{
    "id": "-OpUg0GDrII",
    "title": "Pixel Watch Review: First Gen Fumbles!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-10-15T21:34:48Z",
    "video_url": "https://www.youtube.com/watch?v=-OpUg0GDrII",
    "category": "Science & Technology",
    "tags": [],
    "views": 3356835,
    "likes": 96911,
    "comments_count": 4505,
    "description": "The second gen should be much more interesting. Thank you to Rocket Money for sponsoring today's video! Check out to start managing your personal finances today.  Shop Merch:   Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   Smartwatch provided by Google for review  ~",
    "description_links": [
        "http://rocketmoney.com/MKBHD",
        "https://mkbhd.com/",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "https://discord.gg/mkbhd",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "- [Voiceover] 24/7. (upbeat techno beat music) 24/7. - Let's talk about this Google Pixel Watch. So, the first generation of any new piece of tech is always interesting. This is Google's first Pixel smart watch. We have the Google Pixel phones and the Pixels buds and a Pixel tablet coming later. That could be fun too. But yeah, this is their first crack at a Pixel smart watch. So I know I'm not the only one who was very curious just waiting for this thing to see what it would look like, what features they would include, how well it would work together, what the design would be. And I also know that I'm not the only one who's disappointed in a lot of this stuff. Let's talk about it. So when you first buy a Pixel Watch for $350, you get a small 41 millimeter circular smart watch. It comes in this one size, but there's three colors, black, silver or gold, the black being the best in my opinion, because it is matte black while the other two are very much glossy. And the front glass curves way over into a dome shape made of Gorilla Glass 5. It's like a sleek little pebble. Well, not a Pebble smart watch, but a literal pebble, a very lightweight pebble. And there's only two buttons, the crown that rotates and pushes in, and then a button right above it. The crown, I think, is really good. It sticks out enough. It's usable everywhere. It has haptics when you scroll with it, nice and clicky. The button above it, not so much. It's pretty small, doesn't have much travel. It's still clicky, but because of the domed glass, it's pushed fairly far back, close to your wrist. Luckily, you don't really use it that much. And then connecting the watch bands at the top and bottom happens through this clever little push and slide system. It's clever I say, because it can connect bands in this really seamless looking way without any lugs or bulky connections. And the first party watch bands do a really good job of looking like they just jut out of the side of the watch, which is pretty cool. You might not care about this at all if you never change watch bands, but as somebody who changes watch bands every single day to sleep in a different band, I just get used to this motion a lot. And so I find it good when it's good. And this is also something very important to get right in the first generation, because you don't really wanna have to change it three years in, because that makes everyone's watch bands that they just bought for the past three years incompatible. So they're trying to keep this for a long time. So hardware wise, I think this thing is actually pretty beautiful. I love the simple circle. You can easily dress it down and keep it subtle, or you can just go sports band or fabric band. It seems to fit right into a lot of different places. It's stainless steel. It's water-resistant up to 50 meters. And the back happens to be pretty simple too. It's just the heart rate sensor, blood oxygen sensor, and an ECG. And upfront, this is 1,000 nit OLED display with a mostly black background through most of the software, so it just feels like a black disc floating on your wrist. It's nice. The only thing I wish is that it was bigger or if there was a larger version. So I don't even have that big of a wrist, but this thing, it's pretty small, which some people will like, but I just wish I had a larger screen. This watch is a 41 millimeter watch, but that measurement is just of the actual outside of the casing. When you actually get a look at this thing, the bezels are pretty substantial, and so the screen is down to about 29 millimeters across. Now, I don't actually hate these bezels. I think it's like the notch on a phone. A lot of people who don't actually use it can make a big deal about it, 'cause if you just look at 'em, they look silly, but the mostly black background throughout the UI does a good job of hiding 'em, and you really only see them when you're looking for them, or if you set a photo as a watch face. But I really think a bigger watch would feel even more modern for the computer on the wrist nerds like me, and it would also solve the number one problem of this hardware, which is battery life, because the battery life is trash. It's bad. It's just not good at all. So on stage, Google said... What did they say? Up to 24 hours was their claim, which probably should have been the first red flag, 'cause if you think about it, 24 hours is like 8:00 a.m. one day to 8:00 a.m. the next day. So one day and one night, but that's the maximum. It's up to 24 hours. So the always on display is off by default out of the box. I turned that on, and it's literally measuring your heart rate every single second all day, every day, every single second. That's a lot of heart rate measurements. So just for context, the Apple Watch, for example, is checking periodically through the day and every five seconds while you're sleeping. So now here, I'm getting more like 18 hours tops, which is not quite enough to go all day and then do a full night of sleep tracking. So if you wanna do sleep tracking like me, basically you have to charge it twice a day every day, sometime in the morning when you wake up and then again sometime in the afternoon before you go to sleep, or it's just gonna die. (chuckles) The thing drains about 20 to 25% battery just during one night of sleep tracking. Now, measuring your heart rate every single second to the second is actually sick. Like it's pretty cool. There is a complication, they showed it on stage too, of just the watch telling you every second, updating what your heart rate is. I've never seen anything like it. It's the most accurate heart rate tracking I've ever tried in a wearable. It's great for tracking workouts, heart rate recovery. This is the Fitbit prowess going to work, no doubt, but the other smart watches that are now years in, the Samsung Galaxy Watch 5 and the Apple Watch Series 8, they've all realized by this point that the way you save battery is by pinging all these sensors less often. Like the Battery Saver mode on the new Apple Watch literally is just pinging heart rate and GPS less and turning off things like the always on display and the blood oxygen readings that are going on all the time in the background. That's how you save battery. So the fact that this watch does it all the time can be cool, but also can nuke your battery all the time. When I go to Bedtime mode, and just turn on like the Sleep mode, it doesn't say it's stopping those heart rate measurements. It continues to measure my heart rate constantly. I will say, though, the saving grace that makes it usable is that it does charge up very fast. It does come with this plastic puck charger in the box with a pretty weak magnet that feels like it could easily fall off, also very first gen feeling, but it could go from like 10 to 40% in like 15 minutes, which is amazing, and it can go from zero to 100 in about an hour. But okay, all that being said, the most clumsy thing about the Pixel Watch for sure is the fact that it's also a Fitbit, or let me rephrase that. Fitbit isn't built into the watch so much as it's like bolted onto the side. So where a Wear OS 3.5 here, it's fine. It's pretty familiar. It's still intuitive. You've got your watch face with a swipe down to get to all your customizable quick settings. That's nice. And then you swipe up to get to your notifications. Your list of apps is one click of the crown away, but your recent apps is behind that secondary button that I find I almost never use. Then you can swipe sideways between a predetermined set of tiles that you can organize in the phone app, and these are like these big quick shortcuts to screens that you might use a lot. Ongoing background things will show up at the bottom. So if you have a notification, there's a little dot for your notification dot. If there's music playing, it'll show a little animation for that. And if you're in the middle of something like a workout and a new notification comes in, it'll show the logo down there for that too. So to control any of the normal watch faces and complications, which I really like a lot of 'em, you go through the Watch app. Makes perfect sense, but then for the fitness stuff, that's where Fitbit, which Google acquired in 2019, comes into play. So when you set up the watch, you actually make a Fitbit account and it starts you off with six months free of Fitbit Premium, which is a subscription service. So as a smart watch, I've mostly enjoyed using it. It's been fine. Like it's smooth. It has a good performance but it does feel disjointed sometimes in ways where like you'd expect it to sync more things with the phone, but it doesn't. Like for example, when I put my Pixel phone my Pixel phone, in Do Not Disturb mode, the watch does not go to Do Not Disturb mode. It keeps buzzing. It has its own separate Do Not Disturb mode, basic stuff. It feels like it should work together more than just being a Bluetooth accessory connected to your phone, but then you do a bunch of fitness stuff, a bunch of workouts or whatever, sleep tracking, and then the watch dumps all of that fitness data into the Fitbit app. Now, there is still a Google Fit app, by the way. The watch doesn't really talk to it at all. So, what does that mean for the future of the Google Fit app? I don't know, your phone can still talk to it and dump step counting in there, but then you're using two different apps to track fitness. So, I don't know. (chuckles) And then even throughout the watch UI, all the Fitbit stuff, it's in there, but it also just feels like they just dropped it in there on top. Like instead of ECG, it's Fitbit ECG, and instead of exercise, it's Fitbit Exercise. And then you start using these features, and the free six month trial. Before you realize, a ton of the stuff it's collecting and that you're using like the breathing rate, heart rate variation sleep stage tracking, and sleep scores, all of that goes behind a Fitbit $10 a month subscription paywall when the free trial is over. It feels like you can see the arc of the thinking where Google wanted people to use a Google Watch, so they bought Fitbit. And then as they integrated it they realized, oh, people love the Fitbit name, and they still want a Fitbit, so you can't remove that name or that branding. So people now get the Google Watch that has Fitbit in it, and they use the Fitbit app, but then there's also Google Fit in the background that they hopefully also choose to use sometimes, and they all don't really talk to each other. Now all this stuff, it doesn't make the rest of the parts of the watch worst to use. It all still works. It adds to this first gen feeling here where you can tell that there is a lot that can get better. And this is the funny thing about reviewing products that you're hoping to be good. You end up sounding really harsh like a disappointed parent or something. Basically, I think this whole Pixel Watch thing has a lot of potential, and I really do enjoy parts of it. Having Google Assistant on my wrist everywhere is awesome. Downloading music to stream offline, the turn by turn navigation with Maps, the Voice to Text to respond to notifications, all that is great, but they clearly still have some first gen learnings to do like the the charger, the heart rate monitoring that is constant that doesn't seem to have any adjusting ability, the Fitbit integration, even the connectivity problems. I've had a little bit of connectivity issues with mine here and there, but some of my friends who are also reviewing this watch right now have had a nightmare of a time just keeping it connected to their phone. So I'll let them talk about that in their reviews. So I was hoping this would be some amazing watch straight from the start, which I should know better. Like first gen stuff is never amazing right from the go. But it's starting from zero here. There's not a lot of bands. There's not a lot of accessories for this. It's $350, and for that money, you could get a more mature version of a smart watch that has more features, that has better battery life, that has things that aren't behind a subscription paywall, and that ultimately will probably be a better experience. But for now, it's fine for their first foray into forearm fitness and fashion, but functionally, it's still far from finished. (bell dings) Oh hey, look, a notification from this video sponsor, Rocket Money. You might've heard of them. They're previously known as Truebill. That's when I signed up. I had this service for years. But this is an all-in-one finance platform that helps you keep track of your finances and also helps you manage your money too, but actually my favorite feature of Rocket Money is that it helps you cancel unwanted subscriptions, which can pile up in the background. So, you connect your bank account, it scans through all of your charges, and then it puts all in one place all of your subscriptions, and with a single press of a button will let you cancel the stuff that you might have forgotten about. Even if there was like a free trial you signed up for a while ago, you just cancel it and be done with it. But also, Rocket Money can help you lower your monthly bills for your phone, internet, or cable. You literally take a picture of your bill, and the app will negotiate the bills on your behalf. It's kind of sick. And you can also monitor your credit score right from the app. It's great, it's easy to save money using this thing. So if you wanna check it out, it's free, or you can unlock more features using the premium account. Just go to rocket money.com/mkbhd. It'll be a link right below the Like button if you wanna head over and check it out, and I'll be over there too. But until the next one, (air whooshes) thanks for watching. See you later. Peace. (upbeat music)",
    "transcript_keywords": [
        "Watch",
        "Pixel Watch",
        "Google Pixel Watch",
        "Pixel smart watch",
        "Fitbit",
        "Pixel Watch thing",
        "Pixel",
        "smart watch",
        "heart rate",
        "Google Pixel",
        "watch bands",
        "Google",
        "Google Pixel phones",
        "Google Watch",
        "Apple Watch",
        "rate",
        "heart",
        "Google Fit app",
        "Pixel smart",
        "Google Fit"
    ],
    "transcript_entity_values": [
        "Google Fit",
        "every single day",
        "10 to 40%",
        "up to 24 hours",
        "the Pixel Watch",
        "Pebble",
        "Fitbit Premium",
        "three",
        "a Pixel Watch",
        "Bedtime",
        "ECG",
        "350",
        "Up to 24 hours",
        "one",
        "about 29 millimeters",
        "years",
        "monthly",
        "Fitbit Exercise",
        "one day",
        "50 meters",
        "the day",
        "Pixel Watch",
        "ECG",
        "Watch",
        "about an hour",
        "UI",
        "41 millimeter",
        "Truebill",
        "one night",
        "three years",
        "Apple Watch",
        "first",
        "Google Watch",
        "Pixels",
        "100",
        "zero",
        "Google",
        "Rocket Money",
        "all day",
        "24 hours",
        "every five seconds",
        "Fitbit",
        "second",
        "10",
        "24/7",
        "Maps",
        "six months",
        "the next day",
        "the Samsung Galaxy Watch 5",
        "the Apple Watch",
        "coming later",
        "2019",
        "only two",
        "1,000",
        "two",
        "8:00 a.m.",
        "20 to 25%",
        "like 15 minutes",
        "a ton",
        "the past three years",
        "up to",
        "six month",
        "the Google Watch",
        "every single second"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "DATE",
        "PERCENT",
        "TIME",
        "ORG",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "MONEY",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "DATE",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "TIME",
        "ORG",
        "QUANTITY",
        "PERSON",
        "TIME",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "TIME",
        "PRODUCT",
        "ORDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERCENT",
        "TIME",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "TIME"
    ],
    "vector": [
        -0.1415375918149948,
        -0.04240463674068451,
        0.1243123784661293,
        -0.06182098388671875,
        0.03142889216542244,
        0.00032552314223721623,
        0.08746521919965744,
        -0.005319725722074509,
        -0.027016889303922653,
        -0.03800119087100029,
        -0.0275406576693058,
        0.04315383359789848,
        -0.03046581894159317,
        -0.06211258843541145,
        -0.0374426506459713,
        -0.042563676834106445,
        0.12697598338127136,
        -0.09791485965251923,
        0.009894661605358124,
        0.005680016241967678,
        -0.01032827328890562,
        -0.09496591240167618,
        0.06292552500963211,
        0.05050214007496834,
        -0.007859022356569767,
        0.07139375805854797,
        0.006418667733669281,
        -0.020370516926050186,
        -0.01917950063943863,
        -0.042944494634866714,
        0.030480679124593735,
        0.10330890119075775,
        0.08123775571584702,
        0.009455811232328415,
        -0.054541751742362976,
        -0.0553152859210968,
        0.04377260431647301,
        0.03108333609998226,
        -0.0782390832901001,
        -0.06918013840913773,
        0.026058660820126534,
        -0.0884571373462677,
        0.016720058396458626,
        0.008115537464618683,
        0.029290592297911644,
        -0.009065508842468262,
        0.0595402792096138,
        -0.06674623489379883,
        -0.01441856287419796,
        -0.013041507452726364,
        -0.07349272817373276,
        -0.06467761844396591,
        0.04191233590245247,
        -0.018582182005047798,
        -0.016551751643419266,
        0.04879581183195114,
        0.017258619889616966,
        -0.0010613159975036979,
        0.05612041801214218,
        0.018718469887971878,
        0.024988655000925064,
        -0.05589129030704498,
        -0.029634544625878334,
        -0.01823972538113594,
        0.04795902967453003,
        -0.019168516620993614,
        0.020315565168857574,
        -0.04196879267692566,
        0.011476215906441212,
        -0.03295641392469406,
        -0.044502291828393936,
        0.04544845223426819,
        0.02205282635986805,
        0.011268073692917824,
        -0.025213902816176414,
        0.029731765389442444,
        0.04104610159993172,
        -0.03622589260339737,
        0.008037705905735493,
        -0.017891492694616318,
        -0.01994696445763111,
        -0.057337213307619095,
        -0.0203760527074337,
        0.0230807326734066,
        0.0053777811117470264,
        -0.01553061231970787,
        0.023934826254844666,
        0.021442970260977745,
        -0.031111940741539,
        -0.06458734720945358,
        -0.031493861228227615,
        0.09048840403556824,
        -0.008684869855642319,
        0.030172044411301613,
        0.03438510000705719,
        0.09473784267902374,
        -0.023880816996097565,
        -0.018803799524903297,
        0.038619451224803925,
        -0.029240747913718224,
        0.04530898109078407,
        0.057131532579660416,
        0.020733773708343506,
        0.02547285333275795,
        -0.027586709707975388,
        -0.13007116317749023,
        -0.05552768334746361,
        0.01699833944439888,
        0.058810751885175705,
        0.06602992117404938,
        0.000508389319293201,
        0.060790084302425385,
        -0.029221447184681892,
        0.041139379143714905,
        -0.0396881066262722,
        0.06524806469678879,
        -0.06797421723604202,
        0.10870146751403809,
        0.1611364185810089,
        0.0495169535279274,
        0.04386279359459877,
        0.03142290934920311,
        -0.051129359751939774,
        -0.07970262318849564,
        0.0050930483266711235,
        -0.007152365054935217,
        -0.07269027829170227,
        4.056426395202274e-33,
        -0.005535639822483063,
        0.06649096310138702,
        -0.032429732382297516,
        0.0267944298684597,
        -0.06690866500139236,
        0.01983763836324215,
        -0.009676963090896606,
        0.07425931841135025,
        -0.014523633755743504,
        0.04279332980513573,
        0.003355521010234952,
        -0.01521290186792612,
        -0.08783132582902908,
        0.053426552563905716,
        0.05009493604302406,
        -0.045214876532554626,
        -0.13917365670204163,
        -0.05510092154145241,
        -0.005318128503859043,
        -0.024627432227134705,
        -0.039824098348617554,
        -0.02651907689869404,
        -0.03810085728764534,
        0.019755158573389053,
        0.008469589054584503,
        0.016235491260886192,
        0.007763538509607315,
        0.013414927758276463,
        0.05978427454829216,
        0.02057211473584175,
        -0.07627393305301666,
        -0.021230876445770264,
        0.04085514694452286,
        -0.05681658163666725,
        -0.06756612658500671,
        -0.00880335457623005,
        -0.03240104392170906,
        -0.04006935656070709,
        0.012906127609312534,
        -0.019721202552318573,
        -0.0676913782954216,
        0.03823782503604889,
        -0.02287144772708416,
        -0.09619743376970291,
        -0.022153764963150024,
        0.03279007226228714,
        0.06505712121725082,
        -0.02437429130077362,
        0.03355898708105087,
        0.011284520849585533,
        -0.012892760336399078,
        -0.02963300421833992,
        -0.026028787717223167,
        -0.049386341124773026,
        0.009678259491920471,
        -0.012042522430419922,
        0.029874728992581367,
        -0.06166102737188339,
        0.014572241343557835,
        0.01845085434615612,
        0.020682936534285545,
        0.030665429309010506,
        0.017986057326197624,
        0.017255382612347603,
        -0.0632566511631012,
        0.08380246162414551,
        0.11738550662994385,
        0.06308367848396301,
        -0.06620966643095016,
        0.037467800080776215,
        -0.025012388825416565,
        -0.03320697695016861,
        -0.028188928961753845,
        -0.0994258001446724,
        0.012828190810978413,
        -0.009357862174510956,
        -0.007235994562506676,
        0.003395560197532177,
        0.027562085539102554,
        -0.04503271356225014,
        0.020496506243944168,
        -0.006619635503739119,
        0.04669381305575371,
        0.08483472466468811,
        -0.03718123212456703,
        -0.009650449268519878,
        0.014934586361050606,
        -0.07756569981575012,
        -0.07682047039270401,
        -0.03750600293278694,
        -0.03685767948627472,
        -0.0889568030834198,
        -0.015274426899850368,
        0.026500891894102097,
        -0.038028471171855927,
        -5.679141612556732e-33,
        -0.01400025188922882,
        -0.036825429648160934,
        0.04152877628803253,
        -0.0031194393523037434,
        0.03571101278066635,
        -0.07071254402399063,
        0.04840719327330589,
        0.01715419441461563,
        0.04617279767990112,
        0.06426697224378586,
        0.03766150027513504,
        0.00982375256717205,
        -0.06192091479897499,
        0.027841176837682724,
        -0.043126825243234634,
        -0.047140780836343765,
        0.03529418632388115,
        -0.11787652224302292,
        0.018468350172042847,
        -0.006354246288537979,
        0.0940338522195816,
        0.05430127680301666,
        -0.002660103840753436,
        0.004992729984223843,
        0.015322363004088402,
        0.0223332941532135,
        0.024631697684526443,
        0.03611563518643379,
        -0.005963646341115236,
        -0.03481457009911537,
        -0.005834565032273531,
        -0.06055161729454994,
        0.041841328144073486,
        0.031054457649588585,
        0.1004180759191513,
        0.007375187240540981,
        0.056789830327034,
        -0.05328479781746864,
        0.02730441279709339,
        -0.06408657133579254,
        0.020192982628941536,
        0.04831326752901077,
        0.044650789350271225,
        -0.01168743334710598,
        0.032547224313020706,
        0.006336222402751446,
        -0.010850767605006695,
        0.11475156247615814,
        -0.06431730836629868,
        0.06524448096752167,
        0.0124924685806036,
        0.0771137923002243,
        -0.032760925590991974,
        -0.09260450303554535,
        -0.12255201488733292,
        -0.02191627025604248,
        0.009088471531867981,
        0.039908260107040405,
        0.02922219969332218,
        -0.023796550929546356,
        0.02018856070935726,
        -0.02489086426794529,
        -0.03858615458011627,
        -0.029812341555953026,
        -0.09847528487443924,
        0.04020289331674576,
        0.04116136208176613,
        0.01320557203143835,
        0.02977265790104866,
        0.06264416128396988,
        -0.023164967074990273,
        0.007438361644744873,
        -0.031020352616906166,
        -0.09975612163543701,
        -0.03581120818853378,
        0.0578879676759243,
        -0.0030985528137534857,
        -0.03835734352469444,
        -0.014685122296214104,
        -0.045300621539354324,
        0.013647045008838177,
        0.05056266486644745,
        0.10893916338682175,
        -0.04423617944121361,
        0.0786532536149025,
        0.052190348505973816,
        -0.024355338886380196,
        -0.006970913615077734,
        -0.04025432467460632,
        0.045211926102638245,
        -0.05174163356423378,
        0.032682452350854874,
        -0.09010277688503265,
        0.1062236949801445,
        0.019915100187063217,
        -5.274849712577634e-08,
        0.0569785013794899,
        0.02254575304687023,
        0.010525115765631199,
        -0.04516400024294853,
        0.039917536079883575,
        -0.11479218304157257,
        -0.03786899521946907,
        -0.031075939536094666,
        0.09053494036197662,
        -0.011300334706902504,
        -0.011328068561851978,
        -0.08026526123285294,
        -0.058152854442596436,
        0.08339899778366089,
        0.030562305822968483,
        -0.00013268996553961188,
        -0.0369899608194828,
        -0.0064255655743181705,
        -0.05693652853369713,
        0.006801484618335962,
        0.025242602452635765,
        0.0339963361620903,
        0.021895183250308037,
        -0.049782056361436844,
        0.013044103980064392,
        0.038850318640470505,
        -0.012668558396399021,
        -0.04978590086102486,
        0.07170148193836212,
        0.005653715692460537,
        -0.003545526647940278,
        0.008178886957466602,
        0.0036741283256560564,
        0.024771658703684807,
        -0.007655174937099218,
        -0.11507293581962585,
        -0.0673547238111496,
        -0.05614017695188522,
        0.10864302515983582,
        0.04854758456349373,
        0.04946289211511612,
        -0.08738421648740768,
        -0.021218258887529373,
        0.055681802332401276,
        -0.04385454207658768,
        -0.11022884398698807,
        0.022759366780519485,
        -0.11077725887298584,
        0.007387212943285704,
        0.10697732120752335,
        -0.03740931674838066,
        -0.0393400713801384,
        -0.004617020953446627,
        -0.025481360033154488,
        0.08934100717306137,
        0.030561374500393867,
        0.03392951190471649,
        0.048639312386512756,
        -0.04321324825286865,
        0.047442566603422165,
        0.06318867951631546,
        -0.05611250922083855,
        -0.030256815254688263,
        0.1191876009106636
    ]
}