{
    "id": "-pg7p_YDs04",
    "title": "Why Does Sony Still Make Phones?",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2021-02-18T19:05:47Z",
    "video_url": "https://www.youtube.com/watch?v=-pg7p_YDs04",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "sony",
        "sony Ericsson",
        "Sony viao",
        "Sony xperia",
        "xperia ii",
        "xperia 1",
        "xperia 5",
        "android",
        "iphone",
        "ios",
        "samsung",
        "oneplus"
    ],
    "views": 97732,
    "likes": 3802,
    "comments_count": 963,
    "description": "Huge shoutout to Storyblocks for sponsoring this video!   The USB Lie Detector:  I built a Laptop:  Why the PS5 is LOSING Money:  Fast Food Tier List:  I sold my body on Amazon.com:    Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "http://storyblocks.com/ThisIs",
        "https://youtu.be/apt0ciQyyuY",
        "https://youtu.be/zjv0RHRfqvE",
        "https://youtu.be/zjv0RHRfqvE",
        "https://youtu.be/uOtEOcBAxys",
        "https://youtu.be/ayPHtwncuGU",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, welcome to \"This Is\". Ken, why does Sony continue to make the most cutting edge smartphones in the industry? - They do? - No, they don't. But we'll tell you all about why they still continue to make smartphones after this word from our sponsors, Storyblocks. Since day one we have taken advantage of Storyblocks to help create \"This Is\". For one low monthly fee you get unlimited downloads of royalty free stock footage like this, and like this, this one's a personal favorite of mine and it really does allow us to create the show. So a little be sure to go check out storyblocks at the link in the description. And again, huge share the storyblocks Chanel and making this as possible, but also for sponsoring this episode. So I have switched over as my daily device to the Sony Xperia five Mark two which is actually written out as Xperia five II for some reason. - It Definitely reads like a final fantasy, (Laughing) title, but... no. Okay, so I know you've spent a lot of time using this phone, - Yes - Especially over the past week. - Yap - The first time I held onto this, I got to say, I do like the physical feel. - So, Sony Is a very interesting company that they've been making smartphones for quite a while, but for the more recent devices , specifically the Xperia five and Xperia one, they are aiming for something a little different. So the first thing to really notice with this phone, it is incredibly tall. This is a 21 by 9 aspect ratio display, which means that in the hand it's comfy, right? Like it's not very wide. It's narrow with an even something like a pixel five. And with a 6.1 inch display it means that it's a little tall in your pocket, but it issue before we started shooting, (Ken laughing) you brought it up. It's almost the same sort of like footprint as something like a Z fold, obviously without the folding and the width, but it's very narrow, which means that actually, is a lot easier to use with one hand. - Yeah, I mean, I don't, I mean you probably have your iPhone 12 mini there, but this kind of feels in a very similar width, which makes it very easier to manage. Obviously, even after having your thumb you know, - To the top, - Reach up to the top to do some stuff. But this feels actually surprisingly nice in hand, maybe short of it, just being very slippery. - And when you look up to something like the Xperia one which is the slightly higher and larger version of this, it's rocking like a 4k OLED, right? and then that same kind of cinema quality, 21 by nine sort of aspect ratio. That is one of the things, that is unique about Sony phones right? let's start with positives. because believe me when I say, there are negatives coming up right? So the hardware I will say is generic, right? - Yeah - I mean, it's just, it's glass, It's metal. I mean, there's not really anything going for it. I mean, it does have IP 60 something... - There's some degree of.. water and dust resistance. - Water and dust resistance. - It actually has some legitimately nice hardware features around, including a headphone jack. Yes, You heard me right, sound the alarm bells a headphone Jack, Now you're not going find it there definitely not going to find it there. We have a headphone Jack - In the garbage - Straight in the garbage. We also do have a couple of dedicated buttons. So you have a fingerprint sensor on the side, and still a big fan of this honestly, even though the new S21 has probably the best end display. - Of the screen like it just makes it easy, You're going to have to hit that power button anyway, that's in no good spot. - Yes, - You also have a dedicated shutter button for the camera. Now, most people, when they look at the Xperia they're really looking at it for the camera. So Sony of course make many excellent cameras that we use here in the studio all the time. And one of the things is they brought a lot of that over to their experience smartphones, right? So the default camera app is, or sorry, there actually are multiple cameras. I'll get to that in a second. (Ken laughing) The photo pro camera app, is very much gives you that same kind of feeling, so I can adjust things on the fly. And then when, especially when you look to the menus I mean, it's very similar to something like... - It actually does look like, yeah, we have a Sony, A seven S three is in the office, like, you know, pretty good for video. Like obviously, they're designed for more professional uses, and that actually carries over the same exact menu for the most part, - Yeah which is very nice to see - You have three cameras, you have a ultra wide wide and a three X telephoto - okay - solid solid. And of course, Sony as a company who makes a lot of cameras they manufacture these, they use the Zeiss coating. Look, there's a lot of stuff here. A lot of the ingredients that are very, very nice. However here's the thing, right? - Okay It doesn't come together in a cohesive package, because for every good thing I can say about this phone there's somewhere else where Sony has dropped the ball. Okay, So say cameras, right? - Okay Cameras are decent. And the app is great. And having the physical button, the problem is the photos. Aren't amazing, right? They feel that they're behind on the computational photography. It feels like it takes a great individual still but the pixel, the Samsung's, the iPhones all the really more modern smartphones of the world are taking multiple images at the same time blending the best parts. With this, it doesn't deliver that same level of quality. - The thing about smartphone cameras and smartphone camera apps, that I usually try to keep in mind, is the computational photography is usually way smarter than you. Whether you're, you know an average layman or even a professional. - Yeah And I think professionals should be in this mindset, of no matter what the limitations are with whatever app you're using or whatever, you know the limitations of the tools and how they work. I don't think a pro mode is what you need on a phone. - I mean, look, it's nice to be able to do that. Sometimes if I'm sitting on a tripod or whatever most of the time, you're right. I'm not going to go through and adjust. Oh, my white balance is slightly off here. I mean, if I'm in a studio setting, I will. - Absolutely. - 99% of the photos I take on a phone. I'm not going to do that. And the fact that we get these promotes, which are cool but don't really do that much for you. And when you lose some of the basic features like at night mode, to me it feels like it is meant to be a little bit more blood post processed through that photo app. - Right. But then, there's a bunch of other stuff here that seems great on paper but it kind of falls apart in practice. The actual software. It's easy to forget how much is missing out of stock Android, right? - Right. If you use the pixel or use like a One Plus, you think, Oh, this is stock Android. It's not, there's still a lot of stuff that's built in to add. There's so many things that feel so basic with the way like the notifications look you can go through like so many settings and like, Oh right. This is like built into Android. Oh wait, no, it's not right. They have some things like they have like the screen mode it is a 120 Hertz display. I'll give them that. But then there are so many other things. I've just like I find myself really wishing I had like better control over. - I think this goes a long way into saying that there are reasons why the Samsung's of the world, and even, let's go as far down as maybe even the One pluses of the world. - Sure. There are reasons why people go for those phones, over something like the Sony, because they're trusted you know, they have gone through that R and D - We can talk about a lot of other Sony phones, such as the Sony Xperia pro, which is essentially the Xperia one, it's got the 4k OLED Right? Which is great, but it's meant to be used more. So for like live streaming and whatnot. So Marquez did a video on it. It is $2,500. - It has an HDMI import that you can use, to have it act as a camera monitor. - Yeah - And I will take his exact words or I might be paraphrasing a little bit but that is a phone that is made literally for 20 people. - It's a really limited amount of people which is great - Yeah that Sony's has to make that. Right. Like I always like something that's weird and wacky and whatnot, but the price of that phone is over double the standard exterior one. - Yeah, Like it's, it's weird and wacky, but not in the way that I think will push them forward. - Absolutely - Like - There is a lot of weird and wacky. One of the ones that is on the table right now, the Galaxy Z fold. - Yeah. - This is about as weird and wacky as it can get pushes the bar forward. Right, there's a lot of innovation here. There's a reason why I think Samsung is doing a push on foldables period, because, - Yeah. I mean they have the resources to do it. The thing about this is that I think they're in a position to actually change the industry, - Yah. with what their vision is by this logic. - Sony making phones that are unique. Right? I mean, again, the foreign factor is unique. The fact that you have some of these software features like the camera is unique, but then there are so many things that it lets you down with. Right? So performance is good, right? Snapdragon 865. This is a phone that came out for reference late last year. So, it obviously doesn't have the Snapdragon triple eight and everything but then you look at stuff like the 5g support, which isn't really a thing, right? It's a Snapdragon 865. It has 5g in other markets, but that 5g does not work in the United States. Right? So this is a 4g phone. It also doesn't have wireless charging. It has for - It being a glass back, - It has a glass bag. I mean, to be fair it has like 20 watt, a wired charging, which is fine. But it's been a while since I've used a quote unquote flagship that does not have wireless charging - I will always go toward the phone that either works best for my use case like the iPhone or in the case of my secondary phone, the Galaxy Z fold two you're going to go back to the Z flip. Alright? - Absolutely. - Like I think especially on the Android side we're starting to see things kind of shift a little bit - Yah. toward, you know, more interesting form factors because every phone looks different, right? - Yeah - There's ones that stand out for us. We want to use - I'm Happy Sony are making phones that are in different form factors like this. Right, I actually do really think that there's something to a tall, skinny device. It's easier to use with one hand. You do still get the screen real estate. Cause I really think about when I'm using my phone, I care about like, Oh, can I see two photos on Instagram at the same time? Or how much more text can I read? Like i'd rather have that than something that's wide. And the fact that it's got like stereo speakers and headphone Jack, and you know, a very nice display. - There's a lot of things that I'm sure Sony imagines people would like a lot, - Absolutely. - Especially - With them making a lot of entertainment focused products. I'm sure there's a lot of quality of life things. I'm sure this headphone Jack is phenomenal. - Yeah, The phone is good but the thing is good is not good enough anymore when there's excellent phones everywhere. - Yeah. - And there's so many things like the software' why is the software so basic and simple? Why is it have none of these features or like these very basic versions of features that have been really well sort of fleshed out. Like I'm not trying to say that Sony has become Samsung and build 18 different stock versions of the app. I'm not saying that, but like there's just so many things that seem so simple. It just doesn't feel like they're going the extra mile on like the camera app. And some of these other things that push it over the edge is the fact that it doesn't have like wireless charging and 5g at $950. I just.. it's hard. This is hard. - This is also something that like, I mean I haven't said this in a video before but this is something that I also give LG flag at least up until recently, like LG for the longest time through the V series through the G series they've made the same phones over and over again. And a lot of the times the designs would be outdated. It didn't seem like they put a lot of thought on R and D into figuring out what customers wanted. They went and did stuff that they thought people would like - Sure. - But that was their own idea of it. I don't think they actually fully understood that, with at least on the LG side where they're starting to do some really wacky stuff, dual screen cases, - Yap. they have the... you know, the LG wing. They're at least trying, to figure out some new avenues to push their bar forward Sony is... - They're making telephones. They're making telephones They're making, you know, really expensive camera monitors that also happen to be phones with 5g that you can live stream with. - Cool. For why going back to another point and this is more to tie the things that other companies are doing as far as innovation goes. - Yeah. Sony used to innovate so much. - Yes. Right, Whether or not there was actually practical is another story, but they would do wacky, wacky stuff. You had mentioned at previous points. We did a video on Sony VAIOs, and how crazy some of those designs could be. - Yap - If we look at the Sony Ericsson devices, like before smartphones even came out, there were - excellent some crazy designs that might've even been way more forward-thinking for their own good. - Yeah. - The, the Sony of today does not push the bar as much in a lot of the industries that I feel like, It might matter a little more to some people - The problem is this right Sony make good phones, but they're not great. It feels like they either need to make a decision. Are Sony going to go the Samsung route? Because obviously they make some of the components inside like such as the cameras, right. Of actually making this a real serious part of their business. Are they going to double and triple their investment, in making these phones more feature complete, where they're not dropping out wireless charging in 5g and a $1000 And are they actually going to be delivering some of these new and more innovative form factors to stay ahead of everyone or to try to catch up really? Or are they going to just start making phones? Because I know that there's clearly selling some of these but to me, the price and the feature set of this phone, doesn't make sense. I can't justify this for pretty much anyone. How much was this $950 here unlocked in the United States which is significantly more expensive than something like the S21 that it was coming from which I liked better in literally every single possible way except that it's slightly wider. - I'm sure you can buy this subsidize for a bit cheaper but I would imagine it wouldn't be that far off from something like another flagship like an iPhone - NO or a Samsung Galaxy, like... - It's expensive. To me, it feels like the Xperia line exists because they still sell some of them in markets such as Japan. Right. - Yeah And it's probably still enough that they're if not breaking even, and just losing a little bit of money and like, okay, cool. At least we have a foothold in - Yap I feel like - The PlayStation app. Pre-installed - I mean, I feel like this is the kind of thing of like Docomo or SoftBank. You know, they make a version of this phone that is actually branded with, you know, the carrier. Right. And they can sell these for a decent profit to whoever wants it over there because that's Sony's home market and they know how to market it there. - So I don't Switch my daily driver that often, right. I mean, for the last year it's been primarily Z flip. I spent some time in the Pixel five. I spent some time recently in the S 21. And now I've spent some time in the Xperia 5 II. Right. I tried a lot of phones, but actually like posting up and like living in with them for extended periods of time as a daily driver, not something I do that often. This has been the first phone I've used as a daily driver and quite a while, that I've been actively ready to like depth. Like, there's just been enough little things about this phone. I like the S21. I'm like, Oh my God, I miss the S21. I miss the Z flip, like the Pixel five all of these devices, that thing we're a far better overall package, then than the Xperia My point is this, I want Sony to succeed. I want to try and spend time with more of these weird, unique devices that they make. There are a lot of good ideas here but they need to nail that execution. We can't get half-baked devices and charge flagship prices for them. - Yeah. - There's simply way too many phones out there that are way too good. - Even at mid range. - I would take a pixel five that is $300 less than this. Any day over the pay of the Xperia. - Exactly. It's just, there's a lot of missed opportunities. There's like mixed execution. Like I want to like this thing a lot. There's a decent amount going for it but it's so hard to recommend when there's so much out there in this competitive landspace. - I'm going to be very curious to know. What do you think about the state of Sony phones in 2021? Let us know in the comments below, make sure to ringling the dingling bell for more rants, about Sony and PlayStations and xbox's and other phones and various pieces of technology until next time. Thank you very much for watching. Sony please don't be upset with us.",
    "transcript_keywords": [
        "Sony",
        "phone",
        "lot",
        "Sony phones",
        "phones",
        "Xperia",
        "Yeah",
        "Sony Xperia",
        "things",
        "Sony making phones",
        "thing",
        "time",
        "camera",
        "Sony Xperia pro",
        "make",
        "cameras",
        "making",
        "good",
        "making phones",
        "Sony make good"
    ],
    "transcript_entity_values": [
        "Xperia five II",
        "18",
        "Android",
        "one",
        "4k",
        "S21",
        "Storyblocks",
        "the last year",
        "Zeiss",
        "iPhones",
        "Marquez",
        "Jack",
        "three",
        "99%",
        "the past week",
        "LG",
        "Storyblocks",
        "20 watt",
        "today",
        "Xperia",
        "nine",
        "the Xperia 5 II",
        "S21",
        "the S 21",
        "eight",
        "60",
        "120",
        "5",
        "the Galaxy Z fold",
        "Samsung Galaxy",
        "300",
        "950",
        "the Galaxy Z",
        "20",
        "daily",
        "Xperia",
        "monthly",
        "day one",
        "Hertz",
        "xbox",
        "Samsung",
        "half",
        "the United States",
        "1000",
        "two",
        "jack",
        "late last year",
        "12",
        "2021",
        "One",
        "Snapdragon 865",
        "4",
        "9",
        "Japan",
        "21",
        "Sony",
        "second",
        "Chanel",
        "five",
        "first",
        "Ken",
        "iPhone",
        "Docomo",
        "Instagram",
        "Xperia",
        "PlayStation",
        "6.1 inch",
        "seven",
        "2,500",
        "Snapdragon",
        "PlayStations",
        "SoftBank"
    ],
    "transcript_entity_types": [
        "FAC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "NORP",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "ORG",
        "NORP",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "EVENT",
        "PRODUCT",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "FAC",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.05750475078821182,
        -0.04366151988506317,
        0.10547374188899994,
        -0.06568524241447449,
        0.09980722516775131,
        -0.012827064841985703,
        0.024306392297148705,
        0.029567943885922432,
        0.07296955585479736,
        0.045070283114910126,
        -0.004953641910105944,
        0.07008896768093109,
        0.02027210406959057,
        -0.009145577438175678,
        0.059242162853479385,
        -0.06439469009637833,
        0.028591983020305634,
        -0.10033131390810013,
        -0.07323946803808212,
        -0.008956195786595345,
        0.04287530109286308,
        -0.07045238465070724,
        0.03539547324180603,
        -0.0008664634660817683,
        0.06306526064872742,
        0.019517363980412483,
        -0.10157940536737442,
        -0.04905891790986061,
        0.04075276106595993,
        -0.020304037258028984,
        -0.01828395389020443,
        0.08279843628406525,
        0.05000779777765274,
        0.012470390647649765,
        -0.04541197046637535,
        -0.0978667289018631,
        -0.007262419909238815,
        0.02405274286866188,
        -0.08246432989835739,
        -0.004841313697397709,
        0.008592558093369007,
        -0.031821999698877335,
        -0.0228235125541687,
        0.03510003536939621,
        0.020819945260882378,
        -0.056313056498765945,
        0.033819135278463364,
        -0.009238860569894314,
        -0.01400135736912489,
        -0.0004985342384316027,
        -0.01430656760931015,
        0.02164348214864731,
        0.05184238404035568,
        -0.06411193311214447,
        -0.10151030123233795,
        -0.038149215281009674,
        0.009106174111366272,
        0.07083141803741455,
        0.11359930783510208,
        0.041356004774570465,
        0.06834737956523895,
        -0.02320326305925846,
        -0.04605850949883461,
        0.04955432564020157,
        -0.026054183021187782,
        -0.022939279675483704,
        0.028496457263827324,
        0.07781031727790833,
        0.03372711315751076,
        -0.0033828529994934797,
        -0.03951658681035042,
        0.013361794874072075,
        0.05905533954501152,
        0.04936498776078224,
        -0.024555757641792297,
        0.03171192482113838,
        0.06559893488883972,
        -0.0287431962788105,
        -0.03160521015524864,
        -0.003825477557256818,
        0.01904880814254284,
        -0.08024163544178009,
        -0.07697063684463501,
        -0.03337724506855011,
        0.036873891949653625,
        0.01840120367705822,
        -0.012735605239868164,
        0.03451405465602875,
        -0.061418112367391586,
        -0.06016217917203903,
        -0.06835999339818954,
        0.048380933701992035,
        0.009102742187678814,
        -0.011007864028215408,
        -0.1044720783829689,
        -0.02082616463303566,
        -0.11356858164072037,
        -0.0744275450706482,
        -0.05236116051673889,
        0.02689475193619728,
        -0.029215164482593536,
        0.016661789268255234,
        0.01632274128496647,
        0.026648087427020073,
        -0.013950926251709461,
        -0.08732911199331284,
        -0.05415740981698036,
        0.047029927372932434,
        0.038066696375608444,
        0.08135819435119629,
        -0.05484307184815407,
        0.03389805927872658,
        -0.026857547461986542,
        -0.03320163115859032,
        0.032770704478025436,
        0.036495141685009,
        -0.04728366807103157,
        0.04275846108794212,
        0.11905678361654282,
        -0.004727688152343035,
        0.033810097724199295,
        0.021873896941542625,
        -0.09234654158353806,
        -0.057961102575063705,
        0.047353677451610565,
        -0.016740502789616585,
        0.01541833858937025,
        1.0642281167161962e-33,
        0.02656681090593338,
        0.08860015124082565,
        0.03053162433207035,
        0.008430694229900837,
        -0.031737565994262695,
        0.0190556850284338,
        0.017794113606214523,
        0.05539136379957199,
        -0.020143138244748116,
        0.009971167892217636,
        0.014547983184456825,
        -0.03271098434925079,
        -0.024503884837031364,
        0.05993613973259926,
        0.03717638924717903,
        -0.05897203087806702,
        -0.045796800404787064,
        -0.08551152050495148,
        0.0368967242538929,
        0.00979483313858509,
        -0.012666786089539528,
        -0.04580358415842056,
        0.022771790623664856,
        0.034040533006191254,
        0.04491712152957916,
        0.019237179309129715,
        0.03845888376235962,
        -0.02372552827000618,
        0.0802551656961441,
        0.014413624070584774,
        -0.08970718830823898,
        -0.025857746601104736,
        0.04801150783896446,
        -0.052300188690423965,
        0.019272515550255775,
        0.01569438725709915,
        -0.039751749485731125,
        -0.10281215608119965,
        0.09133857488632202,
        -0.011453025043010712,
        -0.03909590095281601,
        0.019658459350466728,
        -0.11957286298274994,
        -0.014873092994093895,
        0.015588298439979553,
        0.03071056492626667,
        -0.00873610656708479,
        -0.009657206013798714,
        -0.08213814347982407,
        -0.03207596018910408,
        0.012286712415516376,
        0.03423497825860977,
        -0.0033860616385936737,
        -0.0036855423822999,
        0.0296026561409235,
        -0.029948130249977112,
        -0.019110912457108498,
        -0.06507355719804764,
        0.08497171849012375,
        -0.004173440858721733,
        0.11147204786539078,
        -0.010546528734266758,
        -0.05693602189421654,
        0.08335570991039276,
        -0.10060402005910873,
        0.0611676350235939,
        0.136155903339386,
        0.013311196118593216,
        -0.05340801179409027,
        0.051757439970970154,
        0.007294230628758669,
        -0.02035467140376568,
        -0.018887249752879143,
        -0.017173245549201965,
        -0.0028759269043803215,
        0.04353420063853264,
        -0.06890323758125305,
        0.002269629156216979,
        -0.04777826368808746,
        0.08125147968530655,
        -0.015999631956219673,
        -0.020545367151498795,
        0.016725851222872734,
        -0.01995914988219738,
        0.024821285158395767,
        -2.802165454340866e-06,
        0.03329244628548622,
        -0.07491649687290192,
        -0.049081262201070786,
        0.022541113197803497,
        -0.06705649197101593,
        -0.018579646944999695,
        0.0008364824461750686,
        0.08876776695251465,
        0.02497517690062523,
        -2.74355550934824e-33,
        -0.04997562989592552,
        -0.04887961968779564,
        -0.014708390459418297,
        -0.11260294169187546,
        -0.027280475944280624,
        -0.10356748849153519,
        -0.017841732129454613,
        -0.011843590997159481,
        -0.03997986391186714,
        -0.04134489223361015,
        -0.04025346413254738,
        -0.010010811500251293,
        -0.06355840712785721,
        0.00017860811203718185,
        -0.022895831614732742,
        -0.08011925965547562,
        0.052138183265924454,
        -0.08519753813743591,
        0.02175530046224594,
        -0.030274664983153343,
        0.05033722147345543,
        0.05233828350901604,
        0.0005443506524898112,
        0.11692722141742706,
        -0.0024921114090830088,
        -0.039319492876529694,
        -0.036025505512952805,
        0.059559717774391174,
        0.04236675798892975,
        -0.0639800876379013,
        -0.02252710796892643,
        -0.07461374998092651,
        -0.021267294883728027,
        -0.013260489329695702,
        0.04463844746351242,
        0.0575186125934124,
        -0.015745747834444046,
        0.04146777093410492,
        0.01999194733798504,
        -0.04109116643667221,
        0.100409135222435,
        0.004427850246429443,
        -0.00676480308175087,
        -0.01808037981390953,
        0.029600374400615692,
        -0.05202162638306618,
        -0.015955358743667603,
        0.02529367059469223,
        0.029685892164707184,
        -0.03616045042872429,
        0.10019896179437637,
        0.041993241757154465,
        -0.017080796882510185,
        0.011395758017897606,
        -0.06372945755720139,
        -0.028019854798913002,
        -0.055420830845832825,
        -0.032871924340724945,
        0.03619372844696045,
        -0.06922096014022827,
        0.0742071196436882,
        -0.01848612353205681,
        -0.04666806384921074,
        -0.03904303163290024,
        -0.010316879488527775,
        0.03256025165319443,
        0.14467568695545197,
        0.03325622156262398,
        -0.03579619899392128,
        -0.023929238319396973,
        -0.013321192935109138,
        0.004964633844792843,
        -0.014047467149794102,
        0.031723503023386,
        -0.06136826425790787,
        0.12097932398319244,
        -0.09428262710571289,
        -0.03983324021100998,
        -0.030643200501799583,
        -0.03498612344264984,
        -0.011350685730576515,
        0.050327301025390625,
        0.07353279739618301,
        0.005625510588288307,
        0.09526562690734863,
        0.03748604655265808,
        0.002257933607324958,
        0.015050547197461128,
        -0.06645368784666061,
        0.03353121131658554,
        -0.07447300851345062,
        -0.055135972797870636,
        -0.05605228245258331,
        0.11369751393795013,
        -0.012297118082642555,
        -5.1763112907110553e-08,
        0.08954483270645142,
        -0.039435356855392456,
        0.02463361620903015,
        -0.05002187564969063,
        -0.023475229740142822,
        -0.061208486557006836,
        0.016693824902176857,
        -0.006944623310118914,
        0.17476452887058258,
        -0.004787672311067581,
        0.03111993335187435,
        -0.04476064071059227,
        -0.08610816299915314,
        0.13251979649066925,
        0.0647931769490242,
        0.0896918848156929,
        -0.0006364908767864108,
        0.04266827553510666,
        0.01084709633141756,
        0.01281326450407505,
        0.029303403571248055,
        0.009286884218454361,
        0.008447605185210705,
        -0.056111957877874374,
        0.03593522310256958,
        0.03291412815451622,
        -0.04137096181511879,
        -0.03359154239296913,
        0.07488667219877243,
        0.00760692311450839,
        -0.011224065907299519,
        -0.04754679277539253,
        0.016896631568670273,
        -0.020656846463680267,
        0.019864048808813095,
        -0.03615932911634445,
        -0.023710019886493683,
        -0.061871908605098724,
        0.01828533224761486,
        -0.03768385574221611,
        0.03694361448287964,
        -0.049618568271398544,
        0.04832876846194267,
        0.027237674221396446,
        -0.002989819273352623,
        -0.03678961843252182,
        -0.0823645293712616,
        -0.05014999955892563,
        0.012695983052253723,
        -0.0036886415909975767,
        -0.029163850471377373,
        -0.044002681970596313,
        0.035709258168935776,
        -0.031714413315057755,
        0.03818215802311897,
        -0.06638144701719284,
        0.07206316292285919,
        -0.0060666571371257305,
        -0.011677357368171215,
        -0.007128498051315546,
        0.03695043548941612,
        -0.058367472141981125,
        0.05652235075831413,
        0.10246537625789642
    ]
}