{
    "id": "-rBV4I_LWhg",
    "title": "Less spreadsheets, more GAMING!!! - Logitech G915 TKL Lightspeed Keyboard",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-06-06T15:43:40Z",
    "video_url": "https://www.youtube.com/watch?v=-rBV4I_LWhg",
    "category": "Science & Technology",
    "tags": [
        "Keyboard",
        "Gaming",
        "PC",
        "Computers",
        "Late Night",
        "Evening",
        "Ten Key Less",
        "TKL",
        "Logitech",
        "Corsair",
        "RGB",
        "Wireless",
        "Lightspeed",
        "Battery",
        "Charging",
        "Cherry",
        "GL Switch",
        "Unboxing",
        "Powerplay",
        "Logitech G"
    ],
    "views": 1631341,
    "likes": 40194,
    "comments_count": 3131,
    "description": "Sign up for Private Internet Access VPN at   I found myself playing games more often than working late and I think it's time to make the switch to a TKL keyboard! Does Logitech G915 with their new GL Switches make the grade?  Buy the Logitech G915 TKL Mechanical Gaming Keyboard at   Buy the Corsair K70 RGB Mechanical Gaming Keyboard at   Build your own keyboard with MechanicalKeyboard at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/piashortcircuit",
        "https://geni.us/KOJlJUs",
        "https://geni.us/QKidgG",
        "https://geni.us/RecNBTI",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- I'm still rocking an original Corsair K70 RGB with Cherry MX Brown switches from a number of years ago. To be clear, I love that thing. It performs exactly like the day I got it. But lately I've been considering a new keyboard for a little while because I've been finding myself doing more gaming and less spreadsheets. So I don't really need the number pad that badly anymore. And this one caught my eye for a few reasons. It's 10 keyless, which means more room for mousing, a huge consideration for me, since the only games I really play are Beat Saber, which is downstairs on my VR setup, and Anno 1800, which is basically mouse movement simulator. What do they make this tape out? I need a knife. (laughs) Can I have a knife, please? This video is brought to you by Private Internet Access. PIA is the VPN service that lets you access services and websites as though you are in another country. It encrypts all your traffic and routes it through a safe, protected IP and allows you to connect up to five devices on a single account with clients for Windows, Mac OS, Android, iOS, and Linux. Try it out risk-free at the link in the video description. Now back to this thing that I was already in the middle of. Thank you, sir. That's better. Reason number two is Lightspeed wireless. This is a wireless keyboard. And Logitech's Lightspeed technology means you get negligible latency while cleaning up some of the wires that I keep getting attacked about online. Do you know how much flack they give me about the wire mess at my desk? It's not fair! For the low, low price of just 220 or 230 US dollars or whatever I can take care of that. Reason number three, look how low profile this thing is. Like, that is a slim keyboard. It actually got a bunch of messaging bragging about the engineering of making a keyboard this thin on their website. I guess the engineers over at Logitech have never seen a laptop. (laughs) In all seriousness though, okay, what is special about this is that it uses mechanical switches. These are using what they call their low profile GL switches and they're apparently high performance mech switches for gamers with half of the physical height of typical mechanical switches. And while I wasn't a huge fan of Logitech's Romer-G initiative, I didn't mind them. And they have done so much great peripheral engineering over the last, really, the last five years that I want to give this a chance. I want to give these a try. Oh boy, that's disappointing. Uses a Micro B cable for charging. Yeah, that's a bummer. So, they boast long battery life on this puppy, 40 hours with the RGB enabled, but like, oh man, micro USB's time has officially ended, as far I'm concerned, on anything that costs more than like 20 bucks. I understand that the Type-C connector is more complicated to implement and it is more expensive, but micro B is just, it's too fragile. Look at it. Ew, see? Ew. Oh, yeah, last thing, RGB. (keyboard banging) Alright, let's go ahead and plug in the. If not, we'll try and plug in the other side, dongle. There we go, yeah! Cool thing about Lightspeed is I'm already using a G Pro wireless. I actually just switched over to that recently. So you can use a single Lightspeed dongle to handle both of your peripherals in that case. And because I picked up a power play, that means I don't have to have basically any dongles or cables for my peripherals, other than, of course, a cable for charging. (keys clacking) Oh, interesting. That is not working. Oh, there's your problem. (howling) All right. That is some pretty vibrant RGB, considering this thing is a wireless keyboard. Does it stay as vibrant? Yes! All right, that's pretty cool. Well, let's take a quick look-it-e-boo at this thing. So we've got, oh, Lightspeed wireless versus Bluetooth wireless. Cool, this could actually be handy for me because when I'm streaming I don't have a secondary monitor. I just have one big ultra wide on my desk. I don't really have anywhere to put another monitor. So I actually prop up my phone under my monitor. I have a little stand for it, and I use that to monitor Twitch chat when I'm watching Twitch chat. So realistically, if I was replying to your Twitch chat, I would probably just say so. Okay, whatever. The point is, we're going back to Lightspeed wireless. We've also got a gaming button, which as far as I know, just disables the start menu, although with Logitech software, I'm sure you can configure it to do other things if you really want to. I never really cared about that anyway. We've got brightness adjustment here. And then media keys. Nice, got the volume wheel. Big fan of the volume wheel, guys. Button's just not a replacement for a volume wheel. And then, of course, a 10 keyless layout. Now, I wasn't really sure about the low profile experience, 'cause the thing is what's funny is, if you look at it from the side, it's low profile, but at the bottom edge of it you still have, if you want to rest your wrist on the table, you still have kind of that angle to your wrist. But what's cool is, even though this is a low profile design, they've gone and they've included these feet anyway, so you can pop it out. And I would probably go with just the first level of pop-out here. Pop this puppy out. (feet clacking) And that actually looks a little better. One other thing I noticed on the bottom here too, check this out. Little spot for the dongle. This gets overlooked so often by lesser products, just like, \"Hey, yeah, I've got this wireless dongle. \"By the way, you're gonna lose it \"because we didn't make a place to store it.\" Interesting. I'm actually super happy right now. For whatever reason, the vast majority of gamer marketing key switches out there are linear switches, which I personally find spongy and actually uncomfortable. I do not like typing on them. I make a ton of mistakes. Did this thing just go to sleep? (keys clacking) It's awake, but I'm not getting any input. Having a little derp moment there! Yeah, it wouldn't wake back up until I turned it off and turned it back on. That's not a great first impression. Let's start with a typing test 'cause I'm ready to jump right into it. I'm feeling good about this. (rhythmic music) (keys clacking) 85 words per minute with five errors on a keyboard that I am touching for the first time. (whoops) That is not bad! These have a nice, subtle, tactile bump in them, kind of like a Brown switch. It's a little heavy. It's not light. You've definitely got that strong mechanical feel. (laughs) I actually really like this thing for typing. Thing is, even though I have been doing a lot more gaming lately, I also type a lot at my computer. So it's a consideration for me no matter what. Let's go ahead and fire up a game, though, shall we? Currently the only thing we loaded on this thing is CS: GO, 'cause you guys just love watching me fail at CS: GO, don'tcha? I'm surprised more people don't practice CS: GO with bots. Seeing all the fake accounts on social media? You know, it must feel good to really get back at them, right? The bots? (laughs) I completely forgot that I was testing a keyboard and just immediately got into playing the game, which I consider to be an extremely good sign. You can't really see the crosshair from here. This is not optimal. Oh, oh, Lordy. I'm gonna die going to the the bumps I Oh, no, there they are (wails) They're harmless bots. Oh, I got killed. This is actually quite comfortable. I'd say there's less of a distinct tactile bump compared to a Cherry MX Brown, but the travel feels comparable to a higher profile, full mechanical keyboard experience. Okay, I am really impressed by how thin it is. This is not your typical laptop keyboard. It's kind of heavy too, considering its size. Not a lot of flex. I like this thing. Oh, terrorists won. That's why I can't take over the... Wow, did my team lose? Holy ba-nay-nays. That's fine, 'cause I'm getting it op this time. I'm oppin', boys! Just got to run faster with my knife and get out there. Oh, no! Oh, no! Oh, no! Oh, no! Oh, no! Oh, no! Oh, no! Oh, I missed! How did I die? I really like this thing. I'm gonna give it a shot as a daily driver. Maybe you guys will see a full review over on the Linus tech tips channel sometime in the future. One thing I would kind of want to look in to is if there's any way that I could mod it to just run while continuously charging without a cable, like a power play charger. Do that inside of it or something like that. That'd be sick. That's the next level for Logitech is they need a power play desk pad that'll charge both your keyboard and your mouse while you're gaming, so you just don't have to have any cables on your desk. There you go, Logitech. I'm the idea man here, free of charge. All you gotta do is engineer it. So guys, you can check out the link to where to buy one of these. This is the G915 TKL Lightspeed wireless tactile. So that explains why. Oh, that's why they sent two! Nope, this is also GL tactile. They must just know me pretty well. We're gonna have that linked in the video description. (claps) And, I don't know, subscribe? We don't really have a standard outro over here. (bell ringing)",
    "transcript_keywords": [
        "original Corsair",
        "thing",
        "Lightspeed wireless",
        "Lightspeed",
        "keyboard",
        "wireless",
        "Logitech",
        "low profile",
        "rocking an original",
        "low",
        "switches",
        "Corsair",
        "profile",
        "RGB",
        "Logitech Lightspeed",
        "Yeah",
        "TKL Lightspeed wireless",
        "wireless keyboard",
        "Lightspeed wireless tactile",
        "Logitech Lightspeed technology"
    ],
    "transcript_entity_values": [
        "Corsair K70 RGB",
        "half",
        "Brown",
        "GL",
        "GL",
        "three",
        "Private Internet Access",
        "One",
        "Lightspeed",
        "one",
        "Lightspeed",
        "USB",
        "40 hours",
        "the last five years",
        "Twitch",
        "G Pro",
        "Logitech",
        "IP",
        "Cherry MX Brown",
        "PIA",
        "number two",
        "Anno 1800",
        "Beat Saber",
        "85",
        "daily",
        "Windows, Mac OS",
        "Linux",
        "10",
        "first",
        "Cherry MX Brown",
        "a number of years ago",
        "220",
        "two",
        "up to five",
        "Romer-G",
        "Android",
        "TKL Lightspeed",
        "RGB",
        "Linus",
        "G915",
        "five",
        "more than like 20 bucks",
        "230 US dollars",
        "CS"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "TIME",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG"
    ],
    "vector": [
        -0.0753760114312172,
        -0.05894933268427849,
        0.04567922279238701,
        -0.10348174721002579,
        0.03706612065434456,
        0.04563893750309944,
        0.03270654380321503,
        0.04585517197847366,
        0.02539035677909851,
        0.0618693009018898,
        0.03796045109629631,
        0.029564283788204193,
        -0.00967636238783598,
        -0.011644236743450165,
        0.06953219324350357,
        -0.022661006078124046,
        0.05106346309185028,
        -0.028380416333675385,
        -0.03987715765833855,
        -0.032977666705846786,
        -0.016553794965147972,
        -0.13386613130569458,
        0.0182481799274683,
        -0.04902086406946182,
        0.031877584755420685,
        -0.07440334558486938,
        0.04251173883676529,
        -0.038302455097436905,
        -0.016108674928545952,
        -0.017766794189810753,
        -0.12025780230760574,
        -0.041014164686203,
        -0.03081519715487957,
        0.05171141400933266,
        -0.07706005126237869,
        -0.030987000092864037,
        0.014431893825531006,
        -0.05359506607055664,
        -0.05351042374968529,
        -0.024146702140569687,
        -0.026067612692713737,
        -0.06788378953933716,
        0.004487576894462109,
        0.03251244127750397,
        0.03858032822608948,
        -0.014665782451629639,
        0.009577847085893154,
        -0.02850998193025589,
        -0.053413234651088715,
        0.08864839375019073,
        0.03352772444486618,
        -0.03833514079451561,
        0.05767053738236427,
        -0.046316150575876236,
        -0.055821940302848816,
        0.027375319972634315,
        -0.020090671256184578,
        0.026809081435203552,
        0.09565818309783936,
        0.01564743183553219,
        0.03981152921915054,
        -0.06281942129135132,
        -0.06797681748867035,
        0.031704798340797424,
        -0.021247901022434235,
        0.060364000499248505,
        0.026948658749461174,
        -0.004170254338532686,
        0.0013144187396392226,
        -0.019997579976916313,
        -0.033645790070295334,
        -0.0005852862959727645,
        0.022381450980901718,
        -0.01595374010503292,
        -0.07758878171443939,
        -0.04610097408294678,
        0.03613033890724182,
        -0.017642533406615257,
        0.100471630692482,
        0.021152107045054436,
        0.004118388053029776,
        0.049662668257951736,
        -0.02415560372173786,
        0.020903408527374268,
        -0.000817593710962683,
        -0.05682217329740524,
        0.033495042473077774,
        0.09638120979070663,
        0.013897990807890892,
        -0.038588423281908035,
        0.05377089977264404,
        0.060090016573667526,
        0.06696833670139313,
        0.07111119478940964,
        0.022459525614976883,
        -0.004872807767242193,
        0.05015745759010315,
        -0.07402754575014114,
        -0.04830499738454819,
        0.029458116739988327,
        -0.02057318016886711,
        0.045453235507011414,
        0.09434842318296432,
        -0.04290922358632088,
        -0.0368674173951149,
        -0.015857895836234093,
        0.04619744047522545,
        0.03546181693673134,
        -0.0021090381778776646,
        -0.017208995297551155,
        -0.062209825962781906,
        0.058060966432094574,
        -0.09897641092538834,
        0.011973138898611069,
        -0.049054086208343506,
        0.0354609452188015,
        -0.02428516000509262,
        -0.02714983932673931,
        0.16979055106639862,
        0.04950525239109993,
        0.01429769117385149,
        0.017650363966822624,
        -0.05872660502791405,
        0.008172125555574894,
        0.018473301082849503,
        0.04891432821750641,
        -0.044100966304540634,
        4.826258747581744e-33,
        -0.00034428361686877906,
        0.12179442495107651,
        -0.0442989207804203,
        -0.11615446954965591,
        0.05676575005054474,
        0.08692493289709091,
        0.062426380813121796,
        0.036643367260694504,
        -0.09225093573331833,
        -0.01572059653699398,
        -0.1258465200662613,
        0.07663644850254059,
        -0.06938964128494263,
        0.013447071425616741,
        0.06446756422519684,
        -0.04142269864678383,
        -0.017169306054711342,
        0.046102575957775116,
        0.06271228194236755,
        0.01754196546971798,
        -0.018056713044643402,
        -0.01723359152674675,
        0.0833817720413208,
        0.00465392554178834,
        0.01580442301928997,
        -0.0018423424335196614,
        -0.04645388945937157,
        -0.023527227342128754,
        0.06378116458654404,
        0.007604396902024746,
        -0.0005056868540123105,
        -0.05814807862043381,
        -0.05521665886044502,
        -0.040595464408397675,
        0.02482629381120205,
        0.03475182503461838,
        -0.04364323988556862,
        -0.06508016586303711,
        0.07644931972026825,
        -0.008453183807432652,
        -0.06063474342226982,
        0.011973565444350243,
        -0.06065021827816963,
        -0.11869911104440689,
        0.02907675690948963,
        0.020746326074004173,
        -0.013318508863449097,
        0.008794257417321205,
        -0.004225375130772591,
        -0.029938746243715286,
        -0.07582443952560425,
        0.04012902453541756,
        -0.1470988690853119,
        -0.0672679916024208,
        -0.012443147599697113,
        -0.08389490097761154,
        0.03820109739899635,
        0.03769102692604065,
        0.06919431686401367,
        0.05669652298092842,
        0.016972746700048447,
        0.028576401993632317,
        0.0839618369936943,
        0.008859126828610897,
        -0.04222369194030762,
        0.016792848706245422,
        0.007521497085690498,
        -0.017740523442626,
        -0.026937033981084824,
        -0.08249067515134811,
        0.04047413915395737,
        -0.02316867932677269,
        0.05889377370476723,
        0.038712382316589355,
        0.01741877570748329,
        0.05463815852999687,
        -0.04585353285074234,
        -0.02877001091837883,
        -0.0063895490020513535,
        -0.019992882385849953,
        -0.009413660503923893,
        0.049918510019779205,
        0.015086570754647255,
        0.021607259288430214,
        -0.015412487089633942,
        0.012699692510068417,
        -0.028170978650450706,
        -0.03432495519518852,
        -0.06891488283872604,
        0.03585463762283325,
        -0.10066375881433487,
        -0.02274446375668049,
        -0.04585855454206467,
        0.02768969163298607,
        -0.05000082775950432,
        -5.359328905290343e-33,
        -0.09348738193511963,
        -0.009051569737493992,
        -0.049687109887599945,
        0.09902160614728928,
        0.01638088934123516,
        0.038956258445978165,
        0.050184011459350586,
        -0.09330979734659195,
        0.06077943369746208,
        -0.020639777183532715,
        0.06380879133939743,
        0.019352927803993225,
        0.026915261521935463,
        -0.04648256674408913,
        0.02942107617855072,
        -0.05556613951921463,
        -0.025184266269207,
        0.039529457688331604,
        -0.023068442940711975,
        -0.10166571289300919,
        0.03634357079863548,
        -0.003947142045944929,
        -0.0491146482527256,
        0.11442217230796814,
        0.06454163044691086,
        -0.007553766015917063,
        -0.03624371439218521,
        0.036665964871644974,
        -0.06327236443758011,
        0.04909941554069519,
        -0.0016436242731288075,
        0.03645611181855202,
        0.0090111643075943,
        0.008688081987202168,
        0.056986287236213684,
        -0.03294867277145386,
        0.03647349402308464,
        0.08941769599914551,
        0.015858571976423264,
        0.0032736079301685095,
        0.08261574804782867,
        -0.0684678703546524,
        0.07939596474170685,
        -0.006336982361972332,
        -0.012079570442438126,
        0.028303304687142372,
        -0.03875728324055672,
        -0.1400076150894165,
        0.00396308209747076,
        0.020141443237662315,
        0.04456669092178345,
        -0.030095862224698067,
        0.039030522108078,
        -0.037652235478162766,
        -0.10976967960596085,
        0.03916165232658386,
        -0.034328725188970566,
        0.023130346089601517,
        -0.05407402291893959,
        -0.004835294559597969,
        0.03439247980713844,
        0.001894938643090427,
        0.06295686960220337,
        0.10474926233291626,
        0.05736200138926506,
        -0.14512783288955688,
        0.021750347688794136,
        0.04083479568362236,
        0.026141850277781487,
        -0.02743387036025524,
        -0.021079903468489647,
        0.004555792082101107,
        0.03709792345762253,
        -0.024350551888346672,
        -0.03958351910114288,
        0.053999315947294235,
        0.08444634079933167,
        0.019917519763112068,
        -0.015352698042988777,
        -0.04375457018613815,
        0.05149846524000168,
        0.05698292329907417,
        0.05005678907036781,
        -0.06108484044671059,
        0.028663739562034607,
        0.05368387699127197,
        0.08000487834215164,
        -0.019869454205036163,
        -0.005730551201850176,
        0.0008250397513620555,
        -0.08535650372505188,
        0.0231922697275877,
        -0.05276878923177719,
        0.0315353199839592,
        0.04131912440061569,
        -5.3704706459711815e-08,
        0.03408994525671005,
        0.04580569267272949,
        0.0309921782463789,
        0.0328369177877903,
        -0.024347135797142982,
        -0.02581963688135147,
        0.0052379462867975235,
        -0.010944460518658161,
        -0.013780178502202034,
        -0.03590386360883713,
        0.023061633110046387,
        -0.09175968170166016,
        -0.014930649660527706,
        -0.0033326600678265095,
        -0.0012337838998064399,
        0.05583960562944412,
        -0.027326302602887154,
        -0.004333685152232647,
        -0.01488620787858963,
        -0.036718860268592834,
        0.016485163941979408,
        -0.022478792816400528,
        0.022862253710627556,
        0.004437240306288004,
        -0.026386762037873268,
        0.01454739086329937,
        -0.028255688026547432,
        0.10841301083564758,
        0.09322991222143173,
        -0.02064146287739277,
        0.04085101559758186,
        -0.03416334465146065,
        0.047813888639211655,
        -0.0336577482521534,
        -0.013379952870309353,
        -0.003001926699653268,
        -0.022020231932401657,
        0.0367724634706974,
        0.023192215710878372,
        0.10225779563188553,
        -0.07813268154859543,
        -0.09247690439224243,
        -0.026961730793118477,
        -0.044127002358436584,
        -0.0453566238284111,
        -0.0415940098464489,
        -0.061809659004211426,
        -0.014977664686739445,
        0.023136436939239502,
        0.10443518310785294,
        0.015816861763596535,
        0.009909916669130325,
        -0.059079691767692566,
        -0.0024374898057430983,
        0.05167683959007263,
        0.013264997862279415,
        0.033795155584812164,
        0.0412847176194191,
        0.027110528200864792,
        0.023951932787895203,
        -0.013838756829500198,
        -0.1265936642885208,
        -0.11070266366004944,
        0.05539292097091675
    ]
}