{
    "id": "-VqsU1VK3mU",
    "title": "Macrovision:  The Copy Protection in VHS",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2018-05-22T17:49:50Z",
    "video_url": "https://www.youtube.com/watch?v=-VqsU1VK3mU",
    "category": "Science & Technology",
    "tags": [
        "copy protection",
        "VHS",
        "macrovision",
        "video cassette",
        "videocassette",
        "video tape",
        "analog",
        "betamax",
        "beta",
        "sony beta",
        "blockbuster",
        "rental",
        "vbi",
        "vertical blanking interval",
        "analog video",
        "analog television",
        "television",
        "tv",
        "crt"
    ],
    "views": 1243279,
    "likes": 36423,
    "comments_count": 2555,
    "description": "You can support this channel on Patreon!  Link below Did you ever try to copy one VHS tape to another and find that it just, well, didnt work?  Macrovision was the clever creation of what is now TiVo that managed to confuse a VCR without causing too much distress to a TV.  In this video, we find out what it is, how to spot it, and how it works (with a healthy dose of speculation).  Music credit:  Panama Hat No Voice by Audionautix is licensed under a Creative Commons Attribution license ( Artist:   You can support this channel on Patreon!  Patrons of the channel are what keep these videos coming.  If youd like to support the channel as well, please check out my Patreon page.  Thanks for your consideration!   And thank you to the following Patrons! Charlie Quigley, Dakota Williams, Adam Erickson, Kevin Terrell, Tommi Hares, Trevor Smith, Thomas Fuchs, Callum Brieske, Tomas, Chuck Floyd, Eitan Tal, Emil Gilliam, Andy Copsey, Bitcore, Filip, Per 'Zapro' Jensen, Ward Sutherland, rn Arnarson, Alberto Amatucci, etho624, Chris Giddings, Tomasz Kolinko, Carles Codony, Samuel Plainfield, Jason McMillon, TeaChest Media, Michael Pacheco, Jason Ganiatsas, Mike Gerow, Marc Schroth, Andrew J Thom, Samuel Blakey, Mrpirate707, Frank Harris, Joseph Spiros, Patrick Meister, Sergey Kiselev, Clara Latter, Ashley Grant, Scott Emmett O'Donnell, Tianyu Ge, jeekl, rozboris, Kelly Rose, Paul Fisher, Stephen Vrazel, Applied Science, Peter ford, Sophie Haskins, James Id, Brendan Sheehy, Jay Foreman, Rich Theobald, Kyle Olson, Bryan Reid, Quinton Wilson, Jeremy DeGuzman, Sean Spark, Lucas Hartbarger, Taylor Cuzela, David Lastres, Granger Meador, Jeremy Kitchen, Jason Wellband, Shane Belaire, Paul Emmerich, Matthew Rossi, Paul Craigie, Alex Smith, Nick, Tyler, Paul Williams, Steven Hidy, Fredrik Grufman, Kollin O'Dannel, RJ Kent, Yona, Kevin Strehl, Tony DeSimone, Mike Bailey, Maggie Brown, Howard Kraut, TM, Mark Nicholas Wales, Jason D., T.J. Steckbeck, Pavlo Pravdiukov, Tobias Faller, Marco Anastasi, Peter Byrd, Trix Farrar, Matthew Razza, Mitchel J. Mullin II, Jakob Strande Langgaard, Jan Stavl, Paul Walton, Matt Falcon, Steven First, Denver Alexander, Conor Hennessy Sykes, FinaleGrande, Christopher Dickey, OnlyOneSolutionTBHFam, Matt Sackett, Tim Juchcinski, Wayne Marsh, Ernie Smith, foophoof, Stein Strindhaug, Hank Eskin, Brady Brown, Giacomo Scaparrotti, Winfield Trail, Luke Biddle, Marc Ethier, Joseph Hill, John Semander, Bill Basch, Robert Toth, Magnus Tranum, blouerat, PK, Richard Lindsey, Lars JJ, Patrick Musson, Matt Taylor, Johan Schoeman, Thomas Jew, Josef Citrine, Marcus Schwartz, Ryan Cozzubbo, Christopher Bassett, Julian Rapoport, Ed Hall, Jason Portwood, Jesse Cardone, Michael Snowden, Drew McClain, Boh00711, Jon-Andr Haraldstad, The8TrackKid, Daniel J Schless, Sebi Jecklin, Casey Kikendall, Craig Leverenz, Charlie Hankin, Andres Plaza, Revenge, Matthew Baron, Andr, Gerald Monaco, Tab Patterson, Jason Weathered, h.drew foy, Roger Beal, Gantradies, Chris Hartl, Steve Stone, Brian G. Shacklett, Colton Aubrey Hooke, Paul Mills, Christopher Luna, Kotanu, Brendan Terrett, Techmoan, Mike Mason, Elijah Reeds, Christopher Jett, Justin Talbot, Steven Metcalf, Verysofisticated, Lolucoca, John McLusky, Ashleigh R, Stephen Bell, Logan Beenken, Eric Wood, Stephen Pick, BlancoGrande, Matthew Giraitis, James Ryan, Robert Joscelyne, Ellis M. Eisen, Francis Fisher, Kedar Deshpande, Lukas Komischke, Dave Anderson, Felix Freiberger, Dane Peterson, Brent LaRowe, Aerospyke, Kieran Cox, Hunter Schwisow, Logan Kriete, Rafa Wiosna, Adam D. Ruppe, Audin Malmin, Eric Hansen, Noah McCann, Jason R Scheuren, Rufo Sanchez, The War Academy, Yaniv, neko, Daniel Ch, Lee Wallbank, Grayson Lang, Neil Bronner, Carl Yazbek, Jeffrey Grajkowski, Christopher Splinter, Eric Merrill, Stefan Berndtsson",
    "description_links": [
        "https://creativecommons.org/licenses/by/4.0/)",
        "http://audionautix.com/",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "When you hear the term copy protection, these days youre probably more likely to think along the lines of DRM or some clever way to prevent copying a digital something-or-other, such as a music file, DVD, Blu-ray, or whatnot. If this is your frame of reference, you might be a little surprised to learn that a form of copy protection had been in use for pre-recorded video cassettes as far back as 1985. sweet music with tuba The Macrovision company, wh which later became the Rovi corporation, which later bought TiVo and decided to absorb that identity so is now TiVo, came up with a way to exploit the automatic gain control circuitry in a videocassette recorder, and create pre-recorded tapes which would mess around with that circuitry to prevent copying them. Now to be clear, this wasnt so much a copy protection scheme as it was a copy deterrent. This wouldnt exactly prevent you from making a copy, but that copy would be almost unbearable to watch. So first lets see what it does. I have this VCR plugged into this VCR, and the TV is currently displaying the output of this VCR through This VCR, and Im gonna stick a prerecorded tape into this one and a blank tape into this one. I want to make a copy of Rain Main. So now, Im going to hit record on this VCR, which will copy Rain Main onto the blank tape inside it. Pay attention to what happens as soon as I hit record. Thats not exactly a good sign. Well, aside from that, it seems to be working...OK, no apparent issues so far. But when you play the copy back, in addition to the generational loss brought about by being a second generation analog copy, the brightness of the image changes wildly, and its not at all stable. Why is that happening? And why only when Im recording? Well, what Macrovision does is screw around with the vertical blanking interval of the video signal in such a way that a TV wont really be bothered, but that a VCR attempting to record would incorrectly interpret as a change in signal strength. Im not going to go too much into detail here, as Ive already made a video explaining the basics of analog television, but at the start of every field there are a number of lines in the signal that are blank. They are transmitted at the highest intensity which creates a blacker than black segment that the TV can use to synchronize itself to a broadcast image and display it properly. To see the vertical blanking interval, you need to get yourself an old TV that allows you to adjust the vertical hold. This particular set to the rescue once more! I have the vertical hold ever so slightly off so the image will roll. This dark bar is the vertical blanking interval, and the really dark portion is the sync pulse that the TV is looking for. You can tell that it almost catches it each time it makes its way to the bottom, but with the adjustment just a tad off, it wont stay in one place. Many videocassette recorders would use this pulse for determining the signal strength. Not all channels come in with the same strength, which in the land of video means they could appear brighter or darker depending on how clear the signal is coming in. A TV doesnt care too much about the relative signal strength, but a VCR really does. Just like audio tape, a recording onto video tape needs to be made at the correct level. Too much saturation and detail is lost through clipping, and too little saturation and the picture becomes noisy. By calibrating its signal gain to the level of vertical blanking interval, the VCR would get a known reference point for brightness. This meant that no matter how strong the signal was or how bright or dark the scene it was recording was, a VCR would be able to make a recording correctly. So then, with this knowledge in their back pocket, Macrovision Solutions Corporation devised a way to mess with the blanking interval in order to confuse the gain control circuitry of a VCR. Lets look at how Macrovision changed the blanking interval.This copy of the Magic School Bus wasnt encoded with Macrovision. Notice how theres really nothing in there. So what does a tape with macrovision look like? Well, with the Wrong Trousers, the BBC took care to encode their tape with Macrovision. Notice these new blocks inside the blanking interval. That IS Macrovision. Youll see that next to the black blocks, which are actually high intensity pulses because a TV signal is inverted, are white blocks that keep fading in and out. This is likely what causes the brightness changes in the copied tape. A VCR that is recording this video signal keeps seeing the brightness of the vertical blanking interval go up and down, and it will treat it as though the entire signal were getting stronger or weaker. This means that it keeps erroneously adjusting the strength of the recording, which causes the recorded image to suffer. Warning: the following section of the video contains some speculation. OK, I ran into a wall regarding some specifics. A lot of the information about Macrovision you can find online seems incomplete and doesnt really jive with what Ive observed. Most descriptions of Macrovision will talk about the high intensity pulses and the automatic gain control, but this only explains the image getting brighter and darker. This might be particular to these two VCRs, but I tried dubbing in both directions and the resulting recordings were wildly unstable--not just too light or too dark. Because you can see the white blocks change in intensity when you look at the blanking interval, it would seem that this is what causes the image to go light and dark. And thats fine. But in addition to these pulses, which are described as excessive voltage pulses, theres a little something else. These handy oscilloscope captures on the Wikipedia page show that the intensity of the high voltage spike goes up and down, and the lower portion here stays constant. So this means that this part is the white boxes we can see appear and disappear. Assuming these two graphs show these two states of the vertical blanking interval, then the only component that changes is the level of these upper pulses. This make sense because the light portion follows a dark portion. Within the lines, you can see dark, light, grey. Dark, light, grey. And the graph does the same--dark light grey, dark light grey. I think that not enough attention is given to these lower pulses, as these appear to be at the same level as the synchronization pulse in the vertical blanking interval. If we go back to the tape without Macrovision, you can see this very dark portion here in the blanking interval. That is the high intensity pulse that the TV locks onto for vertical synchronization. But the rest of the blanking interval is just a grey color. Thats just the black level. Many black and white televisions including this one cant produce a true black unless theres a good deal of contrast in the scene, which is why it appears grey. It will however always produce true black during the sync pulse, because that pulse is blacker than black--meaning the electron gun is entirely shut off. When you go back to the tape with Macrovision, you can see that the added black bars are also at that blacker than black intensity. It seems to me that these probably screw around with a VCRs ability to maintain vertical synchronization. These dark boxes extend the sync pulse farther into the blanking interval than it should be, and the pulses appear multiple times within a single line. The white bars that appear and disappear are likely what interferes with the automatic gain control and will cause the brightness issues, but that shouldnt mess with tracking or image stability. There seems to be more than just that going on. Some descriptions of Macrovision call dubbed tapes simply annoying to watch, but this? This is unwatchable. Just to check that it wasnt simply this TV that was struggling to maintain synchronization from the copied tape, I played the tape back through the LCD TV in my kitchen, which doesnt use the vertical blanking interval in quite the same way a CRT television does. It had a more stable image, but not only did the image repeatedly become darker, it lost all color completely and the VCR was clearly struggling to maintain tracking. You can hear the pitch of the audio waver continuously. severely warbled music The signal got so bad that the TV kept blanking the screen and giving up. It seems possible to me that not only does Macrovision mess with the automatic gain control, but it might also mess with automatic tracking circuits of a VCR. Which may help to partially explain the next part: Regardless of the exact specifics of Macrovision, theres one interesting quirk to the system. Really old VCRs, which dont have the same automatic gain control circuitry of their modern counterparts, are impervious to Macrovision. (every time I need to move this thing, I regret it.) This beast just really doesnt care whats going on in the vertical blanking interval. It will dub that tape just fine for ya. See, its recording right now, and the TV doesnt show anything weird. Lets play the copy back to be sure. Yep, just fine. Hey, its me from the future. While shooting the B-roll I needed for this video, I noticed that the VCR which was copying Rain Man was making really odd sounds as it recorded. Take a listen. [sound of VCR recording but with wild speed fluctuations] Normally you never hear a VCR make noises like this, except for maybe when its adjusting its tracking. This really seems like the Macrovision is confusing the VCR on where the start of the video field actually is, and it keeps trying to compensate for that. The video head drum needs to spin in perfect alignment with the video signal, and it seems like this VCR is being fooled into thinking the start of each frame moves as the macrovision blocks fade in and out. The old VCR probably isnt affected because it doesnt try to chase a wavering signal-- I would imagine it has much less of an ability to adjust the speed of its video head and tape transport to signal fluctuations, and as a result Macrovision just doesnt affect it. Anyway, Even into the days of Macrovision, there were some VCRs that werent affected by it. It was estimated that 85% were, but that leaves a significant number of VCRs floating around which just dont care about it. Also, for those that were so inclined, getting a Macrovision defeat device from the grey market wasnt all that hard. In fact, you could build one yourself. Because Macrovision cant entirely eliminate the pulse for vertical synchronization, otherwise the TV couldnt display an image at all, a defeat device just needs to remove the altered parts that were messed up with the boxes and replace it with standard black lines. Now, when DVD came along, Macrovision was incorporated here, too. Because DVDs are a digital format, they dont contain the video fields like a videocassette does, so the player actually generates the Macrovision in the vertical blanking interval of its composite output. It will only do it so long as the disc asks for it, which not all of them did. For example, this copy of the Princess Bride doesnt use Macrovision, but this copy of Spirited Away does. The fact that the analog Macrovision system was shoved into the DVD format caused some problems for early DVD adopters. Remember how the image got messed up only after I had hit record? That happened because unless its recording, the automatic gain control circuitry isnt active and it passes the signal straight through to the TV. But many VCRs werent so kind and instead applied automatic gain control to whatever input they received, regardless of if it was recording or not. Many TVs only had one composite input, so for anyone who hooked their new DVD player into their TV through their VCR, and if their VCR didnt simply pass-through the video from the DVD player, they might get a horrible mess. Imagine how annoying it would be to play your first DVD and all of the sudden have the image come out like that. Many people thought their new DVD players were somehow broken, but thankfully newer VCRs like this one wont cause a fuss unless you tried to record from the DVD player. And while were at it, this attempted copying of Spirited Away shows a second thing added to Macrovision, which was called Level II ACP. This would invert the phase of the colorburst occasionally, which produced stripes of the wrong color on a copy. Quite honestly thats the least annoying of the issues with this recording. Now these days, far more complicated copy protection schemes are in use, much to the chagrin of anyone who wants to make legal copies of their media which is, by the way, allowed. But Macrovision was I think quite clever. By messing with the fundamental structure of the video signal just enough to keep a recording VCR from working correctly, but not enough for a TV or a playing to become confused, they actually had a pretty elegant solution. Thanks for watching, I hoped you enjoyed the video! If this is your first time coming across the channel and you liked what you saw, please subscribe to Technology Connections! You can also support the channel on Patreon. Patrons of the channel are what keeps these videos coming, and if youd like to join the awesome people who make this possible, please check out my Patreon page. Thanks for your consideration, and Ill see you next time!",
    "transcript_keywords": [
        "vertical blanking interval",
        "Macrovision",
        "blanking interval",
        "VCR",
        "vertical blanking",
        "blanking",
        "copy",
        "interval",
        "signal",
        "video",
        "VCRs",
        "vertical",
        "tape",
        "DVD",
        "copy protection",
        "automatic gain control",
        "video signal",
        "image",
        "recording",
        "gain control"
    ],
    "transcript_entity_values": [
        "Macrovision Solutions Corporation",
        "LCD TV",
        "Spirited Away",
        "Rain Man",
        "the Magic School Bus",
        "DRM",
        "Rain Main",
        "two",
        "Rain Main",
        "85%",
        "Patreon",
        "Level II ACP",
        "wh",
        "first",
        "TiVo",
        "one",
        "these days",
        "Technology Connections",
        "Macrovision",
        "Wikipedia",
        "Macrovision",
        "1985",
        "BBC",
        "Blu-ray",
        "the days",
        "Rovi",
        "second"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "FAC",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL"
    ],
    "vector": [
        -0.13001438975334167,
        -0.07867595553398132,
        0.0020179504062980413,
        -0.16864246129989624,
        0.07099498808383942,
        0.06354866176843643,
        -0.017769796773791313,
        0.015234355814754963,
        0.016090601682662964,
        -0.013599809259176254,
        0.02093597687780857,
        -0.02083352953195572,
        0.008640537969768047,
        -0.02723013609647751,
        -0.046173449605703354,
        -0.06678034365177155,
        0.034645456820726395,
        -0.02644237130880356,
        0.02316344529390335,
        0.0062555186450481415,
        0.03588901832699776,
        0.03987641632556915,
        -0.015230161137878895,
        0.02262086234986782,
        0.015575270168483257,
        0.04613259807229042,
        -0.0473121739923954,
        0.015486814081668854,
        -0.022091908380389214,
        -0.08467267453670502,
        -0.027588263154029846,
        0.08763523399829865,
        0.05961564928293228,
        -0.010606205090880394,
        0.028722485527396202,
        -0.038797006011009216,
        0.010959799401462078,
        0.009868370369076729,
        -0.050141703337430954,
        -0.01672070473432541,
        -0.035235024988651276,
        0.030991170555353165,
        -0.003291567089036107,
        -0.06538990139961243,
        -0.015265567228198051,
        -0.02801653929054737,
        0.06450998038053513,
        -0.06685604155063629,
        0.030638087540864944,
        0.030477182939648628,
        -0.05810549482703209,
        -0.02340269833803177,
        0.10346003621816635,
        -0.0005965884192846715,
        -0.0277787484228611,
        -0.03150220587849617,
        0.0610983707010746,
        0.02820083312690258,
        0.0489029698073864,
        0.04431307688355446,
        -0.026294538751244545,
        -0.018645362928509712,
        -0.09204750508069992,
        0.0034589008428156376,
        0.036302533000707626,
        0.05507917329668999,
        -0.006486495956778526,
        0.06395098567008972,
        -0.009913712739944458,
        -0.03543086722493172,
        -0.10218479484319687,
        0.031003369018435478,
        0.02934977039694786,
        0.04386157542467117,
        0.04033919796347618,
        -0.033391498029232025,
        0.03869793191552162,
        -0.07356127351522446,
        0.049944907426834106,
        -0.04811680316925049,
        0.009001926518976688,
        -0.08627651631832123,
        0.0011746613308787346,
        -0.061151083558797836,
        -0.0019328627968207002,
        0.044486403465270996,
        0.03303728997707367,
        -0.030992448329925537,
        0.05409698560833931,
        0.058545876294374466,
        -0.1048717126250267,
        0.06818567961454391,
        0.10928358882665634,
        -0.013553682714700699,
        0.04974250867962837,
        0.010120897553861141,
        -0.08066769689321518,
        -0.08757013082504272,
        0.004247004631906748,
        0.08912405371665955,
        0.04272989556193352,
        -0.048413027077913284,
        0.021675366908311844,
        -0.10406497865915298,
        -0.006410138215869665,
        -0.04937419667840004,
        0.07403908669948578,
        0.03111039102077484,
        0.04522855207324028,
        0.05616749823093414,
        -0.01651713065803051,
        0.08342678099870682,
        0.0014306713128462434,
        -0.042738176882267,
        0.0027832509949803352,
        0.05002026632428169,
        -0.040872033685445786,
        0.03939087688922882,
        -0.01912853866815567,
        -0.05267510190606117,
        0.07231926172971725,
        -0.054311320185661316,
        -0.04181920737028122,
        -0.020908977836370468,
        0.029067859053611755,
        -0.07246166467666626,
        0.022110024467110634,
        3.825225758178731e-33,
        0.006737730000168085,
        0.049507904797792435,
        -0.02596057392656803,
        0.031058022752404213,
        0.09441016614437103,
        0.06346563249826431,
        -0.024682827293872833,
        0.0628020167350769,
        -0.06345401704311371,
        -0.022752268239855766,
        -0.007776549085974693,
        -0.0017035857308655977,
        -0.09236033260822296,
        0.043866366147994995,
        -0.07594429701566696,
        0.01743386872112751,
        -0.11571615189313889,
        0.007798330392688513,
        -0.06744512170553207,
        -0.003995124250650406,
        0.003564373590052128,
        0.03278297185897827,
        0.016147863119840622,
        -0.02876899391412735,
        0.017191367223858833,
        -0.0075751799158751965,
        -0.013072635978460312,
        -0.11160368472337723,
        0.12199801951646805,
        0.04239799454808235,
        -0.06655983626842499,
        0.05849834159016609,
        0.05262432247400284,
        -0.0029675362166017294,
        0.05102089047431946,
        0.006855108309537172,
        -0.08862202614545822,
        -0.08540595322847366,
        -0.0696583092212677,
        0.07487311959266663,
        0.06125234439969063,
        0.006700583267956972,
        -0.08113663643598557,
        -0.0005106560420244932,
        -0.06009942293167114,
        -0.05211639031767845,
        0.06885170936584473,
        0.037153489887714386,
        -0.031771786510944366,
        0.05212141573429108,
        0.06032584235072136,
        0.022873928770422935,
        -0.11372046172618866,
        -0.11355157941579819,
        0.026915958151221275,
        0.008976124227046967,
        -0.040959689766168594,
        0.018440982326865196,
        0.032141536474227905,
        -0.05681859329342842,
        0.07474901527166367,
        0.08182156085968018,
        0.0850735679268837,
        -0.017022935673594475,
        -0.0481470450758934,
        -0.016960570588707924,
        -0.0028111753053963184,
        -0.021894220262765884,
        0.03552532568573952,
        -0.001790856011211872,
        -0.08944029361009598,
        8.608295320300385e-05,
        0.014897228218615055,
        -0.11715167760848999,
        -0.01432738546282053,
        0.04865901544690132,
        -0.07589691132307053,
        0.06371069699525833,
        0.03144259378314018,
        -0.017051082104444504,
        -0.03903018310666084,
        -0.022010810673236847,
        0.04840259626507759,
        0.00580811919644475,
        0.032494593411684036,
        -0.014850589446723461,
        0.021042145788669586,
        -0.03974400460720062,
        -0.010196336545050144,
        -0.03198477625846863,
        0.03212904557585716,
        -0.031231407076120377,
        0.006521033123135567,
        0.015201030299067497,
        -0.03527538478374481,
        -4.156223294193194e-33,
        -0.011050643399357796,
        0.035966966301202774,
        -0.01098681427538395,
        -0.012821960262954235,
        -0.04424784705042839,
        -0.0727384090423584,
        0.040345728397369385,
        -0.014577153138816357,
        0.013271631672978401,
        -0.10962896794080734,
        -0.006866985000669956,
        -0.07691299170255661,
        -0.05713871121406555,
        0.006839569658041,
        -0.04458421468734741,
        -0.07204591482877731,
        0.034050874412059784,
        0.005932826083153486,
        -0.041301824152469635,
        -0.06629834324121475,
        0.08572910726070404,
        -0.013967035338282585,
        0.004925552289932966,
        0.0838305652141571,
        -0.03520453721284866,
        -0.01140848733484745,
        0.02168605662882328,
        0.07708411663770676,
        0.11576924473047256,
        0.04351292550563812,
        -0.021392110735177994,
        0.06389486789703369,
        -0.027800219133496284,
        -0.01666272059082985,
        0.009268118068575859,
        0.06640046834945679,
        0.10811839997768402,
        0.03657232224941254,
        -0.014658751897513866,
        -0.045734889805316925,
        -0.00678918557241559,
        0.06385038793087006,
        -0.10768276453018188,
        -0.06667681038379669,
        -0.04627414047718048,
        -0.031922973692417145,
        0.026541199535131454,
        0.0379374735057354,
        -0.056788694113492966,
        -0.0009972875704988837,
        0.07304360717535019,
        -0.02510847896337509,
        0.015877220779657364,
        -0.021618595346808434,
        -0.0007545213447883725,
        0.0476890467107296,
        0.017197128385305405,
        0.02923182211816311,
        0.08108119666576385,
        0.025290779769420624,
        -0.037979770451784134,
        -0.012932696379721165,
        -0.06819186359643936,
        -0.06143655627965927,
        0.05944085121154785,
        0.07183336466550827,
        0.07323439419269562,
        0.0514117069542408,
        0.005429043900221586,
        0.021758468821644783,
        0.04929257929325104,
        -0.016459472477436066,
        0.0067503186874091625,
        -0.052726861089468,
        0.030866699293255806,
        0.04516987502574921,
        -0.029293425381183624,
        -0.05481176823377609,
        -0.11018583923578262,
        0.013216345570981503,
        -0.05894948169589043,
        -0.04026307910680771,
        0.02131078951060772,
        0.09453126043081284,
        0.07031449675559998,
        0.05387530475854874,
        0.032818324863910675,
        -0.0448588952422142,
        0.03898211568593979,
        0.10961327701807022,
        -0.08637317270040512,
        0.07246199995279312,
        0.006798999384045601,
        0.06745847314596176,
        0.03762398660182953,
        -5.732466945573833e-08,
        -0.007780866697430611,
        0.04765314981341362,
        -0.0610051155090332,
        -0.0009704464464448392,
        0.00024931138614192605,
        -0.04198549687862396,
        0.025733837857842445,
        -0.05670830234885216,
        0.008254102431237698,
        -0.026089832186698914,
        0.019593318924307823,
        -0.04299158975481987,
        -0.023569516837596893,
        0.022190088406205177,
        0.08512131124734879,
        0.07272586226463318,
        -0.06465353816747665,
        0.03982166200876236,
        -0.06278689205646515,
        -0.02006429061293602,
        -0.006594941485673189,
        0.029375972226262093,
        0.07388138771057129,
        -0.014384230598807335,
        -0.043312326073646545,
        -0.02090577408671379,
        0.024082452058792114,
        0.023608095943927765,
        0.012581736780703068,
        -0.019695822149515152,
        -0.04806005209684372,
        0.08219082653522491,
        -0.10261133313179016,
        -0.09930538386106491,
        -0.01528045255690813,
        -0.02289615571498871,
        -0.006653282325714827,
        0.018109669908881187,
        0.018094049766659737,
        0.060463033616542816,
        0.012636643834412098,
        -0.03240695595741272,
        -0.05350566282868385,
        0.021017272025346756,
        0.0518796406686306,
        -0.00323394569568336,
        0.06014584004878998,
        -0.057676855474710464,
        0.05012442171573639,
        -0.014211012050509453,
        0.05443968251347542,
        0.0759149044752121,
        -0.006586506497114897,
        0.08308425545692444,
        0.06052591651678085,
        0.034349244087934494,
        0.042838387191295624,
        0.024731455370783806,
        0.00025737943360581994,
        0.07033279538154602,
        0.003196011297404766,
        -0.01635218784213066,
        0.05042582005262375,
        -0.017905734479427338
    ]
}