{
    "id": "-ZXrJRpA0Jw",
    "title": "This is the WORST Monitor Ever...ON PURPOSE! - Dasung PaperlikeU E-Ink Monitor",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-08-30T00:56:08Z",
    "video_url": "https://www.youtube.com/watch?v=-ZXrJRpA0Jw",
    "category": "Science & Technology",
    "tags": [
        "e-ink",
        "eink monitor",
        "paperlike",
        "dasung monitor",
        "paper monitor",
        "epaper",
        "amazon kindle monitor",
        "kindle monitor",
        "eink display",
        "epaper display",
        "amazon monitor eink"
    ],
    "views": 2182072,
    "likes": 89710,
    "comments_count": 5402,
    "description": "Use code LTT50 to get 50% off Keeper personal or family plans at  or try it out with a 30-day free trial.  While we love looking at cool gaming monitors with features like MiniLED and QD-OLEDs, Dasung is coming to us today with something out of left field, an E-INK display. Thats right the same tech that graces the Amazon Kindle is in a monitor now. But is that as bad of an idea as it sounds?  Citations: 1)  2)  3)  4)  5)  6)  7)  8)  9)   Discuss on the forum:   Buy a DASUNG Paper Like E-Ink Monitor:  Buy an Amazon Kindle Scribe:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:32 How E-Ink works 2:48 Features 3:45 Using it... 4:50 Browsing the Web 7:15 the \"modes\" 8:34 Watching Videos 9:30 How would you use this? 10:35 Trying word processing 11:32 Compare it to a Kindle Scribe 12:09 GAMING 13:09 The COLOR version is coming! 13:32 Contesting their claims 14:30 The Cost 15:47 Outro",
    "description_links": [
        "https://bit.ly/3YJILGg",
        "https://www.aoa.org/healthy-eyes/eye-and-vision-conditions/computer-vision-syndrome?sso=y",
        "https://www.webmd.com/eye-health/dry-eye-screen-use",
        "https://link.springer.com/article/10.1007/s40123-023-00675-3",
        "https://sid.onlinelibrary.wiley.com/doi/pdfdirect/10.1002/msid.1086",
        "https://www.cell.com/heliyon/pdf/S2405-8440(22)01570-5.pdf",
        "https://www.rtings.com/monitor/tests/motion/image-flicker",
        "https://www.niehs.nih.gov/health/topics/agents/emf/index.cfm",
        "https://www.cancer.gov/about-cancer/causes-prevention/risk/radiation/electromagnetic-fields-fact-sheet",
        "https://en.wikipedia.org/wiki/Appeal_to_nature",
        "https://linustechtips.com/topic/1528891-this-is-the-worst-monitor-ever-and-that%E2%80%99s-the-point-dasung-paperlikeu-e-ink-display/",
        "https://geni.us/l7uEm",
        "https://geni.us/FPdfp",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "Your eyes are delicate instruments. One wrong move and you could damage them for life, which makes you kind of wonder, could blasting them with light from our monitors be hurting them? Is there a better solution? Meet the Paperlike U253, a monitor by Samsung, I mean, DaSung, that is 25.3 inches, curved, well, kind of, runs at 3K resolution and most importantly, uses E Ink, a panel technology that I have never before today seen in a desktop monitor. It promises to change the game when it comes to eye health. Could it make a difference or is DaSung healthily eyeing a way to game you of your spare change? E Ink is far from new technology, but it wasn't until Amazon introduced the Kindle about a decade and a half ago that it really hit the mainstream, which, wait, that's 15 years. How is it that it took this long for someone to take that technology that people love for how easy it is on the eyes and try to put it in a monitor? Maybe because it's not a very good idea. With that said, DaSung might be onto it, even if, you guys saw the title, this ain't it, chief. But this is a segue to our sponsor, Keeper. Keeper is an end-to-end encrypted password manager that's trusted by millions of people. Plus, they now support Passkeys, the gateway to a passwordless future, wow. And our audience can save 50% today on personal and family plans at the link down below. For all its flaws, it's absolutely a head turner. We had this out when people were doing tours during LTX and literally everyone's like, whoa, what's that? There are a few reasons why E Ink has taken so long to come to the desktop. And to understand those reasons, we need to understand the technology. E Ink, which is kind of the Kleenex of electrophoretic displays, works by suspending charged pigment particles in a capsule that's filled with viscous fluid. These capsules are placed between two layers of transparent electrodes that can send a charge, attracting the particles to either side of the capsule. So if you zoom way in and slow things down a bit, you can actually see the individual capsules floating to the surface. You put a bunch of those capsules in an array and suddenly you have an E Ink display. Now you might think, hey, this could lead to a few problems. I mean, if the particles are as big as they are and they are physically moving through a viscous fluid, how do we refresh the display quickly? That's the neat part. You don't. Despite touting ultra high refresh technology, this monitor maxes out at a whopping 15 Hertz. 15 times it refreshes every second. But before we get too into the weeds, let's take a look at the features on this thing. One of my favorite things about it is watch this. As I unplug everything to show you guys the IO, da, da, da, da, da, da, da. It doesn't need power in order to retain the last image that was on the screen. I mean, it'll degrade eventually, but ah, ah, cool, right? Anyway, it's got a built-in two-port USB hub, built-in audio jack, it has height adjust, pivot, swivel, and power in, display port, USB-C in, very nice, as well as an HDMI port. Linus, you missed the grills for the speakers. It's not that I missed them, it's that I just wouldn't want to use them. I mean, okay, all right, fine, fine, fine, fine, the grill. Really? They're pointing out sideways from behind the monitor. How good could they sound? Left and right. I mean, they're not gonna sound great, but they're there. It's a nice option. It's true what he says. Honestly speaking, I'm glossing through this as fast as I can because I desperately want to try this. I've had to look at this on his desk for the last two flippin' weeks. Is that as good as it manages to do, converting to grayscale? I'm gonna give you a quick little tutorial on how to use it. Oh, look, you're learning. Thanks. These six buttons are very important. They allow you to change the- Ooh! Not backlight. Front light. Exactly, because E Ink is a reflecting display. If you keep pressing that button, you'll find that there's different color front light in reading mode. Yeah, P. Yeah. Also, it's not really very even. You can tell it's very edge-lit. It reminds me of the Game Boy SP when you have it on. Does the C manually refresh the display? Yes, that is- So if I could press this 15 times per second, no, no, okay. Different modes, graphic mode, text mode, video mode. Why don't we start with text mode? It seems to be a contrast control of something. Exactly. I think the funniest part about this is that you can see that the heads-up display just kind of stays on. If you get like a window- Unless it gets refreshed. Exactly. I know, where could I get one like that? lttstore.com. Ooh, okay. I mean, this is- Ooh, that logo is still burned in there. Is that what Clear does? Exactly. If you've used e-readers before, you'll notice like when you change a page, you see the whole screen flash. It's refreshing every pixel a couple of times to totally separate out the e-ink. Because when you have all those charged particles in there, if you have a bunch of positive particles and negative particles, they're gonna be attracted to each other sometimes. So they don't always 100% clean. I can see that. I'm afraid to know what it's gonna look like if I just mouse wheel down. Oh, wow, you can see all these post counts in between here, yikes. Whoa, whoa, go back, go back, go back, go back, go back. Look at the- What? That I don't understand. There's so many things going on in the display that is like worth talking about. One, I don't know why this happens, but you'll notice that here, where we're supposed to have like a gray background. Yeah. It's doing some dithering. Because e-ink, you're either black or you're not, or you have to find sub-pixels that don't exist on this monitor to make gray. So you just use actual pixels, meaning that your text is not necessarily gonna be that sharp unless you tweak your contrast and make sure that there are no shades of gray. And as you can see, there's supposed to be text up here. Oh, no. So you're saying we found the one scenario where dark mode is not better. Yeah, it's substantially worse. It's way more distracting to have bright ghosting than it is to have dark ghosting. I can tweak the contrast to make that show up. It's still not a great experience. Terrifying here. Let's go to something that's more of like an article. As soon as I scroll, it just turns into a mess. A readable mess? Can I adjust the brightness? Yeah, so if you want to adjust. You just hold it? You hold that and you hold the light and then you press plus or minus. Man, the amount of just faffing about with this thing to get it to look decent in all your different content, I just clear it. You can download software, but it doesn't offer a ton of benefits. The best one is that you can make a shortcut to clear the display. Or you can set it to refresh every 30 seconds, but that's super distracting. Because just randomly the whole thing, you're like, oh, it's very jarring. We're experiencing some video, whether we intended to or not. I mean, it's watchable. One thing I want to take a look at is I think we're currently in one of the fastest modes. I think it boots up at the highest refresh rate. No, I put it in text mode. No, that's not, that doesn't define your refresh rate. The different modes defines how it handles contrast. Okay. How do I change the other modes? M and plus switches you from the five modes. You got fast, you got fast plus, you got fast plus plus, you got fast plus plus plus. Okay, how many pluses are there? There's four pluses now. This is the fastest refresh rate. Why would I ever turn it off of the fastest refresh rate? Well, you were complaining about the ghosting, right? Oh, I see. It still happens. It still happens. It's a different kind of awful. They're both awful. Yeah, this is far more smeary. Yeah, and the contrast is lower. And I don't mean contrast in terms of how the processor in the monitor is taking the input and assigning it to black or white or gray. I mean, the actual level of black and the level of white are closer to each other, the contrast ratio. And you can really see it when you look really close on sort of dark colors, you can see it's just like not filled in, right? That's because the ink doesn't make it to the surface in time for your refresh. And it's much darker, even if the ghosting is absolutely still present. I wasn't sure how fast fast was, but I think I could literally count it. And I think it's four frames per second. Time to view video, I guess. Everything's kind of nightmarish. I think you're right. I think it's about four frames per second. I'm trying to move the mouse around. Very challenging. To be clear, we didn't bring this in to hate on it. I was actually very excited to see this technology in a monitor. And I think for a certain user, even this first-generation implementation, and you know who you are, you're probably going, oh, yes. This video did not kill the radio star though. This will like etch a sketch away, I'm sure. Captions are gonna be a problem. It's like station, logo. Any text is really distracting, but oh, man. Look at the smears from the headset just following it around. You could mess with the contrast a little bit. Oh my God. Yeah, that did not improve anything, Adam. You actually, you managed to make it worse. Substantially worse. Good job. Okay, yeah, yeah, right there, right there. That's the spot. You can save a single preset to this monitor so that it will always boot into that one. I don't know how to change it to that preset once it's already on, but it will boot to it. Which I mean, it makes sense if you go like, I'm using this to type my scripts. I need, what's the best way to make word look good? Yeah, I would never have this as my primary monitor, but as a secondary display. You really can't have this as a primary monitor because of just how grayscale works. When you have two colors that are different but have the same brightness, they look identical. So you'd never know what's a clickable link versus what's just text on a page. Exactly, it can be really frustrating. I was worried about this before and I was right. The longer you actually just let it run without doing a refresh, the more washed out it ends up looking. You can see it's gotten pretty hard to look at now. I mean, I do have to say the viewing angles on it are great. Oh man, I can't even tell that this web browser isn't open anymore. That's rough. They also say that the best way to use this is by setting your desktop wallpaper to be pure white so that you don't have that kind of ghosting. Look at that gradient. Let's stop showing what it's not good at for a bit though. How about just for word processing? I'm gonna put it in text mode, maybe tweak the contrast a little bit. Oh, I'm gonna slow down the speed a bit too. You definitely need to be a confident typist if you really wanna take advantage of the slower ones. Also, the text doesn't look that good on text mode and find it very frustrating. Yeah, I mean, this is supposedly 3200 by 1800 resolution. That does not look like a 3200 by 1800 display. I think the issues that text smoothing is done on a sub-pixel level, which this doesn't have. So it's just getting these really weird signals of brightness and trying to interpret them. So it makes things really grainy, whereas when you have something on your Kindle where it's a dedicated OS, it knows it's one-to-one, no sub-pixels, things just look smoother. An obvious solution would be to adjust clear type, just turn it off. That's only gonna work in the programs that use clear type. This is the Kindle scribe. Man, look how much better that grayscale looks. I can erase this and it refreshed it. Whoa, it refreshes like part of it if that's all it needs. And then if it needs more, it's like, no, no, I need more, I'll do the whole thing. Why doesn't this do that? It's receiving the video signal. Because Dasung probably doesn't have the same R&D budget as Amazon. You know what? For just typing though, it's really easy on the eyes. Like it really is though. I would never wanna use even the front light. I would just wanna have a comfortable amount of ambient light in my room and just... Oh, we haven't even played video games on it. I can't even... Steam, adjust your contrast. Can it run Crysis? For mode, I'm kind of feeling video mode. Same to overlays, just chilling. I'll be your clear guy. You just yell clear whenever you want it and I'll press the button. This is a good solution. Clear. Oh, look at that, clean. Clear. Clean. Clear. Wait, can't we skip this intro? Probably not. It's 2006. Now it seems like it's a good time to talk about the letter that Dasung includes with the monitor. Ooh, a letter. Yeah. We know that E Ink products have distinct disadvantages, but they also have advantages. And as long as you understand the shortcomings, those can be worthwhile depending on your use case, which honestly, I think I agree with. That makes me very excited about what they have coming in the future. They're gonna release a color E Ink version of this monitor. So we could be looking at a product from them again very, very soon, one that I am way more excited-er about. Yeah, having the color will solve so many contrast issues, make things a lot easier to see. It has the potential to make a huge difference. It's nighttime in this part of the game, isn't it? If you get the positives that they bring up on their website, I wanna contest some of their claims as they're a bit spurious. They claim things like it's good for people with myopia, which is nearsightedness. There is no benefit to using an E Ink monitor if you're nearsighted. They also claim that it's good for digital eye strain, but there's no conclusive evidence that E Ink will help. The issue of digital eye strain comes from not refocusing your eyes and staring at the same thing for a long, long time. E Ink doesn't change that. It's still a monitor. It's still not very far away. Your eyes are still gonna get strained. But a big part of the strain is A, the lack of focusing, and B, that people forget to blink as much, and then your eyes aren't lubricated and they dry out. If you do have digital eye strain, you should try and follow the 20-20-20 rule, which is every 20 minutes, take 20 seconds to look at something that's 20 feet away. That way, you let your eyes refocus, you work out some of the extra muscles for focusing your eyes. It'll help a lot. How about you work out the muscle for clearing the display so I can see what the heck I'm doing here? I don't think it helped. No, it really didn't. The only thing complicating this matter is the cost. It's... $2,000. Seems like a value to me, right? There, okay. This is the only setting that works at all. What mode are you in? I'm in game mode. Fast, plus, plus, plus, plus. Is that four pluses? Four pluses of fast. Clear. I think I got him. Wow. Keeper. One of the most important steps to take with personal cybersecurity is proper password safety. The majority of security breaches are the result of human error and weak or stolen passwords are big contributors. Keeper security lets you manage and track all your passwords and private information. The platform will auto-fill your usernames, passwords, and 2FA codes on both mobile and desktop, so all you need to remember is your strong master password to access Keeper. Since they use a zero trust and zero knowledge security model, only you have access and control over who can see your passwords. And Keeper is hooking up our audience with a huge 50% off both family and personal plans with code LTT50. Plus, there's an exclusive 30-day free trial and feel free to use that code LTT50 after the trial if you wanna keep using Keeper. So keep your data locked up by clicking the link down below. If you enjoyed this video and you wanna talk more about text clarity, we discussed that a fair bit in our video on the Odyssey G7. Why is it we focus on that so much? QD OLED has color fringing. Ah, that's right.",
    "transcript_keywords": [
        "Ink",
        "Yeah",
        "monitor",
        "mode",
        "Clear",
        "text mode",
        "text",
        "display",
        "make",
        "contrast",
        "good",
        "refresh",
        "fast",
        "eyes",
        "video",
        "things",
        "thing",
        "Keeper",
        "kind",
        "DaSung"
    ],
    "transcript_entity_values": [
        "Four",
        "about a decade and a half ago",
        "20 seconds",
        "DaSung",
        "one",
        "Crysis",
        "second",
        "da, da, da, da, da, da, da",
        "four",
        "DaSung",
        "first",
        "Hertz",
        "Keeper",
        "One",
        "about four",
        "USB-C",
        "2,000",
        "Dasung",
        "zero",
        "Kleenex",
        "Kindle",
        "20-20-20",
        "IO",
        "1800",
        "20 feet",
        "every 30 seconds",
        "Kindle",
        "today",
        "the Odyssey G7",
        "five",
        "Amazon",
        "every 20 minutes",
        "a ton",
        "jack",
        "3",
        "100%",
        "15",
        "15 years",
        "2FA",
        "two flippin' weeks",
        "30-day",
        "six",
        "USB",
        "HDMI",
        "Adam",
        "Linus",
        "between two",
        "50%",
        "3200",
        "2006",
        "two",
        "Samsung",
        "25.3 inches",
        "Passkeys",
        "millions"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "TIME",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "ORG",
        "DATE",
        "FAC",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "NORP",
        "CARDINAL"
    ],
    "vector": [
        -0.09873371571302414,
        0.09079723805189133,
        -0.007038766052573919,
        -0.036168623715639114,
        0.07491108030080795,
        0.006559171713888645,
        -0.0068333023227751255,
        0.06289207935333252,
        0.017554407939314842,
        0.012831824831664562,
        0.001911862287670374,
        0.04443087428808212,
        0.03424321860074997,
        0.00624875770881772,
        -0.03106635995209217,
        -0.07388859242200851,
        0.05758103355765343,
        -0.10836664587259293,
        0.015265011228621006,
        0.027247723191976547,
        0.008691420778632164,
        -0.07505080848932266,
        0.05488187074661255,
        -0.03984817862510681,
        -0.030138030648231506,
        -0.014703742228448391,
        -0.01390751451253891,
        -0.034092798829078674,
        -0.02018892951309681,
        -0.07092305272817612,
        -0.017237123101949692,
        0.0026782795321196318,
        -0.03989635780453682,
        0.041257344186306,
        -0.025064250454306602,
        -0.07836412638425827,
        0.06911586970090866,
        -0.07798628509044647,
        -0.06858590990304947,
        -0.11903636902570724,
        0.03247726708650589,
        -0.033984020352363586,
        -0.05521910637617111,
        -0.033924877643585205,
        -0.028251273557543755,
        -0.11374609917402267,
        -0.05809291824698448,
        -0.027306806296110153,
        -0.09018167108297348,
        -0.033978912979364395,
        0.029978524893522263,
        -0.030950132757425308,
        0.04236224666237831,
        -0.04833785817027092,
        0.044034574180841446,
        0.0003792409843299538,
        -0.0062674954533576965,
        -0.03357604146003723,
        0.045102715492248535,
        0.016640570014715195,
        0.05891537666320801,
        -0.051786135882139206,
        -0.0489957332611084,
        0.05104801803827286,
        0.001143483561463654,
        0.013855566270649433,
        0.017686815932393074,
        -0.01507672481238842,
        -0.04631957411766052,
        0.02233601175248623,
        -0.06955941021442413,
        -0.032635048031806946,
        0.06892511993646622,
        0.03249219059944153,
        0.07836177945137024,
        -0.01417713426053524,
        0.02808770164847374,
        -0.06369538605213165,
        0.03328852728009224,
        0.008118153549730778,
        -0.0012605132069438696,
        0.02759058214724064,
        0.005037462804466486,
        0.08494783937931061,
        0.010068513453006744,
        -0.052145104855298996,
        0.055785611271858215,
        -0.007679578382521868,
        0.0359361357986927,
        -0.07794781029224396,
        0.022685270756483078,
        0.07865531742572784,
        0.018632564693689346,
        0.05460762232542038,
        -0.040307365357875824,
        -0.028370356187224388,
        0.0744098499417305,
        0.035914983600378036,
        -0.005717075429856777,
        0.043439704924821854,
        0.046567391604185104,
        0.07728482037782669,
        0.04200535640120506,
        -0.0822022408246994,
        -0.03163158893585205,
        -0.11235703527927399,
        0.01579214073717594,
        -0.020148666575551033,
        -0.013085439801216125,
        -0.05326799303293228,
        -0.022187288850545883,
        0.007911860942840576,
        -0.08498115837574005,
        0.017228972166776657,
        0.009867202490568161,
        -0.025846092030405998,
        -0.0379389263689518,
        -0.010004539042711258,
        0.06212077662348747,
        -0.030778808519244194,
        -0.027516750618815422,
        -0.011518670246005058,
        -0.10135611146688461,
        -0.03785492852330208,
        0.060572635382413864,
        -0.014029895886778831,
        -0.016140621155500412,
        1.1985418461155778e-33,
        0.05383060872554779,
        0.06940009444952011,
        -0.08602306246757507,
        -0.11361615359783173,
        0.026469813659787178,
        0.0959741622209549,
        -0.024004513397812843,
        0.08312917500734329,
        0.032512277364730835,
        -0.024730471894145012,
        0.013391390442848206,
        0.01887018047273159,
        -0.07964827120304108,
        0.07480717450380325,
        0.054392147809267044,
        -0.03542771935462952,
        -0.05149088427424431,
        0.04459831491112709,
        -0.0545218288898468,
        0.0171832088381052,
        0.008145447820425034,
        -0.10022882372140884,
        0.025288540869951248,
        -0.08486887812614441,
        0.0008941959240473807,
        0.03647709637880325,
        -0.03028818592429161,
        0.04504791274666786,
        0.09441377967596054,
        0.029133619740605354,
        -0.03888280689716339,
        -0.029038362205028534,
        0.019874028861522675,
        -0.028448104858398438,
        -0.08396496623754501,
        -0.012846301309764385,
        -0.05671399459242821,
        0.0006667003617621958,
        0.0280318446457386,
        0.04059230908751488,
        0.006845346186310053,
        0.0946359783411026,
        -0.0071570915170013905,
        -0.06149093434214592,
        0.015295738354325294,
        0.0832725539803505,
        0.06565246731042862,
        0.06979017704725266,
        0.0667693093419075,
        0.039582956582307816,
        -0.12029113620519638,
        -0.05661444738507271,
        -0.004870312754064798,
        -0.052423957735300064,
        0.026885390281677246,
        0.0196481142193079,
        0.04104990139603615,
        -0.06047070771455765,
        0.03868234157562256,
        -0.03612242266535759,
        -0.011675456538796425,
        0.021178048104047775,
        0.03179426118731499,
        0.06886018067598343,
        -0.032658498734235764,
        0.046141501516103745,
        0.011918785981833935,
        0.01056202594190836,
        -0.14818018674850464,
        -0.06186511367559433,
        -0.03416973352432251,
        0.014495340175926685,
        0.030630530789494514,
        -0.09566175937652588,
        0.02927984856069088,
        0.025587117299437523,
        -0.014878403395414352,
        0.05998038873076439,
        0.006506301928311586,
        -0.04389078542590141,
        0.03252943232655525,
        -0.03215895593166351,
        -0.0098573574796319,
        -0.08848860114812851,
        -0.03541407361626625,
        -0.025108113884925842,
        -0.01669449917972088,
        -0.037126462906599045,
        -0.02897290699183941,
        0.004394392017275095,
        0.02517576329410076,
        -0.01694984920322895,
        0.02289634756743908,
        -0.013925332576036453,
        -0.03487825766205788,
        -3.332664972509391e-33,
        0.0009329081512987614,
        -0.049125928431749344,
        -0.009874296374619007,
        0.02522641234099865,
        0.0018836867529898882,
        -0.015261225402355194,
        0.1314469873905182,
        0.07928347587585449,
        0.05334591865539551,
        -0.01251338142901659,
        0.06006702408194542,
        0.014681329019367695,
        -0.06051764637231827,
        0.016161946579813957,
        0.013077015057206154,
        -0.05338289961218834,
        0.04753251001238823,
        -0.04023295268416405,
        0.04146832600235939,
        -0.0601203478872776,
        0.05731244757771492,
        -0.03837725520133972,
        -0.001901530660688877,
        0.06541581451892853,
        0.06892488896846771,
        0.05688570812344551,
        0.0191788487136364,
        -0.049103736877441406,
        -0.05577508732676506,
        0.04911085218191147,
        -0.013646744191646576,
        -0.06158626079559326,
        0.041971173137426376,
        0.10864085704088211,
        0.07107433676719666,
        -0.04290656000375748,
        0.09491448849439621,
        -0.012051772326231003,
        0.00026733067352324724,
        -0.002757677575573325,
        0.024801772087812424,
        0.10522197186946869,
        -0.02146502397954464,
        -0.017475785687565804,
        0.02125759981572628,
        0.006234690081328154,
        -0.05201735720038414,
        -0.005095142405480146,
        -0.006585415918380022,
        -0.024709608405828476,
        -0.041448116302490234,
        0.015422949567437172,
        0.035290803760290146,
        -0.05419085547327995,
        -0.09106216579675674,
        0.01935414783656597,
        -0.05076440051198006,
        0.05836223065853119,
        -0.04655085504055023,
        0.016532305628061295,
        1.803501982067246e-05,
        0.03343600034713745,
        -0.06203002855181694,
        -0.06872421503067017,
        -0.034661103039979935,
        -0.02199162356555462,
        0.03530874103307724,
        -0.0013666650047525764,
        0.05796639993786812,
        -0.025128139182925224,
        0.045047566294670105,
        -0.04830683767795563,
        -0.03677630424499512,
        -0.10646067559719086,
        0.006241212133318186,
        0.07721343636512756,
        0.057149797677993774,
        -0.03139198198914528,
        -0.030081115663051605,
        -0.014000722207129002,
        -0.008871706202626228,
        0.018676284700632095,
        0.033359721302986145,
        -0.032317761331796646,
        0.047833334654569626,
        0.006639175582677126,
        -0.03220204636454582,
        -0.08595547080039978,
        -0.05972738936543465,
        0.04826229065656662,
        -0.03516082838177681,
        0.04533581808209419,
        0.023921804502606392,
        0.07639798521995544,
        0.10268877446651459,
        -5.242306855279821e-08,
        -0.03051096200942993,
        -0.03750911355018616,
        0.04256289824843407,
        -0.0262190792709589,
        -0.02142096310853958,
        -0.1344936043024063,
        0.06918715685606003,
        -0.04063350334763527,
        0.07120176404714584,
        0.0039449939504265785,
        0.026172976940870285,
        -0.10317221283912659,
        -0.06047254428267479,
        0.0198191087692976,
        0.035752758383750916,
        0.014294826425611973,
        0.06685282289981842,
        -0.007326439023017883,
        -0.05833083763718605,
        0.007725501898676157,
        0.005899541079998016,
        -0.024252017959952354,
        0.09112169593572617,
        -0.07118918001651764,
        -0.03522377461194992,
        0.04329536110162735,
        0.05122866854071617,
        0.007579641882330179,
        0.04442557319998741,
        -0.08644218742847443,
        -0.08547511696815491,
        0.035669080913066864,
        0.02582048438489437,
        0.08444970101118088,
        0.060049522668123245,
        -0.04048281908035278,
        -0.017755750566720963,
        0.05309766158461571,
        0.04236520081758499,
        0.13048043847084045,
        0.0027494728565216064,
        -0.05449538677930832,
        -0.08589985966682434,
        0.013356783427298069,
        0.05592598393559456,
        -0.06617215275764465,
        0.028305374085903168,
        -0.05008859559893608,
        -0.048868440091609955,
        0.025011716410517693,
        -0.007181032095104456,
        -0.04602288827300072,
        0.009992113336920738,
        -0.029371242970228195,
        -0.019399035722017288,
        -0.020630979910492897,
        0.03733326494693756,
        0.07082145661115646,
        -0.053613774478435516,
        0.10923798382282257,
        0.07482469826936722,
        -0.04866848513484001,
        0.033301353454589844,
        0.11766587197780609
    ]
}