{
    "id": "01nmrE3ZpGY",
    "title": "I Didn't Think I Would Like THIS! - HP ENVY All-in-One",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-05-16T17:17:56Z",
    "video_url": "https://www.youtube.com/watch?v=01nmrE3ZpGY",
    "category": "Science & Technology",
    "tags": [
        "HP",
        "Envy",
        "All-In-One",
        "All In One",
        "AIO",
        "NVIDIA",
        "3060",
        "GPU",
        "Intel",
        "11th Gen",
        "11700",
        "Laptop Performance",
        "5K",
        "Display",
        "Sound",
        "B&O",
        "Gaming",
        "I didn't think I would like this",
        "I didn't think I'd like this",
        "I didn't expect to like this"
    ],
    "views": 877923,
    "likes": 36111,
    "comments_count": 2710,
    "description": "Thanks to MANSCAPED for sponsoring today's video! Visit  to learn more, get 20% OFF with code CIRCUIT, and make a donation at checkout.  Apple always dominates all-in-one computers, but other brands have excellent offerings if you don't like the macOS ecosystem. For example, this HP Envy line has some impressive features, but it feels slightly a last year device, even though it's releasing this year. Nevertheless, it can still give remarkable performance.   Buy an HP ENVY All-in-One:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 - I'm in trouble 0:20 - Unboxing 1:15 - Exterior first impressions 2:35 - What's behind the panel? 3:54 - Stand impressions 4:05 - Apple rant 5:05 - Is it a peel? 6:00 - Sponsor - MANSCAPED! 6:33 - Powering it on 7:18 - Connecting the webcam 8:01 - Display specs 9:05 - More specs 10:00 - Display impressions 10:25 - Speaker impressions 11:27 - Webcam impressions 12:40 - Gaming impressions 13:31 - Final thoughts",
    "description_links": [
        "https://MANSCAPED.com/TCS",
        "https://lmg.gg/J5bVA",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Why are we doing this? I am coming for you. Jono, what is this? - [Jono] It's a computer. (Anthony sighing) - Yeah, this box is like... There's holes in it. What happened to you? In order to get into a package with a screw, first, you just give it a poke. Power cord webcam, okay. Cable management clip, keyboard, and mouse. This feels, this weighs nothing. Is there anything in here? So there's the power cable. That feels like it was half the weight. So this box lied. We're supposed to have a keyboard and a mouse in here. Oh, some items may be in separate packaging. Okay. This actually feels like a hefty keyboard. Oh, nevermind. (Jono laughing) Wow, that's substantial for such a slim keyboard. They actually, yeah, they don't feel bad. Like, I don't like this style of keys for a desktop keyboard anyway but for what it is, it's not bad. Plus, you've got brightness controls and stuff basically like Apple. - [Jono] It looks nicer than the Apple Magic Keyboard. - It looks nicer than the Apple Magic Keyboard? - [Jono] Yeah. - [Anthony] You think that this looks nicer than like aluminum? - Yes. - [Anthony] You think it, okay. I'm just gonna grab it. Looks pretty nice, but I think the only reason it looks glossy is because I'm pretty sure there's a peel under here. How about the back? Okay, so we've got actually a fairly substantial amount of IO here. We've got, there's our power. Jono clarified that this is, in fact, gigabit, ethernet, which makes sense. This should be HDMI 2.1 because I see here there's a little sticker for GeForce RTX graphics along with I believe that's 12th Gen core. Let's see. No? - [Jono] It's 11th Gen. - 11th Gen. Well, what are we doing reviewing this thing, Jono? - [Jono] 'Cause it looks cool. - [David] We're also not reviewing, Anthony. - Oh right, we're unboxing it. Why are we unboxing last year's tech? - [Jono] 'Cause it's cool. - [Anthony] So we got three super speed USB ports. Those are not colored correctly, but nobody cares anymore, apparently. Two Thunderbolt ports. That's pretty sweet. Have a Thunderbolt dock if your onboard graphics aren't enough. Plus we have a, I guess that's a headset jack. There's more. Look at this. There's actually IO on the stand. We got two more USB ports, another type C port. Not sure, I can't see from here if that's Thunderbolt or not, and also what looks like an SD card reader. That's really cool. I can't help but notice that there's another little thing down here. Now, normally what this kind of thing conceals is more IO. So maybe there's actually even more than we've already seen. So I'm just gonna grab this and pull it off. That was entirely tool less. It's actually magnetic a little bit I think. Yeah, it's magnetic. It stays up like that, and then you just clip it in on either side. It's gonna make a liar out of me now. Yeah, just go ahead and yank on this. - Give it a yank? - Yeah, just give it a yank. - Oh wow, it's really easy. - [Anthony] Yeah. - Only 16 gigabytes? - [Anthony] 16? Jono, I told you, this is last year's tech. Why are we unboxing last year's tech? We need 32 gigs at minimum, and we need 12th Gen core at minimum, and we also need all Thunderbolt four ports, every one of the USB type A ports needs to be 10 gigabits per second, and we need to get 10 gigabit ethernet as well on here. And if that HDMI port isn't 2.1 compliant, I am coming for you. - [Jono] I didn't order this! Actually, he ordered it. - [Anthony] Really? - Yeah, I did order it. - [Anthony] Why? - It looked cool. - It's just too bad the specs are bad. - [Jono] Hey, at least you can upgrade the RAM. - Yeah, you can upgrade the RAM. There are two NVMe ports on there, I think, or maybe one is NVMe and one is set. I'll have to take a look and see. I mean, it doesn't tilt or anything, but it does go up and down. It doesn't really do side to side. Apple could take notes like this one right here. Yeah, and in fact, Apple used to be pretty easy. There was a button you pushed. It opened a door. Apple, why can't you do this anymore? Why are we doing this? (sentimental music) Apple used to care. Oh yeah, the power cord. It came in a whole separate box, the power cord. Like, it wasn't attached to the back of the monitor. I didn't have to like check whether or not I was sane looking at the back of the monitor. Like, what is that on the back of the monitor? Could that possibly be a power cable? Where is the power cable? Oh, it is in fact on the back of the monitor. Why? I don't know. Hey, let's try taking it off. You can't? Oh, watch this. There you go. Watch that. Yeah. Yeah. And you know what? If I- oh, there's actually a little tab here, and I'm not sure why. 'Cause it's gonna have to come this way, right? Wait, what? It's not a full peel. Is this just glossy? It's really glossy. It needs a wipe. Oh, I didn't even notice this. Is that a wireless charging dock? How useful. So you just throw your phone there, which you're probably gonna do anyway, let's be honest, and it'll charge. Oh, there's no way I can make this thing look good. Like even if, like, just looking at it, every time I look at it, there's another streak, and it's like, where are these coming from? I don't understand. I have yet to see a power button. Maybe that's where the key- Like, maybe it's the keyboard that does that? - [David] Computer, on. - Can you see where, how we can turn this on? - Ooh, I love a challenge. - Well, if I can't turn this on, I guess I'm screwed. (Anthony laughing) And first, I need to talk to you about our sponsor, Manscaped, anyway,. Thanks to Manscaped for sponsoring today's video. Manscaped is partnered with the Testicular Cancer Society to help you take care down there. This year, for a limited time, get their new special edition TCS Lawnmower 4.0 electric and waterproof trimmer. With its launch, Manscaped will be donating $50,000 to the Testicular Cancer Society to help those impacted by testicular cancer. Head to Manscaped.com/tcs, and as always, use code Circuit to get a 20% off your first order and free shipping. - [Jonathan] How could there not be an obvious power button? This is insane. - Maybe, okay. Maybe there's something under, like on other underside of it, like if we, - [David] No. - [Anthony] If we tip it over. - Well, let's see. You know what? We're getting desperate, so no. - It took me a while to find it as well. - No, I touched there. I don't feel anything there. - [Jonathan] It's the tiniest button ever. - They could have it pulse light or something so you'd know. The dongle does appear to be built in, so I don't need these. Okay. So what is this? - It's mad at you. It doesn't like your phone. - Clearly. Yeah, okay. So I guess it doesn't wanna charge my phone. Why? - Here, let me try my phone. It's smaller. - Oh, and the webcam, right. How could I forget the webcam? - [Jonathan] Oh, what? - Yeah, that's a thing. Now, why are you on boxing things? - Because I don't really get this privilege being kind of stuck in my corner full of Apple products. (sentimental music) - It's probably at least partially magnetic, isn't it? - Yeah, it is magnetic. - [Anthony] Yeah. - Oh, you do that. Tell me what you think. I like a chonky webcam. There's something substantial about it. - I would prefer a chonky webcam that looks good. to a slimmed webcam that doesn't. - Yes. - Also, here's something we can do about that. - [Jonathan] Hey, hold on (indistinct). - [Anthony] Just goes right into these holes, and once it's all the way in, it is held together with those magnets. Yeah, this is a 4k ultra wide is what this is. It's 2160P tall, 5120 pixels wide. Let's see, is it HDR compliant? It doesn't look like it is. God, why would you maximize a window across an ultra wide like this? - [Jono] So they call this a 5k panel. - Not true. - [Jono] 500 nits, 60 hertz refresh rate with an anti-glare coating. - This is anti-glare? They definitely failed on the anti-glare. I don't really see any effort put into anti-glare here. - No? - Like, I don't really see any like frosting or anything like that. In some cases, if you've got a lot of ambient light but not a lot of direct light, a glossy screen can be more readable than a matte screen. But if you do have direct light, like a window or a studio lighting coming in at you, then you're gonna see shadows and all sorts of other stuff. - [Jono] Get outta here. - What was this used for? - [Jono] Get outta here. You're adding nothing. - Welcome to today's episode of \"Pack Address,\" where we talk about Hewlett Packard devices. So this, okay, straightaway, laptop GPU. So they definitely do not have a desktop class GPU in here. The CPU, yes. That checks out. I mean the display, in this lighting, it's difficult to tell, but it looks pretty good to me. So far, from what I've heard of the little Windows chimes, the speakers are rather nice. They are by Bang & Olufsen. I see we've got McAfee Live Safe pre-installed. What else do we have here? Adobe offers, myHP. Okay, so myHP is probably fine. Dropbox promotion. Why? Anyway, they got Duet Display, which is interesting, which means you could use Duet Display to use a tablet or some other machine to extend your display, your desktop onto. This mouse is actually a problem. Like, I'm sitting here trying to set up OBS so I can screen record for you guys, and like, the tracking sensitivity is not good enough. Basically, I went down to hit apply or okay, and I hit cancel just because like the tracking is so weird. Yeah, it's really good. I don't think it has local dimming, but the contrast ratio and the brightness is actually pretty good. It gives a fake effect of HDR, just looking at it like this as a result of that. Because it has that 500 nit peak brightness, it's the same as the Apple Studio Display. So it looks really good, but it doesn't have that HDR tone mapping, you know? Just as Alex walks in. - Oh wow. - It doesn't get as loud as I thought it would, but the top end is pretty sharp. (upbeat music) - Okay. - It's not terrible. High is really good. Mid is really good. Like the bass, it's good, but it's like, it doesn't go too far down, like, you know? - Yeah, I know. - It doesn't have- - It's not rumbling your butt. - Yeah, well, they got the, oh, they got a Bang & Olufsen sound control. No, the bass is cranked. - Huh? - A little bit. It's at 69%. Nice. So what if we were to turn all of this off? What does it sound like now? (upbeat music) (both men groaning) - [Man] My god. (Anthony laughing) - The stock setting is actually pretty good. - Oh, nice, they do have it, the display control. That's what I wanted. What I really like is that you can do the auto color 'cause then you can go from like Lightroom to your websites and stuff, and it'll automatically switch like SRGB and Adobe RGB. - All right, let us try out that webcam. Okay. Oh, hey, it's got facial recognition. It knows when people are in frame. It looks like it's doing auto focus a lot, which is kind of weird. And there's Jono. Oh, I can set the auto focus set where it should be. Oh, I see. So it actually has like kind of a built in ring light. That's interesting. I'm not sure how actually useful it is, but I guess it's better than nothing. What do we have here? Oh, okay. So I can adjust the aperture of it. I can adjust the temperature of it. So that's warm, and that's cool. That actually does make a difference. - [Jono] What if we put it on here? - It auto rotated. - [Jono] What? Whoa. - Is that built into Windows? Yeah, you can just have, you can straight up just have it down there. In fact, there's a reason why it's a little bit halo-y, and we forgot to do a peel. You're gonna get to see a peel from the other side. You are the peel this time. Oh, here it comes. - [Jono] Whoa, it's so much sharper. - I thought it was just a bad webcam. So yeah, I guess we are hearing presumably the microphone array that is built into this display, and wow, that actually, yeah, that looks really good. Let us play some games. Yeah, It's hovering around 60 FPS. I'm wondering if we have VSync on. It doesn't seem to be when I'm in the menu. VSync is off. Okay, so it only does about 60 FPS max at these settings, which is 1440P wide, ultra quality. This thing's got a really, really quiet little fan in it. This thing is clearly struggling right now because the CPU is gonna be hit pretty hard in a game like \"Doom,\" and the GPU is obviously struggling because it's got a whole bunch of stuff going on right now. But if I mute the audio while the game is running, I don't hear anything, like. - [Jono] I think I hear our server in the back. - Ooh, it is pumping out a lot of heat up here. I have to say, despite the fact that I went into this like kind of crapping on the specs, it's really good overall. Like, it's a good, all-arounder. Long story short, It's got a good display. It's not the best display, but it's a good display. It's got a good webcam. It's not the best webcam, but it's actually pretty strong. It's got good speakers if only because it has the good software. Okay, well this is not so good, but it works sometimes. It's got pretty good IO, and I don't have any major complaints to be honest, aside from all the complaints that I've been doing. I've been complaining this whole time about like bloatware and stuff. - [Jono] Would you buy this, or should you wait until this has the 12th Gen? - I would say, wait for the 12th Gen model. That being said, if you get this on special in the meantime because the 12th Gen model is gonna come, then sure. Like, this is the kind of computer that I would buy for my grandparents, for somebody who doesn't, you know need to upgrade their computer super much. Like maybe they just need to upgrade the RAM later on, or they need to have more storage, then yeah. This is actually super easy to get into. And so for somebody who's not technically minded, you could walk them through doing that very easily. I came into this kind of not being impressed with the specs and not being impressed with, you know some other aspects of it, but it's actually really good overall. I like it, and I like you and the fact that you like Short Circuit, so get subscribed, and I don't know, maybe comment down below on some other machines or otherwise that we should take a look at.",
    "transcript_keywords": [
        "Yeah",
        "good",
        "Apple Magic Keyboard",
        "Apple",
        "display",
        "pretty good",
        "pretty",
        "keyboard",
        "webcam",
        "Power",
        "good display",
        "thing",
        "Apple Magic",
        "Gen",
        "kind",
        "ports",
        "Magic Keyboard",
        "Jono",
        "back",
        "Thunderbolt"
    ],
    "transcript_entity_values": [
        "half",
        "Dropbox",
        "FPS",
        "32",
        "GeForce",
        "Thunderbolt",
        "5120",
        "last year's",
        "three",
        "RAM",
        "webcam",
        "4k",
        "Thunderbolt",
        "20%",
        "USB",
        "This year",
        "60",
        "Doom",
        "Lightroom",
        "Manscaped",
        "1440P",
        "2160P",
        "Adobe",
        "OBS",
        "Alex",
        "Pack Address",
        "Hewlett Packard",
        "Only 16 gigabytes",
        "IO",
        "Adobe RGB",
        "max",
        "10 gigabits",
        "11th",
        "Jono",
        "5k",
        "10",
        "first",
        "Anthony",
        "TCS Lawnmower 4.0",
        "HDMI",
        "Bang & Olufsen",
        "VSync",
        "two",
        "about 60",
        "the Apple Studio Display",
        "69%",
        "four",
        "60 FPS",
        "GPU",
        "500",
        "12th",
        "Manscaped",
        "50,000",
        "Short Circuit",
        "Two",
        "12th Gen",
        "hertz",
        "SD",
        "CPU",
        "2.1",
        "jack",
        "Duet Display",
        "the Testicular Cancer Society",
        "SRGB",
        "Apple",
        "today",
        "Jonathan",
        "McAfee Live Safe"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "GPE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "CARDINAL",
        "LOC",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.045413076877593994,
        -0.06045271456241608,
        0.024468407034873962,
        -0.11925924569368362,
        0.11698824912309647,
        0.050160963088274,
        -0.02853335067629814,
        0.007346271071583033,
        -0.02450466714799404,
        -0.00559983542189002,
        0.011620672419667244,
        0.0444936640560627,
        0.013811065815389156,
        -0.03800734132528305,
        0.011880847625434399,
        -0.01999753899872303,
        0.05253226310014725,
        -0.05633131042122841,
        0.007556581404060125,
        -0.022991355508565903,
        -0.017981909215450287,
        -0.12866249680519104,
        -0.005388197023421526,
        0.06408271193504333,
        0.01856943964958191,
        0.013233314268290997,
        0.024363793432712555,
        -0.014729836024343967,
        -0.053877975791692734,
        -0.04770127683877945,
        0.005475624930113554,
        -0.043104156851768494,
        0.0076914457604289055,
        0.018252912908792496,
        0.04471195489168167,
        -0.09570979326963425,
        -0.03409622982144356,
        -0.06576250493526459,
        -0.09635753184556961,
        -0.12401362508535385,
        -0.01911970227956772,
        -0.034839943051338196,
        -0.01538731437176466,
        0.017029089853167534,
        -0.03180922940373421,
        -0.03694518655538559,
        0.0010291566140949726,
        -0.027713628485798836,
        0.03510710969567299,
        0.04099719226360321,
        0.0012948301155120134,
        -0.07939493656158447,
        0.0022619690280407667,
        -0.04394851624965668,
        -0.035755306482315063,
        0.06058609485626221,
        0.01811615750193596,
        -0.028563203290104866,
        0.019309453666210175,
        -0.012418614700436592,
        0.041792698204517365,
        -0.13357624411582947,
        -0.006172931287437677,
        0.08186110854148865,
        -0.0011566801695153117,
        -0.018175190314650536,
        0.07710324972867966,
        0.1284847855567932,
        -0.08370650559663773,
        0.00241821794770658,
        0.003558399621397257,
        0.012968779541552067,
        0.11339601129293442,
        0.06718053668737411,
        0.011709833517670631,
        -0.016175711527466774,
        0.011000671423971653,
        -0.07510784268379211,
        0.014992110431194305,
        0.04059163108468056,
        -0.017291944473981857,
        -0.0033877401147037745,
        -0.041655439883470535,
        0.005098479799926281,
        -0.0003810119815170765,
        -0.045172568410634995,
        0.0018224164377897978,
        -0.030092710629105568,
        -0.033988937735557556,
        -0.050703633576631546,
        -0.09370862692594528,
        0.10949665307998657,
        0.05117307975888252,
        -0.06629592180252075,
        -0.02537412755191326,
        -0.018243661150336266,
        0.004314148798584938,
        -0.05911608040332794,
        -0.04701527580618858,
        0.029177973046898842,
        0.01136801764369011,
        0.06555390357971191,
        0.06776078045368195,
        -0.11084229499101639,
        0.012389511801302433,
        -0.08635403215885162,
        -0.015554764308035374,
        0.05623845010995865,
        0.029921913519501686,
        0.039130546152591705,
        -0.06785662472248077,
        0.05073535442352295,
        -0.05548691749572754,
        -0.04249761998653412,
        0.040223218500614166,
        0.0434270016849041,
        -0.022642826661467552,
        0.030323250219225883,
        0.05769055336713791,
        -0.01513358298689127,
        0.024258600547909737,
        -0.03318244218826294,
        0.011869078502058983,
        0.005190278869122267,
        -0.023267529904842377,
        0.02595958486199379,
        -0.031036902219057083,
        4.8017577718907614e-33,
        -0.02350107580423355,
        0.0018228397238999605,
        -0.05689501762390137,
        -0.042787935584783554,
        0.023418065160512924,
        -0.004863538313657045,
        0.05041816830635071,
        0.01083058025687933,
        -0.09744572639465332,
        0.003578408621251583,
        -0.0014913389459252357,
        0.005217696074396372,
        -0.065920889377594,
        0.059090811759233475,
        0.040394801646471024,
        -0.04793667793273926,
        -0.041026607155799866,
        0.06736620515584946,
        0.010042907670140266,
        -0.008974097669124603,
        0.005135609768331051,
        -0.02804080955684185,
        -0.013702426105737686,
        -0.05512157455086708,
        -0.017660189419984818,
        -0.061392899602651596,
        -0.028963377699255943,
        -0.06726280599832535,
        0.08997097611427307,
        0.01303929928690195,
        -0.020715540274977684,
        -0.03990158066153526,
        0.016292661428451538,
        -0.07518929243087769,
        -0.0423087514936924,
        -0.008319931104779243,
        -0.10272572934627533,
        -0.049560219049453735,
        0.1002143919467926,
        0.03238392993807793,
        -0.011788706295192242,
        -0.001196142751723528,
        0.0018682648660615087,
        -0.150765523314476,
        0.014313573949038982,
        0.007711694575846195,
        0.03001919947564602,
        0.02839078940451145,
        -0.018318189308047295,
        0.002013616031035781,
        0.016064224764704704,
        -0.04653606563806534,
        0.014194721356034279,
        -0.09626255184412003,
        -0.026460709050297737,
        -0.039567530155181885,
        0.0540427640080452,
        -0.011327078565955162,
        0.14510883390903473,
        0.04452123865485191,
        -0.010255977511405945,
        0.024241916835308075,
        0.04577267915010452,
        -0.07278449833393097,
        -0.10739762336015701,
        0.008619064465165138,
        0.05135522037744522,
        -0.0538407601416111,
        -0.08640418201684952,
        0.06038181856274605,
        -0.014930469915270805,
        0.02795163355767727,
        -0.05762092024087906,
        -0.14165419340133667,
        0.02918718010187149,
        0.04375670477747917,
        -0.07819981127977371,
        -0.014893974177539349,
        -0.037251126021146774,
        0.04006016254425049,
        -0.024495810270309448,
        -0.015170836821198463,
        0.028195202350616455,
        0.040247831493616104,
        0.09012322127819061,
        0.024596624076366425,
        0.020563730970025063,
        -0.06471394747495651,
        -0.12194301187992096,
        0.01493267621845007,
        0.0009852905059233308,
        0.040931593626737595,
        0.006648906506597996,
        -0.004596966318786144,
        0.020685195922851562,
        -6.072315820231986e-33,
        0.06296650320291519,
        -0.0012454946991056204,
        0.08448798209428787,
        0.03067559376358986,
        0.06641369313001633,
        0.03957415744662285,
        0.017881685867905617,
        0.03791365399956703,
        0.018741553649306297,
        -0.02966393530368805,
        -0.024831561371684074,
        -0.026366179808974266,
        -0.0867382287979126,
        -0.021512551233172417,
        -0.01495063491165638,
        -0.0246150903403759,
        0.022524002939462662,
        -0.07708773761987686,
        0.0029379744082689285,
        -0.049069054424762726,
        0.05146247521042824,
        0.061657845973968506,
        0.05779532343149185,
        0.019747231155633926,
        0.013472224585711956,
        -0.04356727749109268,
        -0.038606464862823486,
        0.06466040760278702,
        0.04815077781677246,
        0.014709643088281155,
        0.03703373298048973,
        -0.05513214319944382,
        -0.019435597583651543,
        0.015973446890711784,
        0.10577144473791122,
        0.048980891704559326,
        0.047311559319496155,
        0.10523335635662079,
        -0.005173299461603165,
        0.039498716592788696,
        0.03439510241150856,
        -0.005991951562464237,
        -0.039060160517692566,
        -0.008510708808898926,
        0.06193689629435539,
        0.016148746013641357,
        -0.06877388060092926,
        -0.05627179518342018,
        -0.01801951788365841,
        -0.02055767923593521,
        -0.03976810723543167,
        -0.0016174407210201025,
        0.029134292155504227,
        0.0405593141913414,
        -0.02928726002573967,
        -0.02476217783987522,
        -0.07676521688699722,
        0.07794257998466492,
        0.031845033168792725,
        -0.04949125275015831,
        0.007126389537006617,
        -0.025413837283849716,
        -0.06657380610704422,
        -0.007479404099285603,
        -0.025569714605808258,
        -0.04222707077860832,
        0.04165373742580414,
        -0.018100524321198463,
        -0.11730808764696121,
        -0.01240452192723751,
        -0.013357949443161488,
        0.029206959530711174,
        -0.03032403439283371,
        -0.08722034096717834,
        -0.020679563283920288,
        0.04911239817738533,
        0.039364900439977646,
        -0.028274698182940483,
        0.02493441291153431,
        0.01608487032353878,
        -0.06555742025375366,
        0.0365782231092453,
        0.05420687422156334,
        -0.02428807131946087,
        0.06692434102296829,
        0.05983639508485794,
        0.0859559178352356,
        -0.006970077287405729,
        -0.03698577731847763,
        0.010771352797746658,
        -0.07533618807792664,
        0.047995131462812424,
        0.005982269998639822,
        -0.03427254036068916,
        0.03106430545449257,
        -6.684229703068922e-08,
        -0.04593044891953468,
        -0.015164070762693882,
        0.06471968442201614,
        0.06160397827625275,
        -0.019863124936819077,
        -0.0842830240726471,
        0.03877473995089531,
        0.023136867210268974,
        0.1309574395418167,
        -0.01019552443176508,
        0.04901653528213501,
        -0.08155043423175812,
        -0.05931538715958595,
        0.018163684755563736,
        -0.0017705296631902456,
        0.043498244136571884,
        -0.013754326850175858,
        0.10444262623786926,
        -0.0022963478695601225,
        0.04731952026486397,
        -0.005111460108309984,
        0.03815601393580437,
        0.07807343453168869,
        -0.028425531461834908,
        -0.02496521919965744,
        0.04759896919131279,
        0.0945456400513649,
        -0.04776695370674133,
        0.12681375443935394,
        -0.034709591418504715,
        -0.03077676333487034,
        -0.057660557329654694,
        -0.003743791952729225,
        -0.039527878165245056,
        0.04713274538516998,
        -0.0942828357219696,
        -0.0438600592315197,
        0.09814825654029846,
        0.02486845664680004,
        0.04215453937649727,
        0.002371414564549923,
        -0.05104462802410126,
        -0.012899660505354404,
        -0.015159615315496922,
        0.05589943379163742,
        0.015569380484521389,
        0.007154358085244894,
        -0.05288486182689667,
        -0.03893880173563957,
        0.04242871701717377,
        0.0005220934981480241,
        -0.033167555928230286,
        0.030980434268712997,
        0.02409946918487549,
        0.057928550988435745,
        -0.049420006573200226,
        0.06356192380189896,
        0.030092954635620117,
        0.03300140053033829,
        0.09555716067552567,
        0.13461747765541077,
        -0.05325458571314812,
        -0.010347492061555386,
        0.09023142606019974
    ]
}