{
    "id": "03OZsmDV56k",
    "title": "iPad Killer or Clone?",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-05-26T20:50:13Z",
    "video_url": "https://www.youtube.com/watch?v=03OZsmDV56k",
    "category": "Science & Technology",
    "tags": [],
    "views": 3743268,
    "likes": 97594,
    "comments_count": 4446,
    "description": "OnePlus Pad  MKBHD Merch:   OnePlus Pad:   Tech I'm using right now:   Playlist of MKBHD Intro music:   Tablet provided by OnePlus for review.  ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://geni.us/HWpx",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(spring boings) (upbeat electronic music) (static crackles) - So OnePlus made a tablet. And I made a quick short explaining it, and immediately there were a bunch of comments like, \"Oh, please, this is worth a full video. Please make a full video on this. Please elaborate on this.\" So now that's what I'm doing. So I really get to explain what they've done. See, tablets haven't really changed much over the past couple years. It feels like we've kind of settled, if you will, into this sort of hierarchy, where, especially in the US, iPads are so popular that it's basically just iPads and everything else. And I've even had conversations recently with some friends about this, which is just, like, they straight up won't switch from the iPad. Like, no matter how good of a competitor comes up, it can be amazing hardware, it can be the best screen, the best battery in the world, it's an amazing tablet, but it still wouldn't be an iPad, which is the iMessage and the FaceTime, and all the things that plug into the ecosystem of iPad and Apple world. So making an Android tablet that can actually take users from the iPad is clearly an uphill battle, but, hey, if you're gonna try, you might as well have some strategy to it. And so OnePlus has three. So strategy number one, copying the iPad. So look, just to be clear, I understand there is only so many ways to make a rectangular computer. There's only so many ways to make a tablet. And I actually don't mind when products copy each other, as long as they copy the good stuff. That being said, yeah, they've ripped some stuff straight from the iPad. Now, it does have its own unique hardware aesthetic. You gotta give 'em that. It's a different shape and a different color, and, of course, it's a different layout with a bunch of OnePlus and Android features that really suggest more holding it in landscape, unlike the iPads, which feel a bit more interchangeable. But they weren't shy about some things, like this pencil. This is the Apple Pencil, and this is the new OnePlus Pencil. Same shape, same size, same pressure sensitive tip, which is nice. Same single flat side, which prevents it from rolling away on a table, which is smart, but then same slapping it onto the side of a tablet with magnets and charging it via inductive wireless charging, so you don't lose it, it's convenient. It even has the same little animation to show you when you've paired it and how much battery percentage you have. There are probably other ways to do this, but, you know, the result is just a very familiar experience with a nice finely-controlled, pressure-sensitive pointing device for navigating around, and swiping, and even typing, and, of course, all the drawing and note-taking you could possibly want. They've also made a magnetic keyboard accessory with a track pad that connects to the tablet with magnets and these pins, and turns it into a whole lappable Android 11-inch laptop alternative. It might not completely float the tablet above the keyboard, like the heavier, less lappable one from Apple, but it does use basically the exact same cursor mechanism as the iPad, where you can swipe around with this dark circle, and then it snaps onto different touch targets as you move near them. Again, a pretty great thing to copy. It's got quad speakers in the same four spots as the iPad Pro. It's even got this ultra wide camera at the front that has a software feature that can move around as you walk around and keep you in the center of the frame. It's not called Center Stage though, it's called Limelight. The point is, there's a ton of stuff here where if you're gonna take people away from the iPad, you gotta at least make them feel at home. So then strategy number two, undercutting the iPad. This one's pretty simple. The iPad line is already pretty expensive, so probably the most compelling thing you can do to get someone to consider an alternative is to be cheaper than the iPad. So iPad Air... I think that's a pretty good comp. iPad Air starts right now, with the newest one, at 599, and that's the 64 gig version. This tablet, as we mentioned, pretty fairly priced, 479, and that's 128 gig. So you can see it's a pretty good start, but you have to be careful, because in order to get to that price you have to trim just the right set of things that people hopefully don't notice too much. So this tablet is running a MediaTek Dimensity 9000 chip, which benchmarks similar to the Snapdragon 8+ Gen 1, which is about 50% beneath the more expensive flagship Snapdragon 8 Gen 2. Honestly, most of the time not noticeable, but if you are going to ask it some more demanding things, especially like gaming, then you will feel that this is not the highest end ship. There is also no fingerprint reader, which is fine, but there is also no extra infrared or depth sensors. It's just straight up facial recognition with the standard RGB selfie camera. And for some reason my face has to be really close to it to unlock. It's just picky enough to get slightly annoying sometimes. And then this display doesn't quite get as bright. It maxes out at 500 nits, so it limits your outdoor usability for sure. And then this keyboard case, which is optional, it's actually noticeably cheaper than Apple's too. It's actually 149, so it's literally half the price of the Magic Keyboard. But also it's not backlit. It doesn't float the tablet or anything. It's also less premium feeling material, so it's more in line with the Smart Folio case, which is still 179. But really the most interesting strategy, strategy number three, is one-upping the iPad. There are some things they've done with this tablet that are objectively better than any iPad. Okay? So here we go. First of all, this is an 11 and 1/2-inch display with a unique, slightly tall, seven-by-five aspect ratio, and slightly thinner bezels than the iPad. But you know what's straight up better than any iPad? Its 144 hertz refresh rate. Granted, that's only slightly higher than the 120 hertz iPad Pro, but for 479, I mean, you're more in line with the 60 hertz iPad Air. And I'm a sucker for a high refresh rate display. And I do notice the difference in a few key places, like scrolling around, browsing in Chrome, and drawing with a pen, but more on that in a second. The ultra wide front facing camera is on the landscape bezel. That's also better than almost every iPad, except for the newest cheap one. So anytime you're on a video call, you actually sit in the middle of the frame, not kind of awkwardly off to one side. It also is an objectively better battery than any iPad. This is a 9510 milliamp hour battery that's iPad Pro sized, and combined with the chip, has rock solid battery life, and very good standby time, and it charges much faster than any iPad. It's got 67-watt SuperVOOC charging, so most of the tablet using world is gonna be used to the iPad's kind of slow 30 watts of charging. This one can charge from zero to a hundred in an hour and a half with the charger that's included in the box. And then there's also this whole special features section in the settings where they've tucked these nice, clever little enhancements, mostly to do with the multitasking experience. So I'm not even gonna remind you of the disaster that is Stage Manager on the iPad, that's still kind of rough. But on the OnePlus Pad, you can do things like drag two fingers down from the middle of the screen to slice your app in half, and initiate split screen multitasking with apps that support it. And then there's three different window sizes that it supports, and you can switch those around. There's also a smart sidebar that kind of slides out from the top right where it's this hidden dock, so you can put your favorite apps in there, or some quick shortcuts to grab whatever you want, or just open up the list of all your apps again. So lots of good stuff in here, right? They've even got some little ecosystem stuff going on. Since OnePlus makes phones, you can do data sharing with another OnePlus phone super easily. There's a lot. But this is still an Android tablet, which means a lot of things. It means, of course, that there is no FaceTime, iMessage, all the ecosystem stuff that comes that Apple people like, obviously, but that also means the app situation is still not what you want it to be. Like, when I say, \"Apps that support it with multitasking,\" that's a pretty small list. Like, there's just very few good well-optimized Android tablet apps even today in 2023. It also means that the 144 hertz capable display is rarely actually refreshing at 144 hertz. It's often at 120 hertz, or even 60 hertz, depending on the app support again. And that sort of means you only really get the extra stuff when you're scrolling around the UI, or web browsing, or in the settings app basically, and not while gaming. It also means the cameras are meh. So you see the camera's sort of in this unique layout in the middle. It's a 13-megapixel camera on the back, but the photos it takes are pretty mid. Not that a tablet is, like, some photography machine. It's mostly for video calls, but even this is pretty grainy. It has this like splotching even in a well lit environment. Not great. And then for the, arguably, even more important selfie camera, it's mostly for video calls, and so it should look pretty decent. This is perfect lighting, and it even in these dark shadows, you can see some weird noise artifacts and splotching, and this over here. It's 1080p and it's fine. It's probably fine, but in Limelight Mode, when it's doing the ultra wide and hunting around, it looks worse than this too. And it also means that Android 14 is on the horizon, so that will probably improve a lot of the multitasking stuff we just saw. But this one's gonna launch with Android 13, so if you get one, it'll have Android 13, and never buy a product based on potential future software updates. So as of right now, it's an Android 13 tablet. So OnePlus has made a good tablet for a good price. I think a lot of people would consider this a bargain at 479 for the 128 gigs, but because of the state of tablets, it feels like they're up against some impossible task. Like, this is the same thing that happened to Samsung's Ultra tablet. Remember the video I made on the Ultra? The Galaxy Tab S8 Ultra tried something super, super high end, and, honestly, in the hardware and design department, they really beat the iPad in a lot of ways. They made an incredible piece, but same question, where is it now? I think the same place as this. Some people are gonna buy it, and they're gonna be pretty happy with it. And those people knew exactly what they were getting into. Man, it's a tough task, taking tablet buyers from the iPad. Thanks for watching. Catch you guys in the next one. Peace. (upbeat electronic music)",
    "transcript_keywords": [
        "iPad",
        "tablet",
        "Android tablet",
        "Android",
        "iPad Air",
        "iPad Pro",
        "pretty",
        "Android tablet apps",
        "good",
        "OnePlus",
        "things",
        "stuff",
        "Apple",
        "hertz iPad Air",
        "hertz iPad",
        "ultra",
        "hertz iPad Pro",
        "hertz",
        "iPads",
        "apps"
    ],
    "transcript_entity_values": [
        "the Apple Pencil",
        "599",
        "64",
        "seven-by-five",
        "1/2-inch",
        "today",
        "Limelight Mode",
        "Apple",
        "three",
        "479",
        "149",
        "iPad",
        "one",
        "9510",
        "four",
        "FaceTime",
        "iMessage",
        "11",
        "144",
        "iPad Pro",
        "13",
        "the Magic Keyboard",
        "128",
        "13-megapixel",
        "MediaTek Dimensity 9000",
        "Ultra",
        "UI",
        "Android",
        "a hundred",
        "OnePlus Pencil",
        "2023",
        "Android 11-inch",
        "179",
        "half",
        "Center Stage",
        "OnePlus",
        "67-watt",
        "First",
        "zero",
        "OnePlus",
        "14",
        "Limelight",
        "iPad Air",
        "RGB",
        "Samsung",
        "The Galaxy Tab S8 Ultra",
        "iPads",
        "30 watts",
        "second",
        "the iPad Pro",
        "US",
        "Chrome",
        "hertz",
        "the OnePlus Pad",
        "60",
        "milliamp hour",
        "Snapdragon 8",
        "500",
        "two",
        "a ton",
        "about 50%",
        "Android 13",
        "the past couple years",
        "iPad Air",
        "120",
        "iPads"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "PRODUCT",
        "GPE",
        "ORG",
        "ORG",
        "FAC",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT"
    ],
    "vector": [
        -0.07732012122869492,
        -0.1054302379488945,
        0.028441473841667175,
        -0.1253083199262619,
        0.03670203685760498,
        -0.013302369974553585,
        -0.005707106087356806,
        0.00421992689371109,
        0.07208538800477982,
        0.008038647472858429,
        0.06492774188518524,
        0.05389082804322243,
        -0.064703568816185,
        -0.08651487529277802,
        0.03426805138587952,
        -0.024819372221827507,
        0.052417557686567307,
        -0.04481638967990875,
        -0.06883415579795837,
        -0.0195512343198061,
        -0.028579451143741608,
        -0.025750674307346344,
        0.023382985964417458,
        -0.01843836158514023,
        0.029208309948444366,
        0.038407474756240845,
        -0.0067552924156188965,
        -0.001390534802339971,
        -0.019784538075327873,
        -0.017616817727684975,
        0.016035079956054688,
        0.06988901644945145,
        -0.03338848054409027,
        0.01209183968603611,
        -0.08849027007818222,
        -0.027105318382382393,
        -0.012072302401065826,
        -0.04126317426562309,
        -0.037596918642520905,
        -0.11846694350242615,
        -0.018812013790011406,
        -0.036598704755306244,
        -0.058497104793787,
        0.03468094393610954,
        -0.03543190285563469,
        0.027629835531115532,
        -0.0011729958932846785,
        -0.012069284915924072,
        0.008281785994768143,
        -0.03847115859389305,
        0.01393964421004057,
        -0.012632755562663078,
        -0.02803875505924225,
        -0.06313125789165497,
        -0.021432120352983475,
        -0.008357160724699497,
        0.06537934392690659,
        0.08567242324352264,
        0.08875934779644012,
        0.05727117508649826,
        0.023732949048280716,
        -0.003950735554099083,
        0.07197244465351105,
        0.06196768954396248,
        0.10746660828590393,
        -0.03441859409213066,
        0.02244272269308567,
        -0.015458245761692524,
        0.06423445791006088,
        -0.038114894181489944,
        -0.02273172326385975,
        -0.0017422193195670843,
        0.08150786906480789,
        0.08203866332769394,
        0.017530428245663643,
        -0.024162570014595985,
        -0.03781428560614586,
        0.06111883372068405,
        -0.01949777640402317,
        -0.01747877523303032,
        0.02712380513548851,
        0.016736581921577454,
        0.021277405321598053,
        -0.05705132335424423,
        -0.010040252469480038,
        -0.01608842797577381,
        -0.02605508826673031,
        0.027838492766022682,
        0.019968615844845772,
        -0.03856778144836426,
        -0.008168390952050686,
        0.09022819995880127,
        0.08264261484146118,
        0.026402803137898445,
        0.04190617799758911,
        0.017599957063794136,
        0.019646575674414635,
        -0.0340278185904026,
        -0.04656407609581947,
        0.0188299473375082,
        0.005555087700486183,
        0.09401549398899078,
        0.04162809997797012,
        0.01388635952025652,
        -0.029527530074119568,
        -0.1141178160905838,
        -0.006933693774044514,
        -0.05961621552705765,
        0.047120124101638794,
        0.02068079449236393,
        0.02658836357295513,
        -0.031663138419389725,
        -0.032696064561605453,
        0.007957808673381805,
        0.05840670317411423,
        -0.05609577149152756,
        -0.03887626901268959,
        0.10675355046987534,
        0.05496952682733536,
        0.020634332671761513,
        -0.04623584449291229,
        0.05989975109696388,
        0.0012792242923751473,
        -0.08228238672018051,
        -0.07015259563922882,
        0.05142119526863098,
        -0.06087525188922882,
        2.75064465863866e-33,
        0.01718389429152012,
        0.06341306120157242,
        -0.028360547497868538,
        0.04780192673206329,
        -0.007678752299398184,
        -0.13331793248653412,
        -0.035188451409339905,
        0.1278672069311142,
        0.029986027628183365,
        0.03981711342930794,
        0.04016758129000664,
        -0.062102168798446655,
        -0.0759412944316864,
        0.03479357808828354,
        0.032682422548532486,
        -0.05749783664941788,
        -0.05674232915043831,
        -0.054446905851364136,
        0.003265115898102522,
        -0.0368390716612339,
        -0.031113428995013237,
        0.008466389961540699,
        0.02192598395049572,
        0.003916243091225624,
        0.05411066859960556,
        -0.03536560386419296,
        -0.029048537835478783,
        -0.04488185793161392,
        0.07259269058704376,
        -0.006936768535524607,
        -0.1369464248418808,
        -0.04686832055449486,
        -0.0397985503077507,
        -0.10819980502128601,
        -0.05091466009616852,
        -0.008955762721598148,
        0.0012860961724072695,
        -0.08847814798355103,
        0.06847483664751053,
        -0.06642128527164459,
        -0.1049874871969223,
        -0.03704501688480377,
        -0.024346042424440384,
        -0.019142847508192062,
        0.04323307052254677,
        0.01651901751756668,
        0.026353877037763596,
        0.04101011902093887,
        0.00047702339361421764,
        -0.054566267877817154,
        -0.051039405167102814,
        -0.013744202442467213,
        0.015011124312877655,
        -0.0034331243950873613,
        -0.06853476911783218,
        -0.057747237384319305,
        0.0062720635905861855,
        -0.04339440539479256,
        0.1084405779838562,
        0.08399587124586105,
        0.06055153161287308,
        0.014052136801183224,
        -0.03551784157752991,
        0.03014533221721649,
        -0.06897881627082825,
        0.09213992208242416,
        0.07777553796768188,
        -0.030181773006916046,
        0.0134335458278656,
        -0.020614417269825935,
        -0.015704665333032608,
        -0.02038297802209854,
        -0.04943080246448517,
        -0.06401319801807404,
        -0.028734244406223297,
        -0.02130020782351494,
        -0.005022169090807438,
        -0.008223465643823147,
        -0.017093218863010406,
        -0.0700998455286026,
        -0.050016533583402634,
        0.05428967997431755,
        -0.05327800661325455,
        0.04751191660761833,
        -0.0810827985405922,
        0.03003002516925335,
        0.009751832112669945,
        -0.118010975420475,
        -0.03135986998677254,
        0.05694996193051338,
        -0.016677087172865868,
        0.02252715639770031,
        -0.007281197234988213,
        0.025194410234689713,
        0.08640338480472565,
        -3.73561561976364e-33,
        -0.02406138926744461,
        -0.06502415239810944,
        -0.054395128041505814,
        -0.03490443900227547,
        0.017033971846103668,
        -0.013216875493526459,
        0.012877518311142921,
        -0.01425841823220253,
        0.006833197548985481,
        -0.053253963589668274,
        -0.04548921808600426,
        0.0024258573539555073,
        -0.02993636019527912,
        -0.07286634296178818,
        -0.08914961665868759,
        0.013549501076340675,
        -0.016772383823990822,
        -0.008350284770131111,
        0.05728676915168762,
        -0.015301954001188278,
        0.044806938618421555,
        0.07549408078193665,
        0.06926008313894272,
        -0.01093363855034113,
        -0.02001059241592884,
        -0.0058959354646503925,
        -0.009348591789603233,
        0.03004433587193489,
        0.0712234228849411,
        0.02951849065721035,
        0.13952553272247314,
        -0.05561615154147148,
        -0.020330341532826424,
        0.00800705049186945,
        0.054422881454229355,
        0.05525101721286774,
        0.05556941032409668,
        -0.003881926881149411,
        -0.07040316611528397,
        -0.08740682154893875,
        0.054425109177827835,
        -0.003911335952579975,
        -0.04105706885457039,
        -0.04102371633052826,
        0.035465773195028305,
        -0.011056968942284584,
        -0.0172861497849226,
        0.0767507329583168,
        -0.00983916874974966,
        -0.06617369502782822,
        0.03536705672740936,
        0.059078436344861984,
        -0.04508945345878601,
        -0.0820610299706459,
        -0.030175266787409782,
        -0.029339736327528954,
        0.06782892346382141,
        -0.016050370410084724,
        -0.06311172991991043,
        -0.0014441279927268624,
        0.04482177644968033,
        0.0037103877402842045,
        0.02855226770043373,
        -0.044078756123781204,
        -0.04156215861439705,
        -0.00859915278851986,
        0.05701809003949165,
        0.04826928302645683,
        0.028601784259080887,
        0.04663720354437828,
        -0.032544855028390884,
        -0.018957339227199554,
        0.010296914726495743,
        -0.09769909828901291,
        -0.012282275594770908,
        0.07452613860368729,
        0.0669034793972969,
        -0.09496144205331802,
        -0.01484591793268919,
        -0.08813922107219696,
        0.005795673001557589,
        0.07199667394161224,
        0.00814034417271614,
        0.031606100499629974,
        0.026303336024284363,
        0.04976765066385269,
        0.09221027791500092,
        0.013211636804044247,
        -0.007901481352746487,
        0.04921521618962288,
        0.05688272416591644,
        -0.008918519131839275,
        -0.06757726520299911,
        0.06512950360774994,
        0.034439168870449066,
        -5.34780504324317e-08,
        -0.0022626605350524187,
        0.06797229498624802,
        0.06519439071416855,
        0.011946575716137886,
        -0.028685756027698517,
        -0.05519280582666397,
        0.07400461286306381,
        0.007001964375376701,
        0.06491146236658096,
        -0.029155420139431953,
        -0.05064128339290619,
        -0.07910943776369095,
        -0.039115846157073975,
        0.0654795691370964,
        0.03543268144130707,
        0.10051248222589493,
        -0.04607953131198883,
        0.08516323566436768,
        -0.047900572419166565,
        -0.051542527973651886,
        -0.025336775928735733,
        0.01327939797192812,
        0.028403474017977715,
        -0.10043751448392868,
        0.010051004588603973,
        0.014450150541961193,
        -0.01778901182115078,
        -0.01382505428045988,
        0.046818122267723083,
        0.03769395500421524,
        -0.06238832324743271,
        -0.07499608397483826,
        0.03197574242949486,
        0.009076529182493687,
        0.0817880779504776,
        -0.09823297709226608,
        -0.011600681580603123,
        0.013750658370554447,
        -0.002707141451537609,
        -0.019747640937566757,
        -0.04118069261312485,
        -0.0655134990811348,
        0.0032873989548534155,
        0.03550324589014053,
        -0.005016785580664873,
        0.01250645611435175,
        -0.02438495308160782,
        -0.01455320417881012,
        0.02273784950375557,
        0.12848322093486786,
        0.02008623443543911,
        -0.014234448783099651,
        0.05778859928250313,
        0.043605316430330276,
        0.07548467069864273,
        0.022470269352197647,
        -0.03437364101409912,
        0.08863008767366409,
        0.07368390262126923,
        0.06733717024326324,
        0.09965454041957855,
        -0.04531426727771759,
        0.06340016424655914,
        0.09721727669239044
    ]
}