{
    "id": "0EtgwIajVqs",
    "title": "Download These Handy Tools NOW! Essential USB Tools",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-07-19T17:08:33Z",
    "video_url": "https://www.youtube.com/watch?v=0EtgwIajVqs",
    "category": "Science & Technology",
    "tags": [
        "windows",
        "pc repair",
        "pc tools",
        "windows utilities",
        "software",
        "audio software",
        "equalizer apo",
        "voicemeeter",
        "wintoys",
        "wiztree",
        "ventoy",
        "medicat",
        "netboot.xyz",
        "bootable iso",
        "usb tools"
    ],
    "views": 2505438,
    "likes": 122388,
    "comments_count": 4520,
    "description": "Check out the Vessi Boardwalk and their other styles at  Use code LTT for 15% off your entire order and free shipping.  Reserve the next generation of Samsung Galaxy devices at   Keeping up with the latest and greatest utilities is an impossible task. We highlight a handful of our current favorites tools for everything from audio tweaks to wrestling with Windows settings - theres bound to be something here you didnt know you needed!  Discuss on the forum:   Get Equalizer APO here:      Extensions:         Get Peace EQ here:          Get HeSuVi here:  Visit Auto EQ Headphone Database here:  Get VoiceMeeter here:  Get Chocolately here:  Get WizTree here:  Get WinToys here:  Get Ventoy here:  Get NetBoot.xyz here:  Get Simple HTTP Server here:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:03 Audio Tools 3:36 Windows Utilities 6:19 Bootable Tools 10:54 Outro",
    "description_links": [
        "https://lmg.gg/galaxyunpacked",
        "https://linustechtips.com/topic/1520556-download-these-handy-tools-now/",
        "https://sourceforge.net/projects/equalizerapo/",
        "https://sourceforge.net/projects/peace-equalizer-apo-extension/",
        "https://sourceforge.net/projects/hesuvi/",
        "https://autoeq.app/",
        "https://vb-audio.com/Voicemeeter/index.htm",
        "https://community.chocolatey.org/",
        "https://diskanalyzer.com/",
        "https://apps.microsoft.com/store/detail/wintoys/9P8LTPGCBZXD",
        "https://www.ventoy.net/en/index.html",
        "https://netboot.xyz/",
        "https://github.com/TheWaWaR/simple-http-server",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "Like me, many of you probably carry around a USB stick that's filled to the brim with your favorite utilities. You know, just in case. But technology changes, newer, better tools come along and sometimes the older ones aren't as effective or even stop working altogether. And realistically, who's got the time to keep up with all the latest cool side projects from development with kids who haven't discovered girls yet? Have no fear, because we've got you covered with some improvements to tools you might already know about, some awesome utilities that you might not know about, and a sneaky solution to a problem that pops up at the worst of times. We've also got this completely unexpected segue to our sponsor, Samsung. Samsung's Galaxy Unpacked event is not very far, far away and you can reserve the next generation of Galaxy devices all with no deposit or space credits required. Thank goodness. Check it out at the link below and get a $50 credit. You probably spend a ton of time at your PC wearing headphones. So what if there was something you could do to improve your audio quality regardless of how much you spent on them? Equalizer APO does exactly that, adding powerful graphic and parametric equalization to your Windows PC. You can tweak the EQ curve system-wide for a more personalized listening experience or per device to boost key frequencies so you catch those footsteps sneaking up behind you before it's too late. It's even customizable with add-ons that can enhance it with power functionality like audio device routing, surround virtualization, and even recommended EQ curves for some of the most popular headphones. By the way, if yours were overlooked, you can check out autoeq.app, a database of even more downloadable EQ curves. We're gonna have links to every tool we talk about today in the description below. The only downside, you might have to come back to this video and click that link again if a Windows update messes with the sound subsystem and borks your custom setup. Now, if tweaking frequencies isn't your thing and you just want a way to route your audio so that your stream viewers don't hear your Discord buddies inventing new cuss words, then VoiceMeeter is the tool for you. I can't believe we've never talked about this thing because VoiceMeeter is amazing. It's a virtual audio mixer that comes in three sizes, each giving you more virtual channels and control over more hardware than the last. We installed the middle of the road banana version for our demo of what VoiceMeeter might look like configured for a two player streaming session. We've got audio coming in from our capture card and our two headset mics. Then using these various A and B buttons on each input channel, we can control where that input audio goes. The A outputs are hardware and we've set those up to be each of our headphones and the system speakers and the B outputs are virtual. So we've got those routing to Discord and to OBS for streaming. Once it's all set up, both players can hear themselves, the game and the Discord audio and the stream viewers hear only the player mics and the game audio. Oh, side note by the way, VoiceMeeter also happens to be just about the best and fastest way to clone your audio output to multiple devices. I had a bug a while back where my VR audio mirroring wasn't working which made it impossible to play one of my kids' favorite party games and VoiceMeeter took care of this for me in about three minutes. Let's get away from audio for a bit though. I'd wager that most of you are familiar with Ninite which lets you install and update popular software without all the next, next, next finish. Well, if you've ever been disappointed with the selection of applications that are available in Ninite, then Chocolaty might be for you. Chocolaty is a command line package manager for Windows that has more than 10,000 unique packages available. If you've ever used apt or yum to manage software on Linux, you're gonna know exactly what I'm talking about. And if you haven't, let me demonstrate why you do care about this. On our system here, we've already got Chocolaty installed. So we just go to a prompt and type in choco install paint.net and hit enter. Chocolaty downloads and installs paint.net for us and all we have to do is say yes when it asks it for sure. And we don't even have to do that if we just add a dash y to the end of our command. We can even string together dozens of packages and have our new machine just set itself up while we go out and wash the car. And like Ninite, Chocolaty can also be used to keep your installed programs up to date or specifically to not. If there's something you don't wanna upgrade, you can lock in a particular version. There are paid plans available that offer some extra features for business use, but even in its free community supported form, this is a must have tool. And if the command line is a little too daunting for you, you don't need it. Just make sure the first thing you install is Chocolaty GUI and you can manage everything graphically after that. Here, how about I use Chocolaty to show you guys another cool tool. Winderstat has been a staple of technicians USB keys since its first release back in 2003, allowing us to easily identify what is eating up all of that precious hard drive space. But these days you might prefer Wiztree from antibody software. The interface is immediately familiar, but unlike Winderstat, it's fast. Like I'm talking seconds instead of minutes and it even handles gotchas like hard link files significantly more accurately. Furthermore, unlike Winderstat, Wiztree is still in active development and gets bug fixes, updates, and new features periodically, which by the way, you can get automatically by creating a scheduled task to run the update command in Chocolaty. Changing gears, our next tool is only in the Microsoft store. Sorry, Chocolaty users, but it might be worth checking out anyway. You've probably heard of Windows Powertoys, but have you heard of WinToys? This utility gathers program and service management tools along with frequently used windows settings, tweaks and fixes, and puts them all in one place so you don't have to go digging through the various settings apps and control panels trying to figure out where the devil Microsoft has moved things this week. Speaking of losing track of things, I'm sure we've all been there looking for that bootable thumb drive that you know you have. You know, the one with that ISO on it. Well, no more. While it's long been possible to have multiple bootable utilities on a single thumb stick, our favorite method these days is Ventoy. So cool. After a quick installation to your drive, all you've got to do is just copy any ISO or any disc image file you want and Ventoy will automatically detect it and add it to a menu at boot. No more manually updating menus or requiring the installer software to add or update your tools. This has already been a time-saver for me on multiple occasions. Oh, and while you're adding images to your new Ventoy drive, be sure to include one of the tiny images from netboot.xyz which uses PXE booting to let you launch your choice of more than 80 operating system installers, live operating systems and utility images all downloaded on demand over the internet. It can even boot Windows installers though you will need to do a bit of fancy work to host the installer files in a Windows PE environment somewhere on your network. If you'd rather someone else do all the heavy lifting and gather your utilities for you, kind of like Hiren's boot CD back in the day, you can check out MediCat USB. This massive 20 plus gigabyte collection of tools is wrapped up in a customized Ventoy menu system and includes a wide selection of bootable tools along with a Windows PE environment with an enormous collection of portable apps. Now, obviously collections like these exist in the legally dubious, excuse me, zone, but the reality is that if you've ever worked at a tech shop, you've probably touched one at some point. So we would be naive to imagine that everyone is just going to pretend they don't exist. So we installed MediCat to a 32 gigabyte thumb drive and actually ended up with only a couple of gigs free. So if you're gonna wanna add any additional ISOs or tools, you're gonna probably wanna start with a bigger device. We should also note by the way, that our antivirus lost its flip in mind when we first tried to install this collection and classified many of the utilities as hacking tools, which feels a little unfair because it is chock full of legitimately useful repair and diagnostic tools. And I think we need to look at them through the lens of the good that they can do rather than the harm, like a screwdriver from LTT store. It could be used as a shiv, but it's a lot more useful for screwing and unscrewing things. Oh yeah, while I'm annoyed by the way, why is it so hard sometimes to move files between devices? We run into this all the time when we're away from the studio and trying to copy scripts from our windows laptops to the iPhones that we use as teleprompters. It wastes a lot of time and never needs to happen again, thanks to simple HTTP server from GitHub user, TheWaWar. Running this program in a folder will launch as advertised, a simple HTTP server that offers up the contents of that folder to the network. That means any machine on the network that has a web browser can then navigate to that IP address and download the file they need. Easy peasy, only one thing, just remember to turn off the server when you're done because otherwise pretty obvious security issues. Oh, and on that note, don't try to run this utility on your company's corporate network because I'm sure it's gonna send IT running. Hopefully we've introduced you to at least a couple of cool new tools that you're already downloading to your thumb drives. And if you've got a suggestion for a must have that we haven't brought up before, let us know in the comments down below. Ideally, you could maybe give us one that generates marginally wittier segues to our sponsor. Vessi, with the sun out in full force, you gotta take care of your body. Sunglasses for the eyes, sunscreen for the skin and a pair of Vessi's for your feet. Check out their boardwalk slip-on sneakers. They're a modern take on a classic design and using their patented Dymatex technology, these trendy kicks let sweat and heat escape, keeping your feet dry. Speaking of moisture, they're also backed by Vessi's claim of being 100% waterproof. So capitalize on the weather, take that trip you deserve and bring your Vessi's. They're lightweight and stretchy, meaning they can fit in most size bags. Check out the Vessi boardwalk and other styles at vessi.com slash linustechtips and use code LTT for 15% off your entire order. If you liked this video, why not check out the return of Handytech under a hundred where we discovered some must have physical gadgets rather than software tools.",
    "transcript_keywords": [
        "tools",
        "Chocolaty",
        "Windows",
        "audio",
        "Samsung Galaxy Unpacked",
        "tool",
        "Vessi",
        "Check",
        "Ventoy",
        "VoiceMeeter",
        "drive",
        "time",
        "software",
        "utilities",
        "thing",
        "Discord",
        "install",
        "Ninite",
        "system",
        "update"
    ],
    "transcript_entity_values": [
        "IP",
        "one",
        "Chocolaty",
        "first",
        "this week",
        "MediCat",
        "iPhones",
        "Vessi",
        "Chocolaty",
        "a hundred",
        "Vessi",
        "Chocolaty GUI",
        "WinToys",
        "Ninite",
        "Discord",
        "32 gigabyte",
        "2003",
        "Dymatex",
        "20 plus gigabyte",
        "VoiceMeeter",
        "Hiren",
        "today",
        "ISO",
        "TheWaWar",
        "MediCat USB",
        "a ton",
        "50",
        "Wiztree",
        "Ventoy",
        "more than 80",
        "100%",
        "dozens",
        "more than 10,000",
        "Ventoy",
        "LTT",
        "Windows Powertoys",
        "three",
        "Ventoy",
        "Windows PE",
        "Handytech",
        "USB",
        "Winderstat",
        "EQ",
        "Winderstat",
        "Linux",
        "the day",
        "GitHub",
        "15%",
        "Wiztree",
        "only one",
        "two",
        "Microsoft",
        "Samsung",
        "these days",
        "about three minutes",
        "Galaxy",
        "Windows"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERSON",
        "NORP",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "FAC",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "LOC",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "GPE",
        "DATE",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.08915013819932938,
        -0.010782844386994839,
        0.024142639711499214,
        -0.07237553596496582,
        0.044061459600925446,
        0.01582706905901432,
        -0.01823803037405014,
        0.024241816252470016,
        -0.10994064807891846,
        -0.030442308634519577,
        0.04621047154068947,
        -0.09543481469154358,
        0.01681252382695675,
        -0.0551673099398613,
        0.02802850492298603,
        -0.028901243582367897,
        0.006335841957479715,
        0.05155843868851662,
        -0.027271762490272522,
        -0.03462054580450058,
        0.04261421412229538,
        0.0603298619389534,
        0.030842993408441544,
        -0.024642374366521835,
        0.07119496166706085,
        -0.024975301697850227,
        -0.00913644302636385,
        -0.055845774710178375,
        0.040696099400520325,
        -0.08084025979042053,
        -0.005047255661338568,
        0.037655994296073914,
        0.04666706919670105,
        0.01089373417198658,
        -0.08631410449743271,
        -0.1520603895187378,
        0.05777234584093094,
        -0.05295505374670029,
        -0.038600631058216095,
        -0.08442292362451553,
        -0.06125665456056595,
        0.018618319183588028,
        0.02959883026778698,
        -0.06408935785293579,
        -0.048114825040102005,
        -0.10927325487136841,
        -0.05582635477185249,
        -0.010491147637367249,
        -0.02213086187839508,
        -0.006984316743910313,
        0.007458268664777279,
        -0.03455018997192383,
        0.007110126782208681,
        0.04871375113725662,
        -0.05644083023071289,
        0.05150622874498367,
        0.03475005552172661,
        0.02807299979031086,
        0.05710214376449585,
        -0.025797385722398758,
        0.032680440694093704,
        -0.05868234857916832,
        -0.0491865798830986,
        0.034852925688028336,
        -0.07414942979812622,
        0.029548531398177147,
        0.02583373337984085,
        0.08008361607789993,
        0.015235818922519684,
        0.0009288661531172693,
        -0.10134802013635635,
        0.002057494828477502,
        0.0423591248691082,
        0.03851098194718361,
        0.024868641048669815,
        0.06290551275014877,
        0.04425080120563507,
        0.016301026567816734,
        -0.017331266775727272,
        0.020105751231312752,
        -0.020869055762887,
        -0.01191144809126854,
        -0.039230238646268845,
        0.009788524359464645,
        0.0849955677986145,
        -0.011350912973284721,
        -0.0557541698217392,
        0.037584543228149414,
        -0.0051964400336146355,
        -0.00393811147660017,
        -0.05332190915942192,
        0.01931641809642315,
        -0.01154290046542883,
        -0.05439896509051323,
        -0.032694362103939056,
        0.026578335091471672,
        -0.05849684402346611,
        -0.07860112935304642,
        -0.00587855651974678,
        0.06424568593502045,
        -0.007027837913483381,
        -0.0315142385661602,
        -0.013061773963272572,
        -0.04764460399746895,
        -0.0329308919608593,
        -0.0963020920753479,
        0.016455311328172684,
        0.006260565482079983,
        -0.0005552460788749158,
        -0.030901530757546425,
        -0.02391303889453411,
        -0.01055081281810999,
        -0.05898668244481087,
        -0.042455028742551804,
        0.03760853409767151,
        0.047066569328308105,
        0.04816161468625069,
        0.04583589360117912,
        0.08373551815748215,
        -0.08276373893022537,
        -0.023403702303767204,
        -0.04421728104352951,
        -0.09072374552488327,
        -0.10644758492708206,
        0.05412343144416809,
        0.015264595858752728,
        -0.05090168118476868,
        8.63626295594328e-33,
        0.038471873849630356,
        0.034053150564432144,
        -0.001232366543263197,
        -0.008034738712012768,
        0.04674901068210602,
        0.0037315748631954193,
        -0.006493950728327036,
        9.78968309937045e-05,
        -0.016317136585712433,
        0.013702844269573689,
        -0.009407594799995422,
        0.06942709535360336,
        -0.13538824021816254,
        -0.032575786113739014,
        -0.059861768037080765,
        -0.10361906886100769,
        -0.04782179743051529,
        0.043779969215393066,
        -0.02123141847550869,
        -0.02604326419532299,
        -0.007947787642478943,
        -0.00576607882976532,
        -0.0060941074043512344,
        -0.020967703312635422,
        0.12123633921146393,
        0.03998901695013046,
        0.08269588649272919,
        -0.01480953674763441,
        0.06786841154098511,
        0.0346304289996624,
        -0.08389587700366974,
        -0.049012407660484314,
        0.05484442412853241,
        -0.03039633296430111,
        0.005565146915614605,
        -0.0031787273474037647,
        -0.07038073986768723,
        -0.017171606421470642,
        0.0795210525393486,
        -0.05443039909005165,
        0.021627796813845634,
        -0.028565481305122375,
        -0.09103741496801376,
        -0.01485804095864296,
        -0.07471590489149094,
        -0.010812502354383469,
        -0.052529703825712204,
        0.04558253660798073,
        0.06527596712112427,
        0.009154833853244781,
        0.006259226705878973,
        -0.027011606842279434,
        -0.04419756680727005,
        -0.01668444834649563,
        -0.028370823711156845,
        -0.062033578753471375,
        -0.026535678654909134,
        0.10030152648687363,
        0.05781310424208641,
        0.029144348576664925,
        0.05751727893948555,
        0.009167970158159733,
        0.030617956072092056,
        -0.060783542692661285,
        -0.0009781685657799244,
        -0.005330971907824278,
        0.012362540699541569,
        -0.044208746403455734,
        -0.06415169686079025,
        -0.004499570466578007,
        -0.01871929131448269,
        -0.04126974567770958,
        0.04651019722223282,
        -0.019552620127797127,
        0.0026672210078686476,
        0.033011484891176224,
        0.0425543375313282,
        -0.01355692744255066,
        0.002526891650632024,
        -0.024636367335915565,
        -0.09416685253381729,
        0.05523187294602394,
        0.01661611720919609,
        0.039788465946912766,
        0.041526470333337784,
        -0.09601785242557526,
        -0.016173623502254486,
        -0.1029045358300209,
        0.021598607301712036,
        -0.014833677560091019,
        -0.04958479106426239,
        0.05757151544094086,
        0.030928319320082664,
        0.03675920143723488,
        -0.06414345651865005,
        -9.184392298311867e-33,
        0.021953009068965912,
        0.0032420202624052763,
        0.052648160606622696,
        0.025288229808211327,
        0.0041198935359716415,
        -0.009256751276552677,
        0.08665388077497482,
        0.04172565042972565,
        0.040783558040857315,
        -0.09518084675073624,
        0.026879139244556427,
        0.02364153414964676,
        -0.009949644096195698,
        -0.09375838935375214,
        0.05446820706129074,
        -0.04551626741886139,
        0.0664082020521164,
        -0.027068156749010086,
        0.03369434177875519,
        0.018570750951766968,
        0.002282191999256611,
        0.01364734023809433,
        0.0624191053211689,
        0.06305190175771713,
        -0.05187569186091423,
        -0.023956097662448883,
        -0.026890652254223824,
        0.055085767060518265,
        0.005892356391996145,
        -0.028071803972125053,
        0.03444374352693558,
        0.01029228139668703,
        -0.04748612642288208,
        -0.08635243028402328,
        0.040079325437545776,
        0.009701494127511978,
        0.12391647696495056,
        0.11395430564880371,
        0.02531801164150238,
        -0.009519750252366066,
        0.05497000738978386,
        -0.027060359716415405,
        -0.0023961272090673447,
        -0.053603120148181915,
        0.08039718866348267,
        -0.060463204979896545,
        -0.05926964804530144,
        -0.023389672860503197,
        -0.03799327462911606,
        0.024312280118465424,
        0.12511979043483734,
        -0.08010116964578629,
        0.022846637293696404,
        0.005177340004593134,
        -0.009893814101815224,
        0.02356601320207119,
        0.018610879778862,
        -0.04829031974077225,
        0.03798940032720566,
        0.04489521682262421,
        0.0012656999751925468,
        -0.05228505656123161,
        -0.12745386362075806,
        -0.08535078912973404,
        -0.052650902420282364,
        0.031232129782438278,
        0.052625056356191635,
        -0.03863334655761719,
        -0.03661905974149704,
        0.02302681840956211,
        -0.03545774519443512,
        0.005857158452272415,
        0.0072411419823765755,
        -0.015261974185705185,
        0.008337130770087242,
        0.06679852306842804,
        -0.05336341634392738,
        -0.10775697231292725,
        -0.004634699784219265,
        -0.040332894772291183,
        0.025989007204771042,
        0.09844519197940826,
        0.08219477534294128,
        -0.059707898646593094,
        -0.014325927011668682,
        0.09100227057933807,
        0.005513741634786129,
        0.045880306512117386,
        0.08509190380573273,
        0.041132424026727676,
        -0.16995888948440552,
        0.03550536930561066,
        0.018601777032017708,
        0.10655661672353745,
        -0.01977543905377388,
        -6.512561157023811e-08,
        -0.015610834583640099,
        0.01615157537162304,
        0.03709142655134201,
        -0.018691103905439377,
        -0.05332794040441513,
        -0.06258068233728409,
        -0.007295970804989338,
        -0.05106336623430252,
        0.12295083701610565,
        -0.0649213194847107,
        0.055527206510305405,
        -0.09286661446094513,
        0.02751268446445465,
        0.06257135421037674,
        0.02175692468881607,
        0.04912170022726059,
        -0.06956198811531067,
        0.11096800863742828,
        -0.037723835557699203,
        -0.07387327402830124,
        0.013016034848988056,
        0.06222136318683624,
        0.08795960247516632,
        0.0011690286919474602,
        0.12506750226020813,
        -0.0053550261072814465,
        0.0029092468321323395,
        0.0658453032374382,
        0.0868382453918457,
        -0.042702171951532364,
        -0.025569284334778786,
        -0.003965533338487148,
        -0.03486069664359093,
        0.0001702571753412485,
        -0.03359498083591461,
        -0.003543062834069133,
        -0.048996295779943466,
        -0.01090033259242773,
        0.023546328768134117,
        0.07636447250843048,
        -0.01818418875336647,
        0.0009751314646564424,
        -0.03454840928316116,
        0.014177988283336163,
        0.015265025198459625,
        -0.047492075711488724,
        0.056170910596847534,
        -0.002408757572993636,
        -0.02179795876145363,
        0.009092133492231369,
        -0.01591184362769127,
        0.0018267898121848702,
        -0.047256577759981155,
        -0.046670034527778625,
        0.03175469860434532,
        -0.015571117401123047,
        0.045954205095767975,
        0.0744231715798378,
        0.0003679344954434782,
        0.05140015855431557,
        -0.033213064074516296,
        0.003436502767726779,
        0.012323963455855846,
        0.09503889083862305
    ]
}