{
    "id": "0g8AhCAP4w8",
    "title": "BACKYARD BUNKER PART 5 - WATERPROOFING THE TUBE!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-12-08T15:11:00Z",
    "video_url": "https://www.youtube.com/watch?v=0g8AhCAP4w8",
    "category": "Howto & Style",
    "tags": [
        "backyard bunker",
        "back yard bunker",
        "waterproofing a bunker",
        "waterproof bunker",
        "culvert bunker",
        "pipe bunker",
        "underground bunker",
        "secret bunker",
        "secret tunnel",
        "tractors",
        "sher-tar"
    ],
    "views": 1144526,
    "likes": 47044,
    "comments_count": 1823,
    "description": "Today we waterproof my underground backyard culvert bunker. Visit  for 50% off your first month of KiwiCo with code JERRYRIG. And huge thanks to KiwiCo for sponsoring this video. Before we can bury my backyard bunker and put the dirt back on top, we have to make sure that the bunker tube itself is water tight. If water gets inside the bunker when it rains.... well... that would not be a good thing.   Watch all the bunker videos in order HERE:   Grab a JerryRigEverything Knife or GroundX Bunker Project T-Shirt HERE:",
    "description_links": [
        "https://www.kiwico.com/jerryrig",
        "https://youtube.com/playlist?list=PL0vZL9uwyfOE6Of8qi5dtIFgdSt1hlOZm",
        "https://www.youtube.com/@JerryRigEverything/store"
    ],
    "transcript": "We finally have the bunker submerged below grade in my backyard. Super exciting times, but now that we're below ground we have to worry about the water. Whether it's rain, sprinklers, snow runoff, water can cause extraordinary damage to metal over time. Not to mention, all the electronics I want to keep inside wouldn't be too happy about any leakage. So it's time to waterproof some things. I'm not too worried about the steel bunker tubes themselves since they're covered in something that's called trench coat that can last more than a century underground. However, we did burn away a significant amount of that coating while welding on the flanges, so we do have to correct that. It's the exposed metal that needs to be coated so it doesn't corrode away. My bunker lasting 100 years is far better than my bunker lasting 10 years. And we've got to move quick before the snow comes. Let's get started. [Intro] If you've enjoyed this project and want the kids in your life to make cool things but aren't quite ready to tear out your backyard yet, might I present KiwiCo, a longtime channel sponsor that gives the gift of discovery, learning, and experiences that last far beyond the holidays. KiwiCo introduces science, technology, engineering, art, and math in fun ways. Designed by experts, KiwiCo has shipped more than 50 million crates worldwide. Crates that are full of fun, innovative projects like this programmable music box. My wife and I prefer giving KiwiCo subscriptions for birthdays or holidays because they are gifts that keep on giving. Monthly hands-on projects delivered right to your front door. With 9 different lines to choose from, there's something for every interest and age,from newborns all the way up to grandparents. This music box is part of the Eureka! Crate line, which leans towards engineering and design for kids ages 12 to 100. And even has a cool maker's guide with lots of historical information. Like music boxes were once the only way to listen to music without human performers. And music box building is definitely a good skill to have in the apocalypse. Use code JERRYRIG to get 50% off of your first month. I assure you it is far less expensive than building a bunker in your backyard. Kiwico.com /JerryRig let's get back to work. Having only one entry and exit point of a bunker is kind of a bad idea. If one entry gets blocked, broken or caved in, the bunker becomes more of a tomb instead of a shelter, which is counterproductive. So since we have the large elevator shaft at one end, we're adding a second smaller exit shaft with a ladder at the far side of the culvert. Wish us luck. We're going to try and flip this thing. With all the timing of the large excavation equipment and our rush to get the bunker buried before the snow falls, we found it easier to just weld a large metal sheet together out of 3-8's plate and drop that into place with the crane while it was still here. Locked. We only cut the hole for the exit door out of the sheet after it was welded to the bunker so we could ensure that the door would be completely level. We can go about 63 probably. There's going to be a saw blade coming through right here. The blade we're using to slice through the 3 -8's plate is tipped with carbide teeth that are specifically designed to cut through steel. Carbide is a level 8 on most scale of hardness, while steel is about a level 4. The blade wins every time. We will add the shaft portion of the outside exit shaft after we start filling up the hole a bit once the excavator has more room to move around again to do the heavy lifting for us. I see it moving. That weighs so much. That is so heavy. Do you think we should just bury it? We have to grind away the coating on the inside of the tube once again to weld bare metal to bare metal. And we use lasers so that everything is level. The green laser beam gives us a consistent mark across both sides of the tube so that during the apocalypse nothing will be off center. With the door level, we can get the metal sheets lined up for where the floor is going to attach to the bunker walls. This also needs to be pretty level. And we have to wire wheel away the black plasticky waterproofing trench coat on the inside so that the metal plate has something to weld to. And at the end of this project, this bunker will be wheelchair accessible and if the floor isn't level, someone in a wheelchair will just roll off into the far wall. So, level floors are more important than you might think. Before we can start waterproofing anything, we have to get some of the metal for the flooring welded to the wall. Since these particular pieces are connected directly to the tube, and the welder will burn through the trench coat. And we need to recoat everything that burns away before adding dirt back into the hole. So super trippy, the exterior coating on this thing is supposed to last underground for like a hundred years, but when we're welding the floor on the inside, the welder is using so much electricity and heat that it burns through the coating. Luckily it's not like perpetually burning, but it's still pretty intense. This is what I was talking about earlier when I said we'd have to recoat the exterior stuff that got burned away. Better to do it now while there's not dirt covering the bottom half of the pipe. And I think it just sounds super cool. Listen to this. It's actually kind of difficult walking around on the slippery helically corrugated pipe walls. Even though the pipe is 12 feet in diameter, and there is plenty of curvature, I'm still looking forward to getting the floor in. Once it's installed, we'll have so much more room to move around, and having a floor means we can start storing stuff underneath the floor panels. All the cost of this metal was included in the price I gave last time. I have no idea why my welder is puffing smoke rings better than Gandalf in the Shire, but I'm here for it. All the way over on this end of the bunker, this metal sheet is bare that we have to recoat. And if we walk this way, the middle seam, which we've cinched together with the bolts inside, we got to coat this line, this line, and this line, as well as all of this bare metal here. Once we weld this entire seam, it's going to be watertight, but once again we still have to coat the metal. The galvanized stuff, don't got to worry about that. And we have waterproof construction adhesive along each seam. And Graham down there is taking care of the corners. Graham is currently welding the outside seam, making sure that it's watertight edge to edge. We are currently in the elevator shaft. To join the entry shaft up with the bunker itself, we're using something called a magdrill, which uses an electromagnet to hold itself to the bunker wall while it drills a massive hole through the entry shaft and the bunker itself, which we can put a bolt through to cinch the two sections together. At the moment we have four EcoFlow Delta Pro batteries down here in the bunker running all of our power tools charging our batteries. They give us about 12 kilowatt hours worth of electricity, which is more than enough to run all of our tools at the same time. Even though the bunker weighs about 20,000 pounds, we're using ratchet straps and concrete blocks to hold it down so when we start packing gravel underneath the haunches, It doesn't start rising up out of the ground. That's not going anywhere. The straps are only temporary and not structural of course. Once there's dirt packed on top, the bunker's not going anywhere. We just got to keep it from moving while the dirt gets compacted. We do have a strip of rubber between both halves of the culvert bunker and we're adding waterproof construction adhesive to either side of that piece of rubber. There will be additional exterior piece of rubber and a large metal strap that we'll add later. I'm fairly confident no water will be ingressing at this scene. The material we're using to coat the bare metal on the bunker is called high mill suretar and it is incredibly nasty stuff. It's a two part epoxy just like all those beautiful wooden river tables you see on Instagram. But instead of aesthetic perfection, this is more apocalyptic protection. It's basically epoxy mixed with refined coal tar and it's used to keep metal from corroding in extreme environments, like out in the oil fields or offshore drilling rigs. It can handle salt water, chemicals, and is extremely abrasion resistant. It's industrial grade stuff and the high mill part of the name means it gets applied very quickly and we only have to do one coat. Luckily here in Utah it's still above 50 degrees because there is a temperature requirement for it. Once the epoxy gets mixed up with the coal tar it has to sit for an hour and then we can paint it directly onto the bare metal. Like I said earlier, we don't have to paint the trench coat covered tubes or the galvanized sheet metal, just the bare steel components that we made ourselves. This coal tar should allow my bunker to survive 100 years underground so make sure you hit that subscribe button and we'll check back in a century to see if it worked. I assure you that this smells exactly like you think it does. The bunker is bolted up, welded up, sealed shut and strapped shut, which is perfect because it just started raining and I definitely needa new shirt. And we are finally ready to bury the bunker, which means this is the last time that you can buy your exclusive jar of dirt from 18 and a half feet under my backyard. Dirt that hasn't seen the light of day for a million years. And as a fun little side note, I've randomly placed 1 ounce bars of silver inside a few of the jars of dirt. I have about 25 of these because I think everyone has a small hope that they find buried treasure at the bottom of any hole that gets dug. And remember, if you don't happen to get a bar of silver in your jar of dirt,the true treasure is the knowledge we made along the way. It is time to make this bunker disappear and for my wife to get her yard back. I'll see you next week.",
    "transcript_keywords": [
        "bunker",
        "metal",
        "bare metal",
        "level",
        "coat",
        "time",
        "shaft",
        "bare",
        "bunker submerged",
        "dirt",
        "floor",
        "inside",
        "trench coat",
        "metal sheet",
        "bunker lasting",
        "music",
        "large metal",
        "hole",
        "start",
        "stuff"
    ],
    "transcript_entity_values": [
        "a century",
        "Eureka",
        "10 years",
        "the holidays",
        "9",
        "a million years",
        "100 years",
        "8",
        "Instagram",
        "Monthly",
        "four",
        "more than a century",
        "two",
        "about 12 kilowatt hours",
        "an hour",
        "12 feet",
        "Kiwico.com",
        "about 63",
        "only one",
        "half",
        "18 and a half feet",
        "a hundred years",
        "next week",
        "JERRYRIG",
        "ages 12 to 100",
        "Gandalf",
        "Graham",
        "about 25",
        "about 20,000 pounds",
        "3 -8's",
        "your first month",
        "1 ounce",
        "second",
        "4",
        "Shire",
        "50%",
        "3",
        "EcoFlow Delta Pro",
        "Utah",
        "one",
        "more than 50 million",
        "50 degrees"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "TIME",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "LOC",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "MONEY",
        "QUANTITY"
    ],
    "vector": [
        -0.04577456787228584,
        0.03860265389084816,
        0.07781621068716049,
        0.009544896893203259,
        0.06823209673166275,
        -0.015968261286616325,
        0.03448467701673508,
        0.06738591194152832,
        -0.06912121176719666,
        -0.014622586779296398,
        -0.07269947230815887,
        -0.015220039524137974,
        0.09514133632183075,
        0.029767319560050964,
        -0.008908325806260109,
        0.0012230053544044495,
        -0.017293762415647507,
        0.015778018161654472,
        -0.05929424241185188,
        -0.04811827093362808,
        -0.04298151656985283,
        -0.0242279302328825,
        0.04472963884472847,
        -0.03129550442099571,
        -0.018754366785287857,
        0.07460357248783112,
        -0.009451348334550858,
        0.07934991270303726,
        -0.07554009556770325,
        -0.00249945349059999,
        -0.05967835709452629,
        -0.021106548607349396,
        -0.04177972674369812,
        -0.03865770995616913,
        0.09111244976520538,
        0.04155934229493141,
        0.046738505363464355,
        0.018269462510943413,
        0.01681888848543167,
        -0.02237710729241371,
        -0.06524555385112762,
        -0.008831202052533627,
        0.009182090871036053,
        0.039538607001304626,
        0.062460094690322876,
        -0.015145509503781796,
        0.054505325853824615,
        -0.013821450993418694,
        0.0021121057216078043,
        0.03461828455328941,
        0.030013293027877808,
        -0.031384896486997604,
        0.037962038069963455,
        0.03716748580336571,
        -0.06236496940255165,
        -0.09004321694374084,
        -0.007871911861002445,
        -0.03491383045911789,
        0.005448271986097097,
        0.0742998942732811,
        0.09034619480371475,
        -0.04843033477663994,
        -0.06743044406175613,
        -0.007846996188163757,
        0.01897655799984932,
        0.014319779351353645,
        0.020052824169397354,
        0.03317786380648613,
        0.03956478089094162,
        0.09872663021087646,
        -0.01464872993528843,
        0.11011924594640732,
        -0.030650373548269272,
        -0.0661618560552597,
        -0.07003641873598099,
        0.023784231394529343,
        0.025409845635294914,
        0.008603251539170742,
        0.01716996729373932,
        0.03540566563606262,
        -0.006276923231780529,
        0.03357643634080887,
        0.11873859912157059,
        -0.12038519978523254,
        -0.02566264383494854,
        0.12204910069704056,
        0.03834511339664459,
        0.03300858289003372,
        -0.02180906943976879,
        0.009061206132173538,
        -0.09242743998765945,
        -0.07075555622577667,
        2.532223516027443e-05,
        0.05988841503858566,
        0.02568148635327816,
        -0.014384779147803783,
        -0.018179649487137794,
        -0.06949980556964874,
        -0.03186318278312683,
        0.008097538724541664,
        0.033062633126974106,
        -0.05019649490714073,
        0.005498635116964579,
        -0.03802955150604248,
        0.12867681682109833,
        -0.025111038237810135,
        0.002331655705347657,
        0.0573355108499527,
        -0.005260038655251265,
        -0.0200232844799757,
        0.03518025949597359,
        -0.008542055264115334,
        -0.011899060569703579,
        0.07653806358575821,
        -0.04613537713885307,
        -0.03148908540606499,
        -0.023001646623015404,
        0.016118116676807404,
        0.020341096445918083,
        0.013335294090211391,
        0.04772372171282768,
        0.029357722029089928,
        0.04568897560238838,
        0.023845544084906578,
        0.07377401739358902,
        -0.02022462897002697,
        0.0055535584688186646,
        1.8894427834087044e-33,
        0.04070431366562843,
        -0.058015309274196625,
        -0.04784122854471207,
        0.02090648002922535,
        0.03417239338159561,
        -0.024699261412024498,
        0.035853706300258636,
        0.026917213574051857,
        -0.017142880707979202,
        0.050823625177145004,
        -0.04574330896139145,
        0.012272409163415432,
        -0.09531352669000626,
        -0.00863387156277895,
        0.00039485993329435587,
        -0.02798687107861042,
        -0.07555004954338074,
        -0.055227864533662796,
        -0.0034100927878171206,
        -0.021794414147734642,
        0.0029148010071367025,
        -0.11454526335000992,
        -0.01990782842040062,
        -0.0736684799194336,
        0.08508343994617462,
        -0.08116665482521057,
        -0.013087951578199863,
        0.026192346587777138,
        -0.040310006588697433,
        0.004827934317290783,
        -0.04396761208772659,
        0.012130719609558582,
        0.08573660254478455,
        0.052888423204422,
        0.017869479954242706,
        -0.000431629188824445,
        0.04205261543393135,
        -0.006646302063018084,
        0.022370638325810432,
        0.012538503855466843,
        -0.021266037598252296,
        -0.023754622787237167,
        -0.0007402985356748104,
        -0.03957716003060341,
        0.051493216305971146,
        -0.07112164795398712,
        0.00227387435734272,
        0.010769903659820557,
        -0.04055796191096306,
        -0.1585034728050232,
        -0.0067988610826432705,
        0.07995166629552841,
        -0.03767423331737518,
        -0.031648799777030945,
        -0.016485003754496574,
        -0.005155423190444708,
        0.10279050469398499,
        0.009396921843290329,
        0.03955669701099396,
        0.032747041434049606,
        -0.04710559546947479,
        0.0912332683801651,
        0.021391844376921654,
        -0.03134455159306526,
        -0.10326474159955978,
        0.017271418124437332,
        0.014736935496330261,
        0.05661926791071892,
        -0.021947117522358894,
        -0.06265879422426224,
        -0.0495791994035244,
        0.032862793654203415,
        0.042890824377536774,
        -0.036636464297771454,
        -0.06531179696321487,
        0.03192589432001114,
        0.024429988116025925,
        -0.040885079652071,
        0.07210507988929749,
        0.0004234857624396682,
        0.09115994721651077,
        -0.05089586228132248,
        0.0024498444981873035,
        -0.002096867188811302,
        -0.04334770515561104,
        -0.0015757406363263726,
        0.04049086943268776,
        -0.024913599714636803,
        -0.025876328349113464,
        0.004973838571459055,
        -0.0339779406785965,
        0.0328889898955822,
        0.007790525909513235,
        -0.08973444998264313,
        0.04933140426874161,
        -3.6267707203492506e-33,
        0.07509036362171173,
        -0.01351939421147108,
        0.0456671305000782,
        -0.01525326818227768,
        0.040407516062259674,
        0.01691262051463127,
        0.051029182970523834,
        -0.0591878779232502,
        0.02074560523033142,
        -0.030441753566265106,
        -0.09882572293281555,
        0.07791043072938919,
        0.000538885360583663,
        -0.02645750343799591,
        -0.036588218063116074,
        -0.03314985707402229,
        -0.08339472115039825,
        -0.08029662072658539,
        0.023233627900481224,
        -0.039766576141119,
        -0.02952144294977188,
        0.019255168735980988,
        -0.006712713278830051,
        0.07355748116970062,
        -0.03600030019879341,
        -0.0030269837006926537,
        -0.03941307216882706,
        0.00459290063008666,
        0.04780390486121178,
        0.02470168098807335,
        -0.06946564465761185,
        0.002904266119003296,
        0.06700684130191803,
        -0.06369064748287201,
        0.013411392457783222,
        0.0142204025760293,
        0.03843295946717262,
        -0.02053849771618843,
        -0.014825219288468361,
        -0.025840165093541145,
        0.044829294085502625,
        0.03233636915683746,
        -0.0677601546049118,
        -0.06897547096014023,
        -0.009454934857785702,
        0.06153464317321777,
        0.07354113459587097,
        -0.09382674098014832,
        -0.03642132878303528,
        0.00010634138016030192,
        0.0012503028847277164,
        -0.0027283472009003162,
        -0.053461916744709015,
        0.04083789139986038,
        0.039127085357904434,
        0.003168454859405756,
        0.005776504520326853,
        -0.008555838838219643,
        -0.12841086089611053,
        0.053752437233924866,
        0.014034529216587543,
        0.006119113881140947,
        0.026674389839172363,
        0.019437527284026146,
        -0.017047425732016563,
        -0.010381394997239113,
        -0.013893858529627323,
        0.1007537767291069,
        -0.0149061419069767,
        0.008708788082003593,
        0.0038099277298897505,
        -0.01698414795100689,
        0.015373701229691505,
        -0.06761931627988815,
        0.09116464108228683,
        -0.08649268746376038,
        -0.05165134370326996,
        0.07230104506015778,
        -0.034552451223134995,
        0.09866267442703247,
        0.03778623044490814,
        0.07139332592487335,
        -0.1356247216463089,
        0.0649009570479393,
        0.14780208468437195,
        -0.0350397452712059,
        0.049859922379255295,
        0.02389971911907196,
        0.011232597753405571,
        0.017432579770684242,
        0.036795277148485184,
        -0.02366025745868683,
        -0.08941102027893066,
        0.020618882030248642,
        -0.018276134505867958,
        -4.9022556680711205e-08,
        0.020976277068257332,
        0.08410254865884781,
        -0.030237440019845963,
        -0.03879651427268982,
        -0.045836564153432846,
        -0.07967130094766617,
        0.060819756239652634,
        0.002309357048943639,
        0.06267226487398148,
        -0.07202509790658951,
        -0.04984671249985695,
        -0.02667202427983284,
        -0.04675080254673958,
        0.001151423784904182,
        -0.1001177579164505,
        0.024282408878207207,
        -0.03742964193224907,
        -0.05742550268769264,
        0.0008236338035203516,
        -0.0061573670245707035,
        0.011965499259531498,
        -0.03336325287818909,
        0.058990247547626495,
        0.04680582508444786,
        -0.06676624715328217,
        0.058680713176727295,
        0.020795557647943497,
        -0.05318488925695419,
        0.055985353887081146,
        0.1139688715338707,
        -0.1145937368273735,
        -0.024630771949887276,
        -0.08300769329071045,
        0.027200112119317055,
        0.021127033978700638,
        0.006683554966002703,
        0.09782387316226959,
        0.025836771354079247,
        0.016070542857050896,
        0.12163791805505753,
        -0.06883435696363449,
        -0.13116256892681122,
        0.04964814335107803,
        0.019351720809936523,
        0.018566053360700607,
        0.06782496720552444,
        -0.06469064950942993,
        0.031503643840551376,
        -0.013972807675600052,
        -0.02187124639749527,
        0.05923309177160263,
        -0.040465131402015686,
        -0.0033002460841089487,
        0.06993107497692108,
        0.05205797031521797,
        0.11755663901567459,
        -0.0544884018599987,
        -0.04142320156097412,
        -0.025665590539574623,
        0.009949986822903156,
        -0.10776416957378387,
        -0.014766030944883823,
        0.017807839438319206,
        -0.013139632530510426
    ]
}