{
    "id": "0qyjuVa18sY",
    "title": "This Gaming Phone gets HOT... in more ways than one.",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-08-08T13:45:00Z",
    "video_url": "https://www.youtube.com/watch?v=0qyjuVa18sY",
    "category": "Howto & Style",
    "tags": [
        "Gaming phone",
        "black shark 5 pro",
        "black shark",
        "fast charge",
        "120w fast charge",
        "budget gaming phone",
        "gaming",
        "video games",
        "video game",
        "mobile game",
        "smartphone game",
        "hot phone",
        "phone cooling",
        "charging test",
        "hyper charge",
        "xiaomi",
        "best gaming phone"
    ],
    "views": 559514,
    "likes": 26980,
    "comments_count": 1111,
    "description": "Its time we durability test the new Black Shark 5 Pro! Get a 4-week trial, free postage, and a digital scale at  Thanks to Stamps.com for sponsoring the video! Gaming phones are some of my favorite devices. But I feel like this Black Shark 5 Pro is a gaming  phone in stealth mode. Without RGB's to announce your gaming presence - are you really even a gamer? Today we find out if the magnetic pop up buttons on the black shark 5 pro effect its structural integrity. We'll also test out the 120w fast charger to see if it can really charge the phone in 15 minutes.   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.Stamps.com/jerryrig.",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "In front of us today we have a brand new, top of the line, gaming phone called the Black Shark 5. For some reason gaming phones tend to be the ones that don't survive my durability tests when they should be the ones that do. At least that was the case last year. We'll have to see what happens this year. Good news about the Jerry Rig Everything Knives though the blue ones should be back in stock later this week. I've had a lot of people asking when they will be able to complete their collection, and the answer is very soon. And of course, as soon as they arrive I'll be shipping them out with Stamps.com. Huge thanks to Stamps.com for sponsoring this video. I've been using Stamps.com for a few years now to ship everything out right here from the comfort of my own home with my regular computer and regular printer. I have nothing against people who like to stand in lines of course, it's just not really my thing. Plus, a little secret, at Stamps.com you don't actually pay full price for stamps. With discounts you can't get anywhere else, like 30% off of USPS, and 86% off of UPS, it makes a lot of sense and saves you a lot of cents. So whether you're an office sending out paper invoices, or selling things off of Etsy, Shopify, Amazon, or Ebay, or maybe you're just a YouTuber selling freaking sweet razor knives. You can be up and running in minutes printing official postage for any size letter or package, sending anywhere you would like to send. You can even order shipping supplies off of Stamps.com. To get a 4 week free trial, free postage, and free digital scale, just head to Stamps.com/JerryRig. Not having to go to the post office is nice all by itself, the free stuff and discounts just make the deal even sweeter. Stamps.com/JerryRig. And I'll get back to shipping knives as soon as we finish this durability test. It's time to find out how durable the Black Shark 5 Pro really is. Let's get started. [Intro] We've never had a Black Shark gaming phone fail my durability test, but there is always a first time for everything. Strong phones come and go. This Black Shark 5 Pro is hiding a few secrets up its sleeve that most smartphones do not have. The first of which is a soft spot for poetry. Under the ordinary reality, an extraordinary journey shall begin. Through the mist and the shadow I conquer with my blade and courage, ultimate passion shall I devote. For me, game is real. I think in it's original language it probably makes a bit more sense, but it probably boils down to game is life, which is probably true for a lot of people and people who are interested in this phone. Inside the box we do get a free protective case which is nice of them, along with a SIM card removal tool. Not near as cool as the Nothing Phone's SIM removal tool, but they can't all be 10's. The phone itself has a soft touch frosted glass panel on the back with some futuristic accents. But to be honest, any phone reviewed after the Nothing Phone is just going to have a hard time looking cool. Inside the box is where we find the second secret a massive 120 watt fast charger, which according to Black Shark, can get us from 0-100% in just 15 minutes. Obviously we'll have to put that to the test. Also, I did check the wallpaper options and this was legit the best one so we're rolling with it. Now Black Shark does say that this fast of charging might lower the life of the battery as things heat up. And turning on even charge mode would help keep the battery in a more safe and stable temperature range while charging. But they also say that the battery has more than 1,200 charge cycles so we should be fine. It'll be interesting to see what the chemistry of the battery is when we open it up from the inside. Testing how long it takes the battery to go from 0-100% while charging at an unthrottled 120 watts is unsettling. At 5 minutes, we're already at 40% and the phone is definitely getting warm. It was about the 10 minute mark when we hit 75% and the phone is feeling extremely hot, like almost uncomfortable to hold level of hot. Now unfortunately, once that 15 minute time limit ticked over, we were only at 95%, and it took until just shy of 17 minutes to hit the full 100%. Missed the goal by a few minutes, but still very impressive. Something unimpressive, however, is on the back. Historically speaking, gaming phones have all had some distinguishing RGB LED's to light things up. Since we know nothing improves a gamer score quite like pulsing lights, however, shrinkflation has it extra hard this year in the LED department, leaving Black Shark with nothing more than a glorified multicolored notification mark on the back. Not even their logo is lit up. Once again, hard to compete with the Nothing Phone and its hundreds of LEDs. Personally, I just think that all gaming phones should be lit up brighter than a Christmas tree, so it's disappointing. One major advantage that this gaming phone has over other gaming phones are the hidden magnetic, and might I add, very satisfying, pop up retractable physical corner triggers. There is a sound animation each time the button is released, and the button can't be released if it's held down in place. But it is a pretty cool feature. The trigger doubles as a screenshot taker tool. It'll definitely be interesting to see how they work from the inside. But of course, first the durability test and the Mohs scale of hardness. I promise someday I won't be caught off guard by the preinstalled plastic screen protectors, but today is not that day. After the plastics are removed we can continue up the scale. Glass scratches at a 5 or 6, and sapphire would scratch at an 8 or 9. We haven't seen a sapphire phone in quite a long while. This Black Shark 5 Pro scratches at a level 6, with deeper grooves at a level 7. There is a 16 megapixel hole punch selfie camera also under the front glass, just below the super thin earpiece speaker. Is it just me or does this kitten add a strange level of guilt to the durability test? Analyzing the sides is where we get a closer look at the metal physical clicky trigger buttons, along with the metal textured slider that unlocks the magnetic mechanism. We also have the scratchable fingerprint scanning power button. Damaging this will probably come back to bite us later. And we have another physical metal trigger up in the top corner. The top of the phone has more metal, along with one of the stereo loudspeakers. The left side has a metal volume rocker, with a lot more metal. Moving to the bottom of the phone, we have our second stereo loudspeaker, along with the 120 watt USB-C port. Which as a bonus, when you plug in the phone it's able to bypass the battery altogether so you can run the phone on wall power without adding any cycles or drain to the battery. We have our dual SIM card tray but no expandable memory, and no IP rating. And unfortunately, with frosted glass there is also no Art Class with Jerry. The camera units, however, are rather impressive. Up here we have the 13 megapixel ultra wide camera, with a 108 megapixel camera in the middle, and a 5 megapixel telephoto down at the bottom, all protected by glass. The bottom flash area though, is made from plastic, which is a little unique since everything else is glass, but also not a big deal. Flipping the phone around again, totally forgot about Mittens over here, the Black Shark 5 Pro is rocking a 6.7 inch 1080p 144htz refresh rate and 720htx touch sensitivity rate, which is important for gaming. And also the reason Mittens here is tugging at our heartstrings so much is because it's a 10 bit with 1 billion colors OLED panel and lasted for about 25 seconds before going white and mostly recovering. Now I'm not really sure why I do the fingerprint scanner tests anymore since none of them lately are functioning well with my fingerprints. Although to be fair, we did scratch this one up beforehand. It is side mounted on the power button where I like them, but it's unable to set or recognize my fingerprint, neither with my thumb nor my pointer finger, so take that how you will. Now for the bend test. Mittens doesn't get a pass just because it's cute. And plus, I don't even really like cats. Bending from the back there is a decent amount of flex once again near that antenna line, kind of like we saw on the Nothing Phone. And bending from the front we get a whole hole appearing between the frame and the glass, with some substantial separation. But the Black Shark 5 Pro locks out without any cracking or actual breaking. Mittens and her physical buttons survive this round. Nice work, Black Shark. It'll be fun to see how those magnetic triggers work from the inside, especially since Black Shark says they can survive for over 1 million presses. Someone, not me, should count those. Hit that subscribe button if you haven't already so you don't miss it. Come hang out with me on Instagram and Twitter. And thanks a ton for watching, I'll see you around.",
    "transcript_keywords": [
        "Black Shark",
        "phone",
        "Shark",
        "Black",
        "Black Shark gaming",
        "Shark gaming phone",
        "gaming phones",
        "gaming phone called",
        "Stamps.com",
        "leaving Black Shark",
        "phones",
        "gaming",
        "phone called",
        "durability test",
        "Pro",
        "battery",
        "back",
        "glass",
        "test",
        "gaming phones tend"
    ],
    "transcript_entity_values": [
        "Black Shark",
        "the Black Shark 5 Pro",
        "the Black Shark 5",
        "the Nothing Phone",
        "YouTuber",
        "95%",
        "9",
        "30%",
        "6",
        "8",
        "just 15 minutes",
        "minutes",
        "Stamps.com",
        "Instagram",
        "5 minutes",
        "15 minute",
        "100%",
        "OLED",
        "Glass",
        "Jerry",
        "6",
        "108 megapixel",
        "the Black Shark",
        "4 week",
        "75%",
        "120 watts",
        "later this week",
        "6.7 inch",
        "17 minutes",
        "Etsy",
        "RGB",
        "40%",
        "the Jerry Rig Everything Knives",
        "10 minute",
        "Amazon",
        "more than 1,200",
        "hundreds",
        "1 billion",
        "USPS",
        "10",
        "Ebay",
        "120 watt",
        "this year",
        "5 megapixel",
        "5",
        "a few years",
        "the Nothing Phone",
        "the Nothing Phone",
        "last year",
        "first",
        "second",
        "a few minutes",
        "720htx",
        "over 1 million",
        "today",
        "Black Shark",
        "86%",
        "One",
        "16 megapixel",
        "about 25 seconds",
        "This Black Shark 5 Pro",
        "0-100%",
        "13",
        "Shopify",
        "one",
        "Twitter",
        "IP"
    ],
    "transcript_entity_types": [
        "LOC",
        "ORG",
        "LOC",
        "PERSON",
        "NORP",
        "PERCENT",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "TIME",
        "ORG",
        "ORG",
        "TIME",
        "TIME",
        "PERCENT",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "QUANTITY",
        "LOC",
        "DATE",
        "PERCENT",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "TIME",
        "ORG",
        "ORG",
        "PERCENT",
        "FAC",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.1529918611049652,
        0.05590500310063362,
        0.020788956433534622,
        -0.01940392330288887,
        0.04699234664440155,
        -0.06446364521980286,
        0.07031440734863281,
        -0.030217887833714485,
        -0.04957952722907066,
        0.05492844805121422,
        0.04159492999315262,
        -0.022038962692022324,
        0.007160059176385403,
        0.01822051592171192,
        0.016047945246100426,
        0.03719286620616913,
        0.09950719028711319,
        -0.04862977936863899,
        -0.06831386685371399,
        0.09717010706663132,
        -0.010086442343890667,
        -0.05062999948859215,
        0.027872206643223763,
        -0.05423982813954353,
        -0.04178199544548988,
        0.009468385018408298,
        -0.004676713142544031,
        0.003229293040931225,
        -0.1069180965423584,
        -0.0708182081580162,
        0.03863251581788063,
        0.054480209946632385,
        -0.0392807200551033,
        0.016934959217905998,
        0.03762434050440788,
        -0.05702105164527893,
        -0.0047687324695289135,
        -0.013086694292724133,
        -0.05358782038092613,
        0.005953327752649784,
        -0.05991334468126297,
        -0.051906101405620575,
        0.020850015804171562,
        0.0251961350440979,
        0.015631532296538353,
        0.03134073317050934,
        0.030243773013353348,
        -0.005405769217759371,
        0.005503551103174686,
        0.012057953514158726,
        -0.004573599435389042,
        -0.07507167011499405,
        0.04006078466773033,
        -0.08141960203647614,
        -0.07890983670949936,
        0.01574084907770157,
        -0.009787685237824917,
        -0.0505465492606163,
        0.05653539299964905,
        -0.04132205620408058,
        0.0398448221385479,
        0.02044818364083767,
        -0.09767113626003265,
        0.08350750803947449,
        -0.005506708286702633,
        0.06199711188673973,
        0.04723457992076874,
        -0.06216926500201225,
        -0.015687737613916397,
        -0.0189097560942173,
        -0.007767410948872566,
        0.03886103630065918,
        -0.040427885949611664,
        -0.0633404403924942,
        -0.00963464006781578,
        0.03480127453804016,
        0.04844390228390694,
        0.010476029478013515,
        0.02298581972718239,
        0.06828798353672028,
        0.05023878812789917,
        -0.061005257070064545,
        -0.04969354346394539,
        0.025867702439427376,
        0.08482430130243301,
        0.023049112409353256,
        0.028158653527498245,
        0.08437255769968033,
        -0.10576003789901733,
        -0.08529261499643326,
        -0.04015767201781273,
        0.10420968383550644,
        -0.009313798509538174,
        -0.05282948538661003,
        -0.04380148649215698,
        -0.04107055813074112,
        -0.1274760216474533,
        -0.11136574298143387,
        -0.06878599524497986,
        0.036064911633729935,
        -0.04403708502650261,
        -0.0033578176517039537,
        0.0517597459256649,
        -0.0347273088991642,
        0.08073707669973373,
        0.0072268289513885975,
        -0.06148087978363037,
        0.09127867221832275,
        0.011885975487530231,
        0.022159699350595474,
        -0.05286984145641327,
        0.011603792198002338,
        -0.04536375403404236,
        0.0055802431888878345,
        0.08060173690319061,
        0.02794562466442585,
        -0.03940180316567421,
        0.11250288039445877,
        0.12735025584697723,
        -0.028852811083197594,
        0.04945901408791542,
        0.02650446817278862,
        -0.07426784932613373,
        -0.07033801078796387,
        0.0019699919503182173,
        0.03440673276782036,
        -0.04410943761467934,
        3.86995735898935e-33,
        0.05768522247672081,
        0.07571789622306824,
        -0.013980701565742493,
        -0.020767299458384514,
        -0.000614476331975311,
        0.016473092138767242,
        0.025667700916528702,
        0.022355981171131134,
        0.020698808133602142,
        0.09546942263841629,
        0.0007330222288146615,
        0.04055064916610718,
        -0.04984581097960472,
        0.027664726600050926,
        0.07810968160629272,
        -0.01643182709813118,
        -0.00939884502440691,
        -0.06915387511253357,
        -0.025833498686552048,
        -0.025802740827202797,
        -0.005312478169798851,
        0.039162635803222656,
        0.04914100840687752,
        -0.02808920294046402,
        0.04510967433452606,
        0.08876976370811462,
        0.016619006171822548,
        -0.06357107311487198,
        0.045546043664216995,
        0.029425231739878654,
        -0.10862801223993301,
        -0.04067238047719002,
        -0.02214311994612217,
        0.04106335714459419,
        -0.003446184564381838,
        0.0805782601237297,
        -0.017049724236130714,
        -0.05243012681603432,
        0.004158355295658112,
        0.00891268253326416,
        0.0097199073061347,
        -0.027047811076045036,
        -0.05905529856681824,
        -0.0028614732436835766,
        -0.03259911388158798,
        -0.002979568438604474,
        -0.04869862273335457,
        -0.09197545051574707,
        -0.05661291629076004,
        0.011928272433578968,
        -0.0027547318022698164,
        -0.05845383182168007,
        -0.0038095377385616302,
        0.025786008685827255,
        -0.10571465641260147,
        -0.03262646123766899,
        0.05303484946489334,
        0.006059182807803154,
        -0.012754145078361034,
        0.036153070628643036,
        0.03081386350095272,
        -0.04597536474466324,
        -0.027120433747768402,
        0.023659545928239822,
        -0.06142672896385193,
        0.010760488919913769,
        0.06194367632269859,
        -0.0021595314610749483,
        -0.07190801203250885,
        0.021028021350502968,
        0.03391969949007034,
        0.035871900618076324,
        0.08006171137094498,
        -0.07985442131757736,
        -0.022673213854432106,
        0.039772044867277145,
        -0.010649294592440128,
        -0.07357087731361389,
        0.0024405138101428747,
        -0.03219125419855118,
        -0.05789995193481445,
        -0.017176689580082893,
        0.047472033649683,
        -0.0024897900875657797,
        -0.017331616953015327,
        -0.011916923336684704,
        0.03159857913851738,
        -0.055894240736961365,
        0.0678272470831871,
        -0.011978156864643097,
        -0.0538855642080307,
        -0.07934404164552689,
        0.0004974129260517657,
        -0.03533773124217987,
        -0.005081048235297203,
        -6.21099990905803e-33,
        -0.007160468492656946,
        -0.07993277162313461,
        0.02465224824845791,
        0.02493089996278286,
        -0.03448064625263214,
        -0.018870538100600243,
        0.09075313806533813,
        0.11189629137516022,
        -0.028366653248667717,
        -0.03271162509918213,
        -0.018186988309025764,
        0.10458415746688843,
        -0.018744196742773056,
        -0.007955959998071194,
        0.08204568177461624,
        -0.020096905529499054,
        -0.0008007381693460047,
        -0.023412616923451424,
        0.04053036868572235,
        0.014495862647891045,
        0.06790874153375626,
        0.035690851509571075,
        0.028680335730314255,
        0.09069167822599411,
        0.017608534544706345,
        0.02592512033879757,
        -0.023137418553233147,
        -0.07459622621536255,
        0.10894014686346054,
        0.01726960949599743,
        -0.0003335627552587539,
        0.055900558829307556,
        0.06017207354307175,
        0.0009126982185989618,
        0.02170247584581375,
        0.033769432455301285,
        0.03670140728354454,
        0.05465507507324219,
        0.022346673533320427,
        -0.04402417317032814,
        0.0027988438960164785,
        0.03435986861586571,
        0.0010054493322968483,
        -0.02296975441277027,
        -0.024924198165535927,
        0.03542790561914444,
        -0.017751339823007584,
        -0.013528058305382729,
        -0.05512036383152008,
        0.06443339586257935,
        -0.0020682692993432283,
        -0.021861009299755096,
        -0.04571285471320152,
        0.009841516613960266,
        -0.08923746645450592,
        0.0024627558887004852,
        0.05236263945698738,
        -0.1009339988231659,
        0.032136961817741394,
        0.00935683399438858,
        0.06749287247657776,
        0.031453099101781845,
        -0.05114441365003586,
        -0.050255872309207916,
        -0.028224008157849312,
        0.05228018760681152,
        0.12840469181537628,
        0.01365916058421135,
        0.053451091051101685,
        -0.011852124705910683,
        -0.041888996958732605,
        -0.042083028703927994,
        -0.016624242067337036,
        -0.04384514316916466,
        0.005613771267235279,
        -0.002190203173086047,
        -0.09808778762817383,
        -0.02452091872692108,
        -0.012492676265537739,
        -0.01994641125202179,
        0.02845236472785473,
        -0.01367646548897028,
        0.034845467656850815,
        -0.013477501459419727,
        -0.005922595504671335,
        -0.05800357833504677,
        0.055066030472517014,
        0.0033461826387792826,
        -0.00043012009700760245,
        -0.062119338661432266,
        -0.03116600587964058,
        0.05356987565755844,
        -0.046013593673706055,
        0.10850445181131363,
        -0.030455274507403374,
        -5.7594096602997524e-08,
        0.0626298114657402,
        0.05391164869070053,
        0.010413841344416142,
        -0.027073562145233154,
        0.01136370562016964,
        -0.017890360206365585,
        -0.025498010218143463,
        -0.07056207209825516,
        0.0662311315536499,
        -0.034449055790901184,
        0.014672729186713696,
        -0.049505073577165604,
        0.011571487411856651,
        0.07814288139343262,
        -0.031734440475702286,
        0.12380596250295639,
        0.025654323399066925,
        -0.006587855517864227,
        -0.0012513878755271435,
        0.02669156901538372,
        -0.0818430706858635,
        0.06861656159162521,
        0.016302650794386864,
        -0.10337535291910172,
        -0.009622137062251568,
        0.012325049377977848,
        -0.11420223861932755,
        0.06461253762245178,
        0.10289054363965988,
        0.009743258357048035,
        -0.062103476375341415,
        0.05749465897679329,
        -0.0425933301448822,
        -0.008443988859653473,
        -0.04816732183098793,
        0.0064729955047369,
        0.054040323942899704,
        -0.04387590289115906,
        0.06993445754051208,
        0.04239955171942711,
        -0.05599699914455414,
        -0.08978244662284851,
        -0.07949233055114746,
        -0.00515446811914444,
        -0.07075797021389008,
        -0.12150676548480988,
        0.027882598340511322,
        -0.1253959685564041,
        -0.03009696491062641,
        0.05641987919807434,
        -0.06766147911548615,
        0.03626015782356262,
        -0.04691632464528084,
        -0.04157200828194618,
        0.0298574510961771,
        0.034598033875226974,
        0.005573667120188475,
        -0.004219535272568464,
        -0.0037135437596589327,
        0.02367820218205452,
        0.07202347368001938,
        -0.08411670476198196,
        -0.0433429554104805,
        0.05613379925489426
    ]
}