{
    "id": "0SqEY8j91tk",
    "title": "OnePlus Nord Durability Test! - Sacrifices were made...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-07-27T12:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=0SqEY8j91tk",
    "category": "Howto & Style",
    "tags": [
        "OnePlus Nord",
        "Nord",
        "OnePlus",
        "Flagship killer",
        "OnePlus pro",
        "smartphone",
        "technology",
        "oneplus nord unboxing",
        "oneplus nord review",
        "OnePlus nord bend test",
        "OnePlus Nord full review",
        "OnePlus nord durability test"
    ],
    "views": 4425263,
    "likes": 147116,
    "comments_count": 9762,
    "description": "Making a 'cheaper' phone means sacrifices have to be made somewhere... This OnePlus Nord Durability Test helps us find out where. Grab your Teardown Nord case here:  or the Teardown Skin from dbrand here:   The OnePlus Nord is one of the coolest looking phones that ive seen this year. The Vibrant marble blue is super eye catching. Today we are going to find out how durable the OnePlus Nord is with the Standard JerryRigEverythig durability tests. Starting with the scratch test, the seeing what the phone is made of with my razor blade. And finally finishing off with the bend test.   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.oneplus.com/uk/product/oneplus-nord-creator-case",
        "https://dbrand.com/teardown",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "So there's a new phone out. You've probably seen it the OnePlus Nord. It's a little bit different than the normal OnePlus phones we've been seeing. Deviating from the gradual price increases we usually see, they brought it back down to a pretty fair 400 euros, which is about $460 right now...if they were being sold in the United States...which it's not. I'm a huge fan of the color. Inside the box underneath the welcome letter is a free soft clear rubber case with a frosted diamond design on the back. Probably going along with that north compass theme that the name Nord is based on. And it's even got a cool little water-resistant plug flappy thing for the charging port. Extra protection is always a good thing. Going deeper we have the 30 watt European warp charging brick. I'm not sure why OnePlus isn't selling the Nord here in the USA. It's kind of like they're avoiding the United States like we have the plague or something....Oh yeah. I think my favorite part of the new Nord phone though is its case selection. OnePlus teamed up with dbrand and I to make a custom OnePlus case for the Nord, with a blue battery that matches pretty darn well with the blue glass. This video isn't sponsored by the way. And I wasn't paid anything for helping them out with the case design. Nor do I get any commission from the sales of the case. It's just a fun little project between friends, and I think it turned out pretty well. I'll leave a link down in the description if you want to snag one for yourself. Anyway, let's get started. [Intro] If cases aren't your thing of course, we still do have the regular Teardown skin. Same transparent design and a sleeker form factor...But also, without that drop protection. Personally I think the skin looks pretty cool under that clear rubber case as well. It's pretty awesome of OnePlus to let us be involved in the design process. Now, we know the OnePlus Nord is a cheaper phone this time around. And to get that lower price point sacrifices do have to be made. Sometimes even sacrifices to durability. Lucky for us, OnePlus has included a free screen protector on the display. I'll peel that off so we can start with the actual scratch test. Remember, these Mohs picks help us differentiate between plastic, which scratches at a level 2 or 3, and glass, which scratches at a 5 or 6. And of course sapphire, which is level 8 or 9. The OnePlus Nord is using Gorilla Glass 5, which starts scratching at level 6, with deeper grooves at a level 7. I think this Robin's Egg Blue is one of the most eye-catching colors we've seen this year. There are two cameras on the front a 32 megapixel regular selfie camera, and an 8 megapixel ultra wide angle where you can fit more people...you know, for when it's safe to take selfies in groups again. Which for the rest of the civilized world is right about now, and in the USA it might be next year. There is a nice little black plastic buffer layer between the front glass and the frame of the phone always good to see. This kind of cushions the glass a little more than metal would if it's ever dropped. And it makes excellent curlicues. Speaking of metal though, this OnePlus Nord does not have a metal frame. The frame has the silvery shine of anodized metal, but it's actually just paint over plastic. You can see my razor blade carve chunks out of the lower portion of the phone, leaving the black plastic exposed. Not necessarily a deal breaker of course, we just haven't seen a plastic phone in quite a while. The volume rocker is made from metal. You can see the silver shining through from underneath my scratches. Making a phone out of plastic does save money. I think OnePlus just decided to use the Nord budget to improve the internals of the phone rather than the externals. The SIM card tray is also made from plastic and does still include the water-resistant rubber ring around the opening. The right side of the phone is also plastic, with a metal power button and a metal mute switch, which I'm still a huge fan of. And up at the top, more plastic. The back of the phone is glass. My razor blade does no damage and the logos are safe on the underside of that glass. OnePlus is calling this a quad camera setup with a 48 megapixel main camera stolen from the OnePlus 8. There is also an 8 megapixel ultra wide angle camera, and a 5 megapixel depth camera. Along with a 2 megapixel macro camera down at the very bottom. It's always nice to have options. And they are all protected under the scratch-resistant glass. Speaking of glass, under the front slab is a 6.4 inch 1080p display, with a 90 Hertz refresh rate, which is a nice improvement over the normal phones with their 60 Hertz. And we can see from the screen going white after about 25 seconds and never fully recovering, that the display is AMOLED. Testing out the underscreen fingerprint scanner, also a perk for a phone this price, we can tell it's an optical scanner by the way the screen lights up to illuminate my fingerprint through the glass. Ultrasonic fingerprint readers, like on the Samsung phones, don't need this extra light. After adding some level 7 deeper groove damages, my fingerprint is still able to be read and unlock the phone every single time. Nice work, OnePlus. Gets a thumbs up from me even though my hands are still covered in that glitter paint. Now remember, smartphone durability isn't everything. It's just one of the many aspects to consider when buying a phone. A good protective case can solve many structural issues, and the OnePlus Nord does have some structural issues. Nothing major happens with the first bend from the back, even though the phone was left a little kinked. It's only when bending from the front that we hear the first snap. I try not to get spooked when my phone cracks, but I am only human. It turns out it was the frame near the volume button. And once that last shred of structure was gone, the rest of the screen was soon to follow. The interesting thing to note here though is that the entire phone is still mostly fine. The exterior glass is not cracked at all on both the front and back surfaces. It's just the interior display underneath the glass that's broken...cracked like a potato chip...or a robin's egg. The Gorilla Glass on the outside of the phone is still undamaged and unshattered. I actually saw something similar to this happen on a $5000 TV one time, but that's a different story for a different day. The OnePlus Nord is not going to break on its own of course. The amount of stress I put on phones isn't normal by any means. But the Nord should indeed try to stay out of extreme situations, and avoid back pockets. Most phones that pass through my tests do not end up breaking. A hard case is always a good idea no matter what phone you own. And with this OnePlus Nord I'd say a hard case is probably a great idea. Remember, this video only focuses on the durability aspect of the phone, and even though the OnePlus Nord failed my durability test, it still is a good phone. Like I said before, durability is only one aspect to consider. But like always, let me know your thoughts down in the comments. We'll dive deeper into the phone during the teardown video. So come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "OnePlus Nord",
        "Nord",
        "phone",
        "OnePlus",
        "glass",
        "case",
        "plastic",
        "Nord phone",
        "phones",
        "United States",
        "metal",
        "OnePlus Nord failed",
        "normal OnePlus phones",
        "camera",
        "megapixel",
        "OnePlus phones",
        "back",
        "Gorilla Glass",
        "pretty",
        "level"
    ],
    "transcript_entity_values": [
        "OnePlus",
        "8 megapixel",
        "6.4 inch",
        "9",
        "OnePlus",
        "6",
        "8",
        "Instagram",
        "32 megapixel",
        "two",
        "Mohs",
        "the OnePlus Nord",
        "6",
        "Hertz",
        "about $460",
        "only one",
        "SIM",
        "400 euros",
        "European",
        "next year",
        "30 watt",
        "this year",
        "5 megapixel",
        "Hertz",
        "the United States",
        "USA",
        "5",
        "90",
        "60",
        "first",
        "The Gorilla Glass",
        "this OnePlus Nord",
        "Samsung",
        "5000",
        "this Robin's Egg Blue",
        "3",
        "Nord",
        "48 megapixel",
        "about 25 seconds",
        "AMOLED",
        "The OnePlus Nord",
        "7",
        "Twitter",
        "2"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "GPE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "NORP",
        "DATE",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "ORG",
        "GPE",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "TIME",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.1276683360338211,
        0.07600625604391098,
        0.06391359865665436,
        -0.033924829214811325,
        0.03480805084109306,
        -0.11001760512590408,
        0.03905755653977394,
        0.08659861981868744,
        -0.055176276713609695,
        0.05482424795627594,
        0.028597360476851463,
        -0.01795892044901848,
        -0.03692047297954559,
        0.04115936905145645,
        -0.029624206945300102,
        -0.0527418851852417,
        0.042678795754909515,
        -0.049635786563158035,
        -0.04913631081581116,
        0.09080778062343597,
        0.0009549925453029573,
        -0.009575104340910912,
        0.017891764640808105,
        -0.04197029769420624,
        0.0049041761085391045,
        0.02318439818918705,
        -0.03036765567958355,
        -0.02965005300939083,
        -0.019726205617189407,
        -0.09227564930915833,
        0.0753621757030487,
        0.07579821348190308,
        -0.06217080354690552,
        0.05643193796277046,
        0.012245671823620796,
        -0.027174318209290504,
        0.050111230462789536,
        -0.004261639900505543,
        -0.1346297562122345,
        0.008679998107254505,
        -0.061972323805093765,
        0.013914363458752632,
        -0.0039133974350988865,
        -0.020910700783133507,
        0.024565041065216064,
        -0.04035908356308937,
        0.04752612113952637,
        -0.014344586990773678,
        0.023583920672535896,
        -0.007591034285724163,
        0.0025663617998361588,
        -0.029453236609697342,
        0.027261273935437202,
        -0.040755052119493484,
        -0.05422648414969444,
        0.050727613270282745,
        -0.02232816070318222,
        -0.007073975633829832,
        0.053231969475746155,
        -0.02620713971555233,
        0.09474685043096542,
        0.0011124113807454705,
        -0.011384151875972748,
        0.06306689232587814,
        0.007910401560366154,
        0.0017733838176354766,
        0.03232955187559128,
        -0.142764151096344,
        -0.08251418173313141,
        0.024677429348230362,
        -0.02192191779613495,
        -0.009468719363212585,
        -0.04239995405077934,
        0.026754062622785568,
        0.01694958470761776,
        0.09697037190198898,
        0.05216024070978165,
        -0.051516711711883545,
        -0.05719961225986481,
        0.03741198778152466,
        -0.040942393243312836,
        -0.013159692287445068,
        -0.028829744085669518,
        0.024982213973999023,
        0.050542112439870834,
        0.0821009948849678,
        0.032082006335258484,
        0.049150820821523666,
        -0.04657384380698204,
        -0.09219131618738174,
        0.08010342717170715,
        0.09412845224142075,
        -0.05297550559043884,
        0.02805321104824543,
        -0.009021679870784283,
        -0.033276695758104324,
        -0.07452765107154846,
        -0.02858494594693184,
        -0.013736146502196789,
        0.020985757932066917,
        -0.046072013676166534,
        -0.07337768375873566,
        0.015661774203181267,
        0.013288051821291447,
        -0.0008733608410693705,
        -0.05221087485551834,
        -0.05041955038905144,
        -0.060317687690258026,
        0.06085529178380966,
        0.03879496082663536,
        0.002553012454882264,
        0.008570480160415173,
        -0.035002708435058594,
        0.05427977070212364,
        0.027470676228404045,
        -0.05524464324116707,
        -0.06302738934755325,
        0.0626949891448021,
        0.108200803399086,
        -0.009435996413230896,
        0.028593946248292923,
        -0.02384064346551895,
        -0.05066337436437607,
        0.0007239899132400751,
        0.01950826495885849,
        0.003081040922552347,
        0.0046051545068621635,
        4.5528163537194175e-33,
        0.08478733897209167,
        0.11758852750062943,
        -0.014703731052577496,
        0.0025703615974634886,
        -0.04493715614080429,
        -0.007440967485308647,
        0.02399740181863308,
        0.08345330506563187,
        -0.06592622399330139,
        0.0741194412112236,
        -0.07052969187498093,
        0.03981688246130943,
        -0.029140530154109,
        0.03498658537864685,
        0.013728905469179153,
        0.032439831644296646,
        0.025254124775528908,
        -0.08131585270166397,
        -0.10139263421297073,
        0.03653894364833832,
        0.0022603131365031004,
        0.007982834242284298,
        0.02211640402674675,
        0.03499659150838852,
        0.11376502364873886,
        0.010537630878388882,
        0.06112249940633774,
        -0.05610106140375137,
        0.051844093948602676,
        0.017991987988352776,
        -0.11799345910549164,
        -0.0010791681706905365,
        -0.037965450435876846,
        0.054393116384744644,
        -0.029625045135617256,
        0.07707667350769043,
        -0.008907054550945759,
        -0.024269768968224525,
        -0.07438504695892334,
        -0.01753394864499569,
        -0.03459087386727333,
        0.01357327401638031,
        0.006034409161657095,
        -0.04932386800646782,
        0.049849703907966614,
        -0.028017910197377205,
        -0.04410402104258537,
        0.05547415465116501,
        -0.031996309757232666,
        -0.03594086691737175,
        -0.026314804330468178,
        0.030026216059923172,
        0.0472460500895977,
        -0.008976027369499207,
        -0.1067105084657669,
        0.03478001430630684,
        0.07059945911169052,
        -0.04728357866406441,
        0.06260507553815842,
        0.1056574359536171,
        0.02748207375407219,
        -0.02784477360546589,
        -0.0445641353726387,
        0.05531628057360649,
        -0.01762450486421585,
        0.00482235848903656,
        0.021011250093579292,
        0.004176178481429815,
        -0.05707552656531334,
        -0.03045651502907276,
        -0.04450488090515137,
        0.006537785287946463,
        0.010086679831147194,
        0.0007810664246790111,
        -0.011377820745110512,
        0.0031362259760499,
        -0.02737807296216488,
        0.04743726924061775,
        0.047591935843229294,
        -0.06990181654691696,
        -0.0702022910118103,
        0.04936429485678673,
        0.00940634310245514,
        -0.05832981318235397,
        0.0290889423340559,
        -0.05628296360373497,
        0.03453453257679939,
        -0.10251530259847641,
        -0.014914351515471935,
        0.02050282061100006,
        -0.009368693456053734,
        -0.04561788961291313,
        -0.045626770704984665,
        -0.07582009583711624,
        -0.01902218535542488,
        -6.040612737590309e-33,
        -0.06078248471021652,
        -0.0942264050245285,
        0.0038959833327680826,
        0.067806676030159,
        0.04741976782679558,
        -0.02712073177099228,
        0.05259255692362785,
        0.10203513503074646,
        -0.04429367557168007,
        -0.08137964457273483,
        0.04519212618470192,
        -0.010466297157108784,
        -0.03229841962456703,
        0.0011514323996379972,
        0.013054566457867622,
        -0.022472742944955826,
        -0.022688118740916252,
        -0.03710486367344856,
        -0.0013280113926157355,
        0.01817924901843071,
        0.02984713949263096,
        0.07205662876367569,
        0.04599243402481079,
        0.032716549932956696,
        -0.10390441119670868,
        0.016552137210965157,
        0.015317489393055439,
        -0.10373052209615707,
        -0.014645768329501152,
        -0.03540913015604019,
        -0.03883536532521248,
        -0.010028507560491562,
        -0.0043722521513700485,
        0.04260851815342903,
        0.04864189028739929,
        0.13521069288253784,
        -0.020099302753806114,
        -0.028767084702849388,
        0.04294241592288017,
        -0.03870883584022522,
        0.02578846924006939,
        0.04272103309631348,
        0.004010191187262535,
        0.02704758197069168,
        0.019552547484636307,
        -0.07506252825260162,
        -0.03665519878268242,
        0.03892635181546211,
        -0.01467043161392212,
        0.0508764274418354,
        0.053602565079927444,
        0.035579901188611984,
        0.02021574229001999,
        0.03138808533549309,
        0.013547761365771294,
        -0.0299387089908123,
        0.04679533839225769,
        -0.13245929777622223,
        -0.048405971378088,
        0.030566943809390068,
        0.03228961303830147,
        0.014703062362968922,
        -0.04618775099515915,
        0.02420320361852646,
        -0.020861685276031494,
        -0.05811307206749916,
        0.054573748260736465,
        -0.0381496399641037,
        0.0018241353100165725,
        0.02596931718289852,
        0.01351214200258255,
        0.031095659360289574,
        0.01968095451593399,
        -0.11530278623104095,
        0.030656758695840836,
        -0.008946926333010197,
        -0.08507224172353745,
        -0.0281506534665823,
        0.019113941118121147,
        0.002014224184677005,
        0.02892719767987728,
        -0.050335150212049484,
        0.03182985633611679,
        0.0875740647315979,
        0.11347509920597076,
        0.028971945866942406,
        0.04834313318133354,
        0.05427447706460953,
        -0.02632431499660015,
        0.011101987212896347,
        -0.050630051642656326,
        0.053817905485630035,
        -0.05863242223858833,
        0.08922543376684189,
        0.002785499906167388,
        -6.102698790755312e-08,
        0.05130505561828613,
        0.0728338435292244,
        -0.019859181717038155,
        -0.02141224965453148,
        -0.0052428776398301125,
        -0.037151649594306946,
        0.022011009976267815,
        -0.08987484872341156,
        -0.043849557638168335,
        -0.05679413303732872,
        -0.03299078717827797,
        -0.016871653497219086,
        -0.09579652547836304,
        0.09247753769159317,
        -0.04368776082992554,
        0.05418219417333603,
        -0.025339895859360695,
        0.08124901354312897,
        -0.005332467146217823,
        0.04295240342617035,
        -0.06604303419589996,
        0.03291790932416916,
        0.07087348401546478,
        -0.03787018731236458,
        -0.012522192671895027,
        0.03548729047179222,
        -0.08607927709817886,
        -0.0203873198479414,
        0.1095794141292572,
        0.03655962273478508,
        -0.017464764416217804,
        -0.031258463859558105,
        -0.0038025439716875553,
        -0.017892912030220032,
        -0.01759263686835766,
        -0.02902938611805439,
        -0.05757346376776695,
        0.04699668660759926,
        0.11149931699037552,
        0.02783040702342987,
        -0.02164269983768463,
        -0.013196246698498726,
        0.018089627847075462,
        0.040270473808050156,
        -0.030216867104172707,
        -0.06088796257972717,
        0.005320614203810692,
        -0.16091755032539368,
        -0.09802362322807312,
        0.0019706999883055687,
        -0.05814197659492493,
        -0.03909384459257126,
        -0.07459541410207748,
        -0.011262926273047924,
        0.007161315530538559,
        0.01223380770534277,
        0.04833487793803215,
        0.027058957144618034,
        -0.004048168193548918,
        0.04307003319263458,
        0.02934393100440502,
        -0.10049053281545639,
        -0.006323447450995445,
        0.09773445874452591
    ]
}