{
    "id": "0U1oNI1lHIM",
    "title": "The Most Average PC 2022",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-12-26T17:51:20Z",
    "video_url": "https://www.youtube.com/watch?v=0U1oNI1lHIM",
    "category": "Science & Technology",
    "tags": [
        "Steam",
        "Hardware Survey",
        "Average",
        "Most Average PC",
        "Gaming Rig",
        "Intel",
        "NVIDIA",
        "Gaming PC",
        "Budget",
        "1650",
        "1060"
    ],
    "views": 2920040,
    "likes": 91864,
    "comments_count": 4642,
    "description": "Shop Micro Centers Year End Deals:  Submit your Build to Micro Centers Build Showcase:  Visit Micro Centers Community Forum:   Ugreen deals this holiday season at  (Up to $40 OFF)  RIP the GTX 1060 6GB. The 1650 is now in first place, so we went digging through the rest of the Steam Hardware Survey to see if any other major changes have come about in the last two years.  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:30 Motherboard 2:30 CPU 4:20 Storage 5:50 Memory 6:35 Case 7:45 PSU 8:35 GPU 9:50 Peripherals 11:30 Gaming on it 13:05 Conclusion 14:41 Outro",
    "description_links": [
        "https://micro.center/hku",
        "https://micro.center/0fx",
        "https://micro.center/m2q",
        "http://bit.ly/3EXRhZS",
        "https://linustechtips.com/topic/1476527-the-most-average-pc-2022/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Two years ago, when we built our first most average gaming PC, the GTX 1060... (crowd gasping) Stood alone as the most popular GPU for gamers. But finally, all of that has changed. - [Crowd] Praise the 1650! - That's right, the great price raisening has taken its toll and for the first time that I can remember, the average gaming rig has actually gotten worse. And since game developers are always going to target the lowest common denominator for their low graphics settings, does this mean that game realism could actually take a step back? To find, out we're gonna be building a new most average gaming PC, because GPS aren't the only thing that's changed in the last two years. For instance, we've got a completely new sponsor! It's... UGREEN! UGREEN is taking your charging to the next level with their new 100 watt charger. It's a four in one charger that has three USB-C ports and a USB-A port while still fitting in the palm of your hand. Get yours today using the link down below. (energetic music) To make a proper comparison, we started by reassembling our last unexceptional winner and we reran all of our benchmarks. Driver updates can make a big difference over such a long period of time. And then we pored over the latest Steam hardware survey, along with the Amazon bestsellers, list to fill in the gaps for items like power supply, case, and storage. So without further ado, let's build it, starting with our motherboard, the B660M-G from MSI. And I know what you're thinking. Really? A 12th gen chip? Yes, actually, but I don't wanna talk about that yet. We chose this board because the top selling V660 on Amazon right now is $110 gigabyte board that we don't have, but we do have this similarly-priced guy from MSI with pretty much the same features, and no matter which one of them you end up with, it's enough to make you question why anybody needs a $500 motherboard. It doesn't have some of the latest bells and whistles, no support for front USB type C, and it only has two memory slots, which can make upgrading less economical, but it's got two gen four M.2 slots, support for two and a half gig LAN, and of course, an upgrade path to the latest 13th gen CPUs. With that out of the way, now we can talk about the CPU. The problem with the Steam hardware survey is that it doesn't report specific model numbers, only the brand, average base clock frequency, average core count, and an indicator for how many people have hyperthreading or SMT. On that note, 80% of you, by the way, have hyperthreading now, meaning that two threads per core is now overwhelmingly the norm. The average core count has also gone up, moving us from quad cores into the hexacore class. But wait, the average base clock is now just 2.3 to 2.7 gigahertz? I mean, even if Intel didn't still have two thirds of the market, AMD's recent chips pretty much all weigh in at around 3.6 gigahertz base. Our suspicion is that this is due to a couple of converging trends. First of all, older CPUs that have low IPC but extremely high clock speeds have really reached the end of their useful gaming lifespan and are likely being retired en masse. The second is that we know that laptops are a growing segment, particularly in gaming, and they tend to have high boost clocks but very low base clocks. We were able to find some modern desktop chips that closely fit the bill, though, and we settled on the Core I5-12400. Since it doesn't have any efficiency cores, only performance cores, it should be fairly representative of either a current gen Intel or AMD gaming experience, and it also happens to be a great bang for the buck choice at its last gen discounted price. for CPU cooling, the Hyper 212 lineup of heat sinks from Coolermaster must be mentioned due to its obvious popularity. However, some other great value options have hit the market in recent years, so it's not really the clear choice that it once was. As for our build, well, our CPU comes with a stock cooler and since it can't be overclocked due to restrictions on the motherboard chipset and CPU, we're gonna go ahead and use that, which also makes our installation a little bit simpler. Storage was a tough one. I think I'm gonna fire an email over to Valve and ask them if maybe in the future they can split it out by interface so that we can see the share of NVMe versus SETA drives. That could become a really important datapoint down the road, depending on how direct storage plays out. For now, though, the hardware survey doesn't give us much in the way of granularity. With only one terabyte plus for guidance, then, we erred on the side of plus, given that so many modern games will occupy 50 gigs or more of storage. And we felt that with the popularity, not to mention affordability, of M.2 NVMe drives, it made sense to go for the not the best but far from the worse Samsung 970 EVO Plus two terabyte. If Amazon reviews are anything to go by, you guys are on the same page here. It's only PCie Express gen three, which might not be as F-word as a gen four drive once direct storage hits the scene for real, if it does, but this thing has over 44,000 reviews maintaining a solid five star rating. And the best part is that if you don't need two terabytes for $165, the one terabyte version is only 90 bucks. That's incredibly affordable for this kind of performance, though it is still over double of what a retro polar fleece costs from lttstore.com, and this is much less comfortable to wear. Oh (beep)! How cool is it that affordable motherboards are coming with simple toolless SSD installation mechanisms now? Love to see it. Now, for memory... Uh, it hasn't really changed. Most of you are still rocking sixteen gigs, which is good, but one thing did change. We went with DDR4 rather than DDR3 this time around. We settled on a middle of the road kit from Corsair, a two by eight gig 3200 megatransfer per second CL16 kit. All three top spots on Amazon are variants of this Vengeance LPX kit with 72,000 reviews. No RGB, just straight performance is what the people want, so that's what we're gonna give them. Moving on to the case... What can I say? This thing is still on top, despite the new variants that massively improve on its performance. At over 30,000 reviews, it eclipses every other case in the top 10 list right now. I mean, it's almost never the worst choice to just pick what's popular, and the H510 is no exception. It's got good looks, a user-friendly layout, and it's fairly priced. I just think that a savvier shopper would venture just outside the box and maybe grab the Flow variant in hopes that it will better handle future GPU upgrades as we continue to march towards the industry goal of creating gaming processors that double as space heaters. This is the kind of thing I'm talking about with quality of life features. There's a little nubbin on the center motherboard standoff that allows you to just rest the motherboard there. I'm not saying I recommend doing this, I'm just saying that, mm, you could. By the way, the keen-eyed among you might have noticed that I'm missing an IO shield. Someone put this board back in inventory without it. It doesn't affect performance but it could affect the amount of EMI that's coming out of the back of the case. Not that the sheeple shopping approach is always the best. I'm about to contradict a lot of what I just said. Please do not just buy the most reviewed power supply on Amazon. The Thermaltake Smart 500 watt will almost certainly not immediately light on fire. We actually included its little brother in our entry tier holiday shopping guide, but we only did that because we were trying to fit in a very aggressive budget. We would never actually recommend that you skimp on power supply, so we're gonna put a couple of better options under the video that don't cost much more. For the purposes of this build, though, majority rules, so we grabbed a close enough equivalent off our shelf, complete with ketchup and mustard cables and no 80 plus efficiency badge whatsoever. Now let's talk about the big change, the GPU. It costs anywhere from 170 all the way up to $250 for a 1650 brand new. It wasn't very good when it launched and it's not very good right now. But with a new 3050, which would be the closest, you know, current gen equivalent going for at least $300, it's easy to see why, over the last few years especially but even now, most people have opted for the save a buck option and gone for one of these. It's got only a 128 bit bus, four gigs of GDDR5 memory, that is two gigs fewer than our 1060 from our last most average gaming PC, and a boost clock speed of up to 1665 megahertz. The problem with this card and the reason that I would not recommend picking one up, even if you're budget constrained, is that you can get a used 3050 for about the same price off of eBay or Facebook Marketplace. If you have one of these guys, though, don't feel bad about it, 'cause I'm about to game on it and I think our benchmark results might surprise you. Or maybe it won't surprise you, since we already said that game developers tend to target the hardware that's out there, and a whopping 6% of gamers are using this GPU. Oh, moving on to what we're gonna connect it to, we've got this, the Sceptre 24-inch 75 hertz. Does it even have a model name? The point is, it's not actually the most popular monitor, this 21 and a half inch 1080p beast from Acer, but it is the silver medalist and both of them have the same core specs. 1080p resolution, a slightly higher than standard 75 hertz refresh rate, which makes a huge difference over 60, by the way, and a very attractive price point. On that note, the wired version of the G502 from Logitech might seem like a bit of an odd choice on the most average gaming PC, given that it's priced at $80, but there's a method to this madness. Nobody actually pays $80 for it. It's currently $34 on sale, which is a whole lot of bang for the buck, and if the 50 plus thousand reviews are anything to go by, it's almost always on sale. Don't buy it for 80. For keyboard, realistically, anything is probably fine. Like, I would take a good mouse and a $6 keyboard over the opposite eight days of the week, so I grabbed this S101-3 from Red Dragon, it's membrane, it's super popular, and it'll get the job done. If you just need a keyboard, though, this actually comes as part of a keyboard mouse combo. There are a lot of options out there around this price point, or you could just see if your aunt and uncle really need that one that's sitting there collecting dust and just use that. Almost complete absence of RGB, just as nature intended it. The first thing you'll probably notice now that we're fired up, other than that, hey, it worked, is that despite us being able to install Windows 11, we're still on Windows 10, just like 65% of you out there. The top five games on Steam right now are CS:GO, DotA 2, Lost Ark, Warzone 2, and PUBG. Naturally, we benchmarked all of them, and honestly, when you look at this, we've got 220, 230 FPSs in CS:GO. All of them run pretty okay on either system, but whether it's the fewer CPU cores or the outdated DDR3 memory, our previous system simply didn't keep up quite as well in our two Battle Royale titles. We noticed more hitching and our 1% lows were much, well, lower, which results in a noticeably degraded experience, particularly in intense firefights. In DotA 2, we got about 150 FPSs, with Lost Ark hovering around 60, meaning that either of these systems, the most popular from now or two years ago, is gonna be perfectly fine with the most popular titles, and we did all of our testing at very high details, so if you want more FPS, you can just turn down the settings and you should be good to go for another year or two at least, all for the reasonable price of $735, which could fairly easily be cut down if you went for, like, a secondhand case or something like that. It's still a fair bit more than a console, but it's also a fair bit more useful than a console, since you can do so much more on PC, like emulating older games, browsing the web, chatting on Discord, et cetera. But unlike a console, our computer isn't even sort of 4K ready. Halo Infinite defaulted to low, so obviously, if we're gonna want strong frame rates, we're going to have to expect to turn details down a little bit, but whether it's Halo Infinite or whether it's other AAA titles, at 1080p, we found that everything was very playable and with no odd bugs to speak of. So if you target for your hardware what pretty much everyone else is running, game studios are sure to at least consider your system as they develop their upcoming titles. The bar does look like it's about to jump up, by the way, with the RTX 3060 gunning for the top spot, but that's another story for another day, just like this story about our sponsor... Micro Center! Holiday savings at Micro Center start now. The weather outside might be frightful, but these holiday savings are so delightful. Check out their amazing deals in store, from CPU and motherboard bundles all the way to desktops and laptops. They've got deals like the ASUS Tough Gaming A17 laptop for $400 off and the Acer Nitro 5 laptop for $490 off, in-store only. And if you need help choosing parts, no worries. Micro Center's PC Builder can assist with compatibility and help you get it fast with their 18 minute in-store pickup. For a fee, you can check the box marked same day pro assembly and Micro Center's expert technicians will assemble the PC for you. You won't see in-store exclusives like this anywhere else, so head down to your nearest Micro Center to get your deals today. Links for everything can be found in the description down below. If you guys enjoyed this video, maybe check out the first one, where we talked a lot more in detail about this machine. Oh yeah.",
    "transcript_keywords": [
        "average gaming",
        "Micro Center",
        "gaming",
        "average",
        "CPU",
        "gen",
        "average base clock",
        "average core count",
        "center",
        "average core",
        "Amazon",
        "core",
        "GTX",
        "motherboard",
        "Steam hardware survey",
        "thing",
        "top",
        "bit",
        "Micro",
        "popular"
    ],
    "transcript_entity_values": [
        "one",
        "hertz",
        "Acer",
        "500 watt",
        "eBay",
        "LAN",
        "DDR3",
        "two years ago",
        "1060",
        "eight",
        "Discord",
        "RGB",
        "230",
        "Corsair",
        "only one terabyte",
        "21 and a",
        "GPU",
        "Micro Center!",
        "Logitech",
        "GDDR5",
        "400",
        "AMD",
        "three",
        "eight days of the week",
        "V660",
        "80",
        "220",
        "6",
        "just 2.3 to 2.7 gigahertz",
        "over 44,000",
        "first",
        "PCie Express",
        "Battle Royale",
        "First",
        "Windows 10",
        "Lost Ark",
        "80",
        "EMI",
        "170",
        "3050",
        "24-inch 75 hertz",
        "Amazon",
        "MSI",
        "two terabytes",
        "735",
        "4",
        "Two years ago",
        "CPU",
        "$110 gigabyte",
        "6%",
        "Micro Center",
        "Intel",
        "Samsung",
        "Valve",
        "IO",
        "the last few years",
        "1080p",
        "Acer Nitro 5",
        "four",
        "12th",
        "490",
        "recent years",
        "50 plus thousand",
        "3.6 gigahertz",
        "H510",
        "1080p",
        "Coolermaster",
        "34",
        "the last two years",
        "five",
        "only 90 bucks",
        "the latest 13th",
        "sixteen",
        "over 30,000",
        "10",
        "M.2",
        "the ASUS Tough Gaming A17",
        "up to $250",
        "two thirds",
        "SETA",
        "Micro Center's",
        "18 minute",
        "two and a half",
        "mm",
        "3200",
        "80%",
        "two",
        "3060",
        "second",
        "128",
        "Warzone 2",
        "Halo Infinite",
        "two terabyte",
        "up to 1665 megahertz",
        "Red Dragon",
        "another day",
        "IPC",
        "another year",
        "at least $300",
        "65%",
        "75",
        "today",
        "1650",
        "1%",
        "Hyper 212",
        "SMT",
        "Windows 11",
        "AAA",
        "Facebook Marketplace",
        "72,000",
        "100 watt",
        "G502",
        "AMD",
        "GTX",
        "CL16",
        "500",
        "about 150",
        "2",
        "USB",
        "50",
        "165",
        "Halo Infinite"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "GPE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "WORK_OF_ART"
    ],
    "vector": [
        -0.07368442416191101,
        -0.05026834458112717,
        -0.0028744731098413467,
        -0.0346609391272068,
        0.0476749911904335,
        0.03020418994128704,
        -0.0484924353659153,
        0.02509179711341858,
        -0.049790434539318085,
        0.00595960533246398,
        -0.04792873188853264,
        0.022714082151651382,
        -0.018385257571935654,
        -0.041339244693517685,
        0.029245169833302498,
        -0.01982015371322632,
        0.02603241428732872,
        -0.10873565077781677,
        -0.04674363136291504,
        -0.008802245371043682,
        -0.00398272043094039,
        -0.06768457591533661,
        -0.03838864713907242,
        -0.0006941737956367433,
        0.01907816156744957,
        -0.0358455665409565,
        0.018390977755188942,
        -0.05506378039717674,
        0.035121187567710876,
        -0.012457242235541344,
        -0.05069363862276077,
        0.09330998361110687,
        0.048328667879104614,
        0.016874991357326508,
        0.08467962592840195,
        -0.06440454721450806,
        0.04067392647266388,
        -0.13121846318244934,
        -0.08050654083490372,
        -0.10403873026371002,
        0.006582087837159634,
        -0.02685827948153019,
        -0.01140089612454176,
        0.02130710519850254,
        0.05063213035464287,
        -0.01411602832376957,
        0.01153292041271925,
        -0.032211948186159134,
        0.0036195183638483286,
        0.08834236860275269,
        -0.003236382734030485,
        -0.07443591207265854,
        0.0391390323638916,
        -0.023426806554198265,
        -0.07778637856245041,
        0.051454491913318634,
        -0.03359929099678993,
        -0.03834439814090729,
        0.05071481317281723,
        -0.009489837102591991,
        0.036350201815366745,
        -0.16062991321086884,
        -0.06222684681415558,
        0.08706194162368774,
        0.015534784644842148,
        -0.002264539012685418,
        -0.03140970692038536,
        0.0212095994502306,
        -0.02935773879289627,
        -0.02193661406636238,
        0.021251102909445763,
        -0.030286002904176712,
        0.009421688504517078,
        0.06201039254665375,
        -0.007053454406559467,
        0.016247475519776344,
        0.03613860160112381,
        -0.024753175675868988,
        0.060672577470541,
        0.012995995581150055,
        0.010044887661933899,
        -0.01544018555432558,
        0.03222145885229111,
        -0.049822594970464706,
        -0.01780223473906517,
        -0.03709878772497177,
        0.08806806057691574,
        0.01958639919757843,
        0.0003737450169865042,
        -0.10717722773551941,
        0.004182838369160891,
        0.07406026124954224,
        0.0816684290766716,
        0.05050548166036606,
        -0.018889790400862694,
        0.039567384868860245,
        0.008639243431389332,
        -0.06570743769407272,
        0.022280296310782433,
        0.04714488610625267,
        0.03649299591779709,
        0.0907946452498436,
        0.056126900017261505,
        -0.033138059079647064,
        -0.08921124786138535,
        -0.0641154944896698,
        -0.018206259235739708,
        0.10599624365568161,
        -0.01349501684308052,
        -0.009922852739691734,
        -0.028990814462304115,
        0.07938621193170547,
        -0.04085112735629082,
        -0.01885971799492836,
        0.015466779470443726,
        -0.06372980773448944,
        0.0002361783990636468,
        -0.02097422443330288,
        0.05393792688846588,
        0.006903606001287699,
        0.019375775009393692,
        -0.03713049739599228,
        -0.047990117222070694,
        -0.02042013220489025,
        -0.06160588189959526,
        0.04855760559439659,
        -0.054611098021268845,
        2.0171703465301233e-33,
        -0.0649443194270134,
        0.0026421924121677876,
        -0.02696131356060505,
        -0.05250648781657219,
        0.0168047733604908,
        0.013996873050928116,
        0.056640975177288055,
        0.009885645471513271,
        -5.503079592017457e-05,
        -0.006466738414019346,
        -0.04315481707453728,
        0.05681507661938667,
        -0.09340732544660568,
        0.07905541360378265,
        0.062105365097522736,
        -0.06368131935596466,
        0.03500007838010788,
        0.04469847306609154,
        0.01712953671813011,
        0.01782708428800106,
        -0.002771425526589155,
        0.01140036340802908,
        0.06641288846731186,
        -0.04583446681499481,
        0.08010489493608475,
        -0.019938375800848007,
        -0.010459883138537407,
        -0.02851555310189724,
        0.0857052132487297,
        0.029585281386971474,
        -0.023002324625849724,
        -0.07626224309206009,
        0.04148479178547859,
        -0.06641935557126999,
        -0.010897231288254261,
        0.06459974497556686,
        -0.05739207565784454,
        -0.06711369752883911,
        0.05095266178250313,
        0.015174781903624535,
        -0.05010268837213516,
        0.08546460419893265,
        -0.09488611668348312,
        -0.13514405488967896,
        -0.038865827023983,
        -0.0058422693982720375,
        0.05187969282269478,
        -0.03410543128848076,
        0.024101991206407547,
        -0.001319647766649723,
        -0.09089706093072891,
        0.017391011118888855,
        -0.09679390490055084,
        0.03701406344771385,
        0.05926143378019333,
        -0.06278805434703827,
        0.048401910811662674,
        -0.07351958751678467,
        0.04083774983882904,
        0.061857737600803375,
        -0.0015456033870577812,
        -0.04930673912167549,
        0.026911217719316483,
        -0.03605637326836586,
        -0.06390193849802017,
        0.02902499958872795,
        0.05166146904230118,
        0.055611949414014816,
        -0.09157254546880722,
        0.01666206307709217,
        -0.031101904809474945,
        -0.020432299003005028,
        0.003418970387428999,
        -0.036821380257606506,
        0.018307438120245934,
        -0.020833181217312813,
        -0.09249957650899887,
        -0.04631039500236511,
        -0.04755648970603943,
        0.021154897287487984,
        -0.03743957728147507,
        0.042845070362091064,
        0.011400547809898853,
        0.06154526770114899,
        -0.0049399565905332565,
        0.05301365628838539,
        0.022267915308475494,
        0.03595161810517311,
        -0.05231325328350067,
        0.009926989674568176,
        -0.03315834701061249,
        -0.006066471803933382,
        0.011068006977438927,
        0.0387086495757103,
        -0.02674996852874756,
        -4.906181343178121e-33,
        -0.04694192484021187,
        0.021723417565226555,
        -0.05311840772628784,
        0.10153867304325104,
        -0.022330159321427345,
        -0.02427632361650467,
        0.05127004161477089,
        0.03711714968085289,
        0.029728896915912628,
        0.004451751243323088,
        0.01207560021430254,
        0.047994326800107956,
        -0.013508436270058155,
        0.04248461499810219,
        -0.03567374497652054,
        -0.06294868141412735,
        0.028010044246912003,
        -0.07425802946090698,
        0.0531650073826313,
        -0.0757802352309227,
        0.04235057905316353,
        -0.026617011055350304,
        -0.005410222336649895,
        0.003306247293949127,
        0.003919732291251421,
        0.02103932946920395,
        -0.025590995326638222,
        -0.00825749896466732,
        -0.022848090156912804,
        0.011148693040013313,
        -0.008455474860966206,
        -0.038461197167634964,
        0.00711829261854291,
        0.0463503934442997,
        0.12330497056245804,
        -0.06562123447656631,
        0.11638795584440231,
        0.06421814113855362,
        -0.0020372653380036354,
        -0.008109526708722115,
        0.06264708936214447,
        -0.04069213569164276,
        -0.004894556477665901,
        -0.026351358741521835,
        0.07748088240623474,
        -0.06948769837617874,
        -0.022049544379115105,
        -0.10237667709589005,
        0.03685867041349411,
        -0.010954001918435097,
        -0.0007955851033329964,
        -0.06882930546998978,
        0.06071103364229202,
        0.03696277365088463,
        -0.04176713526248932,
        -0.06182970479130745,
        0.008562074974179268,
        0.0433792807161808,
        -0.014640173874795437,
        -0.07205647975206375,
        0.0588853619992733,
        0.025642745196819305,
        -0.0771680399775505,
        0.007656143046915531,
        0.026775797829031944,
        0.011314119212329388,
        0.03898609057068825,
        0.03524116426706314,
        -0.07086849957704544,
        -0.015117222443223,
        -0.03200912848114967,
        -0.04290343075990677,
        -0.0113480594009161,
        -0.08088505268096924,
        -0.12322521954774857,
        0.0764477476477623,
        0.043329011648893356,
        -0.030593618750572205,
        0.09395560622215271,
        -0.05836733058094978,
        -0.03866316378116608,
        0.046310774981975555,
        0.04269935190677643,
        -0.01831977814435959,
        0.010237771086394787,
        0.006155618466436863,
        0.04880853742361069,
        -0.042920101433992386,
        -0.0600937083363533,
        -0.016402684152126312,
        -0.10359520465135574,
        -0.013292865827679634,
        -0.04641501232981682,
        -0.004513261374086142,
        0.0020565420854836702,
        -5.8894219279181925e-08,
        -0.019394604489207268,
        -0.005711526144295931,
        -0.006572952959686518,
        0.0306856669485569,
        0.012045386247336864,
        -0.05608946830034256,
        0.027770480141043663,
        0.05788302794098854,
        0.06461353600025177,
        0.048798758536577225,
        0.07359160482883453,
        -0.11496835201978683,
        0.004983742255717516,
        -0.02791053056716919,
        0.012372591532766819,
        0.03980030119419098,
        -0.04663776233792305,
        0.0407254658639431,
        -0.013661562465131283,
        -0.11061430722475052,
        -0.014211401343345642,
        0.08813006430864334,
        0.10553177446126938,
        -0.00954910833388567,
        -0.021909229457378387,
        -0.012001680210232735,
        0.038179781287908554,
        0.12711714208126068,
        0.08162081986665726,
        -0.07982314378023148,
        -0.06429892778396606,
        -0.04023968055844307,
        0.0017756976885721087,
        -0.032651398330926895,
        0.026026742532849312,
        -0.04610033705830574,
        -0.030993914231657982,
        0.08296655118465424,
        0.1285172998905182,
        0.0025273507926613092,
        -0.04416506364941597,
        -0.04009503498673439,
        -0.000624203123152256,
        -0.005161229055374861,
        0.07408521324396133,
        -0.026748035103082657,
        -0.06008540838956833,
        -0.018816029652953148,
        0.002785230055451393,
        0.056283287703990936,
        -0.04787922278046608,
        0.013406018726527691,
        -0.022155871614813805,
        0.05114978924393654,
        0.027066677808761597,
        -0.03289005532860756,
        -0.07052311301231384,
        0.03952517732977867,
        -0.024944022297859192,
        0.05064826086163521,
        0.014212665148079395,
        -0.14133411645889282,
        -0.08711712807416916,
        0.11189612746238708
    ]
}