{
    "id": "0X0Jm8QValY",
    "title": "iPhone 15 Review: Welcome to the Club!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-10-02T23:08:40Z",
    "video_url": "https://www.youtube.com/watch?v=0X0Jm8QValY",
    "category": "Science & Technology",
    "tags": [
        "iPhone 15",
        "iPhone 15 review",
        "iPhone 15 vs",
        "MKBHD",
        "iPhone 15 pro",
        "iPhone 15 Plus",
        "iPhone 15 plus review",
        "battery",
        "cameras",
        "overheating",
        "software",
        "update",
        "iPhone 15 update",
        "iOS 17 update",
        "iOS 18 update",
        "iOS 17.1"
    ],
    "views": 5866944,
    "likes": 151069,
    "comments_count": 9303,
    "description": "iPhone 15 is not new. But that doesn't mean it isn't good.  MKBHD Merch:   Tech I'm using right now:   Outro track:  Playlist of MKBHD Intro music:   Phone provided by Apple for review.  0:00 Intro 0:59 \"All new\" design 3:04 Let's get real about 60Hz 6:08 Performance and Heat/Battery 7:24 USB-C  8:09 Things that are actually new 10:11 Underrated camera upgrade 12:26 Verdict  ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - All right, so this is Apple's brand new, latest and greatest iPhone 15. And nothing inside is new or anything that we haven't seen before in some other phone somewhere. Now that doesn't mean it's not a good phone. You can actually be a really good phone and not really new, they aren't mutually exclusive. And it turns out, that is actually Apple's strategy with this phone. The more I use this phone, the more I see Apple's textbook, late mover advantage strategy coming into play here. They're gonna take something we've literally already seen before and then do it the Apple way. So on the outside, let's see, how would I describe this new phone's design? Kind of familiar, I don't know, somewhat reminiscent of the 14. How does Apple say it? - iPhone 15 has an all new design that's simply gorgeous. - All new? All new? Really? Okay, I mean, I don't know about all new but this phone definitely inherits the same looks and general design as last year again. But you know what's at least partially new is actually the way it feels in the hand. So I said this in the 15 Pro review, but they've done a good job softening the corners here. So it still looks boxy, still has aluminum rails, but it's more comfortable to hold, since these corners aren't as sharp, they're a little bit rounded off. And then, this is also the first glass-backed, non-Pro iPhone with a satin back, and I am loving the satin back, this is like a nice, soft touch, frosted glass back here. I know there's a super complicated process too to like get this single piece of glass on the back to be two different colors and two different thicknesses and all that, and I can totally respect it. But honestly, the colors, they are super weak. People were saying in the last video the the color grading must be off, it looks like it's white instead of blue. No, this blue phone really doesn't look that blue at all in almost any lighting, it's like 1% blue. But either way, you can say between the aluminum and the pale light colors, these are also probably the most fingerprint resistant iPhones in years. On the sides, same button placements, same speakers placements, same mute switch, no action button on this phone. Honestly, you could probably use an iPhone 14 case on the iPhone 15. But around the front, new screen, well, not new, again, but new to this iPhone, new screen. You now get the dynamic island on the non-Pro iPhones this year, which is very much doing the whole punch cutout the Apple way. So the notch is finally dead until maybe a new iPhone SE brings it back, it could happen. But also, slowly, app developers have been getting on board in useful ways over the past year. I already have a few favorites now, my airline app's giving me real-time flight info, my weather apps, Uber, et cetera. But while we're up here talking about the screen on this phone, it's also brighter, It's up to 2,000 knits now, which looks awesome outdoors. But also, it's 2023, and this is an $800 phone that still has a 60 hertz display. This is actually really fascinating to me. It's so odd. Like, on one hand, for most people buying this phone, it's totally fine. It literally doesn't have, it's a new baseline iPhone, have you talked to someone who buys a new baseline iPhone? They literally don't care. It doesn't matter, it's not something they pay attention to, you could ask them right now how many frames per second their phone is and they wouldn't have an answer, just doesn't matter. So just as long as it works and it's all relatively smooth like last year and the year before and the year before, it's totally a non-factor. I have actually literally handed 120 hertz phone to people next to a 60 hertz phone, and even side by side next to each other, they can't see the difference. Or if they do, it's just like, oh, that's a subtle thing that seems kind of neat but they'd be totally fine missing out on it. So with the target demographic of this phone, it's totally fine. But on the other hand, Apple, the richest technology company in the world, does stuff all the time that regular people will literally never notice, that are subtle improvements or changes here and there, all the time. Like, when they switched these baseline iPhones from LCD to OLED displays, do you think any of these people actually noticed that? Or what about going from the A15 Bionic last year to this A16 Bionic? Do you think people are actually noticing the differences here? Or what about when they just added 5G to the iPhone and most people didn't care? Like, making subtle improvements over time is what modern smartphones are all about these days. And I would actually argue that a higher refresh rate is more noticeable to more people than some of those other things. Like, I think you could today hand me, a professional, an unlabeled iPhone with an A15 Bionic and an A16 Bionic, and it would take me quite some time to find the real differences between them. And so, that combined with the fact that it's incredibly cheap and easy and reasonable to get to like at least a 90 hertz phone, isn't the new Moto G is like 90 hertz at $170 or something like that? Now I'm sure that's a horrible looking screen compared to this iPhone, it's 720P with the brightness of a box of crayons. But still they decided to add that to that phone because Motorola knew that enough people would notice it and feel that smoothness difference and it's a higher level of perceived performance. So it's just wild to me, knowing how easy it would be for Apple to make this even a 90 hertz display, but they just refuse to do it because they've attached the word Pro to that feature. It's promotion for the Pro phones. And it just strikes me as a tool just to sort of continue widening the gap as much as they can between the Pro iPhones and the non-Pro iPhones, and they're happy to do it, even if it makes this iPhone 15 the most expensive phone in the world with a 60 hertz display. Anyway, speaking of widening that gap, the Pro phones this year also got a brand new A17 Pro chip but this iPhone 15 gets last year's A16 Bionic from the 14 Pro. Honestly, the renaming of the Pro chip might be the most interesting part because it implies that it's definitely not going to trickle down to the baseline phone next year. But either way, this A16 bionic here is more than good enough in a phone of this price, as far as performance and handling everyday tasks and gaming and flying around iOS at 60 hertz. And the one thing you definitely can argue for 60 hertz would be battery life, because despite all the issues floating around, the battery life on these phones has been pretty good. So I don't know if you saw it, but Apple has officially now addressed the heat and battery issues that some people, including myself, have been reporting with these iPhones. So an iOS update is coming and it seems like some specific third party apps, like Instagram, were also having issues and those should be getting updates too. But on average, the battery life on my 15 has been better than my battery on the 15 Pro. And the 15 Plus looks to have the best battery life ever on any iPhone, which is really promising. So that combination of the A16 Bionic, which is not new, and 60 hertz screens, which are not new, are giving you great battery life. Also, USB-C is definitely not new but here it is alongside all the benefits that come with it, from using the same cable to charge everything, to plugging into more accessories, like monitors and keyboards and all kinds of other stuff. It is sad that the older chip does mean there's no USB 3 controller so there are no USB 3 data speeds, it's still slow, but honestly, unless you're using the Pro iPhone's camera features, there's almost nobody here buying this phone that's gonna actually need fast data transfer anyway so I guess you can give it a pass. And they managed to do it in the Apple way too. They color matched the inside of the USB-C port with the color of the phone, and they actually, I don't know if you've seen this, they print the model number inside the port. So Apple really loves hiding this in the most discreet way possible. You know, I should really gives some appreciation to some of the clever software features on the iPhone 15 because you could actually consider them new. So they added stuff like an ultra-wideband chip so you can find your phone more easily with an Apple Watch or be found on Find My Friends, that's new. They also added these clever audio effects and video effects at an OS level, so they work inside of any app. So you can be on a phone call or a video call or a Google Meet or Zoom or whatever, and flip on the background noise cancellation and it works really shockingly well, it's very, very good. So I'm on a phone call with myself, this is what it'll sound like to be in a room with the dishwasher running, the HVAC going, and the sink going right next to me, right next to the microphone. When I switch the mic from Standard mode to Voice Isolation mode, even though all the same noises are still happening, it does a much better job of just picking out specifically my voice, really smart and it's genuinely new. There's also some other not so new stuff, like they just now added downloadable offline areas to Apple Maps and interactable widgets, and they finally added an 80% battery charge limiter in the settings. So you can check out all this stuff, I did a full video on the iOS 17 update at the link below that like button, if you wanna watch that, you should definitely check it out after you watch this video. What I will say is one of the most liked features I talked about in that video is Standby mode. And on the Pro iPhone, when you put it on a charger, turn it sideways, it keeps the screen on which it can do because it goes to one Hertz, it's an LTPO display, and it's fine staying on like that. But on the non-Pro iPhone, which does not have LTPO, it's basically locked at I think either 30 or 60 hertz, either way it doesn't drop to one Hertz. So Apple just decides, we'll turn off the screen after a little bit, which kind of feels like it defeats the purpose of this feature, so then you have to nudge the table or or bump the stand to wake it up like an Apple Watch charger. Just a notable difference between the Pro and non-Pro iPhones. But last but not least, these new cameras are actually weird, but in a good way. So iPhone 15 has been upgraded to a new set of 12 megapixel ultra wide and the new 48 megapixel main camera. It's not the same sensor as the Pro, it's actually slightly smaller, but it has a larger max aperture of F1.6 to make up for it. And then, it's also doing a combo of binning and detailed transfer to give you this new 24 megapixel photo as a result by default. Now, if you were paying attention before, you'll remember that this new iPhone has the exact same chip as last year's Pro iPhone. Same processing cores, same image signal processor, same neural engine, same A16 Bionic, same everything. So why is this new 24 megapixel default only coming to the newest iPhone 15 and not last year's Pro? Like, I still have last year's Pro phone and I've updated it to the latest software and it does not get this feature, it's still shooting 12 megapixels. So honestly now my base iPhone 15's non-zoomed in photos are actually looking a little better, a little more detailed than last year's Pro phones. And then, there's the new auto-Portrait Mode detection feature, which is pretty sweet. Basically you don't have to switch to Portrait Mode to take a photo that captures all of the depth information that allows you to turn it into a Portrait Mode photo later. So as long as you're pointing the camera at a human subject or a cat or a dog as identified by the neural engine, or if you tap to focus, you automatically get this little F at the bottom corner of the screen, which means it's capturing the data needed for Portrait Mode, just in case. And so, then, later, if you decide, eh, I actually do want this to be a Portrait Mode shot, you go into your gallery and just make it a Portrait Mode photo, that you can even then go in and edit and play with. Some people have been describing it as being able to change the focus point later. It's not exactly doing that, you can't like save something that was out of focus by bringing it back. But basically, for the classic iPhone shot where it kind of looks like everything is in focus, then, yeah, you can play with Portrait Mode and get really good results. Last year's Pro iPhone has the same chip, also has a 48 megapixel main camera and has the same neural engine, doesn't get this feature, for some reason. Also kind of weird. So look, with these reviews, we always make a lot of judgements about what we think the typical iPhone buyer is, what they actually care about, what they'll notice, what they will appreciate about a new phone. And with this one, I do feel like they've stacked up enough of these subtle improvements, that even though it looks the same and there's not really that much that's actually new here, they've at least stacked enough things that it feels like an appreciably better phone. So my verdict is, if you have an iPhone 14, you don't have to upgrade, of course, even a 13 maybe. But if you have an older phone and you're looking to upgrade to a new iPhone, every year, I always get friends asking like, \"Oh, should I just get the older, like last year's iPhone to save some money?\" And no, I actually wouldn't, I would say just get the iPhone 15. There's enough new changes here, it's a better phone in every way and it's also USB. Like, you don't buy a base iPhone to get the bleeding edge of tech, you buy it just 'cause it works and it's fine and it's gonna be familiar and work for the next few years. And just knowing that you're gonna have it for the next few years, I would not recommend buying a Lightning iPhone as we just moved everything forward into the world of USB type C. Just get the new one, just grab the boring new iPhone with nothing that's actually that new. It's just gonna work. That's it, thanks for watching, catch you in the next one. Peace. (upbeat music)",
    "transcript_keywords": [
        "iPhone",
        "year Pro iPhone",
        "phone",
        "Pro",
        "Pro iPhone",
        "year Pro",
        "Apple",
        "Pro phones",
        "year Pro phones",
        "Portrait Mode",
        "year",
        "hertz",
        "mode",
        "hertz phone",
        "iPhones",
        "Pro iPhone camera",
        "Bionic",
        "People",
        "Pro phone",
        "Portrait Mode photo"
    ],
    "transcript_entity_values": [
        "every year",
        "a Google Meet or Zoom",
        "5",
        "today",
        "Apple",
        "iPhones",
        "Motorola",
        "one",
        "LCD",
        "years",
        "Moto G",
        "Hertz",
        "the next few years",
        "Find My Friends",
        "the A16 Bionic",
        "90",
        "90 hertz",
        "third",
        "13",
        "Pro iPhone",
        "15",
        "Last year's",
        "HVAC",
        "iPhones",
        "this year",
        "800",
        "Hertz",
        "Voice Isolation",
        "Apple Maps",
        "the A15 Bionic",
        "Apple Watch",
        "first",
        "USB-C",
        "iPhone SE",
        "Lightning iPhone",
        "an A15 Bionic",
        "at least a",
        "up to 2,000",
        "last year's",
        "A16 Bionic",
        "iPhone",
        "Portrait Mode",
        "14",
        "2023",
        "170",
        "non-Pro",
        "17",
        "the year before and the year before",
        "this A16 Bionic",
        "an A16 Bionic",
        "next year",
        "the past year",
        "second",
        "12 megapixels",
        "Portrait Mode",
        "12 megapixel",
        "60",
        "A17 Pro",
        "80%",
        "24 megapixel",
        "Instagram",
        "48 megapixel",
        "two",
        "non-Pro iPhone",
        "1%",
        "60 hertz",
        "last year",
        "USB",
        "120",
        "iPhone 15",
        "these days",
        "30"
    ],
    "transcript_entity_types": [
        "DATE",
        "EVENT",
        "CARDINAL",
        "DATE",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "NORP",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "FAC",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.08779117465019226,
        0.039904069155454636,
        0.08001957088708878,
        -0.06129448488354683,
        0.05469854176044464,
        -0.004820036236196756,
        0.0075276861898601055,
        -0.003969093319028616,
        0.028558775782585144,
        -0.004631720948964357,
        0.06467616558074951,
        0.02016502432525158,
        -0.026653852313756943,
        -0.028494499623775482,
        0.008629604242742062,
        0.028145870193839073,
        0.13971909880638123,
        -0.06463948637247086,
        -0.08612244576215744,
        -0.03806357458233833,
        -0.08264441788196564,
        -0.03346298635005951,
        0.060738202184438705,
        0.04754585400223732,
        0.020565012469887733,
        0.05695679038763046,
        -0.02944200672209263,
        -0.08385970443487167,
        -0.09109758585691452,
        -0.06512286514043808,
        0.03733667731285095,
        0.09321457147598267,
        0.08436427265405655,
        -0.029666559770703316,
        -0.04842093586921692,
        -0.052023693919181824,
        -0.025870176032185555,
        -0.017325766384601593,
        0.003615319263190031,
        -0.022299574688076973,
        -0.039202362298965454,
        0.003062464529648423,
        0.0008072062628343701,
        0.0673985406756401,
        -0.027377936989068985,
        -0.015020402148365974,
        0.009468680247664452,
        -0.030296342447400093,
        -0.014578607864677906,
        -0.04185738041996956,
        -0.04685879871249199,
        0.011168166995048523,
        0.026179246604442596,
        0.008172298781573772,
        -0.017530908808112144,
        0.0902566909790039,
        -0.033851779997348785,
        0.03498537093400955,
        0.11804467439651489,
        -0.023685280233621597,
        0.10657837241888046,
        -0.02000986784696579,
        -0.03922109305858612,
        -0.0314410924911499,
        0.021401099860668182,
        -0.08880844712257385,
        -0.034724391996860504,
        -0.03144630044698715,
        -0.03590882569551468,
        0.09365013986825943,
        0.03357452526688576,
        -0.03762255236506462,
        0.010754146613180637,
        0.022429315373301506,
        0.005490509793162346,
        0.04481380432844162,
        0.03356582671403885,
        0.01666654460132122,
        -0.021713780239224434,
        0.021174980327486992,
        0.04173380881547928,
        -0.038604218512773514,
        -0.009159576147794724,
        -0.05658552050590515,
        0.0281827412545681,
        -0.03696801885962486,
        -0.04345123842358589,
        -0.009267556481063366,
        -0.038963980972766876,
        -0.030070342123508453,
        -0.05591784790158272,
        0.08608506619930267,
        -0.07487255334854126,
        -0.009111694991588593,
        0.005811202805489302,
        0.04006057232618332,
        -0.07585567235946655,
        -0.051759764552116394,
        -0.045463260263204575,
        0.01609954610466957,
        0.07879054546356201,
        0.058470770716667175,
        0.03359410539269447,
        -0.018891476094722748,
        -0.007022087927907705,
        -0.14329437911510468,
        0.022394854575395584,
        0.019534442573785782,
        0.0041575501672923565,
        0.08001681417226791,
        0.03914673998951912,
        -0.01387922465801239,
        -0.060401543974876404,
        -0.01596846990287304,
        0.05406004562973976,
        0.03784556686878204,
        -0.057183656841516495,
        0.05990085378289223,
        0.07634667307138443,
        0.028818050399422646,
        -0.02963371016085148,
        -0.0030391179025173187,
        -0.052144087851047516,
        -0.06304985284805298,
        -0.1147741824388504,
        -0.04412171244621277,
        -0.0634470283985138,
        4.849361252337233e-33,
        0.020883137360215187,
        0.02601107768714428,
        -0.043313685804605484,
        0.04248359426856041,
        -0.012393029406666756,
        -0.12999117374420166,
        0.03080133907496929,
        0.027818894013762474,
        -0.029478419572114944,
        0.005210359115153551,
        0.0065223355777561665,
        -0.04390312731266022,
        -0.025264229625463486,
        -0.027320194989442825,
        0.05593975633382797,
        -0.041609641164541245,
        -0.13676239550113678,
        -0.09746570885181427,
        0.021007021889090538,
        0.012944361194968224,
        0.017290418967604637,
        0.017437690868973732,
        -0.029067182913422585,
        -0.05668960511684418,
        0.04188711941242218,
        -0.001821247162297368,
        0.05067715793848038,
        -0.025690212845802307,
        0.022631607949733734,
        0.0013371435925364494,
        -0.11091427505016327,
        0.03783818334341049,
        -0.05004868656396866,
        -0.05664154514670372,
        -0.016789067536592484,
        0.09167224913835526,
        0.08425582200288773,
        -0.053251929581165314,
        0.059339024126529694,
        -0.03457072377204895,
        -0.06683488190174103,
        0.020556939765810966,
        -0.12062327563762665,
        0.03186871483922005,
        0.048314694315195084,
        0.09194820374250412,
        -0.0716092437505722,
        0.006637596059590578,
        -0.05212520807981491,
        0.061911892145872116,
        0.0021179637406021357,
        0.0073506650514900684,
        0.027869002893567085,
        -0.0069828638806939125,
        -0.04829399660229683,
        0.08268775790929794,
        0.05869312584400177,
        0.03008895553648472,
        0.023279868066310883,
        0.07097237557172775,
        0.06979827582836151,
        -0.008097367361187935,
        -0.048665355890989304,
        0.04319457709789276,
        -0.06158113852143288,
        0.08175560086965561,
        -0.0358407087624073,
        -0.005618274677544832,
        0.016131596639752388,
        0.05605015903711319,
        -0.026876060292124748,
        0.035694319754838943,
        0.03111983649432659,
        -0.00646122545003891,
        0.09567257016897202,
        -0.009755814447999,
        -0.013648340478539467,
        -0.050930190831422806,
        0.025105055421590805,
        -0.03913639485836029,
        -0.019026117399334908,
        -0.0044557154178619385,
        0.008221961557865143,
        0.0014332315186038613,
        -0.003580652642995119,
        -0.026678308844566345,
        -0.0056421286426484585,
        -0.05927635729312897,
        0.017966050654649734,
        0.11755193024873734,
        -0.08257628977298737,
        -0.05329599976539612,
        -0.008236085064709187,
        0.09727932512760162,
        0.009463755413889885,
        -6.550467249212152e-33,
        0.05575966089963913,
        -0.05852440372109413,
        0.013752945698797703,
        0.0002081440616166219,
        0.005764770787209272,
        -0.007894065231084824,
        0.002355873351916671,
        0.04710381105542183,
        -0.015256737358868122,
        -0.030196068808436394,
        0.007920492440462112,
        0.008813655935227871,
        -0.025856265798211098,
        0.011965746060013771,
        0.02654208242893219,
        -0.047413419932127,
        0.01604418270289898,
        -0.08758549392223358,
        0.005584314465522766,
        0.08417442440986633,
        0.05710717663168907,
        0.062234893441200256,
        -0.0693238154053688,
        0.06117568165063858,
        -0.0929507464170456,
        0.011655774898827076,
        -0.04795265197753906,
        0.009730791673064232,
        0.009935164824128151,
        -0.08324539661407471,
        0.05590680614113808,
        -0.08534655719995499,
        0.03644154965877533,
        -0.024169811978936195,
        0.04018136486411095,
        0.05741726979613304,
        -0.005345064215362072,
        -0.04606672003865242,
        0.0007836233708076179,
        -0.01819531060755253,
        0.034992918372154236,
        0.008339242078363895,
        0.0011426301207393408,
        -0.00396512309089303,
        -0.007733757141977549,
        0.05684340000152588,
        -0.03604499250650406,
        0.017449241131544113,
        -0.029619578272104263,
        0.05167798697948456,
        0.078349769115448,
        -0.03040144219994545,
        -0.07293189316987991,
        0.021904826164245605,
        -0.10619622468948364,
        -0.009521630592644215,
        -0.0181005597114563,
        -0.016898861154913902,
        0.08212541043758392,
        0.04642047360539436,
        0.0984770879149437,
        0.04902541637420654,
        -0.011262794025242329,
        -0.12396068871021271,
        -0.06092469394207001,
        -0.02646242454648018,
        -0.020416609942913055,
        -0.05440026894211769,
        0.0393904373049736,
        0.09748252481222153,
        -0.13296106457710266,
        -0.012538849376142025,
        -0.03399612382054329,
        -0.015285051427781582,
        0.03637097030878067,
        0.02192268893122673,
        0.00015071114466991276,
        -0.019709767773747444,
        -0.016917692497372627,
        -0.022946437820792198,
        0.005155715625733137,
        0.08059979975223541,
        0.02467920072376728,
        -0.035726968199014664,
        0.0748642161488533,
        0.10239332914352417,
        0.029307713732123375,
        -0.03837869316339493,
        0.013194170780479908,
        0.08051518350839615,
        0.012633678503334522,
        -0.022540556266903877,
        -0.08184293657541275,
        0.0893547534942627,
        -0.052565570920705795,
        -5.6289252370334e-08,
        0.02856694534420967,
        -0.014548571780323982,
        -0.009334765374660492,
        0.017851458862423897,
        -0.013813722878694534,
        -0.0413261353969574,
        -0.009763195179402828,
        -0.010090692900121212,
        0.12463734298944473,
        -0.008557681925594807,
        0.04889829456806183,
        -0.04723183065652847,
        -0.0705915316939354,
        0.06480627506971359,
        -0.005879707168787718,
        0.018560556694865227,
        0.06379422545433044,
        -0.021190514788031578,
        -0.0005188433569855988,
        -0.005151706747710705,
        -0.008434210903942585,
        0.10583006590604782,
        0.0894239991903305,
        -0.08273833990097046,
        0.03609742969274521,
        0.03191114217042923,
        -0.053273946046829224,
        -0.02902596816420555,
        0.04234837368130684,
        -0.053437139838933945,
        0.022344399243593216,
        0.03723996505141258,
        0.027470631524920464,
        0.04435032978653908,
        -0.036075904965400696,
        0.003824436804279685,
        0.023616908118128777,
        -0.038999930024147034,
        0.049360666424036026,
        0.01378120481967926,
        -0.032335855066776276,
        -0.025539375841617584,
        -0.07144434005022049,
        0.005696513690054417,
        -0.05908733233809471,
        -0.08987496048212051,
        -0.020756836980581284,
        -0.0777597576379776,
        -0.03975493088364601,
        0.03360996022820473,
        -0.05943388491868973,
        -0.065778948366642,
        -0.03019954264163971,
        0.0057366774417459965,
        0.10738983005285263,
        0.0385376401245594,
        -0.006815492641180754,
        0.008494244888424873,
        -0.06968573480844498,
        -0.003586917882785201,
        0.03145303577184677,
        -0.0982658788561821,
        -0.01510416530072689,
        0.0925731286406517
    ]
}