{
    "id": "0xKSzEhOhV4",
    "title": "The Best Tech Under $50 - December 2016",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2016-12-22T22:26:27Z",
    "video_url": "https://www.youtube.com/watch?v=0xKSzEhOhV4",
    "category": "Science & Technology",
    "tags": [
        "gift guide",
        "tech gift guide",
        "2016 gift guide",
        "2016",
        "tech",
        "best tech under 50",
        "best tech under $50",
        "holiday tech",
        "holiday tech gifts",
        "best tech gifts",
        "tech under 25",
        "smart home tech",
        "best tech under 50 dollars",
        "tech under 50 dollars",
        "cool tech under 50",
        "tech under 50",
        "cool tech",
        "gadgets",
        "cool technology",
        "best tech",
        "best tech for gifts",
        "tech under $100",
        "top tech",
        "tech under 100",
        "black friday",
        "cool tech deals",
        "(つ▀¯▀)つ",
        "tld",
        "jonathan morrison"
    ],
    "views": 627764,
    "likes": 31888,
    "comments_count": 1360,
    "description": "Krystal's 2016 Holiday Tech Guide!  Philips Hue Motion Sensor:  SHIRTS ARE HERE! :D    Why I'm wearing glasses lol   To enter this gift guide just make sure you're subscribed here on TLD and then Krystal's channel (linked above). Contest will run for 1 week and we'll announce the winners on Twitter! Follow us to stay updated!     Philips Hue Motion Sensor -  Amazon Echo Dot -  Status BT-1 Headphones -  Superlux HD668B Headphones -  Google Chromecast -  Avantree Bluetooth Transmitter -  BHOLD Acoustic Pod -  Samsung PRO+ SD Card -  Oittm Apple Watch Car Charger -  TP-Link Smart Plug -   Add me on Snapchat!  My Gear:  Instagram:",
    "description_links": [
        "https://youtu.be/UwrdVlPfhNY",
        "http://www2.meethue.com/en-us/productdetail/philips-hue-motion-sensor#overview",
        "http://www.s2apparel.com",
        "https://youtu.be/xshYJVm6qFY?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "http://www.twitter.com/tldtoday",
        "http://www.twitter.com/lora_krystal",
        "http://amzn.to/2gTfg2U",
        "http://amzn.to/2hDTJIG",
        "http://amzn.to/2hDZyWR",
        "http://amzn.to/2hDX2zx",
        "http://www.bestbuy.com/site/google-chromecast-black/4397400.p?skuId=4397400",
        "http://amzn.to/2gTRZfS",
        "http://amzn.to/2hXp1JH",
        "http://amzn.to/2hDZGWc",
        "http://amzn.to/2gTi0gG",
        "http://amzn.to/2hXuobS",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday"
    ],
    "transcript": "- Wow, that's pretty Christmassy. - Thanks, buddy. Yo, guys, Jonathan here and welcome back to a special holiday edition of the Best Tech Under 50, so whether you're in need for a super last minute gift idea, or you're watching this after the holidays and need some ideas on what to spend those sweet gift cards on, this has you covered. Now quick announcement, the shirts are finally here, available to pick up. Huge shout out to everyone on Twitter who's rockin' 'em, they look amazing. And if you haven't checked 'em out yet, I will drop a link down below. So first up is the Philips Hue Motion Sensor. And huge shout out to Philips for not only sponsoring this gift guide, but also a really sweet giveaway. So if we can hit 10,000, no 20, no, 5,000 hundred million likes, or they delete my channel and Ralphy goes homeless, then we can give some stuff away. Or, I love you guys, and even if we hit 20 likes, I am givin' away some stuff. Now if you have Philips Hue, the motion sensor is pretty much a must have, because it gives you control of your lighting through motion. No talking, no pressin' buttons, simply movement. What's awesome with this, though, is A, it's battery powered, so there's no wires, and B, it can also attach magnetically, which allows you to place this pretty much anywhere. The ability to adjust it and place it in the optimal field of view for motion is a nice touch, but what I love most about this is how responsive it is. With this, you're not only able to simply turn on lights, but you can also trigger entire scenes with motion. So in this case, if I want something colorful when I walk by, bam. But more realistically, if it were the middle of the night and wanted somethin' dim, relaxed, with no blue tones so it didn't wake you up, you can do that as well. And then conversely, you can set it up to where it will automatically turn off the lights once you leave the room, which is perfect for those who tend to leave those on and drive up that electricity bill. So next up is the Amazon Echo Dot. The tiny baby brother to the Amazon Echo, and this is a great option to either extend Alexa into various rooms in your household or, in this case, if you already have a Bluetooth speaker, you can pair it with that and save some money. If you haven't jumped on the Echo train yet, it is kind of awesome. Alexa, turn off all the lights. - [Amazon Echo] Okay. - Alexa, turn on the lights downstairs. - [Amazon Echo] Okay. - You could also use it to play music. Alexa, play some Christmas music. - [Amazon Echo] Here's a station for Christmas music, Holiday favorites. (upbeat funky music) - Damn, Evans. (laughing) Alexa, stop, for the love of God, stop. (laughing) - [Man] You're gonna break something. - I think he broke his hip. So really not much more needs to be said. It is pretty awesome. Whether it's for yourself or someone else and you've been looking to get into the smart home game, this is a fairly inexpensive and also really great way to do so. Now following that, we've got a couple inexpensive headphone options, both of the wired and wireless nature. The first of which are the Status BT-1s, which are a simple, clean, lightweight pair of wireless headphones that right now are only about 40 bucks. Now these are on ear headphones and not over ear phones, so that, combined with the fact that they are lightweight like I talked about, means they're not gonna be cumbersome or feel like they're weighed down after longer periods of listening. What really stands out to me with these, though, is the sound quality. They're not gonna beat out Bose or Sony in that two to $300 range, but they are definitely gonna give headphones at least twice the price a run for its money which is really surprising. On the flip side, in the wired world, the Superlux HD 668Bs might be my new favorite headphones under 50 bucks. Right now these are around 40. They're not the flashiest, they're not the prettiest. They get a little bit bulky with the cable in and everything, but good God, these things sound really good for the price. The build quality isn't phenomenal, but there is a pretty substantial amount of padding, which makes these really comfortable for long periods of time. Now obviously, if you're on team iPhone 7 or any other phone without a headphone jack, you're gonna need to dongle it up to take advantage of these but if you do have a headphone jack and you don't have a ton of cash to spend, these are a fantastic pick up. Now next I'm gonna hand this one off to Miss Krystal Key. - Hey guys. So this is a Priva II from Avantree, and it's a tiny little device that acts as a multi point Bluetooth transmitter. And probably the biggest reason why you'd wanna use this is to send your TV's audio wirelessly to your Bluetooth headphones. So this is perfect for watching movies late at night without disturbing your sleeping family members or maybe even prevent them from disturbing you. And the latency on here is very low, too, and from what I can see the audio looks perfectly in sync and the sound quality is great with it using an aptX HiFi quality stereo codec. It's very easy to set up, too. You can slap it somewhere near your entertainment system, run an aux or RCA cable between the Priva II and your television, and then after that, you can easily sync any pair of Bluetooth headphones or earbuds you already have. Now you can have the Priva II run on a charge or plug it into an outlet or USB port on your TV. But the best part with using the Priva II, I think, is that you can hook up two Bluetooth devices and have them work simultaneously, so you can watch movie and shows with a friend, still without any noticeable latency and both 100 percent in sync. And you can even use this to turn other devices into wireless audio transmitters, like computers or audio interfaces. And the Priva II will only set you back about $50, which is already much cheaper than buying just one good pair of wireless TV headphones. - Now next, Google did launch their 4K Chromecast earlier this year, but if you don't have a 4K TV or something to watch 4K content on, then it kinda doesn't make sense, and if that's the case, the regular Chromecast is still a great option. For the most part, you can pick it up on sale for around 25 bucks right now, and if you have an HDMI equipped TV but can't access things like YouTube, Netflix, or Hulu, this is probably the cheapest and easiest way to do that. Going down the list next, is the BHOLD Acoustic Pod, and this is a very simple piece of tech. You place your phone in it and it amplifies things. Now, by no means is this gonna compete or replace a dedicated Bluetooth speaker, but if you want something simple, something you're never gonna have to charge, more importantly I think it leans to people who tend to use their phones for a lot of conference calls, this is gonna be a simple and effective way to amplify your sound. Now next, I know a ton of you out there shoot video, you take pictures, and with your cameras you're gonna need media, so I wanted to recommend one of my personal favorite SD cards, the Samsung Pro+. These are super fast, which is important if you shoot 4K video and more importantly, they're gonna allow you to transfer the files to your computer quickly. Unless you own a Macbook Pro, then you gotta get a dongle, that's a whole different story. But either way, this is a super solid SD card. Following that, we're gonna show a little Apple Watch love and when I first saw this, I was like, holy crap, that is actually a really smart idea. This is an Apple Watch car charger, and I've seen portable Apple watch chargers before, which kind of really don't make too much sense. But if you were ever to charge your Apple Watch in a situation that wasn't next to your bed, to me, the car is the perfect scenario. What I like about this is, A, it works right out of the box. You're not gonna have to install or buy any extra cables and B, there is also a USB port, so you're gonna be able to charge your phone at the same time. Build quality is fantastic. It feels really premium, so I've been really happy with this. And whether you've been looking for the perfect Apple Watch accessory for yourself or for someone else, I would definitely recommend picking this up. Next up is the TP-Link Smart Plug which has quickly become one of my favorite pieces of tech. So theoretically, you could use this to connect anything in your house, whether it's the TV, speakers, or in my case, I have it hooked up to the tree. I do of course have control through the app to turn it off and on. But again, it also does work great with Alexa, turn the office tree off. - [Amazon Echo] Okay. - Alexa, turn the office tree on. - [Amazon Echo] Okay. - The app is clean, it's simple, it's easy to navigate. I love the fact that you can apply different icons to different things in your house and again, if you own an Echo or Echo Dot, the integration was seamless. Aside from that, hopefully you guys enjoyed the video. If you did, and you are feeling like being awesome, make sure to go Austin \"break that hip\" Evans on that like button. And as far as that giveaway goes, I am teaming up with Krystal Key. We're giving away an Apple Watch, a Philips Hue starter kit, an Amazon Echo Dot, and a couple of these shirts. Now to enter the giveaway, all you gotta do is make sure you're subscribed here on TLD and then also to Krystal's channel. She just released a really awesome tech guide herself, so check that out as well, it's linked here and down below. This is Jonathan, and I will catch you guys later. (clapping) Whoo. Damn that eye though. - [Man] Alright, you ready to cut? - Yeah.",
    "transcript_keywords": [
        "Apple Watch",
        "Amazon Echo Dot",
        "Philips Hue",
        "pretty Christmassy",
        "Amazon Echo",
        "Echo Dot",
        "Philips Hue Motion",
        "watch",
        "Echo",
        "Bluetooth",
        "turn",
        "Apple",
        "Alexa",
        "headphones",
        "Apple Watch love",
        "Bluetooth headphones",
        "Priva",
        "Philips",
        "Hue Motion Sensor",
        "Christmassy"
    ],
    "transcript_entity_values": [
        "two",
        "only about 40 bucks",
        "Christmassy",
        "Apple Watch",
        "Echo or",
        "Krystal Key",
        "the Amazon Echo",
        "Chromecast",
        "the Priva II",
        "Hulu",
        "Evans",
        "SD",
        "Bose",
        "Twitter",
        "10,000",
        "5,000 hundred million",
        "50",
        "4",
        "Philips Hue",
        "TLD",
        "20",
        "about $50",
        "two to $300",
        "the Best Tech",
        "both 100 percent",
        "K TV",
        "Alexa",
        "USB",
        "Apple",
        "50 bucks",
        "K Chromecast",
        "Echo",
        "YouTube",
        "Krystal",
        "RCA",
        "Netflix",
        "iPhone 7",
        "a ton",
        "the TP-Link Smart Plug",
        "Amazon Echo",
        "Avantree",
        "HiFi",
        "Ralphy",
        "Google",
        "Holiday",
        "first",
        "one",
        "Austin",
        "Krystal Key",
        "the BHOLD Acoustic Pod",
        "jack",
        "Alexa",
        "Christmas",
        "a Priva II",
        "Samsung",
        "Philips Hue",
        "Philips",
        "Superlux",
        "Amazon Echo Dot",
        "the Philips Hue Motion Sensor",
        "around 25 bucks",
        "Sony",
        "earlier this year",
        "Yo",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON"
    ],
    "vector": [
        -0.10863155126571655,
        0.005680088885128498,
        0.0843350887298584,
        -0.028046397492289543,
        0.10585964471101761,
        0.027481459081172943,
        0.12626329064369202,
        0.0022574225440621376,
        -0.051940418779850006,
        0.026872357353568077,
        0.02278662472963333,
        -0.010450630448758602,
        -0.029051585122942924,
        0.013909307308495045,
        0.022103700786828995,
        0.010281787253916264,
        0.07981117069721222,
        -0.07620013505220413,
        -0.010816242545843124,
        -0.029886549338698387,
        -0.04216409847140312,
        -0.06216457113623619,
        0.05040306597948074,
        0.04061657935380936,
        -0.04904661700129509,
        0.1009673923254013,
        -0.021166037768125534,
        -0.08015932142734528,
        -0.11043106764554977,
        -0.058899179100990295,
        -0.012385313399136066,
        0.056659746915102005,
        0.053608883172273636,
        -0.04612455517053604,
        -0.05302336812019348,
        -0.11424765735864639,
        0.020944908261299133,
        -0.051660459488630295,
        -0.09011649340391159,
        -0.0304990503937006,
        -0.04813852906227112,
        -0.05651401728391647,
        -0.009092563763260841,
        0.02075457014143467,
        0.00850147195160389,
        -0.016902398318052292,
        0.045670561492443085,
        -0.011522559449076653,
        0.013714978471398354,
        0.026543883606791496,
        -0.011829795315861702,
        -0.04658551514148712,
        0.060052528977394104,
        0.03374811261892319,
        -0.04292328283190727,
        0.06608235836029053,
        -0.041077084839344025,
        0.0030849622562527657,
        0.051310908049345016,
        -0.04752536863088608,
        0.017643237486481667,
        -0.05961953476071358,
        0.0323864109814167,
        -0.004465795122087002,
        -0.07327727228403091,
        -0.027986744418740273,
        0.0020140507258474827,
        0.04003380239009857,
        -0.025987081229686737,
        0.015189189463853836,
        -0.04246629402041435,
        0.06166419759392738,
        0.07450088858604431,
        0.008014759048819542,
        0.08823371678590775,
        0.03495940938591957,
        0.10023266077041626,
        -0.07800481468439102,
        -0.026204966008663177,
        -0.00997430831193924,
        -0.043920889496803284,
        -0.08221621811389923,
        -0.06411365419626236,
        -0.007820740342140198,
        0.05535663291811943,
        0.004081537947058678,
        0.011701185256242752,
        0.030519727617502213,
        -0.09738409519195557,
        -0.06205908954143524,
        -0.07792691141366959,
        -2.5359666324220598e-05,
        -0.02176237665116787,
        -0.051561273634433746,
        -0.036100175231695175,
        0.03895726799964905,
        -0.05805353820323944,
        -0.02125772461295128,
        -0.02719276025891304,
        0.013083284720778465,
        0.07188943028450012,
        -0.014260439202189445,
        -0.004113157745450735,
        -0.029225938022136688,
        -0.005004211328923702,
        -0.06060699373483658,
        -0.061246443539857864,
        0.04520170018076897,
        0.09447046369314194,
        0.0254290122538805,
        0.0032821123022586107,
        0.013454336673021317,
        0.005806567147374153,
        -0.04140626639127731,
        -0.029167726635932922,
        0.040021300315856934,
        -0.06775079667568207,
        0.11812911182641983,
        0.14482028782367706,
        -0.008528502658009529,
        0.08579812198877335,
        -0.0035066630225628614,
        -0.010716302320361137,
        -0.02309119701385498,
        -0.024565469473600388,
        -0.010096533223986626,
        -0.0017711822874844074,
        7.704003365561079e-33,
        -0.006107689347118139,
        0.11360910534858704,
        -0.05859369412064552,
        -0.0010672020725905895,
        -0.03935237228870392,
        -0.0020374697633087635,
        0.01515275239944458,
        0.09581513702869415,
        -0.048975855112075806,
        0.009030118584632874,
        -0.019494395703077316,
        0.06466155499219894,
        -0.0946231260895729,
        0.021601831540465355,
        0.009325080551207066,
        -0.11125992983579636,
        -0.05308486521244049,
        -0.005629623308777809,
        -0.030404681339859962,
        0.005297748371958733,
        0.014328091405332088,
        -0.056313514709472656,
        -0.0031179487705230713,
        0.0505388081073761,
        0.0904727354645729,
        0.031009085476398468,
        0.03527010232210159,
        0.027881519868969917,
        0.09233643114566803,
        0.01141932513564825,
        -0.032816946506500244,
        0.031299855560064316,
        0.05218885466456413,
        -0.00905145425349474,
        -0.05300413817167282,
        -0.012599955312907696,
        -0.0657927617430687,
        -0.06070195883512497,
        0.010453525930643082,
        -0.08223006874322891,
        -0.028999703004956245,
        0.045846179127693176,
        -0.11995048075914383,
        -0.00025248649762943387,
        -0.02279762178659439,
        -0.027464255690574646,
        0.059380579739809036,
        0.06359013170003891,
        0.0003005719918292016,
        0.05187658593058586,
        -0.08067972958087921,
        -0.0900857001543045,
        -0.03080441616475582,
        -0.03828374668955803,
        0.009650863707065582,
        -0.07149661332368851,
        0.02448922209441662,
        -0.008260459639132023,
        0.057337503880262375,
        -0.05312468111515045,
        0.01741972379386425,
        -0.004486158490180969,
        0.035355523228645325,
        -0.11101003736257553,
        -0.05804559215903282,
        0.038173917680978775,
        0.09022735059261322,
        0.025215432047843933,
        -0.06299049407243729,
        0.028285261243581772,
        0.018564315512776375,
        0.07627923041582108,
        0.0179174542427063,
        -0.06675460189580917,
        0.031218742951750755,
        0.04014020413160324,
        -0.01398694608360529,
        -0.015687618404626846,
        0.00720138568431139,
        -0.046809837222099304,
        -0.04170512408018112,
        -0.0035326797515153885,
        0.04609979689121246,
        0.08220036327838898,
        0.014813692308962345,
        -0.010862103663384914,
        -0.03470286354422569,
        -0.06230001151561737,
        -0.10188210010528564,
        -0.01967724785208702,
        0.008367692120373249,
        -0.0019154669716954231,
        0.03946003317832947,
        0.0012380897533148527,
        -0.05007896199822426,
        -7.510675687153092e-33,
        0.037808019667863846,
        -0.01791863702237606,
        0.01443604938685894,
        0.05425266921520233,
        0.034622322767972946,
        -0.01959371566772461,
        0.04874531179666519,
        0.04573691263794899,
        0.05397871881723404,
        -0.016388211399316788,
        0.04174081236124039,
        0.005833359435200691,
        -0.0493454709649086,
        0.0002784225216601044,
        0.011384048499166965,
        -0.03661218658089638,
        0.03292728215456009,
        -0.04115632548928261,
        0.060121603310108185,
        -0.007558373734354973,
        0.01338903047144413,
        0.10840187966823578,
        -0.03297245502471924,
        -0.008560570888221264,
        -0.04254654049873352,
        0.079569011926651,
        0.013475121930241585,
        0.017837803810834885,
        -0.026631956920027733,
        -0.03382790461182594,
        -0.07771862298250198,
        -0.053430695086717606,
        0.004909937269985676,
        -0.008091157302260399,
        0.07006488740444183,
        0.042427174746990204,
        0.03589155524969101,
        -0.010444428771734238,
        -0.02276105433702469,
        -0.013016352429986,
        0.017644144594669342,
        0.026921311393380165,
        0.06603638827800751,
        0.03975297883152962,
        -0.009982536546885967,
        -0.06181178614497185,
        -0.0934174507856369,
        0.08690173178911209,
        -0.015984073281288147,
        0.0851481482386589,
        -0.01617739349603653,
        -0.018162226304411888,
        -0.04628511518239975,
        -0.027726590633392334,
        -0.07773252576589584,
        0.020174665376544,
        -0.0383295975625515,
        0.045265525579452515,
        0.04840298369526863,
        -0.008750594221055508,
        0.013077030889689922,
        -0.008529320359230042,
        -0.03853708878159523,
        0.029808489605784416,
        -0.0959399864077568,
        0.05201977118849754,
        0.09620537608861923,
        -0.00793414656072855,
        0.05477524921298027,
        0.011209719814360142,
        0.013346197083592415,
        0.08385957777500153,
        0.02238151617348194,
        -0.07051805406808853,
        -0.008909428492188454,
        0.011516127735376358,
        0.017507532611489296,
        -0.05838428810238838,
        0.006150652654469013,
        -0.03202927112579346,
        -0.03718980401754379,
        0.03216550126671791,
        0.06999789923429489,
        0.006174641661345959,
        0.047742970287799835,
        -0.008732201531529427,
        -0.050189290195703506,
        -0.014085507951676846,
        -0.03823782503604889,
        0.051771052181720734,
        -0.02205156348645687,
        0.07691960036754608,
        -0.01211574673652649,
        0.12832233309745789,
        0.022156590595841408,
        -6.546300568288643e-08,
        0.04979649558663368,
        0.06296079605817795,
        -0.03729531168937683,
        -0.07387141138315201,
        0.09042368084192276,
        -0.11513827741146088,
        -0.005774731747806072,
        -0.018140610307455063,
        0.008103346452116966,
        -0.03587193414568901,
        0.08984369784593582,
        -0.03707670047879219,
        -0.00768409576267004,
        0.02890568971633911,
        0.0538475438952446,
        -0.0033930079080164433,
        -0.02363782748579979,
        0.033795423805713654,
        -0.031260207295417786,
        -0.028733128681778908,
        0.046640217304229736,
        0.03187452629208565,
        0.028162742033600807,
        -0.008348671719431877,
        0.05738036334514618,
        0.02474885806441307,
        -0.004023988731205463,
        -0.004371748771518469,
        0.10964687913656235,
        -0.05434215068817139,
        -0.05140584334731102,
        0.00962336640805006,
        0.007905703037977219,
        -0.022290591150522232,
        0.02749013714492321,
        -0.07415486127138138,
        -0.10763631761074066,
        -0.01566447503864765,
        0.019286589697003365,
        0.02919590286910534,
        0.06835091859102249,
        -0.11098737269639969,
        -0.0881301760673523,
        0.020377833396196365,
        -0.04109066724777222,
        -0.12379969656467438,
        0.016037000343203545,
        -0.1127755418419838,
        -0.05621949955821037,
        0.07552658766508102,
        -0.07183915376663208,
        -0.05712303891777992,
        -0.013739094138145447,
        0.01158878579735756,
        0.027501089498400688,
        0.010007347911596298,
        0.08025192469358444,
        -0.007976898923516273,
        -0.018286461010575294,
        0.013226671144366264,
        0.04504503682255745,
        -0.046480897814035416,
        -0.06579211354255676,
        0.10088256001472473
    ]
}