{
    "id": "16gB2BDXwTo",
    "title": "What exactly is the goop inside a lava lamp?",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2020-11-21T16:23:24Z",
    "video_url": "https://www.youtube.com/watch?v=16gB2BDXwTo",
    "category": "Science & Technology",
    "tags": [],
    "views": 2913689,
    "likes": 116968,
    "comments_count": 8066,
    "description": "Yep! Gonna get questionably gloopy!  Seriously, Don't try this at home. Only use chemicals in ways they're meant to be used. Be good :)  Strings of text which take you places! Technology Connextras (the second channel that stuff goes on sometimes):  Technology Connections on Twitter:  The TC Subreddit   This channel is supported through viewer contribution on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. It's how I can make fun of products like these! If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!   And thank you to the following patrons! Andrew Diamond, Cole Campbell, Christopher Beattie, Paul Bryan, Samuel Kirzner, Daniel Pritchard, Brandon Tomlinson, Eric Loewenthal, Jeremy Samuels, Malcolm Miles, David L Jones, Matthew Burket, Noah Corwin, Andrew Roland, Luke Whiting, Smith8154 , Lars Jacobsen, Kenneth Siewers Mller, jacob kamphaus, Slysdexia , HurleyPotter, Tommy McCarthy, Andrew Bobulsky, On Ice Perspectives, Brian Wright, TheGreatCO , Petteri Hjort, Nathan Obuchowski, Shaun Puzon, Vlycop, Devon Hodgson, Zimpan , Filmmaker IQ, Jan Houben, Bren Ehnebuske, T.J. Zientek, Vernon , Ton Brands, Scott Wright, Kory Howard, rezonant , Thanasis Dimas, Adam Quartarolo, Marc Grondin, Hex , Craig Kollai, Daniel Barrera, Mark Stradling, Peter Sodke, Dee Dub, joseph , Kristian Scheibe, BigMcLargehuge510, Andrew Liendo, Nick , The Masterpiece, Sterling , Seanvdv , Chris Cody, Jason Portwood, Chad Fertig, Joseph Houghtaling, Ben Tucci, Dave Stares, Josh Braun, Joe Johnson, Daniel Dugger, Christopher Lowell, Oleg Korsunskiy, Michael Sacchi, Ali Elam, Dan Allen, Zhenbang Xiao, Jason Watson, Markus Towara, Barky doggo, Ectra , Martin Embeh, Reid Fishler, Daniel Meagher, Joel , Clemens , Bill Bates, Centronias , Dennis Walsh, Alex Warren, Paul Robins, CanyonMID , Les , Keenan Finucan, Ian Clanton-Thuon, Ryan Pratt, Paul Newton, Greg Golds, Theo Keeler, Tyler Alberico, Ben Ratner, WildMartin, Paul Sharp, Craig Brickey, Zidy , Brandon , Karl Kornel, Danila Fediashchin, Adam , Zach Rose, Patryk Majewski, Ryan Kamphuis, WB , AmbientCyan , Sam Calandra, Wolfgang Gschwendtner, Jzef Sokoowski, Will Preston, Stuart Stanfield, Christopher Olson, Kor Nielsen, Stephen Amar, Bryce , Andy Holzhammer, David Jeroslow, Charles MacDonald, Tim Jones, Crisco762 , Phil E, AnsulFolf , Jack Mudge, Raymond Coutts, Ian Spence, John De Witt, Mike A, Alex Dodge, hipp1eguy , Justin Derleth, El Jefe, NEON725 , Emily Eisenberg, Mark Christian, Dylan Leblanc, Bard , Megan Lovett, LGR, kn0tsin , David Wulff, FirstWizardZorander, Michael Riegel, Paul Kavanagh, Isaac Clarke, Sean Hearrell, Christopher Macdonald, Selectric , Keithius , Snke Schlter, Julian Haldenby, Seb Bacanu, Mauricio , Hunter Thornsberry, Austin C Borger, Gabe Cook, Anapan, Hodgkin LeBlanc, Michael Patron, Sonic Ether, mike quick, Kyle Ramer, Adam , Lucas , microserf , Daniel Kraut, Luka Sanzin, Peter Hillier, PeterH , William Holt, Ethan Hamel, Grant Campau, Else , Michael Dunn, Rin , Richard Hicks, Atlas Pup, Levi Maaia, Mike Roach, Simon Janssen, Jorge Caballero, Kyle Messner, Matthew Schwartz, gs , ashka , Mr. Yan, Matthias Feist, RedR0ze , adan c, Thomas Fuchs, Markus Wst, Alan Holland, Dan Boulden, Phiroze Dalal, Devin Rosenthal, Ray Hardman, G Cowell, Kevin Hamilton, Chase Tarson, Christopher D'Arpa, Marshall Kurtz, Matt Goldman, Hurf Durr, shaun morris, Miguel Gonzalez, Bryce Ontiveros, Kenneth A Cusson, Johnathan Reale, Charles Corbin, Simon Arrow, Brett Walton, Martin Schrder, lakewalk3r , Hayden McAfee, Dan Maku, Mark Injerd, Paul Demers, Michael Sandler, Jacob Harrington, Clay , Benjamin Deming, Thorbjrn Meyer, Eben , M1GEO , Michael Kaegler, Chrno , Colin Macdonald, Shlomi Borovitz, Krispin Miller, Jan Borcherding, Matthew Castellana, ., Sean Anderson, David , Jason Downs, Deviant Ollam, Dillan Weems, Eldrin_22 , Andrew Bogard, Craig Albert, Brandon Ryan, Travis Geiselbrecht, Pedro Brito, Ryan Milke, Marko , splateagle , Dale Crossley, MaikSan , Timothy Miller, Jim Renney, Steve Lafferty, Joseph Mayfield, Noah Dobson, William Astle, John Plasket, Avery Alexander, Don Eitner, Adam Belebczuk, Matt , Matt Lawrence, Matthew Krajnak, James Fuhrman, Brian Moore, Mark Majewicz, Logan Shelts, Matt Beard, Sebastian Mellor, Hildabun, Steets , Matt, Joel Jauregui, James Alexander, Joon Shin, Calvin Walton, Jesse Crawford, Justin Tokke, Ryan Morash, Matt Towers, digit777 , Tee Jay, Delliardo, Eidorian , MsWhit , Jeremy Price, Lydia Saunders, Nishith Thakkar, Samuel Colburn, C. Taylor, Evan Langlais, Andyface , Hugo Melchers, R Fisher, Sam Atkinson, PanicOpticon , Don Riesbeck, Marco Menendez, Rob Tapp",
    "description_links": [
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Hello and welcome to No Effort November, a series of videos for the month of November in which it is becoming increasingly obvious the title is a misnomer. Todays video is about lava lamps! Yes, those things that hang out in the set unceremoniously. Just doin their globular thing. Speaking of misnomers, unless the lamp has broken the lava is inside the glass so shouldnt they be magma lamps? These are important questions. Lava lamps have been a personal object of fascination for many years. They are objectively pointless objects, producing little to no usable light, and take literal hours to become operational, especially for larger ones, but once theyre going theyre downright transfixing and hypnotic. And the way they work is stupidly simple but at the same time - surprisingly complicated. And thats what were gonna be talking about today. First, the anatomy of a lava lamp. Ya got the base. Ya got the globe. And ya got a little hat to hide the fact that the globe is really just an oddly-shaped bottle, complete with bottle cap. Inside the base is an incandescent light bulb, often some kind of appliance bulb, and then when you put the globe on the base you end up with what amounts to a weird bottle on top of a light bulb. And that light bulb has to be incandescent because these things work thanks to the heat they generate, so its a good thing they use appliance bulbs since theyre unlikely to be phased out. Cant exactly put an LED bulb in an oven, can you? But as is the case for many things in life, its whats inside that counts. Clearly there are two substances inside this bottle: a clear one, and a not-clear one. Clearly they dont want to mix, and its also clear that the not-clear one is some sort of wax, clearly. When the lamp is cold, it forms a big ol clump at the bottom and some gentle inverting and shaking reveals that, clearly, this is a solid. That much is clear. Indeed, anyone whos ever owned a lava lamp and watched it warm up knows just how clear it is that were dealing with a wax. Except of course those who are both too impatient and too careless to read the labels plastered on the things that say to be patient and then leave product reviews claiming it doesnt work - those people are lots of fun. Anyway, a fun, frequent phenomenon found in flava flamps when they warm up is the Spiky Tower of Wax. Youll often find that the clump of wax at the bottom sort of pushes itself upward as the wax nearest to the bulb melts and expands, and once enough has melted it pokes a hole in the top of the dome, and then splooshes outward and upward where it resolidifies once in contact with the still-cold mysterious clear liquid. Then itll look like that for another half-hour at least, so be patient, Greg. You dont always get the Spiky Tower of Wax, sometimes you just get the Bloaty Glob of Indigestion, or the Fantastic Flippy Flip. No matter how the wax behaves in the beginning, it takes until the entire globe has warmed to the point that all the wax has melted (and can stay melted), and then you get variously colored jigglies. What a callback! Now heres where our friend physics makes for some magnificent magma magic. The wax, much like most substances out there, expands when it melts. Water does the opposite because its cheeky, but anyway once the wax melts its density is almost exactly that of the mysterious clear liquid. That means its not exactly gonna float, nor is it gonna sink. Itll just be suspended somewhat. But luckily for us, its density - and thus its buoyancy in the mysterious clear liquid - varies a tiny bit with its temperature. And also luckily for us, because the heat source is at the very bottom, we get a temperature gradient across the globes length with the hottest parts being at the bottom, and the coolest parts being at the top (farthest from the lamp). So, we end up with this cyclic behavior where the wax starts at the bottom, gets heated by the lamp, becomes ever-so-slightly buoyant in the mysterious clear liquid thanks to thermal expansion, and then it floats to the top. Once there, it cools a bit since its far from the light bulb, which causes it to contract ever-so-slightly, and thus it is no longer buoyant but in fact sinkyant, and then it sinks back to the bottom. And this repeats over and over and over and over and over and over and over and over and over and ov If youve watched a lava lamp for any period of time youll know that these globs of wax dont really want to combine with one another. Collisions are frequent but more often than not result in a bounce and not a smoosh. But there needs to be something to force them back together otherwise at some point youll just end up with a bunch of teeny tiny beads floating around as they continue to break apart. So, at the bottom of the globe is a coil of wire which serves to break the surface tension of these globs and force them into one big glob again. Thus the lamp can operate continuously. This also keeps the wax in contact with the hottest part of the glass at the bottom, making it heat faster and keeping things moving. Now, you might be wondering what this heretofore mysterious clear liquid is. Or for that matter, the wax. Ordinary candles are made of our ol friend paraffin wax, which melts at fairly low temperatures and so seems like would be a good candidate. But paraffin wax is much less dense than water and would never sink in it, so if it is paraffin wax, the mysterious clear liquid would have to be something else. Now there are clear liquids out there in which paraffin would sink, but many of them are flammable and thus pose a problem. A large quantity of, for example, acetone in a glass bottle above a light bulb would probably not get UL approval. Plus, many of these potentially OK liquids would mix with the paraffin and we cant have that. We need it to be separate like oil and water. So, as it turns out, that mysterious clear liquid is in fact water. Which now makes the wax a mysterious translucent substance. For what wax behaves like paraffin but also sinks in water? The answer is: paraffin. OK, so now comes the part of this video where I make my very own lava lamp fluids for my very own lava lamp. I've done this once before, and here is the beautiful result. Yes, the base is a bucket and the globe is a wine bottle but this is actually functioning like a real lava lamp. You can look online for home-made lava lamp recipes but most of them are, well, terrible. I mean, sure, theyre kid-friendly and most are designed for fun little science projects but vegetable oil in water isnt at all like the real thing. Eventually I found a recipe that is probably exactly whats in commercial lava lamps. Or at least, what once was - this recipe uses nothing but what can be found in a craft store and a Walmart, but one of the ingredients isnt available for sale in all fifty states any longer.... Yeah. And Ill explain that recipe shortly but first we need to swap out this cheap IKEA table that I care for at least a little bit with a folding table that I care for almost not-at-all. Cause you know, messy. Did that cut work? I hope so. Doesnt matter because this part didnt really go as planned exactly. I am one for three here, and Im fairly confident Ive figured out why. But first, for those of you looking at this lamp with its clear liquid and yellow wax and wondering where one can find such an uncommon color combination, well you cant! Thats because this lamps goop has been replaced with my very own, and as you can see its working quite well. There are some things Id like to improve about it but let me now explain how this was done. The wax is in fact ordinary paraffin wax. Ive used raw paraffin from a craft store rather than just melted some white unscented candles down, which Ive done because a previous lava lamp attempt with simple candles clouded the water. However, Ive discovered that perhaps the wax wasnt the issue there - more on that later. The water is ordinary distilled water (tap water would probably be fine, too, for what its worth), and a dash of dish soap, and kosher salt. Lets start with coloring the wax. What has proven to be the most difficult to recreate aspect of commercial lava lamps is the color. Paraffin, when it melts, is transparent but that would be kinda hard to see in a lava lamp. It might look cool if dyed with candle-making dye, but Im looking to recreate the translucent look of a real lamp. I found with this one successful wine bottle lamp that adding a bit of raw titanium dioxide powder seemed to work a treat to make it cloudy, but I added a bit too much and the consistency is kinda not great. This time I tried simple oil paints. I really just want the pigments inside of the paint, but the linseed oil base should hopefully dissolve into the paraffin well-enough. I experimented with blue, yellow, and brown (of course) and was quite happy with the result. In the end it still wasnt quite perfect, after some time the paint does settle out towards the bottom of the wax, but with enough movement it gets mixed up at least a bit. Id like to get my hands on some raw pigments like the titanium dioxide powder in here, and I may give powder paint a shot in the future. So long as it can dissolve into or be suspended in the wax and not leech into the water, itll work. Well mostly, well get to that. But anyway... So now that I had a reasonable method of coloring the wax, its time to discuss how you get the wax to sink. This part is where I think some mishaps occurred this time. We need to increase the density of the paraffin so that when its melted, it has a specific gravity of about 1 - that of water. So we need some sort of oil-soluble chemical that is very dense. And it turns out that a somewhat commonly-available automotive chemical fits the bill. What is it? dramatic sting Ah, so heres where I get a little disclaimery. This chemical is, to put it mildly, questionable. Its probably not particularly dangerous to be around, after all automotive technicians have for decades sprayed this stuff haphazardly all over brake parts and whatnot, but it is recognized to be a probable carcinogen with prolonged exposure, and there are also a lot of other anecdotal health effects associated with this chemicals use, so ya know I wouldnt consider this entirely harmless. Plus, I am not going to be using it for its intended purpose whatsoever so, with that in mind; This video is intended for entertainment purposes only and does not endorse the use of this or any other chemical product in a manner inconsistent with its labeling. Do not try this at home. And, aside from potential health and safety risks, this chemical also has certain environmental risks, too! Again, this isnt great stuff. What is it? Why, its tetrachloroethylene. Fun fact, this was widely used in dry cleaning, and I believe is still pretty common in the industry today! Dry cleaning doesnt mean things dont get wet, it just means they dont get wet with water. In the dry cleaning industry this is often called perc, short for perchloroethylene. And the reason why its environmentally problematic is the precise reason it is useful in lava lamps - its very dense. The specific gravity of this chemical (Im not gonna keep saying tetrachloroethylene, OK?) is 1.62, meaning that that is 1.62 times denser than water. Great for my needs, but a problem for soil and groundwater contamination because this stuff just sinks. And stinks, for that matter. This is probably the reason its been outlawed in some states. Newer formulations are various concoctions of other fun things. Now, to be clear, this environmental hazard is generally only problematic for big industrial spills. This stuff evaporates quite quickly, which is why in some states anyway were still selling it in spray cans like this, but Im just giving you yet another reason to consider this something that ought not to be played with. But it is exactly the sort of chemical we need to make paraffin denser. So heres what I did. First, I consumed the contents of and then cleaned out a couple of wine bottles to hopefully make into fashionable bucket lamps. Now, I found that the punt of the bottle - thats the protrusion upward into the body by the glass - should be minimal to nonexistent for best results, and we need to add some sort of coil to help the wax reform at and stick to the bottom, just like in a commercial lamp. It doesnt seem like it needs to be rust-proof as once its covered in wax it will pretty much always be covered in wax, so I used a couple of random springs. I learned from this previous wine bottle lamp that you want the coil to be a bit smaller than the diameter of the bottle, as otherwise the wax can form a giant ball that never touches it given enough time. After I was satisfied with the coil, I added distilled water to the bottle and placed it on the base. I wanted it to be close to operating temp for when I added the wax. As it was heating, I prepared the color of wax that I wanted in a glass jar using a double-boiler. After emptying the contents of a can of brakleen into a mason jar outside, I then added it to the wax - something like one third the volume of the wax seemed to work OK, but I was totally guessing everything here. Once it was mixed, and assuming the water in the bottle was hot, I dumped it into the bottle. Here the wax didnt sink so there wasnt enough brakleen in it. I experimented with using syringes to inject the brakleen into the wax, and this worked sort of OK but was quite slow and ended up in the thing I was hoping to avoid: little balls of way too dense wax rapidly sinking to the bottom. In the end I used a larger syringe without a needle to simply shoot into the top of the bottle. Once the bulk of the wax had sunk, it was on to the finessing. If the wax is too dense, this isnt a problem - we can easily make the water denser by adding salt to it, and in this case its best to use kosher salt which wont cloud the water. I found that it was best to make a very saline solution and use a syringe to add it to the water. Then I simply added the brine to the bottle until the wax started to float. Some fine-tuning was of course necessary, and luckily if you add too much brine well all you need to do is remove some of the liquid and replace it with plain water. This process is a bit finicky though, as you cant start with a full bottle unless you want to deal with overflowing, and I still had to remove some liquid anyway which means youre screwing with the ratio of salt to water once you add either brine or plain water... so... But in the end it wasnt much of a hassle and I found the process worked a treat. The idea of making the brine solution really made this a fairly straightforward affair, but heres where I ran into problems. The water was starting to cloud and I couldnt figure out why. It didnt seem like it was the paint - the earlier test didnt have any issue with clouding. And simply adding the salt alone shouldnt have clouded the water. Whats more, the wax seemed to be separating somehow, as if there were impurities in it. I didnt know what to make of this behavior until I happened to notice that the can of brakleen I had used for this wasnt purely tetrachloroethylene. It also contained petroleum distillate and trichloroethylene. Now, Ive had these cans for ages - I bought them something like a decade ago when I first tried this - and I never noticed that this one was different. I suspect that the other components were reacting to the paraffin wax which caused both the clouding of the water and weird impurities. And perhaps this was the culprit of my earlier failed wine-bottle lamp with cheap candle wax - perhaps the wax was never the issue. Regardless, Im considering the blue and brown bottles to be lost causes. It seemed as though the wax impurities could be removed with some finagling - a sort of crust was appearing on the surface of the molten wax and it could be removed with a pokey thing - but a couple of attempts at this were fruitless for the brown bottle. However, the yellow actual lava lamp, despite initially having the same clouding and impurity issues was spared somehow. After removing the crusty wax, it came back together with little clouding. I simply repeated that again, removing whatever tainted wax I could, and changed the water, and now it's remained almost perfectly clear. So thats neat. The yellow lava lamp went a little differently, of course. It started life as a brand-new pink wax with purple liquid lamp, a color combo Ive never really cared for despite being on sale forever, and after being warmed up just one time I unceremoniously opened the bottle cap and poured its contents out. A quick sniff test revealed that, for sure, commercial lava lamps are no longer using tetrachloroethylene in their wax. It smells almost like plasticky flour, or something like play-dough, nothing like the sweet chemical smell of this stuff. Im very curious about what this wax is, and its undoubtedly safer than this concoction Im cooking up. I cleaned its coil simply by running some boiling water over it, and washed out the bottle as best as I could. From there the process was the same, but this time I added too much brakleen and the wax immediately sank. I actually would prefer this to needing to add it to floating wax, but you do need to be careful because if you go overboard on the brakleen no amount of salt will get the wax to float. Luckily, though, not much was needed to get the lava flowing. The last thing needed to make a decent lava lamp is a couple of drops of dish soap. This helps keep the wax from getting stuck to the glass, but more importantly it makes the lamp more visually appealing. Without it, the surface tension of the water tends to keep the wax as just a couple of big blobs. The soap reduces that surface tension and so you get a more active lamp. In hindsight, it seems best to add the soap to the water before you even add the wax, however I began to suspect the soap may have been causing the clouding problems. It sorta was, but only because of the wax impurities caused by the non-pure brakleen. It seems like the soap was helping to get them out of the wax, which is I guess a good thing, but led to clouding. Now, this recipe is far from perfect. For one, it requires and absolutely perfectly sealed bottle. You can still smell the brakleen when its added to the wax which means its slowly seeping out of it and evaporating. With the wax underwater this doesnt matter - its not water soluble so it probably just stays in the wax, but even if it leached out into the water it would immediately sink to the bottom where wax would recombine with it again. However, if left open to air, enough of it will leave the wax over time to screw up the density. Ask me how I know. Also, well, the oil paint seemed promising but in the end... wasnt great. It seems like the linseed oil base isnt actually dissolving into the paraffin. It looked like it was, and perhaps its the bad brakleen thats messing this up, but over time the paint is sinking in the wax and not remaining suspended. Making things worse, the coil in this commercial lamp seems to be acting something like a strainer, so over time the wax becomes clearer and clearer. I can get the paint to recombine by sort of twisting the globe while its warm and the wax is settled at the bottom, but this is annoying and also - the paint just isnt combining well anymore and its all flecky and gross. I may try oil paints once more with the correct brakleen, but Im willing to accept that it just doesnt work. Now, the most remarkable thing about this process is how finely balanced it is. The difference between no movement and good movement was about 10cc of my brine solution, which itself had perhaps a gram of salt in it, if that. The overall change in specific gravity on the bottle was miniscule, but thats just the world of lava lamps. They are finely tuned bottles. Speaking of, some tips and tricks! Some lava lamps misbehave. This one here just loves to get bubbles in its wax. One thing you can try to help mitigate this is to lower the wattage of the bulb - Tech Tangents had success with this for a pesky lamp. He also noted that airflow around the lamp can affect its performance, which actually makes perfect sense given how fragile this buoyancy balance is. Tiny changes in temperature can make the wax sink or rise, and speeding up the rate at which energy leaves the bottle will greatly affect its behavior. If you want even finer control, you can put your lava lamp on an inline dimmer switch. Ive personally only found these necessary for the giant Lava Grande lamps - and eventually they added dimmers to the lamp bases themselves. I'm not even sure if they still sell those, though They really need something like 85 watts of output, which isnt exactly a normal bulb size. But, easy enough to make happen with a dimmer! And before I go, Id like to talk about how Im going to deal with this environmentally problematic goop Ive created. Its probably not the best idea to just send this to landfill, so Ill be keeping it. Im gonna melt all this failed wax down into a clump and keep it open in the garage because I suspect if exposed to air, eventually all of the brakleen will evaporate out of the wax. The old mason jars I was using way back when for this no longer have any odor to them, and the remaining wax has become harder with time (the wax and brakleen combo is quite soft as a solid - and whats left now feels like ordinary paraffin). So it seems like eventually it just evaporates, despite being dissolved in solid wax. Ill be curious to see how long it takes for the wax to off-gas, if it does. But if that fails, theres also option B. The boiling point of tetrachloroethylene is 250 degrees fahrenheit, or 121 celsius. Thats much lower than the flash point of paraffin, so I could also just put this in a toaster oven set to 300 degrees and wait a while. Probably best to put the toaster oven outside if Im gonna do that. But this should cause it to vaporize and enter the atmosphere where it will decay into less harmful stuff. Its lifetime in the atmosphere is estimated to only be 2 to 5 months, so Im not terribly worried about the impact of this, though I do want to be careful. Anyway, thanks for watching. I hope you enjoyed this video about lava lamps and one way they were made. I actually have no idea if this recipe was ever used in commercial production, and theres no way Im gonna remember where I came across it exactly, but if memory serves it did seem like it was, ahem borrowed from someone back in the day. If there are any chemistry-inclined folks out there who know of a more inert way to do this, or perhaps might have a guess at whats in lamps today, please do leave a comment. Id also love suggestions on how better to color the wax. What Im leaning more towards is actual candle-making dye for color, and just a bit of the titanium dioxide powder that's in here to achieve translucency. Though, as I said, I want to try powder paint and track down some raw pigments, too. I think the biggest issue with the oil paint is that the linseed oil isnt actually dissolving into the paraffin, and it appears much denser than the wax. Since the titanium dioxide power seemed to do so well for this one, I imagine any fine powder that can remain suspended in the wax will work. Ill report back if there are any significant findings. Toodles! volcanically smooth jazz Literal hours to become operational especially for lawl -- [and then weird mouth sounds] ...appliance bulb, and then when you put the I did that too soon! [sound of hair drier] This is so exciting! OK, so now comes eh no I need to.. Cuz its gobedy go do do I know what Im doing! I know what Im doing. I should probably mention that there is an alternate method to this that I want to try, thats one of the reasons why Im doing three total lamps, or I hope to anyway. [spatters as water boils over onto the hot plate] Ooh! Turn that down a bit... This recipe uses nothing but what eh biteh be Thats because this lamps goop has been replaced with my very own, and as you can see its wor - god thats hot. [laughing] Dont touch the bottom, you fool! Man this video was weird. And the hair! Eugh, why! It looked way better in the experiment shots. Gotta try and replicate that next time.",
    "transcript_keywords": [
        "wax",
        "Effort November",
        "lava lamp",
        "lamp",
        "lava lamps",
        "Water",
        "lava",
        "paraffin wax",
        "lamps",
        "bottle",
        "mysterious clear liquid",
        "commercial lava lamps",
        "paraffin",
        "clear liquid",
        "clear",
        "bottom",
        "November",
        "time",
        "mysterious clear",
        "liquid"
    ],
    "transcript_entity_values": [
        "about 1",
        "Fantastic Flippy Flip",
        "about 10cc",
        "1.62",
        "a decade ago",
        "121 celsius",
        "two",
        "the month of November",
        "November",
        "UL",
        "one third",
        "Ill",
        "decades",
        "literal hours",
        "the Spiky Tower",
        "fifty",
        "today",
        "another half-hour",
        "250 degrees fahrenheit",
        "first",
        "one",
        "Greg",
        "many years",
        "Ya",
        "One",
        "IKEA",
        "First",
        "300 degrees",
        "Lava Grande",
        "Walmart",
        "three",
        "2 to 5 months",
        "the day"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "TIME",
        "PERSON",
        "CARDINAL",
        "DATE",
        "TIME",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE"
    ],
    "vector": [
        -0.08904485404491425,
        -0.08582260459661484,
        0.10485997796058655,
        -0.10094032436609268,
        0.020712317898869514,
        -0.043381787836551666,
        0.10349138081073761,
        -0.001627800753340125,
        -0.04695546627044678,
        -0.07347925752401352,
        0.00369447423145175,
        0.014461134560406208,
        0.03568233922123909,
        0.010291722603142262,
        -0.0352868027985096,
        0.015101492404937744,
        0.020351888611912727,
        -0.12196901440620422,
        -0.028407294303178787,
        -0.04466652870178223,
        0.0650544986128807,
        -0.061719633638858795,
        0.0246119387447834,
        -0.01782001182436943,
        -0.026335492730140686,
        0.08659651130437851,
        -0.0034447854850441217,
        -0.04439703747630119,
        0.005000104662030935,
        -0.04981822147965431,
        -0.0217687226831913,
        0.07533013820648193,
        -0.10376138985157013,
        -0.05384431406855583,
        0.007133698556572199,
        -0.01868324540555477,
        -0.07687883079051971,
        -0.04181436076760292,
        -0.025273509323596954,
        0.023094192147254944,
        0.0006859137793071568,
        -0.18696002662181854,
        -0.009465496055781841,
        -0.0019119310891255736,
        0.05032435059547424,
        -0.014659358188509941,
        0.02430848404765129,
        -0.05847475677728653,
        -0.01714489981532097,
        -0.05698934569954872,
        -0.014702376909554005,
        -0.041368644684553146,
        0.05446754768490791,
        0.021497951820492744,
        -0.023247700184583664,
        -0.05026847869157791,
        0.01749829575419426,
        -6.056171332602389e-05,
        0.02471156418323517,
        -0.02711215242743492,
        0.09615079313516617,
        0.023206600919365883,
        -0.026189813390374184,
        0.033850252628326416,
        0.0384586937725544,
        -0.023608582094311714,
        -0.013261673972010612,
        0.037836577743291855,
        0.022011559456586838,
        -0.07746846973896027,
        -0.06007593870162964,
        0.018251927569508553,
        0.005939150229096413,
        0.07751837372779846,
        0.03726059943437576,
        -0.003860864555463195,
        0.015630897134542465,
        -0.029811842367053032,
        -0.015534504316747189,
        -0.001962844282388687,
        0.04774365946650505,
        0.03962108492851257,
        0.00026793882716447115,
        0.07578449696302414,
        -0.0445927232503891,
        0.02358853816986084,
        0.03486708924174309,
        0.0666557028889656,
        0.006408801302313805,
        -0.008968106471002102,
        -0.06396835297346115,
        0.0027700874488800764,
        0.029099028557538986,
        0.004629871807992458,
        -0.001393183134496212,
        0.020191891118884087,
        -0.06456063687801361,
        -0.0667266845703125,
        -0.02486562728881836,
        0.04439064487814903,
        -0.03514137119054794,
        0.021541960537433624,
        -0.035573989152908325,
        -0.09144020080566406,
        -0.0768633633852005,
        -0.0785401314496994,
        -0.04542252793908119,
        0.13806413114070892,
        0.1806659698486328,
        0.04567500203847885,
        -0.07901632785797119,
        -0.03534439951181412,
        0.008078844286501408,
        0.0024834938813000917,
        -0.08033593744039536,
        -0.05286940932273865,
        0.024041177704930305,
        0.010238997638225555,
        0.08012361824512482,
        -0.018313566222786903,
        0.05280599370598793,
        0.024760622531175613,
        -0.013443594798445702,
        0.029447130858898163,
        0.07456200569868088,
        -0.03820866718888283,
        -0.11992514133453369,
        7.518451582283781e-33,
        0.034556496888399124,
        0.10632244497537613,
        0.005132635124027729,
        0.02738993987441063,
        -0.002686671447008848,
        0.04560079798102379,
        -0.052139025181531906,
        -0.01674344763159752,
        -0.07756826281547546,
        0.00026939657982438803,
        0.0029497058130800724,
        0.0756538137793541,
        -0.042487725615501404,
        0.04747513681650162,
        0.011652850545942783,
        -0.06483137607574463,
        -0.05656987801194191,
        0.005925906356424093,
        0.0038842607755213976,
        -0.07503706961870193,
        -0.0556316040456295,
        0.03363015130162239,
        0.020699800923466682,
        0.02823115698993206,
        0.008313564583659172,
        0.02235294319689274,
        -0.11422713100910187,
        0.03873872384428978,
        0.03195393830537796,
        0.02781483344733715,
        0.05083167180418968,
        0.0257651936262846,
        -0.042954836040735245,
        0.0033973820973187685,
        0.01991831324994564,
        0.01802154816687107,
        -0.07345325499773026,
        -0.1576002538204193,
        -0.015230711549520493,
        0.001428393879905343,
        -0.024046896025538445,
        0.037557169795036316,
        0.08388683199882507,
        0.07931660860776901,
        -0.03488621488213539,
        0.03472781181335449,
        -0.042987387627363205,
        0.02342193014919758,
        0.012040538713335991,
        -0.04857778921723366,
        -0.042185768485069275,
        0.03822515159845352,
        -0.022351548075675964,
        -0.016164112836122513,
        0.0517926886677742,
        0.02815321274101734,
        -0.016703207045793533,
        -0.04680205136537552,
        0.04102298989892006,
        -0.03668053820729256,
        0.022799234837293625,
        0.07136771827936172,
        -0.0531185120344162,
        -0.014333531260490417,
        -0.1098155528306961,
        -0.009184782393276691,
        0.023459574207663536,
        0.05166144669055939,
        0.015725811943411827,
        -0.01949138753116131,
        -0.0596308559179306,
        0.004877644591033459,
        -0.03152388334274292,
        -0.015607867389917374,
        -0.05018075928092003,
        -0.03682396188378334,
        -0.012137371115386486,
        -0.036327674984931946,
        0.025507653132081032,
        0.07328379899263382,
        -0.027582431212067604,
        -0.13252505660057068,
        0.044081468135118484,
        -0.06768817454576492,
        -0.018727922812104225,
        -0.011970293708145618,
        0.03180074691772461,
        -0.023386895656585693,
        -0.02226811833679676,
        0.010705501772463322,
        -0.025875192135572433,
        -0.07116422802209854,
        0.01415396947413683,
        0.0407196581363678,
        -0.059357523918151855,
        -8.116112583176172e-33,
        -0.042779527604579926,
        -0.0509985126554966,
        0.0018606078810989857,
        0.04435412585735321,
        0.11897598206996918,
        -0.04541139677166939,
        0.0479399599134922,
        -0.05766364559531212,
        0.06476322561502457,
        0.01554642990231514,
        0.03042467311024666,
        0.07714883983135223,
        0.021758409217000008,
        -0.08781026303768158,
        -0.031594663858413696,
        -0.0217270664870739,
        0.03863464295864105,
        -0.0693897008895874,
        -0.0027775592170655727,
        0.04477106034755707,
        0.013125009834766388,
        0.0715215653181076,
        -0.10028047859668732,
        0.025182217359542847,
        -0.07477575540542603,
        0.061105940490961075,
        0.05064273625612259,
        -0.026333510875701904,
        -0.01748393289744854,
        0.05748004838824272,
        -0.010428840294480324,
        0.022779269143939018,
        -0.041795965284109116,
        -0.05153926834464073,
        0.026426589116454124,
        0.02255946770310402,
        0.09981964528560638,
        -0.05702488496899605,
        -0.023091400042176247,
        -0.11834991723299026,
        0.08538100123405457,
        0.002147083403542638,
        -0.018600955605506897,
        -0.03648783639073372,
        -0.06422270834445953,
        0.09380308538675308,
        -0.05298443138599396,
        -0.04196247085928917,
        -0.05825027823448181,
        0.0892752856016159,
        0.050271034240722656,
        0.008316556923091412,
        0.010044814087450504,
        -0.022790344431996346,
        -0.018721023574471474,
        -0.0101694967597723,
        -0.031608693301677704,
        0.07891054451465607,
        -0.02807128056883812,
        0.006542063318192959,
        0.0321308895945549,
        0.004452419932931662,
        0.046626828610897064,
        0.06121531128883362,
        0.015289572067558765,
        0.020111028105020523,
        0.034623946994543076,
        0.08322104066610336,
        3.373712024767883e-05,
        -0.03246515616774559,
        0.006281944457441568,
        -0.027188969776034355,
        -0.00584418186917901,
        -0.03680843859910965,
        0.020352188497781754,
        -0.09357668459415436,
        0.006954350508749485,
        0.0012306645512580872,
        -0.061251528561115265,
        0.018526064231991768,
        0.01148741040378809,
        0.09984933584928513,
        0.02027634158730507,
        -0.006581188179552555,
        0.14220625162124634,
        -0.04052721709012985,
        -0.006182582583278418,
        0.07071516662836075,
        -0.05214647576212883,
        0.0208528283983469,
        -0.04868217930197716,
        0.05864995718002319,
        -0.02948009967803955,
        0.03604194149374962,
        0.039204102009534836,
        -6.93352930625224e-08,
        0.02858547680079937,
        0.049519192427396774,
        0.03511923924088478,
        -0.008197362534701824,
        0.031201010569930077,
        -0.09373441338539124,
        0.029503338038921356,
        0.05022227019071579,
        -0.038907479494810104,
        -0.041101690381765366,
        0.0025192517787218094,
        0.038279738277196884,
        0.0147847980260849,
        0.03510422259569168,
        0.13002967834472656,
        0.0441896878182888,
        -0.06808456033468246,
        0.017789825797080994,
        -0.0722532719373703,
        -0.09089057892560959,
        -0.0068397969007492065,
        0.02271619252860546,
        0.05116547644138336,
        0.044020600616931915,
        0.02925136126577854,
        0.07725910097360611,
        0.03418920934200287,
        0.0022780396975576878,
        -0.02721429243683815,
        -0.031315386295318604,
        -0.06532549858093262,
        -0.0072412071749567986,
        -0.05262420326471329,
        0.004910641815513372,
        0.005640313494950533,
        0.06194637343287468,
        -0.05740181729197502,
        -0.07094790786504745,
        -0.0025135313626378775,
        0.04055660963058472,
        -0.041038043797016144,
        -0.021271100267767906,
        0.022382592782378197,
        0.058695510029792786,
        0.03190749138593674,
        0.025885147973895073,
        -0.059358902275562286,
        0.00482705794274807,
        -0.029078802093863487,
        0.06265786290168762,
        0.06600566953420639,
        -0.017672952264547348,
        0.010868693701922894,
        -0.023673253133893013,
        0.03929901868104935,
        -0.041976429522037506,
        0.08768098056316376,
        0.03567013144493103,
        -0.026463693007826805,
        0.036626674234867096,
        0.05982676148414612,
        0.030736302956938744,
        0.056062329560518265,
        -0.0114826625213027
    ]
}