{
    "id": "194URg0tkSg",
    "title": "The Samsung Galaxy S9 is Here",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-02-25T17:00:13Z",
    "video_url": "https://www.youtube.com/watch?v=194URg0tkSg",
    "category": "Science & Technology",
    "tags": [
        "galaxy s9",
        "samsung galaxy s9",
        "s9",
        "galaxy s9 plus",
        "s9 plus",
        "samsung galaxy s9 plus",
        "samsung",
        "samsung s9",
        "galaxy s9 review",
        "samsung galaxy s9 review",
        "galaxy s9 specs",
        "galaxy s9 release date",
        "smartphone",
        "android",
        "austin evans",
        "hdr"
    ],
    "views": 544597,
    "likes": 18251,
    "comments_count": 2515,
    "description": "The Samsung Galaxy S9 and S9 Plus are the 2018 smartphones to beat. Why Does an Android Flip Phone Exist?  Subscribe!   This video was shot in 4K HDR in 21:9 widescreen on a Red Epic-W.  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "https://www.youtube.com/watch?v=s3-3sMVynm0",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. I recently got the chance to head out to San Francisco to get a sneak peek at the brand new Samsung Galaxy S9 and S9 Plus. Design wise, it's definitely an evolution over the Galaxy S8 so just like when you went from the S6 to the S7, it wasn't a huge difference, on the surface the S9 looks very similar. I'm definitely not going to complain. The S8 already had one of the nicest looking designs on the market, and here, we're keeping that same infinity display that's going to be about 15% brighter as well as with some slightly smaller bezels. Evolution, not revolution. Amazingly enough, something else that carries over is the headphone jack. Yes, my friend, you heard correctly. This is a flagship for 2018 which has a headphone jack. For real though, props to Samsung for keeping it around. While pretty much everyone has abandoned it, a lot of people still really do appreciate having a headphone jack, and with the S9, it's going to be one of the only high end options with one. In fact, the audio side of things has seen an upgrade across the board, as Samsung took a page out of the iPhone playbook and switched over to stereo speakers. What they've done is combine the standard bottom firing speaker from the S8 with the speaker grill that's going to give you a decent sounding stereo setup. Now it's not going to be quite as nice sounding as the iPhone X or Pixel, but it is a huge improvement over the previous generation. In my brief time with the S9, it sounds pretty good. And on top of that, you're going to be getting Dolby Atmos support, so this works not only with the speakers as well as the headphone jack. And while for normal stuff, it's not going to sound amazing, it is cool to have that codec built in. Something else improved this time around is the fingerprint sensor. After basically every tech reviewer on the planet complained about the Galaxy S8 as well as the Note 8, it has now been moved below the camera. In addition to moving it, it is also now a little bit raised, so especially when you're just trying to reach the fingerprint sensor from the back without looking at it, it's much easier to find. The S9 is going to be available in three colors here in the US, black, blue, and pink. Personally, I like the look of the blue, especially when the light hits it, I think it looks really, really nice. But in a lot of international markets, you're also going to get a gray option. The rest of the design should look very similar. You're still getting USB-C, fast wireless charging, as well as IP68 water resistance. Look, it is definitely not some huge overhaul, but Samsung took pretty much everything that was good about the Galaxy S8 and just cranked it up to 11 with the S9. Two big thumbs up for me. Inside, you're getting the brand new Qualcomm Snapdragon 845 processor with four gigs of RAM on the S9 and six gigs on the S9 Plus. Not only is this going to be the first phone launching with it, but you're also going to be getting a 25 to 35% performance improvement. I'll have to take a closer look when I get the S9 in for review, but based on first impressions, it's blisteringly fast. Although that shouldn't exactly be a surprise because that's basically every flagship from the last few years. Now the software is still very much in evolution of the Samsung skin on Android. It's fine, it's usable, it's not something that's going to be a deal breaker, but it is going to be nowhere near as clean as what you're going to find on the Pixel. Bixby is also back and improved with the same wonderful Bixby button. So there's a few improvements, so you can now use Google Translate to translate text live as opposed to taking a photo. But for the most part, I think everyone's just going to ignore it and use Google Assistant, or at least that's what I'm gonna do. One thing that hasn't really been improved is battery life. So the sizes are going to be the exact same, 3000 milliamp hours on the S9 and 3500 on the S9 Plus. Now unless they've gotten some crazy efficiency boosts, it's going to be fairly similar to last year, which is to say, decent but not spectacular, especially in a world where the iPhone X and Pixel 2 XL can easily last all day and then some. The screen, on the other hand, is still phenomenal. So it's very similar to last year's phones, which is to say, about as good as it gets on a phone today. So it's going to be a little bit brighter, about 15% or so on the max brightness, but for the most part, it's going to be right up there with the very best that you could buy. One of the most exciting updates is with the camera. So while the S8 had basically the same camera from the S7, the new Galaxy S9 is going to have an all new camera sensor as well as it's going to be getting a telephoto option if you jump up to the Galaxy S9 Plus. The coolest party trick is an adjustable aperture. So this is typically found on higher end cameras. What this is going to allow you to do is actually adjust the amount of light coming into the shot. So you have two options here, f/1.5 or f/2.4. Now unlike a normal camera, you don't have any options in between, but it is really nice to be able to have at least some flexibility when you take a shot. So, for example, when you open it all the way up, it's going to be a little bit softer. You're letting a lot more light in in a low light situation. Whereas where you're out here on a nice bright day, you might want to close it down a little bit to get that extra bit of sharpness. Speaking of low light, there are also some other improvements including taking up to eight shots and combining them into one to be able to get better noise processing as well as they have a little demo set up where you can actually see some of the low light photos in action. And it was very, very dark, so it looked pretty decent. But of course, this is something I'm going to have to try when I get it in for a full review. Now with the pro mode, not only do you have the normal options to be able to adjust things like shutter speed and ISO, but you also can adjust the aperture here. But on top of that, there's also a new mode, super slow motion, which will record at up to 960 frames per second. The way it works is that it will start recording standard 720p video at a normal frame rate and then either when you manually trigger it or you can set up a zone that will automatically trigger when it detects motion, it will record a quick burst of 960 frame per second video. And while it's not going to be the sharpest thing in the world, you can do some really cool things with this. And it's all made possible by the fact that this new sensor has memory stacked actually on top of it, very similar to some of the Sony stuff and for example the RX100 Mark V. Now this does mean that you can't exactly set it to 960 frames per second and let it do super slow motion all day long, but when you get those short little bursts with standard video around it, even though it's not the sharpest thing in the world, you get some really cool effects. Video on the whole is actually pretty impressive. So, in addition to your standard 1080p and 4K modes, which the 4K actually now goes up to 60 frames per second, but you're also going to be getting two options to record, either to H.264 or the new and more efficient HEVC codec. Now as far as the telephoto camera on the Galaxy S9 Plus, it's fine. It's not exactly going to be great. In some of the portrait mode shots I took actually aren't that impressive looking, but for the most part, the standard camera on the S9 and the S9 Plus is going to look phenomenal. Samsung is also introducing a brand new revolutionary feature called AR Emoji. So totally unlike Animoji on the iPhone X, this uses the front facing camera to paste a very, very scary version of your face on an emoji which then will be hilariously shared out not only as a photo or video if you want to record that but as a series of stickers that go to your camera roll. The Samsung Galaxy S9 will be available for pre-orders starting on March 2nd and will be going on sale on the 16th. Now yes, it is not going to be a huge update over the Galaxy S8, but there was a lot of nice little improvements here that does actually add up to a pretty nice looking package. So, what do you guys think about the Galaxy S9? Let me know in the comments below, and I will catch you on the next one.",
    "transcript_keywords": [
        "Galaxy",
        "Samsung Galaxy",
        "Samsung",
        "camera",
        "San Francisco",
        "headphone jack",
        "Austin",
        "pretty",
        "light",
        "nice",
        "options",
        "similar",
        "bit",
        "standard",
        "video",
        "jack",
        "headphone",
        "low light",
        "Pixel",
        "huge"
    ],
    "transcript_entity_values": [
        "six",
        "last year's",
        "iPhone",
        "three",
        "S6",
        "2018",
        "HEVC",
        "USB-C",
        "the 16th",
        "up to 960",
        "Animoji",
        "Samsung Galaxy S9",
        "the Galaxy S8",
        "first",
        "Google",
        "RAM",
        "3500",
        "the Galaxy S8",
        "jack",
        "Samsung",
        "Two",
        "Qualcomm",
        "Austin",
        "S7",
        "the S9 Plus",
        "two",
        "the Galaxy S9 Plus",
        "four",
        "S8",
        "S9 Plus",
        "4",
        "Sony",
        "one",
        "second",
        "Snapdragon 845",
        "S9",
        "11",
        "S7",
        "March 2nd",
        "San Francisco",
        "the Galaxy S9 Plus",
        "Bixby",
        "Pixel 2 XL",
        "last year",
        "Galaxy S9",
        "up to 60",
        "the S9",
        "the last few years",
        "about 15%",
        "max",
        "S9",
        "One",
        "US",
        "up to eight",
        "960",
        "25 to 35%",
        "today",
        "ISO",
        "3000 milliamp hours",
        "Dolby Atmos",
        "AR Emoji",
        "Android"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "FAC",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "GPE",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "PERCENT",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG"
    ],
    "vector": [
        -0.10497111827135086,
        0.010021517984569073,
        0.11640577763319016,
        -0.07491748780012131,
        0.03438597545027733,
        0.04945840314030647,
        -0.08709367364645004,
        0.14757855236530304,
        -0.037062015384435654,
        -0.02013205550611019,
        -0.002027671318501234,
        0.05068311467766762,
        0.0503280945122242,
        -0.015897788107395172,
        0.005860627628862858,
        -0.11342767626047134,
        0.03484897315502167,
        -0.09182997047901154,
        -0.018589409068226814,
        0.007122226059436798,
        0.015741748735308647,
        0.0200186874717474,
        -0.003859026823192835,
        -0.04671895131468773,
        0.06044720485806465,
        0.038092005997896194,
        -0.045380931347608566,
        -0.04233551770448685,
        -0.017597105354070663,
        -0.03127396106719971,
        0.04163442924618721,
        0.14709369838237762,
        0.008826319128274918,
        0.04657856002449989,
        -0.12172622978687286,
        -0.11743409931659698,
        0.034481119364500046,
        0.03544794023036957,
        0.022033562883734703,
        -0.024023214355111122,
        -0.05554380640387535,
        -0.02612154930830002,
        0.035379067063331604,
        -0.02033218927681446,
        0.020808041095733643,
        -0.053521137684583664,
        0.0634724348783493,
        -0.03900093212723732,
        -0.021838590502738953,
        -0.02267463319003582,
        0.018540645018219948,
        -0.05231302231550217,
        0.0059813931584358215,
        -0.047865401953458786,
        -0.04615300893783569,
        0.03971773758530617,
        0.03576481342315674,
        -0.03432997688651085,
        0.04709464684128761,
        -0.04733815789222717,
        0.10720764100551605,
        -0.03094668686389923,
        0.007818521931767464,
        0.04989439249038696,
        0.028816647827625275,
        -0.009329527616500854,
        0.008935392834246159,
        -0.07176507264375687,
        0.028930090367794037,
        0.036220721900463104,
        0.056532807648181915,
        0.03322906792163849,
        0.006381981074810028,
        -0.015622219070792198,
        0.01682576909661293,
        0.03502076864242554,
        0.05555490776896477,
        0.00784215610474348,
        -0.02569805085659027,
        0.008897482417523861,
        0.10372649133205414,
        -0.02472275123000145,
        -0.04930337890982628,
        0.013872801326215267,
        0.005412588827311993,
        -0.03701820224523544,
        -0.022039201110601425,
        0.009017511270940304,
        -0.03294620290398598,
        -0.005653569474816322,
        -0.033604566007852554,
        0.06962845474481583,
        -0.06153687462210655,
        -0.10429848730564117,
        -0.029926596209406853,
        -0.013021675869822502,
        -0.10716592520475388,
        -0.0545697920024395,
        0.016311632469296455,
        0.00502429436892271,
        0.059660471975803375,
        0.0019995933398604393,
        0.06237354502081871,
        0.039025530219078064,
        0.11318904906511307,
        -0.04207085818052292,
        -0.022628996521234512,
        0.015456849709153175,
        -0.03561278060078621,
        -0.008723553270101547,
        0.04306379333138466,
        0.00277969753369689,
        -0.036895014345645905,
        0.014521866105496883,
        -0.06462793052196503,
        -0.06682898849248886,
        -0.0016280125128105283,
        0.0218705665320158,
        0.004380103666335344,
        0.08649580180644989,
        0.013303350657224655,
        0.02277904376387596,
        -0.07645199447870255,
        -0.09184448421001434,
        0.04974883049726486,
        0.016804033890366554,
        -0.09840598702430725,
        2.0621175770857212e-33,
        -0.02029992826282978,
        0.06788956373929977,
        -0.015265361405909061,
        -0.027991071343421936,
        0.016291091218590736,
        0.01717064343392849,
        -0.015874868258833885,
        0.055062633007764816,
        -0.03767932951450348,
        0.037541549652814865,
        -0.0765947699546814,
        0.07787687331438065,
        -0.035545386373996735,
        0.016174664720892906,
        0.045214880257844925,
        -0.061264071613550186,
        -0.043831516057252884,
        -0.0074542672373354435,
        -0.057436734437942505,
        -0.061509329825639725,
        -0.015628498047590256,
        -0.01939431205391884,
        0.04486333578824997,
        -0.042080312967300415,
        0.011602823622524738,
        0.0033219740726053715,
        0.10902268439531326,
        0.007558141369372606,
        -0.01395119447261095,
        -0.03450384736061096,
        -0.06793123483657837,
        0.033152900636196136,
        0.04690772294998169,
        -0.02211637981235981,
        0.008506977930665016,
        0.012352625839412212,
        0.05571741610765457,
        -0.13769209384918213,
        0.0686776265501976,
        0.002661551581695676,
        -0.046498216688632965,
        0.06031147763133049,
        -0.10074248164892197,
        0.031272292137145996,
        0.07663232088088989,
        0.04589513689279556,
        -0.018455324694514275,
        -0.05783914402127266,
        -0.0308558139950037,
        -0.047896236181259155,
        0.02868208847939968,
        -0.03894820064306259,
        -0.0012935862177982926,
        0.03409162163734436,
        0.011604071594774723,
        -0.04362478479743004,
        0.005236167926341295,
        0.011191997677087784,
        0.0024931624066084623,
        0.07661964744329453,
        0.03236490860581398,
        0.013102793134748936,
        -0.0982663705945015,
        0.00830961111932993,
        -0.05226444453001022,
        0.03823847696185112,
        0.10351414978504181,
        0.02658228762447834,
        -0.039605513215065,
        0.048303961753845215,
        0.07222846895456314,
        -0.07691889256238937,
        -0.016974853351712227,
        0.03304962068796158,
        0.0700543224811554,
        0.013221979141235352,
        0.026937857270240784,
        0.0010575250489637256,
        0.06425132602453232,
        0.020127955824136734,
        0.016972992569208145,
        0.022879434749484062,
        0.036957137286663055,
        -7.517128688050434e-05,
        -0.014708418399095535,
        -0.021608740091323853,
        0.008345243521034718,
        -0.03943861648440361,
        0.01837744750082493,
        -0.0221867598593235,
        -0.017823342233896255,
        -0.03143385797739029,
        0.009776046499609947,
        0.03147824853658676,
        0.0006461974116973579,
        -3.2294624459789486e-33,
        -0.07270994782447815,
        -0.06328149884939194,
        -0.05302555859088898,
        -0.007995865307748318,
        0.0238207895308733,
        -0.02415427938103676,
        0.0651099681854248,
        0.004101368598639965,
        -0.09078510850667953,
        -0.09229179471731186,
        0.019651053473353386,
        0.017868082970380783,
        0.051037050783634186,
        -0.07292407751083374,
        -0.005675224587321281,
        -0.06957115232944489,
        0.03675340488553047,
        -0.05244840681552887,
        0.006397610530257225,
        -0.018296897411346436,
        0.033173926174640656,
        0.06213032454252243,
        -0.008776000700891018,
        0.03405248001217842,
        -0.03222145512700081,
        -0.03779323026537895,
        -0.052184686064720154,
        0.07928400486707687,
        0.05223119631409645,
        0.03899914026260376,
        0.012266218662261963,
        -0.05481402203440666,
        0.028797082602977753,
        0.06353256106376648,
        0.00902837049216032,
        0.03449619933962822,
        -0.0018934381660073996,
        0.01304679736495018,
        0.05294230207800865,
        -0.035224221646785736,
        0.03094356879591942,
        -0.015031197108328342,
        0.08111396431922913,
        -0.004811965860426426,
        0.05907721817493439,
        -0.024938294664025307,
        -0.02876301109790802,
        0.054378919303417206,
        0.009974571876227856,
        -0.0141445966437459,
        0.04329386726021767,
        0.0139578552916646,
        -0.04957793653011322,
        -0.0023307737428694963,
        -0.046490252017974854,
        0.011962870135903358,
        -0.024388065561652184,
        -0.06430504471063614,
        0.025623682886362076,
        0.026925645768642426,
        0.10056992620229721,
        0.01898103952407837,
        -0.06004664674401283,
        -0.050055306404829025,
        -0.05485190451145172,
        0.03168676048517227,
        0.04752465337514877,
        -0.05975911021232605,
        -0.0008377231424674392,
        -0.07662919163703918,
        -0.054453492164611816,
        -0.0749458596110344,
        -0.10937989503145218,
        -0.06595569849014282,
        0.06439246237277985,
        0.10016398131847382,
        -0.07021932303905487,
        0.007342170923948288,
        0.0303731020539999,
        -0.015429026447236538,
        -0.03910798206925392,
        0.03785964474081993,
        0.09049110114574432,
        0.011933202855288982,
        0.07414399832487106,
        0.018162639811635017,
        -0.04829802364110947,
        -0.006862856447696686,
        0.044023547321558,
        0.05226396396756172,
        -0.03336063027381897,
        -0.009238896891474724,
        -0.11283615976572037,
        0.005551247391849756,
        0.03526756167411804,
        -5.3456716386790504e-08,
        0.0915965884923935,
        -0.020835433155298233,
        0.11162223666906357,
        -0.021208927035331726,
        -0.019066790118813515,
        -0.04561958834528923,
        0.07567205280065536,
        -0.018870897591114044,
        0.06406555324792862,
        -0.022427359595894814,
        -0.026678208261728287,
        -0.09801355004310608,
        -0.06290934234857559,
        0.048988793045282364,
        0.08276883512735367,
        0.07683161646127701,
        -0.03718484193086624,
        0.05572599545121193,
        -0.025037499144673347,
        0.05676736682653427,
        -0.0331859327852726,
        0.04798083379864693,
        0.03611951321363449,
        -0.06695020943880081,
        -0.0029649632051587105,
        0.04417046532034874,
        -0.10813892632722855,
        0.014521700330078602,
        0.06808719784021378,
        -0.0562494732439518,
        0.04644321650266647,
        -0.05976947024464607,
        -0.02626984380185604,
        -0.012957650236785412,
        0.002228905213996768,
        -0.08030898869037628,
        0.03519617021083832,
        0.012706844136118889,
        0.11928229033946991,
        0.006738512776792049,
        -0.0037281494587659836,
        -0.0719917044043541,
        -0.016948029398918152,
        0.06982880085706711,
        -0.017488326877355576,
        -0.056639913469552994,
        0.0363086499273777,
        0.011142740026116371,
        -0.027492793276906013,
        0.04816073924303055,
        -0.012135626748204231,
        -0.05438140407204628,
        -0.07609455287456512,
        -0.049610886722803116,
        0.0732850655913353,
        -0.0948869064450264,
        0.07617087662220001,
        -0.040557634085416794,
        -0.01765923574566841,
        0.11925313621759415,
        0.057303037494421005,
        -0.07717273384332657,
        0.011875251308083534,
        0.06750104576349258
    ]
}