{
    "id": "1EIlcYCfEIE",
    "title": "I Asked Best Buy to Fix my PC… They FAILED - Geek Squad vs Mom & Pop Shop",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-04-03T18:46:04Z",
    "video_url": "https://www.youtube.com/watch?v=1EIlcYCfEIE",
    "category": "Science & Technology",
    "tags": [
        "best buy",
        "gaming",
        "amd",
        "intel",
        "nvidia",
        "linus",
        "linus tech tips",
        "ltt",
        "linustech",
        "repair",
        "mom and pop",
        "pc",
        "pcmr",
        "pcgaming",
        "secret shopper",
        "top best buy deals"
    ],
    "views": 3199885,
    "likes": 86295,
    "comments_count": 6455,
    "description": "Thanks OriginPC for sponsoring today's video! Enter for your chance to win an OriginPC Neuron pre-built PC at   Computer repair is big business, and no one is bigger than Geek Squad. If youre no IT expert and your PCs sick, should you go to Best Buy, or should you look at a smaller fish?  Discuss on the forum:   Buy Corsair XTM70 Extreme Performance Thermal Paste:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Can a mom and pop shop beat Geek Squad? 4:38 Listening in on Geek Squad support 7:37 Best Buy location #2 11:40 Listening in on the mom and pop shop 14:29 Receiving the PC back from Geek Squad 17:30 Receiving the PC back from Mom and pop shop 19:31 Inspecting the PCs post-repair 26:07 Results 29:31 OriginPC Giveaway!!!",
    "description_links": [
        "https://bit.ly/originpc-ltt-mp",
        "https://linustechtips.com/topic/1565323-i-asked-best-buy-to-fix-my-pc%E2%80%A6-they-failed/",
        "https://geni.us/D5RLHBW",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "Why would Origin PC sponsor a video where their top of the line gaming machine performs like this? Well, maybe because it doesn't. Hey, there we go. That's better. The Neuron should be getting hundreds of frames per second in CS2. And ours would have if we hadn't given it to our techie friend to fix and gotten it back worse than before. Of course, it arrived from Origin in perfect working order, but well, we'll get to that. It's a really common situation, and for many people, the next move is to prepare their wallet and head to the tech shop. If they had an Origin PC, they could just use their 24/7 lifetime support. But if they don't have an Origin PC, well, the big question is, where do you go? The service department at a big box store would surely have the processes and tools to diagnose and repair your PC. But on the other hand, maybe the veteran tech at the mom and pop shop down the road is best equipped to evict your systems gremlins. Yeah, we couldn't decide which route to go either. So we dropped off two identical and identically broken systems, courtesy of Origin, to compare big box versus small business. But before we get into the results, we need to know the problem. Let's take a look at the messes that we're gonna be handing over. I'm that friend, everyone asks for tech support, but I don't mind helping to set up such a beautiful machine. It looks so fast. Ooh, and it is, but it's a little loud. Okay, I've watched a lot of videos about system tuning and I know what this means, overheating. That is where everything went from oops to OMG. That cable that was loosened during unpacking handled communication between the PC and our cooler's ICue. Link system hub. So that knocked out RPM monitoring for our fans, meaning it's full throttle o'clock all the time. Now a quick reality check before we go further, the Link AIO and fans all have temperature probes in them, so this behavior doesn't normally happen. But in general, a hub running full speed due to a loss of signal is a very common scenario and one that should be easy for a technician to rectify. Too bad our friend isn't a technician. First, they tried rolling back the NVIDIA driver to the earliest one available. Unfortunately, they did so without removing the existing driver. So not only did this not solve the problem, it created a new one. Device manager is now reporting error code 43. Oops, too bad my friend didn't notice. Then they ran CCleaner and started uninstalling stuff in hopes that it would help, which it did not. Friendo was running short on ideas by this point, so they dug around in the BIOS and disabled everything they could find that would cause extra heat in hopes that the fans would slow down. And for good measure, they also locked the core clocks as low as they would go. It's too bad the LTT HAT Pro doesn't make you smarter, just more water resistant, lttstore.com. Now, as a pretty average buyer of a prebuilt system, I don't know any of what my friend did, and even if I did, I wouldn't understand what it meant. All I would know is my games are unplayable, they crash, and my system is as loud as a vacuum cleaner. I would have no way of knowing is it a hardware, or a software problem, or even how to tell the difference, and I would probably be scared of damaging it any further. Now, I could contact the manufacturer, and for a brand new PC, that's probably a pretty good bet. Origin PC has scored well for customer service in our Secret Shopper series. Origin PC, what can I say? Wow. A+. So good. They nailed it. Under 10 minutes, and... Baking face mask. 24/7. A+. And they have free lifetime support, but not everybody has a brand new PC or an Origin PC for that matter. Now, of course, what we actually are dealing with here is a software and BIOS mess and one loose cable. The quickest way of fixing it then would be to plug the cable in, clear the CMOS, and reinstall Windows. But... It can also be fixed without doing either of those things, if you know exactly what we did. The techs, of course, don't, so let's listen in and see what kinds of conclusions they drew, starting with the Langley Best Buy. Hey, so I bought this off of a friend a couple days ago, and it's been giving me problems when I've been trying to play games on it. They're just running super slow, and the thing sounds like it's gonna- Do you have the receipt? No. Did we send Chewie? A friend who bought it from... ...Origin, I believe. Okay, I thought you were talking about Chewie in the classroom. No, no, no. It's custom-made, right? I'm not sure. He bought it and never even took it out of the box. It's a custom. Yeah. Put a sticky note here with my Steam in case you need to get in there. Like when you play games, they're lagging or they're... Super slow, yeah. Super slow. One of the games I have, Helldivers 2, when I open it, it just crashes and it says something about the CPU being bad or something. I'm not sure. Chewie did a really good job of both playing the ignorant customer who has no idea what he's talking about while also putting out a nice little trail of breadcrumbs for them to follow in order to diagnose this issue. He even gave them access to a Steam account that has a specific game installed that requires AVX support so they would get the error message that would help them reconfigure the BIOS. \"We're not taking it.\" Excuse me? I mean, I guess, right? Like I can't force you to work on something. You can just be like, no, look, this job is not right for us. Maybe take it somewhere else, but we are not taking it. It's a little direct. 'Cause we're not working on custom builds. Okay. We're working on . He says, you know, what's up with that was we have those parts from the brand. Okay. That have manufacturer warranty. Okay. Fortunately, I'm really sorry about that, but we can really help. Okay, he tried to soften it a little bit. Okay. Some people go to memory. Memory, the shop nearby, they do custom builds and stuff like that. On the one hand, I kind of get his rationale. Look, we don't necessarily have access to replacement parts for this thing. On the other hand, if you're gonna recommend that I go to another shop, can you at least tell me the actual name of the shop? Ah, the irony of not being able to remember the name of memory something. Express, that's it. So we just got told to, leave, essentially, at the first Best Buy. That can't be policy. Emily, that's not policy, is it? No, we called them afterwards, and they told us that, yes, they actually absolutely do work on pre-built computers, and also custom-built computers that they don't sell in their stores. You know what I bet it's about? They probably saw how high-end it was, looked at the issues that we were having with it, and went, \"Hmm, this thing's haunted,\" and just didn't wanna deal with it. 'Cause you make a mistake on a, you know, $600 office box, okay, what, that's a $50 mistake or a $100 mistake. You make a mistake on a, you know, 5,000, 6,000 Canadian dollar gaming rig? Let's move on. Drop off this time at the Best Buy on King George Highway. Hey, how big is this, how big is this? What do you wanna do now? Get it fixed. Whatever, whatever it needs. Chewie really does play the ignorant customer extremely well. He has like strong trust fund kid vibes. I've got this like crazy machine. I'll just like, I don't know, I'll fix it, I guess. Sure, whatever. Chewie's our community coordinator, by the way. So if you ever see a reply on Reddit, that's not from me, it's probably from him. You use TV or a monitor? A monitor. That's an interesting question. Do you hook it up to a TV or a monitor? Unless they were trying to help figure out if we were plugged into the onboard GPU or the dedicated graphics card, maybe? It's a custom build, or? I bought it off a friend, I'm not sure. If it is a custom PC, they won't look at it. Wait, this is an interesting distinction and I can kind of see where they're coming from, but even at this second Best Buy location, they're drawing a line. Between a system that was built of custom parts by an experienced integrator like an origin PC and A system that could be built of the exact same parts, but by the individual user and in that case It's not about the value of the parts and the risk of you know Breaking them or the difficulty finding replacements because they're willing to work on an origin PC They just don't want to work on potentially those exact same parts if you put it together yourself and maybe bungled something up because who knows you could be trying to blame them for it if you bent a pin in the socket or whatever the case may be they've probably run into some horror stories working on custom pcs so my friend tried but he moved just before just after he sold it to me it seems almost seems like what he did made it worse i don't really know what he did and the thing is if you've ever worked in a tech shop you will know exactly how common this kind of scenario is oh yeah my friend or my nephew or my uncle worked on the system and like i don't know what they did and you see all kinds of wild things that supposedly techie friends and family members will do to systems they're well intentioned they just don't really have familiarity with the hardware this is not a software issue so it's kind of a hardware issue we need to ship it out to the repair center we have it what you can't tell me that you know what kind of issue it is without even like turning on the system then again what i suspect is that they just don't want to deal with it there in the store they want to send it to the depot so they're just telling us anything that it takes to get us to accept that this needs to go to the depot so that they can just kind of go oh yeah fancy expensive system i don't want to deal with it i sent it away to the other guys for shipping and diagnosis it's hundred dollars man a hundred bucks to even start to do anything do you have any important data that's a good question okay they're going to call you after diagnosis and do you want to sign up for the membership wait what sign up for membership hopefully you're going to fix it i won't need a membership to best buy the whole drop-off process at the second best buy took about 20 minutes half of which was filling out paperwork They did log the issues that we had with the machine and they gave us a case ID and a phone number We could call to get updates But we're still having a hard time figuring out exactly what best buys policy is with respect to working on custom PCs versus Just OEM PCs from HP Lenovo and the like when we called the main line. They said no There's no reason that they wouldn't look at a completely custom- built PC let alone one that was built by a system integrator but both of the stores we talked to were we're like, whoa, whoa, whoa, whoa, whoa. When it came to working on custom PCs and only one of them was willing to work on our Origin. Now for the one I'm more excited about. Let's listen to the drop off at Black Lab, which you guys may recognize as the mom and pop shop that we bought all the old inventory from a couple of months ago. Keith seemed like the kind of battle hardened technician that should be able to make short work of this, but only the results matter. And let's see what they are. What's going on with it? Right to the point. So first of all, it's insanely loud and I feel like that's not right. And it's running slow in general, but especially trying to run games, like it can't even run anything really. Really? Yeah. SSD, obviously? I'm not sure. Huh, first thing he asks is, \"Do you have an SSD?\" That makes a ton of sense. It's really interesting how the kind of shop you go to Dictates the kinds of questions they ask just like secret shopper You know Dell is asking questions like are you buying an entire fleet of these things? Do you want on-site service whereas a custom builder like origin PC is asking what games do you want to play and what FPS? Do you want to play them that so in the same way Keith probably sees a lot of 15 year old machines So he wants to know okay. Is there anything obvious that's making this thing dog slow like does it have a hard drive and also do i even want to work on another machine that has a hard drive in it wait you know 10 minutes for an application to install you didn't even take it out of the box interesting what yeah how much uh that's hilarious too he doesn't know how much he paid for it like 3k made up a number yeah he was moving away so he just wanted to get it off his hands but it's not running right nope yeah for now so it goes into windows yes and then everything goes yeah is there a password nope but my steam info is on a sticky note there perfect i'm gonna go home tonight i can't believe neither of the best buys called chewie on giving his steam credentials whereas keith's like yo dude the low points for professionalism but high points for efficiency the whole interaction with keith took less than five minutes is it a 4090 you know i don't know we get to oh this video card is coming at 1060. stop just kidding me oh man see i don't know keith very well but i've spent enough time with him to know that i think he's honest enough that he wouldn't actually just swap out the hardware in someone's machine who obviously has no idea what they have but he's also smart enough to see that this is somebody good if he really felt like it awesome all right okay thank you just as i remember him an efficient troll now it's time for pickup chewie was sick that day so we sent him ltt employees to grab the machines starting with best buy so i just wanted to share that report okay can i see the document that they're looking at please yep my goodness we got a whole folder jeez motherboard, hard drive, memory uh everything is good so this is the come up this okay wait a second whoa whoa whoa whoa whoa whoa how much did i pay for this whole tube of thermal paste of which you guys used one tiny dollop they sold me a giant tube of thermal paste because they re-in-read the cooler. Really? How much did I pay for this? 20 bucks in thermal paste. That wasn't even the problem, you guys. Okay. Nothing wrong with the hardware, just they found that overheating was causing the problem. Overheating was the problem? No! You put on new thermal paste, you think you solved the problem, but... We're about to look at this machine, and I don't think we're going to find the problem solved if they think overheating was the problem, if anything. Underheating was the problem. We had too much cooling fans. They played the game for a little while, and see how it goes. They kept it on, like, you know, the computer for almost, like, you know, more than 24 hours. Okay. You know, to see if anything's happening, passing anything. Okay. I'm afraid I don't really understand what they're saying. So they reimbursed me the hardware repair, and then... charged me almost double for software repair because they reinstalled the operating system. They made no mention of bios settings, no mention of the loose link hub cable. They charged me 20 bucks for a gigantic tube of thermal paste that I think it's pretty clear from the way that I'm talking about this system. I have no idea what it is. I am never going to use. Did they even solve the problem? You had a lot of fan. So the fans, like, over the time, you would make noises. Oh, the fans were noisy? Yeah, because you had three here, three here, six. Oh, just a lot of fans in it? Yeah. So that is normal there. More fans is not more noise. Yeah, we have 12 fans, which means they should be spinning very slow and making very little noise. Oh, best buy, best buy, best buy. It is very heavy, yeah? Yeah, I know, I know, I'm gonna have to carry it. Are you managed to carry it? Yeah, it'll be okay. Oh, okay. Yeah. That's the way I'm gonna ask somebody to . To their credit, it seemed like they were offering to help them carry the system out. That's one thing they did well. But I paid $123 to fix a computer that as far as I can tell is not fixed. Actually, it was a total of 209 because- What? A total of 209? Holy bananas. We paid 250 bucks for them to not fix the problem? Maybe they shouldn't work on custom PCs. All right, let's see how Black Lab did. Can I get the documentation for that one? About the same price though, realistically. I guess what it comes down to now is, did Keith manage to fix the computer? Hey, I just had a pickup. Oh, okay. What was wrong with it? Oh, it had to be completely reloaded. Completely reloaded? It was wacko, man. And those fans were just roaring. I tried everything to get them to shut up. Oh. Yeah. Okay. Reloading software, all that stuff just didn't work. So I reloaded everything and did all the drivers again. Awesome. Interesting. Okay, cool. So it's all good now. Yep. And if he has any problems whatsoever, just tell him to call me. That's nice. Offering the follow-up. And he did have some malware on there, so. Malware? Oh, okay. Do we have any idea what malware he's referring to? Did we have logging software on there to see what they were doing? No? No, no. The best I can figure is CCleaner and WinZip. Yeah, I wouldn't consider those malware. Awesome, thank you so much. thank you so much. Have a great day. All right, you too. Full marks for efficiency and love the personality, but I think at best, Keith is headed for a partial pass here. He says that the fans are quieted down now, and there is a way to do that without reseating that link cable, but he didn't manage to find the underlying problem, and he made no mention of any of the issues in the bios. So I have to say, I'm a little worried that the performance of the machine, even if the fans are quiet, is not going to be up to snuff. He also charged a little more than Best Buy did, but if he managed to solve the problem, at least solved enough that I can use my computer, then... It's hard to really complain about that. God, I can sure complain about how much it costs to get service done on a computer. I can see why people just buy a new machine. Like, if you have a five-year-old Dell or something, and you take it into a shop, they're like, \"Yeah, it's gonna be three or four labor hours to reload windows, put on drivers, and get it up and running again.\" Just be like, \"Oh, screw it. I'll just get a new one, and then it'll just be fast anyway.\" And this, my friend, is where e-waste babies come from. Starting with the Best Buy PC, I am not that impressed with the condition of this computer. I mean, we dropped it off brand new, and it is so covered in fingerprints and thermal paste that I could probably defeat the biometric security of the phone of this technician. Not to mention, they left this giant stupid service tag sticker on it. Like, why? It comes off pretty easily, so just remove it. I don't know, maybe I'm just in a bad mood. I'm being picky because I don't think they solve the problem. Let's see, let's see. Maybe I'll feel differently when we open it up and they did a great job or whatever. All right, get me my screwdriver. I'm talking to me, I will get me my screwdriver. How's their thermal paste job? Realistically... Probably not gonna cause any problems, but I'd have put on more especially since like I have plenty do we have thermal results for The after no probably shouldn't have pulled this off then oh Seriously, you made it that easy on them I thought you meant you were gonna pull out like one of these USB-C connections between the link devices You pulled a freaking USB header off and they didn't notice that? They did not Brother I mean if you diagnosed it as a software issue and you didn't look that closely at the hardware I can kind of see how you could miss it But you went you did a full re and re on the CPU cooler So you thought it was hardware And you didn't check if a USB header was uninstalled what that tells me is I'm gonna press this button and That's gonna happen Which they passed off as normal how much you want to bet origin PC? Based on the experiences we've had with them would fix this issue over the phone in like 10 minutes Before we hook up a monitor and see how they did software wise. Let's have a look at Keith's hardware Also a little fingerprinty, but the difference here is that the fingerprints are in the typical carrying positions and Are not made out of thermal paste. So this is probably us Wait, where's the us? Oh, he plugged it back in. Did he plug the USB header back in? We didn't do it Okay So that's interesting Keith is still convinced. It was a software issue. At least that's what he told us but he found the hardware issue which solved his problem. If you do the right thing that's definitely better than just not seeing it at all even if you aren't sure exactly which thing you did fixed it. He took longer. He took a week compared to three days and he did charge us more but here let's get this thing fired up. Oh and of course my RGB is working properly now too. Now that we're posted let's see how they did. They managed to enable XMP. They put it on the first profile which is 6,000 megatransfers per second rather than 6,200. AVX is still disabled. Frequency control is fine though. You know what's funny to me? We've talked about this in our troubleshooting challenges before. If you suspect at all that a BIOS configuration issue is present modern systems all you got to do is go into the profiles create a profile for what they had just in case. you know if they had like weird legacy boot settings or something like that reset it and see if that solves the problem and if it does then great you enable XMP and you're done you don't have to dig through all the sub menus to find what stupid thing their friend adjusted. There's no avoiding it is there? We're gonna have to start a tech shop so people can have their computers fixed properly. Well we'll see maybe Black Lab did great. Now that we're on the desktop I'm even more confused. Did they really install user benchmark and then just leave it here? Yeah. Ida too. Which is not free software. Like you're not allowed to just use it however you want and leave it on any system you want. Oh this is even a oh no that is a trial for yeah yeah there's even a thing that pops up and tells me that. Probably their worst sin was that Norton 360 was not on this computer when we dropped it off. Now. The reason for that can actually be traced back to MSI, who includes Norton in their driver package bundle thing. But, when you do a Windows refresh, I kind of expect you to pay attention to what I had installed on the machine and not leave anything extra on it. That seems to be about it. Now, let's get this machine shut down, so... Ah, our audio is usable. Let's move over to Keith's machine. Oh, Keith didn't turn off fan speed monitoring. So we get that CPU fan error when the system first turns on. That's a rookie mistake. It's even in the simple interface. That's how quick that is to fix. Oh, Keith used the higher XMP profile. And did he reset CMOS? No, AVX is still off. He's got all the frequency stuff fixed. Why not just clear CMOS? Both of you. In fairness to Keith, the CPU fan error message is a lot less of a problem on these MSI boards. On an ASUS one, it'll hang until you go in and tell it not to check it. Now that we're in Windows, I see no sign of user... Heaven benchmark. Okay, A, really, heaven? Does anyone use that anymore? And B, yeah. I can't believe in software installed on people's systems. If you have a conversation with them that goes, I put this on there in order to do this. It's really useful for this. You may want to use it. Otherwise you can just take it off. It's not harming anything. Then at least that's a conversation we had. If you're just leaving software installed on my system, it's sloppy. No Norton though. Kudos Keith for installing the drivers. Properly, either doing it manually by downloading them and then installing them, or by making sure you're paying attention when you use that package and unselecting Norton for gamers. Since we have Heaven on here, I guess we can do a quick check and see if the system is performing as we would expect. And it is casual 600 frames per second. Did they really put 4090s in these things? Oh, Origin. You guys and your crazy systems. Now that we've run through both systems, the results are both clear and also not clear. Best Buy, they failed. They solved problems we didn't have and they didn't solve the problems we did have, all while charging us $200 and selling us a bunch of thermal goop that we probably don't need. Meanwhile, over at Black Lab, Keith did manage to nail the fan issue. So that was the underlying problem. But what he missed, was enabling AVX in order to get Helldivers 2 working, which we explicitly told him was a concern and even gave him our Steam account so that he could check. However, I don't want to write him off yet because on our way out the door he did say, \"Hey, just give me a call if anything else goes wrong. Let's see if he's willing to troubleshoot this for us over the phone or fix it for free.\" In which case, I'm ready to give him an A. Colin, can you call this computer shop for me and just explain the problem that we have? It's AVX related and we can't launch Helldivers 2. Right, no, it's okay. Never mind. We found Hoffman. I can't talk to him because he'll probably recognize my voice. Okay, we ready? May I ask if Keith is around? No, he's coming back in two hours. Yeah, we'll give you a call. I guess, yeah, I wanna talk to Keith in two hours. Well, that went about as poorly as it possibly could have. Two hours later, Keith gave us a call back and in about eight minutes walked us through changing the setting. But before he did that, he did say, \"Hey, if you bring it in, \"I'd be happy to fix this for you for no charge.\" He joked about charging us $600 for it or something like that, but was obviously joking in the way that he does. And I guess at this point. It's an A. He hit everything. Now that everything's fixed up, we should take a look at the kind of performance we should be getting from our Origin PC. And this is cool. While I was digging into that, I noticed a couple of other things that Keith got right. He installed ICue and he installed what then was probably the latest GeForce drivers. These are quite new, even though they're not quite the newest. The reason I was poking around in the control panel was that I want to enable DSR, Dynamic Super Resolution, so we can see what kind of 4K gaming performance we should expect from a machine like this. Here's what I'm thinking: 4K, ray tracing ultra, natively rendered, and then motion blur off. Should handle it, right? Maybe? We'll see? God, this game looks so good when you max it out, but it is so demanding. This is a 4090. With a core i9-14900K, and we're getting about 70 FPS. Now with that said, it's a really even 70 FPS. So it feels extremely smooth compared to if we had lows that were much, much lower and we were getting any kind of hitching or stutter. But when you crank it, man is ray tracing ever heavy. The good news is now that Keith has solved our fan problems, it's quiet. Yeah. Not everybody needs a swanky LCD on their cooler, a ton of RGB fans, an RTX 4090, a 990 Pro SSD, and 32 gigs of dominator memory. The Neuron starts at just over $2,300 with respectable specs in ready to ship configurations, and you can find links to their Neuron desktops and more in the description down below. But if you want one that goes this hard, you can win one for free. Origin PC is giving away a Neuron. Just like the ones we used today with a Core i9-14900K and an RTX 4090. Winners will be drawn two weeks from today and all you need to do is follow the link to Origin PC's giveaway down below and enter. Big thanks to them for sponsoring this video. While I can't speak to the experience you'll have at every single Best Buy, or at every single mom and pop shop, I still think there were some interesting learnables here that might help equip you better if you or One of your loved ones who you don't feel like fixing a computer for ever needs to go through an experience like this If you guys enjoyed this video, maybe check out the recent secret shopper origin pc makes a very small cameo",
    "transcript_keywords": [
        "Keith",
        "Yeah",
        "Origin",
        "problem",
        "Buy",
        "system",
        "fans",
        "thing",
        "kind",
        "machine",
        "friend",
        "custom",
        "whoa whoa whoa",
        "shop",
        "software",
        "whoa",
        "issue",
        "thermal paste",
        "systems",
        "whoa whoa"
    ],
    "transcript_entity_values": [
        "an A. Colin",
        "Helldivers 2",
        "DSR",
        "one",
        "Norton",
        "SSD",
        "1060",
        "One",
        "RGB",
        "6,200",
        "GPU",
        "Dell",
        "Keith",
        "50",
        "209",
        "6,000",
        "AVX",
        "three",
        "Under 10 minutes",
        "15 year old",
        "Hoffman",
        "Canadian",
        "Dynamic Super Resolution",
        "the Best Buy PC",
        "the Best Buy on King George Highway",
        "only one",
        "AIO",
        "4090s",
        "Secret Shopper",
        "Norton",
        "ASUS",
        "4090",
        "CMOS",
        "Helldivers",
        "first",
        "keith",
        "about eight minutes",
        "just over $2,300",
        "3k",
        "HP Lenovo",
        "a week",
        "990",
        "First",
        "32",
        "Origin",
        "Keith",
        "XMP",
        "MSI",
        "the Langley Best Buy",
        "a couple days ago",
        "70",
        "two weeks",
        "250 bucks",
        "4",
        "more than 24 hours",
        "CPU",
        "max",
        "Helldivers 2",
        "six",
        "OEM",
        "five-year-old",
        "Chewie",
        "LCD",
        "WinZip",
        "20 bucks",
        "14900",
        "10 minutes",
        "hundreds",
        "four labor hours",
        "Windows",
        "a couple of months ago",
        "GeForce",
        "three days",
        "hundred dollars",
        "Emily",
        "Two hours later",
        "Origin",
        "43",
        "Black Lab",
        "a ton",
        "5,000",
        "12",
        "600",
        "two",
        "second",
        "two hours",
        "600",
        "Reddit",
        "K",
        "Neuron",
        "today",
        "NVIDIA",
        "a hundred bucks",
        "4090",
        "123",
        "us $600",
        "tonight",
        "a second",
        "Breaking",
        "us $200",
        "2",
        "100",
        "Windows",
        "USB",
        "about 20 minutes half",
        "Core",
        "less than five minutes"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE",
        "PERSON",
        "NORP",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "TIME",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "PERSON",
        "TIME",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "TIME",
        "TIME",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "TIME",
        "ORG",
        "TIME"
    ],
    "vector": [
        -0.08365264534950256,
        -0.025935744866728783,
        0.031455010175704956,
        -0.11289933323860168,
        0.09710873663425446,
        -0.0026858472265303135,
        0.014401808381080627,
        0.08366915583610535,
        -0.0857740193605423,
        -0.013226471841335297,
        0.04008135944604874,
        0.022811101749539375,
        -0.0444054938852787,
        0.01781265065073967,
        0.003149069380015135,
        0.0019666943699121475,
        0.08448366820812225,
        -0.05412336438894272,
        -0.014054110273718834,
        -0.04500250890851021,
        -0.11344041675329208,
        -0.06362515687942505,
        -0.0573560856282711,
        0.010404683649539948,
        -0.012426658533513546,
        3.5567936720326543e-06,
        -0.001008887542411685,
        0.017812125384807587,
        0.014943818561732769,
        -0.0149412602186203,
        -0.06728409230709076,
        -0.007329909130930901,
        0.005268990062177181,
        0.008441969752311707,
        -0.002982048550620675,
        -0.03716456890106201,
        -0.008460326120257378,
        -0.1336383819580078,
        -0.08504995703697205,
        -0.07842537015676498,
        0.03084789589047432,
        -0.02551029436290264,
        -0.01881546527147293,
        0.027023399248719215,
        0.049005039036273956,
        0.004206286743283272,
        0.05962900444865227,
        -0.0851416066288948,
        0.019487936049699783,
        -0.017167119309306145,
        -0.034226417541503906,
        -0.05162651091814041,
        0.0068883770145475864,
        -0.009306881576776505,
        -0.09759330004453659,
        0.06288262456655502,
        0.0029990309849381447,
        -0.038543324917554855,
        0.05289635434746742,
        -0.017351550981402397,
        0.06405084580183029,
        -0.07071418315172195,
        0.004534784704446793,
        0.05672276020050049,
        0.08004861325025558,
        -0.024176938459277153,
        0.004796770866960287,
        0.08325661718845367,
        -0.012484538368880749,
        0.029809733852744102,
        0.013053136877715588,
        0.00014965914306230843,
        0.013541754335165024,
        0.10567893832921982,
        -0.019497264176607132,
        0.03226209431886673,
        0.05015895888209343,
        -0.06303395330905914,
        0.011655010282993317,
        0.009535067714750767,
        0.03357229381799698,
        -0.019340476021170616,
        0.004088141024112701,
        -0.05242874100804329,
        0.051105890423059464,
        -0.021418364718556404,
        0.05461747571825981,
        0.009995345026254654,
        -0.011313981376588345,
        -0.07725020498037338,
        -0.008759229443967342,
        0.04884853586554527,
        0.0955187976360321,
        0.026609789580106735,
        -0.00876920111477375,
        0.0126098757609725,
        0.02650296688079834,
        -0.067286916077137,
        -0.033523038029670715,
        0.05270692706108093,
        0.012237092480063438,
        0.03550386056303978,
        0.012081364169716835,
        -0.046555910259485245,
        -0.08911646157503128,
        -0.0972505733370781,
        -0.01667034439742565,
        0.1285473108291626,
        0.03325442597270012,
        -0.028292905539274216,
        -0.1111152246594429,
        0.06811592727899551,
        -0.07791567593812943,
        -0.036402370780706406,
        0.05241161584854126,
        -0.005015663802623749,
        -0.08330169320106506,
        0.04527105763554573,
        0.028292523697018623,
        -0.05445288121700287,
        -0.019654517993330956,
        -0.01301409862935543,
        0.016627516597509384,
        0.0023633951786905527,
        0.025867346674203873,
        -0.017372583970427513,
        -0.034419361501932144,
        1.8618936039292455e-33,
        -0.04841449111700058,
        0.04773252457380295,
        -0.08069320023059845,
        -0.04407260939478874,
        -0.011698760092258453,
        0.004895407240837812,
        0.04531189799308777,
        -0.003661923808977008,
        -0.004690125118941069,
        0.029867175966501236,
        0.032965075224637985,
        -0.008513592183589935,
        -0.08423280715942383,
        0.00042623409535735846,
        -0.017644967883825302,
        -0.040348492562770844,
        -0.048099979758262634,
        0.04628732427954674,
        -0.05583241954445839,
        -0.034928642213344574,
        -0.010822096839547157,
        0.010243629105389118,
        0.041879937052726746,
        -0.01729436405003071,
        0.07310707122087479,
        -0.07480072230100632,
        -0.04725143313407898,
        0.028301594778895378,
        0.05980147421360016,
        0.032920461148023605,
        -0.06265909969806671,
        -0.04325523599982262,
        -0.0009259278886020184,
        -0.00708087207749486,
        -0.014158020727336407,
        0.004520797170698643,
        -0.07612059265375137,
        -0.11393783986568451,
        0.008357810787856579,
        0.022941019386053085,
        -0.05291206017136574,
        0.048356883227825165,
        -0.046978890895843506,
        -0.09356248378753662,
        -0.00984712690114975,
        0.017406605184078217,
        0.018432341516017914,
        0.02323320135474205,
        -0.019629640504717827,
        -0.031415678560733795,
        -0.08339416980743408,
        0.009633596986532211,
        -0.07099790126085281,
        -0.006255537271499634,
        -0.01400255411863327,
        -0.05679862201213837,
        0.05811154469847679,
        -0.023579319939017296,
        0.08854102343320847,
        -0.009872914291918278,
        0.06603705883026123,
        -0.04778840020298958,
        -0.019373798742890358,
        -0.04988669976592064,
        -0.03620970994234085,
        0.036493733525276184,
        0.09522706270217896,
        -0.042556632310152054,
        -0.04191315546631813,
        -0.04280313476920128,
        -0.01996150240302086,
        -0.036245208233594894,
        0.02083016186952591,
        -0.049228038638830185,
        0.01250231172889471,
        0.00021061240113340318,
        -0.14860209822654724,
        -0.018525205552577972,
        -0.057313114404678345,
        0.00491328164935112,
        -0.04060573875904083,
        0.013611352071166039,
        0.013733779080212116,
        -0.014495797455310822,
        0.04739715903997421,
        0.00670236349105835,
        0.011040878482162952,
        -0.02260308712720871,
        0.022072967141866684,
        -0.009975727647542953,
        -0.06320440769195557,
        0.015356689691543579,
        0.010741221718490124,
        0.03345867618918419,
        -0.030092723667621613,
        -3.6551633170254244e-33,
        -0.06206054240465164,
        -0.028763674199581146,
        0.008517483249306679,
        0.10971473157405853,
        -0.02503693290054798,
        -0.008398490957915783,
        0.04502194747328758,
        -0.0014810195425525308,
        0.08237166702747345,
        0.01890416443347931,
        0.04593358561396599,
        -0.03473112732172012,
        -0.0931815505027771,
        -0.10603952407836914,
        0.024518933147192,
        -0.02410704642534256,
        0.01161267515271902,
        -0.054337553679943085,
        0.07209055870771408,
        -0.06555794179439545,
        0.10897058248519897,
        -0.008500207215547562,
        -0.008079287596046925,
        0.0769239142537117,
        0.005283025559037924,
        0.048663750290870667,
        0.006310748402029276,
        0.014273809269070625,
        0.013134057633578777,
        0.02834944613277912,
        0.005434177350252867,
        -0.024573365226387978,
        -0.018480878323316574,
        0.08936767280101776,
        0.09969396144151688,
        -0.007107050623744726,
        0.0802375003695488,
        0.058911606669425964,
        -0.022717351093888283,
        -0.05806799232959747,
        0.06203518062829971,
        0.07442571967840195,
        -0.0024645994417369366,
        0.010454985313117504,
        -0.009635603055357933,
        -0.06271954625844955,
        0.007455865852534771,
        -0.09309706091880798,
        0.06993024796247482,
        0.058813758194446564,
        0.007534831762313843,
        -0.08169521391391754,
        0.09610294550657272,
        -0.03962075710296631,
        -0.033939704298973083,
        0.01652752421796322,
        0.025614146143198013,
        0.06698063760995865,
        -0.0008033002959564328,
        -0.07278995960950851,
        0.07602051645517349,
        -0.013586693443357944,
        -0.05312706530094147,
        -0.057327207177877426,
        0.03372730687260628,
        0.021289780735969543,
        0.06841180473566055,
        0.07646413147449493,
        0.017640797421336174,
        -0.012927516363561153,
        -0.024418750777840614,
        0.00667216069996357,
        0.023719467222690582,
        -0.13144482672214508,
        -0.03893773630261421,
        0.01602589525282383,
        0.022008908912539482,
        0.0009090462699532509,
        0.05329045653343201,
        -0.060151711106300354,
        -0.011876464821398258,
        0.019056551158428192,
        0.07332862913608551,
        0.03385106846690178,
        0.06460925936698914,
        0.04866662621498108,
        0.028416194021701813,
        0.018368184566497803,
        -0.003883946454152465,
        -0.05663389712572098,
        -0.05633269250392914,
        0.013942535035312176,
        0.017317447811365128,
        0.018003595992922783,
        0.044042740017175674,
        -5.7203045855658274e-08,
        -0.040345195680856705,
        -0.028064606711268425,
        0.005682445131242275,
        0.08174076676368713,
        0.03583402931690216,
        -0.10901166498661041,
        -0.03007243387401104,
        -0.00938512571156025,
        0.053415145725011826,
        0.012937975116074085,
        0.019929274916648865,
        -0.09923991560935974,
        -0.02448093518614769,
        -0.002480877563357353,
        -0.01888475939631462,
        -0.02994658797979355,
        -0.0725027546286583,
        0.12141644954681396,
        -0.05838269740343094,
        -0.10442870855331421,
        -0.004470630083233118,
        0.04203222319483757,
        0.16975031793117523,
        -0.018501292914152145,
        -0.022308453917503357,
        0.061960045248270035,
        0.023980755358934402,
        0.07794442027807236,
        0.10531973838806152,
        -0.09557010233402252,
        -0.1336117833852768,
        -0.027392175048589706,
        0.018192527815699577,
        -0.022694917395710945,
        0.06423265486955643,
        -0.03836507722735405,
        0.032090578228235245,
        0.059054479002952576,
        0.09045843034982681,
        0.0038725968915969133,
        -0.0401473231613636,
        -0.03564848378300667,
        0.03497641906142235,
        0.04699774086475372,
        0.04872767999768257,
        -0.018467921763658524,
        -0.01780768483877182,
        -0.06968356668949127,
        -0.048572394996881485,
        -0.020578788593411446,
        0.031872380524873734,
        -0.002719916868954897,
        -0.023343294858932495,
        0.035927724093198776,
        0.02755584754049778,
        -0.06131017208099365,
        -0.020614968612790108,
        0.07276131957769394,
        -0.006464637350291014,
        0.0701904147863388,
        -0.017626062035560608,
        -0.10429676622152328,
        -0.015450078062713146,
        0.052966635674238205
    ]
}