{
    "id": "1LLvmJ2xZOU",
    "title": "MSI GE76 Raider review: the most powerful gaming laptop",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-01-31T15:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=1LLvmJ2xZOU",
    "category": "Science & Technology",
    "tags": [
        "Intel",
        "Alder Lake",
        "12th GEN",
        "Intel 12th-gen",
        "Apple",
        "M1",
        "M1 chip",
        "M1 max",
        "apple m1",
        "MSI GE76 Raider",
        "MSI GE76",
        "MSI GE76 price",
        "Raider",
        "gaming laptop",
        "laptop",
        "best laptops",
        "best gaming laptop",
        "GE76 Raider",
        "12th Gen mobile processors",
        "Ryzen 6-series",
        "14-cores",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge",
        "msi ge76 raider",
        "msi ge76 review",
        "msi ge76 raider review",
        "intel alder lake",
        "intel 12th gen",
        "intel vs amd"
    ],
    "views": 208075,
    "likes": 5891,
    "comments_count": 553,
    "description": "Weve gotten our first look at Intels new 12th Gen mobile processors in MSIs upcoming GE76 Raider, but can it beat the M1 Max? These chips are unbelievably powerful, but that power comes with some trade-offs.   Read more:   Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://www.theverge.com/e/22670932",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- So it's that time of year again. Intel has released its new mobile processors. It's 12th Gen line code named Alder Lake. The desktop version of these chips have been out for awhile and they're quite powerful, but we've been waiting for months to try out the laptop versions and see how they compare to the best chips on the market, including of course, Apple's M1 Max. And we've finally got a system in our hands. We've run some tests, we've exported some videos, we've played some games, and we finally got answers to the questions we've been asking for months. Well, we kind of do. There are some caveats, so let's get into it. (exciting music) Alder Lake is an entirely new architecture for Intel and it represents a major strategic shift for the company. Intel processors have showed off some serious single core power in recent years, but where they've really fallen behind Apple and AMD is in power efficiency, that is battery life. So this year, Intel is going hybrid. Like Apple's M1, these new chips have a combination of performance cores and efficiency cores. The chip we had today is the Core i9-12900HK, which is the flagship of this year's Alder Lake mobile one. Intel says it's the most powerful mobile chip that it's ever made. So it has 14 cores, including six performance cores and eight efficiency cores. If any Intel chip is going to beat Apple's powerhouses, it's probably this one. The system we have here is the MSI GE76 Raider and this gaming laptop is the mother of all gaming laptops. It's 17 inches, it's covered in RGB, it's six and a half pounds, and it's got NVIDIA's brand new GeForce RTX 3080 Ti, mobile GPU, and some heavy duty cooling inside. Before we go any further, the thing to note about this device is that it's not cheap. The 12th Gen GE76 Raider models will start as low as $1,599, but if you want the powerful specs we have here, you'll need to fork over $3,999. You can probably see why Intel chose this device as the first Alder Lake laptop to show the public. It's about as close to a desktop as a laptop can get. So if you are the most powerful chip on the market trying to show off your full potential, the GE76 Raider is where you want to live. Now, there are a lot of things to like about the GE76 Raider. The keyboard and the light strip are both full of pretty colors, and while the keys aren't the fastest or the sturdiest one I've ever used, they have a quite a satisfying click. (typing keys clicking) The speakers are fantastic with some serious bass, which I rarely ever get to say about laptop audio, and the port selection is huge. So you get three USB-A, two USB-C, a full-size SD slot, a headphone jack, a display port, and HDMI and an ethernet jack, and everything is pretty spread out. I really had all the ports I needed. But there are also some things that are a bit odd to see at this price point. In particular, if you're paying $4,000 for a laptop, you would probably expect that laptop to have a QHD, if not a 4K screen, but nope. Our test model is a good 1920 x 1080 with a 360 Hertz refresh rate. That's a lot of frames, but on a 17-inch display it still means you're talking about some substantial pixels. And while my games didn't look terrible, they did look a bit grainy. MSI is also selling a 240 Hertz QHD model for the same $4,000 price, and to be honest, I don't see a reason not to just buy that one, unless you're an E-sports person who really needs those extra frames. For everyone else, the primary benefit of having a 360 Hz 1080p screen is that it allows Intel's processor to show off some absolutely absurd frame rates. So let's talk about those frame rates. This is hands down, the most powerful gaming laptop I have ever tested. On famously demanding games, like Red Dead Redemption 2, Cyberpunk 2077, and Shadow of the Tomb Raider, this GE76 put up the best frame rates we've ever seen. I ran CS:GO, which is a super CPU heavy game, mostly for fun and average 415 frames per second, which I think is the highest frame rate I've ever seen a laptop generate on any game ever. Our favorite gaming laptop of 2021, the Zephyrus G 15 got less than half that. So this is mostly just to get those numbers out of the way. If you're paying $4,000 for a gaming laptop, you should be getting better frame rates than every other gamer you know. But what's even more impressive is how dominant this chip is in productivity workloads. (soft upbeat music) We ran our real world 4K video export and the GE76 Raider just wrecked it. It finished in just a 1:56. That's the fastest time I've ever seen a laptop complete this test, except for, can you guess? The M1 MacBook Pro with M1 Max. Now because different versions of Premiere Pro can impact the export time, this real world test doesn't always make for the best apples to apples comparison, but the GE76 was even more dominant on the synthetic Puget Systems benchmark for Premiere Pro, which tests live playback and export performance. So this device got the highest score I have ever seen a laptop get on that test. Not only is it beating Intel's 11th Gen chips, but it's beating every score I've ever seen an M1 machine get as well. You're getting desktop level performance here when it comes to content creation. (light music) But there are some big, big asterisks here. So first, this is a huge laptop. For some context, the 60-inch MacBook Pro that achieved these results is 4.8 pounds and 0.66 inches thick. That's not a tiny machine, but the GE76 Raider is six and a half pounds and over an inch thick. That extra size and weight is a significant compromise. Now, before you get mad at me in the comments, I know the GE76 and the MacBook are targeting different audiences, and these comparisons between the Core i9 and the M1 Max probably don't matter to too many gamers. But they matter in general because they help us see where Intel is in the context of the broader market. And they help illustrate how much extra power and cooling the Core i9 needs to achieve this performance. And then there's battery life. The battery life, it wasn't great. I got just over four and a half hours when I was multitasking in Chrome, and that's not a terrible result among today's 17-inch gaming laptops, but that was sort of Intel's whole goal in moving to a hybrid architecture. It was supposed to deliver exceptional battery life. And this battery life is just average and it's nowhere near the 10-hour lifespan we got out of our 16-inch M1 Max system. While gaming on battery, the GE76 could go for an hour and 15 minutes before dying. That's actually an okay score, but it's somewhat misleading because the game was only really playable until about 45 to 50 minutes in. For the last half hour or so, it was stuttering all over the place and just not really fun. That makes me nervous for what we might see coming out of ultra portable laptops, where battery life is way more important than it is for gaming devices. This was a test of Alder Lake's E-Cores and in my opinion, they didn't passed. (soft upbeat music) All in all from the battery life to the weight, to the port selection, it's increasingly clear why Intel chose the GE76 to show off Alder Lake mobile for the first time. It's a laptop that's meant to spend most of its time plugged in, so battery life isn't super important. And it's a laptop that puts basically no constraints on the Core i9 inside. MSI was able to pair the chip with NVIDIA's top of the line mobile GPU and provide the heavy duty cooling necessary to make that pair work, and it's charging a very, very high price for all that engineering. But the GE76 Raider is still a pretty specific use case. And if the rest of the market is any indication, shoppers, myself included, really want thin and portable laptops right now. Many of the biggest manufacturers are making their laptops thinner and lighter at the expense of other features. To really judge whether Intel's venture into hybrid architecture has been successful, we need to know whether these mobile chips will deliver in a thin, light, and most importantly, affordable chassis in the future. We've seen Alder Lake perform very well in multiple power user desktop scenarios at this point, but on-the-go use, for me, it still a question mark. So yes, Intel has made an astonishingly powerful chip. Good job, Intel. Good job. But when it comes to performance and battery life in a machine, I might actually wanna buy. I'm still waiting. Thanks for watching. Make sure to like and subscribe. And while you're here, make sure to watch Becca's latest full frame video on how to shoot better night photos.",
    "transcript_keywords": [
        "Alder Lake",
        "Intel",
        "Alder Lake mobile",
        "laptop",
        "Alder Lake laptop",
        "battery life",
        "Raider",
        "Lake",
        "Alder",
        "battery",
        "gaming laptop",
        "year Alder Lake",
        "life",
        "chip",
        "core",
        "cores",
        "gaming",
        "Lake mobile",
        "named Alder Lake",
        "laptops"
    ],
    "transcript_entity_values": [
        "AMD",
        "Premiere Pro",
        "Shadow of the Tomb Raider",
        "three",
        "the Zephyrus G 15",
        "2",
        "2077",
        "CPU",
        "4,000",
        "1920",
        "jack",
        "Chrome",
        "MSI",
        "Red Dead",
        "17 inches",
        "a 360 Hz 1080p",
        "12th",
        "M1 MacBook Pro",
        "11th",
        "M1",
        "360",
        "Alder Lake",
        "GPU",
        "M1 Max",
        "17-inch",
        "0.66 inches",
        "GeForce",
        "MacBook Pro",
        "RGB",
        "an hour and 15 minutes",
        "about 45 to",
        "MacBook",
        "this year",
        "240",
        "first",
        "recent years",
        "E-Cores",
        "the last half hour",
        "Gen GE76 Raider",
        "the MSI GE76 Raider",
        "Puget Systems",
        "Alder Lake",
        "less than half",
        "Becca",
        "16-inch",
        "the GE76 Raider",
        "4",
        "as low as $1,599",
        "SD",
        "USB-C",
        "4.8 pounds",
        "second",
        "1:56",
        "Intel",
        "Alder Lake's",
        "Alder Lake",
        "2021",
        "six and a half pounds",
        "one",
        "Apple",
        "60-inch",
        "14",
        "today",
        "just over four",
        "3080 Ti",
        "1080",
        "eight",
        "year",
        "six",
        "months",
        "Hertz",
        "10-hour",
        "two",
        "over $3,999",
        "Core",
        "NVIDIA",
        "415",
        "HDMI"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "PRODUCT",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "FAC",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "LOC",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.03023996762931347,
        -0.02556951344013214,
        -0.009483782574534416,
        -0.04960741102695465,
        0.0072365510277450085,
        -0.09461142867803574,
        -0.09534180909395218,
        -0.00029653526144102216,
        -0.0640278160572052,
        0.006528215482831001,
        -0.017553022131323814,
        0.03209127485752106,
        -0.007769279181957245,
        -0.016669640317559242,
        0.058484114706516266,
        0.0499972403049469,
        0.1371399313211441,
        -0.13163961470127106,
        -0.008169963024556637,
        0.03356073051691055,
        -0.02875140681862831,
        0.0029247491620481014,
        -0.02475881017744541,
        -0.01069717574864626,
        0.06557809561491013,
        0.0007317371782846749,
        0.019743653014302254,
        0.005732274614274502,
        -0.0509241446852684,
        -0.00741214444860816,
        -0.008081924170255661,
        0.06400585174560547,
        -0.020928001031279564,
        0.039996251463890076,
        0.016373716294765472,
        -0.07024151086807251,
        0.07724872976541519,
        -0.0756993517279625,
        -0.0009396523819305003,
        -0.10810615122318268,
        -0.1101825013756752,
        -0.004711422137916088,
        0.11819466203451157,
        0.02399791218340397,
        0.05721895024180412,
        -0.019126802682876587,
        -0.00989135354757309,
        -0.12644347548484802,
        0.012421357445418835,
        0.060752883553504944,
        -0.06040459871292114,
        -0.09102117270231247,
        0.015350724570453167,
        -0.015302186831831932,
        -0.021515680477023125,
        -0.010223601013422012,
        -0.02669626474380493,
        -0.03401235491037369,
        0.04721982777118683,
        0.024311773478984833,
        0.044635698199272156,
        -0.10239063203334808,
        0.008926325477659702,
        0.0029353059362620115,
        0.0065880161710083485,
        -0.04417940601706505,
        0.049626704305410385,
        -0.05611523240804672,
        -0.005497392732650042,
        -0.010626878589391708,
        0.0019996389746665955,
        -0.03943038359284401,
        0.018769316375255585,
        -0.007730078883469105,
        -0.012684446759521961,
        0.04799337312579155,
        0.022732684388756752,
        -0.03800617903470993,
        0.0485345721244812,
        -0.0354120247066021,
        0.023891011252999306,
        -0.016913332045078278,
        0.0008295743609778583,
        0.010712976567447186,
        0.0416378490626812,
        -0.02316030114889145,
        -0.017541654407978058,
        0.05514257401227951,
        -0.002192646963521838,
        -0.026555191725492477,
        0.04387902468442917,
        0.05707288905978203,
        -0.004744378384202719,
        0.01743795908987522,
        0.08240381628274918,
        -0.0010971386218443513,
        -0.029037410393357277,
        -0.11611281335353851,
        -0.04173137992620468,
        0.06104113906621933,
        0.0036301775835454464,
        0.08359193801879883,
        0.08122928440570831,
        0.006661132909357548,
        -0.03778013959527016,
        0.0013238112442195415,
        0.0396728478372097,
        0.10719340294599533,
        -0.04247405007481575,
        -0.03044525533914566,
        0.023520346730947495,
        0.05906163901090622,
        -0.019751176238059998,
        0.009848838672041893,
        0.024682361632585526,
        -0.036686986684799194,
        -0.03705325722694397,
        0.055849719792604446,
        0.06892844289541245,
        0.06571296602487564,
        -0.020260201767086983,
        0.026130538433790207,
        -0.06212804839015007,
        0.025350943207740784,
        0.04297085851430893,
        0.07027094066143036,
        -0.10008978098630905,
        4.115794370048569e-33,
        -0.020516809076070786,
        0.043480150401592255,
        -0.00838635116815567,
        -0.007320639677345753,
        0.014087758027017117,
        -0.04693517088890076,
        0.026166556403040886,
        -0.013595262542366982,
        -0.017721662297844887,
        0.028600893914699554,
        -0.07540759444236755,
        -0.01605577953159809,
        -0.07485149055719376,
        0.04738346114754677,
        0.08956311643123627,
        -0.10797115415334702,
        0.021199200302362442,
        -0.04411826282739639,
        -0.06999928504228592,
        0.007574338465929031,
        0.07343468070030212,
        -0.010231329128146172,
        0.032596517354249954,
        -0.13771778345108032,
        0.053278014063835144,
        0.08467675000429153,
        -0.0017342334613204002,
        -0.02758132852613926,
        0.023690132424235344,
        0.030152078717947006,
        -0.05692832171916962,
        -0.05978994816541672,
        -0.06416066735982895,
        -0.02708316780626774,
        -0.02303112857043743,
        0.0366947166621685,
        -0.0702286809682846,
        -0.0739767774939537,
        0.012986362911760807,
        -0.00992986373603344,
        -0.09256428480148315,
        0.12408924847841263,
        -0.06753360480070114,
        -0.034089699387550354,
        0.016789330169558525,
        0.022650957107543945,
        -0.011486186645925045,
        0.0004228964098729193,
        -0.00512011768296361,
        -0.05052528157830238,
        -0.0808214545249939,
        0.045803893357515335,
        -0.05563459172844887,
        -0.003580872667953372,
        -0.03636522963643074,
        -0.004821181762963533,
        0.11085913330316544,
        0.027465729042887688,
        0.08714046329259872,
        0.10661235451698303,
        -0.04098336771130562,
        -0.01608031801879406,
        -0.07721535861492157,
        0.05244050174951553,
        -0.04113130271434784,
        0.04878081753849983,
        0.0795520693063736,
        0.021710272878408432,
        -0.09574032574892044,
        0.08993014693260193,
        -0.018697163090109825,
        -0.04161541536450386,
        0.06172923743724823,
        -0.056938186287879944,
        0.03076988086104393,
        -0.010262832045555115,
        -0.033791329711675644,
        -0.004100095480680466,
        -0.05234178900718689,
        -0.03800899162888527,
        -0.01325950212776661,
        0.03253219276666641,
        -0.04932219907641411,
        -0.038001421838998795,
        -0.023251255974173546,
        0.06866704672574997,
        -0.040086276829242706,
        -0.051045387983322144,
        -0.0023358315229415894,
        0.026260824874043465,
        -0.01948334462940693,
        0.006080518011003733,
        0.039672836661338806,
        0.050144534558057785,
        -0.03147013857960701,
        -4.614493440281109e-33,
        -0.046352319419384,
        -0.05301419645547867,
        0.009659727104008198,
        0.07553192228078842,
        -0.01109782513231039,
        -0.035515256226062775,
        0.011416120454668999,
        -0.009817816317081451,
        -0.07993446290493011,
        -0.07093258202075958,
        -0.006434874143451452,
        0.06400133669376373,
        0.013355848379433155,
        0.005167107563465834,
        0.01965850405395031,
        -0.04183323308825493,
        0.01501944474875927,
        -0.08607727289199829,
        0.130303755402565,
        -0.05719170719385147,
        0.09137066453695297,
        0.08828367292881012,
        0.011385838501155376,
        -0.04258802905678749,
        0.04666401445865631,
        -0.011035862378776073,
        -0.019011586904525757,
        0.018909607082605362,
        0.04880760982632637,
        -0.03223094716668129,
        -0.031701479107141495,
        -0.011647773906588554,
        0.04903420805931091,
        -0.01633865013718605,
        0.09993869066238403,
        0.03577297925949097,
        0.03223273158073425,
        -0.005977763794362545,
        -0.021396545693278313,
        0.05449618399143219,
        0.08160420507192612,
        0.02788720279932022,
        -0.04737766832113266,
        0.00708579458296299,
        0.06763049960136414,
        0.06936811655759811,
        -0.02655174769461155,
        -0.010852517560124397,
        0.06742437183856964,
        -0.04051640257239342,
        0.007719486020505428,
        -0.04554636403918266,
        -0.010779078118503094,
        -0.033760301768779755,
        -0.0016021581832319498,
        -0.09095215052366257,
        -0.02534893900156021,
        -0.022988395765423775,
        -0.010972774587571621,
        -0.032233159989118576,
        0.028976233676075935,
        0.034898702055215836,
        -0.034330371767282486,
        -0.04830628260970116,
        0.004807529971003532,
        0.08080673217773438,
        0.03798985108733177,
        0.03502901643514633,
        -0.01276366226375103,
        0.018343668431043625,
        -0.06006079912185669,
        -0.04872117564082146,
        -0.014089296571910381,
        -0.0471002534031868,
        -0.02191164344549179,
        0.025744400918483734,
        0.00648995628580451,
        -0.0437152124941349,
        -0.0033719551283866167,
        -0.03802603483200073,
        -0.006827902980148792,
        0.0724077895283699,
        0.015511234290897846,
        0.05108825862407684,
        0.10083214938640594,
        0.0449027419090271,
        0.06913653016090393,
        0.004388975445181131,
        -0.05343930423259735,
        -0.04688873514533043,
        -0.054596904665231705,
        -0.012969973497092724,
        -0.027715332806110382,
        0.012405497021973133,
        -0.09096450358629227,
        -5.3332431804165026e-08,
        0.010535218752920628,
        -0.05033561587333679,
        -0.006920319050550461,
        0.01519495528191328,
        0.01067387219518423,
        -0.022532008588314056,
        0.0023350787814706564,
        0.0324152410030365,
        0.07775794714689255,
        -0.0005273802671581507,
        0.09638072550296783,
        -0.0945771262049675,
        -0.06336408853530884,
        0.008614685386419296,
        0.04659164696931839,
        0.051689933985471725,
        -0.050687383860349655,
        0.008642262779176235,
        -0.011373988352715969,
        -0.02284133806824684,
        -0.011718097142875195,
        0.03299945220351219,
        0.13282111287117004,
        -0.035248443484306335,
        -0.04201041907072067,
        0.01140701025724411,
        -0.0623733326792717,
        0.020732644945383072,
        0.02483644150197506,
        0.033125851303339005,
        -0.09286380559206009,
        0.016495445743203163,
        0.05582292750477791,
        -0.05770626664161682,
        0.006382382474839687,
        -0.04742174223065376,
        0.04817904531955719,
        0.06381504982709885,
        0.1488507241010666,
        0.005384787451475859,
        -0.03473740443587303,
        -0.08942431211471558,
        -0.04153082147240639,
        -0.029813863337039948,
        0.004191577900201082,
        -0.01814999058842659,
        -0.07599020004272461,
        -0.10084731131792068,
        -0.010321956127882004,
        0.06036921963095665,
        0.02013726532459259,
        -0.02032800205051899,
        0.04719102010130882,
        0.08779362589120865,
        0.05054275691509247,
        0.010159804485738277,
        -0.005186070688068867,
        -0.03957124799489975,
        -0.007514399942010641,
        0.049158770591020584,
        0.14366120100021362,
        -0.0986318364739418,
        0.02417095936834812,
        0.04723158851265907
    ]
}