{
    "id": "1m8jmwH-5-w",
    "title": "365 Day Battery!? - Eufy Wireless Security Camera!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-04-08T13:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=1m8jmwH-5-w",
    "category": "Howto & Style",
    "tags": [
        "Security system",
        "best security system",
        "battery security system",
        "wireless security system",
        "eufy security camrea",
        "eufy",
        "anker security",
        "battery security camera",
        "wireless doorbell",
        "video doorbell",
        "eufy security camera",
        "eufy doorbell",
        "eufycam 2 review",
        "eufy doorbell installation",
        "eufy floodlight cam"
    ],
    "views": 1394181,
    "likes": 49117,
    "comments_count": 2864,
    "description": "Ive been looking for an easy to install security system, and I think I finally found it! Thanks to Eufy for sponsoring this video: The EufyCam 2:   Use Code JERREUFY $80 OFF Battery Doorbell:   Use Code EUFYDB2K at $50 OFF Wired Doorbell:  Use Code JERRYDB3 at $52 OFF Floodlight Camera  Use Code EUFYFLC1 to get $40 OFF eufy Security Kit (Valid from April 8, 2020 - April 13, 2020) Exclusive JerryRigEverything deals on our best-selling eufy Security products. (Valid from April 8, 2020 - April 13, 2020) Use the codes for their best ever deals.   Wired security systems have their perks. But its nice that this wireless Eufy security system has a 365 day battery life, with no need to run wires through my walls.   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://amzn.to/2JtFzZD",
        "https://amzn.to/2wYhHdI",
        "https://amzn.to/2Xd188X",
        "https://amzn.to/39weFKZ",
        "https://bit.ly/3dKmLmB",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Security systems are pretty important...especially nowadays when you have to keep your toilet paper stash secure. But installing security systems is pretty complicated if you have a wired system. Running data cables and wires through a house that's already built is pretty difficult. Drilling through walls and patching walls isn't something I want to do right now. So I did some research and found a company called Eufy by Anker that doesn't require any of that complex installation procedure since it has a battery that lasts for 365 days. So I reached out to them and asked if they wanted to sponsor a video and they said yes as long as I took one apart to show how it works from the inside...which is kind of what we do around here. So this video is sponsored. You can get a 25% discount using the code in the description. And Eufy Security System doesn't just have cameras. It also has, you know, the whole video doorbell thing, as well as a keypad and actual alarm system for your house. They all interact seamlessly with each other. And I'll explain more in minute. But I think it's time to install this thing and we should be able to do it in less than 3 minutes. Lets get started. [Intro] So my favorite thing about this security system, besides the fact that it's easy to install with no wires, is that there are also no mandatory monthly fees. It's a one-time purchase And yeah, like I mentioned before, this is a full-fledged security system with alarms and a 2K resolution video doorbell. But today we're going to be focusing on the 1080p high definition outdoor security camera with their 365 day battery life. I'm curious to see how big the battery actually is on the inside. This box has 2 cameras and the base station. And you can see that both of the cameras have a massively strong magnet on the back. There are 2 types of mounts that come in the box: an indoor mount with just a curved ball looking thing where the camera can just magnetically sit anywhere on that half circle. And the other outdoor mount which has a screw attachment. This actually screws into the back of the camera to hold it in a fixed position. I'll do a nighttime darkness test at the end of this video, but first let's see how this UV cam 2 works from the inside. Now, getting inside of a water-tight security camera is pretty difficult. There are 4 star-shaped screws next to the microUSB charging port, which hopefully I'll only need to use that port once a year. The super strong magnets in here make guiding my screwdriver rather difficult. But once all those screws are out I can start working my way around the lens of the camera. This thing is strongly glued shut and definitely not designed to come apart, but that's never stopped us before. After applying a ridiculous amount of pressure, I can finally pull the camera guts out of the water-tight housing. And we get our first look at the large circular magnet at the base of the camera. We can also see the charging port board, as well as a portion of the internal battery. It looks like this thing is 13,000 milliamp hours. The way this battery is able to last an entire year is that it's not recording consistently 24/7. It sits in standby until it notices motion, you know, either a person moving or some kind of motion inside of the activity zones you create. And then it turns on the actual camera to send that footage or that highlight to the base station. So it's conserving energy by only streaming when you manually want to check the footage or when it senses something move. It should be able to handle 10 of these security captures every for 365 days without needing to recharge. But there's always that option of getting a super inexpensive small microUSB solar panel and plugging into the camera permanently. Then you'll never have to charge anything...ever. Inside of the battery pack are four 18650 lithium cells, which coincidentally is the same type of battery that Tesla was using in their electric cars. Except for instead of 4 cells, Tesla's using like 7,000. But still, if it's good enough for Tesla, it's good enough for my security camera. After digging a bit deeper we can pull out the 1080p Sony camera sensor. And then what I assume is the lower power in motion sensor that tells the camera when to start recording or not. And of course there's also the massive speaker below that motion sensor for the alarm and allows you to communicate through the camera. You know, for when people come to steal your toilet paper you can be like, 'Hey, wait! No, don't do that' through the camera. Finally we have the base station. Now I kind of forgot that I still need this thing to do the night footage, so I really hope the base station still works when I put it back together. After 4 screws are removed I can pull out the brains of the whole operation with it's tall Wi-Fi antennas. This doesn't need to be plugged into the router all the time. It can work on just Wi-Fi alone. And under this massive heat sink we have a metal plate which covers the internal storage. All of which, of course, is encrypted and none of which is ever stored on the Cloud. I have read that the UV system has the ability to store footage on a NAS backup, so I'll have to look into that some more. I do plan on buying more of these cameras. A hardwired security system would have its perks of course, but I'm sure glad that now I don't have to tear apart my house to install one. Now let's go see how well this system works outside. Getting started just takes a few seconds. I'll plug the base station into both power and my router. Then download the Eufy Security App and pair the two together. Then to add a camera to my system I just press one button on top of the camera [robot voice: 'Ready to add device'] when it's near the base station. [Beeping] And ...[robot voice: 'Device was added successfully.']. Now we can see if it can really be installed in 3 minutes or not. But either way, it's going to be a lot easier than running wires all throughout my house. Installing the camera is actually pretty easy. There is a very convenient little white sticker stencil that tells where two holes need to be drilled for that outside mount. Then I can remove the sticker and screw in two screws... [Drilling sounds]...that hold the plastic base to the exterior wall. Once that's secure the little ball mount gets clipped in and the whole camera can screw into place. One cool thing about this camera is that if anyone every tries to take or steal the camera itself, it triggers a 100 decibel alarm. [Alarm sounds] This alarm can also be triggered manually. [Alarm sounds] So this is what the audio and video sounds like from the camera. I'm about, I don't know, 10 feet away or so, headed back towards the house. And the camera should auto detect human faces as well as motion zones that you can set manually Kind of cool. So normally I would install a security system a little bit lower than that, but even at that height it has good resolution and I'm pretty clear. This is what the footage looks like from the 2K resolution doorbell. Slightly higher resolution than the 1080p security cameras. This doorbell has a 6 month battery, once again because it's not recording all the time, just when it senses motion. It's nice that Eufy has designed a complete security system that doesn't require monthly subscription or a complex installation. Now I installed my camera underneath an eave so it would be a little bit protected against the elements like snow, wind, water, all that stuff outside. But the camera itself is ip67, so as long as it's not submerged underwater, it should be resistant to weather. And as long as the cameras are placed within range of a base station, a base station can handle 16 cameras, which is a lot of footage. Now I've tried out other security systems in the past, ones that store all their information on the Cloud, and I've always noticed anytime I try to access that information that it takes forever for it to load on my phone. But since the Eufy is all located at one station on my own Wi-Fi, I can access it relatively quickly, which is pretty beneficial if you want to see exactly what set off the notification to your phone. Here's what the Eufy camera looks like at night. There's a few lights on at my house but it's 11pm and very dark outside. Obviously I'll have to wait a little bit and see how long the battery lasts on this camera. I'll leave an update down in the comments after a couple months or so. Either way, I'm super glad that I didn't have to tear down my house to install a security system. Thanks to Eufy for sponsoring this video. If you have any questions, leave them down in the comments. Come hang out with me on Instagram and Twitter. Thanks a ton for watching, I'll see you around.",
    "transcript_keywords": [
        "camera",
        "Security System",
        "Security",
        "base station",
        "system",
        "security camera",
        "cameras",
        "base",
        "Eufy",
        "Eufy Security System",
        "battery",
        "station",
        "Eufy Security",
        "thing",
        "video",
        "pretty",
        "house",
        "Eufy Security App",
        "inside",
        "motion"
    ],
    "transcript_entity_values": [
        "Anker",
        "NAS",
        "Eufy Security System",
        "microUSB",
        "Twitter",
        "ip67",
        "7,000",
        "Instagram",
        "four",
        "two",
        "Wi-Fi",
        "16",
        "Eufy",
        "Sony",
        "3 minutes",
        "half",
        "monthly",
        "4",
        "less than 3 minutes",
        "10 feet",
        "13,000 milliamp hours",
        "an entire year",
        "10",
        "Wi-Fi",
        "100 decibel",
        "11pm",
        "365 days",
        "Tesla",
        "first",
        "a couple months or so",
        "today",
        "2",
        "their 365 day",
        "a few seconds",
        "One",
        "the Eufy Security App",
        "6 month",
        "one",
        "25%",
        "Cloud",
        "1080p"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "LOC",
        "QUANTITY",
        "TIME",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.10225614905357361,
        0.0775284469127655,
        -0.024069108068943024,
        -0.05404328182339668,
        0.07287754118442535,
        -0.03469661623239517,
        0.08372993022203445,
        0.04417920857667923,
        -0.028881585225462914,
        0.08396903425455093,
        0.0427541583776474,
        0.002079219790175557,
        0.016660520806908607,
        0.022537846118211746,
        0.035438381135463715,
        0.023195035755634308,
        0.012344215996563435,
        -0.09548571705818176,
        -0.029687365517020226,
        -0.008506725542247295,
        -0.01662718504667282,
        -0.0967935100197792,
        0.08828607946634293,
        -0.041258081793785095,
        0.0014006784185767174,
        0.022078445181250572,
        0.009028050117194653,
        -0.028904275968670845,
        -0.09126631915569305,
        -0.02551198936998844,
        -0.04582589864730835,
        -0.00041965587297454476,
        -0.0236766766756773,
        -0.010617759078741074,
        0.0308865774422884,
        -0.0487329438328743,
        0.010977618396282196,
        0.009234659373760223,
        -0.06964974105358124,
        0.014073669910430908,
        -0.0837889164686203,
        -0.012294373475015163,
        -0.0063969967886805534,
        0.03762264549732208,
        -0.04930657520890236,
        0.004628895316272974,
        0.05553057789802551,
        -0.02337457984685898,
        -0.010898408479988575,
        -0.07078462094068527,
        0.03989062085747719,
        0.028955858200788498,
        0.05040819197893143,
        -0.009268459863960743,
        -0.04910759627819061,
        0.005686174146831036,
        -0.07619080692529678,
        -0.01902955397963524,
        0.06411023437976837,
        -0.008742647245526314,
        0.049754753708839417,
        0.010627951472997665,
        -0.03449606895446777,
        0.05491746589541435,
        -0.024546485394239426,
        0.03646266460418701,
        0.04043565317988396,
        -0.03393666446208954,
        -0.019404225051403046,
        -0.06015963852405548,
        -0.09226352721452713,
        0.022773869335651398,
        0.01430150680243969,
        0.03434550017118454,
        0.028899990022182465,
        0.05346359685063362,
        0.04377591982483864,
        -0.012146253138780594,
        0.036365389823913574,
        -0.06460320204496384,
        0.03634830564260483,
        -0.043710507452487946,
        0.0026482809334993362,
        0.01748354360461235,
        0.09539338201284409,
        0.044669706374406815,
        -0.0020536943338811398,
        0.05112549290060997,
        -0.02944517321884632,
        -0.02396608702838421,
        -0.00836240965873003,
        0.013664700090885162,
        -0.034835465252399445,
        0.03951265662908554,
        -0.036603786051273346,
        -0.05580948665738106,
        -0.02582063339650631,
        -0.05334248021245003,
        -0.0853162482380867,
        0.06139720231294632,
        -0.017161883413791656,
        -0.015164005570113659,
        0.03451913967728615,
        -0.05877692997455597,
        0.10497519373893738,
        -0.02367456816136837,
        0.011451988480985165,
        0.07392236590385437,
        0.05500015988945961,
        0.028428448364138603,
        -0.025779319927096367,
        0.01080631185323,
        0.011376078240573406,
        -0.06871654838323593,
        -0.006066029891371727,
        0.07695776969194412,
        -0.07961616665124893,
        0.05076785758137703,
        0.19573813676834106,
        0.022230656817555428,
        0.1445973962545395,
        -0.020597662776708603,
        -0.019529128447175026,
        0.02965005859732628,
        0.020170612260699272,
        0.038785845041275024,
        0.030013257637619972,
        6.776025513351748e-33,
        -0.03633818402886391,
        0.11731088906526566,
        -0.06902875006198883,
        -0.01391331572085619,
        -0.04961403086781502,
        0.052615877240896225,
        0.004050380550324917,
        0.05543189495801926,
        -0.09378758072853088,
        0.03501049801707268,
        -0.078129343688488,
        0.023888403549790382,
        -0.00812481064349413,
        0.02644762210547924,
        0.04116136208176613,
        -0.06070001423358917,
        0.01101326197385788,
        -0.05357171967625618,
        0.048337336629629135,
        0.04504070803523064,
        0.035691335797309875,
        -0.06033146381378174,
        0.036491911858320236,
        0.08129186183214188,
        0.06526748836040497,
        0.026265256106853485,
        0.06574665755033493,
        0.0021817036904394627,
        0.11004570126533508,
        0.05545395240187645,
        -0.050874315202236176,
        -0.033765342086553574,
        0.06737036257982254,
        -0.017819054424762726,
        -0.008322537876665592,
        0.013390778563916683,
        -0.02210216224193573,
        -0.11063609272241592,
        -0.0016477000899612904,
        -0.0558653324842453,
        -0.0028476763982325792,
        0.05554657429456711,
        -0.0341104157269001,
        -0.09687972813844681,
        0.06530187278985977,
        -0.056397102773189545,
        -0.012473110109567642,
        0.04466036707162857,
        -0.06991061568260193,
        0.042160019278526306,
        -0.05584382265806198,
        -0.01985606551170349,
        -0.046747878193855286,
        -0.03235092759132385,
        -0.08581352233886719,
        -0.018401380628347397,
        0.003777706064283848,
        -0.035312674939632416,
        0.11865875124931335,
        0.04741474241018295,
        -0.000592773430980742,
        0.02500426582992077,
        0.012801467441022396,
        -0.06605012714862823,
        -0.012632223777472973,
        -0.029695171862840652,
        0.012455698102712631,
        0.030799737200140953,
        -0.15733209252357483,
        0.050825465470552444,
        -0.01781601831316948,
        0.005575284361839294,
        0.07002206891775131,
        -0.0662241280078888,
        0.04732577130198479,
        0.037078842520713806,
        0.004925936460494995,
        -0.018017632886767387,
        -0.04795432090759277,
        0.01369883120059967,
        -0.04371567815542221,
        0.029956376180052757,
        0.05069386214017868,
        0.07592228800058365,
        0.05239301547408104,
        -0.061846304684877396,
        -0.04175082594156265,
        -0.030965134501457214,
        -0.10499312728643417,
        0.08161262422800064,
        0.042625926434993744,
        -0.029468392953276634,
        0.03229634463787079,
        0.0007085765246301889,
        -0.009076551534235477,
        -5.9282729465341305e-33,
        0.02561011351644993,
        0.04565813019871712,
        -0.02239643596112728,
        -0.02288934402167797,
        0.0611337386071682,
        -0.004392120521515608,
        0.03634830191731453,
        0.06179836764931679,
        0.04513799026608467,
        0.01901976391673088,
        0.03556200489401817,
        -0.016536608338356018,
        -0.05067070573568344,
        -0.02841559611260891,
        0.06455740332603455,
        -0.003393137827515602,
        -0.03666741028428078,
        -0.04154263809323311,
        0.0131599809974432,
        0.04551434889435768,
        0.050397589802742004,
        0.10081300139427185,
        -0.06922545284032822,
        0.041397012770175934,
        0.01608530804514885,
        0.0746198296546936,
        0.012107997201383114,
        0.06942456215620041,
        0.03178176283836365,
        -0.032373543828725815,
        -0.12106383591890335,
        -0.0405113510787487,
        -0.00034714461071416736,
        0.020391782745718956,
        -0.014563491567969322,
        0.02396133914589882,
        0.10697772353887558,
        -0.0181894451379776,
        -0.03463656082749367,
        -0.028236404061317444,
        0.04412354901432991,
        0.0063594914972782135,
        -0.0411406047642231,
        -0.03656286373734474,
        -0.010891936719417572,
        0.014117714948952198,
        -0.05702321231365204,
        0.005540166515856981,
        -0.0653519332408905,
        0.023071961477398872,
        -0.007787224370986223,
        0.030342280864715576,
        -0.09988366812467575,
        0.05023087561130524,
        -0.06324201822280884,
        -0.0037343965377658606,
        0.04313407838344574,
        0.031747784465551376,
        -0.040596041828393936,
        0.044107984751462936,
        0.0370892696082592,
        -0.030472496524453163,
        0.03987913951277733,
        0.012291268445551395,
        -0.03988959640264511,
        -0.04000004380941391,
        0.053364966064691544,
        0.08100099861621857,
        -0.04042031988501549,
        0.023251501843333244,
        0.03016483597457409,
        -0.016039900481700897,
        0.007235638797283173,
        -0.07621976733207703,
        0.025602586567401886,
        0.01885886862874031,
        -0.005216408055275679,
        -0.029099009931087494,
        -0.03448401018977165,
        -0.020250942558050156,
        0.030582299456000328,
        -0.04113086313009262,
        0.003369598649442196,
        0.01747005619108677,
        0.04796604812145233,
        -0.03004370629787445,
        0.04678069427609444,
        -0.006919386330991983,
        -0.07114730775356293,
        0.04211481660604477,
        -0.10334005206823349,
        -0.06338302791118622,
        -0.0236053504049778,
        0.08798252046108246,
        0.07549828290939331,
        -5.424745097570849e-08,
        -0.001186666777357459,
        0.08698608726263046,
        -0.025602104142308235,
        -0.07424499839544296,
        -0.002701581921428442,
        -0.07992035150527954,
        0.014709515497088432,
        0.03849704563617706,
        -0.015371197834610939,
        -0.08997756987810135,
        0.11941014230251312,
        -0.012378675863146782,
        0.007041896693408489,
        0.02297200635075569,
        -0.042285677045583725,
        0.09914813935756683,
        -0.08883266896009445,
        0.0031904985662549734,
        -0.014369959942996502,
        0.05981718748807907,
        -0.03675119951367378,
        0.005559795536100864,
        0.00676968926563859,
        -0.0485481396317482,
        -0.03569294139742851,
        0.012873232364654541,
        -0.05123596265912056,
        0.02342565357685089,
        0.06672069430351257,
        -0.045711949467659,
        -0.07870203256607056,
        0.005790974944829941,
        0.048560235649347305,
        0.026549160480499268,
        -0.09580113738775253,
        -0.06953953206539154,
        -0.10811471939086914,
        -0.04591509327292442,
        -0.0017479424132034183,
        0.07285373657941818,
        0.02198154665529728,
        -0.11422960460186005,
        -0.07793334126472473,
        -0.004965794738382101,
        -0.017411712557077408,
        -0.03309834375977516,
        0.04100351780653,
        -0.07710699737071991,
        -0.058537352830171585,
        -0.0012966551585122943,
        -0.055782441049814224,
        -0.00442549679428339,
        -0.06928928941488266,
        0.03487186133861542,
        0.03566956892609596,
        0.036053989082574844,
        0.046099159866571426,
        -0.11466827988624573,
        0.019788164645433426,
        0.04805746302008629,
        -0.04296845942735672,
        -0.0727807879447937,
        -0.03657795488834381,
        -0.0029472666792571545
    ]
}