{
    "id": "1OfxlSG6q5Y",
    "title": "The Antique Toaster that's Better than Yours",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2019-04-19T16:12:58Z",
    "video_url": "https://www.youtube.com/watch?v=1OfxlSG6q5Y",
    "category": "Science & Technology",
    "tags": [
        "toaster",
        "technology connections",
        "radiant control",
        "automatic",
        "sunbeam",
        "vintage",
        "antique",
        "pop-tart",
        "pastry",
        "bread toaster",
        "auto-drop",
        "self-lowering"
    ],
    "views": 2827389,
    "likes": 106073,
    "comments_count": 8745,
    "description": "You can support this channel on Patreon! Link below    That title isnt hyperbole or clickbait nonsense. This really is better than your toaster. At least, I think so. Seriously, can we make this the norm, please? If we figured it out in 1948, youd think we woulda kept going with it. I mean, really.  Looking for the previous video?   How about the second channel video where we improve and fix these?   Want to read those patents that were on the screen? Youre in luck! Theyre right here! Heres the patent for the toaster itself:  And heres the patent for the thermostat:   Also, heres a link to that fan-site I mentioned;   Do you want more of these videos to happen? Well then, you should know that you can support this channel on Patreon! Patrons of the channel have turned Technology Connections from sporadic hobby to well, my job! And its super cool! If youd like to join the fine folks you saw on-screen in pledging some support, please check out my Patreon page. Thanks for your consideration!   And thank you to the following Patrons!Yaniv, Tab Patterson, Francis Fisher, The War Academy, Conor Killeen, Paul Emmerich, Jason R Scheuren, Dave Anderson, Noah McCann, Eric Hansen, Dane Peterson, Steven First, Audin Malmin, Adam D. Ruppe, Rafa Wiosna, Matthew Giraitis, Kevin Landrigan, Harald E. Westlie, Carl Yazbek, Stephen Bell, Logan Kriete, Hunter Schwisow, Matt Falcon, Kieran Cox, Eric Wood, Paul Williams, Brent LaRowe, Lurker239, Felix Freiberger, James Ryan, Lukas Komischke, Steven Hidy, Robert Joscelyne, Jason Nevins, Jeffrey, BlancoGrande, Stephen Pick, Logan Beenken, Technicalleigh, John McLusky, Adam Coddington, Lolucoca, Steven Metcalf, Justin Talbot, Christopher Jett, Elijah Reeds, Mike Mason, Techmoan, Brendan Terrett, Kotanu, Christopher Luna, Paul Mills, Colton Aubrey Hooke, Brian G. Shacklett, Eduardo Kaftanski, Steve Stone, Chris Hartl, Gantradies, Andre N, Tony, Matthew Baron, Revenge, Andres Plaza, Charlie Hankin, Casey Kikendall, Sebi Jecklin, Warmo, The8TrackKid, Drew McClain, Michael Snowden, Ed Hall, Julian Rapoport, Christopher Bassett, Ryan Cozzubbo, Marcus Schwartz, Johan Schoeman, Matt Taylor, Patrick Musson, Lars JJ, Richard Lindsey, Kollin O'Dannel, PK, blouerat, Robert Toth, Joseph Hill, Marc Ethier, Giacomo Scaparrotti, Brady Brown, Stein Strindhaug, foophoof, Ernie Smith, Tim Juchcinski, Christopher Dickey, Denver Alexander, Jan Stavel, Mitchel J. Mullin II, Matthew Razza, Trix Farrar, Marco Anastasi, Pavlo Pravdiukov, Raymond LaRose, Howard Kraut, Mike Bailey, Yona, neko, Grayson Lang, Thomas Beaver, Jeffery Grajkowski, Christopher Splinter, Eric Merrill, Stefan Berndtsson, Michael Sims, Clint Eisinger, Christopher Leidich, Mike Friedman, Andr Waage Srensen, Sam Douglas, Sam Redfern, mark barratt, Tully, Duncan Ward, fussel, Corey A Hudson, EpicLPer, Luc Ritchie, Michael Dragone, Eric Romero, Ryan Hardy, Taylor Martin, Nicholas, thefanification, Ewen McNeill, Shane Zamora, John Bailey, Alex Ilyin, Andrew \"FastLizard4\" Adams, Avi Drissman, Phil Taprogge, Rich Jeanes, Jonathan Skowronek, Tim Grov, Pieter van der Eems, Brian Condron, Reto Jost, Torin Zaugg, Vince Terranova, Andrew Montagne, David Scott, Mike Nichols, Brandon Enright, James Fialho, Christian Torelli, toasterking, Jason Brady, Norman Tatlock, ce keen, Nick Pollard, David Grossman, Manalope, Andy S, Robert, Johan Greefkes, Jacob Dixon, Rob Kefford, Eric Butterfield, Tim Skloss, Benjamin A., James-Ross Harrison, Nathaniel, Colin Cogle, Aaron Rennow, Yota Ninja, Bee Jay, Countzero, Kodapan, Eli Krumholz, Guillaume Tremblay-Beaumont, Sha Nasti, Charles Surett, Laria, Stephen B Hinton, thegeoffreak, f. scott b., Piotr Kowalski, Elliot Clark, Bob Slovick, Jason Burgett, Jib Systems, Andrew Rosenwinkel, Grazer, Tero Janhunen, Bob B, Mike Noe, Scott Rowland",
    "description_links": [
        "https://youtu.be/zLFG068HtgM",
        "https://youtu.be/2vcdbtAca0Y",
        "https://patents.google.com/patent/US2667828",
        "https://patents.google.com/patent/US2459170A",
        "http://automaticbeyondbelief.org/",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "By the time this video is over, youre gonna to be mad at your toaster. This is a Sunbeam Radiant Control toaster. Its pretty old. One might say, quite old. This particular toaster was most likely made in the early 1960s, but its design goes back at least to 1948. But dont let its age fool you, in most respects, this chrome contraption is light years ahead of your toaster. Unless you have one of these in your kitchen, youve never known true toasting luxury. Let me show you what I mean. To use this modern, fancy pants toaster, you must first place your bread into the slots, then firmly press down on this lever. Then you must wait. Once the timer reaches zero, your toast is thrust upward with passionate fury, and you may now enjoy your toast. Now, to use this practically antique toaster, you begin by inserting your bread slices into the slots and then eu whaaaa? Did that... the bread. It just went down on its own. What madness is this? Oh, but this is an old fashioned toaster. It doesnt have that digital display to warn me [audible click] that the toast is gonna pop up. Wait, did it just shut off? *stares intensely as bread rises* (in a slow whisper) What is happening? Now, if youre like me, youre not just flabbergasted by this toasters effortless, silent, and fluid operation; youre also mad at how clunky and obnoxious this much, much newer toaster is. Lets go for another round of toast. Literally the only thing you have to do with this toaster, assuming youve set the darkness where you want it, is place the bread in the slots. It does the rest, and in style. This is how all toasters should work! Before we get too deep into this toaster, you might want to check out a video I quite recently made about the electromagnet in your toaster. There is a beautiful elegance to the way modern toasters operate, and it was in making that video that I was reminded of these 20th century marvels. Youll of course find a link to that video in the description, or you can click the card up above. Lets start with aesthetics. If you dont find this toaster to be downright beautiful, then frankly you dont deserve its operational perfection. The polished chrome is such a beautiful finish, and its been crafted into a timeless shape. The right hand toast slot is marked One Slice, as this slot contains both the actuator lever to start the toast cycle, as well as the thermostat. Bakelight handles on either side enable you to move the toaster when its hot, and the darkness control is hidden under the right hand handle. On the bottom youll find the crumb tray, as well as the various patents Sunbeam was most proud to be the holder of. Other than that, its just a pretty toaster. Really the only radically different thing about this is its lack of a lever. But of course, thats whats so neat. So lets take a closer look at the toasting action. Looking down into the slots reveals the fact that the right-hand side contains a lever that the bread falls on. This actuates the switch which starts the toast cycle. Once its started, the bread immediately descends into the toaster, and the heating elements begin to glow. Notice how the heating elements are different in the center vs. the sides. Both heating element styles are necessary for this toaster to function as intended, but well get back to that. Once the toast cycle is complete, you hear a click, the heating elements switch off, and the bread is slowly lifted back up. This toaster is clever in more ways than one. Not only is it Automatic Beyond Belief! its also using a very crafty thermostat design. Modern toasters operate based on a timer, either using a logic chip or a more rudimentary circuit. Older toasters, like this, use a bimetallic thermostat to end the toast cycle. But the way Sunbeam has used it here makes for a very consistent toasting experience. If I activate the toaster by pushing the lever down with a high-tech insulated poking device, youll see the bread lifters fall, and the heating elements glow. But the toaster barely runs before shutting off. Why is that? Well, the reason the heating elements are so different on the sides versus the middle, is to allow the thermostat to see the bread. The bimetallic strip lives right between these two heating coils, and its shielded from their heat output by these little wings. When its toasting, the bimetallic strip isnt warmed significantly by the heating elements; instead its warmed mainly by the heat radiating from the bread itself. This means that, effectively, it measures the surface temperature of the bread in order to determine how done it is. Thats where the toaster gets its name. Radiant control. By pointing the thermostat at the bread, its able to consistently trip at the same relative darkness, pretty much regardless of how hot the toaster itself is. Here, Ill let the patent speak for itself: The principle of operation of the control mechanism is based upon the fact that the surface of a bread slice emits a definite amount of radiant heat per unit area of surface when brought to a preselected temperature and on the fact that within the limits of permissible error a preselected temperature at the bread surface will always correspond to a certain brownness thereof. For example, it appears that with bread of normal composition practically no visible chemical change occurs in the surface of a slice subjected to temperatures below about 350 F. However, as the temperature approaches 500 degrees, chemical changes occur at an increasing rate. Time and the rate of heat input are also factors in the degree of chemical change produced, but the temperature factor has been found to be so critical under the conditions prevailing in an ordinary bread toaster as to make the other two factors of negligible importance. Thus when the bread surface, during the toasting operation, reaches a predetermined color, the heat emission therefrom will always be substantially the same, and this radiation or emission may be used for the purpose of actuating a control mechanism. The reason why the toaster barely ran when I started a toast cycle with the pen was that without bread in it, radiation from the center elements can travel straight into the thermostats eye. It is shielded at the start of a toast cycle by this little plate which falls as the bread does, but once its exposed to the heat coming from the middle elements, it will quickly trip and stop the toast cycle. OK, so we know why the side elements are made from two coils. So the thermostats eye can sit between them. But why, then, isnt the center element the same? Why is it made of this thin wire? Well, that wire, believe it or not, is what lowers the bread into the toaster. The entire mechanism is based around the thermal expansion properties of the nichrome wire heating element. To better understand this, we need to take this apart. And, through the magic of buying two of them, I have an already-taken-apart one right here! With the rather ugly innards exposed, one of the first things youll notice is this wild series of levers and linkages. These two arms form a third class lever, and connect to the bread lifters through a linkage on the right hand side. The fulcrum of the lever is at the extreme left. When the toaster is engaged, the arms swing downward and thus bring the bread into the toasting position. Its a little hard to see what makes them fall, but watch closely. The force in our third class lever is applied right here, and due to the nature of third class levers, the amount of motion imparted by the force is greatly multiplied, however the strength of the force is greatly reduced. This doesnt much matter, though, as were just lifting a couple slices of bread. The force on our third class lever is itself derived from the action of this first class lever, with the fulcrum here in the center, and the input force coming from right here. Now heres where things gets pretty clever. Mind blowingly clever, if I do say so myself. The input side of that lever is connected to this crossbar, which is connected via a set screw to the central core of the toaster. Its a little hard to see, and Id rather not remove it for fear of breaking the toaster, so heres the image from the patent application. The part we want to focus on is here. The nichrome wire is wrapped many times around two vertical structures, which are attached to each other via these flexible linkages at the top and bottom. The nichrome wire is wrapped quite tightly, so this entire thing is under tension. The squeezing force causes the two sides to be pulled closer together, which flexes the top and bottom pieces, and slightly increases the central cores overall vertical length. This is how the toaster sits in its resting state. When a piece of bread is inserted, the force of the bread falling on the trip lever flexes the bimetallic strip via this linkage, and engages the switch contacts. With power flowing through the heating wire, it rapidly heats up, which causes it to expand ever so slightly. Being a wire, the effect is that it becomes slightly longer, which in turn relaxes the squeezing force on the center core, and causes it to get just a little bit shorter. That shortening of the central core structure pulls up on the cross bar at the bottom of the toaster, which causes this lever to actuate, which in turn lowers this piece ever so slightly, and thanks to the multiplication of movement in our third class lever, causes the bread carriage to drop a dramatic amount. Once the thermostat trips and shuts power off to the toaster, the nichrome wire will begin to cool. As it does, it gets slightly shorter, which squeezes the sides of the core together, which pushes on the bottom, which pulls this side of the lever down, which pushes up on the third class lever, which pushes up on the bread carriage itself, causing it to return to the top. Isnt that just so neat? The design of this toaster used the physical properties of the heating element itself to provide the motive force that makes the toaster Automatic Beyond Belief! Even though the wire relaxes just a teeny, tiny bit, the resulting movement is harnessed, amplified, and directed so effectively, that it revolutionized the way toasters work. And its almost accidental perfectness just makes the whole thing more awesome! Because the nichrome wire has such a small thermal mass, it almost immediately relaxes when the bread is inserted, quickly dropping the bread into the toasting position. And when the power is switched off, it doesnt take long for it to cool and squeeze in again, pushing the toast back up. It just works. A component that needs to be in the toaster anyway turned out to be the perfect motor for automated bread lifting. While this toaster sure is a pleasure to use compared to any toaster you can buy in stores today, it does have some design weaknesses. Not many, though, and we can fix the worst of them. Lets talk about its circuitry, and youll see what needs to be addressed. Obviously the circuitry in here is very simple. In fact its almost unfair to call it circuitry. This leaf switch right here is the only component controlling the toaster. When the bread sensing lever is pushed down by, oh I dont know, bread, this little helper pushes on the bimetallic strip inside the toaster, and once it flexes, it allows these contacts to touch, completing the circuit. The switch latches in place, and what releases it is of course the action of the bimetallic strip. As it heats up, it deforms to an increasingly greater extent. Once its deformed enough, it snaps back into its original position and the two contacts are pushed apart with a click. The toaster is then shut off, and the bread is returned to the top. The darkness control simply moves a little peg that presses on the bimetallic strip. This increases or decreases the amount of deformation in the strip that is required before it snaps back and breaks the circuit, which in turn changes the temperature at which the contacts will open. Cleverly, the switch actuator cant engage the switch again until the toast is removed, thanks to this little swinging cup thing. Now if you know much at all about toasters and circuit design, you might guess the literally fatal flaw of this toaster. Unless equipped with a polarized plug, theres a fifty-fifty chance that all of the heating elements and indeed the metal bus bars connecting them inside the toaster are live at mains voltage even when the toaster is off. And, surprise surprise, this cord aint polarized! Now you know why you were taught to never stick a knife down a toaster. Frankly this cord is terrifying on its own given its age and puny plug so it should be replaced anyway, but if youre going to take that step, you might as well add a ground lead, too. This toaster is made entirely of metal, and given that there are wires going all around its insides, its probably wise to add a safety ground. In fact, heres a rather terrifying sight. A wire right next to the metal body, with paper insulation. Im sure that was among the only ways to make such a heat resistant insulation at the time, but if you needed more reason to give this a ground... there you are. Ill link to a video on my second channel where I replace the cord and walk you through the process, but for now, make sure the hot wire goes to the switch, and the neutral wire goes to lead snaking its way into body. Again, Ill cover this in more detail over there. The design weaknesses which we cant easily fix are in my opinion rather minor, depending of course on your tastes and priorities. Firstly, the toaster of course lacks a bagel mode. But that doesnt really matter, because there is no way youre gonna get a bagel in here anyway. Unlike modern toasters which have moveable bread guides, the bread guide in our Sunbeam is a simple arrangement of thin wires. They dont move, and theyre kind of close together, so even moderately thick slices of bread maybe arent going to fit. I can happily report, though, that frozen waffles, Pop Tarts, and Toaster Strudels all work just fine. Secondly, the toaster doesnt seem to do a great job toasting both sides of the bread with quite the same veracity. It has always come out darker on one side than the other. I dont really mind this, and its not like its horrendously uneven, but I figured Id point it out anyway. What it loses in consistency on the individual slice, however, is largely gained back by its surprisingly effective radiant control thermostat. And lastly, though I alluded to this before, this toaster lacks any sort of thermal barrier between its inner core and its outer surfaces. This thing gets hot. Quite hot. These handles are definitely required to move it if its been used recently. You might not want to use one of these if you have small children in the house, and whatever you do. Dont leave the bread loaf next to the toaster. You dont want to melt the plastic bag onto your beautiful chrome finish. One of the more remarkable things about this toaster design is how reliable and robust it was. Even though this toaster is 50 years old, at least, it is still functioning perfectly. The beautiful simplicity in its automated design means that short of the nichrome wire breaking in two, theres not a whole lot that can go wrong. Almost all of these toasters can be fixed with one small adjustment. In fact, [From right: Oh god, he has a *third* one] this toaster supposedly doesnt work, but well attempt to repair it on the second channel video. A link is down below. And now, lets talk about how silly it is that no one makes a toaster like this anymore. Hello, toaster manufacturers of the world. Hows it going? Have you seen one of these toasters? Like, ever? Because if you have, well Im just sorta curious why youve never tried to copy this design. No doubt you can make electromagnet toasters much more cheaply than you could make one of these, but I mean this is mostly just stamped sheet metal. Maybe the cost of these levers and bearings is far greater than I think it is, but I bet you could get people paying at least $60 for one of these, new. And you could add so many of the features that people want, these days, so easily! Bagel mode? Just run the center core. Wider bread? Adapt one of those squeezy things into this toaster. Im sure it could be done. You could make the design safer and up to modern standards, in fact you could improve on the design in so many ways that it sort of baffles me that you havent. I suppose weve all just gotten used to pressing a lever and waiting for the toast to pop. *terrified scream* But I mean, Im getting used to this now because this is just so much better. This really is how all toasters should work. Sunbeam continued to make these toasters in some form all the way until 1997. Why they were discontinued, Ill never know, but I imagine they were just much more expensive than the competition and people didnt really appreciate the design. But Id like to go back in time and make people appreciate it a little more, because in my opinion its a damn shame this design has been lost to time. I sincerely do believe that this is how all toasters should work. Before I go Id like to give a shoutout to Craig Rairdin who maintains the site automaticbeyondbelief.org. His fan-site, if you will, about these toasters is a neat little tribute, and it helped me get this exact toaster working more reliably. In the second channel video I discussed, Ill walk you through those steps, as well as replacing the power cord on one of these toasters. Its not super involved but there are some special steps to consider. As always, thank you to everyone who supports this channel on Patreon, especially the fine folks you see scrolling up your screen. Thanks to the support of people like you, Technology Connections has been able to grow in amazing ways, and I am extremely grateful for your support. If youd like to join these people in supporting the channel with a pledge of your own and get perks like early video access, behind the scenes footage, and the latest info on upcoming projects, please check out my Patreon page. Thank you for your consideration, and Ill see you next time! jazz thats Smooth Beyond Belief! Bakelight handles ena. Hmph. How many times we gonna record this line? Bakelight handles on either side enabley youll to mooove bleh bleugh blibbity eugh! Bakelight handles on either side enableuy to Ah! God! This line! OK, two things. I have to get two things. Keep recording, well come back. ...and this actuates the switch which start the *sigh* Already (clearing throat in an incredibly silly way making sounds like a car starting because Alec is silly) ...which squeezes the sides of the core together, which pulses-- pulses? Pushes. Dammit. It needs to be in the toaster anyway. Ahhhhh!!!! No, I skipped some words! *stares insanely intensely at the toaster* Whaaaaaaat?",
    "transcript_keywords": [
        "toaster",
        "bread",
        "toasters",
        "lever",
        "toast",
        "wire",
        "heating elements",
        "design",
        "heating",
        "toast cycle",
        "class lever",
        "bread toaster",
        "modern toasters",
        "elements",
        "side",
        "ordinary bread toaster",
        "nichrome wire",
        "make",
        "force",
        "switch"
    ],
    "transcript_entity_values": [
        "Firstly",
        "zero",
        "third",
        "at least to 1948",
        "Sunbeam Radiant Control",
        "Pop Tarts",
        "two",
        "Craig Rairdin",
        "Sunbeam",
        "Ill",
        "these 20th century",
        "Secondly",
        "Patreon",
        "today",
        "Toaster Strudels",
        "Time",
        "at least $60",
        "the early 1960s",
        "first",
        "one",
        "bleh bleugh blibbity eugh",
        "these days",
        "1997",
        "Technology Connections",
        "One",
        "Automatic",
        "about 350",
        "eu",
        "Smooth Beyond",
        "Bakelight",
        "500 degrees",
        "second",
        "50 years old",
        "light years",
        "Alec",
        "fifty-fifty"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.13478337228298187,
        -0.028865326195955276,
        0.026403870433568954,
        -0.07022090256214142,
        0.046408139169216156,
        0.015089801512658596,
        -0.013694319874048233,
        0.047638773918151855,
        -0.05503525212407112,
        -0.041245292872190475,
        -0.0043174815364181995,
        0.09905442595481873,
        0.0392913818359375,
        -0.020800957456231117,
        -0.042670898139476776,
        -0.03300316631793976,
        0.010457741096615791,
        -0.058496735990047455,
        -0.0669153556227684,
        0.0012200248893350363,
        0.029015393927693367,
        -0.015429767780005932,
        0.07174958288669586,
        0.0334140919148922,
        -0.05897819623351097,
        0.03271981701254845,
        0.013229124248027802,
        0.0062008630484342575,
        -0.05420868098735809,
        0.0004869279218837619,
        -0.024047976359725,
        0.060299791395664215,
        0.011890922673046589,
        -0.047823794186115265,
        0.030561476945877075,
        -0.07984594255685806,
        0.06388357281684875,
        0.019563905894756317,
        -0.01567903719842434,
        0.03855489566922188,
        0.036067552864551544,
        -0.18111953139305115,
        0.022211099043488503,
        -0.0034782355651259422,
        -0.054513584822416306,
        0.0729190781712532,
        0.071354940533638,
        -0.039002660661935806,
        -0.034275270998477936,
        -0.027059948071837425,
        -0.03458155691623688,
        -0.002600881038233638,
        0.06387394666671753,
        -0.06585357338190079,
        0.005359967239201069,
        0.022642267867922783,
        0.011559651233255863,
        -0.027351288124918938,
        0.007047396153211594,
        -0.05060945451259613,
        0.12943525612354279,
        -0.03878391906619072,
        -0.024170737713575363,
        0.012753168120980263,
        0.03794394060969353,
        -0.02897416427731514,
        -0.0008509789477102458,
        0.0175189059227705,
        0.04972505569458008,
        -0.06684329360723495,
        -0.005683069583028555,
        0.01409575343132019,
        0.019929936155676842,
        0.05743314325809479,
        -0.03648819774389267,
        -0.03050697036087513,
        0.06323657184839249,
        -0.03763777017593384,
        0.0005911810440011322,
        -0.1140071377158165,
        0.06985200941562653,
        -0.08904143422842026,
        -0.0231340192258358,
        -0.023881923407316208,
        -0.026177741587162018,
        0.003277324140071869,
        0.04641071334481239,
        0.02647566795349121,
        0.09093844145536423,
        -0.04934951290488243,
        -0.09568194299936295,
        -0.01968422718346119,
        0.03156797215342522,
        -0.011632101610302925,
        -0.030817504972219467,
        0.002331847557798028,
        -0.07554761320352554,
        -0.020442238077521324,
        -0.05571029707789421,
        0.048139385879039764,
        0.01569650135934353,
        -0.030558211728930473,
        -0.00407309178262949,
        -0.04515549913048744,
        -0.023393791168928146,
        0.0006522154435515404,
        -0.0991017073392868,
        0.10099771618843079,
        0.10989198833703995,
        -0.01653994247317314,
        -0.02361590787768364,
        0.06594455987215042,
        -0.01710684970021248,
        0.029142912477254868,
        0.030749227851629257,
        -0.054847024381160736,
        -0.033641982823610306,
        0.002707347273826599,
        0.07659226655960083,
        -0.04038365185260773,
        0.05870205536484718,
        0.02876260317862034,
        -0.010689196176826954,
        -0.012205272912979126,
        0.009588646702468395,
        -0.001740816398523748,
        -0.019701160490512848,
        -7.435195541847862e-34,
        -0.051958248019218445,
        0.16840201616287231,
        0.004834421910345554,
        0.0378713496029377,
        0.0528433732688427,
        0.011594682931900024,
        -0.005191766656935215,
        0.057525668293237686,
        -0.0650518536567688,
        -0.0034874400589615107,
        0.06190964952111244,
        0.001039522816427052,
        -0.011233986355364323,
        -0.011187405325472355,
        -0.0459538996219635,
        -0.060892634093761444,
        -0.041764095425605774,
        -0.07328042387962341,
        0.028372278437018394,
        -0.09900455921888351,
        0.004321586806327105,
        0.0046738614328205585,
        0.057716138660907745,
        -0.017044546082615852,
        0.01814310811460018,
        -0.07564327120780945,
        0.03563685342669487,
        -0.013173798099160194,
        0.05776111036539078,
        0.031132211908698082,
        0.05767063796520233,
        0.03277292102575302,
        -0.010959058068692684,
        -0.011005102656781673,
        0.03041064366698265,
        -0.06101798266172409,
        -0.031665824353694916,
        -0.12971900403499603,
        0.0026920209638774395,
        -0.028526248410344124,
        -0.013817857950925827,
        -0.0006047894130460918,
        -0.02552165277302265,
        0.07748626172542572,
        0.015399203635752201,
        0.06077797710895538,
        0.04695421829819679,
        0.05387677624821663,
        0.031307052820920944,
        0.02114563062787056,
        -0.018906734883785248,
        0.025720641016960144,
        -0.03301288187503815,
        -0.09728281944990158,
        0.009029612876474857,
        -0.051090020686388016,
        -0.01871960423886776,
        0.013449512422084808,
        0.056844066828489304,
        -0.042617231607437134,
        -0.006463722325861454,
        0.06287451088428497,
        -0.010156222619116306,
        -0.02865610457956791,
        -0.09925945103168488,
        0.08670981228351593,
        0.037485234439373016,
        0.021193550899624825,
        -0.04803694412112236,
        0.011415560729801655,
        0.012264019809663296,
        -0.024181624874472618,
        -0.03498879075050354,
        -0.08341185003519058,
        -0.0020759596955031157,
        0.03984591364860535,
        -0.045375850051641464,
        0.024139614775776863,
        0.004881856497377157,
        -0.04512915015220642,
        0.041313253343105316,
        -0.05380084738135338,
        0.028125537559390068,
        0.0003047283971682191,
        0.011144321411848068,
        -0.050075650215148926,
        0.017711110413074493,
        0.015507950447499752,
        0.04212407022714615,
        0.0688977763056755,
        -0.04258235916495323,
        -0.0019309637136757374,
        -0.009004590101540089,
        0.05553590878844261,
        0.0459013432264328,
        -2.0104817836739445e-33,
        -0.06194538623094559,
        0.0021798466332256794,
        0.006801617797464132,
        0.012006093747913837,
        0.009494463913142681,
        -0.08059392124414444,
        -0.06262362748384476,
        -0.048135366290807724,
        -0.0012295091291889548,
        -0.037629835307598114,
        0.0649544894695282,
        -0.0015922095626592636,
        -0.02189325913786888,
        -0.055296409875154495,
        -0.04845042899250984,
        0.026877187192440033,
        0.007052090484648943,
        -0.01709992252290249,
        -0.0006903767352923751,
        -0.05210178345441818,
        0.07402943074703217,
        0.050157006829977036,
        -0.11112062633037567,
        0.08055967837572098,
        -0.0583345927298069,
        0.039624638855457306,
        0.04458172619342804,
        0.06360561400651932,
        0.08748879283666611,
        -0.0023149524349719286,
        -0.036847230046987534,
        0.02036832831799984,
        -0.01636979728937149,
        0.015729663893580437,
        -0.026758162304759026,
        0.06355497986078262,
        0.12522871792316437,
        -0.03535312041640282,
        -0.10391765087842941,
        -0.17229048907756805,
        0.0009039232390932739,
        0.017640890553593636,
        -0.01734405755996704,
        -0.008341500535607338,
        -0.07352105528116226,
        -0.04278348758816719,
        -0.027565568685531616,
        -0.042170990258455276,
        -0.01170218177139759,
        0.03855166956782341,
        0.04146163910627365,
        -0.08009421825408936,
        0.10367348045110703,
        -0.040375158190727234,
        -0.03800813853740692,
        0.03072555921971798,
        0.036702390760183334,
        0.004584928974509239,
        0.08268184959888458,
        -0.02856414206326008,
        0.026790078729391098,
        -0.01276062149554491,
        -0.01804209128022194,
        0.00489290663972497,
        0.07132264226675034,
        -0.09621959924697876,
        0.09735724329948425,
        0.05779352784156799,
        -0.0004266991454642266,
        -0.02841610461473465,
        0.06264007091522217,
        0.009373940527439117,
        -0.009868385270237923,
        -0.0606197714805603,
        0.013355046510696411,
        0.06851131469011307,
        0.06173147261142731,
        -0.017588987946510315,
        -0.15917204320430756,
        0.014201084151864052,
        -0.02705579251050949,
        -0.01309114322066307,
        0.0842830017209053,
        -0.041458651423454285,
        0.105794757604599,
        0.007547694258391857,
        0.06558578461408615,
        0.03596379980444908,
        0.006728342268615961,
        0.059480275958776474,
        0.005617732182145119,
        0.04914892092347145,
        0.02637217938899994,
        0.04475087672472,
        0.05590754747390747,
        -5.4621981604441316e-08,
        0.02068520337343216,
        0.022872691974043846,
        -0.01815161295235157,
        -0.022081227973103523,
        0.029563114047050476,
        -0.08209215849637985,
        0.02659374475479126,
        -0.017047274857759476,
        -0.011089444160461426,
        -0.06126722693443298,
        -0.10636991262435913,
        0.05291448161005974,
        0.04896804690361023,
        0.11158192157745361,
        0.03077772632241249,
        -0.059674929827451706,
        -0.09423454105854034,
        0.016177615150809288,
        -0.04016440361738205,
        0.003901482792571187,
        0.0794922411441803,
        -0.016881311312317848,
        0.10628147423267365,
        -0.024368727579712868,
        -0.008399306796491146,
        0.08747796714305878,
        0.04159365966916084,
        -0.011933807283639908,
        0.015360239893198013,
        0.01769542507827282,
        -0.08364353328943253,
        -0.04888935759663582,
        -0.020528236404061317,
        -0.016246674582362175,
        0.03882385790348053,
        -0.02628347836434841,
        -0.03699510917067528,
        -0.004197411239147186,
        -0.03501104563474655,
        -0.03599541261792183,
        0.023108409717679024,
        -0.07159265130758286,
        -0.02270682342350483,
        0.10026298463344574,
        0.08961939066648483,
        -0.034103281795978546,
        -0.11679542809724808,
        -0.06615699827671051,
        0.012910295277833939,
        0.05326661095023155,
        0.013094840571284294,
        0.007613598369061947,
        0.0031144958920776844,
        -0.018564274534583092,
        -0.05085982009768486,
        0.011310105212032795,
        -0.002771156607195735,
        0.03097708523273468,
        -0.022506196051836014,
        0.0024038860574364662,
        0.0636252835392952,
        -0.011369648389518261,
        -0.09073430299758911,
        0.01799115724861622
    ]
}