{
    "id": "1PNBEqw_Fmk",
    "title": "The IMPOSSIBLE Gaming Challenge ft. @KevinKenson",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-08-26T16:49:36Z",
    "video_url": "https://www.youtube.com/watch?v=1PNBEqw_Fmk",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "Kevin kenson",
        "gaming",
        "video games",
        "retro gaming",
        "retro games",
        "street fighter",
        "contra",
        "banjo kazooie",
        "et game",
        "portal",
        "bioshock",
        "persona",
        "persona 4",
        "donkey kong",
        "ape escape",
        "starcraft",
        "nes",
        "snes",
        "nintendo",
        "n64",
        "pc",
        "playstation",
        "sony",
        "Microsoft",
        "xbox",
        "silent hill",
        "quiz",
        "trivia",
        "game show",
        "hadouken",
        "atari",
        "sega",
        "game sound fx",
        "sfx",
        "videogames"
    ],
    "views": 64471,
    "likes": 2946,
    "comments_count": 215,
    "description": "We dialed up the difficulty for this one... Can you TRUST Gameranx?! ft. Jake Baldino:  I Showed You My Tech Tip ft.  @Linus Tech Tips  The IMPOSSIBLE Apple Challenge ft.  @iJustine:  EXPOSING Dave2Ds Tech  Does MrMobile Know Phones?!   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/e15q1y6cxtw",
        "https://youtu.be/N_VoajKuBhs",
        "https://youtu.be/sd8UfamDJOg",
        "https://youtu.be/53RBwdzW6fs",
        "https://youtu.be/SPF8HXytAFs",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to This Is. My name is Austin. However, today I have been joined by the illustrious, the incredible, the interesting Kevin Kenson. Kevin, how is it going this fine morning? - It's going pretty good. You know, I'm looking forward to losing right now. I just wanna preface before any of this that, you know, ever since I agreed to even do this, Matt has told me every time I've seen him that, you know, Jake did way too well. So, he needs someone to fail and he's decided that person is me. So, you know, I'm here to rise to the challenge. - The rules are very simple. We're going to play you 10 sound effects from games. And we're going to ask you two questions. First of all, what game franchise and or game it's from, we'll explain that in a little bit, as well as what year it came out. Now, some of these, as you might imagine, have been shared through multiple games throughout. So sequels and whatnot were all the same. So for a few of them, we're going to accept the first year that that game came out in the franchise, right? So if it's like, say Super Mario, when did Super Mario first come out, because obviously the sound had been carried on for several years. Does that make sense? - Okay, yeah, that makes sense. - If you are able to get 50% of these correct, so the years, if you get all the years right, if you get all the names right, or some combination of those equaling 50%, you'll be a This Is winner and you will be entitled, to a tweet of literally whatever it is that you want on our Twitter handle. However as always, if you fail, then we're going to ask you to tweet out a very kind, please subscribe to This Is, and hopefully you're okay with that. I should've asked you that before we started. - I was gonna say, I don't remember signing any contract to this deal. - Oh, if you think this sudden, wait till you get to the bonus round. All right Kevin Kenson, are you ready, for, the This Is game show! - Let's do this! - Let's start out with question number one. (Street Fight II sound) - Oh, okay, I thought this was going to be like hard. Yeah, all right, yeah. Obviously like, Street Fighter II. No, I mean, this wasn't the year Street Fighter II, specifically where you it's like the main Hadouken line. Year though, I'm bad at years. It's '90s, it's 1990, 1993. - [Matt] He's not wrong! - But you're not right, and that's the important thing. This actually is from Street Fighter I not Street Fighter II, which was back in 1987. - Oh, did they reuse the exact same soundbite? Cause that's definitely the soundbite II uses. I didn't realize that. - [Matt] Alright, I'll give it to you! - Wait. - [Matt] I'll give it to him. - Matt, where you wrong? You wrong on question one? Ooh, I think Kevin Kenson just showed you up with his superior video game knowledge. Kevin Kenson full points. - I would bet my life on that being a Street Fighter II, or at least the one that was used in Street Fighter II. - Kevin, now that you have successfully challenged and successfully gotten your points, let's move on to question number two. (soft classic music) - Oh, I'm actually not sure. Like I know, I know those sounds. - Walk me through your thought process. So you immediately think that this is pretty old school, pretty classic, right? - Yeah, and it almost sounds like it's not direct captured from the game, but like someone playing, on arcade cabinet. Cause it sounds like you hear the stick being like moved around, or is that a clicking sound from within the game? - I think that that like click, click, click sound, I think is actually like the sound of the game itself. - I'm really not sure about this one. It definitely sounds classic like old, old, like, you know, '80's arcade era. Okay, my gut reaction was this and I felt like it was wrong, but because of the heavy drums you're clearly trying to drop right now, Dig Dug? - And what year did that particular video game come out? - I don't remember what year that is. Cause I'm poor at years? It's the eighties, 1983. - Kevin Kenson, I'm happy to say, this is a game from 1982, which means you get points there. However, is not Dig Dug. Is, the incredibly successful, honestly, one of the greatest games of all time, E.T. or the Atari 2600. - I forgot about E.T. I mean, I wanted to forget about E.T. So, I just succeeded there, but, that was not a good time for this. - So of course, if you're not familiar, E.T. is the, probably one of the worst, like mainstream games of all time and is widely credited for ultimately bringing down the video game industry as a whole back in the early eighties. It was bad. And they buried, like what, 10,000 or a hundred thousand. They buried a ton of extra unsold copies of E.T. in the desert. - Yeah, it's crazy. And part of what made the game awful too was, I mean, not just how rushed it was, but the fact that you couldn't tell what anything was on screen, like there were holes you would fall down, which is what that sound effect was. But then it was the exact same little like colorful bar to represent a door or like other things you can interact with. So you just had no idea what was going on. You just have to falling down holes and getting angry. It was awful. - Kevin, I'm very happy to report, that you were currently at three or four questions, correct. Which means that you were well over the 50% threshold. So, if you can keep this kind of pace up, you are absolutely on track to be a This Is winner. Let's move on to question number three. (upbeat music) - That was definitely Banjo's voice. I'm gonna be awful right now. Like, so Banjo-Kazooie, which started in 1997. - All right, so Banjo-Kazooie from 1997, is that your final answer? - 98, 98 is my final answer. - Kevin Kenson, on question number three, you are correct. This is Banjo-Kazooie, however is actually from 1995. - I thought it was later in the life cycle. - No, no, no, you're correct, it's 1998. I couldn't read my card. (laughs) - I was like, was the N64 out of the US by 1995. That doesn't sound right? - Yes, 1998 is dead on for Banjo-Kazooie. I think I should get a point. Cause Nintendo 64 was out 1995. - It was 96, or 97, 97. Cause it was every five years for a little while. - Something like that, yeah. Regardless, congratulations on being correct. We are currently, you're actually doing better than we are because we have the answers and we have messed up twice already, whereas you have not had the answers and have been pretty much dead on. So, let's just swiftly move on, to question number four. - [Desert Queen] Our forces, are under attack. - Okay, so that's StarCraft. Jeez, which was, I feel like I'm cheating a little bit here because Matt gave me specific instructions to watch Jake's video before this. And his first question was StarCraft, but I actually don't remember what year it was now that he said it. I wanna say it was, cause it was, it was a year that had like a lot of big hits. So it was like either it was in the late '90's. StarCraft 1990, was it 98 again? I might happen to lose like my RTS, like knowledge license. Am I like way off on this? - No, Kevin Kenson, you were dead on. So yes, 1988 was infamous for being like probably the best year for video games ever, besides like, well maybe 2007. So, of course that is Desert Queen letting you know that your forces are under attack. So, just a future note for anyone who's watching this, who might be on the business game show. I make Matt put StarCraft into every single quiz. So, just keep your StarCraft knowledge handy. Well, let's see how you fare with question number five. - [Donkey] Oh banana! - Oh, what was that? It sounds vaguely familiar to me, but I'm not sure if it's like really resonating. I really have no idea what that is. Based on like the quality of the sound effect, I'm gonna guess it was something like late '90s ish. Oh wait, I gotta, I gotta, I gotta Ken help right? I don't know if I'm blowing this too early. Yeah, I was actually really hoping I wasn't gonna have to resort to this. And I feel a little bad, it's this soon in the game. I have no idea what this is. Like it sounds really familiar, but it's just not clicking in my brain. - [Ken] It kinda sounds like Donkey Kong? - Okay, I guess I'll go with Donkey Kong 64 and we'll see if, if you're killing me or not. So, I'm gonna go with, the game is Donkey Kong 64, and for just going off of like the rare series, Donkey Kong games started with the SNES game Donkey Kong Country. I think that was 1992. - All right, Kevin Kenson, for question number five, you get 50% points. So this is in fact from Donkey Kong Country. However, the game came out in 1994, I've been given, an instruction from Matt that I am supposed to read word for word for this particular question. Original Donkey Kong was released in 1981, but Matt argues the Donkey Kong Country in 1994 was the spiritual reboot of the Donkey Kong franchise, with donkey being the permanent switch from antagonist protagonist, and the console and arcade games should be separated into different franchises. I will die on this hill, Matt. So that is my official statement from Matt and Sini. - But either way I'm wrong. So, I actually kind of agree with him, like it's the character Donkey Kong, but there's definitely as a kind of separate entity that starts with the later ones. But, I don't know, if that's, that's a lot of splitting hairs. Anyways, I'll take the 50% points. - You should because on question number five, you have eight points. So you were very close. You can actually tie this up. Technically, if you get this next question, 100% correct. So let's move on to question number six. (upbeat music) - Oh, I feel bad about how fast this one is gonna be. Like, I feel like we should bonce for more so there's time in the video. That is Contra, on the NES, 1989. - Well, Kevin Kenson prepare to hate yourself, because this is Contra from 1987. - Duh! Each time I go a little higher or lower. (laughs) - It's okay, it's okay. You obviously got that one incredibly quickly, but that means, that we, on the This Is side are still alive because you were still one point away from clenching. And don't forget, there is the bonus round, which if you able to go one more point, I will explain to you shortly. But let's move on quickly, to question number seven before you decide what the answer is already. (puzzle shot) - Oh, that's a short sound effect. Oh, what does it sound like? That sounds like either picking up like a power up, or using maybe like a jump pad kinda deal, or like picking up a healing item. My brain wants to go to this as some kind of FPS. I'm gonna hate myself and I don't know what this is. Why did I blow the Donkey Kong one earlier? I had like an inkling and I didn't trust myself. - You're very close to clenching. And even if you get within a year, of the actual year of the game, you still get points. So you gus should take a pretty wild guess and still be pretty safe here. - You know what, I'm just gonna say Halo, even though I'm pretty sure it's not right. And I'll throw out the year of 2000. Was that 2002? No, no, not two, years later. 2001, was the original Halo, right? I was recording marathon, which is very different. Go ahead and tell me how I'm wrong. - All right well, Kevin Kenson, I am sad to say that you are incorrect. This is, a game from 2007, and this is the Orange Portal from Portal. - Oh, I hate myself. - It's like one of those ones where like, now that you know it, you can't unhear it, but when you hear it, like, it's tough. I'm telling you, like people watch this game, and they think it's easy. But when you're in the hot seat is really difficult to like, understand like where you can even place it. - I was definitely more focused on like actual, full blown, you know, running gun type stuff. I wasn't thinking about a puzzle shooter. - Well, lucky for you, Kevin, you were still absolutely in the game. So let's move on to question number eight. (Big Daddy roaring) - Yeah, that's either like a really big monster bellowing or it's a war horn. It sounds like a, like a much later game. Something that's more recent for sure. My, gut wants to say God of War with the giant serpent in the distance, like when it's kind of alluding to that thing being around. Yeah, okay. I'm gonna go with the giant snake and God of War. The most recent one and God of war started in, Oh jeez, what year was God of War on PS2? 2000, 2004, for the original God of War. - Cuff, for question number eight, you have come a very long way in this game. And here, you are going to continue because that is incorrect. This is from a little game, 2007, called BioShock. Specifically, this is the sound of the Big Daddy. - Yeah, you're right, you're right. Oh no, I'm losing my gamer card after this video. (laughs) - Dude, I'm telling you, man, these later ones are really tough, cause it sounds like it could be a bunch of different things, especially, cause I feel like specifically in BioShock. I feel like usually the, the Big Daddy, you can never really actually hear it super clear. Like there's always like other on-balance, like you don't really actually just hear that roar sound by it. - Oh man, guys. I don't know if we can go live with this video. (laughs) - It seems like you're in tough straits. However, keep in mind you have two questions. If you can get half of either of these questions, right? You will catch the victory. So you are still 1000% in this game. Are you ready to go onto question number? - No, I'm not. I'd like to stall forever please, filibuster. - Okay, question number nine. (upbeat music) This gives me, another kind of arcade vibe later, obviously than, than the, the E.T. one, even though he wasn't arcade game, I don't think this is what it is, but it reminds me of turtles and time, which is I think why my brains attaching to that. It's like that, you know, there's music going on. There's like a line. There's a sound effect after like picking something up. Can at least guess a year for the sake of getting something. - You can absolutely guess whatever you like. - 1996. - Okay, well fair enough. Well, I'm sad to say in question number nine, I can't give you points because you did not escape to the correct Ape Escape from 1999. - So, I growing up, actually didn't own a PS1. And so I missed a lot of those games. Yeah, no, I went straight into PS2, and the majority of what I replayed from PS1, was RPGs. Cause that's really like the main genre I play a lot. That was just one of those franchises I totally missed out on. I mean, like I said earlier, I didn't even play Crush growing up. I played the Trilogy later when it got released. - I know that this is specifically Matt's favorite game, but I'm right there with you. I never played Ape Escape either. And yeah, I'm telling you these later, these later sound effects are really difficult, but you're still in the game. Get a little bit dicey now, but we're going on to the final question, which you're gonna need to get at least half of correct if you wanna win. So let's move on to potentially our very final question. Question number ten. (sound effect) - It's either interference or it's like a scanner or something. It's definitely the kind of sound effect you get whenever you're like either, analyzing something or there's some kind of interruption on what you're watching. So there were bones earlier where I was like, oh, I know this general vibe, but I don't know. Like I don't remember that's hearing this specific sound. This is one where I'm like, I know I've heard this. Like I know it like in the back of my brain, but I don't think I'm gonna be able to find like the filing cabinet it's in. Like it is somewhere lost in all the other files. I think I'm actually like, not even going to guess on this one because I really have no, like I know I've heard the sound, but I just have no clue what it's from. - You just gonna completely pass. You're not going to take any guests whatsoever. - Well, no, no, no, I'm going, I'm going to, I'm going to try a year for the hell of it, but I don't, I can't, I can't think of like what specific game. I don't know, 2002. - Kevin Ballsy Kenson, we've gone 10 long rounds. In this This Is. We've come down literally to the wire. You started out with a commanding lead, of the This Is game show, which has been slowly whittled away by some of the more difficult questions we've ever asked. When it comes down to question number 10, this is the Radio Static Danger from Silent Hill, which was released in 1999. I'm sorry, my friend, you have lost the This Is game. However. - My first instinct was fricking silent Hill and I didn't listen to it. I didn't listen. I don't know why I did not listen to that instinct. I was like, no, like I don't like that. That's just a specific, ah. - Don't be alarmed, because now you have absolutely nothing to lose by going for ultimate double or nothing. - I don't have everything to lose because I have to do a 30 second shout out if I lose it. - Matt's trying to soften your prize, but no, I will not allow it. So now, you get to go on to the bonus round. Typically this is optional because if you had, won the tweet, you could just walk away. However, because you have nothing to lose, there's no reason not to go for it. So the rules here are very simple. We're going to show you one last question or rather let you listen to one last question. You're going to need to get it exactly right on the year and exactly right on the game. However, if you do so, you will be able to walk away with a 30 second ad spot in the future This Is episode. You can give up and leave right now, but at least you got a shot of winning, and you can redeem yourself with what I will say is a quite difficult one. (Persona music) - For some reason my brain almost wants to say soul caliber for that one. I think that's quite right. So Matt specifically told me he wasn't going to do persona, but my brain keeps going back to this might be persona because it reminds me of when you ambushed an enemy. - Wait, hold a second, Matt specifically told you again, that was not going to be included. That seems like it's against the rules. Matt, is this true? Is this true? - [Matt] I didn't say anything! - Matt denies it. That says that there's no such rule in this. - He said, no, I'm not gonna use that. - Matt's being pretty firm that he has no such rule in place. So, I don't know if I believe that one. - It sounds like persona. The problem here is whether it's, it sounds like one of the earlier ones, it doesn't sound like five to me. It sounds like three or four. Yeah, 'cause this sounds like the sound effect, when you like sneak up on an enemy and then initiate combat, and then it does the like, like the first sound effect is like the hitting them. And then the next one is the whatever transition sound effect in the combat. I'm gonna say Persona 5, which came out in 2017. - I'm getting a hard no from the judges. So, this is in fact from Persona 4. - Four dammit! - I'm sorry, my friend, that one, that one came down to the wires. So yes, this is, you are dead on though. It is the, the summoning Persona noise by now. - Yep, yeah. Cause five, they have the mass thing taken off. - So, I'm sorry to say my friend, you are not, A This Is winner today. However, I would like to extend an open invitation to come back to the game show at any point in which I'm sure we will inevitably make it even more difficult piece of work. - And we do that one, where I win, and we don't upload this one, right? - Exactly, yeah. So at this point, we're going to cut the video and then this is gonna go into the archives, the vault, some might say, and we'll come right back in two months and you'd be like, hey, what are the rules to this brand new wacky game you guys have? Woo. - Oh man. - All right, Kevin, thank you very much for being an excellent sport. Thank you very much for being onto This Is game show. Where can people find your wonderful, bearded face? - It's Kevin Kenson. I don't know if anyone's gonna wanna click through at this point after seeing me just completely fail on the second half of this game, squandering my lead. But yeah, if you want to check stuff out, there you go. - No, no, no, no. You need to, if you're watching this video, you absolutely need to go subscribe to Kevin Kenson, for some of the most high quality video game content retrospectives, all kinds of excellent content around the world of video games, on the entire internet. I am saying that not only as Kevin's friend, but as someone who has been watching his videos from day one. You should absolutely be sure to go subscribe, and, thank you very much for watching. Make sure to subscribe not only to Kevin, but also here to This Is for many more wonderful game shows. And if you've missed any, including some of the wonderful ones right beside me, you can go watch those right now. Anyway, thank you very much for watching, and stay tuned, for, Kevin Kenson two, the Kevinning. (upbeat music)",
    "transcript_keywords": [
        "Kevin Kenson",
        "Donkey Kong",
        "game",
        "question number",
        "Kevin",
        "question",
        "Donkey Kong Country",
        "sound",
        "Street Fighter",
        "Kenson",
        "Matt",
        "sounds",
        "Donkey Kong games",
        "game Donkey Kong",
        "Donkey",
        "year",
        "sound effect",
        "number",
        "Kong",
        "yeah"
    ],
    "transcript_entity_values": [
        "Sini",
        "BioShock",
        "1989",
        "Halo",
        "two months",
        "30 second",
        "three",
        "Donkey Kong Country",
        "the Donkey Kong Country",
        "Kevin Ballsy Kenson",
        "Contra",
        "Hadouken",
        "every five years",
        "the 50%",
        "E.T.",
        "Super Mario",
        "1000%",
        "50%",
        "Halo",
        "Donkey Kong",
        "SNES",
        "the early eighties",
        "80",
        "NES",
        "1994",
        "Twitter",
        "2000",
        "1988",
        "Jake",
        "2017",
        "Donkey Kong",
        "Nintendo",
        "Matt",
        "number eight",
        "II",
        "1982",
        "96",
        "1981",
        "'90s",
        "the Atari 2600",
        "Desert Queen",
        "Street Fighter II",
        "first",
        "1995",
        "StarCraft",
        "2004",
        "Hill",
        "1992",
        "a ton",
        "10",
        "Year",
        "1987",
        "Donkey Kong",
        "Donkey Kong Country",
        "nine",
        "US",
        "1999",
        "N64",
        "Kevin Kenson",
        "Banjo-Kazooie",
        "1993",
        "10,000",
        "98",
        "100%",
        "Kevinning",
        "Donkey Kong 64",
        "the best year",
        "64",
        "Crush",
        "StarCraft",
        "a hundred thousand",
        "gus",
        "second",
        "five",
        "the eighties, 1983",
        "at least half",
        "Kevin",
        "the year",
        "First",
        "ten",
        "1998",
        "the year of 2000",
        "one",
        "four",
        "2002",
        "Portal",
        "today",
        "4. - Four",
        "number nine",
        "eight",
        "the Orange Portal",
        "six",
        "Austin",
        "years",
        "several years",
        "a year",
        "Banjo",
        "98",
        "half",
        "two",
        "the first year",
        "the second half",
        "97",
        "1997",
        "two, years later.",
        "Ken",
        "2007",
        "Silent Hill",
        "1990",
        "seven"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "TIME",
        "CARDINAL",
        "LOC",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "PERCENT",
        "PRODUCT",
        "PERSON",
        "PERCENT",
        "PERCENT",
        "ORG",
        "LOC",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "LOC",
        "FAC",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "DATE",
        "PERSON",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "GPE",
        "FAC",
        "CARDINAL",
        "GPE",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "NORP",
        "GPE",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "LOC",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.140373095870018,
        0.01815420389175415,
        0.08926188945770264,
        -0.13979792594909668,
        0.01891409046947956,
        0.005735386628657579,
        0.12091811001300812,
        -0.01343400590121746,
        -0.011268669739365578,
        0.026098022237420082,
        -0.025696957483887672,
        -0.10189270973205566,
        0.03414103016257286,
        0.0006997047457844019,
        0.019523167982697487,
        -0.021748481318354607,
        0.041341632604599,
        -0.023144342005252838,
        -0.053006839007139206,
        0.06452126055955887,
        0.0536213144659996,
        0.01669570431113243,
        0.003839504672214389,
        -0.0579477995634079,
        -0.012452288530766964,
        0.07739206403493881,
        -0.011102629825472832,
        0.03144233673810959,
        -0.01856355555355549,
        -0.04904778674244881,
        -0.006791885010898113,
        -0.014319999143481255,
        -0.015353226102888584,
        -0.01646796241402626,
        0.03201008588075638,
        -0.04513847455382347,
        -0.060133788734674454,
        -0.04409048333764076,
        -0.05778047442436218,
        -0.027201121672987938,
        -0.02276744320988655,
        -0.003852162742987275,
        0.0030463896691799164,
        0.030324356630444527,
        -0.014476330019533634,
        0.006457298994064331,
        -0.0006049252697266638,
        -0.05080004036426544,
        0.04411628097295761,
        -0.039126552641391754,
        -0.06326747685670853,
        -0.0733352079987526,
        0.13706344366073608,
        -0.01295579131692648,
        0.027493072673678398,
        0.0873003676533699,
        0.0019165967823937535,
        0.05163700878620148,
        0.09579221159219742,
        -0.033731311559677124,
        0.07708694785833359,
        -0.08767358958721161,
        -0.03410378471016884,
        0.0807582214474678,
        -0.013577205128967762,
        -0.00889900978654623,
        -0.06325597316026688,
        -0.028099823743104935,
        -0.006371371913701296,
        0.10183069109916687,
        0.00592670077458024,
        0.014705995097756386,
        0.01311442069709301,
        0.04469062760472298,
        0.1049342006444931,
        0.025828447192907333,
        -0.03491491451859474,
        -0.05753307044506073,
        0.005953372456133366,
        0.04432796314358711,
        0.05098632350564003,
        -0.1141306683421135,
        -0.04961562901735306,
        0.0008786511025391519,
        -0.021184004843235016,
        -0.03974132984876633,
        0.025170793756842613,
        0.0013955124886706471,
        0.009115644730627537,
        0.01879049465060234,
        -0.08944392949342728,
        0.05841897800564766,
        0.07013210654258728,
        0.027158435434103012,
        0.045887406915426254,
        0.02486788108944893,
        0.013072602450847626,
        -0.018006471917033195,
        -0.13073068857192993,
        0.07152000069618225,
        0.043970704078674316,
        0.07510531693696976,
        0.0141151649877429,
        0.006619424559175968,
        0.07009010761976242,
        -0.02573583461344242,
        -0.06893090158700943,
        -0.01027524471282959,
        0.0531761534512043,
        0.0014629813376814127,
        0.019312681630253792,
        -0.03751116245985031,
        -0.00427106861025095,
        0.02495836652815342,
        0.009081265889108181,
        0.057638999074697495,
        -0.008350826799869537,
        0.04508732259273529,
        0.013187956996262074,
        -0.018218768760561943,
        0.01447291299700737,
        -0.012293938547372818,
        0.012354987673461437,
        0.05603766813874245,
        0.0720871239900589,
        0.026290947571396828,
        0.0035846992395818233,
        8.204682409090785e-34,
        0.07534946501255035,
        0.0762949213385582,
        0.00496481591835618,
        0.03043983317911625,
        0.024881713092327118,
        -0.0748881995677948,
        -0.06300721317529678,
        -0.021055754274129868,
        -0.11488031595945358,
        -0.02506088837981224,
        -0.08330687880516052,
        0.03565506637096405,
        -0.0021574487909674644,
        0.02273731864988804,
        0.06669697165489197,
        -0.021566446870565414,
        -0.012480603531002998,
        -0.09203345328569412,
        0.005794001743197441,
        -0.00918328482657671,
        0.11447148025035858,
        -0.06998297572135925,
        0.03534045070409775,
        -0.06824634224176407,
        -0.020725993439555168,
        -0.0026677052956074476,
        0.005250944755971432,
        -0.04412933066487312,
        0.10243532806634903,
        0.025200823321938515,
        -0.14628320932388306,
        -0.020615531131625175,
        -0.016155630350112915,
        0.009783782996237278,
        0.018665149807929993,
        -0.016400882974267006,
        0.059779953211545944,
        -0.05301088094711304,
        -0.011478389613330364,
        0.022064853459596634,
        -0.09794380515813828,
        0.0240005049854517,
        -0.05081117898225784,
        -0.04679974541068077,
        -0.09973523020744324,
        -0.015502753667533398,
        0.04007991403341293,
        -0.041901785880327225,
        -0.012362812645733356,
        0.02231459692120552,
        -0.05572204291820526,
        0.006675681099295616,
        0.04170526564121246,
        -0.07903193682432175,
        0.0014549741754308343,
        -0.04246252775192261,
        -0.00991388875991106,
        0.00849311612546444,
        -0.003553577233105898,
        0.04782378673553467,
        0.0747494325041771,
        -0.00885498896241188,
        -0.010926440358161926,
        0.08277864009141922,
        -0.07887351512908936,
        -0.04903609678149223,
        0.007875744253396988,
        -0.014792503789067268,
        0.010363008826971054,
        -0.010474483482539654,
        -0.059563908725976944,
        0.024902792647480965,
        0.011516873724758625,
        -0.08253506571054459,
        0.0875392034649849,
        0.00840491522103548,
        -0.050675731152296066,
        0.019155457615852356,
        -0.060023948550224304,
        -0.012755410745739937,
        0.01899106241762638,
        -0.026627594605088234,
        -0.11494717746973038,
        -0.003677313681691885,
        -0.06887213885784149,
        -0.061995502561330795,
        0.0047619519755244255,
        -0.08906648308038712,
        -0.03813769668340683,
        0.07983165979385376,
        -0.09673550724983215,
        -0.02578873559832573,
        0.004191287327557802,
        0.06544676423072815,
        0.004826721269637346,
        -3.487780635650008e-33,
        0.023450255393981934,
        -0.01548858918249607,
        -0.014098446816205978,
        0.01126914843916893,
        0.10174686461687088,
        -0.04838902875781059,
        0.039883803576231,
        0.05512942746281624,
        0.07432740926742554,
        -0.06932371109724045,
        -0.02801457978785038,
        0.059256475418806076,
        -0.010614590719342232,
        -0.040253084152936935,
        -0.03097064420580864,
        -0.08791131526231766,
        -0.10049821436405182,
        0.03660740703344345,
        -0.02044391632080078,
        -0.004278256557881832,
        0.08110310882329941,
        -0.020841268822550774,
        -0.10320869088172913,
        -0.017711786553263664,
        0.013141968287527561,
        0.03622099757194519,
        0.046040236949920654,
        0.06310487538576126,
        -0.031574759632349014,
        -0.04165201261639595,
        -0.002354735042899847,
        -0.0037414110265672207,
        -0.057130154222249985,
        0.028544407337903976,
        0.05236774682998657,
        0.09964107722043991,
        0.0017575396923348308,
        0.03819962963461876,
        -0.033441975712776184,
        -0.0025707960594445467,
        0.06388615816831589,
        0.0387771911919117,
        -0.06544458121061325,
        -0.07572449743747711,
        0.051317665725946426,
        0.012619642540812492,
        0.06852247565984726,
        -0.029369020834565163,
        -0.0688243955373764,
        -0.019083373248577118,
        0.0740261897444725,
        -0.03580206632614136,
        -0.02053491212427616,
        0.02245161682367325,
        -0.04982511326670647,
        0.021474748849868774,
        0.0435013510286808,
        0.04001792147755623,
        0.06853333860635757,
        0.02831428125500679,
        -0.015194413252174854,
        -0.02098684199154377,
        0.0044683911837637424,
        0.08657746762037277,
        0.0038881420623511076,
        0.020278118550777435,
        -0.017035627737641335,
        0.060328688472509384,
        0.01831507496535778,
        0.0055287908762693405,
        -0.05384038761258125,
        0.0200779028236866,
        -0.03324836120009422,
        -0.061980847269296646,
        0.09667595475912094,
        0.050398532301187515,
        -0.08859319239854813,
        0.011753185652196407,
        0.004982765763998032,
        -0.11754404753446579,
        0.05893990769982338,
        0.015670249238610268,
        0.00029982038540765643,
        0.037465352565050125,
        0.10282329469919205,
        0.11611633747816086,
        0.07693666964769363,
        0.04720410704612732,
        -0.039316337555646896,
        0.02271297387778759,
        0.018549777567386627,
        0.0012049311771988869,
        0.04314876347780228,
        0.044873181730508804,
        -0.015681490302085876,
        -6.315283229696433e-08,
        -0.03952788561582565,
        0.019195130094885826,
        -0.11776135861873627,
        -0.02024022489786148,
        0.07083280384540558,
        0.08221016079187393,
        0.014778084121644497,
        -0.05391015484929085,
        0.015173564665019512,
        -0.017959093675017357,
        0.08331464231014252,
        0.0209516454488039,
        0.006202254444360733,
        0.04420234262943268,
        0.013253649696707726,
        0.10466566681861877,
        -0.09533041715621948,
        0.0026110250037163496,
        -0.04304392263293266,
        -0.004617004655301571,
        -0.07766623049974442,
        0.007198917679488659,
        -0.03791800141334534,
        0.002537349471822381,
        0.004935864824801683,
        0.00607094494625926,
        0.001272692927159369,
        0.07374252378940582,
        -0.006997732911258936,
        0.04502719268202782,
        -0.07869980484247208,
        -0.03089159168303013,
        -0.07604796439409256,
        0.0023785538505762815,
        -0.03944404423236847,
        -0.03663169965147972,
        -0.018917974084615707,
        0.017239045351743698,
        0.029460012912750244,
        -0.023224711418151855,
        -0.06068187952041626,
        0.0018643987132236362,
        0.0034804244060069323,
        -0.01204846240580082,
        -0.05490407347679138,
        0.01303810440003872,
        -0.010457048192620277,
        -0.042923085391521454,
        -0.014511588029563427,
        -0.08115126937627792,
        -0.046466343104839325,
        -0.08698020875453949,
        -0.03521636873483658,
        0.026134097948670387,
        0.05601631850004196,
        -0.022275015711784363,
        -0.019552232697606087,
        -0.014543253928422928,
        -0.07052215188741684,
        0.00918154139071703,
        0.08112987875938416,
        0.039812859147787094,
        -0.0510530024766922,
        0.033061813563108444
    ]
}