{
    "id": "1Q1RA-Xl9hU",
    "title": "OnePlus 6T First Look: Android's Coolest Value Comes To America",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-10-29T16:02:36Z",
    "video_url": "https://www.youtube.com/watch?v=1Q1RA-Xl9hU",
    "category": "Science & Technology",
    "tags": [
        "oneplus 6t review",
        "oneplus 6t hands on",
        "oneplus 6t impressions",
        "oneplus 6t vs oneplus 6",
        "best android 2018",
        "oneplus",
        "mrmobile",
        "michael fisher",
        "android central"
    ],
    "views": 528074,
    "likes": 13672,
    "comments_count": 1533,
    "description": "Sponsored by dbrand. Get your OnePlus 6T skins here:     [ONEPLUS 6T REVIEW PART 1]  \"This is a new smartphone. It does most of the things this other phone does. And it costs much less.\" For five years, this has been the story of OnePlus  but the OnePlus 6T is different. Because it's the first OnePlus to be sold by a US carrier, making it available to a whole swath of new consumers who otherwise wouldn't know the brand exists. And it's the first OnePlus to be whitelisted by Verizon Wireless for use on its LTE network.   It's also, infamously, the first OnePlus to ditch the headphone jack and if you think that means the company will take a break from its habit of inching up the price by a few bucks every generation, think again. Does the resulting bit of compromise fall to the threshold of \"settling,\" or is the $200 discount from comparably equipped phones enough to preserve OnePlus's old reputation as a \"flagship killer?\" Find out in part 1 of the OnePlus 6T Review!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S ONEPLUS 6T REVIEW PART 1]  MrMobile's OnePlus 6T Review Part 1 was produced following five days with a OnePlus 6T review device provided by OnePlus. Preproduction unit running prerelease software. Some conclusions subject to change pending additional time with final software.  OnePlus provided travel and lodging accommodation for some media attending the OnePlus 6T launch event in New York City, including MrMobile. No compensation for coverage was requested or provided.   Additional footage courtesy Android Central. See Android Central's complete OnePlus 6T coverage here:   Additional footage courtesy Rene Ritchie / Vector. See Rene's iPhone Xr Review here:    [MUSIC]  Much More by Eternity Bro, available at Premium Beat:   Sun Shine by Cymatix, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #oneplus6t #oneplus #oneplus6 #smartphones #android",
    "description_links": [
        "http://dbrand.com/mrmobile-6T",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.androidcentral.com/oneplus-6t",
        "https://www.youtube.com/watch?v=JgtwN52uvzo",
        "https://www.premiumbeat.com/royalty-free-tracks/much-more",
        "https://www.premiumbeat.com/royalty-free-tracks/sun-shine",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "(upbeat music) - [MrMobile] This is a new smartphone. It does most of the things this smartphone does, and it costs over $200 less. For five years, this has been the story of OnePlus, but this time if you live in the U.S., you actually have a reason to care. I'm MrMobile, and I've spent five days with the OnePlus 6T. (upbeat electro music) Let's change it up, shall we? I'm gonna start with the worst part of this phone. The OnePlus 6T ditches the headphone jack, and for the record the company deserves every bit of the bashing that it's getting for that decision. Not that I care. The dongle in the box is fine, and I'm a Bluetooth guy anyway, but when you spend two years putting the screws to other companies for making this same move, you better be ready for the wrath when you take a turn down hypocrisy road. I asked OnePlus why they ditched the jack, and a company representative told me this. They wanted to move the fingerprint sensor back up to the front of the phone for some reason, but they knew people didn't want a big chin on the bottom. So they dumped the jack, moved the vibration motor, popped in a 12% larger battery, that part's nice, and built in an optical fingerprint sensor beneath the display. Is it worth it? Eh. Sometimes. See the sensor usually works well. I've programmed three fingers to it and some of them log me in smoothly, while others take a few tries. I do like it, on the whole. You can change this animation by the way, If the lightening storm isn't to your liking. Or just ditch the fingers and the security all together, and go for the face unlock. OnePlus does warn that using after-market screen protectors may interfere with the sensor, so the phone comes with a protector pre-installed over the Gorilla Glass 6 cover glass. It gets smudgy in a hurry, but it's still nice to have. Let's move on. The immediate predecessor to this phone was one of the best reviewed of the year, the OnePlus 6. So it's no surprise the company carried over a few things. All three cameras have identical hardware, with some minor tweaks to help with noise reduction, portrait shots, and a new low-light mode. Also, the display notch has been shaved down to just a tear drop. It's just barely big enough to accommodate the selfie shooter. You can hide it, but as notches go, I actually think it looks kind of pretty. And the mute switch is still here to make silencing your ringer much simpler than on any other Android. Sharp-eyed folks with notice that these volume call outs look a lot like those on the newest version of Android, and that's because the custom software here is based on it. It doesn't stop with Android Pie either, remember the confusing gestures I called out in my Pixel 3 review? Well OnePlus offers its own in their place. Yes, they're better. I still prefer the buttons though, so I'm happy that option is here too, and there's also a funky hybrid mode that kind of walks a middle ground. Along with the various things that come in the box, case, charger, the aforementioned dongle, there's a letter from the company's CEO, who encourages you to look at the phone with curious eyes. Well, that's good advice. You'll find tiny customizations buried everywhere. Some new, and some familiar. For example, you can now set your accent color to whatever hex code you like. Go ahead, be bold. The display can be tuned to an even wider variety of color calibrations, or shifted to black and white for reading mode. Those nav keys, if you keep them around, can be set to do things like spring the notification shade on a double-tap. And if you double-tap on the wallpaper instead, you can now put the phone to sleep, or wake it up. OxygenOS is really good about these little tweaks, and with the help of the usual prodigious spec sheet, the phone builds them in without slowing itself down. For all the sacrifices it's made over the years, OnePlus has kept this focus. Delivering flagship performance, at affordable prices. Let's talk about those prices, shall we? Each year, OnePlus has asked a little more for its phones and each year, I've gotten increasingly annoyed with that price creep. But in 2018, the market has done OnePlus a favor, as Smartphone prices are up across the board. The Pixel 3 at $799. The Razer Phone 2 at the same price. The iPhone 10R at $750. Compared to those, the OnePlus 6T is a bargain at a starting price of $549. Better yet, for my fellow Americans, T-Mobile will carry the OnePlus 6T in brick and mortar stores. The first time a U.S. carrier has offered a OnePlus device. T-Mobile is only stocking the mid-tier offering, which is the newer, black 8/128 gig option at $579. A little more money there. But it is offering $300 to existing customers who trade in any OnePlus phone, going all the way back to the OnePlus 1. And if you prefer your carrier in a redder hue, Verizon Wireless is also white-listing the OnePlus 6T. They won't sell it in stores, but you can use it on Verizon's LTE network under the Bring Your Own Device Program. This is huge for OnePlus, and I'm hoping the injection of some potent competition into the marketplace will help dampen those skyrocketing smartphones prices. But let's not get carried away. This would be even bigger news, if OnePlus had done a better job of avoiding that price creep I talked about. 'Cause, folks, there is competition here. As I put this video together, you could get a Samsung Galaxy S9 at B&H for $599. Or an LGG7 at Best Buy for $549. Both of those competitors bring features that Oneplus omits. Not just the headphone jack, but wireless charging, more camera features, better speakers and water-resistance, that's backed up by an actual IP rating. Any one of those things alone might not make a difference, but put together, they do make it tougher for this phone to stand out. If the 6T still speaks to you, I'll tell you when you can get it, and I'll ask your thoughts on how I should cover it further. But first, I want to warn you that glass phones are very easy to (bleep). I already scratched it. How did I, it was in the case the whole, yeah. Anyway, get a skin from my sponsor, dbrand. From marble, to carbon fiber and everything in-between, these are the best vinyl skins in the business and just like the 6T itself, they're sold at a compelling price. Dbrand your OnePlus at the link in the description below, before you scratch it, like I did. Somehow. The OnePlus 6T goes on sale November 1st, and if you live in New York City, you can get one on the day that this video goes up at the popup T-Mobile store in Times Square. I told OnePlus I'm gonna swing by, so I'd better go ahead and do that, Come say, hey! And maybe you can help me figure out how to cover this thing. I mean this video wasn't technically a review, but the 6T is very similar to the OnePlus 6, and I already went over most of what's different in this first look. So, what kind of video do you want to see? Let me know down in the comments, and be sure to subscribe to me, MrMobile on YouTube so you don't miss the rest of the avalanche, as Techtober, Phonetoberfest, Phoneavalanche, Phonepacolypse rolls on. Whatever we're calling it right now. Until next time, thanks for watching. And stay mobile, my friends.",
    "transcript_keywords": [
        "OnePlus",
        "phone",
        "price",
        "OnePlus phone",
        "things",
        "prices",
        "jack",
        "sensor",
        "company",
        "Android",
        "video",
        "years",
        "year",
        "smartphone",
        "phones",
        "OnePlus device",
        "time",
        "Glass",
        "move",
        "price creep"
    ],
    "transcript_entity_values": [
        "LTE",
        "five days",
        "Phonetoberfest, Phoneavalanche",
        "Phonepacolypse",
        "Verizon",
        "12%",
        "799",
        "Times Square",
        "579",
        "T-Mobile",
        "the OnePlus 6",
        "750",
        "6",
        "549",
        "IP",
        "the year",
        "OnePlus 1",
        "the years",
        "New York City",
        "Samsung Galaxy S9",
        "2018",
        "Pixel 3",
        "Techtober",
        "the Bring Your Own Device Program",
        "two years",
        "Verizon Wireless",
        "OnePlus",
        "Android Pie",
        "OnePlus",
        "Best Buy",
        "first",
        "November 1st",
        "YouTube",
        "jack",
        "U.S.",
        "each year",
        "599",
        "the day",
        "OnePlus",
        "8/128",
        "over $200",
        "The Pixel 3 at $",
        "five years",
        "OnePlus 6",
        "Oneplus",
        "MrMobile",
        "Americans",
        "three",
        "one",
        "Android",
        "300"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERCENT",
        "MONEY",
        "FAC",
        "MONEY",
        "ORG",
        "EVENT",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "GPE",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "GPE",
        "DATE",
        "MONEY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY"
    ],
    "vector": [
        -0.05802780017256737,
        0.036152444779872894,
        0.0434299111366272,
        -0.03316914662718773,
        -0.0011120475828647614,
        -0.020715132355690002,
        0.011012538336217403,
        0.11398572474718094,
        0.03957487270236015,
        0.0355459563434124,
        0.017981234937906265,
        0.10653325170278549,
        0.02215510979294777,
        -0.04660293087363243,
        -4.4410302507458255e-05,
        -0.06729384511709213,
        0.024389827623963356,
        -0.13207204639911652,
        -0.0669357106089592,
        -0.009676320478320122,
        0.009945698082447052,
        0.0048124296590685844,
        0.03874771296977997,
        -0.016100965440273285,
        0.10292517393827438,
        -0.08166094869375229,
        -0.0615999661386013,
        -0.027055954560637474,
        -0.02965928241610527,
        -0.014408569782972336,
        0.026744740083813667,
        0.13086020946502686,
        0.00935459416359663,
        0.018937161192297935,
        -0.04852917790412903,
        -0.0625382736325264,
        0.049544673413038254,
        0.0032667519990354776,
        -0.031034471467137337,
        0.003813172224909067,
        0.0176383163779974,
        -0.015596166253089905,
        -0.07148603349924088,
        -0.003937504254281521,
        -0.017209546640515327,
        -0.043643806129693985,
        -0.005686682648956776,
        0.03427913784980774,
        -0.020227108150720596,
        -0.04302066192030907,
        0.14908164739608765,
        0.015628131106495857,
        -0.0022049208637326956,
        -0.04989532753825188,
        -0.09122273325920105,
        0.03424176946282387,
        -0.05113174021244049,
        0.08066902309656143,
        0.032166771590709686,
        0.00439862348139286,
        0.034813206642866135,
        -0.06271161139011383,
        -0.0012816139496862888,
        0.07921934872865677,
        0.05121297761797905,
        -0.050721991807222366,
        -0.048658449202775955,
        -0.09096946567296982,
        -0.06213986873626709,
        -0.016925834119319916,
        -0.01653534360229969,
        -0.001714131562039256,
        0.017466802150011063,
        0.055429209023714066,
        -0.01948101632297039,
        0.12199663370847702,
        0.08617009222507477,
        -0.0005924983415752649,
        0.02429385297000408,
        0.00843239389359951,
        0.03803545981645584,
        -0.02951163239777088,
        -0.020144637674093246,
        -0.10887607932090759,
        0.025516783818602562,
        -0.021296745166182518,
        0.010934320278465748,
        0.0600305050611496,
        0.0579233355820179,
        -0.09366848319768906,
        -0.001901620184071362,
        0.060760971158742905,
        -0.006460884120315313,
        0.02274213172495365,
        -0.09170811623334885,
        0.030758032575249672,
        -0.12790648639202118,
        0.017313523218035698,
        -0.038296062499284744,
        -0.01479937881231308,
        0.048187363892793655,
        0.036465175449848175,
        0.023393694311380386,
        0.053802739828825,
        0.03259000927209854,
        -0.03878159448504448,
        -0.01774519681930542,
        -0.0483340360224247,
        0.06172417849302292,
        0.07695648819208145,
        -0.05328470841050148,
        -0.03953781723976135,
        -0.01782795414328575,
        0.03291391581296921,
        -0.05796976760029793,
        0.01741628721356392,
        -0.04365701600909233,
        0.028479808941483498,
        0.07268358767032623,
        -0.10436093807220459,
        -0.0247807577252388,
        -0.002416635397821665,
        -0.01645665057003498,
        -0.055675577372312546,
        -0.02701539918780327,
        -0.023962484672665596,
        -0.02473882958292961,
        2.6770666101298543e-33,
        -0.04783494025468826,
        0.051583513617515564,
        -0.07341834902763367,
        -0.06362266093492508,
        -0.023661741986870766,
        0.019311096519231796,
        0.030384954065084457,
        0.03765004873275757,
        -0.028064830228686333,
        0.1386571228504181,
        -0.06782470643520355,
        0.0013204545248299837,
        -0.03273467347025871,
        0.0560389868915081,
        0.036875419318675995,
        -0.0052621313370764256,
        -0.007884562946856022,
        -0.024549532681703568,
        0.02213979698717594,
        0.028916308656334877,
        -0.03325884789228439,
        0.04786133021116257,
        -0.005152648780494928,
        -0.05191371962428093,
        0.005955144762992859,
        -0.01707046665251255,
        0.03372513875365257,
        -0.005457954481244087,
        0.06398600339889526,
        -0.014890450984239578,
        -0.08919700980186462,
        -0.008045565336942673,
        0.033808961510658264,
        0.006779305636882782,
        0.01645292155444622,
        0.028225749731063843,
        -0.0017174755921587348,
        -0.04913783445954323,
        0.05321851000189781,
        -0.020022079348564148,
        -0.044127315282821655,
        0.05739520862698555,
        -0.11664988845586777,
        -0.0035744193010032177,
        0.08509393781423569,
        -0.029659077525138855,
        -0.015540995635092258,
        -0.017970124259591103,
        -0.020878318697214127,
        -0.04356328397989273,
        -0.07895369082689285,
        0.044565536081790924,
        -0.00824250653386116,
        -0.004483661148697138,
        -0.05827564373612404,
        -0.007884708233177662,
        0.048773813992738724,
        -0.0007347791688516736,
        0.12219483405351639,
        0.029291821643710136,
        -0.05255189910531044,
        -0.03545018658041954,
        -0.05931372195482254,
        0.0340261235833168,
        -0.03726249188184738,
        0.06836816668510437,
        0.045021697878837585,
        0.048898518085479736,
        -0.12752138078212738,
        0.05943209305405617,
        0.03974247723817825,
        -0.015504732728004456,
        -0.016930699348449707,
        -0.03595965355634689,
        0.015137208625674248,
        0.016338689252734184,
        0.0977972075343132,
        0.032662298530340195,
        0.028994722291827202,
        -0.07373486459255219,
        -0.016733558848500252,
        -0.0011294414289295673,
        0.029214002192020416,
        0.030467698350548744,
        0.019030742347240448,
        0.0005584870814345777,
        -0.007837967947125435,
        -0.04190291836857796,
        0.023112816736102104,
        0.09871295839548111,
        0.062261227518320084,
        0.020470762625336647,
        -0.09724117070436478,
        0.0722205862402916,
        0.09496302902698517,
        -4.3503954918238504e-33,
        -0.10599168390035629,
        0.0235739778727293,
        0.005108960904181004,
        -0.006745939143002033,
        0.023518063127994537,
        -0.03413081541657448,
        0.04387252405285835,
        0.05242209509015083,
        -0.027153728529810905,
        -0.07748773694038391,
        -0.028187787160277367,
        -0.016021262854337692,
        -0.0021212862338870764,
        -0.03202671930193901,
        0.04654915630817413,
        -0.04596910998225212,
        0.03358104079961777,
        -0.014095115475356579,
        0.051642514765262604,
        0.03304038941860199,
        -0.02808687463402748,
        0.01526705827564001,
        -0.06474635004997253,
        0.061400577425956726,
        -0.07494176924228668,
        -0.004841376096010208,
        -0.052312761545181274,
        -0.0663757249712944,
        -0.020124703645706177,
        -0.019028371199965477,
        -0.03924959525465965,
        -0.01340996939688921,
        0.01539328321814537,
        0.03172820433974266,
        0.08543224632740021,
        0.041822291910648346,
        -0.004782157950103283,
        -0.03224784880876541,
        0.08312142640352249,
        0.03139042854309082,
        0.021594597026705742,
        -0.010551603510975838,
        0.06176074221730232,
        -0.011270497925579548,
        0.07956855744123459,
        -0.09385494142770767,
        -0.059216830879449844,
        -0.03131992742419243,
        -0.017295537516474724,
        0.038209784775972366,
        0.06394445896148682,
        0.032850202172994614,
        0.025655033066868782,
        0.008040113374590874,
        -0.005803030915558338,
        -0.07484084367752075,
        0.032662007957696915,
        -0.06274854391813278,
        -0.06976806372404099,
        0.017184223979711533,
        0.11687327921390533,
        0.02566199190914631,
        -0.03468703478574753,
        0.03438795730471611,
        -0.009954430162906647,
        0.0071645257994532585,
        0.050002194941043854,
        -0.05575444549322128,
        -0.033020853996276855,
        0.027566667646169662,
        0.0027254908345639706,
        -0.06327757984399796,
        -0.10105671733617783,
        -0.1577002853155136,
        0.023570990189909935,
        0.061052680015563965,
        -0.12495134025812149,
        -0.0032132386695593596,
        0.039120208472013474,
        0.02106991782784462,
        -0.024486662819981575,
        0.09113049507141113,
        -0.009760809130966663,
        -0.025232456624507904,
        0.10859978199005127,
        -0.05952025204896927,
        0.05727958306670189,
        0.027292897924780846,
        -0.046335455030202866,
        0.016140831634402275,
        0.01541920006275177,
        -0.002968545537441969,
        -0.08534129709005356,
        0.008829888887703419,
        -0.020064763724803925,
        -5.235255429170138e-08,
        0.04505916312336922,
        -0.05326298996806145,
        0.047781508415937424,
        0.003476503537967801,
        0.03670942410826683,
        -0.032149698585271835,
        0.018489276990294456,
        -0.01674303226172924,
        0.06090625748038292,
        0.03194323182106018,
        0.0037943031638860703,
        -0.02329765073955059,
        -0.1079714298248291,
        0.0447382889688015,
        -0.004424804821610451,
        0.04124857112765312,
        -0.1011258214712143,
        0.0165028665214777,
        -0.000498226610943675,
        0.0695982575416565,
        -0.014169984497129917,
        0.07029663026332855,
        0.008511406369507313,
        -0.11245222389698029,
        0.0422748401761055,
        0.014344712719321251,
        -0.004130865912884474,
        0.05653364211320877,
        0.12677831947803497,
        -0.01772782951593399,
        -0.024010976776480675,
        -0.058148425072431564,
        -0.038943253457546234,
        -0.020569469779729843,
        0.026280727237462997,
        -0.04954648017883301,
        -0.004628985188901424,
        0.027908647432923317,
        0.04442144185304642,
        -0.02884860709309578,
        0.004489469341933727,
        -0.029558798298239708,
        0.02924460731446743,
        0.047435030341148376,
        -0.024714119732379913,
        0.022605249658226967,
        -0.0598439946770668,
        0.002267004456371069,
        -0.030152615159749985,
        0.04957149922847748,
        -0.04931018874049187,
        0.003448310075327754,
        -0.024614781141281128,
        -0.11678042262792587,
        0.007372051011770964,
        -0.07838796079158783,
        0.009530024603009224,
        0.051107097417116165,
        -0.01878824643790722,
        0.024688173085451126,
        -0.014221872203052044,
        -0.1059345081448555,
        0.057108644396066666,
        0.06237800046801567
    ]
}