{
    "id": "1QlKANAO2YM",
    "title": "Where Do I Get Music for Videos? (Artlist Demo)",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2018-08-14T20:03:07Z",
    "video_url": "https://www.youtube.com/watch?v=1QlKANAO2YM",
    "category": "Science & Technology",
    "tags": [
        "Where Do I Get Music for Videos? (Artlist Demo)",
        "Stock Music",
        "Artlist",
        "Artlist.io",
        "Music for Videos",
        "ANSWERED: Where Do I Get Music for Videos? (Artlist Demo)",
        "Trailer",
        "Apple",
        "Mac",
        "Computer",
        "Tech",
        "Demo",
        "TidBytes",
        "Independent Artists",
        "Review"
    ],
    "views": 7124,
    "likes": 217,
    "comments_count": 59,
    "description": "Where do I get music for Computer Clan videos? Today on TidBytes, I reveal all of the secrets. And by \"all of the secrets\" I mean Artlist. Check out Artlist    Click that link and you'll get 2 free months on us! Plus, you'll be supporting the Computer Clan, and independent artists.  You're not just helping yourself, you're helping other artists. Let's face it, that's pretty cool!  And with Artlist, you can browse and download tons of stock music, and never have to worry about breaking your budget, or your licenses expiring. Having that kind of freedom let's you focus on what's importantyour creative project!   Artlist has helped me a lot, and I know it'll help you, too. Ken  Subscribe for new content!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  More description information can go here.  Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?    In partnership with Artlist Amazon links are powered by the Amazon Associates Program.",
    "description_links": [
        "http://bit.ly/clan2LBaKov",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- Today, I wanna show you something really cool. And it relates to something I've been asked about many, many times. The questions I get are: \"Ken, what's the name of that music you're using?\" \"Where do you get your music from?\" Well, I'm gonna show you all that right now. (orchestral trailer music) Greetings, Internet, I am Ken from the Computer Clan and today on TidBytes, we're gonna take a look at Artlist. Okay, I just revealed the secrets. Again, people ask me all the time about the music I use in my videos. And here it is. It's Artlist. This is my favorite website by far for stock music. And I hope you can use it, too. Because it does something that a lot of other websites don't do. There's three big reasons why I stick with this. I'm gonna go over those and then we'll get into the nitty gritty about how the website works. A simple reason as to why I use a stock music website is to save time, so I don't have to write my own music and all that stuff. Or search for music somewhere else and get a license for it and stuff like that. This place is just a one-stop shop for stock music. Two. The licenses you get with the music tracks you download, they're good in many places, not just in youtube. Like if you post to another website or make a film. And three. The biggest reason I love this website is it is super, super, super low cost everything else. Let's say you spend $20 a song on a different website. After you buy 10 songs, you're already spending $200. But on Artlist, $200 will get you as many songs as you want for a whole year. This website uses a subscription model that I love. And that's coming from a guy that doesn't really like subscription models, but this website nails it. For $199 a year, you get access to the entire catalog of music. Again, if you spend $20 a song, by the time you spend money on 10 songs on a different website, you're already paying for the whole year of Artlist. And you can reuse the music as much as you want. There's websites where you can pay once and you can only use the song once. That's ridiculous. On here, you can use the music as many times as you want in virtually any type of project. After you download it, it's yours to use. Even if your subscription expires, you can keep the music. And again, it's only $199 for the whole year. And I do it this way, because when it comes to budgets this is by far the most affordable way to get music for the Computer Clan videos that I produce. So those are three big reasons why I recommend Artlist. So now we're gonna take a look at the nitty gritty as to how the website works, and how freaking fast and easy it is to get stuff off this website. (upbeat music) - One subscription, an annual subscription, gets you all of this stuff with all of these genres, categories, and artists, and it's absolutely amazing how extensive it is. And again, even if your subscription ends after you pay for a year, you can still keep the music. I typically start with the video theme, and we're the Computer Clan right, so we do a lot of tech stuff, so sometimes the technology button is really useful and I can find a lot of good stuff right here. Just gonna take a listen to a few. I can skip along down here. (broad music) Ooh. Not too shabby. And even before you have a subscription, you can have a free account and just add the stuff to your cart and download watermarked versions of the songs if you just wanna check the stuff for free. So let's say, yeah, I liked that Intro one, I'm gonna add that to my cart, just gonna click the cart button. Super simple. Let's keep looking through some other things. The microphone here means hey, this song has vocals in it. And you can even see, if you hover your cursor there, boom, the lyrics just show up. Now, I can refine this a little bit more as well. Let's say I wanna do like a trailer, right? Let's take out the technology tag, let's go to mood, let's say, maybe it's a dramatic trailer. You just click dramatic. For instrument, I'm thinking, you know, like an orchestra, right? Well, I can do orchestra or I can do strings, so I'll just choose one of those. And up here, I can even choose the tempo. If I want the song to be slower, I could do low. Or da-da-da-da-da-da-da, fast, you know, high tempo, right? Let's do Tense, Into the Battle, all right. (dramatic music) Oh, yes. (dramatic music) Yeah, yeah, yeah, that sounds good, I like that. So I'm just gonna boom, throw that into the cart. And the cool thing is, sometimes you see that \"NEW tag pop up like this down here. New stuff is added every single week, so when you subscribe for one year, that means there's gonna be 52 cycles of new stuff thrown onto this modern, sleek looking website, which is pretty cool. And if I want, I can click through the artist and see more of what they do. See all their albums. And just to have a good cause behind this, a lot of these people, if not all of them, are independent artists, so actually using this service not only benefits you, not only benefits the Computer Clan, but hey, there's a third leg to the stool. You're also benefiting independent artists. So it's a win-win-win. (dramatic music) Yeah that sounds pretty cool, too. I'm gonna throw that in my cart. And again, I can just click and add all this stuff to my cart, I don't have to worry about my budget, I don't have to worry about price. Like, the freedom there is unbelievable. I can just throw this stuff in my cart and boom, it's there. So let's say I did all that, I got three songs that I'm gonna try out in my project later, great. So we just click on our little cart up here. And here's everything we purchased. Now watch how fast and easy this is. Ready? Check out. Done. That's it. And there it is. Your Artlist songs have arrived. Within seconds. Didn't have to pay. Hardly had to wait more than a few seconds. Here's my receipt already. Here's all my downloads. I can access them through the email here or I can go to Ken's music, where I see everything that I added to my cart and downloaded. So remember the little preview I showed earlier. That's actually a small excerpt from the trailer for our new flagship show coming up soon. This is the music that I found for that. (upbeat music) And as you can hear, it fits beautiful. Like, this is high quality stuff. This isn't cheap, like, beginner stuff just thrown up on a website. Like, this is, this is real stuff. I legitimately don't know how Artlist makes it sound so good and how they keep it so low cost, I'm literally shocked. But that is why I love these guys and I just wanted to share the good word because I use them all the time. And now you'll be able to as well in your creative projects. Which, by the way, share with me. I'd love to see what you do with Artlist in your videos. Boom, ladies and gentlemen, that is Artlist. Again, put that link in the description if you wanna get a bonus subscription of two extra months. You'll be getting extra months with Artlist and you'll be supporting the Computer Clan when you do so. So it's a win-win. And you'll never have to worry about your budget, for your money or your time, ever again with stock music. I used a lot of music from Artlist for our new flagship show that's coming up soon, it fit the bill perfectly. And I know it'll work for you, too. So again, hit that link in the description, and you can start using Artlist right away. And let me know if you have any questions. I'm here to help as well. So have fun exploring the new music. And I'll see you in the not-too-distant future.",
    "transcript_keywords": [
        "music",
        "Artlist",
        "Computer Clan",
        "stuff",
        "website",
        "cart",
        "subscription",
        "Computer",
        "Clan",
        "stock music",
        "songs",
        "year",
        "Ken",
        "song",
        "good",
        "time",
        "Ken music",
        "Computer Clan videos",
        "lot",
        "yeah"
    ],
    "transcript_entity_values": [
        "annual",
        "Ken",
        "third",
        "more than a few seconds",
        "Battle",
        "one year",
        "two extra months",
        "the Computer Clan",
        "TidBytes",
        "the whole year",
        "da-da-da-da-da-da-da",
        "199",
        "today",
        "52",
        "200",
        "one",
        "a whole year",
        "10",
        "seconds",
        "One",
        "youtube",
        "Two",
        "every single week",
        "only $199",
        "Artlist",
        "the Computer Clan",
        "a year",
        "Artlist",
        "20",
        "three"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "ORDINAL",
        "TIME",
        "PERSON",
        "DATE",
        "DATE",
        "FAC",
        "ORG",
        "DATE",
        "PERSON",
        "MONEY",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL"
    ],
    "vector": [
        -0.06652624905109406,
        -0.10140915960073471,
        -0.02390166185796261,
        -0.04453904181718826,
        0.08559516072273254,
        0.10688111931085587,
        0.025898922234773636,
        0.024155884981155396,
        -0.02524529956281185,
        -0.004853873047977686,
        -0.010964320041239262,
        -0.018184363842010498,
        -0.03317118063569069,
        -0.006319853011518717,
        0.012681619264185429,
        0.05412043258547783,
        0.08132996410131454,
        0.04958770051598549,
        0.01345654483884573,
        -0.049702439457178116,
        -0.03448694199323654,
        -0.05370837822556496,
        0.009677289985120296,
        -0.004522659815847874,
        -0.020528743043541908,
        0.05960783734917641,
        -0.01995036005973816,
        -0.04648800939321518,
        0.033071670681238174,
        -0.04657137766480446,
        -0.00925189908593893,
        -0.01794995181262493,
        0.04760022833943367,
        -0.04878826066851616,
        -0.008928508497774601,
        -0.014651249162852764,
        -0.007562043145298958,
        -0.01768420822918415,
        -0.06262142211198807,
        -0.008225851692259312,
        -0.03882565349340439,
        0.09540816396474838,
        -0.029951632022857666,
        -0.015893932431936264,
        -0.02478916384279728,
        -0.014980620704591274,
        0.04364684596657753,
        -0.08533087372779846,
        -0.006099284160882235,
        0.042559415102005005,
        -0.017862491309642792,
        -0.048244696110486984,
        -0.04563312605023384,
        0.01695680432021618,
        -0.060930393636226654,
        -0.09162472188472748,
        0.023429024964571,
        -0.011598733253777027,
        0.0573924295604229,
        0.02486533671617508,
        0.038827598094940186,
        -0.10158149152994156,
        -0.036938369274139404,
        0.009890874847769737,
        -0.014628474600613117,
        -0.03700411692261696,
        0.0515950582921505,
        0.17709079384803772,
        0.023982543498277664,
        -0.08255734294652939,
        -0.047690343111753464,
        0.009094847366213799,
        -0.054011669009923935,
        0.1001233235001564,
        0.027621563524007797,
        -0.009314070455729961,
        0.013490303419530392,
        -0.07342641800642014,
        -0.031572017818689346,
        -0.05496140941977501,
        0.042133934795856476,
        0.047846533358097076,
        0.015246221795678139,
        -0.09972288459539413,
        -0.026343854144215584,
        0.018051914870738983,
        -0.0016919909976422787,
        0.04110541567206383,
        -0.030037103220820427,
        -0.005118100438266993,
        -0.031013041734695435,
        0.1287851631641388,
        0.041141659021377563,
        -0.03464522585272789,
        0.0773640051484108,
        0.01063730288296938,
        0.05575023964047432,
        -0.08448471873998642,
        -0.059128981083631516,
        0.028889143839478493,
        -0.006143396720290184,
        0.01735171303153038,
        0.0062775760889053345,
        -0.08864511549472809,
        -0.03588458150625229,
        -0.02529076859354973,
        -0.018067780882120132,
        0.11514356732368469,
        0.03439147397875786,
        0.06909962743520737,
        0.028811641037464142,
        0.08970308303833008,
        -0.1033824160695076,
        -0.09152402728796005,
        0.06106537580490112,
        0.04113536700606346,
        -0.121835857629776,
        0.044565845280885696,
        0.10509376227855682,
        0.03374745324254036,
        -0.045707058161497116,
        -0.029583534225821495,
        0.021716581657528877,
        -0.02056172490119934,
        0.023919953033328056,
        -0.014383254572749138,
        -0.0722372829914093,
        -2.895057767139276e-34,
        0.08450153470039368,
        0.001239289646036923,
        0.004576655570417643,
        0.09058854728937149,
        0.054617807269096375,
        -0.07617940753698349,
        0.021908193826675415,
        0.008975516073405743,
        -0.1380164623260498,
        0.05275830626487732,
        0.11822781711816788,
        0.011891262605786324,
        -0.05776194855570793,
        0.08034354448318481,
        -0.02835916541516781,
        -0.05837326496839523,
        -0.04069782420992851,
        -0.0625595971941948,
        0.018530752509832382,
        -0.025123286992311478,
        0.0018463315209373832,
        -0.04577736556529999,
        0.06755701452493668,
        0.10230430215597153,
        0.02164793573319912,
        -0.0645732581615448,
        -0.06625150144100189,
        -0.06624145805835724,
        0.07796914130449295,
        0.007979677058756351,
        -0.1013953909277916,
        0.020349280908703804,
        0.07279748469591141,
        -0.04212876409292221,
        0.004577432759106159,
        0.026009585708379745,
        -0.07253019511699677,
        -0.07036364823579788,
        0.03184444457292557,
        -0.05712517350912094,
        -0.004438083153218031,
        0.024780526757240295,
        -0.06601537764072418,
        -0.06083362549543381,
        0.007517440244555473,
        -0.014997163787484169,
        0.061951857060194016,
        -0.0054086740128695965,
        0.08182629197835922,
        0.028414156287908554,
        0.04319676011800766,
        0.03797394409775734,
        -0.03563494607806206,
        0.013009968213737011,
        -0.05527125298976898,
        -0.003043373813852668,
        0.01920922100543976,
        -0.02771776169538498,
        0.05740877985954285,
        -0.02141261287033558,
        0.06625226140022278,
        0.034861721098423004,
        0.015129677020013332,
        -0.02730894461274147,
        -0.07127945870161057,
        0.005403949413448572,
        0.045099224895238876,
        -0.04404217377305031,
        0.0448407307267189,
        0.022715184837579727,
        -0.018733099102973938,
        -0.053021255880594254,
        0.06312985718250275,
        -0.07188050448894501,
        0.04038888216018677,
        0.03525417670607567,
        -0.07138653099536896,
        -0.09116639941930771,
        -0.033253297209739685,
        0.049494028091430664,
        -0.03752754628658295,
        0.003530707908794284,
        0.0005143879679962993,
        0.09836801141500473,
        0.016546936705708504,
        0.049784254282712936,
        0.02268160507082939,
        -0.01794305443763733,
        -0.032562077045440674,
        0.007481646258383989,
        -0.02573130838572979,
        0.050049904733896255,
        -0.010029804892838001,
        0.04383925721049309,
        0.03326817601919174,
        -3.4197107424475144e-34,
        0.05090044066309929,
        0.014655791223049164,
        0.017467902973294258,
        -0.04286874085664749,
        0.1123964935541153,
        0.03774520009756088,
        -0.0179025549441576,
        -0.0033549468498677015,
        0.04258618503808975,
        0.009535843506455421,
        0.026053234934806824,
        -0.05589960515499115,
        -0.15849930047988892,
        0.014438795857131481,
        -0.04801512137055397,
        -0.09569856524467468,
        -0.024756215512752533,
        -0.034208547323942184,
        -0.028256775811314583,
        -0.03334477171301842,
        -0.011680853553116322,
        0.023927533999085426,
        0.012035424821078777,
        -0.03786633163690567,
        -0.011254841461777687,
        0.024383477866649628,
        -0.05717487260699272,
        0.06600353866815567,
        0.07020316272974014,
        0.04265452176332474,
        0.03875216469168663,
        -0.05385073274374008,
        -0.011476187966763973,
        -0.05684966593980789,
        -0.013726449571549892,
        -0.024911800399422646,
        0.07135314494371414,
        0.01398600172251463,
        -0.027472538873553276,
        0.03514231741428375,
        0.0031000678427517414,
        0.060454532504081726,
        -0.04076531156897545,
        -0.037287093698978424,
        -0.020699193701148033,
        -0.026161322370171547,
        -0.03200520575046539,
        0.0881146788597107,
        0.009957822039723396,
        -0.06409118324518204,
        0.06131947785615921,
        -0.033757660537958145,
        0.05334675684571266,
        -0.05317509546875954,
        -0.012201839126646519,
        0.0029028933495283127,
        -0.02218509651720524,
        0.02977028489112854,
        0.017696019262075424,
        0.0636385828256607,
        -0.03945264220237732,
        0.054070279002189636,
        -0.0410439632833004,
        -0.014000277034938335,
        -0.04957801103591919,
        0.036481745541095734,
        0.07404360920190811,
        0.016583207994699478,
        -0.05072060227394104,
        -0.023770472034811974,
        -0.005808881483972073,
        0.053796373307704926,
        -0.00467605609446764,
        -0.08035541325807571,
        -0.07595829665660858,
        -0.00925834383815527,
        0.05149424076080322,
        0.011571488343179226,
        0.07560417801141739,
        -0.04680369794368744,
        -0.024669913575053215,
        0.00790213793516159,
        0.030635744333267212,
        -0.011435184627771378,
        0.06678961962461472,
        0.051271405071020126,
        0.04712130129337311,
        -0.02425467036664486,
        -0.033297568559646606,
        0.06940928101539612,
        -0.00902954488992691,
        -0.004184513818472624,
        0.03594191372394562,
        0.10102155059576035,
        0.04036956652998924,
        -4.833490052646994e-08,
        -0.05632687732577324,
        0.020401444286108017,
        -0.03757763281464577,
        -0.004549555946141481,
        0.00797269493341446,
        0.05492985621094704,
        0.03583178669214249,
        0.016046192497015,
        0.06864872574806213,
        0.02755095809698105,
        0.04860607162117958,
        -0.08408024907112122,
        -0.016517281532287598,
        0.05065523087978363,
        0.034357357770204544,
        0.0057488251477479935,
        0.01162117999047041,
        0.026095474138855934,
        -0.01814713515341282,
        -0.031322889029979706,
        -0.027468187734484673,
        0.014881951734423637,
        0.08592147380113602,
        -0.09082524478435516,
        -0.024025829508900642,
        0.025661924853920937,
        0.08949218690395355,
        0.03915933892130852,
        0.02185792662203312,
        0.06568685919046402,
        -0.05774968862533569,
        0.01712465099990368,
        -0.010987485758960247,
        -0.10044676065444946,
        0.08409348875284195,
        -0.1109059527516365,
        -0.0702676847577095,
        -0.059011831879615784,
        -0.06261726468801498,
        0.04491311311721802,
        0.013000786304473877,
        0.012686071917414665,
        0.07829882949590683,
        0.0016645502764731646,
        -0.036062903702259064,
        0.013581785373389721,
        -0.029613109305500984,
        -0.03213432803750038,
        -0.012448764406144619,
        0.059295546263456345,
        -0.10354221612215042,
        -0.04765121266245842,
        -0.02360292710363865,
        0.05699186772108078,
        0.07749973237514496,
        0.058621279895305634,
        -0.03831997886300087,
        0.08905187249183655,
        -9.287449211115018e-05,
        0.06279164552688599,
        -0.01387180294841528,
        -0.04075589030981064,
        -0.003029139479622245,
        0.0037910586688667536
    ]
}