{
    "id": "1uu9VWBgcBU",
    "title": "Samsung Z Flip 3 Review: The First Big Step!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2021-08-26T23:07:22Z",
    "video_url": "https://www.youtube.com/watch?v=1uu9VWBgcBU",
    "category": "Science & Technology",
    "tags": [],
    "views": 5096234,
    "likes": 135568,
    "comments_count": 7578,
    "description": "Samsung made a folding phone I can actually recommend to real humans! Crucial SSDs:  That shirt!  Flip 3 skins:   Tech I'm using right now:   Intro Track: Jordyn Edmonds   Playlist of MKBHD Intro music:   Phone provided by Samsung for review.  ~",
    "description_links": [
        "https://crucial.gg/MKBHD",
        "http://shop.MKBHD.com",
        "https://dbrand.com/flip3",
        "https://www.amazon.com/shop/MKBHD",
        "http://smarturl.it/jordynedmonds",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - Now the thing I remember saying at the beginning of this whole foldables wave, is if we really want these foldables to catch on, if this really is the future of how smartphones could be, then the tech is gonna have to get better and better to the point where folding in half is just another feature, right? There can't be huge compromises, or massive price tags, or awkward things about it, it has to just be one more thing. 'Cause at that point, you know, it's kind of cool that it folds, but that's when early adopters are gonna give it a shot and really see what it's about. But if you want everyone to be trying these things, it's gotta be just one more feature. It's gotta be a normal phone in every other way, except for the fact that it also folds in half. That's when it gets interesting. So at this phone, the Z Flip 3, the ambition's still pretty simple. Give us a regular phone for regular use, and then let us fold it shut into a sort of smaller form factor, kinda like a throwback to the flip phones of yesteryear. Now there's a couple of new features on this year's version that really make it that much more usable. It doesn't change a ton, but there are a few key things that make a big difference. So in my order of importance, that would be the new refresh design, which is pretty sweet, the much improved build quality and the bigger, much more usable outside cover screen. So the new design is pretty sweet. It reminds me of the classic Panda Pixel 2, which was one of my favorite phone designs ever. But it also looks and feels more refined too. They squared up those sides. You know, they've shifted, obviously you can see to a two-tone look. And there's some new colors. This cream color has gotten a lot of love, but there's also a pretty sweet green. And yes, it does come in matte black if you're into that. Or you can just grab an icon skin from the link in the description and make it look even more sick. I'm just saying, link below. Now, there's a funny little quirk of using a phone. That's the shape, which is when you fold it, it's basically a square. And so you put it in your pocket, and a lot of times you flip it by accident, or maybe it's upside down or whatever, it can be in your pocket in any number of different orientations. And so when you pull it out of your pocket, there's this brief moment where you have to figure out where you're at, figure out what's right side up. And so this dual tone front and also the little tiny indentation for the fingerprint reader power button on the side has been my way of just like quickly finding home and getting into using the phone. And so I kinda, it's got a little utility, I like that. And I really like that they found a lot of other subtle little things to improve about the build quality too. The flat sides like I said, really nice, but also this hinge is even more sturdy and will hold almost any angle you want until it's nearly shut, which is when the magnets takeover and give this satisfying, that clap when it slapped shut. It's a nice hinge. And it also now happens to be IPX8 water resistant. So while you should absolutely still keep it away from sand or dust, it can now survive a splash of water, or falling into a puddle and be totally fine. So that's dope. Also underrated, the stereo speakers are much better and fuller. And even if you block that small bottom speaker grill with your finger, the earpiece speaker is also plenty loud too. So no worries. That was well done. I only really have two minor complaints with the build of this phone. One, it gets very fingerprinting. That's I guess, a little bit unavoidable, or you can just scan it. But two, the volume rocker is like way up top on the side of the phone. Even with big hands, just the way you normally hold a phone, it's pretty unreachable. So it becomes a sort of a two handed operation to go up there and change the volume. I definitely wish they just put it on the other side of the phone. But instead there's this cutout, which I believe is for the 5G antennas. So I guess I just wish they swapped those. But I guess aside from the hinge, the most important part on a phone like this would be the screen. And so there's really only one ambition of a phone like this, which is to unfold into a normal phone experience. And so this what you get here is a pretty big display unfolded. It's almost S21 ultra sized. So it's a 6.7 inch, 22 by nine, 10 ADP, bright Ola display, with a hole punch cutout, and it's 120 Hertz finally. So this was my biggest ask from the last version. It just doesn't seem right anymore to charge flagship money for a phone with a 60 Hertz display. Apple I guess can somehow still pull it off, because people still buy iPhones all the time. But this feels way better, way more smooth, love the higher refresh rate experience now. But a couple of things about this screen. So first of all, the top of, the screen protector, it's a 30% harder cover glass on the screen, great feature. But this top layer of the skin protector is like cut out around the selfie camera, and it's pretty annoying. Like it kind of looks like one of those cheap pre-installed screen protectors, and it really makes me wanna remove it. But Samsung would really like you to not remove it. So that's gotten pretty annoying, although I'll probably eventually get annoyed and take it off. But it's there. But two, the crease. The crease is definitely still here. In fact, it hasn't changed all that much from the last flip. It's right through the middle of the phone, where your finger runs over it all the time when you're scrolling through normal things, like social media, or emails or whatever you're doing. So it's visually there, but it's also physically there since you feel it so much. I feel like it's both annoying, but also like no big deal at the same time. Maybe I'm a little, I'm a person who's used a folding phone before. So I'm a little more used to the crease than a normal person. But it's true. If you just look at the content on the screen you can definitely ignore it. The keyboard is below, it doesn't touch it. So all that's fine. But on the other hand, it's definitely still noticeable. Even if you're just a little bit off access, it catches your eyes sometimes. You know, if you're reading text it'll kind of droop it in the middle a little bit. So I'll like scroll a bit extra to get the text away from the middle. It's weird. I hope they keep working on this, because if they could get it to feel even more flat, like a normal glass screen someday, that would be way better. But yeah, I think that should be the next big improvement. Minimizing this crease and also trimming down the edges around the display, because it's still a bit off on a $1,000 phone to have to do that gesture from the side, but have your finger hit a piece of plastic. But Flip 3 is all about the outside cover screen. So Flip 2, as you can tell by my shirt, I shopped that from community.com, had a very, very, very small outside cover screen. It basically would just show you the time, and if you had a notification, right? Then Moto Razr came out, and while most of the rest of this phone was pretty terrible, it did have a massive outside screen that turned out to be very useful. So now Samsung has given us a larger cover screen on the Flip 3. Not as big as the Razr's, but it's four times the area as the last one, and it genuinely changes the way you use the phone. So actually do some quick stuff on the outside screen now without opening the flip. So by default it's just time, date and battery, plus a dot over on the side, if you have any notifications. But then you can change the visual on the screen if you want to a bunch of different things in the settings. There's a whole page. You can change different animations, and different backgrounds and clock styles. You can even match it to the watch face if you have a Samsung galaxy watch. So that's pretty smart. But from there you can do a bunch of stuff. So you can swipe over to your different widgets in whatever order you want. Music, weather, a timer if you want one, some people might want their calendar here. It's not unlimited widgets. There's actually just a list of six you can choose from, that Samsung has put in here, and you can choose the order. But even just these six are pretty useful. So if I'm playing a podcast or music, which I do all the time, the music icon shows up and then I can tap that to skip right to the music controls widget, and then play or pause, or fast forward or wherever from here. Also fun fact, when the phone is closed like this, the volume buttons on the outside reverse function. So this up direction increases volume and down decreases, but then it flips back when you open up the phone. Again, very smart. You know, it would have been smarter though, Google assistant on the outside screen, just like firing it up, asking it a question. That's not a thing available here. It does use Bixby voice to answer text messages, which is, whatever, that's fine. But then also even taking pictures on the outside screen is way better. You could do it before, but it was a tiny screen. You didn't want to. This one actually would. So it's a decent sized viewfinder, and it's the primary camera, so they're kind of nice. And you can swipe up or down to change lenses and swipe left or right to switch from photo or video mode. One thing to note though, is selfies from the main camera with the cover screen will be a one by one square aspect ratio, and there's no way to change that, just a heads up. Aside from that, though, you do get decent selfie image quality from the primary cameras, which aren't quite flagship level, but they're pretty good. Same as last year. The primary and the ultra wide. And that kind of checks out across the rest of the features of this phone. Like I love that the cameras are basically flushed with this phone. But aside from that on a $1,000 phone they're fine, nothing special. The battery life, again, you know, this is a 3,300 million power battery split between the top and the bottom, and it's powering a huge 120 Hertz display. So it did better than expected, but when it taps out after four hours of screen on time, that's just fine, nothing special. Call quality, again, fine. Heat dispersion, only really warm up when wireless charging on the rare wireless charger that actually fits a phone this size. But again, it's fine. And on a phone like this, it might sound like I'm like disappointed. I'm saying, oh, it's fine, it's fine. But really that's kind of an accomplishment on a phone that screen folds in half. Like that's kind of amazing. We are looking to eventually get down to the point where there's no major compromises or major shortcomings, and it delivers on the one promise of being able to fold your phone down into something that's theoretically a bit more pocketable for people with smaller pockets, or for ladies with purses and things like that. And it does it. So it's not super flashy or head-turning. It's not even as ambitious as the Fold 3, which is trying to give you a normal smartphone and a tablet in your pocket, which is a lot. But the fact that it gives you a normal smartphone experience and folds in half is very close to what I said at the beginning, and what I've been saying since the beginning of this whole foldable thing, which will get them to catch on. This is a folding phone. I can actually start recommending it to people. And the fact that we got this far is crucial for them to move forward. But speaking of crucial, shout out to Crucial for sponsoring this video, it's perfect. Okay, so Crucial, a brand of Micron, has been really good and really experienced with SSDs. Now when I say SSD might be picturing like one of these guys that just goes into your computer. But Crucial is one of the biggest memory manufacturers in the world. So they've brought their expertise to making external solid state drives. And these guys are super useful. So a single external SSD like this is gonna give you incredible performance, reliable quality, and durability with zero moving parts. And they're compatible with not just Windows and Mac iOS, but Chrome OS, the Xbox, the PS5, Android, and the iPad Pro. You know, the one iOS device that actually has a USB-C port. It's a pretty ideal universal solution to so many things. I've talked a lot about devices in the past that have lower based storage just to get away with having a lower base price. And so, you know, cloud storage has been a popular solution to this problem, but when you think about that economically you want it save money by going into lesser storage, but then you spend money every single month to sort of rent that space in the cloud, which seems crazy where you can just have four terabytes in your pocket like this. So we use these in the studio here all the time for transferring video files and assets between computers. But for you, I mean, it's whatever you want. The tiny X6 offers up to four terabytes of storage at 800 megabytes per second read, right? Or if you're like me and you just need this speed, you can get the Crucial X8, and that'll do 1,050 megabytes per second for up to two terabytes of storage. So future proof yourself, grab a Crucial SSD. I'll have the link below if you wanna check out the X6 or the X8. And of course I have the X8 if you care, that's the one I carry with me all the time in my backpack. But that's pretty much it. Thanks for watching. I'll catch you guys in the next one. Peace. (logo whooshing)",
    "transcript_keywords": [
        "phone",
        "screen",
        "pretty",
        "cover screen",
        "things",
        "Flip",
        "time",
        "fine",
        "kind",
        "crucial",
        "normal phone",
        "normal",
        "side",
        "thing",
        "pretty sweet",
        "change",
        "cover",
        "bit",
        "flip phones",
        "big"
    ],
    "transcript_entity_values": [
        "5",
        "Micron",
        "30%",
        "year",
        "four hours",
        "one",
        "Hertz",
        "Crucial",
        "four",
        "One",
        "22",
        "X8",
        "1,000",
        "nine",
        "1,050 megabytes",
        "iPhones",
        "S21",
        "10",
        "Android",
        "X6",
        "Flip 2",
        "half",
        "first",
        "last year",
        "Windows and Mac iOS",
        "every single month",
        "zero",
        "Google",
        "Xbox",
        "four terabytes",
        "800 megabytes",
        "Bixby",
        "PS5",
        "X6",
        "the iPad Pro",
        "second",
        "Chrome",
        "up to two terabytes",
        "Crucial SSD",
        "60",
        "six",
        "Moto",
        "SSD",
        "Ola",
        "iOS",
        "two",
        "a ton",
        "Panda Pixel 2",
        "6.7 inch",
        "ADP",
        "Samsung",
        "120",
        "3,300 million"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "PERCENT",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "FAC",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "NORP",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.15569397807121277,
        0.025924159213900566,
        0.07914688438177109,
        -0.030560467392206192,
        0.01922345906496048,
        -0.033475831151008606,
        -0.013443903997540474,
        0.12677593529224396,
        -0.0670894905924797,
        0.01668556220829487,
        0.006583971902728081,
        0.06299587339162827,
        -0.004361059982329607,
        -0.017347922548651695,
        0.07087758928537369,
        -0.013064322993159294,
        -0.016286050900816917,
        -0.02152089588344097,
        -0.050604525953531265,
        0.05053853616118431,
        0.044805701822042465,
        -0.05023333802819252,
        0.029101945459842682,
        -0.0065953293815255165,
        -0.00011553323565749452,
        0.051644254475831985,
        -0.022231440991163254,
        -0.0613166019320488,
        0.001145660295151174,
        -0.01791517250239849,
        0.07064361870288849,
        0.12973642349243164,
        0.054667096585035324,
        0.0023733030539005995,
        -0.02447497472167015,
        -0.07321836799383163,
        0.03505093604326248,
        0.002342364052310586,
        -0.04589294642210007,
        -0.014977751299738884,
        -0.03880590200424194,
        0.026659337803721428,
        -0.042579784989356995,
        0.013164144940674305,
        0.009267168119549751,
        -0.046799805015325546,
        0.009377512149512768,
        -0.041356783360242844,
        -0.04375433176755905,
        -0.013155593536794186,
        0.03293275833129883,
        -0.004327805712819099,
        -0.0028301181737333536,
        0.01902257651090622,
        -0.06012052670121193,
        0.07607526332139969,
        -0.02704477496445179,
        0.019988078624010086,
        0.05287043750286102,
        0.04207564517855644,
        0.10965055227279663,
        -0.06838208436965942,
        -0.02777737006545067,
        -0.0018751040333881974,
        0.0914100706577301,
        -0.024350734427571297,
        -0.003449329175055027,
        -0.056842140853405,
        -0.030823588371276855,
        0.046422079205513,
        -0.028953775763511658,
        0.020537037402391434,
        0.020109597593545914,
        0.03136477991938591,
        0.07788697630167007,
        0.012628362514078617,
        0.09566855430603027,
        -0.03563596308231354,
        -0.08352404832839966,
        0.02948775887489319,
        -0.02057398296892643,
        -0.07111905515193939,
        -0.06342040747404099,
        0.007493575103580952,
        -0.03095049038529396,
        -0.03674136474728584,
        -0.055757787078619,
        0.009290375746786594,
        -0.08495840430259705,
        -0.031924836337566376,
        -0.013945555314421654,
        0.06328197568655014,
        -0.0017511335900053382,
        -0.03276074677705765,
        -0.014244225807487965,
        0.03392799571156502,
        -0.08356955647468567,
        -0.062308743596076965,
        0.005863121245056391,
        -0.002077716402709484,
        -0.01852920465171337,
        0.06338342279195786,
        0.14556579291820526,
        0.011819610372185707,
        -0.0006820533890277147,
        -0.11257180571556091,
        0.02396990731358528,
        0.0006417185068130493,
        -0.0649770051240921,
        0.015122628770768642,
        0.009256510064005852,
        -0.008342958055436611,
        0.034672968089580536,
        -0.007130465470254421,
        -0.047688599675893784,
        0.017964953556656837,
        0.0021363263949751854,
        0.028865203261375427,
        0.08491703122854233,
        0.057126883417367935,
        -0.05844839662313461,
        0.022937923669815063,
        -0.023744460195302963,
        -0.09917062520980835,
        -0.0011080881813541055,
        0.04391665756702423,
        -0.06486853957176208,
        6.833108253711648e-33,
        -0.00916081853210926,
        0.1469707190990448,
        -0.06424158066511154,
        0.04216430336236954,
        0.01027582585811615,
        -0.020475393161177635,
        -0.04226849600672722,
        -0.024728499352931976,
        -0.05911913514137268,
        0.10555869340896606,
        -0.01643802598118782,
        0.04826876521110535,
        -0.0027814197819679976,
        -0.01644342951476574,
        0.0513671413064003,
        -0.07467213273048401,
        -0.07298853993415833,
        -0.03607170283794403,
        -0.07123750448226929,
        -0.0570746511220932,
        0.017506960779428482,
        -0.01948198676109314,
        0.06909996271133423,
        -0.01863202266395092,
        0.04124673083424568,
        -0.06409304589033127,
        0.03686823323369026,
        -0.060164399445056915,
        0.05787847191095352,
        0.001886384910903871,
        -0.08111916482448578,
        0.01783895492553711,
        0.027063097804784775,
        -0.05285533145070076,
        0.009331791661679745,
        0.04521383345127106,
        -0.015179197303950787,
        -0.0654100775718689,
        0.027113132178783417,
        0.033539529889822006,
        -0.048285555094480515,
        0.03445899486541748,
        -0.03695455566048622,
        0.03244275227189064,
        0.03665302321314812,
        0.021119942888617516,
        0.08747866749763489,
        0.04864409565925598,
        -0.05722756311297417,
        -0.021719908341765404,
        0.017785364761948586,
        -0.009496127255260944,
        -0.01500233169645071,
        -0.04100675508379936,
        -0.015822527930140495,
        -0.02348235249519348,
        0.055396806448698044,
        -0.08424331992864609,
        0.03717251494526863,
        0.037167467176914215,
        0.004750603344291449,
        -0.00043836538679897785,
        -0.05341614782810211,
        -0.02200864441692829,
        -0.04239429160952568,
        0.07609841972589493,
        0.072100430727005,
        0.008789109997451305,
        -0.04777107015252113,
        0.00262548984028399,
        -0.047192469239234924,
        0.0008013340993784368,
        -0.06592049449682236,
        0.0013063912047073245,
        0.02834438718855381,
        0.0150460135191679,
        0.041560523211956024,
        -0.008828232996165752,
        0.06616202741861343,
        -0.043393153697252274,
        0.020488599315285683,
        -0.01894443668425083,
        0.03666004166007042,
        0.05182577669620514,
        0.01388039905577898,
        -0.07062064111232758,
        0.013673350214958191,
        -0.113945372402668,
        -0.040286868810653687,
        0.025612952187657356,
        -0.09230773895978928,
        -0.03730248659849167,
        0.06695656478404999,
        -0.00928604044020176,
        0.025226155295968056,
        -6.1005636841662146e-33,
        -0.05279817432165146,
        -0.04858381301164627,
        -0.018826885148882866,
        -0.0069076004438102245,
        0.024388626217842102,
        -0.04819157347083092,
        0.05425368621945381,
        0.0458410270512104,
        -0.0663103461265564,
        -0.06935511529445648,
        0.006842402275651693,
        0.020214805379509926,
        0.03921761363744736,
        -0.026652146130800247,
        -0.044509924948215485,
        -0.013852301053702831,
        0.07026045769453049,
        -0.05038657411932945,
        0.07999882847070694,
        0.060715869069099426,
        0.0602383017539978,
        0.01746283657848835,
        -0.050854358822107315,
        0.08531888574361801,
        -0.02636364847421646,
        0.03812013193964958,
        -0.03566386550664902,
        0.00879413727670908,
        0.08229684084653854,
        0.040983546525239944,
        -0.029934395104646683,
        -0.08991102129220963,
        0.03294309601187706,
        -0.015667390078306198,
        0.022307967767119408,
        0.0160251222550869,
        -0.03414704278111458,
        -0.021464111283421516,
        0.08009830862283707,
        -0.058101996779441833,
        0.0001217204044223763,
        0.006047547794878483,
        -0.02441670186817646,
        -0.027550391852855682,
        0.06694351881742477,
        -0.06535566598176956,
        -0.0020446404814720154,
        0.05982036888599396,
        -0.1128927692770958,
        -0.0366424024105072,
        -0.010747808031737804,
        0.02245691977441311,
        -0.004882512614130974,
        -0.06952608376741409,
        -0.03581638261675835,
        0.028339898213744164,
        -0.004351357463747263,
        -0.04391977936029434,
        0.06411825865507126,
        0.04849402233958244,
        0.08609239012002945,
        0.05243325233459473,
        0.0008298648754134774,
        -0.10458853095769882,
        -0.02781924046576023,
        0.035176534205675125,
        0.10692787170410156,
        -0.04715630039572716,
        -0.03184313327074051,
        -0.0177591722458601,
        -0.05981952324509621,
        -0.05536796525120735,
        -0.026321763172745705,
        -0.10275089740753174,
        0.006437026429921389,
        0.06326062232255936,
        -0.050855107605457306,
        0.0147448955103755,
        0.021248415112495422,
        -0.01990002952516079,
        0.026286879554390907,
        0.007735762745141983,
        0.028386570513248444,
        -0.01573420688509941,
        0.05550340563058853,
        0.007903913035988808,
        -0.036328986287117004,
        0.028757724910974503,
        0.018514879047870636,
        0.022856300696730614,
        -0.05488627031445503,
        -0.02970891073346138,
        -0.02661784738302231,
        0.15376928448677063,
        0.048729363828897476,
        -5.7377288698035045e-08,
        0.06256682425737381,
        0.027953635901212692,
        0.07502372562885284,
        0.025644982233643532,
        0.002073570154607296,
        -0.03767089918255806,
        0.06678710132837296,
        -0.09739036858081818,
        0.05942839756608009,
        0.04290295019745827,
        -0.019183456897735596,
        -0.05941159650683403,
        -0.10035967081785202,
        0.08075956255197525,
        0.0495731458067894,
        0.09438742697238922,
        -0.035336725413799286,
        0.11435344070196152,
        -0.03915134444832802,
        0.042856745421886444,
        0.014984364621341228,
        0.0028732919599860907,
        0.06539494544267654,
        -0.023039361461997032,
        0.07828237861394882,
        -0.010029186494648457,
        -0.08624830096960068,
        -0.01171001885086298,
        0.06645254790782928,
        -0.017603201791644096,
        -0.021390892565250397,
        -0.04027487337589264,
        0.03185456618666649,
        0.06160171329975128,
        -0.030570872128009796,
        -0.07963304221630096,
        -0.011955068446695805,
        -0.020740995183587074,
        0.07790073752403259,
        0.02314871735870838,
        0.08635770529508591,
        0.04485635459423065,
        -0.021261241286993027,
        0.07962249964475632,
        -0.05036883056163788,
        -0.10631798207759857,
        0.04416119307279587,
        -0.01794678159058094,
        -0.020731676369905472,
        0.058112163096666336,
        -0.02602190524339676,
        -0.0981404185295105,
        -0.05608727037906647,
        0.016822997480630875,
        0.06651172041893005,
        0.08148183673620224,
        0.023097772151231766,
        0.076711505651474,
        -0.05103422328829765,
        0.04366827383637428,
        -0.019695743918418884,
        -0.08126922696828842,
        -0.0480075478553772,
        0.08319519460201263
    ]
}