{
    "id": "1vJoXQP9sS0",
    "title": "I bought Japanese MYSTERY TECH",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2023-07-25T15:01:48Z",
    "video_url": "https://www.youtube.com/watch?v=1vJoXQP9sS0",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "japan",
        "sendico",
        "console",
        "game console",
        "psx",
        "sony psx",
        "playstation",
        "casio",
        "loopy",
        "casio loopy",
        "wonderswan",
        "wonder swan",
        "game boy",
        "game boy light",
        "nintendo",
        "austin",
        "austin evans"
    ],
    "views": 877653,
    "likes": 23137,
    "comments_count": 530,
    "description": "on @thisis   on @Denki   Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   Chapter Titles: 0:00 What's Sendico? 0:34 Ordering Japanese Tech 1:54 Tech Has Arrived! 3:08 Casio Loopy 4:02 Loopy Part 2 5:54 Pokemon Cards (obviously) 7:17 Nintendo DS Lite 9:12 Sega Game Gear 11:05 Game Boy Light 13:33 How Did This Get Here? 14:00 WonderSwan Color 15:50 Sony PSX",
    "description_links": [
        "https://youtu.be/WtQs7R3hbsg",
        "https://youtu.be/5Gk99B_M6r8",
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- You've seen Wishtery Tech, you've seen Mystery Tech, you've even seen Temu Tech, but today, we're buying tech from Japan. And no, no, not just any Japanese tech, we're using Sendico. Sendico is a fast, reliable, and easy to use auction and shopping proxy service. Herein, you can buy products from most popular Japanese online stores and Japan auctions. Theoretically, we could deposit some money in Sendico, they will then bid on my behalf based on whatever my sort of maximum price is, and then if I win it, it all goes to the Sendico Warehouse. They package up all my items, and then I get one neat little box, which hopefully, won't be incredibly expensive to ship. What do I want today? I want a Game Boy Light. I'm gonna start with a Game Boy Light. Now to be fair, a lot of items that I'm looking for today, could be purchased on eBay, right? And there's plenty of Japanese sellers that do ship on eBay. The problem is that, first of all, you're paying shipping for each and every individual thing. And second of all, from my limited experience, items tend to be a little bit cheaper domestically, in Japan versus the international market, because on eBay, every single Game Boy Light's gonna be compared, whereas, if I go on like, say, Yahoo! Auctions or something, odds are, hopefully, I can get something that's a little bit cheaper. Oh, here we go. So, good condition Nintendo Game Boy Light. Now, if you're not familiar, the Game Boy Light was a rare-ish Japanese-only Game Boy. This was essentially based on the Game Boy Pocket. It came out right around the same time, as the Game Boy Color, and the real advantage here, we would have a very dim, but technically, lit screen. I want a Game Boy Light in my life. I'm just gonna look up Pokemon cards, and see maybe we get like a lot or something. What the? Next-Generation World Hobby Fair. I have never seen this card in my life. $14? I'm not an emotional kind of person, but I might cry. You should subscribe and ring-a-ling the ding-a-ling button. Every subscription is one tear. Wait, no, that's the opposite. Wait, wait, wait, no. Every one of you who'd, don't hit the subscribe button, I cry that I missed an opportunity. There we go, that makes a little bit more logical sense. All right, I'm about to go hard. I'm about to go. (Austin clapping) And so my friends, our package has arrived. So this whole process took about three weeks, although, it could have been a little bit faster, so it was slowly slowed down by some of the auctions, I had, had like five or six days left. That being said, once they actually shipped it out, I had to pay a lot of money via DHL to get it here. - [Matt] How much was a lot of money? - We'll talk about that later. Very well packed. Oh, we got a bunch of stuff. - [Matt] I see a Pokemon card. - Here's the thing. - [Ken] Wait, so, just one? - I think might be a couple more. Ooh... Wait, I can actually get this outta the top loader. - [Ken] Okay, great. - [Matt] He's gonna dissolve and degrade the card. - [Ken] As soon as oxygen hits this. - [Austin] That's not the way it works! - [Matt] I've seen \"The Mummy.\" - I'd say this is probably like light played, but for a neato little card, that I've quite literally never seen in like eBay or a card shop or anything. That's really neat. So one of the nice things about Sendico is that, you get all these items and what basically what happens is, is that when items show up to the Sendico warehouse, they unpack them and they kind of like set them off, to the side and they nicely repack them. So you don't have like a bunch of small boxes inside. They actually do this nice and neatly here, and I dunno how much they do, but supposedly they do at least somewhat inspect the items to make sure that it's what it was supposed to be. So you don't get like scammed. I don't actually know how much they do that for, but everything so far has been nice. Oh, okay. So these are our Casio Loopy games. Look, see we've got- - [Matt] Your chest just been blinking red, for the past 15 minutes. - Let me know the in the comments below, If you like the POV cam. Don't you like to see my hands from both sides? - [Matt] Ha ha, we bullied him into taking it off! - Not nice guys. I'm going into this completely blind. I have no idea what the Loopy is at all, but I will tell you that we got ourselves... - [Matt] Is that a tape deck? - It's like a label maker built in. - [Matt] What? - [Ken] Oh, let's go. - What is a Loopy? So we're gonna start out with PC collection. Let's see if this actually wants to work. - [Matt] Ooh, listen to that baby purr. - Oh wait, AV NTSC. One moment please. While we fast forward three weeks, and order a Japanese compatible television, to demo the Loopy with. Oh, hello, welcome back. Now that we have a PAL to NTSC converter, why don't we try the Loopy again? - [Ken] Is there like a game? - How strange. No, it... - [Ken] Ah, classic. - I mean... Oh, oh, oh, it worked it did it! I had to blow the cartridge. (laughs) Art, music, angel, a creepy cat, whatever that is. Let's do paint. - [Ken] Oh, it's the thing you don't say anyone. - Do I wanna be a mouse, a girl or an elephant? I'll be a mouse. Okay, so wait, I'm very confused. All right, did I just do the thing? - [Ken] Yo! - Okay, we did it. Now I'm going to cut it and reveal. Oh, look how cute that is! - [Ken] Oh, it worked! - [Austin] I mean it's really, really small, but look how cute that is. Awww. All right, well I know who this is getting. This goes right on Robo T Raptor - [Ken] On his thigh? - Yeah, where do you, I mean, yeah, of course. So for $65, this was very cheap. Wait, let's pick one more. What do we think is cool? - [Joanna] Dress. - Dress? This one, look at the style. - [Ken] You just make you, and then print yourself out. - I will do that. What are we gonna put Mega Austin on? - [Ken] The back of the TV. - Okay, it'd be a really funny gag, in like two to three minutes, don't worry. Now, wait, wait, wait, I'm not done, I'm not done. Hold on. - This is like if you told Midjourney to render a human, and it hallucinated somewhere in the middle. - May I present to you Austin 2.0 comprising of 16 expertly printed stickers from the Casio Loopy. I will be taking no further questions, on why I'm a thick boy, with a half an extra leg and three eyes. And of course I can't order stuff from Japan, without getting the most important item of all. - [Ken] Drugs? - That's not the place to get those. Ken, you should know this. Pokemon cards, the next best thing. This my friends, is the Pokemon 151 set, which is the original 151 Pokemon. All in a nice, neat set. I'm very excited because this is actually not out in English yet. So this is gonna be coming out later this year, but we have not one but two boxes, of 151 mostly because one of these is... One of these, we're just gonna keep down here. Don't mind that one. - [Ken] Are you taking company property? - No, no, what are you- No, see, the card's right here? There's just one in the box. - [Ken] You are so lucky you own the company. - This is true. This set retails for roughly 40 US dollars. However, we paid significantly more, than that and on the resale market right now, these boxes are going for some truly spectacular prices. Gang, would you like to come over and open cards with me? All right, let's stack up the good hits, and the bad hits side by side. I don't know if we pulled our value out of this box, but I will say the fun of opening the first 151, and like there's so many cool hits. You look for the Master Ball and stuff, man. I think it's time to do another Sendico, right? - [Ken] Oh, I thought you were gonna say, let's open the other box. - No, no, we're not doing that. I'll be honest, a big reason why I wanted to do this video, is that Japan is absolutely overflowing with DS's, and Game Boys and a lot of them are surprisingly cheap. For $27 this DS Lite, oh, I can immediately tell you, that's in good shape. So to go along with this, even though this, as a DS is region free, so that means you can put in pretty much any game. We got actually a couple of options here. We've got, oh, what is it called? It's not \"Brain Age.\" They called it like brain training or something. I actually don't know what it's called in Japanese, but this is basically \"Brain Age,\" and we also got another one. Wait, what? Wait, are you trying to tell me that I got two copies, of Brain Age and the DS for $27? (cackles) Nice. Uh-oh, I'll be right back. I wanna go find a DS that I know works, and we're gonna get to the bottom of this one moment, please. - See, what would happen if I just did it? Just gonna... - Are you blowing it again? Oh my god, Ken blew it and it fixed it. - And I also hit it like you're supposed to. - So I'm gonna try a flash cart to see if this works first. Boom, look at that. So we've got all the ROM, I mean the games, you know, of course that... - [Ken] That you own legally? - Actually I do. Amazingly enough, Ken is correct, that the DS actually does work. The only real bad thing you can say short of that slightly scuffed slot, which I guess is, just probably slightly dirty considering it works fine is that the screen, both screens are a little bit used, but definitely the bottom one is a little yellow. That being said though, it's not unusable, and considering the fact that we got the DS, in I would say good condition, and a couple of excellent boxed Japanese games, for 27 bucks, that's pretty good. That's pretty good. Next step, we have the Game Gear! Now there were other versions of sort of Game Boy competitors back in the day. There was the Atari Lynx, there was the Sega Nomad which is basically just a Genesis, that was in a portable form factor. But in my opinion, the Game Gear was one of, if not really the best competition to the Game Boy, much more powerful, color LCD display. The downside was it was huge, and it lasted like no time on a ton of batteries. - [Ken] Oh whoa. - Oh it matches my shirt! This thing is dope and it does come with a game, which I believe is Sonic Two? Yes, \"Sonic and Tails.\" It's not in perfect condition. Of course not, but this is so decent. Like very, very solid, especially considering, that this is basically 30 years old at this point? That's one of the main advantages of getting stuff, from Japan because you can get a Game Gear here. I don't think they ever sold the yellow Game Gear, in the United States, but the difference is, is that Japanese stuff typically has quite nice quality. So we've got ourselves a D-pad which does not feel great, but I think that's just the way it was designed. All right, shall we play the Game Gear? Oh my God, that screen's bad. (laughs) Wow, so here's a reminder that early LCDs were bad, or at least the game has not crashed, but hang on, I need to actually turn that brightness down. So this is like full brightness, and the brightness is actually okay, but the problem is that it completely wrecks your contrast. So I definitely need to bring that down some. - [Ken] It looks fast. - Oh yeah, the game runs fine. The screen is ghosting like a ghosty ghost. For $110, not only do we have the yellow Game Gear, but also a copy of the game. Is that a good deal? I think it's a pretty decent deal, especially because I have never seen a yellow Game Gear. Now, if you're a Game Gear aficionado, and you wanna let me know, in the comments that this was a common color, and that I'm a moron for thinking that 99% of them are black, feel free to let me know. But this is neat. So of course I can't go on a Japanese website, and order weird, neat Japanese tech without getting myself the good old reliable, a Game Boy, but not just any Game Boy. Oh no, not only is it yellow, 'cause of course it is. This is a very cool Game Boy. This is a Game Boy Light. I will say I actually used to own a gold Game Boy Light, that I sadly no longer have. I did a video on it, if you wanna see an old school, Austin video. - [Ken] Oh, the one that got lost in the fire? - Yeah. So I purchased this for $141. I'm gonna be honest, I'm still used to seeing Game Boys, like modified with like, you know, aftermarket shells and stuff. I'm not 1000% sure that this is actually a real color, that you could buy. I've certainly never seen it before. - It is a limited edition, Toys R Us version of it. - [Austin] Toys R Us Japan? - [Ken] Toys R Us Japan. - Jeffrey, was cheating on me in Japan? - This is 340 bucks on eBay. Some without games are anywhere between 250 to 300. on varying conditions, but they're all being imported from Japan by eBay sellers. - So, basically what you're saying is people are going on Sendico buying Japanese tech for cheap, maybe giving a little bit of TLC, and flipping it for morons, on eBay for double the price? I mean flipping it is a smart idea. And if you like my Game Boy, you can visit my eBay. No you can't, I'm keeping this. So this is a game that actually came with it. Now it's got that sort of weird taller cartridge, which it's got the little GB kiss thing on the top, if I know what I'm talking about. And I vaguely do, I believe this is IR. So you actually get to use a couple of games, to wirelessly communicate, much like how there was an IR sensor, on the top of the Game Boy Color, which was built in a little bit later. Okay, well, so the game is not recognized. That's fine. It has been a hundred percent success rate so far. So let's just do it. I can't believe you're never supposed to really spit, or do that, but whatever, let's try again. Yep, it worked (laughs) - Nice! - You can easily assume, that it's just a Game Boy pocket, right? It's very similar. This is only able to play original Game Boys. So not Game Boy Color or Advance. So it's a little too bright in here. Can we go ahead and kill the lights please? It is incredibly dim, but you can actually use this in the dark. Is it good? I don't think so. I'm so happy I haven't had a Game Boy Light, in like almost 10 years, so. What should we do next? What's this? Oh. - [Ken] Pokemon cards? - What? No. - [Ken] It kind of smells like, like Tide because I think someone's doing laundry, with the money in this company. - Are you trying to insinuate that I am... - [Ken] You are using the, you embezzle the company money to furnish your- - No, no, no- - [Ken] Pokemon card collection? - No, no, no, no, no, no, no, no, no, no. - [FBI] FBI, open up! - This is a Final Fantasy WonderSwan still in the box. Now if you just heard the words Final Fantasy, and WonderSwan and go, \"is that like the new Final Fantasy?\" - [Ken] That actually does sound like a Final Fantasy name. - Final Fantasy WonderSwan. I would probably play that. This was actually made by Gunkoi Yopai. - What did he say? - I think that's how you say his name? Basically the original inventor of the Game Boy. After he made the Game Boy, he left Nintendo, went over to Bandai, and created his own ideal console, which was the Wonder Swan. Oh, okay. So maybe a little yellowed on the bot- Okay, so maybe not mint. Now I'm starting to see why this was 86 bucks. But the front looks pretty decent, and I am so surprised at how tiny this is. Oh my God, look at the game. That is so cool. You got the art on the back, look at that. That is so cool. It's really interesting to look at this display, because it is an LCD from I guess 2000 or so. And when you have the light on it, it's very, very viewable. But watch that move it even just a little bit off axis. Look, it just, it's gone, right? Like the view angles are so narrow. I would actually say this is probably maybe, a little harder to see, like a Game Boy Advance screen, but not by a lot. Uh-oh, we found dudes. I don't know what I'm doing. This is neat. I will admit I don't have an enormous amount, of nostalgia for \"Final Fantasy.\" I didn't really play it as a kid, but it is incredibly cool to see a piece of history like this preserved so well for so cheap. Again, $86, and this console, it is crazy, that we never got this in the US 'cause it's so nice to use. Yeah, do I wish I had a back lit screen? Absolutely, but it's comfy. The button layout, the dual sort of D-pads actually aren't that bad. Like I am legitimately impressed. This is really nice. Oh, hello there. The TV is back because to finish this video off, we have one of the most ridiculous consoles, to ever come out of Japan. I'm just gonna show you, I'm just gonna show you. Behold the PlayStation that we never got. This is the PSX. What, you might ask, is the PSX? Oh, have I got a story for you. Actually, I don't. I've never used a PSX, so I only know a little bit about it. This, if you're not familiar, is actually a PlayStation 2, but not just any PS2. Oh no, this is a PS2 that also doubled as essentially a DVR? I think would be the best way to describe it. So this is only sold in Japan. It has a hard drive built in. It does have a slot loading disc drive, which I will say this one actually looks pretty rough 'cause all the foam is kind of falling apart. We've got quit game, we've got power, eject. - [Ken] Oh, you're not done with the front my friend. - Where'd I miss the front? (gasps) (Austin laughs) Oh, memory card slots. Of course, we've also got all your directional buttons, for the interface we've got. Is that FireWire? - [Ken] Yeah, buddy. (laughs) - [Austin] Wow, there is a veritable cornucopia, of ports on the back of this thing. So you've got your two game controller slots, which yes, you plug into the back of the PSX. So this came out in 2005, for the price of almost 900 US dollars, which is outrageous. Now keep in mind that this is one of the last models of the PSX, which is why it has some of the additional ports. But we paid a mere 170 bucks for it, which to be fair is still a lot of money. But for such a weird novelty, we again, got pretty much the cheapest PSX, that we could find from Japan. So it is missing everything. It doesn't have the original controller, which had a longer cable, 'cause you had to plug it in the back. It didn't have the remote, it didn't have anything. It also very well might not work without that adapter. So a lot of questions. (crickets chirp) - Oh, I got it! - [Ken] Oh! - I fixed it, I'm a genius! Now this probably looks, like a very familiar interface because it is. This was what they ran on the PS3, for many years, on the PSP, in my opinion, still my favorite Sony menu system they ever had. But they actually got it started, all the way back on the PSX. They've got music on here, MP3's on my PS2. (upbeat music) - [Ken] Oh, let's go. - This is the way I feel when I use my PSX and it works. - [Ken] You could burn DVDs, from like the shows that you recorded. - Wait, wait, wait. Okay, so I'm just wrapping my head around this. So I could hook up, say my cable box or my camcorder, burn my recordings to the hard drive, and then put a DVD in here and then make DVDs out of it. That's so wild. The PS3 was never able to burn discs. All that being said, that's really the cool part, but it is still a full PS2. I believe that this was region locked, which is why we've got \"Auto Modellista.\" - [Ken] Yes! - Ken basically told me that I had to get this game. - Yeah, man, it's one of the greatest racing games of all time. Don't you know? - Well, I know that this game must be popular, because it was plentiful and dirt cheap. I believe this cost me like eight bucks, including Sendico's fee. I think it was like 500 yen. Obviously there's a lot of thoughts, when it comes to ordering from Sendico. The big one is you need to, to make it worth it, spend some good money, right? Because you've gotta consider that every item you buy, you have to pay the 500 yen processing fee. And most importantly, you've gotta spend a good chunk of money shipping your items. So if you're gonna buy stuff from Sendico, it makes sense to get a lot. And I'll tell you that this PSX is massively heavy. I wouldn't be surprised if this PSX just by weight, alone was probably like 80 bucks of our shipping costs. Give a try, I'm gonna put this in. We're gonna do it all aesthetic. Everyone ready? Okay, okay. You know, that was, I thought that was gonna look a little cooler, I'll be honest with you. Let's try it one more time. There we go! Just need a little bit of encouragement. You know, we all do sometimes in life. Let's see if the disc drive actually wants to work. (PSX rattling) Uh-oh, we've angered it. So yes, our PSX needs a little bit of TLC, but this is still really fun, to get all this Japanese mystery tech. Now, the shipping was expensive. Our entire box ended up costing $184. Mind you, if we were okay waiting, a few weeks instead of a few days, we could have saved a little bit of money on that. But especially when you get these big heavy items, it just costs money. That being said, it was still a whole lot cheaper, than buying this stuff locally on eBay. And I gotta say, stay tuned because this is not the last time we're buying Japanese mystery tech.",
    "transcript_keywords": [
        "Game Boy Light",
        "Game Boy",
        "Game",
        "Game Boy Color",
        "Boy Light",
        "Game Gear",
        "Boy",
        "Game Boys",
        "Game Boy Pocket",
        "Japaneseonly Game Boy",
        "yellow Game Gear",
        "Nintendo Game Boy",
        "Game Boy Advance",
        "cool Game Boy",
        "original Game Boys",
        "Japan",
        "single Game Boy",
        "Japanese",
        "Light",
        "games"
    ],
    "transcript_entity_values": [
        "Ken] Ah",
        "the Sendico Warehouse",
        "Sendico",
        "Ken] Wait",
        "the Game Gear",
        "65",
        "500 yen",
        "Final Fantasy WonderSwan",
        "Tide",
        "first",
        "eight bucks",
        "Game Boys",
        "Final Fantasy",
        "Temu Tech",
        "86",
        "two",
        "151",
        "Matt",
        "three weeks",
        "340 bucks",
        "Japan",
        "one",
        "the past 15 minutes",
        "a ton",
        "Sendico",
        "Auto Modellista",
        "30 years old",
        "English",
        "many years",
        "a Game Gear",
        "PSX",
        "Robo T Raptor",
        "141",
        "2005",
        "between 250 to 300",
        "a half",
        "a few days",
        "FireWire",
        "NTSC",
        "TLC",
        "Midjourney",
        "184",
        "DHL",
        "PlayStation",
        "the United States",
        "the day",
        "Ken",
        "Sonic and Tails",
        "Gunkoi Yopai",
        "Austin",
        "a few weeks",
        "27 bucks",
        "Game Boy Light",
        "99%",
        "1000%",
        "two to three minutes",
        "Wishtery Tech",
        "AV NTSC",
        "PSP",
        "86 bucks",
        "Gang",
        "IR",
        "16",
        "Genesis",
        "Bandai",
        "27",
        "14",
        "the Game Boy Color",
        "US",
        "80 bucks",
        "PlayStation 2",
        "today",
        "110",
        "PSX",
        "2000",
        "Next-Generation World Hobby Fair",
        "Casio",
        "the Sega Nomad",
        "Final Fantasy",
        "almost 900 US dollars",
        "Loopy",
        "DVR",
        "Game Boy Light's gon",
        "Sony",
        "LCD",
        "Pokemon",
        "the Game Boy",
        "Sonic Two",
        "Swan",
        "later this year",
        "eBay",
        "Ball",
        "FBI",
        "Joanna] Dress",
        "One",
        "Mystery Tech",
        "the Atari Lynx",
        "Ken] Yo",
        "almost 10 years",
        "WonderSwan",
        "three",
        "170 bucks",
        "GB",
        "Nintendo",
        "the Game Gear!",
        "Pokemon",
        "Mega Austin",
        "second",
        "Ken] Pokemon",
        "PS3",
        "a hundred percent",
        "Yahoo",
        "Loopy",
        "Japanese",
        "five or six days",
        "The Mummy",
        "roughly 40 US dollars",
        "about three weeks",
        "Game Boy"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "NORP",
        "PERSON",
        "WORK_OF_ART",
        "MONEY",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "MONEY",
        "GPE",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "LANGUAGE",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "MONEY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "PRODUCT",
        "GPE",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "DATE",
        "MONEY",
        "WORK_OF_ART",
        "PERCENT",
        "PERCENT",
        "TIME",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "WORK_OF_ART",
        "GPE",
        "MONEY",
        "PRODUCT",
        "DATE",
        "MONEY",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "MONEY",
        "NORP",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "GPE",
        "ORG",
        "EVENT",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PERCENT",
        "ORG",
        "PERSON",
        "NORP",
        "DATE",
        "WORK_OF_ART",
        "MONEY",
        "DATE",
        "WORK_OF_ART"
    ],
    "vector": [
        -0.12095796316862106,
        0.008081984706223011,
        0.03741312772035599,
        -0.04246014356613159,
        -0.026906944811344147,
        -0.0688701793551445,
        0.1422600895166397,
        0.0524803064763546,
        -0.0034755440428853035,
        0.006052797194570303,
        0.0274954866617918,
        -0.02111213095486164,
        0.05074905604124069,
        0.06723980605602264,
        0.05209394544363022,
        0.0011636861599981785,
        0.0651126429438591,
        -0.04343728721141815,
        -0.02000293880701065,
        -0.05244586616754532,
        0.029975667595863342,
        -0.0930560827255249,
        -0.013012174516916275,
        -0.02299155667424202,
        -0.0004390605608932674,
        -0.05026525259017944,
        -0.01865535043179989,
        0.010546248406171799,
        -0.07444629073143005,
        -0.017799872905015945,
        -0.12649647891521454,
        0.08482015132904053,
        -0.04373018816113472,
        0.005719061940908432,
        0.02242451347410679,
        -0.05003273859620094,
        -0.06682315468788147,
        -0.08105979859828949,
        -0.03291279077529907,
        -0.05996977910399437,
        -0.06054394692182541,
        -0.02794915810227394,
        -0.04663597792387009,
        0.04309775307774544,
        -0.014344526454806328,
        0.016943596303462982,
        0.07785072922706604,
        0.03687583655118942,
        0.02981550060212612,
        0.006178816314786673,
        -0.06620075553655624,
        -0.012800387106835842,
        0.0772373378276825,
        0.04483051598072052,
        -0.03203854337334633,
        -0.02790430746972561,
        0.04311932995915413,
        0.007977908477187157,
        0.08087658137083054,
        0.0002829398727044463,
        0.05404011532664299,
        -0.09392812103033066,
        -0.020987048745155334,
        -0.013765072450041771,
        -0.002447877312079072,
        -0.055001042783260345,
        -0.11757977306842804,
        0.09968290477991104,
        -0.02759714052081108,
        -0.07359371334314346,
        0.10622962564229965,
        0.0029971206095069647,
        0.030868293717503548,
        0.072245754301548,
        0.009192491881549358,
        0.05102267488837242,
        0.09735061228275299,
        -0.06131915748119354,
        -0.03279842063784599,
        0.04995311424136162,
        -0.04886781796813011,
        -0.04672541096806526,
        -0.05623317137360573,
        -0.07488461583852768,
        0.06327817589044571,
        0.008922344073653221,
        0.025616316124796867,
        0.033360738307237625,
        0.06076133996248245,
        0.04181428626179695,
        0.018459457904100418,
        0.0643356516957283,
        -0.013243449851870537,
        0.00403331033885479,
        0.06478159129619598,
        0.016709430143237114,
        0.004729906562715769,
        0.015819355845451355,
        -0.045946404337882996,
        0.04679539054632187,
        0.070962093770504,
        0.026351958513259888,
        0.0628804937005043,
        -0.012878851033747196,
        0.03761237859725952,
        -0.04789523407816887,
        -0.06220963969826698,
        -0.009701280854642391,
        0.06905756890773773,
        0.048130739480257034,
        -0.12556011974811554,
        -0.01063601765781641,
        -0.018917087465524673,
        0.02327265776693821,
        -0.0795648843050003,
        0.08609696477651596,
        -0.0624338798224926,
        0.08899489045143127,
        0.00204735086299479,
        -0.06136538088321686,
        0.07263343781232834,
        0.010370268486440182,
        -0.05368304252624512,
        -0.0820845514535904,
        -0.0037059520836919546,
        0.03175771236419678,
        -0.031614940613508224,
        8.260915854782216e-33,
        0.0008852743194438517,
        0.07541754096746445,
        -0.03480518236756325,
        -0.003577732713893056,
        -0.0583108514547348,
        -0.006989645306020975,
        0.03737892210483551,
        0.08948609977960587,
        -0.09831153601408005,
        0.021283529698848724,
        -0.15302017331123352,
        0.08071485161781311,
        -0.03275623172521591,
        0.07803008705377579,
        0.026349404826760292,
        -0.002292528748512268,
        -0.041861578822135925,
        -0.024528497830033302,
        0.10838416963815689,
        0.05469370633363724,
        0.07902928441762924,
        -0.005996978376060724,
        -0.011971691623330116,
        -0.04189107567071915,
        -0.032732728868722916,
        0.008129014633595943,
        -0.07633019983768463,
        -0.06071484088897705,
        0.07776890695095062,
        0.06951402127742767,
        -0.06319142878055573,
        -0.031026605516672134,
        0.0524725615978241,
        0.04246509075164795,
        -0.055196382105350494,
        -0.04265635833144188,
        0.001838124473579228,
        -0.10263814777135849,
        0.026300689205527306,
        0.03353267163038254,
        -0.02436291240155697,
        0.03759453073143959,
        -0.0824495330452919,
        0.04995139688253403,
        -0.04919155314564705,
        0.018009280785918236,
        0.04317525029182434,
        -0.05773257464170456,
        0.0009026136831380427,
        0.0813007578253746,
        -0.10445085167884827,
        -0.029614919796586037,
        0.008930044248700142,
        -0.048720814287662506,
        0.01624273508787155,
        -0.10425321012735367,
        0.035350900143384933,
        -0.01956338621675968,
        -0.006234714761376381,
        0.0045476555824279785,
        0.01576710306107998,
        -0.02596689946949482,
        0.059362705796957016,
        0.02472378872334957,
        -0.07254727929830551,
        0.051623255014419556,
        0.07855013012886047,
        -0.008183766156435013,
        -0.001217669458128512,
        0.004309982527047396,
        -0.022349514067173004,
        0.02158292755484581,
        0.020681265741586685,
        -0.05848417803645134,
        0.031359076499938965,
        -0.032679297029972076,
        0.021398669108748436,
        0.07487479597330093,
        0.028545482084155083,
        -0.056151892989873886,
        -0.03444094583392143,
        -0.03863304853439331,
        -0.020716290920972824,
        0.08931633830070496,
        -0.009461360052227974,
        0.09266269207000732,
        0.03303211182355881,
        0.0011689037783071399,
        -0.019544364884495735,
        -0.026528719812631607,
        -0.02878047339618206,
        -0.010973714292049408,
        -0.012150746770203114,
        0.04836275428533554,
        0.021783897653222084,
        -7.639260075453665e-33,
        -0.023963144049048424,
        -0.07801107317209244,
        -0.00969612505286932,
        0.007509056478738785,
        0.002886509522795677,
        -0.05843787267804146,
        -0.02654716931283474,
        -0.003564605489373207,
        0.05646580085158348,
        0.013360853306949139,
        -0.025523317977786064,
        -0.010409620590507984,
        0.025816677138209343,
        -0.034561239182949066,
        -0.02659478783607483,
        -0.04174737632274628,
        0.04251030087471008,
        -0.022181997075676918,
        0.0003975159488618374,
        -0.044398047029972076,
        -0.015051547437906265,
        0.02934052236378193,
        -0.06673143059015274,
        0.00786664243787527,
        -0.03916791453957558,
        0.04538698494434357,
        0.006432209629565477,
        -0.018865248188376427,
        0.0027840021066367626,
        0.05074841156601906,
        0.039356622844934464,
        -0.06329905986785889,
        -0.02919900231063366,
        0.08815547078847885,
        -0.010541717521846294,
        0.0038510120939463377,
        0.04148325324058533,
        0.018997332081198692,
        0.11433298885822296,
        0.027133148163557053,
        0.03262997418642044,
        -0.027505172416567802,
        0.020625324919819832,
        0.07301405817270279,
        -0.09782731533050537,
        -0.06230194494128227,
        -0.05149263143539429,
        -0.006036264356225729,
        0.09346500039100647,
        -0.0260123610496521,
        0.08008509129285812,
        0.03626145422458649,
        -0.007181098684668541,
        -0.03315924480557442,
        -0.15115031599998474,
        0.022945962846279144,
        -0.023998284712433815,
        0.010426823049783707,
        -0.06443310528993607,
        0.049426622688770294,
        0.02435748651623726,
        -0.018712909892201424,
        0.020645705983042717,
        0.04428641498088837,
        -0.048513803631067276,
        0.06039050966501236,
        0.12961961328983307,
        0.03346196934580803,
        -0.0031185776460915804,
        -0.051579881459474564,
        -0.014246887527406216,
        -0.0024753636680543423,
        0.005737042985856533,
        -0.07121080905199051,
        0.021958177909255028,
        0.061299216002225876,
        -0.043669577687978745,
        0.014305994845926762,
        0.05461081117391586,
        -0.03689923509955406,
        -0.012999173253774643,
        0.07697686553001404,
        0.061289288103580475,
        -0.01629420928657055,
        0.041681919246912,
        -0.012173122726380825,
        -0.0665942057967186,
        -0.009969327598810196,
        0.0294408667832613,
        -0.080026775598526,
        0.0071249669417738914,
        0.02240392565727234,
        0.01775023527443409,
        0.010619756765663624,
        -0.026635605841875076,
        -5.8831254534652544e-08,
        0.046890996396541595,
        -0.06613413244485855,
        0.0406663753092289,
        0.09293442219495773,
        -0.023285672068595886,
        0.04075289145112038,
        0.01707027107477188,
        0.09026151150465012,
        0.02131611295044422,
        0.021908245980739594,
        0.02361910417675972,
        0.00512298010289669,
        -0.10124380141496658,
        -0.01304132305085659,
        0.008022145368158817,
        -0.025580352172255516,
        -0.007172214798629284,
        0.006722880527377129,
        -0.042757611721754074,
        -0.019131936132907867,
        -0.008752771653234959,
        0.011377726681530476,
        0.08358120918273926,
        -0.08934157341718674,
        -0.035365860909223557,
        0.05988900735974312,
        -0.012895281426608562,
        0.009702703915536404,
        0.05557558685541153,
        0.006464082282036543,
        -0.03370086848735809,
        -0.08706838637590408,
        -0.04318573325872421,
        0.05366939306259155,
        -0.010073922574520111,
        -0.039414118975400925,
        -0.048470206558704376,
        -0.06597153097391129,
        -0.10355183482170105,
        -0.013102319091558456,
        0.02622770331799984,
        -0.11652106791734695,
        -0.0671607032418251,
        0.0059736743569374084,
        0.007510703522711992,
        -0.005592342000454664,
        -0.07226689159870148,
        -0.04510173201560974,
        0.10073921829462051,
        0.03461438789963722,
        -0.007710997946560383,
        -0.029408389702439308,
        0.016055412590503693,
        0.02329248934984207,
        0.033174727112054825,
        0.019618619233369827,
        0.008586568757891655,
        -0.0190933458507061,
        0.029214417561888695,
        0.0792924016714096,
        0.010736226104199886,
        -0.07211645692586899,
        -0.047177962958812714,
        0.034419748932123184
    ]
}