{
    "id": "1VXRw5kDGQc",
    "title": "I WISH you could buy this at MSRP - AORUS Radeon RX 6800 XT Master Type C",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-03-02T22:00:12Z",
    "video_url": "https://www.youtube.com/watch?v=1VXRw5kDGQc",
    "category": "Science & Technology",
    "tags": [
        "AMD",
        "Radeon",
        "Aorus",
        "Gigabyte",
        "6800",
        "6800 XT",
        "Video Card",
        "Graphics Card",
        "Gaming",
        "PC",
        "Game",
        "MSRP"
    ],
    "views": 485042,
    "likes": 25629,
    "comments_count": 1478,
    "description": "Big thanks to AORUS for sponsoring this video! Check out the AORUS Radeon RX 6800 XT Master Type C, as well as their motherboards on Amazon and Newegg.  Buy AORUS AMD Graphics Cards: On Newegg:  On Amazon:  On BestBuy:   Buy AORUS AMD Motherboards: On Newegg:  On Amazon:  On BestBuy:   Inventory on video cards is tough to come by, but hey, at least we're getting some big performance boosts this year. Hopefully, you can get your hands on this soon at MSRP!  Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/i81Eg",
        "https://geni.us/BSIz",
        "https://geni.us/EGQEC",
        "https://geni.us/wpwT",
        "https://geni.us/P3eHHe",
        "https://geni.us/IPFiz",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- It's probably fine. Don't worry about it! We're complete professionals around here. At this point you must think I'm some kind of AMD fanboy. Here I am looking at the RX 6800 XT again. This time it's an Aorus Master and they actually sponsored this ShortCircuit just so we can take a look at their unique cooling design and all the other things that make this particular card special. So clearly the key features of this card are exactly the same as a reference or, sorry... Yeah, they're reference, aren't they? They're not called anything special. Yeah, the reference-designed 6800 series. But if we we look at the rest of the box here, we've got MAX-Covered Cooling, which is 2 x 115-millimeter fans and 1 x 100-millimeter unique-shaped blade stack fans. With Wind Claw design. Wind Claw. (Anthony laughs) - [David] It's like a cat pawing at the wind. (both laugh) - The Wind Claw apparently reinforces and channels the airflow to completely cover the heat sink. And of course we've got RGB Fusion to- - [Siri] I didn't get that. Could you try again? - Yes, in fact, I can try again. I'm putting you in theater mode. And of course we've got RGB Fusion 2.0, which is Gigabyte's addressable RGB. And, ooh, what's this? LCD Edge View. Enthusiast mode. Chibi Time mode. (laughs) Okay. Custom GIF mode and Custom Text mode. So this has got a display on the side. All right, let's get this opened and see what's actually on the card and not, you know, whatever they say is on the box. All right. First thing is this little package here. Wonder what's in this. \"You can enjoy a four-year warranty by registering on the website within 30 days of purchase.\" It's also kind of adorable that there's broken English on here too, like down here in the corner. \"Get extend warranty and manage warranty period. Service status more conveniently.\" Okay. Yeah. What's this? Aw, it's a little metal... Is it metal? Yeah, it looks like... Feels like a little sheet of metal. Case badge. Let's get to peelin' here. Ooh. Where does the plastic begin and where does it end? Wow, it tucks under. There we go. Wah. Hmm. I mean, the shroud is plastic, but it looks quite nice. It's got this brushed feel to it, so it doesn't feel tacky. It's quite a... Well, it's chunky. This is a three-slot card. But it looks pretty nice. It's got a lotta weight to it as well. And there's a little bit of... There we go. The pitch of the heat sink fins is actually quite large. There's a lot of space for air to flow, which is actually quite good. Presumably that's what the extended heat sink is for, so they can space that out a little bit more but still have the surface are required to dissipate all the heat that's coming off of this thing. Speaking of which, these fans. Interesting. Aw, there's more peels. Gotta peel 'em. There were two of these on that middle fan. I think. No, these are stuck to me. They just won't... They won't leave. These fans on the outside here are flanking this middle fan. They're actually a little bit above where that fan sits in vertical space. So this fan in here seems to be the one with their, um, their Wing Claw design. It's kinda got like, I don't know, fingers on the tips of the fan blades. I guess the design is supposed to be kind of like a scoop to pull the air that these fans are kinda pulling in, like that, to kinda grab that and push it through. So according to Aorus, the way this works is that every millimeter of this heat sink's surface area is hit by airflow thanks to these fans. That lets the fans spin a little bit slower and that means that you're not dealing with that super loud whine, like when you're in the middle of a game or even if you just start up your computer, sometimes they do that. Around the back we've got this nice metal backplate back here. Not sure if it's actually cooling anything or if it's just to provide structural rigidity. This thing is not twisting at all. But we also have a BIOS selector switch. So on the left is BIOS OC, which I think is currently selected. Yup. And on the right is Silent, which I presume would further cap the maximum fan speed. Finally, on this edge of the card we have two 8-pin PCI Express power connectors. Sorry, Nvidia. Nobody cares about your 12-pin connector. And we have this LCD on the side. It's kinda cleverly hidden. The glass or plastic... I'm not sure if that's glass or not. It kinda looks like it. It is very reflective. There's very little to, I guess, delineate the LCD itself from the rest of that little bezel. Especially since it's picking up fingerprints. - [David] I like how you're using the Stealth hoodie and there's a microfiber cloth to your left. - Listen. We don't sell microfiber cloths on LTTStore.com. We do sell Stealth hoodies on LTTStore.com. All right, we're back. We've got a computer. The video card is installed and you can see it has lovely... I think currently red LEDs. There they are, RGB. And that little animation going on on the little LCD, which we change if we go into RGB Fusion 2.0. Oh! Well, I could just look at the screen. Yeah, GPU temperature, GPU usage, GPU clock, fan speed, VRAM usage, VRAM clock, and TGP, the graphics power. Custom image. We'll get to that. Custom text. Yeah, \"Hi, Aorus.\" Let's do, \"Hi, Aorus.\" Is that what it's saying now? - Yep. - Hi, Aorus. - Hi. - All right, let's change it to something different then. - [David] Bye, Aorus. - No, I changed it to something far more interesting, if I'm being completely honest. - [David] Nice! - LTTStore.com. Chibi Time. Yeah, that's... That's this thing. The frame rates are silky-smooth. I don't have the FPS display up right now 'cause I just wanted to stress the card, but it is very nice. I've got no complaints whatsoever here. So every hour you have your computer on it levels up. - Nice! - That's, uh... Uh, that's a thing. I don't know. That's not very environmentally friendly. I would've thought that it would just level up when you're increasing power draw or temperature or something. We're doin' it. Estimated upload time's (gasps) 11 minutes, 9 seconds? - [David] Why? - What? Aw. All I wanted to do was give the people Flossing Linus on a graphics card. So, CPU benchmark, go. Part of how it's managing to keep up this level of performance throughout the entire test here, and we're running it a second time now, is thanks to its entirely unified copper heat plate. So the CPU, or sorry, the GPU, and the memory are all part of one contact plate and it also has two other contact plates for its power phases as well. So it's able to take all of the heat from those heat-generating components, pipe it out through several heat pipes built into the design, and then it goes through the stacked fins that are inside of the cooler itself. And it's doing an excellent job. It's managing to do all of this, we started the benchmark, it spiked up to about 60-65, and now it's at 66-66 towards the end of the benchmark. So it is doing a phenomenal job. (laughs) A lot of warm air is actually being kicked out of the back here. And I think the majority of the noise that you're hearing there is actually from the CPU fan. That sounds like the Noctua cooler to me. In fact, I could very easily figure that out. Let's plug that back in then. - [David] You unplugged the fan? - Yeah. (David laughs) It's probably fine. Don't worry about it! We're complete professionals around here. So that just about does it. Thanks for watching, guys. Check out the Aorus RX 6800 XT Master Type C down below on Amazon and on Newegg, and we'll have those linked. And we also have Gigabyte motherboards down there too. (PSU clicks off) - [David] Off!",
    "transcript_keywords": [
        "Wind Claw",
        "fan",
        "RGB Fusion",
        "Aorus",
        "Yeah",
        "fans",
        "kind",
        "heat",
        "card",
        "RGB",
        "Claw",
        "Wind Claw design",
        "heat sink",
        "nice",
        "Wind",
        "Claw design",
        "time",
        "LCD",
        "GPU",
        "mode"
    ],
    "transcript_entity_values": [
        "Aorus",
        "FPS",
        "David] Bye,",
        "115-millimeter",
        "English",
        "Aorus",
        "30 days",
        "three",
        "8",
        "one",
        "Newegg",
        "Gigabyte",
        "Silent",
        "Amazon",
        "1 x 100-millimeter",
        "every hour",
        "four-year",
        "66-66",
        "second",
        "PSU",
        "Wind Claw",
        "David",
        "about 60-65",
        "RGB Fusion 2.0",
        "Anthony",
        "Noctua",
        "AMD",
        "PCI Express",
        "Nvidia",
        "two",
        "LCD Edge View",
        "Chibi Time",
        "the Aorus RX 6800",
        "RX 6800 XT",
        "Gigabyte",
        "6800",
        "LCD",
        "GPU",
        "XT",
        "RGB",
        "ShortCircuit",
        "12",
        "Linus",
        "CPU",
        "First",
        "2",
        "TGP",
        "11 minutes, 9 seconds",
        "Wind Claw",
        "Wing Claw"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "LANGUAGE",
        "LOC",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "QUANTITY",
        "TIME",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.03342961519956589,
        -0.02570503018796444,
        -0.010491292923688889,
        0.02954963594675064,
        0.08095978200435638,
        0.03779169172048569,
        -0.0541037991642952,
        0.1030103862285614,
        -0.01942448876798153,
        -0.0162944532930851,
        -0.07765799015760422,
        0.030797505751252174,
        -0.03456386923789978,
        -0.022417457774281502,
        0.0016515521565452218,
        0.03861153870820999,
        0.040501780807971954,
        -0.009542187675833702,
        0.030428916215896606,
        0.07938705384731293,
        -0.006376947276294231,
        -0.10509384423494339,
        -0.07896438986063004,
        -0.024090958759188652,
        0.03516919165849686,
        -0.021901799365878105,
        0.06308943033218384,
        -0.06341176480054855,
        0.026102770119905472,
        -0.034115321934223175,
        -0.0030223510693758726,
        -0.014336545020341873,
        0.0262836255133152,
        0.044728267937898636,
        -0.016758540645241737,
        -0.013860550709068775,
        0.07977719604969025,
        -0.09449195116758347,
        -0.04707258939743042,
        -0.08658057451248169,
        0.004124767147004604,
        0.01229727640748024,
        0.05388655886054039,
        0.005658049136400223,
        0.024879300966858864,
        -0.035360634326934814,
        0.04603468254208565,
        -0.03977768495678902,
        -0.014113684184849262,
        0.030864035710692406,
        0.007001631427556276,
        -0.05248842015862465,
        -0.026183152571320534,
        -0.024518508464097977,
        -0.09611069411039352,
        0.022793956100940704,
        -0.05893574655056,
        -0.1487441211938858,
        0.014938990585505962,
        -0.031203120946884155,
        0.04556794464588165,
        -0.09649769961833954,
        0.04250429570674896,
        0.07063274085521698,
        0.007235120981931686,
        0.01035241037607193,
        -0.024765634909272194,
        0.022412432357668877,
        0.005604236852377653,
        -0.026069192215800285,
        -0.045248739421367645,
        0.05419815331697464,
        0.0022485428489744663,
        0.04970451816916466,
        0.021900342777371407,
        0.048729654401540756,
        0.07625612616539001,
        -0.06426363438367844,
        0.08641920983791351,
        0.01366176176816225,
        0.01999201811850071,
        -0.04641197621822357,
        -0.05818901211023331,
        -0.031089797616004944,
        0.06269899010658264,
        -0.047384414821863174,
        0.03806566074490547,
        0.0541020892560482,
        -0.01965131238102913,
        -0.10763651132583618,
        0.039695579558610916,
        0.08885830640792847,
        0.0759541392326355,
        -0.014115951955318451,
        -0.036302704364061356,
        -0.011141606606543064,
        -0.02748016268014908,
        -0.08576320856809616,
        -0.03367302194237709,
        0.06737137585878372,
        0.004237367771565914,
        0.0476217046380043,
        0.04547370225191116,
        0.04526786133646965,
        -0.0731831043958664,
        -0.06499019265174866,
        -0.04408298060297966,
        0.07260311394929886,
        -0.07988356798887253,
        -0.05452209711074829,
        -0.0501222237944603,
        0.055672820657491684,
        -0.04909197986125946,
        -0.00904440600425005,
        -0.02136198617517948,
        0.03874214366078377,
        -0.07408519089221954,
        -0.05353954806923866,
        0.07484491169452667,
        0.002169113839045167,
        -0.04498839005827904,
        -0.07021749019622803,
        -0.010573615320026875,
        0.06830895692110062,
        0.0785040631890297,
        0.021586015820503235,
        -0.024072837084531784,
        8.164924251410099e-33,
        -0.05079980567097664,
        0.07376326620578766,
        -0.06036286801099777,
        -0.08223707228899002,
        -0.01573963835835457,
        0.03372369334101677,
        0.06322623044252396,
        -0.04516714811325073,
        -0.003785449545830488,
        0.013743131421506405,
        -0.01618870534002781,
        -0.015735875815153122,
        -0.048185236752033234,
        0.07756160944700241,
        0.02302178367972374,
        -0.08359242975711823,
        0.034024208784103394,
        0.026120372116565704,
        -0.0006022822926752269,
        -0.0010789131047204137,
        -0.023146701976656914,
        0.0037774862721562386,
        0.0311594158411026,
        -0.022264743223786354,
        0.056210123002529144,
        0.010688805021345615,
        -0.030630970373749733,
        -0.004330439493060112,
        -0.011461096815764904,
        0.012033170089125633,
        0.04382355883717537,
        0.010475748218595982,
        -0.017792899161577225,
        0.061867643147706985,
        -0.011889138258993626,
        -0.008170834742486477,
        -0.09547542035579681,
        -0.09651292860507965,
        0.029091399163007736,
        0.02697114646434784,
        -0.06611858308315277,
        0.09694525599479675,
        -0.07011198252439499,
        -0.10591119527816772,
        -0.005189890041947365,
        0.007023336831480265,
        0.023342158645391464,
        0.021361645311117172,
        0.05863892287015915,
        0.00926261581480503,
        -0.060169607400894165,
        0.05809307098388672,
        -0.0702323168516159,
        -0.005140657536685467,
        0.04648953676223755,
        -0.05723735690116882,
        -0.03073303960263729,
        0.027017608284950256,
        0.07500046491622925,
        0.052456676959991455,
        -0.04232148081064224,
        -0.010583041235804558,
        -0.045620985329151154,
        -0.02816661074757576,
        -0.1435326635837555,
        0.0453263595700264,
        0.06283872574567795,
        -0.03530287742614746,
        -0.07812333852052689,
        0.009087629616260529,
        0.018690824508666992,
        -0.034233786165714264,
        0.07537522912025452,
        -0.03274499624967575,
        0.030762067064642906,
        0.029834512621164322,
        -0.045742254704236984,
        0.03270651027560234,
        -0.02452010102570057,
        -0.014835916459560394,
        -0.031006421893835068,
        0.015828710049390793,
        0.051792632788419724,
        0.032970499247312546,
        0.062002524733543396,
        0.029249319806694984,
        -0.019114654511213303,
        0.014774607494473457,
        0.007769761141389608,
        -0.0021856368985027075,
        -0.029234573245048523,
        -0.0264996699988842,
        -0.03669450059533119,
        0.05476612597703934,
        -0.006044808309525251,
        -7.050928826286956e-33,
        -0.010210730135440826,
        -0.051639359444379807,
        -0.0033309825230389833,
        0.06850147992372513,
        0.006425734143704176,
        -0.04785521328449249,
        0.04884554073214531,
        0.02682262472808361,
        0.06468791514635086,
        -0.11335638165473938,
        0.020404048264026642,
        0.05185656249523163,
        0.010551469400525093,
        0.022279037162661552,
        0.003489081747829914,
        -0.06134624406695366,
        0.06755641847848892,
        -0.043981727212667465,
        0.1158137321472168,
        -0.0650888979434967,
        0.055330030620098114,
        0.031693823635578156,
        0.010004823096096516,
        0.01117040403187275,
        0.04560958594083786,
        -0.019227078184485435,
        0.02458818256855011,
        0.014291050843894482,
        -0.016926541924476624,
        -0.0423707515001297,
        -0.05104827135801315,
        0.03710068017244339,
        0.05676315724849701,
        0.026852495968341827,
        0.04187905415892601,
        0.009633231908082962,
        0.07641179114580154,
        0.077506422996521,
        -0.003647417761385441,
        0.05450902506709099,
        0.03003557026386261,
        0.050781793892383575,
        0.01725435070693493,
        -0.04370707646012306,
        0.048843324184417725,
        8.83196626091376e-05,
        0.014112735167145729,
        -0.04946848377585411,
        0.06382948160171509,
        0.013548865914344788,
        -0.06718866527080536,
        -0.10414297133684158,
        0.12062516063451767,
        -0.0016243666177615523,
        -0.0007294832612387836,
        -0.09223956614732742,
        -0.04366440698504448,
        0.03337129205465317,
        -0.04716004803776741,
        -0.026179300621151924,
        0.006596800405532122,
        0.052617695182561874,
        -0.06589403003454208,
        -0.05651698261499405,
        0.046125560998916626,
        0.0018741205567494035,
        0.018206870183348656,
        -0.024416668340563774,
        -0.037422772496938705,
        0.03406717628240585,
        -0.07884921878576279,
        -0.0492510050535202,
        -0.050438713282346725,
        -0.04181381314992905,
        -0.009430683217942715,
        0.018974583595991135,
        0.024477360770106316,
        0.021063094958662987,
        0.10531669110059738,
        -0.03044309839606285,
        -0.07802792638540268,
        0.019777653738856316,
        0.05233759060502052,
        0.005239984951913357,
        0.07701081037521362,
        0.06729993969202042,
        0.011935161426663399,
        -0.04271300137042999,
        0.02605654112994671,
        -0.06659403443336487,
        -0.10332539677619934,
        0.09197578579187393,
        0.003759113373234868,
        -0.06635597348213196,
        0.039454489946365356,
        -5.900438893036153e-08,
        0.013061786070466042,
        -0.007282356731593609,
        0.00990460254251957,
        0.049784593284130096,
        0.0544675812125206,
        -0.06347006559371948,
        0.011799920350313187,
        -0.06445322185754776,
        -0.011128654703497887,
        -0.03585532307624817,
        0.03725430741906166,
        -0.06588481366634369,
        0.01930067501962185,
        -0.0974448025226593,
        -0.021116625517606735,
        -0.03922031447291374,
        -0.0187844131141901,
        0.04530903324484825,
        -0.011256302706897259,
        -0.016734648495912552,
        -0.0020721841137856245,
        0.03113495372235775,
        0.1927681714296341,
        -0.034774988889694214,
        -0.019124863669276237,
        0.034287650138139725,
        0.05971817672252655,
        -0.04233996570110321,
        0.11343677341938019,
        0.012367823161184788,
        -0.06637769192457199,
        0.01299547590315342,
        0.04712296277284622,
        -0.05266861617565155,
        0.0923127606511116,
        -0.027883511036634445,
        -0.01670462265610695,
        0.09510641545057297,
        0.11082252115011215,
        0.03787284716963768,
        0.026288503780961037,
        0.00020245651830919087,
        0.0035581293050199747,
        -0.02124813199043274,
        0.04183642193675041,
        0.030804986134171486,
        -0.045900311321020126,
        -0.09189644455909729,
        0.0017124518053606153,
        -0.019446177408099174,
        -0.0005144055467098951,
        -0.04057709500193596,
        -0.1074451208114624,
        0.013320310972630978,
        0.06309555470943451,
        -0.07972605526447296,
        0.026179147884249687,
        0.013307551853358746,
        0.06918222457170486,
        0.04326966404914856,
        0.015816252678632736,
        -0.13859114050865173,
        -0.03685101866722107,
        0.04781290888786316
    ]
}