{
    "id": "21drUWDifvo",
    "title": "Juggling FIRE and KNIVES with Josh Horton!!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-09-03T18:54:16Z",
    "video_url": "https://www.youtube.com/watch?v=21drUWDifvo",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "juggling",
        "how to juggle",
        "juggling knives",
        "juggling fire",
        "how to juggling 4 balls",
        "jugglin josh",
        "juggling josh",
        "world records",
        "guiness record"
    ],
    "views": 84809,
    "likes": 4781,
    "comments_count": 528,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys this Justine! And I'm so excited cause today I'm joined with Josh. Now this is really exciting because some of you guys may know that I like to juggle but you can juggle really... - I Can juggle, I've been known to juggle. - You also have a bunch of Guinness world records? - I do, I have 12. - Wait 12! oh my goodness! Wow, wow! - Yeah! (chuckles) - I've got the world record for most samurai swords juggled, most apples sliced while juggling, longest time to juggle five basketballs, most toilet paper rolls balanced on your head, most marshmallows caught in your mouth in 30 seconds. There's a few!(laughs) - okay I'm going to list the rest of them right here. I am extremely impressed. - Thank you. - I love juggling. - I haven't even done anything yet! - I know. - So, I'm winning so far - But if I follow you in Instagram and I've seen all of your stuff on Twitter and Youtube and this is so cool. So today we don't really know what we're gonna do. But you brought a bunch of stuff. - But you also, said that you wanted to try something. - I did, so I bought this balls that you light on fire. And Jenna my sister told me that I probably shouldn't try them because I'm gonna get hurt. - So that's why you brought me. - I was like, Oh a professional. (laughs) - Great I've already almost burned this yard in half so it's okay. - And I brought you, I brought you a little present. Josh Horton juggling balls. - No way, oh my goodness this is so cool! Wow oh wow. - There you go. - Okay so - Let's see - Okay - No pressure. - There's a lot of pressure. - I'm just a gold medalist juggler okay. - So I'm kind of basic. - No that looks great! - I could do one of these. - Awesome. - Do a little bit of that. And I like to like juggle real low like that. And then something a little like this. - And then I could, - That's so good. - I can do one of those. And then, I started with four but I'm not like that good at it. Oh - wait you can do it okay, that was great yeah. So four is, two in your right hand, plus two in your left hand. Just like that. Here you juggle three, and I'm gonna steal them and then you'll steal them back. - I don't know if I ever than that. - I know, right here. Okay now you see, you'll take that one first. (laughs loudly) yup, yup yup yup yup! you just gotta commit. - So, okay. - That was it. - Yay. (music) - Nice. - Oh I get it, this is fun, oh thief. (bright ragtime music) - Oh this is a little more tricky - It's a little more tricky. Something like that yeah. - Okay well I tried. - Cool, so I'm gonna give you those. - I'm not gonna juggle them because I don't want them to get crunched if I drop them. (slow music) you guys. Oh they are there, oh wow! Wow, wow - So one of the world records I have is, most apple sliced while juggling knives in 30 seconds. An so , just a nice underhand toss from you, I'll be juggling knives and then I'll slice the apple. Hold on. - Should I move? - Maybe step back just a little bit. Oh, No you're good. You're good. - Are you (laugh) okay - Hold on three, two, one. (loud scream) (laughs) - Did I get it? I think so. - Yeah - I might have cut with the wrong side of the knife. Let's try again, one, two, three. Let's try one more time, - Okay - One, two, three. (laughs loudly) got it. - This is so cool, sliced in half. - Sliced let's do one more time? - This is really fun. Okay. - Okay get, make this one a little bit higher, okay one - Oh shut up! Now, oh my God you're eating the apple and juggling knives. - There you have it. - So how long you have been doing this? - I started in second grade. - That's cool, that's really cool. - I learn in a sort of P.E class basically. - Yeah my Mom is gym teacher and she started teaching her kids to juggle. And she was just learning and she brought me some scarves and I was like \"this is really fun.\" - Yeah. - Wow, this is so great! (laugh) - I bought some clubs, and then - Can you do clubs? - I kept hitting myself. - You can't do clubs? - Wow oh that's really cool. (lively music) - So is there any records, that you currently trying to beat you right now? Or should you not tell anyone because then they'll try to beat you? - I'm like always, on my youtube channel I break a world record every Wednesday. - Oh every Wednesday, casual. - Yeah so we do world record Wednesdays it's not all juggling. - Yeah - I'm always looking for the next world record. - I mean, I've definitely tried it before but I don't know if I did it right. - Let me see your first flip. One, two, three. Watch the camera, watch the camera! - Ah! (laughs) - Very good! - I was very close to it. (laughs) - That was great. - Yeah - Wow. Are you left handed or right handed? - I'm right handed. - I'm left handed. - Oh. - We screwed up. (laugh) - Yeah we did. - What's the most you can juggle? - I could do seven of these. - Seven? - Start juggling and kick it forward, and then continue juggling. - wow - Tada! - Tada! - Insert garage band children cheering. (children cheering) - Right? - Yay! - It's so cool. - But haven't caught anything on fire yet. - We haven't. - We promised at the beginning of this video. - There will be. - So we briefly read the directions, I bought these awhile ago and I didn't attempt to use them, because I'm a little bit scared. So right now we're wetting the outer little rim here. I guess thats supposed to like help protect your hand? - Yeah, and even with these, you can hold them like that And it's not gonna burn you because the flame is right in the middle. This part doesn't catch on fire. - I'm gonna go on tour with my one trick - We'll get a little bit of fuel, on the wicks. I don't know how this is going to, where should we do this? - Do it over the flaming bucket. (laugh) - This is where we put things in, when we flame throw. - Alright that seems like a decent amount now. should we just see if one works first? - I guess? - Okay. - Do I just jam it in there? - Yeah. - Oh yeah that's working. Oh jeez, oh gosh, I'm scared, I'm scared, okay here you go. - Oh my God - No, sorry oh God (both laugh) would you like a third? - Yeah sure. - Oh yeah, okay, wow alright. Okay I'm sorry I was scared. will I catch my hair on fire? - I don't know. - Do you think I will? - I think you'll be alright. - Okay I'll just. Do you hate it? - It does get actually kind of hot sometimes, I want to make sure. - Are you okay? - Yeah I'm okay. Hold on. Oh! - Okay here, here, here here here put it in the water. Put it in the water! - There we go. - Oh no fire. - So do they get hot? - It does kind of hot, I remember I used to have these. And i feel like it was these rubber things that where getting hot. Are this supposed to come off? - I don't know. - We didn't read the directions. - So I read the end of the directions. (laughs) if you're struggling, then you're probably doing it wrong. (laughs) I think we did it right. - Okay. As long as you keep moving it's fine, definitely don't hold on to it for a very long time. - Okay - Here you go, ready? - Yes - You're good, you're good, you're good. You good? - Oh yeah I'm good let's do it. - Are you ready? - yup okay just throw it up. (censored) I mean shoot, I mean I don't swear my channel. I mean, oh God, flicker flicker flame. Okay, okay, so I guess just throw it up. - Here remember the - Yes - Remember the steal we did? - Just throw one, just throw it up. Just throw the ball! Oh God, yes it so hot. oh Gosh, no, shoot. (laughs) It's so hot. - Okay throw to me, remember you do the steal - Okay, yes, I'm panicking. - This is all training for this moment right now. - Yup - There you go (clapping) - You alright? - Oh that was hot! (laughs) - Oh God, oh god, the flame, the flame it's getting warm. Its getting toasty, oh my gosh you're so calm, you're so calm. (panting) (stammering) wow this is cool. I'm super impressed. Oh my goodness. That would have crisped my ponytail right off. How are they feeling, good? - It feels a lot better actually here you take them back. - Okay - Right hand first. Nice! You good? - Yeah I'm good, I'm just trying to turn around quicker. Oh God that one burned a little bit. (laughs) I mean I have fairly, pretty decent, health insurance. jeez oh God. - Here you go, have fun with that. - Steal them back? - Yup - I'm glad I taught you to steal, this is the best way to give it to you - this is great! - Yeah without me panicking. Oh my Gosh. (Laughs) - Oh God. Oh god. - We're good. - I was so scared. (laugh) I'm so scared of the balls on fire. (music) This is cool also, sorry - The couch is on fire. Oh. - Oh! - Now just steal with that one hand. Nice, the flames are getting smaller. - Oh jeez Why am I so clumsy? I'm a little nervous from the flame. (blowing out flame) - That was better. - That was fun, yes! - That was good, you did a good job. You alright? - I'm good, yeah it something I've never that before and it was a lot of things, I was scared. You were so calm. - I have done it before. - oh yeah that's right. - I've got one last thing to catch on fire. - Really? - You wanna see it? Yeah. - Yes! Oh it's nice and dark now, it'll look great. - Okay, so, I'm going to juggle one of these, one of these, this is a - Woah little katana, the flaming battle axe. - Wow this looks like something that I would find in Destiny. (laughs) so this catches on fire - no way - Maybe I shouldn't have said I was going to juggle all four of these, but I'm going to try. - You could do whatever you want, you could back out now. I'm totally okay with that. - No it's okay - So that's, Whoa! Whoa! Whoa! should I go away? Where do I go? - I'm gonna need those things, throw them up. Wow. - Alright, hold on. - Oh my gosh I am so impressed. Whoa, whoa, whoa, how do you even keep your eye on the things? That is a lot. (laugh) I actually never juggled four things with this before. So that was the first. - Oh, just never done that before! - Yeah - Super casual. - I had to do something special for your channel. - Wait don't blow it out, lets get a thumbnail. - Oh yeah. Do you wanna hold any of this stuff? - Oh sure. Okay great thumbnail taken, wow. - There we go! - Maybe next time, I will have a new trick to show you. - That would be awesome. - We'll see, I'll work on, what should I work on? What's my homework? - I would like to see you get, like a solid four ball juggle. - Okay - You did like eight, eight throws that was good. - Thank you. - Yeah - I've done more before but - I believe you. - I'm just, I'm having an off day. (laughs) - No problem. - Well guys thank you so much for watching, and Josh thank you so much for coming over and teaching me some juggling tricks. - You bet. - And you didn't even burn my house down. - I did not. - I mean, the fact that I haven't burned my house down that's saying something. Be sure you go check out Josh's channel, youtube, Twitter, Instagram, Facebook. I'll put all of the links below, and be sure to go subscribe to his youtube channel. Thank you so much. - Thank you. This was so great. - We're gonna go to the grocery store and juggle some things now. - That'll be on my channel. - I'm so excited. Let's go grocery shopping. - Let's do it. - Okay, bye! - Bye - Yes indeed. The crowd goes wild.",
    "transcript_keywords": [
        "Yeah",
        "good",
        "Wow",
        "God",
        "juggle",
        "juggling",
        "cool",
        "Great",
        "fire",
        "throw",
        "yup",
        "Justine",
        "Hold",
        "things",
        "scared",
        "steal",
        "hot",
        "Whoa",
        "flame",
        "world"
    ],
    "transcript_entity_values": [
        "12",
        "second",
        "one",
        "Wednesdays",
        "Justine",
        "P.E",
        "Josh",
        "Instagram",
        "three",
        "Guinness",
        "30 seconds",
        "Twitter",
        "four",
        "half",
        "Wednesday",
        "an off day",
        "five basketballs",
        "eight",
        "today",
        "third",
        "two",
        "youtube",
        "seven",
        "Josh Horton",
        "Facebook",
        "first",
        "Youtube",
        "Jenna",
        "One"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.046845581382513046,
        -0.06714021414518356,
        -0.06181163713335991,
        -0.11762366443872452,
        0.004920081235468388,
        0.021558785811066628,
        0.08261572569608688,
        0.023374127224087715,
        -0.02398849092423916,
        0.07328625023365021,
        0.046174779534339905,
        0.003996795043349266,
        -0.021741991862654686,
        0.041451048105955124,
        0.01845255307853222,
        0.03671127185225487,
        0.0013475839514285326,
        0.013346037827432156,
        -0.017224624752998352,
        0.04446404427289963,
        -0.05432174354791641,
        -0.05884820595383644,
        0.0263674296438694,
        -0.024424772709608078,
        -0.02710820734500885,
        0.11499381810426712,
        0.0078250328078866,
        0.04176954925060272,
        -0.08523061871528625,
        -0.07621613144874573,
        0.041124727576971054,
        -0.008207103237509727,
        0.06151445955038071,
        0.011677163653075695,
        0.02100425958633423,
        -0.04950324445962906,
        0.018710961565375328,
        0.037037719041109085,
        -0.026930566877126694,
        0.008043077774345875,
        -0.026558447629213333,
        -0.012130336835980415,
        0.014903418719768524,
        -0.04536670818924904,
        -0.04222291335463524,
        -0.10654795914888382,
        -0.01060115359723568,
        -0.05117509886622429,
        0.06614923477172852,
        0.05012008920311928,
        -0.10515791177749634,
        -0.013370863161981106,
        0.02872021496295929,
        -0.002341293962672353,
        -0.027723537757992744,
        -0.01969068869948387,
        -0.06332950294017792,
        0.03547258675098419,
        0.06785939633846283,
        -0.07721161097288132,
        0.04243979603052139,
        -0.0591956190764904,
        -0.00445944769307971,
        0.06264685839414597,
        -0.05932221934199333,
        -0.06298409402370453,
        0.033197782933712006,
        0.002034808276221156,
        0.018611647188663483,
        0.028735147789120674,
        -0.06906420737504959,
        0.06168467923998833,
        -0.02444727160036564,
        -0.0008767640101723373,
        -0.023389797657728195,
        0.03642851486802101,
        0.034046392887830734,
        -0.07121380418539047,
        -0.027670469135046005,
        0.08794303983449936,
        0.02285364642739296,
        -0.062198229134082794,
        -0.08816573023796082,
        0.0026548835448920727,
        0.0016703363507986069,
        0.06913574784994125,
        -0.02381087839603424,
        0.009997065179049969,
        -0.027586081996560097,
        -0.04534139484167099,
        -0.10911449044942856,
        0.005034830886870623,
        0.0032335922587662935,
        0.005201345309615135,
        -0.03073228895664215,
        -0.06265005469322205,
        0.016390515491366386,
        -0.0069444794207811356,
        -0.05630537495017052,
        0.07398416846990585,
        0.034673210233449936,
        -0.07679081708192825,
        -0.025245534256100655,
        -0.060364942997694016,
        0.012192510068416595,
        -0.08138316124677658,
        -0.06798102706670761,
        0.03896641358733177,
        -0.004183303564786911,
        -0.03804204985499382,
        -0.022728201001882553,
        0.06950516998767853,
        -0.07055436819791794,
        -0.04178137704730034,
        0.012743729166686535,
        0.06398971378803253,
        -0.036088474094867706,
        0.058173563331365585,
        0.016023671254515648,
        0.07187660038471222,
        -0.004573204088956118,
        -0.026988515630364418,
        -0.0071522691287100315,
        0.07618127018213272,
        0.01728517934679985,
        0.03928885981440544,
        -0.07174673676490784,
        1.3867515506897797e-32,
        0.010404404252767563,
        0.07075802981853485,
        -0.0042758602648973465,
        0.00964023545384407,
        0.018635021522641182,
        -0.06117221713066101,
        0.002668218221515417,
        0.0656101256608963,
        -0.05324201658368111,
        0.06779418885707855,
        0.03308432176709175,
        0.07353626191616058,
        -0.06978880614042282,
        0.039719387888908386,
        0.05880345031619072,
        -0.07488889992237091,
        -0.018547378480434418,
        -0.037427276372909546,
        -0.060518328100442886,
        -0.02571800909936428,
        -0.042279403656721115,
        -0.041228022426366806,
        0.015262947417795658,
        0.07914289832115173,
        0.09620160609483719,
        0.10783813893795013,
        0.07284853607416153,
        -0.0023995679803192616,
        0.11216944456100464,
        0.032663848251104355,
        -0.08630722016096115,
        -0.02461417391896248,
        -0.05591822415590286,
        -0.0844724178314209,
        -0.020108040422201157,
        0.011615810915827751,
        -0.10664161294698715,
        -0.02717556618154049,
        -0.05774904787540436,
        -0.031070925295352936,
        -0.040055420249700546,
        0.033361516892910004,
        -0.08846509456634521,
        -0.046938296407461166,
        0.042644474655389786,
        0.027549905702471733,
        0.031029602512717247,
        0.10627251118421555,
        -0.026392806321382523,
        -0.0047257267870008945,
        -0.036768559366464615,
        -0.014194680377840996,
        0.010679081082344055,
        0.04201570153236389,
        -0.006650506053119898,
        -0.07699622958898544,
        -0.015367603860795498,
        0.05829295143485069,
        0.052427664399147034,
        0.0745091587305069,
        0.044109173119068146,
        -0.012303291819989681,
        -0.058472711592912674,
        0.02780940942466259,
        -0.04744105413556099,
        0.07889902591705322,
        0.07410336285829544,
        -0.05459807068109512,
        0.07981064170598984,
        0.03092133067548275,
        0.0027755575720220804,
        0.012475661002099514,
        0.05573945865035057,
        0.02303539589047432,
        0.05752408131957054,
        0.03332224488258362,
        -0.06807605177164078,
        -0.027821986004710197,
        0.004052907694131136,
        -0.03941192850470543,
        -0.11178062856197357,
        0.06699790060520172,
        -0.009848558343946934,
        0.09163430333137512,
        -0.04751371592283249,
        -0.057587191462516785,
        0.02712518535554409,
        -0.0688374787569046,
        -0.053610146045684814,
        0.026281824335455894,
        -0.0434773750603199,
        0.01303501520305872,
        -0.07861971110105515,
        -0.057702068239450455,
        -0.03070862405002117,
        -1.2642816431918027e-32,
        0.033538494259119034,
        0.037128280848264694,
        0.025409063324332237,
        0.011231984943151474,
        0.04104122519493103,
        -0.024680064991116524,
        0.015798527747392654,
        0.04995563626289368,
        0.04273862764239311,
        -0.08812206983566284,
        -0.007887248881161213,
        -0.05750482901930809,
        -0.08704711496829987,
        0.015816422179341316,
        -0.04444060102105141,
        -0.049429114907979965,
        -0.02024962194263935,
        -0.035734400153160095,
        0.0784088522195816,
        -0.05141697824001312,
        0.08188493549823761,
        0.09280150383710861,
        0.07670846581459045,
        0.016061069443821907,
        -0.014727757312357426,
        0.027491390705108643,
        0.0095044681802392,
        0.013822661712765694,
        0.013967996463179588,
        0.054897911846637726,
        -0.008353718556463718,
        -0.009301306679844856,
        -0.02801579236984253,
        -0.0028502747882157564,
        -0.011069567874073982,
        0.040030524134635925,
        0.023073501884937286,
        0.05352061241865158,
        0.051168978214263916,
        -0.09429508447647095,
        0.047993145883083344,
        0.005421777255833149,
        0.0197195615619421,
        0.007493108045309782,
        -0.04552118480205536,
        -0.11278944462537766,
        -0.06309913843870163,
        0.026359789073467255,
        0.023118630051612854,
        0.02633134089410305,
        -0.08990640193223953,
        -0.03239409625530243,
        -0.07109417021274567,
        -0.030733773484826088,
        -0.04966927692294121,
        -0.032647013664245605,
        -0.023332690820097923,
        -0.053700655698776245,
        0.049940817058086395,
        0.026153065264225006,
        0.048429492861032486,
        -0.03836153447628021,
        -0.03993348032236099,
        -0.0007726986077614129,
        0.011418807320296764,
        -0.033463671803474426,
        0.05455898866057396,
        0.011469559744000435,
        -0.010104023851454258,
        0.026469111442565918,
        -0.018046168610453606,
        0.04622316360473633,
        0.08588319271802902,
        0.005099416244775057,
        0.010561623610556126,
        0.011119692586362362,
        -0.0945003405213356,
        -0.002281644381582737,
        0.09602616727352142,
        -0.02500925399363041,
        -0.03000568598508835,
        -0.003905234159901738,
        -0.016914425417780876,
        0.11171755939722061,
        0.07429919391870499,
        0.12610022723674774,
        0.07787108421325684,
        -0.0018637555185705423,
        -0.035389937460422516,
        0.04957045987248421,
        0.04923323169350624,
        0.05282333493232727,
        0.09499240666627884,
        0.09728621691465378,
        -0.11239306628704071,
        -6.596021506766192e-08,
        0.036847032606601715,
        0.0484745018184185,
        -0.06060852110385895,
        0.031744182109832764,
        0.03982158377766609,
        0.012300730682909489,
        -0.03176290541887283,
        -0.011587287299335003,
        0.03751441836357117,
        -0.04369617626070976,
        0.11424043029546738,
        -0.0075071644969284534,
        0.0033955471590161324,
        0.13051922619342804,
        -0.005907419603317976,
        -0.007287225686013699,
        -0.045470308512449265,
        0.06377894431352615,
        -0.04237327724695206,
        -0.0492696613073349,
        -0.03808280825614929,
        0.047157738357782364,
        0.05176945775747299,
        0.005348781123757362,
        0.019933564588427544,
        0.008735503070056438,
        -0.05841244384646416,
        0.010304695926606655,
        0.07227819412946701,
        0.051516056060791016,
        -0.0802670493721962,
        -0.01011594943702221,
        -0.0003146514354739338,
        0.009447873570024967,
        -0.04646387696266174,
        -0.06472855806350708,
        -0.10580258816480637,
        0.000611856987234205,
        -0.018615834414958954,
        0.028336865827441216,
        -0.013233711943030357,
        -0.12095277011394501,
        -0.03135759010910988,
        -0.005104068201035261,
        -0.017849601805210114,
        -0.07147432863712311,
        -0.006986933294683695,
        -0.08131027966737747,
        -0.06348629295825958,
        -0.0014785428065806627,
        -0.022469105198979378,
        -0.020658841356635094,
        0.02218175306916237,
        -0.027315398678183556,
        0.07065560668706894,
        0.0360751636326313,
        0.048616617918014526,
        0.051152586936950684,
        -0.002835104940459132,
        -0.037567608058452606,
        0.018612999469041824,
        -0.02767941914498806,
        -0.08670633286237717,
        0.024624163284897804
    ]
}