{
    "id": "22dJcEYAlyQ",
    "title": "iPHONE 15 WILL HAVE AN ACTION BUTTON?! New Rumors!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-08-03T14:56:12Z",
    "video_url": "https://www.youtube.com/watch?v=22dJcEYAlyQ",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 163375,
    "likes": 5562,
    "comments_count": 333,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE:    GET YOUR OURA RING:    FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "https://oura.link/ijustine",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ"
    ],
    "transcript": "- We are getting closer and closer to the new iPhone 15 and iPhone 15 Pro. I actually can't believe that it is almost here. I mean, I say almost, we still have a few months. I mean, at this point this phone is definitely finalized. I'm sure they're putting the finishing touches on them before they will be ready to be revealed to us. So let's just go through and check out some of the rumors. I feel like most of the things have already been kind of leaked already, so let's see if there's any updates. So this article on 9TO5Mac I kind of liked because it kind of gives you the breakdown of Apple's charging ports of the past. So we had the 30-pin to Lightning and it's kind of wild because I didn't even think about this. \"Apple only made five models using the original charging port, and that was launched 16 years ago.\" Sixteen! I know. I just can't even handle that thought. And \"still, the public reaction to when the iPhone 5 switched to the current Lightning port was not exactly positive in 2012,\" says the article. And I don't really remember how I felt. I mean I don't think I was upset about it necessarily, 'cause like that charging port was so massive that they then went to something faster and smaller. Like why would, I don't know. I mean, at this point we're like, let's go to USB-C. Are we there yet? Almost. USB-A to USB-C. So \"Apple began shipping a USB-C to Lightning cable in the box with the iPhone 11 Pro. Now, a year later, Apple stopped including the power adapter to save the planet and replaced USB-A to Lightning with USB-C for the iPhone 12.\" There are times that I do plug my phone in if I want to charge it faster or to take footage off of it quicker, which tends to be sometimes faster and a little bit more reliable than AirDrop. What's gonna be cool about AirDrop though in IOS 17 is you'll be able to continue AirDropping photos and videos and content not necessarily being next to the device. You'll be able to continue uploading either on cellular or on Wi-Fi when you get back to any Wi-Fi service. So that's actually pretty cool. And I'm a huge fan of AirDrops, so definitely hyped about that. Now, this is showing a visual of, obviously, somebody using MagSafe to charge, which I feel like a lot of people now, that's pretty much how you charge your phone. And if you do need to charge it throughout the day you may be charging it in your car, or just getting a little juice here or there at the office. But for the most part, I pretty much do charge my phone at night on a magnetic stand. All right, let's go through the rumor roundup real quick. The iPhone 15 Pro: 6.1 and a 6.7-inch sizes, the A17 chip, we've got a Periscope lens, USB-C port, ding ding ding, it's here, and we'll have a Qualcomm modem chip. I've already gone through almost all of these specs, so really there's nothing that's like that new or exciting that has been leaked. I mean, this is all super exciting, but I feel like at some point we've seen this all already, so I don't wanna keep rehashing everything. So here we have the USB-C. Here's a little side shots. Here, they're showing you the dynamic island and the hole punch for the camera. \"The thinner bezel design will be noticeable, as seen in the photo below comparing the iPhone 14 Pro and the iPhone 15 Pro mock-up.\" Wow, actually take a look at that. Seems like a significant difference. I mean there's definitely still a bezel, but in comparison to the previous version it definitely looks much thinner. The volume buttons won't have notable changes, but they are expected to swap the mute switch with a button instead. Interesting. Breaking news. So I had already filmed my iOS 15 rumors video, and then this news just broke about the fourth Beta of iOS 17 came out and leaked that there is going to be an action button. So according to some code snippets, the new button replaces the mute switch. We'll have plenty of options that can be assigned to a click. So based on their findings the iPhone 15 Pro button will have nine assignment options: accessibility, shortcuts, silent mode, camera, flashlight, focus, magnifier, translate, and voice memos. So you'll be able to assign this to do all sorts of actions. So I can't wait to check this out, if it is actually a thing. We don't really know. It's just a rumor. They're saying iPhone 15 Pro Max could be slightly thicker than the iPhone 14 Pro Max with small reductions in the height and width. Of course, we can't make it the same size because we definitely need to make sure that the previous cases that you bought for your 14 will not fit the 15. Very important. We're gonna have a titanium chassis. Obviously, titanium is already being used in the Apple Watch which is beautiful and light. And I'm actually not wearing my Apple Watch Ultra today. I thought I'd switch it up. Get a little wild with the gold. So here's some color options. It could be available in a dark blue color, which is, yeah, that's definitely not far off from the iPhone 12 Pro, but a more gray for a deeper shade. They've heard rumors of red, which I'm sure it'll look better in person. I'm just not a real big fan of the color red. And I'm sure we will have the gray, the gold, and silver. Is that what I said? Gray, gold? Yeah, gray, gold, silver. Space gray? Who knows what they'll call it. Maybe they'll call it something new. Here's some mock-ups of the 15. Here's some case options. There's also been rumors about the iPhone 15 Ultra, which I still don't feel like that's gonna happen this year. I don't know. It kind of would sort of make sense that they would, kind of piggybacking off of the Apple Watch Ultra. So here's a render of what the periscope camera could look like. So this should allow for 5x or 6x optical zoom. And in comparison to the iPhone 14 Pro Max that offers 3x. So we'll basically be getting, possibly, double the zoom. Some other camera improvements. The iPhone 15 Pro models are expected to include improved rear camera and a LIDAR Scanner from Sony. I feel like Apple's gonna be really leaning more into LIDAR and AR, obviously, with the introduction of Vision Pro. So it's gonna be interesting to see how they start catering towards creators or even just regular consumers who aren't looking to be a content creator, but you're still taking videos and photos. How they're gonna be enhancing these devices to make all of the content look great for Vision Pro. Battery: \"suggests the iPhone 15 models will use stacked battery technology.\" Okay, hopefully that'll give us some better battery life. I do feel like right now my battery in my phone, this is about the time where it starts draining. So now the iPhone 15 not Pro, that's the phone that is supposedly going to have the pink version. I just wish so much that they would bring a pink to the Pro, but it's okay. I end up putting a case on it anyway, so I'm never even gonna see what color I actually... Forgot what color I had. I have silver, (chuckles) in case you forgot as well. So here's the whole lineup. We've got the 6.1-inch iPhone 15, the 6.1-inch iPhone 15 Pro, the 6.7-inch iPhone 15 Max, and the 6.7-inch iPhone 15 Pro Max. Just... there's so much. There's so much. Now the Pro models will have a higher end feature and will be more expensive, while the standard iPhone 15 models will be the less expensive, as usual. And of course you've seen this image before, this pink is a possibility, and the blue is also beautiful. Those are really, really great colors. Here's another little render of the iPhone 15s. Frosted glass? Oh, interesting. \"The iPhone 15 models could feature a frosted glass back, which have been previously a design detail that Apple has limited to the Pro models.\" That could be interesting. I don't know if they'll do that because I feel like they need to have something that is that differenti feature between the Pro and like just the regular phones. So here's some part leaks and some renders. Literally looks like it could be anything. (chuckles) I mean, I think they're just showing us because you can see kinda like where the dynamic island is, but not the best photo. iPhone 15 on the left, 15 Plus on the right. It's just hard because like these phones are already so great. So like how much more can you do to them to make them look different? I mean, we're doing kind of incremental upgrades at this point. But yeah, so that so far is what we're looking at for the iPhone 15 and the 15 Pros. So I'd love to hear from you guys, though. Is there anything that you're looking forward to in the next iPhone? I would love to read all of your comments below. So leave those. And with that, I will see you guys in my next video. Don't free to like, comment, and subscribe. Hit the bell to be notified when I post new videos. And of course we've got more videos here on the end screen. So I'll see you in the next one. Peace.",
    "transcript_keywords": [
        "Pro",
        "iPhone",
        "Pro Max",
        "Apple",
        "Pro models",
        "Apple Watch Ultra",
        "Apple Watch",
        "Vision Pro",
        "USBC",
        "kind",
        "Max",
        "feel",
        "models",
        "Lightning",
        "phone",
        "closer",
        "Pro button",
        "Watch Ultra",
        "charge",
        "color"
    ],
    "transcript_entity_values": [
        "USB-C.",
        "A17",
        "AirDrops",
        "the Apple Watch Ultra",
        "nine",
        "12",
        "the Apple Watch",
        "3x",
        "6.1-inch",
        "15 Plus",
        "AirDrop",
        "iPhone 15",
        "a year later",
        "AirDropping",
        "17",
        "Apple",
        "14",
        "Apple Watch Ultra",
        "the USB-C.",
        "ding ding ding",
        "Gray",
        "Sony",
        "MagSafe",
        "iPhone",
        "30",
        "5x",
        "the day",
        "Pro Max",
        "Periscope",
        "Vision Pro",
        "Wi-Fi",
        "6.1",
        "five",
        "night",
        "2012",
        "IOS 17",
        "today",
        "this year",
        "16 years ago",
        "Wi-Fi",
        "a few months",
        "fourth",
        "Qualcomm",
        "6x",
        "USB",
        "Max",
        "6.7-inch",
        "15"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "DATE",
        "EVENT",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL"
    ],
    "vector": [
        -0.11708889901638031,
        -0.07522119581699371,
        0.10464310646057129,
        -0.08516666293144226,
        0.0728382095694542,
        -0.005414531100541353,
        0.023442039266228676,
        0.04325209930539131,
        0.057248279452323914,
        0.06529493629932404,
        0.07327815145254135,
        0.02664051577448845,
        -0.06481345742940903,
        0.019975457340478897,
        0.02462717518210411,
        0.004073886200785637,
        0.04243180900812149,
        -0.10849516838788986,
        -0.07704396545886993,
        -0.021387387067079544,
        -0.031063778325915337,
        -0.05561383068561554,
        0.058837950229644775,
        0.04660338535904884,
        -0.02365967631340027,
        0.0680178552865982,
        -0.04040103778243065,
        -0.10020340234041214,
        -0.12558631598949432,
        -0.06952632963657379,
        -0.003426859388127923,
        0.0281596127897501,
        0.045606981962919235,
        -0.0575052946805954,
        -0.009165443480014801,
        -0.06428241729736328,
        -0.02768864296376705,
        -0.009938718751072884,
        0.01667899265885353,
        -0.054958466440439224,
        -0.02081393264234066,
        -0.03971592336893082,
        -0.023572510108351707,
        0.09196750074625015,
        -0.007546501699835062,
        -0.011682230047881603,
        0.05444382131099701,
        -0.007914174348115921,
        -0.04060089960694313,
        0.05539000406861305,
        -0.016530076041817665,
        0.001542863086797297,
        0.04376767575740814,
        -0.009455994702875614,
        -0.05743608996272087,
        -0.02393670752644539,
        -0.042274508625268936,
        -0.04413184896111488,
        0.10324877500534058,
        0.05296273157000542,
        0.0842985287308693,
        -0.011003025807440281,
        -0.07928700745105743,
        0.02092832326889038,
        -0.057133112102746964,
        0.011848712339997292,
        0.07670602202415466,
        -0.02939034253358841,
        0.01999957114458084,
        0.026204071938991547,
        -0.016602059826254845,
        -0.0044049606658518314,
        -0.01900048553943634,
        -0.007834548130631447,
        -0.017672421410679817,
        0.025110986083745956,
        0.03269373998045921,
        0.0318283811211586,
        -0.062129974365234375,
        0.0026829394046217203,
        0.05619986355304718,
        -0.04565221071243286,
        -0.005800999701023102,
        -0.04432627931237221,
        0.007681658491492271,
        0.044618573039770126,
        -0.024107880890369415,
        0.05787331238389015,
        -0.05802217125892639,
        -0.046708572655916214,
        -0.09069472551345825,
        0.012183052487671375,
        -0.0194388497620821,
        -0.004111669957637787,
        -0.03028665855526924,
        0.043752703815698624,
        -0.07672683149576187,
        -0.042487453669309616,
        -0.05854778736829758,
        0.020198360085487366,
        0.02481628954410553,
        -0.02951992116868496,
        0.011858568526804447,
        -0.05546608194708824,
        -0.010325086303055286,
        -0.06994260847568512,
        -0.05264509096741676,
        -0.04976324364542961,
        0.00596458138898015,
        0.11119198799133301,
        -0.008793876506388187,
        -0.008384134620428085,
        -0.013772960752248764,
        -0.05209503322839737,
        0.03848545253276825,
        0.10228428989648819,
        -0.018231045454740524,
        0.05649876967072487,
        0.041597880423069,
        -0.0041960072703659534,
        -0.00808328203856945,
        -0.060100432485342026,
        -0.04994041100144386,
        -0.028570573776960373,
        -0.01334401499480009,
        -0.0264455433934927,
        -0.12042157351970673,
        4.970083787482713e-33,
        0.0690310150384903,
        0.08082786947488785,
        -0.022216731682419777,
        0.07500163465738297,
        -0.05242690071463585,
        -0.020810237154364586,
        0.09918574243783951,
        0.03822524845600128,
        -0.01326454896479845,
        -0.005070139653980732,
        0.02016245573759079,
        -0.01972806453704834,
        -0.05181683227419853,
        -0.024445313960313797,
        0.000211497928830795,
        -0.03448685631155968,
        0.015249782241880894,
        -0.0502389557659626,
        -0.004921490326523781,
        -0.037156641483306885,
        0.005228037014603615,
        -0.0061104013584554195,
        -0.03964933380484581,
        0.04593884199857712,
        0.0357603020966053,
        0.04944157972931862,
        0.045245300978422165,
        0.001012060442008078,
        0.0008489447645843029,
        -0.013262051157653332,
        -0.12660431861877441,
        0.06402353942394257,
        0.03265044838190079,
        -0.00019820852321572602,
        0.014934714883565903,
        0.028085632249712944,
        0.014722390100359917,
        -0.07024277001619339,
        0.09001835435628891,
        -0.03794936463236809,
        -0.010541127994656563,
        0.019642284139990807,
        -0.08458863943815231,
        0.01766161061823368,
        0.09311353415250778,
        0.1249120756983757,
        -0.02903151325881481,
        0.00816278625279665,
        -0.039381109178066254,
        -0.007210257463157177,
        0.06807824969291687,
        0.00712085934355855,
        -0.027125634253025055,
        -0.04108878970146179,
        -0.05364212393760681,
        0.0446384996175766,
        -0.03925297409296036,
        7.794590783305466e-05,
        0.06121186912059784,
        0.03235446289181709,
        0.04889628663659096,
        -0.016266608610749245,
        -0.06785129010677338,
        0.04015802964568138,
        -0.1053251326084137,
        0.11919620633125305,
        0.025399139150977135,
        -0.033185653388500214,
        0.02240709587931633,
        0.08319249004125595,
        -0.03771378472447395,
        0.007131726481020451,
        -0.010839153081178665,
        0.01070065051317215,
        0.05567563697695732,
        0.01812167465686798,
        -0.03373792767524719,
        -0.05698997527360916,
        0.07820259034633636,
        0.04631485790014267,
        -0.035056810826063156,
        0.0029761893674731255,
        0.008551756851375103,
        0.05233762785792351,
        0.03835887089371681,
        -0.1202382817864418,
        0.024892136454582214,
        -0.02313390001654625,
        0.007576650474220514,
        0.07982823997735977,
        -0.04266493394970894,
        -0.029844019562005997,
        -0.06952586024999619,
        0.05350964516401291,
        0.05842604860663414,
        -6.550118274326752e-33,
        0.018915891647338867,
        -0.040586866438388824,
        -0.031264178454875946,
        -0.05491548776626587,
        0.014916684478521347,
        -0.045316703617572784,
        -0.016157027333974838,
        0.106684111058712,
        0.018175970762968063,
        -0.050411149859428406,
        0.005538780242204666,
        0.0014391705626621842,
        -0.07775639742612839,
        0.016431977972388268,
        -0.05138913914561272,
        -0.04349815472960472,
        0.02669914998114109,
        -0.0587979219853878,
        0.037281449884176254,
        0.03564605861902237,
        0.020766910165548325,
        0.035556185990571976,
        -0.019697539508342743,
        0.021102985367178917,
        -0.036760665476322174,
        -0.02217945083975792,
        0.03497158735990524,
        0.019266679883003235,
        0.01884343847632408,
        -0.057881008833646774,
        -0.02704700455069542,
        -0.0760645940899849,
        -0.032632939517498016,
        0.026175133883953094,
        0.041308872401714325,
        0.045628760010004044,
        0.012185473926365376,
        -0.014950240030884743,
        -0.0030678280163556337,
        -0.07182252407073975,
        0.0019234829815104604,
        -0.01661214418709278,
        0.014357701875269413,
        0.022325756028294563,
        -0.03191059082746506,
        0.004071221686899662,
        0.009806299582123756,
        0.05786704272031784,
        -0.012139207683503628,
        0.00897359848022461,
        0.001655614236369729,
        0.012479087337851524,
        -0.05127517133951187,
        -0.020732460543513298,
        -0.09804318100214005,
        0.0218582171946764,
        -0.0259640384465456,
        -0.041826777160167694,
        0.04243088886141777,
        0.03783877193927765,
        0.1065211296081543,
        0.04953822121024132,
        -0.0049762665294110775,
        -0.11773017048835754,
        -0.04170135408639908,
        -0.025452710688114166,
        0.063135527074337,
        -0.05966440588235855,
        -0.004600582644343376,
        0.11761383712291718,
        -0.020086076110601425,
        -0.08960893750190735,
        -0.006423438899219036,
        0.01170310564339161,
        0.08740317821502686,
        -0.029684200882911682,
        -0.06449583917856216,
        -0.04711485654115677,
        0.006804382428526878,
        -0.0328235849738121,
        0.05901814624667168,
        0.0724247545003891,
        0.055205292999744415,
        0.013282940723001957,
        0.1284666359424591,
        0.08883081376552582,
        0.04922153428196907,
        0.005345991812646389,
        -0.018665000796318054,
        0.08631840348243713,
        -0.04477130249142647,
        0.020141946151852608,
        -0.01390290167182684,
        0.09682705998420715,
        -0.03647267818450928,
        -5.1952014246126055e-08,
        0.10031954199075699,
        0.050923313945531845,
        0.040302544832229614,
        -0.038283929228782654,
        0.02312494069337845,
        -0.017009912058711052,
        -0.054862506687641144,
        0.03474854305386543,
        0.12247749418020248,
        -0.008271281607449055,
        0.039442241191864014,
        -0.010555244982242584,
        -0.05329396575689316,
        0.08264490962028503,
        -0.017730282619595528,
        0.03153570368885994,
        0.004000758286565542,
        0.005486794747412205,
        -0.015150964260101318,
        -0.015288099646568298,
        -0.0422162227332592,
        0.07624299824237823,
        0.08432010561227798,
        -0.06287042796611786,
        0.04907233268022537,
        -0.0021462212316691875,
        -0.053544558584690094,
        0.015933120623230934,
        0.016120098531246185,
        0.0562068447470665,
        0.01916157454252243,
        -0.07218676805496216,
        0.06232163682579994,
        0.028752842918038368,
        -0.08724688738584518,
        -0.04192311689257622,
        -0.03781094774603844,
        -0.06433158367872238,
        0.06474430859088898,
        -0.051603998988866806,
        0.0010569157311692834,
        -0.06931223720312119,
        -0.0036919142585247755,
        0.06123386323451996,
        -0.01338751707226038,
        -0.07634316384792328,
        0.040893152356147766,
        -0.15482833981513977,
        -0.020333902910351753,
        -0.02379731833934784,
        -0.09450897574424744,
        -0.07846879214048386,
        -0.0034098010510206223,
        0.025098681449890137,
        0.09504576027393341,
        0.04368215799331665,
        0.03258867934346199,
        0.03721694275736809,
        -0.003938295878469944,
        -0.020666364580392838,
        0.00921630859375,
        -0.09008824080228806,
        -0.04268519580364227,
        0.07428234070539474
    ]
}