{
    "id": "2afHN4c_0fc",
    "title": "Health Update!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-04-25T14:00:49Z",
    "video_url": "https://www.youtube.com/watch?v=2afHN4c_0fc",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 228284,
    "likes": 12991,
    "comments_count": 1427,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine. And I wanted to give you guys a little health update video. Thank you so much for all of your well wishes to everyone who left comments, to my friends and family who have sent me gifts and all kinds of things to my house, to brands who have reached out and also sent things, it has been incredibly overwhelming, but the amount of love and support that I have felt from the audience and pretty much everyone that I know has been so incredibly, just, I don't even know what to say. I've been just speechless. It was definitely a really tough time because this is something that happened so unexpectedly and I'm incredibly active and healthy, and just kind of makes you really stop and realize that anything can happen any time. So if you missed the video where I talked about the little health scare that I had, long story short, 'cause the video is very long. It's actually about 17 minutes, but it does take you kind of through the whole process of what happened. But I ended up with a blood clot in my shoulder. Now, since that video came out, I do have a few more answers, not really that many more, but what was incredibly is hearing stories from you guys. It's so terrible though, that this is something that is so common and people don't even know the signs or the symptoms. And I was very blown away by how many other people who have been affected by this, not only you guys that have been affected personally, having it happen to you, but your members, your friends, people that you've lost because of a blood clot. And it seems so trivial. Like you don't actually realize how severe this is until unfortunately it's too late and that's when the severity of the issue kind of comes up. So now I just want everyone to know the signs, the symptoms. I even had an incredible call with the National Blood Clot Alliance, which I didn't even know that was a thing until I started Googling and finding out that there's really not that many resources, but they have so many incredible, comprehensive resources, things to look for. And I'll put a link in the description if you wanna check that out to get more information, because it has been very helpful for me. And I think now just knowing that there's a place that I can go to have these resources. And if you want more information that there's just a one stop blood clot shop for you to go to. And I know I've kind of been making light of the whole situation because that's kind of how I deal with things with humor. And even the whole time at the hospital, I was just trying to make jokes and keep my mind off of what was going on. But since then we have some updates, but where I kind of left off was the actual diagnosis of what I have is called thoracic outlet syndrome. In this kind of syndrome there's various different degrees of it. There's a bunch of things that kind of fall under that umbrella. So the one that I have is kind of the vein type thoracic outlet syndrome, where there's not actually enough space in my shoulder for the blood to flow to my arm. And this happens to a lot of athletes, to a lot of younger people who are very, I guess, doing a lot of repetitive motions like swimming, baseball, a lot of pitchers get this. And I've been doing a lot of martial arts over the past couple of years, more specifically like a lot of sword training, light saber, a lot of that same repetitive motion. I have basically beat my body up over the past couple of years. This is also something that is completely, I mean, it's not a topic that I want to get into. A lot of people have been coming after me and saying that I deserve this because I got the vaccine. This is what I get, this is what, I'm like I'm sorry, what, no matter what your beliefs are, I am not blaming the vaccine, but I'm also not denying that maybe that could have something to do with it because honestly we don't have all of the answers, but for those who are curious and just wanna really get their little noses into all of my medical history, I did not end up getting the booster shot because I had gotten, I have actually not had COVID. I did have the two shots and then I didn't get the booster because when I went to get it over Christmas, I ended up getting sick. And then through January, my sister ended up getting COVID. So then I never ended up getting the booster. And then now that this happened, I'll be definitely holding off for just a little bit, just because of the medications and stuff that I'm currently on, which I'm now on blood thinners for the next three to six months, just to get rid of the, part of the blood clot actually broke off in the hospital and went to my lung. And that's where things get very, very serious because it's very dangerous because that can travel. It can travel to your heart, it can travel to your brain. You can have a stroke and things happen very quickly. So I just wanted to get my vaccine history out there so that people can stop making up assumptions. I didn't even realize that this was an issue, this thoracic outlet syndrome. So my entire life I've been very active in sports. I've always tried to do a lot of strength training and lifting, but it has been so difficult for me. And I was just like, maybe I'm just weak and I need to work out more. But I have always struggled with doing like overhead presses or doing anything where my arms are held up, out to the side. I can't even explain the fatigue that I feel. And then my arms just slowly kind of drain. And they start feeling numb and this has happened my entire life. So this has not something that is a new occurrence, but I didn't know that there was a potential reason. And that reason could be purely anatomical, the way that a lot of people are kind of structurally built, their ribs can be placed up too high, or you can even have a freaking extra rib. And then that presses on nerves, on veins or the muscle tissue and stuff inside of here is all wound so tight that it starts pressing on things that it shouldn't. So that's where the surgery comes into play, where they either, oh my god, they remove your extra rib or they remove said first rib. And there's obviously a lot of complications that can come with that. They could puncture your lung because it's so close and they can do some sort of nerve damage. And then that can also ultimately lose feeling or then you can be left with chronic pain in your arm. I'm obviously one of the people that I'm like, okay, I obviously don't like hospitals. I've never really been to them. I'm always very healthy. So this was all a very scary experience, but it also made a lot of sense dating back to why I've always struggled with doing certain types of workouts. Now, a lot of people that I also have talked to who have had something similar have been diagnosed previous to the vaccine. I'm just giving you guys my story and all of the people that I've talked to have all had this prior to the vaccine. I'm not telling you what to do or what you shouldn't do, but I'm just giving you my personal experience. What has happened with me and how I'm gonna kind of now figure out what to do with the rest of my life. Because once you do have a blood clot that can then lead to others easily, that can then lead to others more easily. And now that I know the signs and symptoms to watch out for and the different kinds of activities that I have to be careful doing, I'm much more well informed but the route that I think that I'm gonna take for the next, however long, because they basically gave me two solutions. It's like, you're either gonna be on blood thinners for the rest of your life, or you're gonna have to get your ribs taken out. I'm like oh god, there's gotta be something else. So I did a little searching, I did a little Googling, as we all do, which I mean you could find a lot of good information, a lot of not good information, but most of the information that I found incredibly helpful was from people who have reached out to me personally, who said, hey, I've had this similar thing. This is what I did, and this is what worked for me. So I also had someone reach out and they worked with a physical therapist. And after doing a bunch of research as well, there are a lot of physical therapy things that you can do if you have this specific type of syndrome. So I'm hoping that physical therapy will work for me. I found a physical therapist. I'm gonna start working with her and see how that goes. Obviously, if surgery is the route that I'm gonna have to go, so that I'll be able to get back to doing light saber training and doing martial arts again, then I will probably go that route because I miss it so much. I've definitely not been in a very good state over the past couple of weeks. I'm saying that I haven't been filming videos, but it was honestly just by choice. I literally just could not put on makeup or come up here and make videos, but me overall, like my health, I feel great. I actually feel better than I did before I went in. So it was kind of like, okay, look, this thing happened to you, take as much time as you need, Justine, you hi, speaking to myself, if you wanna freaking watch TV for two weeks, go watch TV for two weeks because that is something that you don't really get an opportunity to do very often. So I was like, all right, I'm gonna freaking just really fully recover. I don't know if I'm fully recovered or now I'm just digressed back into, I don't know, not feeling well because I'm, it's like a vicious cycle of like, man, I'm just watching TV. I should be out doing something. And then it's just like, I'm sure all of you guys have kind of been in that sort of a situation, but all things considered I am doing very well. I just started getting back into a little workout plan. I mean, the doctor, when I left, I was like, yo, do you think I can run? He's like, yeah, sure you'll be fine. But slowly start getting back into running. I've been doing a lot of low impact kind of stuff. I've been trying to avoid doing any sort of arm movements, any type of weightlifting, just because I haven't met with the physical therapist yet. So I wanna have a professional assess what do you think I can do, what's the best way to tackle this. Other than that, I feel great. I've decided to stop drinking caffeine and that kind of stemmed from just not being able to drink it in the hospital. And this has been a purely, a personal choice. This has nothing to do with medical. No one has said that I should not drink it, but I can't even explain to you the difference in how I feel, I have this sense of calmness, coffee, I think is really was messing with me. And I didn't even realize it. Every single day I would have just, I was just anxious. Like my heart would be pounding. I would get worked up very easily about things like if something was going wrong, I would just be stressed. And now, I mean, for an example, my sister and I recorded a podcast and then we forgot to hit stop on the Road Caster and she unplugged it and we lost all the audio for the podcast after filming for two hours, recording this podcast. And I was just like, well, you know, that happened, it's fine. And before I would've been feeling so anxious and stressed out and just thinking of all of these other scenarios of well, how do I fix it? I'm just like that happened. I'll deal with it when I have to deal with it. And I think that most of that calmness has come from no caffeine and I don't think there's ever been a time that I have been off of caffeine like this long 'cause normally I would quit drinking coffee for a couple of days, but I would still be drinking Yerba Mate which has obviously caffeine in it as well. But I've been no caffeine for like, oh my god, 24 days now. The hospital, the most pain that I was in, I think was the migraines that I was getting from the lack of coffee and caffeine, that was more painful than the actual procedures and stuff that was happening, which was kind of crazy and kind of made me reassess, is that something that I want to be addicted to? And I was like, no, I don't. And even before if I was traveling, I would be packing Yerba Mate in my suitcase and I do miss it so much. But I think in the long run, not having that pendency and being reliant on something, I feel so free. And I think that freedom has kind of seeped sort of into, I don't know, my new stress free carefree kind of mode. I don't even know how to explain it. I've never felt this way before. Maybe it's because I had a near death experience or maybe it's cause I'm not drinking caffeine or maybe it's both. So I definitely highly recommend if you are feeling anxious and you drink a lot of caffeine, there's definitely a huge correlation. And this was like a couple years ago. I remember I think Tyler and I were filming and I just started, we were about to shoot. And I just started having a panic attack and it wasn't too aggressive or anything. And I was like, I can't film anymore, we have to stop and we just stopped filming and I just went and laid down. And I was just thinking about how much caffeine I was drinking. I would drink a cup of coffee in the morning, then I'd have another Yerba Mate, I'd have another cup of coffee for lunch. I'd have another Yerba Mate later. And I was like, I'm overloading my body. I'm basically I'm poisoning it essentially with so much caffeine. And it's like, my heart can't handle that. And just, I felt so weird. So I will say that the only thing that I did kind of fall off the boat on was I was trying not to eat candy or a lot of sugar, but it was Easter this past week and Easter candy, it's my weakness. I was losing it. I was like, oh my gosh, Easter candy, like peanut butter eggs, and just little egg chocolates. Ugh. So that I'm not proud of. But at some point I was like, you know what, I'm gonna freaking enjoy this Easter candy 'cause it is delicious. So I guess that was just kind of like a long update of kind of my personal wellbeing. I mean I'm feeling great. I think the one thing is concerning is obviously we don't really have like a set plan yet in action, but the fact that I'm still on the blood thinners is also a little bit scary just because if I do get cut or if I hit my head or if I hit a part of my body, I could potentially bleed out, could have internal bleeding, which is kind of a scary thought to be kinda walking around in your daily life and just have sort of this extra, I don't know, I need a bubble of protection around me, so I don't wanna be on blood thinners forever, but all things considered I'm leading a perfectly normal life right now. I'm clearly not doing my morning knife fight training, 'cause probably shouldn't be knife fighting on blood thinners. Well, I think the doctors thought I was joking when I was like, so I shouldn't be doing any knife fighting or any of that? Like no, no, of course not. I was like, okay. I think they thought it was a joke, but little did they know it was a very, very serious question. I did ask if you guys had any questions on Twitter. And so I thought I would answer a couple of those. Jake is asking what games did I play most during recovery? I didn't play any games. I watched so much TV that it's absolutely just so crazy. I have some press accounts that allow me to watch some early access to shows, which I'm not gonna tell you what, because I don't even know if they're out or announced, but I've watched so much TV, not proud of it, but I don't know I really, really enjoy it. This one's kind of interesting. Erin is asking if I can discuss my insurance situation and how that relates to the care that I received for as a creator can you elaborate, how, when, where is it easy to find good plans and care? So this is actually kind of difficult 'cause I don't really know what all my insurance plan is gonna cover. So I'm kind of finding that out as we go. I know I do have a pretty decent plan since I pay like I think like five to $600 a month for this. And I've been paying this forever since I am self-employed I do have, I mean, I think it's like a business kind of insurance plan, but I'm the only one on it. I think there are different tiers of plans, but I think one of the most important things that you can do is have health insurance. Like if there's something that you have to kind of put aside and not purchase or do without insurance is the most important thing. And I mean you can get various ranges of coverage. So I think finding something that could be the least expensive, but at least it's something. I mean, 'cause you have no idea. I mean I think my medical bills from that stay is going to be, I mean, it's gonna be over a half a million dollars easily because of all of the medication that I was on, I was in the ICU for two nights. I mean that alone is just astronomical plus ambulance, ER, all of those things are very, very, very expensive. And I think that there's so much that needs to be done with healthcare, not just insurance wise, but healthcare in general. I don't know, it's a mess over here and it's scary, but I'm so grateful, I had such incredible nurses. My sister was there every step of the way, she was washing my hands and brushing my teeth and brushing my hair. 'Cause I couldn't move. I was just, I was like in this position for three days straight, could not move. So you definitely realize what you can't do when you can't do something. And how much you miss that like simple things, like I just couldn't go to the bathroom. I had to have assistance going to the bathroom, not a fun time at all. But I guess getting back to your insurance question, I will keep you updated because I'm also terrified because there are some plans where I would have to pay 20% of the overall bill after it hits a certain point, which is like, well let me do the math. Actually I don't wanna do the math. But if my bill is like $800,000, I don't know, that's a lot don't wanna, I don't, I can't, I don't wanna think about it right now until I have to. And so far the bills have started trickling in. So uh. Evan is asking what is JPIG? So JPIG whether you like NFTs whether you hate them. This is a project that I've been working on and I've been hand drawing every single one of these. You guys can follow it on Twitter at JPIG. And I'm basically gonna try to do everything in my power to make sure that this is an NFT drop, that everyone who hates NFTs, this is kind of like taking that and spinning it. So it's not something that you will hate, won't be a cash grab. I'm gonna be doing it on an environmentally friendly chain. And it's basically gonna be kind of like an extension of me. I love pigs and they've always been such an incredible animal and I just love them so much. So this is gonna be kind of something separate from what I'm doing, but it's also what I'm doing. I've always wanted to have a really cool merch company. There's been so many things in the past that I haven't done that is pig themed. I have basically, I have like a full children's book that I kind of wrote many, many years ago that I never ended up releasing. So I kind of wanna have that be a part of it. There's incredible merch ideas that I have. And there's also just the aspect of being able to be a part of the community like the iJustine community. This is where we're gonna be, we're gonna be a part of the JPIG. Like you could become a JPIG, you could be yourself, but you can also be this character. So I'm so excited about it, I can't even explain. And I know there's so many scammy NFT projects and that's where it gets kind of interesting because yeah, a lot of these are scams. They're just people that you don't even know. And they're just releasing these projects and people are buying into the hype. I don't even care if this is hyped up. If you want it, do it. If you don't, don't, but I want it to be something that's accessible. I don't want it to be like this crazy out of reach project that my real true iJustine fans who have been here from the beginning, I need to find you guys, I have to find you and have a way to connect with you so that I can get you a pig. So that's my goal. I'm trying to figure it all out. And it's definitely not that easy, but I have all of the art done. I drew every single thing in Procreate. So just know that if you get a JPIG, I freaking drew it. I drew all of it. It's been so fun, I love it. I'm so, so, so excited about it, but yeah, I'm still figuring all that out, but if you guys wanna follow that, definitely do so. And I'm gonna find a way to try to find all of the hardcore IJ fans out there and make sure they can get a pig. So if that's you just, I'm coming for you. Renee is asking if Tim cook had a light saber, what color would that light saber be? I think it would be purple because when we were talking about the purple iPad, he seemed super into it. And I feel like, well actually in that video too. He was behind the rainbow little backdrop that was at Apple. So maybe it could be a rainbow light saber. That would be cool. And Emily's asking, will there be another vlog university soon? Oh my gosh, I've just been discussing this because that was such a fun time. And also as a part of JPIG, when you're a holder of one of these NFTs, you're gonna get access to other things. So it's like, I even envisioned that if you have a JPIG that would get you early access to getting tickets to vlog university, this would get you early access to basically anything that I'm doing outside of YouTube. So it's kind of, I'm just, oh, I was so excited about it. And it even kind of is stemming from, I went to the NFT LA conference a couple weeks ago and it was really, really fun. So it was kind of cool to be there as a community member and not someone who was actually presenting. And it was really kind of refreshing because I got to kind of take a step back and sort of see what the conference experience is like from who's attending as opposed to someone who is putting it on. So I feel like I learned a lot about that. Who knows what's gonna happen? Anything's possible, but vlog university was so fun and I had so much fun meeting you, Emily. And so many other people who came out. It'd be so funny if I didn't hit record. 'Cause if I didn't hit record, I'm just gonna go watch TV and just say, you're not getting a video 'cause, okay, we're recording now, oh my god. To say that, that hasn't happened before. Yeah I'd be a liar 'cause I've definitely thought I was recording or audio was recording and it wasn't. So that's the update. I honestly can't thank you guys enough for being so supportive and just all of your kind words and I mean, everyone has been just reaching out. It's meant so much to me I can't even tell you, couldn't even use my little fingers while I was in the hospital. So we didn't really tell very many people while I was there. 'Cause I didn't wanna be overwhelmed and just exhausted by trying to read messages. So I kind of kept it to myself for at least a week. And then finally, once I was out, had some answers, that's when I made the video. But if you do wanna go watch the full video, I'll put a link in the description and you can go check that out. And I guess if anybody ever feels not right, like you think something is wrong with your body. Don't hesitate, go advocate for yourself. If you think that it might be nothing, maybe it's nothing, but it could be something. Definitely you should be on the safe side and go get it checked out. Even if it's just at some sort of urgent care or something like that. Don't even know how time is of the essence. If I would've waited a little bit longer, I may have died, may have lost my arm. So just putting that in perspective of how something that can go from zero to 100 real quick, it can happen. With that I will see you guys in my next video. And I mean, might as well just say, hey, if you haven't subscribed, hit the subscribe button, hit the bell to be notified when I post new videos, which now I feel like I'm back. So I'm pretty hyped about it, kind of gave myself that recovery time, but I miss you guys. I miss creating, I miss editing. I'm gonna have to just not watch any more TV for a while. So I will see you guys in the next one. Bye. (upbeat music)",
    "transcript_keywords": [
        "kind",
        "lot",
        "things",
        "people",
        "blood clot",
        "blood",
        "guys",
        "JPIG",
        "thing",
        "Yerba Mate",
        "caffeine",
        "video",
        "blood thinners",
        "feel",
        "happened",
        "time",
        "back",
        "clot",
        "hit",
        "couple"
    ],
    "transcript_entity_values": [
        "zero",
        "the National Blood Clot Alliance",
        "Erin",
        "ER",
        "Yerba Mate",
        "the next three to six months",
        "one",
        "Jake",
        "iJustine",
        "iPad",
        "Renee",
        "a couple weeks ago",
        "Apple",
        "Justine",
        "YouTube",
        "a couple of days",
        "about 17 minutes",
        "the Road Caster",
        "Tim",
        "vlog university",
        "NFT",
        "24 days",
        "the past couple of years",
        "Procreate",
        "two weeks",
        "January",
        "Twitter",
        "a half a million dollars",
        "100",
        "LA",
        "three days",
        "Evan",
        "a couple years ago",
        "at least a week",
        "20%",
        "Emily",
        "many years ago",
        "JPIG",
        "another vlog university",
        "two hours",
        "healthcare",
        "two",
        "the past couple of weeks",
        "Easter",
        "IJ",
        "Tyler",
        "five to $600",
        "two nights",
        "Christmas",
        "first",
        "Easter this past week",
        "800,000",
        "Easter"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "DATE",
        "TIME",
        "FAC",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "PERCENT",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "EVENT",
        "ORG",
        "PERSON",
        "MONEY",
        "DATE",
        "DATE",
        "ORDINAL",
        "DATE",
        "MONEY",
        "ORG"
    ],
    "vector": [
        -0.04519956186413765,
        -0.07478687912225723,
        -0.038515739142894745,
        -0.11039811372756958,
        0.020188426598906517,
        0.006675625219941139,
        0.05331926420331001,
        0.0750853642821312,
        -0.025597169995307922,
        0.06365369260311127,
        0.026295313611626625,
        0.0082310251891613,
        -0.027860460802912712,
        0.016637276858091354,
        -0.007778401952236891,
        0.03587851673364639,
        0.020190993323922157,
        -0.02335108071565628,
        -0.052129607647657394,
        0.048569969832897186,
        -0.0541999377310276,
        -0.030381299555301666,
        0.036428842693567276,
        0.021205374971032143,
        -0.05260660499334335,
        0.09172660112380981,
        0.0017398435156792402,
        0.025882404297590256,
        -0.08728823810815811,
        -0.06421016156673431,
        -0.02218635566532612,
        0.017636334523558617,
        0.10305976122617722,
        -0.029262011870741844,
        -0.006125893443822861,
        -0.040727946907281876,
        0.04797913134098053,
        -0.010146016255021095,
        -0.04963940009474754,
        -0.018385108560323715,
        0.007713813800364733,
        -0.06401748955249786,
        0.016463305801153183,
        -0.0313120037317276,
        -0.047196049243211746,
        -0.08502532541751862,
        -0.004846743308007717,
        -0.06117599457502365,
        0.0705394372344017,
        0.057597823441028595,
        -0.11327040195465088,
        -0.023795830085873604,
        0.0509076826274395,
        0.028745539486408234,
        -0.0814557820558548,
        0.0019546952098608017,
        -0.09695480763912201,
        0.009201500564813614,
        0.014625867828726768,
        -0.09041968733072281,
        0.04247302561998367,
        -0.046074241399765015,
        0.026766987517476082,
        0.06539329886436462,
        -0.06408259272575378,
        -0.04894460365176201,
        0.039053015410900116,
        0.0030183549970388412,
        0.006286705378443003,
        0.018035104498267174,
        -0.12644261121749878,
        0.04989202320575714,
        -0.03278035297989845,
        0.028618033975362778,
        -0.0015122140757739544,
        0.07216024398803711,
        0.046064648777246475,
        -0.06502377986907959,
        0.029878411442041397,
        0.06361953914165497,
        0.01838330551981926,
        -0.05462653562426567,
        -0.060582805424928665,
        -0.014566737227141857,
        0.009988063015043736,
        0.04761699587106705,
        0.025910157710313797,
        0.023542817682027817,
        -0.04299411177635193,
        -0.06241385266184807,
        -0.07770632207393646,
        -0.00011680483294185251,
        -0.015481898561120033,
        -0.011711237952113152,
        -0.020837124437093735,
        -0.036471616476774216,
        -0.046563174575567245,
        -0.07191962748765945,
        -0.04339902848005295,
        0.07708225399255753,
        0.0382966548204422,
        -0.05868880823254585,
        0.002763317199423909,
        -0.007809940259903669,
        -0.039723362773656845,
        -0.11381005495786667,
        -0.0593726672232151,
        0.02469678781926632,
        0.038814932107925415,
        0.02413860149681568,
        -0.03063342161476612,
        0.05776070058345795,
        -0.06293854117393494,
        -0.04599421098828316,
        0.02143549732863903,
        0.12393040210008621,
        -0.015591747127473354,
        0.07491947710514069,
        0.03226551041007042,
        0.015599817968904972,
        -0.0041695223189890385,
        -0.08385392278432846,
        -0.032196976244449615,
        0.02705211006104946,
        0.02128002978861332,
        0.03338153660297394,
        -0.06344753503799438,
        1.3354641444162279e-32,
        -0.011082768440246582,
        0.062235262244939804,
        0.04471337050199509,
        0.05563971400260925,
        -0.024775300174951553,
        -0.04301195591688156,
        -0.04304215684533119,
        0.08292683213949203,
        0.0006030891090631485,
        -0.005538264289498329,
        0.0017669672379270196,
        0.05380536988377571,
        -0.02397812344133854,
        0.038863614201545715,
        0.0037394706159830093,
        -0.05660146102309227,
        -0.029094481840729713,
        -0.03276583179831505,
        -0.06577537208795547,
        0.012590054422616959,
        0.013898995704948902,
        -0.06021876633167267,
        0.02699824795126915,
        0.09806104749441147,
        0.10153065621852875,
        0.09373096376657486,
        0.06843267381191254,
        0.03039599023759365,
        0.07533606141805649,
        -0.0015505552291870117,
        -0.05184929445385933,
        -0.04904245212674141,
        -0.005474759731441736,
        -0.13229870796203613,
        -0.024307213723659515,
        -0.0010923412628471851,
        -0.05843832343816757,
        0.006768462713807821,
        -0.020342066884040833,
        -0.027070587500929832,
        -0.013992933556437492,
        0.03734084591269493,
        -0.04113081097602844,
        -0.060135696083307266,
        0.10168109089136124,
        0.039559319615364075,
        0.05108179897069931,
        0.0801195278763771,
        -0.04077848047018051,
        -0.008242592215538025,
        -0.04037224501371384,
        -0.012010329402983189,
        -0.03844695910811424,
        -0.004032011143863201,
        -0.037622734904289246,
        -0.05662931874394417,
        -0.033573444932699203,
        0.059140030294656754,
        0.03853440284729004,
        0.06710828840732574,
        0.029178431257605553,
        -0.015607309527695179,
        0.004852268844842911,
        -0.030803309753537178,
        -0.05053967237472534,
        0.09413140267133713,
        0.06792595237493515,
        -0.04402763396501541,
        0.020741257816553116,
        0.06456758826971054,
        0.0052290428429841995,
        0.00280408700928092,
        0.030004356056451797,
        0.02315775491297245,
        0.04281557351350784,
        0.07213184237480164,
        -0.0918339416384697,
        -0.05441918224096298,
        0.012805424630641937,
        -0.042871683835983276,
        -0.09677530825138092,
        0.07581078261137009,
        -0.015125159174203873,
        0.11788084357976913,
        -0.034266769886016846,
        -0.07758987694978714,
        -0.0006708074943162501,
        -0.017472291365265846,
        -0.03485582396388054,
        -0.005499649792909622,
        -0.01419811975210905,
        0.09624361991882324,
        -0.06690829992294312,
        -0.0409979373216629,
        -0.0324702225625515,
        -1.309090900097973e-32,
        0.01545036118477583,
        0.027267109602689743,
        -0.010205636732280254,
        -0.013995671644806862,
        0.06467283517122269,
        -0.028135117143392563,
        0.052811454981565475,
        0.08442018181085587,
        0.0864086002111435,
        -0.07856880873441696,
        0.07238973677158356,
        -0.07001355290412903,
        -0.13891413807868958,
        -0.005838961340487003,
        -0.036619894206523895,
        -0.012956121005117893,
        -0.06719274073839188,
        -0.06730376929044724,
        0.05514967814087868,
        -0.009036888368427753,
        0.07183229178190231,
        0.14315743744373322,
        0.08954721689224243,
        0.025704262778162956,
        0.008600108325481415,
        0.031671684235334396,
        0.02005038969218731,
        0.046632636338472366,
        0.0595005638897419,
        0.0077490899711847305,
        -0.020583713427186012,
        -0.05176224932074547,
        -0.04791168123483658,
        -0.01387633103877306,
        0.04080766439437866,
        0.042060740292072296,
        0.018046274781227112,
        0.014253415167331696,
        0.008196795359253883,
        -0.0655495673418045,
        0.05300530418753624,
        0.02079671248793602,
        -0.002585616195574403,
        0.0015508558135479689,
        0.009370209649205208,
        -0.09993162751197815,
        -0.042679134756326675,
        0.014925945550203323,
        -0.0012388891773298383,
        0.01093793474137783,
        -0.047046441584825516,
        -0.04909619316458702,
        -0.022557813674211502,
        -0.01577649638056755,
        0.00110461690928787,
        -0.012184899300336838,
        -0.061894066631793976,
        -0.03654218092560768,
        -0.004970789887011051,
        -0.008560537360608578,
        0.003355978522449732,
        -0.03441914916038513,
        -0.095649354159832,
        -0.07277941703796387,
        6.502235919469967e-05,
        -0.036175698041915894,
        0.1138845682144165,
        0.018629401922225952,
        0.000774173007812351,
        -0.011418030597269535,
        -0.004901102278381586,
        0.019189972430467606,
        0.05083083733916283,
        -0.012015366926789284,
        0.05840370059013367,
        -0.014641668647527695,
        -0.08126210421323776,
        -0.018025308847427368,
        0.059238117188215256,
        -0.028232786804437637,
        -0.052771445363759995,
        -0.051227714866399765,
        0.014706983231008053,
        0.055843286216259,
        0.08192391693592072,
        0.10098510980606079,
        0.08182252198457718,
        -0.03701998293399811,
        -0.011589501984417439,
        0.05825095251202583,
        0.01247486099600792,
        0.073996402323246,
        0.031127268448472023,
        0.1029844731092453,
        -0.09617036581039429,
        -6.638768468292255e-08,
        0.05238315835595131,
        0.004309163894504309,
        -0.032506417483091354,
        0.015584691427648067,
        0.01123706717044115,
        -0.08448577672243118,
        -0.03684648871421814,
        0.03819457069039345,
        0.04931139573454857,
        -0.04772982373833656,
        0.07336844503879547,
        0.010781669989228249,
        0.03644917905330658,
        0.09662768244743347,
        0.039318740367889404,
        0.018329724669456482,
        -0.11353329569101334,
        0.09636852145195007,
        -0.0552406944334507,
        -0.07465196400880814,
        -0.05870721489191055,
        0.043556537479162216,
        0.03887462243437767,
        -0.026475803926587105,
        0.06417153030633926,
        -0.0055386642925441265,
        -0.012810713611543179,
        -0.03712064400315285,
        0.03145235776901245,
        0.0074965134263038635,
        -0.06645844876766205,
        -0.005266197025775909,
        0.024362005293369293,
        -0.007149153854697943,
        -0.0567423440515995,
        -0.05437926948070526,
        -0.02346682734787464,
        -0.020356858149170876,
        0.020628759637475014,
        0.04598638415336609,
        -0.004192119464278221,
        -0.10667439550161362,
        -0.0510224811732769,
        0.01826031506061554,
        0.0118991918861866,
        -0.08246652036905289,
        0.039745911955833435,
        -0.06310398131608963,
        -0.02531183883547783,
        -0.041894447058439255,
        -0.04762788861989975,
        0.04264140501618385,
        0.05532563477754593,
        -0.04674732685089111,
        0.04498865827918053,
        0.004152235109359026,
        0.02153504639863968,
        0.0656227320432663,
        -0.018607037141919136,
        -0.012286916375160217,
        0.045144788920879364,
        -0.022701885551214218,
        -0.051190514117479324,
        0.021466171368956566
    ]
}