{
    "id": "2fGXDFiFBhg",
    "title": "DON'T Buy The iPhone X",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2017-11-26T15:59:15Z",
    "video_url": "https://www.youtube.com/watch?v=2fGXDFiFBhg",
    "category": "Science & Technology",
    "tags": [
        "iphone x",
        "iphone x review",
        "iphone",
        "review",
        "apple iphone x",
        "apple iphone",
        "iphone x unboxing",
        "iphone review",
        "iphone unboxing",
        "x review",
        "x unboxing",
        "new iphone",
        "iphone x vs",
        "vs",
        "iphone 8",
        "apple",
        "iphone 8 plus",
        "iphone x vs iphone 8",
        "unbox therapy",
        "unbox",
        "unboxing",
        "unboxtherapy",
        "2017",
        "iphone x hands on",
        "iphone 8 vs x",
        "iphone 10",
        "iphone x vs 8",
        "iphone x vs 8 plus",
        "iphone 7 vs 8",
        "don't buy iphone x",
        "iphone x worth it",
        "iphone x vs iphone 8 plus",
        "reasons not to buy iphone x",
        "android"
    ],
    "views": 11720213,
    "likes": 320932,
    "comments_count": 61464,
    "description": "I used the iPhone X for 2 weeks. I dont think you should buy the iPhone X. Follow me on Twitter for giveaway -  Sponsored by GoDaddy, check out GoCentral here -   The iPhone X is the latest Apple flagship smartphone. With the iPhone X Apple has entered the realm of near bezel-less smartphones. The screen-to-body ratio on the iPhone X is one of the most impressive on the market. The camera on the iPhone X is also market leading and competitive with the Google Pixel 2 XL. Many users will be happy living with the iPhone X but I think the purchase is tough to justify. Given the emergence of truly high quality smartphone options retailing for half the price. Devices like the OnePlus 5T, Essential Phone, Razer Phone and even the heavily discounted Samsung Galaxy S8 offer better value for money. The iPhone X is not twice as good as any of those devices. Of course, this is my opinion There is no perfect smartphone, just the best smartphone for you. The iPhone X will be great for some but I think most would be better served pocketing the extra $500 and grabbing something like the OnePlus 5T. __________________________________________  WATCH SOME MORE VIDEOS...  The Super Smartphone You've Never heard Of...   This 3D Audio Experience Will Blow Your Mind (Wear Headphones)   How LOUD Is The Razer Phone? (vs iPhone X, Pixel 2 XL, Note 8)   OnePlus 5T Unboxing - Is This The One?   The Most Insane Workstation + Gaming Setup   Removing The Notch From iPhone X   The Best 9 Dollars You'll Ever Spend...   Switching to the iPhone X   The Smartphone Battery Life World Champion - 10,000mAh!   The Dual Screen, Foldable Smartphone Is REAL!   The $2800 Game Console You Didn't Know Existed...    How terrible is a $58 smartphone?   The iPhone X Unboxing You Deserve.   Razer Phone Unboxing - My New Daily Driver?   You'll Never Guess What's Hidden In This Hat...   Google Pixelbook Unboxing - Could You Switch?   DON'T Buy A Wireless Speaker Without Watching This...   Xbox One X Unboxing   The Most INSANE Dual 75-inch Screen Setup!   Unboxing The iPhone X Clone Edition   You've Never Seen A Keyboard Like This...   Samsung Galaxy S9 Concept   You've Never Seen Shoes Do This...   TOP SECRET SMARTPHONE UNBOXING   The Fidget Spinner Phone Is Real...   They Say It's The Fastest In The World...   Would You Wear This Thing In Public?   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://twitter.com/unboxtherapy",
        "http://go2l.ink/lewis2",
        "https://youtu.be/HkdoOyIRCj4?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/40r8JE7aVI8?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/Rh_iWXRxIY4?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/0KcvQpRdCzQ?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/2oGjBA0OcO8?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/0VNjuoiAEd0?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/9r462oO1cUU?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/3t2jdkDBfPc?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/MLiZf6ZYA_8?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/jpdR-bdV08c?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/aCGRXLJFSUg?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/r-AREHFBjZ4?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/AJtnrsuzJbY?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/Qrlo3Dbr7YI?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/8sj_aIz11Rs?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/4bdwBjBaJvI?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/Db17w0DjDS0?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/0CrwDj5zcT4?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/LJMpjVx0xjQ?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/Szuw_XJsv1w?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/8b0TenoBMTo?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/nTCsZFkK36o?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/1WnbD0YVAlE?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/ZRxenHv0oPs?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/DjKEZbe4V9M?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/JMZbfc9MFE4?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/ICfeLG-yXH0?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "It's time to make... ...a very highly anticipated video. I've been compiling some ideas. I've been doing my job. Because a little while back, I made a video called: Switching to the iPhone 10 And you probably noticed that in front of me, there's an iPhone X right here. When a new smartphone comes in here, I don't always switch over to it exclusively. I don't always put my SIM card into that device. But you see this device here, this is a flagship, this gets a lot of attention. The notch, the lack of the home button, the lack of the fingerprint scanner. So because of that, I had to make an effort to really invest myself into it. So I could give you guys the type of feedback that might help you determine whether or not this phone is for you. I do wanna let you know that there is no perfect smartphone. No single smartphone that it's the best smartphone for absolutely everyone, so because of that, I'm gonna be having a giveaway coming up shortly, for the smartphone of your choice. Android or iOS? You pick the smartphone and I give it away. So go follow me on Twitter right now and stay tuned for a tweet with all the details. Alright, the iPhone. First of all, I'm happy Apple was ambitious. They said, \"Hey, it's time to finally do something different!\" Now, it's not because they thought it would be fun to do so, It's because the market place have been pushing in that direction. We've had shrinking bezels from almost every major competitor in the smartphone space. We want more screen, we don't want bigger phone. Anytime you're making a change, you're taking a risk. You get rid of the home button? You're gonna have some users that are like \"But, wait, I- I- I- liked it\" Your quick settings moving up to the top right corner, that had to be utilized for this new home gesture, let's call it. Which also accesses the multitasking gesture. I think a lot of what's being talked about from an interface perspective, feels a little bit disjointed. A lot of that comes from your preconceived notions of how you're going to interact with the device You expect things to work a certain way and when they don't work that way, it's going to take a while to adjust. The face unlock...it works... but the process is not something that I consider to be enjoyable. And it's something that I speculated might come up for me when I saw the original keynote. \"It's as easy as looking at it and swiping up..and--ya know...Let's try that again. Oh-ho-ho\" You know I'm lying in bed, I wanna reach over and quickly unlock it, and my glasses are off and my hat is off and it will miss. Alright? Now with fingerprint scanner that doesn't happen. But there's also, kind of strange way that you interact with it, is almost like bowing to your phone. You adjust you, \"clearing throat sound\" there is a little bit of that. Sometimes there's a little bit of a an adjustment here. You when you will get a little unlock there You're not done. It's an unlock, and then it's a swipe up It's a two step process. I'm a fan of technology so I like that progression. But then also I picked up the OnePlus 5T, and was like BWAMM! I have it over here. I pointed towards you, NADA! BAAAMMMMM!!! IT'S A THING! It's just using the front facing camera. You see that right there? You wanna go fingerprint, GO FINGERPRINT! .2 seconds. Options are good. The camera is good, maybe the best. Cameras good. Build quality is solid, it feels great. It just feels expensive Wireless charging. Finally, it's great. Using it in my car, use beside the bed. I never charged it with a cable, not once. Weirdly though. Because of how much this camera protrudes here. Some wireless chargers, make contact better than others. That camera hump rears its ugly head as well. The speaker! The second loudest speaker that I tested on smartphone after the Razer Phone, which is huge and has these, these giant speaker units. I wanna give you the backstory on how I got to this phone as my daily driver. Galaxy S8. Moved on the S8 Active. Bigger battery. To the Pixel 2 XL \"We got the fancy wallpaper, with the waves coming in beautifully.\" Took the SIM and I put that to the Razer Phone. My goodness... with the 120 hertzs, Yes! That's what it should look like. Comes at a cost, because you're not getting an OLED display. Gotta have the OLED. I gotta have it! So the SIM card came out, and it went into the OnePlus 5T. You saw that unboxing video. But to round up my feelings here about the iPhone X, it's an ambitious project for Apple here, they're trying to change the core interaction that you've had with your iPhone forever. I like ambitiousness. But the problem is, when you're a device, that's a thousand dollars plus. I'm not sure you paying strictly for ambition. What you want is no excuses. I don't think you can have excuses in a thousand bucks. Because a thousand bucks now represents twice the price of something like the OnePlus 5T. I get an enormous number of notifications. Probably, 400 e-mails a day. But when I switched to this phone, I had exposure to the notification system that exist on here. I'm not telling you anything new when it comes to notifications. I'm not the first person who's complained about it. But on Android, if you've ever used it, it will stack 'em. And you can drag down and see the most recent one. But this is a good phone. I think a lot of people would buy this thing and be happy with it. But that doesn't change the fact that I don't think that you should. And I don't think that you should because of the price. Because to me, there's no way that this phone is twice as good as this phone. That's the OnePlus 5T. It's not two times better This is $499. Snapdragon 835, Dual Lens System with Portrait mode, Fingerprint Scanner works in .2 seconds, facial recognition which works way faster than the iPhone, dual SIM card tray instead of single. A headphone jack for the headphone lovers because why not? Slightly less pixel density. But still OLED, 6-inches. I'd be showing this display to people. I'd put this display, this display, and this display. Almost everybody pick the OnePlus display. These are all nice displays. The trouble is there is only one phone in here that's a thousand dollars and up. ONLY ONE! Android phones are getting good. The competition that exists is driving the price of better down. That's an S8 just below $600 probably on Amazon. That's the OnePlus 5T, $500. And this on the far right, is of course the Essential Phone. $449. It's a lot more competitive now. I know, in this audience right here there are die hard iOS users, and I respect that. And I know there's value there, for you as an individual. You could get a OnePlus 5T and an Xbox, for less than the iPhone. You could get the OnePlus 5T and an extra one as a gift for your spouse. You could get a OnePlus 5T and a plane ticket for a vacation, for less than the iPhone. It's my responsibility to bring light to that. This phone is not two times better than that phone. I'm sitting here because you guys trust me to tell you what I'm thinking. I just can't tell you to buy this phone. My recommendation is to not buy the iPhone X. If you look around, you will be amazed at what's happening at half the price. What I want you to do is leave a comment down below, and let me know what you're gonna do with that extra $500 in your pocket. This episode of Unbox Therapy has been sponsored by GoDaddy. You've probably heard of them. It's the place for you might have registered a domain in the past. And now they've got this new thing called Go Central so you can very easily build your own website probably in under in an hour. And here's a thing you can use Go Central on a laptop, on a desktop, but also on a mobile device. You can sit in there in a coffee shop on your smartphone setting up your new project. Head over to the link down in the description for a one month free trial and there is no credit card needed for that trial. So you can, you can mock up, your own website. You can do it for free thanks to GoDaddy. And because of their sponsorship, we were able to give away a bunch of smartphones. In fact, three smartphones that I'll be giving away on Twitter so go follow me there and the smartphones is gonna be your choice. If you happen to win, it could be any of this. It could be a Pixel 2 XL It could be the Razer Phone. Hey, even the iPhone X if you think it's perfect for you o-or even ones that aren't here. If you win this giveaway, you might be building your website on this device right here. Full details are gonna be on my Twitter. So like I said earlier, make sure to be following me there. And let me know in the comments if you win, which one will you pick? Video subtitled and corrected by: LightFlame_",
    "transcript_keywords": [
        "phone",
        "smartphone",
        "iPhone",
        "Razer Phone",
        "OnePlus",
        "device",
        "display",
        "good",
        "SIM card",
        "fingerprint",
        "SIM",
        "lot",
        "fingerprint scanner",
        "THING",
        "Razer",
        "camera",
        "OLED",
        "give",
        "make",
        "unlock"
    ],
    "transcript_entity_values": [
        "the S8 Active",
        "BWAMM",
        "Twitter",
        "OnePlus 5",
        "OnePlus",
        ".2 seconds",
        "one month",
        "600",
        "an hour",
        "iPhone",
        "Unbox Therapy",
        "6-inches",
        "499",
        "a thousand dollars",
        "first",
        "Fingerprint Scanner",
        "LightFlame",
        "First",
        "the Essential Phone",
        "NADA",
        "OnePlus 5T",
        "500",
        "jack",
        "Apple",
        "only one",
        "two",
        "a thousand bucks",
        "second",
        "Galaxy S8",
        "SIM",
        "Android",
        "449",
        "Pixel 2 XL",
        "Twitter",
        "the Razer Phone",
        "daily",
        "Amazon",
        "S8",
        "BAAAMMMMM",
        "Xbox",
        "three",
        "half",
        "400",
        "120"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "TIME",
        "DATE",
        "MONEY",
        "TIME",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.019181083887815475,
        0.04902883991599083,
        0.09849848598241806,
        -0.03758412227034569,
        0.018125299364328384,
        0.03019418939948082,
        0.02440604381263256,
        0.09619960188865662,
        0.0024206629022955894,
        0.017853714525699615,
        0.00012111951218685135,
        0.00973032508045435,
        0.02363405004143715,
        -0.01933436468243599,
        0.05543539673089981,
        -0.011065894737839699,
        0.12559200823307037,
        -0.045803721994161606,
        -0.0720023363828659,
        0.045324455946683884,
        -0.002724352292716503,
        -0.05411195382475853,
        0.055824197828769684,
        -0.020065195858478546,
        0.055863168090581894,
        0.054964810609817505,
        -0.07693753391504288,
        -0.09626476466655731,
        -0.04289329797029495,
        -0.02094256319105625,
        0.013646034523844719,
        0.10348731279373169,
        -0.024048510938882828,
        -0.010414988733828068,
        -0.033163588494062424,
        -0.035659924149513245,
        0.04109688848257065,
        -0.001984466565772891,
        -0.03255481272935867,
        -0.03199384734034538,
        -0.01234324648976326,
        -0.013460376299917698,
        -0.029130607843399048,
        0.04076221212744713,
        -0.0054349941201508045,
        -0.06756807118654251,
        0.0696379691362381,
        0.017517467960715294,
        0.039193183183670044,
        -0.007715741638094187,
        0.023636100813746452,
        0.009666071273386478,
        0.006243414711207151,
        0.028547942638397217,
        -0.022325215861201286,
        0.040952883660793304,
        -0.041651651263237,
        -0.048598822206258774,
        -0.011638714000582695,
        -0.07164354622364044,
        0.03128618001937866,
        0.037301596254110336,
        0.02876552753150463,
        0.07165782153606415,
        0.015005310997366905,
        -0.021521737799048424,
        -0.014681275002658367,
        -0.07173918187618256,
        0.025000477209687233,
        0.0685957670211792,
        0.005137955769896507,
        0.015357027761638165,
        0.01334903109818697,
        -0.025865165516734123,
        0.024951081722974777,
        0.01586824096739292,
        0.041198380291461945,
        -0.04680084064602852,
        -0.009962882846593857,
        0.04458054155111313,
        0.04573197662830353,
        0.03404567763209343,
        -0.0514247864484787,
        -0.027394065633416176,
        -0.02638504095375538,
        -0.03686809167265892,
        -0.024851931259036064,
        0.08539074659347534,
        -0.018055543303489685,
        -0.03934100642800331,
        -0.010805034078657627,
        0.12110701948404312,
        -0.015921711921691895,
        -0.006549059879034758,
        0.034365519881248474,
        0.034151412546634674,
        -0.028305135667324066,
        -0.05277490243315697,
        -0.03959839418530464,
        -0.04272136837244034,
        0.05905357748270035,
        -0.018519574776291847,
        0.03228990361094475,
        -0.020918413996696472,
        0.030542222782969475,
        -0.12445451319217682,
        -0.08328358083963394,
        -0.04063543304800987,
        0.010046343319118023,
        0.07482141256332397,
        -0.028688956052064896,
        -0.07953540980815887,
        -0.0581282302737236,
        0.057889148592948914,
        -0.002077616984024644,
        0.028744008392095566,
        0.03088773787021637,
        0.03510615602135658,
        0.10403136909008026,
        0.024014435708522797,
        0.02244865894317627,
        -0.039563052356243134,
        -0.10720618814229965,
        0.04719466716051102,
        -0.01322657149285078,
        -0.02134806662797928,
        -0.03874623775482178,
        5.043069497041299e-33,
        -0.10285823792219162,
        0.08617983013391495,
        -0.030055781826376915,
        -0.0019214738858863711,
        -0.020090557634830475,
        0.0021018784027546644,
        0.09880129992961884,
        0.02992398850619793,
        -0.012801900506019592,
        0.07256045192480087,
        -0.08959496021270752,
        0.015208035707473755,
        -0.04941878840327263,
        0.047504980117082596,
        0.06759583204984665,
        -0.06257518380880356,
        -0.0569269061088562,
        -0.034211497753858566,
        -0.014790931716561317,
        0.02919105812907219,
        -0.012102479115128517,
        -0.04288323596119881,
        -0.04181528836488724,
        0.039011698216199875,
        -0.014712189324200153,
        -0.06148436293005943,
        0.07221437990665436,
        -0.05524083226919174,
        0.0004188573220744729,
        -0.034539882093667984,
        -0.07219851016998291,
        -0.01906297542154789,
        0.07055377215147018,
        -0.029387854039669037,
        -0.07455088943243027,
        0.04592647776007652,
        0.025706341490149498,
        -0.017507849261164665,
        0.03129853680729866,
        0.02067244052886963,
        -0.09075741469860077,
        0.05796775221824646,
        -0.012257448397576809,
        -0.015567552298307419,
        0.12447604537010193,
        0.053643643856048584,
        -0.04018824175000191,
        -0.05088333040475845,
        -0.05137684941291809,
        -0.10370153933763504,
        -0.007442530710250139,
        -0.03760555014014244,
        0.02274276502430439,
        -0.024809205904603004,
        -0.062091052532196045,
        0.015447067096829414,
        0.0009410018683411181,
        0.015356183983385563,
        -0.03709319233894348,
        0.0603749118745327,
        -0.05293336138129234,
        -0.028971046209335327,
        -0.0928286537528038,
        0.03874797746539116,
        -0.07595666497945786,
        0.05893755331635475,
        0.014734411612153053,
        -0.020698318257927895,
        -0.10094408690929413,
        0.1388864666223526,
        -0.01596640981733799,
        -0.009257507510483265,
        0.06604120880365372,
        -0.03700917214155197,
        0.09513956308364868,
        0.05229247733950615,
        -0.03697967529296875,
        -0.006495686713606119,
        0.03402097895741463,
        0.04384996369481087,
        0.015910912305116653,
        0.0626615509390831,
        0.03242190554738045,
        0.04683670774102211,
        0.033458296209573746,
        -0.019616253674030304,
        -0.043622925877571106,
        0.01612384431064129,
        -0.006053628399968147,
        0.08482272922992706,
        0.005038822535425425,
        0.034994859248399734,
        -0.05840117111802101,
        0.009500841610133648,
        -0.0069346013478934765,
        -5.2060756660118105e-33,
        0.005268139764666557,
        -0.059037063270807266,
        0.05256184935569763,
        0.0347006618976593,
        0.05592242628335953,
        -0.004274788778275251,
        0.018049389123916626,
        0.023075038567185402,
        0.0279940627515316,
        -0.017694823443889618,
        -0.01960863545536995,
        0.014034091494977474,
        -0.019185811281204224,
        0.08434890955686569,
        -0.028612568974494934,
        -0.015049259178340435,
        -0.014832090586423874,
        -0.10836700350046158,
        0.010819165967404842,
        -0.011565039865672588,
        0.06373343616724014,
        0.05927081033587456,
        0.007496890611946583,
        -0.0015720624942332506,
        -0.07196098566055298,
        -0.03644818440079689,
        -0.021030543372035027,
        0.010724917985498905,
        0.007197726052254438,
        -0.0693230926990509,
        -0.03895057365298271,
        -0.0936218872666359,
        0.05008377879858017,
        -0.0028680942486971617,
        0.07996116578578949,
        0.008047256618738174,
        -0.015032975003123283,
        0.013555251993238926,
        -0.015053530223667622,
        0.03502124547958374,
        0.023233961313962936,
        0.03030429594218731,
        0.005512476433068514,
        -0.02974209561944008,
        0.13571453094482422,
        0.015782397240400314,
        -0.020582979544997215,
        0.035099465399980545,
        0.040756188333034515,
        0.10339663922786713,
        -0.01940890960395336,
        0.03984145447611809,
        -0.048981886357069016,
        0.03787608817219734,
        -0.09369402378797531,
        -0.0028145210817456245,
        -0.008264676667749882,
        -0.0696471631526947,
        0.013571261428296566,
        0.0037742415443062782,
        0.031115230172872543,
        0.08902449905872345,
        -0.038020603358745575,
        -0.003594721434637904,
        -0.05176352337002754,
        -0.0626852735877037,
        0.04433198645710945,
        0.014389664866030216,
        -0.049901433289051056,
        -0.025231093168258667,
        -0.07981155067682266,
        -0.07160072028636932,
        -0.05540504679083824,
        -0.10451527684926987,
        -0.008611601777374744,
        0.1100572794675827,
        -0.06338996440172195,
        -0.0265183262526989,
        0.06055114045739174,
        -0.00034644216066226363,
        0.0013065544189885259,
        0.06368459761142731,
        0.06192558631300926,
        0.02587207593023777,
        0.11310762912034988,
        0.0806630551815033,
        0.020009249448776245,
        -0.020356738939881325,
        -0.034211624413728714,
        0.004912270698696375,
        0.014834802597761154,
        -0.04799192026257515,
        -0.05941617116332054,
        -0.03297305107116699,
        0.054729852825403214,
        -5.067788322321576e-08,
        0.008229383267462254,
        -0.027597790583968163,
        0.04774447903037071,
        -0.048119232058525085,
        -0.01967126876115799,
        -0.060893747955560684,
        -0.005804563872516155,
        -0.013791574165225029,
        0.17200155556201935,
        0.03769174963235855,
        0.02060585841536522,
        -0.10993867367506027,
        -0.10117483139038086,
        0.05558492988348007,
        -0.05554002523422241,
        0.032127633690834045,
        0.012835890054702759,
        0.03309422731399536,
        0.026020875200629234,
        0.01692860946059227,
        -0.007255605421960354,
        0.023853424936532974,
        0.029969213530421257,
        -0.07722140848636627,
        -0.0007828500238247216,
        0.008341459557414055,
        -0.055985528975725174,
        -0.056351225823163986,
        0.06448710709810257,
        0.02073810249567032,
        -0.05491340160369873,
        -0.07266654074192047,
        0.02088344283401966,
        0.042709819972515106,
        0.011563887819647789,
        -0.10797756910324097,
        -0.019932938739657402,
        -0.042100563645362854,
        0.0823611319065094,
        0.015570517629384995,
        0.06306450068950653,
        -0.0879921019077301,
        0.04017650708556175,
        -0.014166331849992275,
        0.043992165476083755,
        -0.13458086550235748,
        0.0735270231962204,
        -0.14376300573349,
        0.0018604067154228687,
        0.026415986940264702,
        0.0003959262394346297,
        -0.0516650415956974,
        0.007744758389890194,
        -0.08316531777381897,
        0.03539865091443062,
        0.005452569108456373,
        0.0418037585914135,
        0.011031029745936394,
        -0.047715023159980774,
        0.09049928188323975,
        0.027831198647618294,
        -0.08443759381771088,
        -0.02455492690205574,
        0.06174597889184952
    ]
}