{
    "id": "2fKIaalk4_w",
    "title": "I should stop building computers - ASUSTOR Flashstor NAS",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-06-10T17:00:25Z",
    "video_url": "https://www.youtube.com/watch?v=2fKIaalk4_w",
    "category": "Science & Technology",
    "tags": [
        "ltt",
        "linus tech tips",
        "gaming",
        "pc",
        "pcmr",
        "computer",
        "nas",
        "networking",
        "server",
        "nvidia",
        "amd",
        "asustor",
        "linus"
    ],
    "views": 1958255,
    "likes": 58858,
    "comments_count": 1989,
    "description": "Check out Supermicro's AMD-powered server technologies at the link below:   Save 10% and Free Worldwide Shipping at Ridge by using offer code LINUS at   We built a crazy expensive portable NVMe video editing server earlier this year, but then ASUSTOR launched this, a substantially less expensive machine that does basically the same thing.  Buy an Asustor Flashstor 6 Portable NAS:  Buy Crucial 3200MHz CL22 2x16GB DDR4 RAM:  Buy SABRENT Rocket 4TB NVMe M.2 SSD:  Buy an Ubiquiti Switch Flex XG:  Buy an Apple Macbook Pro M2 14\":  Buy a CalDigit External 10 GbE Adapter:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 ASUSTOR did it better than us 0:54 Specs and IO 2:07 Let's look inside 6:00 Adding RAM and SSDs 10:20 Testing",
    "description_links": [
        "http://www.supermicro.com/aplus",
        "https://www.ridge.com/LINUS",
        "https://geni.us/QwAP02",
        "https://geni.us/x7Ag1FP",
        "https://geni.us/J3AN",
        "https://geni.us/Coynsyh",
        "https://geni.us/8NSzhI",
        "https://geni.us/SF3l",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Last year, we put together an absolutely wild miniature server so that we could travel to trade shows with a team of editors and still use the same high-performance workflow on the road. And then, ASUSTOR comes up with this thing that does everything that our DIY machine did at a quarter of the price, half the size, and with zero jank. That's not even fun! How could it possibly do what they say for less than the price of the motherboard in our server? Who is building an all solid state NAS? And why did they design it for desktop rather than rack-mount use? Why is it that I'm not gonna answer any of these questions for you, until I tell you about our sponsor? The Ridge! The Ridge has joined with Travis Mathew for a limited run of their classic wallets. This sleek, low-profile wallet is perfect for any golfer on the go. And now with the Travis Mathew touch, you can elevate your game and style. Get your hands on this collaboration using the link down below. Right out of the gate, I can tell you one of the reasons it's so cheap is that it has just a wimpy Quad-Core Celeron processor and four gigs of RAM. So our machine is definitely faster, but it's also ludicrous overkill and almost screwed us over at the airport, since when it's packaged with the network switches and the cables we need, it was too heavy for a standard carry-on. It's also a little on the big and cumbersome side. By comparison, the ASUSTOR Flashstor 12 Pro is an equally all NVMe NAS, but it's about the size of a PlayStation 2. (thud) Look at that! It's so tiny! And that is what she said. - Ugh. - (chuckles) It also weighs almost nothing. (Flashstor clanking) It feels like a toy. It's got plenty of features, though. Two external USB-3 ports, if you wanted to back up your external drive to your NAS, 10-gig LAN right on board, S/PDIF and and HDMI out. I guess if you wanna use it as a media center. - You should install Windows on it, too. - Oh, it's just a computer. Oh, wow! So it's like fully hackable. - Yeah, you can install TrueNAS on it, you could put Unraid on it, whatever you want. - Okay, that's super cool. We gotta open this thing up. - Oh, did I mention those USB Type-A ports are 10 gig? - Oh! - You're gonna break the thing. Can I help you? - No, I'm tryna... - Can I help you? - I wanna figure it. - Do you need an adult? - No, you need an adult. You just told people to put Unraid on here, but Unraid doesn't have proper SSD support. Doesn't support trim on SSD RAIDs. - I mean, it doesn't have a proper sliding of (beep) plastic panel support apparently. - Boom! - Wow! You did it. Look at that. - Got 'em. Wow! - That's not even the one you're supposed to take off first. - Well... - Seems like a missed opportunity for some like, quick disconnect kind of mechanism, you know? - Seems like a missed opportunity to tell you about our fantastic screwdriver, available on lttstore.com. - Yeah. You didn't notice this at all? You're not gonna say anything about this using a... - Wow, this is cool. - A type-A port. - Wait. What? - For the... - What the hell? That's your fan connector? Okay. - I guess we shouldn't complain about things that are overbuilt, right? - Yeah, exactly. We should encourage it. (both making funny noises) Oh, sick. The RAM is upgradable. - [Jake] Yeah. It only comes with four gigs by default, which is pretty thinner. So we have more RAM. Try not to break it. Okay! - I'm not gonna break it. - Feels like there's something still. - Nah, it's all good. - Hey, look, another screw, no way. It's a big heat sink for a little chip. - And the only airflow comes from this fan that basically blows right over and through your... - Whoa! - 12 M.2 SSD slots here. Okay, that's pretty sick. And then blows a little bit over your heat sink and then out the side here. - I mean it doesn't need much, you're gonna be using more power here than you will be over here. - Oh yeah. What does it use in terms of power source? Oh! - 65 watt. - [Linus] I think you mean 90 watt, but good try. - What! Oh, they said 65 on the product page. Wow! I've been lied to ASUSTOR. - Wow! Way to go, ASUSTOR. They've actually got some foam up in the the front here as well to make sure that no air is gonna accidentally leak out over here. - Yeah. I wonder if this is RGB. - Are you sure? Where's the LED? - Is it on the board? - Oh, okay. There they are. I'm trying to figure out what the deal is here. They've got these ASMedia controllers, but I've never seen an ASMedia PCIe splitter. Why three? - How many PCIe lanes do you think this thing has? - I'm gonna say 16. - Eight. - Yikes! Are they just trying to get out ahead of NAND prices falling even further to the point where even general home users are building NASs with flash rather than hard drives? - Hard drives are fine if you need lots of capacity. But as soon as you go, I want to copy a thousand small files, or I wanna scrub my timeline in Premiere, you start to realize pretty fast that they're just hard drives. - And in the event that one of them fails, it can take hours if you're lucky or even days to rebuild a failed array with mechanical drives. With an SSD? Minutes, maybe hours. That's a lot less time to be stressed out, worrying that your data's on the line because you didn't have an offsite backup. And the truth is most people don't. - You're limited by the 10 gig port. But just humor me this, our crazy video editing server that's tens of thousands of dollars, what do you think the peak usage is during the week? We have like 15 video editors that are all editing 4K, and sometimes 8K footage, we have like 80 other people that use it as their just work storage thing, watching footage, ingesting footage. 13 and a half, fourteen? - Yeah. - And that's with like a hundred people using it. - I mean, I would've given anything for something like this to exist 8, 10 years ago when we were starting out. Does that Celeron have any kind of like, RAID acceleration? Anything that I'm not aware of? - I don't think so. - Okay. - It does have an iGPU, so if you're gonna run like Plex Media Server on this thing, because you're a baller, and you have an all SSD NAS, you can totally do that. I think you'll get H.264 and x265 acceleration, but not anything more than that, so your mileage may vary. I did find out what the optical is for. If you're like an audiophile, a lot of people run Rune, which is like a music streaming server. They do have an app for it and you can use that to output to a DAC and some fancy speakers. - Okay. - Ugh! - What? What? What? It's durable. Let's go. Thanks Crucial. - The same RAM, 3200 cl22. It came with four gigs, we're putting 16 in, which is the max that this SOC can handle. You know, actually I think that the 316 TB hard drives you'd need to get that same amount of storage would be almost the same amount of volume. - [Linus] Oh! Oh, wow, you have to push really hard. - [Jake] Yeah, I mean they're plastic. - [Linus] I mean... - They're very cost effective. Quick M.2 disconnects. I would take that over screws any day of the week. - Yeah, actually yeah. Why aren't these on motherboards? I mean, we know ASUSTOR is just ASUS. - [Jake] Yeah. - Right? Like everybody knows that, right? Just put this on your motherboards, this is kind of awesome. - Hopefully they don't end up like OnePlus. I mean, we can install TrueNAS. Who cares? - That's true. The fact that this is so open. - You just get to do what you want with your computer. Imagine that. - Well I shouldn't be impressed by it. - I know. - But I have to be these days. - That's it, right? That was a lot easier. Like with the first PortaNAS, we're gonna be using a Ubiquiti Switch Flex XG. It's a four port 10 gig switch, also has a one gig PoE in. We're not gonna be using that. And it should be the perfect amount of ports I think this time. I feel like we have three editors. - I think so. - And one to the NAS. - Then on the client side, we're gonna be using Apple Silicon MacBooks with these cool external Thunderbolt 10 gig cards from CalDigit. Now you're probably wondering, as an Adobe and predominantly Windows house, why are we using MacBooks? There are certainly faster Windows laptops. The issue is that Adobe Premiere is actually... (computer beeping) - It's just turning on. - More stable on macOS these days. And any time that you might gain from a faster machine, you lose in crashes and glitchy behavior. We didn't even notice the 32 gig SSD that's built in for the operating system. - Ah, right. - That's super cool because it means you don't have to use up any of your storage for your OS. One potential downside is it means if that eMMC storage fails, which can definitely happen, especially if it's running any kind of write-intensive applications, or if Unraid ever gets their act together when it comes to SSDs, you would boot off USB anyway. - [Jake] Hey, look it found instantly. - [Linus] Wow, that was really fast. - Yeah. I have read and agreed to the ADM terms and conditions. Gives us three options. By default is balanced, which is RAID 5. So that would give you one drive parity data, you can lose one drive. - Okay. - Which across 12 is not a lot, but then again this is flash storage not hard drives, they fail a little differently. You should have a backup. What are the other options? Maximum capacity, that's RAID 0. - Oh my god! No! (Jake laughing) - Okay. And then superior... - Especially if you don't even have the CPU to push any kind of decent throughput off it. You might as well go JBOD at that point. - Well, it would be good because there'd be no parity. - You'd be literally better off with JBOD. - It would be a bit slower. - Yeah. - For random. - Barely. - The last one is superior data protection which is RAID 6, which is like RAID 5, but you have two drives of parity. - And it has a more expensive parity calculation, which given that this is a quad-core CPU that... (computer beeps) Oh crap, I pressed the button. - Oh my God! But that's all it shows. (computer beeping) Oh my God! - Now it's really on. - [Jake] Wow, that booted really fast. - [Linus] Yeah. Not bad. - Wow. You know what? Now we're gonna call it PNAS 2. - No! - [David] No, call it PPNAS. - Actually, that's kind of better. HDD partition. - You literally can't put hard drives in this. What are you talking about? I mean you... - Okay. M.2 to micro drive adapt. (chuckles) This is shockingly painless. I've never tried any ASUSTOR product before. They have begged and pleaded for us to cover them, but I was just like, \"Yep, they're NAS boxes, all right.\" - I'm very interested to see what their software actually looks like once you're in there, because that's the thing that people are paying for. Ease of setup, simplicity, and like, it just works with all the stuff. - Yeah. - I mean if all of the things in this list, in regards to bettering your data security, this is the least important one. It takes all of half of a second to port scans up there. - You know how stuff like this happens though, right? - Yeah. - Some executive at ASUS read some article somewhere. - Targeted ports, oh. - Yeah. Now Jake's gonna figure all this out while I go buy a GPU on Facebook Marketplace, and I'll see you in a bit. - Because this is just using normal RAID and not ZFS or anything like that, it has to sync the array before it's kind of at its full performance. And it's already 7% done and it's only been like half an hour, but it says the ETA is 10 hours. Whatever performance we get right now is not really gonna be indicative of what it can do, but I do want to try it. So let's see if I copy a file here. It seems to be averaging around 300 or 350 megabytes a second or around 3 gigabit. It's not anywhere near the 10 gigabit that this port can do and this switch can do, but the array is still syncing, so any performance test we do right now is not super meaningful, although it is good, it can still do three gigabit while doing that. I heard there's a lot of apps on these things, I haven't dove into it at all yet. Agree. Sign my life away. Of course, right at the top. Plex Media Server. No surprises there. Let's install that. Wow! They even have an app for Portainer, which is like a Docker control panel. I guess if you wanna run Docker containers on this thing, which a lot of people do, if they have this as their home lab, that's gonna be perfect for it. Let's install that. I have to install Docker first. I don't know why I didn't just say, \"We're gonna install it for you.\" Oh, Prime Video. Wait, is that for the HDMI port? If I install Prime Video, is it just gonna like show up on here? Whoa! You need a lot of things. Installation of Firefox is recommended, Remote Center. Oh, if it needs something to run, whatever you're doing, it will install it. Oh, look at that. What are the odds that that happened, right? (laughing) Oh, there's a Pi-hole one, look at that. Okay, so some of the apps are Docker based, some of them are just applications. That's cool. I have a cursor, but that's it. (chuckles) Hmm. Cool. It gives you a tutorial on how to use this. There's Plex. This is running a bit slow. It might have something to do with all of the apps I installed, and the fact that it's still syncing. It works. We got a Plex Media Server. It's playing at full quality. So if I go convert to, let's say, 1080p. It's H264 to H264. This should not be very difficult. Oh my God, I hope it didn't take that long to do one frame. Oh god! Well that's a little disappointing. All right. The version that's on ASUSTOR's app store is very out of date. Weird that it's an Android APK, like this is an Android app. I guess maybe it's simpler to package it that way. There we go. - Well that's cool. - So you could throw, in theory, anything on here, like we could put Unified Protect on here, and you could look at security cameras. You could do whatever you want. - Oh! Hey-oh. (computer beeping) - What is going on? This is what I had before. - That's not really a cursor though. Here I'll show you a cursor. (beep) (beep) (beep) (beep) - I wanna try Plex again now that it's not syncing the array to see if it'll actually transcode. I did copy over a different file because the one that I used originally is like our very compressed, fancy YouTube one. - [Linus] That is very high CPU usage for just playback of a video. - Let's try the other one again. - [Linus] That one drive's at 58. - I don't think it can do the parity data fast enough to heat them up is... What's going on here? - We just copied 75 gigs to it though. - I think it's leveled off there. Considering the noise level, I do wish you had the option to do better with a little bit louder fan. - Hey, not bad. That's about 300 megabytes a second. - We can try going the other way. It should, oh... - Have you seen my TrueNAS performance at home? It's awful. - It's probably user error. - I mean you set it up, so. - [Jake] One gigabyte a second. - That makes sense that writing is not as fast. Writing is far more processor intensive, and that's where that Celeron is gonna be hurting us. This looks like your Mac being turd. What does preparing to copy mean? - [Jake] Why can't I stop this? Quit? - It's like the cancel button on a printer. The print head's not moving yet. Cancel! You press it, and then it just (beep) prints the page anyway. - Or it'll print halfway and then stop and then just (beep) out a half printed piece of paper. - Thanks. This is really useful. - Yeah. We could go to an ingest station and do it that way. - These are connected at 25 gig. - Woo! - [Linus] Okay. - [Jake] Woo! - That is very 10 gig. It looks like about all we can expect from RAID 5 is 400, 500 megabytes a second. - One thing to consider is this would likely perform better if we had, say, only six drives. When you have 12, that's a lot of striping you need to do. - [Linus] They ship twelve drive versions, so it's on them to make sure that it performs as it should. - I mean, there you go. - That's definitely CPU bottlenecked. - [Jake] We're at like 80%, 90% on the CPU. I bet you if I put TrueNAS on it, we could do gig both ways. - It's not gonna, it's two gigahertz Celeron. - I looked on PassMark to compare this Celeron to the PortaNAS we built originally, which is a 5700X, it was less than one fifth. To be fair, it also uses about one fifth of the power. - I think the main value add for this product is in what the alternatives are. Compared to building a system yourself, yeah, you could do it, but you're gonna be spending as much on a motherboard as you are on this thing. - Yeah. - So if it happens to be what you need. It's kind of killer. There's nothing else like it. - [Jake] There is actually, QNAP makes one, but it only has four drives. - Well then, that's not really that much like it, is it? And this is an even smaller segue to our sponsor. Supermicro. Featuring their H13 generation servers powered by AMD's EPYC 9004 series processors. With 128 cores on a single processor, these have more than most dual CPUs can offer. And they have support for AMD 3D V-Cache. So Supermicro's servers offer unmatched processing power for your business needs. Additionally, Supermicro is introducing their Hyper-U, their 3U 8-node MicroCloud, and their EDSFF E3.S Petascale storage servers providing scalability and memory expansion options. With the highest core counts on a single processor and support for AMD's 3D V-Cache, Supermicro's H13 servers deliver blazing fast performance for memory intensive workloads. Such as EDA, CFD, FEA, etcetera. So upgrade to H13 generation servers and supercharge your infrastructure today. You can check them out at the link in the description to get more information on Supermicro's AMD powered server technologies. If you enjoyed this video, why don't you check out the one where we DIY did. It's... (sharp noise) Really does put the Y in DIY. - [Jake] Hmm.",
    "transcript_keywords": [
        "Yeah",
        "absolutely wild miniature",
        "Plex Media Server",
        "wild miniature server",
        "wow",
        "hard drives",
        "drives",
        "thing",
        "ASUSTOR",
        "server",
        "gig",
        "RAID",
        "install",
        "NAS",
        "SSD",
        "lot",
        "Media Server",
        "kind",
        "drive",
        "put"
    ],
    "transcript_entity_values": [
        "Rune",
        "one",
        "PlayStation 2",
        "316",
        "MacBooks",
        "LAN",
        "SSD",
        "about one fifth",
        "One",
        "ASMedia",
        "Supermicro",
        "RGB",
        "Celeron",
        "cl22",
        "zero",
        "ETA",
        "Adobe",
        "Firefox",
        "about 300 megabytes",
        "GPU",
        "Plex",
        "Quad-Core Celeron",
        "the week",
        "only six",
        "AMD",
        "Unraid",
        "less than one fifth",
        "three",
        "Linus",
        "YouTube",
        "two gigahertz",
        "PNAS 2",
        "Linus",
        "Travis Mathew",
        "NAND",
        "Remote Center",
        "half",
        "400",
        "Docker",
        "ASUS",
        "Hyper-U",
        "FEA",
        "first",
        "days",
        "CalDigit",
        "32",
        "jank",
        "80",
        "3D V-Cache",
        "9004",
        "25",
        "Mac",
        "JBOD",
        "ASUSTOR",
        "Plex Media",
        "4",
        "hours",
        "CPU",
        "58",
        "max",
        "NAS",
        "any day of the week",
        "Docker",
        "DIY",
        "Windows",
        "four",
        "Ridge",
        "65",
        "90%",
        "90 watt",
        "Apple Silicon MacBooks",
        "around 300",
        "hundred",
        "USB Type-A",
        "twelve",
        "like half an hour",
        "S/PDIF",
        "16",
        "ASUSTOR",
        "eMMC",
        "ADM",
        "Plex",
        "10",
        "QNAP",
        "15",
        "tens of thousands of dollars",
        "500 megabytes",
        "7%",
        "12",
        "Adobe Premiere",
        "HDMI",
        "H264",
        "EDA",
        "3U",
        "3200",
        "80%",
        "two",
        "around 3",
        "these days",
        "OnePlus",
        "Windows",
        "Android",
        "Premiere",
        "second",
        "SOC",
        "Jake",
        "128",
        "10 hours",
        "PassMark",
        "EDSFF",
        "Two",
        "Eight",
        "Last year",
        "Portainer",
        "Celeron",
        "TB",
        "75",
        "today",
        "AMD 3D V-Cache",
        "MicroCloud",
        "Ubiquiti Switch Flex XG",
        "Facebook Marketplace",
        "a quarter",
        "RAM",
        "8",
        "fourteen",
        "Y",
        "13 and a half",
        "AMD",
        "PPNAS",
        "Windows",
        "USB",
        "5700X",
        "CFD",
        "thousand",
        "8",
        "10 years ago",
        "65 watt"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "QUANTITY"
    ],
    "vector": [
        -0.04874328523874283,
        -0.03280716389417648,
        0.011755730956792831,
        -0.02162906713783741,
        0.08019913733005524,
        -0.0015262895030900836,
        -0.0668078362941742,
        0.06831333041191101,
        -0.0142994849011302,
        -0.0046611265279352665,
        0.029875272884964943,
        0.05046435445547104,
        -0.013305078260600567,
        -0.026649458333849907,
        0.027845868840813637,
        0.01564345322549343,
        0.0643838569521904,
        -0.09475433826446533,
        0.015020065940916538,
        0.0021317435894161463,
        0.08038982003927231,
        -0.032860226929187775,
        -0.01822848990559578,
        -0.05415840446949005,
        0.013850076124072075,
        -0.023428233340382576,
        0.05097026750445366,
        -0.0851641446352005,
        0.0030438618268817663,
        -0.10057277232408524,
        0.03238850459456444,
        -0.0002652551047503948,
        -0.03850357234477997,
        -0.01145957875996828,
        0.07210296392440796,
        -0.06865423172712326,
        0.07028144598007202,
        -0.053915828466415405,
        -0.10699377954006195,
        -0.1194547563791275,
        0.02009812742471695,
        -0.01576288975775242,
        0.03796733543276787,
        0.056814972311258316,
        -0.00734878471121192,
        -0.025577429682016373,
        0.0541834756731987,
        -0.05361216887831688,
        0.06962042301893234,
        -0.005174366757273674,
        -0.0200204998254776,
        -0.04301008582115173,
        -0.022043276578187943,
        0.002152051078155637,
        -0.01551417913287878,
        0.0668424591422081,
        -0.01594567857682705,
        -0.07494853436946869,
        0.07161187380552292,
        -0.041653215885162354,
        0.06625448167324066,
        -0.056528449058532715,
        0.0028464426286518574,
        0.012363597750663757,
        0.00043273126357235014,
        0.022183595225214958,
        0.061485011130571365,
        0.02389228343963623,
        -0.022165454924106598,
        0.055439647287130356,
        0.013426914811134338,
        -0.05349138006567955,
        0.022154025733470917,
        0.11166643351316452,
        -0.055888786911964417,
        0.01368345320224762,
        0.05500250309705734,
        -0.04679770767688751,
        0.04575582221150398,
        0.038126666098833084,
        0.013690426014363766,
        -0.04262225329875946,
        -0.005812672898173332,
        -0.05904309079051018,
        0.037613771855831146,
        -0.050310198217630386,
        0.020747721195220947,
        0.011070075444877148,
        0.017481785267591476,
        -0.04180357977747917,
        0.003615755820646882,
        0.05327316001057625,
        0.0843362808227539,
        0.022511625662446022,
        -0.003451485885307193,
        -0.02816343680024147,
        0.013580143451690674,
        -0.05415542796254158,
        -0.027906812727451324,
        0.027897486463189125,
        0.0026693472173064947,
        0.0741264745593071,
        0.03897864744067192,
        -0.023571396246552467,
        -0.0963146984577179,
        -0.07247024774551392,
        -0.017191488295793533,
        0.06190468743443489,
        -0.010012581013143063,
        -0.012232933193445206,
        -0.036092765629291534,
        0.07751939445734024,
        -0.0876726284623146,
        0.03787142038345337,
        0.04641079530119896,
        0.00032603018917143345,
        -0.0714472085237503,
        -0.022495117038488388,
        0.010105879046022892,
        -0.016657989472150803,
        -0.031360283493995667,
        0.022248221561312675,
        0.004602496977895498,
        0.05033054202795029,
        0.0260726697742939,
        0.037549588829278946,
        -0.07853806763887405,
        8.824140748667268e-33,
        -0.025855226442217827,
        0.056994929909706116,
        -0.10514548420906067,
        -0.030498873442411423,
        0.021336641162633896,
        0.01334447506815195,
        0.06487452983856201,
        0.05438888445496559,
        -0.02565881237387657,
        -0.03698976710438728,
        0.0038867639377713203,
        -0.017238283529877663,
        -0.06812965869903564,
        0.059187471866607666,
        0.09313742816448212,
        -0.12126327306032181,
        0.012205366045236588,
        0.018249358981847763,
        0.01882222108542919,
        -0.08368492871522903,
        0.044692687690258026,
        0.023232316598296165,
        0.02450685389339924,
        -0.01821073889732361,
        0.03930870443582535,
        -0.03907592222094536,
        0.021535387262701988,
        -0.03699493780732155,
        0.08528558164834976,
        0.032904114574193954,
        -0.06402678787708282,
        -0.06308950483798981,
        -0.01922024041414261,
        -0.027918588370084763,
        0.029995188117027283,
        -0.01988223008811474,
        -0.06916024535894394,
        -0.1163882166147232,
        -0.021349133923649788,
        -0.055675607174634933,
        -0.08581894636154175,
        0.04335246980190277,
        -0.08786626905202866,
        -0.06011025235056877,
        -0.014886847697198391,
        0.0030945828184485435,
        0.014568480663001537,
        0.04295084625482559,
        -0.028294818475842476,
        0.024787280708551407,
        -0.07727598398923874,
        0.04235992208123207,
        -0.03750523179769516,
        -0.0037437346763908863,
        0.006662731058895588,
        -0.012016004882752895,
        0.03800375759601593,
        -0.025451017543673515,
        0.11262315511703491,
        0.09041447937488556,
        -0.021101439371705055,
        -0.014579376205801964,
        0.028110643848776817,
        0.013996065594255924,
        -0.09948339313268661,
        0.06173643842339516,
        0.07199651002883911,
        -0.04602014645934105,
        -0.04607321321964264,
        0.010446551255881786,
        -0.004020607098937035,
        -0.035133250057697296,
        0.06156231462955475,
        -0.05005838721990585,
        0.039677925407886505,
        0.031773876398801804,
        -0.08799998462200165,
        0.017701510339975357,
        -0.058607544749975204,
        -0.045811183750629425,
        -0.036726564168930054,
        0.028824124485254288,
        -0.00468884501606226,
        0.05090933293104172,
        0.04541240260004997,
        0.010022436268627644,
        0.05568929389119148,
        0.03511567413806915,
        -0.04412643611431122,
        0.045884836465120316,
        0.015023794956505299,
        -0.011030358262360096,
        0.020235368981957436,
        0.008673136122524738,
        -0.04259876161813736,
        -8.125706086446821e-33,
        -0.02362585999071598,
        -0.03872593119740486,
        0.018659794703125954,
        0.04326612874865532,
        -0.013526313938200474,
        0.0018840880366042256,
        0.07464801520109177,
        -0.006822932977229357,
        -0.027127256616950035,
        -0.13396859169006348,
        -0.047333866357803345,
        -0.011129838414490223,
        0.008075246587395668,
        -0.032755762338638306,
        -0.017618190497159958,
        -0.05364779755473137,
        0.02210741676390171,
        -0.08801078051328659,
        0.04411555454134941,
        -0.06494158506393433,
        0.05514450743794441,
        0.08333567529916763,
        0.01727222464978695,
        0.04140603914856911,
        -0.015574292279779911,
        0.010835354216396809,
        -0.02891526184976101,
        0.03293892741203308,
        -0.05406659096479416,
        0.04812602326273918,
        0.0014755359152331948,
        0.043936628848314285,
        0.008349919691681862,
        -0.02368609420955181,
        0.03789578750729561,
        0.034609269350767136,
        0.06830743700265884,
        0.02875685691833496,
        -0.03355155512690544,
        -0.04828735068440437,
        0.07730572670698166,
        0.040504664182662964,
        -0.08914954215288162,
        -0.027435071766376495,
        0.03815986588597298,
        -0.029136674478650093,
        -0.07155662775039673,
        -0.04147719219326973,
        0.0802479237318039,
        -0.016342483460903168,
        -0.02828916721045971,
        -0.07149636745452881,
        0.07032380998134613,
        -0.01767892949283123,
        -0.012044425122439861,
        -0.06227695196866989,
        0.02297716587781906,
        0.03308434411883354,
        0.0027409920003265142,
        -0.008033053018152714,
        0.054142143577337265,
        -0.03515040501952171,
        0.005851435009390116,
        -0.09376193583011627,
        0.03183695673942566,
        -0.10721597075462341,
        0.09896877408027649,
        0.00472717359662056,
        -0.026387985795736313,
        0.043105289340019226,
        0.01359179150313139,
        -0.021424438804388046,
        0.034342210739851,
        -0.03688953071832657,
        -0.018658217042684555,
        0.022419534623622894,
        0.03909321129322052,
        -0.020836586132645607,
        0.041304491460323334,
        -0.025332503020763397,
        -0.12529559433460236,
        0.09044234454631805,
        0.004444602411240339,
        0.014536548405885696,
        0.014713305979967117,
        0.021499592810869217,
        0.06303390115499496,
        -0.026223916560411453,
        0.03248666971921921,
        -0.004125493112951517,
        -0.14997726678848267,
        -0.032013870775699615,
        -0.01956692524254322,
        0.0687188133597374,
        0.009609700180590153,
        -5.96098104210796e-08,
        -0.009158005006611347,
        0.015638532117009163,
        0.03773808851838112,
        0.06913155317306519,
        0.05385737493634224,
        -0.09975921362638474,
        -0.03556973114609718,
        0.058828890323638916,
        0.12100519239902496,
        -0.014277649112045765,
        0.10885702073574066,
        -0.0961194783449173,
        -0.053370293229818344,
        0.0371137298643589,
        -0.025299396365880966,
        0.047349944710731506,
        0.004316382110118866,
        0.06717927753925323,
        -0.02044699341058731,
        -0.106853187084198,
        -0.0032352537382394075,
        0.07562310248613358,
        0.056183185428380966,
        -0.003354644402861595,
        0.03222092241048813,
        0.05167695879936218,
        0.042501624673604965,
        0.02270958200097084,
        0.09823676943778992,
        -0.006891652010381222,
        -0.1014334112405777,
        -0.015288140624761581,
        0.008083993569016457,
        -0.009453250095248222,
        0.004857759922742844,
        -0.04297550767660141,
        0.011186355724930763,
        0.10216329246759415,
        0.09281599521636963,
        0.09797769039869308,
        -0.019052591174840927,
        -0.027976250275969505,
        -0.021862326189875603,
        0.025745544582605362,
        0.01740049384534359,
        -0.025767816230654716,
        -0.12060181796550751,
        -0.03795327618718147,
        -0.08140987157821655,
        0.060839343816041946,
        -0.0035410390701144934,
        -0.07379289716482162,
        -0.017415829002857208,
        0.05235927551984787,
        0.021767878904938698,
        -0.032174739986658096,
        -0.051938220858573914,
        0.02170666493475437,
        -0.03439440578222275,
        0.09303230047225952,
        0.08579040318727493,
        -0.11717048287391663,
        -0.0732353925704956,
        0.08361281454563141
    ]
}