{
    "id": "2Gr1xxlZbWY",
    "title": "iPhone Jenga",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2017-01-26T21:46:14Z",
    "video_url": "https://www.youtube.com/watch?v=2Gr1xxlZbWY",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "iphone jenga",
        "iphone",
        "jenga",
        "iphone se",
        "iphone 7",
        "iphone 7 plus",
        "plus",
        "7 plus",
        "iphone 8",
        "apple iphone",
        "apple",
        "iphone 8 plus",
        "2017",
        "diy",
        "dbrand",
        "dbrand skins",
        "iphone7",
        "iphone8",
        "apple iphone 7 plus",
        "new iphone",
        "new inventions",
        "cool",
        "cool gadgets",
        "android",
        "invention",
        "innovation",
        "smartphone",
        "cool technology",
        "new gadgets",
        "products",
        "awesome",
        "cool gadget",
        "amazing",
        "new technology"
    ],
    "views": 6243365,
    "likes": 177956,
    "comments_count": 32758,
    "description": "Enter to win by following the two accounts below: Unbox Therapy:  dbrand:   Winners site:   Using 108 iPhone SE to do the unthinkable... Play high tech smartphone Jenga. Shout out to cousin Ryan for being a good sport.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://Instagram.com/unboxtherapy",
        "https://Instagram.com/dbrand",
        "https://dbrand.com/winners",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "This is what they call a professional endeavor. WOOOO! You know who Ric Flair is? Do you remember Ric Flair? He slapped the guy right in the chest like whoa with the back of the hand is aggressive. The iPhone SE you heard about it. I showed too, I talked about it I even i did a video and then I had a little snooze. So what do you do when you got a phone like this. How do you make it just a little bit more exciting. I don't know maybe you put a hundred, on a table... maybe it's more than a hundred. I'm really to be honest I think it kind of adds something to the decor. You know thats not why I did it. Today, I'm going to introduce you, to a concept that has been percolating for a while, marinating. This my friends, is iPhone, Jenga ! *Jazz type music plays* Because if there's one thing that the iPhone SE would be perfect for it's to behave as a jenga brick I mean I don't plan on keeping all these phones obviously. I'm not wasteful like that so they will find some new home and the home might be your home so stick around to the end. So let's go ahead jump inside these boxes and get to the construction of the world's first, I believe it's the world's first iPhone Jenga Tower! Somebody's gonna come play against me. Little do they know I've been training for years maybe it's only been weeks or days I don't know. The last 10 minutes. I haven't trained at all. iPhone number one *music plays * *Hums darth vader theme* Oh man this is so ridiculous! This could be in... in a architectural digest next thing you know in Dubai they're going to have the iPhone Tower. I'm going delirious to this right now. Alright so towers; towers of phones that's cool I guess but you know what's really cool is iPhone Jenga. We're gonna call in Ryan and him and I are going to go head-to-head in the unprecedented world's first iPhone Jenga competition showdown! How do I build the Jenga tower again? Three go this way.. Will it work? Only time will tell. Would you look at that the world's first iPhone SE Jenga Tower But, You know what I don't know I kinda feel like somethings missing here. It's not really saying jenga to me. dbrand! Of course! Wooo! Yeah. All right that is much better as you can tell these things have now been outfitted with these wonderful bamboo skins making 'em look a lot more like jenga bricks courtesy of dbrand skins but now it's time to bring in cousin Ryan to play Jenga against me using iPhones. Ryan get in here man! \"Hey\" Look its beauty how do you feel man? \"I feel uh... extremely confident\" Really?! \"Yeah.\" I can't...I can't even tell right now. \"Well I'm ready to smoke you.\" Wow allright Jesus that was a little intense. Kind of an unusual design because of the dimension of the phones. You see the kind of hanging out a little bit. If you look because of that lip you have a very fragile end peace. That falls down I guess technically jenga rules you lose so when you're placing the phone that you've slid out on top be very careful that's my warning to you. \"I'm not too worried.\" Oh wow! Do you want me to go first? \"Yeah you go ahead\" Alright alright.. \"That's slick\" Okay, here we go, I'm gonna put this baby right here. What do you need man you want space here? The holy deep breath is going on. \"This is a lot like a real jenga it's actually working.\" It's a lot like real jenga that's right. I shouldn't be on this side but I'm worried... That's a lot of weight down there! Brother! \"Right here\" What are you doing? You're standing up now? Don't we have a rule against to that ? standing up jack is that allowed \"No.. I got to stand up to get the back ones here.\" \"You took it from the same row as me.\" And I think the reason this is working so well.. I'm no physicist not even like that would be the individual who would judge this. I think the fact that they're so thin is helpful. \"Yeah, you know I agree I agree I ..\" Look at this, you're not even done yet. \"Yeah but you're gonna get cocky and it's gonna spill and no one's rebuilding this thing.\" But that's we have jack for. You're going down there! \"No, I don't know.\" \"Let me just have a wiggle\" Oh.. Hey dude! Hey man! \"Nice\" \"I don't want.. oh it's starting to wiggle a little bit\" Yeah look that's one that's one iPhone right there now. Oh there's a lot of weight there ... \"It actually feels ..\" What the rule of you touch the piece take the piece \"Uh well yeah I think so yeah that's fair yeah\" There's a lot of weight right there! \"Now you're back on one it's gonna spill, don't do it.\" Ho ho! It's a one-on-one brother! \"You can't do it!\" \"Take it.\" Take it cause I touched it ? Oooooooooooooooh! ooh! You were talking a big game and look who pulls you from there! Oh this could be it for you man. It could be it for you man. \"Oh you're gold.. you're gold...\" Aggressive move! Money in the bank. Ooooooooooh! Can I? \"Yeah you got that one.\" Wow! What was that about? \"Real.. in-depth look there.\" Whoa! This is a win at this point. \"Yeah\" No matter what happens although we should not be so friendly \"No, no, I definitely wanna see you lose\" That's right that's right. \"I think it's going down!\" \"It's not, now I think it's ..\" No, I think it's going down. I think it might go down Ooooh! For the first time.. ever on the planet on planet Earth. It's never been done. They don't even do this at Apple. \"I'm not sure what they're doing at Apple\" \"Does anybody work at Apple?\" This is actually lunch time at Apple right now. This is Phil Schiller and Johnny Ive... \"I'm sure they got time for that.\" They gather round you know.. they've got the coffee.. \"Yeah\" Listen, Apple head out here come chill for a bit and we'll have actual good time. There's Japanese whiskey, Ryan you know that stuff.. \"Little coke...... the pop like coke and Japanese whiskey.. It's coca-cola.. Yeah..\" \"Yeah\" Oh that might be it that might be it \"You said that like four times\" Game set and match it's over stay stay.. stay right there! \"It's fine! \" Oooh Wooo! \"Ooh Yeah.\" W-was that perverted? That was... That was so perverted man. I'll put the heat on you right like that. I'll put the heat on you right like that. \"Get on your own side!.\" \"Stay on your own side!\" Oh you got a problem? Oh that's solid! I just touched a solid one! Ooh I touched it, I touched it HOHOHOHOHO! iPhone Jenga it's never been done... \"And there's a reason..\" and you give them all away the end. \"Yeah cause it's like ..\" Who comes up with stuff like this? Who? \"This is ridiculous.\" Jack who comes up with stuff like this? That's right. \"That's right\" you see that? you see that? Do you see who he pointed at ? Do you see who he pointed at ? \"you..\" Yeah wasn't you. \"I'm just here to bust your ass up, that's why im here\" Jesus! Easy man! Holy leave my ass alone man.. Bust you ass up? *giggles* \"I didn't come down here to have fun OK? .\" Alright. \"I'm here to smash it..\" Okay just leave my ass out of it, man. \"Do you know in school when you used to get a 'E'? \"Like an 'E' was above an 'A+'\" \"It was like excellent and in like grade school\" \"Do you remember that?\" What kind of school do you go Ryan? *laughs* Ryan, you can be proud of your 'E' alright. People know what an 'E' was \"Excellent!\" Yeah it comes just before 'F'. \"No above it..\" You know what it's not gonna go on 'like cause I'm about to sabotage. \"You're garbage.\" That's a dangerous game you're playing. HOHOHOHOHO! You wanna play that game! LET'S PLAY THAT GAME! [Faster] You wanna play that game. LET'S PLAY THAT GAME! Stretching out I caught that! *Evil laugh* \"This is the first time I've actually been concerned that I might... lose...\" \"It makes a little bit easier to slide them out.\" OOH! OHOHOHO! \"I just need a second okay?\" \"It's not moving.\" \"It's the whole, it won't come out.\" \"Now hold on. Can I use two hands or no?\" No. \"Well, That's ridiculous!\" \"Oh shit!\" \"Oh shit! \" OOOOOOOOOOOOOOOOH! HAHAHAHAHAHAH! \"I can't believe I lost!\" BOOOOM! \"Alright\" You know who they picked! You know who they picked! UNCLE LEW THAT'S WHO! Thumbs up for Ryan for what a good sport. We're giving away every last one of these ok we're gonna stick 'em back in the boxes and send them to a bunch of lucky people. Make sure to follow myself and dbrand skins on Instagram the details will be in the description as well as the links thank you there it is thank you 108 iPhones. This has been iPhone Jenga tell your friends! OOOOOOOOH! HAHAHAHAHA!",
    "transcript_keywords": [
        "Jenga",
        "Yeah",
        "iPhone Jenga",
        "iPhone",
        "Jenga Tower",
        "Ric Flair",
        "iPhone Jenga Tower",
        "man",
        "Ryan",
        "game",
        "play",
        "remember Ric Flair",
        "Apple",
        "professional endeavor",
        "lot",
        "Tower",
        "time",
        "Alright",
        "play Jenga",
        "real jenga"
    ],
    "transcript_entity_values": [
        "Earth",
        "Oooooooooooooooh",
        "Ho ho",
        "iPhone",
        "the iPhone Tower",
        "years",
        "Jenga",
        "Jenga",
        "Phil Schiller",
        "Ryan",
        "first",
        "108",
        "Dubai",
        "weeks",
        "darth vader",
        "Today",
        "Jesus",
        "jack",
        "Apple",
        "Jack",
        "The last 10 minutes",
        "two",
        "second",
        "iPhone Jenga",
        "Jesus!",
        "four",
        "Three",
        "iPhones",
        "Ooooooooooh",
        "a hundred",
        "Instagram",
        "iPhone Jenga",
        "more than a hundred",
        "Ric Flair",
        "OOOOOOOOOOOOOOOOH",
        "BOOOOM",
        "HOHOHOHOHO",
        "Japanese",
        "Johnny",
        "LEW",
        "coca-cola",
        "Bust",
        "one",
        "iPhones"
    ],
    "transcript_entity_types": [
        "LOC",
        "GPE",
        "PERSON",
        "ORG",
        "FAC",
        "DATE",
        "ORG",
        "FAC",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "GPE",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "NORP"
    ],
    "vector": [
        -0.05269211158156395,
        0.05773354321718216,
        0.09610874950885773,
        -0.07460249215364456,
        -0.020165806636214256,
        -0.006415851879864931,
        0.1254500150680542,
        -0.0035930760204792023,
        0.04581785202026367,
        -0.03510472550988197,
        -0.05039659142494202,
        -0.043993499130010605,
        0.0019896249286830425,
        0.042578455060720444,
        -0.01069470401853323,
        -0.020152470096945763,
        0.12280718982219696,
        -0.020496441051363945,
        -0.14151546359062195,
        0.0725073367357254,
        0.03200487792491913,
        -0.01526182796806097,
        0.03255660459399223,
        0.01262491475790739,
        0.004127614665776491,
        0.0337723009288311,
        -0.053982969373464584,
        4.647679816116579e-05,
        -0.05085242912173271,
        -0.026076845824718475,
        0.012833861634135246,
        0.08343220502138138,
        0.006282305344939232,
        0.024477940052747726,
        -0.11466401070356369,
        -0.060137249529361725,
        -0.04619972035288811,
        0.06146496161818504,
        -0.034551989287137985,
        -0.04688793420791626,
        -0.023147663101553917,
        -0.07855603843927383,
        0.07285012304782867,
        0.10830359905958176,
        0.028171855956315994,
        -0.013343616388738155,
        0.02621418610215187,
        -0.03026697225868702,
        0.018696200102567673,
        -0.10747414827346802,
        -0.011685174889862537,
        -0.006006116047501564,
        0.029749343171715736,
        -0.008552752435207367,
        -0.04399866983294487,
        0.016713537275791168,
        0.07622894644737244,
        0.03550104424357414,
        0.04146689921617508,
        0.01715993881225586,
        0.08350108563899994,
        0.003412554506212473,
        -0.003799804486334324,
        0.05605672299861908,
        -0.01825098879635334,
        -0.0605192705988884,
        -0.04655895754694939,
        0.037310052663087845,
        0.07786332070827484,
        0.059667378664016724,
        0.09740746021270752,
        -0.010142629966139793,
        0.041409682482481,
        0.018317898735404015,
        0.0673222690820694,
        0.030840246006846428,
        -0.051582906395196915,
        -0.013527153991162777,
        -0.008913750760257244,
        0.12219608575105667,
        0.04552236571907997,
        -0.04684261605143547,
        0.030771398916840553,
        0.03203025460243225,
        -0.02565053291618824,
        -0.007071433123201132,
        0.007999037392437458,
        0.029051952064037323,
        -0.051891837269067764,
        -0.048969816416502,
        -0.03580278158187866,
        0.10383099317550659,
        -0.005354863125830889,
        -0.014859038405120373,
        -0.004650540184229612,
        -0.0011103261495009065,
        -0.15758343040943146,
        0.003910986240953207,
        -0.05276503041386604,
        0.05795159935951233,
        0.05783194303512573,
        0.047972239553928375,
        -0.03365788981318474,
        0.014032026752829552,
        0.0380917489528656,
        -0.07482374459505081,
        -0.06455669552087784,
        -0.004616604186594486,
        0.012285332195460796,
        0.062201712280511856,
        -0.05264955759048462,
        0.02500760741531849,
        -0.09177885204553604,
        0.05614094436168671,
        -0.00337521405890584,
        0.03490711748600006,
        0.0014795772731304169,
        0.07211463153362274,
        0.08559627085924149,
        -0.009816314093768597,
        0.06051415950059891,
        -0.022564655169844627,
        -0.07682305574417114,
        -0.040456436574459076,
        -0.010333748534321785,
        -0.005523887928575277,
        -0.0247464831918478,
        -4.494979735771557e-34,
        0.08267252147197723,
        0.10517380386590958,
        -0.0185408778488636,
        0.1167113408446312,
        0.06279022246599197,
        -0.021603038534522057,
        -0.016645587980747223,
        -0.007557125296443701,
        -0.0239546075463295,
        0.07380283623933792,
        0.03495460003614426,
        0.07219485938549042,
        0.012809901498258114,
        0.06147812679409981,
        0.009480890817940235,
        -0.06772414594888687,
        -0.10468858480453491,
        -0.10354945063591003,
        0.008074997924268246,
        -0.050071243196725845,
        0.026773883029818535,
        -0.032683052122592926,
        -0.024524977430701256,
        0.03112354315817356,
        -0.02598389983177185,
        0.06195756793022156,
        0.02426871471107006,
        -0.022412441670894623,
        0.03193112835288048,
        0.009783286601305008,
        -0.05077465623617172,
        -0.009815387427806854,
        -0.03012365661561489,
        -0.06540492922067642,
        -0.03906182944774628,
        -0.01132630743086338,
        0.06036901846528053,
        -0.09297045320272446,
        0.09507843106985092,
        0.058552734553813934,
        -0.10225021094083786,
        0.045453790575265884,
        -0.04858024790883064,
        -0.043839164078235626,
        0.019408605992794037,
        0.0568045936524868,
        0.050792302936315536,
        0.01798584684729576,
        -0.04218720272183418,
        -0.024861974641680717,
        0.05129823833703995,
        -0.05992863327264786,
        0.09546153992414474,
        -0.030883675441145897,
        -0.10901065170764923,
        -0.03254096955060959,
        0.06415872275829315,
        -0.04456913471221924,
        0.025140518322587013,
        -0.012485994957387447,
        0.036529239267110825,
        -0.05951972305774689,
        -0.05959537252783775,
        0.08055027574300766,
        -0.09676603972911835,
        0.020187700167298317,
        0.0018889547791332006,
        -0.0017032221658155322,
        -0.008080452680587769,
        -0.004134424962103367,
        0.007492768112570047,
        0.059809111058712006,
        -0.027163254097104073,
        -0.08013316243886948,
        0.007668829523026943,
        0.0313652865588665,
        0.00811524037271738,
        -0.03463556990027428,
        -0.060220204293727875,
        -0.01632303185760975,
        0.06389015913009644,
        -0.06166255101561546,
        -0.06419742107391357,
        -0.015399898402392864,
        0.009753289632499218,
        -0.05540082976222038,
        -0.033326655626297,
        -0.025410257279872894,
        -0.014626335352659225,
        0.12084180861711502,
        -0.038392454385757446,
        0.04217518866062164,
        -0.008198434486985207,
        0.014280700124800205,
        -0.04729674011468887,
        -2.7476507755461613e-34,
        0.005015044007450342,
        -0.00946582667529583,
        -0.012268900871276855,
        -0.0020164605230093002,
        0.10643507540225983,
        -0.05309209227561951,
        0.036529120057821274,
        0.031336892396211624,
        0.050201985985040665,
        -0.033143557608127594,
        0.02883521281182766,
        0.001579207368195057,
        0.0020783969666808844,
        -0.020846441388130188,
        -0.026304518803954124,
        -0.03052866831421852,
        0.00038389989640563726,
        0.02485492080450058,
        -0.11524342000484467,
        0.03503882884979248,
        0.01466700155287981,
        0.07897943258285522,
        -0.0015326763968914747,
        -0.000651526905130595,
        -0.03223920240998268,
        -0.024550095200538635,
        0.06550873070955276,
        0.0024995640851557255,
        0.00518971448764205,
        -0.012419218197464943,
        0.0012048023054376245,
        -0.1301087886095047,
        -0.009124252945184708,
        -0.018396925181150436,
        -0.005035690031945705,
        0.0971287190914154,
        0.042611345648765564,
        -0.048337314277887344,
        -0.005738494452089071,
        -0.08380187302827835,
        0.05231918394565582,
        0.01055484265089035,
        -0.05737229064106941,
        0.0020311076659709215,
        0.01916513778269291,
        -0.037287455052137375,
        -0.11014937609434128,
        0.00987282581627369,
        -0.004958813544362783,
        0.056302763521671295,
        0.0531744584441185,
        -0.007660204544663429,
        -0.010726387612521648,
        0.03124069608747959,
        -0.047903623431921005,
        -0.03456981107592583,
        0.051980167627334595,
        -0.03789122775197029,
        0.013404697179794312,
        0.005629817955195904,
        0.009067404083907604,
        0.03827838599681854,
        -0.07974325120449066,
        -0.010591384954750538,
        -0.0024902622681111097,
        0.0012505491031333804,
        -0.01416686736047268,
        -0.03839818760752678,
        -0.010291563346982002,
        0.0074026938527822495,
        -0.026335308328270912,
        0.11956434696912766,
        -0.05386011302471161,
        -0.06932444870471954,
        0.025342892855405807,
        0.06226719915866852,
        -0.05833137780427933,
        -0.0013400847092270851,
        -0.00871369894593954,
        -0.022015301510691643,
        -0.036525022238492966,
        0.027532385662198067,
        0.052585385739803314,
        -0.08339034765958786,
        0.07963715493679047,
        0.03603899106383324,
        0.030666343867778778,
        0.06923888623714447,
        -0.07266649603843689,
        0.016671176999807358,
        0.006026539485901594,
        0.02492435835301876,
        0.05011148378252983,
        0.033120568841695786,
        0.04499968886375427,
        -5.824615811889089e-08,
        0.023104460909962654,
        -0.0309863593429327,
        0.028998393565416336,
        -0.07197297364473343,
        -0.01764584146440029,
        0.013702576979994774,
        -0.0038848731201142073,
        -0.009767167270183563,
        0.07198362052440643,
        -0.0824512243270874,
        0.05132602900266647,
        0.011286614462733269,
        -0.07541202008724213,
        0.11757093667984009,
        0.04953298717737198,
        0.02259168028831482,
        0.03988170623779297,
        0.025824550539255142,
        -0.03529202565550804,
        0.044561874121427536,
        0.031649794429540634,
        0.04536869004368782,
        0.006956041324883699,
        0.012624331749975681,
        -0.023885175585746765,
        0.03615596145391464,
        -0.012333649210631847,
        0.06892946362495422,
        0.00568176107481122,
        -0.03045388124883175,
        -0.0135548310354352,
        -0.0819445252418518,
        -0.06409861147403717,
        -0.016458434984087944,
        -0.08938764035701752,
        0.013860917650163174,
        0.021958982571959496,
        -0.1173204854130745,
        0.0707332193851471,
        0.0018571310210973024,
        -0.042686112225055695,
        -0.1232614666223526,
        0.028862128034234047,
        0.06570881605148315,
        -0.004090968053787947,
        -0.05692453309893608,
        -0.031008344143629074,
        -0.08389857411384583,
        -0.01972907967865467,
        0.042283035814762115,
        0.005928513593971729,
        -0.08589056879281998,
        -0.03669603541493416,
        -0.012077280320227146,
        0.03763236477971077,
        -9.404645243193954e-05,
        0.030540507286787033,
        0.07223113626241684,
        -0.010737883858382702,
        0.03341641649603844,
        0.04810021072626114,
        0.010113673284649849,
        -0.0972810909152031,
        -0.004721534438431263
    ]
}