{
    "id": "2LQhZcfQdCk",
    "title": "I'm starting over",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2022-07-07T15:09:00Z",
    "video_url": "https://www.youtube.com/watch?v=2LQhZcfQdCk",
    "category": "Science & Technology",
    "tags": [
        "austin evans",
        "austin",
        "evans",
        "this is",
        "denki",
        "denki time",
        "studio",
        "studio tour",
        "office",
        "bts",
        "behind the scenes",
        "camera",
        "gear",
        "mystery tech",
        "video"
    ],
    "views": 687726,
    "likes": 44424,
    "comments_count": 1773,
    "description": "This has been quite literally years in the making  Subscribe to Ken's channel @Denki:  More shenanigans on @thisis:     Subscribe for more!  TikTok:  Instagram:  Twitter:",
    "description_links": [
        "https://www.youtube.com/denkitime",
        "https://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- It's all gone, and it is time for a fresh start at our brand new office building! Apologies for the click bait, but today I'm gonna give you a tour of our brand new studio as well as give you a little look at our previous studio and say goodbye to the many, many fun videos we've shot there. It's actually gonna be a little sad. So this is the spot that we have been in for, actually a full six years now. Originally, this front room was very different, right? So before it was painted and we had all the wood up, this was almost more so storage, because our real first studio was actually in the back over here. It was a little bit of a gap between when I had the fire and when I moved to California and kind of really started getting set up. But this is really where I treat the last few years of the channel really starting. This is where we built the ultimate PS5 set up where we had all the consoles set up here. That was a huge project. It's honestly kind of sad to tear a lot of this stuff down. The amount of times I've sat here and ordered dumb things from Wish. Oh, hell no, electric foot stimulator massager. No. I hate, dude, I hate electricity. I hate being shocked by things. Little gas engine from mystery tech. The coolest Walkman that's ever been made. So this is actually my dad's old camera. So this is a Roloflex. Actually, if you look in, it's very blurry. If you're curious about any of the more detailed stuff, Sara Dietschy actually recently did a full studio tour which I would definitely recommend checking out, where she went really in depth on a lot of the stuff that we've got here. This space is very nostalgic for me because this was our first real studio. So, it's hard to see underneath all the stuff, but where Jared's standing over here by the fridge, that was where the camera was. We actually didn't have a refrigerator there. That was where the camera was. We had a table here. I sat on something like this. And this is how we did videos for the first few years. The first episode of Mystery Tech with Lamarr in it, still I think my favorite video I've ever done, was right here. This is from a Broke vs Pro, a year ago, maybe? So Ken built a PC in this desk. Ken came on and really Overclock was founded in 2016. What is this? Ken, you? - [Ken] Told me not to cotton candy it. - Okay. Why don't we go take a look at the other spot though? Otherwise I'm gonna get too emotional here. This is probably gonna look a whole lot more familiar. This has been our main studio space for the last four years? Five years? We've had some people come in who have looked at our spot and they're always like, \"Oh my God, you do so much in this little spot.\" And like, yeah, well, this is all we had, you know? This is the old This Is set. This is where we keep a lot of the gear, where we keep the Pokemon cards that we open before every shoot, because you know, it's important. And this is the old workshop, which is incredibly tiny. You've probably seen this when we were doing something like the PC builds last year, where we were 3D printing the Checo build or Minecraft stuff in here, and we'd have all the actual lights controlled from this board. Look at this. This was the PS5/Xbox hybrid that we did, I guess last year? I think as we've been moving and tearing stuff apart, I keep finding more and more little Easter eggs and sort of little memories of things. This, I would like to think, looks a little bit more familiar. So this is the main channel set that we currently have right now, and we're gonna keep this up and running until it's fully set up in the new office. You'll still see videos from in here for I'd say a few months. So you see there's so many nick-nacks. This is, we did a video on the first optical mechanical switch that Razer had, and we almost didn't make that video but ended getting like, 10 million views. (plastic clicking) So for our new set, it's gonna be completely different. So we're gonna be re-doing literally everything. Some stuff is gonna move over, like I think maybe the chalk sign, I think the neon sign. Roboraptor which of course, he'll go with us forever. Anytime you see us on a backdrop or something, it's actually literally right here. This is where This Is 1.0 was shot. So we're literally in the normal spot, we just fly the desk out of the way and I'd be like, \"Welcome to the world's craziest power plant\" Or, you know, some of those very early This Is videos. This is way more of an emotional video than I thought 'cause I'm just realizing that we gotta say goodbye to all this. The switch book from I think the very first episode of the Ultimate Build Off that Ken and Matt made. I don't know why Jared put this back here 'cause it looks like I'm dead and it's the memorial for Austin. We've got the arcade cabinet. So this is actually originally built for PUBG mobile. A lot of the stuff is still in here, and that video I think was so cool. All of this actually worked, so not only had the LEDs, but actually had a fog machine inside, which is actually still in here. and we've got the table. - [Ken] The termite-infested table. - Look, we're not talking about the termite. Okay, yes, has this table had termites for five years? Maybe. have I continued to shoot here anyway? Absolutely. This is Austin's cancel corner. So anytime there's some serious (blank) to talk about, I'm usually here and I'm like, \"Well, I'm sorry for saying the PS5 is better when in fact it is worse\" Or whatever nonsense. This is the main camera angle for Mystery Tech. So you see, basically, if you flip around, this is the normal shot for Mystery Tech, so the camera lives all the way back here. We got the button which you always just have to keep on deck. So this is actually where I recorded the Test Drivers for two years. So I would literally set my laptop here with this USB-C cable. I had it all connected to the MixPre. I have my mic here, which I'm gonna move over to the new studio soon. You guys wanna see the real secret stuff? - [Joanna] Oh yeah. - [Jared] It's gonna be a mess. - [Austin] It is a mess. This is the storage spot. Oh, what? Is this not the right shot, coming up the stairs? So this is all stuff that's currently being moved. So we've got trays of CPUs, which I always find to be very exciting. Having a bunch of older consoles comes in handy so often. So this backpack. So basically, the way this thing was set up was that it would give me a third person perspective where I had to build a PC, and this was probably the worst video that I've ever had to take part in. That was one of those few videos where halfway through, I think I actually had to stop. I don't remember if I threw up or not, but I definitely remember, I had to just take a break and come back the next day. While I might be a little sad that we're leaving, let me give you a little sneak peek at what the new spot looks like. You've seen a couple of teases in a few videos over the last six months or so. Let's just say it looks a little different now. Welcome to OC HQ. So this has been a very long time in the making. We started looking for stuff over a year ago was when I think the process started. - Over, longer than that. - And then what, a solid six months of construction and just kind of prep and stuff. As you can see, we're literally in the process of moving. This stuff showed up 20 minutes ago. We've got a chair here where I can sit and... - [Matt] It's called a reception desk. - So this is the main work area. Hello, friends. We shamelessly stole Marques' desk idea. So these are the two sided desks that you can just kind of lift up, because I'm personally a big fan of standing desks. I would just point out that literally everyone is awkwardly trying to stay off camera right now, but I don't think, yeah, everyone creeps around. On camera. Okay, Jared, that's enough, Jared. That's enough, Jared. So, if you've subscribed to the highly successful, world acclaimed Denki channel, you'll know that Ken's been making videos for a few months, and those videos have primarily actually been shot back here. So this was originally Denki HQ for the first few months. Now it is Matt's office. - This is actually probably the biggest office out of everyone's personal offices. So Matt, good for you. - Well, I'm the biggest person out of all of them. - That's pretty true. That's fair, that's fair. - So we come around here, we got a little kitchen area. This, I'm very excited to say, is the break room. Now for context, you've seen what our existing studio looks like. This is two thirds of the size of our existing studio and it's just a break room. So one of the first things we did when we moved in here was swap out all the lights. These are actually all LED. One of the things we wanted to try to do is that while obviously upstairs is the actual studio, so that's where we'll be doing the proper filming. But for videos like this where we just wanna wanna be able to walk around and shoot stuff, we can just flip on the regular lights and it is very bright in here. Almost too bright. So, this is a room I'm excited for. So we've never had one of these before. It's a conference room. We'll have a TV up here on the wall. I think this building is about eight times bigger than all of our studios combined right now. Jared, would you like to go to your office? - [Jared] Oh, what an upgrade. Dude, this one has so much natural light. - Much better. Basically, the idea with this space is that downstairs is where pretty much everyone works, but upstairs is where the fun happens. Oh, you're gonna take the elevator? - Yeah, we're taking the elevator. - Okay, they're gonna take the elevator. I'm gonna walk up the stairs. - [Joanna] Uh... - You're taking the elevator with them? - [Joanna] Well- - All right, fine. No, no, no, you gotta shoot the stairs. - [Joanna] Okay. - I'm very excited because we have a sign. Again, signs make things legit. So we went back and forth on this design five or six different times, and every time they came back like, \"Can you make it bigger? Can you make it bigger?\" This is literally, they're like, \"That's too big.\" I'm like, \"No, it looks great.\" How is the elevator? - It was great. Elevator is the best part of this whole building. So this area right here is the gear cage. This is where the cameras and all the kind of film equipment is going to live because basically regardless of where you're shooting in the building, it's all, you can easily pull it from one spot. So in here is our B-roll studio. So as you can see right now, this is mostly staging area for gear that's slowly coming over, but essentially, this is gonna be Joanna's zone. We're basically gonna steal Marques' top down room 'cause I really like that, but basically, this is a dedicated studio just for B-roll. Now, over here is Jared's actual work zone. Jared, would you like to give us a tour of the workshop? - Sure, so this is my grand old workshop. Over here is gonna be our 3D printer table. We have this brand new Rat Rig V-Core 3. That's how big we're gonna be able to print with it. - [Austin] Which is huge for a 3D printer. - It's massive. And then this will just be a general workspace. - [Austin] This is not huge, but compared to the last space which was half the size of this table was a whole workshop. - It was literally a kitchen in an apartment. That was what we were using as a workshop. - So this is studio A. Unlike our friends in the great white north who have 11 buildings, we wanna make sure that this lasts for a long time, so the idea is that we're most likely gonna end up splitting this room into half. This would be a PC build zone in the back, but honestly, for right now, this is just gonna be storage as we move, and then we'll build the studios out bit by bit. So back here is more storage. A lot of this is going to be cable wall. And in here, this is the beginnings of our server room. So as you can see, it's completely empty in here. We did install a dedicated AC system just to make sure that no matter what, it's cool in here. Now, if you wanna see something beautiful, come look at this. This Cat 6a. It all runs up here, and you can see half of it goes up into the ceiling, half of it goes down to the downstairs. So we're gonna have full 10 gigabit ethernet throughout the entire office. This is the most important room in the entire building. Well, according to me at least. This is our new main channel set. So where you see we shoot Mystery Tech and pretty much all of our videos will all be done in here. It'll be, as you can see, a couple months before we're actually ready to start using this. Continuing on. So this is the new This Is office. So as you can see, it is not done yet, so it's actually being built literally as we speak. - We have what I have deemed the Chipotle wall. - So, for reference, two days ago, this was a window. - This is gonna add to what This Is can do. We're gonna have a couple extra angles. - This Is, it's gonna be the first thing, or this is gonna be the next project operational in here. - Yes. - From when you watch this video, this will actually probably be fairly close to being done. - Yeah. - Ken, would you like to show Denki studio? - Yeah. - So actually, before we walk in here, so when we did the Target versus Walmart challenge, this was the door that we had to smash into, which has now been removed and sealed up. And that's one of the things that's been kind of fun about this whole project. Every time I come over here, everything's different, right? Like, \"Oh, the window disappeared.\" Or, \"Oh, this thing's been built\" Or whatever the case is. - Walls that weren't here before now exist. For the Denki room, which used to be two rooms, now it's just one gigantic room. So this is Denki studio. This is where I shoot all of the videos. It looks very different from the old space because the paint colors are different, the floors are different. But, I'll say that it's way more comfortable 'cause I'm not in a little shoebox anymore. I'm actually in a fairly big room. - And this is my favorite thing in here. The floating headphones stand. - It's not even really designed as a headphones stand. You're actually supposed to put your kicks or whatever. It's a shoe stand. - So that is the Denki studio. And that's actually pretty much the whole office. I think above all, I wanna thank each and every one of you for watching, for subscribing, for ringling the dingling bell. You guys are all what made this possible, and so, I'm excited to try to up the quality, up the content, and just up everything that we do. And now we finally have the space to do it where we're not literally all over each other's shoulder, crammed in a tiny little apartment, trying to make videos. We'll see how this looks in 10 years. - Or in three years when we have a new building. That one over there, that one's for sale.",
    "transcript_keywords": [
        "studio",
        "stuff",
        "videos",
        "mystery tech",
        "room",
        "Jared",
        "years",
        "set",
        "Denki studio",
        "literally",
        "video",
        "back",
        "Denki",
        "spot",
        "office",
        "things",
        "Ken",
        "camera",
        "mystery",
        "tech"
    ],
    "transcript_entity_values": [
        "Marques",
        "Easter",
        "the Ultimate Build Off",
        "six",
        "Checo",
        "Roloflex",
        "Jared",
        "half",
        "third",
        "10 million",
        "two thirds",
        "USB-C",
        "a few months",
        "Razer",
        "Roboraptor",
        "the next day",
        "first",
        "10",
        "Walmart",
        "two years",
        "Ken",
        "Rat Rig V-Core 3",
        "the last four years",
        "Austin",
        "the last six months or so",
        "two",
        "2016",
        "Minecraft",
        "Matt",
        "the first few years",
        "Xbox",
        "California",
        "Lamarr",
        "five years",
        "Austin",
        "about eight",
        "six months",
        "one",
        "ringling",
        "Pokemon",
        "11",
        "AC",
        "10 years",
        "Walkman",
        "a year ago",
        "Joanna",
        "nick-nacks",
        "five",
        "the first few months",
        "two days ago",
        "three years",
        "Chipotle",
        "Sara Dietschy",
        "last year",
        "Target",
        "OC HQ",
        "a couple months",
        "20 minutes ago",
        "the last few years",
        "a full six years now",
        "Five years",
        "Mystery Tech",
        "One",
        "Denki",
        "today",
        "PS5",
        "Denki HQ"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "LOC",
        "PERSON",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "DATE",
        "GPE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "NORP",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG"
    ],
    "vector": [
        0.0472063384950161,
        -0.09539246559143066,
        0.12834173440933228,
        0.024967029690742493,
        0.10437696427106857,
        -0.014551127329468727,
        -0.07330634444952011,
        -0.02080821804702282,
        0.030784040689468384,
        0.002268560230731964,
        -0.11520428210496902,
        0.08160955458879471,
        0.008741478435695171,
        0.0011030134046450257,
        0.014618545770645142,
        -0.03954870626330376,
        0.014687489718198776,
        -0.13296793401241302,
        -0.044288817793130875,
        0.007095749955624342,
        -0.020596053451299667,
        -0.03790413960814476,
        -0.05089757218956947,
        -0.023197149857878685,
        0.032108161598443985,
        0.044460050761699677,
        0.016917720437049866,
        0.07502225786447525,
        0.017965778708457947,
        -0.08370130509138107,
        -0.0008357588085345924,
        0.04061194881796837,
        0.00958762876689434,
        -0.025776168331503868,
        0.04953472316265106,
        0.03740202262997627,
        -0.006167965475469828,
        -0.03742092102766037,
        -0.016719968989491463,
        -0.020249614492058754,
        -0.0209749024361372,
        -0.03840864077210426,
        0.03577712923288345,
        0.09565114974975586,
        -0.0380219966173172,
        -0.02777072787284851,
        0.01927427016198635,
        -0.10958577692508698,
        0.07697159051895142,
        -0.043638214468955994,
        0.00839928351342678,
        -0.025880685076117516,
        0.0644402801990509,
        -0.00785048771649599,
        -0.03452625870704651,
        0.04410293698310852,
        0.04588652029633522,
        -0.045993633568286896,
        0.07735325396060944,
        -0.06413700431585312,
        0.06146056577563286,
        -0.061546843498945236,
        -0.0375419445335865,
        0.022189827635884285,
        -0.028758998960256577,
        0.0049866000190377235,
        -0.00022464468202088028,
        0.06711922585964203,
        0.08396871387958527,
        -0.03287196531891823,
        -0.03109152801334858,
        0.04489360377192497,
        -0.022630924358963966,
        0.03816109895706177,
        0.10026506334543228,
        0.016781605780124664,
        0.019314652308821678,
        0.0038073735777288675,
        0.040050823241472244,
        -0.053245458751916885,
        0.08511766046285629,
        -0.06510963290929794,
        -0.12346160411834717,
        0.01982412487268448,
        -0.10555523633956909,
        0.01831960305571556,
        0.028575556352734566,
        0.023764844983816147,
        0.0031894820276647806,
        0.011748934164643288,
        -0.017861340194940567,
        0.06564410030841827,
        -0.028399169445037842,
        0.010573802515864372,
        0.011942064389586449,
        0.00672498531639576,
        -0.08045466244220734,
        -0.04014226794242859,
        0.010167429223656654,
        0.07177440077066422,
        -0.04055367782711983,
        0.05554426833987236,
        0.08921525627374649,
        -0.032057881355285645,
        -0.008589657954871655,
        -0.09574280679225922,
        -0.05718212202191353,
        0.04081379622220993,
        -0.04157723858952522,
        -0.036207497119903564,
        -0.017942728474736214,
        -0.008515171706676483,
        -0.07065930217504501,
        0.08289500325918198,
        0.09622611105442047,
        0.019155949354171753,
        0.03680729866027832,
        0.02680882439017296,
        0.012483391910791397,
        -0.014603681862354279,
        0.06802292168140411,
        0.018537795171141624,
        -0.03265855088829994,
        0.02299671620130539,
        -0.011452115140855312,
        -0.04117424041032791,
        -0.023641865700483322,
        6.881667925344116e-33,
        0.06114457920193672,
        0.06030901521444321,
        -0.039827775210142136,
        0.11158169060945511,
        0.0744316354393959,
        -0.0169523935765028,
        -0.033343613147735596,
        0.07271172851324081,
        -0.03452223911881447,
        0.035912640392780304,
        0.07732508331537247,
        0.05829097703099251,
        -0.05724889785051346,
        -0.030660871416330338,
        0.08428078889846802,
        -0.04425622522830963,
        -0.04329000413417816,
        -0.0070548634976148605,
        -0.06086907535791397,
        -0.03268132358789444,
        -0.057292114943265915,
        -0.03172159567475319,
        -0.016236014664173126,
        0.008936764672398567,
        0.027656158432364464,
        0.042218953371047974,
        0.015116872265934944,
        -0.0009186462848447263,
        -0.04062429443001747,
        -0.02182048000395298,
        -0.11887882649898529,
        0.026315737515687943,
        0.006725097540766001,
        0.031450603157281876,
        0.023693155497312546,
        -0.0203526820987463,
        0.014794381335377693,
        -0.03810056298971176,
        0.03898458555340767,
        -0.00590535206720233,
        -0.046944793313741684,
        0.09463737159967422,
        -0.020018957555294037,
        0.017231231555342674,
        0.02225346490740776,
        0.031383730471134186,
        0.06580651551485062,
        0.019439972937107086,
        0.003373614978045225,
        0.05113896727561951,
        0.020042849704623222,
        0.03447943925857544,
        0.016997236758470535,
        0.02573563903570175,
        -0.028913484886288643,
        -0.05783962458372116,
        0.03392915427684784,
        -0.09308864176273346,
        0.1094031110405922,
        -0.03308247774839401,
        0.09350382536649704,
        0.09559576213359833,
        -0.005400910973548889,
        0.05791262537240982,
        -0.05611796677112579,
        0.0349089689552784,
        0.03312978893518448,
        0.052021536976099014,
        0.08168817311525345,
        -0.03339339420199394,
        -0.07187218219041824,
        -0.0470905639231205,
        -0.023734204471111298,
        -0.06269852817058563,
        0.05321430787444115,
        0.04335186630487442,
        -0.1281103938817978,
        -0.005554782692342997,
        0.011789114214479923,
        0.07836094498634338,
        -0.04261573404073715,
        0.027569187805056572,
        -0.08327388763427734,
        0.03638927638530731,
        0.02462880313396454,
        -0.018941540271043777,
        0.11450070142745972,
        -0.012552035972476006,
        -0.053166713565588,
        0.045751143246889114,
        -0.045827556401491165,
        -0.014432314783334732,
        0.06247662380337715,
        0.03903510421514511,
        -0.013115028850734234,
        -6.163584140365705e-33,
        0.04606188088655472,
        -0.09377788752317429,
        0.01638108491897583,
        -0.00126739835832268,
        0.008965734392404556,
        -0.06877754628658295,
        -0.008552540093660355,
        -0.0027462078724056482,
        0.04090997204184532,
        -0.014463824220001698,
        0.040899332612752914,
        -0.0015731474850326777,
        0.015216056257486343,
        -0.03906600549817085,
        -0.043521009385585785,
        -0.049494851380586624,
        0.0831909105181694,
        -0.04294838383793831,
        -0.067130446434021,
        0.006635681260377169,
        0.06158216670155525,
        0.07416369765996933,
        -0.10355885326862335,
        -0.0185546837747097,
        -0.052722346037626266,
        0.0605730339884758,
        0.02827845886349678,
        0.06032034382224083,
        -0.06055964156985283,
        -0.01706819050014019,
        -0.07829581201076508,
        -0.029435286298394203,
        -0.013410923071205616,
        0.0022830392699688673,
        -8.176384289981797e-05,
        0.056661512702703476,
        0.08617205172777176,
        0.005718593951314688,
        -0.014770489186048508,
        -0.07893747091293335,
        0.050565291196107864,
        0.00706809526309371,
        -0.051319222897291183,
        0.04486898332834244,
        -0.018965277820825577,
        -0.019616831094026566,
        -0.01694120652973652,
        0.005860777571797371,
        -0.08502793312072754,
        -0.004890452139079571,
        0.02058684639632702,
        0.015553498640656471,
        -0.08893825113773346,
        -0.1424310803413391,
        0.027980074286460876,
        -0.010646762326359749,
        0.04313458129763603,
        0.049750037491321564,
        -0.03836952894926071,
        0.05770093575119972,
        -0.03446027263998985,
        -0.01370724756270647,
        0.024155396968126297,
        -0.014576778747141361,
        -0.062112241983413696,
        0.009998823516070843,
        0.10639554262161255,
        0.03686489537358284,
        -0.04824632406234741,
        0.006394030060619116,
        -0.03542482107877731,
        0.0725240483880043,
        -0.04926561191678047,
        -0.04391583800315857,
        -0.0087956003844738,
        0.023919006809592247,
        0.08316662907600403,
        -0.04654549062252045,
        0.025920435786247253,
        -0.0011318526230752468,
        -0.11991512775421143,
        0.07168349623680115,
        -0.0963883101940155,
        0.006027706898748875,
        0.0682712271809578,
        0.10243780165910721,
        -0.06279529631137848,
        0.0010689824121072888,
        -0.007570465095341206,
        -0.0012209098786115646,
        -0.03543293848633766,
        0.013875543139874935,
        -0.05656597018241882,
        -0.027294745668768883,
        -0.014657661318778992,
        -7.186672235093283e-08,
        -0.07553346455097198,
        0.028093723580241203,
        0.0021704367827624083,
        0.014174164272844791,
        0.044966921210289,
        -0.05204560235142708,
        0.06490496546030045,
        0.07303622364997864,
        0.04700320214033127,
        -0.020143218338489532,
        0.028492821380496025,
        -0.004913976415991783,
        0.021434254944324493,
        0.05087403208017349,
        -0.02806498482823372,
        0.054806191474199295,
        -0.044293444603681564,
        0.04496828094124794,
        -0.08183072507381439,
        -0.03463313728570938,
        -0.02768922597169876,
        0.026530662551522255,
        0.05777622014284134,
        -0.008619632571935654,
        0.03555645793676376,
        -0.04426000639796257,
        -0.0022639790549874306,
        -0.00564297940582037,
        0.03728552535176277,
        -0.03062555566430092,
        0.007028658874332905,
        -0.011243409477174282,
        -0.12399006634950638,
        0.015376057475805283,
        0.018597081303596497,
        -0.10606646537780762,
        -0.006963788531720638,
        0.03857959434390068,
        -0.029278825968503952,
        0.0367690809071064,
        -0.0440148189663887,
        -0.09015174210071564,
        -0.05120745673775673,
        0.04506763443350792,
        -0.0160808302462101,
        0.002510638441890478,
        -0.05498690903186798,
        0.04247423633933067,
        -0.02620032988488674,
        -0.03648856282234192,
        -0.05243518948554993,
        -0.044886864721775055,
        -0.03278409689664841,
        0.013276302255690098,
        0.11141446977853775,
        -0.006024644244462252,
        -0.02960548736155033,
        0.0538889579474926,
        -0.020911188796162605,
        0.03202008455991745,
        -0.027360180392861366,
        -0.040641892701387405,
        -0.10996468365192413,
        0.07129859924316406
    ]
}