{
    "id": "2mRXgZTUm8s",
    "title": "The Mi Mix 3 is cooler than you think... - Teardown",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-01-29T16:49:05Z",
    "video_url": "https://www.youtube.com/watch?v=2mRXgZTUm8s",
    "category": "Howto & Style",
    "tags": [
        "Mi Mix 3",
        "Xiaomi Mi Mix",
        "slider phone",
        "magnetic slider",
        "magnets inside cell phone",
        "xiaomi",
        "smartphone",
        "android",
        "mobile phone",
        "no notch",
        "best smartphone",
        "cool smartphone",
        "Best android",
        "motorized camera",
        "teardown",
        "hot to fix mi mix 3",
        "repair",
        "mi mix 3 review",
        "xiomi mi mix 3 review",
        "top smartphones 2019",
        "screen repair mi mix 3"
    ],
    "views": 1854425,
    "likes": 48052,
    "comments_count": 2827,
    "description": "The Mi Mix 3 Sliding smart phone is attractive. Literally. Go to  to get 75% off and use code JERRYRIG to get one additional month for free! With super strong magnets inside the Mi Mix 3, the two halves of the phone are constantly attracting each other to stay in the 'closed' position, and constantly repelling each other to stay in the 'open' position. Xiaomi has designed a brilliant phone. Uniquely with no complex mechanical parts that might break or fail. I think this mechanism will last for quite a while.   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://NordVPN.com/jerryrig",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "This teardown is sponsored by NordVPN. Watch till the end to get a 75% discount and a free month. The Mi Mix 3 is a unique slider phone with the physically hidden front facing cameras. One thing I did notice while charging the phone up for this video was that the cable in the box is specifically designed and formed for this phone, allowing the screen to slide while charging. But, while using a third party cable, the screen is stuck in the closed position. Kind of interesting. It's time to take apart the Mi Mix 3 and see what kind of magic is holding the whole contraption together. Let's get started. [Intro] Since the Mi Mix 3 isn't water resistant, we can always hope it won't be glued shut quite as tight as some of the other water tight phones. A little bit of heat gets the phone hot enough to soften the adhesive between the glass and the frame of the phone. I can use my suction cup to pull up on the glass slab and slide my razor, or metal pry tool, underneath to slice away the adhesive holding the two portions together. It kind of makes you miss the good old days when all you needed was a screw driver...but, it is what it is. The back glass panel does pull away easy enough. I'm taking special care not to put any stress on the fragile ribbon cable connecting the fingerprint scanner to the board. I'll reach my plastic pry tool in there and unsnap it like a little Lego. Then the back glass can fold away from the phone. It kind of looks cool inside with the black plastic and gold antennas. The wireless charging coil is still connected to the rear glass and covered with black plastic on both sides. So it's not quite as aesthetic as Google's copper colored coils on the Pixel 3. And we also have what's probably the NFC pad up here at the top, attached to the back glass. Xiaomi does have not one, but two, warranty void stickers...which means we better stop the teardown. Just kidding. With 9 normal Phillips head screws holding down the top protective plastics, we can finally unplug the battery and make our way down to the magical pull tabs poking up from the bottom. I'll get to show you exactly how the magic happens with these pull tabs because one did end up breaking. They are unfortunately silent, but do their job for the most part, hypothetically allowing the battery to release without putting any stress on the pouch itself. If the fragile pull tab doesn't break during the pull, of course. Now that the battery is out, you can see how the adhesive reacts when tension is applied to the white strip. It loses it's stickiness and pulls out from underneath the battery easily, while leaving no reside behind. The longer the battery has been installed though, the more brutal these become, and the easier they break. But still, pull tabs are better than the permanent adhesive alternative. Inside the Mi Mix 3 is a 3200 milliamp hour battery. After the battery's removed, we get our first glimpse of how the sliding mechanism works. Two rather large rectangular magnets. You can see how it pulls the metal screw into the center with it's magnetismic force. I don't really know how magnets work. The screen ribbon flexes with the motion of the slide, kind of like what we saw with the Vivo Nex S's motorized camera from last year. We got to go deeper though. So the 7 Philips screws surrounding the bottom plastic plate are next. The plastics that pull away include the... [drop] ...include the loud speaker with the two square golden contact pads. These allow for communication with the motherboard. I still think the black and gold accents are kind of fun. I'll remove the one silver screw from the charging port board, and unplug the white wire cable. Then unclip the bottom extension ribbon. This allows the small board to fall out of the phone frame. It's got the standard USB-C port, along with the microphone, but no headphone jack. Those are getting more and more rare these days. All that's left in the bottom part is the cute little coin-style vibrator motor, but we'll leave that in place for now. The motherboard up top is where some cool stuff is happening. Basically all the connectors have this copper grounding tape over the top. I imagine that with the sliding motion of the phone, the internals are constantly feeling sharp jolts and the screen jerks up and down. So the tape probably helps keep the ribbon intact and plugged in. Each of the 4 camera connections are unclipped, and there are 3 little silver Phillips head screws holding down the motherboard. The 2 front facing cameras come away next a 24 megapixel and a 2 megapixel sensor that allow for the blurry background portrait mode thing. Both housed in the same metal housing. The dual SIM card tray comes out next. This would probably also make a good step number 1 if you like doing things in order. Finally I'll unclip the screen ribbon surrounded by red rubber, which I assume helps support the cable as it constantly flexes and moves with the sliding motion of the phone. Xiaomi has said that they've tested the sliding motion over 300,000 times with no ill effects on the hardware. And it does look like they have taken extra precautions from the inside, which is nice. Gray dollops of thermal pates on the back of the motherboard transfer heat to the metal frame of the phone. There is also a white hexagon shaped water damage indicator sticker next to the SIM card tray. This will turn pink if the phone ever gets wet. And now the rear facing cameras both with different functions. The normal 12 megapixel sensor does have optical image stabilization, but the 12 megapixel telephoto camera does not. Both are mounted in the same metal housing. We didn't come all this way to stop here though. That sliding motion still needs to be explained. Underneath the long black extension ribbon, we reveal a third set of yellow tape covered screws, which I'm pretty sure all attach the screen into the body. I'll peel away each of the 3 yellow tape strips and unscrew the 8 super flat Philips head screws, similar to the same sidewall screws we saw back in the iPhone 4. The Mi Mix 3 has 28 screws inside, so I'm definitely keeping them all organized off to the side, so I can hopefully put the phone all back together again when I'm done. After the last 2 top screws are removed, I can very gently slide the screen ribbon out through the hole in the phone housing. And we've successfully removed both halves of the phone. The design of this thing is so simple, it's brilliant. A little trick I saw on Marquez's channel was this magnet paper that shows us where magnets are hidden inside of electronics. Two large rectangular magnets in the main body of the phone, and down here we can also see it's picking up the little tiny magnet inside of the vibrator motor. Then over here on the screen half of the slider, we have another 2 main magnets. The silver sliding rack itself on the screen side is completely free floating no springs or resistance. It slides up hitting the large rectangle, and then slides back down and locks out with the little silver tabs bent up, hitting the ends of the plastic rails. These blocks keep it from extending too high up and too far down. Obviously the thin AMOLED screen is glued into the other side of this thin piece of plastic, and it is replaceable with enough heat. The little gold screen ribbon just pokes through the hole in the back of the plastic. Now you might be thinking to yourself, 'Hey Jerry, don't magnets spend all their time attracting each other? How does the slider stay open if the magnets are the only thing inside of there?' Well, I'm glad you asked. As you can see, when the slider is in the closed position, the magnets line up directly over top of each other with a large amount of attaching force. But when I slide up, the magnets move from the initial attracting magnetic field, into a position where the magnets are actually repelling each other and pushing away from each other, holding the screen in the upward, extended position. This is pretty brilliant because there are no motors, springs or crazy complicated hardware to get jammed or misaligned just simple magnetic fields. Let me show you. I have two super strong magnets here. Strong enough that they want to attract through my finger. I'll put them on either side of my metal pry tool. The north end of one magnet is currently very strongly attracted to the south end of the other magnet. But let's say I move the 2 magnets so that they're next to each other. They start to repel pushing away. Just like the position of the magnets in the phone when the slider is open. But when the slider is closed, the magnets line back up again and attract each other into the down position, keeping the slider tightly closed. The fun sliding effect you feel with the Mi Mix 3 is that feeling of magnets passing from one attracting magnetic field into the repelling magnetic field. It's pretty smart of Xiaomi. I mean, so far, this is the only phone I've taken apart in 2019, but with this kind of ingenuity, we're off to a good start. I'm definitely going to need y'all to collectively cross your fingers now, in hopes I can put all 28 screws back into place with everything still working. I'll make sure the yellow tape is back on top so the screws won't jiggle loose with the jarring motions of the slide. The motherboard can set back into place with it's red rubber protecting the screen ribbon cable. And all 4 of the camera units get plugged back in with the 3 silver motherboard screws holding everything down. Then I'll set the charging port down into the frame next to the small vibrator. The rest of the install is super straightforward, with the super long extension ribbon cable running under the battery, which also then gets set into place. And then the camera lenses and all the plastics get screwed down with all those screws I kept organized earlier. The last step is the fingerprint scanner ribbon, and the back glass panel getting set back onto the phone. And lucky for us, the whole thing does still turn on, and slides up and down just like it did out of the box. This is partially due to the pure simplicity of the design and also because you had your fingers crossed the whole time. Thank you. I agree with Xiaomi that the sliding mechanism is indeed secure. And with no moving mechanical parts, it's probably going to last for a very long time. Speaking of secure things, huge thanks to NordVPN for sponsoring this video and making the teardown possible. You've probably heard of a VPN at this point since you're on the internet right now. A Virtual Private Network allows you to encrypt your Internet traffic and change it from one location to another. It's super important that all your personal information is unobtainable and untrackable, especially when using public Wi-Fi at hotels or restaurants, or even at home. With over 5,000 servers in 62 different countries, NordVPN is rated the Number One virtual private network by PC Magazine, and can secure 6 different devices, like cell phones and computers, all at the same time. For a free month and a 75% discount off a 3 year plan, use the discount code: jerryrig. It ends up costing just a few cents a day. NordVPN.com/jerryrig. I'll put the link in the description. Would you ever use a slider phone, or would you rather everything be in one solid piece? Let me know in the comments. Come hang out over on Twitter and Instagram. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "phone",
        "magnets",
        "back",
        "screen",
        "screws",
        "screen ribbon",
        "ribbon",
        "back glass",
        "Mix",
        "pull",
        "battery",
        "plastic",
        "sliding",
        "slider",
        "glass",
        "Kind",
        "screws holding",
        "cable",
        "top",
        "slider phone"
    ],
    "transcript_entity_values": [
        "the Mi Mix 3",
        "over 5,000",
        "Google",
        "2019",
        "the Vivo Nex S's",
        "9",
        "6",
        "8",
        "just a few cents",
        "Lego",
        "Instagram",
        "two",
        "Wi-Fi",
        "Virtual Private Network",
        "Philips",
        "Jerry",
        "75%",
        "Two",
        "1",
        "Marquez",
        "VPN",
        "12 megapixel",
        "half",
        "The Mi Mix 3",
        "4",
        "Phillips",
        "SIM",
        "PC Magazine",
        "28",
        "24 megapixel",
        "NFC",
        "the white strip",
        "300,000",
        "first",
        "last year",
        "3200 milliamp hour",
        "Xiaomi",
        "2 megapixel",
        "a free month",
        "the Mi Mix 3",
        "these days",
        "third",
        "62",
        "3",
        "One",
        "3 year",
        "one",
        "two square",
        "7",
        "Twitter",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "DATE",
        "FAC",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.12771840393543243,
        -0.03963390365242958,
        0.09641294181346893,
        -0.07763618230819702,
        0.03182908520102501,
        -0.06893842667341232,
        0.082706518471241,
        0.06531332433223724,
        -0.04581763595342636,
        0.036201078444719315,
        0.13079243898391724,
        0.03292287513613701,
        0.05117562785744667,
        0.023485613986849785,
        0.03444133698940277,
        0.027319174259901047,
        0.03215288743376732,
        -0.008396439254283905,
        -0.0672331377863884,
        0.08294365555047989,
        0.03608578443527222,
        -0.03587740659713745,
        0.02677277848124504,
        0.0045656017027795315,
        -0.02130434289574623,
        0.052560385316610336,
        -0.029923783615231514,
        0.021624727174639702,
        -0.03357813134789467,
        -0.037711575627326965,
        0.035325564444065094,
        0.09245721995830536,
        0.005458429921418428,
        -0.026034345850348473,
        0.039620183408260345,
        -0.053461428731679916,
        0.03730341047048569,
        -0.00583344791084528,
        -0.08696573227643967,
        -0.017745954915881157,
        -0.12126290053129196,
        0.007780057843774557,
        0.1298225224018097,
        -0.009816283360123634,
        -0.02418375201523304,
        0.006971131078898907,
        0.09864319860935211,
        -0.08886513113975525,
        0.02101239003241062,
        -0.04520721361041069,
        -0.09477682411670685,
        -0.03414176404476166,
        0.02714705280959606,
        0.08585610240697861,
        -0.05982360616326332,
        0.01812993362545967,
        -0.01783745177090168,
        0.008753879927098751,
        0.008400985039770603,
        -0.021075693890452385,
        0.037214357405900955,
        0.06916951388120651,
        -0.05414823070168495,
        0.037697579711675644,
        0.004668551962822676,
        -0.00396322226151824,
        -0.029063468798995018,
        -0.06296027451753616,
        0.03975674510002136,
        0.02908865548670292,
        -0.04465651884675026,
        -0.038664620369672775,
        -0.058259010314941406,
        0.008264205418527126,
        -0.013399694114923477,
        0.08511614054441452,
        0.054452069103717804,
        -0.006654367316514254,
        -0.0337580144405365,
        0.016900639981031418,
        0.03966638073325157,
        -0.042889565229415894,
        -0.012221728451550007,
        -0.03343215212225914,
        0.006058670114725828,
        -0.023473599925637245,
        -0.03839818388223648,
        0.10398153960704803,
        -0.030947351828217506,
        -0.004653776064515114,
        -0.020851189270615578,
        0.11927768588066101,
        -0.05196276679635048,
        -0.002756096189841628,
        0.0974845141172409,
        -0.03338363394141197,
        -0.12087532877922058,
        -0.1220717504620552,
        -0.012065625749528408,
        0.07008980214595795,
        -0.030971132218837738,
        -0.018466154113411903,
        0.015802571550011635,
        -0.0044555626809597015,
        0.07012718170881271,
        -0.06816523522138596,
        -0.05429716408252716,
        -0.013227691873908043,
        -0.03934858739376068,
        0.005209334660321474,
        -0.016621781513094902,
        -0.00043483293848112226,
        -0.05216069146990776,
        -0.007071079686284065,
        -0.031088609248399734,
        0.04313915967941284,
        0.0019106795080006123,
        0.10523476451635361,
        0.06424862891435623,
        0.02294679917395115,
        0.08115260303020477,
        -0.0012158211320638657,
        -0.05397283658385277,
        -0.009705653414130211,
        0.04224391281604767,
        0.016396524384617805,
        -0.040837835520505905,
        5.3105756444319734e-33,
        0.030494971200823784,
        0.05740313604474068,
        -0.019847555086016655,
        0.05063766986131668,
        -0.06175254285335541,
        -0.003937940578907728,
        0.04999928176403046,
        0.0025010572280734777,
        -0.0006142205675132573,
        0.05345424264669418,
        -0.00043022751924581826,
        0.03811470419168472,
        -0.03434343263506889,
        0.031744811683893204,
        0.03990955278277397,
        -0.0647660493850708,
        -0.028057845309376717,
        -0.05356963351368904,
        -0.0170906875282526,
        0.009349352680146694,
        -0.018580224364995956,
        -0.03154675289988518,
        -0.034329358488321304,
        0.02027871087193489,
        0.060839030891656876,
        0.09272175282239914,
        0.08047082275152206,
        -0.03228341042995453,
        0.07515180855989456,
        0.027444960549473763,
        -0.12649165093898773,
        -0.053146231919527054,
        0.009650595486164093,
        0.021640338003635406,
        -0.04009054973721504,
        0.06363550573587418,
        -0.11506249010562897,
        -0.10672671347856522,
        -0.011219259351491928,
        0.0392804853618145,
        -0.046075981110334396,
        -0.0019879790488630533,
        -0.020591191947460175,
        0.00047578616067767143,
        0.07574780285358429,
        -0.011657673865556717,
        -0.02417713776230812,
        0.02064748853445053,
        -0.07509850710630417,
        0.005650043953210115,
        0.06668961048126221,
        -0.08173162490129471,
        0.0009768597083166242,
        -0.002478530630469322,
        -0.08404269814491272,
        -0.004219493363052607,
        0.02689511887729168,
        0.015225403010845184,
        0.03338269144296646,
        0.010034840553998947,
        -0.01981549896299839,
        0.002799046691507101,
        -0.03253839164972305,
        0.050268881022930145,
        0.00597058329731226,
        0.01123775914311409,
        0.00070076750125736,
        0.008723448030650616,
        -0.06727913022041321,
        0.08496753871440887,
        -0.04374541714787483,
        -0.01449184212833643,
        0.026682475581765175,
        -0.020959874615073204,
        -0.002435469999909401,
        -0.010150891728699207,
        -0.07280638068914413,
        -0.041495803743600845,
        0.02506810985505581,
        0.006446877494454384,
        -0.03077259287238121,
        0.03997046500444412,
        0.06652666628360748,
        0.040062014013528824,
        -0.04097047075629234,
        0.0024597204755991697,
        -0.004065482411533594,
        -0.0672341138124466,
        -0.01662016659975052,
        0.07614196091890335,
        -0.01383619848638773,
        -0.03136979043483734,
        -0.023078948259353638,
        0.054858509451150894,
        -0.03607815131545067,
        -4.841416012551628e-33,
        -0.044848524034023285,
        -0.03500784933567047,
        0.04796728864312172,
        0.033175017684698105,
        0.012388788163661957,
        -0.09010321646928787,
        0.06496401131153107,
        0.07962509989738464,
        0.04377800226211548,
        -0.02314295805990696,
        -0.041641030460596085,
        -0.018333053216338158,
        -0.011961061507463455,
        -0.03384729102253914,
        0.007158518303185701,
        -0.02143017388880253,
        0.04157791659235954,
        -0.08644648641347885,
        0.033699605613946915,
        0.06874554604291916,
        0.09955789148807526,
        0.04579421505331993,
        0.08186711370944977,
        0.07228849828243256,
        -0.05683857947587967,
        -0.011004341766238213,
        -0.004720487166196108,
        -0.02870124764740467,
        0.01208948902785778,
        0.009351416490972042,
        -0.0040731849148869514,
        -0.13739557564258575,
        0.041769664734601974,
        -0.03462100028991699,
        0.06787109375,
        0.030072899535298347,
        -0.005830973852425814,
        -0.021873559802770615,
        0.06191752851009369,
        -0.09094446152448654,
        -0.008578302338719368,
        0.020399482920765877,
        0.04802601411938667,
        0.013148929923772812,
        -0.012463834136724472,
        -0.06154664233326912,
        -0.005398344714194536,
        0.034422617405653,
        -0.03588331863284111,
        0.024355923756957054,
        -0.05988072603940964,
        -0.01187057327479124,
        -0.0764557346701622,
        -0.022151868790388107,
        -0.009778201580047607,
        -0.011691145598888397,
        0.06653501838445663,
        -0.09419526904821396,
        -0.0024371847975999117,
        0.033198848366737366,
        0.11641518026590347,
        0.0024538873694837093,
        -0.05562949180603027,
        0.014834316447377205,
        0.007855512201786041,
        0.07591377198696136,
        0.10548339784145355,
        0.01597018353641033,
        -0.046130575239658356,
        0.07016943395137787,
        0.07656046003103256,
        -0.035981323570013046,
        0.04207013547420502,
        -0.0840780958533287,
        0.07159265875816345,
        0.020355865359306335,
        -0.045306816697120667,
        0.007319213822484016,
        0.008757908828556538,
        -0.011900336481630802,
        0.06141884624958038,
        -0.006556670181453228,
        0.0374259278178215,
        0.021784137934446335,
        0.051039669662714005,
        0.014944035559892654,
        -0.021361982449889183,
        0.08546969294548035,
        -0.017362434417009354,
        -0.01009372528642416,
        -0.039778050035238266,
        0.016072427853941917,
        0.03412743657827377,
        0.043502334505319595,
        0.0013495894381776452,
        -5.774832700922161e-08,
        0.058413051068782806,
        -0.00396695313975215,
        -0.0033734594471752644,
        -0.015201215632259846,
        -0.10050401836633682,
        -0.020262427628040314,
        -0.0020159343257546425,
        -0.023392289876937866,
        0.09125138819217682,
        -0.02259625680744648,
        0.040104903280735016,
        -0.06086047366261482,
        -0.08391650021076202,
        0.10210492461919785,
        -0.053280916064977646,
        0.02791527658700943,
        -0.03654717281460762,
        0.07166948914527893,
        -0.03138589486479759,
        0.005394109059125185,
        -0.0368846096098423,
        0.01642622984945774,
        0.08303254842758179,
        -0.07500676065683365,
        -0.03361685574054718,
        0.0690997913479805,
        -0.07866968959569931,
        -0.019498461857438087,
        0.07409428805112839,
        -0.013099095784127712,
        -0.014849637635052204,
        -0.02859107404947281,
        -0.04359719902276993,
        0.08334750682115555,
        -0.13240039348602295,
        -0.04563778266310692,
        -0.04460474103689194,
        -0.034153830260038376,
        0.03567969426512718,
        0.016291888430714607,
        0.03352978825569153,
        -0.01635756343603134,
        -0.0026067602448165417,
        0.01202312856912613,
        -0.013679204508662224,
        -0.07310296595096588,
        0.0192545335739851,
        -0.1518440693616867,
        -0.05623385310173035,
        0.07459888607263565,
        -0.025187604129314423,
        -0.04987238720059395,
        -0.05542580038309097,
        0.023212945088744164,
        0.030665526166558266,
        0.0009778558742254972,
        0.09720151126384735,
        -0.0384984165430069,
        0.003788125468418002,
        -0.006543328985571861,
        -0.08025382459163666,
        -0.041623305529356,
        -0.04898802936077118,
        0.058351654559373856
    ]
}