{
    "id": "2n2K9Jg_0fs",
    "title": "HP thinks it can beat Apple - HP Z2 Mini G9 Review",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-07-10T16:58:31Z",
    "video_url": "https://www.youtube.com/watch?v=2n2K9Jg_0fs",
    "category": "Science & Technology",
    "tags": [
        "HP",
        "Apple studio",
        "apple mac stuidio",
        "mac studio",
        "macintosh",
        "appple comupter",
        "apple computer",
        "best computer",
        "workstation",
        "mini workstation",
        "z2 mini",
        "z2 mini g9",
        "hp z2 mini g9"
    ],
    "views": 1433120,
    "likes": 58546,
    "comments_count": 2619,
    "description": "Get up to 30% off Jackery products during Prime Day 2022 at   HP is making some BOLD claims about their Z2 Mini G9  workstations, but can HPs new workstation match the performance and the equally bold claims of the Mac Studio?  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:10 Meet Z2 Mini G9 2:50 Z2 vs Mac Studio 5:21 Thermal Problems 7:46 Trying to Fix It 8:55 Z2 vs 12700k 9:28 HP things 12:34 Outro",
    "description_links": [
        "https://www.amazon.com/dp/B09Z6GWLP6",
        "https://linustechtips.com/topic/1442284-how-not-to-make-a-pc-feat-hp/",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Apple's Mac Studio set a high bar for performance in a compact workstation. But HP is here to say, no way, San Jose, or Cupertino. Meet... What, is it glued in? The Z2 Mini G9. According to HP, it is the world's most powerful mini workstation. But then, also according to HP, that's a big load of horse poo. So what exactly is it then? Well, it's a sleek, mini workstation, boasting up to a Core i9 12900K, and NVIDIA A2000 graphics, and those are some very impressive specs. I mean, clearly HP's bringing the heat. The question is then, can they keep cool under the pressure? Like I keep cool when segue-ing to our sponsor. - Jackery. Their Explorer 2000 Pro portable solar generator provides a massive 2000 water capacity, charges up to eight devices at once and more. On Prime Day, you can save $900 on an Explorer 2000 bundle. Learn more below or at the end of the video. - HP has gotten a pretty rough ride on this channel, and deservedly so. Nearly every fascinating innovation they've brought to us has been spoiled by poor pricing, arbitrary hardware limitations and antediluvian build quality. Sometimes all three. They just can't seem to point the gun away from their foot. Maybe this time will be different, but maybe it won't. Looking at the Z2 Mini G9's IO, we're off to a reasonably good start here. They offer a range of display, USB, Thunderbolt and network connectivity, and they provide both a PCIE 4.0 x 8 half height slot, with GPU support, and a flex IO slot that can accommodate anything from extra display outputs or USB ports to serial ports, though a likely use for it will be to remedy the inexcusable, in my opinion, absence of multi-gigabit networking in the base spec. HP, this is a workstation product, and even at my purchase volumes, two and a half gig ethernet costs $4 per chip. The case can lie flat or be vase amounted, and if you wanna get really fancy, you can pick up a vertical mount and flip the logo around. Wow. The front is all mesh for better airflow, and HP helpfully points out that if you really wanted, you could buy a whole gaggle of them and put them on a rack mount shelf. Neat. First though, we need to drag race it against the other most powerful mini workstation and see if there's any reason to buy one of these things, let alone seven of them. As configured, our Z2 Mini G9 is nearly identically priced to the M1 Ulta Mac Studio, spec for spec. Let's begin. In Apple's weakest category, gaming, HP pulls out an easy, wait, what? In \"Shadow of the Tomb Raider\", the M1 Ultra beats it, with the cheaper Max Tiered tying the HP workstation? Boy, this is not a good start. And this trend continues in \"Total War: Warhammer\", where, again, HP is bested by the mighty Mac Ultra. The story flips with \"Counter-Strike\", but this is mostly due to \"CS:GO\" running on open GL on Mac OS. Now, obviously game compatibility isn't gonna favor the Mac, but given that we're evaluating these machines as workstations, our true objective in running games is to find the performance potential of the hardware, and it is clear that HP's tiny workstation is limited by NVIDIA's A2000, a cute little GPU that can be thought of as a 3050 but on a 70 watt power diet, with a whopping 12 gigs of VRAM, and certified drivers for professional applications for high resolution video editing and 3D modeling. A gaming GPU, it clearly ain't. So let's move on to productivity, where surely the story will stay exactly the same. In PugetBench Premiere, HP loses to Apple again, though in Photoshop, HP does score its second win, though it should be noted that PugetBench relies on Rosetta for Photoshop on Mac OS, so it's not really apples to apples. After Effects is another win for Apple, given we couldn't get the benchmark to run on our Z2 Mini G9, so we can just skip that, I guess. And as for Blender, well, in CPU rendering, it loses against the Ultra in our BMW test and in Gooseberry, which raises some very interesting questions because we had a similarly configured test bench in our Mac Studio review that did win with a Core i9. Hmm. In our GPU render testing, rendering with optics wins every time, but with CUDA, the Mac Ultra pulls ahead again. As for synthetic productivity benchmarks, in Cinebench, HP wins in single threaded performance but then fumbles in multi threaded performance, and the same goes for GeekBench, signaling the existence of a clear trend here. Core i9 12 900K plus heat, name a more iconic duo. I'll wait. Oh yeah, I guess the Wan hoodie and Wan sweatpants from lttstore.com. Now, it should be noted that our M1 Ultra Mac Studio is decked out with 128 gigs of RAM, but that's unlikely to heavily factor into the tests that we ran today. What that means is that HP must have screwed something up in here. To find out what, we have to take a bit of a deeper dive inside. Actually, we won't even really need to do that, because like you, we did a double take when we saw they were trying to pack a Core i9 into this tiny three and a half liter enclosure. I mean, the mighty NHD 15 can barely handle the CPU, and it alone is four liters in volume. Did HP engineer a magic 240 watt cooling solution out of unicorn horns and leprechaun blood? Nope, they didn't even try. In fact, you can see it right here. There's a sticker on the cooler that says 125 watts. So naturally, the poor thing throttled hard throughout our testing. In Cinebench, the Z2 performs a whopping 30% worse than the exact same chip on our test bench. In Blender, our render times increased between 20 and 50% over our test bench. And Premiere Pro, we see 10% power scores in PugetBench, with similar losses in GeekBench. This performance hit even bleeds into gaming, where we see 10% losses for the HP Workstation in \"Tomb Raider\", \"Warhammer\" and \"CS:GO\". We also took \"Forza Horizon 5\" for a spin and saw, again, a 10% hit. And even more damningly, running the benchmark for an extended period of time drops the Z2 Mini G9's result even further. Why would that be, you might ask. Surely the CPU is already thermally throttled. And you're right, but as it turns out, thanks to HP's brilliant case design, which provides next to no clearance for the GPU cooler, the GPU overheats too. That's right, even our tiny little 70 watt GPU is throttling to the point where longer GPU renders complete 25% faster on our bench compared to the HP. It's just sad. Even cranking the GPU fan to 100%, which is well beyond the factory curve, only delays the inevitable throttling. And as for the CPU, well we tried some simple adjustments to their cooling solution in an attempt to prevent hot air from recirculating inside the case, and we were able to marginally improve our scores. But what we really need is a way to adjust the fan curve, something that HP, either through their performance advisor software or the bios, shockingly does not allow. And it needs to be adjusted. Look at this! We started at the benchmark. This thing is running full border right now and it's dead silent. The fans didn't even spin up until after the CPU had already thermally throttled. We tried every performance mode, from quiet to high performance, and they all behaved basically the same. The only possible solution was to set the idle fan speed to 100%, which unfortunately locks it at maximum, which unfortunately is 7000 RPM on this model, which is loud as all hell. And adding insult to injury, the machine still throttles. To demonstrate that this is a cooling problem rather than a spec problem, we actually swapped out our Core i9 with a Core i7 12 700K, and in this exact system, that i7 actually beat the i9 in rendering, Premiere and in \"CS:GO\". Even our less power hungry CPU though, it still throttled, partially because HP's got dang power limiting made yet another surprise appearance. So, sorry I gotta turn this off, HP not only equips their workstation with insufficient cooling, their workstation class motherboard can't even power the hardware anyway. I mean, knowing that HP employs some incredibly talented engineers, it's hard for me to imagine what goes on behind the scenes for a train wreck like this to make it to market. Unlike LMG, where you can watch the train wreck in slow motion behind the scenes on floatplane.com rather than just imagining it. Let's come back around to HP's claim though that the Z2 Mini G9 is the fastest mini workstation in the world. We called that horse plop before we even knew that the machine throttled like an aging white dude on a Harley. Why? Because their qualification for that claim is that it is based on HP's internal analysis of non-gaming small form factor desktop workstations with between three to 20 liters, a minimum three ISV certifications, configurable professional graphics and a dedicated workstation brand, as of March 2022. Good gravy! I mean, by that kind of logic, based on my analysis, I have the most subscribers on YouTube, of people with at least eight channels that make tech videos based in Surrey, Canada. And we haven't even started on the price. Much like the Mac Studio, this thing is very expensive. I mean, I get it. It's a business system, so there is a premium and you do get some benefits from it. The parts have undergone extra reliability testing, it uses a workstation chip set, ECC memory, ISV certification. The whole corporate kit and caboodle. But charging $1100 for a 12 900K that is $500 over retail? For the privilege of running it throttled? That's just insulting. HP, this could've been a very sleek, capable workstation, and for less power components, it still could be an excellent fit for your business. But as configured, it simply shouldn't exist. You know what should though? Our sponsor. - Jackery. Whether you're looking to make margaritas on the beach, living that van life or preparing to leave civilization, the Jackery Explorer 2000 Pro portable solar generator has all the juice you need to keep all of your devices energized. The massive 2000 water capacity and 2200 watt output allows for eight devices to be plugged in simultaneously. With a 100% charge from an AC wall outlet and just two hours, you can get in and out before anyone has even noticed you're there. Or pair your power station with an array of Jackery SolarSaga 200 watt solar panels for a full charge in as little as two and a half hours and rid yourself of the need to even step a foot indoors again. Jackery has a special Prime Day offer coming up on July 12th, where you can save $900 on the Explorer 2000 Pro and two SolarSaga 2000 watt solar panels. Check out the Jackery Explorer 2000 Pro at the link down below, and make sure you bookmark the Amazon page so you're ready for that sweet Prime Day offer. - Thanks for watching. HP, seriously, you guys need to get your stuff together. Everyone else, if you enjoyed this bloodshed, why not check out our video on HP's Omen 45L pre-built? It also had problems.",
    "transcript_keywords": [
        "Mac Studio",
        "mini workstation",
        "workstation",
        "Mac",
        "Ultra Mac Studio",
        "Mini",
        "Apple Mac Studio",
        "GPU",
        "powerful mini workstation",
        "Mac Ultra",
        "San Jose",
        "CPU",
        "Core",
        "performance",
        "Mac Studio set",
        "Mac Ultra pulls",
        "mighty Mac Ultra",
        "Studio",
        "Ultra",
        "Jackery"
    ],
    "transcript_entity_values": [
        "The Z2 Mini G9",
        "125 watts",
        "Thunderbolt",
        "March 2022",
        "1100",
        "8 half",
        "NHD",
        "eight",
        "San Jose",
        "10%",
        "four liters",
        "GPU",
        "seven",
        "Jackery SolarSaga",
        "Ultra",
        "Mac",
        "Cinebench",
        "2000",
        "three",
        "GL",
        "Canada",
        "YouTube",
        "the M1 Ulta Mac Studio",
        "70 watt",
        "Tomb Raider",
        "PugetBench",
        "Warhammer",
        "July 12th",
        "at least eight",
        "Apple",
        "Jackery",
        "A2000",
        "Premiere Pro",
        "Mac Ultra",
        "First",
        "Surrey",
        "M1 Ultra Mac Studio",
        "ISV",
        "3050",
        "Amazon",
        "Blender",
        "Mac OS",
        "Harley",
        "up to eight",
        "Mac Studio",
        "CPU",
        "IO",
        "BMW",
        "Explorer 2000 Pro",
        "AC",
        "between 20 and 50%",
        "just two hours",
        "Forza Horizon 5",
        "HP",
        "ECC",
        "Explorer 2000",
        "4",
        "2200 watt",
        "Wan",
        "Gooseberry",
        "Prime Day",
        "200 watt",
        "100%",
        "as little as two and a half hours",
        "25%",
        "LMG",
        "Shadow of the Tomb Raider",
        "12",
        "three and a",
        "two",
        "GeekBench",
        "Core",
        "Z2 Mini G9",
        "second",
        "Premiere",
        "the Jackery Explorer 2000",
        "128",
        "the Mac Studio",
        "240 watt",
        "the HP Workstation",
        "PCIE",
        "the Z2 Mini G9's",
        "two and a",
        "Max Tiered",
        "today",
        "NVIDIA",
        "900",
        "30%",
        "CUDA",
        "7000",
        "Photoshop",
        "RAM",
        "between three to 20 liters",
        "PugetBench Premiere",
        "500",
        "USB",
        "the M1 Ultra",
        "Rosetta",
        "Cupertino",
        "the Jackery Explorer 2000 Pro",
        "IO"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "NORP",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORDINAL",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "LAW",
        "ORG",
        "CARDINAL",
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "GPE",
        "DATE",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "MONEY",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "GPE",
        "FAC",
        "GPE"
    ],
    "vector": [
        -0.09473898261785507,
        -0.04230266436934471,
        0.06744495779275894,
        -0.06648240238428116,
        0.08385472744703293,
        -0.024820325896143913,
        -0.04892479255795479,
        0.019101103767752647,
        -0.05884446203708649,
        -0.06457588821649551,
        0.0028937452007085085,
        0.09286398440599442,
        0.007103473413735628,
        -0.060874052345752716,
        -0.0011587002081796527,
        -0.03093940019607544,
        0.12675170600414276,
        -0.041016094386577606,
        0.007027106825262308,
        0.029699208214879036,
        -0.0005007898434996605,
        -0.051080040633678436,
        0.03453325107693672,
        0.007238894701004028,
        0.06420334428548813,
        -0.02482461929321289,
        0.0005171854863874614,
        0.011401095427572727,
        0.027441805228590965,
        -0.01337624341249466,
        -0.07557402551174164,
        0.06551454216241837,
        -0.026446327567100525,
        0.03912876918911934,
        0.052084147930145264,
        -0.08953558653593063,
        0.06255324184894562,
        -0.027180679142475128,
        -0.06954718381166458,
        -0.10540264844894409,
        0.021602047607302666,
        -0.03576679155230522,
        -0.042412225157022476,
        0.0391392782330513,
        -0.005534735042601824,
        -0.01646481826901436,
        -0.013213925063610077,
        -0.11113744229078293,
        -0.06873748451471329,
        0.07264501601457596,
        -0.07166293263435364,
        -0.1546781212091446,
        0.03190668672323227,
        -0.07760965079069138,
        0.015411680564284325,
        0.0002097265823977068,
        -0.0067481654696166515,
        -0.015786398202180862,
        0.07306642085313797,
        0.017387527972459793,
        0.03305644541978836,
        -0.13184009492397308,
        -0.04764886945486069,
        0.08191011846065521,
        0.045432042330503464,
        -0.030832570046186447,
        0.04126494750380516,
        0.002351861447095871,
        -0.11389343440532684,
        -0.027250872924923897,
        0.10619480162858963,
        0.014388144947588444,
        0.07776501029729843,
        0.0507369302213192,
        -0.053202368319034576,
        0.038839876651763916,
        0.012724447064101696,
        -0.05617142841219902,
        0.04080839827656746,
        -0.029669247567653656,
        0.05219641327857971,
        -0.04202009737491608,
        -0.04019157961010933,
        -0.0030702343210577965,
        -0.0024169054813683033,
        -0.05952535569667816,
        -0.009326049126684666,
        -0.008309777826070786,
        -0.03966348618268967,
        -0.020329345017671585,
        -0.01564137078821659,
        0.0797736644744873,
        0.0222722589969635,
        -0.004100834019482136,
        -0.03777025640010834,
        -0.001365683157928288,
        0.07033845037221909,
        -0.04007115587592125,
        0.027336016297340393,
        0.0641687661409378,
        0.03664739429950714,
        0.12143358588218689,
        0.06201823800802231,
        -0.10373775660991669,
        -0.024632645770907402,
        -0.06517183780670166,
        0.01759178936481476,
        0.04517826810479164,
        -0.04427767172455788,
        0.053927335888147354,
        -0.018494948744773865,
        -0.004241487011313438,
        -0.07601727545261383,
        -0.0835736095905304,
        0.0028910173568874598,
        -0.018994953483343124,
        -0.026820138096809387,
        0.008420283906161785,
        -0.007592211477458477,
        -0.07008645683526993,
        -0.027805591002106667,
        0.03640107065439224,
        0.009685982018709183,
        -0.02989477850496769,
        -0.0019188460428267717,
        0.028751682490110397,
        -0.0957183688879013,
        -3.3216546312040175e-33,
        -0.027732398360967636,
        -0.00011969284241786227,
        -0.0718512237071991,
        -0.04768195003271103,
        0.014676135964691639,
        -0.0429227240383625,
        -0.05990606173872948,
        0.017901260405778885,
        -0.03698885440826416,
        0.014445164240896702,
        -0.06370621919631958,
        -0.01155339740216732,
        -0.06784840673208237,
        0.01954975724220276,
        0.054216839373111725,
        -0.011865751817822456,
        0.043574146926403046,
        0.06968855112791061,
        -0.059791650623083115,
        0.02001255750656128,
        0.06725279241800308,
        -0.045019861310720444,
        0.010903043672442436,
        -0.0769689530134201,
        0.034579478204250336,
        0.02166319079697132,
        -0.006544857285916805,
        -0.05891159921884537,
        0.008790376596152782,
        0.015885133296251297,
        -0.06626661866903305,
        -0.059913039207458496,
        0.01277179829776287,
        -0.06009957566857338,
        -0.025798819959163666,
        0.00535165099427104,
        -0.07441133260726929,
        -0.08454422652721405,
        0.09284966439008713,
        -0.032893914729356766,
        -0.08204443752765656,
        0.026868708431720734,
        -0.04312191158533096,
        -0.12853829562664032,
        0.03078491985797882,
        0.04079190641641617,
        0.008776522241532803,
        -0.062181662768125534,
        -0.010775182396173477,
        0.03891090676188469,
        -0.023352643474936485,
        -0.003496465738862753,
        -0.04103849455714226,
        0.057666946202516556,
        0.039168763905763626,
        0.007399043999612331,
        0.07584796100854874,
        -0.030827874317765236,
        0.10746023058891296,
        0.07936163991689682,
        0.0316644161939621,
        0.016055501997470856,
        -0.018588408827781677,
        -0.04507872834801674,
        -0.06603852659463882,
        0.07651219516992569,
        0.03536054119467735,
        0.02610413171350956,
        -0.0952397882938385,
        0.10716048628091812,
        -0.006553990766406059,
        -0.08000685274600983,
        0.023265046998858452,
        -0.04846245050430298,
        0.060861553996801376,
        -0.0015119079034775496,
        -0.06439998000860214,
        0.006568075157701969,
        0.005774759221822023,
        -0.009757879190146923,
        -0.06091232970356941,
        0.04381638765335083,
        -0.010162676684558392,
        0.042480580508708954,
        -0.009456794708967209,
        0.0590493381023407,
        0.026711389422416687,
        0.004828212317079306,
        -0.0797421857714653,
        0.07267830520868301,
        -0.0038618866819888353,
        -0.011779407039284706,
        -0.033102650195360184,
        0.000876894686371088,
        -0.07501808553934097,
        -1.0185799058184243e-33,
        -0.06743490695953369,
        0.02083265781402588,
        0.0041575985960662365,
        -0.0014478635275736451,
        -0.04323183372616768,
        0.013298102654516697,
        -0.005622326862066984,
        0.005227628629654646,
        -0.023916661739349365,
        0.0061796908266842365,
        0.06270768493413925,
        0.013798251748085022,
        -0.059452321380376816,
        -0.045091014355421066,
        -0.0036571756936609745,
        -0.06691645085811615,
        0.015079271979629993,
        -0.04804177209734917,
        0.0853344202041626,
        -0.03720829263329506,
        0.1228625699877739,
        0.023958737030625343,
        0.04373524710536003,
        0.0625060498714447,
        0.07062164694070816,
        -0.04392720386385918,
        0.03432798385620117,
        0.03349277377128601,
        0.02085062861442566,
        0.012620125897228718,
        0.03767906129360199,
        0.008941790089011192,
        -0.07275678962469101,
        0.03853035718202591,
        0.1321650594472885,
        -0.02873828075826168,
        0.019155193120241165,
        0.044913921505212784,
        -0.020923664793372154,
        0.0003842075529973954,
        0.06944360584020615,
        0.010613816790282726,
        -0.0646984875202179,
        0.006400995887815952,
        0.02266388013958931,
        0.014513902366161346,
        0.010239546187222004,
        -0.0836426317691803,
        0.06249953433871269,
        -0.034432895481586456,
        0.03472121059894562,
        -0.007488049566745758,
        0.011281480081379414,
        0.053723905235528946,
        -0.0635911226272583,
        -0.004232592415064573,
        -0.042374059557914734,
        -0.013245495967566967,
        -0.043456677347421646,
        -0.01717410981655121,
        0.013422996737062931,
        -0.027366695925593376,
        -0.0533248633146286,
        -0.059439484030008316,
        -0.0011345971142873168,
        -0.0035467760171741247,
        0.04004242643713951,
        0.03403444588184357,
        -0.0018162133637815714,
        0.011604854837059975,
        -0.01783020794391632,
        -0.013432505540549755,
        -0.015754155814647675,
        -0.06692682206630707,
        -0.033762186765670776,
        0.03930564224720001,
        -0.0027401254046708345,
        -0.036954864859580994,
        0.01211343053728342,
        -0.07660415768623352,
        0.03738117590546608,
        0.08204089105129242,
        0.09466506540775299,
        0.020233018323779106,
        0.037215590476989746,
        -0.012455197982490063,
        -0.02040018141269684,
        -0.014173847623169422,
        -0.06123223900794983,
        -0.029976697638630867,
        -0.028482645750045776,
        0.03695020079612732,
        -0.02889993041753769,
        0.01900476962327957,
        -0.10530498623847961,
        -5.38514299819326e-08,
        -0.04346092790365219,
        -0.001226681051775813,
        0.05693252757191658,
        0.017512328922748566,
        0.0033154285047203302,
        -0.08626022934913635,
        -0.034702252596616745,
        -0.005112700164318085,
        0.06330356001853943,
        0.09969747811555862,
        0.10223766416311264,
        -0.11250591278076172,
        -0.030443286523222923,
        -0.02355123497545719,
        0.026193013414740562,
        0.05180880054831505,
        -0.02913586236536503,
        0.06164027750492096,
        -0.02175384946167469,
        -0.06338643282651901,
        -0.0335952527821064,
        0.08074463158845901,
        0.04752681031823158,
        -0.007766447030007839,
        -0.007837694138288498,
        0.000977388583123684,
        -0.015740562230348587,
        0.04002928361296654,
        0.05650174990296364,
        -0.054082512855529785,
        -0.05584961548447609,
        0.03091193176805973,
        -0.01091166865080595,
        0.024676445871591568,
        0.05668702721595764,
        -0.13707542419433594,
        0.004968734923750162,
        0.12782731652259827,
        0.0596809908747673,
        0.022630205377936363,
        -0.06200500950217247,
        -0.02777840569615364,
        -0.03003344126045704,
        0.026866452768445015,
        -0.0031736823730170727,
        -0.026760751381516457,
        -0.001522134174592793,
        -0.07719143480062485,
        -0.01369912177324295,
        0.03068973869085312,
        0.04133497178554535,
        -0.016423461958765984,
        0.05112706124782562,
        0.012005127966403961,
        0.03149307519197464,
        -0.03976115956902504,
        -0.010698237456381321,
        0.023223349824547768,
        -0.0525178387761116,
        0.04240908846259117,
        0.09182307869195938,
        -0.09424669295549393,
        0.07667911052703857,
        0.09710553288459778
    ]
}