{
    "id": "2NfvzoDpcSM",
    "title": "This is superior to everything! - GuliKit KingKong 2 Pro Controller",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-10-19T20:32:00Z",
    "video_url": "https://www.youtube.com/watch?v=2NfvzoDpcSM",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "gulikit",
        "controller",
        "kingkong 2",
        "pro",
        "electromagnetic",
        "stick",
        "joystick",
        "replacement",
        "repair"
    ],
    "views": 3464874,
    "likes": 80409,
    "comments_count": 5855,
    "description": "Get a dbrand skin or case today at   Stick drift sucks, and it seems to be a continual problem in game controllers. Today on ShortCircuit, we get Linus to open up the GuliKit KingKong 2 Pro. It's durable, it's cross compatible... but does it hold up to Linus' expectations?  Buy a GuliKit KingKong 2 Pro:  On Amazon (Paid Link):   Buy a Brook Wingman Xbox Converter:   Buy a Nintendo Switch OLED:  Best Buy:  Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 The perfect controller? 0:18 First look and initial thoughts 1:00 A better way to joystick 2:55 Other included accessories 3:31 No native Xbox compatibility? 4:57 Pricing and build quality/button impressions 6:14 Sponsor - dbrand 7:10 Linus doesn't know how to use a switch 7:48 Gaming impressions 9:00 Replacement parts 9:55 \"AI\" controller settings and macros 11:33 Trying the gyroscope 13:22 Misc features and battery life 13:42 Overall thoughts 14:04 Outro",
    "description_links": [
        "https://dbrand.com/shortlinus",
        "https://lmg.gg/nEdEi",
        "https://geni.us/KJNdYv",
        "https://geni.us/nkhOWP",
        "https://geni.us/kh06r",
        "https://shop-links.co/ch5eNPBbdA1",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- On paper, this is a king-tier gaming controller offering an unprecedented one-two punch of cross-compatibility and durability. And yet, it comes from a company that I only just heard of when they made the news for offering replacement analog sticks for the Valve Steam Deck. It comes from GuliKit and they're calling it the KingKong 2 Pro Controller. But what makes it so special? Aside from the fact that it comes with a nice little carrying case. Man, I love that actually. Nice little hard case if you like to travel or just keep your belongings safe when they're in storage. Although, I can immediately see some ways that it could be improved. There's no pass through for charging so you can't charge your controller while it is inside the case. And also, mm oh, I'm less impressed now. This hinge seems like it's not long for this world. But the same cannot be said of the controller itself. On the surface, it looks just like an Xbox Series X Controller. It's even got the same little texture dimples on the back, although there are some switch buttons added to it. We'll talk more about that later. But it's what's under the hood that counts. The KingKong 2 Pro, instead of using cheap potentiometer-based joysticks, uses hall effect joysticks. So that means that unlike the PlayStation 5, Nintendo Switch, Xbox Series, and even the Valve Steam Deck, the KingKong 2 Pro's joysticks should last much longer. The reason for this is that potentiometer joysticks are kind of like us. It's not a matter of if, it's a matter of when they will expire. They use two potentiometers. One in the x-axis. One in the y-axis. And a potentiometer, if you're not familiar, is a variable resistor. So what happens is as you move the potentiometer, the voltage readout changes, indicating to your PC or to your console where the analog stick is. The problem is that potentiometers have moving, wearing parts. And when the metal contacts wear out, it can actually change those resistance values. That's what's known as joystick drift. So your joystick might be sitting in a centered position still, the springs might be fine, but the values have changed. So now in that neutral position, your character starts drifting off to the side or walking backwards or whatever the case may be. Hall effect joysticks use an entirely different mechanism. They look and feel exactly the same because they're still spring-loaded. But to get that voltage, to get that value, they use permanent magnets. Now, okay, before you correct me, I know that even a permanent magnet is not technically forever permanent. But compared to a potentiometer, I think it's okay to call it that. So what happens is as we change the relative position of these permanent magnets, we get a voltage value that is never going to change. Of course, if it's attached to a crappy controller, we're not gonna care about that. So we'll definitely get some impressions there. But first, let's have a look at what else is in the box. You get some stickers. You get some firmware updates. Little manual. Ah yes, this matters a lot because there's a bit of complexity here. We get a nice little type A to type C flat charging cable. It's definitely USB 2. You can tell from the white color coding and the fact that most of the pins inside the type C connector are missing. I'm actually not even sure if it does data. Nice. All right. It does do data. There's charging-only USB-C cables. Which is like really? You had to save those fractions of a penny worth of copper. Next to the charging port, we've got a pairing button with accompanying four LED player indicator, just like you'd find on an Nintendo switch. Then on the other side, we've got my first disappointment. I really hoped, given that it is shaped exactly like an Xbox controller, that they might have found a way to work Xbox compatibility into the product. But unfortunately, you need a third-party dongle, like a Wingman, in order to connect this thing to your Xbox. The good news is it does still have decent cross-platform compatibility. You can select either D or X input on Windows depending on whether you're playing more retro games or if you just want it to be picked up automatically by modern games, that would be X input. You can select Android or iOS compatibility mode. Or obviously Nintendo Switch, since it seems like their main target is Switch players who don't wanna wear out their freaking joysticks. Because it's designed for the Switch, you'll find all the appropriate Nintendo-specific buttons on the front. I did say I would touch on that later. As well as a 6-axis gyroscope inside that GuliKit claims will work just like in PC games without any software configuration or dedicated utility. I am going to wanna try that out. Oh, also it supports Amiibo Tapping. Those are still a thing? - [David] Guess so. - Okay, cool. I mean, yeah, action figures, right? Like, sure. It occurs to me we should probably have an- Oh my God, the ergonomics of the Switch Pro Controller are not as good. The Switch Pro Controller doesn't have analog triggers. I haven't played any Mario Kart this generation. What the actual (beep) Nintendo? And this thing is so expensive. I guess now's as good a time as any to talk about the price of the KingKong 2 Pro. It's 70 US dollars, putting it right in line with first-party controllers in terms of pricing. And I would say pretty damn in line in terms of the build. That's ignoring the hall effect joysticks too. Man, yeah, in line or better. Very little flex. Good plastics. God, those are mushy shoulders. How do they get away with it? Charging as much as they do for first-party. - [David] I hate the Xbox's shoulders. - [Bell] Really? - [David] They're so uneven. - But at least they're not mushy - [David] It's cause they're not supposed to be clicky. They're supposed to be like buttons. - Here try this thing. - [David] These are nice. I actually like these - Like, yeah, like I would take that over... over any one of these first-party controllers. Soft trigger. Sorry, I realize I haven't even talked about. D-pad is nothing special. Especially after playing around with the GPD WIN Max 2, which has like the Vita-style D-pad. Stop trying to reinvent the D-pad. It's already been invented. Okay. It's decent though. ABXY. Decent length travel. Not like super like wild clicky. Like remember those Xbox-compatible Razer controllers they did for a bit that had those like hyper-clicky ABXY? Dbrand is apparently the sponsor for this video and I've been asked to ask, \"What is Dbrand doing?\" - [Bell] Dbrand sent us a game for us to play. - A game to play? Oh my god. - [Bell] James is gonna join in too. - [James] I've actually played this before and I'm really good at it. - [Bell] So when the music stops, be not the last one to push a button. - That was a false alarm. - [Bell] It got me. - We're going to Linus gets shocked. - [Bell] Okay. - Ah! - I guess we get we want. - [James] Yeah, we both did. - [Bell] That's how good I am, baby. - That was it? That's the Dbrand integration is they zap me? I guess you can buy their stickers if you want. They make them for all kinds of products like tablets, phones, laptops, game consoles. They've got their Darkplates for the PlayStation 5. Guys can check them out. They have a weird sense of humor. Ow, that hurt. Theoretically, it should work just like a native Switch Pro Controller. It even wakes the console. Theoretically. Let's just cycle through the modes here. To be clear, I don't know that this is GuliKit's fault, but this has not been a great experience so far. Okay, let's go. - [David] C'mon buddy. - [Bell] I don't think that's the right... That's not the right one. If you look at the instructions, close the screen and select grip order. - Seriously? That's the one? No, 'cause you have to... What the (beep)? It paired. Am I the idiot? Is that... - [Bell] No one here's an idiot. It's just a misunderstanding. - You know what? Now I get to embarrass myself in Breath of the Wild 'cause I haven't touched this damn game in like a thousand years. This feels great. I like this controller though. Gyroscope aside. I think that they could have a little less friction around the edge of the analog sticks. So I do notice a little bit of pull. I'd like to see them do better with that. I think they've got like a beauty ring, like a kind of accent around here that's causing a little bit of friction. I think it's the kind of thing that you could easily solve for yourself if you wanted to with like a little bit of like paraffin wax around the outside or something like that. You shouldn't have to do that. It should just be using Delrin or like some kind of self-lubricating material instead. So maybe for the KingKong 3 Pro. But ignoring that, man, do these ever feel good? The spring tension is great. And one of the benefits of hall effect joysticks I haven't even mentioned yet is that because of their excellent durability, the manufacturers can trust that zero will stay zero. So they tend to have much smaller dead zones. You can see a need to make only a slight... Oh, see that? The slightest deflection of the joystick and Link starts walking. So you're fine control, way better. Which may not be as important on the left stick, but on the right stick for aiming, it's a big deal. It was immediately noticeable when I upgraded my Steam Deck to GuliKit joysticks. Oh, I guess now's as good a time to mention these. This is really cool. Unlike the major first-party controllers, GuliKit provides replacement mechanical buttons. So these are for your ABXYs as well as keycaps. And I don't think they have replacement joysticks yet for this particular controller. Maybe they're confident that they will never die. But they do offer replacement joysticks for the Steam Deck. So I would hope that either those are compatible with their own controller or that they plan to offer replacement ones themselves in the future. I love, love seeing additional repairability make its way into the electronics space. - [Bell] So they only show thumbsticks? The sticks themselves? - They have the sticks themselves, but not the joystick box. That's hilarious. Talk about confident. Man! Why don't we try out the gyroscope in one of the PC titles that they claim it will just magically work in? Now seems like as good a time as any to talk about some of the other functions of the controller. By using this gear button, they call it like AI Button. Doesn't seem very AI to me, but it definitely does some cool stuff. You can swap the XBAY. So if you prefer the North American-style, confirm here, back here, but you're playing a Nintendo or a PlayStation game, then you can just do what's natural for you. Although, it'll definitely cause some confusion if you have to do any kind of button mashing, quick time events, I would think. You can set up basic repeat macros. So by holding the gear button and then pressing any of the right shoulder trigger or ABXY, you can have them repeat up to 20 activations per second. It has this really weird thing, like autopilot or something like that, where you can pretty much record and then replay. Like long, it's like up to 10 minutes or something like that, right? Like long strings of inputs. And this is meant for fine tuning the repeatability of, like say for example, some kind of speed run. I don't know that that's necessarily in the spirit of speed running depending on how you're doing it. But I know that there are cases where speed runners will use hacks and cheats just to determine the viability of a particular strategy. So I could see it being fine for that. Like, \"Hey, oh, that particular section, that's not what I'm focused on right now, but I can often fail at that. Let's just blow through that so I can practice the next bit.\" I could see it being useful for that. Another really cool one is you can adjust the vibration intensity. So that's just gear plus or minus. Did I say plus minus? Sorry. It has a plus or minus button, so that's really confusing. Gear up or gear down. Motion sense aim assist on PC. Cool. Let's turn it up. So we do gear and then left or left trigger. By hitting the gear and either the shoulder or the trigger, you indicate which one you want it to activate the gyroscope when you're holding. So if I press gear left shoulder, then when I hold the left shoulder, the gyroscope will be active. And if I press gear left trigger, which is what I want for this game, then when I hold the trigger so you can see here the gyroscope will be active but when I hold the shoulder, oh wait... Nope, it's working with the shoulder as well. Okay. I don't know then. - [Bell] You might've done both. You can turn it off. - [Linus] Oh, I might have done both. Okay. Yeah, so let's turn this one off. Long vibration is canceled? Yes. Okay. Yes. Oh, well that's cool. So you can have them at even different sensitivities if you really want. Wow, that offers a lot of flexibility. That's super cool! Now to be clear, like other gyro-based aiming schemes, it's not meant for you to enter gyro mode and like hold, contort your controller like this. You're still gonna be using your right stick for the majority of your course motions. It's just for making little adjustments. Hmm. I'm getting some jitter in the side to side. Up and down feels smooth. - [Bell] You also can calibrate it. - You can calibrate it, you say. Whoa, high sensitivity is very high. Let's try low sensitivity. Yeah, I feel like I'm going down more than I'm coming up, but maybe I just feel like that. No, I'm coming up more than I'm going down now. I mean I'm kind of hovering it in about the same spot. It just doesn't seem consistent. I really like the finish on the top. It's like, it feels soft to the touch, but doesn't appear to be that like rubberized junk that comes off like a soft touch. You can customize the sensitivity, the sticks and the triggers. That's also through their gear button here. It works both wired and wirelessly. I guess we didn't mention how long it's supposed to last on a charge. It's rated for 25 hours. And I guess that's all there is to really say about it. Is it perfect? No. But it's absolutely embarrassing that it takes a company like GuliKit to come out and put high-quality joysticks in their controller when we're paying so much for our first-party controllers. And what I hope is that products like this put pressure on the major controller manufacturers to switch over to this objectively superior joystick technology. Thanks for watching ShortCircuit and get subscribed.",
    "transcript_keywords": [
        "Switch Pro Controller",
        "controller",
        "Pro Controller",
        "kingtier gaming controller",
        "unprecedented onetwo punch",
        "Switch Pro",
        "gaming controller offering",
        "switch",
        "joysticks",
        "Nintendo Switch",
        "Pro",
        "Valve Steam Deck",
        "Steam Deck",
        "firstparty controllers",
        "gear",
        "Xbox",
        "good",
        "button",
        "hall effect joysticks",
        "effect joysticks"
    ],
    "transcript_entity_values": [
        "the Valve Steam Deck",
        "The Switch Pro Controller",
        "10 minutes",
        "a thousand years",
        "PlayStation 5",
        "6",
        "the Switch Pro Controller",
        "one-two",
        "Wingman",
        "One",
        "Switch Pro Controller",
        "Darkplates",
        "one",
        "USB",
        "Switch",
        "PlayStation",
        "up to 20",
        "the PlayStation 5",
        "up to",
        "Max 2",
        "Vita",
        "second",
        "Nintendo",
        "North American",
        "AI Button",
        "Xbox",
        "Nintendo Switch",
        "USB 2",
        "KingKong 2 Pro",
        "Dbrand",
        "Delrin",
        "third",
        "first",
        "Amiibo Tapping",
        "two",
        "Razer",
        "Android",
        "James] Yeah",
        "four",
        "GuliKit",
        "70 US dollars",
        "GPD",
        "the Steam Deck",
        "Steam Deck",
        "Linus",
        "ShortCircuit",
        "Xbox",
        "2",
        "Mario Kart",
        "James",
        "25 hours",
        "Nintendo",
        "zero"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "ORG",
        "NORP",
        "ORG",
        "FAC",
        "ORG",
        "PRODUCT",
        "ORG",
        "NORP",
        "PRODUCT",
        "ORDINAL",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "TIME",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.08598203957080841,
        -0.06113296374678612,
        -0.01666824333369732,
        -0.08887774497270584,
        0.12494762241840363,
        0.03558408096432686,
        -0.005704333074390888,
        0.07331651449203491,
        -0.03709476813673973,
        0.042119599878787994,
        0.029812516644597054,
        0.006826774217188358,
        -0.000278062914730981,
        -0.08470066636800766,
        0.0940188318490982,
        0.027526680380105972,
        0.03826110064983368,
        -0.04202277958393097,
        -0.03934229910373688,
        0.036840442568063736,
        -0.030930686742067337,
        -0.07633215188980103,
        -0.011319540441036224,
        0.0036680547054857016,
        -0.09193891286849976,
        -0.05412738770246506,
        0.03302796557545662,
        -0.044966921210289,
        -0.006752770394086838,
        -0.1051572859287262,
        -0.013503294438123703,
        0.01718597486615181,
        -0.07738325744867325,
        -0.001061369082890451,
        0.005266496445983648,
        -0.04421209543943405,
        -0.04179425537586212,
        -0.0735008493065834,
        -0.1117960512638092,
        -0.0849272683262825,
        0.037512414157390594,
        -0.034987691789865494,
        -0.003083224641159177,
        -0.03744060546159744,
        0.021708447486162186,
        0.012795228511095047,
        0.0017779269255697727,
        -0.015110854990780354,
        0.0029063813854008913,
        0.04994570463895798,
        0.05010124295949936,
        -0.0660928264260292,
        0.08611622452735901,
        -0.05143933743238449,
        0.007952788844704628,
        0.04636529088020325,
        -0.07148299366235733,
        -0.02244545705616474,
        0.05651554837822914,
        0.01616533286869526,
        0.03171607851982117,
        -0.00823880359530449,
        0.0022426918148994446,
        0.040196482092142105,
        -0.0021433085203170776,
        -0.04188891500234604,
        0.016704512760043144,
        0.03725036606192589,
        -0.05996168032288551,
        -0.0027830542530864477,
        -0.0025548541452735662,
        0.030065974220633507,
        0.01785106211900711,
        0.09323380142450333,
        -0.006590638309717178,
        -0.007599444128572941,
        0.0013817364815622568,
        -0.01934204436838627,
        0.027564091607928276,
        -0.011873941868543625,
        -0.035857055336236954,
        0.05041719600558281,
        -0.03985306993126869,
        0.006518905982375145,
        0.0303542148321867,
        -0.040514253079891205,
        0.04155629873275757,
        -0.010077674873173237,
        -0.02722860686480999,
        -0.07145939767360687,
        0.10057786107063293,
        0.006539135240018368,
        0.13979953527450562,
        0.054907988756895065,
        -0.07104591280221939,
        -0.006516359280794859,
        0.038510989397764206,
        -0.019183211028575897,
        -0.0906674936413765,
        0.03279043734073639,
        -0.058629684150218964,
        0.09171535819768906,
        0.028127722442150116,
        -0.04199789837002754,
        -0.05794098973274231,
        -0.09597986936569214,
        0.030264247208833694,
        0.01749138906598091,
        -0.040803294628858566,
        -0.014075306244194508,
        -0.06265092641115189,
        0.00047048518899828196,
        -0.06305627524852753,
        0.04522137716412544,
        0.008076522499322891,
        -0.026876671239733696,
        -0.03317948430776596,
        -0.02831537090241909,
        -0.004471916705369949,
        -0.014685120433568954,
        0.023145316168665886,
        -0.04718967527151108,
        -0.0041412897408008575,
        0.0069818743504583836,
        0.026642626151442528,
        0.09111376851797104,
        0.06765592843294144,
        5.1743854403395956e-33,
        -0.00662654684856534,
        0.016689768061041832,
        -0.035230718553066254,
        -0.05208620801568031,
        -0.0014792756410315633,
        0.016165757551789284,
        0.0016544850077480078,
        0.007917894050478935,
        -0.00822744145989418,
        0.04855559021234512,
        -0.11678959429264069,
        0.04632691293954849,
        -0.1518339067697525,
        0.04926329478621483,
        0.08583870530128479,
        -0.011203492991626263,
        0.00479472428560257,
        -0.007077156566083431,
        0.009827898815274239,
        -0.04500409588217735,
        0.0006336744409054518,
        0.05450989678502083,
        0.042892470955848694,
        -0.07308407127857208,
        0.07103567570447922,
        0.03948075324296951,
        -0.0007951146108098328,
        -0.019508853554725647,
        0.09741301834583282,
        0.04842546209692955,
        -0.051868271082639694,
        -0.07705167680978775,
        -0.02307123690843582,
        0.03347532078623772,
        -0.02020334079861641,
        0.020152416080236435,
        -0.04448302090167999,
        -0.050656311213970184,
        -0.006092429161071777,
        0.02198048308491707,
        -0.04415729269385338,
        -0.01231165137141943,
        -0.09199845045804977,
        -0.04352935031056404,
        -0.007464002817869186,
        -0.014988500624895096,
        0.08368120342493057,
        -0.01716526597738266,
        0.022377151995897293,
        -0.01553458720445633,
        -0.03990766033530235,
        0.015376283787190914,
        -0.08973123133182526,
        0.00482602883130312,
        0.014518501237034798,
        -0.14359669387340546,
        -0.007829940877854824,
        -0.06384928524494171,
        0.06765736639499664,
        0.0310333501547575,
        0.049327973276376724,
        -0.031160200014710426,
        0.05056210234761238,
        -0.05193459615111351,
        -0.032907046377658844,
        0.07378646731376648,
        0.02864881046116352,
        -0.03497280180454254,
        -0.08564029633998871,
        -0.11324615776538849,
        -0.004052635282278061,
        -0.02730424329638481,
        0.018914537504315376,
        -0.04197303578257561,
        0.044241055846214294,
        -0.0281198862940073,
        -0.07620956003665924,
        -0.04679632931947708,
        0.04542418569326401,
        -0.005801596213132143,
        -0.046795498579740524,
        0.0670437440276146,
        -0.02491625025868416,
        0.05023636668920517,
        0.06130435690283775,
        -0.08190359175205231,
        -0.010556906461715698,
        8.224885823437944e-05,
        -0.06654828041791916,
        0.00801490806043148,
        -0.026436928659677505,
        0.03385058045387268,
        0.028097396716475487,
        0.029501477256417274,
        0.01784861646592617,
        -6.563770906527583e-33,
        -0.0616726316511631,
        -0.05915330722928047,
        0.026517974212765694,
        0.08285603672266006,
        0.03545345738530159,
        -0.03516799584031105,
        0.010862155817449093,
        0.03446490317583084,
        0.02073836699128151,
        -0.028071235865354538,
        -0.024001695215702057,
        -0.0011692986590787768,
        -0.07128144055604935,
        0.03622012957930565,
        0.032087747007608414,
        -0.056800566613674164,
        0.02412307634949684,
        0.01210800465196371,
        0.04258370399475098,
        -0.11154250055551529,
        0.13934536278247833,
        -0.035097409039735794,
        -0.006540149450302124,
        0.017355861142277718,
        -0.00528854550793767,
        0.04643579199910164,
        0.007026480510830879,
        -0.003949667327105999,
        -0.025660628452897072,
        0.08064751327037811,
        -0.016210006549954414,
        0.026064977049827576,
        -0.022831909358501434,
        0.03333251550793648,
        0.0059564909897744656,
        -0.04149140790104866,
        0.055394671857357025,
        0.11011126637458801,
        -0.06747108697891235,
        -0.06742371618747711,
        -0.005523327272385359,
        -0.08014614135026932,
        0.019588442519307137,
        -0.0008908501476980746,
        0.051884204149246216,
        -0.05604349449276924,
        0.0009509996743872762,
        -0.03234122693538666,
        0.054740991443395615,
        0.049779947847127914,
        -0.0037715823855251074,
        -0.04463016986846924,
        0.09600523859262466,
        -0.0401090644299984,
        -0.050333570688962936,
        -0.033749744296073914,
        -0.009855075739324093,
        -0.015883488580584526,
        -0.025777405127882957,
        0.00265052099712193,
        0.03195343539118767,
        -0.06594529747962952,
        -0.04904957115650177,
        -0.02584795281291008,
        0.047811295837163925,
        0.05860947445034981,
        0.16526193916797638,
        0.05179078131914139,
        0.08315409719944,
        -0.01915186457335949,
        -0.012675336562097073,
        -0.0713837668299675,
        -0.0017374797025695443,
        -0.10589563101530075,
        -0.015363694168627262,
        0.039626557379961014,
        0.008052755147218704,
        -0.02311544492840767,
        0.08311440795660019,
        -0.06709747761487961,
        -0.04561470448970795,
        -0.028401654213666916,
        0.05466410890221596,
        -0.054277729243040085,
        -0.003277265001088381,
        0.028715455904603004,
        0.049502789974212646,
        -0.04035564884543419,
        -0.005125309806317091,
        -0.013802772387862206,
        -0.05318652093410492,
        0.05796690657734871,
        -0.006000424735248089,
        0.10911884158849716,
        0.0078017376363277435,
        -6.421591081107181e-08,
        -0.020265398547053337,
        0.07390417903661728,
        0.035347823053598404,
        0.0026804141234606504,
        0.04024694487452507,
        -0.01225354615598917,
        -0.059867776930332184,
        -0.033320069313049316,
        0.0038574100472033024,
        0.00494613591581583,
        0.040300194174051285,
        -0.00589290214702487,
        -0.010348031297326088,
        0.004583497066050768,
        0.07741019129753113,
        0.044311221688985825,
        -0.011079096235334873,
        0.07469256222248077,
        -0.05652053654193878,
        -0.02692258544266224,
        -0.007175777573138475,
        0.05523718148469925,
        0.04823889955878258,
        -0.06473658978939056,
        -0.021040385589003563,
        0.01645735464990139,
        -0.03593417629599571,
        0.07451802492141724,
        0.06985832005739212,
        -0.01767915114760399,
        -0.04202881082892418,
        0.03358273580670357,
        0.01072775386273861,
        0.055400997400283813,
        0.05426373705267906,
        -0.062000907957553864,
        -0.028280576691031456,
        0.09264819324016571,
        0.06638702005147934,
        0.0164303258061409,
        -0.01271885260939598,
        0.035146139562129974,
        -0.045878175646066666,
        -0.002234907355159521,
        0.05686791613698006,
        0.0021069322247058153,
        0.046108704060316086,
        -0.05730053782463074,
        -0.04155781492590904,
        0.042455654591321945,
        -0.02900157868862152,
        -0.07695341110229492,
        0.033674340695142746,
        0.04740589112043381,
        0.06722214072942734,
        -0.012872433289885521,
        -0.04878959432244301,
        0.03428758680820465,
        -0.01835869997739792,
        0.04341932386159897,
        -0.007964009419083595,
        -0.14190658926963806,
        -0.059895530343055725,
        0.1966800093650818
    ]
}