{
    "id": "2pmYoZNCgTY",
    "title": "The Oppo Find N - Can the Newcomer Survive?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-01-21T14:45:00Z",
    "video_url": "https://www.youtube.com/watch?v=2pmYoZNCgTY",
    "category": "Howto & Style",
    "tags": [
        "Oppo Find N",
        "Folding phone",
        "best folding phone",
        "smartphone",
        "android",
        "iphone",
        "oppo",
        "samsung",
        "xiaomi",
        "apple",
        "ultra thin glass",
        "utg",
        "Flagship",
        "oppo foldable"
    ],
    "views": 1055003,
    "likes": 44871,
    "comments_count": 2156,
    "description": "Lets durability test the Oppo Find N! Sign up for Stamps.com at:  for a special offer that includes a 4-week trial, free postage, and a digital scale. No long-term commitments or contracts. Folding phones are pretty awesome. Seeing pixles wrap around a radius is still mind blowing futuristic. With so many brands using flexible displays these days, its important to know which folding smartphones can survive, and which folding smartphones.... dont survive. Its time to test the new Oppo Find X.   Watch the Teardown HERE:   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.Stamps.com/jerryrig",
        "https://youtu.be/2Nt3J4ZvkbM",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today we're going to review a newcomer to the folding phone realm, this is the Oppo Find N. Oppo is marketing this phone as a novelty to necessity which is a bold claim considering that most folding phones are still in the novelty realm. One of the prerequisites though of moving from novelty to necessity is durability. So today we're going to put years worth of abuse onto this Oppo Find N to see if it can survive. Do you know what else has been around for years though? Our sponsor Stamps.com. Stamps.com has been around for 20 years bringing the services of the United States Postal Service and UPS right to your computer. Whether you're sending letters like invoices, or packages, Stamps.com can handle it all, which is why over a million small businesses like my own use Stamps.com. I can print labels, compare rates, and get exclusive discounts from UPS and USPS all year long...right from my desk. I mean it's not that I don't like large crowds, standing in lines, and traffic, but you know, why go outside when you can just...not. Save time and money with Stamps.com. And with my link Stamps.com/JerryRig you get a special discount that includes free postage, 4 week trial, and a free digital scale. No long-term commitment or contract, and the frosting on top is that you get a 40% discount with USPS and a 76% discount with UPS. I'll leave that special link, Stamps.com/JerryRig, right there in the video description. And now it's time to find out if the Oppo Find N is novelty, necessity, or nuked. Let's get started. [Intro] The Oppo Find N. Right off the bat I'm going to be honest with you, while this folding phone might be a bit different than the rest, it's still way up there in price. This guy sits around $1,500. So yeah, it is cheaper than Samsung's Galaxy Fold 3 at $1,800, but it still costs substantially more than a normal regular brick phone even a flagship. So the price alone kind of leaves it in the novelty department. Form factor-wise though, I do think I like it a bit better than the Fold 3. While the Galaxy Fold 3 is skinnier and longer, this guy is shorter but makes up for the length with girth and a very usable front screen which you'll see in a second. It also shuts tight. No air or light gaps to be seen between the halves. It's very different than the Galaxy Fold series which leaves a gap between the inner screens while shut and allows light through. And finally, here's the front screen. Girthy, functional, and reachable all with one hand. Inside the phone with both halves opened up, it's basically a square which is great for consuming square content like Instagram, and YouTube videos from 2007. It does have multitasking though. But we aren't here for the software, we're here for the hardware. If this $1,500 phone is indeed a necessity then it will be durable. Oppo's bragging about a 12 layer inner display, one of which is an ultra thin glass. We'll see if that layer's on top or not. As we can see with the exterior screen, the top layer is plastic... a plastic screen protector that is. With that gone we continue up our Mohs scale of hardness, past the plastic at level 2 to glass which is level 5 or 6. The Oppo Find N is using Gorilla Glass Victus which scratches at a level 6 with deeper grooves at a level 7. Very normal. The inner screen, however, a level 2, with deeper grooves at a level 3. We knew this was coming, but it's still a little crazy how soft it is. Fingernails, coins, and dust are especially a worry since this thing does close tight, trapping contaminants inside. The display should always definitely be cleaned or wiped off before closing. The ultra thin glass Oppo is talking about is not one of the surface layers and maybe we'll be able to find it during the teardown. Until then, let's continue. The exterior front screen glass is also protecting a 32 megapixel hole punch selfie camera and the sides of the phone are made from...metal. Kind of cool how we can check two sides at the same time when it's shut like this. The volume rocker is metal and the fingerprint scanner is scratchable but recessed. The metal at the top of the phone has a microphone hole, but the spine, which is signed, designed for Find, bear in mind, the grind shall be behind, leave silver straight lined. Oppo says there are 136 different components that make up the complexity inside of this hinge so it's good to see the exterior is metal, a durable material. Let's cross our fingers that we don't see all 136 parts from the inside during this video. The bottom, of course, has our 33 watt fast charge USB-C port as well as a dual SIM card tray, which does have a water resistant rubber ring around the opening. Good to see Oppo has put some thought into water resistance even if it's not officially rated like the Galaxy Flip and Fold are. The back of the Oppo Find N is a heavily textured piece of glass. The lines you see left behind on the glass are actually little pieces of my razor blade. The level 6 glass is actually sanding down my level 5 stainless steel. Instead of my knife durability testing the phone, the phone is durability testing my knife. I do like the textured glass though, I do wish more phones had it. As far as cameras go, we have a 13 megapixel telephoto camera up top, 50 megapixel main sensor in the center, and 16 megapixel ultra wide camera down at the bottom all protected with little glass circles of their own, along with the dual tone LED flash. Back to the hinge since it's one of the things that makes this phone unique. It can hold its position in different places while it's being opened. And one big perk over Samsung's Folding phone is that the Oppo Find N's crease in the center is 80% less visible due to the larger curve radius it has while closed. I know that that crease is a deal breaker for some people and Oppo has done a good job of hiding it. They also hide burns pretty well. Even after 30 seconds the screen is still pretty well intact. I can tell there is some minor melting on the square 7.1 inch 120 Hertz plastic inner display, but not too shabby all things considered. The outer screen is a 5.5 inch AMOLED and actually only makes it 20 seconds before getting permanently damaged which proves to us once again that nobody should be burning their screen with a lighter. Thanks for coming to my TED Talk. Finally though, it's time to bend the Oppo in ways that make you say uh-oh. Hold on, I almost forgot. Out of necessity I will once again venture outside so you don't have to for the dust test. With no official water resistance and 136 moving parts inside of the hinge, let's see how much of this dust can actually get inside. It makes me extremely nervous that there is no extra space between the two halves though. Kind of hard to shut with all these rocks and pebbles inside. With all the obstructions there is definitely a gap now. I'll wiggle the dust around on the screen and hinge for good measure and get some good coating on the backside and top edges. There's more dust here on my desk and phone than the phone should ever reasonably encounter in everyday life if you're one of those people who take care of it. But yet if we listen closely, the hinge still sounds pretty pristine. Nice work, Oppo. I'll slam it shut a few times, clean it off, and assess the damage to the surface. While there are significantly more marks and divots on the inner screen, it is less than I anticipated. It's not too bad...until you remember this costs $1,500 and then the damage hurts a little more. Finally, we know the phone is supposed to bend inward, and with the thickness of the phone folded shut it's nobody's surprise that it's solid while closed from both sides. But will the Oppo Find N bend backwards and break? There's only one way to find out. No, no it will not. Sitting on this phone while open might slightly scratch or damage the soft inner screen, but structurally this Oppo Find N is solid. I'm still a bit shocked every time my folding phone doesn't snap in half though. It just seems like they should. Does this Find N move phones from novelty to necessity though? I mean it is cool, but until folding displays are on pare with regular phones cost-wise, I think they remain solidly in the novelty realm. That's just my opinion though, what do you think? Let me know down in the comments. And which folding phone form factor is your favorite so far? I'm curios. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Oppo Find",
        "Oppo",
        "Find",
        "phone",
        "screen",
        "Stamps.com",
        "folding phone",
        "Galaxy Fold",
        "glass",
        "Samsung Galaxy Fold",
        "level",
        "Fold",
        "novelty",
        "folding",
        "Inside",
        "glass Oppo",
        "phones",
        "United States Postal",
        "review a newcomer",
        "bold claim"
    ],
    "transcript_entity_values": [
        "50 megapixel",
        "Galaxy Fold 3",
        "6",
        "Girthy",
        "80%",
        "Stamps.com",
        "Instagram",
        "32 megapixel",
        "two",
        "120",
        "the United States Postal Service",
        "4 week",
        "around $1,500",
        "years",
        "33 watt",
        "the Galaxy Flip and Fold",
        "5.5 inch",
        "1,800",
        "Oppo",
        "40%",
        "only one",
        "UPS",
        "76%",
        "half",
        "Gorilla Glass Victus",
        "USPS",
        "Hertz",
        "5",
        "7.1 inch",
        "2007",
        "second",
        "20 years",
        "30 seconds",
        "13 megapixel",
        "Samsung",
        "today",
        "1,500",
        "12",
        "Today",
        "3",
        "One",
        "16 megapixel",
        "YouTube",
        "20 seconds",
        "Galaxy Fold",
        "USB",
        "one",
        "136",
        "Twitter",
        "2"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "DATE",
        "MONEY",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "MONEY",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "DATE",
        "TIME",
        "QUANTITY",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "TIME",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.17622068524360657,
        0.06115144491195679,
        0.005733099300414324,
        -0.037806324660778046,
        0.016950776800513268,
        -0.09671997278928757,
        0.07255003601312637,
        0.11352290958166122,
        -0.030694294720888138,
        0.032625433057546616,
        0.08930555731058121,
        0.037622012197971344,
        -0.014578020200133324,
        0.03225473687052727,
        0.017035018652677536,
        0.020753445103764534,
        0.06912369281053543,
        -0.01770687662065029,
        0.025967853143811226,
        0.09283895790576935,
        0.0003961321781389415,
        -0.07303787022829056,
        0.08190108835697174,
        -0.078874871134758,
        -0.07802899181842804,
        0.0784844383597374,
        -0.021575767546892166,
        -0.012973274104297161,
        -0.014185847714543343,
        -0.08641575276851654,
        0.06796909123659134,
        0.10922038555145264,
        0.02446683682501316,
        -0.010419255122542381,
        0.053418997675180435,
        0.006227077916264534,
        0.04893055185675621,
        0.007858465425670147,
        -0.08783470094203949,
        -0.012566189281642437,
        -0.009662355296313763,
        0.02596614882349968,
        -0.01894586719572544,
        -0.0034646177664399147,
        0.03488140553236008,
        -0.08107733726501465,
        0.0014196436386555433,
        -0.03211714327335358,
        0.0033281242940574884,
        -0.011275459080934525,
        -0.009090429171919823,
        -0.06515826284885406,
        0.060434285551309586,
        -0.002001444809138775,
        -0.05596137046813965,
        0.018915100023150444,
        -0.0674867257475853,
        -0.03713562712073326,
        -0.015010581351816654,
        0.012169952504336834,
        0.05295190587639809,
        0.041326116770505905,
        -0.06095420941710472,
        0.042433001101017,
        0.018063688650727272,
        0.031063811853528023,
        0.032326292246580124,
        -0.1126636415719986,
        -0.07908203452825546,
        -0.01653570681810379,
        -0.09491077065467834,
        0.056731242686510086,
        0.0063376594334840775,
        -0.016812706366181374,
        -0.0108886593952775,
        0.09059789031744003,
        0.06840138137340546,
        -0.0450839139521122,
        -0.04932662472128868,
        0.022827977314591408,
        0.028408287093043327,
        -0.014501062221825123,
        -0.07035093009471893,
        0.02320064604282379,
        0.0022136967163532972,
        0.03989345580339432,
        -0.005140656139701605,
        0.06642172485589981,
        -0.030197136104106903,
        -0.04828184098005295,
        -0.04823705181479454,
        0.10464458912611008,
        -0.06912139058113098,
        -0.006704043131321669,
        -0.055413562804460526,
        -0.06611580401659012,
        -0.06063711270689964,
        0.012776635587215424,
        -0.07965202629566193,
        0.05997420847415924,
        0.0509696826338768,
        0.05248427391052246,
        0.09510751068592072,
        0.00014210035442374647,
        -0.04079996049404144,
        -0.055089227855205536,
        -0.028770262375473976,
        -0.025950977578759193,
        0.06527045369148254,
        0.06290005892515182,
        -0.05108482390642166,
        -0.023208564147353172,
        -0.017740122973918915,
        -0.0452381893992424,
        0.0018715187907218933,
        0.01759796030819416,
        -0.12979169189929962,
        0.07748626917600632,
        0.11759978532791138,
        -0.013302878476679325,
        0.01137289684265852,
        0.00114376749843359,
        -0.05922989174723625,
        -0.0009267707937397063,
        0.09026674181222916,
        0.0465097576379776,
        -0.07853688299655914,
        4.073414492623564e-33,
        0.03428263962268829,
        0.14982816576957703,
        0.030311819165945053,
        0.06470964848995209,
        -0.007948532700538635,
        0.009231636300683022,
        0.0048269773833453655,
        -0.005685660056769848,
        -0.08436853438615799,
        0.03868282958865166,
        -0.01477616373449564,
        0.04648112133145332,
        -0.0069507393054664135,
        0.01659453846514225,
        0.07581770420074463,
        -0.06591185182332993,
        -0.0018958834698423743,
        0.015590855851769447,
        -0.03356114402413368,
        -0.01652730256319046,
        -0.032054927200078964,
        -0.08892135322093964,
        0.031003905460238457,
        0.013456599786877632,
        0.048336803913116455,
        0.04315924644470215,
        -0.012177879922091961,
        -0.037291452288627625,
        0.020051466301083565,
        0.0277476254850626,
        -0.10530636459589005,
        0.014284585602581501,
        0.005589702632278204,
        0.07202819734811783,
        -0.0756998136639595,
        0.023687127977609634,
        -0.057300664484500885,
        -0.1202993094921112,
        -0.048442546278238297,
        -0.007432305719703436,
        -0.05550295114517212,
        0.027658922597765923,
        0.024925943464040756,
        -0.0028217171784490347,
        0.002761570503935218,
        -0.067190021276474,
        0.05959764122962952,
        0.02599310502409935,
        -0.012495365925133228,
        0.025883156806230545,
        0.007599296048283577,
        -0.04302172362804413,
        -0.04627882316708565,
        -0.071563720703125,
        -0.042006246745586395,
        -0.007629386615008116,
        -0.03333161771297455,
        -0.015089585445821285,
        0.0724160373210907,
        0.029859721660614014,
        0.0643714889883995,
        0.010528046637773514,
        -0.07135829329490662,
        0.040093500167131424,
        -0.06660925596952438,
        0.05803942680358887,
        0.032582856714725494,
        -0.055392708629369736,
        -0.04417796432971954,
        0.11545054614543915,
        -0.0274043045938015,
        -0.009491831995546818,
        0.02577010914683342,
        -0.006525428965687752,
        0.06291171163320541,
        0.042731136083602905,
        0.0021812014747411013,
        0.01011197455227375,
        0.0430317185819149,
        -0.02877275086939335,
        0.011217670515179634,
        -0.02775542065501213,
        0.047509871423244476,
        0.024702545255422592,
        -0.005280735436826944,
        -0.03288742154836655,
        0.055225055664777756,
        -0.04925660416483879,
        -0.02027037926018238,
        0.003280408214777708,
        -0.009432362392544746,
        -0.08497460186481476,
        -0.06931998580694199,
        -0.07779417932033539,
        0.009666616097092628,
        -4.1070185700357115e-33,
        -0.005747124552726746,
        0.004760849755257368,
        -0.01498720608651638,
        -0.034829847514629364,
        0.007655432913452387,
        -0.06163676455616951,
        0.04625825583934784,
        0.061763983219861984,
        0.03847792372107506,
        -0.10665594041347504,
        -0.07654678821563721,
        0.03221885859966278,
        0.04037687927484512,
        -0.004899025894701481,
        0.029392460361123085,
        0.023801377043128014,
        0.0044092643074691296,
        -0.06358499825000763,
        0.04330401495099068,
        -0.024205755442380905,
        0.018365995958447456,
        0.031429730355739594,
        0.025020064786076546,
        0.08899342268705368,
        -0.0039058623369783163,
        0.04296654090285301,
        0.07430942356586456,
        -0.04991825670003891,
        0.05014234408736229,
        -0.04547019302845001,
        -0.05874217301607132,
        -0.0534498393535614,
        0.03531939536333084,
        0.07596855610609055,
        0.03478768840432167,
        0.05604599788784981,
        -0.04117974266409874,
        -0.02162957936525345,
        0.04113940894603729,
        -0.05454316362738609,
        -0.030092177912592888,
        0.029108664020895958,
        0.024407483637332916,
        -0.01531246118247509,
        -0.034583207219839096,
        -0.11922270059585571,
        -0.03400813788175583,
        0.033296991139650345,
        0.0006280698580667377,
        0.01918851025402546,
        -0.048035215586423874,
        0.05115915834903717,
        -0.015756497159600258,
        -0.04509362578392029,
        -0.053587090224027634,
        0.04007206857204437,
        0.003473020624369383,
        -0.04864328354597092,
        -0.003289523534476757,
        -0.012644193135201931,
        0.056752629578113556,
        0.01965939626097679,
        -0.004237400367856026,
        0.06854519248008728,
        -0.011392302811145782,
        0.013121554628014565,
        0.07777592539787292,
        -0.024657778441905975,
        -0.06190279498696327,
        0.017138974741101265,
        0.013226109556853771,
        -0.008434323593974113,
        -0.012795612215995789,
        -0.09411711990833282,
        0.0626453384757042,
        0.034859225153923035,
        -0.07452838867902756,
        0.020065434277057648,
        -0.00871049053966999,
        -0.009978163056075573,
        0.02063392475247383,
        -0.036790382117033005,
        0.008056622929871082,
        0.01746203564107418,
        0.041196197271347046,
        0.020520895719528198,
        0.03054177761077881,
        0.04166925325989723,
        -0.028531912714242935,
        0.035612571984529495,
        -0.008416751399636269,
        0.00964856706559658,
        -0.04045402258634567,
        0.13085874915122986,
        0.00537768192589283,
        -5.98133595985928e-08,
        0.00019598068320192397,
        0.0797581821680069,
        0.004660713020712137,
        -0.02538064494729042,
        0.07581114023923874,
        -0.003252214752137661,
        0.039520252496004105,
        -0.07904911041259766,
        0.022573910653591156,
        0.013410981744527817,
        0.011213622987270355,
        -0.07525684684515,
        -0.019679008051753044,
        0.1141054704785347,
        -0.005563399754464626,
        0.08663467317819595,
        -0.006148576270788908,
        0.0025445788633078337,
        -0.06580899655818939,
        0.040036391466856,
        -0.0965595617890358,
        0.02355201169848442,
        0.06657968461513519,
        -0.038557764142751694,
        -0.0027503627352416515,
        0.015538740903139114,
        -0.12607112526893616,
        -0.022322749719023705,
        0.11683490872383118,
        0.05971532687544823,
        -0.03181081265211105,
        -0.008615574799478054,
        0.008239582180976868,
        -0.03637778386473656,
        -0.05860765650868416,
        -0.06340044736862183,
        -0.027486169710755348,
        -0.018066613003611565,
        0.04060467705130577,
        0.06808781623840332,
        0.042513784021139145,
        -0.03857913240790367,
        0.022834412753582,
        0.04753026366233826,
        -0.03720398247241974,
        -0.011313692666590214,
        0.04080653190612793,
        -0.1527893841266632,
        -0.06997304409742355,
        0.03978894278407097,
        -0.01199549250304699,
        -0.02369113080203533,
        -0.077040895819664,
        -0.018231036141514778,
        0.002691869158297777,
        0.01328254584223032,
        0.045323602855205536,
        0.0028261221013963223,
        0.026929983869194984,
        0.006891132332384586,
        -0.03919532895088196,
        -0.0971279963850975,
        0.014275404624640942,
        0.0831969752907753
    ]
}