{
    "id": "2QkQSofGxTw",
    "title": "Daniel Ek Spotify CEO on their new redesign and video on Spotify!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-03-10T18:09:35Z",
    "video_url": "https://www.youtube.com/watch?v=2QkQSofGxTw",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Unboxing",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 55975,
    "likes": 2323,
    "comments_count": 175,
    "description": "Had so much fun checking out the Stream On presentation at Spotify and getting a chance to talk to their CEO and Co-founder Daniel Ek on the new platform updates, video on Spotify and his advice for creating a great company culture.  Check out more here:    PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "https://newsroom.spotify.com/stream-on-2023/",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, it's Justine and I'm so excited. 'Cause right now I'm actually at Spotify headquarters and they just had an incredible stream on event where they announced a bunch of new features in Spotify. And then I'm gonna go interview Daniel Ek, the co-founder and CEO of Spotify. I could not be more excited. Let's go. (upbeat music) Oh my gosh, Daniel, thank you so much for chatting with me today. This is so exciting. - Of course. Well, I'm happy to be on. I've been watching the show for a while, so yeah. Happy to be here. - That's so cool. Thank you. And I have been a Spotify user for a very long time. Like I don't even really remember how I got an invite, but I don't even know what the year was, but it was a long time before Spotify was really readily available. - Yeah. - So, I just remember making a lot of people jealous. - Yeah. Yeah. And it's funny because I looked it up just before. So, I think you got it through Sean Parker back in the day as one of their really really early people here in the US who got it. - That's wild. Do you remember what year it was? - That must be probably 2010. - Wow. - So, 13 years ago. - That's a really long time. - Yeah. - And I think it's also been so fascinating just kind of you know, reading about Spotify, like the beginnings and kind of your career. It's so inspiring. So, do you wanna give people who may not be familiar, like, how did Spotify actually come to be? - Yeah, sure. I'm born and raised in Sweden. And you know, I had two big passions growing up. I had music and technology and I was kind of one of these kid who never could pick, I was always like playing an instrument and I was always dealing with computers and technology in some shape or form. And I got lucky enough to start company did pretty well, ended up selling it. And as I was thinking about what to do next, my co-founder and I, we started hanging out and we didn't know we were gonna start a company, but he kind of suggested to me, look, I mean what are your passions? And I said, well, my passion's always been music and technology. And he's like, well, so, why don't we do something in music and technology? I said, well, I don't think that's a great idea. This is like a terrible thing because it's all only piracy going on all over the world and you can't get that to work. And I said, well, okay, but what if you solve that? How would you do that? And I said, well, I don't think that's possible. I think here's all the problems, but I guess you could potentially do this. And I said, okay, well, but all these problems, how would you solve that? And then the why came, and the why came and the more and more answers I started giving, I was like, well, maybe there is a chance here to do something. And back then, it was pretty simple. It was based on this idea that the music industry was in a free fall, yet you had something consumers loved which is all the world's music available through these pirate sites. And I realized you couldn't sue the consumers which was what the music industry was trying at the time, but you had to build a better experience than piracy. And that's where it started. And I realized it had to be legal and I realized it had to compensate artists fairly for that process. And that's when we started working on Spotify. And it took like three years to get all the licenses done. I probably thought it would take two months, but you know, that's what happens with these entrepreneur journeys that goes up and down, up and down. And then we launched and then it took another like three or four years before we were able to launch here in the US. - Yeah. And I just love that journey and I just feel like it's so cool to hear and I think it's inspiring for a lot of other entrepreneurs and even creators and where Spotify is now is really, it's pretty impressive, like what you guys have done in the music industry, making so many jobs for actual creators being able to do their passion. And what I love so much about the streamline presentation is you focused a lot on creators. And I think it's also interesting. 'Cause we all say the word creators and that encompasses so many things. Musicians, artists, podcasters. And even audiobooks. - Yeah. - What are some of the things that you guys launched today or whenever you guys are watching this or listening? - [Daniel] Yeah. - What can creators expect? - So, what we launched today is an all new Spotify experience where it really starts with the home feed. So, it's an entirely new home feed that's very visual, very interactive, that allows you as a consumer to be able to now engage and see the creators the way they want to be seen. As a crater, that means you have the opportunity to use video as a way of expressing yourself. It means that you have the way of using transcripts as a podcaster and we're gonna be able to pick out interesting places just for you using our machine learning technology that you might be interested in. So, even if I've never listened to you before, but for instance, I know stuff about Spotify and I'm generally interested, you'd get right into precisely this moment in our conversation. So, that person gets a chance to listen to that and ends up engaging and thereby also discovering hopefully you and start listening to more and more of your great content. And that's the start. And then it really comes through an entirely new updated experience where everything from our search and discovery also changes with more ways for you to discover a great content, more great new tools for you as a content creator as well to reach those fans. - No, it's awesome. And my sister's so sad she couldn't be here. 'Cause we host a podcast together and we started during the pandemic and we found anchor and it was honestly life changing. Everything was so simple. - Oh amazing. - And I was like, okay, we have to make sure we're shooting video because when Spotify launches video we need to be ready. - A hundred percent right. - So, from the beginning that was our entire plan was like when you guys launched, like, we're here, we're ready. So, that is something that I'm super excited that you guys are really leaning into. So, for people who may be interested in starting a podcast or who have audio podcasts what kind of features are you guys, you know, helping out with for video? - Again, as you mentioned, video took sort of the front stage center today for us at Spotify and for us it's an important way to express yourself both as a creator, but I think we're, you know, on our side also creating lots of more ways for people just generally to engage with these creators. So, you would see us do Q&A, you saw us do polls as well. So, there's gonna be a lot more ways for people just to engage with creators and for creators to engage with their audience as well. We also updated an entirely new podcaster for spotify.com which is our tool that allows now anchor creators to get the benefit of all the other great Spotify tools that you get access to. And of course, as you mentioned rolled out video now for all creators no matter what hosting platform you're using as well. - It's really cool and I know I'm very excited about it. Something else I thought was really cool was the countdown to albums for artists. - It's a big deal. You know, many times like a podcast say, you know, you may work on an episode, but you may have a pretty regular frequency of maybe releasing content weekly or biweekly. But an artist, when they're working on an album, sometimes that process might take a year or even two years. So, it's very important for them to be able to as they're dropping a single for instance, build that kind of an excitement and anticipation for the album as well. Having that product we've seen, you know, gets more than 80% to listen to the album then the first week who pre-saves the album. - No, it's such a great idea and super helpful for artists. Another thing is AI is pretty much the top of everyone's mind today and I think a lot of people don't even realize a lot of the stuff that you guys are doing has been AI, all of the recommendations. Of course, you do have people in-house doing that and you also launch the the AI DJ which is so just, it's so fun. - Yeah. - And so, how do you see, kind of going forward how AI's gonna help listeners and also help creators? - We think about it from two ways. So, I think when people hear the word, they either get very worried or they get very excited. And it seems to be either one of those extremes. And at Spotify we've always thought really really hard about what position we take of AI. Everything from, if you think about our wrapped on how we do storytelling with data, we knew privacy and individual expression is importance. We put the ability for you to share if you like it front and center instead of the platform just sharing it automatically to everyone. That's just one example. But then even in terms of recommendation, we don't try to maximize the time spent in app as an example. We try to maximize the influence that we have by shortening the distance between the person wanting to watch something listen to something and the person then actually hearing it. And those are just a few ways that may seem kind of trivial, but underneath the surface actually makes all the difference in how the algorithms actually work. And as a creator, for example, what we're actually trying to do is build meaningful connections. We're not just trying to get you you to create a viral clip on Spotify, but we're actually trying to get you to create whether this person actually came back and listened to more episodes is more meaningful for our signal than it is that they particularly enjoyed that clip that you posted as well. So, it just fundamentally works very different underneath the surface than other platforms. And for us, I think that means if you're a creator that means you can really trust that you can build an audience on Spotify and you can be able to sustain that audience. And we don't shy away from that responsibility, including of course, helping creators with monetization as well. - Yeah. And I also saw how you guys were doing merch and ticket sales and that kind of things. Obviously I'm not a musician so I guess four musicians, traditional ones like what are you guys doing to implement more of like the merchandise and and extra monetization streams? - Yeah, I think you're touching on something that's very important. So, the way we are looking at the world is there are obviously lots of types of creators that we were talking about, but perhaps the most important definition for us is whether you're doing it to share content with your friends or whether you're actually trying to do this as a business. So Spotify, we wanna be the best home for you that aspire to be professional or are already a professional creator. And that means we have to do things a little bit differently than a platform where, for instance, you're focused mostly around communication with friends and family. But one of those realization is that many creators don't rely on just one revenue stream. It can't just be around advertising. It can't just be about sort of paying customers. But oftentimes it's both of those things and perhaps even more. And on the music side, that's been very true for a long time. So, if you think about an average musician, an average musician has their music of course, that they record and put out, but they're also touring, they also have merchandise. And so, as we look at this thing what we realized is many of the things that we built for the musicians are also the things that we believe almost all creators would want at some point in time. You may have digital merchandise, you may have physical merchandise, but you may also put on your own events as well. And we want Spotify to be the best home for you as a creator to be able to do all of those things. - Yeah. You're talking about digital now. I know it's usually a controversial thing with like NFTs, but like what do you think of like the web three landscape? I mean obviously that's probably future thinking, but I mean I think it's very fascinating and the tech is really interesting and I think you can do a lot there as well. - I agree with you. I'm not sure we found the right product just now that sort of both captures the imagination is long term, sustainable both for creators and consumers. But I look at it and the most important thing is we wanna allow for as much experimentation as possible to happen. Quite often what ends up happening is some amazing creator out there figures out something that none of us would've imagined. And it's really through that that other people then start learning. You know, I've been for instance, checking out Mr. Beast and some of the stuff he's been doing and it's pretty fantastic to just see how many other lines of businesses he's building up now on the side too. And I think even if all creators won't be at that scale, I still think the idea is the same, which is you're building your audience you're building this unique relationship to that audience and that trust can extend to other things as well. And that's a very big a part of the focus we have at Spotify. - I think it's also cool you're doing the Patreon integration and so do you wanna talk about how that works? 'Cause I know a lot of my friends and a lot of creators also use Patreon. - Yeah, sure, absolutely. So, I think another thing that's very unique and different about Spotify is we are an open platform. We believe that the most important thing is to give as much choice as possible both to consumers and creators alike. And so, some others may have believed, oh, well Patreon must be, we must build all this functionality ourselves. We can't work with anyone else. But Spotify really from day one has always been built on partnerships. And for me as a consumer and as a creator as well, I think it's just great because as you rightly pointed out, there's lots of creators who are using Patreon, but there's also a lot of people who are consuming content on Spotify. So, one of the problems at the moment is if I want to consume any of that Patreon content, I may have to do it in a place that's not my actual audio listening place or where I would watch videos. So, there's two separate experiences almost. When this comes live, the way it's gonna work is that you as a creator is gonna be able to link to your Patreon thing and the consumer can then authenticate against that and unlock all the content that you wanna make available for your Patreon subscribers as well. And that's just an amazing way, again, talking about sort of not relying on one revenue model, but allowing you as a creator to have a lot of control over what you want to do with your business and us just building sort of the tools and the platform that enables that. - That seems to be a common Spotify trend. You guys identify a problem and you figure out how to solve it and I think that's pretty impressive. - Thanks. Yeah, I mean we certainly try, but I won't say we always get it right. I mean the big thing I think that I've learned as an entrepreneur is just understanding how important culture is. And I used to think that was like a buzzword that that wasn't that important. But ours is a culture of experimentation. We actually get a lot of things wrong, but hopefully we will evolve and we will learn from them and we will try more things as well. And it's always about sort of taking those insights, trying to do something, learning from it as we get feedback and yeah, go move on faster and better. - Yeah, I mean it's a testament even that you've been there for so long, you know, you started this company and really caring it through and I just loved so much watching the presentation and seeing how much you guys care about creators and really making sure that they're at the forefront. So, was there anything else today that you presented that you know, people may have missed or might need to know? - Well, I guess the one thing to touch on is perhaps AI DJ. - Oh yeah, oh my gosh, yes. I completely forgot. Yeah, it's so cool. - Yeah. - So, how does this all work? - I mean, it's so much fun and I probably shouldn't say it because it's kind of picking among my favorite children, but it is my favorite feature at Spotify at the moment. We've constantly been playing around with recommendations and giving you more choice. And as Gustav, who's our head of product set on stage today, our goal is to try to save you time. And one of the moments that we know people listen to a lot is in the car when you're driving, but you still want to have a great mix, but you're not entirely sure what to do and you wanna understand why you're getting served the recommendations you are. So, we created AI DJ to do exactly just that. And it's powered by (indistinct) who is an actual Spotify employee. - I met him today. - Yeah. - Which was awesome. - Yeah, he's a super cool guy. And it's funny because he gives you all this amazing context around music and it's scary good. And his voice is scary good. And so, quite often internally we really thought he had recorded all these things. - [AI DJ] I'm on it, coming up now. I got some hip hop, yo kind of hip hop. - And it was only when he started speaking Swedish which he definitely doesn't know how to do that we were like, oh, this is getting scary good. - That is hilarious. So, it's basically you took his voice track. - Yeah. - And then was able to implement that even in two other languages as well. - Yeah, we've taken his voice, had it recorded, all the intonations, phrasings, all of these different things. We've trained that on our models. We acquired a company a while ago called Sonantic that helps us do exactly that. They also, by the way created Val Kilmer's voice in Top Gun. - Oh wow. - So, it's a really cool company that now is part of Spotify. Their first product now is AI DJ where X now is talking about music and he's sharing a lot of context in history about each track too. And these are not things we told it. These are things that through our partnership with OpenAI that it's now able to tell the world about, for instance, a background story about a track and of course why you are hearing that track. - So, what kind of things would it say, like why I was listening to it would it be like, like a date that or was it a playlist? - Yeah, so it might be like, now we're gonna go back and listen to your favorite music during the summer of 2017. Do you remember this one? And then it would start playing, but it might also give you more specific around the track itself. Where did you know that this song was recorded by or produced by this person who you also liked these other tracks by? So, just more personal context. It's like having your own DJ in your pocket that could be with you when you're driving or commuting or outrunning or whatever you might be doing. And yeah, it's my favorite at the moment. - And like, this is why AI is cool and I think people think like AI robots like running around town. No, this is what it's all about. - Yeah. I totally agree and that's kind of why I said I think like people are like polarized on AI. It's like either it's really great or it's really bad. And obviously as a technologist, I see mostly the positive stuff. I think what we did here is struck a tone where we're making it come alive and it feels personal and feels like it's an actual real human being who's talking to you, giving you context and know you really well and know your music tastes super well and can give you all that great music for when you're cooking or running or whatever you're doing. - I'm so excited about it. I guess one last thing, you were talking about sort of like the Spotify culture and I guess for any other entrepreneurs or business people or creatives who are running a business, what do you think is the most important thing to kind of cultivate that culture that you guys have made? - I actually don't think it's that important that you have our culture. I think the most important thing is that you try to define what your culture is. - Yeah, that's what I meant. Like, how do you, I guess instill whatever your culture is? - Yeah. - Like you personally as a leader. Like, what advice can you give to someone? - Well, my advice, I guess the first thing I modeled myself on probably all the other famous entrepreneurs that you'd have the jobs, the gates and so on and so forth. But what I realized after a while is I wasn't any one of them. I was just me. And when you're not authentic, it's really hard to get across. And this is what I would say to any creator too. It's like, don't try to be anyone else. You just gotta be you. And so, it took me a few years to find that and that was probably like the most important part of the Spotify journey when I started being authentic to me. And I started asking the company to, you know have values that were aligned with me too. And that's a highly personal thing as well. And so, when I'm watching Spotify today, it's been 17 years, it's kind of crazy because it feels like I've got like this teenager who's right kind of unruly. It's not always doing what I wanted to do, but you can definitely see yourself in like bits and pieces of what it's doing. Yeah. It's pretty crazy that way. But I would just say be you, be really authentic and then be consistent. Just you have to reward the positive things you wanna see in the culture. And you have to try to very, very fast and clear. When you see something that's not marking up to that culture you want to build, go in and fix that. - Well, thank you so much for chatting with us today and we'll see you guys on the DJ. - Yeah. Thank you. - Thank you so much. (upbeat music)",
    "transcript_keywords": [
        "Spotify",
        "yeah",
        "creators",
        "things",
        "thing",
        "kind",
        "people",
        "creator",
        "lot",
        "music",
        "guys",
        "important",
        "important thing",
        "Patreon",
        "great",
        "today",
        "started",
        "cool",
        "culture",
        "time"
    ],
    "transcript_entity_values": [
        "three or four years",
        "Sean Parker",
        "Patreon",
        "one",
        "Spotify",
        "A hundred percent",
        "Sonantic",
        "Justine",
        "Swedish",
        "three",
        "weekly",
        "the day",
        "biweekly",
        "two years",
        "the year",
        "four",
        "Sweden",
        "Daniel",
        "13 years ago",
        "two months",
        "AI DJ",
        "17 years",
        "Daniel Ek",
        "today",
        "two",
        "AI",
        "US",
        "a year",
        "the first week",
        "2010",
        "Gustav",
        "first",
        "a few years",
        "Beast",
        "Spotify",
        "the summer of 2017",
        "more than 80%",
        "Val Kilmer's",
        "three years"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "PERSON",
        "NORP",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "GPE",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "ORDINAL",
        "DATE",
        "PERSON",
        "GPE",
        "DATE",
        "PERCENT",
        "PERSON",
        "DATE"
    ],
    "vector": [
        -0.025375910103321075,
        -0.07966292649507523,
        0.037320490926504135,
        -0.10062656551599503,
        0.05918363481760025,
        0.040649574249982834,
        0.11254990845918655,
        0.04110338166356087,
        0.011803163215517998,
        -0.028793927282094955,
        -0.016749851405620575,
        0.004119439981877804,
        -0.0006608510739170015,
        -0.035030316561460495,
        0.016097920015454292,
        0.00014321958587970585,
        0.0365280918776989,
        -0.04075133055448532,
        -0.01951882801949978,
        -0.036483630537986755,
        -0.06406599283218384,
        -0.09420228004455566,
        0.014165623113512993,
        0.011130649596452713,
        -0.032885730266571045,
        0.07817008346319199,
        -0.00860698614269495,
        0.034454528242349625,
        -0.06495585292577744,
        -0.10052609443664551,
        0.015610010363161564,
        -0.02903592959046364,
        0.13784126937389374,
        -0.04327533394098282,
        -0.038388676941394806,
        -0.03578720614314079,
        0.025421330705285072,
        -0.0038571872282773256,
        -0.10387098044157028,
        -0.008536317385733128,
        0.055246103554964066,
        -0.034997373819351196,
        0.006149443332105875,
        -0.04632804915308952,
        -0.04587125778198242,
        -0.03445813059806824,
        0.0028662835247814655,
        -0.08908365666866302,
        0.01854573003947735,
        0.0691201314330101,
        -0.08075729012489319,
        -0.10056643187999725,
        0.05632854998111725,
        -0.044117316603660583,
        -0.0468611866235733,
        -0.004179821815341711,
        -0.04389938339591026,
        0.062261879444122314,
        0.0933326706290245,
        -0.050989482551813126,
        0.08275329321622849,
        -0.06772425770759583,
        0.008757447823882103,
        0.0491611510515213,
        -0.013917733915150166,
        -0.03854803368449211,
        0.015227971598505974,
        0.038278304040431976,
        -0.019753320142626762,
        0.030902089551091194,
        -0.08053668588399887,
        0.061055995523929596,
        0.05452866479754448,
        -0.017237847670912743,
        -0.006922174710780382,
        0.05048622190952301,
        -0.050264354795217514,
        -0.04441915079951286,
        -0.04532022029161453,
        -0.004309781361371279,
        0.05318532884120941,
        -0.018959026783704758,
        -0.07989264279603958,
        -0.03630058094859123,
        -0.025503845885396004,
        0.025130558758974075,
        0.05622688680887222,
        -0.059758495539426804,
        -0.0886797234416008,
        -0.06095518544316292,
        -0.07084714621305466,
        0.0840982049703598,
        -0.005128920078277588,
        -0.046828798949718475,
        -0.005913696717470884,
        -0.006383918225765228,
        -0.05268502235412598,
        -0.01167299784719944,
        -0.010649600997567177,
        0.05902864411473274,
        0.0055864304304122925,
        0.029506074264645576,
        -0.009429979138076305,
        -0.027473917230963707,
        -0.012493843212723732,
        -0.14631737768650055,
        -0.06417827308177948,
        0.07675642520189285,
        0.0552869513630867,
        0.05057111755013466,
        -0.025284303352236748,
        0.011151686310768127,
        -0.06573763489723206,
        -0.048579972237348557,
        0.017233585938811302,
        0.13861368596553802,
        -0.07376644015312195,
        0.055467408150434494,
        0.04287269711494446,
        -0.021220097318291664,
        0.03360854461789131,
        -0.036263491958379745,
        -0.04668164253234863,
        0.0318332202732563,
        -0.018599282950162888,
        0.03284299746155739,
        -0.03570874407887459,
        1.1189809905385675e-32,
        -0.03297187387943268,
        0.09607949107885361,
        0.03363645821809769,
        0.0025022721383720636,
        0.029417401179671288,
        -0.037401989102363586,
        -0.04713710770010948,
        0.04822416976094246,
        -0.06212365999817848,
        0.00659300247207284,
        0.024987177923321724,
        0.01011523138731718,
        -0.022795915603637695,
        0.07126828283071518,
        0.0009039687574841082,
        -0.08479814231395721,
        -0.011549962684512138,
        -0.02369524911046028,
        -0.06837566196918488,
        -0.0624857172369957,
        0.04128386825323105,
        -0.043831393122673035,
        -0.05413482338190079,
        0.08370088785886765,
        0.07161303609609604,
        0.049478840082883835,
        0.07513180375099182,
        0.03818603232502937,
        0.11422303318977356,
        -0.019395867362618446,
        -0.10008444637060165,
        -0.03361501172184944,
        0.04124055430293083,
        -0.053544435650110245,
        -0.010774814523756504,
        -0.02849404327571392,
        -0.07194188982248306,
        -0.020568473264575005,
        -0.020349929109215736,
        -0.05898786708712578,
        0.017991848289966583,
        0.008299287408590317,
        -0.09251092374324799,
        -0.029535479843616486,
        -0.01199901569634676,
        0.08112023770809174,
        0.06394046545028687,
        0.07522249221801758,
        0.06851839274168015,
        0.01199953444302082,
        -0.029036512598395348,
        -0.006683355662971735,
        -0.004123834427446127,
        0.015462338924407959,
        0.028806759044528008,
        -0.05901926010847092,
        -0.08585343509912491,
        0.011706171557307243,
        0.08197007328271866,
        0.017838023602962494,
        0.05414478853344917,
        0.051060210913419724,
        -0.0057375370524823666,
        -0.0023585506714880466,
        -0.09151723980903625,
        0.12005657702684402,
        0.09596721827983856,
        -0.04853203520178795,
        0.07402688264846802,
        0.026293862611055374,
        -0.02906508930027485,
        0.04432760179042816,
        0.034720830619335175,
        -0.01659223437309265,
        0.020167382434010506,
        -0.010584300383925438,
        -0.12635527551174164,
        -0.024882487952709198,
        -0.021697940304875374,
        0.016059240326285362,
        -0.08416952937841415,
        -0.014199490658938885,
        0.02641267143189907,
        0.10057783871889114,
        -0.07307355105876923,
        -0.06058275327086449,
        -0.00045366722042672336,
        0.008565944619476795,
        -0.049915820360183716,
        0.07109939306974411,
        0.0031706050503998995,
        0.051495298743247986,
        -0.008085545152425766,
        -0.02478460967540741,
        -0.02735011838376522,
        -1.0267750667232734e-32,
        0.03847643360495567,
        0.04252650588750839,
        0.03486098349094391,
        -0.04211903363466263,
        0.0718819722533226,
        -0.025407548993825912,
        0.007950904779136181,
        0.07960166037082672,
        0.07640871405601501,
        -0.049725960940122604,
        0.038803741335868835,
        -0.02797790989279747,
        -0.12076561897993088,
        -0.015833860263228416,
        -0.140641987323761,
        -0.0233431626111269,
        -0.01998763158917427,
        -0.04100135713815689,
        0.04919179156422615,
        -0.0644509345293045,
        0.04698000103235245,
        0.06901825219392776,
        0.030169321224093437,
        0.048186421394348145,
        0.00430171936750412,
        0.05235246196389198,
        0.0819193571805954,
        0.08612864464521408,
        0.008025288581848145,
        0.022397605702280998,
        0.0024112563114613295,
        -0.05298614501953125,
        -0.06819989532232285,
        -0.028047718107700348,
        0.016672877594828606,
        0.012152555398643017,
        -0.01675224117934704,
        0.04364129900932312,
        -0.03729132562875748,
        -0.045494936406612396,
        -0.0036875205114483833,
        -0.009882892481982708,
        0.021168088540434837,
        0.02492108941078186,
        0.0234206635504961,
        -0.021640757098793983,
        -0.02590816654264927,
        0.07739365100860596,
        -0.05012458935379982,
        -0.04845871031284332,
        -0.06987154483795166,
        -0.021212179213762283,
        -0.02451215498149395,
        -0.05846484377980232,
        0.0014634662074968219,
        0.018213454633951187,
        0.007909415289759636,
        0.005599242635071278,
        0.015267807990312576,
        0.004927126225084066,
        0.03915359452366829,
        -0.049719538539648056,
        0.0005960072157904506,
        -0.04358017444610596,
        -0.02468061074614525,
        0.0014529988402500749,
        0.09128902107477188,
        0.03875492140650749,
        -0.003489580238237977,
        0.043667711317539215,
        0.0007318336865864694,
        0.00794261135160923,
        -0.00391725217923522,
        -0.024345988407731056,
        2.7857629902428016e-05,
        0.03076423518359661,
        -0.043057482689619064,
        0.045339129865169525,
        0.016836758702993393,
        -0.038540370762348175,
        -0.028016328811645508,
        -0.015395963564515114,
        0.02984882891178131,
        0.022065337747335434,
        0.09985404461622238,
        0.12316346168518066,
        0.06909846514463425,
        -0.0389677956700325,
        -0.03549390658736229,
        0.11973695456981659,
        -0.010415193624794483,
        0.0371297225356102,
        0.009036630392074585,
        0.12285777181386948,
        0.000916093064006418,
        -6.076079017702796e-08,
        -0.009631345048546791,
        0.0023686045315116644,
        -0.037951648235321045,
        -3.6441365409700666e-06,
        0.02035231702029705,
        -0.031144239008426666,
        -0.01891835406422615,
        0.00045354230678640306,
        0.08601249009370804,
        -0.06079486384987831,
        -0.003379357047379017,
        -0.06339292228221893,
        -0.0469491071999073,
        0.0606706403195858,
        0.043642956763505936,
        -0.035511210560798645,
        -0.05567287281155586,
        0.11970246583223343,
        -0.06105392426252365,
        0.020153425633907318,
        -0.040102340281009674,
        0.05066671967506409,
        0.003912799526005983,
        -0.05932224541902542,
        0.07105706632137299,
        0.0018130438402295113,
        0.07798075675964355,
        0.01351136714220047,
        0.04935460910201073,
        -0.005958993453532457,
        -0.0032717541325837374,
        0.007669230457395315,
        -0.014215418137609959,
        -0.009278965182602406,
        -0.012574940919876099,
        -0.05973196029663086,
        -0.08027251809835434,
        0.022629940882325172,
        -6.888153438922018e-05,
        0.023890800774097443,
        -0.008022485300898552,
        -0.041638221591711044,
        0.015623600222170353,
        -0.00952613539993763,
        -0.07723525911569595,
        -0.07251062989234924,
        0.021151727065443993,
        -0.04126735031604767,
        -0.0009656111360527575,
        -0.011277555488049984,
        -0.06950444728136063,
        0.007647952064871788,
        0.02036955952644348,
        0.011603142134845257,
        0.11603324115276337,
        -0.04489706829190254,
        0.042677972465753555,
        0.036804571747779846,
        -0.03426918387413025,
        0.03796616196632385,
        0.036390047520399094,
        -0.07040278613567352,
        0.010957466438412666,
        0.09203619509935379
    ]
}