{
    "id": "2s59MSm8y4g",
    "title": "iPod Touch Bend Test! - Be gentle with Apples new iPod...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-06-14T18:14:22Z",
    "video_url": "https://www.youtube.com/watch?v=2s59MSm8y4g",
    "category": "Howto & Style",
    "tags": [
        "ipod touch",
        "2019 ipod touch",
        "ipod touch durability test",
        "apple ipod",
        "apple",
        "iphone",
        "android",
        "mobile phone",
        "best phone for kids",
        "Budget phone",
        "smartphone",
        "new iphone",
        "pink iphone",
        "ipod",
        "touch ipod",
        "ipod touch bend test",
        "ipod touch scratch test"
    ],
    "views": 4880718,
    "likes": 110497,
    "comments_count": 9775,
    "description": "Apple just released a new iPod touch! But is it durable? Lets find out. Go to  to take back your Internet privacyTODAY and find out how youcan get 3 months free. Thanks to Express VPN for sponsoring this video. Apple used to be known for always innovating, and being on the leading edge of technology... But lately things have changed. Apples new iPod touch is for a very specific market. But you can see how Apple has intentionally watered down their iPod touch, so it wont hurt their iPhone sales. Personally i think if you HAVE to buy an IOS device... just go with a used iPhone for much cheaper. It'll have better cameras, and can still run off of Wifi. nbd. To parents looking to get their kids something to communicate with? Try a flip phone.   Fix your iPod yourself with parts and guides from iFixit!:   Current iPod Touch pricing on Amazon:   Watch the iPad Pro Bend Test here:  iPhone Xs Max Bend Test:  iPhone Xr Bend test:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://expressvpn.com/jerryrig,",
        "https://www.ifixit.com/Store/iPod?utm_source=youtube",
        "https://amzn.to/2XQFFUL",
        "https://youtu.be/hUBsxCcJeUc",
        "https://youtu.be/oT6VL4x-rHY",
        "https://youtu.be/deNqaM2RnoU",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Apple iPod Touch is alive and well with its new refresh in 2019...well, it's alive for now at least. I've been performing systematic durability tests on hundreds of portable electronics for the past 4 years. And most of the time these electronics survive my tests, but some of the time, like with the iPad Pro, they...you know...don't survive. It's time to see what happens with this dainty feeling, bright pink, 2019 iPod Touch. This video is sponsored by ExpressVPN. Let's get started. [Intro] You might be thinking to yourself, who needs an iPod Touch? I imagine Apple made this for people who don't want to pay for a monthly cell phone plan and are usually still surrounded by Wi-Fi. Or for parents who want to communicate with their kids for cheap. Since the iPod Touch starts at $200 bucks, it's a much better bargain than the thousand dollar iPhones. My Mohs mineral picks can tell the difference between plastic, glass, and sapphire. And during the scratch test on this 4 inch display, we start seeing scratches at a level 6, with deeper grooves at a level 7, on par with the latest iPhones that are using tempered glass displays. That means that the front camera up here is going to be protected from scratches all 1.2 megapixels of it. You heard that right 1 whole megapixel. It's nice to see Apple competing with the flip phones of 2004. There is a plastic physical clicky home button, which is nostalgically refreshing. No complaints here. There is no earpiece though. Apple has to keep at least some separation between the iPod Touch and the iPhones because they both literally do the same things. You can add your own microphone and earpiece with the headphone jack....which is back. Thumbs up for that. It's super interesting that even though Apple tried watering down the iPod Touch as much as possible, this $200 device still does 90% of what a full-fledged thousand dollar iPhone can do. Even the design is all metal. With Wi-Fi phone calling through the headphones, FaceTime, social media messaging, and full-fledged Wi-Fi internet access on the iPod Touch, I could totally see this $200 device being used as a daily driver. The only thing you'd lose out on is the physical phone calls, but those are all Robo spam anyway. The rear camera isn't half bad with it's 8 megapixel sensor, protected by a minor metal camera bump. Apple's not advertising sapphire protection this time around, which is refreshing since their attempt at sapphire is, well, an attempt. I have another cool sapphire video coming out soon, so make sure you're subscribed for that. Looks like this lens has the same scratches at levels 6, 7, and 8, like we've seen on the other iPhones and sapphire version of the Apple Watch. It's the same weird hybrid material that Apple always uses. The pink anodized coloring of the 2019 iPod Touch is pretty brilliant. Pink is actually one of the most calming colors. Some jail cells in Switzerland are even painted pink in order to calm the inmates down. Kind of crazy. There are quite a few flowers that are also pink, including the beautiful roses. One thing you might not know though is that roses, if the flowers aren't picked early, actually have little fruits that grow underneath the flower called hips. Rose hips. And the hips are totally edible, full of vitamin C. They make all kinds of rose flavored products, including rose hip syrup. I haven't tried rose flavored syrup before, but now I totally want to. The secret to rose hip syrup is to start up a flame and boil equal weight of rose hips and sugar and water until the right consistency is reached. Just make sure you don't burn anything. The 326 pixel per inch display of the iPod Touch, which is the same pixel density of the $800 dollar iPhone XR, but who's keeping track? It took about 12 seconds to go black from my flame, but being an LCD, it didn't fully recover. The pixels all eventually came back to life minus the evaporated oleophobic anti-fingerprint coating, of course. It's time for the bend test the ultimate test of construction and build quality. Remember, most phones survive this test just fine. I'll start from the back, and with a subtle flex with no noises or cracks, the first bend of the iPod Touch absolutely destroys the display underneath the glass. There's no external damage, but the internal damage is catastrophic. The screen is broken and the device is unresponsive. Even the power button is not working anymore. This particular bend wasn't even that drastic compared to what other phones and tablets go through during my tests. I'll bend one more time from the front. Everything is still structurally intact, no cracks on the glass or kinks in the metal frame, but the iPod Touch is still dead. It has a flaw internally that can't handle any abuse. The 2019 iPod Touch fails my durability test. What do you think of the iPod Touch? Would you get one? Let me know down in the comments. We'll have to wait and see if that internal design defect becomes a widespread issue or not. But until then, a case will go a long way towards physically protecting the device. Physically protecting your device is important, but so is protecting yourself online. Huge thanks to ExpressVPN for sponsoring this video. A VPN or virtual private network is an app that secures and encrypts all of your personal data online so no one can access your personal passwords or credit card information when you're using public Wi-Fi. Since I travel quite a bit, I've personally used ExpressVPN to access YouTube videos that aren't available in the country that I'm traveling to. Virtual private networks can change the location of where you're accessing the internet from, and makes it appear like you're in a totally different spot. With ExpressVPN you can use 3 devices simultaneously, all for less than $7 bucks a month with a 30 day money back guarantee. To take back your internet privacy today and find out how you can get 3 months for free, click the link in the description. ExpressVPN.com/jerryrig. They even have 24/7 live customer support, which is hard to find these days. ExpressVPN.com/jerryrig. Huge thanks to ExpressVPN for sponsoring this video. Hit that subscribe button if you haven't already. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "iPod Touch",
        "Touch",
        "Apple iPod Touch",
        "iPod",
        "iPod Touch starts",
        "Apple",
        "iPod Touch absolutely",
        "iPod Touch fails",
        "Rose",
        "time",
        "Apple iPod",
        "test",
        "device",
        "Touch starts",
        "sapphire",
        "pink",
        "ExpressVPN",
        "back",
        "iPhones",
        "rose hip syrup"
    ],
    "transcript_entity_values": [
        "Switzerland",
        "3 months",
        "$200 bucks",
        "2019",
        "8 megapixel",
        "$800 dollar",
        "30 day",
        "6",
        "7",
        "8",
        "Instagram",
        "1.2 megapixels",
        "Wi-Fi",
        "jack",
        "326",
        "FaceTime",
        "about 12 seconds",
        "the iPad Pro",
        "6",
        "1",
        "VPN",
        "2004",
        "half",
        "the past 4 years",
        "monthly",
        "this 4 inch",
        "hundreds",
        "90%",
        "XR",
        "Apple",
        "iPhones",
        "daily",
        "first",
        "less than $7 bucks",
        "LCD",
        "today",
        "iPod Touch",
        "thousand dollar",
        "Robo",
        "these days",
        "3",
        "One",
        "YouTube",
        "the Apple Watch",
        "one",
        "200",
        "Twitter",
        "iPod"
    ],
    "transcript_entity_types": [
        "GPE",
        "DATE",
        "MONEY",
        "DATE",
        "QUANTITY",
        "MONEY",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "NORP",
        "DATE",
        "ORDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.04713023826479912,
        -0.007913985289633274,
        0.09729922562837601,
        -0.05627491697669029,
        0.03166789934039116,
        -0.04228461533784866,
        0.048400070518255234,
        0.09090641140937805,
        -0.02019806019961834,
        0.0423334464430809,
        0.10969961434602737,
        0.0145732956007123,
        -0.05575218424201012,
        0.03168710693717003,
        0.07160282880067825,
        -0.002831778023391962,
        0.07703883200883865,
        -0.01690712757408619,
        -0.0478702187538147,
        -0.012274101376533508,
        0.009512593038380146,
        -0.050767943263053894,
        0.05591505393385887,
        -0.0770784243941307,
        -0.0006425270112231374,
        0.07019105553627014,
        0.005413898732513189,
        -0.06606267392635345,
        -0.05743061751127243,
        -0.013655947521328926,
        -0.019080985337495804,
        0.05686142295598984,
        -0.012182872742414474,
        0.009777489118278027,
        -0.007317244540899992,
        -0.13414067029953003,
        0.06605670601129532,
        0.011032314039766788,
        -0.06059517711400986,
        -0.03447060286998749,
        -0.06840723752975464,
        0.029453493654727936,
        -0.05291983112692833,
        0.039089299738407135,
        0.03584198281168938,
        0.0013640789547935128,
        0.05471453815698624,
        0.01725815050303936,
        0.02618280239403248,
        0.03384696692228317,
        0.07353534549474716,
        -0.03054322861135006,
        0.09481829404830933,
        0.011269607581198215,
        -0.018494179472327232,
        0.006754238158464432,
        -0.03240486606955528,
        0.016059840098023415,
        0.06624140590429306,
        0.05857172608375549,
        0.057601701468229294,
        -0.06894771009683609,
        0.006933663040399551,
        -0.01971183530986309,
        0.011914489790797234,
        -0.043395645916461945,
        0.03994685783982277,
        -0.015570656396448612,
        0.015136239118874073,
        0.011305180378258228,
        -0.06211947649717331,
        0.03955875337123871,
        0.059621214866638184,
        0.04579806700348854,
        0.017715511843562126,
        0.007187537383288145,
        0.04806864261627197,
        -0.038404740393161774,
        -0.05177092179656029,
        0.01787317730486393,
        -0.016373271122574806,
        0.004200005903840065,
        0.012365913018584251,
        -0.08965414762496948,
        0.023788394406437874,
        0.009579678997397423,
        -0.0011926779989153147,
        0.024557704105973244,
        -0.05537031590938568,
        -0.015080282464623451,
        -0.011503519490361214,
        0.1084265410900116,
        -0.05817991867661476,
        -0.02996663562953472,
        0.03667360171675682,
        -0.015956945717334747,
        -0.049525659531354904,
        -0.09564429521560669,
        -0.08213553577661514,
        -0.04647378623485565,
        0.024860292673110962,
        0.006177445873618126,
        0.018027378246188164,
        -0.009639336727559566,
        0.013409609906375408,
        -0.09737440198659897,
        -0.059417206794023514,
        -0.030236244201660156,
        0.015594352036714554,
        0.1495661586523056,
        -0.0040413192473351955,
        -0.04447399452328682,
        0.012519089505076408,
        0.017390910536050797,
        -0.019714079797267914,
        -0.04466632381081581,
        -0.08338414877653122,
        0.10671797394752502,
        0.05731167644262314,
        0.014457310549914837,
        0.01551409438252449,
        0.007884976454079151,
        -0.037178728729486465,
        0.002988285617902875,
        -0.0503099225461483,
        0.047625068575143814,
        -0.017867323011159897,
        3.206301901189888e-33,
        -0.05994795635342598,
        0.14290589094161987,
        -0.05264211446046829,
        -0.03491178900003433,
        -0.04292686656117439,
        -0.02621212787926197,
        0.06730432063341141,
        0.10711035132408142,
        -0.06903242319822311,
        0.046869534999132156,
        0.000818792381323874,
        -0.08159954100847244,
        -0.042037177830934525,
        -0.040976714342832565,
        0.10393992066383362,
        -0.017077412456274033,
        -0.10374561697244644,
        -0.09005402028560638,
        -0.006145096849650145,
        0.06327063590288162,
        -0.03966667875647545,
        -0.09862220287322998,
        0.002679213648661971,
        0.01674487441778183,
        0.015503725036978722,
        -0.0856412798166275,
        0.049140363931655884,
        -0.007357173599302769,
        0.09007211029529572,
        -0.014877143315970898,
        -0.10139327496290207,
        -0.056506987661123276,
        0.006837031338363886,
        -0.05960514396429062,
        -0.04093803092837334,
        -0.004915041383355856,
        0.0608973354101181,
        -0.06058832257986069,
        -0.03027786873281002,
        -0.010943422093987465,
        -0.07831671088933945,
        -0.0051379939541220665,
        0.0062776291742920876,
        0.031193025410175323,
        0.10201054066419601,
        0.0011958148097619414,
        -0.0004488312697503716,
        -0.026726964861154556,
        -0.06823477149009705,
        -0.02414964698255062,
        -0.0776498094201088,
        -0.04190649464726448,
        -0.06100087985396385,
        -0.0358443520963192,
        -0.06616067886352539,
        0.0339290127158165,
        0.03826379403471947,
        -0.00105578254442662,
        -0.015489714220166206,
        0.03599368408322334,
        0.005829424597322941,
        -0.043740127235651016,
        -0.06742796301841736,
        -0.00477388733997941,
        -0.07036824524402618,
        0.05939963832497597,
        0.03567449003458023,
        0.06537465751171112,
        -0.03680545091629028,
        0.04895224794745445,
        0.008163036778569221,
        -0.009946642443537712,
        -0.03384967893362045,
        -0.0030432287603616714,
        -0.021249622106552124,
        0.05081363394856453,
        0.028066428378224373,
        0.05302491784095764,
        0.02032879739999771,
        -0.05715688690543175,
        -0.01351473294198513,
        0.05711835250258446,
        0.08109820634126663,
        0.060719843953847885,
        0.04622121900320053,
        -0.05858920142054558,
        -0.04069087654352188,
        -0.07104258984327316,
        -0.044201672077178955,
        0.06642857193946838,
        -0.013078862801194191,
        0.02990224026143551,
        -0.09406600147485733,
        0.01850227639079094,
        0.018891578540205956,
        -4.524600081195867e-33,
        -0.034962043166160583,
        0.026914328336715698,
        -0.04268705099821091,
        0.02690313197672367,
        0.03910829871892929,
        -0.08826608955860138,
        0.021583952009677887,
        0.02024221420288086,
        -0.004907337017357349,
        -0.09855674207210541,
        -0.04697847738862038,
        0.003295100759714842,
        -0.03566114231944084,
        0.0224812850356102,
        -0.009545565582811832,
        -0.022060612216591835,
        -0.04794251173734665,
        -0.05905149132013321,
        0.06825608760118484,
        0.05448151379823685,
        0.007321521174162626,
        0.07409372180700302,
        0.031634215265512466,
        0.03490174934267998,
        -0.0057789054699242115,
        -0.06325457245111465,
        -0.01887889951467514,
        0.0042888750322163105,
        0.031071018427610397,
        0.015968559309840202,
        0.03893144801259041,
        -0.14407119154930115,
        0.07372322678565979,
        0.045434243977069855,
        0.041623249650001526,
        0.01928000897169113,
        0.003429389325901866,
        -0.057656340301036835,
        0.007285475730895996,
        0.006581281311810017,
        0.05626557022333145,
        0.04787705838680267,
        0.0075389607809484005,
        0.006104703526943922,
        -0.00788088794797659,
        0.01255158893764019,
        -0.04182061925530434,
        0.06721200793981552,
        -0.0018996288999915123,
        0.01975686103105545,
        0.06250396370887756,
        0.0357368104159832,
        -0.029856273904442787,
        0.01919676922261715,
        -0.08972643315792084,
        -0.004145295824855566,
        0.09156863391399384,
        -0.0452030748128891,
        -0.003796657780185342,
        0.05770520120859146,
        0.04953928291797638,
        0.018388481810688972,
        0.027345621958374977,
        -0.0035083829425275326,
        -0.05858399718999863,
        -0.0493432991206646,
        0.0714227557182312,
        0.040827665477991104,
        -0.001917984918691218,
        0.07799194008111954,
        -0.03216271102428436,
        0.03409776836633682,
        0.034840621054172516,
        -0.05350581556558609,
        0.037145618349313736,
        0.044571854174137115,
        0.028858046978712082,
        0.058334387838840485,
        -0.012082705274224281,
        -0.011919726617634296,
        0.02416529506444931,
        0.09229272603988647,
        0.044963639229536057,
        -0.015485018491744995,
        0.11845564842224121,
        0.010345379821956158,
        0.03299940750002861,
        -0.015878785401582718,
        -0.04605179652571678,
        0.09283030033111572,
        -0.01994938962161541,
        -0.06821069121360779,
        -0.07935784012079239,
        0.037237927317619324,
        -0.06652572005987167,
        -4.3624236667483274e-08,
        0.04634406045079231,
        -0.03464336693286896,
        0.09725891798734665,
        -0.023267362266778946,
        0.05330456420779228,
        0.026322655379772186,
        0.017803825438022614,
        -0.03548012673854828,
        0.045511893928050995,
        -0.03631014749407768,
        -0.08465177565813065,
        -0.06157803535461426,
        -0.08145514130592346,
        0.10785511136054993,
        0.02662903256714344,
        0.07241639494895935,
        0.020443126559257507,
        0.0051338826306164265,
        -0.008258186280727386,
        0.004855494014918804,
        -0.07890274375677109,
        0.03308551758527756,
        -0.003930095117539167,
        0.023391861468553543,
        0.032400473952293396,
        0.02363216131925583,
        -0.049618467688560486,
        -0.03899893909692764,
        0.007632195949554443,
        -0.011507133021950722,
        -0.005571881774812937,
        -0.0679149329662323,
        -0.01007651723921299,
        0.0006767708109691739,
        -0.05926540493965149,
        -0.0865006297826767,
        -0.09782778471708298,
        -0.004460764117538929,
        0.004877673462033272,
        0.07007983326911926,
        0.009659872390329838,
        -0.009716448374092579,
        -0.03575180098414421,
        0.016278330236673355,
        0.009062046185135841,
        -0.10581663250923157,
        -0.022856049239635468,
        -0.10585963726043701,
        -0.006424913182854652,
        0.08806251734495163,
        -0.0263021569699049,
        -0.10226506739854813,
        0.012697278521955013,
        0.004895130638033152,
        0.07684614509344101,
        0.022929249331355095,
        0.025264766067266464,
        -0.004866354167461395,
        -0.07310523837804794,
        0.0931362509727478,
        0.024070817977190018,
        -0.05772269517183304,
        0.04130652919411659,
        0.12304513901472092
    ]
}