{
    "id": "2w6aYLKlEJw",
    "title": "What's On My Old Mac? (Macintosh IIci) - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2018-12-06T21:00:37Z",
    "video_url": "https://www.youtube.com/watch?v=2w6aYLKlEJw",
    "category": "Science & Technology",
    "tags": [
        "What's On My Old Mac? (Macintosh IIci) - Krazy Ken's Tech Misadventures",
        "What's On My Old Mac? (Macintosh IIci)",
        "Apple",
        "Mac",
        "Macintosh IIci",
        "Mac OS X",
        "macOS",
        "System 7",
        "Kid Pix",
        "Microsoft Office",
        "Vintage",
        "SCSI",
        "SoundEdit 16",
        "HyperCard",
        "History",
        "Computer",
        "Tech",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "68K Processor",
        "Motorola",
        "Old Software"
    ],
    "views": 27202,
    "likes": 651,
    "comments_count": 106,
    "description": "Now that Krazy Ken has his old Macintosh IIci (mostly) working, he decides to explore the hard disk and show you what ancient relics lie within.  Support the show and get in the credits   Want more videos like this?   Subscribe for more tech videos!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures #78 - What's On My Old Mac? (Macintosh IIci)  Krazy Ken is now on Patreon! Pledge now to help support the show and get an opportunity to be in the show's credits!   Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?   Amazon links are powered by the Amazon Associates Program.  #KrazyKen",
    "description_links": [
        "http://patreon.com/krazyken",
        "http://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://patreon.com/krazyken",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- [Krazy Ken] Holy crap, this is cool! I had no idea this was on here. I am really drunk. This one's labeled red. It must be important. Game over. That's a disappointment. (electronic beeping) (upbeat electronic music) Hey guys. How are you all doin'? Really? That's just great. You know what, I'm doing pretty great today too because as a follow-up to the previous Macintosh IIci tech misadventures, I would like to explore what is actually on this hard drive that's connected to it because it has been years since I've actually got this computer up and running. If you have not seen that previous episode, please do that first because now, we're gonna explore the insides of the disk. Time to boot it up. Hopefully it works. Sometimes it's a little fidgety. It's hopefully starting up now. By fidgety, I mean it does a few things. One, the IIci just likes to turn on by itself when it's plugged in. Very rarely does pressing the power button actually do anything. Two, when I shut down the IIci, it doesn't shut down all the way. It tries to turn off, but then the power light which is kind of hidden right now, just rapidly flashes and the fan on the back doesn't stop spinning. It'll spin down then spin up a little bit, then spin down, then spin up a little bit, and it'll just keep going until I yank the power chord. So I think the PSU is starting to be a little wonky. Right now, it's not even turning on all the way. One moment. No joke, I leave for a little bit, let it juice up, and it just magically turns back on. I didn't even press a button. For fun, let's just crash it. There you go. Now the fun part, trying to get it to boot off the external drive 'cause sometimes it's really touchy with how you power on the disk and the computer at the same time. We're gonna see what we can do. Gone around SCSI, reboot IIci. There we go. Welcome to Macintosh. Connectix RAM Doubler installed. The color is on. Sometimes when I reboot this, I lose all the color. This is back when download more RAM was actually a thing. You could install a piece of software that doubled your RAM. I don't know how. It just does. (laughs) I've also adjusted the monitor from the previous episode so now those beautiful, iconic rounded corners are fully included in the nostalgic experience. Here we go. Here's our launcher. We got our window shade, our desktop, and our menu bar. Unfortunately, the speaker doesn't seem to work anymore. I tried turning the sound on an absolutely nothing happens. Control panels, go to sound. I do like how responsive the screen is. I do get a 60 hertz experience with it. Obviously this is a newer screen so that should just work, but the fact that it works with a 1989 computer just fine, that's great. Sound is turned up all the way and I got nothing. Maybe the headphone jack works. I haven't tested that in forever, but maybe it does. I plugged in some Sennheiser headphones in and let's just see if we can get any sound. If we can't, it's not the end of the world. It's just the end of my world. To be honest, I don't even know what that is. (chuckles) That's something. I'm getting nothing so I don't think sound's gonna work on this bad boy. Yes, I do have the launcher customized here. I do have the Apple menu customized from a long time ago. I have my applications here, my control panel's here, documents here, all the shortcuts here, and the whole hard drive here just so we can browse everything just from the menu. Let's see what kind of programs are on here and what kind of documents and files remain on this disk from long ago. As a reminder, I was not the original owner. I believe this computer and the hard drive inside of this thing belonged to a school at one time. Public library or something, who knows, so a whole bunch of teenager's files could be on here. Civil War report or some bullshit. Let's have a look. Boom, magical change. I switched to a different display to try to reduce some of the moire pattern. I'm also picking up a 67 hertz refresh rate from the computer. I don't know if that's because of the converting I'm doing for the video or what. That is very odd. Had to adjust some things to make that work, but we're all good and magical now. In a way, you could put this launcher down here and make it the doc. Now it looks like Mac OS X. Yes, so much so. Do I have other things in here? I have a shut down button! How convenient. I'm not gonna press that 'cause the computer's never gonna turn back on again. Let's explore. MoviePlayer! That's what it was called back then. It was powered by QuickTime, but I guess the program was just called MoviePlayer. I actually have some samples on the hard disk. Man, there's a lot of stuff on here. Youth crime. That sounds fascinating. QuickTime Logo Movie, here we go. Let's check out the frame rate performance of this machine. However, this movie I think plays just fine at a beautiful 12fps or so. Probably less than that. (laughs) That's what we had, QuickTime. There you go. I would actually like to get this working with Adobe Premiere One. I don't know how the performance is gonna be, but I should be able to install Premiere 1.0 on here eventually. It's driven by QuickTime and QuickTime is on here so maybe it'll work. TETRIS, does TETRIS work? Booyah! We got TETRIS. High score was 6,067. Hold down the space bar and just lose. There you go. Game over. That's a disappointment. Hang on, I gotta get my trusty keyboard over here. Oh crap, the cord's not long enough. I'm gonna lose at TETRIS. I think it's J, K. K is rotate. I'm trying to get my bearings of the controls here. Let's start over. Let's do that again now that I have the controls. It's J, K, L, and space. I am so not used to these controls. Kid Pix Studio. We're gonna make some magic. Wow, it works. Too bad I don't have the sound because I'm sure there would've been a whoop there or something. Come on, I clicked it! Let me play it! Come on man. Dude. Surprise me! It gave me very rainbowey looking circle. Let's just make a giant eyeball! That's not freaky at all! No way sir. They have little icons. Pick a movie. Let's see, can we load a movie file in here? Oh! Okay. Whoa, whoa, whoa. I don't remember seeing these before. I am really drunk. This one's labeled red. It must be important. What? I don't remember seeing these before and if I did, I don't remember ever transferring them to this disk. Let's see what's in here. I am sorry person who probably recorded themselves back in the '90s on this computer, or on this hard disk, but you're about to be on a Krazy Ken episode. (laughs) Look at that. What is this, Cinepak pack or Road Pizza? I don't know what kind of video format we're working with here, but we're getting incredible performance. I can't seem to abort this. That's bad. Let's just force quit. (chuckles) Spare us. It just force quit that one part of the program, not the whole thing. Very smart. Let's just Command + Q altogether. I wanna find that file. I wanna see what other movie files we have. Those are actually some movie files I'll be able to use when I test out Premiere. I guess they're already on here, right? Might as well use them. Let's just search drunk, not drunk with a slash, but just drunk. I am drunk, I am really drunk. Let's open up the movies folder. I just love the click of the old Macintosh mouse. You like that? I like it. I just opened up more things. Oh my gosh, I have Anubis Mounter on here, and Microsoft Office '98? What? PowerPoint. I'm just finding more stuff as I go. Picture one. This was probably a screenshot. Hang on, let's take a look. This was a screenshot I must've done, let's see. My scrolling. Just hands-free, just going at it. Disk management programs? Usually Mounter has to do with disks. This must be some kind of disk utility. Hello. INUIT PowerPoint. I think this was a PowerPoint presentation. (groans) Now that's just sad! I may have to get this file off of here and try it on a different computer. Apparently we need a Power PC processor to open up this version of PowerPoint. This was an old presentation I did probably from my Greek mythology class probably back in 6th grade. I kid you not, I walked into the class with a floppy disk and put it in the PC. That's what I did, and I presented. It went over pretty well. Sky end title? Let's see what's on here. Looks like people were making movies. They were having some fun with Video Echo it looks like right there. There's a sky, hence the title. We got that going for us. Look at all that noise and dithering. Hey, we got somebody! Cool. I like the fact that there's old movies on here. It's like we're coming across some ancient treasures. We're on a little treasure hunt. That's what it's like exploring a hard drive, you know? The first broadcast, studio and camera. I'm very curious about what all of this is. Whoa! This looks like a real studio. That looks like the FOX logo. Holy crap. This is cool! I had no idea this was on here. The people who were using this computer must've been filming at a studio. This must've been for a broadcasting class or something. Oh look, it's the set of Wayne's World. Just kidding. Let's try one more. Vince's main forecast. I'm guessing this is weather. For tonight, high, 87. This computer, I don't know if this computer was used at FOX, or the hard drive I should say in the computer at the time was used at FOX, or if this was a class studying broadcasting. Oh my gosh man. It looks like a real studio to me. I don't wanna get too overly detectivey, but that looks like Milwaukee. Cool. That was cool discovery. Let's close that 'cause we gotta give some time to the other programs. I was gonna experiment in Office, but nope. I guess that needs Power PC and we don't got that. So sad. Applications, what else we got on here? I know we got MacWrite II. Let's open this bad boy up. We could probably just start multitasking. We can open up more than one thing at a time, right? We have a multitasking menu over here. We actually do have some other apps running. We could switch to the MoviePlayer, we can hide the MoviePlayer, we can hide other applications, show all applications, kind of like what we have today on macOS actually. Pretty sweet. This was MacWrite II, with a spell check built in. Sweet. Stationary templates, let's do it. I like it. The duck swims on the lake. The duck may swim on the lake, but my daddy owns the lake. chuckles) Quasi-obscure live action film references. How much fun. Let's get out of that. Command + N for no. Don't know if you knew that, but that's a nice little shortcut for some of those things there. Command + N for no. HyperCard. HyperCard I believe is used for building interactive multimedia apps. I think that's what it was. Wow. Holy crap. E. E. What is this, Mini Me? Whoa! This is clearly a human body thing. This must've been a student project. Compact stack, delete stack, sweet. How do we get out of this? Abort. I don't wanna quit HyperCard. Dude, wow. HyperCard 2.2. '87 to '93. I don't know where your HyperCard Two is, but I have your family memories! How do you like that? You can add your own buttons to this card. Congratulations. Icon, background. I can change this or something? Oh shit, I can. Krazy Ken. Now how do I get out of here? There we go man! This is good! That's all I need! That's pretty! Alright, that's enough HyperCarding for now. What shall we do? A spreadsheet? That sounds exciting. Stationary, none. I love it. Let's build a spreadsheet. Here's my budget. We had $2,500 and we spent $500. How do we calcumalate this? We can do the sum of A1 minus A2 and get $2,000. I didn't know that would actually work. I'm impressed with myself. Let's say we spend $2,510. We now have negative $10 left in our budget, and you're fired. Command + N. Boop. No. Let's see what got left on the Notepad. No, upgrade to Mac OS X. I think I'm a little late. SoundEdit. That is something I have not seen in a year and a half plus forever. Let's see what we got. Macromedia. Holy ball sack. They don't even exist anymore. Adobe bought 'em. Little dog loading cursor. That's pretty. Now, I don't have working speakers, the headphone jack doesn't work, I don't have a microphone hooked up, I'm probably not gonna be able to do much with a sound application. That's cool. Let's do slate, whatever it's called, bars and tone. That's usually at 1,000 hertz for sound wave. Let's generate that. Boy, it would be great if we could hear it. Imagine if you will that this is a one kilohertz sound wave playing. (laughs) That is what that would be. We just don't have a way to actually hear it right now unfortunately. That looks good. Let's do a slow one. You have control points even. Yo, that's what I'm talking about. That's my jam. Chime when done, if only we could hear it. (laughs) Good times. Now it should taper. Wow, look at that. My hot new mixtape is now done guys. Get ready to listen to this, biatch. Okay, I see what kind of spectrum it's doing. I don't see a ruler here, but frequency's this way, time is this way, and then the hotter or pinker the sound or the space is, the louder it is so that's amplitude. There's a lot of cool shit in here man. Watch it paint. (laughs) Photoshop. If I remember correctly, I did a demo of this a long time ago and it was a beta copy. This looks really primitive. I'm guessing this is beta .63 or something. .63, October 2nd or February 10th, depending on where you are I guess, 1988. Holy crap. That is something. Open as? Interesting. Let's open. I think I have some Photoshop documents on here? Car. There's car. I thought I had that on the desktop earlier. I thought I saw a file for car here. Guess it got moved. Sweet. Let's try to find a different file. Red John from The Mentalist. I love that, I almost said film. It was a TV show. I think I painted this a long time ago. There's a beautiful bloody smiley face. Let's try to do some stuff. Filter, blur, gaussian blur, wow dude. Star lens. Can we change colors or something? Blend modes. They're under calculate menu I guess. Hue and saturation. If I remember correctly, this is really fun, when you adjust the stuff, it'll actually adjust everything in the interface until you hit preview. Then it will just adjust inside the canvas. I guess that's just because of the computational power. It was quicker to calculate everything on the screen as opposed to just inside the canvas. That's wicked. Save as. Let's see what kind of formats we have. We have Photoshop and PICT File, PIXAR, PICT Resource, MAC Paint, Raw, RIFF, TIFF. I don't know what a RIFF file is, but a TIFF, I know TIFF. This must've been a school report like a journal or something. It looks like it's loading. Dear mother and dad and Craig? What? And Craig, is that the second father? (laughs) Muffins, you got Muffins. It's capitalized so you know it's important. Let me make this bigger for y'all. I have never read this stuff. This is all new to me as well. That was too freaking big. Let's go down a little bit. Let's just scroll through a random part of this story. One of the German moms said that one never does a craft at German birthday parties. Although, spelt wrong, we did at Timo's. Thought it was a good idea when all seven kids decorated party hats patterned after McDonald's variety. That's great. We need to find out who Craig is. He's in danger. Exams. This has gotta be a school thing. The secret menu's there, cool. I just wanted to do that quick. About this Macintosh, see that? If you hold down the option key and press it, it's about the finder and you still get the mountain scene. Beautiful, beautiful, beautiful. The world since 1945. I feel like Bill Wurtz should be reading this or something. This is probably a bill Wurtz script from long time ago. The history of the world since 1945. It was beautiful, until there were some bombs. I totally forgot you can actually adjust fonts and everything for views in the finder. You can also make these icons ridiculously huge, or really, really, really tiny. I like right in between. Let's just crank that font size up. Let's see how ridiculous this looks. Whoa! Whoa! That's just a little big. Times? Oh my gosh. I honestly did not know you could change the label styles in the finder like this. Oh my gosh. This is very Greek looking though. Let's go back to, what was it even on? Geneva I think is the default. Font and size nine. That was a lot of fun. I'm gonna show you what happens when I shut this thing down 'cause this is where it gets a little weird if it does it. I'm gonna just shut it down here. It doesn't always shut down all the way. You'll have to listen kind of carefully. I'm gonna turn off the SCSI disk. I don't know if you can hear this faint sound coming from the back, but I can see it and feel it. The fan's not shutting down all the way and the light on the front is kind of spazzing out. It refuses to turn back on. Typically I have to plug it in and let it sit for five to 10 minutes, and then it just turns back on just fine, by itself actually. I'm willing to bet bad PSU, but it could be anything on the motherboard honestly. Now it's turning back on. Hooray! I was lucky that time. It usually does not respond that quickly. As you can see, we lost color now. Sometimes some of the settings get wiped out. I'm calling this a win. If you guys have any other stories about these old Macs you wanna share, I totally wanna hear them. I love learning about the history some more and just hearing what you guys have to say. Also, if you know of any other classic Mac programs, or maybe obscure Mac programs you want me to try, send a comment my way because I want to install more software. I love it so I'm totally open to your suggestions. Thanks for sticking with me. Catch the crazy and pass it on. (upbeat electronic music)",
    "transcript_keywords": [
        "computer",
        "Time",
        "back",
        "sound",
        "disk",
        "kind",
        "work",
        "power",
        "file",
        "long time ago",
        "thing",
        "long time",
        "cool",
        "hard drive",
        "hard",
        "time ago",
        "Whoa",
        "Movie",
        "drunk",
        "open"
    ],
    "transcript_entity_values": [
        "6th",
        "1988",
        "Macromedia",
        "PSU",
        "12fps",
        "Adobe Premiere One",
        "A1",
        "tonight",
        ".63",
        "Mini Me",
        "February 10th",
        "five to 10 minutes",
        "jack",
        "one",
        "a long time ago",
        "PICT File",
        "Bill Wurtz",
        "nine",
        "Two",
        "PICT Resource",
        "macOS",
        "PIXAR",
        "87",
        "500",
        "MacWrite II",
        "Macs",
        "Mentalist",
        "Connectix RAM Doubler",
        "one kilohertz",
        "years",
        "Red John",
        "Apple",
        "Mounter",
        "more than one",
        "1989",
        "1,000",
        "Geneva",
        "MAC Paint",
        "Wayne's World",
        "Mac",
        "2.2",
        "first",
        "HyperCard",
        "2,000",
        "Timo",
        "Cinepak",
        "Adobe",
        "2,500",
        "10",
        "Macintosh IIci",
        "McDonald",
        "2,510",
        "TIFF",
        "67",
        "today",
        "Krazy Ken",
        "'93",
        "INUIT",
        "seven",
        "FOX",
        "Sennheiser",
        "German",
        "1945",
        "60",
        "Milwaukee",
        "A2",
        "October 2nd",
        "Greek",
        "HyperCarding",
        "IIci",
        "Kid Pix Studio",
        "Mac OS",
        "hertz",
        "Craig",
        "Video Echo",
        "Krazy Ken] Holy",
        "TIFF",
        "Office",
        "Vince",
        "6,067",
        "Mac",
        "Macintosh",
        "MacWrite II",
        "Premiere",
        "Microsoft Office '98",
        "Booyah",
        "J, K, L",
        "SCSI",
        "RAM",
        "MoviePlayer",
        "Yo",
        "Road Pizza",
        "One",
        "the '90s",
        "second",
        "TETRIS",
        "a year and a half",
        "PowerPoint"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "LOC",
        "ORG",
        "DATE",
        "TIME",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "DATE",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "DATE",
        "NORP",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "DATE",
        "PRODUCT"
    ],
    "vector": [
        -0.11338665336370468,
        -0.056979335844516754,
        0.016247471794486046,
        -0.14354725182056427,
        0.03312879428267479,
        0.021694771945476532,
        0.06400755792856216,
        -0.012968567200005054,
        -0.015548651106655598,
        -0.03278422728180885,
        -0.009777618572115898,
        -0.006495922803878784,
        0.0037877396680414677,
        0.020435530692338943,
        -0.041360002011060715,
        -0.036384597420692444,
        0.08024226874113083,
        -0.04433310404419899,
        -0.03913271427154541,
        -0.00811764132231474,
        0.020260898396372795,
        -0.04445381090044975,
        0.03953056037425995,
        0.00027180108008906245,
        0.0045171272940933704,
        0.08575718104839325,
        0.012265707366168499,
        0.02395031228661537,
        -0.05322616174817085,
        -0.04117468744516373,
        -0.02738899365067482,
        0.013701993972063065,
        0.035364050418138504,
        -0.054469503462314606,
        0.04804863780736923,
        -0.04734235256910324,
        0.030223213136196136,
        -0.004525485914200544,
        -0.08817987143993378,
        -0.02715381234884262,
        -0.0498228557407856,
        0.029056649655103683,
        0.00510607473552227,
        0.07688995450735092,
        -0.009371545165777206,
        -0.018105803057551384,
        0.033138882368803024,
        -0.11518137902021408,
        0.08291676640510559,
        0.038958724588155746,
        -0.004085775930434465,
        -0.015072468668222427,
        0.04775599390268326,
        0.00524748582392931,
        0.053753308951854706,
        -0.00457743788138032,
        0.0005473762867040932,
        0.007680672220885754,
        0.06397370994091034,
        -0.01970919780433178,
        0.02874593436717987,
        -0.05456643924117088,
        6.710361776640639e-05,
        0.033800993114709854,
        -0.025248847901821136,
        -0.0283094123005867,
        0.01806887425482273,
        0.06912264972925186,
        -0.009332817047834396,
        -0.11719533801078796,
        -0.04298580810427666,
        -0.030419936403632164,
        0.01343025453388691,
        0.07075969874858856,
        0.002448983257636428,
        -0.04992465674877167,
        -0.0029762766789644957,
        -0.10702932626008987,
        -0.058199573308229446,
        -0.060773834586143494,
        0.03236831724643707,
        -0.03223711624741554,
        -0.013985181227326393,
        -0.009733112528920174,
        0.014164983294904232,
        0.01168359536677599,
        -0.04758544638752937,
        -0.05638943985104561,
        0.02431025169789791,
        0.03336538374423981,
        -0.008229300379753113,
        0.0374438501894474,
        0.1056920662522316,
        -0.05549563840031624,
        0.04336134344339371,
        0.006502182688564062,
        0.002430038060992956,
        0.017696697264909744,
        -0.02833973802626133,
        0.09779556840658188,
        0.013900169171392918,
        0.0707123801112175,
        0.029378008097410202,
        -0.11108356714248657,
        0.007678085472434759,
        -0.04711723327636719,
        0.0060108136385679245,
        0.07820961624383926,
        0.045834194868803024,
        0.043791115283966064,
        0.010514507070183754,
        -0.002909053349867463,
        -0.0490521676838398,
        -0.0036029010079801083,
        0.0699259489774704,
        0.0778835117816925,
        -0.044959500432014465,
        0.017832117155194283,
        -0.01230458915233612,
        -0.05972083657979965,
        0.0867050439119339,
        0.005816855002194643,
        0.0020207439083606005,
        0.062349844723939896,
        0.05974475294351578,
        0.003055865177884698,
        -0.001054257620126009,
        3.173192266089055e-33,
        -0.004445244092494249,
        0.023848820477724075,
        -0.019351646304130554,
        0.001642959425225854,
        0.009706164710223675,
        -0.09716162085533142,
        -0.025334568694233894,
        0.06177889555692673,
        -0.09119629114866257,
        0.022578183561563492,
        0.0005592934903688729,
        0.05818919092416763,
        -0.12133914977312088,
        -0.015331570990383625,
        -0.0002649555099196732,
        -0.01693282462656498,
        -0.06334367394447327,
        -0.042063158005476,
        -0.01375862117856741,
        0.051133256405591965,
        0.046147968620061874,
        0.021117987111210823,
        0.04175041988492012,
        -0.056261833757162094,
        0.0014762874925509095,
        -0.03426387533545494,
        -0.045705970376729965,
        0.0006791751366108656,
        0.11124103516340256,
        0.01965716853737831,
        -0.13439439237117767,
        -0.014174327254295349,
        0.028596550226211548,
        -0.04946013167500496,
        -0.035252492874860764,
        -0.051504433155059814,
        -0.087989442050457,
        -0.08865153044462204,
        0.012144124135375023,
        0.055623527616262436,
        -0.00510427774861455,
        0.038344211876392365,
        -0.06550895422697067,
        0.002629253314808011,
        -0.03150571510195732,
        -0.01288004033267498,
        0.12208128720521927,
        0.02503545582294464,
        0.06222747638821602,
        0.07156755775213242,
        -0.06441056728363037,
        -0.03471870720386505,
        0.0295292679220438,
        0.0036684272345155478,
        -0.08355625718832016,
        0.044392433017492294,
        0.07736875116825104,
        -0.04814600571990013,
        0.04562538117170334,
        -0.026908747851848602,
        0.07306045293807983,
        0.06468307971954346,
        0.07189227640628815,
        0.026652352884411812,
        -0.045831941068172455,
        0.019460897892713547,
        0.015783820301294327,
        0.03999932482838631,
        -0.015471591614186764,
        0.037171944975852966,
        -0.08143897354602814,
        -0.0002068799512926489,
        0.03494986519217491,
        -0.10970984399318695,
        0.05681344494223595,
        -0.006756083108484745,
        -0.10454925149679184,
        0.029561247676610947,
        -0.07376478612422943,
        0.017229190096259117,
        -0.0028151823207736015,
        -0.09138580411672592,
        -0.05925064533948898,
        0.10321164131164551,
        -0.0013774310937151313,
        0.0694345012307167,
        0.09448815137147903,
        -0.005957660265266895,
        -0.00025611845194362104,
        -0.017852162942290306,
        0.005963754374533892,
        -0.06906438618898392,
        -0.038756515830755234,
        -0.024671383202075958,
        -0.024932416155934334,
        -4.021661149776705e-33,
        0.08846314996480942,
        -0.0345408134162426,
        0.0006798600661568344,
        0.015565883368253708,
        0.037810150533914566,
        -0.020397711545228958,
        -0.013807556591928005,
        0.014467564411461353,
        -0.00018008782353717834,
        -0.026284536346793175,
        0.06344737857580185,
        0.03935178741812706,
        -0.09403393417596817,
        -0.03336925432085991,
        0.01602223701775074,
        -0.00960075668990612,
        -0.03762217238545418,
        0.09330681711435318,
        -0.01055539958178997,
        -0.038518987596035004,
        0.03993478789925575,
        -0.022762484848499298,
        -0.015475040301680565,
        -0.006825686432421207,
        0.013722122646868229,
        0.026821449398994446,
        0.06164856255054474,
        0.04116756096482277,
        0.010178864933550358,
        0.04712405428290367,
        -0.05288974568247795,
        0.005051975138485432,
        -0.02298242785036564,
        -0.00963496696203947,
        0.012787631712853909,
        0.06953423470258713,
        0.094908706843853,
        -0.06404493004083633,
        -0.1450849175453186,
        -0.0401749387383461,
        0.07013093680143356,
        0.0702195093035698,
        -0.09271015971899033,
        0.038219280540943146,
        -0.07086192816495895,
        -0.018614035099744797,
        -0.09969141334295273,
        0.08012199401855469,
        0.03365359082818031,
        -0.09067541360855103,
        0.06070566177368164,
        0.006712807342410088,
        0.014662361703813076,
        -0.04422064125537872,
        -0.04629811644554138,
        0.02661801315844059,
        -0.022626005113124847,
        0.10288065671920776,
        -0.002706578467041254,
        0.035065166652202606,
        -0.0767354741692543,
        -0.04344773665070534,
        -0.027471153065562248,
        -0.07507402449846268,
        0.02531614527106285,
        -0.03704490140080452,
        0.023465251550078392,
        0.06131652742624283,
        -0.05372823029756546,
        0.04178695008158684,
        0.017044492065906525,
        -0.026374755427241325,
        0.032442670315504074,
        -0.09605555236339569,
        0.004367887042462826,
        -0.02324759028851986,
        0.02467966079711914,
        0.011648207902908325,
        0.020210329443216324,
        0.022280219942331314,
        0.015989476814866066,
        0.01446983590722084,
        0.014189307577908039,
        0.10440605878829956,
        0.06851974129676819,
        0.08477967977523804,
        0.01640533097088337,
        0.037383101880550385,
        -0.04221143200993538,
        -0.02301991544663906,
        0.01898381859064102,
        -0.003945978358387947,
        -6.322151602944359e-05,
        0.09123672544956207,
        -0.007938126102089882,
        -5.630351651575438e-08,
        -0.025972578674554825,
        0.01788146421313286,
        -0.027441082522273064,
        -0.012658694759011269,
        0.08661354333162308,
        -0.04613278806209564,
        -0.07234306633472443,
        0.023663558065891266,
        -0.041134126484394073,
        -0.036489080637693405,
        0.06462080031633377,
        -0.00799404364079237,
        -0.015177899040281773,
        -0.007603038568049669,
        0.033495355397462845,
        0.0286607313901186,
        -0.03689087554812431,
        0.05244149640202522,
        -0.043630462139844894,
        -0.019063418731093407,
        -0.008733545430004597,
        -0.017955603078007698,
        0.06668072193861008,
        -0.06448423117399216,
        -0.05773374065756798,
        0.09787982702255249,
        0.001594910048879683,
        0.06299438327550888,
        0.0806146115064621,
        -0.003917279187589884,
        -0.013759073801338673,
        -0.03295739367604256,
        -0.07036741077899933,
        -0.026790015399456024,
        0.10183543711900711,
        -0.11235873401165009,
        -0.08012966066598892,
        0.0737868919968605,
        -0.011449145153164864,
        0.05163902789354324,
        -0.06066453084349632,
        -0.13022275269031525,
        -0.008366966620087624,
        0.04419872164726257,
        -0.006133413407951593,
        0.09079807251691818,
        -0.04995260387659073,
        -0.007958738133311272,
        0.01894637756049633,
        -0.054309748113155365,
        0.025185484439134598,
        -0.028367314487695694,
        -0.0253179632127285,
        0.0590670108795166,
        0.0005013768677599728,
        0.010938324965536594,
        0.01771603524684906,
        0.0453331358730793,
        -0.03859884291887283,
        0.032449059188365936,
        0.14578096568584442,
        0.0005098560359328985,
        -0.039449308067560196,
        0.031155647709965706
    ]
}