{
    "id": "3-GdTvkLUFA",
    "title": "The Weird Typewriter-Computer Hybrid: Smith Corona PWP-3200",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2018-05-06T21:08:32Z",
    "video_url": "https://www.youtube.com/watch?v=3-GdTvkLUFA",
    "category": "Science & Technology",
    "tags": [],
    "views": 748038,
    "likes": 21897,
    "comments_count": 2512,
    "description": "You can support this channel on Patreon!  Link below In this very chill and laid back video, we take a look at the Smith Corona PWP-3200, a word processing typewriter from the early 1990's.  There were a number of products like this available, and while they are an interesting bit of technological history, they are really strange.  You can support this channel on Patreon!  Patrons of the channel are what keep these videos coming.  If you're interested in becoming a patron as well, please check out by Patreon page.  Thanks for your consideration!   And thank you to the following patrons! Charlie Quigley, Dakota Williams, Adam Erickson, Kevin Terrell, Tommi Hares, Trevor Smith, Thomas Fuchs, Callum Brieske, Tomas, Chuck Floyd, Eitan Tal, Emil Gilliam, rn Arnarson, Alberto Amatucci, etho624, Chris Giddings, Tomasz Kolinko, Carles Codony, Samuel Plainfield, Jason McMillon, TeaChest Media, Michael Pacheco, Jason Ganiatsas, Mike Gerow, Marc Schroth, Andrew J Thom, Samuel Blakey, Mrpirate707, Frank Harris, Joseph Spiros, Patrick Meister, Sergey Kiselev, Clara Latter, Ashley Grant, Scott Emmett O'Donnell, Tianyu Ge, jeekl, rozboris, Kelly Rose, Paul Fisher, Stephen Vrazel, Applied Science, Peter ford, Sophie Haskins, James Id, Brendan Sheehy, Jay Foreman, Rich Theobald, Kyle Olson, Bryan Reid, Quinton Wilson, Jeremy DeGuzman, Sean Spark, Lucas Hartbarger, Taylor Cuzela, David Lastres, Granger Meador, Jeremy Kitchen, Jason Wellband, Shane Belaire, Paul Emmerich, Matthew Rossi, Paul Craigie, Alex Smith, Nick, Tyler, Paul Williams, Steven Hidy, Fredrik Grufman, Kollin O'Dannel, RJ Kent, Yona, Kevin Strehl, Tony DeSimone, Mike Bailey, Maggie Brown, Howard Kraut, TM, Mark Nicholas Wales, Jason D., T.J. Steckbeck, Pavlo Pravdiukov, Tobias Faller, Marco Anastasi, Peter Byrd, Trix Farrar, Matthew Razza, Mitchel J. Mullin II, Jakob Strande Langgaard, Jan Stavl, Paul Walton, Matt Falcon, Steven First, Denver Alexander, Conor Hennessy Sykes, FinaleGrande, Christopher Dickey, OnlyOneSolutionTBHFam, Matt Sackett, Tim Juchcinski, Wayne Marsh, Ernie Smith, foophoof, Stein Strindhaug, Hank Eskin, Brady Brown, Giacomo Scaparrotti, Winfield Trail, Luke Biddle, Marc Ethier, Joseph Hill, John Semander, Bill Basch, Robert Toth, Magnus Tranum, blouerat, PK, Richard Lindsey, Lars JJ, Patrick Musson, Matt Taylor, Johan Schoeman, Thomas Jew, Josef Citrine, Marcus Schwartz, Ryan Cozzubbo, Christopher Bassett, Julian Rapoport, Ed Hall, Jason Portwood, Jesse Cardone, Michael Snowden, Drew McClain, Boh00711, Jon-Andr Haraldstad, The8TrackKid, Daniel J Schless, Sebi Jecklin, Casey Kikendall, Craig Leverenz, Charlie Hankin, Andres Plaza, Revenge, Matthew Baron, Andr, Gerald Monaco, Tab Patterson, Jason Weathered, h.drew foy, Roger Beal, Gantradies, Chris Hartl, Steve Stone, Brian G. Shacklett, Colton Aubrey Hooke, Paul Mills, Christopher Luna, Kotanu, Brendan Terrett, Techmoan, Mike Mason, Elijah Reeds, Christopher Jett, Justin Talbot, Steven Metcalf, Verysofisticated, Lolucoca, John McLusky, Ashleigh R, Stephen Bell, Logan Beenken, Eric Wood, Stephen Pick, BlancoGrande, Matthew Giraitis, James Ryan, Robert Joscelyne, Ellis M. Eisen, Francis Fisher, Kedar Deshpande, Lukas Komischke, Dave Anderson, Felix Freiberger, Dane Peterson, Brent LaRowe, Aerospyke, Kieran Cox, Hunter Schwisow, Logan Kriete, Rafa Wiosna, Adam D. Ruppe, Audin Malmin, Eric Hansen, Noah McCann, Jason R Scheuren, Rufo Sanchez, The War Academy, Yaniv",
    "description_links": [
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Warning! This video is UNSCRIPTED! The jacket is back because.... because. Uh, so, say it's the 1980's --late 1980's or early 1990's, and you've always wanted to be able to write your letters as a document, save them to a floppy disk to edit later, but you've never been able to afford one of these newfangled personal computers. Well, Smith Corona has got you covered with this: This bad boy is the Smith Corona PWP-3200. It is a typewriter that has a VERY large LCD display and most importantly, a floppy disk drive. Let's take a look at it. Alright so let's get into it. Obviously this was a Goodwill find, as you can see by the sticker, I've had this for a number of years and you'll see a great example of that in just a moment. So really, all this is is a daisy wheel printer (and we'll look a bit more at that in a bit) but it's a daisy wheel printer which has been integrated into a typewriter chassis with a floppy disk drive and a very basic computer. And, well first let's turn it on. Most typewriters don't turn on like this. [various mechanical sounds, like a printer initializing] [beep] Alright, so now we're in. So immediately, what you get is you get this word processing display. You'll notice that there's a switch here that says type and word processing (WP), we're on word processing now so when I type stuff, which is gonna be hard to do with where you are as the camera, you'll see it appears on the screen, the typewriter is not actually typing anything. Now the beautiful thing about this, is that you can write documents on the screen before you even print it, and it warns you if you've made a typo. [fast double beep] It doesn't think \"typo\" is a word, so once you hit the space bar it beeps at you to tell you, you may want to rethink that. Uh, also this is unique to Smith Corona apparently, these functons \"Word Eraser\", there's a Registered Trademark thing on there so I'm guessing it's some \"special feature\". If you hit Word Eraser it just deletes that entire word. And if you hit Code and hit the same key, it will erase the entire line. But what we're really here for is the word processing function. So, on the right-hand side is a floppy disk drive. Now I'm using what used to be Microsoft Works because the floppy drive on here can only read 800kb formatted floppies, so any disk that has been formatted as a high density disk it can't read, because the read/write head is not strong enough to overwrite the high density disk. So if you have an unformatted high density disk it can use it, but if it's ever been formatted it won't work. So this was one of very few 800kb non-high density disks I had, and I am not in need of Microsoft Works for the Apple Macintosh, so I went ahead and used this. So with it in the floppy drive, to get to what's on the disk--all of these little menu items here, you can see they have an underscored letter. To access them you hit \"select\" and hit that letter. So we're gonna go to the disk menu, which is select-D. And, weirdly, you hear it access the floppy but it hasn't actually done anything yet. You actually have to select Save, Recall, Erase, Rename, Join, Directory, or Other. So we're gonna hit recall. And now it brings up a directory of what is on the disk to be recalled. So...just so that way you can see how much of a dork I am, I'm gonna pull up this file. But first it's gonna warn me we have text in memory, do we want to keep it or not? No. This was a homework assignment. When I was in my senior year of high school--I believe that was the year I got this--I'm such a dork that I did some of my homework assignments on this machine. So, if you want to just read this...this is just so incredibly, ugh. It's not great. But, it shows you the power of a machine like this. Now, sadly, and I bet a lot of people who bought these machines were very disappointed in this, the actual computer--I've no idea what system this is--but it is incredibly slow. If you want to just scroll through this, it has to re-draw line by line. And it is not fast. If you hit Code and the down arrow it will redraw the entire screen but even that--this is not fast at all. This is very, very slow. So yeah, it's useful in that you can review an entire document before you print it. But this is not at all what I'd consider to be.... ideal. Of any sort. Want to take a look at my writing when I was in high school? There we go. So how does it actually type stuff? Or print stuff, I should say. Well first, I'm actually going to reboot it here, so I'm gonna shut it off. 'Cause I want to show you what's underneath. So this here is the daisy wheel, this is how it's actually \"typing\". Each one of these little fins has an engraving on it that it uses to punch onto the actual writing surface. This is sort of similar to the IBM Selectric golf ball type thing, but nowhere near as, um, well honestly nowhere near as interesting. And also, these are plastic and I'm always a little curious on how long these actually last. You can see there's a registration point here. And the idea with using the daisy wheels is that you can change the typeface or the font of what exactly it's typing. So the daisy wheel just rests in here, and then it will automatically catch. And this here is the ribbon that it uses to type with. I do not have correction tape for this machine, so... it's just what it is. Sadly it won't let you print anything with the cover open so I'll have to close it, we'll get a better angle for you. Just like any typewriter you load it up with paper before you begin. It's got markings here for what various different paper sizes. The unlabeled one which continues through here is gonna be your standard letter paper (in the US). So, with this machine, if we switch to typewriter mode, which I've just moved the switch into, now it will go as you type. So if I start typing words [sound of typewriter, with typo warning beep] I can't spell typing so it beeped at me. You can see...hopefully...that those words are appearing on the page. [more typing sounds] I don't have any correction tape in here, otherwise I could go and actually correct it back. If I hit \"Word Eraser \" it will attempt to erase it. [rapid triple-clacks as it attempts to erase the type] but there's no actual correction tape in there so it's not doing anything. But the thing is, let me move this up a little bit. We're gonna go back into word processing mode. And I will call up that homework assignment. [floppy drive sounds] So this option here is to print. So if we select to print the document, it gives you the option to setup which I believe changes the margins and stuff like that but we're just gonna go with the standard and hit Print, and it will fire away. I lied. First it's gonna ask us if we want to print the entire document or multiple copies. So we can do, it's giving me little---it's pretty self explanatory so we're just gonna hit return. [a cacophony of clacking and rapid-fire typing sounds begins] OK, so I hit delete to stop the print. But as you can see, it can print (type) faster than anyone could actually type, though honestly not a lot faster. So, of course it's doing it with 100% accuracy, but if you use this thing for printing out an 8 or 9 page letter, that process is gonna be a few minutes. And it's probably, uh, I would not be surprised if this takes well over two minutes to print one page. Which isn't exactly fast. So we'll get a little bit closer here. [typo beep] Oh my goodness. [keyboard sounds as Alec types without speaking because he can't type and speak at the same time] [Another beep] See? Ugh. My goodness. [more speechless typing] [You should follow the words up there ^^^] Oh I hit caps lock. See, if I had done that on a regular typewriter now we would be deep into the woods. But let's just go ahead and show you...remember how I was saying that this is slow? Oh my goodness it's very slow. Say I want to erase \"IF YOU WANT TO BE SURE T\". So in order to do that I could press and hold Backspace or I could hit the \"Word Eraser \" key, let's see that would be onetwothreefour five six, seven times. I'm gonna hit it seven times and watch how long it takes it to actually process that. Still goin'. Yeah that's...that's not exactly what I'd call fast. I don't know about you but, uh, that seems really painful, actually. But to continue with this little demonstration, if we select Disk. What we can do is we can save this. And it just wants you to give it a name. And I still have--Oh! That's an interesting point. We'll get back to that in a second. I'm just gonna call it \"NAMEHJ\". And now it's saved, so if you back to the disk menu, we can recall something. We'll recall \"Palindrome\". Gonna dismiss what's in memory because we saved it to the disk. I really don't know what this document is, but now we can go back to what we were working on. We'll have to scroll down to get to it, though. Again, we'll erase what's in memory. And now, there we're back to what we were doing. Now obviously if you had an actual computer this would be a lot easier. And faster. But if you had a limited budget, these were being sold up until at the very latest--or the very earliest 1993. I saw a listing for these for sale and they were less than $300. So if you were on a tight budget and you wanted to be able to have many of the features of a word processor but didn't have your own computer, something like this might actually be a pretty good idea. What I wanted to go back to was, if you saw when I was saving the file name, it was inserting special characters even though I was just touching numbers. Now, that's because this emulates the way the caps lock key works on older typewriters. A couple odd things about the keyboard you may notice are that comma has got two commas on there, rather than having a special character and the comma like you'd expect today, it's got two commas. Just as this is two periods. That's because on older typewriters it wasn't \"caps lock\" it was \"SHIFT lock\". And that's why this key the default is simply \"lock\" and \"caps lock\" is an option. So if I hit lock, and unfortunately the light in the key does not work, you'll see that I type--oh, apparently I haven't actually turned it on, there we go--as I type it's all capital letters, but the period and comma stay period and comma because there's two of them. But any time I hit a number, I'm gonna get a special character because I don't have \"caps lock\" on I have \"SHIFT lock\" on. So now every key is shifted. That's because in the days of manual typewriters like this, when you hit shift the entire carriage is lowered. That's actually why it's called the shift key because it shifts the carriage down. And you can see when you get close up that the capital letters are all on the...well, let's see I should actually look before I do a closeup...OK. So the capital letters are all at the top of each of these strikers which means that when it's shifted down the top is what hits the paper, and when it's not shifted the bottom is what hits the paper. And because the platen is curved, even when you're, uh, the top will miss the paper because it's farther away from it. So on a typewriter like this when you engage shift lock which is this button here, it simply holds the carriage in the down position. So if you were to type anything, it would always be the top of the row because you're going to have shift lock engaged. The typewriter, because this is mechanical, it can't decide to only print numbers as numbers, it's going to hit \"!, \", #, $, %\" et cetera, just as it's gonna hit the \"@\" vs the \"\" over here. And yes, \"@\" keys were on typewriters like this. That is not something that email created, email uses the \"@\" key because it was a key nobody used. [sound of clickity clackity typing from an old-fashioned typewriter] [again, you should be looking up there^^^] [a lovely gentle ding from the bell] So I hope you enjoyed this video into the Smith Corona PWP-3200 personal word processor. Thanks so much for watching, I do hope you enjoyed the video. Of course thank you to everyone who supports the channel on Patreon. If you're interested in joining the Patreon supporters out there, please feel free to check out this link. I'm gonna have a lot more videos coming soon--I finally was able to clear out my obligations, and what you see behind me is nearly complete. You'll be seeing the full extent of it in the next video. Thanks for watching!",
    "transcript_keywords": [
        "hit",
        "disk",
        "word",
        "Smith Corona",
        "Word Eraser",
        "print",
        "word processing",
        "floppy disk drive",
        "floppy disk",
        "lock",
        "type",
        "hit Word Eraser",
        "typewriter",
        "key",
        "back",
        "high density disk",
        "floppy",
        "SHIFT lock",
        "disk drive",
        "density disk"
    ],
    "transcript_entity_values": [
        "800",
        "Join, Directory",
        "the year",
        "a few minutes",
        "9",
        "five six",
        "Palindrome",
        "IBM",
        "two",
        "UNSCRIPTED",
        "8",
        "1980",
        "Save",
        "Patreon",
        "LCD",
        "today",
        "100%",
        "early 1990's",
        "Microsoft Works",
        "Smith Corona",
        "US",
        "seven",
        "less than $300",
        "first",
        "one",
        "WP",
        "#",
        "Selectric",
        "Erase",
        "a number of years",
        "two minutes",
        "the Apple Macintosh",
        "the days",
        "Word Eraser",
        "First",
        "second",
        "Smith",
        "Disk",
        "NAMEHJ",
        "Alec"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "DATE",
        "TIME",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "PERSON"
    ],
    "vector": [
        -0.12371836602687836,
        -0.07651524990797043,
        0.0036331210285425186,
        -0.05718642845749855,
        -0.0816904827952385,
        -0.021191610023379326,
        -0.011767600663006306,
        0.016162505373358727,
        -0.005311798769980669,
        -0.0011926282895728946,
        -0.01226511225104332,
        0.07012347131967545,
        0.013619625940918922,
        -0.017196329310536385,
        -0.03443662449717522,
        -0.008570973761379719,
        -0.0016603975091129541,
        -0.13608984649181366,
        0.04106821119785309,
        0.031928274780511856,
        -0.035519182682037354,
        0.005717377178370953,
        -0.045736923813819885,
        -0.02197314240038395,
        0.022054357454180717,
        0.03420921415090561,
        -0.04570949077606201,
        -0.05282043293118477,
        0.039759524166584015,
        -0.06438059359788895,
        -0.06860364973545074,
        0.08691688627004623,
        0.03374062478542328,
        0.009371700696647167,
        0.023655643686652184,
        0.005667989607900381,
        0.045454639941453934,
        0.06498167663812637,
        -0.030724123120307922,
        -0.011081180535256863,
        -0.022209802642464638,
        -0.07958867400884628,
        0.011963997967541218,
        0.015871351584792137,
        0.06763029843568802,
        -0.054580289870500565,
        -0.028667530044913292,
        -0.0401606522500515,
        -0.028429266065359116,
        0.039611559361219406,
        -0.08021361380815506,
        -0.041804954409599304,
        0.06607897579669952,
        0.0499449223279953,
        -0.00859173946082592,
        -0.05175730213522911,
        0.05479281768202782,
        0.025647087022662163,
        -0.012532014399766922,
        0.007206028793007135,
        -0.04974796622991562,
        0.017194902524352074,
        -0.10932215303182602,
        0.0033621364273130894,
        -6.046910857548937e-05,
        0.0646376982331276,
        -0.08174170553684235,
        0.03674345090985298,
        0.020254317671060562,
        -0.07819968461990356,
        -0.07919285446405411,
        0.020977452397346497,
        -0.024574538692831993,
        0.00803972315043211,
        0.06784508377313614,
        -0.04103655368089676,
        0.07522785663604736,
        -0.09996682405471802,
        0.040275201201438904,
        -0.020495358854532242,
        0.009013080969452858,
        -0.029551228508353233,
        -0.03922485187649727,
        0.037211548537015915,
        0.01223845686763525,
        0.044051483273506165,
        -0.03869941830635071,
        0.025998562574386597,
        0.015768297016620636,
        -0.005417030770331621,
        -0.06302577257156372,
        -0.013634813018143177,
        0.10167542099952698,
        -0.03673029690980911,
        -0.0736011266708374,
        -0.009317019023001194,
        -0.01373874768614769,
        -0.06475373357534409,
        -0.014724423177540302,
        0.09943003952503204,
        -0.010298172943294048,
        0.034296561032533646,
        0.05776689946651459,
        -0.08983004838228226,
        -0.03674513101577759,
        -0.04584716260433197,
        0.02048160508275032,
        0.03560519590973854,
        0.039925944060087204,
        -0.09072879701852798,
        -0.045084960758686066,
        0.04837402328848839,
        -0.08009088784456253,
        -0.053040653467178345,
        -0.040314409881830215,
        -0.03938405215740204,
        -0.07545211911201477,
        0.019421476870775223,
        0.09211206436157227,
        0.008009455166757107,
        -0.007443479727953672,
        0.03719576820731163,
        -0.05530760809779167,
        0.024525288492441177,
        0.01756722666323185,
        -0.04826769232749939,
        0.015193834900856018,
        8.4074559192916e-33,
        0.06537915021181107,
        0.12604553997516632,
        -0.059165969491004944,
        0.040412917733192444,
        0.06686457246541977,
        0.05358270928263664,
        -0.046253740787506104,
        0.01538767945021391,
        -0.08657491207122803,
        -0.05053569748997688,
        0.047864560037851334,
        -0.03406834229826927,
        -0.012895832769572735,
        0.043834563344717026,
        8.454712769889738e-06,
        -0.07790056616067886,
        -0.08442676812410355,
        0.01380650419741869,
        -0.0759817436337471,
        -0.018503904342651367,
        0.04790709912776947,
        0.09843883663415909,
        0.03995104879140854,
        0.013425312004983425,
        -0.018409626558423042,
        0.023205706849694252,
        -0.00832586083561182,
        -0.009840038605034351,
        0.07820282131433487,
        0.023196233436465263,
        -0.028945015743374825,
        0.012808190658688545,
        -0.019031574949622154,
        -0.024960927665233612,
        -0.0032361610792577267,
        0.0008049754542298615,
        -0.04230942577123642,
        -0.14462131261825562,
        0.03601483255624771,
        -0.007496135774999857,
        -0.037672169506549835,
        0.07253185659646988,
        0.04635446518659592,
        -0.05559109151363373,
        -0.04219858720898628,
        0.0416003093123436,
        0.059885457158088684,
        0.08089568465948105,
        0.02393263392150402,
        0.0028994998428970575,
        -0.015956031158566475,
        0.04571642726659775,
        -0.020948000252246857,
        0.05578251928091049,
        0.020488537847995758,
        -0.07400321215391159,
        0.07147106528282166,
        -0.002973695285618305,
        0.06294219940900803,
        -0.022295555099844933,
        0.07461214810609818,
        0.11744509637355804,
        0.04396821931004524,
        0.018465744331479073,
        -0.10067147016525269,
        0.008368332870304585,
        -0.007589221931993961,
        -0.017318183556199074,
        0.09649207442998886,
        0.022711945697665215,
        -0.00419339956715703,
        0.0156739242374897,
        -0.05594317987561226,
        -0.0800810307264328,
        0.009306595660746098,
        0.0238031093031168,
        -0.029572222381830215,
        -0.007615076377987862,
        0.009182412177324295,
        0.03479466587305069,
        -0.02360326051712036,
        -0.0418802946805954,
        0.011568243615329266,
        -0.03401487320661545,
        -0.03203197568655014,
        -0.09273470938205719,
        0.034770697355270386,
        -0.036667585372924805,
        -0.02151385508477688,
        -0.002859292784705758,
        0.021550601348280907,
        -0.013196263462305069,
        0.04136841371655464,
        -0.002556915394961834,
        -0.01213917974382639,
        -7.591531331390434e-33,
        -0.07047146558761597,
        -0.028009643778204918,
        -0.07323037832975388,
        -0.01141666341573,
        0.002249725628644228,
        -0.06675495207309723,
        0.08518587797880173,
        0.009295259602367878,
        0.07102293521165848,
        -0.051349740475416183,
        0.032682761549949646,
        0.026444029062986374,
        0.012382770888507366,
        -0.07016772031784058,
        0.005262932274490595,
        -0.05720819532871246,
        -0.02707958221435547,
        0.04917178303003311,
        0.02974502183496952,
        -0.04951513931155205,
        0.12275515496730804,
        0.015721740201115608,
        -0.08999966830015182,
        0.0885554701089859,
        0.09043843299150467,
        0.053821951150894165,
        0.00720868818461895,
        0.053044337779283524,
        -0.0026997276581823826,
        0.02942761592566967,
        -0.10969839990139008,
        0.01859896257519722,
        -0.010599585250020027,
        0.09853881597518921,
        -0.025553487241268158,
        0.026757381856441498,
        0.051798317581415176,
        0.09301099181175232,
        0.024251092225313187,
        -0.04307611659169197,
        0.07133892923593521,
        0.06291346997022629,
        -0.026525579392910004,
        0.05142887309193611,
        -0.06646649539470673,
        0.06855186820030212,
        -0.11738251894712448,
        -0.02749645709991455,
        0.005066182930022478,
        0.04892950505018234,
        0.020455336198210716,
        0.040700290352106094,
        -0.0015471085207536817,
        -0.019466783851385117,
        -0.0846652016043663,
        0.011430084705352783,
        0.06878502666950226,
        -0.03387372940778732,
        -0.0339527353644371,
        0.03769537806510925,
        -0.06615572422742844,
        -0.04363221302628517,
        0.06795598566532135,
        -0.03183472156524658,
        0.06695970147848129,
        -0.08623136579990387,
        0.043206147849559784,
        -0.0005362604861147702,
        -0.05535013973712921,
        -0.013157243840396404,
        0.015119065530598164,
        0.055278077721595764,
        0.03276443853974342,
        -0.024263208732008934,
        0.0027239809278398752,
        -0.011668173596262932,
        0.0295830387622118,
        -0.022540602833032608,
        -0.08363217860460281,
        0.012341988272964954,
        0.00223179766908288,
        0.017940741032361984,
        0.041560523211956024,
        0.10910636186599731,
        0.08245918154716492,
        0.05736060068011284,
        -0.03361991420388222,
        0.04856664314866066,
        -0.020669609308242798,
        0.08760388940572739,
        -0.002399323508143425,
        0.08748786151409149,
        0.08491503447294235,
        0.036733560264110565,
        0.028485765680670738,
        -7.017047209956218e-08,
        -0.06931605190038681,
        -0.0672217607498169,
        -0.09053748846054077,
        0.011067753657698631,
        -0.01299096830189228,
        -0.08217541128396988,
        0.006601143628358841,
        -0.11017139256000519,
        -0.0014346858952194452,
        -0.06069384142756462,
        0.03778844326734543,
        -0.03654373064637184,
        -0.028997009620070457,
        -0.040355026721954346,
        0.12942001223564148,
        0.0006474598194472492,
        0.012727184221148491,
        -0.05473189428448677,
        -0.07101589441299438,
        -0.03047795034945011,
        0.06035744026303291,
        -0.006411484442651272,
        0.0038951635360717773,
        0.03184651955962181,
        -0.058278001844882965,
        0.05517369881272316,
        -0.07717873901128769,
        0.000484795484226197,
        -0.009747637435793877,
        -0.017910989001393318,
        -0.03516967594623566,
        0.0642387792468071,
        -0.03812478482723236,
        -0.049167655408382416,
        0.025036994367837906,
        0.04397011548280716,
        -0.04156137630343437,
        0.019705045968294144,
        -0.00943598523736,
        0.10222630947828293,
        0.04131067544221878,
        -0.05459626019001007,
        -0.08890087902545929,
        0.03861258551478386,
        0.08977136015892029,
        -0.04920816048979759,
        -0.006315217819064856,
        -0.05619332939386368,
        0.03570275753736496,
        -0.009995942935347557,
        0.0393977016210556,
        0.04579968377947807,
        0.06184745952486992,
        0.004351889714598656,
        0.03457615524530411,
        0.01748008280992508,
        0.006843169219791889,
        0.014183083549141884,
        0.030066024512052536,
        0.038055166602134705,
        0.07270215451717377,
        0.02020205184817314,
        0.052279479801654816,
        0.033034548163414
    ]
}