{
    "id": "3C-KeTYs0IU",
    "title": "Lenovo's Smart Display: the first Google Appliance",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-07-26T15:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=3C-KeTYs0IU",
    "category": "Science & Technology",
    "tags": [
        "lenovo",
        "google",
        "google assistant",
        "lenovo smart display",
        "display",
        "speaker",
        "android",
        "smart",
        "hey google",
        "ok google",
        "best android",
        "kitchen",
        "kitchen appliances",
        "the verge",
        "google home",
        "operating system",
        "os",
        "amazon echo",
        "smart home",
        "homepod",
        "voice control",
        "tv",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "how to",
        "diy",
        "mkbhd",
        "marques brownlee",
        "apple",
        "review",
        "microsoft",
        "verge",
        "macbook pro 2018"
    ],
    "views": 242429,
    "likes": 5150,
    "comments_count": 462,
    "description": "This Lenovo Smart Display is the first smart speaker with Google Assistant on a screen. It runs Android Things and is a completely new way to use an intelligent assistant. Our question  is it better than the Amazon Echo?  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(gentle music) - The new smart displays with Google Assistant are here and this is the first one, it's the Lenovo Smart Display. It's a Google Home with a screen, sure, but it's something much more interesting than that. It's basically a brand new operating system. So, here's a question, what will Google do now that it has this brand new clean slate to work with? So, what you're looking at here is the 10 inch Lenovo Smart Display. It's $249 and it has a really nice design. It's got this bamboo on the back and sort of a wedge shape. It looks way better than the Amazon Echo Show. You can also get a $199 version that's eight inches but it has a really boring gray plastic back. Honestly though, I'd be happy to have this on my kitchen counter especially if it were standing up like this because it has little feet to do that but yeah, you can see the software is not designed to work with it yet, Google hasn't finished that. The only thing that works on portrait mode is dual video calls. Anyway let's suss out the rest of the hardware here. My favorite feature surprisingly is this little tiny switch right here, which covers up the five megapixel camera. Now people can't drop in on you like they can on the Echo Show but being able to cover up the camera means I'm much more likely to put this thing in my bedroom or my bathroom. I keep a Google Home in my bathroom and it's great so come at me. Anyway, the speaker is fine. It's a 10 watt speaker with two passive tweeters and if you're hoping that this relatively big size means relatively big bass, well sorry. It sounds about the same as any other basic smart speaker. It's nowhere near as good as the Sonos One or an Apple HomePod. A Smart Display can do everything that a Google Home or a Google Home Mini can do but the really important thing here is obviously the screen. This thing runs on all new software called Android Things which is technically based on Android but this is completely different. Now the Core UI is still your voice but you can do stuff with the screen and the main thing you need to know there is swiping in from the left edge serves as a back button. It takes you home, then to your photos and then ultimately to the ambient display. Now when you're on the home screen, you can tap on the weather, look at that. And then there's a bunch of cards that basically serve to show you what you could do and what you can ask. And you'll notice one of these cards is my personal calendar, it does show personal information on this screen. Luckily when you set it up with your phone, one of the little options on there tells you that if you don't want your personal information visible to everybody in your house, you can just leave that off. So one of the things that Google Home can do that's great is it can recognize your voice and set reminders or show you your specific calender stuff but it has to recognize your voice for it to do that and that doesn't always work here. So if I were to sort of speak weirdly, hey Google, remind me to buy cheese on the way home. - I couldn't verify your voice so I can't set any reminders. - Hey Google, what's next on my calender? - Your next event is called dinner. It's today at 6:30pm, located in Rosa Mexicano. - Hey Google, video call Felicia. - Making a video call to Felicia Shivakumar. (device ringing) - Hey, how's it going? - It's dark on my side. (Dieter laughing) - Hey Google, show me pictures of Vjeran Pavic. - Showing your photos. - There he is! What a guy. One of the big things to know about this platform is there's no apps per say, there are some third party integrations. So for example, here's Spotify and there are a handful of other apps that can have stuff displayed on the screen but there's no App Store and the touch UI here is pretty basic. It's pretty basic but it's also pretty pretty. In terms of how software design can look, this is the clearest example of where I think Google is going. Since they didn't have to deal with any of the legacy cruft like they did on Android or Chrome. Google was free to just make what it wanted to make and so what you end up with is very fluid animations, really nice fonts, good drop shadows. It just looks great. If you ask it a how-to question, you might get a Youtube video instead of just like a weblink, so. Hey Google. How do I darn a sock? - Okay, playing how to darn socks on Youtube. - Now, I'm a Youtube TV subscriber which means that I can just use this thing as a television by saying something like, hey Google, watch CNN. - Alright, here's CNN on Youtube TV. - And as soon as this plays, I'm just watching live television. It also works with HBO Now if you ask for a specific show. What it doesn't have is Netflix or Hulu which is kind of a huge bummer but as long as you have a phone that has a cast button like this Android phone, you can still cast stuff to it. You put it all together and this thing makes a really great kitchen TV but it only comes into its own if you're fully bought in to the Google ecosystem. So for example, I'm a Google Photo teaser and having Google Photos in my kitchen on the display is really, really nice. It also makes video calls with Google Duo which is also really good but not that many people use it. Basically I see this thing as a really good Google appliance which is, I don't know, fitting because it goes into your kitchen with other appliances. Oh, hey, one more thing, it also makes regular old phone calls which is kind of a neat feature. Now, my favorite feature of this thing might be recipes. If you start a recipe, it shows each step one by one. It doesn't move to the next step till you ask for it and it stays on the screen. It's really great and I hope that some day Google allows us to put our own personal recipes on the thing cause right now it just pulls the recipes on the web. Actually, that's a lie. My very favorite feature, this is super dumb but my very favorite feature is still timers, because on this thing, the timer stay on the screen the whole time. You can even set multiple timers and they all stay on the screen. It's not how the Echo showed us it, it's not how the HomePod does it. It's the most basic thing and Google actually got it right. Everything here is pretty simple, it's clean and it's fast. If you aren't put off by the price, having a screen on a smart speaker is definitely better than not having one. If you already bought in to an Amazon Echo ecosystem, should you switch to this thing? Nah, probably not but if you're using Google Assistant, I think this thing is great. It's my favorite smart speaker with a display by a long mile even though I still hate, hate saying hey Google compared to just saying Alexa. More important to me, I hope that Google expands its platform to work with more third party software fairly soon. Maybe the most fascinating part of this smart display is that just by adding a screen to the Google Assistant, they've completely changed how the Google Assistant answers questions so if you ask it how to do something, you might get a Youtube video. If you ask it for photos, you might get your photos instead of something from the web. If you ask it for a recipe, you'll get a webpage completely remade into step-by-step instructions for you. It's the culmination of everything Google has been trying to do with Search. Making it give you answers instead of just sending you to webpages. So, what happens when Google actually does have a clean slate to work with? Turns out it makes a really great Google appliance. Hey everybody, thanks so much for watching and I don't know if you've noticed but we're in a whole different space here. We're gonna build out a set, we've got this cool graphic behind us. Also, you should check out vox.com's video on road diets. I've been really into smart scooters lately and a road diet is a really good way to make roads safe for those scooters so take a look at it.",
    "transcript_keywords": [
        "Google",
        "Google Home",
        "hey Google",
        "Google Assistant",
        "Lenovo Smart Display",
        "thing",
        "Google Home Mini",
        "Home",
        "Smart Display",
        "screen",
        "smart",
        "hey",
        "Lenovo Smart",
        "Display",
        "Show",
        "Youtube",
        "Google appliance",
        "video",
        "great",
        "Google Photo"
    ],
    "transcript_entity_values": [
        "HBO",
        "Google Photo",
        "Google Home",
        "Amazon Echo",
        "Android",
        "one",
        "third",
        "Felicia",
        "10 inch",
        "the Core UI",
        "Echo",
        "249",
        "Vjeran Pavic",
        "Google Duo",
        "five megapixel",
        "today",
        "Alexa",
        "Android Things",
        "Google",
        "Spotify",
        "Youtube TV",
        "the Echo Show",
        "10 watt",
        "Dieter",
        "Hulu",
        "a long mile",
        "the Amazon Echo Show",
        "Felicia Shivakumar",
        "Youtube",
        "UI",
        "CNN",
        "eight inches",
        "two",
        "Lenovo Smart Display",
        "One",
        "Google Photos",
        "199",
        "Google Home Mini",
        "Sonos",
        "Netflix",
        "HomePod",
        "first",
        "Rosa Mexicano"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "EVENT",
        "QUANTITY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "EVENT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "GPE"
    ],
    "vector": [
        -0.09071893990039825,
        -0.04217717796564102,
        0.024937083944678307,
        -0.09486425668001175,
        0.03679147735238075,
        0.021315788850188255,
        -0.017129728570580482,
        -0.00798035692423582,
        -0.03514852002263069,
        -0.043129339814186096,
        0.049955617636442184,
        0.02656576596200466,
        0.002205772092565894,
        -0.03772164136171341,
        0.015875818207859993,
        0.026109209284186363,
        0.20217563211917877,
        -0.1645263284444809,
        -0.004157238639891148,
        0.015987645834684372,
        0.003773364471271634,
        0.026871005073189735,
        0.03762044757604599,
        -0.007816676050424576,
        0.022611455991864204,
        0.039414599537849426,
        0.04321852698922157,
        -0.06658271700143814,
        -0.03484524413943291,
        -0.030347241088747978,
        0.01232414972037077,
        0.01959923468530178,
        0.08435611426830292,
        0.021022766828536987,
        -0.09140907973051071,
        -0.08696414530277252,
        0.042474471032619476,
        0.006160425487905741,
        -0.012512829154729843,
        -0.10419633239507675,
        -0.02043372578918934,
        -0.12854865193367004,
        -0.05460086837410927,
        -0.053094662725925446,
        0.0012746003922075033,
        -0.04467632621526718,
        -0.03020339272916317,
        -0.0795893669128418,
        0.04655752703547478,
        -0.045356933027505875,
        -0.05128374323248863,
        -0.0594589002430439,
        -0.014410068280994892,
        0.0003392361104488373,
        -0.09177514910697937,
        0.10200979560613632,
        0.022988982498645782,
        0.04185710474848747,
        0.04964432492852211,
        0.05816154181957245,
        0.06530550122261047,
        -0.053634002804756165,
        0.04489787667989731,
        0.05522998422384262,
        0.05870584025979042,
        -0.02157803252339363,
        -0.011774822138249874,
        -0.09349266439676285,
        0.023441487923264503,
        -0.06628191471099854,
        0.009069889783859253,
        0.046687010675668716,
        0.04877404123544693,
        -0.10831142216920853,
        -0.006910413037985563,
        -0.03057870641350746,
        0.014204172417521477,
        -0.07760407775640488,
        -0.010043910704553127,
        0.0542844794690609,
        -0.01550989504903555,
        0.04748332127928734,
        -0.05297069624066353,
        -3.497855504974723e-05,
        -0.013762018643319607,
        -0.0736132562160492,
        -0.011921904981136322,
        -0.0356067419052124,
        -0.012128448113799095,
        -0.04364491254091263,
        0.02995045855641365,
        -0.020486539229750633,
        -0.03605159744620323,
        -0.004162779543548822,
        0.015817884355783463,
        -0.016936151310801506,
        -0.027958139777183533,
        -0.09636454284191132,
        0.012366593815386295,
        0.03451722115278244,
        0.030477670952677727,
        0.04654761776328087,
        0.04453745856881142,
        -0.06736256927251816,
        -0.01078510470688343,
        -0.05274432152509689,
        -0.031317077577114105,
        0.07639825344085693,
        0.05442549288272858,
        0.017847709357738495,
        -0.005428877659142017,
        -0.0121192941442132,
        -0.021292926743626595,
        0.0558987557888031,
        -0.04779814928770065,
        -0.028575118631124496,
        -0.004491179250180721,
        0.010226540267467499,
        0.10985882580280304,
        0.03276319429278374,
        0.08027743548154831,
        -0.0571722574532032,
        -0.0038316675927489996,
        -0.015555910766124725,
        0.019109347835183144,
        0.0476902611553669,
        -0.11904802918434143,
        -2.2662091562451427e-34,
        0.03815092518925667,
        0.05549902468919754,
        -0.01871659979224205,
        -0.11032544821500778,
        0.023705115541815758,
        0.07086913287639618,
        -0.05997062847018242,
        0.07020628452301025,
        0.031500447541475296,
        0.0019408989464864135,
        0.006170445121824741,
        0.06320276111364365,
        -0.029937399551272392,
        0.0007528421119786799,
        -0.025629587471485138,
        -0.049825519323349,
        -0.08573883026838303,
        0.0827968418598175,
        -0.041038013994693756,
        -0.023003455251455307,
        0.04415326938033104,
        -0.023725759238004684,
        0.0013965921243652701,
        -0.08342383056879044,
        0.02371944673359394,
        0.044966429471969604,
        0.03313779458403587,
        0.02285391464829445,
        -0.04762359708547592,
        0.03208015859127045,
        -0.0570257194340229,
        -0.07230023294687271,
        -0.03016529232263565,
        -0.01996595412492752,
        -0.04984995350241661,
        -0.06336751580238342,
        -0.032544806599617004,
        -0.0945393517613411,
        0.05604114383459091,
        -0.03844606876373291,
        -0.10171011835336685,
        0.06902124732732773,
        -0.0007724611205048859,
        0.030499882996082306,
        0.005140629597008228,
        0.07314030826091766,
        0.06781700253486633,
        0.017551278695464134,
        0.014776285737752914,
        0.04612201079726219,
        -0.06605520844459534,
        -0.049251262098550797,
        -0.020908940583467484,
        -0.0010563322575762868,
        0.0018657720647752285,
        -0.08575692027807236,
        0.05064079165458679,
        0.004619060084223747,
        0.06352958083152771,
        -0.04777421057224274,
        0.035082943737506866,
        0.054815247654914856,
        -0.008402595296502113,
        0.018476536497473717,
        -0.0508042573928833,
        0.046853698790073395,
        0.048832278698682785,
        0.024880092591047287,
        -0.029177958145737648,
        0.00017012696480378509,
        0.003994522616267204,
        -0.00866448599845171,
        0.054097145795822144,
        0.015595109201967716,
        -0.029913775622844696,
        -0.023732345551252365,
        0.02873421087861061,
        -0.014770670793950558,
        0.03884689137339592,
        -0.015968656167387962,
        0.013335865922272205,
        0.010200146585702896,
        0.030642123892903328,
        -0.002130826935172081,
        -0.009453445672988892,
        0.032770462334156036,
        -0.010783293284475803,
        -0.05207251012325287,
        -0.05903879553079605,
        -0.037463605403900146,
        -0.04566238448023796,
        0.01911267265677452,
        -0.0003419139829929918,
        0.050843801349401474,
        0.026568617671728134,
        -7.777479292998157e-34,
        0.0018381201662123203,
        -0.004062070045620203,
        -0.013361162506043911,
        -0.010894980281591415,
        0.06062273681163788,
        -0.07362240552902222,
        0.0940469428896904,
        0.02339930087327957,
        -0.048781223595142365,
        0.024862663820385933,
        -0.023823194205760956,
        0.038141537457704544,
        -0.022955792024731636,
        -0.0041327341459691525,
        0.016742391511797905,
        0.02483430877327919,
        0.06885033845901489,
        -0.14954045414924622,
        -0.049185026437044144,
        0.021428320556879044,
        0.02737225592136383,
        0.057565171271562576,
        -0.040876761078834534,
        -0.0003539270837791264,
        0.030243515968322754,
        0.008544297888875008,
        0.00015705663827247918,
        0.010772278532385826,
        -0.015752527862787247,
        0.05925839766860008,
        -0.022988347336649895,
        -0.045374173671007156,
        -0.006235572975128889,
        0.025625169277191162,
        0.07628326117992401,
        -0.030374731868505478,
        0.037667952477931976,
        -0.07446441054344177,
        0.0016863513737916946,
        -0.023550909012556076,
        0.10027119517326355,
        0.028192946687340736,
        0.027412619441747665,
        -0.03645714744925499,
        0.02120932750403881,
        0.03160494938492775,
        -0.05386950448155403,
        0.03491809219121933,
        -0.06197317689657211,
        -0.04982927814126015,
        0.035565849393606186,
        0.06973627954721451,
        -0.034940455108881,
        -0.03583476319909096,
        -0.042216937988996506,
        -0.02711276151239872,
        0.009732207283377647,
        0.06354985386133194,
        -0.04720572754740715,
        -0.010995437391102314,
        0.01844959333539009,
        -0.01633557677268982,
        -0.010505248792469501,
        -0.06407924741506577,
        -0.028083128854632378,
        0.08032902330160141,
        0.094377301633358,
        0.06496699154376984,
        0.029165487736463547,
        0.0007984722033143044,
        0.04649578779935837,
        -0.07734853029251099,
        0.06385583430528641,
        -0.07061273604631424,
        0.013269039802253246,
        0.13029588758945465,
        0.05947783961892128,
        -0.09032411128282547,
        -0.015830187126994133,
        -0.017887316644191742,
        0.004929137881845236,
        -0.031485021114349365,
        0.12964509427547455,
        -0.03576677665114403,
        0.06433029472827911,
        0.03672478720545769,
        -0.024513134732842445,
        -0.009805836714804173,
        -0.037795715034008026,
        0.06932633370161057,
        -0.06239207461476326,
        0.07008650153875351,
        -0.03108956292271614,
        0.043671730905771255,
        0.023403095081448555,
        -4.237111994598308e-08,
        0.01263182982802391,
        -0.05195627734065056,
        0.09307387471199036,
        -0.020230166614055634,
        0.010375735349953175,
        -0.0727934017777443,
        0.03148208186030388,
        -0.0033090561628341675,
        0.033494845032691956,
        -0.04647933691740036,
        -0.014905192889273167,
        -0.13894450664520264,
        -0.03433063626289368,
        0.1091151162981987,
        0.0643032044172287,
        0.0732593834400177,
        -0.019425317645072937,
        0.019022969529032707,
        -0.03223871439695358,
        -0.013034369796514511,
        0.02020222321152687,
        0.028494518250226974,
        0.05861448124051094,
        -0.06370154768228531,
        -0.029440144076943398,
        0.045088689774274826,
        -0.0015444651944562793,
        0.06760267168283463,
        -0.018819931894540787,
        -0.029466181993484497,
        -0.05888338014483452,
        -0.00387839344330132,
        -0.04385683685541153,
        0.03621724247932434,
        0.05874300375580788,
        -0.057271748781204224,
        -0.06689181923866272,
        -0.05605059117078781,
        0.006058439612388611,
        0.052553437650203705,
        -0.009438700042665005,
        -0.05081780627369881,
        -0.056294336915016174,
        0.034017644822597504,
        0.08538935333490372,
        -0.028002647683024406,
        0.0495670922100544,
        -0.08227739483118057,
        -0.004928766284137964,
        0.11869560927152634,
        0.02599085308611393,
        -0.04728701710700989,
        0.011649789288640022,
        0.016649985685944557,
        0.0957174226641655,
        -0.031596921384334564,
        0.05116535350680351,
        -0.006547524128109217,
        -0.04381334036588669,
        0.14233243465423584,
        0.07152170687913895,
        0.015075746923685074,
        0.01696150191128254,
        0.04726961627602577
    ]
}