{
    "id": "3DyFq4_ZSgY",
    "title": "The Most Expensive Budget Laptop - HP Pavilion Aero 13",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-10-02T18:28:32Z",
    "video_url": "https://www.youtube.com/watch?v=3DyFq4_ZSgY",
    "category": "Science & Technology",
    "tags": [
        "HP",
        "Pavilion",
        "Aero 13",
        "13 inches",
        "Laptop",
        "Budget",
        "PC",
        "Personal Computer",
        "Notebook",
        "Affordable",
        "Higher End",
        "AMD",
        "Alex",
        "Performance",
        "Best Bang For The buck",
        "Efficient"
    ],
    "views": 624276,
    "likes": 21691,
    "comments_count": 1021,
    "description": "Check out the Volta GIGA today at   The HP Pavilion Aero 13 isn't exactly budget, or at the very least, it's in the upper band in that spectrum, BUT if you can shell the extra $, it might be an option you should consider.   Buy HP Pavilion Aero 13 On HP (Paid Link):   Buy Dell XPS 15 On Amazon (Paid Link):  On Best Buy (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/r91ag",
        "https://geni.us/Ar4A",
        "https://geni.us/woJp",
        "https://geni.us/BLtT6L",
        "https://geni.us/syhAd",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- You guys asked for it. Guess what? This laptop, it's under $1,000. Now, I don't know if I'd call it a budget laptop. It's maybe like a budget premium laptop or a very expensive budget laptop, either way. It's the HP Pavilion Aero 13, and I think it's gonna be pretty good. You can see right here, right off the bat. Not quite as fancy as other laptops. Not that it really matters. That's kind of spooky how it just stood up like that. So what do we get? Set up instructions, easy, a little power brick, this thing's tiny, actually, 45 Watts. So yeah, this is not a beast. You're not gaming on this. - [David] How about solitaire? - Oh, this thing would be a solitaire beast. - [David] Yes. - Here it is, the HP Pavilion Aero 13 and wow. That is light. So this is an all magnesium chassis, which is like, that's the first thing that's like, that's not a budget laptop kind of thing. You don't put magnesium into a budget laptop. Although it feels really good. Like I think it's under a kilogram. So LG gram spec. Nice, and we get very solid bit of IO, especially given how small this is. So we have headphone right there, USB type C. It's not Thunderbolt. This is an AMD machine. So no Thunderbolt yet. USB type A, full-size HTMI. Another type A port, and there's our power input. Yeah, that's everything that you need right there. Should we just get into it? - Yeah. - No, sponsor. - Ooh. - Thanks to Volta for sponsoring today's video, clean up your desk and declutter your workspace with the Volta Giga charger, which can charge four devices simultaneously. It comes in either 131 or 200 Watt configurations and it's compatible with all fast charging capable devices. They have expressed worldwide shipping with a 30-day-money back guarantee. Learn more about the Volta charger at the link below. Actually just before we get into it, this right here is the natural silver color. I think I'd go with the white one. It's a $20 addition, but the ceramic white one looks really sick. Anyway, let's do it. That's a laptop. We're gonna move this just so you know that it's not that flexing, but this is an extremely stiff feeling chassis, definitely not budget feeling, much more premium. The only thing that would give away that you didn't spend over $1,000 on this are the bezels, it's just plastic. And we also get a 16 by 10 display. Love to see that, love to see that it's making its way down. What should we look at first, David? what do you wanna see? - How's the screen? - How's the screen? The screen looks pretty good. So it's a matte finish, 400 nits peak brightness. There are two options. So you can either choose from 1,200P or 1,600P, 1080P and 1440 except you know, taller. So this is a 1920 by 1200 version. I feel like you're gonna have a really hard time on a display of this size, noticing the difference between quad HD and just normal, full HD. I guess we're getting this close maybe. Let's just try the keyboard. (keyboard clicking) I can confidently say that this is an excellent keyboard. It feels basically identical to what you would find on HP's Envy lineup, which is awesome. Those are all A-plus keyboards. So good job, HP. Actually, this whole thing just feels like an Envy. HP is really bad for doing this where they make like the Spectre lineup, and they're like, oh, it's our new premium one. And they make the Envy. That's a lot cheaper, but pretty much just as good. And then you're like, okay, why the hell would you ever buy a Spectre? And now we have this Pavilion Aero that is basically a lighter Envy 13. And I don't know why, based off of my small amount of use of this you would spend the extra money for the Envy. Actually I can think of one. This doesn't have a touch screen, but like getting eight-core AMD processor, AMD Ryzen 7, 5,800 U, eight-core 16 threads, wicked. That one is like $140 option, and when you're in a computer like this one, do you wanna spend the extra amount? I'd probably stick with the Ryzen five one like six cores is going to be enough, but I would go for the 16 Gigabytes of memory. I find that I use up eight really fast these days. As for SSD it's 500 Gigabytes and AMD Radeon graphics, pretty solid overall, also the track pad's good, I've just been using it here. They've used basically all of the space that they have here. There's no speakers up top to move the keyboard down, and with the 16 by 10 display, there's just more space, especially on a 13-inch-laptop, that gets you a lot more keyboard space, moving just that little bit of extra display on the bottom there. Just looking at it here, this is a very nice display. It does cover full SRGB. So, you know, unless you're a professional photo editor, it's gonna it. Speakers though. (upbeat electronic music) Okay, that's pretty good. I would say that I'm impressed. It's going to get wrecked by the XPS 15, but like it's a much larger and much more expensive laptop. Like I don't know what to expect really for a 13 inch device, that's not obscenely expensive. That's very respectable. What even are they? Ah, they're down firing, cool. (upbeat electronic music) Yeah, it's not even close, but I wasn't expecting it to be, I'm not even going to bother looking at it, but the display on the XPS is a lot nicer. But then again, the display on this XPS is a $400 addition, which is more than half of what this entire laptop costs. So like yeah, absolute beast. People have been speaking for a long time about how incredible the Aero 13 is at solitaire and they were right. One thing that we needed to check. So this one right here has a real tech Wi-Fi 6 card, but there are two options. One's a two by two, and one's a one by two. The additional cost to go to the two by two is not very much, but it'll make your wifi experience way better. So let's just hop into the configurator real quick, figure out what exactly you want to buy. 'Cause I think that's a lot more important on this guy than a lot of other laptops. 'Cause you can kind of screw yourself with a couple of these options. So first of all right now it's on sale. $80 off makes a big difference in a laptop like this, 669.99, very nice, yeah. First of all, ah, we won't bother changing the color, because like whatever. Now we get to choose between two different processors, the Ryzen 5 5,600 U and the 5,800 U, I would go for the 5,600 U. But the 16 gigabyte version, which adds $50, now have the full HD versus 1440 P display, 30 bucks, do you think you'd go for it, David? - [David] For 30 bucks? - Yeah, I probably would as well, realistically. 256 gigabytes, I feel like isn't enough right now. Now this is the one that annoys me. What do you see that's wrong with this image, David? - [David] I don't know. - There's no keyboard backlight, terrible. It's a $20 option. - What? - And we come down here, two by two. You want to get that. So all in all this $669 laptop, one you have that's spec'd as you want is $830, 800, if you got a 10 ADP, pretty respectable, like you're getting 16 gigabytes of RAM, half a Gigabyte storage, half a Terabyte of storage, I mean, this is obviously better. If Dell is going to send me a like $2,500 laptop, I'm going to use it and be like, this is a good laptop. For the vast majority of what I do, I'd probably be happier with this laptop, because it is so much lighter. Yeah, if you're looking for a budget premium laptop or a very expensive budget laptop, that feels kind of like a premium laptop, but isn't quite as good looking, but in almost ignorable ways, the HP Pavilion Aero 13 is your best bet. Oh also it has a fingerprint reader right there. That'll probably be nice. It also has a webcam. Actually, let's see. This webcam had a little bit of trouble at first. Oh, it's having trouble again. But like this isn't bad at all. It's only lightly blowing up my face, I'm like, there's no detail back here, but like whatever, this is a very challenging situation. So good job HP. I'll use the Dell briefly just so you guys know how terrible it is. Just complete butt on the side of the XPS, well, there you go, HP Pavilion Aero 13. If it's what you're looking for, I would say get it. It seems pretty good to me. So anyway, hit like, get subscribed, and just have a great day. Especially you, David. - Aw, you too, Alex. - Give your dog a treat.",
    "transcript_keywords": [
        "laptop",
        "Pavilion Aero",
        "budget laptop",
        "good",
        "budget",
        "budget premium laptop",
        "Aero",
        "yeah",
        "expensive budget laptop",
        "display",
        "pretty good",
        "Pavilion",
        "thing",
        "premium laptop",
        "Envy",
        "pretty",
        "David",
        "XPS",
        "AMD",
        "Gigabytes"
    ],
    "transcript_entity_values": [
        "1080P",
        "USB",
        "more than half",
        "5,800",
        "Alex",
        "200 Watt",
        "131",
        "830",
        "10",
        "AMD",
        "669.99",
        "80",
        "U",
        "gram",
        "Dell",
        "today",
        "16 gigabytes",
        "15",
        "HP",
        "30-day",
        "140",
        "half a Terabyte",
        "Watts",
        "13 inch",
        "David",
        "1,600P",
        "1440",
        "first",
        "AMD",
        "ADP",
        "two",
        "256 gigabytes",
        "2,500",
        "between two",
        "AMD Ryzen 7",
        "XPS",
        "16 gigabyte",
        "eight",
        "SSD",
        "Spectre",
        "400",
        "1,200P",
        "Wi-Fi 6",
        "1920",
        "RAM",
        "one",
        "20",
        "a great day",
        "Envy 13",
        "under $1,000",
        "13",
        "LG",
        "HP Pavilion Aero 13",
        "1200",
        "30 bucks",
        "45",
        "AMD Radeon",
        "six",
        "Volta",
        "First",
        "Ryzen",
        "half",
        "Volta Giga",
        "One",
        "over $1,000",
        "13-inch",
        "5,600",
        "1440",
        "IO",
        "500 Gigabytes",
        "669",
        "16",
        "four",
        "400",
        "Gigabyte",
        "the 16 Gigabytes",
        "this Pavilion Aero",
        "50"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "QUANTITY",
        "LOC",
        "QUANTITY",
        "PERSON",
        "DATE",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "DATE",
        "EVENT",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "LAW",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "LAW",
        "ORG",
        "MONEY"
    ],
    "vector": [
        -0.06440635025501251,
        0.0352521650493145,
        0.0022983637172728777,
        -0.02845011092722416,
        0.06177307292819023,
        0.02586318925023079,
        -0.006301813758909702,
        0.040757887065410614,
        0.06382834166288376,
        0.048615433275699615,
        -0.0030136716086417437,
        -0.022782426327466965,
        0.017002806067466736,
        -0.0210068691521883,
        0.04749537631869316,
        -0.01732473261654377,
        0.11266132444143295,
        -0.0876738652586937,
        0.039785418659448624,
        -0.013154230080544949,
        -0.02656165510416031,
        -0.01933923363685608,
        0.04679716378450394,
        -0.021613582968711853,
        0.0022467433009296656,
        -0.011812059208750725,
        0.06228119134902954,
        -0.07134538143873215,
        -0.05113900452852249,
        -0.027630601078271866,
        -0.022694632411003113,
        0.05099499970674515,
        -0.04808327183127403,
        0.01421899814158678,
        -0.0013676618691533804,
        -0.04222201928496361,
        0.02968760021030903,
        -0.06517095863819122,
        0.011153563857078552,
        -0.05734916776418686,
        -0.06290901452302933,
        -0.014652101323008537,
        -0.020265696570277214,
        0.009625625796616077,
        0.032255806028842926,
        -0.10436813533306122,
        -0.021258190274238586,
        0.02054499089717865,
        0.03364451229572296,
        0.08145766705274582,
        0.014718669466674328,
        -0.07974334061145782,
        0.02356579340994358,
        -0.003385190386325121,
        -0.02412104234099388,
        -0.017067918553948402,
        -0.014545770362019539,
        -0.041692107915878296,
        0.032339755445718765,
        -0.05633074417710304,
        -0.0035745168570429087,
        -0.12998294830322266,
        -0.06894441694021225,
        0.02811921387910843,
        -0.05611255392432213,
        -0.06876126676797867,
        0.0012535500572994351,
        0.03407536447048187,
        -0.05417891964316368,
        0.028678586706519127,
        -0.0012404447188600898,
        0.047273967415094376,
        0.06636764854192734,
        -0.019006505608558655,
        -0.022389234974980354,
        0.055220503360033035,
        0.09458398818969727,
        -0.050801269710063934,
        0.06315451860427856,
        0.0718504935503006,
        -0.014496461488306522,
        0.020322687923908234,
        -0.06190117076039314,
        0.005148458760231733,
        0.062274277210235596,
        -0.0858491063117981,
        -0.006879505701363087,
        0.01333424262702465,
        -0.025526894256472588,
        -0.06842406094074249,
        -0.01644790731370449,
        0.07801121473312378,
        -0.00855115707963705,
        0.013652236200869083,
        -0.0014788195258006454,
        0.012126188725233078,
        0.05406855791807175,
        -0.04727592319250107,
        -0.0024811599869281054,
        0.017715375870466232,
        0.047101788222789764,
        0.07210946083068848,
        0.13585491478443146,
        -0.044472094625234604,
        -0.09756091237068176,
        -0.07591422647237778,
        0.019778937101364136,
        0.04263673350214958,
        0.051063697785139084,
        -0.04333179444074631,
        -0.09706217795610428,
        -0.03358975052833557,
        -0.08269955962896347,
        -0.05354078859090805,
        -0.00981901679188013,
        0.0507587194442749,
        -0.021998710930347443,
        -0.06054112687706947,
        0.10805400460958481,
        0.0010484133381396532,
        -0.02024667337536812,
        -0.030369717627763748,
        -0.005205102264881134,
        0.05074503272771835,
        -0.0008751560817472637,
        -0.016414878889918327,
        -0.08694195002317429,
        1.1197216438150817e-33,
        0.015402838587760925,
        0.06805641949176788,
        -0.08322390913963318,
        -0.09780857712030411,
        -0.005823695566505194,
        0.08269936591386795,
        0.0341968908905983,
        -0.03403059020638466,
        -0.06589595973491669,
        0.022602073848247528,
        -0.07199602574110031,
        0.018781419843435287,
        -0.09099046885967255,
        0.015987325459718704,
        0.07047372311353683,
        -0.053824201226234436,
        -0.015794534236192703,
        0.02376537397503853,
        -0.023267678916454315,
        -0.04950523376464844,
        0.021983345970511436,
        -0.02536376565694809,
        0.05772661417722702,
        -0.03965054079890251,
        0.020307060331106186,
        -0.026535680517554283,
        -0.013633890077471733,
        -0.015283753164112568,
        0.03300818055868149,
        0.03873860836029053,
        -0.02407405525445938,
        -0.035880375653505325,
        0.030540920794010162,
        -0.026213862001895905,
        -0.05339718237519264,
        -0.04350758716464043,
        -0.08522771298885345,
        -0.07504971325397491,
        0.07233339548110962,
        -0.03758225589990616,
        -0.07504021376371384,
        0.09070803970098495,
        -0.010238553397357464,
        -0.09420916438102722,
        0.020691903308033943,
        0.03082774206995964,
        0.01711813360452652,
        0.0179305337369442,
        0.040865909308195114,
        0.006220375653356314,
        -0.08346077799797058,
        0.012434849515557289,
        -0.029726656153798103,
        -0.06338946521282196,
        -0.05513804033398628,
        0.010590164922177792,
        0.088016077876091,
        0.02426932379603386,
        0.08078964054584503,
        0.05596032738685608,
        -0.011850596405565739,
        0.012133371084928513,
        0.024264546111226082,
        -0.034975502640008926,
        -0.03513741120696068,
        0.026367908343672752,
        0.04230416566133499,
        0.07220901548862457,
        -0.1110508143901825,
        0.04514596611261368,
        -0.0035157795064151287,
        -0.0102039510384202,
        0.05505954846739769,
        -0.002901962259784341,
        0.03485655039548874,
        0.02588745579123497,
        -0.0602823868393898,
        -0.04879092425107956,
        -0.034759193658828735,
        0.0348966121673584,
        -0.05651579797267914,
        0.06439131498336792,
        -0.03235970810055733,
        0.01789972558617592,
        0.003542892402037978,
        0.029874900355935097,
        -0.05476832017302513,
        -0.0014893502229824662,
        -0.04121660441160202,
        0.03215177729725838,
        -0.03529740124940872,
        -0.017724022269248962,
        -0.07436493039131165,
        0.009469534270465374,
        -0.016889311373233795,
        -3.5364303060687115e-33,
        -0.041300080716609955,
        0.010603430680930614,
        0.030246054753661156,
        0.04784626141190529,
        0.06866780668497086,
        0.0012518815929070115,
        0.01580054685473442,
        -0.001319881179369986,
        0.00480416277423501,
        -0.038725174963474274,
        -0.0442824549973011,
        0.09968918561935425,
        0.007114223670214415,
        0.06087249889969826,
        0.039253223687410355,
        0.008156286552548409,
        -0.07072488963603973,
        -0.09382116049528122,
        0.05078444629907608,
        -0.02778862603008747,
        0.024378353729844093,
        0.001099663320928812,
        -0.032364845275878906,
        0.04570522531867027,
        -0.002313074888661504,
        -0.007959945127367973,
        -0.05173527076840401,
        0.007710247300565243,
        0.02797771617770195,
        0.06294523179531097,
        -0.080997534096241,
        0.011451086029410362,
        0.011978807859122753,
        0.04073738679289818,
        0.0745629072189331,
        0.00025352297234348953,
        0.060455918312072754,
        0.03411824628710747,
        0.046269215643405914,
        0.04074211046099663,
        0.06878354400396347,
        0.02114194445312023,
        0.04495210200548172,
        0.003978302702307701,
        0.09471231698989868,
        -0.03056257776916027,
        -0.0563749335706234,
        -0.09385602176189423,
        0.022501224651932716,
        0.012886970303952694,
        -0.06066650152206421,
        -0.03439813479781151,
        0.017179932445287704,
        0.03984915837645531,
        -0.018237410113215446,
        -0.06995045393705368,
        -0.07633839547634125,
        0.09894871711730957,
        0.04164006561040878,
        -0.07422661781311035,
        -0.04114195331931114,
        0.04686814174056053,
        -0.044907573610544205,
        0.05577877163887024,
        -0.03272904455661774,
        0.015681514516472816,
        0.07745328545570374,
        0.008068467490375042,
        -0.003184365574270487,
        -0.0255770031362772,
        -0.06242558732628822,
        -0.012743947096168995,
        -0.03973545506596565,
        -0.07136532664299011,
        -0.07561640441417694,
        0.03406450152397156,
        0.06375733762979507,
        0.015476283617317677,
        0.06648531556129456,
        0.01577802374958992,
        0.06932607293128967,
        0.03611154109239578,
        0.02636347897350788,
        -0.1101621761918068,
        0.05928381159901619,
        0.022055476903915405,
        0.0018067203927785158,
        -0.059205278754234314,
        -0.11389999091625214,
        0.02806810848414898,
        -0.012797155417501926,
        -0.0024465552996844053,
        -0.006094327662140131,
        -0.0007409067475236952,
        0.013889055699110031,
        -5.363527577628702e-08,
        -0.006984498351812363,
        -0.0077857268042862415,
        0.07754289358854294,
        0.018842369318008423,
        0.0446971096098423,
        -0.12284613400697708,
        0.08435232937335968,
        0.008396015502512455,
        0.09120507538318634,
        0.05010059103369713,
        0.06722971051931381,
        -0.14929215610027313,
        0.0525948628783226,
        -0.016146423295140266,
        -0.03500891849398613,
        0.010558943264186382,
        -0.04766952246427536,
        0.05979766324162483,
        -0.012986882589757442,
        -0.02340586483478546,
        -0.028777267783880234,
        0.03922709450125694,
        0.11161728203296661,
        0.01857234351336956,
        0.05818704143166542,
        0.019053813070058823,
        -0.06188277155160904,
        -0.0399191677570343,
        0.0711907297372818,
        -0.054595764726400375,
        -0.07105351984500885,
        0.018041254952549934,
        0.04877017065882683,
        -0.07595186680555344,
        0.00790900643914938,
        -0.0647244080901146,
        -0.02971928007900715,
        0.028946949169039726,
        0.08148431032896042,
        0.05712516978383064,
        0.00785789079964161,
        -0.052133407443761826,
        -0.07472239434719086,
        -0.06718835234642029,
        0.06513148546218872,
        0.023190859705209732,
        -0.034955669194459915,
        -0.09630830585956573,
        0.00876830704510212,
        0.1288660615682602,
        -0.03429194912314415,
        -0.048163075000047684,
        0.06196749582886696,
        -0.015248266980051994,
        0.009331104345619678,
        0.03307646885514259,
        -0.03494606167078018,
        0.10833922773599625,
        0.024764299392700195,
        0.048291947692632675,
        0.06964020431041718,
        -0.12526708841323853,
        -0.03199600428342819,
        0.04279301315546036
    ]
}