{
    "id": "3gawhT7L9xE",
    "title": "Galaxy Buds Pro Review: semi-pro",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-01-15T16:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=3gawhT7L9xE",
    "category": "Science & Technology",
    "tags": [
        "samsung galaxy buds pro",
        "galaxy buds pro",
        "samsung",
        "the verge",
        "verge",
        "wireless earbuds",
        "galaxy buds",
        "galaxy buds live",
        "airpods pro",
        "airpods",
        "galaxy buds pro review",
        "surface buds",
        "jabra elite 85t",
        "galaxy buds pro vs galaxy buds live",
        "galaxy buds pro vs airpods pro",
        "anc",
        "active noise cancellation",
        "galaxy buds mic test",
        "samsung galaxy buds pro vs apple airpods pro",
        "bose qc earbuds",
        "samsung galaxy buds pro unboxing",
        "buds pro",
        "galaxy buds plus",
        "becca farsace",
        "samsung galaxy buds"
    ],
    "views": 324822,
    "likes": 10507,
    "comments_count": 672,
    "description": "The Galaxy Buds Pro are Samsungs newest wireless earbuds. They come in Phantom Silver, Phantom Violet, and Phantom Black and are available today for $200. With solid microphones, a slim design, and decent battery life, these earbuds have kept all of the good parts of the Galaxy Buds that have come before them. But what earns them their Pro title are all their extra features.  Becca's music playlist:  Spotify -  YouTube Music -   Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://spoti.fi/39t4adm",
        "http://bit.ly/2N7sGcK",
        "http://bit.ly/3igT8fm",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- What does it mean to be a Pro earbud? You want that decent sound quality. You want a solid Bluetooth connection. You want good battery life. You want all of the fundamentals that Samsung has truly nailed in their previous Buds, but you want a little bit more. Well, with the Samsung Galaxy Buds Pro, it seems like Samsung's saying, \"Get you a bud that can do it all.\" (chic electronic music) So what does Pro mean to Samsung? Well, for starters, it means active noise cancellation, and Samsung claims that these buds can block out 99% of external background noise at 118.43 hertz, which honestly that means almost nothing to me, but in practice, it means that it blocks out a decent amount of outside noise, just not all of it. I sat under some subway tracks to really put it to the test, and I brought along the AirPod Pros and the Bose QuietComfort Earbuds as well. And out of these three earbuds, the Galaxy Buds Pro, well, they definitely let through the most outside noise. And the only difference between ANC being turned on versus ANC being turned off is really that the low-level hums, they disappear when you turn it on. And although I could still slightly hear the trains passing over me, once I had some music playing, the outside world, it did disappear, just not as much as it does with the Bose QuietComforts or the AirPods. What I found more impressive though was the Ambient sound mode, and that's the mode where it's like letting outside noise in. Now on the Galaxy Buds+, the Ambient mode sounded real tinny and really robotic. And they have taken a huge leap forward with the Pros on this. The Pros, they're just much clearer and they can even amplify sounds around you. Super helpful for when you're on the train and you need to hear some announcements or when you're totally listening in on someone else's conversation. I said it. You know you do it too. We're all guilty. Within the Galaxy Wearable app, you can adjust ANC levels along with those ambient sound levels. And the app also has these EQ settings, touch control settings, the ability to block touch controls, a find your bud feature, and voice detection settings, which that voice detection, that is where you start to feel some more Pro features in these earbuds. When the earbuds detect your voice, they automatically go into Ambient sound mode and turn down your music. Samsung claims that it uses all of the mics and a Voice Pickup Unit, which is basically an accelerometer that detects jaw movement to detect when you start speaking. And once your voice isn't detected for several seconds, and you can choose 5, 10, or 15 seconds, the earbuds go back into the previous state of noise cancellation. And the good news is this feature works real well. Once I start speaking, the outside world is immediately let in, and I'm no longer screaming over the music that only I can hear. And although I fundamentally believe that it is incredibly rude to have a conversation when you have earbuds in with someone else, this feature is actually super helpful for running into the bodega and just needing to talk quickly to someone at the counter or when a neighbor is passing by and I wanna say hello. I loved it, and I always had it on. The Sony 1000XM4 headphones, they also have this auto speech detection feature, but Samsung is among the first for earbuds. And now that I'm using this feature all the time, I just really wish that all of my other buds had it too. But these are earbuds, so let's talk about what Pro audio quality means. The Buds Pro utilize a dual-driver design with 11-millimeter woofers and 6.5-millimeter tweeters in each earbud. Those are bigger than what we saw in the Galaxy Buds+ and the results are a full sound that will be clear and crisp in most listening situations. The bass isn't overpowering, and the highs and lows are separated enough as to not be mushy. And the sound quality was comparable to the AirPod Pros, but not as crisp as the Bose QuietComfort Earbuds that have quickly become my go-to buds for great audio quality. The Buds Pro sit in the ear with a twist. The silicone tip pressed firmly in the ear canal by pushing against the back of my ear. Now the Buds Live, for example, when they're in your ears, they kind of, like, rest against the top of the back of my ears, and the Buds Pro, well, they kind of rest against the bottom of the back of my ears, which was a really big problem for me and this conch piercing. Now I get DMs often from people with ear piercings that are like, \"Hey, I'm interested in these earbuds, but I don't know if they're gonna work with this piercing.\" And typically, it's never a problem. I think with the Surface buds, I had a slight problem with my conch piercing, and also with the Jabra Elite 85ts. Those, I had a small problem with. I do understand this is a personal problem though. And the right earbud fit perfectly, really snug, and was really secure. And then because these earbuds are real thin, they don't stick out very far from your ear, so they don't get caught on things, which also helps with them staying in my ears. There are three different sized silicone tips in the box for finding that perfect seal. The buds are also IPX7 water resistant, which means that even if these accidentally took a swim, they'd be totally fine. But if you know me, you know there is one feature of great importance to your buds, and that's the mic. Samsung claims the Buds Pro have a new Wind Shield technology, that when coupled with the less protrusive shape and especially designed chamber with mesh over one of the outside mics, well, it makes for a real clear audio, even in windy situations. All right, first up, we have the Bose QuietComfort Earbuds. They are not sleek in any way, shape, or form, but they have really good audio quality. All right, these are the Jabra Elite 85ts. They absolutely don't stay in my ears very well, but they have solid connection and they also have some pretty good sound quality. And then we have the AirPod Pros. And just so you know, I connect all of these headphones via Bluetooth to my MacBook Pro. And then I record using Audio Hijack, which is a free program that I would highly recommend. And these are the Galaxy Buds Pro. Now Samsung really improved the audio quality last year in the Pluses, and it was really decent on the Live as well. But how is it here? Turn on the fans. Now we got some wind going. How do they sound with just a little bit of wind? Like, if you're biking or, I don't know, using Limited Convertible. So I'm really interested to hear how these sound because they also stick very far out of my ears, so they're catching lots of wind right now, lots of wind. Okay, the AirPod Pros, they got these long stems, they're naturally catching the breeze, I'm catching the breeze. Not gonna lie. It's getting a little chilly in here. Okay, so how does this sound with a breeze? It's a really windy day in New York, I wanna talk to my buds, can they still hear me? Is the Wind Shield technology good? Wait, I gotta do with this one. Ah. That's enough. Samsung, your Wind Shield technology, it's pretty damn good. I don't think you have the best mic overall without wind, but I'm really impressed because once you put wind on the AirPods, everything got super tinny and robotic, but man, this Buds Pro, that's kind of cool. Each earbud has a 61-milliamp power battery, and Samsung claims that you will get five hours of music playback with ANC on and eight hours with ANC off. And then four hours of talk time with ANC on and five hours with ANC off. I found this all to be true. And in my time with the Buds, it was right around hour four of continuous use that my ears needed a break. All in all, battery life is on par with other noise-canceling earbuds. Their traditional charge is in the 472 milliamp hour case, and a five-minute quick charge will get you an hour of playback time with ANC off. And this case is gonna look real familiar because the Buds Live had the same exact case, down to the USB-C port around back. It's super light, small, very pocketable, and it wirelessly charges. And then there's a few other Pro features that are very AirPod Pro-esque, you could say. The AirPod Pros, they can automatically switch between Apple devices, and now the Galaxy Buds Pro can hop between Samsung phones and tablets based on which one you're using. There's no multipoint though, so they can only connect to one device at a time. But for a person that uses many different devices from many different manufacturers, this wasn't really super helpful to me. There's also 360 Audio with Dolby Head Tracking, which is absolutely Samsung's take on spatial audio that's in the AirPod Pros and the AirPod Maxs. Unfortunately, you'll need a device with One UI 3.1, which the S21 has, but I don't have yet, so I wasn't able to test this feature out. In concept though, you'll get like a really immersive soundscape experience when you're watching content in an app that has Dolby audio. So the Galaxy Buds Pro, they come in Phantom Silver, Phantom Violet, Phantom Black, and are available today for $200. With solid mics, slim design, decent battery life, these earbuds have kept all of the good parts of the Galaxy Buds that have come before them. But what earns them their Pro title, it's all those little extra features. It's the voice detection, the more useful active noise cancellation, 360 Audio. Building on the solid foundation Samsung has created with its previous earbuds, the Galaxy Buds Pro, they definitely feel more refined and they bring the right amount of extra features to earn them a Pro title. But the competition is like absolutely better than ever. And the AirPod Pros, they still have the best ANC in the game, and those Bose QuietComforts, oh my gosh, they, like, really bring an incredible audio experience to a super small form factor. So I think it's gonna take just a little bit more if these buds really wanna stand out. Dear Samsung, can you please support Facebook Messenger in your notification readout and also in your edge lighting? It's like super frustrating. Maybe I am one of the few people, I know I'm not, that uses Facebook Messenger as much as I do, but, like, just would really appreciate that. So (chuckles) thank you, XO, Becca Farsace.",
    "transcript_keywords": [
        "Galaxy Buds Pro",
        "Buds Pro",
        "Galaxy Buds",
        "Buds",
        "Pro",
        "AirPod Pros",
        "Samsung Galaxy Buds",
        "Pros",
        "Samsung",
        "Earbuds",
        "Galaxy",
        "Buds Pro utilize",
        "Buds Pro sit",
        "Bose QuietComfort Earbuds",
        "ANC",
        "Pro features",
        "audio",
        "Buds Live",
        "Pro audio quality",
        "Wind"
    ],
    "transcript_entity_values": [
        "four hours",
        "Surface",
        "last year",
        "XO",
        "IPX7",
        "New York",
        "ANC",
        "five-minute",
        "one",
        "Audio Hijack",
        "around hour",
        "Apple",
        "several seconds",
        "S21",
        "four",
        "Phantom Silver",
        "the Buds Pro",
        "Becca Farsace",
        "99%",
        "three",
        "the Samsung Galaxy Buds Pro",
        "118.43",
        "today",
        "the Bose QuietComfort Earbuds",
        "and eight hours",
        "3.1",
        "Wind Shield",
        "the Galaxy Buds",
        "5",
        "Ambient",
        "15 seconds",
        "the Galaxy Buds Pro",
        "hertz",
        "Limited Convertible",
        "Samsung",
        "the Buds Live",
        "five hours",
        "MacBook Pro",
        "472 milliamp hour",
        "One",
        "Dolby",
        "AirPods",
        "an hour",
        "Buds",
        "Phantom Black",
        "Facebook Messenger",
        "200",
        "Bose",
        "Pros",
        "Sony",
        "11-millimeter",
        "Voice Pickup Unit",
        "Bose QuietComforts",
        "first",
        "1000XM4",
        "Jabra Elite 85ts",
        "6.5-millimeter",
        "Phantom Violet",
        "the Galaxy Buds+",
        "10",
        "61-milliamp",
        "the Galaxy Buds+",
        "Buds"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "FAC",
        "CARDINAL",
        "LOC",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "TIME",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "FAC",
        "DATE",
        "QUANTITY",
        "LOC",
        "WORK_OF_ART"
    ],
    "vector": [
        -0.13853560388088226,
        -0.03239666670560837,
        0.019647210836410522,
        -0.04362614452838898,
        0.031735822558403015,
        0.02510768175125122,
        0.08182963728904724,
        0.06984355300664902,
        -0.014186195097863674,
        0.0036996614653617144,
        0.01891624927520752,
        -0.005273453891277313,
        0.05572172999382019,
        -0.03642567992210388,
        0.06753739714622498,
        0.009136340580880642,
        0.07474467903375626,
        -0.04046082869172096,
        -0.013693916611373425,
        0.03193956986069679,
        -0.06127694621682167,
        0.048222415149211884,
        0.0882982462644577,
        0.06110642850399017,
        0.020696764811873436,
        -0.007793594617396593,
        -0.02105247788131237,
        -0.054488297551870346,
        -0.04654194787144661,
        -0.03930477052927017,
        0.02005271427333355,
        0.09787428379058838,
        0.036909863352775574,
        -0.05846954137086868,
        -0.010601899586617947,
        -0.1257239431142807,
        0.0413152351975441,
        -0.008948462083935738,
        -0.02768196165561676,
        -0.018560120835900307,
        -0.023096203804016113,
        0.02384016662836075,
        -0.02465548738837242,
        -0.03097359836101532,
        -0.0017787264660000801,
        -0.05360867828130722,
        0.0358269065618515,
        -0.04662124440073967,
        0.011973478831350803,
        0.01903616264462471,
        0.03068302385509014,
        -0.04116116464138031,
        0.008727909065783024,
        0.0586741678416729,
        -0.027591247111558914,
        0.03801780566573143,
        0.0017941567348316312,
        0.03522953391075134,
        0.03537636250257492,
        0.02022526226937771,
        0.028717288747429848,
        -0.06593523919582367,
        0.032898496836423874,
        -0.025605080649256706,
        -0.009127683006227016,
        -0.008211802691221237,
        0.009824295528233051,
        0.10016924142837524,
        0.021797489374876022,
        -0.007980325259268284,
        -0.09711815416812897,
        0.09955068677663803,
        0.03506680950522423,
        -0.0015526054194197059,
        0.053642407059669495,
        0.05506110191345215,
        0.0530928298830986,
        -0.011837431229650974,
        -0.0671534538269043,
        -0.0005188375362195075,
        -0.030068006366491318,
        -0.021466601639986038,
        -0.0731431245803833,
        -0.02553921565413475,
        0.05138725787401199,
        -0.026015745475888252,
        0.019502054899930954,
        0.03254814073443413,
        -0.13017933070659637,
        -0.0066376845352351665,
        -0.026713624596595764,
        0.12189153581857681,
        -0.0758354589343071,
        -0.05242438614368439,
        0.013148401863873005,
        0.02480694279074669,
        -0.0744936540722847,
        -0.06455186009407043,
        0.03125644847750664,
        0.031999338418245316,
        0.055161356925964355,
        -0.025129854679107666,
        0.04512900486588478,
        -0.11988458782434464,
        0.016633862629532814,
        -0.08432706445455551,
        -0.06968214362859726,
        0.019060255959630013,
        0.0699281096458435,
        0.06041257083415985,
        0.06586484611034393,
        -0.039415113627910614,
        -0.04412127286195755,
        -0.005238398909568787,
        -0.04683426767587662,
        0.09976749122142792,
        -0.05138378590345383,
        0.07932636141777039,
        0.05672910809516907,
        -0.04680204391479492,
        0.001074533793143928,
        -0.004639430902898312,
        -0.04911934211850166,
        -0.1059463769197464,
        -0.05443739891052246,
        0.020289743319153786,
        -0.07580484449863434,
        2.8387380419992053e-33,
        0.024125736206769943,
        0.04010230302810669,
        -0.020744478330016136,
        0.002051242394372821,
        -0.014477214775979519,
        -0.023770231753587723,
        -0.14380645751953125,
        -0.003509403672069311,
        -0.008382787927985191,
        -0.002013368997722864,
        -0.07444290816783905,
        0.025761384516954422,
        -0.05218297615647316,
        0.02297484129667282,
        0.034078750759363174,
        -0.09541637450456619,
        -0.110545314848423,
        -0.0025608206633478403,
        -0.06100911274552345,
        0.022311480715870857,
        0.04872128367424011,
        -0.03974375128746033,
        -0.028207700699567795,
        0.035702675580978394,
        0.1352633386850357,
        0.022964557632803917,
        0.07134594768285751,
        0.020879702642560005,
        0.03168767690658569,
        0.010230283252894878,
        -0.07735444605350494,
        0.02617124654352665,
        0.03587964549660683,
        -0.06742469221353531,
        0.04550714045763016,
        0.023774106055498123,
        0.011115405708551407,
        -0.027598224580287933,
        0.009651604108512402,
        -0.12452208995819092,
        -0.0019706739112734795,
        0.03020106628537178,
        -0.10120045393705368,
        0.06173807010054588,
        0.04490581154823303,
        -0.005143874324858189,
        -0.02866341546177864,
        0.013031398877501488,
        0.030101073905825615,
        -0.012843034230172634,
        -0.03373602032661438,
        -0.05287470668554306,
        -0.02321646176278591,
        0.025513561442494392,
        0.011543319560587406,
        -0.03737591952085495,
        -0.008580034598708153,
        0.027070995420217514,
        0.0013133306056261063,
        0.027011854574084282,
        0.042038694024086,
        0.050901178270578384,
        -0.05801089107990265,
        -0.044583823531866074,
        -0.05737890675663948,
        0.08114029467105865,
        0.04950021579861641,
        0.05146258696913719,
        -0.05184430256485939,
        -0.08020126074552536,
        -0.0034563932567834854,
        0.030934946611523628,
        0.06419448554515839,
        -0.038539230823516846,
        -0.001932130311615765,
        -0.0011102656135335565,
        -0.020390000194311142,
        0.027608755975961685,
        0.020499594509601593,
        -0.015370860695838928,
        -0.050942543894052505,
        0.006596725434064865,
        -0.030680857598781586,
        0.039583031088113785,
        -0.030146781355142593,
        -0.043040093034505844,
        -0.01375002320855856,
        -0.059383708983659744,
        -0.033361535519361496,
        -0.005436159670352936,
        0.011973356828093529,
        0.06308594346046448,
        0.024574795737862587,
        0.013108810409903526,
        -0.10127191990613937,
        -3.996651405437007e-33,
        -0.00933209341019392,
        0.036370355635881424,
        0.08136096596717834,
        0.0620727501809597,
        0.059755679219961166,
        -0.024806126952171326,
        0.05209368094801903,
        0.009291822090744972,
        -0.005243068095296621,
        -0.03949084132909775,
        -0.015111500397324562,
        0.04094673693180084,
        -0.05854804441332817,
        0.014414279721677303,
        -0.006121390499174595,
        -0.05502744019031525,
        -0.0055971588008105755,
        -0.07868877053260803,
        0.024620061740279198,
        -0.009967716410756111,
        0.04120074585080147,
        0.035148974508047104,
        0.02697066403925419,
        -0.005623498000204563,
        -0.05077395215630531,
        0.02467207796871662,
        -0.008121407590806484,
        0.050087545067071915,
        0.03977163881063461,
        0.020912813022732735,
        0.07214410603046417,
        0.03664541617035866,
        -0.07352720946073532,
        -0.04898878186941147,
        0.05720783397555351,
        0.018776249140501022,
        0.06350255757570267,
        -0.003338961396366358,
        -0.018434904515743256,
        -0.05847208574414253,
        0.004850632511079311,
        0.014032106846570969,
        -0.003702803049236536,
        -0.10036680102348328,
        0.00748106325045228,
        -0.0012091350508853793,
        -0.05260297283530235,
        0.061624184250831604,
        -0.05258220434188843,
        -0.006340389139950275,
        0.07823062688112259,
        0.020062506198883057,
        -0.018741833046078682,
        -0.07935216277837753,
        -0.04461648315191269,
        -0.017382843419909477,
        -0.06717095524072647,
        -0.01619429513812065,
        0.021861927583813667,
        -0.0052908798679709435,
        0.03825705125927925,
        -0.011052792891860008,
        -0.03566664084792137,
        -0.019009200856089592,
        -0.13660991191864014,
        0.03129333257675171,
        0.0829460471868515,
        0.038655348122119904,
        0.040485575795173645,
        0.010375048965215683,
        -0.011295798234641552,
        0.03241639956831932,
        -0.013029535301029682,
        -0.03628178685903549,
        -0.010020803660154343,
        0.07586229592561722,
        -0.0776333138346672,
        -0.11145324259996414,
        -0.009208271279931068,
        0.0004707653424702585,
        -0.022066690027713776,
        0.07708290219306946,
        0.0597350113093853,
        -0.007198032923042774,
        0.03755130618810654,
        0.06855440139770508,
        -0.08059952408075333,
        -0.008357555605471134,
        -0.025508105754852295,
        0.03939187526702881,
        -0.05025147646665573,
        0.0012037667911499739,
        -0.06318710744380951,
        0.14699627459049225,
        -0.02256901189684868,
        -5.386960211239966e-08,
        0.021169941872358322,
        0.06473428755998611,
        0.059648457914590836,
        -0.06085296720266342,
        0.025156432762742043,
        -0.09084499627351761,
        0.022050103172659874,
        -0.004545781761407852,
        0.1268179565668106,
        0.006716616917401552,
        0.019969796761870384,
        -0.08056270331144333,
        -0.0973859503865242,
        0.004696317482739687,
        0.06798011064529419,
        0.08975193649530411,
        -0.044129952788352966,
        0.05051445588469505,
        -0.0350809209048748,
        -0.0275966078042984,
        0.015333451330661774,
        0.07374732941389084,
        -0.002458402654156089,
        -0.030461518093943596,
        0.0511946901679039,
        -0.04593668505549431,
        0.0179604385048151,
        0.04058152809739113,
        0.056453194469213486,
        0.0023668401408940554,
        -0.03327242657542229,
        0.02799026109278202,
        -0.04408971592783928,
        -0.018426647409796715,
        -0.02523445151746273,
        -0.07664790004491806,
        0.0054671368561685085,
        0.01022885087877512,
        0.017392465844750404,
        0.08755821734666824,
        -0.009813024662435055,
        -0.09603900462388992,
        0.005019630305469036,
        0.02351853810250759,
        -0.07356232404708862,
        -0.1440192461013794,
        0.09663544595241547,
        -0.024332474917173386,
        -0.06014208123087883,
        0.07212088257074356,
        -0.029637562111020088,
        -0.015650935471057892,
        -0.016277361661195755,
        -0.03157084435224533,
        0.004477965645492077,
        0.04149489104747772,
        -0.009762842208147049,
        0.04261075332760811,
        -0.08448854833841324,
        0.015888605266809464,
        -0.001382159418426454,
        -0.053228773176670074,
        0.05737407132983208,
        0.14154052734375
    ]
}