{
    "id": "3GXsF6zwPWA",
    "title": "RTX 2080 Laptops Are Here 🔥",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2019-01-29T14:04:05Z",
    "video_url": "https://www.youtube.com/watch?v=3GXsF6zwPWA",
    "category": "Science & Technology",
    "tags": [
        "rtx 2080",
        "rtx",
        "rtx laptop",
        "gaming laptop",
        "rog",
        "zephyrus",
        "zephyrus s",
        "zephyrus gx701",
        "asus",
        "rtx 2080 max q",
        "rtx 2080 maxq",
        "maxq",
        "max q",
        "nvidia",
        "gx701",
        "rtx 2080 laptop",
        "laptop",
        "notebook",
        "gaming",
        "ray tracing",
        "test",
        "benchmark",
        "tech",
        "review",
        "this is",
        "austin evans"
    ],
    "views": 489917,
    "likes": 12546,
    "comments_count": 1230,
    "description": "With Nvidia RTX 2080 Max-Q, this laptop has some SERIOUS graphics firepower. The Asus ROG Zephyrus S GX701:  How an NFL Team Disappeared in 24 Hours:   Check out our new channel!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://www.asus.com/us/Laptops/ROG-ZEPHYRUS-S-GX701/",
        "https://www.youtube.com/watch?v=EYEzhTLR9QY",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. We've had those sweet, sweet RTX graphics in desktops for a little while now. However, today is the day that it is finally time for all of this power to come down to the laptop side of things. To test, we have the brand new ROG Zephyrus S 17 inch. Now, we actually took a brief at this laptop at CES. However, at that time, Nvidia had the performance testing side of things locked down. But with this in our hands, it's time to see exactly what we can get out of RTX for laptops. Here, we've got the top end RTX 2080, paired with a Core i7-8750H. Now, the main cutback going from the full desktop GPU to the laptop Max-Q edition is in TDP. Instead of having over 200 watts to work with, this has to fit in a 100 watt budget, which basically just means the clock speed comes down. Desktop was about 1700 megahertz, this is a little bit over 1200 as far as boost clocks go. Take a look at the benchmarks, though, and it is not a massive improvement, but you will see a pretty good performance bump over the previous generation, GTX 1080, and especially that Max-Q implementation. Now, benchmarks are one thing. But what I want to know is what will it take to get this RTX 2080 running at a full 1080p at 144 frames per second, which is what this screen can do. Now, starting off with, let's see what we can do with Overwatch. Well, three seconds into Overwatch, it looks like this is no problem. We're completely maxed out on ultra settings, the 1080p. And right now, we're about 160 frames per second. I gotta say, Overwatch looks like a solid thumbs up on this front. Next up, we have everyone's favorite game, Fortnite. So this, I think should be pretty easy for the 2080 to handle. Even on full epic settings, I don't think it'll be an issue. Fortnite is another game that is no problem to run, although we're a little bit closer here, at about what, 100, I don't know, 120? So especially paired with that G-Sync panel, 144 frames per second is no problem in Fortnite, so now let's move on to Black Ops. So when it comes to Black Ops, I'm not super sure that we're actually going to be able to max it out fully and still hit 144 frames, but let's give it a try, I guess. I will mention that I am running this on the balanced power mode, so you can crank the fan up to turbo, but in my testing, it only gives you another couple percentage or so of performance, but it's like twice as loud, so I'm not gonna do that. Okay, yeah, immediately I can tell that we're at 100 frames per second, which is good, and to be fair, we do have a G-Sync panel, which means that it's nice and smooth, but a 90, 100 frames per second, that's not what we're looking for. So all you needed to do is crank things down to high and we're pretty much locked at 140 fps. Next, let's see how Battlefield 5 fares. We are in the game, this is not 144 frames. This is about 50 frames. So the thing with Battlefield that's going to be difficult is it does support ray tracing. And it is one of the very few games that does support ray tracing right now, but it is incredibly demanding, especially on the ultra setting. Okay, so turning ray tracing down to low gave us a big boost in frames. We're now up to about 90, which on this G-Sync panel, honestly, really is not a problem. I would be totally happy to play the game like this. Damn, like look at the, look at the reflection. Dude, every time I see a car, I have to go and like, oh, I should probably not do that. So this is a playable game, absolutely, but I want 144 frames per second, which means it's time to start cranking that thing down. Now that's more like it, we're about 130, 140 frames per second right now. I did have to turn off ray tracing and then set everything down to medium, but I mean, we do have a very, very playable, 140 frames per second. I mean to be fair, medium looks totally fine and that 144 frames per second is a big deal. But if it's me, I'm going to turn the ray tracing on and give up a few frames per second to get that extra little bit of visual. Now gaming is great, but this also is great for content creation. So Wes, how does it handle Resolve, and specifically RED stuff? - So what we have playing here is 7 and 8K RED footage playing down at quarter res. But as you can see, with a color grade on there, and a few nodes, doing kind of a punchier grade. It is playing back in real time, which is something that Resolve would struggle with on lower end spec. - This makes a lot of sense as a laptop to use for content creation then, right? Because you got something that's fairly thin, you do have the Pantone color calibrated display, which realistically, eh. - Well, so, so look. Coming out of the factory, it'll be pretty good. It's going to shift over the first few hours, honestly, of use. But by having a good display, that means that if you are someone that wants to calibrate in the future, you can be fairly comfortable that you are going to be able to get a fairly good calibration out of it. - Next, let's talk about this actual laptop itself, the Zephyrus S, which there's actually a lot more to talk about than purely just the graphic side. This shares a lot of DNA with the original Zephyrus. When it's closed, it's only 18 mil thick. When you open it up, the entire deck lid raises to give more cooling from the bottom. There's also a very unusual placement for the keyboard and trackpad. So it's all put on the bottom half of the laptop, which means that this top half is entirely dedicated to cooling that CPU and especially the GPU. Now, these does take a little bit of getting used to, but it's really not so bad. Now, the same thing goes with the touchpad. While it's a little bit smaller than usual, most importantly it has a solid surface, and you do have the option of turning it into a number pad. And some of the best sounding click buttons I have ever tried on a trackpad. All of this means that this is among the smallest 17 inch gaming laptops that you can buy. That being said though, it is still a 17 inch gaming laptop. Sure, it's a little bit closer to something like that 15 inch Zephyrus that came out last year. But realistically, there's no getting around that this is a very, very big footprint for a laptop. I'll give them this though. At only six pounds, it is way lighter than you would expect, considering that there is that full 2080 inside, but don't exactly expect to you know, fit this in your backpack easily. The display itself is exactly what you would expect out of a high-end gaming laptop. It's a 17.3 inch panel, with a 1080p resolution, but importantly, not only does it run at a full 144 hertz, but it also supports G-Sync. You also have Nvidia Optimus onboard. Usually, you have to pick one or the other. G-Sync is for keeping those frame rates nice and smooth and to keep any kind of tearing out, whereas Optimus allows you to turn off that graphics card when you're not using it to save battery life. Now, in this, you do have to manually turn it on as well as restart the laptop when you're switching between the two. Most of the time, when you have a laptop with G-Sync, it means that you're gonna get like an hour of battery life, so thankfully that's not the case here with Optimus onboard. Paired with a decently sized 76 watt hour battery, I'd be able to get about three to three and a half hours of normal use with the laptop. Now that's not gaming, mind you, but this is actually a laptop that you can do some other stuff with. Not a lot of other stuff, but some other stuff. You do have the added benefit of supporting USB-C charging. Now, that's not enough to fully power the laptop. It tops out at 65 watts, so it's a lot more for kind of, charging it overnight, or using it for lighter tasks, but importantly, this means that if you want to take this on the go, you don't have to always carry the giant 200 watt power brick. Instead, you can take a smaller one or just plug into a USB-C monitor to top off. Also, while we're talking about USB-C, it does have a pair of USB-C ports, but neither support Thunderbolt 3, something that the previous Zephyrus did. Not exactly like a deal breaker, it's just kind of an odd decision. Something interesting about this notebook is the webcam, it doesn't have one. That is where this comes in. In the box, they do include an external webcam. Now, there's a couple reasons for this. First of all, they don't have a whole lot of bezel to work with on the top. But more importantly, this is a higher quality webcam than usual. Not only does it support 1080p, but it also has a full 60 fps output. And on top of that, they also have a little stand that comes with it, so if you want to do something like Twitch streaming, you can set the webcam off to the side. You know what, this actually does look a lot better than most webcams, including on a laptop. Now sure, it's not going to be quite as good as something like a dedicated camera setup for Twitch streaming, but considering that this comes in the box, I've gotta say, really not a bad idea. (music playing from laptop speakers) - Hey, not bad. So the audio's pretty impressive here. Not only do you have a pair of speakers that are firing directly at you, but on top of that, there is this awesome little wheel to control the volume. It's like what you would find on a lot of mechanical keyboards, and I love it. Like seriously, can everyone just adopt this? Like, I want this on every laptop ever. Now as you might imagine, all of this doesn't exactly come cheap. The Zephyrus S starts at $2700, and the model I have here comes in at a full $3,200 and zero cents. I don't know why I had to say zero cents, but it just sounds more impressive that way. With that RTX 2080 Max-Q inside, you will not find another gaming laptop that's this thin as well as this light, while still giving you a full 17 inch display, and importantly, this much performance. Now whether it's worth the price tag is kind of up to you. But I've gotta say, they did a lot right with the Zephyrus S.",
    "transcript_keywords": [
        "laptop",
        "frames",
        "Zephyrus",
        "RTX",
        "lot",
        "full",
        "time",
        "Austin",
        "gaming laptop",
        "ray tracing",
        "bit",
        "top",
        "GSync",
        "gaming",
        "good",
        "inch",
        "USBC",
        "game",
        "ROG Zephyrus",
        "sweet RTX graphics"
    ],
    "transcript_entity_values": [
        "Zephyrus",
        "the Zephyrus S",
        "about 1700 megahertz",
        "100",
        "Nvidia Optimus",
        "1200",
        "zero cents",
        "half",
        "17 inch",
        "about 130",
        "2080",
        "15 inch",
        "65 watts",
        "three seconds",
        "USB-C",
        "2700",
        "about three to three",
        "200 watt",
        "GTX 1080",
        "the Zephyrus S.",
        "G-Sync",
        "Overwatch",
        "the day",
        "USB",
        "18 mil",
        "two",
        "17.3 inch",
        "Thunderbolt 3",
        "100 watt",
        "120",
        "140",
        "Battlefield 5",
        "Battlefield",
        "76 watt hour",
        "Austin",
        "one",
        "8",
        "K RED",
        "Max",
        "second",
        "60",
        "CES",
        "Nvidia",
        "Black Ops",
        "90",
        "about 50",
        "Fortnite",
        "Pantone",
        "over 200 watts",
        "CPU",
        "only six pounds",
        "ROG Zephyrus S 17",
        "about 160",
        "1080p",
        "Optimus",
        "TDP",
        "144",
        "last year",
        "webcam",
        "Twitch",
        "about 90",
        "7",
        "quarter",
        "max",
        "the first few hours",
        "Zephyrus",
        "2080",
        "GPU",
        "today",
        "Wes",
        "First"
    ],
    "transcript_entity_types": [
        "GPE",
        "FAC",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "ORG",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "FAC",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "PERSON",
        "TIME",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "TIME",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORDINAL"
    ],
    "vector": [
        -0.0550185963511467,
        0.060986265540122986,
        0.0013101182412356138,
        0.03925935551524162,
        0.05415011942386627,
        -0.038259439170360565,
        -0.02500583417713642,
        0.031121758744120598,
        -0.013910890556871891,
        -0.018178444355726242,
        -0.01635204814374447,
        0.08135365694761276,
        0.030549820512533188,
        0.04870777204632759,
        0.0223496463149786,
        -0.004451762419193983,
        0.07684114575386047,
        -0.09195096790790558,
        -0.03225768730044365,
        -0.0038762299809604883,
        -0.017015399411320686,
        -0.07595540583133698,
        -0.03692168369889259,
        -0.07905330508947372,
        0.06331778317689896,
        0.0016731986543163657,
        0.06469316780567169,
        -0.011564206331968307,
        0.02137080207467079,
        -0.0061683813109993935,
        0.0243817288428545,
        0.056016191840171814,
        -0.06578944623470306,
        -0.06526069343090057,
        -0.07692795246839523,
        -0.057353660464286804,
        -0.004294348414987326,
        -0.06325183063745499,
        0.012903382070362568,
        -0.0946192517876625,
        -0.06111038476228714,
        -0.038870640099048615,
        -0.008415283635258675,
        0.07012505829334259,
        0.013626445084810257,
        -0.09012468159198761,
        -0.01712210476398468,
        -0.011613276787102222,
        -1.434946807421511e-05,
        -0.04395044967532158,
        -0.028987282887101173,
        -0.011897755786776543,
        0.012102637439966202,
        0.052301425486803055,
        -0.10209660977125168,
        0.06706029176712036,
        0.012448017485439777,
        -0.0702170878648758,
        0.015620999038219452,
        -0.00379074364900589,
        0.0625874325633049,
        -0.10221005231142044,
        0.008530396968126297,
        0.05056494101881981,
        -0.017061538994312286,
        -0.03961651027202606,
        0.007190933916717768,
        -0.06460561603307724,
        -0.029424984008073807,
        0.07033426314592361,
        -0.013016365468502045,
        0.08192320168018341,
        -0.02745496667921543,
        -0.03375944867730141,
        0.042009852826595306,
        0.012473607435822487,
        -0.011648866347968578,
        -0.02524898573756218,
        0.02709944173693657,
        -0.03346213325858116,
        0.06845960021018982,
        0.016884716227650642,
        0.029377205297350883,
        -0.020192980766296387,
        0.04382910951972008,
        -0.015806348994374275,
        0.03627127408981323,
        0.0428328663110733,
        0.026892978698015213,
        -0.01210119016468525,
        0.008471623994410038,
        0.023778943344950676,
        0.03773725405335426,
        0.035867273807525635,
        0.02879648096859455,
        -0.06075955927371979,
        0.02169613167643547,
        -0.05877034738659859,
        0.0002526848984416574,
        0.009537182748317719,
        0.0013700170675292611,
        0.0019941218197345734,
        0.053480397909879684,
        0.08370907604694366,
        -0.04192119836807251,
        -0.0044203526340425014,
        -0.06399820744991302,
        0.054809316992759705,
        -0.06498932093381882,
        -0.04293478652834892,
        -0.02536226622760296,
        0.06417327374219894,
        0.02252965420484543,
        0.025728864595294,
        -0.07645823061466217,
        0.07873684167861938,
        -0.06040477752685547,
        0.018772440031170845,
        0.06361822038888931,
        0.020794764161109924,
        -0.00820731371641159,
        -0.038052547723054886,
        -0.013455643318593502,
        0.066226065158844,
        0.0715089738368988,
        0.07595513761043549,
        -0.09873659908771515,
        6.997518771089407e-33,
        -0.0010352401295676827,
        0.04223669692873955,
        -0.028175728395581245,
        -0.04105487838387489,
        0.045506179332733154,
        0.06029222160577774,
        0.027336161583662033,
        -0.029732709750533104,
        -0.001397281652316451,
        0.05899980664253235,
        -0.07404620945453644,
        0.025792965665459633,
        -0.018485110253095627,
        0.02846520207822323,
        0.056666526943445206,
        -0.061013124883174896,
        -0.08512873202562332,
        0.08650289475917816,
        -0.10669698566198349,
        0.06957326084375381,
        0.11288759112358093,
        0.03389522060751915,
        -0.013197517022490501,
        -0.046977754682302475,
        0.007996585220098495,
        0.0797492191195488,
        -0.0034276472870260477,
        0.06688728928565979,
        -0.04552232846617699,
        0.01822265051305294,
        -0.015802564099431038,
        -0.0856051966547966,
        -0.06573352217674255,
        0.007894612848758698,
        -0.047314394265413284,
        0.009839764796197414,
        -0.04674026370048523,
        -0.08709146827459335,
        0.05789265036582947,
        0.026456942781805992,
        -0.01838538609445095,
        0.12958891689777374,
        -0.01735685206949711,
        -0.06436437368392944,
        -0.038748521357774734,
        0.0038120278622955084,
        0.012607740238308907,
        -0.02141234651207924,
        -0.03591015934944153,
        -0.004719945602118969,
        -0.07161825150251389,
        0.08471424877643585,
        -0.039417777210474014,
        -0.005762620363384485,
        -0.021480225026607513,
        -0.026689672842621803,
        0.05737746134400368,
        0.0809268206357956,
        0.11560091376304626,
        0.10890748351812363,
        0.029957301914691925,
        -0.037252455949783325,
        -0.08156299591064453,
        -0.012570224702358246,
        -0.10770365595817566,
        0.07365232706069946,
        0.06622904539108276,
        -0.042182330042123795,
        -0.05929814279079437,
        -0.008718029595911503,
        -0.03290250524878502,
        -0.0037845068145543337,
        0.05205066502094269,
        -0.04550262913107872,
        0.09510146826505661,
        -0.04650150239467621,
        -0.027250783517956734,
        0.006129296496510506,
        -0.055666107684373856,
        -0.11323607712984085,
        -0.05989916995167732,
        0.0673723816871643,
        0.022760218009352684,
        -0.02381756342947483,
        -0.06755146384239197,
        -0.0640510618686676,
        -0.11041580140590668,
        0.01884220540523529,
        -0.02256377786397934,
        0.021157748997211456,
        -0.05190403759479523,
        0.014150254428386688,
        -0.041273824870586395,
        0.03984198346734047,
        0.010859859175980091,
        -6.1108264845328625e-33,
        -0.01512995921075344,
        -0.06597447395324707,
        -0.003458042861893773,
        0.041621651500463486,
        0.05966881290078163,
        -0.006948036141693592,
        0.031773991882801056,
        0.0021069454960525036,
        0.0064313230104744434,
        -0.13939602673053741,
        0.10619497299194336,
        0.06586946547031403,
        -0.08970320969820023,
        0.06510529667139053,
        0.044401414692401886,
        -0.07596705853939056,
        0.06179283559322357,
        -0.03819018229842186,
        -0.013578199781477451,
        -0.05147913470864296,
        0.019697515293955803,
        0.02804880402982235,
        -0.01648196019232273,
        0.024343032389879227,
        0.003844449296593666,
        0.019915563985705376,
        0.023221971467137337,
        0.01244494691491127,
        0.05155732110142708,
        -0.01013028435409069,
        -0.04923699051141739,
        -0.02508377470076084,
        -0.02241363562643528,
        0.09862855821847916,
        0.12102598696947098,
        0.03876074403524399,
        0.0020651412196457386,
        0.045635245740413666,
        -0.029979947954416275,
        0.07302268594503403,
        0.1368643045425415,
        0.05356358364224434,
        0.03173156455159187,
        0.04897528886795044,
        0.019594669342041016,
        0.046836964786052704,
        -0.05699346214532852,
        -0.13658468425273895,
        -0.01498581375926733,
        0.003182426793500781,
        0.010958701372146606,
        0.0017981280107051134,
        -0.0016631829785183072,
        0.05023903399705887,
        -0.010042671114206314,
        -0.09617757797241211,
        -0.009703441523015499,
        0.035754602402448654,
        0.00900703202933073,
        -0.003022476565092802,
        0.1278059035539627,
        0.07168567925691605,
        -0.03742464631795883,
        0.00957001093775034,
        0.018170585855841637,
        -0.022555891424417496,
        -0.00913670752197504,
        0.011221585795283318,
        0.040209610015153885,
        0.01861787773668766,
        -0.08110656589269638,
        0.009484514594078064,
        -0.03118356689810753,
        -0.0326310358941555,
        -0.01191140990704298,
        0.06594742089509964,
        0.013477331958711147,
        -0.05095035955309868,
        0.022442974150180817,
        -0.07223955541849136,
        -0.042750775814056396,
        -0.049006231129169464,
        -0.0013689299812540412,
        -0.019042914733290672,
        0.06414968520402908,
        0.08095045387744904,
        -0.04848731309175491,
        0.00032900567748583853,
        0.04452122002840042,
        -0.0631769672036171,
        -0.04080936312675476,
        -0.01613583229482174,
        -0.06266391277313232,
        0.0038714557886123657,
        0.03938298299908638,
        -4.8769521754365996e-08,
        -0.001410005846992135,
        -0.0681852474808693,
        -0.025752803310751915,
        0.11579841375350952,
        -0.04241687431931496,
        -0.07736905664205551,
        -0.009997853077948093,
        -0.04808316007256508,
        0.02589351125061512,
        -0.025285840034484863,
        0.09343724697828293,
        -0.044449545443058014,
        0.05143994837999344,
        -0.022426189854741096,
        -0.006760942749679089,
        0.01965990848839283,
        -0.06423293054103851,
        0.0033825014252215624,
        0.015063942410051823,
        0.023333806544542313,
        -0.022962355986237526,
        0.04332998767495155,
        0.053812917321920395,
        -0.021383237093687057,
        0.027412382885813713,
        0.04331149533390999,
        -0.019759761169552803,
        -0.009498574770987034,
        0.10220389068126678,
        -0.033423472195863724,
        -0.06465912610292435,
        -0.014507275074720383,
        0.0022006062790751457,
        0.017130335792899132,
        0.004026143345981836,
        -0.03331010788679123,
        -0.01382248941808939,
        0.10196566581726074,
        0.12589481472969055,
        0.04057125747203827,
        -0.001559309079311788,
        -0.08092567324638367,
        -0.01846073567867279,
        -0.025344785302877426,
        0.040892742574214935,
        0.02339615486562252,
        -0.06479695439338684,
        -0.049495045095682144,
        0.007031022105365992,
        0.007600581739097834,
        -0.039600323885679245,
        -0.000640733283944428,
        -0.01670124940574169,
        0.01802000030875206,
        0.053375646471977234,
        -0.07551940530538559,
        -0.09327274560928345,
        0.05499952659010887,
        0.014560543932020664,
        0.0025759076233953238,
        0.026801995933055878,
        -0.06706565618515015,
        -0.053764697164297104,
        0.03381764516234398
    ]
}