{
    "id": "3HzLjxNCZGc",
    "title": "I got SCAMMED on the new Wish.com",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2023-02-25T16:04:16Z",
    "video_url": "https://www.youtube.com/watch?v=3HzLjxNCZGc",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "tech",
        "wish",
        "temu",
        "temu tech",
        "wishtery tech",
        "austin",
        "austin evans",
        "unboxing",
        "amazon",
        "scam",
        "denki",
        "this is",
        "temu.com",
        "wish.com"
    ],
    "views": 1424641,
    "likes": 39942,
    "comments_count": 1742,
    "description": "Welcome to the wild world of Temu. Sony is in TROUBLE on @thisis  Alright, Samsung on @Denki   Subscribe for more!  TikTok:  Instagram:  Twitter:   Chapter Titles: 0:00 What is Temu? 1:10 Squishy Gorilla 1:54 Fake PS5 4:45 PS5 Cover 5:31 Makeup...? 7:36 The Demonetization Segment 8:30 Lenovo LivePods 9:53 Mini Chainsaw 12:13 Football Shoe Car 12:48 Nintendo DS Game Cart 14:07 USB Light 14:33 Switch Lite Grip 15:25 \"tech\" 15:44 Electric Face Slimmer",
    "description_links": [
        "https://youtu.be/bGumK1Brh8M",
        "https://youtu.be/s4oRq9lO85o",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- You know what? I'm sick and tired of wish.com. I keep buying things and getting scammed. So I've decided to move on to greener pastures. Welcome my friends, temu.com. What you might ask is temu.com? I don't know. Everyone just keeps telling me it's better than Wish. Temu is an online marketplace, a U.S.-based subsidiary of the Chinese company, Pinduoduo. They should just call it Pinduoduo. That's actually a much better name. I will immediately say, the Temu website is a lot nicer looking than Wish. A micro SD card reader for iPhone. So it's micro SD on one side and it is a Lightning port on the other side. And it's three bucks. That's neat. Oh, they got... Oh, okay. Here we go. So they've got a Game Boy, it's not Supreme, it's Sup. - [Kinsey] (laughs) Sup. (Austin groans) - Electric V face shaping massager. Face firming machine, beauty device, double chin removal machine. (laughs) Do you have a double chin? Well, buying this massager will clearly get rid of it. I'm about to be so beautiful. There's so much stuff on Temu. Bro, you better subscribe to the channel and ringaling that dingaling button. I'm about to go ham on temu.com. I got months of content here. (laughs) So, our packages from Temu have arrived much faster than they ever did from Wish. I think everything was here within two weeks. Usually, Wish is like two months. Temu purchase protection. It's almost as if they're preparing you to be scammed in advance. Have you ever wanted to have a little gorilla buddy? - [Matt] What? - Me too. This, my friends, is a gorilla. (all laugh) Grab a hand. - Oh, no! Oh. Ew! - It feels so- - Ew! - [Kinsey] Feel his body. Touch my body - [Ken] Ew! Austin! Good time - Hey, Ken and Matt. - [Matt] Yeah? - Can I ask you a question? - [Matt] Yeah. - [Ken] Yes. - Have you ever wanted a PlayStation for Christmas? - Yeah. - [Austin] Put on your wishlist, ask Santa Claus. - Yeah. - Yeah. - [Austin] Can I have a PS5? - Yeah. - What if I told you that we have a PS5 at home? - [Matt] What? (laughs) - [Ken] Let's go! - I'm just gonna say for reference, the entire box is smaller than a real PS5. - [Kinsey] It is so light weight too. If you pick that thing up, it weighs nothing. - Wow, product features. Number one, double hands. - [Ken] Oh, I have those. - Well, you're qualified to operate this particular piece of machinery. (Matt laughs) - [Ken] Wow. - Look, it's just a little guy. Actually, you know what? They look kind of all right side by side. (controller rattles) Don't you love it when a new DualSense sounds like this right out of the box? Shout out to Select and Start being on your touch pad. And A, B, X, Y? - [Ken] Yo. - [Austin] There's no attention to detail. - [Ken] If we wanted to use this as an ornament on our desk, how much does this cost? - $63 and 48 cents. - [Ken] All right. No. - [Austin] Ooh! - And I was not able to find it again on Temu, so Sony was probably like, \"You can't actually do that.\" - Yes. So often when we're doing these Wishtery Tech style videos, the items that we're looking for mysteriously disappear only to quickly be replaced by another identical item soon after. The warranty is good for seven days. (all laugh) - [Matt] Also can't help but notice that nothing's happening so far. - Look, it's a working progress. Okay? (game beeps) - [Matt] It's a speaker! - Really loud. Okay. So it's getting power, but it's just not getting any video out. Unfortunately, our 4K game station seems to be DOA. - Wait, this TV can't do 4K. (Matt laughs) - No. No. All right. I'll get a 4K TV. No. No. (game beeps) - [Matt] Hey! (all laugh) - It's 720! - [Ken] Yo, \"GundamBattleAss\"! Let's go! - Oh, it's \"Battle Assault\"! I do not understand what I'm playing, but it's a PlayStation game, so it counts. - [Matt] Who are you? - I'm Deathscythe. - [Ken] I'm guessing he's the one with the scythe? - [Matt] Yeah. - This is actually not the worst thing I've ever seen. The main issue with these little micro consoles that you usually get on Wish and whatnot is that they're all just in the NES clones. They play like 50 versions of \"Super Mario\", and that's it. But this actually has a full selection of games. I still don't think it's really worth it, but it's not a complete rip, as long as you know what you're getting yourself into. Which I mean, they're very clearly trying to insinuate it's a PS5, but it's actually an okay little emulator. Not a good one, but it's okay. So, if you do own a PS5, have I got the item for you. One of the biggest problems with the PS5 is clearly that it collects dust. - [Ken] Is that a dust cover? - Yeah. - [Ken] What the... (Ken laughs) - You'll never know what I've got underneath this secret bag. - [Kinsey] I was thinking this is for people who cover their couch in plastic. - [Ken] Oh, my dad. - That's exactly what it... (laughs) Well, Ken, here you go. Send it over to your pops. - Yes, this will- - Definitely plays PS5. - This will go well with all of our TV remotes that are still in the original Saran wrap. (Austin laughs) - [Kinsey] First of all. - Wow! Are you in the NFL or something? Why do I have a bunch of eggs? Did I order eggs? - [Matt] We can't afford to order eggs in 2023. - Ah! This is horrific! (all laugh) - [Joanna] Oh, oh, oh shoot. Yeah, now I remember this. - [Matt] Is it just me, or is Austin Evans getting hotter? - [Joanna] Oh my gosh! I don't like that. - So, the idea with this fleshy squishy skin bit is so that you can practice doing makeup. Now, I am a certified beauty expert. (upbeat music) - [Joanna] It should not be that difficult. - I shouldn't do this hard, right? Are we pulling the IFixit kit to open this makeup? How could this be this hard? - [Joanna] Can I look at it? - Wait, Joanna's gonna do it in like half a second. Did you open it? Ah! Did you just turn it? - Yeah. - I knew that. I'm an expert. Wow! Look, it's beauty cream. Ah! Ugh! Why is it so goopy? - [Joanna] It's how foundation is. - Oh, is that really? I mean, I knew that. - [Joanna] Yeah! - As an expert, this consistency is close to optimal. Just... - [Joanna] Yeah. - My eyes! - [Joanna] Uh-oh. Oh, okay. - So here we go. This is great. This seems really great. Hey, Matt, you wonder why I asked you to come today? This is why. - Let's make me beautiful. - Let's do it. Where are some of your areas that you'd like me to focus on? A little bit of this. Over here. Just kinda rub it in. You wanna just make sure that as you're applying this, that you're really making the appearance smooth and flawless because you wanna just accentuate the natural curves. - How do I somehow look whiter? - [Joanna] You know, they're called beauty blenders for a reason. - Do we need to use it more? - [Joanna] I mean, you might wanna blend it into his face. (gentle music) - Wow! - [Matt] Whoa! - Woo! Kinsey don't play! All right. What? Did I order this? - [Matt] You are the only one who ordered this. This happens every time we do Wishtery Tech. - This, my friends, is the Derringer Science Education Model. This, my friends, is only for science and education. So- - [Kinsey] It's a (beep)! - We can't say that word on YouTube. - [Kinsey] It's a device. - [Ken] Austin, are you trying to bust a cap? - Three, two, one. (gun fires) - [Ken] That's actually pretty powerful. - And of course, as soon as you're done, you just drop your... Oh, I didn't realize it actually jumps the shells out. - [Ken] Wow! - It's neat, right? Look, inappropriate? Yes. Demonetizable? Almost certainly. Kind of cool. Ah, I got it. This is Lenovo Live Pods LP40. So, you might be familiar with AirPods. Who wants a pair of AirPods when you can have Live Pods? Now, I believe on Wish, we took a look at some Lenovo AirPod-like things that were very cheap. How much were these Live Pods? - [Kinsey] $7.59. - So for $7, these are fully wireless EarPods. So it's a USB-C. Thumbs up. And it's also a little bit of a smaller case. It does though, without the Lenovo logo, look identical to AirPods. The case feels pretty decent. Bro, these look just like AirPod Pros. Oh my God, these are actually like AirPod Pros. All right, I'm gonna pair 'em. They actually look really pretty solid. (upbeat music) What the (beep)? Okay. Wait, they're really touch sensitive just like AirPods! You literally got the stems. Pause, play. And if I take them out, do they stop? No, they don't stop. But still, I will say they don't sound as good as AirPods, but they're not way far off. I think the main thing is just the sound's not very full. So it's a little bit thin. But man, for seven bucks, I'm legitimately impressed. This is take one of day two of Temu tech! - [Matt] Temu! - Ow! I slated on my freaking hand. - [Matt] We call that, getting the clap. - Okay. - [Kinsey] Let me take a look at that. Let me take a look at that. - See that? - Oh, that's pretty bad. We might have to amputate it. - Temu is a wild place full of lots of very exciting things like chainsaws. - [Kinsey] What could go wrong? - So it comes with a mini saw chain. - [Matt] I feel like this is really dangerous. - Matt would be correct. That's a bunch of little sharp saw blades. How do you undo this? (Kinsey laughs) Shake and came out. It's okay. - [Joanna] Oh, no. - I didn't mean that. I can't undo it. Okay. I literally have no idea how to do this. Oh, is this the one that we need a drill for? I'll be right back. I'm gonna go get power tools. Okay, I've got this figured out. Okay? So now that I have an actual power tool. - No, no, no, no, no. - No, what? - We're gonna assemble it first before you attach it to a power source. - But I wanna make sure it works. - This is a thing where you should in fact read the instruction. - There is no instruction. Literally no instructions. - [Matt] I don't like any of this. (chainsaw beeping) (Kinsey laughs) - Woo! This is a real chainsaw. Here, I'ma put it like this. - [Matt] What did you expect it to be? That's not how you do chainsaws! - Okay, Mr. chainsaw expert, how am I gonna attack this? I feel powerful now. I'm gonna hurt myself very quickly. This is incredibly dangerous. Do not try this at home. I feel like there should be maybe like some kind of guard, because I feel like my hand's really quite exposed here. Round two. (chainsaw whirring) I mean, that's a real chainsaw. I mean, I'm not gonna actually slice through real wood, but considering that this is just using a drill, that's actually kind of impressive. I'm still not entirely sure who needs this and why, but Temu... - You definitely do not need this. You're not allowed to have this anymore. - It's okay. I can't argue with that. - [Kinsey] Maybe something a little more age appropriate? - This is age appropriate? How dare you? This is the shoe car. A funny football boot. Apparently this has been tested according to international standards. Oh, okay. Look how exciting this is. It's not very maneuverable for something that's supposed to be kicking a ball. - Watch and learn. - Okay, you go for it. It's wide open, Matt. It's wide open. It's wide open! - [Announcer] He's done it! - Wow. - [Kinsey] Goal! - Look, not all items from Temu are great, and thumbs down. This is a Nintendo 3DS 208 in one cartridge with a stylus. - [Matt] Oh. - Oh! So on the back, you've actually got yourself a blank micro SD card. So I think this is just a dummy to converter basically to make micro SD turn into DS slash 3DS. Okay. I mean, not that I would ever condone piracy. So I'm gonna load this up into a DS Lite to see what actually happens. Okay. Wow! All right. Well, we're immediately in. So, I see \"Pokemon Black and White\", version one and two. It's a very expensive game. So we've got a bargain already. \"Platinum\", also an expensive game. \"HeartGold\", \"SoulSilver\", \"Diamond\". Just at first glance, this seems like it's got every DS game I could ask for. Oh my God, there's \"Call of Duty: Modern Warfare 3\". - [Matt] Yeah. - For the DS. - [Kinsey] Oh, the world ends with you. - [Matt] People forget about that. - All right, I'm playing that. I'm just playing that. How much was my 218 games in one cartridge for the DS? - [Kinsey] $9.48. - $9? - [Kinsey] $9 and 48 cents. - [Matt] That's worth it just for the adapter to do your own ROMs. - I will say, I don't love the idea of playing what's clearly just a bunch of ROMs loaded up onto a flashcard. But once you're actually playing this, if you're not looking at the little label here, you would never realize that you're not playing a legitimate game. - Okay. - Okay. - [Matt] I hate all of that. - I'm like reverse scanning myself. What is this is? It's a USB light? I bought this? I bought this! So if you ever wanted a light, you can plug it in, and then, boy, it'll be a light. Wow! - [Kinsey] Hey! - It's the whole thing. I'ma catch this one. I caught it. The Grip Case for the NS Lite. Not too long ago, I did a video on why I personally think that the Switch Lite is one of the best deals in gaming right now. A little bit of a controversial video, but the only thing I agree when the haters come knocking trying to make fun of my Switch Lite is the fact that it is maybe not the most ergonomic thing in the world. Now, for me, not a big problem, but that's where a grip case like this comes in handy. So all I need to do is just slide this in. Ooh. Oh, oh. Wait. Well. Boy, that does not wanna go in there well. But okay, sure. Let me actually see if I can play this and see if it actually helps. Actually, this is not bad. I'm not usually a big fan of grips and stuff, but actually this does make a difference. I feel like I still have full access to all of the controls, but it also feels a lot more natural. Hey, Joanna, I have a question for you. - [Joanna] Oh, what? - Would you like some tech? - [Joanna] Tech? It's tech. - This is a joke that literally no one is going to appreciate. - [Joanna] Except me. - Except Joanna. - [Joanna] Yay. - But my friends, Temu also delivered a pile of fake carrots. The electric face slimming instrument. Everyone wants a V face. You don't want this face, you want this face. - [Matt] No one wants that face. - Well, let's see what we got here. How does it slim my face? - [Matt] Science. - So it says I'm supposed to have my skin wet, but no. Break my jaw. Okay. - All right, we're gonna go for it. Safe word is pickle. - Okay. Cucumber! Ooh, boy. I feel like I'm Pikachu right now. It's literally like shocking me. So on the inside, there are a couple of little metal things and they're shocking my cheeks. Boy, I am about to be a different shape all right. Beauty is pain. Beauty is pain. Okay. How long do I have to do this for? - [Matt] Every night before bed until you're beautiful. - Are we ready? Woo! - [Matt] Is that Marilyn Monroe? Oh, wait, no, it's just Austin Evans. - You know what it feels like? Feels like someone punched me on both sides of the jaw. Okay. Let me know in the comments below, do you think that Temu Tech deserves another shot? Should we continue the mystery tech rabbit hole with Temu Tech? Is everyone gonna throw things at me now? Is this the way we end the video? Okay. - [Kinsey] Yes! - Thank you for watching this episode of Temu Tech. - [Joanna] Oh, gosh, no. No! - Make sure you subscribe to the channel. And if you don't, Matt's gonna throw his chainsaw at me. (Kinsey laughs) Thanks for watching. I'll see you next time on Temu Tech!",
    "transcript_keywords": [
        "Temu",
        "Temu tech",
        "Yeah",
        "Tech",
        "Wow",
        "face",
        "Feel",
        "thing",
        "Game",
        "make",
        "Live Pods",
        "feels",
        "Matt",
        "things",
        "Hey",
        "beauty",
        "Wishtery Tech",
        "playing",
        "AirPods",
        "Lite"
    ],
    "transcript_entity_values": [
        "like half a second",
        "Battle Assault",
        "iPhone",
        "K TV",
        "Call of Duty: Modern Warfare 3",
        "first",
        "48 cents",
        "Temu Tech",
        "two",
        "Matt",
        "9.48",
        "The Grip Case",
        "2023",
        "seven days",
        "one",
        "DualSense",
        "Select and Start",
        "Live Pods",
        "7",
        "9",
        "Kinsey",
        "63",
        "one of day two",
        "Lenovo Live Pods LP40",
        "Austin Evans",
        "PlayStation",
        "Ken",
        "USB",
        "Austin",
        "seven bucks",
        "Wishtery Tech",
        "the Derringer Science Education Model",
        "218",
        "Joanna",
        "Joanna]",
        "IFixit",
        "Demonetizable",
        "today",
        "PS5",
        "two weeks",
        "three bucks",
        "Switch Lite",
        "Joanna] Tech",
        "7.59",
        "Santa Claus",
        "the Switch Lite",
        "Saran",
        "Christmas",
        "Temu",
        "AirPods",
        "two months",
        "720",
        "GundamBattleAss",
        "YouTube",
        "Sony",
        "Super Mario",
        "Lenovo",
        "208",
        "SD",
        "Ken] Austin",
        "One",
        "First",
        "Pinduoduo",
        "Supreme",
        "Ken] Yo",
        "Marilyn Monroe",
        "months",
        "NFL",
        "Three",
        "Chinese",
        "Temu",
        "EarPods",
        "SoulSilver",
        "Nintendo",
        "4",
        "50",
        "Pokemon Black and White",
        "NES",
        "Sup"
    ],
    "transcript_entity_types": [
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "MONEY",
        "MONEY",
        "PERSON",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "PRODUCT",
        "ORG",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "NORP",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.09436148405075073,
        -0.03838251903653145,
        0.03683675825595856,
        -0.06861338764429092,
        0.013126705773174763,
        -0.056518178433179855,
        0.07711510360240936,
        0.05003882572054863,
        0.056544914841651917,
        0.025491639971733093,
        0.16004903614521027,
        -0.008540692739188671,
        0.021330805495381355,
        -0.004009811207652092,
        0.040459372103214264,
        -0.07150079309940338,
        0.05467608571052551,
        -0.10348586738109589,
        -0.028848476707935333,
        -0.030122587457299232,
        -0.024481739848852158,
        -0.07323532551527023,
        -0.018711144104599953,
        -0.0037254069466143847,
        -0.06770572811365128,
        -0.0028278904501348734,
        -0.08413983136415482,
        0.03559837490320206,
        -0.0905146449804306,
        -0.012171879410743713,
        -0.05050890892744064,
        0.1184505820274353,
        -0.02416149340569973,
        -0.018841492012143135,
        0.025780238211154938,
        -0.050352126359939575,
        -0.033831894397735596,
        -0.05002695322036743,
        -0.05863837152719498,
        -0.030606402084231377,
        -0.039921414107084274,
        -0.06589964777231216,
        -0.05278400331735611,
        0.009660297073423862,
        0.00886453315615654,
        0.007392919156700373,
        0.08523166924715042,
        0.007444188930094242,
        0.015965797007083893,
        0.010317188687622547,
        -0.02916862815618515,
        -0.028602994978427887,
        0.04934674873948097,
        -0.0063493140041828156,
        -0.07470354437828064,
        0.002066711662337184,
        0.05337714031338692,
        0.02280484326183796,
        0.08076959103345871,
        -0.020168233662843704,
        0.05355723947286606,
        -0.042677272111177444,
        0.03570180758833885,
        0.03146705776453018,
        0.044527921825647354,
        -0.022646745666861534,
        -0.08981059491634369,
        0.05991700664162636,
        0.042336054146289825,
        -0.05424513295292854,
        0.04871074855327606,
        -0.0037397879641503096,
        0.056371476501226425,
        0.14520910382270813,
        -0.04162241518497467,
        0.03145960718393326,
        0.11718051880598068,
        -0.059051528573036194,
        0.016649818047881126,
        0.1035914346575737,
        -0.0045613874681293964,
        0.009805908426642418,
        -0.05861179530620575,
        -0.037561818957328796,
        -0.022531485185027122,
        0.024445265531539917,
        0.0071760560385882854,
        0.08140204101800919,
        0.04676496982574463,
        -0.05887976288795471,
        -0.009931372478604317,
        0.012323832139372826,
        0.012536673806607723,
        0.005000578239560127,
        0.018732689321041107,
        -0.0388745442032814,
        -0.07313341647386551,
        -0.04268840327858925,
        -0.07985872775316238,
        -0.0017157159745693207,
        -0.009346269071102142,
        0.017612671479582787,
        -0.00707925483584404,
        -0.0895371064543724,
        0.011785866692662239,
        0.0514676533639431,
        -0.05988149717450142,
        0.11215029656887054,
        0.12388290464878082,
        0.03851636126637459,
        -0.08350559324026108,
        -0.0033673662692308426,
        -0.0016242078272625804,
        0.0031445494387298822,
        -0.030463121831417084,
        0.06939063966274261,
        -0.0938747376203537,
        0.076152004301548,
        0.04452703520655632,
        -0.023266682401299477,
        0.05651860684156418,
        0.03251437097787857,
        -0.0032711762469261885,
        -0.059347640722990036,
        -0.0031807024497538805,
        -0.015834825113415718,
        -0.03623468056321144,
        7.494712473868925e-33,
        0.053890250623226166,
        0.11648360639810562,
        0.002624938730150461,
        -0.035037145018577576,
        0.005283808335661888,
        0.01948412135243416,
        0.0674152672290802,
        0.05040737986564636,
        -0.12825752794742584,
        0.049233727157115936,
        -0.09004808217287064,
        0.03748844563961029,
        -0.06121920421719551,
        0.05554535612463951,
        0.015045995824038982,
        -0.05419062077999115,
        -0.0360720157623291,
        0.004086493980139494,
        0.06095266714692116,
        0.010913129895925522,
        0.028259411454200745,
        0.06269709765911102,
        -0.018810946494340897,
        -0.05056009069085121,
        0.03799908235669136,
        0.053142644464969635,
        -0.0583464577794075,
        0.008728982880711555,
        0.11368216574192047,
        0.046797703951597214,
        -0.04828862100839615,
        -0.006676891818642616,
        -0.016742058098316193,
        -0.007189727853983641,
        0.12295131385326385,
        -0.06369588524103165,
        0.0031883823685348034,
        -0.023478494957089424,
        0.0006198260234668851,
        -0.03513024374842644,
        0.018602455034852028,
        0.04063064232468605,
        -0.11683657765388489,
        0.036595169454813004,
        -0.008258088491857052,
        0.05458495765924454,
        0.03870184347033501,
        -0.03180024027824402,
        0.058052148669958115,
        -0.0020940671674907207,
        -0.05815127491950989,
        -5.463748311740346e-05,
        -0.05315176770091057,
        0.07367509603500366,
        -0.061167217791080475,
        -0.11051623523235321,
        0.0030900633428245783,
        0.011145344004034996,
        0.0801721066236496,
        -0.017104241997003555,
        0.018321476876735687,
        -0.043734874576330185,
        -0.06823000311851501,
        0.0030428809113800526,
        -0.07892591506242752,
        -0.020586976781487465,
        0.0690135508775711,
        -0.02280341275036335,
        0.00016758462879806757,
        -0.009066424332559109,
        -0.02533017098903656,
        0.004091301001608372,
        0.05568299442529678,
        -0.00929421465843916,
        -0.04845839738845825,
        0.011638488620519638,
        -0.013308168388903141,
        0.0516800694167614,
        -0.0396689809858799,
        -0.02449018880724907,
        0.004752097651362419,
        0.015232307836413383,
        -0.011994678527116776,
        0.015493600629270077,
        -0.007911207154393196,
        0.044661883264780045,
        0.05143164098262787,
        -0.025521863251924515,
        -0.03829564154148102,
        -0.009253344498574734,
        -0.04608939588069916,
        0.029579484835267067,
        -0.07123101502656937,
        0.05060736462473869,
        -0.0026660363655537367,
        -7.933866143076593e-33,
        -0.04706801101565361,
        -0.0761108249425888,
        0.0020807951223105192,
        0.00368942366912961,
        0.010246792808175087,
        -0.0688994899392128,
        -0.052312955260276794,
        0.04780745133757591,
        0.055163297802209854,
        -0.004031085409224033,
        -0.026478154584765434,
        -0.016964275389909744,
        0.012955122627317905,
        -0.008532386273145676,
        0.008790780790150166,
        -0.01922820322215557,
        0.013932968489825726,
        -0.03711960092186928,
        -0.038690321147441864,
        -0.10198500007390976,
        -0.0028646362479776144,
        0.021382352337241173,
        -0.06419936567544937,
        -0.022265514358878136,
        -0.07652997225522995,
        0.07788742333650589,
        -0.012170499190688133,
        -0.02557380497455597,
        0.018474334850907326,
        0.03789106383919716,
        -0.02468036860227585,
        -0.02622583694756031,
        -0.06639142334461212,
        0.15368084609508514,
        0.019651463255286217,
        -0.004770932253450155,
        -0.020103327929973602,
        -0.03299548476934433,
        0.05353521928191185,
        -0.07526830583810806,
        0.07623296231031418,
        -0.001041818642988801,
        0.0037499850150197744,
        -0.046045929193496704,
        -0.10622531175613403,
        -0.0772668868303299,
        -0.009954706765711308,
        -0.046242132782936096,
        0.07659544795751572,
        0.03730832412838936,
        0.06334686279296875,
        0.04246924817562103,
        0.04794875904917717,
        -0.03651946410536766,
        -0.02496063895523548,
        -0.04163593426346779,
        -0.020631734281778336,
        -0.02229142189025879,
        -0.03232075273990631,
        -0.019276507198810577,
        0.0816560834646225,
        -0.0015032195951789618,
        -0.0226630549877882,
        0.011969981715083122,
        0.03387000784277916,
        0.04696386680006981,
        0.143135666847229,
        0.07024956494569778,
        0.027728937566280365,
        -0.08672164380550385,
        -0.014343771152198315,
        -0.020478038117289543,
        0.0054491604678332806,
        -0.046536412090063095,
        0.04300098866224289,
        -0.017165102064609528,
        -0.07471851259469986,
        0.0013081784127280116,
        0.0029707199428230524,
        0.009239591658115387,
        0.03945888206362724,
        -0.0064612762071192265,
        0.06773080676794052,
        0.05423690006136894,
        0.06382535398006439,
        0.04669257998466492,
        -0.04446173459291458,
        0.04286910593509674,
        0.04697977006435394,
        0.006100072059780359,
        -0.052454203367233276,
        -0.004450865555554628,
        0.007161435205489397,
        0.09283443540334702,
        0.05576043576002121,
        -5.958898796620815e-08,
        0.03942463546991348,
        -0.05169795826077461,
        0.0347164161503315,
        0.09251422435045242,
        0.007420909591019154,
        -0.012721343897283077,
        0.02422940544784069,
        0.042946722358465195,
        0.015807073563337326,
        0.028820697218179703,
        0.024121010676026344,
        0.008348671719431877,
        -0.1181526929140091,
        0.05321396514773369,
        -0.020703867077827454,
        -0.03589297831058502,
        -0.053067635744810104,
        -0.014665920287370682,
        0.01358303427696228,
        -0.044624246656894684,
        -0.08482565730810165,
        0.006401000544428825,
        0.06904880702495575,
        -0.11640288680791855,
        -0.06582176685333252,
        0.029490014538168907,
        0.020553501322865486,
        0.10286655277013779,
        -0.006999004632234573,
        -0.013216967694461346,
        -0.083452507853508,
        -0.0862342044711113,
        -0.02906188741326332,
        -0.03537603095173836,
        -0.02884366549551487,
        -0.04862559214234352,
        -0.06961654871702194,
        -0.008976680226624012,
        -0.029360024258494377,
        0.04102563485503197,
        -0.005815436597913504,
        -0.021547000855207443,
        0.042256176471710205,
        0.019634529948234558,
        -0.030172450467944145,
        -0.03999527171254158,
        -0.010122581385076046,
        -0.06460149586200714,
        0.0624096505343914,
        -0.009373797103762627,
        -0.08344868570566177,
        -0.002308408496901393,
        -0.012623963877558708,
        0.055880844593048096,
        -0.012893733568489552,
        -0.014873971231281757,
        -0.07011846452951431,
        0.05386318266391754,
        0.0031478977762162685,
        0.05941937118768692,
        0.054462164640426636,
        -0.05683615431189537,
        -0.044866468757390976,
        0.05856601521372795
    ]
}