{
    "id": "3LqtO491Wzg",
    "title": "iPhone 8 DROP TEST! -- Don't drop your new iPhone... ever.",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-11-01T14:59:53Z",
    "video_url": "https://www.youtube.com/watch?v=3LqtO491Wzg",
    "category": "Howto & Style",
    "tags": [
        "iphone 8 drop test",
        "iphone x drop test",
        "Apple phone glass",
        "most durable glass ever in a smartphone",
        "smartphone",
        "mobile phone",
        "technology",
        "iphone 8 review",
        "iphone 8 durability test",
        "do I need a case",
        "phone protection",
        "drop test",
        "durability test",
        "iphone",
        "Apple",
        "New iphone",
        "Glass iphone"
    ],
    "views": 932089,
    "likes": 23573,
    "comments_count": 2609,
    "description": "Get your RhinoShield Mod Case HERE!:  (Use discount code? \"Jerry15\" for 15% off until November 15th) Also available on Amazon:   Its time to test the durability of the glass backed iPhone 8.  Apple has claimed this is the most durable smartphone glass ever.... but does that actually mean anything? Is the glass so special that you wont need a case? OR is apples repair cost SO HIGH that not having a case would be more dumb than usual?   Ill give you a guess... and then watch the video to find out how easy the glass on the iPhone 8 breaks. This is the same glass that is used on the iPhone X so it will be interesting to see if the iPhone X glass is held in place by the same permanent glue as before.   Watch the RinoShiled 100ft drop test here:  iPhone 8 Durability Test video:  iPhone 8 Teardown:   Awesome iPhone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://bit.ly/2lAqkVp",
        "http://amzn.to/2z5iq9P",
        "https://youtu.be/V3oChLwrvzo?t=31s",
        "https://youtu.be/lLAmL6Tz59Y",
        "https://youtu.be/2B1ZxR9xpwQ",
        "http://amzn.to/2xu8VBL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "So you know what's better than one drop test? Two drop tests. I have two more brand new iPhone 8's, which Apple claimed to have the most durable smartphone glass ever. But it's important to remember that even though it might be durable glass, it's still glass. And the unfortunate part about the iPhone glass is that it's incredibly expensive to replace. Even if you have AppleCare, the back glass replacement is $99. And after your two year AppleCare is up, or you don't get AppleCare at all, it's $349. That's expensive for a back glass panel. With Samsung phones you can usually replace that panel for about $20 bucks so there's a big difference. Today's drop test is going to be sponsored by the RhinoShield Mod Case. I'll be dropping one of the phones, the silver one, completely naked. And the other one, the black phone, is going to have the Rhino Shield Mod Case installed on it. This says it's a super tough modular case that changes according to your needs. So we'll put that tough part to the test. Let's get started. [Intro] So both of these phones are brand new and 100% functional. And the case that the black one is going to be wearing is from RhinoShield. On the box it says it's impact resistant to 11 feet, but I've actually dropped a RhinoShield case from over 100 feet and had the phone survive. So I'm pretty sure this phone's going to be alright. Inside the box we have the bumper shield, and as part of the mod part of the casing, we have a back. So you can have the case operate in one of two ways: one is just the bumper shield, or have the back installed as well. Since both the front and back of the phone are made from glass, I am going to install the back cover, just so I can avoid paying that $350 replacement fee. If I wanted to install just the bumper though, I would just slip it into the case like so. It would have a raised rubber lip around the front and the back to protect it from impacts, even keeping the camera lens below that surface. The case fits pretty snug all the way around the phone, but does leave us enough room for the ports around the speaker, the microphone and that charging port. I'm sure if there was a headphone jack there would be room for that as well. And the buttons still have a clicky feel to them. Getting the back glass protecting panel into the phone is easy enough. Just pulled out that rubber insert and drop the phone into the case. Not too bad. If you're not a fan of the clear back, they do have some designer versions, but I'm going to leave mine clear because we are dropping this phone and I want to see if the back panel is protected by the case. The last cool thing is that this case actually comes with lens mounts so you can increase the power of your camera with additional lenses. I'll be testing these out in a second, but first, let's drop these things. Just like last time, I will have two phones recording in slow motion. Right now we have the Google Pixel recording on this side, and then we have the clear Galaxy Note 8 recording on this side. The RhinoShield Mod case does come in different colors. I will have all of these linked down in the video description if you want to check them out. The nice thing about all the different colors of the RhinoShield Mod case is that they don't absorb stains, like from your pocket or bluejeans, which is a little bit more than the Pixel can say. So I think one of the most common times that I drop my personal cell phone is when I leave it on my lap and get out of my car. [Music] I'll leave that there for a second, and try it with the RhinoShield Mod case. [Music] No damage done to the back of the unprotected phone, back or front. Both seem to be working just fine. And no damage appears to have happened to the RhinoShield either. We'll try it one more time for good measure. Getting out of the car with the unprotected case. [Dramatic Music] And getting out of the car with the protected case. [Dramatic Music] Looks like we have one giant crack all the way through the back of the phone, starting up here by the antenna line. Camera lens is still fine, but now we owe Apple $349 to replace this. Taking off the case of the RhinoShield just to double check, and everything is fine. Front of the phone is also undamaged. Let's keep going. And for the record, that is about a 3 foot drop from the edge of my seat all the way to the ground. And the unprotected iPhone is shattered. So now we'll drop the phones from about waist high, which is the second most common drop, just pulling it out of your pocket and letting it go. [Dramatic Music] Looks like the screen of the phone is totally fine and the back panel still has that same crack, but we're still good. And the RhinoShield is good on the front and good on the back. We'll do another waist-high drop for good measure. This is drop number 4. [Dramatic Music] Front of the phone is still good. Back of the phone is the exact same. Front of the phone is good, and the back of the phone is still not cracked. Now we'll be going about chest high. This is drop number 5. [Dramatic Music] Take a look at the damage. It looks like we have a couple more cracks along that side right there. On the front of the screen...ah, now we have damage on the front as well. We got a nick right there on the corner, as well as a crack in the top. The RhinoShield case...we are looking totally good on the front. And if we pop the case out...it's a pretty tight fitting case, the back panel is still fine. So we owe Apple nothing to fix this phone so far. The unprotected phone now has screen and back panel replacements, and with Apple's in-house repair costs, it might be cheaper to buy a new phone at this point. Alright, now we'll be doing head high, as if it slips from your hand as you're talking on the phone. [Dramatic Music] Taking a look at the silver phone...same cracks as before, nothing new yet. And we have a new spiderweb in the corner of the screen. Pretty safe to say that this phone wouldn't survive any kind of drop over 3 feet. Now we have the 11 foot protected phone, and the screen is still fine and the back panel is still good underneath that plastic. So I'm about 6 feet tall. I'm going to raise my hand above my head and drop it from there just for kicks and giggles and see what happens to both phones. This is about an 8 foot drop, give or take. [Dramatic Music] Aw man. And it is pretty easy to tell that the iPhone 8 did not survive that at all, even the camera lens is completely shattered on that one. We are doing this drop test on asphalt to imitate a parking lot, you know, whether you're in your car and getting out...dropping it as you're getting groceries. Both the screen and the back are completely obliterated. Taking a look at the RhinoShield case...no damage on the front. We'll pop it off and take a look at the back. And the back panel of the phone is completely fine. So now after having dropped 4 different phones in 2 different drop tests, I think it's pretty safe to say that it doesn't matter what Apple says about their most durable glass ever, glass is glass and it's going to break if it's dropped. It's very unfortunate about their super high repair costs that I'm not a fan of. Personally, I'll be trying to find a way to fix it cheaper than what they're charging as always, but until then, a case is a very good idea. And the one we used today, the RhinoShield mod case, holds up pretty darn well. Like I mentioned before, the RhinoShield case does come with external lenses. We'll try out the macro lens on the damage done to the iPhone 8. And this is the footage done with one of the macro lenses attached to the phone. If we were to unscrew that lens, the footage wouldn't be quite as close up. I'll also try out this wide-angle lens. Super big thanks to RhinoShield for sponsoring this video by the way. This drop test would not be possible without them. Just like a real camera lens. That thing is beastly. So here's some video with that wide-angle lens in place. It's got quite a big field of view with not a whole lot of fish-eye effect. It's letting us capture quite a bit into the image. I'm going to unscrew the lens for kicks and giggles...and we are much closer up. I'll be linking all of those cases and lenses in the video description of this video. So head down there if you need protection for any of your phones. Once again, thank you so much for watching. I don't always delight in the abuse of iPhones, but sometimes it's necessary. Thanks a ton for watching and I'll see you around.",
    "transcript_keywords": [
        "RhinoShield Mod Case",
        "phone",
        "Case",
        "back",
        "Mod Case",
        "drop",
        "RhinoShield",
        "RhinoShield Mod",
        "glass",
        "back panel",
        "RhinoShield case",
        "phones",
        "back glass",
        "front",
        "Mod",
        "good",
        "lens",
        "panel",
        "drop test",
        "Apple"
    ],
    "transcript_entity_values": [
        "Google Pixel",
        "AppleCare",
        "iPhone",
        "100%",
        "two",
        "3 foot",
        "jack",
        "about 6 feet",
        "Two",
        "nick",
        "over 100 feet",
        "two year",
        "about $20 bucks",
        "4",
        "11 feet",
        "RhinoShield",
        "349",
        "Galaxy Note 8",
        "the Rhino Shield Mod Case",
        "5",
        "Apple",
        "11 foot",
        "iPhone 8's",
        "first",
        "second",
        "Samsung",
        "today",
        "Today",
        "the RhinoShield Mod Case",
        "iPhones",
        "over 3 feet",
        "99",
        "one",
        "8 foot",
        "350",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "DATE",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "MONEY",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "DATE",
        "LAW",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "CARDINAL"
    ],
    "vector": [
        -0.07138229161500931,
        0.04125845804810524,
        0.1383092850446701,
        -0.04692130535840988,
        0.037103354930877686,
        -0.041591476649045944,
        0.07537718862295151,
        0.11110123246908188,
        -0.03706106171011925,
        -0.038280390202999115,
        0.07625621557235718,
        0.01511042658239603,
        -0.017233839258551598,
        0.09713978320360184,
        0.008020004257559776,
        0.005780348088592291,
        0.018240127712488174,
        -0.055612385272979736,
        -0.10314560681581497,
        0.05950102210044861,
        0.08104334026575089,
        -0.04544473811984062,
        0.008126438595354557,
        -0.060264650732278824,
        0.028557589277625084,
        0.05634045973420143,
        0.012496327981352806,
        -0.09181548655033112,
        -0.06115100532770157,
        -0.03683876618742943,
        -0.02289910987019539,
        0.02440800704061985,
        -0.071507528424263,
        0.053578030318021774,
        0.0003898800350725651,
        -0.03161042556166649,
        0.037849437445402145,
        0.021031193435192108,
        -0.001527766464278102,
        -0.0487896129488945,
        -0.11591541767120361,
        0.006428822875022888,
        -0.0033279552590101957,
        0.05243478715419769,
        -0.0012804429279640317,
        0.03236818686127663,
        0.14616923034191132,
        0.063385508954525,
        0.015698760747909546,
        0.020319541916251183,
        -0.0370345376431942,
        0.016349224373698235,
        0.0068887146189808846,
        0.04883776232600212,
        0.0058068642392754555,
        0.06151086464524269,
        0.018810255452990532,
        -0.055191557854413986,
        0.06008927896618843,
        0.017972281202673912,
        0.07287368178367615,
        -0.028508953750133514,
        0.0053167869336903095,
        0.09498404711484909,
        0.026179293170571327,
        -0.020653562620282173,
        0.03835153579711914,
        -0.050331488251686096,
        -0.013110916130244732,
        0.026445280760526657,
        0.0036278930492699146,
        -0.00679265521466732,
        -0.01948907971382141,
        0.055575743317604065,
        0.009240986779332161,
        0.05017717927694321,
        0.020625686272978783,
        -0.017682429403066635,
        -0.09300705790519714,
        0.04509362205862999,
        0.07736809551715851,
        0.052690450102090836,
        0.020902927964925766,
        0.0222352035343647,
        0.0022268998436629772,
        0.02986311726272106,
        0.006610346958041191,
        0.039342284202575684,
        -0.03475555032491684,
        -0.06485849618911743,
        0.04004358500242233,
        0.1272120624780655,
        -0.06972846388816833,
        -0.018695827573537827,
        0.04091799259185791,
        -0.05289109796285629,
        -0.030302744358778,
        -0.059832099825143814,
        -0.06009228900074959,
        0.028486905619502068,
        0.04528959095478058,
        -0.11096255481243134,
        -0.004338225349783897,
        0.029174121096730232,
        0.004631425719708204,
        -0.12423990666866302,
        -0.06887965649366379,
        -0.05854858458042145,
        -0.017156289890408516,
        0.0875023677945137,
        -0.017847690731287003,
        0.007992417551577091,
        -0.016630982980132103,
        0.052307166159152985,
        -0.0019449953688308597,
        -0.02691321261227131,
        -0.013945749029517174,
        0.05784052237868309,
        0.022547615692019463,
        -0.007299899589270353,
        -0.0323031060397625,
        0.05387382581830025,
        -0.020142903551459312,
        -0.0059572686441242695,
        -0.006732665002346039,
        0.012648752890527248,
        -0.06723827123641968,
        1.9741024375679025e-33,
        0.02084251493215561,
        0.048143599182367325,
        -0.0318334624171257,
        -0.032373037189245224,
        0.01706826500594616,
        -0.10682357102632523,
        0.058537766337394714,
        0.06761015206575394,
        -0.020609943196177483,
        0.04973507672548294,
        -0.022250598296523094,
        -0.025199241936206818,
        -0.04510432481765747,
        -0.08537828922271729,
        0.03107435815036297,
        0.014217955991625786,
        -0.015391973778605461,
        -0.011114378459751606,
        -0.062130361795425415,
        -0.014766911044716835,
        -0.05353142321109772,
        -0.03868987038731575,
        -0.052680641412734985,
        0.09312822669744492,
        -0.010594473220407963,
        0.052164532244205475,
        0.10474898666143417,
        0.002921690233051777,
        0.044826362282037735,
        0.003828485729172826,
        -0.09030608087778091,
        0.027121437713503838,
        -0.010748207569122314,
        -0.0003335826622787863,
        0.003251298563554883,
        -0.0074721211567521095,
        0.010244706645607948,
        -0.023443235084414482,
        0.044860027730464935,
        0.0015198505716398358,
        -0.12748605012893677,
        0.04000081866979599,
        0.04874846711754799,
        0.00973333790898323,
        0.07159364968538284,
        -0.029925156384706497,
        -0.12796999514102936,
        0.028483858332037926,
        -0.06085934862494469,
        -0.06395837664604187,
        0.03246893733739853,
        -0.07779164612293243,
        0.009444810450077057,
        0.012043344788253307,
        -0.1435464769601822,
        0.021342726424336433,
        0.03418717533349991,
        -0.021236348897218704,
        0.020606957376003265,
        0.01810705102980137,
        0.016528882086277008,
        -0.018532054498791695,
        -0.04142921417951584,
        0.046552903950214386,
        -0.049594394862651825,
        0.037161871790885925,
        -0.05861985310912132,
        0.00450283894315362,
        -0.042935848236083984,
        0.04055383801460266,
        0.0023344536311924458,
        -0.028386443853378296,
        -0.03598233312368393,
        0.02395620010793209,
        0.04403207078576088,
        -0.017845597118139267,
        -0.03132230415940285,
        -0.0254049152135849,
        0.030213287100195885,
        0.0356455035507679,
        -0.024726079776883125,
        0.0442633293569088,
        0.056735504418611526,
        -0.06513373553752899,
        0.014384748414158821,
        -0.057680223137140274,
        0.03307465836405754,
        -0.08036358654499054,
        0.028865264728665352,
        -0.010946949012577534,
        -0.0039666942320764065,
        -0.0843798965215683,
        -0.0585564486682415,
        -0.04216766357421875,
        0.055712055414915085,
        -3.422134418944368e-33,
        -0.027424508705735207,
        -0.0936039388179779,
        0.049604423344135284,
        0.005390208680182695,
        0.08568735420703888,
        -0.058126889169216156,
        -0.004210515879094601,
        0.1234830990433693,
        0.010419641621410847,
        -0.08287034183740616,
        -0.01670124940574169,
        0.05598114803433418,
        -0.03480380028486252,
        0.06613977253437042,
        -0.06794755905866623,
        -0.0077616130001842976,
        -0.020071452483534813,
        -0.10509996861219406,
        -0.005879268515855074,
        0.06224508956074715,
        0.12347523123025894,
        0.004565988667309284,
        0.015198011882603168,
        0.028408989310264587,
        -0.052453938871622086,
        -0.07790199667215347,
        0.042390719056129456,
        -0.02858937717974186,
        0.03533012792468071,
        -0.017395276576280594,
        0.014154965989291668,
        -0.0800420418381691,
        -0.030051011592149734,
        0.08595993369817734,
        0.008533084765076637,
        0.026638220995664597,
        0.030699212104082108,
        -0.08054998517036438,
        -0.02672198973596096,
        -0.0968087762594223,
        -0.001640682341530919,
        0.049141984432935715,
        -0.004984711296856403,
        0.019269615411758423,
        -0.002289347816258669,
        0.02176669053733349,
        0.04718354344367981,
        0.0186788160353899,
        0.01735120452940464,
        0.04858732968568802,
        -0.0068757859990000725,
        -0.01758916862308979,
        0.003889264538884163,
        0.028943698853254318,
        -0.04254259169101715,
        0.01096213050186634,
        0.03412376716732979,
        -0.05894392728805542,
        -0.03715746849775314,
        0.027070458978414536,
        0.06983870267868042,
        0.08136844635009766,
        -0.012737534940242767,
        -0.048520226031541824,
        -0.04989597201347351,
        -0.07245157659053802,
        0.03919817879796028,
        0.022457771003246307,
        -0.05585652217268944,
        0.004228603560477495,
        0.007521263789385557,
        -0.021526306867599487,
        -0.007428539451211691,
        -0.047119926661252975,
        0.08012858033180237,
        0.054079651832580566,
        -0.04410093277692795,
        0.01620052196085453,
        -0.017416561022400856,
        0.012743121944367886,
        0.03730408474802971,
        0.021924033761024475,
        0.01590600796043873,
        0.06536837667226791,
        0.07577560842037201,
        0.021699441596865654,
        0.09150956571102142,
        0.04062459617853165,
        -0.04173508286476135,
        0.07350998371839523,
        -0.04014601930975914,
        0.010733985342085361,
        -0.026486150920391083,
        0.04292202740907669,
        -0.04073113948106766,
        -4.870538816703629e-08,
        0.043573834002017975,
        -0.005902490578591824,
        -0.008051101118326187,
        -0.05458887293934822,
        -0.008854512125253677,
        -0.00306585431098938,
        -0.02368026413023472,
        -0.01462556142359972,
        0.07693378627300262,
        -0.12205778062343597,
        -0.06652534753084183,
        -0.04467562213540077,
        -0.11448542028665543,
        0.10514473170042038,
        -0.08551973849534988,
        0.001313751214183867,
        0.01638399064540863,
        0.05672585591673851,
        0.004148227162659168,
        -0.02414357103407383,
        -0.03744323179125786,
        -0.019611390307545662,
        0.13570518791675568,
        -0.012312540784478188,
        0.019402794539928436,
        0.09232316166162491,
        -0.08497918397188187,
        -0.05716845393180847,
        -0.0036985657643526793,
        0.014943703077733517,
        -0.005854187533259392,
        0.006967839319258928,
        -0.018625395372509956,
        0.041523728519678116,
        -0.038039181381464005,
        0.03559765964746475,
        -0.09160379320383072,
        0.04780001938343048,
        0.03035033866763115,
        -0.02559228241443634,
        0.027933219447731972,
        -0.10221511870622635,
        0.012700933031737804,
        0.031934238970279694,
        0.025881441310048103,
        -0.06636101007461548,
        0.03280171751976013,
        -0.11838965117931366,
        -0.017894409596920013,
        0.05302635207772255,
        0.0209968164563179,
        -0.0817691832780838,
        -0.038030315190553665,
        -0.021387746557593346,
        0.0053410641849040985,
        -0.00496736029163003,
        0.08186909556388855,
        -0.017880752682685852,
        0.005671012680977583,
        0.005587594583630562,
        0.02967563085258007,
        -0.06285400688648224,
        0.06479611992835999,
        0.07154835015535355
    ]
}