{
    "id": "3Mcw9MX1MJI",
    "title": "Does the PS5 Even Matter?!",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2019-10-04T17:15:14Z",
    "video_url": "https://www.youtube.com/watch?v=3Mcw9MX1MJI",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "playstation 5",
        "stadia",
        "google stadia",
        "ps5",
        "tech",
        "cloud gaming",
        "ps5 latest news",
        "ps5 leaks",
        "#xboxscarlett",
        "#sonyps5",
        "playstation 5 leaks",
        "#playstation5",
        "ps5 dev kit",
        "apple arcade",
        "microsoft",
        "sony",
        "microsoft xcloud",
        "xcloud",
        "xcloud demo",
        "psv",
        "xbox news",
        "project xcloud",
        "#xboxonex",
        "#ps5",
        "xbox scarlett",
        "project scarlet",
        "apple arcade games",
        "stadia vs xcloud",
        "ps5 update",
        "cloud",
        "xcloud vs stadia",
        "psnow",
        "switch",
        "nintendo",
        "nintendo switch",
        "gaming news",
        "tech news",
        "ps5 news"
    ],
    "views": 183728,
    "likes": 5407,
    "comments_count": 1133,
    "description": "We've got some hot takes about the PS5 and Xbox Scarlett  We Tried Apple Arcade and Play Pass so You Dont Have To:  WHAT Was Nintendo Thinking?!  Is Apple Replacing the Game Console?!  Netflix SAVED Piracy :  Is It Time to DITCH Chrome?:   #ps5 #googlestadia #xboxscarlett   Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://youtu.be/b7V8JvEqPfs",
        "https://youtu.be/b7V8JvEqPfs",
        "https://youtu.be/5ZHHXZXTISY",
        "https://youtu.be/3PCs_jcOFdI",
        "https://youtu.be/se5PS2AjKY0",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hey, guys, and welcome to This Is. Matt, why is the PS5 doomed to failure? (upbeat music) Is that too strong? - I don't (laughs) yeah, for me. - Okay, tell me more. - I don't know why it's doomed, I don't think it's doomed. I think it's gonna do very well. So, I'm the definition of a casual gamer. - You play Bloons, that sounds about right. - Yeah, I've gone on record multiple times that my favorite game series is Bloons Tower Defense, I'm pretty good at it. So, we did a couple of videos now on Apple Arcade and Google Play Pass, and how the mobile game and cloud gaming, they're on the rise, and they're gonna be cutting into console space, and our fans did not like that. - What? Are you trying to say that the people on the internet were upset when we made some speculation about the future of gaming? - Yeah, yeah. I think most of the comments are just, \"No.\" - (laughs) Okay, but hold on, hold on, hold on. I disagree with that, though. As much as I do think, that while cloud gaming has a thing, I think consoles are the future, even consoles are getting into it, right? Xbox Live and Xbox Game Pass Ultimate is one of the best deals in gaming right now. Yeah, for 15 bucks a month, you're getting PC games, you're getting Xbox games, you're also getting Xbox Live Gold, which is already worth like, what? How much is Gold these days? What, like, eight bucks a month or something? 10 bucks a month? - I wouldn't know. - Well, you're a terrible gamer. - I am a terrible gamer. - Well, you're a casual Bloons gamer. - I'm a hardcore Bloons gamer, I'm a casual every other game. - Okay, you can get a 12 month trial, or a 12 month pass for Xbox Live Gold for about 40 bucks. - Sure. - So, it's a pretty good deal, but the thing is consols and the entire gaming industry I do think is on the edge of a huge, huge shift. So, things are changing. - Yeah, and that makes me wonder why should anyone care about the PS5 and the Scarlett. - Dude, consols push the industry forward. There's no doubt. So, all of the times I think when people look at things like PC gaming and console gaming and then you obviously can go down to cloud gaming and mobile gaming, but most of the Triple-A games, a lot of the techniques, a lot of the technology is honed in the console and the PC space. Now, the console is certainly the most powerful, I'm sorry, I rephrase, the PC is the most powerful gaming platform available. However, the PC, with some limited exception, isn't enough to be stand-alone, right? Most of the time, if a game comes out for PC, it also needs to come out for consoles, specifically with Triple-A to make the budget back, so even though you might have all the extra bells and whistles on PC, ultimately, it is limited by the lowest common denominator, which is, typically speaking, the console. You already saw this in the last generation, the Xbox 360 and PS3 generation, partially because, even though they were fairly powerful consoles for back in the day, they got aged fairly quickly, and specifically really quickly once they got like four, five, six years older, where the PCs of the time were way, way more powerful. So, the fact that developers still had to make their games for the 360, and they could try to bring it up to PC. I think a good example of that is when we saw PS3 PS4 shift. The PS4 had like 16 times more memory. So, all of a sudden, we saw so many more huge, open world games, loading times, there was these all these advantages, and it came to everyone, because the base, the consoles that were holding everyone back, had been upgraded. So, I do think the consoles, even though they're not the most powerful thing in the world, even though PS5 is looking pretty solid right now, but I do think that the consoles, being the lowest common denominator, really do help push the industry forward as consoles get Rate Racing, Rate Racing is going to become more standard on PC, it's going to trickle down, we'll see an iPhone 13 with RTX on. All these things will happen, but I think the consoles are the big, we can't see a lot of these major improvements without consoles being on board, at least, at some point. - All right, okay, so we build a PS5. - [Austin] It's right here. - Right behind you. - Right here, right here. beside, a wonderful This Is play button. - Yeah, hey. - Hey, for real. - Hey. We built this with off the shelf parts from AMD, we were able to get them a couple of months ago, like two months ago. - I did a full video on Mii Channel talking about building the PS5, and, essentially, it comes down to this, at this point, the PS5 and the Xbox Scarlett are both official consoles, right? They're both on the record, they're both coming out, almost definitely, end of next year, and because of that, we actually know some specs about them, right? So, we know that they're using AMD Zen 2 processors, in the PS5 case, we know it's an eight-core, we know they're using fast memory, we know that they're shipping with default SSDs, which is going to help cut down load times. We also know a little bit about the graphics because it is based on Navi, which is something that you can buy in the PC space. So, what I wanted to do is, essentially, buy all the components that I could which were as close as possible to the PS5, and test to see how much more powerful it would be, which is not something that you usually do, because a lot of times, consoles are using weird, customized components, and that's certainly going to be the case this generation, but this is the first time in a very long time that we've actually been able to build a PC which is before the consoles come out, a very similar spec to test on. - But we did that a couple months ago, PS5, Scarlett, they're what, 18 months out? - I'd say probably closer to 12 to 14 at this point. - That's a long time in hardware. By the time the PS5 and Scarlett come out, they're already outdated, there's gonna be... - Well, I guess. - There's gonna be Navi 2 or whatever. - Maybe. - It won't be a whole new architecture, what we're speculating, and we underclocked this. - We did, yeah. - So, there's going to something even more powerful available. So, one, the question is if I need power, why not just grab a PC-- - Sure, of course, you can always build a PC or buy a PC. - For me personally, though, my biggest thing is does the specs matter anymore if cloud gaming is gonna be a bigger thing in the future? - It still matters. Okay, so let's take Stadia versus something like PS5, for example. So, with the PS5, what you're getting, or what you should be getting, everything we know, is a mid-upper range gaming PC of today, right? So, eight-core processor running at decent clocks, graphics which should be pretty well capable of playing 4k30 and 4k60, theoretically, 8k, but I highly doubt we'll see that, but you're seeing a console with an SST, you're seeing something which is very, probably, the equivalence of, say, I know for this system that we built, if you're trying to build it right now, it's like $1,200 or so. I'd say by end of next year, you're looking at $1,000 PC or something, right? But when you look at that compared to, say, Stadia, right, which, Stadia is actually on paper a more powerful system. It's in the cloud, but each of the individual console nodes are very, very powerful. They're like proper high-end PCs, also based on AMD, but I guess the thing that I really take away from the idea of the PS5, and why it doesn't have to be cutting edge, it's because consoles never are. Consoles are not, if you want the leading edge, the absolute best kind of tech that you can get your hands on, PC, of course, obviously. PCs had Rate Racing for what? Like a year now? But, that being said, it's not the volume thing, right? It doesn't matter, developers are not gonna make these insanely high-end games for 2% of the PC audience, or 2% of the gaming audience, they're gonna do it for 60%, which includes PS5s and Xboxs and stuff. So, yeah, these consoles are not going to be the super, ultra, high-end, but consoles have never been the highest end, right? Like when the PS4 came out, it was a very good value, it was, again, probably equivalent to a seven, eight, $900 gaming PC, but, that being said, it was obviously much cheaper, and because there's so much more optimization they can go on on consoles. Look at some PS4 games. If you look at a PS4, which is equivalent to, again, a mid range, mid to upper range gaming PC from 2013, you look at something like Spider-Man, or Uncharted, or anything like that, it's incredible what they've been able to pull out, right? So, I think it's a little bit of a combination of having years to optimizing absolutely everything out of these consoles, and also the fact that the consoles don't have to be the highest of high-end specs, as long as they're a big step up, that's sort of the floor that everyone can expect to develop on for the next generation. - So, which is all great on paper, and my argument is also on paper, but that means every time you wanna go to a next generation, millions of people have to upgrade their system, which is great for a developer like Sony or Microsoft selling new-- - New consoles. - New consoles, but with proper cloud gaming, Stadia is the closest thing right now. The Xbox-- - [Austin] xcloud is kind of up in the air. - It's there, the true promise of cloud gaming is that you can play these Triple-A titles with a potato, because all that processing is done serverside. And so, you don't have to have the top of the line specs anymore. Everyone can have, literally, an iPad, and I could be playing Triple-A title. I did it with Stadia. So, you just played it in Chrome, I was playing Assassins Creed. Now, that means only Google Stadia has to upgrade their system for-- - [Austin] Or their cloud gaming services, I'm trying to say. - Yeah, right. Stadia is just an example of what people know, but that means everyone, instantly, can have access to Rate Racing, can have access to High Frame Rate, obviously, if their monitor supports it, but, to me, it's just the scalability of cloud gaming has a better promise than consoles ever will. - But there are fundamental issues with cloud gaming. - Sure. - One of the big ones is, obviously, you have to have that solid connection, and while, yes, internet connections do get better year over year, people's houses are start getting giggabit, you get lower latencies, but there's still a huge bone lack. Now, even if you say that 50% of gamers have a fast enough internet connection, stream, 4k, High Frame Rate games over something like Stadia, not only are you missing 50%, but at your house, right? Sure, you can through out things like 5G, which are cool and, theoretically, very capable, but are they actually going to be usable? Is that really something that is going to make a lot of sense when you're on the go and you're trying to play a game, and all of a sudden, you drop out of a 5G spot, and all of a sudden you're down to 3G, and your quality crashes. Not only do you have the millions and millions of variables that can throw your game off, but also, you have to consider, that you have to band with caps, I don't think the world is ready for a full cloud gaming experience, I think it makes sense in your home with a good internet connection, but if you're at your home with a good internet connection, why are you not playing on a PS5 or a PC or something? - Which is a good point, I don't think the internet connections are quite there yet-- - Sometimes, they are, just not everywhere. - Right, but the argument can be made, all right, am I playing a Triple-A title at the airport? No. It's probably can count for both of them. You wouldn't be playing at the airport anyway, but like you say, you might as well play it on a console at home, but for someone like me, I like being able to play it anywhere in my home. A console is tied to the living room TV, the bedroom TV, with-- - Well, there's local streaming, though. You could still have it running on a native machine in your house. - But then you still have the same issues of cloud-- - It's not as bad, because you're not going out to the cloud. For local stream, so say like Steam, or Xbox, or whatever the case may is, you're just streaming over your local network, there are far fewer issues there. Generally speaking, I actually feel pretty confidant with that. It's when you go out to a cloud server running somewhere else, you have hundreds or thousands miles of latency, and all those kinds of stuff, that's where it gets more complicated. If you're in your own house, I actually feel pretty good about local streaming. - I have the PS4 stream connector, whatever that app is. That's never worked for me in my own home. So, mainly because the upload gets caps, get capped on both of them because it's sending it both ways. My point, though, is still, I can put it on my phone, I can put it on my iPad, I could take it to any TV I want. - Yeah, that's right. - But with the local streaming, you can't do that. - [Austin] Okay, yeah, that's exactly what you can do. - [Matt] You need extra devices. - Well, it depends. For Windows PCs, there's apps for Xbox. There's obviously Edge cases, but generally speaking, with something like Steam, it's pretty easy to play a game, you're computer's upstairs and you can play it downstairs on your TV with a cheap computer, or even those old Steam links, or whatever. - But I think you're-- - We're getting in the weeds, I guess. - I think you're accidentally arguing, though, for cloud gaming, because-- - No, not cloud gaming, no, it's local streaming, those are two different things. - But local streaming is just the baby brother of cloud gaming. - Yeah, no, but that's, I agree, though, I totally agree. - So, 'cause it's just scaled up. - But scaling up is not as simple as you're saying, like it's be fixed. You can make a PS5, which is more powerful than the PS4, done, right? - Yeah. - Local streaming is not crazy difficult. It's been done before, it works really well. But when you get out of that, sure, if you live fairly close to a Google data center with a bunch of Stadia machines that are all spun up, you have a fast internet connection to that data center, there's no reason why you can't get a very solid experience, but if you're in that limited experience, what's the point of cloud gaming when I can just turn around and I could be on a PS5 or something, right? I think the real draw for me with cloud gaming is the fact that, yes, you get the hardware out of the way, that is an advantage, I'll totally give you that, it's much cheaper to buy a $200 HP stream and play on that forever versus upgrading your PS5 or your PC or whatever, but beyond that what the problem is is that the cloud gaming idea and the promise is it's gonna work everywhere, right? You're gonna be in the subway on the way to work, or whatever the case is, you're gonna be playing your games, when real world internet connections are okay, but they're too spotty for anything resembling a Triple-A experience right now. So, I'd say the issues that you might have with locals streaming are 100 times worse when you get out in the middle of the world. Sure, you might have a little 5G hotspot, like, \"Oh, \"I've finally found this little sliver of 5G, \"I'm gonna play my 4K game,\" but that's not realistic for most people. That's where I'm coming from. - That's assuming you're trying to play a Triple-A title every time. Then what about all of the Indie titles? - Don't run that on the device. - Right. - So, I don't need cloud games. - It's part of Stadia, with Stadia, that's part of the service. - That's fair. - So, who's trying to play a Triple-A title on a subway? If you could, that would be awesome, but you can't do it now anyway. With cloud gaming, you at least have-- - But you can do it with gaming PC, if you to take on-- - Don't be one of those guys who brings your whole rig to Starbucks or whatever. - Hey man, you gotta do what you gotta do, right? - I don't know it just like. - Okay, I will give you one bit of credence to the cloud gaming idea, and that comes to multiplayer gaming, because right now, with multiplayer gaming, it actually is a little bit of a weird process, because everyone has their own computers, there's a host, either one of the people or in the cloud that's the host. So, data's having to be sent back and forth, and back and forth, which adds, not a crazy amounts of latency, but certainly, and it's all the same as you might have with cloud gaming, or pretty much replicated when you play online, right? If you're playing as game such as CS:GO, and you need, some guy's got 10 milliseconds of playing, you've got 50, then you're playing at a huge disadvantage, but one of the advantages with cloud gaming is that if everything is being done in the cloud, everyone's pretty much fighting on an equal playing field, because the latency between systems is, oh, this datum node is talking to this one, it's six feet away, right? There's no real latency there. It's just your latency to the actual server. That's one advantage, and there's also other advantages, you're getting pretty much instant load times, and these Stadia computers specifically, I know we talk a lot about Stadia, but are very powerful. These are very, very high-end machines. - It's powerful and it's fast, and we talk about the new PS5, as are these. They're talking about with Spider-Man, that all that open world stuff was taking 15 seconds to load on PS4, it's gonna be less then a second. Doesn't matter, because you're looking at machines that are four, five, 10 times faster than that. - I don't know if Stadia is that much, but you can certainly imagine you buy a PS5 next year, 2020, it's not replaced for five or six years, whereas Stadia might have two or three major upgrades during that time, so I'll give you that, but then, okay, so the upgrade part, I think, is another part of cloud gaming which is interesting, but I'm not so convinced, because as a gamer, I don't think anyone is all that turned off, or at least, most hardcore gamers are not turned off by the idea of upgrading their hardware on a semi-regular basis, right? If you've got a PC, you're gonna upgrade your graphics card in a few years, or buy a new CPU, or, if you're a console gamer, you're gonna buy that PS4, you're gonna play it for a few years, and then, oh, you know what? That PS4 Pro's looking pretty good? Or oh, the PS5. It's not crazy to think that three, four, five years down the line, you might be ready for an upgrade. So, while yes, it's more expensive to do that, but it depends, right? I think a lot of people still appreciate the superior gaming capabilities of that versus paying for cloud gaming which, the second that you stop paying for your subscription, or whatever the case is, you might lose your games. Obviously, Stadia's not the case. You actually purchase your game, you still play them, as long as Stadia is still running. But I don't know, I see the value proposition, it's not that appealing to me, I don't know. You still need hardware at the end of the day to play cloud gaming too. - Not really. - You need something. You should probably play on Chromecast for Stadia, so. - I definitely play it on my Mac, which, I know, I've got a Mac. If I want a game, I'm not gonna go buy a gaming PC if my whole ecosystem is on Mac. - That's totally fair. - And so, I was playing a Triple-A title on Mac, seamlessly, today. So, yeah, cloud gaming as a whole is definitely not there, but we have something that's working good enough right now, that it just says, it's only gonna get better from here and I think it's something that can scale better and faster than consoles ever can. So, yeah, a lot of people have horrible, hard-lined internet, they use cable companies and ISPs, they're using old copper lines, that infrastructure is not gonna get updated anytime soon, 'cause that's millions, if not billions of dollars, for a company to do, but what's really easy is if they start doing a 5G modem in a house, and 5G is better than most people's wifi, or even hard-lined LAN. So, that's something that can be done in the next year or two. - A little longer than that. - Will it, will it? No. Can it? Yes. So, we're fortunate we live in LA, we have-- - [Austin] There's lots of options. - Lots of options here for us. So, obviously, in other parts of the world, not so much, even in other parts of the country, not so much. Where I'm from in upstate New York, we were through the roof when we had 100 megabit internet, but it's in a year we went from having that 100 megabit internet, we now have an ISP that does gigabit, and that's literally 10 times the performance of that in a year versus incremental for the hardware change. - I'm not gonna argue with you that cloud gaming has a lot of potential in the future, and especially when you combine that with the idea of these subscription services and everything, but I'm saying but for the foreseeable future, three years plus, I think most people should still play on hard consoles, such as PS5, Xboxs, or play on PC. I think that still is going to be the superior gaming choice. There's still too many compromises with cloud gaming, and I certainly don't think that for this generation, you should throw your PS5 in the garbage and go buy a Chromecast with Stadia. I just don't think it's there yet. - But I also just don't think is worth it to get a PS5 day one when it's six, even maybe $700. - That's a whole different conversation if that's going to be that expensive. - Because how many phone videos have we done? - A lot. - [Matt] Like dozens? - Quite a few. - The number one comment for every phone video is this is too expensive for me. I never get that comment because it's the same people, oh, just buy a new gaming PC, or buy a new console or whatever for gaming, which it doesn't matter whether it's a $300 Pocophone or $1000 Apple iPhone, people say a phone's too expensive, but if a phone could do everything for you, including in this case gaming on Triple-A, yeah, it's not the best to do, it's not the same as a 55 inch TV, but if you can game on a phone, what's the point of a $600 gaming console that's doing the same thing? - But then, I guess I would argue, that if that's the future you see, mobile gaming is getting better and better, that is running natively. Look at Apple Arcade, right? Apple Arcade as a lot of games which are, if not Triple-A, they're getting close. - We'll say Double-A. - I think that's actually a definition, I don't know, but regardless, their games that are looking really good, and they're running natively on the phone. Phones are getting to the point where, if consoles are bumping up every 5 years, they double and or triple, phones are doing that almost every year. There's definitely a point in which phones are going to be, if not caught up, much, much closer, which I do think removes some of the argument that you need cloud gaming. I'll throw the switch at you, look at the Wii U, right? The Wii U was very much a proto switch. It was a very early version, and a few years later, they were able to really get rid of the console, shrink the gamepad down, and put everything in it, and that's almost entirely because of the mobile technology inside. You can imagine, a little bit farther down the line, why couldn't you have a portable Xbox or a portable PlayStation, or why couldn't your phone have all the PS4 solutions when they cut giant deal with Sony or whatever? I see that as being a better and more realistic future of everything as switches and phones what docs and stuff versus cloud gaming, 'cause I get it, cloud gaming seems cool, but at the end of the day, these companies want to sell hardware too. The native experience I don't think will ever be better on cloud. I think for multiplayer games maybe, maybe you might get a little bit of a better experience when you have those perfect setups, but I think I would bet a lot more on mobile than anything else. - This is a thing that is pretty much every any industry, is does it have to be better or does it have to be good enough? Where does the convenience outweigh the better performance? - But isn't it more convenient to not have to deal with your ISP giving you a, \"You used too much 5G data this month, \"stop paying Bloons so much.\" - Maybe, but that's something we don't know. You're right, it probably will happen, just because ISPs suck, but we don't know that that's going to happen. - You raise your whole premise here is that your betting on ISPs to not suck. (laughter) - [Ken] Well, yeah. - I think I just won this argument, I think it's over now. - I may be a casual gamer, but I am a power user when it comes to downloading and uploading stuff. I've never gotten a band with cap, I don't have Comcast so, but what happens when we have 8k gaming with Rate Racing? Look at the day one patches on a console right now, you get the game and then suddenly, oh, yeah, it's a five-hour download because we need to download the entire game again onto your console. That's eliminated with cloud gaming. So, there's the convenience factor there, but if I'm a developer, and I'm looking at, and this is why so many people are hopping on, when you look at why developers only develop for iOS, if I have to develop a game to reach as many people as possible, something like Stadia looks super appealing to me, because, obviously, if it gets traction, but because I know the hardware to for all these people, obviously, it's whatever the majority is, but they don't need to redevelop something for Xbox, they don't need to make a port for PS4, and they don't need to make it for PC if you just say, \"Oh, \"we're going to put it on a cloud service \"which can be used on any device.\" So, that's appealing to me as a developer. Again, obviously, that's banking on something being popular enough to have that masses, but why would I spend resources to develop it three times if I can do it once and be done? - That's fair. I think there is a lot of cross-platform capability in the fact that Stadia, and the consoles, and all the gaming PCs are running AMD hardware, it does make that a little bit simpler. I know I've heard I think it was Ubisoft, they're mostly focusing on Stadia for upcoming games, they were like, \"Oh, yeah, \"it's not that much more expensive to throw Stadia in \"as one of the things that we support.\" But I think, regardless, it's a super interesting time to be a gamer. No joke. I think there's a lot of really cool stuff going on between subscriptions which doesn't sound good, but some of these are legitimately interesting. - There are pro's to subscription. We just did the video last week about Apple Arcade and Game Pass, and there's some really good games on there for five bucks a month for Apple Arcade, the Game Pass is if you play literally any Android game, it's worth it. Obviously, you don't own them, which is a downside. You have to keep paying in order to play those, but you're also getting all of these updates, you're getting huge access. So, there's pros and cons that, I personally like to own my own games, but another reason why I don't like console gaming is I've switched consoles throughout my life, I've bought a Grand Theft Auto V four or five times for PS3, PS4, PC, Xbox. - [Austin] Why? - 'Cause that's what I'm playing at that time. - Oh, so you just bought for every console. So, you got a new console or PC, you were like, \"Oh, you know what? \"Time to play GTA again.\" - Yes, yeah, so. - You can just go for Stadia and stream it to all of your devices and you'll be living the happy, perfect life. - Exactly. - I'll be playing PS5 and Xbox and PC because that's superior way to game. I think we should leave it there. - Yeah, fair. - What do you guys think about this format? I'm really curious to know. We've been talking about this for a while, and this is something that I think we'd like to talk about in the office a lot, because of the different ideas with the gaming stuff, and specifically with Xbox and PS5. There's so many things that are coming out right now that I think it's super interesting to look into what exactly gaming's going to look like in three, five, seven years. I'm curious, what do you guys think is going to be the winner of the next generation of gaming? Is it cloud gaming, is it mobile, is it PS5 and Xbox, PC? Are we all just going to all stop playing games and go back to tic tac toe? Let me know in the comments below. Matt, would you like to add anything, 'cause I can't make fun of you since you're already here? Can you do an Outro for me? - Thank you so much for watching this episode of This Is. If you wanna tell me how much you hated it my opinion, just go ahead and leave it in the comments. You can check out some other episodes here, but, yeah, thanks for tuning in. - That was a good one, I think they're gonna definitely let you know. - Oh, yeah, yeah. (upbeat music)",
    "transcript_keywords": [
        "cloud gaming",
        "gaming",
        "cloud",
        "Stadia",
        "consoles",
        "Xbox",
        "yeah",
        "game",
        "play",
        "console",
        "games",
        "Xbox Live Gold",
        "Rate Racing",
        "Xbox Game Pass",
        "people",
        "lot",
        "Xbox Live",
        "times",
        "time",
        "playing"
    ],
    "transcript_entity_values": [
        "Navi 2",
        "New York",
        "2013",
        "Android",
        "AMD",
        "three",
        "millions",
        "55 inch",
        "the day",
        "the next year",
        "18 months",
        "Navi",
        "5",
        "the end of the day",
        "the PS4 stream connector",
        "a few years",
        "2%",
        "CPU",
        "three years",
        "15 seconds",
        "two months ago",
        "50%",
        "six feet",
        "1,000",
        "Chrome",
        "Bloons Tower Defense",
        "50",
        "billions of dollars",
        "Xbox 360",
        "Edge",
        "Xbox Live Gold",
        "Microsoft",
        "the Xbox Scarlett",
        "Google Stadia",
        "Spider-Man",
        "PS4",
        "AMD Zen 2",
        "4k",
        "Grand Theft Auto",
        "CS",
        "GTA",
        "60%",
        "Bloons",
        "Stadia",
        "Google",
        "Matt",
        "2020",
        "dozens",
        "iPad",
        "PS4 Pro's",
        "Austin",
        "every 5 years",
        "Indie",
        "600",
        "Assassins Creed",
        "12",
        "10 bucks",
        "six years older",
        "700",
        "12 month",
        "Xbox",
        "five",
        "LA",
        "first",
        "the Game Pass",
        "ISP",
        "month",
        "10",
        "next year",
        "five-hour",
        "PS5",
        "Scarlett",
        "Bloons",
        "a couple months ago",
        "Comcast",
        "Chromecast",
        "millions and millions",
        "Apple Arcade",
        "AMD",
        "LAN",
        "about 40 bucks",
        "Apple iPhone",
        "4k60",
        "a few years later",
        "SST",
        "five bucks",
        "this month",
        "Xbox Live",
        "4",
        "HP",
        "hundreds or thousands miles",
        "Uncharted",
        "last week",
        "200",
        "these days",
        "second",
        "five",
        "seven years",
        "Xboxs",
        "PlayStation",
        "five or six years",
        "PS3",
        "a couple of months ago",
        "one",
        "Mac",
        "five years",
        "PS4",
        "four",
        "Mii Channel",
        "100 megabit",
        "14",
        "today",
        "15 bucks",
        "High Frame Rate",
        "eight",
        "year",
        "eight bucks",
        "six",
        "years",
        "a year",
        "3",
        "a 12 month",
        "1,200",
        "Ubisoft",
        "Rate Racing",
        "two",
        "almost every year",
        "Google Play Pass",
        "Steam",
        "Sony",
        "100",
        "Triple-A",
        "Mac",
        "16",
        "seven",
        "Starbucks",
        "8k",
        "10 milliseconds",
        "$300 Pocophone"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PERCENT",
        "ORG",
        "DATE",
        "TIME",
        "DATE",
        "PERCENT",
        "QUANTITY",
        "MONEY",
        "ORG",
        "FAC",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "NORP",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "ORDINAL",
        "EVENT",
        "NORP",
        "DATE",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "MONEY"
    ],
    "vector": [
        -0.0029139185789972544,
        -0.0945199728012085,
        0.09765181690454483,
        -0.08585142344236374,
        0.05558202415704727,
        0.08400297909975052,
        0.035240430384874344,
        -0.013350128196179867,
        -0.017122521996498108,
        0.07792534679174423,
        -0.03506532683968544,
        0.05130477994680405,
        -0.004249698016792536,
        -0.07551835477352142,
        0.06292015314102173,
        0.0923195406794548,
        0.06242726370692253,
        -0.08414336293935776,
        -0.09829424321651459,
        0.053379785269498825,
        -0.058309104293584824,
        -0.06508646160364151,
        -0.04704594984650612,
        0.06793976575136185,
        -0.0947481095790863,
        0.0858997106552124,
        -0.033738426864147186,
        0.03508583456277847,
        -0.1223028153181076,
        -0.011278916150331497,
        -0.09888885915279388,
        0.02961505576968193,
        -0.023389138281345367,
        0.04228416085243225,
        -0.0014230721862986684,
        -0.07005531340837479,
        0.012719431892037392,
        -0.02895044907927513,
        -0.08118612319231033,
        -0.08082833886146545,
        -0.06301552802324295,
        -0.0020180256105959415,
        -0.058389537036418915,
        0.06356139481067657,
        0.0381479486823082,
        -0.032671812921762466,
        -0.06912188231945038,
        -0.06652651727199554,
        0.011227529495954514,
        0.0448588989675045,
        -0.0031384634785354137,
        -0.0288294218480587,
        0.08002908527851105,
        -0.03591451048851013,
        -0.0749143585562706,
        0.040925152599811554,
        -0.021419966593384743,
        0.04710821807384491,
        0.15959134697914124,
        0.05621478706598282,
        -0.034824930131435394,
        -0.09448175132274628,
        -0.016086939722299576,
        0.04811306297779083,
        0.04421304166316986,
        -0.0056546819396317005,
        0.07571209222078323,
        -0.010490890592336655,
        -0.01682371087372303,
        0.09791299700737,
        -0.05230408534407616,
        0.026694342494010925,
        0.027165545150637627,
        0.02906123176217079,
        -0.049606483429670334,
        0.010902990587055683,
        -0.009289965033531189,
        -0.060245804488658905,
        -0.03424068167805672,
        0.09729991108179092,
        0.08724826574325562,
        0.00861694198101759,
        -0.049795001745224,
        -0.02903127484023571,
        -0.038179073482751846,
        0.0023564414586871862,
        -0.01421587448567152,
        -0.01686081849038601,
        -0.032277174293994904,
        -0.044507548213005066,
        -0.0823865607380867,
        0.007371005602180958,
        0.11634910106658936,
        0.0395306833088398,
        0.012721366249024868,
        0.016293369233608246,
        -0.0487135574221611,
        -0.09217052906751633,
        -0.05605766177177429,
        -0.010520368814468384,
        -0.029915232211351395,
        0.06561358273029327,
        0.05520704761147499,
        -0.05386437848210335,
        0.011460160836577415,
        -0.006595625076442957,
        -0.07385837286710739,
        0.06339216232299805,
        0.05236915498971939,
        0.011217157356441021,
        -0.026301104575395584,
        -0.0010243426077067852,
        -0.038510676473379135,
        0.025379667058587074,
        0.07679304480552673,
        0.08102600276470184,
        -0.050371166318655014,
        0.01711205393075943,
        -0.006665557157248259,
        0.05491974949836731,
        0.049756355583667755,
        0.047798361629247665,
        -0.038844380527734756,
        0.04237283021211624,
        -0.006333243567496538,
        -0.04251958802342415,
        -0.04043784737586975,
        1.563483893726446e-33,
        0.01362520270049572,
        0.011483769863843918,
        0.058774739503860474,
        0.05985912308096886,
        -0.021405339241027832,
        -0.05442488566040993,
        0.0521734245121479,
        0.0492577888071537,
        -0.06944429129362106,
        0.07655024528503418,
        -0.004048458766192198,
        0.022208664566278458,
        -0.1028391644358635,
        0.01506643183529377,
        0.12399851530790329,
        0.00017734273569658399,
        -0.064542256295681,
        -0.022099392488598824,
        0.004057231824845076,
        0.0506867915391922,
        -0.006659329403191805,
        0.0028442246839404106,
        -0.0028211011085659266,
        -0.10442724078893661,
        -0.055976271629333496,
        0.06325480341911316,
        -0.043535299599170685,
        -0.03517703711986542,
        0.04181591793894768,
        -0.004313089419156313,
        -0.09891167283058167,
        -0.03131495788693428,
        -0.05711570754647255,
        -0.011119784787297249,
        0.012740700505673885,
        -0.03979019820690155,
        -0.009448005817830563,
        -0.02407856099307537,
        0.004509878810495138,
        0.001660361886024475,
        -0.05819506198167801,
        0.022639170289039612,
        -0.11167866736650467,
        0.039052627980709076,
        0.04335998743772507,
        -0.05079733207821846,
        0.07094250619411469,
        -0.13134150207042694,
        -0.09523145109415054,
        0.004254887346178293,
        -0.03960477188229561,
        0.031002596020698547,
        -0.009475394152104855,
        -0.00971593614667654,
        -0.014399406500160694,
        -0.05546705424785614,
        0.06689926981925964,
        -0.027927199378609657,
        -0.010869527235627174,
        0.034305114299058914,
        0.13185003399848938,
        -0.0630900040268898,
        -0.02349313162267208,
        -0.04340283200144768,
        -0.042157575488090515,
        0.047390006482601166,
        0.0867609828710556,
        0.017394358292222023,
        -0.013839262537658215,
        -0.02453143708407879,
        0.03022812120616436,
        0.015240970999002457,
        -0.0035785005893558264,
        -0.011373118497431278,
        0.037343040108680725,
        0.05096503719687462,
        -0.036555249243974686,
        0.03575364127755165,
        -0.005701625719666481,
        0.01712977886199951,
        0.04224943742156029,
        -0.017165813595056534,
        -0.0599694550037384,
        0.031118519604206085,
        -0.019477464258670807,
        0.04924311116337776,
        0.10824880748987198,
        -0.07698018103837967,
        -0.04607119411230087,
        -0.0020793736912310123,
        -0.10678927600383759,
        -0.07629020512104034,
        0.014432085677981377,
        0.07591842114925385,
        -0.013344851322472095,
        -3.958109149725452e-33,
        -0.013494153507053852,
        -0.08435656130313873,
        -0.0337696298956871,
        0.016474133357405663,
        -0.07513604313135147,
        -0.005292273126542568,
        0.002755905734375119,
        -0.024431351572275162,
        0.021521983668208122,
        0.02010870724916458,
        -0.023526616394519806,
        0.10144046694040298,
        -0.0069577572867274284,
        0.03722067177295685,
        0.023868553340435028,
        -0.023593178018927574,
        -0.0290266964584589,
        -0.04547782242298126,
        0.009804883040487766,
        -0.031063605099916458,
        0.014290747232735157,
        0.006896374747157097,
        0.013080449774861336,
        0.008208743296563625,
        0.017794888466596603,
        0.059910792857408524,
        0.04749634861946106,
        -0.02635272778570652,
        0.06765484064817429,
        0.05334450677037239,
        0.04134295508265495,
        0.014462689869105816,
        0.07700920104980469,
        -0.039695464074611664,
        0.08135249465703964,
        0.024346239864826202,
        0.023993905633687973,
        -0.016367536038160324,
        -0.04472403973340988,
        -0.042002685368061066,
        -0.050774455070495605,
        0.06024932116270065,
        -0.07132014632225037,
        -0.07790776342153549,
        0.011743253096938133,
        0.0803479254245758,
        0.041479844599962234,
        0.02064286731183529,
        0.06756861507892609,
        0.02316061034798622,
        0.09406564384698868,
        0.008033047430217266,
        -0.0719079002737999,
        -0.06563664227724075,
        -0.035414814949035645,
        -0.07166601717472076,
        -0.08294620364904404,
        -0.012392541393637657,
        -0.04893073812127113,
        -0.0161551833152771,
        0.015232473611831665,
        0.05485616996884346,
        -0.03477894887328148,
        -0.02591075375676155,
        -0.014141443185508251,
        0.06951868534088135,
        0.07707517594099045,
        -0.0062522199004888535,
        -0.01233736239373684,
        0.0037623951211571693,
        -0.10724379867315292,
        0.025109313428401947,
        -0.0047167218290269375,
        -0.04849227890372276,
        -0.0253604743629694,
        -0.008807815611362457,
        0.0443231575191021,
        0.02459152415394783,
        -0.00990395899862051,
        0.03454512357711792,
        -0.050893038511276245,
        0.05219088867306709,
        0.0028095925226807594,
        -0.006135580129921436,
        0.009824787266552448,
        0.004141340963542461,
        0.08209270983934402,
        0.0035299311857670546,
        -0.034460920840501785,
        -0.02079969272017479,
        0.036949336528778076,
        0.02511700615286827,
        -0.041151296347379684,
        0.007044612430036068,
        -0.020386934280395508,
        -5.657527779590055e-08,
        0.08884301781654358,
        0.021526340395212173,
        -0.020919183269143105,
        -0.03364330530166626,
        0.08161339908838272,
        0.01041467860341072,
        -0.047075629234313965,
        -0.03222338482737541,
        0.09162252396345139,
        0.08576708287000656,
        0.030148528516292572,
        -0.022553686052560806,
        0.014475541189312935,
        0.01957525685429573,
        -0.027919188141822815,
        0.08399795740842819,
        -0.016601597890257835,
        -0.04745956137776375,
        -0.006186275742948055,
        0.07793256640434265,
        -0.01855696365237236,
        0.04144690930843353,
        -0.022550860419869423,
        -0.06396203488111496,
        0.014354218728840351,
        -0.010579722933471203,
        0.01326090656220913,
        -0.037323400378227234,
        0.02278754860162735,
        0.05747971683740616,
        -0.029575252905488014,
        -0.04563049599528313,
        -0.09255719929933548,
        -0.08426263183355331,
        4.3862455640919507e-05,
        -0.09469441324472427,
        0.09065224975347519,
        0.0317067876458168,
        -0.013645242899656296,
        0.03575414419174194,
        -0.03888322040438652,
        -0.06560435146093369,
        -0.005955521948635578,
        0.012949785217642784,
        -0.004678183700889349,
        -0.02868037484586239,
        -0.045253951102495193,
        -0.024852324277162552,
        -0.019596939906477928,
        0.006515082437545061,
        -0.037848372012376785,
        -0.004239078611135483,
        0.0003187605761922896,
        0.021752208471298218,
        0.11146882176399231,
        -0.058499664068222046,
        0.013999187387526035,
        0.014365109615027905,
        -0.049858078360557556,
        0.024436384439468384,
        0.06309022009372711,
        -0.010860600508749485,
        -0.020766012370586395,
        0.06452809274196625
    ]
}