{
    "id": "3sa-ZqveD9E",
    "title": "This laptop was ALMOST great! - MSI Summit E13 Flip Evo",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-05-08T18:26:01Z",
    "video_url": "https://www.youtube.com/watch?v=3sa-ZqveD9E",
    "category": "Science & Technology",
    "tags": [
        "Laptop",
        "Ultrabook",
        "Notebook",
        "360 Laptop",
        "2-in-1",
        "Pen",
        "Stylus",
        "MSI",
        "Gaming",
        "Intel",
        "Evo",
        "Alex",
        "Unboxing"
    ],
    "views": 593611,
    "likes": 23560,
    "comments_count": 1172,
    "description": "Check out the Volta 2.0 cable today at   MSI does have workstation and creator laptops but they're primarily known for their gaming laptops. They went a bit outside of their comfort zone with the MSI Summit E13 Flip Evo.  Buy the MSI Summit E13 Flip Evo laptop On Amazon (PAID LINK):  On BHPhoto (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/volta2",
        "https://geni.us/GzrY1ke",
        "https://geni.us/6Bd9f",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- When brands go outside of their comfort zone, one of two things happens. Either it's amazing and everybody loves it, or they didn't quite understand what they were making and it's bad. Which brings us to this here today. MSI has made a professional laptop instead of a gaming one and from the looks of it, it seems really good. But when we touch it, it might not be. We'll see. Opening here up here. This is the MSI Summit E13 Flip Evo. It's a long name, but hopefully it's a good laptop. For a charger, we have... Okay, nice little power brick. Type-C connection. A total of 65 watts. That's actually pretty good. We also get MSI's Flip Pen? Is that what it's called? Just the MSI Pen. I would be slightly concerned about this, but as far as I can tell they just took Microsoft's pen and put an MSI logo on it, which honestly is about the best thing they could've done because Microsoft makes great pens. So when you want to charge it, it's just a Type-C cable. Right in... Ooh. There. Oh. Couple more tips. And I think we're good here. On to the main show. Now, the first thing that we get here is a nice little sleeve for it to go into. This is something that HP really likes to do with their laptops. And I'm not saying MSI ripped off HP, but it seems like everything that they did is ripping off HP. (laughs) It doesn't smell very good. You know when you get a new foam mattress and it just stinks up your whole apartment for week or two? Similar vibes. But on to the main show. Do-do-do. Oh, it's a nice box. This one smells nice, at least. See, they double-bagged it here. As I was saying, it looks a lot like they ripped off HP. The design of this is, um... Spectre-like. They don't quite have the 45-degree angles here, but aside from that, it looks like an HP Spectre. Not that that's really a bad thing. HP's a pretty good company to rip off in this situation. Oh! There's another HP feature. So right here, a little switch for your webcam. I/O, though, it looks pretty good. So on this side, just Type-C and a MicroSD card reader. They said that you can expand your storage with this, but I don't know who's going to do that on a laptop like this. Over on this side you get two Thunderbolt, I believe it's Thunderbolt 4's. And a full-size Type-A, which is always nice to see. I like that. Oh, and also a headphone combo port right there. Quick guide. Oh, it's one of these ones. I like these. Feels like I'm taking out a map and gonna go on a big road trip. Yep, I think I could've figured all of that out on my own. Is it time to open it up? - [Jono] Yep. - Nope. It's time for our sponsor, Volta. The Volta 2.0 is a reliable single cable for all USB devices. It supports charging and data transfer on a wide range of devices. It's magnetic and snag-proof, and comes with a 30-day money-back guarantee and a lifetime warranty. Check it out today at the link below. Here we go. (laughs) I love this. They're just like, \"Golden Ratio, 16:10.\" It's not the fact that every single professional device has been moving to 16:10 or 3:2, it's the golden ratio. I need to read you the marketing notes. It's absolutely incredible. \"Mathematics code in aesthetics. Designed under the golden rule of proportion, the new logo of the new MSI Summit E13 Flip Evo utilizes the Golden Ratio to determine aesthetics and mathematics and geometry and also precisely placed in the most prominent position.\" Yes. Thank you, MSI. That said, I do really like 16:10 displays. 16:10 is awesome because, for one, it just gives you more vertical screen space, which is nice for websites... Basically anything productivity-related. (Alex laughs) Okay. They really like the golden ratio. Can we do some golden ratio memes right here of all the things that you can put golden ratios on? So let's get right into the specs here. So for a processor you get the i7-1185G7. Also 32 gigs of RAM. Wi-Fi 6E, which is actually sick. That's pretty cool that they included that. And also Iris Xe graphics. So what's fun about this is that the i7 that they have in here is turned up to 28 watts, which means that it might be able to compete with a much cheaper AMD processor. Yeah. It's four cores. Before I talk too much more about this, we need a bit of context. This thing starts at $1,600 U.S. and the one that we have here today is 1,800, which means... It's more expensive than XPS 13, it's more expensive than a Spectre 13 2-in-1, it's way more expensive than an Envy or a MacBook Air, M1, MacBook Pro M1... Yeah, it basically has to be the best thin-and-light ever at that price. And yeah... I don't know if you can see this here, Brandon, but... The chassis is pretty good stiffness, but I would say it's comparable to HP's Envy lineup, which come in at $700 less than this. One complaint that I have right off the bat is that the screen is way too floppy. So whenever I've been picking it up here, it really wants to just do that. You don't normally do that with a laptop. Normally it doesn't go around quite that fast. And when I'm typing, it looks like it's moving a bit. But not too bad. This keyboard's not good. Yeah. So the spacebar is the biggest offender that I've found so far. The stabilization on it is just trash. Also, the feel of the keys is not quite the same on our model. K feels way different than J. And L also feels different. It's gotta be the creme de la creme, and this just is not. As for the screen... Jono, you said that this is 100% SRGB? - [Jono] Yeah. - That's not great. A laptop of this size at this price and this class I would expect to have full Adobe RGB coverage or DCI-P3 and come with color accuracy. That said, it is a good display. It goes up to 500 nits and it's fine. I would strongly recommend... Aw, but the hinge is not quite strong enough. Then again, we try with the 2-in-1 in this here for a second. Let's see. This pen seems fine. I don't want to say anything bad about it because I'm not totally sure how well OneNote responds to pens. I feel like I could get used to this. The tracking seems fine. And if I was a student and I wanted to take notes, this would be perfectly good. It's probably good enough for art, but I don't make art, so I can't really comment on it. This keyboard's maybe a B. I'm downgrading it. As for the trackpad, it's pretty good, but I do wish that there was more of it. So it seems like it wouldn't be very difficult. MSI has a lot of space up in here and some space here and also space here, and it should be used for the trackpad. I'm guessing that this is just a design that they already had laying around and that they were able to just slap in this laptop, but I really wish that had made something unique for this, so that they could've got something bigger that comes all the way up here. Oh, I see what they did. So MSI's trade-off here was that they made it very thin, but they aren't able to get the USB Type-A underneath the keyboard and maintain this thickness. So you can see here, that comes in, and that's why they have this big raised spot up. Yeah, I think that I would be willing to give up a USB Type-A for a larger trackpad because that's the kinda thing... Dongles are annoying, but not being able to interact with your laptop very well is way more annoying. What else do we have to do? Oh! Apparently their webcam's good. Let's take a look at that. I would say that that is fine. But let's have a little bit of a comparison here. So the XPS 15 has what I would consider a bad webcam. Ooh. What was that? This is having quite bad exposure issues. Yeah, we are under studio lighting right now, so it is very possible that this just is too much light for this camera. Okay, so now I'm recording on the XPS 15 as well, which I would say has a terrible camera. Yeah, the XPS 15 is bad, but it also is kind of more consistently bad, if that makes sense. The MSI is having really bad exposure issues, which might be fine if you're just in an office environment. But then again, on the XPS, this whole side of my face is blown out. This is definitely a bad camera. This one's maybe good in certain situations, but it doesn't look great right now. Okay, so here we have a nice little screen quality comparison. Let's hit Play. (upbeat music) So this is what you would expect on an $1,800 thin-and-light. It should have the same-quality screen, but it really does not. These speakers actually aren't bad. As far as what I expect out of a 13-inch laptop, they aren't exceptional, but at the same time, they're not doing anything bad. I don't hear any distortion or bad highs. (music becomes crisper) Yeah. This one's way better, but I don't expect a 13-inch to be able to beat out a 15-inch. Perfectly acceptable speakers. The screen... Especially when this is going right up against Dell's new XPS 13 OLED in price, it's not good enough, it's just not a good-enough screen. What do we even say about this, Jono? I feel bad 'cause I'm just kinda tearing it apart, but at the same time it's expensive and fine. So the one thing this laptop does do exceptionally well is the battery life. So it has a 70-watt hour battery and in a laptop like this, MSI claims 20 hours, and I believe them. I think that you can probably very easily get 17 to 20 hours of battery life out of this thing. That said, the LG Gram exists, and it's what, like $600 less for their 13-inch, Jono? - [Jono] I think so, yeah. - Let's take it apart and see if we can upgrade anything. I'm guessing you can't, I don't expect that you can, but at the same time, it's always fun to see inside of a laptop. All right. So the bottom panel that we have here is just plastic. Totally fine, but HP's Envy lineup uses metal. So yeah. As for the chassis itself, though, it is all CNC machined. You can see how they came in here with a tool. That's not a cheap part, and... I don't think that they got their money's worth out of it. Pretty flexy. It's not too bad, but it's not great. As for cooling, this doesn't look very big compared to, you know, all of the massive gaming laptops that we have. But for a laptop like this, a four-core mobile CPU, this is loads. So we have two heat pipes that come over here. There's quite a bit of surface area of the fins. And two cute little fans. Apparently they've done quite a bit of tuning on these, so in balanced mode it stays below 35 decibels. When I was using it, I didn't hear the fans at all, so good job there, MSI. As for upgradability... Not a whole lot. So you do have a removable SSD here, but you can't put a second one in. I think your options are 512 or 1 terabyte, so you don't necessarily want to throw that in the garbage. (babbles) Maybe. So I'd give this a... What would you call it? An Ultrabook pass for upgradability. You can get at the battery. You can get at the storage. That's kind of all that we expect. I don't know, I feel like I've been a bit hard on this laptop. But at the same time, MSI did a lot of things right here. And nothing's actually wrong with it, aside from the price. So this laptop right here, if it was priced at $1,200, I would be like, \"Yeah, go, get it right now.\" Priced at $1,600 to $1,800, I just can't. It's very comparable in quality to HP's Envy lineup, and that's just coming close to $1,000 less. And you can get ones with eGPUs for $600 less. So if MSI does drop the price, you should pick it up. Or maybe they should make an i5 version and then, also, you should pick it up. But either way, that's the end of the video, so have a fantastic day, get subscribed, hit like, and so long.",
    "transcript_keywords": [
        "MSI",
        "good",
        "laptop",
        "bad",
        "Yeah",
        "MSI Flip Pen",
        "Golden Ratio",
        "pretty good",
        "MSI Summit",
        "XPS",
        "Golden",
        "thing",
        "nice",
        "pretty",
        "MSI Flip",
        "comfort zone",
        "screen",
        "fine",
        "MSI Pen",
        "Ratio"
    ],
    "transcript_entity_values": [
        "32",
        "1 terabyte",
        "15",
        "100%",
        "week",
        "One",
        "RAM",
        "HP",
        "30-day",
        "one",
        "Flip Pen",
        "USB",
        "U.S.",
        "15-inch",
        "70-watt hour",
        "700",
        "The Volta 2.0",
        "65 watts",
        "Alex",
        "J. And L",
        "13-inch",
        "35 decibels",
        "1,200",
        "Iris Xe",
        "second",
        "16:10",
        "the MSI Summit E13 Flip Evo",
        "Adobe RGB",
        "1,800",
        "Microsoft",
        "Spectre",
        "Jono",
        "28 watts",
        "MSI Summit E13 Flip Evo",
        "DCI-P3",
        "Brandon",
        "first",
        "AMD",
        "M1",
        "webcam",
        "20 hours",
        "two",
        "MSI",
        "a fantastic day",
        "OneNote",
        "four",
        "1,800",
        "the MSI Pen",
        "up to 500",
        "MacBook Pro M1",
        "17 to 20 hours",
        "MicroSD",
        "600",
        "close to $1,000",
        "512",
        "45-degree",
        "CNC",
        "XPS",
        "Golden Ratio",
        "Volta",
        "1,600",
        "an HP Spectre",
        "MacBook Air",
        "16:10 or 3:2",
        "Envy",
        "2",
        "CPU",
        "today",
        "Dell",
        "Spectre"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "GPE",
        "QUANTITY",
        "TIME",
        "MONEY",
        "EVENT",
        "QUANTITY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "PRODUCT",
        "ORDINAL",
        "TIME",
        "EVENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "LAW",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "ORG",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERSON"
    ],
    "vector": [
        -0.13781127333641052,
        0.019152626395225525,
        0.03410206735134125,
        -0.045939140021800995,
        0.08125180006027222,
        -0.0046416050754487514,
        -0.04467878118157387,
        0.04192739352583885,
        -0.010410113260149956,
        0.013512834906578064,
        0.074565090239048,
        -0.01106939185410738,
        -0.008164256811141968,
        -0.012417959980666637,
        0.06887391209602356,
        0.02455868013203144,
        0.07177387923002243,
        -0.07951761037111282,
        0.0004346246423665434,
        -0.02699180692434311,
        -0.008849302306771278,
        -0.09118795394897461,
        0.004430203232914209,
        -0.0548696406185627,
        -0.011210164986550808,
        -0.019407110288739204,
        0.06820587068796158,
        0.0014811551664024591,
        -0.043893963098526,
        -0.0331663154065609,
        -0.03460560366511345,
        0.0009950652020052075,
        -0.03463767096400261,
        -0.00926867313683033,
        -0.006165050435811281,
        -0.0439155139029026,
        0.05510985478758812,
        -0.1032760962843895,
        -0.005871884990483522,
        -0.10086077451705933,
        -0.026923872530460358,
        -0.04445769265294075,
        0.030399421229958534,
        -0.04633631557226181,
        0.12124285101890564,
        -0.09385498613119125,
        0.021542657166719437,
        -0.029314687475562096,
        0.026697173714637756,
        0.05289754644036293,
        0.03457273915410042,
        -0.05164237320423126,
        0.04267445206642151,
        -0.053335174918174744,
        -0.017435522750020027,
        0.031114710494875908,
        -0.01295747421681881,
        -0.053992412984371185,
        0.05756797268986702,
        -0.03700420260429382,
        0.12217993289232254,
        -0.12633652985095978,
        -0.06185873970389366,
        0.05205949768424034,
        -0.028299661353230476,
        -0.05467396229505539,
        -0.005228533875197172,
        -0.01717008650302887,
        -0.03974132984876633,
        -0.026177434250712395,
        -0.027235744521021843,
        0.007363650482147932,
        0.05881195887923241,
        0.017709331586956978,
        -0.035302817821502686,
        0.03555876016616821,
        0.08528035879135132,
        -0.005713623948395252,
        0.05977791175246239,
        0.08076949417591095,
        -0.025515547022223473,
        0.03077051043510437,
        -0.019558461382985115,
        -0.0037663630209863186,
        0.025427576154470444,
        -0.07111692428588867,
        0.03643175587058067,
        0.013258304446935654,
        -0.00854452233761549,
        -0.05477525666356087,
        0.010771526023745537,
        0.055563341826200485,
        0.03049737773835659,
        0.03845696896314621,
        0.014938533306121826,
        -0.05442604795098305,
        0.05037058889865875,
        -0.06041456013917923,
        -0.0494653545320034,
        0.06057180091738701,
        -0.008967050351202488,
        0.07013839483261108,
        0.04222676530480385,
        -0.04348691180348396,
        -0.05376231297850609,
        -0.024946773424744606,
        0.010427985340356827,
        0.058319736272096634,
        0.020855169743299484,
        -0.012876628898084164,
        -0.0539434440433979,
        0.021364396438002586,
        -0.05730963125824928,
        -0.05323052033782005,
        -0.022693291306495667,
        0.06940527260303497,
        -0.10868220031261444,
        0.019782455638051033,
        0.12305289506912231,
        0.02260418049991131,
        -0.011763897724449635,
        0.0049672541208565235,
        -0.01797168143093586,
        0.02008068934082985,
        0.0531039796769619,
        0.02481105737388134,
        -0.021196844056248665,
        3.64708803817726e-33,
        0.01364583894610405,
        0.06574752926826477,
        -0.045111749321222305,
        -0.07480904459953308,
        0.07137760519981384,
        0.08318714797496796,
        0.03221378102898598,
        -0.031666237860918045,
        -0.06264336407184601,
        0.030306922271847725,
        -0.132344052195549,
        0.08528505265712738,
        -0.064486563205719,
        0.06787212938070297,
        0.012839013710618019,
        -0.09253792464733124,
        0.018315820023417473,
        -0.00935772992670536,
        -0.0166642963886261,
        -0.019945604726672173,
        0.0356438048183918,
        -0.04701024666428566,
        0.10717630386352539,
        -0.07711149007081985,
        0.00751845957711339,
        0.03910272568464279,
        -0.023475406691432,
        -0.017117096111178398,
        0.0843019038438797,
        0.056175656616687775,
        -0.015847625210881233,
        -0.06904779374599457,
        -0.00979811791330576,
        -0.06358017027378082,
        -0.03959093615412712,
        0.017116906121373177,
        -0.07325217872858047,
        -0.12669196724891663,
        0.06711940467357635,
        0.028842167928814888,
        -0.03182871267199516,
        0.09063418954610825,
        -0.08474292606115341,
        -0.0800364762544632,
        -0.04766311123967171,
        -0.013358833268284798,
        0.04635166749358177,
        -0.018499035388231277,
        0.04187244176864624,
        0.03671107813715935,
        -0.14697055518627167,
        0.0021219258196651936,
        -0.05408276244997978,
        -0.04189867898821831,
        0.016166338697075844,
        0.012192333117127419,
        0.032973285764455795,
        0.05831635743379593,
        0.07779944688081741,
        0.06849340349435806,
        0.02627095766365528,
        0.06386458873748779,
        -0.04988856241106987,
        -0.04606109485030174,
        -0.07229382544755936,
        0.0886029601097107,
        0.08729665726423264,
        -0.026121465489268303,
        -0.1074426919221878,
        -0.04264417290687561,
        -0.004487116355448961,
        0.0018077734857797623,
        0.05284895375370979,
        -0.010492535308003426,
        -0.0007387360674329102,
        0.021724775433540344,
        -0.07633089274168015,
        0.006103167310357094,
        -0.00942175928503275,
        -0.0011081696720793843,
        -0.054038386791944504,
        0.02450842224061489,
        0.02183917909860611,
        -0.006692354567348957,
        -0.024353627115488052,
        0.05464500933885574,
        -0.07731911540031433,
        -0.02112676575779915,
        -0.004873055033385754,
        0.017230985686182976,
        -0.030678419396281242,
        -0.02580362930893898,
        0.002558909123763442,
        0.02056553214788437,
        0.012981695123016834,
        -5.2333243597478404e-33,
        -0.10315833985805511,
        -0.0407542809844017,
        -0.04129043594002724,
        0.024316154420375824,
        -0.007216996978968382,
        0.008432278409600258,
        0.0017572869546711445,
        0.029856711626052856,
        -0.014689786359667778,
        -0.0629829466342926,
        0.006855427287518978,
        0.09948888421058655,
        0.025927798822522163,
        -0.008310648612678051,
        0.07054530084133148,
        -0.0359182246029377,
        -0.009806947782635689,
        -0.04375395551323891,
        0.07196492701768875,
        -0.05402177944779396,
        0.06506702303886414,
        0.010781658813357353,
        -0.02550719864666462,
        -0.006567645352333784,
        0.05472506582736969,
        0.008516356348991394,
        0.015461195260286331,
        0.00165585707873106,
        0.022671915590763092,
        0.039284925907850266,
        -0.027870332822203636,
        0.025698695331811905,
        0.0036423243582248688,
        0.031184731051325798,
        0.08044072240591049,
        0.02873273193836212,
        0.030139541253447533,
        0.04030200466513634,
        0.04949609190225601,
        -0.0115976482629776,
        0.05708193778991699,
        -0.009249228984117508,
        0.05481550842523575,
        0.006737463641911745,
        0.05604717507958412,
        -0.02806924283504486,
        -0.10006918013095856,
        -0.07794095575809479,
        0.006639106199145317,
        0.019211098551750183,
        -0.08757514506578445,
        -0.04139988124370575,
        0.024739600718021393,
        -0.018277442082762718,
        -0.01729085110127926,
        -0.09323589503765106,
        -0.0723673552274704,
        0.06432193517684937,
        0.004244026727974415,
        -0.05357861518859863,
        0.0568886324763298,
        0.0014890708262100816,
        -0.03525598719716072,
        0.026394246146082878,
        -0.010555130429565907,
        0.034418217837810516,
        0.06583575904369354,
        0.005615666043013334,
        0.009809765964746475,
        -0.04835187643766403,
        -0.05597515404224396,
        -0.03601287305355072,
        -0.021429650485515594,
        -0.11418204009532928,
        -0.07948827743530273,
        0.04311668127775192,
        -0.035890527069568634,
        0.03514648228883743,
        0.0007830298272892833,
        -0.03249384090304375,
        0.02558896318078041,
        0.015921050682663918,
        0.041228778660297394,
        -0.03173128888010979,
        0.07007212936878204,
        0.02994333766400814,
        0.042672041803598404,
        -0.03413407877087593,
        -0.027813006192445755,
        0.005873408634215593,
        -0.023086601868271828,
        -0.0056125447154045105,
        -0.05411281809210777,
        0.058612704277038574,
        0.014205929823219776,
        -5.984418294247007e-08,
        0.003976927138864994,
        0.0027600526809692383,
        0.07176900655031204,
        0.04752899706363678,
        -0.011166220530867577,
        -0.06429258733987808,
        0.05751032754778862,
        -0.03718147426843643,
        0.05443165451288223,
        0.033633265644311905,
        0.05770599842071533,
        -0.10812922567129135,
        -0.014258910901844501,
        -0.03108268976211548,
        0.009896612726151943,
        0.05652150511741638,
        0.004832131788134575,
        0.12204217910766602,
        -0.0010469795670360327,
        -0.01810525171458721,
        0.022920653223991394,
        0.006050641182810068,
        0.09771963953971863,
        -0.03469136357307434,
        0.07688423991203308,
        -0.0018912787782028317,
        0.0033084629103541374,
        0.025310246273875237,
        0.04191210865974426,
        -0.11557651311159134,
        -0.1034557893872261,
        -0.014832135289907455,
        0.0712074488401413,
        -0.0226930920034647,
        -0.044824786484241486,
        -0.044562626630067825,
        0.005845312029123306,
        0.05497884377837181,
        0.09303745627403259,
        0.044934991747140884,
        -0.015613901428878307,
        -0.04910333454608917,
        -0.02479611709713936,
        -0.054188523441553116,
        0.018874898552894592,
        0.06627286970615387,
        -0.01895224116742611,
        -0.07737505435943604,
        -0.007252808194607496,
        0.05019109696149826,
        -0.05697893723845482,
        -0.04545672982931137,
        -0.016982054337859154,
        0.05014176666736603,
        0.033089347183704376,
        0.03626653179526329,
        -0.013765224255621433,
        0.06579726934432983,
        0.028462067246437073,
        0.08517535030841827,
        0.07268612086772919,
        -0.1178552582859993,
        -0.09871615469455719,
        0.03753601759672165
    ]
}