{
    "id": "3V90LzlfV74",
    "title": "Apple Doesn't Want YOUR Money - iPhone 15",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2023-02-10T18:08:21Z",
    "video_url": "https://www.youtube.com/watch?v=3V90LzlfV74",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 101761,
    "likes": 3312,
    "comments_count": 439,
    "description": "Let's talk about the iPhone 15 Amazon's WORST PC Scams:  TikTok Made Me Buy It...AGAIN:  Buy a Mac, STUPID:  WEIRDEST Products on Etsy:  Samsung, We Need to Talk...  Subscribe!  Twitter:  Matt:  Instagram:   Produced by Kinsey Lynaugh  Edited by Aron Goodall:   Chapter Titles ------------------------------- 0:00 Apple thinks youre POOR 0:45 Does the iPhone 15 Matter?? 1:56 The iPhone needs to be DIFFERENT 2:52 iPhone 15 will be PORTLESS 3:57 Maybe it will be BUTTONLESS too 4:59 We NEED USB-C 5:47 Wireless charging is like a windowless car.. 6:42 The industry follows Apple.. 7:42 Apple isnt ALWAYS overpriced 8:45 Used is BETTER than cheap 9:40 The Mac Mini is a better first Apple device 10:43 The ecosystem is REAL 12:13 Apples is BEST 13:28 Apple cares more about privacy 13:58 Faster no longer matters 15:17 What do you think?",
    "description_links": [
        "https://youtu.be/1HIN4OecBtQ",
        "https://youtu.be/XcAPWNMh8uk",
        "https://youtu.be/LycbutY5oUE",
        "https://youtu.be/lnQr7RyUfVg",
        "https://youtu.be/zfqhs99eURo",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel",
        "https://twitter.com/arongoodall"
    ],
    "transcript": "- Let's stop mincing words on Apple stuff. They don't want your poor (grunt) buying their stuff. (Austin laughing) (broadcast beeping) Hello and welcome to \"This Is...\". We talked about why the s23 is a just a boring little rectangle. Now let's talk about why the iPhone 15 will also be a boring little rectangle. - Before we even talk about this, right? So clearly the iPhone 15 will be out later on this year, so. - Right, August. - September, or October probably. - Probably. (laughs) - You know what? - You're right. - Matt's just firing me up right now. (Matt chuckling) Matt's firing me up right now. - I may or may not be treating this entire episode as a way to troll Austen Evans because Austen always is like, \"I'm gonna talk about the specs and I'm gonna talk about-\" - No! - \"the thing.\" - I was in the middle of my point. There are a lot of great YouTube channels out there. \"This Is...\" is not gonna be the cutting edge latest spec talk. What we wanna talk about is the philosophy. What we wanna talk about is, \"Does the iPhone 15 even matter?\" So I would like to posit a question. Dear \"This Is...\" viewers, what would it take for you to buy an iPhone 15? What would we need? Because I do believe that this year we will see a little bit more of a substantial redesign of the iPhone. We've been on this existing sort of rough sort of body style with the flat edges and whatnot for three years-ish or so, at this point. Matt, I would throw this to you. What do you need out of an iPhone 15 to A, wanna buy one, B, care at all? - I would never buy an iPhone. (gate slamming) Ever. I wouldn't use Apple whatsoever. - Show me what's in your pocket right now. - You wanna see what's in my pocket right now? - Oh my God! - I got a Z Flip. - He was ready for it. He was ready for it. (Matt laughing) He doesn't usually carry the Z flip. Matt really committed to the bit today. - You notice my big tan line here? (both laughing) Just gonna go ahead and put this back on. - So Matt, what would it take for you to transition from your clearly Z Flip lifestyle and move over to an iPhone? - A lot of things I'm gonna say about the iPhone 15 is the exact same things I said about the s23. - Okay. - It's boring. - Sure. - Because of how good they are. We can't have these like crazy leaps and bounds every year. - Yes. - We're at the point where we're not gonna get them. I think what iPhone needs to do for this time around, I think they need to differentiate their lineup a little bit more- - Between Pro and non-Pro? - Yeah, they already started doing that. - So, okay. But hold on, before you expand on that, I'm just curious. So if you want more of a difference between the regular iPhone and the Pro, what do you mean by that? Obviously right now, you know, you've got the difference in like the Pro motion, you've got the additional camera. What more would you want? Like are you talking about making the Pro better, making the regular iPhone like cheaper? Like what do you mean by that? - Both. Both. - Okay. - So I think right now we do have some features, but I think they're all pretty minor in the grand scheme of things. Like a lot of people don't actually really notice Pro motion. You probably do, but like not, it's not like much. - I agree. I agree. - And the build quality between 'em, the stainless steel is, I, like again- - Everyone puts a case on. - Right. - Doesn't matter. - I think if we can make a slightly cheaper base model, which is gonna be fine for the vast majority of people- - You mean like if they brought a mini iPhone at a lower price? That would be some real excitement. - I miss the mini more than I miss most relatives. (xylophone playing) I don't know if it's gonna be this year, but I do, I am firm believer that Apple is going towards the portless iPhone. - I think we can pretty categorically say that's not the case this year. - Not this year. - Because they've literally said already that the iPhone will have USB-C. - No they didn't! They did not say that! They did not say it'll have a USB-C. They said they will \"comply with the ruling,\" which is a very weird lawyery speech. - No, no, no, no. But but hold on. So for context, if you're not familiar, so the European Union has passed a mandate basically saying that all smartphones will have to be on a standardized connector, which seems to be USB-C whatever- - Let me tell you why that's stupid. - But hold on- - in itself. It took so long for that to happen. 'Cause that's been going on for years now. USB-C is already starting to become a weird outdated standard. Whether it's USB two speeds, whether it's USB three speeds, 3.1, 3.2, 4.0. That was a rant. - I know Matt's very upset, but here's the thing. They're going to do USB-C, right? Like they're gonna do it. They're not removing the port from the iPhone this year. - I think the non-Pro- - Yes. - will be a portless phone. If we're gonna get like a \"budget iPhone,\" I think that's one of the first things they're gonna do with it, is go portless, because it's already the rumor that they're gonna be removing the physical buttons. Everyone's like, \"No Matt, you're wrong on this stuff.\" Like, \"They wouldn't do this because I want this.\" They don't give a (grunt) what you want. This is the largest company in the world. They are very good at making money. - Yeah. And they already, they, making money selling you lightning things, and they'll just sell you USB-C things instead. Like I don't think this is that complicated of a thing. Like is there a possibility for future portless iPhone? Yes. - They're not gonna make as much money selling USB-C stuff. Everyone in the world already does it. - That is 100% true, yes. - So like, it's... - But they've already got MagSafe, right? Like they've already got their own proprietary-ish wireless- - Which which they're gonna try and make even more popular this time around. - Yeah. - Because they said, \"Oh we're gonna be releasing MagSafe \"into the wild.\" If they want MagSafe to catch on, they need to make that the standard. - Sure. - And what better way to make it the standard- - Than by just letting everyone use it. - Than by saying, most of the iPhones that are gonna be out in 2023- - Yeah. - or 2024 are gonna be required to use it? Because that's how you're gonna get a bunch of third party people to start using the MagSafe. - Okay. But hold on. Okay. We're getting really deep onto a port here. The iPhone, for me, and I think for a lot of people, it has become a real production tool. And having USB-C will make a huge difference, because right now we shoot iPhone video all the time, including videos, and most of the time you can't really tell, or it's not anything that's like all that obvious. Right? But one of the things that we do not do is shoot in Pro res, because Pro res files over lightning take hours to dump, like it's ridiculously slow. I bet you what you'll see is with the new iPhone 15s, the base models will just have like USB two, slow USB-C, and then the Pro model will have the fast USB-C. Regardless, that's not the thing I think is actually most interesting about the iPhone 15. Remember I started out by saying what would make you switch to an iPhone? Clearly Matt just wants to see the world burn, and remove all the ports and make you sad. - I don't want to see this! - You do, you do. - I just am a futurist. - I'm not saying this will never happen. I'm saying it's not gonna happen this year. It's not gonna happen for a little bit. You might be out here posing with your prop Z Flip, but there's someone else in this room who uses Android on a regular basis. Kenzie, as an Android user, what would it take for you to switch to an iPhone 15? If there was no port, you'd be out on iPhone. - Absolutely. That's so dumb. So I'm looking at a car right now, right? And so one of the things is like unlike the super fancy trim, you can get wireless charging in the car, but other than that you'd have to like what? Like- - You have to plug in a USB to wireless charging dongle, and then drop your phone on it. - I'm not considering switching, but I would consider switching even less. Like I would just be like, your windowless car? (horn honking) Have fun! (Austin laughing) - My point is this, and again, I don't want this. I wanna make it clear I don't want any of this. But this is the track record we have. - Yeah. - That when Apple does something like this, everyone else in the industry, not just cell phone, but automakers- - Sure. - accessory makers, they follow. When Apple first came out with a 30-pin connector, there was cars with a 30-pin connector. All the treadmills and whatnot at gyms had 30-pin connector. - [Austin] IPod docs from every hotel everywhere. - So if iPhone says, \"We're gonna go portless,\" the world, like the industry- - MagSafe would be everywhere. - It would rush to adapt. - Here's my thing. - And then the next year you're gonna start seeing all these cars with more and more wireless chargers. - Sure. - You already see a lot of cars with wireless CarPlay and wireless Android Auto. - Yeah. Okay. Cars will have those features, but like who has a new car? Like- - Yes. - But that's never been Apple's concern, because Apple doesn't want your poor (grunt) people buying their phone. - Whoa. I bet you were about to go there. Are you trying to say- - Yeah. that Apple doesn't wanna sell phones to poor people? - Correct. (gate slamming) - Who can't afford a brand new car? - Correct! (gate slamming) - Apple have like a billion iOS devices out there. - Yeah. - I know that they have a reputation for selling premium devices that are only for the rich Matts of the world. Apple actually sell, I think, a fairly wide variety of devices right now. Look at that Mac mini that we've already talked about. You can check that video out here. That's one of the best deals in computing period right now. You've got the iPad, which has been like 300 bucks for years, which is a terrific device at that kind of price point. You got the iPhone SE, even the regular iPhones I think are pretty competitively priced with those sort of like mid to upper range flagships. Right? So it's like for you to sit here and tell me that Apple only cares about rich people. I get it that they want, that's like obviously the most affluent demographic, who're gonna spend the most money upgrading their iPhone Pros every year. But you can't tell me that Apple's gonna be like, \"Oh, let's just ignore the 85% of the rest \"of the our consumers, who don't have brand new cars \"and cool smart homes.\" - No, no, no. That's exactly what they're thinking. Because this is the example of trickle-down economics that's actually working. (bell dinging) They're like, \"Okay, our affluent market base \"are gonna buy the phone every year.\" - Yep. - \"And we're gonna come out with a new one, \"and they're gonna buy that new one again.\" - Yes. - And then what are they gonna do with their old ones? They're gonna go and probably sell 'em. And that's, and let the poor people have our used phones that are a couple years old, which we have said for the record, is the best deal. - Is the best deal. - Buying a used iPhone is one of the best deals in cell phones. We're not saying it's a bad thing, but that is clearly what Apple's philosophy is. Let the bottom 97% deal with used stuff, because then you're still in the ecosystem, that's still on the app store. And this is what I do want, not what I think should happen, but like I want the Pro to be more Pro, and then let the actual iPhone be more consumer friendly. If they have to take away a port to do that, I think that that would be better overall. Apple does not want to go down to you. They want you to come up to them. They want you to adjust your lifestyle- - Okay. Yeah. - to the Apple lifestyle. This is my theory on why the, like the Mac and the Mac Mini are so cheap. Whereas the iPhone is more premium. The Mac doesn't make 'em that much money. Period. IPhones make you money. - True. But they're, Mac's starting to become more and more of a priority, I will say it's not like nothing. - No. But the real money that they make is through the app store, which statistically is coming from an iPhone. The whole value proposition, which we said in the s23 video, the value proposition of using an iPhone is if you're in the Apple ecosystem. I stay on my iPhone because it works with my Mac, it works with my iPad, blah blah. So get you cheaper ecosystem things going through. So like a cheap Mac mini gets you in the door. - That's exactly what- - And now, now when you buy an iPhone... - Yep. - Now you have a better value proposition. - Well, I think the Mac and the iPhone are a little bit different too, because I think you look at that Mac mini, again, I we're gonna talk about that a lot, because I still think at $600, that is an incredibly good value. - Of course. - Look at that. At 600 bucks. It's like why Chromebooks have become so popular. Is it like you as like a student as your, like, sort of your first computer, or your first real computer. If they get you on Mac early, you're gonna grow up knowing how to use Mac, and you're probably not gonna wanna leave. - Which is exactly what happened to me. I got a Mac 15 years ago. - Yeah. - And I haven't wanted to leave since, because that's what I grew up using. - Absolutely. Right? But I think the iPhone's a little bit of a different sort of thing where yes, the $300 iPad that tons of kids use and you've learned how to use iOS since you were, you know, roughly 17 seconds old? Like that has real value because when you become a little bit older, you start going to school, they give you a school iPad. When you're ingrained in this kind of stuff and you're used to using Apple products, you're way more disposed to continuing to use Apple products throughout your life, because it's what you've grown up with. That's why I think it's really interesting to think about where Apple, as a company, are right now. I feel like we started talking about iPhone 15, and now we're just like onto a much more philosophical question about like- - Because that's how- - \"Does Apple care about you?\" - But the- - \"Does Apple care about you?\" \"Does Apple care about you?\" - They care about you the same way that Samsung does. They care about you the same way that Google does. - I- - As in, you're a consumer. - You know what, I would actually a little bit disagree with that, because I do think Apple think a little bit more of that long term, right? Like how many people have used Samsung devices for their entire lives? A little bit, but not really. - And like go with Google, it's, you just think about it differently. How many people have used Google products their entire life? Not necessarily the hardware. - Sure. - 'Cause it's a different type of company. - Whereas Apple like almost, like they're investing in their future, because they want you to like using Apple products from an early age, and continue to use those Apple products and let them grow with you. Right? They want to have a wide variety of different things, because Apple is a much older company, and a much more established harbor company. They've sort of built this up where it's like they're cultivating that next generation. And I say that like that might sound bad, but there's nothing wrong with you growing up knowing how to use something, and feeling confident wanting to use it more and more in the future. And you know what? If you're 15 right now, and you're just getting your first iPhone, or probably not your first iPhone if you're 15, but whatever the case is- - Well... - You know what, 10 years from now when you're making big money, you might go by yourself an Apple car, and you'll have an iPhone Pro in it or whatever, because you have such a strong affinity for the brand and you're completely engulfed in that ecosystem. Now obviously there are downsides to being sort of trapped in the ecosystem, but I would also argue that especially as someone who spent a lot of time trying, and actually trying to commit to some of the other ecosystems out there, the Apple one hands down is the most cohesive, where all the products work together in a really seamless way. - Mhm. - I would argue that the Apple experience is a generally good positive one in a way that doesn't make me feel icky. I feel better trusting Apple as a company because I understand their motivations, right? They primarily make their money by selling me premium hardware. I understand that value proposition. I pay Apple probably a little bit more than I should for my new computer or phone or whatever the case is. In return, I've got a company who, generally speaking, wants to safeguard my privacy, because they're not making money on the ads and all this kinda stuff. Whereas you look at the Amazons and the Googles and Microsofts to a degree of the world, you are the product. It's one of those things where I feel a lot more safe and secure knowing that the company who I am trusting my digital life to, at least on the hardware side, has more pure intentions. Now obviously this is a subset of major, major simplification, right? But that's why I just think that while there's a lot of things I don't agree with the way that Apple handle things, I at least can understand the transaction. I give you a lot of money, you gimme a very nice piece of hardware, and you're not interested in harvesting every - So are you saying- - thing I do online and all that. - that everyone else is just so poor that the only thing they have to barter with is not money- - But their data? - But their bodies and their data and themselves. - Whoa. (laughing) I didn't say that. Didn't say that one. - And that's what Microsoft and Google and even Samsung exploit, let me circle this all back. Because why are we talking about the philosophy of technology and companies when we were supposed to be talking about, \"Is the iPhone 15 worth it?\" Because these devices have all gotten so good that you can't sell them the way you used to do it. Because it used to be, \"I'm gonna sell you this product, \"and it's better than this one because look at this, \"it's X spec better.\" They could say like, \"Oh, this is five times faster \"than the previous generation.\" None of that actually matters, because it's just on paper, it's imaginary numbers at this point. You're not gonna notice your app loading 0.0001 second faster than it was before. So the only way you can sell these is basically the way you incorporate them into the lifestyle. Is it the better virtual assistant? Is it the better way it's gonna like, \"Oh, it will work \"with every one of your devices?\" And when you have the lock on the ecosystem like Apple does- - Yeah. - that's a way bigger selling point. - The ecosystem is massive because, okay, if you think about it from like a broader context, right? If you look at cars, generally speaking, if you say bought a Toyota, you are very very likely to buy another Toyota is your second car or the next car. You know, like you would kind of stay in that sort of track. And what's happening with the EV space is that a lot of that brand loyalty is being tossed out the window, because now suddenly it's electric. None of it really matters too much. It's kind of the wild west and getting what you can get. - I mean the brand loyalty was just to Tesla, because, \"Oh, they're the-\" - Yeah, it was the only option for a while. - Yeah. - Yeah. But the thing is that is a major disruption, but there are a lot of families who were Ford families for their entire lives or whatever, right? And I think the tech space is similar where if you grow up and your family uses all iPhones or all Androids or whatever the case is, you're much more likely to continue not to be a one-time customer, to be a lifetime, or at least a very, very long-term customer of the thing. And as a company, you have massive incentive to build a strong ecosystem to make sure that people like using your products, can use them all over the place, they work well together. (upbeat music playing) I know it's easy to say like, \"Oh, it's all nefarious, \"because they're trying to build walls \"so you can't get out.\" I don't necessarily think that's the case, but they wanna make it so nice in here. - It is nefarious- - that you don't want to go. - But why would it not be? Because that's again, how businesses work. These aren't charities. We've talked about this a lot, and like we come back to the debate of like \"Why won't Apple adopt a wider standard \"so they could work with Android store?\" Why would they? - Yeah. This is a real debate, and I'd be very curious to see what you think in the comments below about the philosophy of Apple. Are they a company that's only for Rich Americans like Matt over here? Or is it a company of the people- - I'll show you my paystub. - by the people? Thank you very much for watching. Subscribe to the channel. I feel like there's a part two of this video, 'cause I don't think we're done with this yet. - Maybe we'll actually talk about the iPhone 15 in the next one. (Austin laughing) - We should talk about it at some point. Oh, did you hear that the iPhone 15 is gonna have... (upbeat music ending)",
    "transcript_keywords": [
        "Apple",
        "iPhone",
        "Mac",
        "Pro",
        "Apple products",
        "make",
        "USBC",
        "things",
        "Apple care",
        "Yeah",
        "thing",
        "Matt",
        "lot",
        "people",
        "year",
        "money",
        "talk",
        "Mac mini",
        "bit",
        "company"
    ],
    "transcript_entity_values": [
        "the 85%",
        "Ford",
        "hours",
        "USB-C. - No",
        "September",
        "the Mac Mini",
        "Android",
        "one",
        "Mac",
        "10 years from now",
        "Apple",
        "30",
        "0.0001",
        "iPhones",
        "3.2",
        "300 bucks",
        "the next one",
        "three",
        "USB",
        "the European Union",
        "iPhones",
        "today",
        "the next year",
        "Googles",
        "Tesla",
        "October",
        "three years-ish",
        "3.1",
        "Google",
        "Androids",
        "a couple years old",
        "Matt",
        "600 bucks",
        "years",
        "iPad",
        "300",
        "EV",
        "97%",
        "an iPhone Pro",
        "100%",
        "15",
        "4.0",
        "Austin",
        "Samsung",
        "an early age",
        "roughly 17 seconds",
        "every year",
        "2024",
        "Amazons",
        "two",
        "600",
        "Kenzie",
        "iPad",
        "Toyota",
        "Rich Americans",
        "MagSafe",
        "USB-C. Regardless",
        "Microsofts",
        "this year",
        "a bunch of third",
        "Android Auto",
        "USB-C",
        "15 years ago",
        "CarPlay",
        "second",
        "five",
        "Austen",
        "YouTube",
        "Microsoft",
        "first",
        "iPhone",
        "Mac",
        "IPhones",
        "August",
        "Austen Evans",
        "2023-"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "MONEY",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "PERCENT",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "TIME",
        "DATE",
        "DATE",
        "NORP",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "ORG",
        "NORP",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "FAC",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.046650562435388565,
        0.08594709634780884,
        0.08797932416200638,
        -0.06627852469682693,
        0.029877854511141777,
        -0.028390690684318542,
        0.01409902609884739,
        0.05325496569275856,
        0.08910523355007172,
        0.018525293096899986,
        0.10583048313856125,
        -0.010958516038954258,
        0.011735882610082626,
        0.014266790822148323,
        -0.008780578151345253,
        -0.003045314457267523,
        0.11183442920446396,
        -0.0823453962802887,
        -0.05462446063756943,
        -0.0015919406432658434,
        -0.014399626292288303,
        -0.030880602076649666,
        0.04766657203435898,
        -0.01383389625698328,
        0.02392071671783924,
        0.06047981232404709,
        -0.04883204400539398,
        -0.061635952442884445,
        -0.08460287749767303,
        -0.013263312168419361,
        -0.04295029491186142,
        0.033275436609983444,
        0.06683327257633209,
        -0.012646196410059929,
        0.022853681817650795,
        -0.10580714792013168,
        0.010890363715589046,
        -0.02158186584711075,
        -0.014698423445224762,
        -0.026101218536496162,
        -0.03455457091331482,
        -0.06632290780544281,
        -0.0575217641890049,
        0.10415926575660706,
        -0.04428304359316826,
        -0.02876887284219265,
        0.009828413836658001,
        -0.011758639477193356,
        0.0066596148535609245,
        -0.052822746336460114,
        -0.02087116241455078,
        0.02978457696735859,
        -0.04519772529602051,
        -0.004881031345576048,
        -0.03597775101661682,
        -0.005973152816295624,
        -0.0226176418364048,
        0.01637284830212593,
        0.14189577102661133,
        0.014959470368921757,
        0.0377633310854435,
        -0.004576533101499081,
        -0.026856206357479095,
        0.0073500205762684345,
        0.025401335209608078,
        -0.09097310900688171,
        -0.06872802972793579,
        -0.006494035478681326,
        -0.10721329599618912,
        0.08052987605333328,
        0.05118001997470856,
        -0.030537959188222885,
        0.044039707630872726,
        0.04783055931329727,
        0.004983086138963699,
        0.008437937125563622,
        0.07226122170686722,
        0.001902243122458458,
        -0.04023252800107002,
        0.042611584067344666,
        -0.046639326959848404,
        -0.014869381673634052,
        -0.04792988672852516,
        0.002151444321498275,
        0.008520852774381638,
        -0.0525219552218914,
        -0.028212018311023712,
        0.025990378111600876,
        -0.018460825085639954,
        -0.05278140306472778,
        -0.062319912016391754,
        0.10351898521184921,
        -0.04738253355026245,
        -0.01955670304596424,
        0.03996234014630318,
        0.014094230718910694,
        0.00045567250344902277,
        -0.006926486734300852,
        -0.11727377772331238,
        0.0010233484208583832,
        0.0576297789812088,
        0.00812760554254055,
        0.01731741428375244,
        -0.0029774236027151346,
        0.034576140344142914,
        -0.10522255301475525,
        -0.04542144015431404,
        -0.021747270599007607,
        0.04961980879306793,
        0.06796522438526154,
        0.010505849495530128,
        -0.02336164563894272,
        -0.06569383293390274,
        -0.036205969750881195,
        0.03800320252776146,
        0.046984098851680756,
        -0.06418547034263611,
        0.08685018867254257,
        0.12803030014038086,
        0.018859034404158592,
        -0.04722367972135544,
        0.0007984514813870192,
        -0.018688660115003586,
        -0.027705179527401924,
        -0.024486402049660683,
        -0.006330055184662342,
        -0.017257465049624443,
        4.405177569334e-33,
        -0.022105148062109947,
        0.04452946037054062,
        -0.06415008008480072,
        -0.03897298127412796,
        0.02025880105793476,
        -0.08680075407028198,
        0.017924269661307335,
        0.10103979706764221,
        0.046670883893966675,
        0.023623468354344368,
        -0.052981190383434296,
        -0.10596699267625809,
        -0.042722295969724655,
        -0.03931467980146408,
        0.07468158006668091,
        -0.03322219476103783,
        -0.043495889753103256,
        -0.047629214823246,
        0.004561086185276508,
        -0.0005970064084976912,
        -0.016693873330950737,
        -0.01593630760908127,
        -0.011457092128694057,
        -0.10336355865001678,
        0.010764865204691887,
        -0.08504269272089005,
        -0.017762212082743645,
        -0.031017376109957695,
        0.07905995100736618,
        0.018478117883205414,
        -0.07106449455022812,
        0.015364285558462143,
        0.030325893312692642,
        -0.07279346138238907,
        -0.004486459773033857,
        -0.001035574241541326,
        0.09479553997516632,
        -0.04650020971894264,
        0.04276210814714432,
        -0.019692368805408478,
        -0.12170197814702988,
        0.0032943307887762785,
        -0.006670437753200531,
        0.0060175578109920025,
        0.11246030032634735,
        0.14050252735614777,
        -0.0025950451381504536,
        -0.04887460172176361,
        -0.07879766076803207,
        0.0028467702213674784,
        -0.05097344145178795,
        0.02453748881816864,
        0.057932719588279724,
        -0.012190314009785652,
        -0.029506681486964226,
        -0.030991340056061745,
        0.019224492833018303,
        -0.02739725075662136,
        -0.02096029371023178,
        0.06303104758262634,
        -0.0017209254438057542,
        -0.0036008136812597513,
        0.02309263125061989,
        0.009844941087067127,
        -0.0662224069237709,
        0.09343196451663971,
        0.0516832172870636,
        0.0038710092194378376,
        -0.042010873556137085,
        0.11266776919364929,
        -0.03816642239689827,
        0.07977087795734406,
        0.008539319969713688,
        -0.025146929547190666,
        0.02788490429520607,
        0.06450974196195602,
        0.03642018139362335,
        0.03466294705867767,
        0.008149405010044575,
        -0.0070138853043317795,
        -0.01880090869963169,
        0.03652487322688103,
        0.05210976302623749,
        0.005449523217976093,
        0.07472001761198044,
        -0.015341767109930515,
        0.027171192690730095,
        -0.024822238832712173,
        0.059607118368148804,
        0.07222946733236313,
        -0.03379276767373085,
        -0.009783216752111912,
        -0.023684585466980934,
        0.017180928960442543,
        -0.03483634069561958,
        -5.00251016649213e-33,
        -0.05233444273471832,
        -0.07829385995864868,
        -0.012793246656656265,
        0.06504904478788376,
        -0.038727883249521255,
        -0.056725166738033295,
        -0.008519136346876621,
        -0.007380108814686537,
        0.04580136388540268,
        0.026785138994455338,
        -0.033706728368997574,
        0.025603126734495163,
        -0.0011179621797055006,
        -0.014912891201674938,
        0.0018964223563671112,
        -0.04242550581693649,
        -0.04997112601995468,
        -0.0789494588971138,
        0.007756409235298634,
        0.06917516142129898,
        0.060975708067417145,
        0.07827319204807281,
        -0.03835977613925934,
        0.05609130859375,
        -0.014077776111662388,
        0.013892567716538906,
        -0.03913022577762604,
        0.010668357834219933,
        0.03958623856306076,
        -0.059415169060230255,
        0.0061153024435043335,
        -0.10071288794279099,
        0.04084749147295952,
        0.022360119968652725,
        0.015123778954148293,
        -0.0015436774119734764,
        -0.046391673386096954,
        0.005743481684476137,
        -0.006672499235719442,
        -0.02456958405673504,
        0.07120587676763535,
        -0.020534183830022812,
        -0.033058471977710724,
        0.029374709352850914,
        -0.03382505103945732,
        -0.003010889980942011,
        -0.030568763613700867,
        -0.028364481404423714,
        0.01862437091767788,
        0.007616437040269375,
        0.02539498172700405,
        -0.005106028635054827,
        -0.07543303072452545,
        0.0962820053100586,
        -0.13213340938091278,
        0.004556173458695412,
        0.03579771891236305,
        0.05499156564474106,
        0.06463299691677094,
        0.051265425980091095,
        0.09946835041046143,
        0.012018577195703983,
        0.011693115346133709,
        -0.04381250590085983,
        -0.022458359599113464,
        -0.03378862142562866,
        0.04477345198392868,
        -0.007300698198378086,
        0.0021118647418916225,
        0.024910952895879745,
        -0.0328645259141922,
        -0.050978489220142365,
        -0.02591034024953842,
        -0.06554882973432541,
        -0.028925640508532524,
        0.11455895751714706,
        0.07724654674530029,
        -0.010488652624189854,
        -0.04477060213685036,
        -0.013818730600178242,
        0.04726335406303406,
        0.13406066596508026,
        0.009691551327705383,
        -0.044010359793901443,
        0.004241806920617819,
        0.04121846333146095,
        0.06382542848587036,
        -0.001124427653849125,
        -0.005349908955395222,
        0.0957408994436264,
        -0.024497389793395996,
        -0.002641706494614482,
        -0.04426267743110657,
        0.12290594726800919,
        -0.10950271785259247,
        -5.9015917486249236e-08,
        0.016423042863607407,
        -0.0230182446539402,
        0.05694303289055824,
        -0.003957005683332682,
        -0.018391121178865433,
        -0.0178352240473032,
        -0.01867520809173584,
        -0.003426069626584649,
        0.10226837545633316,
        0.060189180076122284,
        0.02810131013393402,
        -0.03671873360872269,
        -0.11738081276416779,
        0.0629853680729866,
        -0.022007349878549576,
        0.046464595943689346,
        0.00545272184535861,
        -0.026919884607195854,
        0.02902740240097046,
        -0.02167351357638836,
        -0.02779432199895382,
        0.09244516491889954,
        -0.01898438110947609,
        -0.047050509601831436,
        -0.010837312787771225,
        0.032831769436597824,
        -0.02184673771262169,
        0.06702691316604614,
        0.013928701169788837,
        -0.016216663643717766,
        -0.030141711235046387,
        0.010412372648715973,
        -0.017545070499181747,
        0.07132809609174728,
        -0.05023161321878433,
        -0.05339663475751877,
        -0.08690367639064789,
        0.011445911601185799,
        0.022038187831640244,
        -0.010640038177371025,
        -0.02382592111825943,
        -0.10970041900873184,
        -0.06805888563394547,
        0.0048651909455657005,
        -0.01585509069263935,
        -0.09778118133544922,
        -0.06718720495700836,
        -0.06855688989162445,
        -0.0018514631083235145,
        0.05179600045084953,
        0.0052027516067028046,
        -0.08087009936571121,
        0.06306661665439606,
        -0.055839184671640396,
        0.13419638574123383,
        -0.01026875153183937,
        0.004857223946601152,
        -0.058301158249378204,
        -0.06899510324001312,
        0.02180441841483116,
        0.10398661345243454,
        -0.05934818834066391,
        0.02549532614648342,
        0.056042127311229706
    ]
}