{
    "id": "3ZzQ1wUJ9iA",
    "title": "Why the PS5 is LOSING Money",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2021-02-06T19:05:56Z",
    "video_url": "https://www.youtube.com/watch?v=3ZzQ1wUJ9iA",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "ps5",
        "playstation",
        "microsoft",
        "series x",
        "series y",
        "nintendo",
        "switch",
        "gaming",
        "console",
        "consoles",
        "tech",
        "technology"
    ],
    "views": 127960,
    "likes": 5267,
    "comments_count": 459,
    "description": "Sony lost HOW much on the PS5?! Fast Food Tier List:  I sold my body on Amazon.com:  The Pocket Gaming PC - GPD Win3:   I was Wrong about the Samsung Galaxy S21:  Reddit is Killing GameStop    Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/uOtEOcBAxys",
        "https://youtu.be/ayPHtwncuGU",
        "https://youtu.be/XldRhq0rz-g",
        "https://youtu.be/btP4DK5Nm6U",
        "https://youtu.be/s5BfSwLa1T4",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to \"This Is\". - I always do the the intro-- - No I do the intro. Hello and welcome to \"This Is\". Austin? - Yes? - PlayStation and Sony are hemorrhaging money with the PS5. - Wait, they're supposed to do that. That's how consoles work. - Correct, recently in a report with a call with shareholders, the board of Sony, just the board, right? Like - who's on the earnings call? You know like, CFO, a bunch of big titles. Basically, they had some good news that they sold over 4 million PS5s. - [Matt] 4.5, to be roughly exact. - I mean, that is actually an exact statement. 4.5 million PS5s, in the holiday quarter, which I think is November, December, I believe for Sony. - [Matt] Yeah. - The first two months of being on sale, which - Which, I would say, which does beat out the PS4, - Slightly. - By 0.1 million, so that's 100,000. - You know what, they probably waited their earnings call. Like they stopped counting like one day later, so they could sell that last handful of PS5 at the factory. So here's the thing, right? This is good news for Sony, because it means that, of course, surprise, surprise, people like the PS5. - And, I have to admit, I will, I'll say I was wrong. I'm wrong a lot. - Well, you're actually usually right. You're usually right about like AMC, movie theater. - Yeah, but, I had said that I thought it was gonna be like 100,000 PS5s that were sold. - 4.5 million, is a lot. - Somewhat of (mumbles) I can't say that. - Facetious. - Yeah, I can't say that with my lisp, that's fine. But that was somewhat of a made up number but I did not think it was gonna be 4.5 million. - Which is great news. And it is very clear that Sony would have sold way more if they could have produced way more, right? Like, every PS5 that is arriving on a store shelf is immediately, the little kid who's about to buy it is punched in the face by some 25-year-old dude, who takes it and flips it on eBay. Which of course is a problem, right? And we've talked about this before. More, well, I don't wanna say most. A lot of consoles are currently in resellers' hands. And a lot of people don't actually have their consoles. So, I don't know how many actually these consoles have been activated yet. Probably somewhat less than 4.5 million. - [Matt] Yeah, I like, I would say it's about 50-50 just, like looking through like Reddit and like seeing all the people who still can't get one, versus like how many people who can get one. You, they're so abundant on eBay that like, it's hard to say like, Oh, that people actually have these things. - Yeah. - But, it's not like Sony is making money on all, like, when you start seeing all of these PS5s being sold for $1,000 dollars, Sony doesn't make any of that. They're still losing money on that. - And that's - What a lot of people don't realize. - And that's one of the things we learned with this earnings report, surprise, surprise. Sony are selling you that $500 PS5, at a loss. Now this is not something brand new for the console industry, right? Typically speaking it, like you said, I guess unless you're talking about Nintendo. Typically speaking, companies such as Sony, such as Microsoft, such as Sega, I guess, such as, - What year is it? - Activision, I don't know I'm coming up. - Activision doesn't make consoles. - It's fine. They sell console at a loss. Which is reasonable. You think something like the PS3, that was an incredibly expensive console day one. And they were still losing money on it because, Sony, Microsoft and Nintendo, they made most of the money, not by selling you the console. Oh no, they make their money by selling you the games, selling you the online services, selling you the streaming, selling you, videos, selling you, Spotify, selling you, Game Pass. - So you're just explaining app stores in any form. - Yeah, that's true. - Yeah. Now what makes this generation of consoles slightly different, is that we have two versions of each of these consoles at significantly different price points, which normally we don't have. Normally when a console launches, well, you just have the console, and then there's cheaper, more efficient models later on where they can perfect manufacturing, which was cheaper to manufacture, it, whatever. But so now we have PS5, and then we have the Digital Edition, which is being sold at even more of a loss. - Yeah. - But then the real big loss, is the Xbox Series S. - So here's the thing, right? PS5 and Series X are both $500. I bet they're losing money on those 'cause you have to also consider that not only do you have to consider how expensive it is to manufacture and sell the console, but the Best Buys and the Amazons of the world take a cut of that. Sometimes a fairly substantial cut, right? So, once you actually get it imported and pay all your taxes and all that kind of stuff, these consoles are expensive. But then you look at the PS5 Digital Edition, which is $400 instead of 500 bucks, that the difference in the hardware between the two consoles, I'll be generous and say it's $20, right? - Which, I think that's 10 times more than what it actually is. I think, there was like, it's like a $2 drive that they're putting in there when you're buying in bulk. - [Austin] For the Blu-ray, I think, I've heard estimates that somewhere in like the 14, $15 range to buy like a million Blu-ray drives. But regardless, Sony lose a lot of money on the digital compared to the standard. But it doesn't even really hold a candle to what Microsoft are doing. So, to be fair, Sony have admitted that they are like, they had lost a bit of money or they the revenue wasn't as high because they were losing money on PS5 individual sales. - [Matt] Now there was a rough estimate. This is not in any way, like a valid number, just an estimate from Bloomberg, that it costs about $450 to manufacturer a PS5. - That checks out. You add the shipping, you add obviously all the R and D that needs to be paid off. And the fact that, you know, you're probably selling it to Amazon for what 430 or $450, or whatever their actual cut is, makes sense, right? But you look over on the Microsoft side. Series X is in a similar sort of boat. I do think the Series X is more expensive to manufacturer. - [Matt] I agree. - We've discussed this in the past. It has a more advanced cooling system. It is just a physically bigger chip, which just naturally means it's going to be more expensive. But then you look at the Series S, right? The Series S is $300. Which is very reasonable, I would say, for any kind of brand new console. There are SSDs that they sell that are almost that price, right? And this has the entire system in. And sure, it doesn't have a disc drive. But as we talked about, the disk drive is like 15 bucks. It doesn't have the advanced cooling. But that's another 20, 30 bucks, right? The Series S they're probably also losing money on. Now unfortunately, Microsoft does not break down their sales like Sony does, right? So we know that they've sold 4.5 million PS5s. We have no idea how many Xbox they've sold. This actually dates back to the Xbox One days. - [Matt] Right. - Where when the PS4 was completely wiping the floor with the Xbox One, Microsoft stopped announcing how many actual sales they have. And they, I think they report, is it like monthly users or active subscriptions or something like that? - Yeah, like active Xbox live subscription. I didn't figure out what it is. It's not - Active gamers or whatever. - It's not, a great number. Like, it's not a great way to tell because there's so many variables in that. - Yeah. - But yeah, like, this doesn't tell the full story, though, with, like you say. They're losing money on these. But at the same time, what they're losing the most money with consoles, you could argue that they're making the most money on those. - Sure, every console that goes out. So say it's a PS5 it has a five-year lifespan of someone's gonna be using it, right? In that five years, how many games are you gonna buy? How many months of PS Plus are you gonna pay for? How many random like, PlayStation Now games are you gonna stream, or whatever the case is. There's a lot of money that adds up there, which is how Sony and Microsoft pay for these ridiculously expensive sort of R and D projects to create consoles. - And when you don't have a disc drive, you're forced to get everything digitally through the store, which-- - Hurts GameStop. - That's why my, stonk. (laughter) I'm not gonna rant about how much money I lost. Well, like, as you guys have said, you like having physical games, because a lot of you like the resale value you being able to buy them cheap, whatever. Well, digital games rarely go on sale. They, I mean it's not never, but they rarely do. - Less often than Walmart's blowing out an old copy of \"Sonic\" and \"Mario Go\" to the moon. - Ignore sales completely, all right? Look, take two games, digital version, 60 bucks. 70 in the case of PlayStation. But so, all right, both of them are $70. One's physical, one's digital. When you have the physical one, you have the manufacturing costs to actually manufacture, distribute, all that stuff for the physical disk. Then there's the retailer cut with GameStop, Amazon, anything like that. And then there's the resale value of it. Where is if someone goes and turns it into GameStop and it gets sold back, they're not making any of that money. Whereas one console, one digital copy of it. That's full 70, that's obviously there's the cut of the developer. But that's, for the rest of it, pure profit. - I think I got the amount of numbers that were correct in that sentence. - [Matt] You got about halfway through, yeah. - I did start throwing extra numbers there. No, but it makes sense, right? Clearly they make more money on the digital versions. And clearly like the PC space has shown, things are moving in that direction. But you what sort of throws a wrench in this whole argument? Sony and Nintendo and Microsoft have different approaches to the way that they sell things. Because like we discussed, the Switch is sold at what we believe to be probably a slight profit, right? If it's a $300 Switch, they probably make a little bit on each console, which has always been the way that Nintendo does things, right? They'll typically have like less powerful hardware that will be able to hit a price point which is more reasonable. So here's a fun fact. They sold 4.5 million PS5s. - [Matt] Yep. - They probably sold a similar number of Xboxes. Very clearly, Sony and Microsoft sold every single PlayStation and Xbox they could make for the holiday quarter. The Switch sold almost 12 million units, over the slightly longer period, three months instead of two months. But that is the biggest quarter for the Switch ever. Including the launch quarter, including when all of these crazy games came out like when \"Animal Crossing\" came out last year, none of the quarters have ever been as much. In fact, the Switch has actually now passed the 3DS for the most units sold in Nintendo consoles, which is crazy because the Switch has been out for like, three years now? - Which is-- - Four years, something like that. - In, again, in pure Nintendo fashion, they have so many Switch sales, it's like, you know what? We're gonna stop making the DS now. - Yeah, so they're still, they did announce the think they had like 700 3DS, 700,000 3DS games sold. The 3DS is clearly drifting away, which is fine, right? It makes sense. - That's always how Nintendo has done some, done stuff. Again, if we didn't have the Sega, we would never have the SNES. Because they will just sell it, and, 'cause clearly that works, people are buying 'em, until there's a need to make something different. And right now, there is no need. - There's always been, a lot of talk about Switch Pro and all that kind of stuff which, should probably happen at some point. But as long as Nintendo are selling every Switch they can make. - Yeah, why would this, why would they put out the Switch Pro right now when, - Yeah. - So many are buying just regular switches. - It's interesting to think about how the space is because, Sony and Microsoft, specifically Microsoft, that we'll say, can afford to lose a good chunk of money on you know, building and designing Xboxes and everything. Because for them, the game is, get you on Game Pass, right? They want you to sign up for that monthly recurring revenue that you're gonna keep for years and years, as you buy games, as you, rent how do you actually would you describe the game on Game Pass? As you - Its the same - Borrow it? - Model as Netflix It's your, - Stream it? - You're stream - Streaming download, I don't know - They have to pay a licensing fee every time that's that stream. But I mean, so many of the games are now being owned by, for so many first party titles. Like, that's the big thing that all these companies are doing is, buying bigger. - Yeah. - Bigger developers, that way, everything's first party. It's hard to talk about Game Pass without at least mentioning, I know it's a couple of weeks now that this happened but, the price hike that Xbox tried to do. - Yeah. - It just kinda shows - We didn't even make a video on it because it was like over. - It was over in a couple hours. - Yeah. - But you know, that just goes to show you, they don't care about selling you the console. They care about selling you the service. Because, if you wanna take advantage of the console, you need the service. So - [Austin] Well then, as we talk about streaming games, there was also news recently that Stadia have sort of killed off their development arm. Not surprising, at all. - I got stuff to say about that as well. - All right. - I know - Everyone, make sure to subscribe, like the video and ring-a-ling the ding-a-ling bell, - Before I make my opinion - Because Matt's about to talk about streaming games. And please don't want, stop watching the video. Pay attention, y'all. It's about to get spicy. Matt, hit us with your Stadia hot take. - All right, this is not actually me pitching for cloud gaming. - Okay. - I, It still, I mean it does solve a lot of problems, whatever, skip it. - I mean the correct answer, but whatever. - I don't blame Stadia for getting, for killing their studio like this. Because, it's a gamble and basically, what they're trying to do is say, \"All right, we're gonna take a, we're gonna invest in a brand new other developer. And just hope that they make a blockbuster game that can support our entire platform.\" - Yeah, that sounds about right. That to the platform's already been stood up. - That's, besides the point. Because this just happened with Amazon as well. They, with Luna, they had their, FPS, their first-person shooter game that they were gonna try and do that they canceled because, it's not a good business model to be like, \"We're gonna put literally all our eggs in one basket.\" - Yeah. - Whereas what they can say is, \"All right, we're gonna, rather than just, instead of putting billions of dollars towards developing, it's easier just to pay licensing fees to get, \"GTA Five,\" which is the best-selling game almost of all time. So like, I mean, granted, neither one of them have that yet. But that's like, that's where they're kinda going out to. So, I don't blame them for that. - I mean, I think Stadia is on a very clear path to one of two options. First of all, closing. Second of all, becoming more of a white label service of like, Ubisoft, do you wanna stream Ubisoft games? Or use it through our Stadia back-end or, partner with Stadia, like Luna is trying to do. - That's exactly what Luna's trying to do right now. - There's a lot of talk here about different ways that the industry is going. But I think the main takeaway is this. Sony are selling every PS5 they can make. It is gonna be a while before they're back in stock in any kind of regular fashion. Same thing on the Xbox side. The Series S is starting to become a little bit more popular or at least available. But I mean, Microsoft has straight up said that they expect it to be easily into June or later before the Series X is in, regular supply. And, the funny thing about all of it is, they're losing money. Almost like if you purchased some questionable crypto, or, stock or future or something, that would be unfortunate. But anyway, thank you very much for watching this episode of \"This Is\". Again, please make sure to ring-a-ling the ding-a-ling bell 'cause otherwise, Matt will not be able to pay rent this month. - Please.",
    "transcript_keywords": [
        "Sony",
        "money",
        "Yeah",
        "Microsoft",
        "games",
        "console",
        "Switch",
        "make",
        "consoles",
        "sold",
        "Series",
        "losing money",
        "selling",
        "Game",
        "Xbox",
        "Game Pass",
        "Nintendo",
        "lot",
        "million",
        "Digital"
    ],
    "transcript_entity_values": [
        "Luna",
        "about $450",
        "SNES",
        "two months",
        "the Digital Edition",
        "Reddit",
        "digital",
        "the holiday quarter",
        "three years",
        "300",
        "20",
        "60 bucks",
        "June",
        "$1,000 dollars",
        "Nintendo",
        "One",
        "430",
        "billions of dollars",
        "PlayStation Now",
        "a couple of weeks",
        "30 bucks",
        "Microsoft",
        "500",
        "PS4",
        "Xboxes",
        "4.5 million",
        "about 50-50",
        "Second",
        "15",
        "Stadia",
        "PS5",
        "The Series S",
        "the Best Buys",
        "Five",
        "CFO",
        "Matt",
        "three months",
        "Austin",
        "Xbox One",
        "less than 4.5 million",
        "years and years",
        "Switch Pro",
        "Xbox",
        "Xboxes",
        "70",
        "Netflix",
        "the Switch Pro",
        "first",
        "one day later",
        "10",
        "last year",
        "Mario Go",
        "PS5",
        "eBay",
        "2",
        "25-year-old",
        "the Series S",
        "The Series S",
        "The first two months",
        "$300 Switch",
        "Luna",
        "Blu-ray",
        "20",
        "FPS",
        "PS Plus",
        "this month",
        "the Series X",
        "five-year",
        "3DS",
        "400",
        "Digital Edition",
        "500 bucks",
        "the launch quarter",
        "Sega",
        "PlayStation",
        "GameStop",
        "First",
        "PS3",
        "450",
        "one",
        "five years",
        "PS4",
        "a couple hours",
        "14",
        "700,000",
        "15 bucks",
        "100,000",
        "Spotify",
        "AMC",
        "monthly",
        "Ubisoft",
        "70",
        "million",
        "two",
        "November, December",
        "Walmart",
        "4 million",
        "0.1 million",
        "Amazon",
        "Bloomberg",
        "One days",
        "Sony",
        "Game Pass",
        "Sonic",
        "700",
        "Switch",
        "almost 12 million"
    ],
    "transcript_entity_types": [
        "PERSON",
        "MONEY",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "DATE",
        "MONEY",
        "ORG",
        "MONEY",
        "NORP",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "FAC",
        "EVENT",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "EVENT",
        "DATE",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "MONEY",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.017691267654299736,
        -0.02453038841485977,
        0.10094694048166275,
        -0.00924686249345541,
        0.09116162359714508,
        0.01357957348227501,
        0.071390300989151,
        0.038896143436431885,
        0.08790493756532669,
        0.09506074339151382,
        -0.06591854989528656,
        0.07260128110647202,
        -0.0005943734431639314,
        -0.065133236348629,
        0.01712908037006855,
        -0.0831293836236,
        0.004111630842089653,
        -0.057504165917634964,
        -0.0857890397310257,
        -0.008545992895960808,
        0.014239410869777203,
        -0.10811331123113632,
        -0.04098726063966751,
        0.025510460138320923,
        0.06043783575296402,
        0.06220678612589836,
        -0.05768457055091858,
        0.009875091724097729,
        -0.052595436573028564,
        0.01913398876786232,
        -0.07946368306875229,
        0.0722612664103508,
        0.01912975125014782,
        -0.010573207400739193,
        -0.013277169317007065,
        -0.01921003870666027,
        0.007803928107023239,
        0.0013103453675284982,
        -0.061821479350328445,
        -0.005729755386710167,
        0.036402855068445206,
        -0.01382096391171217,
        -0.07542125880718231,
        0.10051655769348145,
        0.005361279007047415,
        -0.04210129752755165,
        -0.02408892847597599,
        -0.007898085750639439,
        0.012564350850880146,
        0.03711092472076416,
        -0.07210186868906021,
        -0.01772492192685604,
        0.0751715898513794,
        -0.038469795137643814,
        -0.09348040074110031,
        -0.03926914185285568,
        0.023081758990883827,
        0.003457389771938324,
        0.08456945419311523,
        0.041680388152599335,
        0.030870908871293068,
        -0.14072014391422272,
        -0.05221015587449074,
        0.0052674636244773865,
        0.020536206662654877,
        0.027030887082219124,
        0.047721825540065765,
        0.03002685308456421,
        -0.06379860639572144,
        0.04422500729560852,
        -0.00761051382869482,
        -0.009306655265390873,
        0.08213155716657639,
        0.05658624321222305,
        -0.07180193066596985,
        0.009164574556052685,
        0.05765116959810257,
        0.0043731010518968105,
        0.014512944966554642,
        0.04701179265975952,
        0.07732708752155304,
        -0.04708612710237503,
        -0.12427854537963867,
        -0.05003662034869194,
        -0.008232718333601952,
        0.05194567143917084,
        0.02236778661608696,
        0.0034753952641040087,
        0.004605705849826336,
        -0.0147235207259655,
        -0.06895878911018372,
        0.0238634180277586,
        0.059242043644189835,
        -0.019002603366971016,
        -0.08922725915908813,
        0.027290258556604385,
        -0.11551274359226227,
        -0.05442744493484497,
        0.021471161395311356,
        0.05214083567261696,
        0.006051334552466869,
        0.10403735190629959,
        0.049843836575746536,
        -0.04059285670518875,
        -0.040509458631277084,
        -0.05605223402380943,
        -0.08920601010322571,
        0.0808350145816803,
        0.016234872862696648,
        0.026696261018514633,
        -0.115853451192379,
        0.022857004776597023,
        -0.05958240479230881,
        0.0019510339479893446,
        0.06083383783698082,
        0.07281828671693802,
        -0.06273028999567032,
        0.06619056314229965,
        0.022306622937321663,
        -0.007237086538225412,
        0.032141320407390594,
        0.06519804894924164,
        -0.060478951781988144,
        0.02544022910296917,
        4.5011271140538156e-05,
        -0.04262589290738106,
        -0.05301271751523018,
        1.8223032297000394e-34,
        -0.0094314469024539,
        0.06587877124547958,
        0.08639226108789444,
        0.037602659314870834,
        -0.08976536244153976,
        -0.0029447772540152073,
        -0.004307631868869066,
        0.050494857132434845,
        -0.010880779474973679,
        0.07442843168973923,
        -0.004442241042852402,
        0.019258344545960426,
        0.0010575224878266454,
        0.0024039908312261105,
        0.059005703777074814,
        0.0018905727192759514,
        -0.006247763987630606,
        -0.0030924086458981037,
        0.04475860670208931,
        0.011566792614758015,
        0.008981370367109776,
        0.015391772612929344,
        0.05847550556063652,
        0.006330514792352915,
        0.024843854829669,
        0.03435533866286278,
        -0.11807664483785629,
        -0.024378320202231407,
        0.08025319874286652,
        0.0015485784970223904,
        -0.07201983779668808,
        -0.007498921360820532,
        0.06281158328056335,
        -0.03381079062819481,
        0.029121998697519302,
        -0.06865841150283813,
        0.06692838668823242,
        -0.039817482233047485,
        0.07988449186086655,
        0.03112400881946087,
        -0.05005025863647461,
        0.020950250327587128,
        -0.08940119296312332,
        0.020751366391777992,
        -0.02683999016880989,
        0.03921955078840256,
        -0.07783182710409164,
        -0.07339023053646088,
        -0.06172521039843559,
        0.014612101949751377,
        -0.0017562233842909336,
        0.07247453182935715,
        0.04587462916970253,
        0.025608278810977936,
        0.030716098845005035,
        -0.08320869505405426,
        -0.027427738532423973,
        -0.05545812472701073,
        0.00984220951795578,
        0.04047205299139023,
        0.10534204542636871,
        0.04289261996746063,
        -0.0023845024406909943,
        0.03129599243402481,
        -0.11304869502782822,
        0.13231074810028076,
        0.12923137843608856,
        0.03524228185415268,
        -0.00833485834300518,
        0.018318185582756996,
        0.006774555891752243,
        0.02435140311717987,
        -0.02327468805015087,
        0.027985969558358192,
        0.04440540820360184,
        -0.010769049637019634,
        -0.03092184104025364,
        -0.013978534378111362,
        -0.007493217475712299,
        0.10154116153717041,
        -0.009297642856836319,
        -0.01195487380027771,
        -0.014329865574836731,
        0.016208956018090248,
        0.004882308188825846,
        0.08120611310005188,
        0.0976778045296669,
        -0.03123677894473076,
        -0.00665117334574461,
        -0.0347459577023983,
        -0.04563942179083824,
        -0.07374023646116257,
        0.019809817895293236,
        0.08271787315607071,
        -0.012195546180009842,
        -2.155133343040335e-33,
        -0.020393548533320427,
        -0.0793401375412941,
        -0.001419378793798387,
        -0.014087773859500885,
        -0.10581633448600769,
        -0.052406203001737595,
        -0.040225449949502945,
        -0.033883560448884964,
        -0.041673511266708374,
        -0.010106385685503483,
        -0.01930529810488224,
        0.03363628685474396,
        -0.06463662534952164,
        0.055822182446718216,
        -0.032092370092868805,
        -0.05592285841703415,
        0.05171757936477661,
        -0.06447703391313553,
        0.022616678848862648,
        -0.04790457710623741,
        0.10458460450172424,
        0.06312905251979828,
        0.021922996267676353,
        0.08777259290218353,
        0.01672903634607792,
        0.04300340637564659,
        0.05128059163689613,
        -0.010759169235825539,
        0.025951746851205826,
        -0.02167511358857155,
        -0.0032600238919258118,
        -0.017794784158468246,
        0.005006066523492336,
        -0.030407069250941277,
        0.01774117909371853,
        0.025588326156139374,
        -0.03576601669192314,
        -0.0037337548565119505,
        -0.009011887013912201,
        -0.029174311086535454,
        -0.004921871703118086,
        0.025500426068902016,
        -0.028446124866604805,
        -0.02912532538175583,
        -0.03795754536986351,
        -0.0558614544570446,
        0.023822352290153503,
        -0.002195072825998068,
        0.11337040364742279,
        0.011026044376194477,
        0.09213681519031525,
        -0.01792837120592594,
        -0.08694043010473251,
        0.00943911261856556,
        -0.07815588265657425,
        -0.026598375290632248,
        -0.08837464451789856,
        0.009194890968501568,
        -0.027296461164951324,
        -0.0576302744448185,
        0.03142620250582695,
        0.007651597261428833,
        -0.03275824710726738,
        0.024335315451025963,
        0.0011829393915832043,
        0.03392987325787544,
        0.13424763083457947,
        -0.055715639144182205,
        0.019071228802204132,
        -0.09182737022638321,
        -0.060093510895967484,
        -0.02442857436835766,
        -0.044075675308704376,
        0.013731780461966991,
        -0.03788529708981514,
        0.16077221930027008,
        -0.04440297931432724,
        0.0029565594159066677,
        0.01829371228814125,
        0.020160485059022903,
        -0.031342849135398865,
        0.008692355826497078,
        0.004814197309315205,
        0.004901716485619545,
        0.009279840625822544,
        0.006928172893822193,
        0.01725887320935726,
        -0.02733575738966465,
        -0.012218980118632317,
        0.006906427908688784,
        -0.04596114158630371,
        -0.06490222364664078,
        -0.00952256377786398,
        0.04031653329730034,
        -0.022891808301210403,
        -5.215730780605554e-08,
        0.1160486564040184,
        -0.024117648601531982,
        0.014698270708322525,
        0.01795247755944729,
        0.07543657720088959,
        -0.02555019035935402,
        -0.0009200376807712018,
        0.000707634724676609,
        0.10524629801511765,
        0.07704973220825195,
        0.017471255734562874,
        -0.011523311957716942,
        -0.05141865462064743,
        0.0036132624372839928,
        -0.025177909061312675,
        0.05100405588746071,
        -0.08564769476652145,
        0.011318142525851727,
        0.011843489482998848,
        -0.019781066104769707,
        -0.043209850788116455,
        0.03366641700267792,
        0.009332702495157719,
        -0.08095800131559372,
        0.04490518197417259,
        -0.07229485362768173,
        -0.020523283630609512,
        0.01034975703805685,
        0.012453557923436165,
        0.007660840172320604,
        -0.0005994854145683348,
        -0.10802987962961197,
        -0.026478035375475883,
        -0.03067775070667267,
        0.05279390886425972,
        -0.04983408376574516,
        0.042285479605197906,
        0.00020454586774576455,
        0.010911007411777973,
        -0.016368171200156212,
        -0.07792264968156815,
        -0.07601448148488998,
        -0.03265748172998428,
        0.04381144046783447,
        -0.029724417254328728,
        -0.008630073629319668,
        -0.11197194457054138,
        -0.020412705838680267,
        -0.005558351054787636,
        -0.1023494154214859,
        -0.010381212458014488,
        0.022853730246424675,
        -0.014876840636134148,
        -0.015481041744351387,
        -0.002273133024573326,
        -0.03490477427840233,
        -0.0033947033807635307,
        0.025964850559830666,
        -0.06103690341114998,
        -0.023570045828819275,
        -0.022821273654699326,
        -0.08633989840745926,
        -0.01532577071338892,
        0.04208758845925331
    ]
}