{
    "id": "40RrN1PPVY8",
    "title": "RED Hydrogen One Review: Hollow Graphics",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-11-06T23:56:41Z",
    "video_url": "https://www.youtube.com/watch?v=40RrN1PPVY8",
    "category": "Science & Technology",
    "tags": [
        "red hydrogen one review",
        "red hydrogen one",
        "hydrogen review",
        "red phone review",
        "red camera phone",
        "red digital cinema",
        "mrmobile",
        "michael fisher",
        "android central",
        "best camera phone 2018"
    ],
    "views": 143750,
    "likes": 5399,
    "comments_count": 401,
    "description": "The RED Hydrogen One is the first smartphone from RED Digital Cinema, the folks whose cameras have shot films from The Martian to The Hobbit to Transformers. But if you buy it, youll have to break the number-one rule of smart spending in mobile tech: buy it for what it is today, not for what it might be tomorrow. Come see why I'm holding on to mine (for better or worse) in MrMobile's RED Hydrogen One Review!   [SPONSOR]   Brought to you by Thrifter. Sign up for the Black Friday newsletter and follow Thrifter on Twitter to get the inside track on every bit of savings this Black Friday!   Newsletter:  Twitter:    [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S RED HYDROGEN ONE REVIEW]  MrMobile's RED Hydrogen One Review was produced following 15 days with a RED Hydrogen One review device provided by AT&T. The device was running software build H1A1000.007ho.01.01.01r.230 at presstime.   Additional footage courtesy Android Central. See Android Central's complete RED Hydrogen One review here:    [MUSIC]  Days and Days by Eternity Bro, available at Premium Beat:   Burning Man\" by Zac Nelson, available at Premium Beat:   Lets Get It by Eternity Bro, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #redhydrogenone #hydrogenone #reddigitalcinema #redhydrogen #red",
    "description_links": [
        "https://www.thrifter.com/black-friday-newsletter",
        "https://twitter.com/ThrifterDaily",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.androidcentral.com/red-hydrogen-one-review",
        "https://www.premiumbeat.com/royalty_free_music/songs/days-and-days",
        "https://www.premiumbeat.com/royalty-free-tracks/burning-man",
        "https://www.premiumbeat.com/royalty-free-tracks/let-s-get-it",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [MrMobile] This is the RED HYDROGEN One. It's the first smartphone from RED Digital Cinema. The folks whose cameras have shot films from The Martian to The Hobbit to Transformers. And if you buy it, you'll have to break the number one rule of smart spending and mobile tech. Buy it for what it is today. Not for what it might be tomorrow. (upbeat techno music) This review drops a little later than most. Which means that my unit has newer software than the version that started shipping to customers on launch day. Now that fixed a lot of things, but it also left a lot of problems unfixed. Holding the shutter button still doesn't launch the camera from standby most of the time. App crashes and general lag are still more common than on similarly speced phones. And while phone calls are generally fine., switch on over to the speakerphone and callers start complaining of terrible voice quality. The company said it has a fix in the works for that last one among others, but it's these foundational things that remind you many times a day that RED has never done this before. But you know what? When it comes to hardware, that newcomer's influence is exactly what we need in 2018. By that I mean this is not just another reflexive copy of the iPhone X. Check it out. In these close ups, you've probably noticed a lot of dust and dirt caught in the crevices of my review sample. Well that's because I've treated like a piece of gear. Instead of babying it like, well, a piece of glass. The HYDROGEN One is made from aluminum and Kevlar. It masses over 250 grams. That's 25% heavier than Samsung's Note9. It dwarves most other phones. Yet it sticks to your hand better than them too. Thanks to the grooves on the scalloped metal side rails. Those grooves make the fast and accurate fingerprint sensor a breeze to feel out and click. The volume buttons on the other side are so satisfying to press; even if one of them clicks differently than the other. And tucked up along side the proximity sensor is a huge bright notification light. I love this hardware. Every time I pick it up, I'm impressed all over again. I'm also pretty happy with endurance. The HYDROGEN One packs a huge 4500 milliampere power battery. And while I think some optimization could make it last longer, on my heaviest day it endured a morning of 4G hot spotting, an afternoon of filming and an evening of podcast streaming. Same with the speakers. I expected a bit more volume from such massive drivers, but I was spoiled having come directly from the Razer Phone 2. With the audio 3D mode enabled, the speakers are better than average. And they're front firing. On the whole still a win. Now here's where it all falls apart. The display. Not in standard mode where it's a perfectly serviceable quad HD LCD. The problem is beneath that. RED has followed in the footsteps of LG, HTC and Amazon in trying to make smartphone 3D a thing. And despite being a technological achievement, that's noteworthy and laudable. It ultimately meets the same fate as those doomed attempts. RED calls this a holographic display. It is not. RED says it's better than 3D without glasses. And what it is, is more like watching a 3D movie when you've forgotten your 3D glasses. - Kinda cool but it's also kinda just strained. Kinda reminds me of like when you go see a 3D movie and you put on the glasses and eventually you get used to it. - [Male] Right, but it takes like 10 minutes? - Yeah. - [MrMobile] I will say this, it does one thing that creatives will love. Something that I will go so far was to say is important. When you're shooting, it forces you to look at the scene differently. In 4V mode you'll find that you start framing shots especially to emphasize depth. Get it just right and you really can create something almost magical. A photo that seems to jump of the screen. The effect doesn't translate well to video so I asked my excellent graphics people to whip up this little mock-up to illustrate what it looks like when it's working well. And RED has made admirable efforts to make sharing that content easier with a nascent network just for 3D content. But displaying it in a way that wows people instead of making them sick, well, that's no easier with this than it was on the EVO 3D seven years ago. So while the intent behind 4V is admirable, the execution is dim. It's color shifted. It's grainy. In a word, it's bad. Fortunately, for every 4V photo you shoot, the HYDROGEN One also captures a conventional photo. They're not as poppy and dynamic as ones from the Pixel 3 or iPhone XS. They're not meant to be. Remember, this is a tool for filmmakers. It's meant to be as color accurate as possible. And to my eye, it excels here. But, it's probably not meant to be this noisy. And it's probably also supposed to have enough dynamic range not to blow out the highlights as often as it does. There are more updates to come. Including hopefully some more manual focus features. And there's an update to the 4V side that will enable a bouquet effect for 3D. So the story of the built in camera is still very much being written. The reasons I'm gonna hold onto my HYDROGEN One has nothing to do with that camera. It has to do with this one. See these pins on the phone's posterior? Well in 2019 RED promises a family of modules that'll click onto them like extra batteries, extra memory and a cinema module. One with a dedicated sensor and a mount that can accommodate lenses from Nikon, Leica, Canon, and my own personal pick, Sony. That means I'll be able to click one one of these lenses directly to my smartphone. And that, more than anything else, is why I'm holding onto the phone I paid for even after I sent my review device back. Of course I have the luxury of doing so because I'm one of the target customers. A mobile videographer who can write off the $1300 cost as a business expense. Well actually $1600 since I sprung to the titanium phone. But something camera people need to understand is that smartphones, particularly Android phones, don't age as gracefully as cameras do. If that cinema module takes until the latter half of next year to arrive, we'll have to use it on a smartphone powered by a processor that's almost two generations old. And that's not a component you can just swap out. We'll be missing out on not just the speed that a newer processor provides, but also all the extra imaging chops, such an SoC brings with it. And we have no idea how well RED is gonna keep up with the software updates. I'm talking Android platform updates, security updates, feature updates, all the updates. So to buy a HYDROGEN One today is more than just to drop a ton of money. It's to make a leap of faith that RED is going to take care of you. That it's going to make the same commitment to smartphones that it did to cameras. It certainly worked out in the world of cinema. Whether that will translate to mobile is still very much an open question. Folks, Black Friday is coming up and it's longer than ever which means deals are already starting. It also means there's more mediocre non deals to sift through in order to find the great ones. Luckily, Thrifter is obsessive about deals year round; from tech to gaming to fashion to fitness and beyond. Sign up for the Black Friday newsletter and follow Thrifter on Twitter to get the inside track on every bit of savings this Black Friday. And thanks to Thrifter for sponsoring this video. I want to hear from you folks. Have you ordered a HYDROGEN One? Played with it at the store? Or are you a veteran of RED cameras with thoughts to share? Drop 'em in the comments and please do subscribe to me, MrMobile, on YouTube if you'd like to see more reviews. Until next time, thanks for watching! And stay mobile, my friends.",
    "transcript_keywords": [
        "RED",
        "RED Digital Cinema",
        "HYDROGEN",
        "RED Digital",
        "RED HYDROGEN",
        "Black Friday",
        "updates",
        "make",
        "Hobbit to Transformers",
        "phone",
        "RED cameras",
        "Digital Cinema",
        "cameras",
        "camera",
        "smartphone",
        "Cinema",
        "side",
        "phones",
        "buy",
        "Black"
    ],
    "transcript_entity_values": [
        "Kevlar",
        "Nikon",
        "a ton",
        "3D",
        "year",
        "RED",
        "the Razer Phone 2",
        "an afternoon",
        "launch day",
        "over 250 grams",
        "Samsung",
        "Black Friday",
        "one one",
        "tomorrow",
        "RED Digital Cinema",
        "2018",
        "YouTube",
        "SoC",
        "EVO",
        "a morning",
        "10 minutes",
        "Leica",
        "25%",
        "3",
        "today",
        "first",
        "One",
        "iPhone XS",
        "4",
        "seven years ago",
        "almost two",
        "Canon",
        "1600",
        "Martian",
        "2019",
        "LG",
        "1300",
        "4500",
        "HYDROGEN One",
        "HTC",
        "4V",
        "Thrifter",
        "Friday",
        "MrMobile",
        "Twitter",
        "the latter half of next year",
        "Sony",
        "one",
        "Android",
        "Amazon"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "TIME",
        "DATE",
        "QUANTITY",
        "ORG",
        "EVENT",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "TIME",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "NORP",
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.12339307367801666,
        0.028459470719099045,
        -0.00857544131577015,
        -0.03729424253106117,
        0.07322735339403152,
        -0.056382838636636734,
        -0.012635504826903343,
        0.07148528844118118,
        -0.025292832404375076,
        -0.08399982750415802,
        0.00013268650218378752,
        0.04018469527363777,
        0.02988654002547264,
        -0.02540716528892517,
        0.03408247232437134,
        -0.009368903934955597,
        0.12858085334300995,
        -0.09823694825172424,
        -0.012197963893413544,
        -0.04530559107661247,
        -0.046561893075704575,
        -0.07403290271759033,
        0.007414667867124081,
        0.0004594681959133595,
        0.0539659783244133,
        0.023084459826350212,
        -0.014069716446101665,
        0.01389817800372839,
        -0.10458115488290787,
        -0.09626978635787964,
        0.004940547049045563,
        0.01371402945369482,
        0.040041957050561905,
        -0.016290957108139992,
        0.012251184321939945,
        -0.03054528869688511,
        0.01949949748814106,
        -0.029236655682325363,
        -0.07551411539316177,
        -0.0736212357878685,
        -0.03153292462229729,
        -0.07020905613899231,
        0.07911202311515808,
        0.051157113164663315,
        -0.005550839938223362,
        0.0042432998307049274,
        0.06769338250160217,
        -0.025616010650992393,
        -0.013159312307834625,
        -0.08665569126605988,
        0.019701756536960602,
        -0.0016087060794234276,
        0.06403354555368423,
        0.02525392174720764,
        -0.08012256771326065,
        0.05181950703263283,
        -0.03635764494538307,
        0.03769475594162941,
        0.07923533767461777,
        -0.1082126572728157,
        -0.028505539521574974,
        -0.031266577541828156,
        -0.021901050582528114,
        -0.019298648461699486,
        -0.02867574244737625,
        -0.024688173085451126,
        0.02280334010720253,
        -0.10287103801965714,
        0.032697465270757675,
        -0.014838467352092266,
        -0.010130945593118668,
        0.01155470684170723,
        0.006278645247220993,
        -0.06465883553028107,
        -0.01138366013765335,
        0.021055882796645164,
        0.12787647545337677,
        -0.02299463376402855,
        -0.01626511663198471,
        -0.0015191402053460479,
        0.07251286506652832,
        -0.019051289185881615,
        -0.03647002577781677,
        -0.018081078305840492,
        0.051333799958229065,
        0.0348990261554718,
        -0.006775821093469858,
        0.04315844923257828,
        -0.10928389430046082,
        -0.05864677205681801,
        -0.04507226124405861,
        0.07814408093690872,
        0.025985000655055046,
        0.04759138077497482,
        -0.06157006323337555,
        -0.005783934611827135,
        -0.044307317584753036,
        -0.004025673493742943,
        0.012465471401810646,
        0.0388663150370121,
        0.04184141382575035,
        0.022442664951086044,
        0.005552666261792183,
        -0.020432056859135628,
        0.0088536087423563,
        -0.11930433660745621,
        -0.08054367452859879,
        0.12389042973518372,
        0.0524723157286644,
        -0.0063300831243395805,
        0.02513521909713745,
        -0.07758856564760208,
        0.015955282375216484,
        -0.03677353635430336,
        -0.0583731010556221,
        -0.01004839688539505,
        -0.022766588255763054,
        0.0520116351544857,
        -0.010168926790356636,
        0.025947703048586845,
        0.016855766996741295,
        -0.020716046914458275,
        -0.014142218045890331,
        -0.10771448165178299,
        0.06330783665180206,
        -0.05575982853770256,
        -0.05642995610833168,
        7.758477977830092e-33,
        -0.004384947475045919,
        0.06947022676467896,
        -0.02686404064297676,
        -0.022906148806214333,
        -0.0432983860373497,
        0.037029579281806946,
        -0.04077760875225067,
        0.08022437989711761,
        0.03465499356389046,
        -0.055329132825136185,
        -0.015292970463633537,
        0.03083256259560585,
        -0.10068976134061813,
        0.007141566835343838,
        -0.0956183522939682,
        -0.09395719319581985,
        -0.0019613958429545164,
        -0.06363490968942642,
        -0.09992794692516327,
        0.008341887965798378,
        -0.11635560542345047,
        -0.0320405513048172,
        -0.014165491797029972,
        -0.03999437764286995,
        0.04012490063905716,
        0.05665018409490585,
        0.06577431410551071,
        -0.04685884714126587,
        0.09082278609275818,
        0.043325841426849365,
        -0.058198899030685425,
        0.003234958741813898,
        -0.012913856655359268,
        0.040341563522815704,
        -0.034695278853178024,
        0.00973501056432724,
        -0.12399472296237946,
        -0.048238355666399,
        -0.033440906554460526,
        -0.07731840759515762,
        -0.047593262046575546,
        0.0900229960680008,
        -0.1408214271068573,
        -0.009868505410850048,
        0.056357186287641525,
        -0.007830475457012653,
        0.03632526099681854,
        0.06655599921941757,
        -0.029910175129771233,
        0.05142227187752724,
        -0.01744113489985466,
        -0.006136207841336727,
        -0.0037791691720485687,
        0.035660240799188614,
        -0.013508817180991173,
        -0.04665132239460945,
        0.020245151594281197,
        0.0018441377906128764,
        0.08753083646297455,
        0.007994375191628933,
        0.021911609917879105,
        0.11308196932077408,
        -0.020243145525455475,
        0.035916589200496674,
        -0.07059049606323242,
        0.09821669012308121,
        0.015125943347811699,
        -0.027173982933163643,
        -0.04134972766041756,
        0.07845579087734222,
        0.03820173814892769,
        -0.04462253302335739,
        0.07081647217273712,
        -0.08077012747526169,
        0.007129417732357979,
        0.04130139574408531,
        0.029295790940523148,
        -0.016874419525265694,
        -0.00649346923455596,
        -0.02074747160077095,
        -0.05881665274500847,
        -0.026094628497958183,
        0.09690990298986435,
        0.037385243922472,
        0.0011836414923891425,
        -0.021400785073637962,
        -0.045808758586645126,
        -0.03472898155450821,
        -0.019323229789733887,
        0.02533603645861149,
        -0.018135273829102516,
        -0.07630015909671783,
        -0.002586518181487918,
        -0.02532910741865635,
        0.037548843771219254,
        -6.907112235251634e-33,
        -0.023479120805859566,
        0.0014707398368045688,
        -0.07304682582616806,
        -0.0033440750557929277,
        0.0820879265666008,
        -0.01547209732234478,
        -0.0023873387835919857,
        0.03381354361772537,
        0.04446762800216675,
        -0.03586159646511078,
        0.021159566938877106,
        0.022248899564146996,
        -0.06366837024688721,
        0.020399060100317,
        0.051060620695352554,
        -0.041113488376140594,
        0.026329996064305305,
        -0.0617641806602478,
        0.0237417072057724,
        0.06547503173351288,
        0.030155491083860397,
        0.010954133234918118,
        -0.0421622209250927,
        0.11839648336172104,
        -0.008537928573787212,
        0.019590245559811592,
        0.04041536897420883,
        0.006906602066010237,
        0.051639266312122345,
        -0.020175201818346977,
        -0.006087528541684151,
        -0.024406759068369865,
        0.010904095135629177,
        0.018201852217316628,
        0.015182646922767162,
        0.03949159383773804,
        0.0546170249581337,
        0.025605497881770134,
        -0.04643672704696655,
        -0.02262341044843197,
        0.00544679956510663,
        -0.03252021223306656,
        -0.022257307544350624,
        0.0075041763484478,
        0.004102553706616163,
        0.018320240080356598,
        -0.026853106915950775,
        0.015845512971282005,
        0.0046485597267746925,
        0.02792215161025524,
        0.046704646199941635,
        0.03435754030942917,
        -0.030659815296530724,
        -0.004062996711581945,
        -0.05650561675429344,
        -0.04051359370350838,
        0.05328662693500519,
        0.0676506757736206,
        0.004335127305239439,
        0.026078535243868828,
        0.0225724745541811,
        0.017336461693048477,
        -0.041209831833839417,
        0.022865809500217438,
        -0.10481248050928116,
        -0.049762800335884094,
        0.13031630218029022,
        -0.020414333790540695,
        0.0034153079614043236,
        0.06000485643744469,
        0.017671572044491768,
        0.011195969767868519,
        0.023687142878770828,
        -0.04551658034324646,
        0.013525240123271942,
        -0.022918784990906715,
        -0.04080177843570709,
        -0.01020266953855753,
        0.018780101090669632,
        -0.03575858846306801,
        0.004107681103050709,
        0.014141994528472424,
        0.08662186563014984,
        0.048854704946279526,
        0.14475813508033752,
        -0.029003020375967026,
        0.0004614200151991099,
        0.006912262178957462,
        -0.09777890890836716,
        0.07369767129421234,
        0.00989819411188364,
        0.05354965105652809,
        -0.07833736389875412,
        0.11300256848335266,
        -0.025789383798837662,
        -6.015235953782394e-08,
        0.12263625860214233,
        -0.0008346011163666844,
        0.07354936748743057,
        -0.037218764424324036,
        0.010098781436681747,
        -0.025086289271712303,
        0.07793939113616943,
        0.03165670484304428,
        0.016589360311627388,
        0.025498315691947937,
        0.018638748675584793,
        -0.05205942690372467,
        0.00827647466212511,
        -0.05256184563040733,
        -0.00021198010654188693,
        0.05882317200303078,
        -0.0010885692900046706,
        0.027082933112978935,
        -0.03359800949692726,
        0.06421135365962982,
        0.027050962671637535,
        0.010288088582456112,
        0.005674293730407953,
        -0.08973648399114609,
        0.08200256526470184,
        0.003218414494767785,
        -0.031511854380369186,
        -0.04796046018600464,
        0.08231880515813828,
        -0.06529057770967484,
        -0.0018480693688616157,
        0.06486192345619202,
        0.09200132638216019,
        -0.03760068863630295,
        0.017708970233798027,
        -0.08587857335805893,
        0.053563665598630905,
        0.035697419196367264,
        0.011678117327392101,
        -0.031028343364596367,
        -0.007931504398584366,
        -0.006583054084330797,
        -0.05457167327404022,
        -0.01689453423023224,
        -0.030368391424417496,
        -0.00887329038232565,
        -0.06139544025063515,
        -0.13844279944896698,
        -0.066851407289505,
        0.08068803697824478,
        -0.0110531747341156,
        0.0023993642535060644,
        -0.05195013806223869,
        0.005853069014847279,
        0.07007391005754471,
        0.027201557531952858,
        0.04223574697971344,
        -0.035094790160655975,
        -0.036418065428733826,
        0.028479740023612976,
        0.0889754518866539,
        -0.029245350509881973,
        0.005365799646824598,
        0.10953058302402496
    ]
}