{
    "id": "43XKfuptnik",
    "title": "Heat Pumps are Not Hard: Here's what it will take to start pumping",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2022-04-13T16:00:10Z",
    "video_url": "https://www.youtube.com/watch?v=43XKfuptnik",
    "category": "Science & Technology",
    "tags": [],
    "views": 856232,
    "likes": 31212,
    "comments_count": 4206,
    "description": "Is this the last video on heat pumps? Well, for a while anyway. This isn't a complete picture by any means, but I hope that you leave this video with the knowledge that this future is well within our grasp.  Hey! There's now a PLAYLIST with all the heat pump videos. You can find it with this clicky thing:   Technology Connextras (the second channel that stuff goes on sometimes):  Technology Connections on Twitter:  The TC Subreddit    And check out these cool people! Smith8154 , Kenneth Siewers Mller, jacob kamphaus, Slysdexia , HurleyPotter, Tommy McCarthy, Andrew Bobulsky, On Ice Perspectives, TheGreatCO , Petteri Hjort, Polaris, Nathan Obuchowski, Shaun Puzon, Vlycop, Devon Hodgson, Zimpan , Filmmaker IQ, Jan Houben, Bren Ehnebuske, T.J. Zientek, Vernon , Ton Brands, Scott Wright, Kory Howard, rezonant , Thanasis Dimas, Adam Quartarolo, Marc Grondin, HexTheDragon, Craig Kollai, Daniel Barrera, Erkin Alp Gney, Mark Stradling, Peter Sodke, Dee Dub, joseph , Kristian Scheibe, BigMcLargehuge510, Nick , The Orangewalled, Chris Cody, Jason Portwood, Chad Fertig, Joseph Houghtaling, Ben Tucci, Josh Braun, Ellie Dugger, Christopher Lowell, Oleg Korsunskiy, Michael Sacchi, Ali Elam, Dan Allen, Zhenbang Xiao, Markus Towara, Barky doggo, Ectra , Reid Fishler, Daniel Meagher, Joel , Clemens , Bill Bates, Dennis Walsh, Alex Warren, Paul Robins, Michael Gernoth, Les , Keenan Finucan, Ian Clanton-Thuon, Ryan Pratt, Paul Newton, Greg Golds, Gopher on the Road, aceat64, Ben Ratner, WildMartin, Paul Sharp, Craig Brickey, Zidy , Brandon , Karl Kornel, Danila Fediashchin, Adam , Ryan Kamphuis, WB , AmbientCyan , Sam Calandra, Miezensortierer, Will Preston, Christopher Olson, Kor Nielsen, Adrian Hunziker, Jacob Ford, Stephen Amar, GmCity , Andy24x, David Jeroslow, Charles MacDonald, Tim Jones, Crisco762 , Phil E, Jack Mudge, Ian Spence, Mike A, Leslie Deana, hipp1eguy , shacklesburst, Justin Derleth, NEON725, Emily Eisenberg, Tinker, Bard , Megan Lovett, LGR, kn0tsin , David Wulff, FirstWizardZorander, Paul Kavanagh, Isaac Clarke, Sean Hearrell, selectric, Keithius , Seb Bacanu, Mauricio , Hunter Thornsberry, Austin C Borger, Gabe Cook, Anapan, Hodgkin LeBlanc, Michael Snow, Sonic Ether, mike quick, Calisto, Adam , Lucas , Daniel Kraut, John de Largentaye, Peter Hillier, PeterH , William Holt, Ethan Hamel, Grant Campau, Michael Dunn, Kenny, Ugi Kutluoglu, Richard Hicks, Atlas Pup, Mike Roach, Matthew Schwartz, gs , ashka , Mr. Yan, Matthias Feist, adan c, Thomas Fuchs, Markus Wst, Alan Holland, Dan Boulden, Phiroze Dalal, Devin Rosenthal, electronicMe, G Cowell  00:00 Intro 01:02 Recap on why heat pumps are important 02:20 Insulate, Insulate, Insulate 08:16 What getting a heat pump is like 09:02 Ductless mini- and multi-split systems 15:15 Air-to-water heat pumps 18:15 The US is largely all set for heat pumps 19:40 Except... the equipment we can get isn't great 20:49 VRF systems and an outstanding performer 22:38 Things are starting to get better in the US... 24:42 But why have they been so bad for so long? 27:18 Getting a cold-climate heat pump is difficult 27:56 Price gouging 32:43 Pricing obfuscation and where to go from here 33:53 Ductwork challenges 37:33 Ambient noise concerns 40:29 A look at some packaged units 45:05 Jazzy bloopers",
    "description_links": [
        "https://www.youtube.com/playlist?list=PLv0jwu7G_DFVIot1ubOZdR-KC-LFdOVqi",
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections"
    ],
    "transcript": "Now that we (hopefully) agree that its time for more pumping more now, Id like to finish off this arc of heat pumps with a discussion on some of the many varieties thereare out there, what the parts that makeup those machines are and where they go, and whats involved in getting a building from no pumping to yes pumping. That includes not only the physical infrastructure, equipment and the challenges certain buildings will face, but also a discussion on some of the barriers there are to heat pump adoption. Some real, and some, lets just say... inflated. That particular wrinkle varies a LOT depending on where you are on the planet. New technologiesleave lots of room for misunderstandings - and this one is particularly fun because heat pumps are not new tech at all! Theyre a refinement of long-established tech used a little differently. *whispers* Your refrigerator is a heat pump. In case youre here without seeing the video this is following, well first - ding - thatll take you there, but the cliffsnotes version is this; Heat pumpsmove heat rather than create it. Although it may be colder outside than inside, unless were at absolute zero there is heat energy to be collected out there. And except in really coldambient conditions, as in below -13 Celsius or 5 Fahrenheit, modern heat pumps are able to moveat least 2.5 times as much energy as they consume in the process, making them the most efficient way to use any source of energy for the purpose of heating a building in the vast majority of cases. That means they lessen the need for fossil fuels in the short term, which is good for many reasons, and in the long-term they make electrification and decarbonization easier because well we cando more with less. Pretty straightforward. A small note before we continue: Imfocusing today on residential and light commercial stuff. When you getinto really big commercial systems, well, things are pretty different. Also,this is by no means a complete picture. My goal with this video is to give you a basic overview of common system designs, talk about some pros and cons of each particularly when it comes to retrofitting existing buildings, and then Ill talk about whatever otherstuff comes up as we go along. Strap in! The first thing we need to talk about actually has nothing to do with heat pumps whatsoever. And fair warning, this sectionmight get some folks a little heated. The wisest thing we can do in the short term can be expressed in these three simple words: insulate, insulate, and insulate. No matter whattechnology is used to heat a building, the faster heat makes it out of the building through walls and windows, the more heat you need to produce to keep the building warm. If you live in ahome that was built in the last 20 or 30 years, odds are youre probably in a decent placealready, depending on where you are of course. But in older buildings? Well, heatloss is often a major problem. Adding insulation to existing buildings (whichalso, by the way, includes things like new windows and general weatherizing) is a complicatedand often spicy topic. Some of this is because buildings are different and techniques suitablefor one type of construction arent necessarily suitable for others. And sometimes it makes moresense to demolish energy-intensive buildings and simply start over - but that course of actionhas lots of baggage attached to it so for now lets just ignore it and talk about improvingexisting buildings. In general, its not easy. But its definitely worth doing. Indisputably. A problem, though. It generally takes a long time to see a return on insulation investments. And when youre an individual simply being asked nicely to do it, well that puts you off. Afterall, if you wont see savings for 5 or 10 years and you arent even sure youll stay living whereyou do by that time, its a hard sell. Worse, if youre a landlord who is putting the cost of energy on your tenants, you just dont care! Which I, for the record, think is real bad. Shoutout tocountries that do energy audits on rental units and publish efficiency scores so that potentialtenants can see what theyre getting into before signing a lease and so that the landlords havea reason to do actually better. I like that a lot. Uh, anyway, incentives to insulate - or as I like to call them, insulentives - are probably something we should be doing, like, a lot more and faster. In fact, Ill go beyond justinsulentives - we should, dare I say it? Just start paying folks to insulateolder buildings. Maybe create some sort of energy-de-intensification agency? I know.What is this, Energy Policy Connections? Well, right now it is. The only way to equitably solvethis problem is with public policy, and while Im not here to tell you what exactly that should look like, Im certain something needs to happen. And, if I were in charge, I would make sure this isnt some financialized scheme where people get, like, loans tacked onto property tax bills. Butyou can have fun arguing about that down below. The key problem is that right now, many of the buildings which are most in need of insulationupgrades house families who would greatly benefit from them but who cannot afford the investment - or may simply have no say init at all. We should fix this. The fact is, unless somethings gone horribly wrong, everyinsulation upgrade will pay for itself in time. And Im just talking about the money part, include the externalities like energy supply stability and reduced carbon emissions and youregetting even more bang for that buck. Plus! If you can save someone $50 or $100a month on their energy bills, youve greatly enhanced their financial security. Which is also good for society! The trouble has always been its a big upfront cost which many simply cannot afford. Rather than engage in the national pastime of well, sucks to be you! Iwould rather we help those folks. Radical, I know. And by the way, this problem goesbeyond just those who cannot afford it. Sometimes, sorely-needed upgrades get deferred because incentives to do them just dont line up in any sensible way. For instance, I used tolive in an older apartment building where all occupants shared a single gas bill and paid forit collectively in a fixed, budgeted monthly cost. The building was new enough to be pretty-well insulated, but the windows were awful! They badly needed replacing. But our energy cost-sharingscheme meant that there wasnt a reason for me to bother replacing my four windows. Mygas use represented maybe 2% of the bill, so even if I somehow never needed heat again, 98% of my heating costs would remain. However, if we had gone in together as a building to replace all of the windows, we would almost certainly have seen our gas bill drop dramatically and suddenly the windows would actually pay for themselves, and pretty quicklyId imagine. Getting everyone to agree to it is, of course, the hard part. Its reallyfrustrating when stuff like this incentivizes us to remain in less-sustainablescenarios. And the less fortunate among us often have no choice but to takethe worse - or even worst - option. Anyway, Ill get off my soap box. Regardless of how we get there, the better a building can retain heat the less heating capacity is needed, and this also means the performance challenges heat pumps currently encounter at very cold temperatures just become less of an issue - which of course means well-insulated homes are better prepared for a heat pump. So, insulate, insulate, insulate. Heat pumps are great, but nothings better than helping a building hold in heat inthe winter and keep it out in the summer. OK, so lets move on. Finally. Youve got a nicelyinsulated home and are looking at replacing your whatever with a heat pump. What does that looklike? The equipment in a heat pump consists broadly of three parts: the outside unitwhich absorbs heat from the outside air, the inside unit or units which then put that heat where we want it, and the refrigerant lineset or sets that connect them together andactually carry the refrigerant and thus its heat energy from place to place. Sometimesthis is all packaged into a single device, and well look at some of those later on, butmore often than not theyre split systems. Part of why Im so excited about heat pumps is that theyre incredibly flexible and also quite straightforward - which a lot of people dont seem to be aware of. I showed you this heat pump in the original videos. This is a single-head ductless mini-split heat pump, and is the simplest possible splitsystem, despite that mouthful of a name. Now, Im doing a fairly deep dive on this style of system first because, well for one thing I have experience with it, but also because in my opinion it has a lot of advantages. I dont expect it to become that popular here in the US outside of certain cases since so many homes are already set up for ducted heat distribution. As youllsee later, thats a fantastic opportunity for us. But in places which arent, thisoption presents a lot of opportunities. This style of system employs simple versions of those three basic heat pump components; the outside unit, the inside unit - hereits called the head and is mounted on the wall - and the refrigerant lineset. In thiscase that includes not only the insulated copper tubing which carries the refrigerant, but also a power and communications cable. Now, the reason I think this style of heat pump has a lot of potential is that its frankly ridiculously easy to deploy! And I dont think thats hyperbole. Let me explain why; All it took to get this unit functional was determining where to mount the components, running a new electrical circuit to the outside unit through a disconnect switch (which I recognize isnt nothing), drilling a hole in thewall to run the lineset and com wire through, actually mounting the indoor and outdoorunits, and then connecting them together with flare fittings on the refrigerant lines and terminated wiring on the electrical side. This was so simple I did it myself overa day - the most complicated part was evacuating the lineset using a vacuumpump and manifold gauges. Otherwise, no special tools were required. Justa drill and some wrenches, basically. Real quick, Im not suggesting that you follow my example and go all DIY here. In many places its not even legal to work on refrigeration equipmentyourself because if you mess up you can let the refrigerant out and we generally dont want that. Thats why people get licensed for this. Im telling you that I did this myself to point out this aint complicated or particularly difficult. One concern many people have especially in locations where air conditioning is rare is that there arent enough technicians qualified to install this equipment. That is a problem, yes, but I hope you can see through this example that its not actually that difficult to get folks up to speed. I barely know what Im doing but simply by following the instructions I managed to get this up and running, and after three winter seasons its still working justfine so I think I can say I didnt screw it up! Aside from who installs it and how hard it is, lets look at other options. If you want or need the indoor unit somewhere other than literallyon the other side of the wall, thats definitely doable. Generally you can run up to 30 meters or 100 feet of line between the units, though you may need to adjust the refrigerant charge in thatcase. Which again is what actual professionals are for. And what if you need more than one indoorunit (which you probably do)? Well, heres where mini-split heat pumps get really interesting. TheAsian manufacturers have for quite a while now been building these sorta like Lego sets. Theyare very modular - outdoor units are available in many different capacities and with connections tomultiple indoor units, and thanks to clever stuff like electronic expansion valves and on-the-flyload calculation, one of these bad boys might have 5 or more linesets connected to it, all goingto different heat exchangers in different rooms. That not only gives you individual room control which is pretty neat, but greatly simplifies the installation process. You onlyneed electrical power run to one outdoor unit, and it will send power to all the indoor units through cables run with the linesets. Thats actually something I want to focus on for abeat. I was unaware of this and was expecting that the indoor head would need its own power source. As a matter of fact I didnt even consider a unit like this because of that false assumption. It seemed like far too much of a pain. But once I knew that the outside unit is in control of everything, shoutout to Aging Wheels for his video on how he installed these, I realizedthis was way more flexible than I assumed. And as a matter of fact, it became far and away the easiest option in my specific scenario. Now, when you have a more complicated system with multiple heads in multiple rooms, this does add the difficulty of dealing with the spaghetti that is a ton of refrigerant lines. But they can be run in various ways. Theycan go through attics or wall cavities, they can be run alongside or up exterior walls in concealing chases, its really up to you! And, it should be noted, the indoor units dont have to be these wall-mounted things. There are options which get concealed in ceilings, they can be floor-mounted devices akinto radiators, and there are more options, too like air handlers or surface-mounted ceiling thingies which looklike something out of a starship. The really coolthing about refrigeration technology is thatits quite flexible so the skys the limit. And perhaps the biggest advantage of systemslike this is that they are cooling-capable out of the box. One thing you always have to deal with when cooling the air is water. Water vapor in the air condenses on cold surfaces, and sowhen cooling the air this condensate collects and needs to be dealt with. A standard ductless head like this has a water pan at the bottom and a little drain hose directs water that collects in it elsewhere. The simplest setup is to mount the head on an exterior wall and drill a small holefor the drain hose, or just run it out with the refrigerant lines if they came in from outside, thus letting it just sorta pee out as it collects. But if thats not an option there are othersolutions, too, like condensate pumps. But what if you currently heat your home with a boiler that circulates hot water through some pipes and releases heat inradiators? Well, there is a heat pump for you - and it can often also produce domestichot water if you use such a combined system. Before I get into it, though, I do just want tosay that unless youre firmly committed to theidea of hydronic heating - which in fairness Iknow many people are - I really really think you ought to consider a ductless system. I know ittakes some adjustment getting used to warm air being pushed around, but these headsare very very quiet and its really not that bad. I recognize that in many cases ductless systems are not a perfect fit. Like, for instance, in bathrooms. There's no sense running a lineset to a head insuch a small space, but if its on an outside wall theres probably already a radiator in there because it needs heat. Also, lets face it, these arent the prettiest things. So I get it,Im just saying - dont rule these out right away, particularly since they offer cooling which might be increasingly necessary as time goes on. If youre on team radiator, though, (and/or on team in-floor heating I suppose) air-to-water heat pumps are pretty common. These will effectively replace a boiler by running a refrigerant lineset from an outsideheat-collecting unit much like this one into a refrigerant-to-water heat exchanger which replacesyour boiler. This can be a more turn-key solution, however these units generally dont produce water as hot as a conventional boiler does. Depending on the radiators you currently have, this could be an issue. The solution is pretty simple in that case - just replacing radiators asnecessary - but if it comes up, well then thats more work and more cost. Also an option arehigh-temperature air-to-water heat pumps that eliminate that potential hiccup, but those tendto be less efficient particularly in cold climates so there is definitely a trade-off. Asis the case with pretty much everything But anyway, one thing that I want to stress is that all a heat pump does is collect heat from outside and move it, one might say \"pump\" it, indoors. The equipmentwhich accomplishes this might seem a little strange if youre not used to it, and itdefinitely feels weird to be getting heat from colder air. But the end goal is the same asit always has been - release heat where we want it so our homes stay warm. Air-to-waterheat pumps allow you to use pretty much the same heat-distribution system you alreadyhave which has value, especially since theres typically only one lineset to run in that case so theinstallation is less intensive. Plus of course there is value in familiarity, too. I wouldsuggest, however, that you make a deep assessment before committing to one orthe other, assuming you have the choice. Now Id like to focus on the challenges to heat pump adoption, with a particular emphasis on the situation here in United States. As I said in anearlier video, the immensely frustrating thing about the way heat pumps have been deployed here is that the vast majority of single-family homes already have excellent infrastructure in placefor a heat pump. Many other housing types are well-prepared, too, but homes with centralair conditioning are basically already set. There is already an outside unit with a decent electrical supply run to it. There is already an inside unit in the form of an evaporator coil. Someone has already planned a path for a lineset to go - and even went so far as to put it there! And there is already an air handler and ductwork to work with it all. And of course that means a lot of boxes - in fact, pretty much all of them! - are alreadychecked for many people over here. Because, once again, air conditioners ARE heatpumps! We just tend to not bother with the reversing valves because but sometimes! thinkingis rampant. The good news of widespread use of air conditioning is that we already have trainedtechnicians who know how to install and service heat pumps. Theyre doing it all the time even ifwe havent realized it. And that is an advantage compared to other parts of the world. The lessgood news for us is that, so far anyway, systems which could best take advantage of all that existing infrastructure... just arent very good. Im not just saying that, by the way, I canback this up with data. A fantastic resource I was pointed to by Ian on Twitter is the listof air source heat pumps maintained by NEEP, the Northeast Energy Efficiency Partnerships. Theytrack, among other things, the COP at 5 degrees, and we can simply sort by that figureand see whos making the best stuff. Right now, I want you to look at the ductingconfiguration column. The best performers are overwhelmingly non-ducted configurations. Theseare mini-split systems. When you see multizone mix of non-ducted and ducted, those are thelego-like systems I was talking about earlier. Those can connect to both a ductless head and a ducted air handler at the same time. Which is pretty neat. Hello! Voiceover me is here to tell you that, well, this section of the video has become a bit of a disaster. Ill explain, but first, theseexcellent systems at the very top of the list arent just mini-splits, some are what areknown as VRF systems, and that stands for variable refrigerant flow. This tech is really neatbecause, when some rooms are too warm but others are too cold, it allows the system to moveheat within the building. It does this by pumping the refrigerant between rooms, taking energy out ofone room to cool it, and dumping it in another to warm it up. That tech is pretty unlikelyto see use in the home, although apartment buildings are likely to deploy it. This excellentFujitsu machine, for example, can actually have 15 heads connected to it, and since any head canheat while the others are cooling or vice versa, its ideal for multifamily setups. Best of all itsperformance is amazing. Its COP is a stellar 3.54 even at 5 Fahrenheit / -13 celsius, and it retainsnearly all of its capacity at that temperature. The performance of this machine is so good that even here in Chicago, so long as you had decent insulation there would almost never be a needfor an alternate heat source which is fantastic. Anyway, I was about to say to see the machines that American homes can best take advantage of, we need to filter for single-zone, centrally ducted systems and then I would have shown you how theres basically only one decentproduct line from Carrier, and nothing else. This is still kinda close to the case, and the American giants of the industry should absolutely be ashamed of themselves for continuingto pump out the same mediocre equipment - ancient 13 SEER air conditioners, which is a horribleefficiency in 2022, are still getting made unfortunately - while various companies in Asiaare actually innovating. However, I can happily report that the situation is at least a bit better thanthat. For whatever reason, when I first wrote this section I couldnt see any of these units; thosewith the brands Allied, Ducane, Comfort-Aire, Concord and Century. Maybe these just got added tothe list, maybe something was wonky when I looked it up, I dont know, but these have a very good COP at 5 Fahrenheit, and retain a decent chunk oftheir capacity in that cold. It could be better, yes, but roughly is still pretty good. Thatllkeep your backup system from kicking on unless it gets frightfully cold. And these are your typical,what I call barrel-style American outdoor units and evaporator coils. This is the exact sort ofequipment that gets installed here all the time. The fact is theres really nothing fundamentally different between one of these and a mini split. Theyre the same parts, in fact the samemachines, just in different form factors. It seems that the tech which gets put intocommodity mini-splits as a matter of course - basically variable-speed compressors and more intelligent control logic - is finally making its way into at least a few American-style machines. Now, the otherthing I want to talk about here is the HSPF, or heating seasonal performance factor. This is ametric which attempts to give an overall average efficiency throughout a heating season. Theseunits all have pretty mediocre HSPF ratings. Which is very weird because an HSPF of 9 should indicate an average COP of only 2.63, but here on the NEEP list it bests that even at 5 degrees Fahrenheit. I do not know the reason for this discrepancy, and if you do by all means please share. Now, although the situation is improving for us, its still pretty bad and there are some other complications which Ill get to in a bit. But now, to set the stage for the next section, pretendthat you didnt know about the units we just saw and that there was only one decent product lineavailable in the US. Youd probably want to ask; Why is this? Well, Id be happy to speculate. Ithink a number of factors have combined to make the American manufacturers largely... just not really care. First, the historically cheap cost of natural gas means that theres been little reasonfrom the consumers point of view to go with a heat pump if they have access to the gas grid. And since most really cold places have gas grids, at least where theres the density to make it work, its rational from a consumers perspective to not bother with a heat pump. Becauseenergy is energy, you can convert the units your natural gas is billed in (herethats the therm) to the kilowatt hour and and make an apples-to-apples cost comparison. Here in Chicagoland, at least until recently gas has cost about a quarter what electricitydoes for the same amount of delivered energy. That has meant that heat pumps basically never made any sense here. Locally we need a consistent COP of 4 just to break even with the cost ofgas, and attaining that is, frankly, hard. Even now. But especially 20+ years ago. Aroundhere, people just wanted air conditioning in the summer and already had some sort of cheapheat which a heat pump couldnt touch on cost. And so the typical air conditioning system inmy climate is super basic. In most cases its a single-capacity, single-speed system that is either on or off. And, of course, its tacked on to the gas-fired heating system made by the same manufacturer. Makes you wonder if they dont want to cannibalize their furnace sales, doesn't it? Now, most all of these manufacturers domake reversible air conditioners and have for many years. But in general, theyre thesame basic, one-speed, one-capacity condensing units that we install here, but equipped with areversing valve and some sort of defrost timers. As a matter of fact, if youve ever wondered why a thermostat terminal board has so many connections, well the O terminal tells the condenser to reverseflow for heating. Now, those heat pumps, although theyre mediocre, work well-enough in the regions of the US with milder climates, and those regions typically dont have widespread gas infrastructure so many homes are all-electric from the start. These factors have combined to create little reason for American HVAC manufacturers to develop their air conditioners intocompetent, cold-climate heat pumps. And the lasting effect of all this is that we are currently in a place where getting a cold-climate heat pump is just not easy here. Even thoughwe are pumping out heat pumps right and left. We make loads of air conditioners, but relatively few are made reversible and fewer still are equipped with the tech to makethem heat when it gets Chicago-levels of cold. This limited supply, combined with the suddeninterest in heat pumps, has led to many suppliers and installers charging rather absurd premiumsfor these systems - if you can even get them to give you a quote. Let me tell you a story. Afriend of mine had their AC unit die last summer. Their heat source is propane which, whilecheaper than electricity, isnt that muchcheaper. I suggested that they should look into getting a Mitsubishi hyper heat unit, and I helped arrange quotes from the local HVAC company whois one of Mitsubishis authorized contractors. A basic replacement of the air conditioner, including a new evaporator coil and lineset, was quoted at $3,000. This option wouldcontinue to use the existing furnace as the air handler - and thus propane for heat. Athree-head ductless system from Mitsubishi a perfect solution for their small home in a number of ways! wouldcost more than $12,000. Thats a gigantic price difference! And if we dig a little into it, wefind what can only be described as greed. Yes, the equipment from Mitsubishi is expensive compared to the commodity grade Carrier equipment in the other quote. But its not $9000 more expensive. Thisonline wholesaler would sell me similar equipment for about $5,500 shipped. Lets say that withthe linesets and a few other ancillary things the equipment cost is $6500. Now I know that mountingwall units and drilling holes for them is more and different work than what is required to replacea condenser and lineset, but I cant see it being $6000 worth of work. Especially when I did itmyself that one time in a day, learning as I went. Actually, when you consider that the technician who ended up replacing the air conditioner needed torches for brazing, had to run copper linesthrough utility spaces rather than the exterior of the building as they would have for the ductlessinstall, and needed to fit a new evaporator coil into a cramped space above the furnace whichended up taking pretty much an entire work dayto complete, I can honestly say that I feel likeinstalling the three head system would have been easier for an experienced technician. And, by theway, there was already sufficient electrical power at the location for the outside unit. I will admit Im not in the HVAC business, but my gut tells me the company could have made more money on that job in the end if they quoted it at $9000 - a much easier-to-swallow price that made the payback period reasonable - but trying to get another $3000 out of it lost them the sale. If I were to guess, that company puts a fixed percentage markup on all the equipment they sell which I would not call savvy, but thats just me. Now if you think thats bad, heres a real headscratcher. My brother lives in San Diego. If you dont know, San Diego really doesnt get cold. And for some silly reason, his home has central AC with a gas furnace - pretty much thesame system youd find here in Illinois. Electricity is very expensive there, yes, but theres just hardly a need for heating. He tells me he and his partner used the furnace for just four days this winter. He wanted to get quotes to replace his aging AC with a heat pump, and thefirst company that came out? First, they said hed probably want an expensive hybrid fuel system so he could keep using gas for backup which no. No. And second, the quote they gave him for a Lennox heatpump and air handler? It came in at over $16,000. And that was the cheap option from this company. I know thats California, maybe there are some weird permitting costs, but cmon. My brother would be perfectly served with a reversible 2-ton system, maybe three at most. He does not need a hybrid system, and he certainly doesnt need atrue cold-climate heat pump. And thanks to the Internet, we know that the equipment cost for a 16SEER 2.5 ton system is probably less than $3000 - I mean, these people are making their money, too. Plus the lineset and whatever other miscellaneous stuff. I cannot see the quote he got as anything but a dishonest company taking advantage of someone looking to install a trendy heat pump, and just hoping they dont know what that is. This is probably happening all acrossthe country, and indeed the world,and it sucks. Heat pumps are not miraclemachines, theyre not even new tech! And installing one is either much the same process as the air conditioners weve beeninstalling for many decades or potentially easieras is the case for mini-splits. I mean, I would not go out and buy a torch, some gas bottles, and learn how to braze copper piping on my own, but I was pretty confident I could tackle a few pre-formed flare fittings. And I did! Hi, its me again. I gotta cover a few more thingsin voiceover before the end. First, to make the last few minutes more explicit, the obfuscationof equipment pricing by installers is a serious problem and one that, well, I couldnt tell youhow to solve. Businesses are gonna business, but a real danger here thats worth a hard lookinto is that many of the incentives we currently use to push people towards better equipment suchas rebates for installing it are ripe for abuse by these installers. Whatever savings the rebatemight bring can simply evaporate if the installer builds it into the quote, and when theyreinventing their own markups on equipment cost, anything goes. It would be great if everyone could simply purchase their own equipment directly and then hire installers for their labor only, buta lot of rebate programs make this impossible and of course few people have the expertiseto determine the equipment they need. The best thing I can do is remind everybody that heat pumps are just air conditioners and are notactually special. Hopefully the more people that know this, the less gouging will occur. Alright, and the other thing I need to talk about is the wrinkle that is subpar ductwork. Thanks to the operational limits of heat pumps, airflow may become a challenge in existing homes thanks to ductwork restrictions. As amazing as refrigerationis, the refrigerant can only get so hot - its a function of the system pressure. And that meansyou need a greater volume of air moving over the heat exchanger to get all that heat out. Ductlesssystems dont pose a challenge here because the heads are designed to attain a certain heat output and the heat exchanger is huge compared to the air it needs to move. But when youre dealing with arelatively small coil shoved into some ductwork, you need as much airflow as you can get - andregrettably often, the ductwork wasnt designed with that in mind. A furnace which heats withfire can make the air leaving it extremely hot, so the ducts didnt need to be designed for the same volume of air as is ideal with a heat pump. It's the same problem with undersized radiators in countries that don't use ducting. But, to be clear, this is a situational problem. Your ductwork could be just fine for a heat pump without any reconfiguration. One possibility is tosimply force more air through them with a stronger blower, but that has limitations and can get noisy. But even if it is a problem in your case, the good news is that a situational problem can be dealtwith situationally. It might be that to match the output of your current heating system, youd needto have a much larger heat pump than your existing air conditioner. I saw someone on Twitter bring up that they were told theyd need a 5 ton heat pump (which is 60,000 BTU/hr or 17.5 kW by the way) but their ducts were sized only for a 3 ton air conditioner. So, they were told the only path to a heat pump was expensive ducting upgrades. But I say - dont let but sometimes thinkingstop you! The fact is you rarely need the full output of a heating system anyway. Around herethey all seem to be oversized by a factor of about 2. So it could be that even if youllonly be able to have a 3 ton heat pump, that's gonna be all you need for the majority ofthe winter anyway. I can tell you that this is exactly the boat that Im. My 70 thousandBTU furnace only runs about half the time even when its well below zero outside, so, athree ton heat pump - which is 36,000 BTU - would actually be more than enough almost all the time. And by the way, this problem might very well be temporary. With new refrigerants and technologies on the horizon, who knows whats possible. From what I can tell, theres regrettably a lot of old-school thinking permeating the trade. Some of it is understandable - its hard to explain to customers all the nuances involved here, and they just want an HVAC system thatworks. But some of it is also... just weird! My friends quote for a three-head mini split seems absolutely bonkers to me, but its become clear from conversations Ive had that lots of HVAC companies are charging similar amounts. Theyre seemingly allergic tomini-splits for some reason, which is a real shame since theyre a great option when you have limitations like poor ductwork. Were entering a strange new phase of indoor comfort - much of it is the same, but refined. And yet there are also entirely new opportunities to be found. Wejust need equipment to get a little bit better, easier to obtain, and for companies to sellit to you and to do the work for a fair price. OK, Im starting to run out of hot air. So I wantto talk about a couple more things before the jazz hits. First, ambient noise. Heat pumps, unfortunately,make noise and this has some people worried. Now, for the record, and I know this doesnt make it right or anything, were surrounded by pretty loud heat pumpsin the summer and were mostly alright. However, modern heat pumps are so much quieter than the air conditioners were used to now. Some of that is simply because theydont do the whole [imitates A/C starting] thing old-fashioned AC units do when they startup. Thats when you notice an air conditioner the most - once its running, you tend to justfilter it out. Inverter-driven compressors have a slow ramp-up in speed, and you basicallydont even notice it. Plus, aside from the whole hard start thing, theyre just much quieter ingeneral. Mostly because unless its so cold or so hot that it needs to give it all its got, its running at a slow, barely-audible speed. Like this. This is me talking toyou in my normal speaking voice right next to a heat pump. And this oneis actually working pretty hard right now. Lets wait til it gets to temperature and see how much quieter it gets. OK, so now the indoor temperature is at the set point and the heatpump has slowed down to basically an idle speed. The great thing about the inverter compressor technology that you find even in pretty cheap heat pumps like this is that they will operate at whatever capacity they need to for the given load. Rather than run for 10 minutesand stay off for 30, this can actually run at 25% output. That means its less disruptive because you dont hear it starting and stopping. But it also just means its quieter from the start. Thisis the ambient noise level that this heat pump operates at for the vast majority of the time. The only thing you notice in the winter is when it defrosts you hear it stop, start, stop, and startagain. So, while I [clunk as compressor stops]... Oh it just stopped [laughs]. So while I understandthat people are concerned about the outdoor ambient environment and the additional noise, its honestly not as bad as you might think. I saw a Tweet about someone looking to install a heat pump in Seattle but they were told it would be illegal thanks to strict noise ordinances. Uh, guys, ya gotta update those. I mean, for one, I kinda doubt a good mini-split would actually violate that ordinance, but if it does - well, looks like theres anordinance we gotta toss out! Not only are they just not that loud anymore, but if slightly louderoutdoor environments are the price we have to pay to help reduce carbon emissions and increaseenergy independence, I think its worth it, dont you? If NIMBYs get in the way of installing heat pumps, may god have mercy on our souls Lastly, lets talk about packaged heat pumps. Theyexist, but right now seem to have some performance challenges which, well Im not surprised by. Onevery common packaged heating and cooling thingy is the PTAC, which stands for packaged terminalair conditioner. If youve ever stayed in a low-to-medium tier hotel in the US, youreprobably familiar with the beige lump of cooling sitting below the window - thats a PTAC. Theyrealso kinda common in certain residential settings, too. Luckily, the PTAC has been developedinto the PTHP, or packaged terminal heat pump. Right now, NEEP barely has any data on these and what they do have isnt great the PTAC is a design optimized more for ease-of-installation byway of standardization than objective performance. Hotels love them because they can be swapped out in minutes and just by keeping a few spares on-hand, out-of-order rooms due to heating andcooling issues can be largely avoided. Until recently these provided heat via resistive heatingelements, but lately the refrigeration circuits are becoming reversible. I suspect these are goingto have some upper performance boundaries because, well, their design is quite a compromise. If youactually were to remove the PTAC from its sleeve, youd discover that the PTAC is theonly thing separating the inside from the outside - that vent you see from theoutside of a building that utilizes PTACs is literally a large hole in thewall. PTACs are really more like the guts of a window unit made to slide into a standard sleeve, with strip heaters, too. It's likely the case that buildings which currently use PTACs would be better off to de-PTAC. Hotels might consider replacing banks of 10 or 15 rooms with a large roof-mounted VRF system, and apartments might want toconvert to ductless mini-splits. Actually, my old apartment building wouldbe much better served by ductless heat pumps. With the bathrooms on interior walls, I would only have needed a three-head system for my two-bedroom apartment. Two small heads for the bedrooms, and a large one for the living room, kitchen,and dining area. Speaking of my old apartment Another less-common packaged system is the wellactually I dont know what its non-trade-name is but the MagicPack. This thing is a packagedfurnace and AC system. Kind of a clever idea, but anyone who has to replace one of these -you have my sympathies. Theyre not made by many manufacturers and youre pretty much stuck with asingle option. But apartment buildings in my area are still getting built to use them - itsobvious from the outside because they have a very particular vent arrangement. I imaginethese will have the same airflow issues as PTHPs, so again, buildings which use these might be best served by mini-splits. And then of course, theres the venerable window unit. These actually could probably be turned into pretty decent heat pumps. The biggerissue there is that window units, as a rule, arent making a good seal between insideand outside. So while a window unit-esque cold-climate heat pump can certainly be built, it would probably be better if it were put through a wall and sealed up with expanding foam. And I supposeat that point youre just re-inventing the PTAC, but with perhaps better outside airflow. This is why mini-splits are pretty cool. Oh, andyes Ive seen that neat-looking low-profile heat pump thingy. Ill be interested in its performancenumbers, because assuming theyre good and you can seal it and the window up well-enough, that could be a very powerful idea for certain places. But for now, I think we can leave it here. Remember, heat pumps arent some miracle tech weve never played with before. Weve beenusing the technology for ages, and there are many directions we can take it from here. One fun onethat so far hasnt been seen much outside of Japan is the use of supercritical carbon dioxide as a refrigerant. Over there its called EcoCute, and Im not kidding. Even now, though,weve got incredibly powerful and relatively easy-to-deploy options sitting at our feet. We may disagree on how best to move forward. And however we do it, it willtake time and a lot of effort to get us where we need to go. But when hasthat ever stopped us? Thanks for watching. egregiously smooth jazz Im certain something needs to whyd I emphasize should like that? Well, we went a while without needing retakes and now were at this line which is taking forEVER. Working on refrigeration equipment yourself ooooowhat? You cant change the wording on the fly, you know that. But you can argue about. Ugh. Yeah. That was a decent take. But I still wanna do another one. Finally. Ugghhhhh dont do that. Dont do that. [a series of really strange noises] [whoop whoop . whoop] [snorts] As a matter of fact, I didnt even consider a uni They can go through attics or wall cavities, theycan be rung al.... I just did it a gain. Run! Not rung. Rung. is on a ladder! A couple of caveats. First, I have FURST! Is that, was that weird? Probably wouldve been OK. Did you like how I put stock footage of ducks over the part where I was talking about ductwork? If you didn't think that was deliberate you were sorely mistaken. In fact, I almost decided to try and make every piece of stock footage some kinda pun on whatever I was talking about, but I couldn't be bothered. This video really was a slog at times. Next, something that isn't heat pumps!",
    "transcript_keywords": [
        "heat pump",
        "heat pumps",
        "heat",
        "pump",
        "pumps",
        "air",
        "ton heat pump",
        "coldclimate heat pump",
        "system",
        "Pretty",
        "heat pump adoption",
        "airtowater heat pumps",
        "modern heat pumps",
        "unit",
        "units",
        "air conditioners",
        "minisplit heat pump",
        "building",
        "ductless heat pumps",
        "buildings"
    ],
    "transcript_entity_values": [
        "inthe winter",
        "3000",
        "2.5",
        "Asiaare",
        "Shoutout",
        "3,000",
        "two",
        "about half",
        "TheAsian",
        "36,000",
        "Theyexist",
        "American HVAC",
        "less than $3000",
        "de-PTAC",
        "about $5,500",
        "four",
        "one",
        "many years",
        "three winter seasons",
        "Theyrealso",
        "Carrier",
        "5",
        "Two",
        "Allied",
        "Twitter",
        "just four days this winter",
        "minutes",
        "30",
        "17.5 kW",
        "13",
        "the last 20 or 30 years",
        "many decades",
        "EcoCute",
        "last summer",
        "16SEER 2.5 ton",
        "United States",
        "100 feet",
        "98%",
        "10 or 15",
        "American",
        "PTAC",
        "HVAC",
        "5 degrees Fahrenheit",
        "more than one",
        "FURST",
        "Asis",
        "3.54",
        "Becauseenergy",
        "Concord",
        "Japan",
        "over $16,000",
        "Aroundhere",
        "2-ton",
        "AC",
        "Mygas",
        "about 2",
        "first",
        "4",
        "Lego",
        "otherstuff",
        "asit",
        "25%",
        "the summer",
        "Onevery",
        "HSPF",
        "2%",
        "insulationupgrades house",
        "monthly",
        "at least a few",
        "three",
        "Fahrenheit",
        "zero",
        "about a quarter",
        "9",
        "more than $12,000",
        "only one",
        "PTHP",
        "Chicago",
        "up to 30 meters",
        "DIY",
        "Seattle",
        "Mitsubishi",
        "today",
        "only 2.63",
        "NIMBYs",
        "Ducane",
        "6500",
        "10",
        "5 or 10 years",
        "San Diego",
        "MagicPack",
        "Chicagoland",
        "Justa",
        "a ton",
        "Lennox",
        "Theyare",
        "9000",
        "20+ years ago",
        "the Northeast Energy Efficiency Partnerships",
        "Aging Wheels",
        "3 ton",
        "Ugghhhhh",
        "Century",
        "the last few minutes",
        "NEEP",
        "Hotels",
        "5 degrees",
        "month",
        "Im",
        "2022",
        "the kilowatt hour",
        "Butyou",
        "winter",
        "Mitsubishis",
        "Energy Policy Connections",
        "100a",
        "ages",
        "California",
        "US",
        "Illinois",
        "Ian",
        "One",
        "Comfort-Aire",
        "15",
        "5 ton",
        "First",
        "6000",
        "second",
        "someone $50",
        "60,000 BTU/hr"
    ],
    "transcript_entity_types": [
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "GPE",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "NORP",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "GPE",
        "MONEY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERCENT",
        "DATE",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "GPE",
        "QUANTITY",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "GPE",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "NORP",
        "DATE",
        "TIME",
        "PERSON",
        "DATE",
        "LOC",
        "ORG",
        "MONEY",
        "DATE",
        "GPE",
        "GPE",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "MONEY",
        "ORDINAL",
        "MONEY",
        "MONEY"
    ],
    "vector": [
        -0.13178950548171997,
        -0.0887688398361206,
        -0.022324802353978157,
        -0.004978558514267206,
        -0.008598146960139275,
        -0.04386969655752182,
        -0.0036126417107880116,
        0.019157158210873604,
        -0.05631701648235321,
        -0.0560348741710186,
        -0.04716512933373451,
        0.058551885187625885,
        0.023484595119953156,
        0.033795494586229324,
        -0.01811220869421959,
        0.012239346280694008,
        -0.0006456971168518066,
        -0.08411232382059097,
        -0.049912065267562866,
        -0.11406173557043076,
        0.030317382887005806,
        -0.08425243198871613,
        -0.012446779757738113,
        -0.03852453827857971,
        -0.02027878724038601,
        0.05335782468318939,
        -0.03493586182594299,
        -0.007601933553814888,
        -0.05464210361242294,
        0.06284140795469284,
        -0.056682005524635315,
        0.004305584821850061,
        -0.08840072900056839,
        -0.04789227619767189,
        0.030089261010289192,
        0.006045161280781031,
        -0.03675944358110428,
        0.02773967944085598,
        -0.09769956767559052,
        0.0753529742360115,
        0.051072392612695694,
        -0.1391373872756958,
        0.06127643212676048,
        0.0794159397482872,
        0.019351394847035408,
        0.02823319472372532,
        0.024784410372376442,
        -0.07894958555698395,
        -0.025220341980457306,
        -0.02148216776549816,
        -0.1348751038312912,
        -0.09200377017259598,
        0.08812766522169113,
        0.02591804228723049,
        -0.01113511435687542,
        -0.03818730637431145,
        -0.02280568890273571,
        -0.03531569615006447,
        0.02974545583128929,
        -0.007985574193298817,
        0.07948289811611176,
        -0.027979731559753418,
        -0.07944769412279129,
        0.007081891875714064,
        0.04894896224141121,
        -0.014652099460363388,
        -0.011139627546072006,
        0.07238833606243134,
        0.021684281527996063,
        -0.07996354252099991,
        -0.05322105437517166,
        0.025682413950562477,
        -0.012596935965120792,
        0.040555428713560104,
        0.051753029227256775,
        -0.0599588043987751,
        0.04719705879688263,
        -0.009449726901948452,
        0.01685345731675625,
        -0.030195172876119614,
        0.14715002477169037,
        -0.07483812421560287,
        0.009340716525912285,
        -0.06502245366573334,
        -0.07201708108186722,
        0.08170605450868607,
        0.07967597991228104,
        -0.034378375858068466,
        0.023541638627648354,
        0.015195128507912159,
        -0.09171392768621445,
        0.018031636252999306,
        -0.00020941864931955934,
        0.004376274533569813,
        0.05154600739479065,
        -0.017120663076639175,
        -0.06609520316123962,
        0.025771034881472588,
        -0.016363929957151413,
        -0.020162908360362053,
        0.014542344026267529,
        -0.027003180235624313,
        -0.02027829736471176,
        -0.031010989099740982,
        -0.0671892985701561,
        -0.08622583001852036,
        0.0035759019665420055,
        0.06106333062052727,
        0.05400880053639412,
        0.010015202686190605,
        -0.06823665648698807,
        0.025057457387447357,
        -0.0165915135294199,
        -0.04130786284804344,
        0.04860983416438103,
        -0.016102857887744904,
        -0.05237192660570145,
        0.019923808053135872,
        -0.006546936463564634,
        0.0566222183406353,
        -0.0030773512553423643,
        0.00047353917034342885,
        -0.037841375917196274,
        -0.008914721198379993,
        0.04231290891766548,
        0.029668491333723068,
        -0.05901111289858818,
        6.512186540993655e-33,
        0.005388255231082439,
        0.08565648645162582,
        0.028767582029104233,
        0.08869580924510956,
        -0.005408137571066618,
        0.03165539726614952,
        -0.011850575916469097,
        -0.02321908436715603,
        -0.04761702939867973,
        0.014870692975819111,
        0.04835595563054085,
        0.047089286148548126,
        -0.10053198784589767,
        0.039074406027793884,
        -0.030289383605122566,
        -0.11237465590238571,
        -0.030248651280999184,
        0.030371196568012238,
        -0.07278688997030258,
        -0.03201873227953911,
        -0.0010871407575905323,
        0.08613511919975281,
        0.007580553647130728,
        -0.015260531567037106,
        -4.554520273813978e-05,
        0.014201383106410503,
        -0.003946398384869099,
        0.011494183912873268,
        0.07174515724182129,
        0.022390393540263176,
        -0.036487530916929245,
        -0.02269604615867138,
        -0.09920258074998856,
        -0.005399498622864485,
        0.035290688276290894,
        0.0063534090295434,
        -0.020044490694999695,
        -0.10404061526060104,
        0.03547728434205055,
        0.022977253422141075,
        0.01647765003144741,
        0.034860048443078995,
        0.003002253593876958,
        0.02741745486855507,
        -0.057153183966875076,
        0.041415199637413025,
        0.03790564835071564,
        -0.005005635321140289,
        -0.012187745422124863,
        -0.07589578628540039,
        -0.01842855103313923,
        0.050098516047000885,
        -0.027300406247377396,
        -0.03473960980772972,
        0.0655582919716835,
        0.01357106864452362,
        0.01257288083434105,
        -0.0019073813455179334,
        -0.003067251294851303,
        -0.00594439497217536,
        -0.056448448449373245,
        0.05968093127012253,
        -0.0696151852607727,
        -0.04984664544463158,
        -0.06419238448143005,
        0.045409347862005234,
        0.030445042997598648,
        -0.006543009541928768,
        0.013993904925882816,
        0.05167744681239128,
        -0.034898389130830765,
        -0.03620024770498276,
        -0.05773816630244255,
        -0.0605379156768322,
        0.09869410842657089,
        0.021667268127202988,
        0.02854149602353573,
        0.010704697109758854,
        -0.10199341177940369,
        0.02287871204316616,
        -0.02742527239024639,
        -0.11446823924779892,
        0.054802924394607544,
        0.010670512914657593,
        -0.013893973082304,
        -0.1191808357834816,
        -0.04077690467238426,
        0.02596288174390793,
        -0.002719661919400096,
        -0.04679127782583237,
        -0.013541140593588352,
        0.008783345110714436,
        0.02558288164436817,
        0.09026309847831726,
        0.033957526087760925,
        -6.426778060198785e-33,
        -0.028383394703269005,
        0.013169926591217518,
        0.01448459830135107,
        0.045446451753377914,
        0.07960395514965057,
        0.005044607911258936,
        0.06336111575365067,
        -0.05397835373878479,
        0.08218569308519363,
        -0.024514734745025635,
        0.011873878538608551,
        -0.06487852334976196,
        0.020878585055470467,
        -0.011623771861195564,
        -0.024699663743376732,
        -0.017027951776981354,
        -0.04285591468214989,
        -0.04112563654780388,
        0.01321433950215578,
        0.029691021889448166,
        0.07067812234163284,
        0.06180088222026825,
        -0.06084277108311653,
        0.0534074641764164,
        -0.12067817896604538,
        0.024293910712003708,
        0.024996165186166763,
        -0.005974908359348774,
        0.057435810565948486,
        0.04492965340614319,
        -0.022930456325411797,
        0.0005702486960217357,
        -0.010981431230902672,
        0.0073633273132145405,
        -0.12253982573747635,
        0.095089852809906,
        0.09062168747186661,
        0.023882437497377396,
        0.00011474530037958175,
        -0.09739893674850464,
        0.09686378389596939,
        -0.04876656457781792,
        -0.04372716695070267,
        -0.007260811515152454,
        -0.06513479351997375,
        0.0387197844684124,
        -0.035802315920591354,
        -0.08267596364021301,
        -0.07889149338006973,
        0.09238877147436142,
        0.005657978355884552,
        0.006494560744613409,
        -0.03089815378189087,
        -0.0154984500259161,
        0.014757809229195118,
        -0.06435175985097885,
        0.06588634848594666,
        0.013665266335010529,
        0.013512402772903442,
        -0.015697242692112923,
        0.035380374640226364,
        0.00459420308470726,
        0.010453935712575912,
        -0.04711846262216568,
        -0.021334635093808174,
        0.010285381227731705,
        0.046107202768325806,
        -0.014879526570439339,
        0.036166440695524216,
        -0.02949344553053379,
        0.013747421093285084,
        0.030966175720095634,
        -0.04966890066862106,
        -0.08047398924827576,
        -0.03394440934062004,
        0.006704107858240604,
        0.007748457603156567,
        -0.008595085702836514,
        -0.036527711898088455,
        0.04668234661221504,
        0.021903790533542633,
        0.08928000926971436,
        0.03766702488064766,
        0.05707736313343048,
        0.15946094691753387,
        0.10518026351928711,
        0.07837315648794174,
        -0.019941752776503563,
        -0.019295424222946167,
        0.06284129619598389,
        0.015400866977870464,
        -0.008250953629612923,
        0.010054681450128555,
        0.11088821291923523,
        -6.497664435300976e-05,
        -6.391604046029897e-08,
        -0.0607326403260231,
        0.025995055213570595,
        0.05010554939508438,
        0.007058394141495228,
        -0.008530480787158012,
        -0.021705083549022675,
        -0.005183323286473751,
        0.09269516915082932,
        0.0005871871835552156,
        0.01595822162926197,
        -0.05899420753121376,
        0.0704716369509697,
        0.11877170205116272,
        0.08225025981664658,
        0.09676560759544373,
        0.00016105860413517803,
        0.01584490016102791,
        0.02589716948568821,
        0.00814252533018589,
        0.010767247527837753,
        0.023438280448317528,
        -0.01628449559211731,
        0.07126735895872116,
        0.06919950991868973,
        0.025867775082588196,
        0.04852284863591194,
        -0.012024352326989174,
        -0.013610037975013256,
        0.06327542662620544,
        -0.03308461606502533,
        -0.0751313865184784,
        -0.034815795719623566,
        0.03767381235957146,
        -0.06057823449373245,
        0.013984177261590958,
        0.05502942204475403,
        -0.015114489011466503,
        0.017604531720280647,
        -0.06518503278493881,
        0.024563632905483246,
        0.004328085109591484,
        0.07110229879617691,
        -0.011132296174764633,
        0.06890973448753357,
        -0.030766591429710388,
        -0.013671761378645897,
        -0.12189766019582748,
        -0.042210642248392105,
        -0.022825375199317932,
        0.08803216367959976,
        0.028885724022984505,
        -0.02773343212902546,
        -0.010919417254626751,
        0.0037642228417098522,
        0.07698407769203186,
        0.03425230085849762,
        -0.06645569950342178,
        0.032532624900341034,
        -0.018880298361182213,
        0.07883598655462265,
        0.01787174679338932,
        0.037278562784194946,
        -0.025318264961242676,
        0.043993521481752396
    ]
}