{
    "id": "443qmsUxjds",
    "title": "Rare MacBook Mod - Modbook First Impressions - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2020-09-28T19:59:48Z",
    "video_url": "https://www.youtube.com/watch?v=443qmsUxjds",
    "category": "Science & Technology",
    "tags": [
        "Rare MacBook Mod - Modbook First Impressions - Krazy Ken's Tech Misadventures",
        "Modbook",
        "MacBook",
        "Rare Mac",
        "Apple",
        "Mac",
        "Axiotron",
        "ModBook Pro",
        "Mac OS",
        "OS X",
        "Mac OS X",
        "Photoshop",
        "Wacom Tablet",
        "Mac Tablet",
        "Snazzy Labs",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Tech",
        "Computer",
        "First Impressions",
        "Computer Clan",
        "Aggretsuko",
        "Invader Zim",
        "MLAATR",
        "My Life as a Teenage Robot",
        "XJ9",
        "Art"
    ],
    "views": 63008,
    "likes": 2552,
    "comments_count": 233,
    "description": "Win your Ultimate Tech Bundle by entering Fasthosts Techie Test here:  (competitions is now closed) The Modbook is a rare version of Apple's MacBook which was sold by Axiotron. Today, Krazy Ken tries it for the first time, and he invites an artist to test the drawing capabilities of the device.  Join our channel and get cool stuff!   Get more Tech Misadventures episodes   Subscribe for more tech videos!    Like us on Facebook   Follow us on Twitter    Krazy Ken's Tech Misadventures - Rare MacBook Mod - Modbook First Impressions  Check out Snazzy Labs' Modbook video:    Pledge on Patreon now to get your name in the show credits and gain access to Krazy Ken's VIP Discord channel!   Contact Us    Want music for your videos?   (We use these guys a lot. They're good.)  Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program. #KrazyKen #ComputerClan",
    "description_links": [
        "https://www.fasthosts.co.uk/computerclan",
        "https://bit.ly/clan2JGWYhz",
        "https://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "https://youtu.be/2AoX-5KIh9Q",
        "http://Patreon.com/KrazyKen",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "https://bit.ly/clan2Dr3M3e",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- All right, yeah. - Oh! One more thing, Hold on, there was a another-- - Okay. All right. Oh, this is huge. Who sent this? Whoa. (timer ticking) (upbeat music) Hey guys, how are you all doing? Really? That's just great. You know, I'm doing pretty great today too because today we're finally taking a look at what was inside that box all of those months ago. Yeah, it's been what, eight months already. Time just flies. But also, before we dive more into that, I do want to thank Fasthosts for sponsoring today's episode and even better, they're hosting a giveaway as well where you can win your ultimate tech bundle plus your dream PC setup worth up to 5,000. So if you're one of my awesome UK viewers, you can enter and you can possibly win that if you can answer the techie test question. I'll explain more later in the episode. Okay. So what do we got? Well, this is a MacBook. This, is a Modbook. So the Modbook was a modified version of Apple's MacBook that was sold by a company called Axiotron. And you could buy this right from their website. In fact, they did a couple of different versions of this, but this, I think was the earliest, if not one of the earliest, very big thanks to Sonny Dickson for helping me get this by the way. So I have not done a ton of research on this yet. I do plan to do more and dive into it and I will do a full breakdown of the history and everything on a future crazy Ken's Tech Talk episode so make sure you're subscribed and stay tuned for that. But today, what I'm gonna do is just explore it for the first time and kinda just get my first impressions out. I'm gonna boot it up and test drive it but even better, I have brought Heidi back to the layer and she is gonna do some drawing on this thing to see how well she can do it and to see how well it works, because I can't draw for crap. Now, the art on our YouTube channel, that's all done by Heidi. Same person. She's gonna be in the layer and she was also the same person that tested out the Koala pad in that episode, like about two years ago. That was a pretty good one if you haven't seen that yet. So, lots of fun to be had. Let's go ahead and plug this baby in and see how it works. All right. So here it is. And you can see, we have our little eyesight camera there and the stylist just kind of hides away right here in this little compartment. And I haven't figured out quite yet what this button does but that does obviously look like the power button there and it just uses MagSafe. It has all the same ports that the other you know, regular Mac book would have. So MagSafe works. Let's go ahead and power it up. Lights. CD drive. (machine chimes) And the startup chime. And let's see how it works. Hey, there's the Apple. The backlight is a little bit low. I'm gonna have to turn that up or at least it's low on this angle. Oh, yeah. That's right. Well, I don't remember what year this particular model is. I think it's like, '08 or '09 But these old panels, don't have like the greatest angle of view. 'Cause I'm just off access by a little bit and it looks crazy dark. But if I lean forward, just like five inches, it gets so much brighter. But yeah, let's go ahead and see how this works here. The stylist input seems pretty responsive and accurate, so that's nice. Oh! The brightness is all the way up. All right, well. I guess we just don't have the greatest angle of view with this thing. But yeah, let's go ahead and see what we're working with. We have Mavericks that's 10.9.5. This is a dual core 64-bit 2.13 gigahertz processor. Pretty sweet. 6 gigabytes of RAM and the startup disk is called SSD. So I'm guessing there's an SSD in here. Since we do have stylists input, I would imagine we have the Mac features for that inkwell, I believe it's called. So we have the ink panel here. I haven't used a stylist much. Like I used to have a Webcam tablet but that was a long time ago. Looks like we have some fonts for the ink pad. We can write on Apple casual. Kind of looks like a slightly more professional version of Comic Sans. I guess you could call it. And the languages, gestures. Let's see what we got here. Oh! Cool. So we can draw little gestures too. Oh! I never actually experimented with these before. so we can do kind of like this to cut. That's pretty cool. All right. So that's some of the inkwell stuff and then down here, it looks like we have pen tablet, now. Oh! This must be a 32-bit panel that's why it has to relaunch. \"Tablet version mismatch, please reinstall the tablet software.\" Okay, not sure about that. Yeah, Chrome (hums). We have Sketchbook Pro, Photoshop CS6, Illustrator CS6, uTorrent. Sublime text, not sure what that is. Well, let's go ahead and bust open Photoshop here and just do a quick test and then we'll let the real pro come in. So yeah, it looks like we have our, our panels here. The workspace looks a little effed up so let's just reset to essentials here and that did a load of nothing. Oh! It's probably 'cause I don't have a document open and the application frame is off. Oh! There it is, down here. Application frame. There we go. So we can go to file, new, make a document here. I can't type in numbers. We're gonna leave it at 3000 by 2000. Well, the angle of view on this thing is really bad. I'm like, I have to like, hold it like here to actually see something. But there's no way to prop this up with like the built in hardware. You'd have to find like a third party solution for that or something. I mean most animators and drawers would typically work on a slant. Anyway, this is like very unergonomic. Don't really like hunch over your tablet please (laughs). I mean, yeah. It's responding to the handwriting here so that's not too shabby. Let's see here. What other buttons do... Does this trigger the eraser? Yes, it does. You can erase just by pressing down the other side of the stylist there. No problem. I'm not an expert drawer by any stretch of the imagination. I'll just draw my good old Mac Picasso face. That is the extent of my artistic abilities right there. Before we bring Heidi in here, let's just pay homage to the original Macintosh from 1984. Let's just make sure things work. Okay, good. It is. We'll just go undo the brush and let's just do our good old hello. Boop, there we go. Just like 1984. So yeah, this is pretty responsive. There's like no latency or lag here. This is pretty great. I just do want to, before I bring Heidi in here, I do want to check some hardware stuff. I wonder if we can find like any hardware indicator in here that tells us what the stylist input is. Let's see. In the USB device tree here, we have Axiotron Modbook and then we have an ISD V4. Which, I guess is some something related to a tablet. It says tablet right there. And then we have the Axiotron Modbook hardware controller, which looks like it's running through some sort of like older USB interface, possibly. It says 12 megabits per second. So that's definitely slower than what you'd have with USB two. So that's interesting. Yeah, there's some kind of controller here on the USB bus that was like, that was redundant. I just said Universal Serial Bus bus, but hey, whatever. This is Krazy Ken, we break the rules. So now I'm gonna bring Heidi out here and she's gonna draw us something much better than what I can do. Let's do it. Okay, so I borrowed Heidi again. So Heidi, just as a quick recap, what do you normally draw on and width? - [Heidi] Well, lately I just draw on an iPad and it's really nice, but for a really long time I would just use my work-on tablet and that thing lasted for like 10 years give or take. - [Ken] What software do you use? - [Heidi] For the longest time, I just always used Photoshop but I really like Clip Studio Paint and since I got my iPad, I learned how to use Procreate and that's pretty easy and yeah, it's fun. - [Ken] All right. So we have Photoshop on here. Go ahead and give it a whirl. - [Heidi] All right. I'm just gonna-- - [Ken] So what are you gonna draw for us to warm up? - [Heidi] I'm going to attempt to draw a Pusheen Cat. - [Ken] All right. So while Heidi is working on that drawing, let's just take a quick moment and talk about that giveaway, I was mentioning earlier. Fasthosts is generous enough to be hosting that and you have a chance to win that ultimate tech bundle plus your dream PC setup. But who is Fasthosts? Fasthosts is a UK based web hosting company, which offers a wide range of web hosting products and other services. Whether you're a beginning businessman or an expert entrepreneur. They provide effective and affordable hosting packages to suit any need. You can easily register affordable domain names with a variety of TLDs like, .uk or .com and their website builder lets you create beautiful mobile ready websites without writing code. You can get three months free and if you're not satisfied in the first 30 days, you can cancel your contract without paying a penny. Now, here's the fun part. If you're in the UK, you can enter in to the Fasthosts giveaway where you can win your ultimate tech bundle and dream PC setup worth up to 5,000. All you have to do, is click the link in the description and answer this techie test question correctly. What was the clock speed of the CPU in the first white Apple MacBook that Apple sold? Click the link in the description and fill out your answer and best of luck. I hope you can win the giveaway. And again, it's all thanks to Fasthosts. Their data centers are based in the UK alongside their offices. And whether you go for a lightweight web hosting package or a fully fledged dedicated box, you can talk to their expert support teams 24/7. Okay, let's see how the drawing is going. (Heidi and Ken laughing) - [Heidi] I did it again. I tried to use two fingers to undo-- - [Ken] Cause your iPad can do that, right? - [Heidi] Yes. - [Ken] Yeah, we don't have that capacitive touchscreen luxuriousness with this rare device (giggles). So yeah. - [Heidi] And it does feel a bit awkward. It's not as crisp and smooth and-- - [Ken] That's true, if you have a retina display on your iPad with 120 Hertz refresh rate, this is a like not even HD and 60 Hertz. So you're spoiled. (Ken and Heidi laughing) Yeah, I mean that's looking pretty good and test out the eraser just to make sure. - [Heidi] I just want to get this correct. Anybody who knows Pusheen Cat is going to be like, \"You're missing the little stripes on her head or something.\" (Ken and Heidi laughing) Oh! That's probably too big. - [Ken] Hey, it works. - [Heidi] Nice. - [Ken] All right. - [Heidi] Not bad. - [Ken] There's pusheen - [Heidi] Pusheen cat. - [Ken] Alright, well, whenever you're ready, go ahead and file new and open up another. - [Heidi] I could just make a new layer and just-- - [Ken] Or new layer, you fancy kids using your... When I grew up, Photoshop one had one layer. (Heidi giggles) One layer and one level of undo. We suffered. - [Heidi] All right, so now I'm gonna try to draw a Retsuko. - [Ken] Oh, yes. - [Heidi] I've only drawn her a few times, but-- - [Ken] I love Retsuko. - [Heidi] I almost did the two fingers again. - [Ken] Or you can do the eraser-- - [Heidi] Oh, yeah, yeah. - [Ken] Yeah, the Apple pencil doesn't have an eraser-- - [Heidi] I did something even worse. I went like this, as if I was drawing traditionally and it's like, Oh God! We got to swipe away the eraser schnibbles. - [Ken] Dude, that would be like quite the virtual experience that actually creates the [inaudible]. Well, that's just force of habit, yeah? (laughs) - [Heidi] Yeah. (Ken laughing) - [Heidi] Eenie minnie miney mo, undo or erase surface. (Heidi laughs) - [Ken] I know, oh my gosh, that's hilarious. 'Cause like, you've probably done that a billion times in your sketchbook. So she's programmed into your brain, I guess - [Heidi] When I'm drawing digitally, like on my iPad my instinct is just go undo. But when I'm drawing traditionally, like obviously you gotta use the eraser and then my instinct is to go like this. So it's like I don't have any eraser on my Apple pencil. - [Ken] Right. - [Heidi] So, yeah. - [Ken] Honestly, I think that is kind of an interesting cycle. That can be like a cool psychological case study in the motor, like muscle memory and like motor skills. Hey, there's happy, non-rage Retsuko. Well, so was there something else you wanted to draw? Maybe XJ9. - [Heidi] Oh! Yeah. (Ken laughing) I love drawing XJ9. - [Ken] XJ9 is a bad ass. So yeah, let's go and try it out. - [Heidi] Actually, I could probably draw this without a reference. - [Ken] Okay. So we have two handicaps, a new device and no reference. Okay. - [Heidi] Just the general look of Jenny is pretty easy to draw it. You just got like a little circle here, right? And then she's got like this harsh cheek-- - [Ken] She got that cheek thing, yeah. - [Heidi] Going on there. (lively music) - [Ken] This would have taken me probably a half hour to do. (Ken and Heidi laughing) - [Heidi] I'm actually really surprised at how slow I'm drawing it. - [Ken] Well you're on a new device you've been using for all of like six minutes. Cut yourself some slack. - [Heidi] Yeah. - [Ken] Yeah? - [Heidi] Her arms look too short. - [Ken] The arms do look a turd short, but the head is definitely better. - [Heidi] Yeah, the eraser doesn't really have great precision. It's just this round thing. - [Ken] Oh! So you mean like on a tactile level? - [Heidi] Yeah. Yeah, like I can't really aim it properly. - [Ken] Oh, gotcha. - [Heidi] And even the actual stylist itself like what you draw with doesn't have that great aim either. - [Ken] You're probably spoiled by the Apple pencil. - [Heidi] Yes (giggles). - [Ken] And you have even the older Apple pencil. Okay, so like literally five minutes ago, Greg from HRUTKAY MODS, buddy of mine, just got a Modbook. (Ken laughs) He said, \"I literally just got one and was going to ask you if you wanted to try it.\" Well. (Heidi laughing) Hey, Greg is awesome and he's loaned me a few things before, but like dang it. Like I already spent the money on this one. Oh well, we're here. - [Heidi] Man, this thing is getting hot and I don't mean sexy hot. I mean, it's just, it's burning. - [Ken] Can you mind if I feel it? I mean, the screen is not too warm. - [Heidi] It's especially hot where I had my hand. Feel? - [Ken] Yeah, it's like warmer on this side. Oh! On the bezel, yeah. Definitely on the bezel over here. - [Heidi] Now we got two classic Nickelodeon characters. - [Ken] Yeah, it's a little bit older, but how does it feel? What do you think? - [Heidi] Well, it feels like I miss my iPad. (Ken and Heidi laughing) It's really not that bad. Compared to the KoalaPad, right? - [Ken] Oh yeah, all of that. Yeah, 1983, I think. Money aside, would this be a thing that you would have bought back in the day? - [Heidi] I imagine if I purchase, something like this around the time it was made, I probably would have been like, oh, this is kind of fun. This is kind of cool. And then I would get frustrated and just go back to traditional drawing because that's like way easier. But I'm sure I would poke around with like the settings and try to get it to work as best as it can and you can actually probably make some decent art with this. - [Ken] Yeah, I mean, I'm gonna spend some more time with it and tweak it up. And when I do my follow-up episode, if you would love to do the honors and do like one final drawing, I think it would be great to have you back and do one more piece. What do you think? - [Heidi] Yeah, absolutely. - [Ken] All right, sounds good. 'Cause yeah, that would be cool too. Oh! Look out now. You gotta color now. Wonderful world of color - [Ken] So, thank you Heidi for blessing us with your artistic skills. Now, some of you may be wondering, how do you interact with this thing, other than the pen? Well, again. It does have the traditional Mac book ports on it. So you can plug in a USB mouse or a USB keyboard. And I actually dug into the box a little bit more and the previous owner gave me a little keyboard. So I could use that in conjunction with the pen. But also we do have this little menu thing here. If we say hide keyboard, it shows the keyboard. I dunno, it glitches out sometimes. And this is the quick clicks interface. So if I was typing, let's say, and I didn't have a physical keyboard. I could use this. Sometimes it's a little laggy and you notice it has a little typewriter sound as well. Now that could get annoying pretty quick but you can turn that off. So if we go to the preferences, we have our smart transparency options. So after you don't use it for a while, it just kind of fades away and you could turn off the typewriter sound if you want. So, pretty sweet. Again, stay tuned because I will revisit this and do more of a deep dive into the history of it and into the design. But in the meantime, actually, while I was taping this first impressions episode Quinn from Snazzy Labs released his own video and it's freaking amazing. So go check that out and I'm pretty sure that will be able to hold you over until I release my follow-up. But I also have plenty of other episodes planned. Knock-off tech, new tech, old tech. Man, it's gonna be great. Definitely stick around. If you like this episode, you know what to do. Thanks for sticking with me. Catch the crazy and pass it on. (upbeat music)",
    "transcript_keywords": [
        "yeah",
        "Heidi",
        "pretty",
        "Apple",
        "draw",
        "thing",
        "drawing",
        "kind",
        "Apple pencil",
        "USB",
        "tablet",
        "Fasthosts",
        "eraser",
        "ahead",
        "tech",
        "Time",
        "Modbook",
        "Photoshop",
        "episode",
        "works"
    ],
    "transcript_entity_values": [
        "five inches",
        "Mavericks",
        "five minutes ago",
        "Tablet",
        "Modbook",
        "Photoshop",
        "two",
        "1983",
        "SSD",
        "Snazzy Labs",
        "Hertz",
        "1984",
        "one",
        "MagSafe",
        "Sonny Dickson",
        "Universal Serial Bus",
        "UK",
        "32",
        "Eenie minnie miney mo",
        "a penny",
        "Mac Picasso",
        "Apple",
        "12 megabits",
        "like 10 years",
        "Mac",
        "'08 or '09",
        "Comic Sans",
        "2.13 gigahertz",
        "3000",
        "the first 30 days",
        "first",
        "Greg",
        "2000",
        "64",
        "CS6",
        "Fasthosts",
        "Nickelodeon",
        "a half hour",
        "MacBook",
        "USB",
        "Ken",
        "Axiotron Modbook",
        "Boop",
        "three months",
        "up to 5,000",
        "iPad",
        "YouTube",
        "today",
        "Krazy Ken",
        "Pusheen Cat",
        "CPU",
        "Apple MacBook",
        "KoalaPad",
        "a ton",
        "about two years ago",
        ".com",
        "60",
        "Clip Studio Paint",
        "third",
        "Retsuko",
        "a Pusheen Cat",
        "Webcam",
        "Fasthosts",
        "Heidi",
        "Procreate",
        "Mac",
        "the Axiotron Modbook",
        "Macintosh",
        "Jenny",
        "Ken] Alright",
        "Retsuko",
        "6 gigabytes",
        "Quinn",
        "eight months",
        "RAM",
        "Axiotron",
        "One",
        "120",
        "Koala",
        "those months ago",
        "the day"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "TIME",
        "PERSON",
        "FAC",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "NORP",
        "ORG",
        "TIME",
        "FAC",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "NORP",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "FAC",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE"
    ],
    "vector": [
        -0.11940911412239075,
        -0.05500153452157974,
        0.044518254697322845,
        -0.08677823841571808,
        0.08641151338815689,
        0.0022340253926813602,
        0.01393967680633068,
        0.037021454423666,
        0.006863507907837629,
        0.015153143554925919,
        0.06435094773769379,
        0.005918090231716633,
        0.022282050922513008,
        -0.06464599817991257,
        0.03366795927286148,
        0.023139700293540955,
        0.08732488006353378,
        -0.07235553115606308,
        -0.011080443859100342,
        -0.00036809456651099026,
        0.026991669088602066,
        -0.09009172767400742,
        -0.001277032308280468,
        -0.04156779870390892,
        0.006609732750803232,
        0.03652200475335121,
        0.0649421438574791,
        0.018604828044772148,
        -0.04651433974504471,
        -0.06232072040438652,
        -0.018529780209064484,
        0.028802143409848213,
        -0.005953306797891855,
        0.017683692276477814,
        0.024785516783595085,
        -0.10926316678524017,
        0.05469578504562378,
        -0.006861267611384392,
        -0.09376312047243118,
        -0.10200700163841248,
        -0.07622473686933517,
        0.010706348344683647,
        0.019865375012159348,
        0.030034583061933517,
        0.045030638575553894,
        -0.03152091056108475,
        0.07361086457967758,
        -0.0717737078666687,
        0.047483984380960464,
        0.010387687012553215,
        -0.006795614026486874,
        -0.11846417188644409,
        0.04627884551882744,
        0.020567815750837326,
        0.0033846586011350155,
        -0.005642484407871962,
        -0.01793062873184681,
        -0.05183000490069389,
        0.13329561054706573,
        -0.006450603250414133,
        0.03920360654592514,
        -0.0587165467441082,
        -0.05636093020439148,
        0.026515373960137367,
        0.011309402994811535,
        -0.051372744143009186,
        0.03807220235466957,
        0.005012149922549725,
        0.028591057285666466,
        -0.07582218945026398,
        0.02521759644150734,
        -0.020557677373290062,
        0.011806813068687916,
        0.11020822823047638,
        -0.03825919330120087,
        -0.028033649548888206,
        0.0038932524621486664,
        -0.06301797926425934,
        -0.012250312604010105,
        -0.02912665717303753,
        -0.02130516618490219,
        -0.0007387467776425183,
        -0.039562806487083435,
        -0.006775117479264736,
        0.018083401024341583,
        -0.02502530626952648,
        -0.03272712603211403,
        0.0011676641879603267,
        -0.05709202587604523,
        0.006939107086509466,
        0.020091580227017403,
        0.07178109139204025,
        0.06274695694446564,
        -0.028026357293128967,
        -0.03138943016529083,
        -0.06562789529561996,
        0.08196279406547546,
        -0.011333494447171688,
        -0.02109859697520733,
        0.07892107963562012,
        0.012382271699607372,
        0.06504608690738678,
        0.08910106867551804,
        -0.04917312040925026,
        0.007235290482640266,
        -0.0924145057797432,
        0.022730235010385513,
        0.09642288088798523,
        0.0190059132874012,
        0.034111831337213516,
        -0.043949272483587265,
        -0.01580985076725483,
        -0.07877711206674576,
        -0.006277651526033878,
        0.04716222733259201,
        -0.004771016072481871,
        -0.05754093825817108,
        0.048807211220264435,
        0.06454013288021088,
        -0.0029157924000173807,
        0.013641267083585262,
        0.021374309435486794,
        -0.024076923727989197,
        -0.012947600334882736,
        0.0835302397608757,
        0.0024959994480013847,
        -0.050040844827890396,
        8.6044834661688e-33,
        0.07172039896249771,
        0.057333048433065414,
        -0.07067056000232697,
        0.02109955996274948,
        0.008341407403349876,
        -0.04536056146025658,
        -0.007870189845561981,
        0.05937812477350235,
        -0.06934085488319397,
        0.0373554565012455,
        -0.04811469838023186,
        0.011924155056476593,
        -0.09656184166669846,
        0.06645449995994568,
        0.02524690516293049,
        -0.030635828152298927,
        -0.09057415276765823,
        -0.07673058658838272,
        -0.03194596618413925,
        0.07486239820718765,
        0.05390157923102379,
        -0.00695747509598732,
        0.06355874240398407,
        -0.009191551245748997,
        -0.00032932613976299763,
        0.013083596713840961,
        -0.007844710722565651,
        -0.0251714326441288,
        0.07481161504983902,
        0.06674443930387497,
        -0.09426473081111908,
        -0.010757713578641415,
        -0.01806836761534214,
        -0.12060562521219254,
        -0.05460215359926224,
        -0.06953849643468857,
        -0.016504058614373207,
        -0.09670376777648926,
        0.031979601830244064,
        0.0005827266140840948,
        -0.10843690484762192,
        0.004098209086805582,
        -0.10032796859741211,
        -0.0767197236418724,
        0.021597469225525856,
        0.019603101536631584,
        0.05403090640902519,
        0.07450515031814575,
        0.013284788466989994,
        0.04191737622022629,
        -0.04105248674750328,
        -0.04264030233025551,
        0.09377899765968323,
        -0.013667107559740543,
        -0.06483829021453857,
        -0.008032887242734432,
        0.047714803367853165,
        -0.03797260671854019,
        0.07627277076244354,
        0.06482051312923431,
        0.08480974286794662,
        0.07757730782032013,
        0.03646865487098694,
        0.0589473731815815,
        -0.07723835110664368,
        0.059131819754838943,
        0.09171010553836823,
        0.04397561773657799,
        -0.032954271882772446,
        0.008607457391917706,
        -0.08111725747585297,
        -0.035636212676763535,
        0.03943013772368431,
        -0.0828881487250328,
        0.0250424612313509,
        -0.05801546573638916,
        -0.1114378422498703,
        0.017923595383763313,
        -0.10896608978509903,
        -0.0028822459280490875,
        -0.046119313687086105,
        -0.034465886652469635,
        0.005276917014271021,
        0.058449484407901764,
        -0.021414540708065033,
        0.0700446143746376,
        0.03345614671707153,
        0.02179504744708538,
        -0.03987814858555794,
        0.0017944396240636706,
        0.023243477568030357,
        -0.011961952783167362,
        -0.04067232832312584,
        0.0482972078025341,
        -0.02540302276611328,
        -8.85406295736745e-33,
        0.044005345553159714,
        -0.0521293468773365,
        -0.03541216999292374,
        0.022231003269553185,
        0.03619176149368286,
        0.020766042172908783,
        0.051665689796209335,
        0.030304815620183945,
        -0.035141121596097946,
        -0.0811091735959053,
        0.05723743885755539,
        0.04451406002044678,
        -0.06510906666517258,
        -0.04696369916200638,
        0.022645849734544754,
        -0.05315965414047241,
        -0.09116155654191971,
        -0.02129364386200905,
        0.025339720770716667,
        -0.06819702684879303,
        0.06337843835353851,
        -0.06873723864555359,
        0.004613868426531553,
        -0.03791312500834465,
        0.01786242425441742,
        -0.003541451646015048,
        -0.061880145221948624,
        0.07570004463195801,
        0.022512607276439667,
        0.06085249409079552,
        -0.002951499540358782,
        0.04080938547849655,
        0.046581100672483444,
        0.01348299439996481,
        0.05585695430636406,
        0.007142878137528896,
        0.014479979872703552,
        -0.020583556964993477,
        0.011369182728230953,
        0.00499406922608614,
        0.07260733097791672,
        0.059787437319755554,
        -0.04914345592260361,
        0.011001740582287312,
        0.013065915554761887,
        -0.015692545101046562,
        -0.05417977273464203,
        -0.030521394684910774,
        0.07515940815210342,
        -0.07983311265707016,
        0.009004026651382446,
        -0.0034167428966611624,
        0.03131411224603653,
        -0.039079271256923676,
        -0.04632728546857834,
        -0.014249684289097786,
        -0.021971631795167923,
        0.0678035244345665,
        0.06952926516532898,
        0.054361503571271896,
        -0.08197425305843353,
        -0.023832298815250397,
        0.0040992628782987595,
        -0.06813393533229828,
        0.0035102744586765766,
        -0.013317134231328964,
        0.06309190392494202,
        0.048189159482717514,
        0.02758660353720188,
        0.0022243938874453306,
        -0.008702939376235008,
        0.01721765473484993,
        0.03471928834915161,
        -0.09054191410541534,
        0.002738125389441848,
        0.04315405339002609,
        0.013252626173198223,
        -0.023199502378702164,
        -0.014916321262717247,
        -0.030649801716208458,
        -0.013319824822247028,
        0.008550211787223816,
        0.061746157705783844,
        0.043168265372514725,
        0.005074677057564259,
        0.07987517863512039,
        0.00817087385803461,
        0.011512544937431812,
        -0.0601181834936142,
        0.025172915309667587,
        0.008034702390432358,
        -0.034667354077100754,
        -0.0012165679363533854,
        0.0982249453663826,
        -0.050587691366672516,
        -7.052513240068947e-08,
        -0.056933797895908356,
        0.06455099582672119,
        0.030678164213895798,
        0.007195902522653341,
        0.07186326384544373,
        -0.01679787039756775,
        0.01555072981864214,
        0.04173944517970085,
        0.05333363264799118,
        -0.0013547270791605115,
        0.11313556879758835,
        -0.10869676619768143,
        -0.07114239782094955,
        0.05228742957115173,
        0.038013700395822525,
        0.03994303196668625,
        -0.04060490056872368,
        0.1144087091088295,
        -0.032204125076532364,
        -0.04903960973024368,
        0.003459618892520666,
        -0.025580475106835365,
        0.11519399285316467,
        -0.06394734978675842,
        -0.012556626461446285,
        0.030183842405676842,
        -0.06102742627263069,
        0.030840154737234116,
        0.03542931750416756,
        -0.0030777056235820055,
        -0.11956337094306946,
        0.005392920225858688,
        -0.018745414912700653,
        -0.047592442482709885,
        0.017405040562152863,
        -0.0447392538189888,
        -0.101885586977005,
        0.01175717357546091,
        0.051103249192237854,
        -0.0058674258179962635,
        -0.04970819130539894,
        -0.1133057177066803,
        -0.07352279126644135,
        -0.02721307799220085,
        0.018054092302918434,
        0.009885511361062527,
        -0.035120878368616104,
        -0.045964471995830536,
        -0.07780632376670837,
        0.018349314108490944,
        0.015432370826601982,
        -0.03218056261539459,
        0.0020920424722135067,
        0.06282149255275726,
        0.0017456022324040532,
        0.022570261731743813,
        -0.017882587388157845,
        -0.026243172585964203,
        0.003250360954552889,
        0.03212520107626915,
        0.09842173755168915,
        -0.0835672989487648,
        -0.05556239187717438,
        0.03292014077305794
    ]
}