{
    "id": "45szHSP5xsg",
    "title": "Who does Samsung think they are?? - S21 & S21 Ultra",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-01-16T07:02:29Z",
    "video_url": "https://www.youtube.com/watch?v=45szHSP5xsg",
    "category": "Science & Technology",
    "tags": [
        "Samsung",
        "S21",
        "S21+",
        "S21 Ultra",
        "5G",
        "Smartphone",
        "Apple",
        "iPhone 12",
        "108MP",
        "Vlog",
        "Selfie Camera",
        "Telephoto",
        "Space Zoom",
        "100X",
        "10X",
        "3X",
        "S-Pen",
        "Note Pen",
        "Adaptive Display",
        "Note",
        "Android"
    ],
    "views": 2599567,
    "likes": 77858,
    "comments_count": 8221,
    "description": "Samsung's S21 smartphones are finally here, and we are checking out both S21 and S21 Ultras. Which one are you thinking about getting?   Buy Samsung S21 Ultra 5G On Samsung:  On Amazon:    On BHPhoto:   On NewEgg:  On BestBuy:   Buy Samsung S21+ 5G On Samsung:  On Amazon:  On BHPhoto:  On NewEgg:  On BestBuy:   Buy Samsung S21 5G On Samsung:  On Amazon:  On BHPhoto:  On NewEgg:  On BestBuy:   Buy Apple iPhone 12 Pro On Amazon:  On NewEgg:   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/GJHvA",
        "https://geni.us/X3KjrgH",
        "https://geni.us/Duzh6fE",
        "https://geni.us/zxHgWh",
        "https://lmg.gg/8EiOu",
        "https://lmg.gg/dGmlb",
        "https://geni.us/3XWKu3q",
        "https://geni.us/mNn2",
        "https://geni.us/lqnfu",
        "https://lmg.gg/yBLeZ",
        "https://lmg.gg/pSQJt",
        "https://geni.us/oOydk3p",
        "https://geni.us/exFuT",
        "https://geni.us/tkt6p",
        "https://lmg.gg/VMh7L",
        "https://geni.us/var6",
        "https://geni.us/mVBp1",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- As usual, I have sequestered myself consuming no media about the Galaxy S21 and S21 Ultra. So I get to have my very own fresh reaction. And you know what? The first thing I wanna say about these is, who does Samsung think they are exactly? Like OnePlus? They've lowered the prices. But, they've also gotten rid of, or reduced, some of the things that make the Galaxy S series, the S series. This, is pretty though. Wow! That matte, like, blasted finish on the S21, looks absolutely fantastic. And like the contrast with the with like the glossy aluminum mid plate, that looks really good, doesn't it? It almost distracts you from the fact that Samsung threw so much shade at Apple, about not including chargers with their phones, and then went and didn't include a charger with their phone. I get it. You guys gotta save a buck, okay? You lowered the prices, at least to Samsung's credit. They lowered the prices of the phones. But don't pretend this is anything other than a cost saving measure. If Apple really cared about the environmental impact of providing all those chargers, what they would have done is what Xiaomi did, which is allow you to have a charger if you want or not have a charger if you don't need it and not charge you extra for it. And there's a couple other things about these devices that make them less Samsung S series for me, and more like, OnePlus. So for example, the S21 and the S21 Plus are both only available with a maximum of eight gigs of RAM. Now, it's LPDDR4X memory, it's freaking fast. But only eight gigs of memory. And only up to 256 gigs of storage. And on top of that, they actually got rid of the Micro SD slot. So on the bottom, you've got your SIM slot, you've got your speaker port, you've got your USB type C charging and data port. On the left, you've got no Bixby button, whatsoever. On the top, you've got a couple of microphones for noise cancellation. And then over on the right, you got your volume rocker and your lock button. And that is pretty much it for the physical buttons. Feel in the hand on the S21, really nice. S21 Ultra, also nice. Especially after having played around with the iPhone 12 quite a bit lately, I do appreciate rounded corners on devices that don't kind of stick into your hand. But, that's not to say that I appreciate everything here. So the S21 and S21 Plus are the first S series devices that I can remember, that actually use 1080p class displays. The Ultra has a 1440p class display, and both of them are running 120 Hertz. So you get that really nice fluidity. So nice. But, as part of the apparent cost saving measures that Samsung has gone to here, they've done away with 1440p displays. Now, in fairness, Samsung already shipped their devices by default. And in fact, even the S21 Ultra ships by default running at 1080p resolution in order to save power even though it has more physical pixels than that. But, it's just a weird move backwards to me to go to a 1080p display. Personally, I can't tell the difference at this screen size. But if you've got really sharp eyes, 1440p can look a little bit nicer. Which isn't to say though, that the displays on these phones aren't gonna look freaking awesome. The S21 and S21 Plus both max out at 1300 nits. Meaning that, like I said before with the S20, the odds are, that for people behind this phone this is gonna be the best HDR content consumption display in the building you live in, while the S20 Ultra actually maxes out at 1500 nits. I'm a little curious about the speakers. That's one of the things that tends to be a cost-saving measure when you're tryna lower the prices. Still stereo. Man, this display looks good. Actually, pretty darn loud too. Let's take something with dialogue though. I did have to change the default display profile from vivid to natural in order to make SDR content look good. But it should be noted, I didn't feel like I had to do the same thing with HDR content. So, your mileage may vary there. Remember, HDR content includes metadata in the video itself that tells the display how to behave. - So this really unfortunate thing happened between shoot days one and two of this. A big rock chipped - Really nice. Actually, both of them sound great. One area Samsung didn't cost down at all is in the SoC. So both of these are featuring Snapdragon 888s in the North America region. And then Exynos 2100s outside of that. And these are pretty sick CPUs. Both of them are built using Samsung's new five nanometer process, and both of them are using new ARM X1 cores. So just like we saw in previous generation Snapdragon SoCs, or Exynos, for that matter, you've got for low power cores for high efficiency and for high power cores for higher performance. But here instead of four lower power cores and then four of the same high power cores, we've actually got three cortex A78s which are pretty high performance, but built using ARM's traditional balance of power consumption and performance. We've also got a single X1 core. So this is ARM's attempt to kind of steal some of Apple's thunder when it comes to single threaded performance. Now, as for whether it actually gets there, now, maybe not yet. But, it's definitely a step in the right direction. Just like the news that Samsung is continuing to work with AMD on some kind of Radeon mobile graphics. It could be a huge step in the right direction. I would be very excited to see, not just the generational improvements that we're seeing in CPU, GPU, and AI performance like we are now, but like a big, like huge multi-generational leap in GPU performance. 'Cause that could be an absolute game changer for them. Now I wanna talk about another compromise. While unlike the S21, the S21 Ultra does have flagship class memory and storage configurations, going up to 16 gigs of RAM and 512 gigs of storage. Both of them have kind of mediocre charging capabilities. So we've got a 4800 milliamp hour battery here. 4000 here, this is a small upgrade. This is basically the same as last gen. Both of them max out charging over a wire at 25 Watts. Wirelessly, at just 15 Watts. And with reverse charging, that's a measly four and a half Watts. Compared to some of the Chinese phones out there, these are like, these are numbers that are like half of what's available on the market. In some cases, less than half. But I've gotta say that I appreciate Samsung's conservative approach here. As someone who cares about the longevity of my device, I actually go out of my way to charge my battery with a wire at just one amp. So that's just five Watts. And the reason that I do that is 'cause there's less risk. I mean, the last thing Samsung needs is another phone that like, lights on fire all over the place. And, it helps your battery last longer. So if you're the kind of person who keeps your phone for longer than a year or two, you should seriously consider charging at lower rates. Even if your phone does support crazy 65 watt charging or like, you know, 25, 35 watt wireless charging. Now let's run through some of the additional differences between the Ultra and the regular S21. Honestly, for me, it's at the point where these are such completely different classes of products. I don't even really understand why they share the S21 name. They've both got 5G connectivity that's included with the Snapdragon 888. But, the Ultra has Wi-Fi 6E instead of just regular Wi-Fi 6, which isn't a huge speed advantage. But, it could be a big advantage in terms of congestion. So if you live in an apartment or something like that, Wi-Fi 6E could mean that you're fighting a lot less with your neighbors. Assuming you have a Wi-Fi 6E router, and getting better Wi-Fi speeds on your mobile device. Another big difference is that while they both do have 120 Hertz displays, which gives you that sexy smoothness, only the Ultra goes down to 10 Hertz with its variable refresh rate technology. The regular S21 and the S21 Plus, even though I don't have it on hand, only go down to 48 Hertz. Which means they could end up being slightly less power efficient, depending on the application. Finally, we've got the cameras. These are two very different classes of cameras. The regular S21 has a 12 megapixel main shooter, which isn't that crazy, except that for years Samsung kind of chased the mega pixel race. And now they're going, \"Oh, you know what? Maybe Apple's got a point and it's better to just capture more light as opposed to being able to capture a ton of pixels under ideal lighting situations.\" So the S21 has a 64 megapixel telephoto, and then a 12 megapixel ultra-wide. Moving over to the S21 Ultra, we get a honking 108 megapixel main shooter. So, the mega pixel race is back. Two 10 megapixel telephotos and then a 12 megapixel wide. And the reason for two telephotos is that they're doing some like, trippy AI combination thing for a theoretical maximum of 100 times zoom. Now I'm expecting that to be a gimmick, but who knows? Maybe I'll be pleasantly surprised. So we're gonna go regular wide angle, taking a picture of the little dude, Adam and Jake over there. I'm gonna go 3X zoom, take another picture. I'm gonna go 10X zoom. Wow, that actually looks really good. And this stabilization is like, freaking outstanding. I think 10X looks like it might be the sweet spot. It's definitely over sharpened. But that's obviously, way more detail left in the image than if we just tried to zoom in the main shooter. And this is on the Ultra. And then we're gonna step it up. Let's go 30. Oh, cool. So when you press the little preview up here, it actually locks the stabilization. Well, you can't really see it now 'cause I'm not zoomed into something. But it actually works really well. That's super cool. So you gotta kind of frame the way you want it. You just press that, and then it'll like, hold your frame. There we go. 30X is just a blurry mess. Like we could've just as easily digitally zoomed this. And a 100X is, I don't know, man. Maybe, the AI is doing a little bit there. It looks a little less over sharpened. But there's like almost no color saturation in it. Finally, there's the difference in selfie cameras. The Ultra gets a 40 megapixel selfie camera, which is like, what? And then it's just a regular 10 megapixel one on the S21 and I was S21 Plus. Oh, I can, okay. To Samsung's credit, the natural color of the selfie camera is like outstanding. Like they're not doing any of that stupid beautifying and smoothing. Or if they are, it's really not much. That looks, like really, that looks really natural. You ready for some 8K, Brandon? - [Brandon] Yeah. - I can already tell even looking at this tiny display that it's like hot garbage. - [Recording] I can already tell even looking at this tiny display that it's like, hot garbage. - Wow, the microphone's great though. Like if I was vlogging on this thing, I think I'd be stoked. It can do 4K 60. Oh man, that just like already looks better than the 8K mode. Whatever, it doesn't matter. You know what, they've got it, they gotta market (mumbles) Now for the most important test for me. The Ultra actually has support, for Samsung's S-Pen. Which isn't to say that it comes with one or even has a place to put one. In fact, you've gotta buy it as a separate accessory. I think it's like $40 US or something like that. And then you also have to get a case that has somewhere to put your S-Pen. So it's like, ah, okay. But to their credit, apparently, they've worked on intergenerational compatibility. And while some people are curious about whether the Note20 Pen works, I actually wanna take it back a couple more steps and see if my Note9 Pen will Work. Wait, it totally works. That's freaking awesome. I actually love the S-Pen, for no reason other than scribbling on screenshots and sending them to people. It's really nice or like, writing down the dimensions of a room for my trip to Ikea. Like I'll scribble on my picture. Or this one. So you can record a GIF of any video you watch, just like, going like this, going like that. And boom, you can save it, you can share it. It's like, freaking awesome. If you're a social media nerd, or whatever the case may be. I just wish there was, somewhere to put it. So that's sort of a downer. But hey, at least it works. So that's cool. It's really nice to see Samsung putting that kind of effort in. Unless it just like worked on its own, I don't know. But honestly, one of the reasons that I have decided to stick with the Note9 for so long is to see how well it does last. I've given Samsung a hard time in the past for not providing enough software updates for their devices and not supporting them in the long term. And overall, other than the couple of drops that have shattered the back glass on this thing, the experience of using it today is basically like it has always been. And I think they've done a pretty darn good job of it for me. So I'm still getting software updates. It's still not sluggish. I'm pretty happy and it's getting me to the point where I'm getting closer anyway to being able to recommend Samsung in the same way, almost, that I would Apple. Apple is still, way better. But hey, improvements improvement. Speaking of Apple, I actually told you guys on Short Circuit that I was going to do a full review of at least one of the iPhone 12 series. So the one that I've been driving is the 12 Pro. And the reason I didn't end up doing it is I just, I didn't have anything to say. So I'm gonna change gears for a little bit. And I'm gonna tell you some of the notes that I had down, if you guys actually cared. And then I'm gonna just put that to rest. So I have stopped being disingenuous about your eco-friendliness. If you actually cared about the environment, there's lots of other things you could do to help save the environment. I didn't like the hard edges. The notch is a piece of (beep) Hole punch is a piece (beep) too, but the notch notch is worse, I guess. I can't wait for that trend to go away forever. I missed 3D touch. Still, 3D touch was amazing. 60 Hertz blows. Some of the apps are better, so that's cool. Some of them are worse, so that's less cool. Face ID sucks in a pandemic 'cause I'm wearing a mask all the time. I think one of the reasons that my iPhone reviews tend to end up really nitpicky and people label me as a hater is that, it's just mostly good. It's fine, it's an iPhone. The only things I can really talk about are the things that are like, wrong. And a lot of the things that are wrong are things that have always been wrong and they just don't seem to give a (beep) about fixing, like, not adding T9 dialing. So there, that's why I didn't do it. As for whether I'm gonna review this. I don't know, what do you think? Is it worth tryna switch to? - [Jono] Yeah! - 120 Hertz display would be really nice. So smooth. I'm gonna miss my S-Pen, though. I don't know. - [Jono] Get the case! - I'm not gonna get a stupid, like case with a pen holder in it, it's ridiculous. I'm a naked phone guy. No case. If I review it, it'll be over on Linus Tech Tips but, that's it. That's it for Short Circuit for today. Oh, yeah, also they launched their smart tags. But I'm not gonna unbox a smart tag. Like what on earth would I say about it? So, good for them. Good job, Samsung.",
    "transcript_keywords": [
        "Samsung",
        "Ultra",
        "display",
        "things",
        "Apple",
        "thing",
        "Hertz",
        "nice",
        "kind",
        "megapixel",
        "good",
        "thing Samsung",
        "power",
        "pretty",
        "Samsung credit",
        "phone",
        "charging",
        "sequestered myself consuming",
        "power cores",
        "performance"
    ],
    "transcript_entity_values": [
        "Linus Tech Tips",
        "Wi-Fi 6E",
        "8",
        "4",
        "US",
        "USB",
        "S21 Ultra",
        "just one",
        "like half",
        "Snapdragon SoCs",
        "10 megapixel",
        "Samsung",
        "48",
        "SoC.",
        "S21",
        "10",
        "Chinese",
        "SDR",
        "Short Circuit",
        "1500",
        "4800",
        "today",
        "Micro SD",
        "1440p",
        "10 megapixel one",
        "just five",
        "Hertz",
        "a ton",
        "OnePlus",
        "25",
        "Watts",
        "3X",
        "max",
        "Xiaomi",
        "the S21 Ultra",
        "Ikea",
        "256",
        "first",
        "AMD",
        "S-Pen",
        "two",
        "1080p",
        "GPU",
        "CPU",
        "64 megapixel",
        "the Note20 Pen works",
        "between shoot days one and two of this",
        "eight",
        "65 watt",
        "Jake",
        "Adam",
        "RAM",
        "4000",
        "one",
        "S20",
        "LPDDR4X",
        "less than half",
        "12 megapixel",
        "1300",
        "the S-Pen",
        "iPhone",
        "Bixby",
        "at least one",
        "Ultra",
        "Snapdragon 888s",
        "35 watt",
        "North America",
        "Brandon",
        "Ultra",
        "a measly four and a half",
        "120",
        "Radeon",
        "512",
        "A78s",
        "12",
        "five nanometer",
        "Note9 Pen",
        "30",
        "Wi-Fi 6",
        "Apple",
        "25",
        "Exynos",
        "year",
        "three",
        "One",
        "40",
        "60",
        "the Galaxy S21",
        "100",
        "108",
        "AI",
        "S21",
        "Wi-Fi",
        "16",
        "the S21 Plus",
        "the S series",
        "four",
        "Two",
        "only eight",
        "years",
        "5",
        "Ultra"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "NORP",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "LOC",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "LOC",
        "PERSON",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "DATE",
        "LOC",
        "ORG",
        "CARDINAL",
        "NORP",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "LOC",
        "CARDINAL",
        "PRODUCT",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON"
    ],
    "vector": [
        -0.11885315179824829,
        -0.01223080512136221,
        0.03458871319890022,
        -0.048363666981458664,
        0.067667156457901,
        0.07689829915761948,
        -0.015421764925122261,
        0.08302263915538788,
        -0.01640983298420906,
        0.024934742599725723,
        0.05513327196240425,
        0.04060858488082886,
        0.1083253026008606,
        -0.02279924973845482,
        0.042417414486408234,
        -0.09085333347320557,
        0.06548275798559189,
        -0.07986224442720413,
        -0.05899406969547272,
        -0.010018221102654934,
        0.040573425590991974,
        -0.04200349375605583,
        0.005158119834959507,
        0.021731063723564148,
        0.05887461453676224,
        -0.04763535410165787,
        -0.07872159779071808,
        -0.039641764014959335,
        0.01309649646282196,
        -0.04463029280304909,
        0.038442764431238174,
        0.08150278776884079,
        0.021369287744164467,
        0.03190445527434349,
        -0.014231424778699875,
        -0.11326171457767487,
        0.02028922736644745,
        -0.04981861636042595,
        -0.004026699345558882,
        -0.04773049056529999,
        -0.0235198475420475,
        -0.022412141785025597,
        -0.03492187708616257,
        0.010946975089609623,
        0.01476091518998146,
        -0.06192728132009506,
        0.032981231808662415,
        0.004276665393263102,
        -0.055537573993206024,
        0.014554444700479507,
        0.048567287623882294,
        -0.03000057488679886,
        0.016764821484684944,
        0.033900823444128036,
        -0.014459190890192986,
        0.01661485992372036,
        -0.04464391991496086,
        -0.07790829241275787,
        0.12444134801626205,
        -0.017410174012184143,
        0.05839391425251961,
        -0.14034290611743927,
        -0.006623962894082069,
        0.06087415665388107,
        -0.018933136016130447,
        0.015173008665442467,
        0.004647586494684219,
        0.021100228652358055,
        -0.0747845321893692,
        -0.03328147903084755,
        0.010879142209887505,
        -0.02984553575515747,
        0.05648588016629219,
        0.10982579737901688,
        -0.030239427462220192,
        0.01560688391327858,
        0.09187403321266174,
        0.009296371601521969,
        -0.011895713396370411,
        -0.013730330392718315,
        0.020859967917203903,
        -0.08893097937107086,
        -0.10682603716850281,
        -0.009934728033840656,
        0.09098950028419495,
        -0.03772285580635071,
        -0.038471415638923645,
        0.06388697028160095,
        -0.04328801855444908,
        -0.07296829670667648,
        0.04480777308344841,
        0.07618936896324158,
        0.007920896634459496,
        0.019770462065935135,
        -0.039579134434461594,
        0.031288519501686096,
        -0.08912430703639984,
        -0.03618824481964111,
        -0.05072909966111183,
        -0.0015812494093552232,
        0.051759764552116394,
        0.09544501453638077,
        0.07389132678508759,
        -0.03429758921265602,
        -0.006081420928239822,
        -0.049552541226148605,
        -0.0418582558631897,
        0.07711194455623627,
        0.042658355087041855,
        0.04543966427445412,
        -0.03256756067276001,
        0.03655298799276352,
        -0.057568758726119995,
        0.04719842970371246,
        -0.08276764303445816,
        0.019284725189208984,
        -0.07287321239709854,
        0.011592318303883076,
        0.09962335228919983,
        -0.06651455909013748,
        -0.03706897050142288,
        0.027762718498706818,
        -0.057004913687705994,
        -0.05841914936900139,
        -0.016969135031104088,
        0.06115283817052841,
        -0.07136830687522888,
        4.051594011394441e-33,
        -0.015352089889347553,
        0.1046023890376091,
        -0.06325045228004456,
        -0.07953885942697525,
        -0.014829861931502819,
        0.035858090966939926,
        0.043060049414634705,
        0.05916579067707062,
        -0.021004067733883858,
        0.011042117141187191,
        -0.10865911096334457,
        0.018057702109217644,
        -0.059802617877721786,
        -0.003129082964733243,
        -0.00024692786973901093,
        -0.03710723668336868,
        -0.049837127327919006,
        -0.07709141820669174,
        0.012941713444888592,
        0.028391478583216667,
        0.021835580468177795,
        0.01398489996790886,
        0.013611656613647938,
        -0.011147195473313332,
        0.04490334540605545,
        -0.04750383645296097,
        0.039845433086156845,
        -0.012156479991972446,
        0.05494925007224083,
        0.04495146498084068,
        -0.05084807798266411,
        -0.030075926333665848,
        0.08796364068984985,
        -0.02513139322400093,
        0.002395591465756297,
        -0.03240177780389786,
        -0.018878091126680374,
        -0.04969991743564606,
        0.06945464760065079,
        -0.02023739367723465,
        -0.033753957599401474,
        0.07266785204410553,
        -0.11820095032453537,
        0.011062927544116974,
        0.007218495476990938,
        0.037059035152196884,
        -0.031973861157894135,
        0.03237993270158768,
        -0.004845930263400078,
        0.029890988022089005,
        -0.09258443117141724,
        -0.03064478002488613,
        -0.0549432709813118,
        -0.06136292964220047,
        -0.00048308962141163647,
        0.0028337198309600353,
        -0.024123359471559525,
        -0.03058842569589615,
        -0.023463169112801552,
        0.0414535254240036,
        0.001821417361497879,
        0.015862535685300827,
        -0.018891431391239166,
        0.01574813388288021,
        -0.039736803621053696,
        0.025018775835633278,
        0.04296441003680229,
        0.00881743524223566,
        -0.09447390586137772,
        0.028524434193968773,
        0.0006809878395870328,
        0.0019253307254984975,
        0.08973654359579086,
        0.019359353929758072,
        0.044263895601034164,
        -0.03834768757224083,
        -0.029396964237093925,
        0.028703836724162102,
        0.039949044585227966,
        -0.005818955134600401,
        -0.04065762460231781,
        0.034683845937252045,
        0.037891171872615814,
        0.07734040170907974,
        -0.04045713692903519,
        -0.015874767675995827,
        -0.019995249807834625,
        -0.03912050276994705,
        -0.014979369938373566,
        0.039864346385002136,
        -0.0014710905961692333,
        -0.03390881046652794,
        0.01930866576731205,
        0.035062454640865326,
        -0.026675298810005188,
        -5.5959360816436995e-33,
        -0.05486168712377548,
        0.011656460352241993,
        0.017501117661595345,
        0.02893771044909954,
        -0.0023401116486638784,
        -0.03931225463747978,
        0.05736853554844856,
        0.03087685815989971,
        -0.013204365968704224,
        -0.0707576647400856,
        0.042187463492155075,
        0.06953513622283936,
        -0.05994175374507904,
        -0.04326066002249718,
        -0.007702489383518696,
        -0.07250416278839111,
        0.024610375985503197,
        -0.12138064205646515,
        0.05453164875507355,
        -0.04630656912922859,
        0.044319041073322296,
        0.01852247305214405,
        0.0269883144646883,
        0.10439619421958923,
        0.03342960774898529,
        0.009434204548597336,
        0.03985580801963806,
        0.036473944783210754,
        -0.006127838045358658,
        0.042962994426488876,
        0.00335982209071517,
        -0.07787103950977325,
        0.00439416104927659,
        -0.017320774495601654,
        -0.0117007652297616,
        0.007232761941850185,
        -0.0036534012760967016,
        0.1051269993185997,
        0.04311292618513107,
        -0.061640266329050064,
        0.044802214950323105,
        0.0073284427635371685,
        0.021140994504094124,
        0.020211465656757355,
        0.04990513622760773,
        -0.017860952764749527,
        -0.025996137410402298,
        -0.02515977993607521,
        0.014523341320455074,
        -0.03633439168334007,
        -0.0063239471055567265,
        0.020791567862033844,
        0.034076448529958725,
        0.029920870438218117,
        -0.049297086894512177,
        -0.040723804384469986,
        0.02575439214706421,
        -0.01227323617786169,
        -0.04315098375082016,
        -0.030220938846468925,
        0.08044630289077759,
        0.019902346655726433,
        -0.020877884700894356,
        -0.018592411652207375,
        -0.06797174364328384,
        -0.04013395309448242,
        -0.01600610837340355,
        -0.014989747665822506,
        0.031032098457217216,
        0.040786441415548325,
        -0.03146223723888397,
        -0.10567175596952438,
        -0.07828367501497269,
        -0.08746620267629623,
        -0.0719008520245552,
        0.08512742072343826,
        -0.08290675282478333,
        0.005101596470922232,
        -0.028771452605724335,
        -0.0676560029387474,
        -0.003327973186969757,
        0.13682417571544647,
        0.050776947289705276,
        0.014450362883508205,
        0.028221355751156807,
        0.00510262930765748,
        0.02156689390540123,
        -0.04944842308759689,
        0.013926945626735687,
        0.01106223277747631,
        -0.1692304164171219,
        -0.001164883840829134,
        -0.07538781315088272,
        0.0014167876215651631,
        -0.050666213035583496,
        -4.825862376378609e-08,
        0.04127633199095726,
        -0.012590717524290085,
        0.031881626695394516,
        0.012487226165831089,
        0.029285548254847527,
        -0.02431725151836872,
        -0.03919137269258499,
        -0.009129230864346027,
        0.16183628141880035,
        0.006089863833039999,
        0.018589269369840622,
        -0.08029841631650925,
        -0.05682963877916336,
        -0.02551756426692009,
        0.004064492415636778,
        -0.005664322525262833,
        0.010096591897308826,
        0.06579966843128204,
        -0.013079787604510784,
        -0.018238330259919167,
        -0.037821631878614426,
        0.08850255608558655,
        0.04193277657032013,
        -0.06426478922367096,
        0.0651707723736763,
        0.02141420915722847,
        -0.004412319511175156,
        0.0037598777562379837,
        0.07832571119070053,
        -0.024179361760616302,
        -0.04459098353981972,
        -0.060514774173498154,
        -0.02854146808385849,
        0.017466723918914795,
        0.04101947322487831,
        -0.04956008493900299,
        -0.005672057159245014,
        -0.006101846694946289,
        0.11657288670539856,
        0.04330531135201454,
        0.00247229658998549,
        -0.025831906124949455,
        0.0029851868748664856,
        0.021528096869587898,
        0.012054041028022766,
        -0.08535691350698471,
        -0.00045234840945340693,
        -0.007804142311215401,
        0.05015994980931282,
        0.09785137325525284,
        -0.031406864523887634,
        -0.11276024580001831,
        -0.09044405817985535,
        -0.055116258561611176,
        0.013511615805327892,
        -0.015363575890660286,
        0.031030233949422836,
        -0.03796222805976868,
        -0.00875623058527708,
        0.09372755885124207,
        0.08613265305757523,
        -0.12608365714550018,
        -0.028147198259830475,
        0.11612268537282944
    ]
}