{
    "id": "48g5FWQKQrs",
    "title": "I hate running but I ran on the Peloton Tread",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-05-03T13:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=48g5FWQKQrs",
    "category": "Science & Technology",
    "tags": [
        "peloton",
        "peloton review",
        "peloton tread",
        "peloton bike",
        "cycling",
        "home gym",
        "t home workout",
        "spin bike",
        "treadmill",
        "spin class",
        "peloton bike review",
        "peloton class",
        "gym",
        "workout",
        "working out",
        "fitness",
        "health",
        "exercise",
        "bike",
        "at home",
        "cardio",
        "soul cycle",
        "cycling bike",
        "spin",
        "home workouts",
        "stationary bike",
        "indoor bike",
        "health and fitness",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "mkbhd",
        "apple",
        "google",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 539077,
    "likes": 7039,
    "comments_count": 514,
    "description": "Peloton released its second machine, the Tread, as a followup to its popular stationary Peloton bike earlier this year. This got us wondering  if a bike could build such a big community over indoor cycling, can the Peloton Tread help a non-runner train for a 5K?  Learn more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2PIyxT4",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- [Workout Coach] Three, two. (house music) - I have a confession to make. Running has never really been my thing. I never got the so-called runner's high because when I run, I normally make it, like, two minutes before I have to stop. So, in comes the Peloton, the exercise craze that's got a huge community over its stationary bike. Earlier this year, the company shipped its second device, a treadmill, and I thought, if a bike can get so many people excited about spinning, maybe it could teach me to learn to enjoy running. And that's why, for the past two months, I put the Peloton Tread, and myself, to the test by signing up for my first 5K. So, I just woke up. It is the middle of February, and I'd like you to meet my new roommate. So, here's the thing: the only place that I could fit the Peloton Tread was in my bedroom, and even though that was really awkward, I wanted it to encourage me to use it as often as I can. Plus, I was pretty emotionally invested in this 5K because we're raising money for pancreatic cancer research, something that's personally very important to me as a two-time survivor. The plan is to train three to four times a week for two months, and we'll see how I go. (upbeat music) If you haven't heard of the Peloton Tread, here's how it works. The machine offers a variety of classes, like hill training, walk / run combos, and even body workouts like arms and leg exercises and yoga. There's even programs for 5K training, or you can stream into a class that's being taught live from a studio in New York. The treadmill has a 32-inch touchscreen, a soundbar across the bottom, and knobs on the side that lets you control speed and incline. There's a button to jump to the next level and also another one to stop the tread. The tread has slatted belts with rugged texture for smoother landings. Now since I don't really run, I can't really compare it to other treadmills, but I will say that on the Peloton Tread, I didn't really have any kind of knee pains that I did from other classes I've taken in the past. Now, it's a beautiful piece of hardware, and it better be for $4,500. But where the Peloton shines is its programming. There is a great variety of classes, instructor personalities, and music genres to suit your mood. And because Peloton is teaching a new class almost every day, there's always something new to try. There are also a couple of other gamification tools, like achievement badges or challenges that you can complete every month. On your profile page, you can see stats like how you've done the past 30 days, the fastest you've ever run, or the instructors whose class you've taken most often. I found this to be really helpful for tracking progress over time because it was so encouraging to see those numbers go up and all the miles I was running, that I just really wanted to keep going. (house music) Hey, so it's now been a little over a week since I got this. I have run seven runs out of the past nine days. A lot more than-- basically more than I did in the entire last year, I think. I haven't really been able to run more than two-ish miles every 30 minutes, which I think is a good start. The fact that I can just roll out of bed, put on my shoes, and just start in my PJs if I wanted to actually helps a lot. I normally start with a 10-minute warmup walk, and then a 30-minute beginner or intermediate class. It's actually kind of funny how well the gamification features worked. For example, at the end of March, I was two miles away from a gold badge and I added a power walk session at the end, just to get the badge. Surprisingly, it was kind of hard to get into a live class. They were either super early in the morning or at times that I wasn't quite home from work yet. And when I was, it was like body weight training that wasn't really what I was looking for. I wish there were more live running classes because it would have been really nice to see the leaderboards jump around. After all, Peloton is about the community and I really would have loved to see that in action. (rhythmic house music) Update time, I look pretty gross right now, but I'm really excited 'cause I have to show you all. I started out at about two miles for every 30 minutes, and today's the first time I crossed 2.5. In fact, I hit 2.62, which is like, wild. That's a lot more than I thought I could do, especially since I, again, hate running. Yeah, I don't know if I will credit the Peloton. That would discredit myself because I did work really hard, however, I'm a little nervous about trying to run outside. But so far so good, I'm really excited. Guess I'll check back in soon. The first month with Peloton is like the week after a New Year resolution. I was consistent, I was motivated, I saw progress really quickly. Then I lost my routine. (calm house music) I just finished my run of the day. I have to admit that this past week I haven't been very good at keeping my runs. As you can see, this is the entire past month since I started on February 19th. And I skipped a lot of days in the past week. It's just been a little busy. My bad. But the good thing is it seems like I'm still getting faster with every run. My pace is still quite slow, but I think that if you compare it to the very, very first time I worked out, I went up a lot. Anyway, I have now about two, three weeks left 'til my 5K, which is nerve-wracking. Right now, the pace is good, I think I'm just going to have to keep trying to sustain that pace on my own since the treadmill keeps up the pace for you. So, now that the weather is getting nice in New York, I will be running outside and seeing how I fare. In the final weeks leading up to my race, I actually did go and train outside. Overall, that made me feel pretty good about the training I had been doing with Peloton. But leading up to the race, I was still pretty anxious about it. (upbeat electronic music) 7:00, we really gotta hit the road before we're too late. Very nervous, didn't get any sleep. But that's okay, let's do it. - [Woman] I believe you can do it. - Thanks, mom. I think I'm about a mile and half, two. What do you think, Rick? - [Rick] Oh, a mile and-- - Change? - Change. - Yeah. - Mile and a third. - Feel good, feel good, let's do this. - [Man] Turn to the right. - [Spectator] Yes, finish strong. (crowd cheering) - Okay, I finished at 32, which is crazy. I don't know, like after mile two I was very winded and tired, but then I think I saw people coming close to the finish and everyone just felt so energized. And there was a sea of purple shirts that just felt like, just keep going, and I did it. It's a good day. So that's how I went from bed to 5K, and you probably want to know by now whether the Peloton Tread was worth it. There were definitely a couple of things I didn't love about the machine, such as how the screen wobbles a little bit when I'm running, and the occasional software lags that affected the stream quality. And to be honest, it's kind of silly to think of your treadmill as something that could be bricked by a bad software update. That said, the best part of the Peloton are the classes, and I found those to be the most helpful aspect of encouraging myself to train every week. I really enjoyed how the instructors were fun to follow along to, and the way they carried through the class with small talks about current events, like International Women's Day, or even jokes about how the weather was in New York. You can access these classes through a digital membership for just $20 a month, which is a lot more worth the value if you already have a treadmill or a gym membership, or plan to run outside. So in the end, although I never quite found that runner's high, I am really grateful to be able to say that I can now complete a 5K. The experience gave me a lot of confidence to go on another race. And even though it was really ridiculous having the Peloton Tread in my bedroom, we went through a lot together and I think I'll actually miss it. Thanks a lot for watching. It means a lot to me to be able to share this journey with you guys, and I'd love to know what kind of tech have you used to achieve something that you'd never thought you could do? Let me know in the comments.",
    "transcript_keywords": [
        "Peloton Tread",
        "Peloton",
        "Tread",
        "run",
        "lot",
        "good",
        "past",
        "Running",
        "week",
        "class",
        "classes",
        "treadmill",
        "kind",
        "day",
        "past week",
        "miles",
        "mile",
        "time",
        "month",
        "York"
    ],
    "transcript_entity_values": [
        "'til",
        "International Women's Day",
        "New York",
        "10-minute",
        "this past week",
        "third",
        "two months",
        "the middle of February",
        "4,500",
        "more than two",
        "two miles",
        "2.5",
        "days",
        "the past 30 days",
        "2.62",
        "a mile",
        "the final weeks",
        "the day",
        "the past week",
        "today",
        "Earlier this year",
        "a little over a week",
        "three weeks",
        "two minutes",
        "the entire last year",
        "5",
        "almost every day",
        "the entire past month",
        "Three",
        "30-minute",
        "February 19th",
        "New Year",
        "every 30 minutes",
        "every month",
        "7:00",
        "every week",
        "just $20",
        "about a mile and half",
        "the end of March",
        "about two",
        "two",
        "32",
        "the past two months",
        "the Peloton Tread",
        "about two miles",
        "32-inch",
        "second",
        "the past nine days",
        "The first month",
        "first",
        "the week",
        "seven",
        "Peloton",
        "Rick",
        "three to four"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "GPE",
        "TIME",
        "DATE",
        "ORDINAL",
        "DATE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "TIME",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "TIME",
        "DATE",
        "EVENT",
        "TIME",
        "DATE",
        "TIME",
        "DATE",
        "MONEY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.03682498633861542,
        -0.014583922922611237,
        -0.013500712811946869,
        -0.04708006978034973,
        -0.005353284068405628,
        -0.03842940181493759,
        -0.08583462238311768,
        0.03328585624694824,
        -0.05528979375958443,
        -0.029217399656772614,
        0.02353476546704769,
        0.03935133293271065,
        0.046476949006319046,
        -0.0067548141814768314,
        0.05089288577437401,
        0.031041862443089485,
        0.04733787477016449,
        -0.028890714049339294,
        0.00119600142352283,
        0.052413418889045715,
        -0.05378953740000725,
        -0.04468502476811409,
        0.06107216700911522,
        0.0675685778260231,
        -0.1038757786154747,
        0.01789264567196369,
        -0.024730345234274864,
        0.04389394447207451,
        -0.04711989685893059,
        -0.018227478489279747,
        -0.01088461559265852,
        0.024304360151290894,
        0.06159110367298126,
        -0.020130682736635208,
        -0.027309507131576538,
        0.035614702850580215,
        0.06353438645601273,
        0.06504896283149719,
        -0.06599877029657364,
        0.012226706370711327,
        0.04669332876801491,
        -0.06876925379037857,
        -0.009847485460340977,
        0.015201554633677006,
        0.04167559742927551,
        0.02762526459991932,
        0.02394176460802555,
        -0.07418987900018692,
        -0.03628186509013176,
        -0.04220985248684883,
        0.002445806981995702,
        -0.05216062068939209,
        0.09316807240247726,
        -0.03117991052567959,
        -0.05694151669740677,
        0.025703798979520798,
        -0.007233488839119673,
        0.08197817951440811,
        0.002711877692490816,
        -0.04569845274090767,
        0.07706725597381592,
        -0.05256655812263489,
        -0.0685720294713974,
        0.018356211483478546,
        -0.007089096587151289,
        -0.0189615897834301,
        -0.006279470399022102,
        0.031119102612137794,
        0.026458870619535446,
        0.020603768527507782,
        0.030702896416187286,
        -0.005719518754631281,
        0.047073621302843094,
        -0.013916422612965107,
        0.006737961899489164,
        0.07263697683811188,
        0.007719275075942278,
        -0.04506063461303711,
        -0.08337820321321487,
        -0.047832220792770386,
        0.019323332235217094,
        -0.01493910513818264,
        0.005772157106548548,
        -0.03518645837903023,
        -0.02104262448847294,
        -0.004466952756047249,
        0.045850686728954315,
        0.037273745983839035,
        0.026740707457065582,
        -0.04387731850147247,
        0.0037736224476248026,
        0.06610698252916336,
        -0.02192511036992073,
        -0.02434060536324978,
        0.02583766169846058,
        0.07143746316432953,
        -0.09195321798324585,
        -0.027868065983057022,
        -0.057639628648757935,
        0.008094105869531631,
        0.044576309621334076,
        0.003701202804222703,
        0.05824768543243408,
        0.02854372374713421,
        0.011206693015992641,
        -0.05821751430630684,
        0.04529542103409767,
        0.07446349412202835,
        0.06654978543519974,
        0.030835486948490143,
        0.007912345230579376,
        -0.03013444133102894,
        0.02456478402018547,
        0.07217257469892502,
        -0.0011315785814076662,
        0.041512083262205124,
        -0.006039403844624758,
        0.05427464097738266,
        0.01752091944217682,
        0.12724918127059937,
        -0.04539475962519646,
        0.023215489462018013,
        -0.012551818042993546,
        -0.01323835738003254,
        0.02062651515007019,
        -0.035228095948696136,
        0.00605720654129982,
        1.6071039176915685e-33,
        -0.09103351086378098,
        0.0006565756630152464,
        0.06949775665998459,
        -0.08080194145441055,
        0.0671524852514267,
        -0.07702098786830902,
        -0.05755443498492241,
        -0.05328727141022682,
        0.0032150247134268284,
        -0.05745576694607735,
        0.02891240268945694,
        0.06715226173400879,
        0.06341397017240524,
        0.10317816585302353,
        0.0654972717165947,
        -0.0709141194820404,
        -0.022466106340289116,
        -0.01964932680130005,
        0.03599708899855614,
        0.022136447951197624,
        0.13423581421375275,
        -0.10762930661439896,
        -0.0854354202747345,
        -0.06309020519256592,
        0.02732832171022892,
        -0.013284487649798393,
        0.09540334343910217,
        0.06609416753053665,
        0.00412280997261405,
        0.02396342158317566,
        -0.05726059526205063,
        -0.03003591299057007,
        -0.05349816009402275,
        -0.044376637786626816,
        0.019612519070506096,
        -0.004367866553366184,
        0.027156339958310127,
        0.014255241490900517,
        0.05670725181698799,
        -0.012185835279524326,
        -0.022017162293195724,
        -0.06981346756219864,
        -0.017601830884814262,
        0.02667737938463688,
        -0.013145742006599903,
        0.05651788413524628,
        0.049742214381694794,
        0.07112531363964081,
        -0.05182128772139549,
        -0.012392737902700901,
        -0.030949389562010765,
        0.006334366742521524,
        -0.03108733706176281,
        -0.04010086879134178,
        0.029911058023571968,
        -0.04800932854413986,
        0.03598954901099205,
        -0.028547590598464012,
        0.016760319471359253,
        -0.04162358492612839,
        0.04415073245763779,
        0.06714768707752228,
        -0.041128288954496384,
        0.04026297107338905,
        -0.11036120355129242,
        -0.03295661881566048,
        -0.012297187931835651,
        -0.03202562779188156,
        -0.00731929624453187,
        0.03605467826128006,
        0.0045736078172922134,
        0.01234603114426136,
        -0.022228874266147614,
        0.01486305519938469,
        0.16043797135353088,
        -0.01958571933209896,
        -0.0624828115105629,
        0.017430324107408524,
        -0.11450633406639099,
        -0.0033288970589637756,
        -0.02466498501598835,
        -0.08607754111289978,
        -0.07148637622594833,
        -0.054156169295310974,
        0.04254700988531113,
        0.045014116913080215,
        0.01862337812781334,
        -0.004942064173519611,
        -0.010292972438037395,
        -0.03190594166517258,
        0.05935463681817055,
        -0.05302073806524277,
        -0.07541054487228394,
        0.14131157100200653,
        -0.06908106058835983,
        -2.036111417612709e-33,
        -0.02311563305556774,
        0.06510886549949646,
        0.10365492850542068,
        0.0083164032548666,
        0.07619298994541168,
        0.02047768607735634,
        0.08724847435951233,
        -0.08658280223608017,
        -0.02440093271434307,
        0.041621942073106766,
        -0.09545964747667313,
        -0.043099891394376755,
        0.030277689918875694,
        0.05046087130904198,
        0.0283238235861063,
        0.006873022299259901,
        0.001195584423840046,
        0.03708202391862869,
        0.035199426114559174,
        -0.06105751544237137,
        -0.008239563554525375,
        -0.014264390803873539,
        -0.06552661955356598,
        0.00017791490245144814,
        0.08973104506731033,
        0.08557245135307312,
        -0.020001202821731567,
        0.022335205227136612,
        -0.03327074274420738,
        -0.0026435861364006996,
        -0.08585094660520554,
        -0.034146860241889954,
        0.004663763102144003,
        -0.02945784293115139,
        -0.010964538902044296,
        0.06854168325662613,
        -0.05338071659207344,
        -0.02471594326198101,
        -0.050954610109329224,
        -0.01802685484290123,
        0.00875837355852127,
        -0.016873784363269806,
        -0.011599569581449032,
        0.001978673506528139,
        -0.051887888461351395,
        -0.002617041813209653,
        -0.015399186871945858,
        0.01879478059709072,
        -0.11841942369937897,
        -0.009251294657588005,
        0.08974290639162064,
        0.07875096797943115,
        0.047062769532203674,
        -0.007879107259213924,
        0.03407812491059303,
        0.008956711739301682,
        -0.016123425215482712,
        0.03486249968409538,
        -0.13956810534000397,
        -0.04335761442780495,
        0.02451304905116558,
        -0.021486632525920868,
        -0.04928102716803551,
        0.04733647406101227,
        0.052795954048633575,
        -0.07996119558811188,
        0.012788429856300354,
        0.06261827796697617,
        -0.024904293939471245,
        0.06843813508749008,
        -0.1383238285779953,
        0.05367187038064003,
        -0.021135129034519196,
        -0.02420777454972267,
        -0.034315645694732666,
        0.10154040157794952,
        0.06714920699596405,
        -0.029001867398619652,
        -0.0777764767408371,
        0.01165800541639328,
        -0.04616730287671089,
        -0.03702425956726074,
        0.09688955545425415,
        -0.040936458855867386,
        0.015214407816529274,
        0.017733119428157806,
        -0.037005312740802765,
        0.03725038096308708,
        -0.02912994846701622,
        0.05092162266373634,
        0.09792586416006088,
        0.061428558081388474,
        -0.03404039517045021,
        0.06257114559412003,
        0.07158388942480087,
        -5.39228537377312e-08,
        0.04411229491233826,
        -0.01981138437986374,
        -0.00017225620103999972,
        0.0666302740573883,
        0.044989097863435745,
        -0.04249584302306175,
        0.039184410125017166,
        -0.003843379206955433,
        -0.016024267300963402,
        0.10130450129508972,
        0.016666404902935028,
        -0.05231046304106712,
        0.03037167526781559,
        0.13322535157203674,
        0.011216366663575172,
        -0.0024454332888126373,
        0.037062712013721466,
        0.011918938718736172,
        -0.03469022735953331,
        -0.01602858118712902,
        -0.02083445154130459,
        -0.04350963234901428,
        -0.06238298863172531,
        0.016981270164251328,
        0.020461982116103172,
        -0.07297700643539429,
        -0.02815082110464573,
        -0.048682622611522675,
        -0.05651545524597168,
        0.0006899606669321656,
        -0.04526188224554062,
        -0.03527521342039108,
        -0.09245654195547104,
        0.013419964350759983,
        -0.07344688475131989,
        0.010145534761250019,
        -0.007323917467147112,
        0.05639372020959854,
        -0.04524732381105423,
        0.07212741672992706,
        -0.023192692548036575,
        -0.036658547818660736,
        0.0006853664526715875,
        0.03159244731068611,
        0.02083822712302208,
        -0.09588848799467087,
        -0.09547126293182373,
        -0.12096915394067764,
        0.017294999212026596,
        -0.02905721217393875,
        0.021200081333518028,
        -0.01928381249308586,
        0.06201229616999626,
        -0.007252252660691738,
        0.06381426751613617,
        0.046452734619379044,
        -0.11709988117218018,
        -0.006102757528424263,
        -0.08903863281011581,
        0.0659002810716629,
        -0.06291094422340393,
        -0.02764986641705036,
        0.022074876353144646,
        0.016187751665711403
    ]
}