{
    "id": "4AnyhHl3_tE",
    "title": "Almost EVERYONE is Wasting Money on Dash Cams.",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-08-14T16:54:28Z",
    "video_url": "https://www.youtube.com/watch?v=4AnyhHl3_tE",
    "category": "Science & Technology",
    "tags": [
        "what's the best dashcam for $100?",
        "what dash cam should i buy?",
        "best dash cam in 2022",
        "what's the best dsh cam",
        "why do all dash cams suck?",
        "is the dashcam good?",
        "avoid dash cam",
        "lenovo",
        "garmin",
        "#DubbedWithAloud"
    ],
    "views": 9944618,
    "likes": 284131,
    "comments_count": 18933,
    "description": "Try FreshBooks free, for 30 days, no credit card required at   Create your build at   Its been YEARS since dash cams hit the market, but it feels like weve been stuck at a standstill. Why is it that camera quality is so lacking? Are there really no good options when shopping for a dash cam to attach to the windshield of your car? (The second half of this video is pretty stunning!)  Discuss on the forum:   Buy a Thinkware F70:  Buy a Biuone A20:  Buy a Chortau B-T13:  Buy an Iiwey T1:  Buy a Pruveeo D30H:  Buy a Rexing V1-4K:  Buy a Garmin Dash Cam Mini 2:  Buy a Rove R2-4K:  Buy a BlackVue DR750X Plus:  Buy a Thinkware U1000:  Buy a Viofo A119 V3:  Buy a Viofo A129 Plus Duo:  Buy a Viofo A129 Pro Duo:  Buy a BlackVue External 4G/LTE Module:  Buy a Thinkware Multiplexer Box:  Buy a Thinkware Multiplexer Kit:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   English This video has been dubbed using an artificial voice via  to increase accessibility. You can change the audio track language in the Settings menu.  Spanish Este video ha sido doblado al espaol con voz artificial con  para aumentar la accesibilidad. Puede cambiar el idioma de la pista de audio en el men Configuracin.  CHAPTERS --------------------------------------------------- 0:00 Intro 1:07 The Back-story 2:37 Thinkware F70 3:26  Biuone A20 3:55 Chortau B-T13 5:00 Iiwey T1 and Pruveeo D30H 6:16 Rexing V1-4K 6:57 Garmin Dash Cam Mini 2 7:34 Rove R2-4K 8:05 Viofo A119 V3 9:12 BlackVue DR750X and Thinkware U1000 10:30 THE REASON THEY'RE SO BAD 15:04 tldr; 17:04 outro",
    "description_links": [
        "https://www.freshbooks.com/linus",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1449409-almost-everyone-is-wasting-money-on-dash-cams/",
        "https://geni.us/ORAo",
        "https://geni.us/PK2Ch",
        "https://geni.us/oiFwAUr",
        "https://geni.us/1QZkry",
        "https://geni.us/sl2dqAc",
        "https://geni.us/sOG6",
        "https://geni.us/TN9q",
        "https://geni.us/n8xqqeE",
        "https://geni.us/L83rlR",
        "https://geni.us/Qwk85TK",
        "https://geni.us/eNBHc",
        "https://geni.us/yPJli",
        "https://geni.us/ygAAc",
        "https://geni.us/AIIy2",
        "https://geni.us/P0bzYvN",
        "https://geni.us/IZGz",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE",
        "https://aloud.area120.google.com",
        "https://aloud.area120.google.com"
    ],
    "transcript": "- Buying a car is a major decision, and you'll wanna do everything you can to protect your investment. (car honking) Oh! Oh God! Oh, what the? That guy just hit me. Good thing I caught his license plate on one of my many trusty dash cams. This one's kinda crap. This one too. Well, surely my expensive one will. Now, come on! This is unusable! What the heck is going on here? I spent over 1000 U.S. dollars on a dozen of the top rated dash cams on Amazon, and almost every single one sucks to the point of being basically unusable. How did this happen? I did my homework. I got the most recommended. I got the highest rated units. I thought I picked up something reliable. Why aren't these things decent, like our sponsor? - Build Redux. Build Redux makes it easy to configure your new build with support guides to help along the way. They also offer competitive pricing as compared to building a PC yourself. So head to buildredux.com/linus and start your new build today. - This video started over three years ago when my wife came across some hilarious examples of blatant insurance fraud that was prevented by dash cam footage. She asked me to get some dash cams for our cars. \"No problem,\" said I, and I headed over to Amazon where, to my surprise, nearly everything was obscenely priced, full of misleading specs, covered in obviously paid reviews, or sometimes all three. Long story short, I settled on a cheap and cheerful unit with decent reviews and bought two of them, not one of which even managed to power on. So, I gave up. Then, one of our new writers overheard me recounting this story and went, \"I can look into that. I need a dash cam too.\" And two weeks later, we've learned a lot. To start with, the dash cam market is still not as straightforward as one might hope. Marketing materials for cheaper dash cams can be confusing and contradictory, and their performance, its basically impossible to compare without trying them side by side in the real world. Dash cams take all the issues of reviewing a regular camera and they add on a ton of extra usability features that need to be evaluated. Parking mode, discreetness, loop recording, gravity sensors, even the length of the cable matters. Too long and you've got an unsightly coil of wire to hide, too short and it could be a challenge to reach your power source. It's a lot to take in. The good news is that if all you want is proof of fault, or lack thereof, in the event of an accident, it's still pretty hard to go wrong. Our value pick is the Thinkware F70. It's pretty bare bones in terms of features, lacking creature comforts like GPS data, or even a screen for that matter, but it is dead simple to set up since it doesn't need to be paired to an app, the included 3m mounting tape is quite permanent, and while it won't be winning any awards for image quality, we were able to clearly identify the vehicles and people in our footage, and we could even make out license plates, at least on stationary cars. That's pretty okay, especially for just 70 U.S. dollars. But, there were situations where it left us wanting a bit more. Now our target price was under $100, and we ended up with a wide range of features and image quality. So let's make our way through the rest of them, from cheapest to most expensive. This is the A20 from Biuone, a brand with no website, but they do have the lucky number eight spot in the Amazon best sellers list. You might not expect much for $60, and if that's the case, boy are you ever a savvy shopper. Image quality during the late hours of the day is lacking, and at night is so bad that you'd think you were filming on a potato. Making matters worse, the screen doesn't automatically dim, so you'll be constantly vibrantly reminded of how little useful information your camera is capturing. The BT 13 comes in at $10 more, ranks number six on Amazon, and just like the Biuone, it comes courtesy of a mystery meat brand with no website. This time called Chortau. It's not that hard to have a website, guys. I've got one. It's full of great deals, like these $9 mystery cable ties. Lttstore.com. Daylight quality is grainier than the A20 for sure, but text is actually slightly easier to read, indicating that Chortau might be using a better sensor, but what they aren't doing is much in the way of post-processing to enhance the image quality. And this is especially apparent at night, where the A20 actually looks somewhat decent in comparison. Also, like the Biuone, the screen stays on by default. Annoying. But one interesting feature it has at least is that the rear camera input is mini HDMI. So if you wanted to use a decent camera for your rear view, the Chortau could act as your screen and save your backups. Otherwise we stand by our recommendation of the Thinkware F70 at this price. And, at $80 for that matter. These two chunky boys didn't make it into our side by side tests due to their considerable bulk. Both have cabin facing cameras though, so realistically they're designed more for an Uber driver audience anyway. The T1 comes from IIWEY, the first manufacturer with an actual website, and in broad daylight driving away from the sun, like ideal conditions, it can't seem to make out the words on many road signs, let alone other important details. Not a good showing for the second highest rated unit with a cabin camera. Chonker number two is the D30H from Pruveeo. They claim it's a 4k camera, which, if true, could be a really great value, but out of the box the metadata for the files clearly reads 1080p. With that aside, in the daylight it can read signs, which is an improvement over the Biuone and the IIWEY, but license plates are still elusive unless at a complete stop and positioned just right. One cool feature though is that it uses capacitors instead of lithium batteries, unlike the rest of the cameras we've talked about already. This is a nice to have, because lithium batteries, especially when subjected to heat, and when they're constantly fully charged, wear out more quickly, which can lead to battery swelling, and in extreme cases, fire. Let's step up our budget. Surely for $100 this sponsored listing for the REXING V1 4k will be a good choice, right? I mean, it has 4k right in the name, right? And Forbes named it the \"Best dash cam for a tighter budget\" of 2022. Let's see how that's goin'. Actually, not too bad Forbes. Looking at the videos from around dusk, it is slightly clearer than our $70 F70, but only slightly. Field of view, colors, ability to make out text, all of that is pretty much the same, which means that unless you really need the screen, it doesn't feel worth spending 43% more. Maybe Garmin can change my mind? They used to be very well known for their GPS offerings. Their compact dash cam Mini 2 was a little out of our price range at $110, but, hey, what's 10 extra bucks for the much better brand name one, right? Well, not right, but at least not wrong. It performs about as well as the V1 4k, maybe a bit better or worse depending on the circumstances. And it has some nice features available, but those features require an app, and that app requires an account, and that account requires you to give Garmin your information, which is super. Now surely the number one pick on Amazon is gonna ride in and save the day, right? At $120, it is now firmly beyond our original price target, but what's another 10 bucks if it's a lot better, right? Here we go. Really? At dusk, the Rove R2-4K manages to capture less detail than our budget F70, and at night it's more of the same, signs are readable, sometimes, if you're lucky. But there is one last hope. It's the darling of budget dash cam stands across the internet, and it happens to nail our $100 budget exactly. It boasts true 1440p recording with easy and secure mounting, and comes from a manufacturer that accepts community feedback and maintains their products through firmware updates. It's even popular enough to get into the top 20 on Amazon. And it's the Viofo A119 V3, all of which sounds great. But what about the image quality? (Linus blowing raspberries) I mean, in fairness it is the best we've seen so far, especially when it comes to the finer details, and it's $20 cheaper than some of the competition, but I can't help but be a little disappointed. It just feels like no matter which brand we buy and no matter how much we spend, we're ending up with pretty much the same crappy image, even from our best camera. So let's do something I wouldn't actually recommend and completely blow our budget. These are the BlackVue Dr750X+, and the Thinkware U1000. The Dr750X is BlackVue's second most expensive one channel dash cam at 270 U.S. dollars. It has dual band wifi, a back illuminated image sensor with enhanced night vision, and support for LTE cloud storage backup. And the Thinkware U1000, well that's Thinkware's flagship device, the best of the best. 150 degree viewing angle, 1440p 60 FPS recording, geofencing with push notifications, red light camera detection, and picture quality that... Oh, come on! The BlackVue is as bad as the crappy Chinese cameras, and the U1000 is barely better than the A19 V3, if at all. It does have some creature comforts. I mean, I guess it's nice that it tells me when there's a red light camera coming up ahead. - [Dashcam] Red light camera in 200 meters. - So that I can stop at it instead of just blowing through like I normally would. I mean, this thing's gonna pay for itself in saved traffic tickets. And the geofencing feature, okay, that legitimately could come in handy once my kids are old enough to drive. And maybe BlackVue's cloud storage would come in handy in case the camera got destroyed in a crash. But at more than double, up to quadruple the prices of these other options, I am frankly blown away that there's anything but a colossal improvement in the quality of capturing video out the front of my windshield. The entire purpose of these devices. What is going on here? I mean, if I were to put a $400 GoPro in my car instead of one of these cameras, it would look amazing. How are these all so bad? Well, here's a hint. You might see nine dash cams attached to this car. You know what I see? Two dash cams in nine different plastic shelves. Listen to these startup chimes. (dashcams chiming) - [Dashcam] Video mode. Please insert micro SD card. - Look at these default folder structures. Heck, even just look at the rear cameras that come with some of these. Notice any similarities? The thing is, there are hundreds, if not thousands of dash cam brands, but there are only a handful of companies that actually manufacture the two most important components; the SOC and the CMOS image sensor. In SOCs, the major player is Taiwanese fabless semiconductor manufacturer, Novatek. Not to be confused with the Russian natural gas corporation of the same name. Their bread and butter is LCD controllers for companies like Asus or Sony. But on the side, they also make camera SOCs, like the NT96660 and the NT 96655. With the numbering scheme not easily obtainable by the general public, it's hard to tell exactly what the specs of these chips are, or when they were designed. But from what we could glean online, the 96660 was built sometime around or before 2017, and the last two digits appear to be the series and iteration. So of our 10 dash cams in that near $100 range, eight of them were using Novatek SOCs, and Viofo was one of the few examples we could find of any camera using an SOC where the second to last digit was higher than six. Meaning most of them are using five year old technology at best. Identifying a Novatek system is fairly easy. They often have the same startup sounds. (dashcam chiming) - [Dashcam] Video mode. - Or use the default backup cameras. Or even have folder structures that include the name Novatek. Other manufacturers of SOCs include HiSilicon from Huawei, Thinkware's manufacturer of choice, Ambarella, and the very infrequently used, Allwinner. In our limited searches, we could not seem to find the SOC manufacturers for BlackVue or for Garmin products, though it's fairly likely that they're using one of these three. As for CMOS image sensors, nearly every company uses Sony STARVIS, a sub-category of their Exmor sensors. Exmors are used in nearly everything, from phone cameras in Apple and Samsung phones alike, to high end consumer cameras, to the lowest end webcams. And the STARVIS line is the type that is specifically designed for security cameras and other similar applications that require decent low light performance. The most common sensor to find in dash cams right now is the IMX335. It's a perfectly fine sensor actually, capable of 1440p video with a reasonable enough level of clarity even in low light. The Rove and the Viofo both use this sensor. So then you would think they would have the same image quality, right? Clearly there's a difference, though. What it could be is something to do with Rove using its limited processing power to upscale the image to 4k. Or it could have to do with the Rove using an NT96660 processor, while the Viofo uses an evidently newer NT96670. For the several hundred dollars more that you would pay for the Thinkware U1000, you're getting a STARVIX IMX334, which appears to be the next level up from the 335, totally intuitive. But the difference, as far as we've been able to see, isn't that great. If I could put it in PC gamer terms, it's kinda like upgrading your graphics card from a 3070 to a 3070 Ti, but for double or triple the price. There are a few other sensor manufacturers, like OmniVision or Galaxycore, but these are only used occasionally, and the image quality, at least going by the other reviews, doesn't seem to be a huge improvement there either. One great thing about Sony being the big kahuna in image sensors is that they're pretty open with their data sheets. So if you know what image sensor a camera uses, you can at least find some basic information on it. But that's only gonna take you so far without having information on the SOC, or probably more importantly, the software algorithms that will be running to process the raw image. The biggest takeaway here then is that no matter which dash cam you choose, there is kinda this hard limit on image quality that can be achieved at the moment. And some of the low end models, they're already pretty close to that limit. So you're either gonna be settling for good enough, or, as we suggested before, you could throw a GoPro up on your windshield with all the associated inconvenience that comes with that. Did I remember to roll it? And the problem is, I doubt that this is gonna change anytime soon, because the top dash cam companies seem to be more interested in adding features, like the ability to string five cameras together or let you review your footage with full gyroscopic readouts, rather than actually making a camera that can read a bloody license plate 10 feet in front of you. So if you're in the market for a dash cam, ignore the Amazon reviews. F70 for the budget shoppers out there, and Viofo A119 V3 for pretty much everyone else. Their video quality isn't nearly as far off the top of the line as you would think, and neither of them is gonna put you at major risk of having your windows smashed to steal your dash cam. If you wanna add a rear cam as well, the A129+ or similar offerings from Viofo will allow you to do that as well, also without breaking the bank. Now let's break our bank where our sponsor puts money. FreshBooks. FreshBooks is the easy to use accounting software that helps you do your business. You can impress clients with professional looking invoices that detail the work you've done, use automated payment reminders if invoices get past due, easily track expenses, and use their time tracker to log every minute of billable hours so you don't have to think about it later. And keep everyone on the same page with their projects feature, which makes it easy for clients, your team, and your contractors to collaborate, share files, and comment. FreshBooks also has your back at tax time. With a ton of reports to choose from, you'll know exactly where your business stands and you can easily hand the keys over to your accountant so they can take over when it's time to reconcile everything for the year. So choose the plan that's right for you and start your free trial of FreshBooks for 30 days today with no credit card required at freshbooks.com/linus. If you enjoyed this video, our first dash cam video is a treat. You can watch Luke threaten me with, wait, is that a crowbar? No, it's an ice scraper. I think I'll be all right. What the heck is going on here? Stop! Forward as one might hope. (beep) you. What the (beep)? 'Cause it's (beep) and everything is (beep). The included 3m mount. Keep doing it. The definition of insanity, right? Here we go, boys.",
    "transcript_keywords": [
        "dash cam",
        "dash cams",
        "dash",
        "image quality",
        "camera",
        "cam",
        "image",
        "cameras",
        "cams",
        "quality",
        "Amazon",
        "dash cam video",
        "Thinkware",
        "budget dash cam",
        "image sensor",
        "sensor",
        "Viofo",
        "dash cam brands",
        "video",
        "make camera SOCs"
    ],
    "transcript_entity_values": [
        "nine",
        "3070",
        "one",
        "over 1000 U.S. dollars",
        "IIWEY",
        "20",
        "eight",
        "One",
        "Allwinner",
        "$400 GoPro",
        "NT96660",
        "FPS",
        "10 bucks",
        "thousands",
        "A20",
        "FreshBooks",
        "three",
        "110",
        "20",
        "Forbes",
        "the Thinkware F70",
        "the day",
        "Linus",
        "two weeks later",
        "9",
        "2017",
        "the BlackVue Dr750X+",
        "Viofo A119 V3",
        "the year",
        "Biuone",
        "80",
        "CMOS",
        "HiSilicon",
        "Apple",
        "first",
        "just 70 U.S. dollars",
        "200 meters",
        "2022",
        "120",
        "270 U.S. dollars",
        "a dozen",
        "Amazon",
        "10 extra bucks",
        "60",
        "BlackVue",
        "Novatek",
        "150 degree",
        "A20",
        "Forbes",
        "every minute of billable hours",
        "six",
        "Chortau",
        "around dusk",
        "Taiwanese",
        "three years ago",
        "LCD",
        "Samsung",
        "hundreds",
        "Sony",
        "30 days",
        "10 feet",
        "Biuone",
        "OmniVision",
        "96660",
        "SD",
        "10",
        "Exmor",
        "335",
        "70",
        "43%",
        "five year old",
        "Rove",
        "five",
        "10",
        "a ton",
        "Ambarella",
        "3",
        "the A19 V3",
        "Build Redux",
        "Viofo",
        "the Thinkware F70",
        "two",
        "Russian",
        "Galaxycore",
        "second",
        "SOC",
        "night",
        "dusk",
        "the several hundred dollars",
        "Two",
        "Huawei",
        "Asus",
        "Chinese",
        "F70",
        "today",
        "4k",
        "Lttstore.com",
        "Thinkware",
        "Pruveeo",
        "Chortau",
        "LTE",
        "the late hours of the day",
        "STARVIS",
        "Viofo",
        "GoPro",
        "100",
        "Luke",
        "Garmin"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "FAC",
        "ORG",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "FAC",
        "DATE",
        "PERSON",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "NORP",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "MONEY",
        "QUANTITY",
        "DATE",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORG",
        "TIME",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PERCENT",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "LAW",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "ORDINAL",
        "ORG",
        "TIME",
        "TIME",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "FAC",
        "MONEY",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.0877673402428627,
        -0.008610518649220467,
        0.028166553005576134,
        -0.07557272911071777,
        0.08526580780744553,
        -0.04481799528002739,
        0.01531193032860756,
        0.13060541450977325,
        0.01317230612039566,
        0.05375261977314949,
        -0.017738817259669304,
        -0.03123697079718113,
        -0.01962677203118801,
        0.0021126349456608295,
        0.03610257804393768,
        -0.08172349631786346,
        0.06712297350168228,
        -0.07081567496061325,
        -0.02538393624126911,
        0.010484888218343258,
        -0.056798964738845825,
        -0.07940270751714706,
        0.03653039410710335,
        -0.01367625966668129,
        0.007335634436458349,
        0.005812779068946838,
        -0.02039838209748268,
        -0.03648856282234192,
        -0.026622433215379715,
        0.009961680509150028,
        -0.03519899770617485,
        0.0350307896733284,
        0.04958472400903702,
        -0.030331164598464966,
        -0.010330630466341972,
        -0.13765554130077362,
        0.059456683695316315,
        -0.031422603875398636,
        -0.07695595175027847,
        -0.017848625779151917,
        -0.09272317588329315,
        0.023060884326696396,
        -0.06778712570667267,
        -0.05052037909626961,
        0.047406863421201706,
        0.001350928796455264,
        0.11924737691879272,
        0.006566962227225304,
        0.07282280176877975,
        -0.09514929354190826,
        -0.06915193051099777,
        0.016210336238145828,
        -0.004375849850475788,
        -0.07452414184808731,
        -0.12494447827339172,
        0.06277871131896973,
        -0.10573580861091614,
        -0.008647654205560684,
        0.0029608365148305893,
        -0.0070288642309606075,
        0.07132755219936371,
        -0.038765471428632736,
        -0.008222135715186596,
        0.02352183684706688,
        0.015078631229698658,
        -0.0057479399256408215,
        0.04585207253694534,
        0.008732335641980171,
        -0.005144659895449877,
        0.09919402748346329,
        -0.029950164258480072,
        0.042354900389909744,
        0.013387676328420639,
        0.02697831764817238,
        -0.03809579089283943,
        0.07705313712358475,
        0.06236092001199722,
        -0.05297533795237541,
        0.005549899302423,
        -0.02367057092487812,
        0.0445355661213398,
        -0.02363685891032219,
        -0.00900273397564888,
        0.06680113077163696,
        0.09040053933858871,
        0.009836755692958832,
        0.04254685342311859,
        -0.002416824921965599,
        -0.036362212151288986,
        -0.10449272394180298,
        -0.014506048522889614,
        -0.023293323814868927,
        -0.005085003562271595,
        -0.09646982699632645,
        -0.031424783170223236,
        0.014849171973764896,
        0.023617258295416832,
        -0.02884967252612114,
        0.0026357073802500963,
        0.04789584502577782,
        -0.0165856946259737,
        -0.036184556782245636,
        0.0836729109287262,
        -0.015206352807581425,
        -0.0034795268438756466,
        0.005114553961902857,
        0.0054481616243720055,
        0.05367240682244301,
        0.06483080238103867,
        0.02842528000473976,
        -0.04233226925134659,
        0.07532764971256256,
        -0.004539625719189644,
        -0.05385071039199829,
        -0.0792374387383461,
        0.09661440551280975,
        -0.08923456817865372,
        -0.036266546696424484,
        0.07179848104715347,
        0.09562467783689499,
        0.03213341534137726,
        -0.1015346422791481,
        -0.055397797375917435,
        0.04155537858605385,
        0.05733170360326767,
        -0.009706387296319008,
        0.07758352160453796,
        7.423564208917468e-33,
        -0.04961344599723816,
        0.14847710728645325,
        -0.015229511074721813,
        -0.006172179710119963,
        -0.06321440637111664,
        0.054387856274843216,
        0.01763417199254036,
        0.017794180661439896,
        -0.06433194130659103,
        0.020257500931620598,
        -0.02491292543709278,
        -0.006351219490170479,
        -0.06996694207191467,
        0.061595648527145386,
        0.08865954726934433,
        0.0182513277977705,
        -0.05337628722190857,
        -0.06971627473831177,
        -0.03475814685225487,
        -0.0028995119500905275,
        0.05292752757668495,
        -0.05008916184306145,
        0.03695292770862579,
        0.014201774261891842,
        0.04611585661768913,
        0.010358895175158978,
        0.09118936955928802,
        0.03031647950410843,
        0.05693691596388817,
        0.024719098582863808,
        -0.08917976170778275,
        -0.023940226063132286,
        0.049533043056726456,
        -0.04709747061133385,
        0.03773898631334305,
        -0.012944137677550316,
        -0.08359641581773758,
        -0.08031021058559418,
        0.025561746209859848,
        -0.02627740427851677,
        -0.0032993603963404894,
        0.1306319236755371,
        -0.1201300099492073,
        -0.013322781771421432,
        0.08084627240896225,
        -0.02376071736216545,
        0.0822519063949585,
        0.06170615181326866,
        -0.09651853889226913,
        0.07571030408143997,
        -0.021832991391420364,
        -0.007887757383286953,
        -0.09790432453155518,
        -0.007601568009704351,
        -0.11899907886981964,
        0.023892587050795555,
        0.03681521117687225,
        -0.03850989043712616,
        0.018099308013916016,
        0.008894172497093678,
        -0.05202925205230713,
        -0.06125728785991669,
        -0.031237220391631126,
        -0.059972066432237625,
        -0.06961017102003098,
        0.05580829083919525,
        0.02469770424067974,
        0.06755739450454712,
        -0.11547140032052994,
        0.018839869648218155,
        0.035636112093925476,
        -0.00579092325642705,
        -0.013546348549425602,
        -0.08436843007802963,
        0.09257150441408157,
        0.05380525812506676,
        -0.010753127746284008,
        -0.01837386190891266,
        -0.015378600917756557,
        -0.007878059521317482,
        -0.0773020014166832,
        -0.0069014229811728,
        0.024625064805150032,
        0.044163163751363754,
        0.028358539566397667,
        -0.04807685688138008,
        0.020780449733138084,
        0.004272226244211197,
        -0.0791386142373085,
        0.006256138905882835,
        0.03277787193655968,
        0.06960788369178772,
        0.01569768227636814,
        -0.01600811257958412,
        0.0105690723285079,
        -5.74580279516591e-33,
        -0.006153151858597994,
        0.02776116319000721,
        -0.013124065473675728,
        0.02118763141334057,
        -0.04291249439120293,
        -0.002907703397795558,
        0.07112613320350647,
        -0.03849690780043602,
        0.04153810441493988,
        -0.05010198429226875,
        -0.01665579341351986,
        -0.015317646786570549,
        -0.008405533619225025,
        0.03776480630040169,
        -0.001947485376149416,
        -0.016666296869516373,
        0.03882886469364166,
        -0.10904642939567566,
        0.01277056522667408,
        -0.0652620866894722,
        0.0995444655418396,
        0.048317939043045044,
        0.06407906860113144,
        -0.005906344391405582,
        -0.0045431689359247684,
        0.02285155840218067,
        -0.026200877502560616,
        0.051171574741601944,
        0.05593201890587807,
        -0.05193044990301132,
        0.025719108060002327,
        0.0033434033393859863,
        -0.0007946703699417412,
        0.007374811917543411,
        0.06342829763889313,
        0.05759113281965256,
        0.08943585306406021,
        0.0711653083562851,
        -0.02406127005815506,
        -0.014288750477135181,
        -0.011102063581347466,
        0.00531940720975399,
        0.04685884341597557,
        -0.06981196999549866,
        0.06427522748708725,
        -0.011429998092353344,
        -0.012615056708455086,
        -0.00035087342257611454,
        -0.023204686120152473,
        0.018467364832758904,
        -0.014755910262465477,
        -0.005265758838504553,
        -0.03071240708231926,
        0.051282934844493866,
        -0.0416410006582737,
        -0.02810094505548477,
        0.011494804173707962,
        0.03427312523126602,
        -0.00015846341557335109,
        0.02437201701104641,
        0.07583356648683548,
        0.04883284866809845,
        -0.04930058494210243,
        -0.058139584958553314,
        0.00943009089678526,
        -0.06412763148546219,
        0.02312624268233776,
        0.04598121717572212,
        -0.00239625689573586,
        -0.0073343063704669476,
        -0.05686868727207184,
        -0.029879409819841385,
        0.006289491429924965,
        -0.07585418224334717,
        -0.06240173429250717,
        0.09137797355651855,
        -0.005279372446238995,
        -0.044293224811553955,
        0.0368465781211853,
        -0.07797345519065857,
        -0.019948123022913933,
        -0.06702318787574768,
        0.03438785299658775,
        0.05435815453529358,
        0.0026514199562370777,
        0.06069564074277878,
        -0.023133911192417145,
        -0.016439326107501984,
        0.012879547663033009,
        0.05836144834756851,
        -0.05815358832478523,
        0.030500926077365875,
        -0.021169273182749748,
        0.08209521323442459,
        -0.03516494482755661,
        -5.2728605481888735e-08,
        0.01947879232466221,
        0.0013597897486761212,
        0.0342373363673687,
        0.08330212533473969,
        0.011703379452228546,
        -0.08223635703325272,
        -0.016723936423659325,
        0.05287730693817139,
        0.0514649823307991,
        -0.033513378351926804,
        -0.00035579685936681926,
        -0.05874435603618622,
        -0.041456181555986404,
        0.011963575147092342,
        0.013705510646104813,
        0.07846017926931381,
        -0.0020084113348275423,
        -0.014934786595404148,
        -0.029806630685925484,
        0.007188184652477503,
        0.018428148701786995,
        -0.012965742498636246,
        0.021483566612005234,
        -0.02487887442111969,
        0.023861583322286606,
        -0.006119200959801674,
        -0.0036847430747002363,
        -0.03134499862790108,
        0.0919995978474617,
        -0.06038841977715492,
        -0.07597838342189789,
        0.011157198809087276,
        0.08883301168680191,
        0.010284754447638988,
        0.06954296678304672,
        -0.08636410534381866,
        -0.0835178792476654,
        0.09431333094835281,
        0.02246534265577793,
        -0.024850012734532356,
        0.0626998096704483,
        0.00358470412902534,
        -0.01991649530827999,
        0.0040089464746415615,
        0.03019627369940281,
        0.004832166712731123,
        0.022603070363402367,
        -0.06772153079509735,
        0.003694147104397416,
        0.030349869281053543,
        -0.013243637979030609,
        -0.04700995609164238,
        -0.03132588043808937,
        0.060669999569654465,
        -0.023001229390501976,
        -0.02538195624947548,
        0.08730107545852661,
        -0.04014522209763527,
        -0.014557632617652416,
        0.0003814556694123894,
        -0.03191085532307625,
        -0.05039873346686363,
        -0.1050933301448822,
        0.10192500054836273
    ]
}