{
    "id": "4G4TChPJE1o",
    "title": "Circuit bending: Hacking a Furby in the name of music",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-09-14T13:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=4G4TChPJE1o",
    "category": "Science & Technology",
    "tags": [
        "circuit",
        "bending",
        "circuit bending",
        "experimental",
        "bender",
        "bent",
        "furby",
        "music",
        "music production",
        "sam battle",
        "look mum no computer live",
        "look mum no computer",
        "future of music",
        "synth",
        "hacked",
        "electronics",
        "electronica",
        "noise",
        "modified",
        "distortion",
        "toy",
        "dani deahl",
        "dj",
        "furbies",
        "toys",
        "90s",
        "lightsaber",
        "future",
        "new music",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "how to",
        "how to make",
        "diy",
        "mkbhd",
        "apple",
        "google",
        "android",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 169287,
    "likes": 2592,
    "comments_count": 157,
    "description": "Circuit bending consists of dismantling toys, household objects and synths in order to rebuild them as new instruments. To most people, old toys like a Furby are just toys, but for musicians who circuit bend, these are instruments waiting to happen. In this episode of The Future of Music, Dani Deahl visited Sam Battle, also known as Look Mum No Computer. He is at the forefront of the circuit bending scene and creates the top circuit bent instruments out of things like bikes, flamethrowers and yes, Furbies.  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Play with me - I am playing with you, buddy. - [Furby] Yeah. (electronic noises) - [Dani] Yeah. - [Sam] That was good. - [Dani] That was- - [Sam] That was a big burp. (laughing) (Furby makes electronic squeaking sounds) - And there we go. - [Dani] Yay. - That is the beginnings of circuit bending. - [Dani] Futuristic doesn't have to mean new. It can also mean using old tech in a way that hasn't been done before. We're here in the seaside town of Margate to visit Sam Battle. Sam is also known as Look Mum No Computer. He's a musician and circuit bender who breaks apart old toys and synths to create his own instruments. Some of his creations include a musical flame thrower and a Furby organ. (Furbies chattering] He's invited me into his studio so I can check out some of his creations for myself. And so we can break open a toy and circuit bend it together. My name is Sam. And I do a project called Look Mum No Computer, which is basically like repurposing things and making silly inventions that are loosely based around music. And I do do some circuit bending and things. - What is circuit bending? - Circuit bending is basically taking machines and toys and cheap things from the past or even nowadays, and just making them do things that they're not intended to do. Usually, let's say in the 70's somebody's got a toy in their attic, a Speak & Spell, like those orange and yellow toys, somebody's like, \"I wonder what it's like inside there?\" They pull it apart, they see all these circuit bits, lick their fingers because it's only got two batteries, you're not going to electrocute yourself, (makes electrocution sound) no, I'm joking. And then it makes, you find that it makes different sounds or you can change the pitch if you touch the ground with one finger and like a certain bit of the chip goes, like, (makes electronic sounds), and like you're making it do unintended things, and it's maybe, it began probably as something that was fun. And then it quickly evolved into something musicians use to make new sounds. - [Dani] At its height, circuit bending spans several musical genres with artists like Trent Reznor of Nine Inch Nails, Beck and Danny Elfman all using circuit-bend instruments in performances. While it's not as popular anymore, there is still something about Sam's creations that's just really cool. They're massive and insane. - 44 circuit-bent Furbies. All circuit bend in sequence. Around the back, it you look really carefully behind it, like you'll see behind them- - [Dani] Yeah, yeah, yeah. - [Sam] They've got like, you can see all the wires and stuff. Have a little peak in there. - They make a lot of noise. - They are noisy. - Yeah - Now you miss it. Now you miss the sound. - I do kind of miss the sound. How long did it take you to build this thing? - I built this in about two weeks of not sleeping. However, I've been planning it for seven years. And then, it took me about a year to find all of the Furbies. This is like Gordon Ramsey, but Furbies. So what we've got to do is we've got to get it ready by removing its protective cable tie. Then you got to be a bit forceful. So there we go. - [Dani] Oh, wow, okay. - Da, da, me scared. (laughing) - [Sam] So now we've got- - I would be to. - [Sam] Now what you've got to do, is you get that and have a fiddle. There's no right or wrong. - [Furby] Larry. (electronic noises) And there we go. - [Dani] Hey! - And then what you do, is you find something like that. - Yeah. - And then you put some sort of thing that would make this permanent or not. So you snip that and you put a switch on it, so you can choose those points. - So you can have control over it making that noise. - Yeah, yeah. Now you just see what it does. Sit back and enjoy. - [Dani] Oh, that is so cool. (organ music playing) - [Sam] I mean I've always, I've circuit bent Furbies a lot from when I started because they were quite cheap for how advanced they were in what they did. Apparently, ever since they came out, there was a people that wanted to, you know, fiddle with them and see what's inside them. - Circuit bending really was, it was this exploitation of this little window of time when the scale and complexity of electronics was just right. You know, it was complex enough to do wild stuff, but simple enough that a little hack could make it, you know, malfunction in cool ways. - [Dani] That's Peter Edwards who founded Casper Electronics. He's a circuit bending expert, who has built custom instruments for bands. - The consumer electronics we have in our lives have evolved in a way that's completely oblivious to these hacking practices and have moved away from hackability. I was teaching circuit bending workshops for about 10 years and then I stopped because eventually no one in the workshop could hack anything. There was nothing to bend, because the circuits just weren't bendable anymore. So yeah, is there a future for circuit bending? I think from the perspective of modifying kids' toys, I think, no, not really. But from the perspective of people approaching, you know, consumer products and electronics with an adventurous spirit and finding new ways to use them, like, absolutely. - [Dani] And Sam is one of these people, who is pushing the medium forward and finding new ways to make music through hacking electronics. (electronic music) - What. It's like a Daft Punk bike. - [Sam] Yeah. (laughs) (synthesizer music with cymbal beat) - Hit that, hit that. (electronic air horn sounds) - Every, synth bike needs an air horn. This one's even got a head. It's got a face. Look, every synthesizer needs a face. His name's Cosmo, or her. I don't know. Right now we're going to control it with this solar panel. So I'm going to patch in a solar panel into the parameter that controls the mouth. So I'm going to get the solar panel. Are you ready? How are you doing, man? I'm okay, how are you? (makes laughing sound) You're so funny. (electronic music plays) - So to be fair with circuit bending, it's not nearly as popular as it used to be. There aren't a lot of people that do it as much anymore, but you are over here doing the absolute most that you could possibly do with circuit bending and doing these gigantic projects. - Yeah, yeah. I feel it's evolved a bit. The kind of people that did circuit bending are into building, like, modular synths now and stuff like that. The problem with modern toys is they're not as hackable as the old ones. However, you can still hack them, but they require a different way to do it, and it's not usually as obvious. But I love it, and I just, I'm trying to take it to different levels. And like right now I'm trying to take existing projects that I've had in my head and just make them larger. - But why? When everything has evolved so that you do it on a laptop and there are digital replications of most hardware instruments that are out there- - Yeah. - Why put in all the effort and time and money into creating things like this? - That is so tough. I mean, the only answer I have is, why not, I guess? I'm just deeply curious. - Do you make music at all digitally at this point or are you really committed to just using hardware? - I think it would be crazy to just do hardware. I mean, like, computers are very enabling for people. I do a lot of work with other artists and I tend to be stuck in front of a computer for that stuff anyway. I shot myself in the foot with the name, like, Look Mum No Computer. I can't really use a computer, but at the same time, whatever. I make the rules, I make the rules for my projects, so you can't tell me if I can use a computer or not because I made the name. (laughs) - Tech and music runs the gamut from futuristic technologies, like AI on one hand, to circuit bending old electronics on the other. Circuit bending has fallen out of style a little bit but that doesn't mean that it hasn't continued to evolve and progress. Creativity doesn't require new technology, but rather a new way of looking at the things that you already have. (light music plays) This video is presented by Aloft Hotels: Different. By Design. If you enjoyed this, please subscribe to our YouTube channel.",
    "transcript_keywords": [
        "circuit bending",
        "Yeah",
        "circuit",
        "bending",
        "make",
        "electronics",
        "Sam",
        "people",
        "Furbies",
        "Computer",
        "lot",
        "instruments",
        "bit",
        "evolved",
        "stuff",
        "Sam Battle",
        "things",
        "miss",
        "anymore",
        "find"
    ],
    "transcript_entity_values": [
        "44",
        "one",
        "Sam",
        "Gordon Ramsey",
        "Trent Reznor",
        "about 10 years",
        "Cosmo",
        "Furby",
        "Casper Electronics",
        "AI",
        "Danny Elfman",
        "Nine Inch Nails",
        "Aloft Hotels: Different",
        "about a year",
        "Peter Edwards",
        "Look Mum No Computer",
        "Design",
        "about two weeks",
        "two",
        "Larry",
        "Dani",
        "70",
        "Sam Battle",
        "seven years",
        "YouTube",
        "Beck",
        "Furbies",
        "Margate",
        "Furbies"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "PRODUCT"
    ],
    "vector": [
        -0.09110726416110992,
        -0.012908721342682838,
        0.051436349749565125,
        -0.0719214454293251,
        -0.1408294290304184,
        -0.016941308975219727,
        0.023470701649785042,
        0.06024501100182533,
        -0.03994448482990265,
        0.06182171404361725,
        -0.01403702050447464,
        -0.007112435065209866,
        -0.01247338391840458,
        -0.033677052706480026,
        0.022188255563378334,
        0.05322158709168434,
        0.017535420134663582,
        0.02113908715546131,
        -0.009323290549218655,
        0.030286449939012527,
        0.012456484138965607,
        -0.02519991435110569,
        -0.01432092860341072,
        -0.011011398397386074,
        -0.059287019073963165,
        0.08542004972696304,
        -0.021668119356036186,
        -0.023220589384436607,
        -0.020233074203133583,
        -0.05910990387201309,
        -0.01472325436770916,
        0.06390408426523209,
        -0.03140776604413986,
        0.01992129720747471,
        -0.08995404839515686,
        -0.0089107109233737,
        0.026247402653098106,
        -0.040790267288684845,
        -0.03482312709093094,
        -0.028583666309714317,
        -0.055491626262664795,
        0.038619160652160645,
        0.05546463280916214,
        -0.04478411376476288,
        -0.017114832997322083,
        -0.05066678300499916,
        0.004964484833180904,
        -0.1617332249879837,
        -0.04132784157991409,
        -0.07555986195802689,
        -0.020851077511906624,
        -0.0527922660112381,
        0.15231646597385406,
        0.07984620332717896,
        -0.038332197815179825,
        0.002921106992289424,
        0.07768864929676056,
        0.06118245795369148,
        0.054908234626054764,
        0.06870156526565552,
        0.005182303953915834,
        -0.0065171075984835625,
        0.04530520364642143,
        0.007504291366785765,
        -0.01191150862723589,
        -0.04269709065556526,
        0.04987534508109093,
        0.020478270947933197,
        0.011503012850880623,
        0.01683664135634899,
        0.025588933378458023,
        -0.024913782253861427,
        0.002692511072382331,
        -0.038932036608457565,
        0.13470783829689026,
        0.04014833644032478,
        -0.002102019265294075,
        0.016898075118660927,
        0.01596500352025032,
        -0.018715068697929382,
        0.0005534040392376482,
        -0.03763217478990555,
        -0.04585426673293114,
        -0.03672700375318527,
        0.008183623664081097,
        0.01716628298163414,
        0.023710018023848534,
        -0.06916157901287079,
        -0.05010680854320526,
        -0.0042847199365496635,
        -0.045104432851076126,
        0.03525518625974655,
        -0.012323547154664993,
        -0.006261761765927076,
        -0.0028515844605863094,
        -0.09939464181661606,
        -0.007792043965309858,
        -0.01484187226742506,
        -0.011131299659609795,
        0.04644775390625,
        -0.0411720871925354,
        0.06102319061756134,
        0.10121262073516846,
        -0.03119133785367012,
        -0.02860790491104126,
        -0.03840823099017143,
        -0.034555986523628235,
        0.06888294219970703,
        0.03672977164387703,
        -0.07650773972272873,
        -0.030466925352811813,
        -0.003601777832955122,
        -0.0341440886259079,
        0.034059472382068634,
        0.04695933684706688,
        -0.02261032909154892,
        -0.0250155720859766,
        0.012775084003806114,
        -0.02265470288693905,
        0.033002376556396484,
        0.037255022674798965,
        0.036227598786354065,
        -0.062476128339767456,
        0.05141080915927887,
        0.06992937624454498,
        0.05693863704800606,
        -0.06010552495718002,
        1.886868083438419e-33,
        0.06631999462842941,
        0.07862921059131622,
        -0.024100884795188904,
        -0.062225356698036194,
        0.0921328216791153,
        -0.05216081440448761,
        -0.04144405946135521,
        0.03087770566344261,
        -0.058428727090358734,
        0.047151755541563034,
        -0.006673369091004133,
        0.08977427333593369,
        -0.0029273158870637417,
        -0.06600217521190643,
        0.07958245277404785,
        -0.12071782350540161,
        -0.05579055845737457,
        -0.05650509521365166,
        0.01825324445962906,
        -0.01676379330456257,
        -0.047229278832674026,
        -0.017551500350236893,
        0.02832336165010929,
        0.013344395905733109,
        0.06030590459704399,
        0.049872495234012604,
        0.02570440247654915,
        -0.04161296784877777,
        0.035675179213285446,
        0.019855210557579994,
        -0.08679284155368805,
        -0.018906494602560997,
        -0.04692726209759712,
        -0.026253366842865944,
        -0.024067187681794167,
        0.03853045403957367,
        -0.005752143915742636,
        -0.07616692781448364,
        -0.03473294526338577,
        0.01308117713779211,
        -0.0022549510467797518,
        -0.05599038302898407,
        -0.02520124241709709,
        0.057571906596422195,
        -0.05875588580965996,
        -0.024703068658709526,
        -0.019000403583049774,
        0.04856675863265991,
        0.03529103100299835,
        -0.014599001966416836,
        -0.040438443422317505,
        0.031954023987054825,
        0.06777510792016983,
        0.020578408613801003,
        0.03204035758972168,
        -0.011167802847921848,
        0.033253807574510574,
        -0.07733673602342606,
        -0.00245124869979918,
        0.05595563352108002,
        0.1060984879732132,
        0.06069234758615494,
        -0.001997467363253236,
        -0.042416445910930634,
        -0.05736302211880684,
        -0.019606025889515877,
        0.07549861818552017,
        0.013912038877606392,
        0.03498731926083565,
        -0.03167872130870819,
        -0.10158101469278336,
        -0.0015274184988811612,
        -0.027973493561148643,
        -0.05345800891518593,
        -0.03809131681919098,
        -0.00527126295492053,
        -0.0374394990503788,
        0.03282897546887398,
        -0.005391534883528948,
        -0.057930391281843185,
        -0.023086823523044586,
        -0.01117008924484253,
        -0.025837436318397522,
        0.03632042184472084,
        0.01454154122620821,
        -0.038954757153987885,
        0.0376792848110199,
        -0.10776271671056747,
        -0.11617575585842133,
        0.03296411409974098,
        -0.05618743970990181,
        -0.036328285932540894,
        0.011431115679442883,
        0.0085251210257411,
        0.011970603838562965,
        -2.5649332652690392e-33,
        -0.012954932637512684,
        -0.029999863356351852,
        -0.010492660105228424,
        0.0720735490322113,
        0.06062817946076393,
        0.0035576403606683016,
        0.017738575115799904,
        -0.0246761292219162,
        0.013210742734372616,
        -0.03462843969464302,
        0.04282931983470917,
        -0.01937275007367134,
        0.020837673917412758,
        -0.07937882840633392,
        0.04244009777903557,
        -0.05173555016517639,
        -0.08274679630994797,
        0.0286658126860857,
        0.0999625101685524,
        -0.02546522207558155,
        0.032787077128887177,
        7.122616079868749e-05,
        -0.047217462211847305,
        -0.03391547501087189,
        -0.01162466686218977,
        0.04384133964776993,
        0.018002167344093323,
        0.02271270751953125,
        0.06171296164393425,
        -0.000899347651284188,
        0.07153904438018799,
        -0.04521893709897995,
        -0.02531641721725464,
        -0.03302287682890892,
        0.0029592132195830345,
        0.08546587079763412,
        0.04889880493283272,
        -0.014047838747501373,
        0.003387863514944911,
        -0.1944517344236374,
        0.00762261962518096,
        0.07356547564268112,
        -0.029071077704429626,
        0.14039786159992218,
        -0.07586494088172913,
        -0.004959939979016781,
        -0.049325551837682724,
        0.06341476738452911,
        -0.04257890209555626,
        0.017444293946027756,
        0.07219789177179337,
        0.031682614237070084,
        0.024042565375566483,
        -0.07717221975326538,
        -0.11049231141805649,
        0.03252081200480461,
        0.02213183604180813,
        -0.06470289081335068,
        -0.030464570969343185,
        0.06054145470261574,
        0.011265966109931469,
        -0.00632450683042407,
        -0.014644297771155834,
        0.012062535621225834,
        -0.0595996230840683,
        -0.020181220024824142,
        0.05694853886961937,
        0.021940134465694427,
        0.0659022256731987,
        -0.020125024020671844,
        0.12829908728599548,
        0.14970731735229492,
        0.04335879534482956,
        -0.02720118686556816,
        -0.028742479160428047,
        0.037313081324100494,
        -0.04886821284890175,
        -0.09190821647644043,
        0.0090649938210845,
        -0.03238651901483536,
        0.06189445033669472,
        -0.0038084336556494236,
        0.02748177945613861,
        0.01606071926653385,
        0.013786149211227894,
        0.005653398111462593,
        0.003249485744163394,
        0.09955417364835739,
        -0.0640529915690422,
        0.039955127984285355,
        0.033975448459386826,
        0.05670396611094475,
        -0.002745486330240965,
        0.09704936295747757,
        0.0033740540966391563,
        -5.5060485948388305e-08,
        -0.00266784755513072,
        0.02002876065671444,
        -0.043403368443250656,
        0.007602763827890158,
        0.09274084120988846,
        0.03857339546084404,
        0.0319911427795887,
        -0.05455487594008446,
        -0.12958668172359467,
        -0.033424366265535355,
        0.03169379383325577,
        -0.027042504400014877,
        0.009297731332480907,
        0.0688573569059372,
        0.04717733711004257,
        0.08265072852373123,
        -0.001341089140623808,
        0.0920259952545166,
        -0.062062859535217285,
        0.07836935669183731,
        -0.04219372197985649,
        -0.01920601725578308,
        0.04143674299120903,
        -0.011231502518057823,
        -0.0066475397907197475,
        -0.015152187086641788,
        -0.07452590763568878,
        0.04633203521370888,
        -0.029426271095871925,
        0.03302675485610962,
        -0.01924729347229004,
        0.01033012941479683,
        -0.01950431428849697,
        0.019560178741812706,
        0.046453796327114105,
        -0.06967990100383759,
        -0.09002193063497543,
        -0.033029790967702866,
        -0.03303038328886032,
        0.014162861742079258,
        -0.030613120645284653,
        -0.0111957136541605,
        -0.020740557461977005,
        0.05482276901602745,
        -0.02633039467036724,
        -0.04422011971473694,
        0.01050530280917883,
        -0.11228743940591812,
        0.002591836964711547,
        0.11571372300386429,
        -0.04804949834942818,
        -0.016361093148589134,
        -0.02945609949529171,
        0.06346912682056427,
        0.0099678048864007,
        0.09377262741327286,
        -0.01417887955904007,
        0.026036499068140984,
        -0.060437895357608795,
        0.051185350865125656,
        -0.07612454891204834,
        -0.00040172014269046485,
        0.07888338714838028,
        0.0529707632958889
    ]
}