{
    "id": "4je3MQntfdo",
    "title": "This Chromebook thinks it’s for gamers - Acer Chromebook 516GE",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-12-10T21:00:36Z",
    "video_url": "https://www.youtube.com/watch?v=4je3MQntfdo",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "chromebook",
        "gaming",
        "nvidia",
        "geforce now",
        "xbox games pass",
        "game pass",
        "streaming",
        "stream",
        "chromeos",
        "steam"
    ],
    "views": 590523,
    "likes": 19646,
    "comments_count": 896,
    "description": "Save $25 with our offer code shortcircuit at   Chromebooks are known for being cheap and straightforward laptops meant for offices, schools, and basic use, but that's about to change with Acer's new gamer-focused Chromebooks meant for game streaming apps. Does Adam think it makes sense, or should you just stick to playing Fortnite on your phone?   Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Gaming? 0:30 Unboxing 0:50 Design and IO overview 2:23 Sponsor - Vessi 2:57 Keyboard impressions 3:34 Display quality 4:24 Speaker test 5:13 Webcam impressions and other specs 6:04 Potential ways to game 7:05 Some downsides to gaming on this 7:52 Playing Cyberpunk 2077 8:43 Gaming impressions and thoughts on price 9:48 Who should buy a Chromebook? 10:47 Overall thoughts 11:43 Outro",
    "description_links": [
        "http://Vessi.com/shortcircuit",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- So you like gaming, but you don't like it that much. Which is why Asus and Acer have developed gaming Chromebooks. The operating system that you're pretty sure was designed to not let you do anything other than browse the web. Now lets you game apparently? We're not gonna cover the Asus one, but just so you know, there's more, there's multiples of these now. Wait, Asus has one. It's called the... Asus got one, and (chuckles), but the one we're interested in looking at today is from Acer, the company that everyone confuses for Asus, including me. Inside the box we got, it's a charger with every possible piece of verification and certification you could ever want. 65 watts which is plenty for a Chromebook. Chromebooks don't usually come with so much power in them. That means that they get super great battery life. This is huge. This is a big Chromebook. It's got little two-tone sheen to it, brushed aluminum. The bottom is plastic. USB-A, full-sized HDMI, love it. A USB-C, I believe it's 3.2 Gen 2 of high two. An Ethernet, oh, that's really nice, we got an Ethernet jack, headphone and microphone combo jack, and a battery charge light. That's pretty big. Chromebooks are usually more focused on portability. It's also quite thick which is interesting because while it is a gaming Chromebook, you can't really play all that many games on Chromebook, so the main thing that this does is it's gonna be really, really good at game streaming. Why you need a gaming Chromebook for game streaming? I don't know. Why can't you just use like a normal Chromebook and stream games? Build quality is, it feels pretty good. It feels quite sturdy, it's big. Deck flex, we got, I mean it's kinda, I gotta really push on it. So far I'm really impressed. It does have a plastic frame up here. Screen flex, that's pretty good for how thin it is. So when I open it, you see they have these little rubber feet back here. So when I pull this back far enough it props up the laptop a little bit, allowing you to get a little bit more airflow, keeping things a lot cooler. We've got nice big speaker grills, but that means nothing as to how good the speakers sound. We'll take a look at that. Wait what? Four times force-canceling speakers. What the hell is force-canceling? What is force- What? (upbeat music) Do you know what I do know? There's a pair of shoes out there that's water-canceling. And they just sponsored this video. Vessi. Thanks for Vessi footwear for sponsoring this video. Vessi footwear is known for being lightweight, comfortable, and most importantly water resistant with its Dyma-tex technology. And also it's easy to pack because you can just smoosh 'em down flat. They're all fabric. Their everyday move line is designed with added support at the mid sole and better breathability to keep up with your active lifestyle and sweaty feet. Take them off and put them on with ease thanks to the handy pull tab. And it's also made creature free so every step you take will be free of guilt Your feet will thank you for wearing these. So say goodbye to wet socks and hello to $25 off with you offer code shortcircuit at www.vessi.com/shortcircuit. So the nice part about the gaming Chromebook is that it has the WASD keys highlighted for you so you never forget which keys you need to press when you're playing games. Interesting that they still make you use the search key instead of the caps locks key because if you're like me caps lock is essential for gaming. Also the up key is highlighted? Up and down is highlighted. It's weird why they highlighted some keys and not others. And how does it feel to type on it? It's fine it feels a little mushy it's not super clicky. Bottoming out feels just kind of unsatisfying. It's almost like it's settling into like a foam or something. They're not advertising it as a mechanical keyboard so it's probably just membrane. So not so bad. I also think that they font's pretty classy. I like the lowercase font. It's 2560 by 1600 which means it's a 16x10 display so you get a little bit more of a vertical resolution which typically is reserved for productivity stuff. That might be a little weird. Some games don't support 16x10. It 120 hertz which is great. High refresh rate, it's gaming. I don't think you'll be able to find that on any Chromebooks outside of the gaming oeuvre. It looks okay just from staring at it in the menus but we're gonna watch some videos that I've looked at before to see how it looks. And yes I know it's YouTube. It's compression it's not the best test. If it looks good enough to watch YouTube then it's a good Chromebook. It looks pretty good. I've seen better looking displays. Nothing's terribly blown out colors seems relatively calibrated. This is obviously just a glance. It's not the darkest black you'll see but it is an IPS display so it's a solid white backlight. Now let's listen to Crab Rave. Let's see how the speakers are going. Okay. Already it sounds really bad (laughs). Just hearing that water. (Music plays) Okay it's louder right now. (Music continues) It completely lacks any significant bass response. When we were playing it all you could hear was like a took took took took. They do get loud though, which is good. And they didn't sound too distorted. (Music continues) They don't get any worse when you're playing them really loud. They just kind of sound bad across the whole volume spectrum. At least it's consistent and it doesn't get super distorted. Of course they have DTS certification because you can just slap that on anything. It's a meaningless badge. Looking at the quality it looks about as good as I would expect from a $650 laptop. Which means that the webcam quality is not great. The microphone quality though? I haven't heard it yet, so let me know what it sounds like. (upbeat music) So inside this we have a Intel Core i5-1240P which is 12 cores, four performance cores eight E cores so a maximum of 16 threads. Good CPU for a Chromebook. That's a lot of horsepower actually. Max Turbo 4.4 gigahertz. That's a beefy CPU for what is considered a lightweight platform. We also got eight gigs of RAM which is, I don't wanna say it's par for the course for a Chromebook but it's the new standard for Chromebooks. So you'll see Chromebooks on the low end having around four gigabytes a lot of the time. We've got 256 gigabytes of NVMe storage which is a lot for a Chromebook. Chromebooks are famous for having like 64 gigabytes so 256 of NVMe PCIE is great for all the programs that I guess you're gonna have loaded on here, which I don't expect to be a ton. But remember, just because we're talking about game streaming doesn't mean you can't install Linux using the Linux subsystem. I actually just did it while we were talking earlier. I don't know what the status of it is. Steam will be running natively on Chromebooks soon. It just runs all of the games through the Linux implementation on the system but soon you'll be really thankful that you have 256 gigs of storage so that you can actually keep some games on here and have them running. But let's talk about game streaming. That's the main claim to fame. That's why you have the 2.5 Gigabit Ethernet or the 120 hertz display, it's all about the game streaming. I also appreciate that they have the full size HDMI. A lot of laptops will forgo the full size HDMI and make you use a dongle. But if you're gonna use this as like, maybe this is your gaming laptop maybe this is your only computer being able to plug it into a display that you have is awesome. I don't know that you can hear it. You can't really. But this thing is like just not even sweating and it is doing a screen capture. Oof we are full up on memory and I only got- I can close this YouTube app. Even with game streaming eight gigs is not a lot and especially if you know if you do decide to play games locally you might be hurting. Oh that's kind of an interesting caveat I never thought about. If you're using like a gaming peripheral, say you have your setting stored and it's in the cloud because that's how so many stupid gaming peripherals work. You don't have local storage on your mouse, you're not gonna be able to configure it because they're not gonna have a Chrome OS app. That's kind of something that you don't really think about until you start using it. Because then you go oh wait, if my mouse requires software to be configured, then I'm not gonna be able to do that on here. I'm gonna be stuck with the default settings and the default DPI settings. See here's the thing. I don't know if I have to change this in like the Gforce Now settings, Gforce Now is only outputting at 16x9. Yeah this is not using the full refresher to the display I don't think. This is just streaming it. However, it is whisper quiet. It projecting two hours of battery life which is, it's a lot more than you would get playing Cyberpunk on your actual laptop oh my god. Excuse me I'm doing illegal stuff. The cool kind of illegal stuff. - [Jonathan] Does the gaming Chromebook have a graphics card? - No it doesn't it just uses Intel Xe Graphics which is actually a good question that we should have not just brushed over earlier. Despite the fact that this is a gaming Chromebook it has no graphics card. It is just integrated graphics which I guess that's the Chromebook part of it huh? But again we're not doing- this isn't really being pitched or sold as a local gaming beast. It's being pitched as a Chromebook that also games because it has RGB and because it has a fast refresh rate that you can't take advantage of because I don't think there's any service that streams in 120 frames per second. I just played a little bit of Cyberpunk and most of all it felt like I was playing a game on a game streaming service. Which you can do on like an Apple TV. You can do it on your smart TV and your smart TV definitely has a worse processor. However your smart TV isn't a laptop. This you get a whole (bleep) laptop. And here's the thing, the price is $650, which is actually pretty good for what you're getting. But if I'm going against other gaming computers let's look at the MSI GF63, that's got an Intel i510 10300H a worse processor than this. It's got the same amount of storage, the same amount of RAM, it's smaller, but it does have a 1650. A GTX 1650 mobile GPU. It's not really that much better. What about this Lenovo IdeaPad? It's in line with PCs that are in the same price range. So here's the thing, the price point of 650, is that a fair price for the specs that you're getting? Things will go on sale like currently it cyber Monday when we're recording this, and there's a lot of higher spec laptops that are available at a very similar price that are Windows laptops. My word of advice for a long time was that if you are planning to spend more than $500 on a laptop go Windows, don't worry about Chromebooks. If you're spending less than that that's the category where the Chromebook becomes really really compelling is under $500. If you're looking for a machine that's under $500 what are you really doing on it? You're browsing the web, you're voice chatting with people. You're not doing heavy stuff. Chrome OS is really great in that budget segment. When you push beyond that that's when you start getting competing with actually competent laptops. It's gonna be better than the integrated graphics on the pros despite the fact this comes with a great CPU and Iris XE graphics are pretty good for built in graphics. I am interested to see what Chromebooks are looking like with similar specs around this price point. Corei3 eight gigabytes and 120 gigabytes of storage for 800 bucks, bad. Yes this is the Asus one, it's got a Ryzen 5 in it. Eight gigabytes of RAM, 64 gigabytes of storage that's it, that's it, that's all you got. It do have a little number pad though. 650 is actually a pretty competitive price if you ask me. You have to be really certain that you want to deal with a lot of the issues of Chrome OS like low game availability. You might be missing some of your very useful apps like think about this, do you use discord? You'll only be able to use the web app in this right now. I think you might be able to use the android version on here but then you're dealing with emulation, it gets a little bit wonky. Until Chrome OS can develop and add more of those native apps to the operating system, like Steam that's coming up. Having Steam directly on the hardware is gonna make your life so much better. It's hard to recommend this at 650. Do I think it's cool and I think it's kind of a step in the right direction for Chrome OS becoming a more versatile operating system? Is that what Chrome OS should be? If for some reason you're like yes, I would love to game but I need to be on Chrome OS this is actually, it's a great price it's a great product. The big question as with all Chromebooks is is Chrome OS right for you? But do you know what would be right for you? Subscribing to Short Circuit. Thanks for watching. If you liked this video, maybe you should mosey on over to our channel LTT and take a look at some of the videos I've done on Chromebooks over there.",
    "transcript_keywords": [
        "Chromebook",
        "gaming Chromebook",
        "gaming",
        "game streaming",
        "good",
        "game",
        "Asus",
        "pretty good",
        "Chrome",
        "developed gaming Chromebooks",
        "games",
        "pretty",
        "lot",
        "good Chromebook",
        "great",
        "streaming",
        "price",
        "laptop",
        "graphics",
        "kind"
    ],
    "transcript_entity_values": [
        "Crab Rave",
        "800 bucks",
        "Lenovo",
        "3.2",
        "Chromebooks",
        "Intel",
        "Linux",
        "RAM",
        "WASD",
        "Chromebook",
        "2560",
        "650",
        "120 gigabytes",
        "Gforce Now",
        "Intel Core",
        "Dyma-tex",
        "25",
        "65 watts",
        "Ethernet jack",
        "1650",
        "Windows",
        "Eight gigabytes",
        "256 gigabytes",
        "second",
        "10300H",
        "eight gigabytes",
        "LTT",
        "Four",
        "Acer",
        "today",
        "120 hertz",
        "650",
        "Apple TV",
        "Chromebooks",
        "two hours",
        "Linux",
        "Chrome",
        "Iris XE",
        "more than $500",
        "256",
        "Asus",
        "16",
        "around four gigabytes",
        "two",
        "PCIE",
        "2.5",
        "120",
        "HDMI",
        "Intel Xe Graphics",
        "MSI",
        "four",
        "GTX 1650",
        "GPU",
        "Monday",
        "USB-A",
        "Short Circuit",
        "USB-C",
        "16x10",
        "12",
        "Max Turbo",
        "RGB",
        "CPU",
        "under $500",
        "YouTube",
        "2",
        "64 gigabytes",
        "eight",
        "16x10",
        "Vessi",
        "Jonathan",
        "1600"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "CARDINAL",
        "LOC",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORG",
        "TIME",
        "GPE",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.06711354851722717,
        -0.0017380835488438606,
        -0.010573075152933598,
        -0.057804834097623825,
        0.0954984799027443,
        0.042667046189308167,
        -0.046442270278930664,
        0.03282241150736809,
        0.010833579115569592,
        -0.027387000620365143,
        -0.009906367398798466,
        -0.03167048096656799,
        -0.04282412305474281,
        -0.0664752945303917,
        0.0664018765091896,
        -0.010993879288434982,
        0.04101806506514549,
        -0.06946457177400589,
        0.01595650240778923,
        -0.004272362682968378,
        -0.07466846704483032,
        -0.0721559152007103,
        -0.05360989645123482,
        -0.0447935126721859,
        0.028881944715976715,
        -0.018220793455839157,
        -0.008038456551730633,
        -0.019930073991417885,
        -0.03610794618725777,
        -0.021046223118901253,
        0.042942408472299576,
        0.038538672029972076,
        -0.02378673292696476,
        0.01329391822218895,
        -0.0360373929142952,
        -0.06318674236536026,
        -0.0661398321390152,
        -0.04345139488577843,
        -0.10124193131923676,
        -0.0408712737262249,
        -0.008833909407258034,
        -0.05903080478310585,
        -0.007548635825514793,
        0.008350574411451817,
        -0.019733382388949394,
        -0.0564495250582695,
        -0.0425751656293869,
        -0.014875596389174461,
        0.042768046259880066,
        0.03799726068973541,
        0.02191746234893799,
        -0.04623299837112427,
        -0.04909438267350197,
        -0.018394529819488525,
        -0.07173056900501251,
        0.03890271484851837,
        -0.02250640280544758,
        -0.03622061386704445,
        0.09476496279239655,
        0.04314852133393288,
        0.0721634179353714,
        -0.04881572723388672,
        -0.013060646131634712,
        0.08099020272493362,
        -0.0037274030037224293,
        0.008931295946240425,
        -0.043317072093486786,
        0.055580634623765945,
        -0.07371428608894348,
        0.021126728504896164,
        0.01431593019515276,
        0.05291925370693207,
        0.018258793279528618,
        0.050167832523584366,
        -0.011848886497318745,
        -0.10196834802627563,
        0.028009407222270966,
        0.032170042395591736,
        0.006390934810042381,
        0.04565073549747467,
        -0.01998785324394703,
        -0.037850119173526764,
        0.009352544322609901,
        -0.00025183302932418883,
        0.0322975255548954,
        0.013641280122101307,
        0.035249315202236176,
        -0.04475424811244011,
        -0.048504989594221115,
        -0.06574535369873047,
        -0.049880191683769226,
        0.044007714837789536,
        0.07529329508543015,
        0.04285701736807823,
        -0.0717151015996933,
        -0.017689166590571404,
        0.016260342672467232,
        -0.037029363214969635,
        -0.1168961301445961,
        0.04197896644473076,
        0.017559995874762535,
        0.0976138710975647,
        0.06739089637994766,
        -0.05579569935798645,
        -0.039311110973358154,
        -0.06859773397445679,
        0.026421543210744858,
        0.09854498505592346,
        0.05689729377627373,
        0.02347438782453537,
        -0.03985222429037094,
        0.005875698756426573,
        -0.05075632408261299,
        -0.06759562343358994,
        -0.03528093174099922,
        0.07655122131109238,
        -0.05307531729340553,
        0.01067016739398241,
        0.20486044883728027,
        0.10777388513088226,
        0.017013270407915115,
        0.10271061211824417,
        -0.025062361732125282,
        0.01590365171432495,
        0.05908888578414917,
        -0.03604910522699356,
        -0.0272460225969553,
        -1.683928902002536e-33,
        0.004058558028191328,
        0.0007959966897033155,
        -0.014442442916333675,
        -0.09176010638475418,
        0.1261785477399826,
        -0.051999326795339584,
        0.03731027990579605,
        -0.004809633828699589,
        -0.01774248108267784,
        -0.03795969486236572,
        0.014548031613230705,
        0.0726800337433815,
        -0.08754774183034897,
        0.09242376685142517,
        0.041918907314538956,
        -0.012084700167179108,
        -0.034848589450120926,
        -0.014792537316679955,
        -0.046542976051568985,
        -0.038939449936151505,
        -0.025235304608941078,
        -0.09857486188411713,
        -0.025151710957288742,
        -0.057293232530355453,
        0.0013410059036687016,
        0.051547903567552567,
        -0.033477503806352615,
        0.013204042799770832,
        0.019263504073023796,
        0.0592871718108654,
        -0.11271799355745316,
        -0.0638987123966217,
        -0.08266916871070862,
        -0.1368400603532791,
        0.042187996208667755,
        0.012725329957902431,
        -0.027499275282025337,
        -0.05612519755959511,
        0.02318788319826126,
        0.009509698487818241,
        -0.027069056406617165,
        -0.05197916552424431,
        -0.09690981358289719,
        -0.04615733399987221,
        -0.024055378511548042,
        -0.013090891763567924,
        0.07798435539007187,
        -0.019588574767112732,
        -0.016156664118170738,
        -0.013534813188016415,
        -0.09118033945560455,
        -0.030437558889389038,
        -0.04481612518429756,
        -0.05329267680644989,
        -0.041068173944950104,
        -0.12151916325092316,
        -0.026972608640789986,
        -0.014655661769211292,
        0.00025588972494006157,
        -0.010685565881431103,
        0.023875398561358452,
        0.02057122066617012,
        0.010897014290094376,
        0.04069692641496658,
        -0.10743309557437897,
        0.029160667210817337,
        0.038158804178237915,
        0.04876181483268738,
        -0.08342275023460388,
        -0.06871385872364044,
        -0.048124611377716064,
        -0.014964978210628033,
        0.13537612557411194,
        -0.020621459931135178,
        -0.02599489875137806,
        0.03288644552230835,
        -0.01600641757249832,
        -0.08503048866987228,
        -0.00701558543369174,
        -0.02453906647861004,
        0.0623844638466835,
        -0.048493433743715286,
        0.044193342328071594,
        0.006473551504313946,
        -0.058568380773067474,
        0.016816340386867523,
        0.048206984996795654,
        -0.07793872803449631,
        -0.07532619684934616,
        0.0785326361656189,
        -0.08898437768220901,
        0.053543560206890106,
        -0.01976325362920761,
        -0.011570604518055916,
        -0.05717312917113304,
        -3.570328624410549e-33,
        -0.08784496039152145,
        0.009593704715371132,
        -0.07472574710845947,
        -0.0016695859376341105,
        0.031793128699064255,
        0.0844043716788292,
        0.04617251455783844,
        0.047498781234025955,
        0.03737745061516762,
        -0.012337763793766499,
        -0.06875308603048325,
        0.02216559648513794,
        -0.12538142502307892,
        -0.031359393149614334,
        0.028174269944429398,
        -0.06289943307638168,
        -0.014888541772961617,
        -0.05628817155957222,
        -0.026817578822374344,
        -0.0725301131606102,
        -0.02744867093861103,
        0.00858372263610363,
        0.020121149718761444,
        0.07774646580219269,
        0.10819372534751892,
        -0.023319872096180916,
        -0.00932182278484106,
        0.011432128958404064,
        -0.02920628897845745,
        0.04116032272577286,
        0.021770410239696503,
        -0.013552648946642876,
        0.0017058018129318953,
        0.006675495766103268,
        0.053642190992832184,
        0.005681023001670837,
        0.021817222237586975,
        0.049763426184654236,
        0.02390463463962078,
        0.013065476901829243,
        0.08183985948562622,
        -0.11477480828762054,
        -0.014909747056663036,
        -0.0034716797526925802,
        0.07157482206821442,
        0.04293377697467804,
        0.02057163417339325,
        -0.0603734590113163,
        0.028786437585949898,
        0.008009425364434719,
        0.011716723442077637,
        -0.008461285382509232,
        0.010250766761600971,
        -0.024233734235167503,
        -0.07218284159898758,
        0.006682179868221283,
        -0.034971535205841064,
        0.022758949548006058,
        0.013317005708813667,
        -0.06750068813562393,
        -0.016204828396439552,
        -0.014939332380890846,
        -0.009275168180465698,
        -0.007359993644058704,
        0.03145814314484596,
        -0.03142627701163292,
        0.026975145563483238,
        0.07387524098157883,
        0.0073593994602561,
        0.05095762014389038,
        -0.07985534518957138,
        -0.02232755720615387,
        0.023238450288772583,
        -0.04708230122923851,
        -0.06066836416721344,
        0.05740244686603546,
        0.1219458281993866,
        -0.011606919579207897,
        -0.07606159895658493,
        -0.06342507153749466,
        0.017387785017490387,
        0.026663094758987427,
        0.040911946445703506,
        -0.0607018768787384,
        0.038357075303792953,
        -0.05105394870042801,
        0.00525427982211113,
        -0.03268557786941528,
        -0.08640696108341217,
        0.035521022975444794,
        -0.015788640826940536,
        0.09839632362127304,
        -0.0657929927110672,
        0.034126222133636475,
        -0.03431730717420578,
        -5.2591477839314393e-08,
        0.05768747255206108,
        0.015822073444724083,
        -0.03366358205676079,
        0.05933206155896187,
        -0.025902176275849342,
        0.0033820653334259987,
        0.037009041756391525,
        -0.059448909014463425,
        0.08550439029932022,
        0.0007608903688378632,
        -0.03400108218193054,
        -0.07885979861021042,
        0.02464057318866253,
        0.07597212493419647,
        0.004177644848823547,
        0.08436655253171921,
        0.02747039496898651,
        0.0206350889056921,
        -0.011816360056400299,
        0.039597757160663605,
        0.02310425415635109,
        0.07224845141172409,
        0.05702939257025719,
        -0.018753333017230034,
        0.004934610798954964,
        0.026174088940024376,
        0.022235983982682228,
        0.10543287545442581,
        0.05329754203557968,
        0.006025298498570919,
        -0.04531434550881386,
        0.05309440568089485,
        -0.033990852534770966,
        0.012522474862635136,
        0.04713491350412369,
        -0.04098178446292877,
        0.00010249359183944762,
        0.023317202925682068,
        0.0068290880881249905,
        0.05500296875834465,
        -0.032733380794525146,
        0.054499927908182144,
        -0.03524589538574219,
        -0.015894029289484024,
        -0.002186861354857683,
        -0.006807598751038313,
        -0.013899797573685646,
        -0.05098084732890129,
        0.0779038667678833,
        0.03407023102045059,
        -0.08276329189538956,
        -0.00878282729536295,
        0.028508871793746948,
        0.012195885181427002,
        0.09253609925508499,
        0.050711970776319504,
        -0.03020104207098484,
        -0.01250526588410139,
        -0.013895652256906033,
        0.004951771814376116,
        0.022462045773863792,
        -0.008644457906484604,
        -0.03559470549225807,
        0.11142973601818085
    ]
}