{
    "id": "4TwfM3s2Wdw",
    "title": "HOLY $H!T - The FASTEST CPU on the Planet - AMD EPYC 9654",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-12-14T17:59:30Z",
    "video_url": "https://www.youtube.com/watch?v=4TwfM3s2Wdw",
    "category": "Science & Technology",
    "tags": [
        "AMD",
        "Intel",
        "CPU",
        "Server",
        "Workstation",
        "workstaiton",
        "Rysen",
        "EPIC GENOA",
        "EPYC GENAO",
        "Sapphire rappids",
        "saphire rapids",
        "sapphire rapids",
        "Benchmarking",
        "benchmarks",
        "CPU world record",
        "benchmark world records",
        "fastest cpu"
    ],
    "views": 3528146,
    "likes": 106100,
    "comments_count": 4213,
    "description": "Thanks to Supermicro for sponsoring this video! Check out Supermicro's H13 System Portfolio, powered by AMD EPYC 9004 Series Processors, at   Fun Fact: In a 2-socket server, you need 4 threads pegged at 100% to get 1% CPU utilization.  AMD's new SP5 socket, and HUGE new Epyc Genoa CPUs are crazy! Using Supermicro's servers, we set a bunch of World Records on a bunch of benchmarks. Intel is gonna be sweating, unless their upcoming Sapphire Rapids platform can magically compete. Intel's Raptor Lake CPUs might win against Ryzen in the mainstream, it's a whole different story in the datacenter.  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:03 Socket SP5 Features 4:07 DDR5 ECC 5:26 Expandability 8:32 Power  9:24 Let's Fire This Thing Up 10:14 Hyper vs Cloud Servers 11:21 Put a 4090 \"In\" it 11:39 More Cores, More Problems 13:12 Epyc vs Cinebench 15:17 ycruncher 17:00 Phoronix Tests 19:33 Outro",
    "description_links": [
        "https://geni.us/q3l95Jp",
        "https://linustechtips.com/topic/1473798-the-fastest-cpu-on-the-planet-again/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- This is the fastest C, the fastest CP, fastest CPU on the planet. In the world. In the world. And, why do I feel like this has happened before? It's because AMD keeps doing this. They're all new EPYC Genoa CPUs are available with up to 96 ZEN 4 cores and a single socket. They support up to six terabytes of DDR5 memory, and feature 128 Lanes of PCI Express Gen 5 connectivity. There is quite literally nothing else in the world like it, even the size. It's absolutely monstrous! And this video is sponsored by Supermicro, who provided not one, but two servers, rocking a total of three of these CPUs. How does the math even work out to on that, that that's like almost 300 cores. We've got to break some world records today, ladies and gentlemen. (upbeat music) The first thing that's new about EPYC Genoa, aside from everything, is the socket. Like its predecessors, it uses an LGA style socket, meaning that the pins are built into the motherboard rather than the bottom of the CPU. But unlike its predecessors, it has a whopping, 6,096 pins, necessitating a massive landing pad on the motherboard. And a seven screw hold down mechanism in order to make sure that even contact is made with all those little pins. But they absolutely need them. And the biggest reason they need them is that to keep those 96 cores, fed with data and working efficiently, aside from having 384 megabytes of onboard cache. EPYC Genoa features, a not two, not four, not six, but 12 channel DDR5 memory controlling. Yeah, it only runs at 4,800 mega transfers per second, but it's 12 channels. That is an effective 12 x'ing of the bandwidth of a single module. Hey, we never did the size comparison with an Intel desktop CPU. Check this out! Look at it, like a little baby. We seem to have run into a problem already. I cleaned all the thermal compound off of this, when we disassembled the server earlier and I don't know if we have enough paste in this building. I'm feeling like a like X for extreme. We just used half a tube of thermal paste. You ain't building more than one server with one of these if you got a dual CPU system. On that note, Supermicro who sponsored this video has a whole lineup of EPYC Genoa systems available right at launch. Everything from their CloudDC, workhorse affordable systems, like the one I'm working on right now. All the way up to their Hyper and GPU oriented servers, which are for absolutely zero compromises performance. I mean, can you really say it's a compromise in performance, if you have up to 192 CPU cores, and up to 160 PCIe lanes in a single system? You cannot! Even though AMD has switched to a heat sink actuated socket. So that is to say screwing in the heat sink is what applies enough pressure to the CPU to make contact with the pins. I got to give them credit for still having that tray and that holder to keep it in place, because man, when you install some of the competition CPUs, where they don't have that retention, it is scary. Whoo! Wait, okay, this is bad. CPU just lifted up. Quick note, if it was important to have AMD's previous high performance sockets torqued correctly, it is triply important to have these sockets torqued correctly, because even one screw, slightly over or under tightened, is going to have the CPU sitting like this in the socket. That's going to be a real bad time. You can have everything from memory channels not detected, to flaky PCI Express behavior, to a system that doesn't boot at all. One of the drawbacks of having a 12 channel memory controller is that if you want to get the maximum performance out of your system, you better be ready to install a lot of memory sticks, which isn't to say that you have to use 12. Though, if you want to do less than that, I would strongly recommend checking AMD's documentation, because it is not as simple as, just popping sticks in wherever you want. Oh, this is the first time I've been hands on with a DDR5 server module. Now regular DDR5 has a form of error checking and correction or ECC, but it's only handled at the die level. Whereas a full ECC module, is going to have to have an extra die for every eight, which actually is not how this is configured. These have 10 packages per side. So do they actually have two ECC packages per eight? After a bit of off-camera research, it seems to be related to the way that individual DDR5 memory dies, operate more like two previous generation dies, meaning that instead of needing one chip per group of eight, you need one chip per group of four. So these are fully proper ECC dims that will protect data even when it's in flight. There's some other differences too. Just like consumer DDR5 modules, the power management IC or Pmic is built into the module rather than into the motherboard. But unlike consumer modules, the notch is in a different place, meaning that you won't be able to have a motherboard that will support both, un-buffered and ECC memory, at least as far as I can tell. This is all very, very new at the moment. Before we go too much further and start covering things up, now's the perfect opportunity to talk not just about the performance, but also the flexibility, a platform like EPYC Genoa provides. I mentioned already that each of these CPUs, supports up to 128 lanes of PCI Express Gen five. That means even on a basic server from Supermicro's CloudDC lineup, you are looking at an utterly unbelievable amount of connectivity. In this one alone, we've got dual OCP 3.0 cards, which are typically used for networking. We've got these CXL slots, okay? Each of these running at PCIe Gen five by 16, and CXL is so cool. It uses the same physical connections as PCI Express, but a new protocol that allows you to do wild things, like put a separate memory controller into a slot in your computer, and add a whole bunch more RAM to it. Like, what? And even if you fill all of this stuff up, in a server like this one, that's using three and a half inch bays, you are going to run out of slots, before you're going to run out of PCIe lanes, as you cram the front of it full of SSDs. Now unfortunately, PCI Express Gen five SSDs, haven't hit the market yet, but when they do, things are going to get really cool. Because instead of needing four lanes to get the most out of these SSDs, in non-performance critical applications like say it's more about capacity, you're going to be able to take just two Gen five lanes and get the same performance you would've gotten from four Gen four lanes just one generation ago. And what was really mind blowing for me, thinking about how fast PCI Express Gen five is, a single PCIe Gen five lane, is the same speed as a 16 x slot of PCIe Gen one. Size doesn't matter that much. Yvonne, you're watching this, right? Look, they can't even put full size slots on the board. They just got these 8X, are those 8X? I think they're 8X. And this has applications outside of just storage as well. Say for example, we were going to take this PCIe Gen five by 16 slot right here and plug a, you know, daughter board or mezzanine card into it. We could plug in literally, four PCIe Gen four by eight cards, and have all of them run at full freaking speed. That's wild! Well you need a pretty complex PCIe switch to go back to Gen four and have that full bandwidth, but that's not the point. The point is that outside of storage and networking, almost nothing needs Gen five bandwidth anyway. And you can see Supermicro knows that. So this is just a simple daughter board that is absolutely covered in Gen five lanes. We go from 16, tot he (talking gibberish) to 16 to 80 lanes and they figure this'll probably be fine, and they're probably right. Not that we're doing anything like that with it. We're just using one of these slots for an RJ45 network card, because we don't have a PC build corner wired up with QSFP, which is with the network card that Supermicro sent over with this thing uses. Okay, there's one more thing about this socket that I didn't tell you guys yet. Unlike AMD's previous server socket, SP5 is rated for up to 400 watts, which is like, what I thought, Zen four was more efficient. Well, yeah it is. But we went from up to 64 cores to up to 96 cores. Some concessions had to to be made, and that's why, can I remind you again, this is a CloudDC, like workhorse class server, Supermicro is shipping, 1200 watt redundant power supplies, in a server that's not even designed for GPU use. Spicy, look how long this thing is. Not that it's about length. Yvonne, you're watching this, right? It's not about length - But is it longer than a 4090? - Oh! 4090 for scale. Okay. Let's fire this thing up. We have a lift off! (machine whirring) Now for best possible cooling, we're going to want to put the top cover on this, 'cause otherwise these fans, instead of drawing air across these NBME drives, and blowing it through the CPU heat sink, they're just drawing air from here, and blowing it out here. Also, that's really annoying. That's a little better. Three hours later. No, but in all seriousness, at the moment, EPYC Genoa takes about 10 minutes to boot up. But AMD says they are working on that, so, good. Got to get that memory training going. Hey, hey! We had time to go get monitors, plug them all in, get (laughing) on the network. - And we're only halfway there! - Oh good. (laughing) Since we're still waiting, we might as well take this opportunity to talk about one of Supermicro's Hyper servers. The main difference between CloudDC and Hyper platform servers, is that instead of one CPU with up to 96 cores, you've got up to two CPUs with up to 96 cores. That's right. 192 cores, that's 384 threads, and up to 12 terabytes of DDR5 memory, you've also got, okay, you lose some of the PCIe lanes in CPU to CPU connectivity. So 160 lanes of PCIe Gen five. And that means that whether you want to connect 10 flipping GPU's to one of these things, or many, many additional nodes of storage devices, they have got the horses. (horses whining) One cool thing is that if you're more into compute than expansion, you can configure the CPUs to allocate more of their PCIe lanes to socket to socket communication, leaving you only 128 lanes but, more bandwidth between your sockets. Need, huh? We're going to try and put this in here. Hey, did it finally boot? - Yeah, we're in Windows now. - That was literally over 15 minutes. We need something to put that GPU on 'cause it's sitting a little funky. - What could go wrong? - Huh! Perfect. Holy crap! Is this one CPU? 96 cores! I mean, they only have 1.85 gigahertz right now, but they'll get faster. What we're expecting is somewhere in the range of around 2.4 gigahertz, when all cores are under load, which means, you actually kind of need to think carefully about your application, when picking an EPYC Genoa processor. If you want higher clock speeds, you may not necessarily be better off, with the higher tier, higher core chip. One cool thing, by the way about Supermicros Hyper lineup, that we're not showing off very well, is that compared to CloudDC, they're totally toolless, just pretty nice when you got to work on a hundred of 'em. So how will I use my screwdriver from lttstore.com? We ready? Boom! Well that's a disappointment. JK, JK, JK. I ran it in single core mode. I actually just wanted to see what it would clock to, and it looks like Task manager is not going to give us a useful account of that. So, - I don't think I have hardware info on here. - You don't have HW? - I put it. I focused on the other server. - You focused! - Because I had two of them. - Oh, he focused, he says! - You should be thankful I got it installed. - I should be thankful! (laughing) Hardware info has either crashed or hung both times I've tried to launch it. I'm not blaming them. This is an extremely new platform. I'm just saying, we're not going to know exactly, what frequency that core's running at. Sorry! Here we go! Oh my goodness! Whoa, whoa, whoa, whoa, whoa, whoa buddy! Two times, it's done. That's a 32 core threadripper with that tiny little blue bar. 75,000! And this is, this is one chip. Now that's not that impressive, compared to a threadripper, which obviously will turbo quite a bit higher. But it's just one, it's just one. We can have, two! I think this one's done booting up now. Is it in? Have we hacked the mainframe? - Are we getting the Windows spinny? - Unfortunately our RTX49D experiment did not work. It's not showing up. We did manage to get a Quadro GPU working earlier, but we're not going to break any world records with that. So we're going to focus on CPU performance, for the time being. Starting of course, with Cinebench but now with, two, 96 core CPUs, 384 threads, in two sockets! They completely break the UI. Look at this, you have to scroll. It's full screen, and you have to scroll. - Look at the L3 cache. - Oh shoot! I had level 3 cache on the mind earlier, when I said these things had three quarters of a gig of cache. No, no, they've got almost an entire gigabyte of cache. The 768 megs is just level three. This thing has more cache than my first gaming system had, RAM. We've got a problem. This is only running 256 of our 368 threads. I didn't think about that. But Cinebench actually has a thread count limit. We only got 82,000 points. Now hold on just a gosh darn minute here! Is there a quick and easy way for us to turn off SMT? Oh no, oh my God. - No, we have to reboot. - We have to reboot. We're not rebooting. We're going to find other benchmarks to run. Time to benchmark Pi. For those unfamiliar, y-cruncher calculates Pi, up to, what is this? Two quadrillion decimal places. We have absolutely no idea what we're doing, which is why it'll be so embarrassing, when we're at the top of the leader board. Enter your choice. Benchmark Pi. - One. - Multi-threaded. Okay, so we need two and a half billion. - Seven or nine. - No, we'll do seven. We're going for seven. Let's go. One moment please. Wow, it's done, and the fan's barely even kicked in. Holy crap! 15.783 seconds. Holy crap! This is not just faster. This is like, half the time. And this record was set back in December of 2021. Okay, how do we submit a score? - I have no idea. - We're logged into hardware bot, Linus Tech 6969, and wait what? Invalid data file, what? Unable to encrypt the, what? What? Unable to encrypt, what? It's a text file. - What does it say in the instructions? - Blah, blah, blah, blah, blah, blah. Well, I have no idea. This is not encrypted. You guys saw it. It's fast. This video is prong past Linus. We moved the server over to the server room, and we are remoted into it right now, using Supermicro's Integrated IPMI/KVM. And all we're going to do is click right here. And, ready, ready, wait for it. Bloody hell, where is it? Ah! There it is! Go Team Canada! Not only do we have the record in this, no holds bar competition, but we are holding it by nearly half the time. But one record is not enough for us. That's why, we installed Ubuntu, and fired up the Phoronix Test Suite, where we will be benchmarking. I don't know. Why don't we start with, X 264, bosphorus4k, boop! Winner dinner made of chicken, chickens. (laughing) Here's what we're going for. The number to beat is 75 frames per second average. For this test, we compare results on open benchmarking.org, which isn't a competitive site like hardware bot but it does show us the top result, which was a dual 32 core EPYC system, that managed, 75 frames per second plus or minus two. Where are we at here? 108 frames per second! See you later record, goodbye! Box plot of samples. Old line, new line. Yes, I certainly would like to upload this. Now it's time to take a run at John the Ripper, which is a password cracking benchmark. Recently saved. Enter a name of the results file. Okay, dinner fish winner. Delicious, but fishy. Estimated time to completion. Four minutes. No, unacceptable. Wait! Am I reading this right? 26 million! I would like to upload it though. See you later records! Previous winner. Fish dinner. (laughing) Time to run blender. Let's go classroom. Let's see if we can cause some trouble on their site. Here we go. Estimated time to completion. Two minutes. I doubt it! 19 seconds is the time to beat for classroom. (laughing) Oh crap, my file name was too long. Whoops! Oh crap! I definitely broke some things. (laughing) Wait, 21.9 seconds. Uncool! Uncool! It's not that this system isn't ripping fast, it's just that clearly someone with another dual 96 cores system got here first. Well, it's been a long day. A long day of breaking records now. Feel like it's time to pack it in. Was that three or three or four? Seems, seems pretty good. In conclusion, EPYC Genoa, really fast. Supermicro, really cool hardware for EPYC Genoa. Check 'em out at the link down below. If you guys enjoyed this video, I think I probably recorded one of these before. So let's just cut that back in. If you guys enjoyed this video, you might also enjoy the, maybe more structured platform overview that we did, when AMD announced EPYC Genoa. And you can check that out, here or here, somewhere.",
    "transcript_keywords": [
        "PCI Express Gen",
        "EPYC Genoa",
        "Gen",
        "EPYC Genoa CPUs",
        "CPU",
        "PCIe Gen",
        "Express Gen",
        "PCI Express",
        "EPYC",
        "Genoa",
        "fastest CPU",
        "Lanes",
        "CPUs",
        "time",
        "Supermicro",
        "cores",
        "EPYC Genoa systems",
        "server",
        "PCIe",
        "AMD"
    ],
    "transcript_entity_values": [
        "nine",
        "one",
        "up to six terabytes",
        "EPYC",
        "up to 400 watts",
        "eight",
        "One",
        "Supermicro",
        "1200 watt",
        "zero",
        "over 15 minutes",
        "fed",
        "up to 96",
        "three quarters",
        "seven",
        "GPU",
        "Seven",
        "minus two",
        "nearly half",
        "Task",
        "L3",
        "384",
        "EPYC Genoa",
        "64",
        "Cinebench",
        "21.9 seconds",
        "AMD",
        "EPYC Genoa",
        "82,000",
        "three",
        "PCIe Gen",
        "Two quadrillion decimal",
        "three or",
        "96",
        "December of 2021",
        "Linus",
        "256",
        "Gen five",
        "1.85 gigahertz",
        "half",
        "PCIe Gen one",
        "a long day",
        "Quadro GPU",
        "Two minutes",
        "two and a half billion",
        "first",
        "Four minutes",
        "LGA",
        "32",
        "19 seconds",
        "6,096",
        "only 128",
        "JK",
        "PCIe Gen five",
        "4",
        "Pi",
        "CPU",
        "un",
        "264",
        "six",
        "NBME",
        "around 2.4 gigahertz",
        "Intel",
        "108",
        "192",
        "more than one",
        "UI",
        "Windows",
        "four",
        "DDR5",
        "384 megabytes",
        "up to",
        "a hundred",
        "15.783 seconds",
        "John the Ripper",
        "ECC",
        "about 10 minutes",
        "Gen four",
        "16",
        "five",
        "CP",
        "768",
        "10",
        "3",
        "Phoronix Test Suite",
        "Hyper",
        "12",
        "three and a",
        "two",
        "one generation ago",
        "A long day",
        "75,000",
        "second",
        "160",
        "PCI Express",
        "128",
        "Supermicros Hyper",
        "Two",
        "CXL",
        "Three hours later",
        "4,800",
        "PCI Express Gen 5",
        "16 to 80",
        "Pmic",
        "26 million",
        "Yvonne",
        "75",
        "368",
        "today",
        "almost 300",
        "SMT",
        "4090",
        "PCI Express Gen",
        "Linus Tech 6969",
        "RJ45",
        "Bloody",
        "RAM",
        "up to 160",
        "Gen five",
        "SP5",
        "Windows",
        "QSFP",
        "RTX49D",
        "DDR5",
        "3.0"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "DATE",
        "ORDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "TIME",
        "PERSON",
        "ORG",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.044749803841114044,
        -0.04452994465827942,
        0.004490848630666733,
        -0.03216305002570152,
        0.06491504609584808,
        -0.03025141917169094,
        -0.045210741460323334,
        0.010794262401759624,
        -0.04410230740904808,
        -0.01380612701177597,
        -0.021135859191417694,
        0.0010890342528000474,
        -0.04625957831740379,
        -0.06195760518312454,
        -0.009439595974981785,
        -0.048095718026161194,
        0.15591715276241302,
        -0.07915034890174866,
        -0.0086168572306633,
        -0.022644806653261185,
        -0.014475463889539242,
        -0.08570016920566559,
        0.031018460169434547,
        0.005072145257145166,
        0.10281688719987869,
        0.023914681747555733,
        -0.0345187671482563,
        -0.0069684963673353195,
        -0.021198881790041924,
        0.0008454753551632166,
        0.02985665760934353,
        -0.03158910199999809,
        0.010313277132809162,
        0.00929810106754303,
        -0.00485681276768446,
        -0.02087867446243763,
        0.04175509139895439,
        -0.0972229391336441,
        0.018327942118048668,
        -0.04530370980501175,
        -0.024575429037213326,
        0.010887201875448227,
        0.013381714932620525,
        0.016117120161652565,
        0.015424882061779499,
        -0.011502616107463837,
        0.08127594739198685,
        -0.051789864897727966,
        -0.015461915172636509,
        -0.035724520683288574,
        -0.059959545731544495,
        -0.07524985074996948,
        0.026084942743182182,
        -0.032611310482025146,
        -0.08995556086301804,
        0.11817708611488342,
        -0.01916050910949707,
        -0.07536424696445465,
        0.046073008328676224,
        0.015284531749784946,
        0.01902802661061287,
        -0.1021561250090599,
        0.02408110909163952,
        0.06492090225219727,
        0.045318588614463806,
        0.016507631167769432,
        0.013953378424048424,
        -0.005283217411488295,
        0.047845806926488876,
        -0.028093883767724037,
        0.08395050466060638,
        -0.0188062135130167,
        0.017235983163118362,
        0.058525364845991135,
        -0.0002983493322972208,
        0.034562185406684875,
        0.06468383222818375,
        -0.0702425092458725,
        0.05322093516588211,
        -0.014436495490372181,
        0.025276262313127518,
        -0.052657872438430786,
        0.023059599101543427,
        -0.08755500614643097,
        0.031888265162706375,
        -0.06284661591053009,
        0.053093768656253815,
        0.042895734310150146,
        0.015660982578992844,
        -0.09520135819911957,
        0.11521026492118835,
        0.08215073496103287,
        0.06178288534283638,
        0.006544575560837984,
        0.08035913854837418,
        0.059086501598358154,
        -0.005023445934057236,
        -0.04851725324988365,
        -0.049143899232149124,
        0.03062126226723194,
        0.0021338609512895346,
        0.009293065406382084,
        0.03957497701048851,
        0.02687118388712406,
        -0.006784804631024599,
        0.02289455756545067,
        -0.0004242761933710426,
        0.0932021215558052,
        -0.07297912985086441,
        -0.024965591728687286,
        -0.009056412614881992,
        0.04185200482606888,
        -0.02512688748538494,
        0.04237847030162811,
        -0.015996141359210014,
        -0.0659072995185852,
        -0.0018453436205163598,
        -0.011574323289096355,
        0.034202419221401215,
        0.06213194876909256,
        -0.038686808198690414,
        0.021490436047315598,
        -0.06438631564378738,
        0.03256778046488762,
        0.022469379007816315,
        0.08440340310335159,
        -0.1280677765607834,
        6.549923583074897e-33,
        -0.011726310476660728,
        0.09975598752498627,
        -0.004938882775604725,
        -0.09762420505285263,
        -0.038970816880464554,
        0.03927011787891388,
        -0.03781534358859062,
        -0.02468409761786461,
        0.013070073910057545,
        0.028454309329390526,
        -0.060770947486162186,
        -0.04942559823393822,
        0.00962067674845457,
        0.08525308221578598,
        0.03803369775414467,
        -0.08771997690200806,
        0.022679684683680534,
        -0.03404559567570686,
        0.043117456138134,
        -0.00033246257225982845,
        -0.00446118600666523,
        0.020007848739624023,
        -0.02386743761599064,
        -0.013523702509701252,
        0.04230951890349388,
        -0.020213710144162178,
        0.012722553685307503,
        -0.0539708249270916,
        -0.016257843002676964,
        0.03762952238321304,
        0.003699919441714883,
        -0.1372866928577423,
        -0.04750002175569534,
        0.019277406856417656,
        -0.02221459150314331,
        0.025031104683876038,
        -0.011791466735303402,
        -0.04545467346906662,
        0.011728769168257713,
        0.054232630878686905,
        -0.003876245114952326,
        0.08497664332389832,
        -0.07124212384223938,
        -0.07378675043582916,
        -0.04748198390007019,
        0.026185190305113792,
        -0.10332673788070679,
        0.05452265217900276,
        0.0018948775250464678,
        -0.07486990094184875,
        0.012629400007426739,
        0.01750636287033558,
        -0.04624800756573677,
        0.05783749744296074,
        0.0754186287522316,
        0.03142698109149933,
        0.0445098951458931,
        0.009185170754790306,
        0.13795259594917297,
        0.1736205369234085,
        -0.03370511904358864,
        -0.04427919536828995,
        -0.051690638065338135,
        0.003694794373586774,
        -0.04644058644771576,
        0.006015409715473652,
        0.03267177939414978,
        0.006214734632521868,
        -0.08893882483243942,
        0.015035133808851242,
        -0.02385767735540867,
        -0.06648020446300507,
        0.09105125814676285,
        -0.032998859882354736,
        0.08863384276628494,
        0.06749466806650162,
        -0.022933779284358025,
        -0.10221019387245178,
        -0.048367321491241455,
        -0.03406914323568344,
        -0.10282120108604431,
        0.06317346543073654,
        0.006858227774500847,
        0.015225917100906372,
        0.06774763017892838,
        0.005394744221121073,
        -0.05568241328001022,
        0.06184010952711105,
        0.01689915359020233,
        0.008369133807718754,
        0.04760083928704262,
        -0.024708759039640427,
        0.08408351987600327,
        0.048823483288288116,
        -0.07810507714748383,
        -5.136243220049305e-33,
        -0.005843227729201317,
        -0.06663558632135391,
        0.002215331420302391,
        0.11147094517946243,
        0.04720084369182587,
        -0.009833662770688534,
        0.06030227616429329,
        -0.029785964637994766,
        -0.07947136461734772,
        -0.09759312868118286,
        -0.011004450730979443,
        -0.0745818018913269,
        0.04896984249353409,
        -0.009977460838854313,
        0.03297009319067001,
        -0.001014677225612104,
        -0.0190468467772007,
        -0.06456305086612701,
        0.06806488335132599,
        0.009311634115874767,
        0.04377502575516701,
        -0.0219760499894619,
        0.012514394707977772,
        0.031081683933734894,
        0.012622023932635784,
        0.004191309213638306,
        -0.03780452907085419,
        -0.040716707706451416,
        -0.01975098066031933,
        -0.03542225807905197,
        -0.084791399538517,
        0.00010781528544612229,
        0.019620444625616074,
        0.04288780689239502,
        0.011248384602367878,
        0.1048579141497612,
        0.027424784377217293,
        -0.002441449323669076,
        -0.013350004330277443,
        0.0723712146282196,
        0.03546727076172829,
        0.025832610204815865,
        -0.05229605734348297,
        -0.009649859741330147,
        -0.03345021978020668,
        0.06496819853782654,
        -0.05027445778250694,
        -0.012706325389444828,
        0.06328835338354111,
        0.03154610097408295,
        -0.03658175468444824,
        -0.08162081986665726,
        0.04572592303156853,
        0.0396956242620945,
        0.026082225143909454,
        -0.10747098922729492,
        -0.002410047920420766,
        -0.021142326295375824,
        -0.07279808074235916,
        -0.01746384985744953,
        0.07522650808095932,
        -0.013319037854671478,
        -0.0013310803333297372,
        0.019890833646059036,
        0.06181245669722557,
        -0.05464767664670944,
        0.0116895055398345,
        0.02907688356935978,
        -0.041244011372327805,
        -0.033872369676828384,
        -0.037692032754421234,
        -0.06598299741744995,
        -0.03026563860476017,
        -0.0010681541170924902,
        -0.06096925213932991,
        0.09408282488584518,
        0.00030024503939785063,
        -0.000880945473909378,
        0.018770651891827583,
        -0.009225300513207912,
        -0.05151266232132912,
        0.09129561483860016,
        -0.03536062687635422,
        -0.0231313556432724,
        0.0070483689196407795,
        0.03249227628111839,
        0.05498349666595459,
        -0.06692337989807129,
        0.015989406034350395,
        -0.09275965392589569,
        -0.015560188330709934,
        -0.020859599113464355,
        0.019245315343141556,
        0.011942592449486256,
        0.038240935653448105,
        -5.676068681736979e-08,
        0.09263671934604645,
        -0.04427757486701012,
        0.03773988038301468,
        0.0357641726732254,
        0.0338975265622139,
        -0.015721280127763748,
        -0.0031321386341005564,
        0.025699004530906677,
        0.07589653879404068,
        0.036203768104314804,
        0.07603345811367035,
        -0.08582755923271179,
        0.026563549414277077,
        -0.03809500113129616,
        0.05150042474269867,
        0.061312831938266754,
        -0.018399540334939957,
        0.023038318380713463,
        0.0062250057235360146,
        -0.1178494393825531,
        -0.041382212191820145,
        0.08900586515665054,
        0.05362759530544281,
        -0.05201810225844383,
        -0.06147908419370651,
        -0.03606726974248886,
        0.022424975410103798,
        0.02338721603155136,
        0.03279212489724159,
        -0.010076348669826984,
        -0.13356620073318481,
        -0.055746182799339294,
        0.020660053938627243,
        -0.047148946672677994,
        0.06992886960506439,
        -0.03246400132775307,
        0.008784884586930275,
        0.09343061596155167,
        0.048921775072813034,
        0.02832537703216076,
        -0.03832199424505234,
        -0.021294184029102325,
        -0.023281050845980644,
        -0.03532269224524498,
        0.03198368102312088,
        -0.03666698932647705,
        -0.0151864904910326,
        -0.017282461747527122,
        0.005549096502363682,
        0.030249755829572678,
        -0.0014415577752515674,
        -0.019198577851057053,
        0.0037789493799209595,
        0.052856165915727615,
        0.02878108061850071,
        0.08837732672691345,
        -0.10012047737836838,
        0.006017366424202919,
        -0.05582178011536598,
        0.03145264834165573,
        0.05246971175074577,
        -0.08306625485420227,
        -0.049613676965236664,
        -0.034458719193935394
    ]
}