{
    "id": "4UcsNWz6-C8",
    "title": "Office Tour!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-11-29T19:43:50Z",
    "video_url": "https://www.youtube.com/watch?v=4UcsNWz6-C8",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "LGTV",
        "LG4K",
        "LGtelevision",
        "NewTV",
        "NewLGTV",
        "LatestTV",
        "LGTVmodels",
        "4KSmartTV",
        "Best4KTV",
        "4KTVDeals",
        "4KHD",
        "Best65inchTV",
        "65inchOLED",
        "OLED",
        "OLEDTV",
        "LGOLED",
        "QLEDvsOLED",
        "OLEDvsLED",
        "OLEDvsLCD",
        "OLED4K",
        "BestOLEDTV"
    ],
    "views": 724990,
    "likes": 21777,
    "comments_count": 1270,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Today I'm finally doing a long overdue office tour. This is where I do all of my editing and I've been working on this for a really time. So I'm so excited to show it to you, finally it is almost ready. There is one thing that I've been waiting for to complete this entire look. And here it is, the missing piece. This is the LG OLED 65-inch TV and I'm super excited about this. So we're gonna unbox it, set it up and we'll start this office tour. Matty it's okay. Do you wanna come see? It's a 65-inch OLED, it's your favorite. Wanna give it a sniff? What do you think? Learn about it. No don't learn about me, you already know. Have I cleared the TV? - [Man] Yes. - Okay, oh gosh I'm gonna topple over. What is in here? I think that's the stand, that's definitely the stand. Holy moly. My gosh. Jeez, I am sweating. I should probably find the directions. Look how thin this is. This is so amazing. I mean I've obviously seen the wallpaper TVs before but this is all built in and this is gonna be the new addition. What I'm really excited about is I'll be able to use this to monitor when I'm shooting videos. And also I can now hook up my Xbox to this then play Call of Duty and act like I'm editing when I know I'm not. (laughing) All right, let's put the stand on. So do we need a screwdriver or does it come with one? This is actually really light. I gotta pick up the TV. I can't play with you right now 'cause we gotta take the TV in the office. (casual upbeat music) Come on in. It's finally complete. Guys, I can't believe I finally get to show this to you. I've been working on this office for so long and now officially the final piece of the puzzle is here, the new LG OLED TV. The LG OLED E9 is wallpaper thin with a floating glass bezel screen design. It features OLED self-lighting technology. Each pixel controls their luminance individually. This ensures those perfect blacks for an incredible image. With 4K Cinema HDR, Dolby Vision and Atmos, this is a great TV for movies, Netflix, and of course gaming. It has a one millisecond response time and 12.9 millisecond input lag. So if you're looking to game on a larger screen, this gives you great performance. This has the new Alpha 9 intelligent processor which uses a deep learning AI algorithm to analyze millions of content pieces. This will provide you with the best image and sound. I also love how easy it is that you can AirPlay right from your iPhone, your iPad or your Mac. This column wasn't supposed to be a part of the video but what's happening right now guys is I'm using this TV as a file browser for all of the media that we shot while we're working on this video. This was just supposed to be a B-roll but I feel like I have to share this 'cause this is amazing. (casual uplifting music) Using your voice, you can ask Google Assistant or Alexa built in questions while watching. Conversational AI makes it seem more like we're talking to a person rather than a voice assistant. So you can ask the Google Assistant things like search for Brad Pitt, what was his latest movie? Play it on the screen. Instead of asking for each question separately, you're able to string along a bunch of different commands to get the result you were looking for. So obviously we've talked about the highlight of this room and that's my new LG TV. Well a lot of times I'm shooting by myself but today thankfully Tyler is here helping me shoot this. So this is great for either a setup when I'm shooting myself or if somebody else is helping as well because I'm able to monitor and we can see if we're in focus and I can make sure if I've got some fly-aways or somethin' I can just fix it right up. But it's also good too because if Tyler is controlling the second camera. Come on (mumbles). So he can be basically monitoring the second camera and the main camera at the same time. What do you think of those TVs, right? - [Tyler] Amazing. - I'm so excited. And over here of course I have my router which is in such a terrible place to put it. I'm gonna find a different location for it but for the sake of this video, I didn't have time to find a longer cable to connect it somewhere else. So that's where it is. And this painting behind me is also one of my favorite parts about this room. This was custom painted for me. I commissioned Cory Basil who is an incredible artist. I was wanting something with kind of like an exposed wall but also with a little bit of rose gold and copper kind of put into it. He honestly captured my vision so perfectly and just, it's so great, I love it. It looks so good in this room. The second centerpiece which is actually technically I guess the actual center of the room is this desk. I love Restoration Hardware, so I got this matching desk and matching TV stand. And I really wanted an executive style desk which is one that you can kind of keep in the middle, it doesn't have to be up against the wall. One of the things that I was hoping that this desk would have was a little hole to put the cords in, but for some reason a lot of their desks don't have holes for cables which is so strange. I'm just gonna sacrifice the fact that there are cords hanging off of my desk. This is the 18-core iMac Pro that you guys saw me unbox before, and obviously it has all of the Space Gray accessories. And that white cable is an ethernet cable that hooks up to my Jellyfish server. And the Jellyfish server is what I edit everything off of. So with that, I dump all of my footage onto it and I edit directly onto that. And I could also have other editors connect to the Jellyfish at the same time and be editing off of the server on other projects. So it's really really cool. A lot of times what I will do is I will dump the footage onto the Jellyfish and then since I do travel a lot, I take that footage with me on the go with these drives and these drives I'm just beyond obsessed with. It's been working out really really well. I've also got this Razer microphone, a HomePod and this is a charging mat my Nomad. And on the charging mat I have a pair of AirPods. And these AirPods have one of the Nomad cases on it. It's this really nice leather case. Since I do travel a lot, I'm always traveling with my MacBook, and this is kind of interesting. It definitely looks like trash. But I have Velcro on the back of my MacBook so that I can attach these hard drives to it when I'm editing, because I never want those cords to get knocked out by accident. This is terrible-looking but extremely functional. Hi, Justine from the future. Got my 16-inch MacBook Pro here. When I shot this video originally, this computer wasn't even out yet. We didn't even know if this was gonna be a thing. I mean in rumors we did but realistically didn't know it was real. Isn't it cool? Because now that that this has Catalina installed and I previously had not installed Catalina on any of my machines, I can now use Sidecar 'cause I've been testing it out using my iPad also as an external monitor. But in my current desk setup as you guys will see here. I can take what I have on my iMac and use this massive LG TV as a file browser. So when going through footage, I can be using that as a huge external monitor. I can also use it to preview my videos. This is something that I didn't realize that I needed in my office until I had it and now it is honestly a dream come true. Okay, back to the video. I've just got a bunch of random things in here. Headphones, pens, I obviously needed some black Post-it notes with the silver Sharpies. Hi, I was not messing around. This entire office is just super dark. If I need to take some notes, I have black paper and again I write on it with my silver Sharpie. I love editing here in the daytime because I have mirror to my left which is also from Restoration Hardware and as soon as I saw that thing online I had to quickly for the first time ever measure this little portion of the wall because I was hoping that it would fit, and it does. And it's great because I have a window to my right, so it makes this room feel so much larger than it is. I've got a few carpets here to hide wires. It's not really working that well but it's, I guess a solid attempt to waste. This little chair setup over here, this is all from West Elm and this is basically Matty's chair. The only problem is this chair is kind of a velvety material, so Matty tends to leave his little paw prints all over the place, which is totally fine, it's okay, he can sit there, he can do whatever he wants. Does he want this chair, he can do what it is, you want my computer? He can have whatever he wants. This is your iPad. You gonna look at your iPad? There you go. You gonna watch animal planet? This chair is also a custom chair from Restoration Hardware. I went and picked the color of the wood, the fabric. I love the way that the white kind of accents everything else in the room. Definitely a big fan, definitely worth the wait. I am shooting this video on a Sony a7 III. It's such a great especially for auto-focus. The light that I'm using to light up this room and I also use this light in the other room where I shoot and do unboxings, it's the LiteMat+ Plus 4 and this thing's amazing. I mean it puts out so much light. It works out well here. Downstairs when I'm shooting kitchen videos. Also have this light back here. I popped in some hue bulbs in there so I can also change the color temperature. A blue or a Savannah, oh that blue option looked really good. I think I'm gonna keep that. I also have some hue lights behind the TV and I have a few other ones that I'm gonna install somewhere around here, I think maybe behind the mirror. So that pretty much does it for a quick little overview of my office. I'm so excited, I absolutely love to just hang out in here and edit and work and it is so much more relaxing now that I have everything set up. There's only one final thing that I have to do. And that's set up my Xbox. Oh gosh, I'm crazy when I play this game, like absolutely insane. I see you, I see you, I see you, do you see me? Nope, you don't. Look at your little, oh come on. Where's your riot shield, what do you think you are? (shooting) No. A huge thank you again to LG for sponsoring this video and making the rest of my office just come to life. See you guys later, I'll put some links in the description if you wanna find out more information about the TV. And be sure to subscribe and like this video and let me know if there's anything else that you think that I need for my office, and I'll see you guys later. (casual upbeat music)",
    "transcript_keywords": [
        "office",
        "video",
        "room",
        "OLED",
        "overdue office tour",
        "Restoration Hardware",
        "time",
        "desk",
        "great",
        "light",
        "love",
        "Guys",
        "kind",
        "chair",
        "thing",
        "Jellyfish",
        "long overdue office",
        "excited",
        "put",
        "shooting"
    ],
    "transcript_entity_values": [
        "MacBook",
        "Restoration Hardware",
        "millions",
        "AirPods",
        "AirPlay",
        "Matty",
        "Dolby Vision",
        "second",
        "Atmos",
        "one",
        "iPad",
        "LG",
        "Razer",
        "MacBook",
        "Velcro",
        "Catalina",
        "West Elm",
        "Savannah",
        "Nomad",
        "Justine",
        "iMac Pro",
        "Sony",
        "Mac",
        "4",
        "iPhone",
        "Jellyfish",
        "MacBook Pro",
        "Brad Pitt",
        "HomePod",
        "Alexa",
        "LG OLED TV",
        "Xbox",
        "Cory Basil",
        "Google",
        "Nomad",
        "Xbox",
        "18",
        "Netflix",
        "only one",
        "Call of Duty",
        "today",
        "iMac",
        "Conversational AI",
        "Tyler",
        "K Cinema",
        "16-inch",
        "first",
        "LG TV",
        "65-inch",
        "12.9 millisecond",
        "Alpha 9",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "LOC",
        "GPE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "FAC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL"
    ],
    "vector": [
        -0.02601999044418335,
        -0.07988277077674866,
        -0.04535319656133652,
        -0.12084580957889557,
        0.00047511293087154627,
        0.040769271552562714,
        0.048071470111608505,
        0.05216711387038231,
        -0.007405368145555258,
        0.048311877995729446,
        -0.002105747116729617,
        0.02099314145743847,
        -0.02052922174334526,
        0.029024403542280197,
        -0.0044213528744876385,
        0.034573983401060104,
        0.034802839159965515,
        -0.040218472480773926,
        0.0015579898608848453,
        0.06389171630144119,
        -0.01962156407535076,
        -0.05459694191813469,
        0.029344376176595688,
        -0.001903018681332469,
        -0.03170394524931908,
        0.08465096354484558,
        -0.0027547935023903847,
        0.058907829225063324,
        -0.07833830267190933,
        -0.060509130358695984,
        -0.037728019058704376,
        0.03958698734641075,
        0.09952136874198914,
        -0.004899040330201387,
        0.025893520563840866,
        -0.021733121946454048,
        0.047542504966259,
        -0.005644070450216532,
        -0.016048215329647064,
        -0.013164411298930645,
        0.004916753154247999,
        -0.05525113642215729,
        0.023209886625409126,
        -0.0175765473395586,
        -0.05486604943871498,
        -0.10351793467998505,
        0.004417769145220518,
        -0.04537196457386017,
        0.07266569137573242,
        0.06807786971330643,
        -0.09011345356702805,
        -0.043275367468595505,
        0.02695443481206894,
        -0.0023904256522655487,
        -0.0856015607714653,
        0.0001962230890057981,
        -0.07733257859945297,
        0.029540713876485825,
        0.03591563552618027,
        -0.09878833591938019,
        0.02087572030723095,
        -0.08180331438779831,
        -0.003292122157290578,
        0.06652690470218658,
        -0.07692903280258179,
        -0.04817519336938858,
        0.0007648075697943568,
        0.007898773066699505,
        0.004877423867583275,
        -0.011078051291406155,
        -0.12004095315933228,
        0.0634138211607933,
        -0.02241694927215576,
        0.03432774171233177,
        0.011816954240202904,
        0.052986856549978256,
        0.037726402282714844,
        -0.062434155493974686,
        0.010333060286939144,
        0.04843732342123985,
        0.029553933069109917,
        -0.06715652346611023,
        -0.0929345041513443,
        -0.01723722368478775,
        0.004516775254160166,
        0.021871212869882584,
        0.025247830897569656,
        0.0027623875066637993,
        -0.03339250013232231,
        -0.06650565564632416,
        -0.1013336107134819,
        0.0063187009654939175,
        -0.028983578085899353,
        -0.01687050051987171,
        -0.04078339785337448,
        -0.04993699491024017,
        -0.02923496998846531,
        -0.05771912261843681,
        -0.0390036441385746,
        0.08728694170713425,
        0.045696623623371124,
        -0.042094096541404724,
        0.022143162786960602,
        -0.04861779510974884,
        -0.05797067657113075,
        -0.11699612438678741,
        -0.04205363616347313,
        0.02830384485423565,
        0.028659118339419365,
        0.0014288545353338122,
        -0.0571281723678112,
        0.04297842085361481,
        -0.0674503967165947,
        -0.07329284399747849,
        0.01673606038093567,
        0.09807196259498596,
        -0.039169929921627045,
        0.07737886160612106,
        0.052417341619729996,
        0.015349767170846462,
        -0.01281774416565895,
        -0.08855278789997101,
        -0.0013251538621261716,
        0.04682224988937378,
        -0.0008499886025674641,
        0.010878660716116428,
        -0.06412864476442337,
        1.3080212002387246e-32,
        -0.027359353378415108,
        0.07483822107315063,
        0.020063860341906548,
        0.06451213359832764,
        0.005983817856758833,
        -0.03188580647110939,
        -0.04230280965566635,
        0.10061619430780411,
        -0.01728861965239048,
        0.003358448389917612,
        0.023054910823702812,
        0.061305489391088486,
        -0.016716836020350456,
        0.043833281844854355,
        0.028778431937098503,
        -0.04593929648399353,
        -0.00896392296999693,
        -0.045688871294260025,
        -0.07051445543766022,
        -0.01926662027835846,
        0.006474265828728676,
        -0.04826722294092178,
        0.029501624405384064,
        0.10621118545532227,
        0.10766737908124924,
        0.08019353449344635,
        0.07612159848213196,
        0.012733924202620983,
        0.10422857850790024,
        0.004120815545320511,
        -0.04443059116601944,
        -0.044066157191991806,
        -0.012607022188603878,
        -0.09684903919696808,
        -0.009344619698822498,
        0.010993498377501965,
        -0.06569572538137436,
        -0.023176001384854317,
        0.003958674613386393,
        -0.023598596453666687,
        -0.03713184595108032,
        0.015365040861070156,
        -0.05490458011627197,
        -0.05489729717373848,
        0.07366818189620972,
        0.05490823835134506,
        0.07163731753826141,
        0.08290227502584457,
        -0.014218817465007305,
        0.029993800446391106,
        -0.02817021869122982,
        -0.010764735750854015,
        -0.058271702378988266,
        0.007893272675573826,
        -0.01788700930774212,
        -0.0912814512848854,
        -0.029834827408194542,
        0.06429760903120041,
        0.05596374720335007,
        0.03628654032945633,
        0.026649558916687965,
        0.0054379357025027275,
        -0.002334016840904951,
        -0.012144647538661957,
        -0.05907628685235977,
        0.09017568826675415,
        0.07263846695423126,
        -0.04609467089176178,
        0.06770351529121399,
        0.053185973316431046,
        -0.0013332869857549667,
        -0.019305860623717308,
        0.05207863822579384,
        0.011006319895386696,
        0.06840214878320694,
        0.058961592614650726,
        -0.09672275185585022,
        -0.049300286918878555,
        0.045189015567302704,
        -0.021500125527381897,
        -0.1371370404958725,
        0.0651048794388771,
        -0.00684136850759387,
        0.09101932495832443,
        -0.04366811364889145,
        -0.052455686032772064,
        0.03152826800942421,
        -0.047793250530958176,
        -0.04854229465126991,
        0.016326773911714554,
        -0.014163902960717678,
        0.08397610485553741,
        -0.09705203771591187,
        -0.004372236784547567,
        -0.023287909105420113,
        -1.2934339030921954e-32,
        0.03850989043712616,
        0.02361328713595867,
        -0.008395585231482983,
        -0.03697880357503891,
        0.07171954959630966,
        -0.02181551791727543,
        0.038547441363334656,
        0.07199526578187943,
        0.0775398388504982,
        -0.06899838149547577,
        0.03875557705760002,
        -0.06172509491443634,
        -0.10653650015592575,
        0.01491704210639,
        -0.048984576016664505,
        -0.041345831006765366,
        -0.03696373850107193,
        -0.0507766529917717,
        0.05883116275072098,
        -0.00938990619033575,
        0.06368471682071686,
        0.13250650465488434,
        0.06361692398786545,
        0.0227317176759243,
        0.026920337229967117,
        0.020020566880702972,
        0.011717474088072777,
        0.033042389899492264,
        0.04729574918746948,
        0.03559090197086334,
        -0.03556021675467491,
        -0.053450848907232285,
        -0.048461493104696274,
        -0.004293607547879219,
        0.047526974231004715,
        0.06958315521478653,
        0.029310883954167366,
        0.03108525276184082,
        0.011802053079009056,
        -0.053968001157045364,
        0.037386342883110046,
        -0.009059752337634563,
        0.018380064517259598,
        -0.0005560262943618,
        -0.0025348179042339325,
        -0.11161825060844421,
        -0.0609971322119236,
        0.022871116176247597,
        -0.017911693081259727,
        -0.009379437193274498,
        -0.06840850412845612,
        -0.04076320677995682,
        -0.02866724319756031,
        -0.04677385464310646,
        -0.002774032298475504,
        0.005425797309726477,
        -0.06428607553243637,
        -0.038937486708164215,
        0.022693941369652748,
        0.010147796012461185,
        0.0102205416187644,
        -0.056024931371212006,
        -0.08089447766542435,
        -0.052716564387083054,
        -0.003985438495874405,
        -0.03800162300467491,
        0.10243409872055054,
        0.036133427172899246,
        -0.010758059099316597,
        0.012566477060317993,
        -0.025205465033650398,
        0.02358383499085903,
        0.0405840240418911,
        -0.017472270876169205,
        0.033336397260427475,
        -0.010490105487406254,
        -0.054795391857624054,
        0.0016934338491410017,
        0.06699792295694351,
        -0.044937435537576675,
        -0.05134732276201248,
        -0.02385704219341278,
        -0.001162462867796421,
        0.06813041865825653,
        0.08021494001150131,
        0.1052161306142807,
        0.09408003836870193,
        -0.03969038277864456,
        -0.050228364765644073,
        0.06300486624240875,
        0.03384344279766083,
        0.061933085322380066,
        0.06589081138372421,
        0.09369414299726486,
        -0.09536176174879074,
        -6.723069390091041e-08,
        0.01929398439824581,
        0.046624649316072464,
        -0.014844605699181557,
        -0.007851849310100079,
        0.019276607781648636,
        -0.09361272305250168,
        -0.02351316064596176,
        0.0275679100304842,
        0.05337146297097206,
        -0.03633744269609451,
        0.07638876140117645,
        -0.034520380198955536,
        0.013117212802171707,
        0.12509021162986755,
        0.03370456025004387,
        0.017226925119757652,
        -0.10310010612010956,
        0.09604677557945251,
        -0.05641426146030426,
        -0.0625353753566742,
        -0.05226811021566391,
        0.046805333346128464,
        0.03220045939087868,
        -0.008543401025235653,
        0.06535781919956207,
        0.011068262159824371,
        -0.024683712050318718,
        -0.03590680658817291,
        0.03478023782372475,
        0.017306681722402573,
        -0.06261997669935226,
        0.014850860461592674,
        -0.005058076698333025,
        -0.014204614795744419,
        -0.04833029955625534,
        -0.06599846482276917,
        -0.05134567990899086,
        -0.02039385214447975,
        0.034020185470581055,
        0.04456065967679024,
        -0.00823969952762127,
        -0.11260797828435898,
        -0.048879630863666534,
        0.01787208579480648,
        0.02881602942943573,
        -0.04288683831691742,
        0.028216838836669922,
        -0.07318095117807388,
        -0.054162997752428055,
        -0.0367206372320652,
        -0.05371183902025223,
        0.031071379780769348,
        0.022731423377990723,
        -0.04297875612974167,
        0.044993359595537186,
        0.016322556883096695,
        0.04182671010494232,
        0.055579036474227905,
        -0.01727982424199581,
        -0.01052191574126482,
        0.03020239993929863,
        0.008606750518083572,
        -0.0687301903963089,
        0.02695905603468418
    ]
}