{
    "id": "4v0nOAzcG2A",
    "title": "The Super Google Pixel 2 Camera Upgrade!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-11-11T15:38:32Z",
    "video_url": "https://www.youtube.com/watch?v=4v0nOAzcG2A",
    "category": "Science & Technology",
    "tags": [
        "Google",
        "Pixel 2",
        "Pixel 2 XL",
        "Pixel 2 Camera",
        "Moment Lens",
        "Pixel 2 Moment case",
        "Moment Case Lens",
        "Smartphone",
        "2017",
        "Apple",
        "google pixel",
        "apple iphone x",
        "pixel 2 xl review",
        "iphone 8",
        "iphone",
        "google pixel 2",
        "camera",
        "google pixel xl",
        "pixel 2 unboxing",
        "review",
        "iphone x",
        "pixel",
        "android",
        "tech",
        "jonathan morrison",
        "tld"
    ],
    "views": 681765,
    "likes": 16455,
    "comments_count": 1043,
    "description": "The Best iPhone X Accessories!  The Google Pixel 2 Camera + Moment Lenses = Amazing.  Check it out the Pixel 2 Moment Case here:   Reading Mean iPhone X comments -   Background music via Epidemic Sound:   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/1yClDITvctI",
        "http://amzn.to/2zBCUHt",
        "https://youtu.be/lHQ4kwXfLbo",
        "https://goo.gl/rMbhQL",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Here guys, Jonathan here. Just dropped a video on some of the best iPhone Ten accessories and today got something for the Pixel Two and Pixel Two XL. It is no secret that it has probably the best smartphone camera in the game right now. If you disagree, let me know what your pick is with the comment down below. But today if you're a Pixel fan, get excited because I got a couple of gadgets that should elevate things and take full advantage of the amazing camera inside the Pixel Two. So this is a two piece case, slash, lens combo from Moment and how it works is you pop on the case and that then adds a layer of modularity in the sense that you can swap out different lenses, there's a wide angle, a telephoto, a fisheye, and even a macro for those super-close tight shots. So the first thing that immediately jumped out to me with these is build quality, presentation, are all extremely well done and they are built like a tank. They are freaking heavy. I'll let you in on a little secret before every Ossen Evans video, he curls these 856 times and that is a secret to those Atkins gains. Speaking of presentation, anything that comes in a case or a bag always makes you feel just a little extra special inside. Here we have the wide angle lens and I'll pop it out. They also include a lens cover so you're not gonna scratch that glass, which is really nice. Very well thought out. Here's the telephoto 60 millimeter lens and again same deal there, lens cap and there's just a really well though out system. Now as far as installation goes, we have a marker here on the case, we have a marker here on the lens, so they make it extremely simple to not screw this up. Pop it in, slide, we have the Moment logo there. You can clearly see once you take the lens cap off the 18 millimeter sight in there. And now it is time to test this guy out. So to give an example of how much this alters your field of view, I'm gonna snap a photo here, but I'm also gonna pop up the lens and show you how much that alters the image. So we had that beautiful wide image, now we are much more cropped in. I'm gonna snap a photo. And take a look back at these pictures. The standard stock lens in the Pixel Two, that's a great picture. But as we swipe over to that wide angle shot you can see so much more in there. You see the sky, we got that street going across, into the sun peeking outta the corner. It's doing a great job with the highlights. You're not really losing any quality. You were just getting an amazing looking wide shot. It's pretty incredible. Seeing that makes me want to pop this immediately back on because we got some beautiful sun creeping through that tree. I'm gonna see if I can catch that right now. We got them palm trees and if I were to take this off, there's no way we are getting that much. Yeah, that's like crowding your image. There's no way we are getting that much detail. I would have to scoot way the hell back there. Man, can I just give the Pixel 2 some major credit right here? The sky is completely visible but we are still getting that beautiful ray of sunshine blasting through those leaves, beautiful. Now on top of photos, these lenses will also work through video. So what you're watching right now is me being shot through the Pixel 2 with that wide-angle lens. It's gotta make this little bit of scenery look extra cinematic but if we were to take that lens off you guys could see how much of that wide angle we are losing. I have no idea what this looks like right now. I'm sure it is nowhere near as cool as before. Well let me know in the comment down below what you think of the quality with the lens and without. Lastly, there is one shot I want to get. Part of me really wishes this light bulb was on because that would be a freaking cool shot, but I'm still gonna try to get it anyway. I don't think I would normally be able to get anything close like this without the wide-angle lens so if I could just get a little bit of exposure, bring that down. Snap it and that is a really impressive image. Now if I were to swipe this off, yeah that is cool but it's nowhere near that wide angle shot. It just adds a whole layer to that photo. Now quick update, initially I wasn't the biggest fan of needing a case to use a lens but the more and more I use it, the more it find myself liking it. One, it's not something you gotta think about. You just swap it on and you're good. And two, if you've ever used those lens attachments that don't require a case, sometimes they don't always align properly but with this you get it perfect every time. So we've seen what that wide angle lens can do. Now it's time to check out that telephoto lens. We're gonna add some length to this Pixel 2. Pop it on, pop the lens cap off. I think we're gonna test it out with this nice little arrangement of flowers right here. What I'm seeing immediately right now is some really nice blur in the background. It's got a super-nice roll-off. This is not in portrait mode. I'm gonna snap a photo but you can see that is really nice. For reference I'm going to pop this off and we should effectively lose all that right now. So yeah, you can see the image is nowhere near as compressed with this. We still see a little bit of that in the background but comparing it to this shot with a telephoto lens on, you can see we got that nice circular fall off ball action. Boca, boce, whatever you want to call it, it is pretty as hell. Now to kinda take that one step further, what I'm gonna do is pop the lens back on and also check out this with portrait mode enabled and see what that does. So right off the bat, that's going to crop us in just a little bit further. We have some nice foreground going on, we still have that ball in the background. I'm gonna take the shots, let it process and right there that is pretty impressive. So we see a little bit more blur in that light in the background. But either way, with or without portrait mode, having this telephoto lens is a really nice addition. From there, Rich, let's flex those breads. We got Rich in frame, photo taken. One without the lens just for safety. Now we see all your legs in that shot. Take it a look back, so that is without the telephoto lens. It's pretty nice. - [Rich] Yeah. Oh that's really nice. - [Jonathan] Look at that! - Oh, got a little flair too? - Yeah, I love what it does with the background, the blur, the sun, it holds all those highlights. This is pretty damn cool. Ugg, I though I was gonna go to move that. I wanted to bring the flowers so I could catch the sun. It's not gonna happen. Oh we got a train coming! Quick, Rich. - Yeah? - Hit me with the stand. Hook me up. This is also a really good test of how quickly you can get set up. (upbeat music) Look man, I'm like one of those Instagram kids. And this guy I'm following, what's his name? It's Steve. Steve is moving it. He said get that (beeps) outta my way! - [Rich] Demonetized. - Holy crap, man, using this telephoto lens on video right now, like that is freaking crazy. It's like portrait mode all the time but in video. I'm not sure how that effects stabilizations, so let me know what you guys think. But just what I'm seeing right here through the viewfinder is kind of crazy. Like the light behind it, that is some insane footage. So with this that is gonna add a complete different layer to your arsenal with the Pixel 2 in terms of video. Now I'm not gonna lie, initially when I saw these, I was a little skeptical especially because of the price point. They aren't the most insane things in the world but they're also not the cheapest. I guess in the grand scheme of things when you compare it to other camera gear out there, it kinda makes sense. The build quality, the fact that it's well presented, you have a case, you have a lens cap. It all kinda makes up for that price. But more importantly the image quality. That wide angle lens was awesome, but after seeing what this did, especially for video, it has definitely won me over. With that said, that has me super-excited for these to come to the iPhone Ten. I believe they're currently available for the Eight and Eight Plus right now, but as we know I think the Pixel 2 and the iPhone Ten are currently the two best in the game. Aside from that, thank you guys very much for watching. Hopefully you enjoyed the video. If you did, and you are feeling like being awesome, make sure to go Richard's Bread on that like button. If you missed it, we are currently giving away a brand new Xbox One X Scorpio Edition. You can check that out here or in the link below. This is Jonathan and I will catch you guys later.",
    "transcript_keywords": [
        "lens",
        "Pixel",
        "wide angle lens",
        "wide angle",
        "telephoto lens",
        "wide",
        "pop",
        "nice",
        "lens cap",
        "angle lens",
        "shot",
        "video",
        "angle",
        "case",
        "telephoto",
        "wide angle shot",
        "image",
        "Yeah",
        "photo",
        "guys"
    ],
    "transcript_entity_values": [
        "two",
        "Eight",
        "Rich",
        "Moment",
        "Jonathan] Look",
        "One",
        "18 millimeter",
        "Ten",
        "856",
        "Pixel 2",
        "Steve",
        "Scorpio Edition",
        "60 millimeter",
        "Xbox One",
        "Eight Plus",
        "Richard",
        "Two",
        "Boca",
        "2",
        "first",
        "one",
        "Pixel Two XL",
        "today",
        "Instagram",
        "Atkins",
        "Ossen Evans",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON"
    ],
    "vector": [
        -0.11385174095630646,
        -0.022335531190037727,
        0.09106044471263885,
        -0.09728493541479111,
        0.036727629601955414,
        -0.058608196675777435,
        0.11498622596263885,
        0.0807865560054779,
        -0.022539444267749786,
        0.03981762006878853,
        0.06787421554327011,
        -0.029397251084446907,
        -0.005442110821604729,
        -0.007144399452954531,
        0.04201503098011017,
        0.024946292862296104,
        0.10370871424674988,
        -0.01446807011961937,
        -0.056461382657289505,
        0.037917181849479675,
        0.0028417452704161406,
        -0.12766166031360626,
        0.07289309054613113,
        -0.006468013394623995,
        0.03999224305152893,
        0.12509684264659882,
        -0.046321067959070206,
        -0.07059864699840546,
        -0.007001435849815607,
        -0.06966507434844971,
        0.021335333585739136,
        0.09756378829479218,
        0.0005698836757801473,
        0.025621188804507256,
        -0.04793800041079521,
        -0.03853030502796173,
        0.05727536231279373,
        0.018777254968881607,
        -0.03723382577300072,
        -0.03514432534575462,
        -0.00894701573997736,
        -0.015978222712874413,
        0.006980181206017733,
        -0.016164205968379974,
        0.022857530042529106,
        -0.01216624490916729,
        0.09106119722127914,
        -0.03172618895769119,
        -0.012055656872689724,
        -0.009909305721521378,
        -0.08390472084283829,
        -0.061125002801418304,
        -0.031421173363924026,
        0.03789115697145462,
        0.008886951021850109,
        0.12095537036657333,
        -0.0786295160651207,
        -0.00698866369202733,
        0.05859929695725441,
        -0.010570081882178783,
        0.026513872668147087,
        0.013114091008901596,
        0.022806117311120033,
        0.06732968240976334,
        0.02520843967795372,
        -0.045213744044303894,
        0.010853464715182781,
        -0.09744198620319366,
        -0.005110064055770636,
        0.008173876442015171,
        -0.03990675136446953,
        0.06846407800912857,
        -0.019772863015532494,
        -0.024203242734074593,
        0.0020239357836544514,
        0.036196060478687286,
        -0.013617412187159061,
        -0.019400810822844505,
        -0.017360791563987732,
        0.031859882175922394,
        0.07622034102678299,
        -0.06774286180734634,
        0.007884633727371693,
        0.037435635924339294,
        -0.04785064607858658,
        -0.022857675328850746,
        0.003618330927565694,
        0.06591662019491196,
        -0.027169307693839073,
        -0.08378413319587708,
        -0.043378736823797226,
        0.02066367119550705,
        -0.018594834953546524,
        0.00029680467559956014,
        0.002357887802645564,
        0.005575108341872692,
        -0.028149520978331566,
        -0.02692159079015255,
        5.5813889048295096e-06,
        -0.008120096288621426,
        0.01196912582963705,
        -0.029545623809099197,
        -0.017194213345646858,
        -0.030169405043125153,
        0.0870470330119133,
        -0.0703199952840805,
        -0.09570971131324768,
        -0.041388824582099915,
        0.056765105575323105,
        0.025014350190758705,
        -0.022242477163672447,
        0.051540639251470566,
        -0.06421392410993576,
        -0.061209119856357574,
        -0.012829714454710484,
        0.003461149986833334,
        0.007410849444568157,
        0.076851487159729,
        0.15014110505580902,
        -0.012461315840482712,
        0.02151886560022831,
        0.021387754008173943,
        -0.06704022735357285,
        -0.02453044429421425,
        0.012820289470255375,
        -0.0028334236703813076,
        -0.0805983692407608,
        2.7293843739361003e-33,
        0.012912859208881855,
        0.08586173504590988,
        0.01670047827064991,
        0.030457939952611923,
        -0.03183377906680107,
        0.0020520370453596115,
        0.007270927540957928,
        0.0654161274433136,
        0.01600232720375061,
        -0.009066267870366573,
        -0.05655882880091667,
        -0.005837130360305309,
        -0.06410309672355652,
        0.04525730758905411,
        0.11699319630861282,
        -0.018707001581788063,
        -0.0834617167711258,
        -0.06270241737365723,
        0.047339294105768204,
        0.005655065644532442,
        0.02594054862856865,
        0.0035820836201310158,
        -0.0029501994140446186,
        0.07847446948289871,
        0.024398736655712128,
        0.006047212518751621,
        0.11128170043230057,
        0.0005859459633938968,
        -0.005927727557718754,
        0.018179312348365784,
        -0.05727480351924896,
        -0.009409736841917038,
        -0.0011546813184395432,
        0.01672278717160225,
        -0.04224255308508873,
        0.01337108202278614,
        -0.06796562671661377,
        -0.051645416766405106,
        0.043525174260139465,
        0.014277453534305096,
        -0.0810103788971901,
        0.07195968925952911,
        -0.03178739920258522,
        -0.06819440424442291,
        0.04726855084300041,
        0.03102068603038788,
        -0.02265642024576664,
        -0.009404445067048073,
        -0.014338991604745388,
        -0.02226702868938446,
        0.07654644548892975,
        -0.07802971452474594,
        -0.025501513853669167,
        0.02963070757687092,
        -0.04647316411137581,
        0.008928515017032623,
        -0.020746611058712006,
        -0.0019925523083657026,
        -0.02797822095453739,
        0.02832280471920967,
        -0.030052488669753075,
        0.009547947905957699,
        -0.0685935989022255,
        0.032385777682065964,
        -0.10885068029165268,
        0.037368353456258774,
        0.06041201576590538,
        0.03422415256500244,
        -0.06568267941474915,
        0.11270131170749664,
        -0.022856811061501503,
        0.005358338821679354,
        0.0075042638927698135,
        -0.049090676009655,
        0.060422200709581375,
        -0.015204786323010921,
        -0.057279229164123535,
        -0.08037828654050827,
        0.026468690484762192,
        0.057595036923885345,
        -0.06469970941543579,
        0.04174434393644333,
        0.07504100352525711,
        0.0867195874452591,
        -0.027021829038858414,
        -0.05551820620894432,
        0.007777799852192402,
        -0.05540531873703003,
        -0.05197839066386223,
        0.0342148095369339,
        -0.10942273586988449,
        -0.0651707574725151,
        -0.033486396074295044,
        -0.0037530160043388605,
        -8.164963946910575e-05,
        -3.745309407396093e-33,
        0.015611651353538036,
        -0.040687087923288345,
        -0.026161981746554375,
        0.06099458411335945,
        0.011068742722272873,
        -0.02654574066400528,
        0.10855720937252045,
        0.00916376244276762,
        0.055940862745046616,
        0.0020861909724771976,
        0.023612458258867264,
        0.0721556693315506,
        0.012396305799484253,
        0.030134573578834534,
        -0.043879434466362,
        -0.07065602391958237,
        -0.031391654163599014,
        -0.14460331201553345,
        -0.028131911531090736,
        -0.043909985572099686,
        0.10518930852413177,
        0.03497839719057083,
        0.05608340725302696,
        -0.0003598143230192363,
        -0.02537865750491619,
        0.03776293247938156,
        0.002416068222373724,
        -0.012535813264548779,
        0.05092094838619232,
        -0.047646716237068176,
        -0.022798994556069374,
        -0.022036293521523476,
        0.03120579570531845,
        0.027450421825051308,
        0.058143921196460724,
        0.04719381406903267,
        -0.010113702155649662,
        -0.04251028597354889,
        0.02989833801984787,
        -0.015286756679415703,
        -0.044267285615205765,
        0.00920310989022255,
        0.08382066339254379,
        0.0023328245151787996,
        0.0497652143239975,
        0.04341674596071243,
        0.05237641558051109,
        0.04467373713850975,
        -0.011287453584372997,
        0.09824948757886887,
        -0.08931857347488403,
        0.06279901415109634,
        -0.048420269042253494,
        0.03244367986917496,
        -0.08692698925733566,
        -0.05668945983052254,
        -0.07639414072036743,
        -0.07347987592220306,
        0.042930860072374344,
        0.00981470663100481,
        0.050550732761621475,
        0.0037396785337477922,
        -0.06822037696838379,
        -0.017009161412715912,
        -0.08152662962675095,
        0.01445007510483265,
        -0.014744419604539871,
        -0.031292397528886795,
        -0.03214917704463005,
        0.03832107037305832,
        -0.0034720050171017647,
        -0.04807564616203308,
        -0.0012251106090843678,
        -0.04890641197562218,
        -0.051804378628730774,
        0.06413187086582184,
        -0.050070952624082565,
        0.010957426391541958,
        0.0447603240609169,
        -0.053555507212877274,
        0.026897331699728966,
        0.01747094839811325,
        0.06322319060564041,
        0.06137965992093086,
        0.09642805904150009,
        0.07028856873512268,
        0.009212539531290531,
        -0.022226572036743164,
        -0.021566936746239662,
        0.001584221376106143,
        -0.008973508141934872,
        0.04352998360991478,
        -0.05920904502272606,
        0.0821007564663887,
        0.03265964612364769,
        -5.462048235926886e-08,
        0.05343529209494591,
        0.02787206880748272,
        -0.0032929994631558657,
        -0.04971187561750412,
        0.04990587756037712,
        -0.08448224514722824,
        -0.1234346479177475,
        0.06773174554109573,
        0.1257227212190628,
        -0.018121061846613884,
        -0.001097104512155056,
        -0.010155893862247467,
        -0.04242962971329689,
        0.05742299184203148,
        -0.017437169328331947,
        0.03720816224813461,
        -0.0240482147783041,
        -0.03817783668637276,
        -0.0018411909695714712,
        -0.05954514443874359,
        -0.04203436151146889,
        -0.007413831073790789,
        -0.012902460992336273,
        -0.08235064893960953,
        -0.035934630781412125,
        -0.02280288189649582,
        -0.07325293123722076,
        -0.06732552498579025,
        0.07832186669111252,
        0.03407176956534386,
        0.005241965875029564,
        -0.04276079311966896,
        0.010455571115016937,
        0.0414750836789608,
        -0.019343985244631767,
        -0.05615512654185295,
        -0.03743167221546173,
        -0.05441145598888397,
        0.10221721231937408,
        -0.04649685323238373,
        0.03983619436621666,
        -0.04650520533323288,
        0.035299647599458694,
        0.061658505350351334,
        0.012841310352087021,
        -0.047187671065330505,
        0.11601058393716812,
        -0.11311184614896774,
        -0.019437512382864952,
        0.05828313156962395,
        -0.06516040861606598,
        -0.021760469302535057,
        -0.03559534251689911,
        -0.0013019167818129063,
        0.04103253781795502,
        0.04710987210273743,
        0.06865361332893372,
        -0.016441376879811287,
        0.016949361190199852,
        -0.006564169656485319,
        0.010657877661287785,
        -0.013142947107553482,
        -0.07734303921461105,
        0.07815084606409073
    ]
}