{
    "id": "4V_pYA7Uq0U",
    "title": "I LOVE Paywalls. Thanks Intel! - ECC Support on Alder Lake",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-09-25T16:59:43Z",
    "video_url": "https://www.youtube.com/watch?v=4V_pYA7Uq0U",
    "category": "Science & Technology",
    "tags": [
        "ECC",
        "Memory",
        "Error Correction Code",
        "Intel",
        "12th Gen",
        "Alder Lake",
        "AMD",
        "CPU",
        "PC Hardware",
        "Motherboard Features",
        "Gigabyte",
        "MW34-SP0"
    ],
    "views": 1513606,
    "likes": 63696,
    "comments_count": 2838,
    "description": "Check out Jackerys Solar Generator 1000 Pro at  or on Amazon:  Use code LinusTechTips for 10% off!  Create your build at   12th Gen Intel supports ECC memory, but you're going to need a specific chipset to utilize it. A chipset only available on expensive workstation motherboards that lack other features you might want... So just how badly do you need Error Correction Code memory in the first place?  Discuss on the forum:   Purchase an i7-12700K:  Purchase an Crucial Ballistix 3200MHz C16:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:25 12th Gen Intel 2:24 Pentium G6951 5:04 ECC Today 7:44 Thanks Intel 9:00 Business Time 10:25 AMD 11:28 Conclusion 12:39 Outro",
    "description_links": [
        "https://geni.us/aL7Ys",
        "https://geni.us/tvzQ8W",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1457330-i-love-paywalls-thanks-intel/",
        "https://geni.us/RPyj54U",
        "https://geni.us/JQWiTPM",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- The way I see it. If you wanna use the heated seats in your car, you should just pay extra to activate them. High beam assist? Just twist the iDrive dial after swiping your credit card in the convenient little reader down here. I mean, don't get me wrong. I know this stuff was already in the car you paid for. I just love the convenience of unlocking things later, for more money. \"Thanks, big auto,\" said the one ever. But at least when it comes to cars, the only hurdle is the paywall. Intel, on the other hand, has sort of been doing this for years, except worse, because in order to get access to those hidden features in your CPU, you often need to buy outright different hardware, upfront, with no way to unlock them after the fact. In today's case, we want access to that sweet, sweet ECC, or error correcting memory, that will give our 12th gen core processor an extra stability boost. But, we cannot has it, unless we buy their special, workstation-grade motherboard with the W680 chip set. Which is like, what? $500 for a motherboard? This thing better be very special and very worth it. Like our sponsor: Build Redux! Build Redux makes it easy to configure your new build with support guides to help along the way. They also offer competitive pricing as compared to building a PC yourself, so head to buildredux.com/linus and start your new build today. This little guy is really cool. It's got the ability to use either regular unbuffered memory modules, or ECC modules. But, only if you shell out anywhere from $200 to $300 more for a W680 chip set motherboard. In our case, the gigabyte MW34-SP0. But why? This consumer grade board has the exact same CPU socket, with the same copper traces connected to the same DDR4 DIM slots. And as the savvy among you will know, the memory controller is baked right into the CPU these days, not the motherboard chip set. So, how is it that a motherboard could prevent you from taking this stick of ECC Ram and putting it into a Z690 board? The answer is Intel. Intel prevents you. And unfortunately, this isn't exactly a new business practice from them. Let's take a little trip down memory lane to 2010 and the first upgradeable Intel processor: the Pentium G6951. Nice. Out of the box, it was a two core, two thread desktop chip with 3 megabytes of level three cache. Pretty pedestrian, even for the time. But, the big selling feature was that for an extra 50 bucks you could upgrade both the chip's cache and Hyper-Threading capabilities turning it into a G6952. Even nicer. Now some of you might be thinking, \"Well, hey! That's kind of great, isn't it? I can save a buck today, and then I can upgrade it later without tearing apart my PC or taking it to the geek squad.\" And, you're right, seriously. For many people, I could actually see this kind of after-the-fact upgradability being not only a non-issue, but even a good thing. But I am not most people. Let's go back to cars for a moment. Many of them have governors, or limiters, that cap their maximum speed. And these days, they're typically way higher than you should ever drive on a public road. For example, in the UK, most cars are limited to about 155 miles per hour, so most people are pretty indifferent to them. But, I also understand the car enthusiasts who feel like, \"Well, damn it! If I paid for the whole speedometer, then I should be allowed to use it. Even if it is only on track days.\" And, that's exactly how I feel about electronics. If it was already factory validated to handle the additional strain, whether it's a clock speed target or a feature, then darn it, it should be accessible. I mean, imagine this in other industries, you buy a backpack from lttstore.com, and half the pockets won't open until you send us another micropayment? I mean, to be clear, it's a great product, and frankly it would still hold a lot of stuff, but have you not already spent enough? And in the Pentium G6951's case, we were talking about Hyper-Threading on a dual core chip where it really does make a huge difference. To be clear, it's normal to bin processors according to their capabilities, and then turn around and sell the same Silicon at a bunch of different price points. In fact, around that same time, AMD had Tri-core processors in their lineup that were just quad-core processors with one of the cores disabled. The big difference though, is that AMD allowed you to play silicon roulette and turn the extra core on. Sometimes, yeah, it was unstable. The thing really was defective. But sometimes, you got free real estate. Good guy, AMD. Enough about ancient history though. Let's turn our attention back to the pay-wall du jour: ECC memory on Intel's 12th gen CPU. Most people think it doesn't matter for gaming rigs but do they actually know that, or have they just bought into the marketing? Error correction code, or ECC memory, is more important than you might think, and there's a reason that it's used in servers around the world. The difference between these two modules, the non-ECC and ECC one, lies primarily in this extra chip of DRAM on either side of the stick. It acts as a parody check that says, \"Hey, all of these bits are valid. You're good to go,\" before passing data back and forth between the Ram and the CPU. We explain this in a bit more depth in our last ECC video, but essentially bits can flip spontaneously and cause soft errors, like data corruption or crashes if they aren't detected and corrected. There are a few factors that affect the soft error rate of memory. Notable ones include: the capacity, speed, and density, all of which will increase the probability of bit flips as they go up. And, unfortunately for us, or fortunately, I suppose for our gaming FPS, Ram does keep getting bigger, faster, and denser. So, perhaps the more relevant study was one done by Google that showed that roughly 32% of all servers, and 8% of all DIMs experienced at least one memory error per year. Now, fortunately for them, they were servers, and they were using ECC, so these errors were caught and corrected before they could bung up your YouTube. So, so, so, so, so so clearly there's a valid argument to be made for ECC in modern computers. What's the drawback then? There are actually a couple. First up, is that using ECC memory in our system did result in lower benchmark results across the board compared to regular gaming RAM. Even running at the same frequency, our Crucial Ballistix RAM managed performance anywhere from the same to as much as 20% higher than our safe and stable choice. And, there's also the small matter of price. While they do use the same commodity chips, ECC modules legitimately cost more to manufacture than typical DIMs because of those extra parody chips. So, this is not just paywall BS. With that said, we're talking at best a 12% increase in materials cost, and, as for the performance issue, well nothing would actually prevent a memory manufacturer from designing and building higher performance ECC modules. In fact, Mushkin does just that, and their pricing is pretty reasonable for them. Kinda like floatplane.com, which has exclusives, like this extra footage from the build with my sister. The big question then is why aren't we all using ECC? And, basically, it's because Intel decided that consumers either didn't need it, or couldn't afford it, and artificially locked the feature to their business-class products for decades. The only real difference now is that it's more obvious now that they've dropped the facade of having parallel Xeon and Core-branded product lines that use the exact same Silicon, but have over-clocking and ECC support as their main differentiating features. However, the uncomfortable truth is that Intel really isn't that wrong about this. Most consumer desktops are far more likely to crash because of a windows update or a driver error than a memory bit flip. And, consumers have shown time, and time again, that they would rather save a buck than invest in mission-critical features like redundant power supplies and ECC. Which raises a pretty important question: are paywalls actually a better solution? Intel showed us a special motherboard in their testing lab that could have its chip set ID reconfigured on the fly. And, if you could just change your mind, and you wanted overclocking support a year later, wouldn't it be kind of awesome to add the K designation after the fact? I mean, if only a fraction of the buyers of a product will use a given feature, doesn't it kind of make sense that they should be the ones to pay for it, even if the cost is disproportionately high? This is the defense that I usually see for Tesla's heated rear seat option in the Model 3. \"It simplifies manufacturing to just put it in every car,\" they say. And that way, only the people who buy it end up covering the cost, allowing Tesla to hit a more aggressive base model price point for everyone else. \"So who cares?\" they say. Well, I do! Just because the decision makes \"business sense\" doesn't mean that we should lie down and take it. If it is actually a negligible cost to the point where they're just gonna put the seat heating hardware in every single car. Spoiler, it is. Then it should just be active on a $40,000 car! Just like ECC should be active on my $500 CPU. And that's without requiring an additional couple hundred bucks for the arbitrary workstation board that, to its credit, worked well in our testing, but is missing features that I might care about as a consumer, like better IO, better VRMs, or even aesthetic gimmicks like RGB lighting headers. The very worst part of all of this is that AMD has already shown Intel the path forward. Intel just refuses to take it, for years. AMD has taken, actually, a very similar stance that ECC is a workstation and server class feature that general consumers probably don't need. They only validate it on their professional products. The difference is that, like that third core unlocking situation, they haven't outright disabled the function on their consumer CPUs and chip sets. This allows their ecosystem partners, like motherboard makers, to activate it, should they choose. And this is the best of both worlds, because it gives businesses a validated solution, one that they will pay extra for. AMD's server CPU sales are clearly doing just fine. While still giving consumers the choice to save a buck or seek out an ECC0-compatible board and ECC Ram, whether it's because they're sticklers for stability, or because they are repurposing their gaming CPU years down the line as a home storage server, which has a clear e-waste reduction benefit. The ECC controversy though, is arguably coming to a close. Now that we're moving on to DDR5 which contains eight ECC bits per channel. But, my main point here is not the ECC memory. My main point is that there are many examples of this practice of locking performance or features behind additional paywalls. Be it GPU driver features or overclocking support. And, as consumers, we should be thinking long and hard about whether it's something that we actually want before we stop making noise and just accept it. Like you accept the segue to our sponsor. - Jackery! Jackery makes solar-ready, portable power stations designed to improve outdoor life by providing power outdoors whenever and wherever you need it. The new Solar Generator 1000 Pro is their fastest solar and wall recharging generator yet. Boasting three times faster charging than the normal SG 1000. It consists of a Jackery Explorer 1000 Pro portable power station and 80 watt solar panels. Plug it into the wall, and get a full charge in under two hours, and deliver up to a hundred watts of power, thanks to the two 100 watt power delivery ports. You can plug stuff into this thing? Check out the new Jackery Solar Generator 1000 Pro at the link below. - Thanks for watching. If you like to this video, check out the one where we talked about Microsoft's dirty practices and that whole internet Explorer debacle.",
    "transcript_keywords": [
        "ECC",
        "ECC memory",
        "Intel",
        "ECC Ram",
        "memory",
        "CPU",
        "ECC modules",
        "chip",
        "AMD",
        "chip set",
        "extra",
        "AMD server CPU",
        "Ram",
        "motherboard",
        "features",
        "car",
        "Build",
        "feature",
        "power",
        "consumers"
    ],
    "transcript_entity_values": [
        "roughly 32%",
        "Solar Generator 1000 Pro",
        "one",
        "Jackery Solar Generator 1000 Pro",
        "Hyper-Threading",
        "12th",
        "first",
        "about 155 miles per hour",
        "2010",
        "Google",
        "W680",
        "eight",
        "Jackery",
        "iDrive",
        "RGB",
        "First",
        "Mushkin",
        "Silicon",
        "ECC",
        "IO",
        "a year later",
        "under two hours",
        "decades",
        "Build Redux!",
        "GPU",
        "ECC0",
        "today",
        "80 watt",
        "Ram",
        "3 megabytes",
        "at least one",
        "$200 to $300",
        "the Pentium G6951",
        "Tesla",
        "as much as 20%",
        "FPS",
        "AMD",
        "12%",
        "40,000",
        "100 watt",
        "half",
        "ECC Ram",
        "three",
        "AMD",
        "Build Redux",
        "CPU",
        "YouTube",
        "500",
        "an additional couple hundred bucks",
        "an extra 50 bucks",
        "a hundred watts",
        "UK",
        "8%",
        "Crucial Ballistix RAM",
        "third",
        "DDR5",
        "Z690",
        "two",
        "Intel",
        "Xeon",
        "Microsoft",
        "Explorer",
        "these days",
        "Core",
        "years"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "LOC",
        "ORG",
        "GPE",
        "DATE",
        "TIME",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "EVENT",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "PERCENT",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "FAC",
        "ORG",
        "GPE",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "GPE",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.07194686681032181,
        0.00945541262626648,
        -0.07639056444168091,
        -0.04259971156716347,
        0.03062594309449196,
        0.0038308892399072647,
        -0.0010547221172600985,
        0.027420159429311752,
        -0.0475519560277462,
        -0.005355039145797491,
        0.009443686343729496,
        -0.023987144231796265,
        0.012528734281659126,
        -0.10089988261461258,
        -0.011509095318615437,
        -0.01779772900044918,
        0.038672056049108505,
        0.021801045164465904,
        0.01911616511642933,
        -0.037657447159290314,
        -0.04955962300300598,
        -0.005416041240096092,
        -0.02036351151764393,
        -0.0030659895855933428,
        -0.04314123094081879,
        0.009427890181541443,
        0.054518941789865494,
        -0.0049860356375575066,
        -0.020357033237814903,
        -0.07342348992824554,
        0.042446110397577286,
        -0.007840758189558983,
        -0.014695863239467144,
        0.02211824804544449,
        0.0829763114452362,
        0.009685900993645191,
        0.013189533725380898,
        -0.11422686278820038,
        0.0007873511640354991,
        -0.07823280245065689,
        0.0040505980141460896,
        0.04222391918301582,
        -0.006184972822666168,
        0.012906127609312534,
        0.04511106386780739,
        0.017820162698626518,
        0.04415744170546532,
        -0.013894150033593178,
        0.000839524669572711,
        -0.015064306557178497,
        0.0539807453751564,
        0.026010379195213318,
        0.01681426167488098,
        0.0020893507171422243,
        -0.053193382918834686,
        -0.02691914699971676,
        -0.028583569452166557,
        0.009241914376616478,
        0.014883218333125114,
        0.010836029425263405,
        0.08438991755247116,
        -0.1351875215768814,
        -0.006212601438164711,
        0.028530018404126167,
        -0.0675271525979042,
        0.006365676410496235,
        0.08130743354558945,
        0.021726006641983986,
        -0.0064267548732459545,
        -0.0012989650713279843,
        -0.01799754984676838,
        -0.02161679044365883,
        -0.030107364058494568,
        0.10189542919397354,
        -0.03710173815488815,
        0.08253778517246246,
        0.011627898551523685,
        -0.0388508215546608,
        0.09705741703510284,
        -0.06819680333137512,
        -0.06173127517104149,
        -0.02449757046997547,
        -0.047551415860652924,
        -0.037503354251384735,
        0.07359999418258667,
        -0.038598399609327316,
        0.08746319264173508,
        0.054285041987895966,
        0.041186634451150894,
        -0.06031819060444832,
        0.07178326696157455,
        -0.02576059103012085,
        0.09718896448612213,
        0.01253718975931406,
        0.05549314245581627,
        0.04458373039960861,
        0.060704901814460754,
        -0.07968307286500931,
        -0.049854718148708344,
        0.03670770674943924,
        0.05604235827922821,
        0.06887877732515335,
        -0.02639690786600113,
        -0.010195506736636162,
        -0.011490844190120697,
        -0.0003120197798125446,
        0.0343385748565197,
        0.14353066682815552,
        -0.05318501219153404,
        0.002463140757754445,
        -0.01056989561766386,
        0.003963920287787914,
        -0.013208015821874142,
        -0.006096099503338337,
        0.0946894958615303,
        -0.02171112410724163,
        -0.022372877225279808,
        -0.056430116295814514,
        0.031441666185855865,
        0.007248110603541136,
        -0.040284425020217896,
        -0.013143004849553108,
        -0.03722204640507698,
        0.03174151852726936,
        -0.05601276457309723,
        0.001484725158661604,
        -0.09327784180641174,
        4.870144359801756e-33,
        -0.034213874489068985,
        0.05178150162100792,
        -0.1021055206656456,
        -0.03838108107447624,
        0.02520558051764965,
        0.024456415325403214,
        -0.01981346309185028,
        0.020006515085697174,
        -0.033582694828510284,
        -0.024779725819826126,
        -0.02774801105260849,
        -0.1144154891371727,
        -0.01871328242123127,
        0.05613039433956146,
        -0.0227634459733963,
        -0.04925280064344406,
        -0.02482118085026741,
        -0.020068418234586716,
        0.050450049340724945,
        0.08488327264785767,
        -0.035514090210199356,
        -0.09054950624704361,
        0.06475429236888885,
        -0.0864519327878952,
        0.09790722280740738,
        0.05007518082857132,
        0.01013307273387909,
        0.023915713652968407,
        0.12558026611804962,
        0.01964707486331463,
        0.020767878741025925,
        -0.12760838866233826,
        0.0030509040225297213,
        -0.06396838277578354,
        0.03025275096297264,
        0.02915813773870468,
        -0.042591117322444916,
        -0.04547499865293503,
        -0.00424715643748641,
        -0.06842442601919174,
        -0.01687171682715416,
        0.1167382076382637,
        -0.0760616585612297,
        -0.07061640918254852,
        0.0011970545165240765,
        -0.02562457136809826,
        0.05635252222418785,
        0.0772923156619072,
        0.030227234587073326,
        -0.02010282129049301,
        -0.0792178362607956,
        -0.03299587965011597,
        -0.12041162699460983,
        0.0030825729481875896,
        0.038336481899023056,
        -0.031756337732076645,
        0.015601680614054203,
        0.0004554521292448044,
        0.07905957102775574,
        0.10902605950832367,
        0.07703135162591934,
        -0.04486168548464775,
        -0.011872955597937107,
        0.02297375537455082,
        0.01564367301762104,
        0.05957630276679993,
        0.015447372570633888,
        0.08339482545852661,
        -0.12465590983629227,
        -0.09091918915510178,
        -0.022186854854226112,
        -0.07359258830547333,
        0.05237921327352524,
        0.04464167729020119,
        -0.018906230106949806,
        -0.002529632532969117,
        -0.03389047086238861,
        -0.0637301579117775,
        -0.08590688556432724,
        -0.007523892913013697,
        -0.0017937683733180165,
        -0.007900814525783062,
        -0.001557005220092833,
        0.07405422627925873,
        -0.03537306934595108,
        -0.004414803814142942,
        0.0027073367964476347,
        0.09249506145715714,
        -0.0055019124411046505,
        0.022410422563552856,
        0.04413863271474838,
        -0.014475338160991669,
        0.09099972993135452,
        0.006386104039847851,
        -0.11585387587547302,
        -6.655386732178765e-33,
        -0.07880587130784988,
        -0.044434405863285065,
        -0.00808503944426775,
        0.06134454533457756,
        -0.04728177189826965,
        -0.010329575277864933,
        0.030295755714178085,
        -0.024465158581733704,
        -0.023833386600017548,
        -0.026031656190752983,
        -0.02780136838555336,
        0.0025261719711124897,
        -0.00836942344903946,
        -0.07533647119998932,
        -0.03085114248096943,
        -0.06449723243713379,
        -0.06809072941541672,
        -0.04913586005568504,
        0.07130510360002518,
        0.028859511017799377,
        0.056439951062202454,
        0.019711902365088463,
        0.06512407213449478,
        -0.010544498451054096,
        -0.028056174516677856,
        0.07492735981941223,
        -0.07228156924247742,
        0.02381017804145813,
        -0.046159930527210236,
        0.021276621147990227,
        0.0035671298392117023,
        -0.030386682599782944,
        -0.03729114681482315,
        -0.020952433347702026,
        0.07203204929828644,
        -0.04885796457529068,
        0.13707628846168518,
        0.016456572338938713,
        -0.05345341935753822,
        -0.03862420842051506,
        0.0775405615568161,
        0.0901717022061348,
        -0.07483293861150742,
        -0.04579872637987137,
        0.05120062455534935,
        0.0031565390527248383,
        -0.051062677055597305,
        0.02425316534936428,
        -0.00805332139134407,
        0.01366507075726986,
        -0.06728695333003998,
        -0.054497309029102325,
        0.04254734888672829,
        0.06723674386739731,
        0.007404007483273745,
        -0.02312074787914753,
        0.05065946280956268,
        0.07041528820991516,
        0.02057209610939026,
        0.018247472122311592,
        -0.02503422647714615,
        -0.07152280956506729,
        0.0345161035656929,
        -0.06970597058534622,
        0.05356629565358162,
        -0.022158924490213394,
        0.02424202673137188,
        0.0685591772198677,
        -0.028038175776600838,
        0.026702674105763435,
        0.008294858038425446,
        -0.0780194029211998,
        -0.0054833595640957355,
        -0.05539419874548912,
        0.008129776455461979,
        0.047684445977211,
        -0.0034404920879751444,
        0.002848817268386483,
        0.0031947018578648567,
        -0.02949414774775505,
        -0.02796456217765808,
        0.034000322222709656,
        0.0110966507345438,
        0.04863129183650017,
        0.06754320114850998,
        -0.013363308273255825,
        0.03920235112309456,
        -0.05997708439826965,
        -0.03459344431757927,
        -0.06432413309812546,
        -0.10383649915456772,
        -0.0652213767170906,
        0.00917984452098608,
        -0.01620832458138466,
        -0.06857900321483612,
        -6.378573402798793e-08,
        -0.03968040645122528,
        -0.026968682184815407,
        0.035377759486436844,
        -0.005206526722759008,
        -0.007182706147432327,
        -0.12104340642690659,
        -0.05528775230050087,
        -0.027604471892118454,
        0.08059649169445038,
        -0.06920836865901947,
        0.09019510447978973,
        -0.04856525734066963,
        -0.02365918830037117,
        -0.02573632076382637,
        0.033740848302841187,
        0.01935753785073757,
        -0.016929037868976593,
        0.06187816336750984,
        0.0027203497011214495,
        -0.02771635167300701,
        0.002647483954206109,
        -0.0004187104641459882,
        0.057607393711805344,
        -0.014993044547736645,
        0.08346778154373169,
        -0.05329524725675583,
        0.07274279743432999,
        0.10242218524217606,
        0.03640759736299515,
        -0.05938505381345749,
        -0.06336372345685959,
        -0.041506703943014145,
        0.06902564316987991,
        -0.0591217540204525,
        0.08298474550247192,
        -0.024343548342585564,
        -0.02168128825724125,
        0.030388405546545982,
        0.11953142285346985,
        0.05644509568810463,
        -0.0012403224827721715,
        -0.017244864255189896,
        -0.003581638913601637,
        -0.021234331652522087,
        0.06446492671966553,
        -0.0192930418998003,
        -0.06154322624206543,
        -0.06574969738721848,
        -0.04488378018140793,
        0.04957326874136925,
        0.012464948929846287,
        0.047921072691679,
        0.013351594097912312,
        0.015662675723433495,
        0.019994691014289856,
        -0.01838831789791584,
        -0.03761442005634308,
        -0.028449246659874916,
        0.03418511524796486,
        0.09428293257951736,
        0.03127872571349144,
        -0.014859319664537907,
        -0.07570517808198929,
        0.0027445657178759575
    ]
}