{
    "id": "4WB9TXrszfM",
    "title": "Is Windows 10X the future of PCs?",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-03-15T16:39:44Z",
    "video_url": "https://www.youtube.com/watch?v=4WB9TXrszfM",
    "category": "People & Blogs",
    "tags": [
        "folding",
        "fold",
        "devices",
        "microsoft",
        "new",
        "Operating System",
        "Gaming",
        "2020",
        "OS",
        "10x",
        "future"
    ],
    "views": 1227501,
    "likes": 46829,
    "comments_count": 5168,
    "description": "Windows 10X is an exciting new operating system from Microsoft that's focused around multi-screen setups. What's it like, and is it really the future?  Buy Windows 10 OS Software On Amazon (Paid Link):  On Staples (Paid Link):  On NewEgg (Paid Link):  On Walmart (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://geni.us/MiNMjTI",
        "https://shop-links.co/1725431960561576213",
        "https://geni.us/RLgW",
        "https://geni.us/C34Bh8x",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- How long has it been since Windows 10 launched? It's been like five years almost, feel old, but now there's a replacement, kind of. It's weird. It's Windows 10X, or 10 10. I don't know what to call it, to be honest. But it's a companion to Windows 10 devices that happened to have dual screens. So like foldable laptops. That new surface device it's coming out. Obviously, Microsoft couldn't just use the standard Windows 10 that they've had for, well, five years. They had to come up with something that's a little bit more mobile device friendly. You might've remembered Windows RT back in the day. Maybe you don't. It wasn't very popular. But basically it was a version of Windows that was specifically tailor-made to run on low power hardware that is very mobile. This is actually surprisingly similar, as a kind of a first for short circuit. Let's dive into the software. I'm just gonna go ahead and hit start. And hopefully it won't error out on me because it seems to be a little bit flaky and I'm not sure why. All right, now there it is. It's a pretty simple looking desktop. Look at that, it's not like your traditional Start Menu. It doesn't have tiles. It doesn't have live updating, anything. It doesn't even have a list of anything. This is a lot more like what you would find on like an Android app. This looks like your Task View. We don't have anything open right now. And as you can see, there's another bar down here, which is for the other screen, but there's also this down here. This is the new Action Center. Quick access to all these toggles here, like your volume, your brightness. And one thing you might notice here is rotation lock. This has meant for mobile devices, devices that are going to be held in your hand, and you can rotate it any way you want. Would you look at that? They come up just fine. So now it's in landscape landscape or portrait of two line. Right clicking on the desktop just gives us a change your background thing, where we can also open up the settings for that. There are rumors that Microsoft is looking to do something similar to the dynamic wallpapers that macOS is using, but I don't see it on here right now. Here we've got Microsoft Edge, Mail, Calendar, Photos, Microsoft Store, File Explorer, all the stuff that you'd normally expect, but they operate slightly differently. Let's open up File Explorer. That's pretty different. All we have are these five folders here: Downloads, Documents, Pictures, Music, and Videos. But there's nothing else. I can't go to the C Drive. I don't think I can even go to any network places. One thing you might not have noticed is that this is full screen. It's taking up an entire screen. Now, if I tried to, say, move it, it'll just go back to full screen. If I move it to the other one, they'll take up that full screen. And if I move it in between, it'll take up both screens all at once, but you can't have a window. Apparently, Microsoft is open to changing this or having a setting or making it so that if you plug in a keyboard and mouse, or if you have a big enough device, you'd be able to use Windows. So maybe let them know what you think if you decide to download this for yourself. It does require Windows 10 Pro to try out this preview. Some apps don't actually have a proper Title Bar. It seems like something you'd be able to drag, but not so much. Yeah, there we go. Let's like fully maximize the Calculator. Yeah, that's ridiculous. I know that with a touch device, it's going to be a little bit difficult to run actual Windows, but still. We have arrow snap. We can snap to corners in Windows. We can do the same thing on mobile. I don't see why not. Let's fire up Edge and I don't, download a file. Let's download a program. \"You'll be ready to browse in three easy steps.\" Let's set up your new tab page. Inspirational, informational, focused. Sign in to sync data. Nah. Done. Okay. Oh yeah, there it goes. Interesting. So I can have Windows. They just need to be a standard Windows program. I guess anything in the universal Windows platform format. Like all of these apps. Straight up will only run in full screen. I guess they don't expect people to use touch as long as they're launching these legacy apps, like the standard Windows programs. So we're just gonna go ahead and install it here. Can I? No. Okay. So the seven zip window itself is just like everything else. I can only have it one of three ways. One screen, the other screen, or both. Okay. And if we go to Options. Yeah, that's pretty much standard. What's in computer though? So what we're seeing here is a representation of a C drive that realistically, this doesn't really have access to. The way Microsoft is handling these legacy apps is by a something called containering. So it's almost like Windows 10 is running underneath Windows 10X. And as a result, those programs aren't actually able to directly interact with Windows 10X, at least on a system level. So you can't change any system files. You can't partition your hard drive or anything like that. You're limited to whatever non-administrative tasks that those applications allow you to do. Windows 10X is starting down a path that seems a lot like lockdown. Like it seems very much like Microsoft is going to really push the Microsoft Store here. And speaking of which, let's take a look inside and see what we can grab. I have this window here. It's like a sub window that just popped up, asking me to sign into my Microsoft Account. And I can move that wherever I want, but wherever I move it, it just snaps back to the main window. It seems like this is the direction Microsoft wants to go with Windows 10X. And that may be a little bit concerning to some of you because chances are they're going to backport that to Windows, which means we might see a Mac like gatekeeper, trusted applications type thing, where the Windows Store becomes the preferred way to install anything, which, I mean, from a security standpoint, that's way better. How much of your freedom do you use your computer? Do you want to give up in order to secure it? Speaking of which, let's just go through the Settings real quick and see if there's anything particularly interesting. The Personalization, we can choose a color. We can go with orange. Oh, they do have a dark mode. Cool. And we can set the size of the Taskbar. So I guess we want a larger, then we could do that. But yeah, it looks like a shift back to Windows 8, almost, where we have this device thing here. And you don't really have a File Manager per se, but you can use a File Manager. It's really strange how it all works out. Well, Microsoft claims over and over again that this is going to be fully compatible with all your old Windows programs, unlike Windows RT, which was that a terrible Windows 8 version. But at the same time, if they're sandboxing everything into their own little play areas, and what does that mean for inter-app compatibility? There's no system tray. So if you close an application that would normally go there, then I'm not quite sure what happens to it, then. I do know that if you minimize an app, then what happens is it actually doesn't run in the background. And Microsoft claims this is for battery life and CPU usage. I don't know. It seems like they already know the direction they wanna go with this. Like, remember the Charms Bar, for example. That's kind of what this is. If you swipe up from the bottom with a touch gesture, that comes up. And if you look at it, it looks a lot like the Charms Bar used to. Actual Windows 10 was more or less Microsoft's way of backpedaling a little bit and saying, \"Okay, we know that you want something \"that's a little bit less futuristic, \"a little bit less simplified. \"So here's Windows 10. \"In the meantime, we'll work on this.\" Here we are with this. And it just feels like Windows 8 again. To be fair, I didn't hate Windows eight interface, but a lot of people did. It's impossible to know the answers to all my questions until we have real hardware to work with. Hardware is due out in the second half of this year. So I guess we'll see soon. It just is. And maybe that's enough. If you liked this video and if you want to see more software or hardware, anything really, go ahead and subscribe to Short Circuit. We'll have more for you.",
    "transcript_keywords": [
        "Windows",
        "Microsoft",
        "window",
        "standard Windows",
        "screen",
        "Microsoft Store",
        "Windows programs",
        "bit",
        "File",
        "thing",
        "actual Windows",
        "Windows Store",
        "device",
        "File Explorer",
        "full screen",
        "bar",
        "move",
        "File Manager",
        "Yeah",
        "Microsoft claims"
    ],
    "transcript_entity_values": [
        "Music",
        "seven",
        "the day",
        "Windows",
        "Windows eight",
        "Windows 10X.",
        "three",
        "One",
        "one",
        "the C Drive",
        "Title Bar",
        "Downloads, Documents, Pictures",
        "Mac",
        "Windows 8",
        "the second half of this year",
        "Windows",
        "Windows RT",
        "Action Center",
        "File Explorer",
        "the Charms Bar",
        "Microsoft",
        "Edge",
        "Windows",
        "the Microsoft Store",
        "Microsoft Edge, Mail",
        "first",
        "two",
        "Windows 10",
        "Android",
        "five years",
        "Windows",
        "Videos",
        "the Windows Store",
        "Short Circuit",
        "10 10",
        "Task View",
        "CPU",
        "five",
        "macOS",
        "Windows 10 Pro",
        "Calendar"
    ],
    "transcript_entity_types": [
        "GPE",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "ORG",
        "FAC",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "LAW",
        "PERSON"
    ],
    "vector": [
        -0.10775920748710632,
        0.004634073935449123,
        0.08231650292873383,
        -0.04898250102996826,
        0.07695141434669495,
        0.07122337073087692,
        0.02096942625939846,
        0.03723128139972687,
        -0.044599950313568115,
        -0.004593365825712681,
        0.024060318246483803,
        0.11177503317594528,
        0.017727931961417198,
        0.06765096634626389,
        0.07174737006425858,
        0.02748374082148075,
        -0.023957407101988792,
        -0.09618709981441498,
        -0.09752152860164642,
        0.07303889840841293,
        -0.027725476771593094,
        -0.056917835026979446,
        -0.0626177117228508,
        -0.032210007309913635,
        0.009401417337357998,
        -0.03306245431303978,
        -0.054153311997652054,
        -0.13066168129444122,
        -0.02307298593223095,
        0.05482346564531326,
        0.009755337610840797,
        0.08600218594074249,
        -0.02564885839819908,
        0.06949236989021301,
        -0.043474797159433365,
        -0.11723396927118301,
        0.0009532765834592283,
        -0.030362620949745178,
        -0.06651443243026733,
        -0.12422380596399307,
        -0.021087275817990303,
        -0.06487105041742325,
        -0.03954735025763512,
        0.0437791533768177,
        0.06076357141137123,
        -0.04214340075850487,
        0.03461921215057373,
        -0.02859489805996418,
        -0.0639711320400238,
        0.029886433854699135,
        -0.020827656611800194,
        -0.1083371564745903,
        0.0650143176317215,
        -0.07446327805519104,
        -0.05166199803352356,
        -0.05088222771883011,
        -0.0022576518822461367,
        0.01754136011004448,
        0.01538250595331192,
        -0.058373965322971344,
        0.0555875301361084,
        -0.11514901369810104,
        -0.05012417584657669,
        0.06033319979906082,
        0.011266805231571198,
        0.024939220398664474,
        -0.03975731134414673,
        -0.0479840449988842,
        -0.014012995176017284,
        -0.040269698947668076,
        -0.0632951483130455,
        -0.03557170554995537,
        0.02265244349837303,
        -0.03288755565881729,
        -0.018452798947691917,
        -0.0037819535937160254,
        0.09713698923587799,
        0.0057578724808990955,
        -0.02839481085538864,
        0.0036652551498264074,
        0.04198281839489937,
        0.04628842696547508,
        -0.03837422654032707,
        -0.0751960277557373,
        -0.07133571058511734,
        -0.01808849163353443,
        -0.05669455602765083,
        0.012695344164967537,
        -0.07161202281713486,
        -0.042516205459833145,
        -0.06540214270353317,
        0.050878703594207764,
        0.029679100960493088,
        0.037614528089761734,
        0.019058704376220703,
        -0.009822586551308632,
        0.02804633416235447,
        -0.03706379607319832,
        0.020386768504977226,
        -0.026239190250635147,
        0.012020024470984936,
        0.07208333164453506,
        0.14615194499492645,
        -0.04278959706425667,
        -0.009433782659471035,
        -0.08381885290145874,
        0.008871838450431824,
        -0.003844054415822029,
        -0.01731172204017639,
        -0.030252689495682716,
        -0.00663948617875576,
        0.007076296489685774,
        -0.052508868277072906,
        -0.031969137489795685,
        0.05152330547571182,
        -0.05452890321612358,
        -0.036714594811201096,
        -0.00040130666457116604,
        0.12099010497331619,
        0.04143131151795387,
        0.0213247649371624,
        -0.04308593273162842,
        -0.06157312169671059,
        -0.07291169464588165,
        0.027573585510253906,
        0.07158034294843674,
        -0.048327282071113586,
        9.760603466037628e-34,
        -0.0008700995240360498,
        0.02476501651108265,
        -0.06091868504881859,
        0.006310968194156885,
        0.037829507142305374,
        -0.004422952886670828,
        0.016643952578306198,
        0.03286655992269516,
        -0.011432209052145481,
        -0.022901123389601707,
        -0.028129132464528084,
        0.024848241358995438,
        -0.04091067984700203,
        0.02481764927506447,
        0.10993311554193497,
        -0.053099777549505234,
        -0.08740537613630295,
        0.03812241554260254,
        0.021012507379055023,
        0.027565848082304,
        0.007273072376847267,
        0.01878459006547928,
        0.02081495150923729,
        -0.05235445499420166,
        0.015107917599380016,
        -0.07135090976953506,
        -0.05200925096869469,
        0.002871961332857609,
        0.056272078305482864,
        0.011041334830224514,
        -0.07416680455207825,
        0.058176856487989426,
        0.007757178973406553,
        -0.05335787311196327,
        -0.016218218952417374,
        0.036163490265607834,
        0.04582931473851204,
        -0.08383941650390625,
        0.10675883293151855,
        -0.03505754470825195,
        -0.09718085825443268,
        -0.0159876961261034,
        0.035241927951574326,
        -0.022017912939190865,
        0.06672196835279465,
        -0.022141842171549797,
        0.014852648600935936,
        0.035749323666095734,
        -0.0519372820854187,
        -0.05000939965248108,
        -0.06831511110067368,
        0.0574229434132576,
        -0.013016605749726295,
        0.04315890371799469,
        -0.023282596841454506,
        -0.009574376977980137,
        0.01749938726425171,
        -0.04116188362240791,
        0.035374484956264496,
        0.07832086831331253,
        0.05485465005040169,
        0.006256826687604189,
        -0.036954522132873535,
        0.030905896797776222,
        -0.036757051944732666,
        -0.010195382870733738,
        0.19904671609401703,
        0.07249191403388977,
        -0.03064494952559471,
        0.07854235172271729,
        0.03348344564437866,
        -0.03238382562994957,
        -0.1049283817410469,
        -0.036331161856651306,
        0.0707501620054245,
        0.04046010226011276,
        0.04912252351641655,
        -0.02141008898615837,
        0.006280778907239437,
        0.04919074475765228,
        0.015605418011546135,
        0.1076633557677269,
        -0.0013780603185296059,
        0.0077237715013325214,
        0.018754957243800163,
        0.031450044363737106,
        0.006533820182085037,
        -0.08109694719314575,
        0.005557033233344555,
        0.02177351526916027,
        -0.03891801834106445,
        -0.018377160653471947,
        -0.014002903364598751,
        0.06304735690355301,
        0.001265983679331839,
        -2.09537121024453e-33,
        -0.0024275099858641624,
        -0.045064616948366165,
        -0.07109580188989639,
        0.0006983691710047424,
        -0.05370094254612923,
        0.007696871180087328,
        0.050246711820364,
        -0.013424529694020748,
        -0.011805491521954536,
        -0.025726309046149254,
        0.01808382011950016,
        0.03731822967529297,
        0.05391179770231247,
        0.05123575031757355,
        -0.007429659832268953,
        0.02521778643131256,
        0.037421293556690216,
        -0.08238369971513748,
        -0.0032098046503961086,
        -0.030557753518223763,
        0.08635558187961578,
        0.02687910757958889,
        -0.0928468182682991,
        -0.01073446311056614,
        -0.012842223048210144,
        -0.03792429342865944,
        -0.02908181957900524,
        -0.06907619535923004,
        -0.019587978720664978,
        0.026859018951654434,
        -0.03345635160803795,
        -0.06537744402885437,
        0.026359912008047104,
        0.007039855699986219,
        0.15843284130096436,
        -0.02957252785563469,
        0.009776010178029537,
        -0.11014237254858017,
        -0.005727632436901331,
        -0.03178519383072853,
        0.02558824047446251,
        -0.014326498843729496,
        0.018694959580898285,
        0.019293030723929405,
        0.07174411416053772,
        0.037809066474437714,
        -0.02473224140703678,
        -0.01787569932639599,
        0.010203302837908268,
        0.03402061387896538,
        0.04900868237018585,
        0.01709907501935959,
        0.01577604003250599,
        0.0033697830513119698,
        -0.03219539672136307,
        -0.10786593705415726,
        -0.06315185129642487,
        0.023063605651259422,
        -0.06541227549314499,
        -0.018227469176054,
        -0.020829031243920326,
        0.016047019511461258,
        0.005482823122292757,
        -0.055485308170318604,
        0.02410884201526642,
        0.11289361864328384,
        0.06561261415481567,
        -0.02101222425699234,
        -0.08231227099895477,
        -0.025578245520591736,
        -0.02538815699517727,
        -0.03288976848125458,
        -0.08436989039182663,
        -0.091000497341156,
        -0.042557671666145325,
        0.08013993501663208,
        0.08450757712125778,
        -0.02633051387965679,
        -0.024530816823244095,
        0.020709238946437836,
        0.0025579954963177443,
        0.002863534027710557,
        0.04698900878429413,
        -0.020001931115984917,
        0.03982052952051163,
        -0.018967097625136375,
        -0.03064602240920067,
        0.014578784815967083,
        -0.05665463209152222,
        -0.0025171907618641853,
        -0.007210427429527044,
        -0.014441162347793579,
        -0.047719068825244904,
        0.08269604295492172,
        0.05950323864817619,
        -4.579077028665779e-08,
        0.004357085097581148,
        0.012894327752292156,
        0.020470688119530678,
        -0.022921917960047722,
        -0.005833794828504324,
        -0.02125602960586548,
        0.053829435259103775,
        0.005807557143270969,
        0.010530355386435986,
        0.07064919918775558,
        0.04202944412827492,
        -0.10448551177978516,
        0.005700284149497747,
        0.05258708447217941,
        0.06165742874145508,
        0.07760821282863617,
        -0.06997904926538467,
        0.020813876762986183,
        0.004197399131953716,
        0.01353251188993454,
        -0.00963646825402975,
        0.09106792509555817,
        0.07505923509597778,
        -0.019453851506114006,
        -0.009066260419785976,
        0.032692018896341324,
        -0.011105206795036793,
        0.011838611215353012,
        0.06036112830042839,
        0.0033103525638580322,
        -0.002523417817428708,
        -0.015973640605807304,
        -0.027897177264094353,
        0.012093610130250454,
        -0.012682104483246803,
        -0.06533849984407425,
        0.032235678285360336,
        0.10796387493610382,
        0.14413754642009735,
        0.017432747408747673,
        -0.020373564213514328,
        -0.03353958576917648,
        -0.03939348831772804,
        0.05675825476646423,
        0.03218351677060127,
        -0.009029663167893887,
        -0.060348030179739,
        -0.028701696544885635,
        -0.023362739011645317,
        0.021478280425071716,
        -0.06778362393379211,
        0.02276088483631611,
        0.03980401158332825,
        0.048123978078365326,
        0.00040936961886473,
        -0.0009013107046484947,
        0.04179656505584717,
        -0.027741804718971252,
        0.038087550550699234,
        0.10061123967170715,
        0.015492922626435757,
        -0.0326620452105999,
        0.035203717648983,
        0.09977927803993225
    ]
}