{
    "id": "56DSH8tKUvo",
    "title": "Furnaces: Why we still burn fuel to heat our homes",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2017-03-01T06:57:03Z",
    "video_url": "https://www.youtube.com/watch?v=56DSH8tKUvo",
    "category": "Science & Technology",
    "tags": [
        "electric heat",
        "heat pump",
        "furnace",
        "natural gas",
        "gas furnace",
        "gas vs electric",
        "wind power",
        "solar power",
        "home heating",
        "electric furnace",
        "radiator"
    ],
    "views": 510391,
    "likes": 18789,
    "comments_count": 2323,
    "description": "Ever wonder why the gas-fired furnace is still so prevalent?  Why isn't electric heat the standard?  Well, wonder no more as we explore the economic and practical reasons the gas-fired furnace is so ubiquitous in colder climates, and how in the future this is almost certainly going to change.  Technology Connections is a channel exploring how the technological do-dads in our homes work and why we use them.  If you like videos like this, hit that subscribe button!  You know you want to...",
    "description_links": [],
    "transcript": "I want to talk about an invention you likely take for granted. Your furnace. If you live in an area that gets pretty cold during the winter time, odds are you have a gas-fired furnace heating your home. Since you have gas lines in your house, you likely cook with a gas-fired stove and oven, and if you have a clothes dryer it is likely also fueled with gas. Even rural areas that don't have the infrastructure to deliver natural gas via pipelines typically will utilize gas fired furnaces that run on propane, with businesses similar to Hank Hills refilling the tanks of farm dwellers Nationwide. Now you probably know that for every one of these gas-fired inventions, there exists an electric counterpart. Electric furnaces are indeed a thing and can be used to provide heat to the living space. Electric stoves are very common. And electric clothes dryers are very common too. In fact in areas that don't get that cold, you'll often see most of these appliances being largely Electric. So then, why has the use of natural gas for the furnace and other appliances remained a staple of the midwestern home and elsewhere? Well the answer is simple, and it has to do with efficiency. But as were about to see, this is going to change. For now, a furnace like this is designed to burn a fuel such as natural gas and release the heat of that fuel into the living space. Furnaces are wonderful at doing this, even the most basic gas-fired furnaces are 80% efficient or more. This means that they release at least 80% of the heat energy contained in natural gas into the living space. In areas that remain cold for a long period of the year, having an efficient furnace is very very important. Now, gas-fired furnaces are usually 80 to 90% efficient. But electric heat is actually 100% efficient. Sort of. Well get back to that. Electric heat is incredibly simple. This is a $10 space heater that works just fine. It's able to be so cheap because all it is is a coil of nichrome wire and a fan to blow air past the wire. The most expensive component in this space heater is likely the fan motor. Just as a point of comparison, this heater puts out 5,120 btus, and the furnace for my apartment delivers 45,000. So less than 9 of these little guys could replace the furnace, maybe even fewer since furnaces are typically sized a little larger than required to combat nastily cold days. Of course space heaters are a terrible source of permanent heat for many many reasons, most important of which is safety, but nevertheless it would work if there were enough separate circuits throughout the apartment to power them all together. Electric heat is so simple because all you need to do is run an electric current through a resistive material, and that material will heat up. 100% of the electrical energy you put through that material will be released as heat. This is the reason why electric heat is itself 100% efficient. See when we talk about making electronic devices more energy efficient, we are actually talking about reducing wasted heat. That's why modern LED lights bulbs are so much more efficient than their Antiquated incandescent counterpart--per unit of light, they waste less energy as heat. But when your goal is to create heat, you can't get it any more efficient than 100%. Sort of. Hold on, I promise were getting somewhere. A gas-fired furnace compared to a space heater is incredibly complex. It requires a sophisticated control system to monitor and regulate gas flow as well as ignite the flames upon startup. It requires an expensive heat exchanger to actually combust the gas safely and get the exhaust from this process away from the living space. And it requires multiple fans and motors to both expel exhaust and move air through the furnace. But putting up with all of this makes far more sense in cold climates then using electric heat. See, although electric heat itself is 100% Efficient, Electric power generation is nowhere near that amount. So long as we continue to use fossil fuels to generate electricity, then using the fossil fuel itself to heat makes far more sense. A typical natural gas-fired electric power plant will be about 40% efficient. Subtract a few percentage points for transmission losses (though in reality transmission losses are very small across the electric grid), and you're looking at a fuel to heat efficiency of about 37% or so for an electric space heater. This means that even the most basic gas-fired furnace uses less than half the amount of fuel to produce the same amount of heat. And that means that gas heat is a lot cheaper than electric heat, and it uses far less of our precious natural resources. And thus in cold climates, it makes far more sense to have natural gas infrastructure capable of delivering the gas itself to homes and businesses then it does to rely solely on electricity for heat. A lot of natural gas would be wasted if it was only used to generate electricity. But this is almost certainly going to change. Our electric grid is very soon going to become 100% renewable, or at least zero percent fossil-fuel if nuclear power remains viable. To be clear, very soon probably doesn't mean in the next 10 years or so, but likely within our lifetimes. As solar and wind energy continues to get cheaper and more ubiquitous, the electric grid will become larger with less resources required to fuel it. Now of course we have energy storage and demand problems to get sorted out, but I have faith that with the Monstrous projects Humanity has taken on in the past, we'll find a way around it. Once we have an electric grid capable of heating everyone's homes with electricity, and its able to do so at a cost that is less than Natural Gas or propane, you should expect to see electric stoves, electric dryers and electric furnaces in every home. This will come with so many advantages to help make our lives more enjoyable. For one thing, electric heat is so much more reliable than gas-fired Heat. One of the most reliable sources of electric heat is the radiant baseboard heater. These are still fairly common in older apartment buildings, and you can buy them new for new construction. Electric baseboard heating does have the disadvantage of taking up some visible space in every room, but it is completely silent and lacks any moving Parts whatsoever. It is common to not have to replace these for decades if at all. Plus, if installed correctly, they offer a comfort advantage as they create a flow of warm air rising in front of windows and outside walls, creating an air curtain that reduces drafts. But did you know there is actually an electric heating solution that is not 100% efficient, but up to 400% efficient? Now before you start saying that breaks the laws of thermodynamics, trust me, it doesnt. I'm talking about a heat pump. Heat pumps are amazing things that have been around for quite a while but are only just now picking up steam. A heat pump is essentially a modified air conditioner that is able to operate in reverse. See, air conditioners actually move three to four times as much energy than they consume. An 8000 BTU air conditioner and heat pump might only use a quarter of the electricity that an 8000 BTU resistive space heater would. This means that even with a natural gas fired power plant, a heat pump can move more heat energy into a living space than the natural gas itself contains, as 37% times 4 is 148 percent. This is possible because the mechanical energy of the compressor in an air conditioner is used to move a refrigerant from a low pressure state to a high pressure state, and its the phase-change that occurs from gas to liquid and back again inside a pair of heat exchangers that actually absorbs and expels energy, moving heat energy from one place to another across a barrier. I'm going to talk about this more in a later video, but for now, know that the heat pump is very likely going to become more and more popular. Right now they don't work so well in climates like mine because when the temperature outside drops below freezing, the efficiency of a heat pump diminishes rapidly. However, heat pumps are being combined with geothermal heat sources which circulate a heat transfer fluid underground to pick up heat from Earth's crust. These systems maintain a high efficiency level even on the coldest of days. While editing this video, I realized I needed to clarify one thing about heat pumps. The fact that their efficiency diminishes below freezing isnt the biggest problem. Even in temperatures far below freezing, they often can move more energy than they consume. But along with getting less efficient, their actual heat output also drops. So even though a heat pump may be producing twice the amount of heat energy for the living space as it consumes, the fact is that its now providing less heat. So while a heat pump may provide 20,000 btus of heat when its 45 degrees fahrenheit outside, about 7 celsius, it might only produce half that when its 20 degrees outside, about minus 7. Without a geothermal system in place to absorb heat from, the heat pump must be supplemented by a second type of heat. Now I happen to know that PTACs, the air conditioning and heater units commonly found in hotels, are starting to also incorporate a heat pump. This makes sense because a heat pump is really just an air conditioner with a couple of reversing valves added. These newer units can tell when its too cold outside for the heat pump to provide enough heat, and will automatically switch to using the resistive heater when necessary. I think that this sort of logic might as well be incorporated into a general heating and cooling system, as in the spring and fall months, even in a cold climate, there are times that a heat pump could be effective. If youre installing an air conditioner, you might as well spend the extra dollars and make it a heat pump. Anyway, back to the rest of the video. To be clear, the gas-fired furnace is going to stick around for a little while. Until the point where electricity gets cheap enough, and heat pumps become popular and effective enough to provide cheaper heat than a traditional furnace, well natural gas heat still going to be popular. But it is already the case that solar and wind energy are cheaper than fossil fuels. After all, once a solar panel is constructed, it captures energy from the Sun and doesn't need any sort of fuel to create electricity. The Same goes for wind power. Once a feasible storage solution is figured out to deal with the intermittency problems of wind and solar, nearly our whole world will be powered with electricity. And when that happens, well there will be no need for gas lines anymore. Thanks for watching this video on technology connections. If you like videos like this, I humbly ask that you hit the thumbs-up And subscribe to technology connections. I'm doing my best to keep videos like this coming your way. I'll see you next time.",
    "transcript_keywords": [
        "heat",
        "heat pump",
        "electric",
        "electric heat",
        "gas",
        "natural gas",
        "pump",
        "furnace",
        "energy",
        "efficient",
        "space",
        "natural",
        "Heat pumps",
        "air",
        "heat energy",
        "gasfired",
        "furnaces",
        "heater",
        "gasfired furnace",
        "living space"
    ],
    "transcript_entity_values": [
        "37%",
        "half",
        "20,000",
        "the coldest of days",
        "Hank Hills",
        "the next 10 years or so",
        "less than 9",
        "10",
        "the spring and fall months",
        "about minus 7",
        "Antiquated",
        "decades",
        "80%",
        "winter",
        "at least zero percent",
        "Heat",
        "less than half",
        "Parts",
        "100%",
        "400%",
        "5,120",
        "one",
        "4",
        "20 degrees",
        "at least 80%",
        "Earth",
        "three to four",
        "148 percent",
        "One",
        "8000",
        "45 degrees fahrenheit",
        "45,000",
        "Electric",
        "about 7 celsius",
        "second",
        "about 40%",
        "Sun",
        "days",
        "about 37%",
        "80 to 90%",
        "8000 BTU"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "GPE",
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "PERCENT",
        "DATE",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "LOC",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "PERCENT",
        "ORG",
        "DATE",
        "PERCENT",
        "PERCENT",
        "QUANTITY"
    ],
    "vector": [
        0.0027883308939635754,
        0.023925231769680977,
        -0.017204830422997475,
        0.05834481120109558,
        0.07543141394853592,
        0.01092473417520523,
        -0.00516428891569376,
        0.03158130869269371,
        0.014632483012974262,
        0.024244075641036034,
        -0.062417834997177124,
        0.014731008559465408,
        -0.014915525913238525,
        0.0016763765597715974,
        0.070255346596241,
        -0.013591493479907513,
        0.025348270311951637,
        -0.08566431701183319,
        -0.01906425505876541,
        -0.08724725991487503,
        0.04839395731687546,
        0.017607776448130608,
        0.06644826382398605,
        0.027445927262306213,
        0.024358980357646942,
        -0.002942251041531563,
        -0.03395850211381912,
        0.02271393872797489,
        -0.10719092190265656,
        0.08829434216022491,
        -0.04645171016454697,
        -0.004842632450163364,
        -0.06898591667413712,
        0.02002268098294735,
        -0.03195517510175705,
        -0.030607515946030617,
        0.029269566759467125,
        0.13803286850452423,
        -0.009634623304009438,
        0.025327684357762337,
        -0.008672960102558136,
        -0.15906111896038055,
        0.05233334004878998,
        -0.04199112206697464,
        -0.08732669800519943,
        -0.025698795914649963,
        -0.025512119755148888,
        -0.04518444091081619,
        -0.0746467337012291,
        -0.031100742518901825,
        0.00393791263923049,
        0.08564015477895737,
        -0.05676829814910889,
        0.040103450417518616,
        -0.009662841446697712,
        -0.030057918280363083,
        0.026906153187155724,
        0.013436897657811642,
        -0.013623437844216824,
        -0.0501631535589695,
        0.031403135508298874,
        -0.07644649595022202,
        -0.08408540487289429,
        0.030529141426086426,
        0.013590437360107899,
        -0.049212925136089325,
        0.07740294933319092,
        0.04179375618696213,
        0.06614681333303452,
        -0.09037508070468903,
        -0.04977673292160034,
        0.01249678898602724,
        -0.05180404335260391,
        0.02875925973057747,
        -0.04590754956007004,
        -0.0016436259029433131,
        0.088839091360569,
        0.022660400718450546,
        0.0364738330245018,
        -0.025287944823503494,
        0.03216090425848961,
        0.05696679279208183,
        0.0160616934299469,
        -0.040425464510917664,
        -0.07552524656057358,
        0.10337488353252411,
        -0.06770733743906021,
        0.013914241455495358,
        0.10200224071741104,
        -0.08407335728406906,
        -0.017972275614738464,
        0.0046023293398320675,
        -0.009405333548784256,
        0.04685709998011589,
        0.03654206916689873,
        -0.013171158730983734,
        0.043773241341114044,
        0.04349689930677414,
        0.02169918082654476,
        -0.051167432218790054,
        0.026629695668816566,
        -0.05909266322851181,
        -0.017961185425519943,
        0.007393535692244768,
        -0.0059276060201227665,
        0.0029222192242741585,
        -0.008181375451385975,
        0.008618076331913471,
        -5.9120884543517604e-05,
        -0.050084188580513,
        -0.04400409385561943,
        0.03178602084517479,
        -0.017803655937314034,
        -0.031243998557329178,
        0.031183460727334023,
        -0.03948131948709488,
        0.0020952257327735424,
        -0.03454319015145302,
        -0.0014295243890956044,
        0.08186066150665283,
        -0.07478811591863632,
        0.040677983313798904,
        -0.05553550645709038,
        0.04098000377416611,
        0.07953526079654694,
        0.06272634863853455,
        -0.01721632294356823,
        1.878199730956066e-33,
        -0.06590066105127335,
        0.059144146740436554,
        0.05954508110880852,
        0.060521792620420456,
        0.025903303176164627,
        0.04317230358719826,
        -0.05094635859131813,
        -0.026431379839777946,
        0.03406882658600807,
        0.04617636650800705,
        0.03538468852639198,
        0.09117785841226578,
        0.022989433258771896,
        0.0893043801188469,
        0.009133481420576572,
        -0.07184720784425735,
        0.011945498175919056,
        -0.02155814692378044,
        0.04278384521603584,
        -0.017487216740846634,
        -0.05718322470784187,
        0.010788090527057648,
        0.10592085123062134,
        -0.010683184489607811,
        -0.03563769534230232,
        -0.039628345519304276,
        0.08242913335561752,
        0.03156514838337898,
        -0.04603716358542442,
        0.0013912764843553305,
        0.0655062273144722,
        -0.027364742010831833,
        -0.003678580978885293,
        -0.04087371006608009,
        -0.03393684700131416,
        -0.0721600353717804,
        -0.04294420778751373,
        -0.020434575155377388,
        0.0009002533624880016,
        0.03796671703457832,
        -0.01593591645359993,
        -0.008329417556524277,
        -0.01301669143140316,
        0.007458942476660013,
        0.046035878360271454,
        -0.013457841239869595,
        -0.0281938798725605,
        0.09625528752803802,
        -0.10248476266860962,
        -0.03891842067241669,
        0.00637660501524806,
        0.05593716725707054,
        0.014211270026862621,
        -0.04576510190963745,
        0.06011854112148285,
        0.007748729083687067,
        0.024900300428271294,
        -0.1160125806927681,
        0.06011998653411865,
        -0.012553764507174492,
        -0.05349932238459587,
        -0.015280252322554588,
        -0.011729632504284382,
        -0.004749022424221039,
        -0.02855765074491501,
        -0.031574394553899765,
        0.11280712485313416,
        0.030006589367985725,
        -0.02295321226119995,
        0.054774656891822815,
        0.06723248958587646,
        -0.0008161297882907093,
        -0.012070964090526104,
        0.018588228151202202,
        0.10162902623414993,
        0.013979311101138592,
        -0.022022521123290062,
        0.022254547104239464,
        -0.07333870232105255,
        0.02125483565032482,
        -0.03361912816762924,
        -0.07522065192461014,
        -0.06569535285234451,
        0.04568946734070778,
        0.04144180193543434,
        -0.10018555074930191,
        -0.09270711243152618,
        -0.0043480065651237965,
        0.01722615398466587,
        0.017539696767926216,
        -0.03721462935209274,
        -0.032347504049539566,
        0.03428864851593971,
        0.09822332113981247,
        0.09260530024766922,
        -2.766874929545654e-33,
        0.0548403263092041,
        0.06379566341638565,
        -0.0056067644618451595,
        -0.02452102117240429,
        0.018100690096616745,
        -0.00012106112262699753,
        0.020930811762809753,
        -0.15612927079200745,
        -0.013417281210422516,
        -0.06257370114326477,
        -0.024236857891082764,
        0.0037681746762245893,
        -0.010626054368913174,
        0.012075229547917843,
        0.003543211380019784,
        0.016941014677286148,
        -0.03432077914476395,
        -0.07111614942550659,
        0.03509736433625221,
        -0.02562062256038189,
        -0.012839309871196747,
        0.03423047810792923,
        -0.22886697947978973,
        -0.02681686170399189,
        -0.07888580858707428,
        -0.013117006048560143,
        -0.12970073521137238,
        0.038628824055194855,
        -0.012265358120203018,
        0.0019197911024093628,
        -0.03603668510913849,
        0.00841541402041912,
        -0.011691251769661903,
        -0.059424884617328644,
        0.005773200653493404,
        0.09962790459394455,
        0.10511266440153122,
        0.033077724277973175,
        -0.00010042452049674466,
        -0.08317840099334717,
        0.0223042294383049,
        -0.0038454802706837654,
        0.05948667600750923,
        -0.005680500995367765,
        -0.04647310823202133,
        0.012407180853188038,
        0.0015202868962660432,
        -0.06417661905288696,
        -0.011896900832653046,
        0.09351146221160889,
        0.05472123250365257,
        -0.04088490828871727,
        -0.07510577142238617,
        -0.039051879197359085,
        -0.05149485543370247,
        0.008908894844353199,
        0.02926807850599289,
        0.013800294138491154,
        -0.09591420739889145,
        0.03878061845898628,
        0.06267742067575455,
        -0.009553791955113411,
        0.04072900116443634,
        0.04401496425271034,
        -0.052041441202163696,
        -0.008237466216087341,
        0.029597746208310127,
        -0.014384106732904911,
        0.05890485271811485,
        0.02144060656428337,
        -0.00303552090190351,
        -0.005107167176902294,
        -0.042717721313238144,
        -0.014018754474818707,
        -0.05142867565155029,
        0.0717892050743103,
        0.07280146330595016,
        0.021591830998659134,
        -0.10774311423301697,
        0.08357301354408264,
        0.0009778678650036454,
        -0.055012382566928864,
        0.0008569389465264976,
        -0.05005916208028793,
        0.1056080088019371,
        -0.042986512184143066,
        0.031384702771902084,
        -0.030563564971089363,
        0.006062065716832876,
        0.022469408810138702,
        -0.00899702962487936,
        -0.052413251250982285,
        -0.05627832189202309,
        0.06332647800445557,
        -0.019371861591935158,
        -5.611277842376694e-08,
        -0.06760342419147491,
        0.004739042371511459,
        0.013753920793533325,
        0.01400637999176979,
        -0.025071991607546806,
        0.03536107763648033,
        0.047562144696712494,
        0.023811250925064087,
        -0.047925472259521484,
        -0.01585574820637703,
        -0.04226163774728775,
        0.02597690373659134,
        0.10364355891942978,
        0.07132088392972946,
        0.09434671700000763,
        -0.03191318362951279,
        0.0020682746544480324,
        0.014321115799248219,
        -0.02010297402739525,
        -0.007055384572595358,
        0.08478119969367981,
        -0.025822661817073822,
        -0.04625929519534111,
        0.04155972599983215,
        0.055608030408620834,
        -0.025342481210827827,
        0.010894440114498138,
        0.020967233926057816,
        0.07129738479852676,
        0.09725850820541382,
        -0.011231140233576298,
        -0.033471908420324326,
        0.01564338430762291,
        0.021458778530359268,
        0.04447522759437561,
        -0.007123706396669149,
        0.025277527049183846,
        -0.05723446235060692,
        -0.02461414597928524,
        -0.04576465114951134,
        0.05003790557384491,
        -0.002098578028380871,
        -0.026800889521837234,
        -0.016761237755417824,
        0.019296975806355476,
        -0.058331768959760666,
        -0.09333308041095734,
        -0.02560959756374359,
        -0.024806635454297066,
        0.144391730427742,
        -0.020037513226270676,
        -0.053937070071697235,
        0.04451245442032814,
        -0.016262609511613846,
        0.06571873277425766,
        -0.0011811137665063143,
        -0.004164107609540224,
        0.0052053555846214294,
        0.09218249469995499,
        0.03463827446103096,
        -0.001867547514848411,
        0.025268753990530968,
        -0.039706483483314514,
        -0.08353082835674286
    ]
}