{
    "id": "5eheREcKfvw",
    "title": "OnePlus Pad Teardown - I make mistakes so you don't have to...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-06-03T12:30:02Z",
    "video_url": "https://www.youtube.com/watch?v=5eheREcKfvw",
    "category": "Howto & Style",
    "tags": [
        "OnePlus Pad",
        "OnePlus tablet",
        "OnePlus",
        "OnePlus Tablet teardown",
        "JerryRig",
        "technology",
        "ipad",
        "apple ipad",
        "apple",
        "ipad pro",
        "ipad clone",
        "android tablet",
        "oneplus pad",
        "oneplus ipad"
    ],
    "views": 449950,
    "likes": 18657,
    "comments_count": 429,
    "description": "Today we take apart the new Tablet from OnePlus: The OnePlus Pad. Kinda fun to see the extra measures that OnePlus took to make it aesthetic and good looking on the inside.  Get my Shirts and Razor Knife here!    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/ACnP4TvUoTN-kdVzL6dT8g?pm=link",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "One fairly fortunate consequence of drawing the Incredible Hulk on the back of my new OnePlus tablet with the razor blade is that there is an internal magnet that lets the Hulk perfectly grip the busted open OnePlus Stylo looking like a copper flag flowing in the wind. I did not plan this. A banner waving Bruce Banner like some kind of tear down Avenger rushing into the 'right for repair' battle. We should see what other secrets OnePlus has hidden away from us. Let's get started. [Intro] It's been a while since I've torn open a tablet. They're not my favorite to take apart since they don't usually survive, but I'm going to do my best. It's always a tad difficult being the first person on the internet to open up technology since I don't get to see beforehand what to expect. But personally, as a consumer of tutorials on the internet, I appreciate it when others do it for me and I hope my videos are able to help other people. The glass slab takes more time to heat up and with more surface area, seems to cool down quicker. I didn't turn on the tablet, it decided to do that all on its own. And apparently, the extreme heat from the heat gun, while getting a glass to temperature, is hot enough to shut off pixels. Obviously this probably isn't healthy for the tablet, but chances are if someone's trying to get inside, there's probably already something else catastrophically wrong. With my suction cup putting up on the glass, the tip of my razor can slip into the black bezel of the screen to slice away the adhesive. If my razer goes past that bezel area it stabs the edge of the pixels which then kills the whole screen. So there's a very fine line of acceptable area to work with. With the fragile glass display completely sliced off of the OnePlus Pad, I realized my first and hopefully my only mistake of the teardown. I sliced through the power button ribbon cable rendering us unable to turn on or off the tablet. Here I am making mistakes so you don't have to. Luckily OnePlus has contingencies in place for errant hardware. And if I hold down the volume down button while plugging it in, I'm able to reboot the tablet without a power button. Thank you OnePlus. Thumbs up for that. Besides the sliced ribbon, the tablet appears to be functioning like normal, even with the screen entirely pulled off. So far, so good. The hardest part is over and a good indicator that we might be successful in the end, minus that bit of carnage near the power button. But hey, worse things can happen. With the power button out of commision, we have to turn on the accessibility menu which gives us an on-screen power button which we can then use to turn off the device and continue the autopsy. The display ribbon for the large 11.6 IPS LCD is held underneath a metal bracket with two screws. And even though we are completely turned off, I'm still going to play it safe and unplug the battery first before unplugging anything else. The battery plug is held underneath another metal bracket with two more screws. And all the plugs can be then popped off just like little Legos. The screen is a bit thicker than normal since it is an IPS display which includes a backlight. Not quite as thin as self-lit AMOLED or OLED pixels. One very cool thing though that OnePlus has taken the time to do is color match their screws to the body of the tablet, probably anodized. And it seems like a lot of effort for something that most people won't even get to see...unless you're here subscribed to JerryRigEverything of course. It would look even better though if the battery was red like OnePlus used to do way back in the old days. We gotta bring that back. With a bit of copper cooling exposed, we can get one more silver bracket over the ribbons for the accessory circles and charging port moved off to the side. The 67 watt USB-C port has 5 green screws of its own and a metal plate covering the whole thing. The charging port board is pretty chill, easy to replace, and has a substantial red rubber ring around the entire port. There are 4 stereo loudspeakers, all pretty much identical, each having 4 screws holding them in place. Once again, these green screws are pretty nifty looking. With the speaker removed we can see that the rectangular driver has a clear transparent rubber surround like we saw on the AirPods. It's good to know that there is some water resistance and resilience built in. I'll flip over the long keyboard signal ribbon and set the charging port ribbon over near the port. It looks like the magnet that was unintentionally located on Hulk's hand is off here to the side of the battery and is probably used to help keep the folio cover closed. The motherboard has a whopping 19 of the little green screws holding it in place, along with a few pieces of black plastic shielding. With 3 wire cables and the front facing 8 megapixel camera unplugged, we can successfully lift the motherboard out from the tablet. We have some thin copper tape over all the important circuitry bits, as well as 2 little cute stalactites of thermal paste that drip down onto the tablet frame. The rear 13 megapixel camera is pretty small and does not have optical image stabilization. It does look like my power button ribbon is easily fixable, if of course I can find a replacement piece. It's just a simple ribbon with 2 small square contact pads. Now as far as the battery goes, tucked between all 4 loudspeakers, it is pretty massive and unfortunately though, it's very securely glued into the frame of the tablet. This probably helped quite a bit during the bend test since the battery couldn't move it helped keep the pad together. But what we gained in durability, we lost in repairability since not even alcohol was able to easily dissolve that adhesive. And since bending a battery is extremely dangerous, if the positive and negative inner layers come in contact with each other they could short out and start a fire, so I'm just going to leave the battery in place for now, all 9,510 milliamp hours. As I get the motherboard situated, I realized that I made another tiny mistake in my durability test video. I called the stylus charging port a 5G antenna, which was an error since the OnePlus Tablet does not have cellular connectivity. You can see what's left of the Stylo magnetically adheres to the tablet body, as well as where the stylus and inner charger line up through that piece of plastic in the frame. If we scrape away the black coating on the inner coils, we can see that the wireless energy passes from coil to coil and is indeed not a 5G antenna. That's my bad. With the motherboard and all of its plastics back in place, we can admire the great screws one more time. No one gets to see these but you. Hashtag #blessed. We can get the charging port reassembled and screwed down, along with the pancaked loudspeaker and its waterproofing mesh, all snuggled down tight into the metal frame. With all the ribbons connected and silver brackets back on top, we can plug in the display. Since our power button is still sliced in half we once again have to do our volume-down-plug-it-in trick. But it does work. The new OnePlus Pad turns on and functions like normal. Nice work, OnePlus. Your tablet survived a durability test and a teardown. I'm thinking that maybe your tablet team should have lunch with your phone team, and if it's at Chick-fil-a or Panda Express, feel free to send me an invite. If you've made it this far in the video, let me know your favorite place to eat down in the comments. And thanks a ton for watching, I'll see you around.",
    "transcript_keywords": [
        "fairly fortunate consequence",
        "drawing the Incredible",
        "tablet",
        "Hulk perfectly grip",
        "power button",
        "Incredible Hulk",
        "OnePlus",
        "power button ribbon",
        "copper flag flowing",
        "busted open OnePlus",
        "OnePlus tablet",
        "button",
        "charging port",
        "port",
        "battery",
        "screws",
        "ribbon",
        "fairly fortunate",
        "fortunate consequence",
        "consequence of drawing"
    ],
    "transcript_entity_values": [
        "19",
        "OnePlus",
        "8 megapixel",
        "67 watt",
        "two",
        "Bruce Banner",
        "the old days",
        "the OnePlus Pad",
        "Legos",
        "half",
        "Chick-fil-a",
        "4",
        "the OnePlus Tablet",
        "Panda Express",
        "2 small square",
        "Avenger",
        "OnePlus",
        "5",
        "Hulk",
        "OnePlus Pad",
        "first",
        "13 megapixel",
        "3",
        "One",
        "AirPods",
        "Hulk",
        "one",
        "OnePlus Stylo",
        "11.6",
        "2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "FAC",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.08234769850969315,
        0.05383191257715225,
        0.0023267341312021017,
        -0.11595089733600616,
        0.06675830483436584,
        -0.06753900647163391,
        0.05629652366042137,
        0.07544641941785812,
        -0.02227623574435711,
        0.08266500383615494,
        0.10536305606365204,
        0.03468824177980423,
        -0.07153352349996567,
        0.02208082564175129,
        -0.03194989636540413,
        -0.01075669564306736,
        0.014070089906454086,
        -0.0030420764815062284,
        -0.07358201593160629,
        0.10292809456586838,
        0.059867728501558304,
        0.01264093816280365,
        0.05275625362992287,
        -0.020381547510623932,
        -0.04063613712787628,
        0.004501486662775278,
        -0.034677162766456604,
        0.03545098751783371,
        -0.06242799386382103,
        -0.0729687437415123,
        0.05073045566678047,
        0.03664734587073326,
        -0.07722663879394531,
        0.014641710557043552,
        0.05499139800667763,
        0.04424212872982025,
        0.029875755310058594,
        -0.03734378144145012,
        -0.09820351004600525,
        -0.04806458204984665,
        -0.028049200773239136,
        -0.012754538096487522,
        0.059249650686979294,
        -0.05353103578090668,
        -0.007158031687140465,
        -0.004345415625721216,
        0.09237784147262573,
        -0.07738504558801651,
        0.07762625813484192,
        -0.024845872074365616,
        -0.07028893381357193,
        0.014670602977275848,
        0.026775069534778595,
        -0.043762173503637314,
        -0.04343981295824051,
        -0.0010363381588831544,
        -0.022234121337532997,
        -0.012312785722315311,
        -0.007360770832747221,
        -0.0524001307785511,
        0.03725406154990196,
        -0.006341249216347933,
        0.005864318460226059,
        0.08076519519090652,
        0.01194725465029478,
        0.02246670238673687,
        0.05154033005237579,
        -0.15533344447612762,
        -0.06152024120092392,
        -0.0011795051395893097,
        -0.11931832134723663,
        -0.01041624415665865,
        -0.0273020900785923,
        0.02660997025668621,
        -0.029060490429401398,
        0.022827010601758957,
        0.013322235085070133,
        -0.001641028211452067,
        0.01920183375477791,
        0.008519910275936127,
        0.04983309656381607,
        0.003734750673174858,
        0.011357721872627735,
        0.011008542031049728,
        -0.0035770232789218426,
        0.08454125374555588,
        -0.004330760799348354,
        0.0664026290178299,
        0.007994892075657845,
        -0.04789894074201584,
        0.020906656980514526,
        0.00956246443092823,
        0.019124262034893036,
        0.05371108651161194,
        0.026396771892905235,
        -0.1299646943807602,
        -0.10281363129615784,
        -0.0948837548494339,
        -0.08761344850063324,
        0.033462487161159515,
        0.0019338304409757257,
        -0.03611805662512779,
        0.05658452957868576,
        0.016673987731337547,
        -0.00821532029658556,
        -0.031246259808540344,
        -0.02738041616976261,
        -0.03133260831236839,
        0.03179235756397247,
        0.03837350010871887,
        -0.008654901757836342,
        0.039995256811380386,
        -0.07087916135787964,
        -0.012087752111256123,
        0.04577004164457321,
        0.03150070831179619,
        -0.07828877121210098,
        0.11301049590110779,
        0.06137304753065109,
        -0.029652347788214684,
        0.029949480667710304,
        -0.04850120097398758,
        -0.012987994588911533,
        0.04316440597176552,
        0.03221512958407402,
        -0.039846017956733704,
        0.01171368733048439,
        4.671378183311292e-33,
        0.03980564698576927,
        0.08504559099674225,
        0.0065520028583705425,
        0.030868733301758766,
        -0.0045722005888819695,
        0.016819506883621216,
        -0.015012320131063461,
        0.06776656955480576,
        -0.00037851138040423393,
        0.060265179723501205,
        -0.005756367929279804,
        -0.002544197253882885,
        -0.02497009187936783,
        0.03504141792654991,
        0.020048612728714943,
        -0.0023226654157042503,
        -0.015077765099704266,
        0.007221178617328405,
        -0.036330290138721466,
        0.014101000502705574,
        -0.05211019888520241,
        -0.018689149990677834,
        0.012188387103378773,
        0.03545447811484337,
        0.09510079771280289,
        0.0641205906867981,
        -0.002499973401427269,
        -0.022676710039377213,
        0.04627099633216858,
        0.04295184463262558,
        -0.1250927895307541,
        -0.024408385157585144,
        0.01535029150545597,
        -0.043334972113370895,
        -0.04098653048276901,
        0.02996767684817314,
        -0.08931577205657959,
        -0.10646361857652664,
        -0.04993033409118652,
        -0.010960717685520649,
        -0.05432051420211792,
        -0.0015296733472496271,
        -0.008848967961966991,
        -0.03676751255989075,
        0.039379749447107315,
        -0.029507897794246674,
        -0.001856361050158739,
        0.06466104835271835,
        -0.0334465391933918,
        -0.0044233831577003,
        -7.58739115553908e-05,
        -0.019330665469169617,
        0.04714521765708923,
        -0.08570782095193863,
        -0.11148330569267273,
        -0.010394352488219738,
        0.06012140214443207,
        -0.007363760378211737,
        0.07187590003013611,
        0.09260567277669907,
        0.009586839005351067,
        -0.0006696731434203684,
        -0.0201728492975235,
        0.014573149383068085,
        -0.05364307016134262,
        -0.02192029356956482,
        0.040309421718120575,
        0.025829147547483444,
        -0.03934406861662865,
        -0.009086277335882187,
        -0.09892792999744415,
        0.003692945232614875,
        -0.010439466685056686,
        -0.01835593581199646,
        -0.05884828791022301,
        0.026035727933049202,
        -0.022622620686888695,
        0.0011091850465163589,
        0.043122388422489166,
        -0.0801461860537529,
        -0.04751729592680931,
        0.03325238078832626,
        0.04392441362142563,
        -0.029534146189689636,
        -0.04233415424823761,
        -0.03928840905427933,
        0.017089830711483955,
        -0.08951878547668457,
        -0.0029339336324483156,
        0.014664647169411182,
        0.015334652736783028,
        -0.02958407998085022,
        -0.06920045614242554,
        -0.038943126797676086,
        -0.017083629965782166,
        -6.961063752534531e-33,
        -0.06539714336395264,
        -0.009192721918225288,
        -0.06156640499830246,
        0.0006180263590067625,
        0.052422501146793365,
        0.009825615212321281,
        0.13460814952850342,
        0.054652437567710876,
        0.07671621441841125,
        -0.07752516865730286,
        -0.038439054042100906,
        -0.016332140192389488,
        -0.1339636892080307,
        -0.0839773416519165,
        0.045298751443624496,
        -0.0003852330846711993,
        -0.017771517857909203,
        -0.05892876535654068,
        -0.0073381634429097176,
        -0.008293678984045982,
        0.06632372736930847,
        0.06647152453660965,
        0.11506515741348267,
        0.034255336970090866,
        -0.04206933081150055,
        0.01642756164073944,
        0.028470635414123535,
        -0.07685292512178421,
        0.039814162999391556,
        0.014192708767950535,
        0.01971689611673355,
        -0.00243827560916543,
        -0.008336033672094345,
        0.05876769497990608,
        0.02127082645893097,
        0.0672881156206131,
        0.013294966891407967,
        -0.022541353479027748,
        0.030660048127174377,
        -0.09384384751319885,
        0.033874861896038055,
        0.06398995965719223,
        0.007496214006096125,
        -0.013114521279931068,
        -0.032972343266010284,
        -0.09260144084692001,
        -0.03805244341492653,
        0.024503789842128754,
        -0.06467098742723465,
        0.06010780856013298,
        -0.0805710032582283,
        0.03079291805624962,
        0.00869231391698122,
        -0.05664374679327011,
        -0.00042273427243344486,
        -0.012718995101749897,
        0.06456927955150604,
        -0.1030261218547821,
        -0.08075641840696335,
        0.01190083846449852,
        0.03874574229121208,
        0.040415503084659576,
        -0.09656200557947159,
        0.012002295814454556,
        0.015134904533624649,
        -0.01367510762065649,
        0.08740047365427017,
        -0.029232323169708252,
        -0.014764265157282352,
        0.053605079650878906,
        0.06968006491661072,
        -0.0242356788367033,
        0.048777513206005096,
        -0.11237016320228577,
        0.0353846549987793,
        0.030891379341483116,
        -0.02934979647397995,
        -0.04637777805328369,
        0.023501751944422722,
        -0.013274925760924816,
        0.019103815779089928,
        -0.049644146114587784,
        0.036336254328489304,
        0.11506684869527817,
        0.06977055966854095,
        0.00030246315873228014,
        0.09750936925411224,
        0.09007291495800018,
        -0.028950313106179237,
        0.017335329204797745,
        -0.01697215996682644,
        0.04727457836270332,
        0.0007641700794920325,
        0.09448981285095215,
        0.02126324363052845,
        -6.271707064797738e-08,
        -0.022203005850315094,
        0.06035163998603821,
        -0.0026707143988460302,
        -0.013990922830998898,
        -0.01402732077986002,
        -0.04074908420443535,
        0.03861789032816887,
        0.025943968445062637,
        -0.009189591743052006,
        -0.08650992065668106,
        0.022658949717879295,
        -0.03420663997530937,
        -0.03663693368434906,
        0.09444904327392578,
        -0.016532722860574722,
        0.040531523525714874,
        -0.10555128753185272,
        0.04700776934623718,
        -0.04923669621348381,
        -0.018072573468089104,
        -0.05211619660258293,
        -0.04141640663146973,
        0.06547436118125916,
        -0.09987904131412506,
        -0.03229672834277153,
        0.032777588814496994,
        -0.1120271235704422,
        0.04987016320228577,
        0.05872439965605736,
        0.05643497034907341,
        -0.029346611350774765,
        -0.05824911966919899,
        -0.00582202710211277,
        0.009223047643899918,
        -0.062061842530965805,
        -0.0591764971613884,
        -0.017381025478243828,
        0.01669018156826496,
        0.06200972944498062,
        0.05732880160212517,
        -0.026520386338233948,
        -0.04510456323623657,
        0.08694059401750565,
        0.053859446197748184,
        -0.01678084209561348,
        0.04879290238022804,
        0.04911239445209503,
        -0.10201208293437958,
        -0.07924066483974457,
        0.026656251400709152,
        -0.04549117013812065,
        -0.010986197739839554,
        -0.06339691579341888,
        0.04895378649234772,
        -0.009182249195873737,
        -0.0073091876693069935,
        0.05301995947957039,
        0.034162599593400955,
        0.03142601251602173,
        0.016227591782808304,
        0.009710952639579773,
        -0.019261829555034637,
        -0.02083631046116352,
        0.06432189792394638
    ]
}