{
    "id": "5IErwoUNVI4",
    "title": "Is Amazon Renewed a SCAM?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2024-05-16T15:01:42Z",
    "video_url": "https://www.youtube.com/watch?v=5IErwoUNVI4",
    "category": "Science & Technology",
    "tags": [
        "amazon",
        "refurbished",
        "refurb",
        "tech",
        "renewed",
        "renew",
        "warehouse",
        "amazon warehouse",
        "deal",
        "discount",
        "bargain",
        "xbox",
        "playstation",
        "samsung",
        "sony",
        "microsoft",
        "meta",
        "quest 2",
        "z flip",
        "beats",
        "headphones",
        "laptop",
        "mac",
        "macbook",
        "apple",
        "austin",
        "austin evans"
    ],
    "views": 556903,
    "likes": 15922,
    "comments_count": 666,
    "description": "Amazon Fire HD 8 Tablet refurbished on Amazon:  Meta Quest 2 refurbished on Amazon:  Apple MacBook Air 2019 refurbished on Amazon:  Sony PlayStation 2 refurbished on Amazon:  Samsung Galaxy Z Flip 3 refurbished on Amazon:  Beats Studio Buds refurbished on Amazon:  Xbox Series X refurbished on Amazon:   Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  Chapter Titles: 0:00 Ordering 2:23 Fire HD 8 5:31 Meta Quest 2 8:07 MacBook Air 2019 10:20 PlayStation 2 12:21 Z Flip 3 14:12 Beats Studio Buds 14:55 Xbox Series X",
    "description_links": [
        "https://austin.tech/firehd8",
        "https://austin.tech/quest2refurb",
        "https://austin.tech/mba19",
        "https://austin.tech/ps2refurb",
        "https://austin.tech/flip3refurb",
        "https://austin.tech/studiobudsrefurb",
        "https://austin.tech/seriesxrefurb",
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- Should you trust Amazon Renewed tech? Now when you go to look for refurbished tech on Amazon, you'll see Amazon Renewed, expertly refurbished products at great prices. I'll be the judge of that. Now, when you're buying refurbished tech, it is an incredibly competitive scene where some companies offer you a one, two year warranty, offer 30, 60, 90 day return policy, but the most important thing for me is always what kind of condition are we actually looking at here? So premium means no scratches on the screen, almost nothing on the body, and functional. It's good with 90% battery life and a one year guarantee. So if we find anything premium, this really does seem like the right move, 'cause you can theoretically, if I'm reading that guarantee correctly, return it after 364 days, seems pretty good. Then we've got excellent, which is 80% battery life, and a 90 day, then you've got good, and acceptable. Let's start out with the gold standard, which is certified premium refurbished Amazon devices. So this is a Fire HD 8, which is 2022, so fairly new. The new version of it is $100 and this one is $55. Okay, that seems like a good deal. I get myself a pair of renewed Beats. Okay, so this is a little bit annoying. So if you're looking through the listing, you can't just choose different quality. So I had to actually scroll down here to find a similar item, which is the same thing, and this one shows up as Renewed Premium. It's only a few dollars more. Okay, let's do the premium and see what we've got. Okay, so Quest 2, now this is not a good deal at all. I was able to see this at Best Buy the other day for $200 brand new. So I just want good, I want the cheapest one possible, I can get it for 156 bucks. Z Flip 3, I heard Z Flip, I didn't say it, it echoed through the cosmos, \"Austin buy a Z Flip.\" We're cooking here, we're cooking. For $320, I can get an acceptable MacBook Air, and this is the base model. Ooh, renewed Xbox. This is the first time I've seen an item that is not refurbished, but actually shows in used condition. Okay, how about something little on the older side? How about a PlayStation 2? Holy! $173 for a PS2? So if I spend $173 on this PS2, I'd better, first of all, get an original controller, and second of all, get something which is in actually excellent condition. So then, my friends, let's place this order with Amazon and see what kind of lovely technology our good buddy, Jeffy B, sends directly to our door, via Amazon Prime shipping. All righty, let's see what Jeffy B. has brought for us, shall we? I'm just gonna call him Jeff actually, we're not... We're on a first name basis. I have high hopes, I mean, has Amazon ever done anything wrong? We'd like you to cite several examples please. First up, we have our Certified Refurbished Amazon Fire HD 8 tablet for $55. Well (box rattles) hopefully that's not important. Now the certified refurbishing means that this was, unlike most items from Amazon, actually refurbished by Amazon themselves. So I assume that this is a return tablet or whatever. So we do have actually custom Amazon packaging. The rattling was just the USB-C cable, but that's fine. Does it have five watt? That's a five watt charger. Wow, they really cheaped out. And then we have our Fire Tab itself, which is in this nice little plastic thing and a hello, (speaks German) So this should be in, essentially, like new condition, and I will say it looks quite nice on the back. There's a couple interesting things here. So it's definitely meant to be used in this landscape orientation 'cause not only do you have the front facing camera, but you actually have top firing speakers, which is kind of interesting. Oh this is gonna have the ads though, I bet, right? I think I had to pay extra to get rid of the ads. - [Alex] For the Certified Refurbished, they don't even give you the option of with ads or without ads. - Ads, ads, ads baby. If you're looking for reasons to buy this Fire HD 8 tablet, may I direct your attention to the most exciting feature, which is a headphone jack. You've got yourself a micro SD card slot, and the beautiful Fire OS. Imagine Android, but (censored) Now the thing that I will immediately tell you jumps out to me is the display. It is quite low resolution. So it is 1280 x 800, which, especially if I'm gonna like I don't know, read a book or wanna watch some video or something, it's a little bit blurry. Let's actually watch some video. Let's see if that's any better. I mean if you want 720p, I mean that's 720p. It's over sharpened. So here's the thing, right? You're paying like 55 bucks for it. It's not great, but it's fine. Let's take a look at the camera. I'm actually just like morbidly curious if this camera's any good at all. So this is a little bit of a sample of the front facing camera on this Fire Tab. Now the good thing is the camera's actually placed in the center, which means that if you actually wanna do a video call or something, it actually works. So here's the thing, this is a $55 tablet. Now I can make fun of it all day long, and I would love to, but for this kind of money it's actually not terrible. The thing I'm a little more interested in is the Amazon Certified Refurbished because we saved a few bucks by getting it refurbished versus new. And I'll be honest, as far as I can tell, there is no reason to buy this thing new, just because the refurbished version is essentially brand new. I don't have any scuffs, scratches, nothing. And importantly, it comes with the exact same warranty if I would've bought it new. So it's really just like I just bought a tablet that was on sale 'cause I got it refurbished. So if this is the kinda level of quality you can get out of the Amazon Certified Refurbished it is a complete no brainer. Obviously this is a one of one test. So we got a lot of other things to look for. But first glance, Amazon Certified Refurbished, big thumbs up. This is our renewed Meta Quest. (vinyl record scritches) I paid $25 in shipping and $17 in tax, meaning that the grand total was $199, (Alex laughs) which is the price of this, if I was gonna buy it new. (Alex continues laughing) - [Joanna] You didn't notice that when you hit the the checkout button? - Are you expecting to actually do anything besides, (voicing nonsensical babble) wait, wait, hold on a second, this actually did show free delivery. Maybe I clicked on the wrong one, but I'm pretty sure I should have been able to get this for the price that I wanted and without paying the extra money for delivery. And it does say it may or may not come with manufacturer packing, and if I can give them anything, this is actually in the original box. It's a little stained though. Ew. Oh that looks, that looks nice. Oh no that's used, okay, yeah that's used. Yep, so I'm not sure if you can see, but there's like fricking scuffs on the inside of the controller here, scuffs on the top, and the whole thing on the outside, it's got some marks and stuff. This was definitely used, dinged, dented as well, and I think they just did their best to clean it up. Now the real question is gonna be the headset, 'cause like look, it's one thing if you buy used earbuds or headphones, I do a lot. It's another thing, something that's on your face and your eyeballs, right? Like you don't want someone else's eyeball juice on your face, that's not cool. You know what it smells like? Tide Pods. There definitely was a lot of work done to actually get this cleaned up. My thought is this came in kind of dirty, and they tried to really clean it, which is great, especially for a VR headset. You want this to be nice and sanitary and clean. I think it seems pretty fair. Guess who's back, back again Let's fire this up and see if it actually works, but if it does, I mean, I might not be able to recommend the headset, but I could at least recommend Amazon renewed yet again. Like pretty good. Now the only problem with the Quest 2 is that the lenses do tend to get a little bit smudgy. Now it's very much dependent on how you actually set the headset up. I wear glasses so there's an extra bit of stuff in the way, but also walking around here, tracking is pretty solid. If I want, I can open up YouTube VR or something, and I should theoretically be able to watch some high quality Austin Evans videos. I bought a lot of tech from the internet Dollar Store. This is a great experience. While I maybe slightly overpaid compared to what I thought, considering that I had to pay shipping, the Quest 2 is actually pretty solid. I think this is a good pickup if you're interested in trying VR and you will get into it at a super, super low budget. I mean I gotta say, I'm looking real good, just you know, real, real good. So let's take a look at this very poorly packed item, which I'm gonna assume did not come (laughs) via Amazon Prime. It's so rattly, I'm afraid it's just a device in here just floating. Oh well I'll tell you what is floating is the big old power adapter, which is a huge (finger taps) hollow chungus of a power adapter, what? The included cable's MFI certified to be compatible with Apple devices. That's not true 'cause it's just a regular cable. JemJem is one of the, I think, larger refurbishers, but this is one of the companies that often will resell refurbish tech on lots of marketplaces, such as Amazon. So this came directly from JemJem. So $320, no shipping. So I would still think it's a little bit questionable considering that this is an Intel MacBook Air, but let's just evaluate the condition. So say for acceptable on the outside, yeah, definitely some scuffs, but, I mean, actually pretty clean. Normally the Space Gray ones will kind of have that sort of silvering, but this has tons of silvering on this. That makes me think that this has been really heavily used and people plugged it in and out a bunch of times. Let's open this up, but the outside is not in acceptable condition. So I'm afraid to see what's on the inside. (laughs) Oh that's lovely. So now that I've got it set up, it is running a copy of macOS Monterey. Now this is a 2019 MacBook Air, which means that we should be able to update it if we want. So it looks like it's a base model, so it's a dual core i5, so that's an eighth gen processor. Oh my God! 623 cycles? That's like a full battery cycle every two or three days for five years straight. That is a lot of cycles. It does say that the condition is normal, so it actually doesn't need to be replaced yet, but that's almost certainly why it is in sort of acceptable condition. Considering it has that many cycles, I'll actually say that this was pretty well taken care of. Like yeah, it's got some scuffs and stuff, but it's actually not bad. And the fact that the keyboard actually seems to be totally functional as well, that's impressive. I guess I will give them props to JemJem and to Amazon that the acceptable condition is correct. I think that is spot on. If it had a better battery life, I actually think it's bordering on good, but because the battery has gotten through so many cycles, it's got a little bit of wear, acceptable is fine. At least though, free shipping. (expressing concern) What the hell, are these drugs? - [Alex] (laughs) What? Why do you immediately jump to drugs? - So in excellent condition, I will tell you what, this looks really clean. I mean certainly a little bit of wear and tear, but I mean this is a 20-year-old console, 24-year-old console. The controller's really what I'm interested in because not that PS2 controllers are expensive, but if I'm paying this kind of money for excellent, I want a first party original DualShock, not like some freaking nonsense Mad Catz. That's a Mad Catz dammit, ah. Sorry, it's actually not a Mad Catz, but it's one of the reproductions. And now, to be fair, these work totally fine. They're much cheaper, and this is fine, but it's too hollow. It doesn't feel like it's got the right weight. The real question is, does this PS2 work? Frigging better. Let's see what we got. (playful music) That's a good sign. Yeah, all right! So we got a PS2 that seems to work. Ah, it's a little dusty on the inside, but it comes out quite aggressively, which is good compared to it not coming out at all. Difficulty, we're gonna go two. All right- - That's not very difficult. - Would you like to try? I didn't think so. Ah, I'm gonna dive-bomb him, watch, I'm gonna dive-bomb him. Ah, I got it! - [Joanna] Maybe you should've done difficulty one. (Alex laughs) - I am not thrilled with the fact that it did not come with an original controller. It was sold to me as a very old console in excellent condition. You're always kind of running the risk here. Normally if I was gonna buy something that's a little bit on the older side, I would buy from eBay or a store where I actually could see photos of the item. So I'll give them that it is in good condition, but between the controller and the fact that it is just so expensive, I really don't think I could justify this one. Oh, don't look at that part, that was me getting up. See, I'm back on the road there, it's fine. I gotta say, I'm feeling really good right now. That's usually the point in the video in which everything goes real bad. So well let's see what we got next. Well it is very well padded, I'll tell you that. A Z Flip 3! Look at that beautiful lilac color. Look man, I actually, wait, yo, whoa, whoa, whoa, this is super not scuffed. So a couple of minor things, so there's some stuff on the outer edge here. I wanna say though, that looks like it's gonna come up. Now for context, this phone came out in 2021 for $1000, which at the time, was a pretty big deal because the Z Flip before this lacked water resistance, it didn't have a 120 Hz display, yeah, that's coming up no problem. And it also had a tiny display. This whole bottom panel is the display, which is not amazing or anything, but it's actually pretty decent. You can still use it for selfies and stuff. Considering that we've basically got it for 75% off, just a few years later, I personally think that's pretty solid. The question though, with all folding phones is what's it like on the inside? So it's gonna be kinda hard to see, but do you see there's a little bit of, almost like a dirty patch right here? What happens is that sometimes the screen protector that's built on will, I don't know if it's a temperature thing or what, but basically it'll start to bubble up around the hinge. You can just peel the screen protector off and that's fine, what it leaves behind is a little bit of a residue, but I'm almost positive that will just wipe right off. That's really, really clean. I actually like the white screen 'cause you can see if there are dead pixels, especially with OLEDs, you don't know how much they've been used. They do have a tendency to burn in, especially if you watched YouTube outside or whatever, but that looks really clean. Am I a little bit biased 'cause I live the Z Flip life? Yes, yes I am. But if you're interested in a folding phone and you can pick up something like this for 230 bucks, man this is really good, to fully evaluate our Z Flip 3. Let's take a look at another item, which is our Beats Studio Buds headphones and I got them for $84.97. Wow, this is actually very premium. We've got ourselves original USB-C to C cable, we've got extra ear tips, we've got a sticker, the whole deal. What do we call this video now? What's the opposite of a scam? I got- - What I paid for. - I got what I paid for. (Alex laughs) Oh yeah. I think that the Beats are actually a good deal, and especially considering the fact that you've got yourself that long warranty, that's great. The thing that's more impressive to me though is definitely this Z Flip. Look at my hair. When did that happen? Now this should be our Xbox Series X. Now this is the only item that we purchased, which is actually not technically refurbished. This is from their Amazon warehouse, which I've gotta assume they're just returns because it does advertise that it came with the original box and all the accessories and whatnot, for the grand total of $403. So $100 off of MSRP, about $50 less than it normally would go for. Oh, interesting, no, you know what? It's a little different than I thought. This is actually a refurbished Series X 'cause it comes in a different box. Oh interesting. I've never seen this before. So it actually specifically calls that refurbished. Interesting. We appreciate is that Amazon warehouse device, so this product, for the sake of life, lots of stickers, lots of lots of tape on here. I almost wonder if this was purchased, sold, returned, maybe even a time or two 'cause that's a lot of stickers that they have gone through on this. Inside, we've got ourselves, well that's some foam, so that's a good sign. The controller, looks pretty okay, What do we got? It's very dirty or very dusty, I think is the correct phrase. It's a little sticky, but the whole thing's a little sticky. Like it's all sides, it's really strange. It's this freaking thing that it was wrapped in, I think it was in there for long enough that this sort of foam sort of started to melt onto it because if this is me, I would actually really wipe the whole thing down just to get that sort of foam remnant off. Let's plug this in, fire it up to make sure it actually works, make sure that we got ourselves a good, renewed deal from Amazon. Okay, our luck finally I think caught up with us. So off camera, we were trying to get this thing up and running. It was giving us HDMI issues and it still is. So you can see that the Xbox will turn it on. It's plugged into this monitor. It wasn't working with the original HDMI cable. We tried two different displays. We briefly got an actual signal on this display. So we started to go through the setup screen and then we literally unplugged it to move it from over there to over here on the table where we could shoot it, and now we cannot get any HDMI out. We've tried multiple cables. We know that it worked with this monitor 'cause it was working with this monitor 20 minutes ago. I'm wiggling the cable actually. I just saw the standby mode thing pop up. I think what probably happened is that someone bought this refurbished, or maybe returned it to begin with, and because it's an intermittent HDMI issue, it wasn't caught. So when they plugged in at the refurbishing Amazon center or whatever, they plugged it in and it worked. They just turned around and re-boxed it and sent it out. The good thing is, it is Amazon, so we've got an easy return policy or refund. So I don't really have any doubts that that's a thing, but not a very satisfying conclusion to what otherwise has been a very, very solid video. With that being said, I still think it seems pretty safe to buy refurbished tech from Amazon, but let me know what you think in the comments below. Like subscribe, follow me on Instagram because I'm gonna take selfies with all the stuff that sucks that I buy from stores. You'll really just, it's a feed of just- - [Joanna] You don't wanna miss that. - You've been missing out so far, haven't you? I see you. Follow me on Instagram. (upbeat music)",
    "transcript_keywords": [
        "Amazon Certified Refurbished",
        "Amazon",
        "good",
        "Refurbished Amazon Fire",
        "thing",
        "refurbished",
        "Certified Refurbished Amazon",
        "Amazon Certified",
        "Amazon Renewed",
        "trust Amazon Renewed",
        "Certified Refurbished",
        "premium refurbished Amazon",
        "refurbished Amazon",
        "pretty",
        "bit",
        "refurbished Amazon devices",
        "condition",
        "Amazon Renewed tech",
        "Flip",
        "Fire"
    ],
    "transcript_entity_values": [
        "20-year-old",
        "623",
        "only a few dollars",
        "75%",
        "first",
        "84.97",
        "25",
        "YouTube VR",
        "jack",
        "the Certified Refurbished",
        "230 bucks",
        "two",
        "Jeffy B.",
        "Amazon Certified Refurbished",
        "one",
        "364 days",
        "403",
        "MacBook Air",
        "Jeff",
        "1280 x 800",
        "320",
        "2021",
        "the other day",
        "German",
        "Austin Evans",
        "just a few years later",
        "DualShock",
        "VR",
        "Meta Quest",
        "Austin",
        "60",
        "80%",
        "Instagram",
        "MSRP",
        "199",
        "Renewed Premium",
        "90 day",
        "Fire OS",
        "Joanna",
        "2022",
        "17",
        "1000",
        "this Fire Tab",
        "120 Hz",
        "PlayStation 2",
        "100",
        "MacBook Air",
        "MFI",
        "156 bucks",
        "JemJem",
        "eighth",
        "Fire Tab",
        "24-year-old",
        "two year",
        "$55 tablet",
        "Amazon",
        "Apple",
        "Xbox",
        "YouTube",
        "HDMI",
        "90%",
        "five watt",
        "macOS Monterey",
        "200",
        "SD",
        "173",
        "eBay",
        "20 minutes ago",
        "First",
        "Alex",
        "MacBook Air",
        "Quest 2",
        "2019",
        "USB-C",
        "about $50",
        "55 bucks",
        "30",
        "five years",
        "Amazon Renewed",
        "second",
        "Intel",
        "a Mad Catz",
        "55",
        "Tide Pods",
        "3",
        "Series"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "MONEY",
        "PERCENT",
        "ORDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "DATE",
        "DATE",
        "NORP",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PERCENT",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "MONEY",
        "MONEY",
        "FAC",
        "QUANTITY",
        "PRODUCT",
        "MONEY",
        "PRODUCT",
        "ORG",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "TIME",
        "ORDINAL",
        "PERSON",
        "EVENT",
        "PRODUCT",
        "DATE",
        "ORG",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "EVENT"
    ],
    "vector": [
        -0.11772537231445312,
        -0.05348196253180504,
        0.06380990892648697,
        -0.03232657536864281,
        0.027959922328591347,
        0.058890752494335175,
        0.005066370125859976,
        -0.01821473240852356,
        0.022633641958236694,
        0.05510032922029495,
        0.03951893374323845,
        0.11140785366296768,
        0.07314596325159073,
        -0.06858960539102554,
        0.09098335355520248,
        -0.047169242054224014,
        0.024264061823487282,
        -0.09058883786201477,
        -0.09411308169364929,
        -0.005174459423869848,
        -0.009939300827682018,
        -0.0070136915892362595,
        -0.02258528396487236,
        -0.028757398948073387,
        0.0067056650295853615,
        0.004411694128066301,
        -0.022396082058548927,
        0.019077114760875702,
        -0.06357207894325256,
        0.01022318284958601,
        0.0014317872701212764,
        0.11999768018722534,
        0.013254359364509583,
        0.01266478467732668,
        0.01504510547965765,
        -0.07345592230558395,
        -0.05069637671113014,
        -0.07604756951332092,
        -0.10946179926395416,
        0.004832411650568247,
        -0.035591404885053635,
        -0.058917369693517685,
        -0.09797586500644684,
        0.05931378901004791,
        0.019086817279458046,
        -0.013346617110073566,
        0.020018119364976883,
        -0.02057395689189434,
        0.06549078226089478,
        0.05486031621694565,
        0.021863684058189392,
        -0.045917168259620667,
        0.01294533722102642,
        -0.01826394721865654,
        0.0027984792832285166,
        0.050565581768751144,
        -0.023275651037693024,
        -0.00437741307541728,
        0.024826867505908012,
        -0.03963104262948036,
        0.09690967202186584,
        -0.16224423050880432,
        -0.021504996344447136,
        0.03179853782057762,
        -0.017116175964474678,
        0.017671002075076103,
        -0.03299235552549362,
        -0.0069572641514241695,
        0.0007232250063680112,
        -0.01166946068406105,
        -0.011507193557918072,
        -0.032113224267959595,
        0.06076296418905258,
        0.05992532894015312,
        0.03035856783390045,
        0.03658996522426605,
        0.06551650166511536,
        -0.04783447086811066,
        -0.0389237254858017,
        -0.010655110701918602,
        -0.02691686525940895,
        -0.0678287222981453,
        -0.07846996188163757,
        -0.044030558317899704,
        0.020568426698446274,
        -0.019749650731682777,
        -0.028298018500208855,
        -0.01191279198974371,
        0.013553544878959656,
        0.022073917090892792,
        0.058741774410009384,
        0.02899331785738468,
        0.048949290066957474,
        0.02380094677209854,
        -0.03934058919548988,
        -0.013141805306077003,
        -0.01758728176355362,
        0.024169793352484703,
        0.006497746333479881,
        0.006130271591246128,
        0.04217524453997612,
        0.015702754259109497,
        0.02885243110358715,
        -0.0890812948346138,
        -0.0053126937709748745,
        -0.11205356568098068,
        -0.016400514170527458,
        0.06422795355319977,
        0.010856189765036106,
        0.03840501978993416,
        -0.024954387918114662,
        -0.022314518690109253,
        0.05066222324967384,
        0.02628067135810852,
        -0.02575179561972618,
        0.07972682267427444,
        -0.0756479799747467,
        0.0073875198140740395,
        0.055924978107213974,
        -0.05871313810348511,
        0.10105906426906586,
        0.06604481488466263,
        0.08452162146568298,
        -0.10017192363739014,
        -0.05162297934293747,
        -0.0482996441423893,
        -0.041328173130750656,
        6.272312959712951e-33,
        -0.04931727424263954,
        0.11914055049419403,
        -0.027625564485788345,
        -0.12995478510856628,
        -0.06085672229528427,
        -0.023895997554063797,
        0.007792865391820669,
        0.09708011150360107,
        -0.006407496985048056,
        0.032385267317295074,
        -0.08589797466993332,
        0.10251949727535248,
        -0.059935860335826874,
        0.031241174787282944,
        -0.05757993459701538,
        0.021808279678225517,
        -0.021978534758090973,
        0.02589559182524681,
        -0.02644253335893154,
        0.06062134727835655,
        0.02890642173588276,
        -0.005563029088079929,
        0.056711673736572266,
        -0.007701071444898844,
        -0.013327650725841522,
        -0.09919125586748123,
        0.024884644895792007,
        -0.018180793151259422,
        0.10487822443246841,
        0.012499125674366951,
        -0.07241988182067871,
        0.0037306782323867083,
        0.04915809631347656,
        -0.09555375576019287,
        -0.022127071395516396,
        0.033612873405218124,
        0.034362200647592545,
        -0.018003026023507118,
        -0.015984246507287025,
        -0.03398925065994263,
        -0.05325278639793396,
        -0.0002225391799584031,
        -0.0957319438457489,
        0.03277609869837761,
        0.05303359776735306,
        -0.07517251372337341,
        -0.04224121943116188,
        -0.05948761850595474,
        -0.04546668007969856,
        0.05115574970841408,
        -0.09065575897693634,
        0.0074448129162192345,
        0.015847034752368927,
        0.04274896904826164,
        -0.0698857307434082,
        -0.020203961059451103,
        -0.009628030471503735,
        0.05071427300572395,
        -0.011551110073924065,
        0.05147058889269829,
        0.06129259243607521,
        -0.03471004217863083,
        -0.021676987409591675,
        0.006503421347588301,
        -0.13213245570659637,
        0.08410777151584625,
        0.1057039350271225,
        0.012759404256939888,
        -0.08401227742433548,
        0.03923974931240082,
        0.0654376968741417,
        -0.010938413441181183,
        -0.0064197806641459465,
        -0.024737421423196793,
        0.04118010774254799,
        -0.039286430925130844,
        -0.023795075714588165,
        0.06659955531358719,
        0.013127610087394714,
        -0.040877025574445724,
        -0.03824450820684433,
        -0.027365176007151604,
        0.005306139588356018,
        0.08779090642929077,
        -0.0592772401869297,
        0.04782828316092491,
        0.06707942485809326,
        0.018405986949801445,
        0.039523541927337646,
        -0.046267736703157425,
        -0.028337065130472183,
        -0.0007571162423118949,
        -0.035057682543992996,
        0.0391545295715332,
        0.08899004757404327,
        -7.192321694907676e-33,
        -0.010123577900230885,
        -0.011154054664075375,
        -0.018305357545614243,
        0.05092089995741844,
        -0.06734979152679443,
        -0.017091382294893265,
        -0.041880130767822266,
        0.05862606316804886,
        -0.012265383265912533,
        -0.0903426855802536,
        0.010435329750180244,
        0.045131947845220566,
        0.02962544560432434,
        -0.06538910418748856,
        -0.0029754089191555977,
        -0.0690295547246933,
        -0.0631699413061142,
        -0.09502493590116501,
        0.06807901710271835,
        0.016363507136702538,
        0.0943724662065506,
        0.006135239265859127,
        -0.011597676202654839,
        -0.0011948958272114396,
        -0.024920165538787842,
        0.010306612588465214,
        -0.06755037605762482,
        0.04890664666891098,
        0.04213806986808777,
        0.020328735932707787,
        0.043464645743370056,
        -0.034645602107048035,
        -0.059491995722055435,
        0.04279156029224396,
        0.053014352917671204,
        -0.01335940696299076,
        0.07492473721504211,
        0.011378049850463867,
        -0.00989743322134018,
        0.036253079771995544,
        0.0521395206451416,
        -0.02689984440803528,
        0.032098203897476196,
        -0.01573518104851246,
        0.025170255452394485,
        -0.04402147978544235,
        0.015327269211411476,
        -0.04829763248562813,
        0.07976274937391281,
        -0.04890919476747513,
        0.027926692739129066,
        0.003798218909651041,
        0.019384346902370453,
        0.006821420509368181,
        -0.08134022355079651,
        0.01838444359600544,
        -0.052241306751966476,
        0.01654275506734848,
        0.056347936391830444,
        -0.021513931453227997,
        0.04988553002476692,
        0.005185187794268131,
        -0.039339207112789154,
        -0.05211136117577553,
        -0.05282224342226982,
        0.008898136205971241,
        0.135112002491951,
        -0.019441280514001846,
        0.04015065357089043,
        0.0011202242458239198,
        -0.06306996196508408,
        -0.03464524820446968,
        -0.057855166494846344,
        -0.09500739723443985,
        -0.02605617418885231,
        0.058639634400606155,
        -0.02029186300933361,
        -0.02947165258228779,
        -0.06353537738323212,
        0.007860740646719933,
        0.007528670597821474,
        0.052320610731840134,
        0.051667358726263046,
        0.060290586203336716,
        0.029388023540377617,
        -0.006976171396672726,
        -0.006050108000636101,
        -0.040287408977746964,
        -0.018537474796175957,
        0.035253673791885376,
        -0.05038267374038696,
        -0.06637309491634369,
        -0.1301632672548294,
        0.06134762987494469,
        -0.051400210708379745,
        -5.1057956085287515e-08,
        0.03560406714677811,
        0.030579866841435432,
        0.09415066242218018,
        0.03807494789361954,
        0.11107189208269119,
        -0.09059184044599533,
        -0.018783269450068474,
        0.04345422238111496,
        0.027260245755314827,
        -0.016503700986504555,
        0.05368054658174515,
        -0.05314207077026367,
        -0.07552022486925125,
        -0.005021343473345041,
        -0.002702581463381648,
        0.06384605169296265,
        0.014351860620081425,
        0.07954702526330948,
        0.008326812647283077,
        0.025603357702493668,
        0.0003797929675783962,
        0.05669676885008812,
        0.07781782001256943,
        -0.038425859063863754,
        -0.007184069138020277,
        0.05090412124991417,
        0.006493092980235815,
        0.0028918569441884756,
        0.037736233323812485,
        -0.005781147163361311,
        -0.049802493304014206,
        -0.06627479195594788,
        0.053151559084653854,
        -0.04306390509009361,
        -0.021973995491862297,
        -0.12146079540252686,
        -0.021561894565820694,
        -0.03094060719013214,
        0.005772693548351526,
        -0.03640379011631012,
        0.03356233984231949,
        -0.04940948635339737,
        0.0006652765441685915,
        0.033148348331451416,
        0.04175058379769325,
        -0.11106614768505096,
        -0.06938772648572922,
        -0.03398570045828819,
        0.019547032192349434,
        -0.015412116423249245,
        0.0335242934525013,
        -0.013691835105419159,
        0.013871091417968273,
        0.02225111424922943,
        -0.03632602468132973,
        0.03620743378996849,
        0.017098795622587204,
        0.020041638985276222,
        -0.021932752802968025,
        0.07276404649019241,
        0.057749487459659576,
        -0.10751687735319138,
        -0.00955947209149599,
        0.01765078492462635
    ]
}