{
    "id": "5Imylx9J3VM",
    "title": "My OTHER sister is here! Tahoe Adventures!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-04-21T14:57:27Z",
    "video_url": "https://www.youtube.com/watch?v=5Imylx9J3VM",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "tahoe",
        "travel",
        "adventures"
    ],
    "views": 184591,
    "likes": 5981,
    "comments_count": 867,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(relaxing music) - [Justine] I'm currently testing out my new Sony A73. I'm messing with a bunch of different settings and color grading. I am not very good at color grading so I've been trying out a couple of different things. I've been testing out some different picture profiles and some different settings, so if there is a favorite look that you guys have in this video, please let me know your favorite time code, and put that in the comments below. Right now, this is being filmed just on a normal no picture profile settings, super basic, no color grading. Now we're gonna hop to another look. I don't even remember which picture profile I used, so even if I wanted to copy this, I don't even remember. - [Breanne] Whoa! - Whoa. Oh my god! - I yelled, I mopped the car. - Oh my gosh! I just opened the door to be like look at Bre, she's mopping the car and I just got snowed on! - We don't have a little scraper. - Oh okay. - Close that, I got a mop. - It's everywhere. - Justine, that was bad timing. - Oh no! (relaxing music) - So we are in Tahoe and I'm so excited because Jenna and I have always wanted to come here and finally we have made the truck out also with the rest of my family. They are in town from Pennsylvania. And yesterday we went on this really fun hike to, it was called Cascade Falls, and for whatever reason I had a microphone setting on that was kind of weird. I'll show you guys a little bit of that right now and I'm apologizing in advance for the audio. And after that we're going to be hopping on these gondolas and heading up to the top of the mountain. When I told my friends I was coming to Tahoe, everyone was like hey are you gonna ski? Are you gonna snow board? And I said no I've never done either one of those before. And also my mom won't let us so we're going to have to come back and do it when she's not present because I don't wanna get yelled at by my mom. Yeah I'm an adult but moms are always right. (upbeat music) hello! - Are you a waver? - Wait, I got worried because I was just thinking that that was you and then I was like wait maybe it's not Jenna. - I think that's a mom. I was like mom! And I was like oh are you my mom? - Breanne. - What? - Can I interview you for a second? - Sure. - How are you? - I'm good, I'm trying to find the falls. - Oh yeah? - Yeah. - Bre you haven't been in one of my videos in a very long time. - I have not. - Are you excited about this? - Yep. - Tell me more about how excited you are. - I'm pretty excited. - Talk about more of the excitement. Can you act more excited? - Okay, I'm over it now. - She doesn't want to be in my movie. (upbeat music) - Cascade Falls or Desolation? Jeez, I don't know. (upbeat music) - What's wrong Jen? - Well, I'm in the shrubs. - Yeah, come back. - One of my favorite things is Breanne likes to google really cool hikes but then she ends up leading us into a random place that is not where you should be at all. Which I have a feeling that this might be it. (upbeat music) - [Justine] Not quite to the falls yet. I think we're like two thirds of the way there. (chill music) - [Justine] It's starting to snow and Breanne is trying to get a picture of herself doing a handstand. We're never gonna make it back. I'm actually going to stop filming and I'm going to see you guys in whatever we happen to do after this hike. One, two, three, go! (guitar strumming music) Okay, we all gotta hop in at the same time! - Whoa! - We are on the gondola! This is the heavenly resort. - It's very heavenly. - Whoa, we are, whoa! (upbeat music) I will say this is pretty high up. Now that we're getting up here. - [Justine] We just hopped up here at the observation deck and it is so pretty. It's actually not that cold. I thought I'd be a little chillier but it's definitely not warm. You're bot going to here me complaining like I did in Austria, we're still in California, let's be real. (upbeat music) - Probably 14 seconds ago I said that it wasn't that cold. I retract every single statement that I said 'cause now I'm freezing once I got over to this side. Wow, this view is amazing! We're about nine thousand feet. - [Justine] Let's go, let's go, let's go! Whoa! - [Justine] I think I might be really into skiing, minus the cold. But we're not allowed. Mom, we're not allowed to ski, are we? She said no. Hey! - Could you imagine if someone's like you gotta snow board down that mountain Jenna? I'd be like whoa, no! - Okay well we saw it and now we go back down. (upbeat music) Guys I am so excited because right now we are going to meet one of my new favorite YouTubers. And I actually just found his channel because I was looking for a bunch of lens reviews and for the past couple of months all of his videos kept showing up when I was searching for things for my Sony camera. Whether it's luts, color grading, anything. And now here we are because I basically stalked him all the way to Tahoe and Victoria, this is Cody and Victoria, hello! It was crazy because I didn't even know that you lived in Tahoe until I did a little more research and then here we are like this is the internet. - [Cody] This is , I don't actually live here I just saw that she was coming so I.. - Yeah, it's cool, it's cool. My mom was like wait, you're going to meet some people from the internet, cause we're here with my family. I'm like, yeah that's what we do, that's what I've been doing for the past however long I've been making videos. So can you tell them a little about your channel? - So my channel is mainly about cinematic film making. Um, I use Sony cameras. So if you guys are Sony camera shooters, come check it out. But yeah, it's all about cinematic travel videos, all that good stuff. If you're interested definitely stop by Cody Blue, if you search me it'll come right up. - And it's so funny because I didn't even recognize you, I recognized you because you're in all of the videos. - Yes I am, hey model right here! - My favorite quote I think, on one of the videos is you're like, I always have to like, for the most difficult job, is you're like I have to always wear makeup or like ready. - [Victoria] Yeah, that's true. I never wear makeup. My hair is always in a bun. You know I'm always in workout clothes. So yeah, it's just horrible. - Hey I have a really good fun stuff! I'm like ugh do I have to look presentable or can I look like me? And you're like maybe like a little presentable. And I'm like, yeah. - There's like a fine line. It's like sometimes we'll look nice and other times it's like wow, I don't even recognize you, sorry! But yeah this is so awesome! Thanks for showing us around Tahoe and thanks for meeting up! - Yeah for sure! Thanks for meeting up with us! - You guys are awesome! - You're actually the first YouTuber that I've met up with so... - Really? - It's an honor! - This is so great! Well this is monumental guys, mark it, that's, we're not going to mark it here, cause that is some poo. But yeah we're definitely gonna come back to Tahoe and if you guys ever come to L.A. come hang out, we'll show you some fun stuff. - Yep. - And yeah, I forgot we're going to the beach now. Okay, I lied, uh we already went to the beach and I was gonna try to fake this. This was going to be the intro to us going to the beach 'cause it was so cold before. Um, yeah, the internet's a lie. We already went to the beach. But here's the beach footage, okay go. (mystical music) (upbeat music) - Justine made me sing, Justine why are you so bundled up at beach? Because It's freezing! - Okay wait, so what's this beach called? - This is Nevada Beach here in Lake Tahoe. This is a secret but not anymore. - A secret beach that everyone pretty much knows about, right? - Right, yeah, it's the secret most popular beach in Tahoe so it's real easy to find it. (chill music) - So I've also been talking about how bad I am at color grading and you've got some luts, don't you? - I do, they're uh, yeah, they're pretty popular. If you guys want to check them out or if you're Sony shooters, especially they're specifically for Sony cameras, so you guys will definitely like them. - Yeah, that's the hard part, finding all of these other ones, and I'm like oh this looks so bad on my footage. - I'll send them to you. - Yay! - And then you can use them and let people know how you like them. - Okay, yeah! I'll put a link in the description and you guys can check them out. Okay, let's go have dinner. - Okay, lots! (chill music) - A lot of you guys have been talking about the new Samsung Galaxy J2 Pro. I ordered it on Amazon so I've got it here. I've also got the Samsung Galaxy S9. And, of course, my iPhone ten. And we're gonna go on a hike and I'm gonna test out all three of these phones. I did a quick unboxing. It looks just like any sort of basic phone. Headphones, micro USB cable, oh the reason that it's so light is 'cause half of the phone is right here, got the charging brick. Okay, lets go! I'm gonna hop in the car, I'll charge this thing on the way, lets go. (chill music) - You guys are often encouraging me to try other phones other then the flagship devices, like the S9 or the iPhone ten. - [Jenna] I don't think this is right. - [Justine] Oh no. - [Jenna] Bre, you sure? (chill music) - [Justine] So let's take this thing for a spin. (upbeat music) - Alright we're testing out the front-facing video here on the J2 Pro. Oh no, I'm filming vertical. That's not acceptable. Going to the bridge. (upbeat music) Well guys, thanks for watching my vlog. This brings this vlog to an end. Jenna's over there. We were playing Duos but then I died like two seconds in and now she's still playing. - It's old people luck man. Twelve people, killin' it! - So I just started a solo match but that's all I've got to say. I'll see you guys in my next video, bye-bye! - [Justine] Let's go, these doors are open and not waiting for anybody. (upbeat music)",
    "transcript_keywords": [
        "Yeah",
        "guys",
        "color grading",
        "Tahoe",
        "beach",
        "Sony",
        "Whoa",
        "mom",
        "color",
        "grading",
        "videos",
        "excited",
        "Jenna",
        "picture",
        "Falls",
        "back",
        "favorite",
        "pretty",
        "Sony camera",
        "picture profile"
    ],
    "transcript_entity_values": [
        "second",
        "one",
        "Amazon",
        "S9",
        "the past couple of months",
        "Cascade Falls",
        "Nevada Beach",
        "Samsung Galaxy S9",
        "Justine",
        "Cody Blue",
        "two thirds",
        "Bre",
        "the J2 Pro",
        "Sony",
        "iPhone",
        "three",
        "Cody",
        "ten",
        "Tahoe",
        "half",
        "like two seconds",
        "Samsung Galaxy J2 Pro",
        "Jen",
        "Pennsylvania",
        "Lake Tahoe",
        "Tahoe",
        "Victoria",
        "Austria",
        "YouTuber",
        "L.A.",
        "14 seconds ago",
        "Twelve",
        "California",
        "two",
        "Breanne",
        "Duos",
        "first",
        "Jenna] Bre",
        "YouTubers",
        "about nine thousand feet",
        "USB",
        "Jenna",
        "yesterday",
        "One"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "GPE",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "GPE",
        "LOC",
        "GPE",
        "GPE",
        "GPE",
        "PERSON",
        "GPE",
        "TIME",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.006173545029014349,
        -0.09987852722406387,
        -0.04125801846385002,
        -0.13079804182052612,
        0.028085850179195404,
        0.022924810647964478,
        0.04161049798130989,
        0.03617676720023155,
        -0.01571129448711872,
        0.09628435969352722,
        0.026977645233273506,
        0.016005754470825195,
        -0.019285820424556732,
        -0.013805151917040348,
        -0.02719496376812458,
        0.04073753580451012,
        0.012393603101372719,
        -0.050241868942976,
        -0.01214567106217146,
        0.04117836430668831,
        -0.0309391301125288,
        -0.06431137770414352,
        0.034381549805402756,
        0.008208843879401684,
        -0.05798044055700302,
        0.08205173164606094,
        -0.012307057157158852,
        0.05821115896105766,
        -0.08621886372566223,
        -0.08580081909894943,
        -0.0523018054664135,
        -0.00787209253758192,
        0.11683507263660431,
        -0.023296723142266273,
        0.054008547216653824,
        -0.010393192991614342,
        0.04252246022224426,
        0.0016155112534761429,
        -0.056435927748680115,
        -0.01973748952150345,
        -0.004665057174861431,
        -0.06210882216691971,
        0.03998306021094322,
        -0.05528900772333145,
        -0.07411923259496689,
        -0.08088608831167221,
        0.02927752025425434,
        -0.061729177832603455,
        0.07661927491426468,
        0.049226582050323486,
        -0.0718933567404747,
        -0.009686022996902466,
        0.005419416818767786,
        0.023549577221274376,
        -0.07319244742393494,
        0.0094729233533144,
        -0.10230893641710281,
        0.011341193690896034,
        0.03607439622282982,
        -0.0737161859869957,
        0.0036319808568805456,
        -0.04087260738015175,
        -0.03563382104039192,
        0.045044414699077606,
        -0.07150130718946457,
        -0.06904911249876022,
        0.028627987951040268,
        0.019982509315013885,
        -0.008806703612208366,
        0.0064604319632053375,
        -0.09996499121189117,
        0.0721733495593071,
        -0.032621584832668304,
        0.05456884950399399,
        -0.0254420917481184,
        0.036582235246896744,
        0.07921972870826721,
        -0.05532725527882576,
        -0.0013323925668373704,
        0.05525992065668106,
        -0.0023550111800432205,
        -0.02994677983224392,
        -0.08761125802993774,
        -0.034181252121925354,
        -0.020806415006518364,
        0.038116224110126495,
        -0.011833950877189636,
        -0.014911842532455921,
        0.007028842344880104,
        -0.08270184695720673,
        -0.07501652836799622,
        -0.014901272021234035,
        0.012259830720722675,
        -0.03614034876227379,
        -0.03359026089310646,
        -0.030099933966994286,
        -0.014622177928686142,
        -0.07321687042713165,
        -0.04564191401004791,
        0.07631310075521469,
        0.03220893070101738,
        -0.05881843715906143,
        0.01922486163675785,
        -0.08383400738239288,
        -0.018458018079400063,
        -0.08406531065702438,
        -0.04682186245918274,
        0.04386216029524803,
        0.02489716187119484,
        -0.00142921123187989,
        -0.04922754317522049,
        0.029486674815416336,
        -0.0576629675924778,
        -0.03565879538655281,
        0.03990430012345314,
        0.07373283803462982,
        -0.019847458228468895,
        0.07044876366853714,
        0.044778972864151,
        0.01728423871099949,
        0.00305334129370749,
        -0.0969332680106163,
        0.025555700063705444,
        0.06576701253652573,
        0.04562557488679886,
        0.012225374579429626,
        -0.037052661180496216,
        1.166451933996984e-32,
        0.008502106182277203,
        0.06234150007367134,
        0.008346488699316978,
        0.08996924757957458,
        0.02144715189933777,
        -0.011963949538767338,
        -0.012986586429178715,
        0.10009392350912094,
        -0.05286036431789398,
        0.03228010982275009,
        -0.002813211875036359,
        0.03734443336725235,
        -0.04833010211586952,
        0.050829894840717316,
        0.026687635108828545,
        0.010868702083826065,
        -0.02202199213206768,
        -0.06704071909189224,
        -0.06912445276975632,
        -0.0013066858518868685,
        0.011252746917307377,
        -0.009700900875031948,
        0.037175070494413376,
        0.09481659531593323,
        0.10189367085695267,
        0.07215122133493423,
        0.05612023547291756,
        8.364227687707171e-05,
        0.06551186740398407,
        0.011511217802762985,
        -0.038837309926748276,
        -0.034988269209861755,
        -0.01054803654551506,
        -0.0912436842918396,
        0.003750018309801817,
        0.009368189610540867,
        -0.051922883838415146,
        0.003729555057361722,
        -0.038307514041662216,
        -0.00031938275787979364,
        0.01383750606328249,
        -0.018173709511756897,
        -0.06572318822145462,
        -0.04587935283780098,
        0.07794105261564255,
        0.046243589371442795,
        0.11079141497612,
        0.07841753959655762,
        -0.017781291157007217,
        0.03917218744754791,
        -0.03729744255542755,
        -0.0166019257158041,
        -0.030286671593785286,
        0.016980096697807312,
        -0.04340048506855965,
        -0.06338587403297424,
        -0.02132406271994114,
        0.03519392013549805,
        0.06521586328744888,
        0.04240447282791138,
        0.02103513479232788,
        0.009928123094141483,
        0.0007798571023158729,
        -0.01923377811908722,
        -0.06158281862735748,
        0.05275929719209671,
        0.09275811165571213,
        -0.01845894195139408,
        0.07243624329566956,
        0.039888348430395126,
        -0.009790613315999508,
        -0.04084552079439163,
        0.03173814341425896,
        0.010321872308850288,
        0.07194564491510391,
        0.07069242745637894,
        -0.11646008491516113,
        -0.04098521173000336,
        0.0390004925429821,
        -0.015711573883891106,
        -0.11377763748168945,
        0.05362267047166824,
        -0.011613275855779648,
        0.10795880109071732,
        0.002187563106417656,
        -0.03426525741815567,
        0.034127142280340195,
        -0.03844365105032921,
        -0.029731132090091705,
        0.0020376299507915974,
        -0.013581465929746628,
        0.09856479614973068,
        -0.06844207644462585,
        -0.05546055734157562,
        -0.03374764695763588,
        -1.2028406105894356e-32,
        0.02014344185590744,
        0.013292662799358368,
        -0.005719934124499559,
        -0.01290357019752264,
        0.07549363374710083,
        -0.032337360084056854,
        0.010047629475593567,
        0.06463054567575455,
        0.0662374421954155,
        -0.08298584818840027,
        0.04543977603316307,
        -0.08207812160253525,
        -0.1244233101606369,
        -0.009422101080417633,
        -0.02023858204483986,
        -0.033568400889635086,
        -0.026507817208766937,
        -0.0403495654463768,
        0.03710537776350975,
        -0.05427980422973633,
        0.039783403277397156,
        0.11548816412687302,
        0.0689685195684433,
        0.024166226387023926,
        0.045081015676259995,
        -0.005562901962548494,
        0.03464483097195625,
        0.05540967360138893,
        0.06007072329521179,
        0.04775135964155197,
        -0.04651404544711113,
        -0.0358874537050724,
        -0.02274034544825554,
        0.006719907280057669,
        0.03535395488142967,
        0.04303373768925667,
        0.011396258138120174,
        0.030653122812509537,
        -0.015839526429772377,
        -0.05263252183794975,
        0.08171353489160538,
        -0.013445859774947166,
        0.006849810015410185,
        -0.00556586030870676,
        -0.03199181705713272,
        -0.13398726284503937,
        -0.06926222890615463,
        0.01700698584318161,
        -0.005933641456067562,
        0.008986310102045536,
        -0.046890564262866974,
        -0.09878970682621002,
        0.011236244812607765,
        -0.030712276697158813,
        0.011842717416584492,
        0.007018678355962038,
        -0.036895137280225754,
        0.004668169654905796,
        0.05229741334915161,
        0.03240763396024704,
        0.02492676116526127,
        -0.059351999312639236,
        -0.09742599725723267,
        -0.06691846251487732,
        0.019844122231006622,
        -0.0649360716342926,
        0.10992321372032166,
        0.0042654299177229404,
        -0.024547390639781952,
        0.030754491686820984,
        -0.0033555312547832727,
        0.015569353476166725,
        0.03739521652460098,
        -0.029521740972995758,
        0.0332181341946125,
        -0.022741297259926796,
        -0.05538012832403183,
        -0.004601959604769945,
        0.0766773670911789,
        -0.04401719942688942,
        -0.04696247726678848,
        -0.017324697226285934,
        0.04133249446749687,
        0.07754053175449371,
        0.07645829766988754,
        0.12216905504465103,
        0.08861459791660309,
        -0.0050227027386426926,
        -0.009602492675185204,
        0.07115482538938522,
        0.022868037223815918,
        0.07337579876184464,
        0.06617584824562073,
        0.10798335075378418,
        -0.1268986165523529,
        -6.008106367971777e-08,
        0.04955735057592392,
        0.04264971613883972,
        -0.056744154542684555,
        0.003969677723944187,
        0.02072099968791008,
        -0.024458015337586403,
        -0.022224990651011467,
        0.011581352911889553,
        -0.00045231287367641926,
        -0.03562598675489426,
        0.09580013155937195,
        0.009539525024592876,
        0.0320698581635952,
        0.10418834537267685,
        0.026523318141698837,
        0.01790447160601616,
        -0.06569825112819672,
        0.09972191601991653,
        -0.06058735027909279,
        -0.07673576474189758,
        -0.04750695079565048,
        0.05595047399401665,
        0.021409522742033005,
        -0.0034872081596404314,
        0.04369848221540451,
        -0.012143994681537151,
        -0.010907663032412529,
        -0.0012420102721080184,
        0.056872181594371796,
        -0.0085148299112916,
        -0.0745922103524208,
        -0.007513214368373156,
        -0.014945713803172112,
        0.0022105576936155558,
        -0.045959554612636566,
        -0.07282733917236328,
        -0.06964565068483353,
        -0.04698672890663147,
        0.0007030670531094074,
        0.023836951702833176,
        0.018924444913864136,
        -0.08461934328079224,
        -0.046936504542827606,
        -0.006265759933739901,
        -0.003483131295070052,
        -0.07279102504253387,
        0.020885922014713287,
        -0.0883927121758461,
        -0.06090006232261658,
        -0.020953085273504257,
        -0.0672745332121849,
        0.04091917723417282,
        0.010655488818883896,
        -0.010371305979788303,
        0.0690726488828659,
        -0.026183275505900383,
        0.03274885565042496,
        0.03525282070040703,
        -0.037046320736408234,
        -0.00890954490751028,
        0.02722945809364319,
        0.0322909913957119,
        -0.07077324390411377,
        0.014003247953951359
    ]
}