{
    "id": "5IzzOsgzWuQ",
    "title": "New Cybersecurity Certification?",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2024-08-02T14:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=5IzzOsgzWuQ",
    "category": "Science & Technology",
    "tags": [
        "oscp",
        "occc",
        "offsec",
        "kali linux",
        "kali",
        "hack",
        "hacker",
        "hacking",
        "cyber",
        "cybersecurity",
        "sec 100",
        "sec-100",
        "cybercore",
        "cybercore security essentials",
        "pen-200",
        "pen200",
        "pen 200",
        "offensive security",
        "pentester",
        "pnpt",
        "pentesting",
        "web hacking",
        "free web hacking",
        "web",
        "web hacking course",
        "owasp",
        "http",
        "https",
        "website",
        "web hacking pro tips",
        "xss",
        "cross site scripting",
        "jscript",
        "javascript",
        "xss attack",
        "bug bounty",
        "jquery",
        "node js",
        "xss bug bounty",
        "sql injection",
        "python",
        "window",
        "linux",
        "microsoft",
        "powershell",
        "network",
        "AI",
        "cryptography"
    ],
    "views": 60582,
    "likes": 1438,
    "comments_count": 135,
    "description": "A huge thanks to OFFSec for sponsoring this video - get your $100 discount using my link (valid until 31 August 2024):   Congratulations to our Winner: Buddha from Romania!  Want to win the free place? (T&C's apply) Enter here:   //Jeremys Socials// Website:  X:  LinkedIn:   //OffSecs Socials// X:  Spotify:   // OffSecs OSCC link // OSCC:   // YouTube video Reference // Dark Side of AI:    // David's SOCIAL //  Discord:   X:   Instagram:   LinkedIn:   Facebook:   TikTok:   YouTube:   // MY STUFF //     // SPONSORS //  Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com   // MENU // 00:00 - Coming Up 00:46 - Sponsored Section 01:08 - Introducing Sec-100 04:11 - The Structure of Sec-100 06:43 - Crowdstrike Failure 08:20 - Style of Sec-100 Exam 11:08 - Finding your Place in Cybersecurity 13:23 - Learning General Skills 14:35 - Can I Start with SEC-100? 15:55 - Breaking Down the Course Material 18:45 - No Prior Cyber Skills Needed 21:24 - Can I Get a Job with SEC-100? 22:38 - The Length and Structure of the Exam 24:16 - Can I Retake the Exam 25:17 - Jobs to get with SEC-100 27:55 - AI in SEC-100 30:24 - Hands-On Learning 31:37 - SEC-100 Price and Giveaways 32:15 - Conclusion  kali linux linux oscp oscc offsec sec-100 offensive security hack hacker hacking pentest pentesting pentester ethical hacking ethical hacker course ethical hacker  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   Disclaimer: This video is for educational purposes only.  #kalilinx #hacker #cybersecurity",
    "description_links": [
        "https://davidbombal.wiki/oscc",
        "https://gleam.io/BS3FT/offsec-oscc-giveaway",
        "https://jeremyharbinger.com/",
        "https://x.com/JeremyHarbinger",
        "https://ca.linkedin.com/in/jeremy-miller-b6816987",
        "https://x.com/offsectraining",
        "https://podcasters.spotify.com/pod/show/offsec/episodes/27-YinYang-in-Infosec-with-Jeremy-harbinger-Miller-e1gqsul",
        "https://davidbombal.wiki/oscc",
        "https://youtu.be/YZqiWFyq-OE",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/@davidbombal",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "these are just things that you need to know as a cyber security professional we're not trying to handwave that away we still want people to come out with recognizable marketable skills but we're trying to give Learners a little bit more assistance in obtaining those skills you can't there's no get rich quick scheme here uh you got to put in the work but something like Sec-100 lets you put it in at a pace that works for you and it lets you really accomplish something uh in a relatively short amount of time rather than like keeping your eye on a decade year long prize um if you can go in and say hey look I can I can do these kind of attacks I can do these kind of defenses I have a broad understanding of security and Technology um this is going to give you the sort of the practical demonstration of your [Music] abilities. Just before we start the interview I've got to say that this video is sponsored by OffSec I really want to thank them for sponsoring this video and supporting my channel also got some fantastic news for those of you who watch towards the end of the video some great news I won't spoil it now but if you watch towards the end you'll be very glad that you did that because some of you or one of you is going to win something enough of that before I give away too much let's cut to the interview. Hey everyone it's David Bombal back with Jeremy, Jeremy great to have you back on the channel hey David thanks for having me so Jeremy you work for OffSec and I believe you got some great news. I do we have just launched our Sec-100 course a brand new course for those entering the cyber security field. So you've got to tell me OffSec are well known for OSCP but this is the OSCC is that right? Yes so in other words the OffSec Cyber course is what my notes say right? Yes the OffSec CyberCore Certified so you got to tell me because I mean OffSec are obviously well known as I said for OSCP how is this different to OSCP. Yeah so the OSCP and PWK or PEN-200 the course that corresponds to it uh teaches somebody how to be a penetration tester specifically and it isn't necessarily for somebody who is brand new to the cyber security space it's for somebody who has been a seasoned veteran in system administration or in programming or in networking or some other cyber security role uh not to say that somebody without those hats can't go into PWK but generally that's what we see the most majority of students taking cyber core SEC-100 is specifically for somebody who is just entering their toes into cyber security as a whole so even if you haven't been a system administrator or you haven't been a programmer uh you can take SEC-100 and the content will be at the right level for you uh and that's that's really who it's for. So this is different as well to OSCP because it's not just offensive hacking right? Correct we cover uh three main domains and those three domains really represent the OffSec library as a whole so the first is attacking and you know that's sort of OffSec traditional bread and butter the uh the things that we covered in SEC-100 on the attacking space um are sort of preliminary to what you'll find in PEN-200 so in PEN-200 you'll find privilege escalation you'll also find privilege escalation in SEC-100 but the level is brought down the amount of handholding is brought up and so we're really giving students a nice on-ramp into the world of pentesting the mirror of attack is defend and so that's the second uh sort of domain that we cover and uh just like SOC-200 we cover uh security operations we also cover some incident response and some threat hunting and some forensics it's really a survey of all the little defensive spaces that you could be in if you choose to pursue a career in defense and the third trash is uh what we call build and build really refers to all those professionals those heroes in the uh tech industry who don't necessarily conceive of themselves as part of the security industry but nonetheless are integral to the security domain so I'm talking about people like programmers and system administrators and network administrators and Cloud Engineers uh when they go to make their resume they don't think I'm a security professional first but from the perspective of security uh they are because they're building the things that must be secure um so those three domains you can think of them kind of as a as a triangle with connections between them all uh that's really what um the OffSec Library covers and that's what SEC-100 covers. There are a bunch of entry level certifications out there I won't you know mention any names but there's a well-known one that doesn't have any labs it's just a bunch of you know questions how is this different does it have Labs is it more hands on? Yeah exactly so true to OffSec style uh the the goal with SEC-100 is really to give the learner as much hands-on experience as possible uh there are a few modules in there that don't have practical Labs but the vast majority of which do and those that don't are because of another differentiator that I'd love to talk about David which is many of these entrylevel certifications don't give the learner a sense of why cyber security is so important not just a sort of a fundamental in itself but to the business many many certs and courses don't talk about sort of the risk inherence to allowing users to do certain things on your application and what that means for the business on the back end and so as much as possible in SEC 100 we try to return to sort of the business fundamentals and make sure that the learner understands uh the context in which security operates as a part of a business um so those those two things really the the the business angle and the hands-on experience gives Learners a real sense of what they would be doing as a cyber security professional and why they would be doing it and then the third thing that I'll say is that even though we cover attack defend and build the build and the defend are also covered in the context of understanding how the attacker operates and so that's the third real differentiation I would say that that SEC 100 has versus maybe some other uh competing certifications is that we're always thinking about the mindset of the attacker regardless of if you're learning attack specific skills or defense skills or build skills. I like that so I mean in other words I see there's a section on networking which is obviously one of my favorites there's when you talk about networking or you talk about Python which is also in here you the hat that you're wearing is cyber security someone's attacking the network someone's attacking me right right? What what can somebody do if they had access to the to the network or thinking in terms of complexity if you link two computers together okay that's a little bit of complexity but if you link 200 now there's a lot of complexity and each point is one for the attacker to take advantage of and realizing that attacker is thinking way is important because it's not just about um making sure that things work fast or that things are productive but also as you increase complexity in a network or a system um what do you expose to the end user and therefore to the attacker. It's really important I mean at the time of this recording there was just a big event in the last few days right I mean yeah Crowdstrike which was supposed to protect companies is now well known for you know the biggest attack ever and very sad to hear that. There is is an irony there for sure.That was an example of bad code from what I understand that caused all of these issues and I mean the poor people have that have to fix this it's it's what a what a nightmare but it's oh yeah. They they they must have been up pulling out letters for days at this point uh this is a few days after the event I think that's another thing that is important to emphasize is um cyber security is often thought of as as safeguarding three things confidentiality uh making sure nobody can can access that data uh Integrity making sure the data stays how it should be and nobody can change it without permission and authorization and then availability and yeah um the irony is that security is often a um a hindrance to availability if left unchecked and I'm not just I'm not just talking about Crowdstrike here but in general um if you put in as many cyber security protocols as you possibly can and as many controls as you possibly can you make things really difficult for the end user you make things really difficult for the employee and so there's a balance to be struck and SEC- 100 covers you know those three things and how to sort of think about them as a whole holistic uh rather than maximize each one individually. I'm glad you did the business side because I mean this whole event is an example of that right like you just said you can lock everything down so much that your users are just going to try and circumvent all your controls so I've got to ask you a very important question which I'm sure a lot of people are thinking about is so in the course their Labs but is the exam like multiple guess as I like to say or absolutely not yeah it's practical um so the exam mirrors the course structure which is to say that on the attack portion of the exam you have to hack machines you're given a certain amount of machines a certain amount of of information about those machines and you're told go pack very much like the OSCP much let's say I don't love the word easier but I used the word complexity before so less complex machines less complex scenarios the entire exam is 6 hours rather than 24 um so some of that time let's say a third will be allocated to attacking certain machines and gaining access to them on the defender scenario you're really putting on your detective hat uh you're presented with an event that has happened and you can see uh via access to certain kind of machines what kind of event has happened what kind of security event and you're tasked with answering questions but it's not multiple choice there are very very specific answers that we're looking for uh like what time did attack X happen on Y computer uh so it's deterministic it's it's objective um and you go find that information through your detective skills and you go put that in uh and then the build scenarios require you to actually fix some code so we give you access to an application uh show you the code show you how it doesn't work and then it's up to you to fix it and make it work make it make it secure but also make it make sure that it continues to work and uh not take down production so to say the three those three areas each have a representation of the kind of things that you would do as professional um and therefore it's all very it's all very Hands-On practical there's no there's no Theory involved in the exam at all I love that so in other words like hacking is like I've got Kali Linux or something and I'm going to hack some device the fixing is I have to go onto machines and discover basically what what went wrong? uh Yeah in particular uh it's going to be some kind of secure code or insecure code in the say so we'll give you an application let's say uh it's vulnerable to SQL injection and we'll show you the source code for it we'll maybe even point out where it's where it's going wrong and it's up to you to figure out okay what do I need to how do I change the code to make sure the application continues to work and that the vulnerability is no longer exploited and then. I probably said it wrong the defending portion is where you something happened right and then you've got to go and discover that but it's all done practically? Right right so it's it's kind of like an incident response scenario where you you discover that something happened and you report on what has happened uh in this particular case you're not necessarily implementing the defense that comes later with the secure software side of things but in this case you're you're you're playing the the detective so to speak uh figuring out what happened why it happened where it happened how do you know how do you prove that it was a security event and not just some anomaly. I love that because I think when you start out you're not always sure I mean red team hacking is where people obviously you know all the the sexy side of things are but it in the real world I mean the jobs are more on The Blue Team side so this gives you a good taste of three different areas right? From a learner perspective like somebody coming into the field somebody Googling and being like I think cyber security is interesting what can I do um many people see the red side are like hacking sounds cool but you're right the truth is is that there are far more jobs on the defending side of things um they're just not necessarily as marketable um at least you know I'm I'm certainly biased having come from the red side myself but I think you know when I was looking into joining this field the attacking sounded so much more fun than defense that sounds hard that sounds like I need to I need to make sure I can keep an eye on every single attack it's exhausting and it is and uh kudos to the defenders out there it's it's really a lot of work um but I think what cyber core does what SEC-100 does is really make uh the full field palatable and explain why all these different things are interesting and who they're interesting for and how you get into them uh so that's really what it's about we have a section on Career Development as well as part of the course where uh after you've gone through everything so you've gone through uh the attack you've gone through the defend you've gone through the build uh there is a part at the start that that we didn't talk about so we should return back up at the end yeah but jumping jumping all the way to the to the to the bottom of the course you go through a module about developing your career and that module talks about resume writing and interviews and how to position yourself as a professional in the field um which is something that many many certifications and courses don't really cover because it's more of a theoretical not theoretical yeah um not a not a Labs based module uh there's nothing about that on the exam but we want to provide that information to Learners so that they can finish taking the exam and then go off and write their resume and and talk to potential employers. It's important because I mean it's fun to hack it's fun to do these things but at the end of the day you want to job. Absolutely yeah so so let's let's just work backwards to give everyone a sense of of where we're at so we ended off with with this Career Development uh we did our our build section we did our defend we did our attack before attack is this General skills section and the general skills section covers things that you will need to know regardless of your career choice whether that is as a penetration tester or a threat hunter or a developer everybody needs to know some Basics and those Basics include cryptography Linux Windows networking how those things link together it's not only that these things are helpful in your job role in the sense that if you can program it makes automating things easier it's that programming languages themselves are objects of security and so if you don't understand how a certain function can access another privileged part of code and what ramifications that might have um then you're sort of at a disadvantage so these sort of general skills provide you with immediate practical assistance in your day-to-day but they are also things that you study as sort of objects of security in themselves. That's great I mean something I'm sure a lot of people are asking or thinking is is are there prerequisites for this so do I need to go and do because like a lot of people say go do Network Plus or CCNA go and do um Pentest+ or there's like this whole track so is this like my first cyber cert or do I need to do other stuff first? This is really the the ground bottom in terms of OffSec certifications um we talked about Pen-200 we didn't talk about Pen-100 and so if you kind of want to visualize it there's SEC-100 and then PEN-100 and all the other 100 level uh learning paths that we have and then the 200 level courses and the difference between say SEC-100 and Pen-100 the syllabus is really similar but the level of handholding that we're providing is is much higher for SEC-100 um and the reason the syllabus is simple is uh is similar as simple it's because these are just things that you need to know as a cyber security professional we're not trying to handwave that away we still want people to come out with recognizable marketable skills but we're trying to give learners a little bit more assistance in obtaining those skills. This would be my first cert uh um SEC-100 uh OSCC and then from there I could say okay I actually want to do blue teaming and then or I want to do coding let's say and then I can take a track that's coding is is that correct? Exactly exactly so it's kind of like your choose your own adventure cert where you do it you get a little bit of a basis and everything and then you'll have a better sense of oh yeah this really works for me I want to go pursue that or uh this was really challenging but it's really interesting so I'm going to go try bashing my head on that part. The course material does it have videos or was it just reading or is it like just how does it what what is it what what's the makeup? yeah So we've tried to create the modality that works best for the specific type of content so there's um there's text as is traditional OffSec course but there's a lot of videos uh that expand on the text and provide a little bit more color literally and then of course there's the labs and so as you go through the module you jump from text to video to Labs depending on what happens to be best uh for that specific subject. Obviously offensive red teaming is is very popular with the audience so the offensive side what kind of attacks are you doing is it against like AD is it against websites what kind of attacks are they? uh so there are 1 2 3 4 5 6 modules in the offensive uh realm in the offensive part of the course we start off with process and this is true for all the different process we start off with process understanding the why and understanding what it is that somebody in this space does so in terms of pentesting what what is a pentest why do we do it what are the different steps um what's the sort of relationship that you might have with a client or with your internal organization um we go into information gathering and enumeration enumeration is just a fancy term for finding out information about the network or the machine or the system or whatever it is then we go into web attacks web attacks I always find are a great first object lesson because everybody's familiar with them we all use web applications all the time and so the idea of oh yeah this is an input field and I can put in my username my password and somehow the the web application has to authenticate me like not everybody's thought about that but we all just sort of intuitively understand that that's a thing uh whereas some more um esoteric type of systems we're just less familiar with in general um as regular users um so so web is a really good first look at like oh yeah here's where an attacker can start getting their hands dirty we then talk about endpoints attacking endpoints and that's just another fancy term for a computer so we've we've graduated from a web application sort of a user-facing uh application to the underlying system itself from there we talk about defense evasion now that you've learned a little bit how to hack a computer what happens if there's sort of intentional defenses installed on that computer and what do you do about them uh so things like antivirus and um we end off with a section on cloud particularly offensive cloud in this case cloud is becoming more and more prevalent and it's important for people getting into the field to understand that cloud isn't sort of this other technology that you know other people are going to go do it's going to become more and more integrated with uh the day to day regardless of your role. I got to ask this I just once again saw Linux Basics Windows basics in the introductory section so I'm I hate to hop on this just to make the point prerequisite skills for this cert is it just basic knowledge or do I have to do like anything before this like do I have to learn Linux before I get you? No we're going to teach you the all the Linux Basics that you need for the course we teach you in in in the course. So all I need to do is like have obviously like know how to use a computer really basic foundational stuff like A+ kind of knowledge is. yeah yeah I mean be able to turn it on open up programs uh type on the keyboard um if you have some conception of what a command line is and how it interacts with the computer and how you can interact with it that's really good um but that's that's really the bare minimum you need I love this so I mean this again is my first cyber cert from OffSec who are have I would say the Gatekeeper or the the top cert when it comes to pen testing OSCP it's the one that always comes up so you guys have now taken it to the beginning so you had like sort of this higher end so that that was really well known but now you're trying to do the same thing for beginners. Yeah I mean we' we've had Pen-200 we made Pen-100 but that's really really preparatory for Pen-200 and this is sort of even more preparatory in general for everything. Topic that's always like a very popular wi-fi hacking is that also here? yes I do yes there is one module on Wi-Fi in the uh defensive space so again we talk always from the attacker perspective or at least we return to the attacker perspective but this this one is is part of defense so how do you think about securing a a Wi-Fi network and what we've done here is a really cool activity uh it's difficult to virtualize Wi-Fi so what we've done is walked the learner through how they can go about um auditing and then securing their own home Wi-Fi network. And it's I'm glad to see you've got IoT and embedded systems. Yes an area like cloud that is becoming more and more embedded not to not to overuse the term in everything else and uh it's very important that even if you're not going to go really really Hands-On you get an understanding of what are people talking about when they say embedded systems or OT. I love this so in other words very wide range of topics very broad but like inch deep type thing right it's not where like when you go to OSCP it's very much deep deep on hacking. Yeah I I would say an inch deep in certain subjects um maybe 3 inches and others there's certainly there's certainly are that we're focusing a little bit more on in terms of those hands down activities because we want that certification at the end to be practical um so things like attacking endpoints things like um uh incident response basics uh these are things that we're going a little bit deeper on but then there are certain models that yeah we're covering hey this is a technology you need to know about here's how it relates to the business here's how it relates to attack defend and build. Most important question I think always is at the end of this am I ready to get a job cyber? Depends on what job uh you're not you're not likely to go and get a job as a penetration tester but yeah a junior level stock analyst absolutely. yeah I think it's important to it's important to highlight that because there's too much stuff out there where they say take this course and you'll earn this crazy amount of money and be a pentester the next week. Of course of course yeah the economic economically it just doesn't it doesn't work that way if if you can give somebody a two way course and then they go get a six figure salary like everybody would do it so can't this is reality there was that book from was it Peter Norvig many many many many years ago that wrote like learn see in 10 years which I think really emphasizes like you can't there's no get-rich quick scheme here uh you got to put in the work but something like SEC-100 lets you put it in at a pace that works for you and it lets you really accomplish something uh in a relatively short amount of time rather than like keeping your eye on a decade year long prize. Another thing people forget is you don't know what you don't know I always like to say that you are highlighting my weaknesses when I take this and showing me like okay perhaps I'm I'm strong on wi-fi hacking as an example but I'm very weak on some other type or some other sphere in in in in in this list of you know topics okay so the exam is 6 hours handson um I completed in one go right or one sitting yeah yeah yeah for sure and is it how does how does the evaluation work do you guys like grade it and then I just get a like an automated email or something telling me that I've passed yeah because there's there's no report required for this exam so you go and let's say in the attack case you go and attack the machines you'll get some kind of proof that shows that you attack the machine you put it into the exam system and you'll know right away if you got it or not not all the questions are like that or not all the not all the inputs are like that so you don't necessarily know if you got the answer correct but at the end of the exam you say okay I'm done and off you go and it'll tell you okay you passed refill and what it is. Let's say I I'm doing the offensive side the attack side and then I I'm I'm further along in the exam can I go back to the attack site if I remember something or is it like. no no you can go go between the this so the way that the exam works is you get access to all the questions all the challenges and you have your six hours and you can use that time however you wish you can go in whatever order you wish is a proctored exam so it's proctored by OffSec however you can take breaks you can say I'm going to work for one hour and then take a three hour break that works for you and you can get it all done I'll power to you. So when you say it's proctored is that means someone's watching what you're doing monitoring what you're doing is that is that what you mean? yeah just like all other OffSec like exams. no no report writing at the end so as soon as I click submit I think I've done I get I can I can get my result. right. so question that often comes up with certs like this is it a lifetime or does it expire because you know I could have done this 20 years ago let's say in theory and I I forgotten everything yeah so the OSCC does expire after 3 years. Jeremy this is going to come up a lot from a lot of people I think do I have to buy like prep exams or you know if I go and take the exam and I fail is that the end of it or do is there like something that allows me to take the exam again? yeah the nice thing is that two exam attempts are included with with the purchase so you could try once fail and then after some cool off period you go again and and try it again. Let's say fail today or life happens stuff gets in the way right is there like a period of time like what's the limit for me to you know take the exam so I purchased today is it like do I have to do in three months or is it like 12 months or something yeah you you'll have to look on the website to get the official answer but as of my current understanding recollection it's 12 months from the time of purchase. How do you say there's no better mock exam than to actually go the exam yeah and Cuz you might feel okay I'm ready but then you're not and that's a good way to test if you're ready and then. And get rid of just get rid of those nerves you know. yeah exactly we're all uh conditioned from from years at school to few exams and think that we're being judged uh but the truth is exam is just another way to test yourself. Jeremy what kind of roles could I expect like let's say I get the cert you've already highlighted that I mustn't expect to become like a full-time pentester necessarily I might be lucky to get that role but um what sort of the job roles that this is aimed for? yeah really any Junior level role um if you can go in and say hey look I can I can do these kind of attacks I can do these kind of defenses I have a broad understanding of security and technology um this is going to give you the sort of the practical demonstration of your abilities um are you going to be a senior network engineer no but can you go to uh you know a network engineering position and say Hey listen this is what I know can you use my skill set yeah absolutely. It's interesting that you mentioned network engineer because I didn't expect that to be in the list I saw other like um like roles as Junior penetration test what I would which I would expect, SOC analysts it security specialist security consultant interesting to see network engineer there but I think it's become important right you can't do you can't be an IT today without having this focus on on cyber security. On security and that kind of goes back to what I was saying at the start which is I don't think Network Engineers you tell me David you know better than me I don't think Network Engineers considers themselves or think of themselves as a security professional and so I'm not saying that you know SEC-100 teaches uh the basics of of routers and switches and how to connect things together that's not what it's about but it's offering a layer of skill and understanding that I think most Network engineers at the junior level aren't going to have uh so you might be able to go there and say Hey listen I still need to learn about switches but what I can tell you is this this and this. I love that though because I mean obviously because of my background I mean if I did CCNA I'm going to get good routing and switching knowledge good networking knowledge but it doesn't have a big emphasis on cyber security it just has like a little bit on on security and this is you know it's great if I got CCNA plus I combine it with this I mean then I would be a really in demand network engineer I think. Exactly and it's the same with um with programming right we're not we are covering Python Basics PowerShell Basics but our goal with that is not to teach you how to be a programmer our goal with that is to teach you the the bare minimum you need to know to understand why programming is part of security in the first place and then skills that you'll need to fix code um but you have to go learn programming if you want to actually go be a developer. But I love that as well because like let's say I'm I I was at Uni and I did some coding course it's it's well known that a lot of these coding courses don't teach proper security or good security practices right so this gives me something really good to add to my coding skills exactly okay it's all the rage these days Jeremy AI is there any AI in this? AI is all there is these days and yes there is uh very very sort of survey level coverage uh what is AI what is an LLM what's a GPT all these terms that have come up in the past let's say year um we do have a module on that because we think it's important that people understand how this interfaces with security um just like Cloud or programming or networking AI is both an object of security you can study in the sense of how do you make something like this secure and also an enabler for for security how do you use it to uh be better at your security job whatever that happens to be um and so we we cover a little bit of both we talk about both uh it's not an AI course it's not it's not you know solely focused on AI but we do uh cover it in that one module because we think it's important for learners to have some grounding in as they start to explore their other cyber skills. I love that because I just interviewed someone recently where they were talking about how a AI is exactly as you've said there you know a lot of AI implementations really badly done no encryption etc etc and also AI is being used dramatically more and more for hacking. There there was a report that came out recently from Mandiant if I recall they were talking about use cases of AI and specifically AI and offensive operations and phishing is uh the number one use case for for AI because you can you can think about it um getting Chat GPT to write you a thousand phishing emails tailored to a thousand different individuals that's something that that kind of uh system is really good at it's starting to be used also for sort of vulnerability discovery and vulnerability exploitation but by far the human element is the one that it can most easily exploit because it's a language model. So I was just reading through sort of the documentation the in the course you mentioned Labs so I've got lots of practical Hands-On Labs correct? Yes there's there's videos there's text that I can read the quizzes stuff like that right? yeah so there's the the quizzes so to speak or questions and answers um we we've tried to have less of them than we have in some other content uh because we really want to emphasize the Hands-On component but there are certain modules certain areas where there's just no there's no way to virtualize a lab and there's no lab to talk about uh say processes right um so we do have some questions and answers but um they're strategically placed so that they reinforce the learning they're not meant to be sort of the the objective of the learning. I think that's so much better than other certs out there and again I won't mention names where it's just reading and you're just asking these multiple choice questions that have it feels like have no real world implementation this is really hands on I love that. I think the real answer depends on the learner there are a lot of people who will say okay I know that I have all this text content and I have this video content but what I'm going to do is I'm going to go to the lab I'm going to go try it and that's where I'm going to spend my time and I'm fiddle around with it until I get it if I need to use the text maybe I'll go back and and give it a read um but for some learners it's going to be 95% of what they do because uh they just they're just kind of learning through doing rather than reading or watching video. yeah but I love that I mean different different options for different people exact some people prefer watching videos some just prefer Hands-On I think most of us prefer Hands-On especially if it's hacking right I mean there's no better way to do it than to do it. People do have this sort of idea of themselves that oh I'm a visual learner or I'm an audio learner whatever it is um it seems like that has that kind of theory has been debunked people do learn in all these different ways and it's about finding the modality that works for the specific information that's being prepared which is what we've tried to do we've tried to match the whether it's text or lab or video depending on the kind of thing that is attempted to be taught. Big question obviously is always going to come up the price? Yes it is if I believe $8.99 you have to check online to get the the formal prices uh don't quote me here but I think it's $8.99 for a year of access. Just for everyone watching got some great news for you really want to thank OffSec for doing this they have given me a special link which you can use below which will give you $100 off the cost of the course and the exams so really want to thank them for doing that and also one of you are going to be able to win a free spot so use the link below you can use that to enter and one of you will win the course for free so again thanks to OffSec for doing that and thanks to them for sponsoring this video Jeremy really want to thank you you know for coming on and sharing again it's great to have you back on the channel got to get you back again for something else have you got any final words before we wrap up? We're uh we're really excited to um have have all the Learners and this one lucky learner that gets uh gets your your your voucher that's that's awesome looking forward to hearing your feedback and David if you have a chance to go through it yourself uh we'd love to hear from you as well. Yeah I'd love that so we'll we'll talk offline be great to go through it and you know talk more about it in in future videos Jeremy again thanks so much for sharing and all the best. All right David thank you [Music]",
    "transcript_keywords": [
        "cyber security",
        "security",
        "Yeah",
        "things",
        "sort",
        "cyber security professional",
        "kind",
        "cyber",
        "exam",
        "yeah yeah yeah",
        "people",
        "OffSec",
        "network",
        "attack",
        "yeah yeah",
        "security professional",
        "OSCP",
        "work",
        "skills",
        "make"
    ],
    "transcript_entity_values": [
        "6 hours",
        "these days",
        "three",
        "95%",
        "Mandiant",
        "OffSec",
        "Cloud Engineers",
        "3 inches",
        "three months",
        "two",
        "OffSec Cyber",
        "Linux Basics",
        "second",
        "SOC",
        "100",
        "Crowdstrike",
        "Python",
        "this 20 years ago",
        "Python Basics PowerShell Basics",
        "Labs",
        "David Bombal",
        "Wi-Fi",
        "Career Development",
        "the end of the day",
        "OSCP",
        "Gatekeeper",
        "The Blue Team",
        "SEC",
        "a thousand",
        "10 years",
        "Jeremy, Jeremy",
        "today",
        "a decade year long",
        "one",
        "the last few days",
        "a decade year long prize",
        "100",
        "Kali Linux",
        "Jeremy",
        "Sec-100",
        "six hours",
        "the next week",
        "first",
        "PWK",
        "IoT",
        "the day to day",
        "Cloud",
        "Linux Windows",
        "days",
        "wi",
        "Labs",
        "8.99",
        "Network Plus",
        "a three hour",
        "AD",
        "David",
        "Peter Norvig",
        "SQL",
        "Linux",
        "AI",
        "LLM",
        "SEC-100",
        "Jeremy AI",
        "a few days",
        "CCNA",
        "six",
        "Network Engineers",
        "200",
        "third",
        "OffSec Library",
        "Network",
        "this Career Development",
        "3 years",
        "12 months",
        "the OffSec CyberCore Certified",
        "Learners",
        "one hour",
        "Uni",
        "a year",
        "CCNA",
        "GPT"
    ],
    "transcript_entity_types": [
        "TIME",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "TIME",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PRODUCT",
        "DATE",
        "GPE",
        "ORG",
        "MONEY",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "GPE",
        "DATE",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.0819539725780487,
        -0.03941436856985092,
        -0.02799195796251297,
        -0.06355559080839157,
        0.057309817522764206,
        0.038122035562992096,
        0.08265130966901779,
        0.025962380692362785,
        -0.028256433084607124,
        -0.02099761739373207,
        0.007182176690548658,
        -0.10848764330148697,
        0.0271927397698164,
        0.02999265119433403,
        -0.030325643718242645,
        -0.02075785957276821,
        0.04510745033621788,
        -0.07110334187746048,
        -0.04570363089442253,
        -0.051295824348926544,
        -0.0423579216003418,
        -0.06650272011756897,
        0.04870791733264923,
        0.008650554344058037,
        -0.08147609978914261,
        -0.01735164038836956,
        -0.06678692251443863,
        -0.042703911662101746,
        -0.02110920660197735,
        -0.050076887011528015,
        0.027608992531895638,
        0.0006996057345531881,
        0.02424151636660099,
        -0.008553048595786095,
        0.07430005818605423,
        -0.015985537320375443,
        0.010720078833401203,
        -0.016725659370422363,
        -0.017165854573249817,
        -0.002489513484761119,
        0.01230020821094513,
        -0.1358388215303421,
        -0.08594807982444763,
        0.034632716327905655,
        0.046252600848674774,
        0.02352975681424141,
        -0.012677847407758236,
        -0.06998039782047272,
        0.022123107686638832,
        0.005329967010766268,
        -0.07966646552085876,
        -0.058866649866104126,
        0.05444294214248657,
        -0.023812035098671913,
        -0.09282735735177994,
        -0.042829155921936035,
        0.013784701004624367,
        -0.0002352414303459227,
        0.018378151580691338,
        -0.018345598131418228,
        0.09321199357509613,
        -0.04495532065629959,
        -0.08117661625146866,
        0.06839963048696518,
        0.035791534930467606,
        -0.036307573318481445,
        -0.05791257694363594,
        0.0967411994934082,
        0.02193586528301239,
        -0.041796792298555374,
        0.013621872290968895,
        -0.009281555190682411,
        0.00449358718469739,
        0.0642690435051918,
        0.02247944287955761,
        -0.016773376613855362,
        -0.013789829798042774,
        -0.021255668252706528,
        0.01956307888031006,
        -0.036903880536556244,
        0.0909438207745552,
        -0.04864487051963806,
        -0.03373405337333679,
        -0.03016567789018154,
        0.034740082919597626,
        0.010515831410884857,
        0.04191992059350014,
        -0.009347199462354183,
        0.04066963866353035,
        0.012057858519256115,
        0.04544077441096306,
        0.06956401467323303,
        -0.0005191879463382065,
        -0.012240743264555931,
        0.055014658719301224,
        -0.037855084985494614,
        -0.0032710330560803413,
        -0.02875673957169056,
        -0.029419513419270515,
        0.11029582470655441,
        -0.024999767541885376,
        0.01569499634206295,
        -0.06374098360538483,
        -0.058702487498521805,
        -0.03005893900990486,
        0.04444413632154465,
        -0.029339637607336044,
        0.10386402159929276,
        0.13773344457149506,
        0.026513250544667244,
        -0.04032612964510918,
        0.04195179045200348,
        -0.029649965465068817,
        -0.05879119783639908,
        -0.025960074737668037,
        0.07259457558393478,
        -0.07632002234458923,
        0.061832502484321594,
        0.09028183668851852,
        -0.030684825032949448,
        0.045362357050180435,
        0.021230090409517288,
        -0.006156601943075657,
        -0.006502146366983652,
        0.05187932774424553,
        -0.08970119059085846,
        -0.023067781701683998,
        5.309060726087351e-33,
        0.03301289305090904,
        0.08566156774759293,
        -0.030689965933561325,
        -0.005013385321944952,
        0.00809903722256422,
        0.020966283977031708,
        -0.0024762775283306837,
        0.0574217326939106,
        -0.12185261398553848,
        0.023298215121030807,
        -0.037024542689323425,
        -0.014226208440959454,
        0.021049322560429573,
        0.028958721086382866,
        -0.041117239743471146,
        -0.010716780088841915,
        -0.027882413938641548,
        -0.09694087505340576,
        0.0030302421655505896,
        -0.01828952506184578,
        0.05589623749256134,
        0.00011642707977443933,
        0.010035494342446327,
        0.05341888591647148,
        0.05132843181490898,
        -0.0035089384764432907,
        0.01733650080859661,
        -0.01932532712817192,
        0.10567169636487961,
        0.04082222282886505,
        -0.08069168031215668,
        0.005843594670295715,
        -0.03347872942686081,
        -0.01746816374361515,
        0.103500135242939,
        0.04340135678648949,
        -0.032864466309547424,
        -0.11671129614114761,
        -0.0007188557647168636,
        -0.03740064799785614,
        -0.008098565973341465,
        0.03597768396139145,
        -0.009603890590369701,
        -0.0004377838340587914,
        -0.020166810601949692,
        0.007335305213928223,
        0.043794624507427216,
        -0.04379047825932503,
        0.08322038501501083,
        -0.033208705484867096,
        -0.11998286098241806,
        0.012760019861161709,
        -0.06446591019630432,
        -0.07549304515123367,
        -0.06709746271371841,
        -0.06802437454462051,
        -0.018678145483136177,
        0.059371139854192734,
        -0.04320480674505234,
        -0.06925219297409058,
        0.06219488009810448,
        0.02105419524013996,
        -0.028661297634243965,
        -0.04047003015875816,
        -0.1289326697587967,
        -0.047012556344270706,
        -0.040072858333587646,
        0.026972319930791855,
        0.08149144798517227,
        -0.02611021138727665,
        -0.06866031885147095,
        0.06041031703352928,
        0.06164431571960449,
        -0.014514623209834099,
        -0.009484268724918365,
        0.011481518857181072,
        -0.029712023213505745,
        0.022217340767383575,
        0.0512625128030777,
        0.021124709397554398,
        0.001925550284795463,
        -0.004665096290409565,
        0.07185612618923187,
        -0.042179886251688004,
        0.02829117886722088,
        -0.0005293348804116249,
        0.041745107620954514,
        -0.03362913429737091,
        -0.02114805206656456,
        0.025909610092639923,
        0.01971159689128399,
        0.01283761952072382,
        0.015490414574742317,
        0.07452433556318283,
        -0.04954858124256134,
        -6.940760026359953e-33,
        -0.04854999855160713,
        -0.024088116362690926,
        0.027181193232536316,
        0.005812057293951511,
        0.08419180661439896,
        -0.026785962283611298,
        -0.052443090826272964,
        0.05282512679696083,
        0.06081297993659973,
        0.07204249501228333,
        0.013395038433372974,
        0.026618221774697304,
        0.026645170524716377,
        -0.07480131834745407,
        -0.02235465869307518,
        -0.11082597821950912,
        -0.01655735820531845,
        0.01863277517259121,
        -0.055441342294216156,
        0.0010932974983006716,
        0.06956923753023148,
        0.15042667090892792,
        -0.02212783508002758,
        -0.007978840731084347,
        0.030206680297851562,
        0.0388152077794075,
        0.07851231098175049,
        0.07739275693893433,
        0.06879997998476028,
        0.059452928602695465,
        -0.01042973157018423,
        -0.023414572700858116,
        -0.11831032484769821,
        0.042164236307144165,
        0.0009086902718991041,
        0.035604484379291534,
        0.03211963176727295,
        -0.009046020917594433,
        -0.03780927136540413,
        -0.00353742903098464,
        0.06834685057401657,
        0.02884126454591751,
        -0.06966790556907654,
        -0.005949890706688166,
        0.017847435548901558,
        0.0006234418251551688,
        -0.05081573873758316,
        4.9277507059741765e-05,
        -0.01823798567056656,
        -0.042477916926145554,
        0.053467318415641785,
        -0.007624092046171427,
        0.008950535207986832,
        -0.008048553951084614,
        0.03411170467734337,
        0.05057685077190399,
        -0.033770762383937836,
        0.014724621549248695,
        -0.03559620678424835,
        -0.008498058654367924,
        0.0226580873131752,
        0.051255542784929276,
        -0.014468261040747166,
        0.06485265493392944,
        0.058717139065265656,
        -0.03217795491218567,
        0.008481153286993504,
        0.15724989771842957,
        -0.07015908509492874,
        -0.03135684132575989,
        -0.046667926013469696,
        0.020839691162109375,
        -0.0846935585141182,
        -0.09517264366149902,
        -0.02419276162981987,
        -0.010807491838932037,
        0.006834714207798243,
        0.04925345629453659,
        -0.007067346014082432,
        0.006476087030023336,
        -0.03185047209262848,
        -0.008504570461809635,
        -0.021035930141806602,
        0.020603680983185768,
        0.12579262256622314,
        0.08859430998563766,
        0.05531411990523338,
        0.023927710950374603,
        -0.028201721608638763,
        0.038480017334222794,
        0.015777818858623505,
        0.016737032681703568,
        0.03921966999769211,
        0.08095943927764893,
        0.03894566744565964,
        -6.560748033734853e-08,
        0.034473687410354614,
        0.01610402949154377,
        -0.030475037172436714,
        0.05066093057394028,
        0.07516541332006454,
        -0.0010270036291331053,
        -0.07128661870956421,
        -0.059168100357055664,
        -0.06495983153581619,
        0.0010270087514072657,
        0.020860129967331886,
        -0.023030972108244896,
        -0.062300439924001694,
        -0.041846662759780884,
        -9.992764717026148e-06,
        -0.058429788798093796,
        -0.10855352133512497,
        0.049893613904714584,
        -0.033785801380872726,
        -0.04758892208337784,
        0.0443895123898983,
        -0.03835740312933922,
        0.007249048911035061,
        -0.0211201012134552,
        -0.08574216812849045,
        0.033656783401966095,
        -0.016922039911150932,
        0.06865290552377701,
        -0.020699385553598404,
        -0.04886062070727348,
        -0.07630901038646698,
        -0.07785046100616455,
        -0.014839272014796734,
        -0.06009966880083084,
        0.045924995094537735,
        0.02873340994119644,
        -0.07807992398738861,
        -0.03440416604280472,
        0.050671979784965515,
        0.03537170588970184,
        -0.047700971364974976,
        -0.01893273927271366,
        0.12953898310661316,
        0.08389054983854294,
        -0.010636924766004086,
        -0.007495101075619459,
        -0.09376212954521179,
        -0.06796171516180038,
        0.051782816648483276,
        -0.03284663334488869,
        -0.006709961220622063,
        -0.09630823880434036,
        -0.01849168725311756,
        0.0381210632622242,
        0.06558448076248169,
        0.047967616468667984,
        0.022411875426769257,
        -0.0181608684360981,
        -0.04710989445447922,
        0.07114148885011673,
        0.05155375599861145,
        -0.08863358944654465,
        -0.08277975767850876,
        0.03637945279479027
    ]
}