{
    "id": "5Me4HEcHghk",
    "title": "Ultimate HP Business Laptop Haul",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-11-06T03:02:24Z",
    "video_url": "https://www.youtube.com/watch?v=5Me4HEcHghk",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "HP",
        "Elitebook",
        "ProBook x360",
        "ProBook 445",
        "Hp Store",
        "HP Computers Review",
        "HP Review",
        "Unboxing",
        "Best computer for busines",
        "best computer for business",
        "best lap top for work",
        "work computer reviews",
        "best work computer",
        "best PC",
        "PC for work",
        "work PC reviews",
        "elitebook 835",
        "elitebook 845",
        "elitebook 855",
        "probook 635",
        "aero",
        "lightest business laptop",
        "probook x360 435"
    ],
    "views": 168875,
    "likes": 6445,
    "comments_count": 508,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, it's Justine and today's video is going to be a little bit different than my usual videos, but it is going to be very exciting, if you're someone in the corporate world, who's looking for a PC for yourself, your business, or outfitting your company's employees. Now, that's not to say that these can't be used by everyone, but I partnered with HP to showcase this lineup in a way that highlights the best use cases for the corporate world. We'll be focusing on security, sustainability, and the software, plus the design and specs of them all. Let's get into it. Thanks to HP for sponsoring this video and providing these devices to show you guys this current lineup that might fit your needs. We're gonna be unboxing and covering four devices today. The HP ProBook x360 435, the HP EliteBook 845, the HP ProBook 445 and the HP ProBook 635 Aero G7, that a lot of devices for one video, so I hope you guys are sitting down and have a snack or two, maybe get a whole meal. The first one that we have is the HP ProBook x360 435 G7, that is the full name and we're about to unbox it, let's, let's get into it, I kind of already opened it up and took a little peak. Power supply and computer. This is actually a lot smaller and thinner than I thought and it's also super light. All right, here's a first look. Oh yeah, I'm ready to type, oh, this has the fingerprint sensor on it as well. So this is the HP ProBook x360 435 G7 and what I love about this is the fact that this has a 360-degree hinge. So this allows the user to really choose how they wanna use this in any situation, especially for businesses, this is really great for presentations, you can just flip the display over and you're ready to go and you know what else this is really good for? Other than works, this great for watching movies or TV shows, whatever you want and then you can get back to work. I love that this is a touch screen, and it can also act, as a two in one so if I wanna turn this into a tablet, I can. So this makes things like giving presentations or watching content or making some podcast notes so that my sister and I have something to look at while we're doing our podcasts very easily, this is great. Lots of stuff to talk about in the next episode of the podcast, Jenna, coffee, tech, Matty, more Matty, Matty, the dog, pets, cute dogs, tech, 'cause there's some business getting done right here, guys. A lot of these laptops can be customized with different things. This one, for example, you can also get it with dual cameras. So this does have one camera up here on the display. It also have an option if you wanna get another camera in the keyboard so if you're in tablet mode, you'll be able to take photos no matter how you're holding the device. This one actually doesn't have the dual cameras in it, but just knowing that that's an option, if you do want it is pretty cool. This also has a fingerprint sensor, which is another optional feature. I'm such a huge fan of having fingerprint sensors on my computer, it's something that I've become very used to. So the fact that this does have this also built in is another really great security feature. As for performance, you got a choice of the latest AMD Ryzen 4000 Quad, six or eight core processors. There's a long lasting battery life with HP fast charge, which will get you to 50% in 30 minutes. Now security is obviously a huge concern, no matter who you are. With the fear of firmware attacks, that can completely destroy your PC, this has HP Sure Start for AMD, which is a self-healing BIOS that automatically recovers from attacks without having to do anything like it just does it automatically for you. The HP Pro Pen also lets you write, draw and take notes on the screen. In addition to your business work, this could also be a great addition for kids doing their online classes and taking notes or just drawing and having fun. I know I honestly can't even imagine going back to school right now. I'd be so hyped up to take notes all day on all of these amazing devices that are out there. This keyboard is spill resistant, which also makes it very easy to disinfect with various types of wipes. Now I can't tell you how many times I've spilled drinks on my laptop and I know I'm not alone. This is running Windows 10 with a 2.7 gigahertz AMD Ryzen processor, eight gigs of RAM, a 256 gigs solid-state drive and display is 13.3 inches. It also has a microSD card expansion slot and weighs about 3.19 pounds. Like, it's super light. Here's our microSD card slots, our headphone port, HDMI, USB-A, USB-C and a power port. And on the other side, we have a another USB-A, you can never have enough USB ports. Next up is HP EliteBook 845 G7. This one I did not take a peak in so join me for the unboxing. Power. Ooh, this is a nice cable. Look at that. Oh my gosh, this is honestly, I kid you not, I think this is my favorites power adapter to date for any computer ever, look at this. It's like a braided soft cable. Oh my gosh. How cool? Oh, this is also super light. For the things that I like to so far is how light these are. Portability is something that's really important, I think especially, for basically for anybody that has a laptop, but this is so light. This one has the new HP logo on it. It's just, I don't know what it is, it's just perfect. I mean, look at this, like that logo just makes everything look so cool. This is cool, this is cool. Oh, okay, this is, look at this, this has like a little, like it's not a joystick, but, does that have a special name? This has such an awesome look to it. I mean the speakers, they even kind of have them etched in like this really nice design. Oh it has the anti-reflective screens. These have bang and Olufsen speakers. I love the little designs have on the keyboard layout. It makes it look really cool. Let's pump up this really chill jam. (soothing music) So here it is and some of the main highlights other than of course the performance is the design. This is highly secure, super thin and very light. It has an all-day battery life up to 26 hours, which is the world's longest battery life in an AMD-based mainstream business notebook. Can you guys say that five times fast? World's longest battery life in an AMD-based mainstream business notebook, (mumbles) you get the point. This is also the first time that AMD processors are available in EliteBook. This features AMD's Ryzen pro-processor with Radeon Vega graphics, a new redesigned keyboard that has a really quiet typing. You guys, well I mean, of course you hear it, but it's way more quiet than previous models. - [Man] You know it could be cracking in your ears. - This will come in handy if we ever actually go back to offices, I know some people have returned to work. If you are in an office with a lot of different people, the more people typing on their keyboards, the louder that that's gonna be, so, any way that you can reduce keyboard clicking is definitely a plus in my book and my book is digital, so, you can find it on anywhere that you get books. (laughs) It has this really cool keyboard-based power button that you can program with a hot key so all of your apps will launch at once. For me, this is huge because whenever I'm about to do a live stream or something like that, like there's a bunch of different apps to go into this, so being able to just press a button right there on the keyboard and everything that I have set up will automatically launch, that's gonna save me, I mean, probably not like that much time, but, I mean like, if you, you know in the long run, if you think about this over the course of years, it's gonna save you time and there's nothing that I love more than saving time, maybe some key into your cookies that can maybe rival that, it's debatable, but this is a feature that I'm obsessed with. HP Sure is integrated privacy screen, so if people are next to you, this will help conceal your screen, at a side-angle view, check this out. Okay, I will make, how about a spreadsheet on how many snacks I eat a day? I don't wanna lie 'cause I don't have anything in my cup. So this is HP Sure view, this is a privacy screen and basically you just push a button and automatically your screen dims to this copper color, so you're not able to see it from the side and when I turn my screen to you guys, you're able to see it. Isn't that crazy? I really wish that this was a feature in every computer because there's a lot of times that I'm working on projects that are super secret or I'm editing a photo of myself for Instagram and I don't want the people in the airplane to see what I'm doing and ask me questions. I also used to always work at coffee shops and on flights and even in places where my screen is very visible, so this is really cool, I love it. This is one of the only HP laptops that come with HP WorkWell integrated into it. This is designed to coach you, to take breaks, exercise and give you productivity tips, personalized to you. If only it could lift up my limbs and pick up the weights for me, then we'd be in business, but until then, I mean that's at that point, then we would be robots and I don't even know if we need a computer, 'cause we are one. This has 16 gigs of RAM, 256 gigs of storage, Ryzen R7 pro, 4700U processor, 14 inch full HD display with a built-in HD and IRR camera with a wide viewing angle. So here's the ports on this one. We've got two USB-As, we've got a headphone jack and on the other side we have actually two USB-C ports and HDMI and our power adapter. Again, a lot of these laptops are customizable, so I'll put links in the description where you can check them all out and see everything that you can customize in each one. But now, guess what? We have another computer to look at. Next up, we have the HP ProBook 445 G7. This one, this one looks a little bigger than our previous. I should probably use an axe to open this. Oh yeah, look at you. Power adapter. (upbeat music) This is cool. This has a little privacy slide. All you have to do is slide it right over there to the left and your camera is hidden. One of the things I see people doing is they're putting tape over top of their webcams and this is not good for a bunch of reasons. First of all, you could potentially be damaging the area around your camera, the screen and when you close your laptops, that piece of tape is then making your laptop a little bit thicker so it can start ruining things. So it's not the best idea ever. I mean, if you're doing that right now, like I mean, your probably shouldn't, that's why this is a really great idea and it's all flushed right there to the web, oh, this is nice, this is cool. So this is the HP ProBook 445 G7 Notebook, this is thin, it's light and it has a lot of really great commercial features that companies are looking for at a very affordable price. This is also extremely durable. This has 180 degree hinge, so there's a little bit more of a hinge, but not quite the 360, like we've seen in the previous one. (upbeat music) Look how flat this gets. Like, it feels like this is something that, you shouldn't be able to do, but you can. I've always wanted to do this on a laptop, just completely take the entire top, and just go like that. Most of them usually stop you and it also has six gigs of RAM, a two gigahertz eight core AMD Ryzen 704,000 processor, 512 gig SSD, 14 inch anti-glare display, which you can see right here. I love displays that have anti-glare. I always do find myself working in various places, coffee shops or in studios like this with bright lights, so carrying this over to offices where a lot of people are usually working by windows or different types of overhead lighting, this helps out immensely. This also has an AMD Radeon graphics card, SD card slot 720 P HD IR camera, spill-resistant keyboard and a very long lasting battery life with HP fast charge. I know we keep talking about security, but this is such a huge concern, especially with everyone's businesses and so much sensitive information that's stored on our laptops. This has commercial grade security features enhanced from the BIOS up, but Justine, what are those? Someone off in the distance ask. Well, I'm glad that you did ask because I was gonna tell you anyway. HP Sure Start Gen 5 is the first that allows for self-healing BIOS that will automatically recover itself from attacks. I talked about this before, basically if your firmware is attacked or your computer is compromised, this will automatically heal itself and you guys don't have to do anything. I did mention the privacy camera. This is a physical shutter that you can slide over, so it will protect you when it's not in use. HP Sure View Gen3 will instantly block the ability to see your screen with the optional HP Sure View Gen3 that reduces visual glare when it's viewed from the side, making your screen appear darker and unreadable. These are some really great added features all in this one laptop, which really does make it a great choice for someone looking for a PC with all of these added security options and just like the others, this also has an optional fingerprint sensor, so much security, so little time. All right, three down, one to go. This is the HB ProBook 635 Aero G7. Let's un-box. Power cable! Rest of the power cable. Oh, oh, this is light! Ooh, look at you! Oh wow, this is super light. Can't we know how light this is? I just still I'm such a huge fan of the fingerprint sensor. We have two USB ports and we also have audio right there. The other side we've got HDMI out and also a USB-C port and this is for the power. And this is for the nano-SIM because this does support 4G LTE. So the HP ProBook 635 Aero G7 is truly a device that is geared towards someone who needs a powerful PC and also have the option to constantly stay connected with support for 4G LTE. While being one of the lightest AMD-based business notebooks, it definitely doesn't skimp on internals. It has a 13.3 inch full HD display, AMD Ryzen 4000 series processor, and up to one terabyte of solid state storage, 32 gigs of Ram, Wi-Fi 6 Plus. It's really light and super durable. This has an option for anti-glare screen with ultra thin bezels and has a new keyboard for quiet typing and an HP programmable key. It's the only webcam that has an 80 degree wide field of view so you are able to fit so much more into your screen. It has a ton of options, you can fully customize it to your needs or the needs of your employees. Thank you guys so much for watching, I hope you guys enjoyed this video and a little look at some of the enterprise options that HP has to offer. I'll put a link in the description, if you guys wanna check it out and I will see you guys in my next video, bye. (upbeat music)",
    "transcript_keywords": [
        "AMD Ryzen",
        "screen",
        "AMD",
        "light",
        "guys",
        "cool",
        "Power",
        "great",
        "ProBook",
        "Ryzen",
        "features AMD Ryzen",
        "lot",
        "keyboard",
        "super light",
        "AMD Ryzen processor",
        "camera",
        "super",
        "business",
        "security",
        "people"
    ],
    "transcript_entity_values": [
        "14 inch",
        "ProBook 635 Aero G7",
        "all day",
        "Ram, Wi-Fi 6 Plus",
        "30 minutes",
        "Matty",
        "one",
        "13.3 inch",
        "G7",
        "EliteBook 845",
        "USB-C",
        "Radeon Vega",
        "13.3 inches",
        "up to 26 hours",
        "Matty, Matty",
        "HP Sure",
        "Justine",
        "32",
        "256",
        "HP",
        "ProBook x360",
        "Windows 10",
        "Instagram",
        "180",
        "years",
        "4",
        "16",
        "IRR",
        "three",
        "up to one terabyte",
        "AMD Radeon",
        "a ton",
        "720",
        "AMD",
        "4700U",
        "jack",
        "HB",
        "four",
        "EliteBook",
        "USB-A",
        "microSD",
        "all-day",
        "80 degree",
        "five",
        "about 3.19 pounds",
        "RAM",
        "two gigahertz eight",
        "SD",
        "six",
        "eight",
        "today",
        "two",
        "The HP Pro Pen",
        "ProBook 445",
        "AMD Ryzen",
        "Olufsen",
        "Ryzen",
        "HP WorkWell",
        "AMD Ryzen 4000",
        "AMD",
        "50%",
        "AMD Ryzen 704,000",
        "AMD Ryzen 4000 Quad",
        "HDMI",
        "first",
        "2.7 gigahertz",
        "USB",
        "First",
        "HP Sure Start",
        "Jenna",
        "512",
        "One"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "ORG",
        "TIME",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "TIME",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "NORP",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.05083560198545456,
        -0.06639907509088516,
        -0.07621556520462036,
        -0.1404731124639511,
        0.0026300866156816483,
        0.04651783034205437,
        0.011280505917966366,
        0.049792781472206116,
        -0.021313544362783432,
        0.014657191932201385,
        0.03960181400179863,
        0.028484713286161423,
        -0.01401954609900713,
        0.007327592931687832,
        -0.01480077300220728,
        0.050479721277952194,
        0.055162280797958374,
        -0.03660658001899719,
        0.006440502125769854,
        0.0350533053278923,
        -0.024182401597499847,
        -0.07325518131256104,
        0.026311004534363747,
        -0.017466938123106956,
        -0.01031413022428751,
        0.049993664026260376,
        0.032164935022592545,
        0.027211971580982208,
        -0.09739118069410324,
        -0.0512201227247715,
        -0.03251104801893234,
        0.015009189024567604,
        0.0769844576716423,
        0.04023563116788864,
        0.028704410418868065,
        -0.051556169986724854,
        0.045862067490816116,
        0.01694534905254841,
        0.019189463928341866,
        -0.07101862132549286,
        0.006891058757901192,
        -0.09110430628061295,
        -0.019323237240314484,
        -0.025667782872915268,
        -0.04449555650353432,
        -0.1025707796216011,
        -0.05659397318959236,
        -0.05029262229800224,
        0.06409488618373871,
        0.06805053353309631,
        -0.08982887864112854,
        -0.04164884239435196,
        0.0171015877276659,
        0.00667814165353775,
        -0.089349664747715,
        0.0012733121402561665,
        -0.06153659522533417,
        0.05318943038582802,
        0.024968627840280533,
        -0.08231546729803085,
        0.0327247753739357,
        -0.08201155066490173,
        -0.007118670269846916,
        0.06543675065040588,
        -0.07465613633394241,
        -0.0749862790107727,
        0.03847403824329376,
        0.010030847042798996,
        -0.03691961616277695,
        0.007445111870765686,
        -0.11130248010158539,
        0.06194930523633957,
        -0.008856999687850475,
        0.02105591632425785,
        -0.012762201949954033,
        0.04660375416278839,
        0.0069740102626383305,
        -0.055868037045001984,
        0.03122866339981556,
        0.04098326712846756,
        0.004556694999337196,
        -0.0068072606809437275,
        -0.09041478484869003,
        0.01039788406342268,
        -0.006714924238622189,
        0.005076985340565443,
        -0.016805369406938553,
        0.02332661859691143,
        -0.0203278549015522,
        -0.076351098716259,
        -0.09566447138786316,
        -0.042351871728897095,
        -0.04623495787382126,
        -0.016901031136512756,
        -0.04707523435354233,
        -0.03844941407442093,
        0.01277781743556261,
        -0.03710123896598816,
        -0.010412197560071945,
        0.04310925304889679,
        0.029130924493074417,
        -0.028804365545511246,
        0.0455639623105526,
        -0.081258125603199,
        -0.06402093172073364,
        -0.13846176862716675,
        -0.04088413715362549,
        0.014461399987339973,
        0.0050974562764167786,
        -0.027018072083592415,
        -0.07171739637851715,
        0.038058169186115265,
        -0.06616806983947754,
        -0.10026223212480545,
        0.021467534825205803,
        0.1035967767238617,
        -0.03776266425848007,
        0.0492231622338295,
        0.026958981528878212,
        -0.00804273784160614,
        -0.028170546516776085,
        -0.044064972549676895,
        0.012505758553743362,
        0.04815696179866791,
        -0.0069961086846888065,
        0.03193524852395058,
        -0.07085201889276505,
        1.345698585981662e-32,
        -0.008857669308781624,
        0.04568599537014961,
        0.0007637295639142394,
        0.04518700763583183,
        -0.015373424626886845,
        -0.018850430846214294,
        -0.015278341248631477,
        0.07054749131202698,
        -0.020805925130844116,
        0.0159282423555851,
        -0.010343355126678944,
        0.053033456206321716,
        -0.02712583914399147,
        0.02136176824569702,
        0.029820285737514496,
        -0.03402426093816757,
        -0.013846030458807945,
        -0.00860507320612669,
        -0.050953712314367294,
        -0.023932045325636864,
        0.03615651652216911,
        -0.036936745047569275,
        0.03815317898988724,
        0.06126025319099426,
        0.11353258788585663,
        0.07683538645505905,
        0.03672368824481964,
        0.01836680993437767,
        0.07870063930749893,
        0.021420441567897797,
        -0.02373618446290493,
        -0.059110913425683975,
        -0.03620185703039169,
        -0.11999557912349701,
        -0.022284789010882378,
        -0.006067686714231968,
        -0.09941233694553375,
        -0.023733852431178093,
        0.03129098564386368,
        -0.06273562461137772,
        -0.034110456705093384,
        0.03208792954683304,
        -0.050840843468904495,
        -0.10322123765945435,
        0.052337098866701126,
        0.04227851703763008,
        0.03884793445467949,
        0.08052702248096466,
        -0.032951511442661285,
        0.05263376981019974,
        -0.039775602519512177,
        -0.028207974508404732,
        -0.01770995929837227,
        -0.0014888669829815626,
        -0.036057718098163605,
        -0.0705137699842453,
        0.013910749927163124,
        0.06038603186607361,
        0.06776010990142822,
        0.07144445180892944,
        0.018305666744709015,
        -0.015060163103044033,
        0.0013647166779264808,
        -0.03499820455908775,
        -0.036190710961818695,
        0.081521175801754,
        0.06789876520633698,
        -0.008129527792334557,
        0.012065830640494823,
        0.067222461104393,
        0.02497257851064205,
        -0.025387927889823914,
        0.058873895555734634,
        -0.012003417126834393,
        0.07249395549297333,
        0.06949532777070999,
        -0.09341823309659958,
        -0.031133051961660385,
        -0.014110194519162178,
        -0.04627019539475441,
        -0.12811465561389923,
        0.09513790905475616,
        0.0023850316647440195,
        0.08079089224338531,
        -0.013129757717251778,
        -0.015443600714206696,
        0.012397204525768757,
        -0.05070580914616585,
        -0.05336294695734978,
        0.041509807109832764,
        -0.015567176043987274,
        0.08440417796373367,
        -0.09642346948385239,
        -0.010839690454304218,
        0.0010636078659445047,
        -1.3498245711530483e-32,
        0.05471865460276604,
        0.05748363584280014,
        0.004855385050177574,
        -0.041970912367105484,
        0.06105520576238632,
        -0.00969335064291954,
        0.031305693089962006,
        0.07720496505498886,
        0.047227632254362106,
        -0.051127031445503235,
        0.033585093915462494,
        -0.06966054439544678,
        -0.10522519052028656,
        0.03208015486598015,
        -0.00807366706430912,
        -0.04187958687543869,
        -0.06548437476158142,
        -0.06088300049304962,
        0.0691659078001976,
        -0.006574125960469246,
        0.06226341798901558,
        0.14320504665374756,
        0.05602426826953888,
        0.04733694717288017,
        0.03824663534760475,
        0.01741468906402588,
        -0.03402223065495491,
        0.052625253796577454,
        0.03806512802839279,
        0.04512379318475723,
        -0.021279875189065933,
        -0.0652097761631012,
        -0.024486256763339043,
        0.03429514169692993,
        0.07436228543519974,
        0.010688437148928642,
        0.04407992213964462,
        0.040649134665727615,
        0.03766578435897827,
        -0.04000530019402504,
        0.06859934329986572,
        -0.016915814951062202,
        -0.004707686603069305,
        -0.009029808454215527,
        0.03102346882224083,
        -0.11246135830879211,
        -0.03150653839111328,
        -0.02833148092031479,
        0.010263746604323387,
        -0.031175727024674416,
        -0.07604549080133438,
        -0.03225802257657051,
        -0.03201949968934059,
        -0.007222330197691917,
        0.0025572581216692924,
        0.014131641946732998,
        -0.060992997139692307,
        -0.01314177829772234,
        0.043006014078855515,
        -0.03894342854619026,
        -0.017209453508257866,
        -0.044422246515750885,
        -0.049885448068380356,
        -0.04901913180947304,
        0.0012022970477119088,
        -0.044093336910009384,
        0.09770651906728745,
        0.016088468953967094,
        -0.021787218749523163,
        -0.0539587140083313,
        -0.026260673999786377,
        0.03211546689271927,
        0.05892719328403473,
        -0.00026773245190270245,
        0.03447790816426277,
        -0.00915500894188881,
        -0.06855178624391556,
        -0.016204433515667915,
        0.07086125016212463,
        -0.017769621685147285,
        -0.03376353532075882,
        -0.05985477566719055,
        0.017428357154130936,
        0.06038673594594002,
        0.10322720557451248,
        0.0693744570016861,
        0.07541529089212418,
        -0.06149080768227577,
        -0.05669841170310974,
        0.0115913525223732,
        0.034753818064928055,
        0.07018961757421494,
        0.06573927402496338,
        0.10627567023038864,
        -0.08975100517272949,
        -6.854951806190002e-08,
        0.001378919230774045,
        0.03853638842701912,
        -0.014664926566183567,
        0.013285898603498936,
        0.03407770395278931,
        -0.11493200808763504,
        0.0016621232498437166,
        0.05549954995512962,
        0.07523550093173981,
        -0.017612770199775696,
        0.10433736443519592,
        -0.05671421065926552,
        0.012942356988787651,
        0.11855082958936691,
        0.01681203953921795,
        0.01190587691962719,
        -0.07750160247087479,
        0.07204481214284897,
        -0.03423362225294113,
        -0.03263659030199051,
        -0.03613158315420151,
        0.0440497100353241,
        0.05025283247232437,
        -0.00726375263184309,
        0.0845102071762085,
        -0.01541549526154995,
        -0.02434619888663292,
        -0.03659610450267792,
        0.0532400868833065,
        -0.010025006718933582,
        -0.06785898655653,
        0.021309221163392067,
        0.02422167733311653,
        0.005826145876199007,
        -0.024389024823904037,
        -0.05875428766012192,
        -0.026055485010147095,
        0.00776429008692503,
        0.04720112308859825,
        0.06440100818872452,
        0.004083201754838228,
        -0.09925951808691025,
        -0.08378200232982635,
        -0.008401057682931423,
        0.054230429232120514,
        -0.014527382329106331,
        0.015580344945192337,
        -0.08091605454683304,
        -0.0628494918346405,
        -0.005075948312878609,
        -0.03538983315229416,
        0.034034617245197296,
        0.10429072380065918,
        -0.03665066510438919,
        0.04154329374432564,
        -0.008511478081345558,
        0.031200874596834183,
        0.0686282068490982,
        0.019216010347008705,
        -0.0020520230755209923,
        0.06718345731496811,
        0.005928770639002323,
        -0.034484729170799255,
        0.03166105970740318
    ]
}