{
    "id": "5QltHaGKH_w",
    "title": "I tried the Leaked Windows 11...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2021-06-16T04:17:50Z",
    "video_url": "https://www.youtube.com/watch?v=5QltHaGKH_w",
    "category": "Science & Technology",
    "tags": [
        "windows 11",
        "windows",
        "11",
        "windows 11 leak",
        "leaked",
        "microsoft",
        "pc",
        "computer",
        "gaming pc",
        "new windows",
        "hands on",
        "tech",
        "review",
        "austin",
        "austin evans"
    ],
    "views": 960695,
    "likes": 46911,
    "comments_count": 3824,
    "description": "No I'm not linking you to a leaked copy of Windows 11 I'll link a video about gaming PC myths people believe though  Or how I built an Xbox inside a PS5   My new podcast @TheBackmarkers!  I have a TikTok!  My Twitch channel:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/TecVgUteNFo",
        "https://youtu.be/K_gXJK7SIRs",
        "https://www.relay.fm/testdrivers",
        "https://www.tiktok.com/@austintechtips",
        "https://www.twitch.tv/austinevans",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- [Ken] Austin I have Windows 11. (dramatic music) - What do you mean? - [Ken] I have Windows 11. Look it's Windows 11! - Oh that's leaked you can't. - [Ken] What what what? - I gotta get at it! That's illegal. - [Ken] Wanna be an accomplice? - No. There's video evidence of this. I want nothing to do with it. Windows 11 is almost here and it is going to make your games better. So not only are there actual functional builds of Windows 11 floating around the internet right now, but there's also a major Windows event next week where they're teasing some big new features. (Austin coughs) Windows 11. It's Windows 11, surprise surprise. What comes after 10? So this stuff has been pretty heavily teased. Not only did the Windows channel post a suspiciously long 11 minute video the other day of slow-fi Windows startup sounds, which sound very bizarre. - Sounds like bagpipes. (Austin humming) (Austin laughing) - [Matt] Oh no, no! - If these teases aren't subtle enough for you Microsoft have also listed the end of support for Windows 10 being in October 2025. So you know, the most recent up-to-date version of Windows 10 that everyone's running right now, oh yeah that's gonna be gone. Historically it is not an easy task to get people to move to a newer version of Windows. In fact six years later only about 78 percent of people are on Windows 10, where still a lot of people are using something like Windows 7 or Vista. There are still people who are using Vista out there. But if you look at gamers it's actually a much much faster ramp. 96 percent of Steam users are running Windows 10 at this point, which is actually pretty impressive. But if you think that Windows 10 is only gonna have a couple more years of support they've gotta move to 11 quickly. And I don't think it's going to be a massive overhaul. There's certainly going to be some major upgrades, but we actually already have an idea of what Windows 11 is going to look like. Beyond all the leaks, because they've been talking about it for a little while. The Sun Valley Upgrade. There are two sides to this. First of all are the leaked builds of Windows 11 floating around. But on top of that there are also a lot of features inside of Windows 11 that are currently actually available if you are a Windows Insider. Now these leaks originated on Baidu with some screen shots. However they were corroborated by The Verge. It seems like Windows Central actually has this running on a Surface. Now these are certainly not completed versions of Windows 11 which I assume is going to ship later this year. But they do give us a look at some of the major new features. Namely the fact that the taskbar has actually now been centered, very much like a Dave2D video had recommended. As well as things like new icons and even these show that there are straight up Windows 11 Pro like names in there right. There's just no question that this is a brand new version of Windows. The thing that this really reminds me of is actually something on the Mac OS side of things. So last year there was Mac OS 11 Big Sur. Now there was certainly some major changes under the hood. But for most people it was a visual overhaul. Now that is obviously something that we are going to see at least in some part on Windows 11. In fact a lot of the UI stuff that we're seeing not only with things like new animations, new icons, and some different redesign functions, reminds me a lot of Windows 10 X. Now if you're not familiar, this was a more modern version of Windows, more mobile focused version of Windows. They originally started talking about a couple of years ago. This was originally going to launch on things like dual screen devices. It was almost gonna look like Chrome books. But ultimately it sounds like they sort of shut that down in favor of bringing a lot of that modern UI interface over to just the mainstream version of Windows. And it really does show. This strategy makes sense to me. Windows 10 X never really felt like it was the future. I mean obviously they always need to try to upgrade and improve Windows. They can't just be running Windows 10 or Windows 11 forever. But what I do think is a little bit of a concern is some of the mobile features that are leaking into the main version of Windows. That might sound odd, because obviously Windows has a great history of supporting a wide range of hardware. But I do think that there is a little bit of a concern. Not so much for me, but I think for a lot of people who are seeing these screen shots who are worried that Windows 11 is being watered down. That is is less than Windows 10 was, that it's sort of like, oh this is like, you know the 80 percent version of Windows. I don't think that's necessarily true. I think for Microsoft it makes a lot of sense to make one operating system that runs from everything from a 100 dollar Chromebook competitor, all the way up to a high end gaming PC. And of course the wide range of hardware that's in the middle. But I think we have to be realistic here. Most people these days are using mobile devices. And when you have all these features on your iPhone and on your Android device people do kind of expect it to work on the desktop side of the laptop or the tablet side of things. - [Ken] When little Timmy grows up with an iPad, he needs to use something that's a little more intuitive that he's used to. - Yep. But before we get into all of the potential possibilities of Windows 11, let's talk about the stuff that we know will be in the next version of Windows no cap. See I said, a thing that the TikTok-ers say, I'm cool again. No cap. So there are some major improvements for gamers. First and foremost, starting with HDR support. Now HDR is not exactly a new feature for Windows. However at this point it's a little bit of a patchwork set up. Different monitors, different applications will support HDR at various levels, and it's never been particularly smooth and consistent going between them. However that should be a lot more seamless with this new version of Windows. On top of that there's much better support for multiple GPU's in the system. No no, I'm not talking about some cross fire SLI set up. We're mostly referring to is the fact that Windows has a lot more fine grain control over if you say have integrated graphics and dedicated graphics on like a laptop or a desktop. Imagine you're playing a lighter title like Among Us which you don't necessarily need to run at 400 frames per second. You can have that running specifically on integrated graphics which would give you much better battery life. It's nice to have this built directly into Windows now. Now Windows 11 is clearly absorbed a lot of the look of Windows 10 X, which was again that more mobile focused version of Windows. But there are also some features it's going to be taking from it as well. Think about things like voice typing, something that's pretty standard on like iOS and Android will be coming to Windows 11. There is some better security features. You'll still be of course able to download and run whatever games you want or whatever apps you want. And on top of that there's one other feature I've forgotten. What is it Matt? - [Matt] Touch screen. - Touch screen. Well that's not new. But you can now get better touch screen support in Windows 11 because the mobile future is here. There's some other updates which I do think will be nice. So the virtual desktop support has been overhauled. So not only can you better support multiple monitors, you can actually have different desktop backgrounds for each of your virtual desktops. On top of that there are a lot of smaller things right. So there's better camera support. So things that used to have to dive into like your web can settings now will be directly into the Windows setting screen. There is a new font, which apparently looks better? I think it looks the same or about the same. You can also restart Windows and restart your apps at the same time. Similar to the way a lot of, actually Mac OS has done this for a long time. But when you restart, it's like hey do you wanna open up all of your apps at the exact same way as before? There's a better clipboard manager. They supports emojis, they moved the disc manager from the old school tool-- - The emojis. Oh my god. - I know, it's very revolutionary. - Yes I'm tired of copy and pasting smiley face. It just putting in text smiley face. (Austin laughs) - Okay look look look, there are a lot of updates for Windows 11. But I think the big question here is what does Windows 11 really do? They've got some secrets. And we'll have to wait for another week to find them out. - [Ken] I might have the build. - What you have the. You have a leaked version of Windows? - [Ken] I might have it yeah. I might've-- - Well I would never use a leaked version of Windows. I. Why would I do that? Look how clean my hands are right now. I love our friends on the Windows team and appreciate all the hard work they do. If Ken wants to dabble on the dark side that's none of my concern. So for the record I would never condone anyone using leaked supposedly authentic software. But Ken how is Windows 11? (upbeat music) I theoretically hypothetically. - Hypothetically. - Hypothetically. - I think he would theoretically say that it is more or less the same. (Austin laughs) - That's it. - Well okay look. - Thank you very much for watching. Make sure to subscribe to the channel for more or less the same. - Look look look. The builds that are out there right now that are leaked are not really that much. There will probably be more features that'll be you know added on as you know time develops. But as of right now a lot of the things that I may or may not have seen. - Hypothetically. - Hypothetically. Are more or less visual. So obviously there's a new direction going about. It's a lot cleaner, a lot more rounded shapes in regards to buttons, and a lot more transparency and color. It's very user friendly. It looks very shiny. It takes a lot of queues, maybe not specifically from the Mac, but I think now it's a little more toe to toe now or-- - Absolutely. - Toe to toe, head to head? - Toe to toe. Head to head? These all work. Those are all good. - Yeah yeah good. - So outside of any potential knowledge we may or may not have of the actual leaked version of Windows 11, there are I think some things that we can speculate about. Because obviously this has not been announced yet. And while there are certain things that we pretty much know for sure, whether it's in the leaked build or whether it's in the Windows insider stuff, what I wanna talk about are the things that we expect. Because I'm gonna just play my cards here, I don't think it's a huge surprise, Windows 11 should be a free update. Now I don't know that-- - I would hope so. - I don't know that, they could charge it. They could be 20 bucks or whatever. But it seems to me, like we're almost gonna pass the era of charging for an operating system update. I mean even think about when Windows 10 first came out, that was a free upgrade for a lot of people if you had a what like somewhat recent, seven or eight system or whatever. Can I hit you with something that's absolutely not going to happen but I want it to happen? - What's that? - Can I run Windows 11 on an Xbox? - I would love to run Windows 11 on Xbox, much like how I wanted Windows 10 to be on the Xbox Series X. - Well okay so here's the thing, this is not gonna happen because Microsoft wants to sell Xboxes and not eat into high MPC sales. But I mean, how cool would it be, you buy a 500 dollar Series X and it comes with Windows. I mean it's already kinda running Windows, like it's definitely physically possible. - Okay so now we're going into less speculation-- - Speculation talk, no this is speculation talk. - Well no no no no no well no. So we're going less into speculation town and we're going more into things that we want to see coming out of Windows 11. - Yeah this is it this is it. - And I would like to see Windows running on an Xbox. Now imagine the dedication that they put into the Surface and that Windows integration and that but for the Xbox. Imagine that for gamers. - You know something else that's maybe a little bit more reasonable that I would like to see, AirDrop for Windows. Now there are third party tools, there's Bluetooth bla bla bla. I just want something as simple as AirDrop on Windows. - Yeah for the record, we're not saying actual AirDrop. We're just saying-- - No I'm saying that. I want AirDrop. Reverse engineer it. - There's a. There's a lot wrong with that. - Come on, I'm sure it's not that hard! - No no but it's, look. You know ideally something that works with iOS and Android that can file drop to Windows or between Windows devices or you know whatever might have you. That would be really cool. 'Cause I actually use that on a day-to-day basis. And that's probably one of the big reasons why I'm tied to Mac OS in the first place. Especially when doing things like content creation. I wanna take photos on my phone, move them into Photoshop. I wanna take videos on my phone, move them to Windows to work in Resolve or Premiere right? - You can kinda do some of this for it was like either with the app the what is it the My Windows app or whatever it is? - Which I have never used in my life I should probably try it at some point just to make the argument, but. - It works well, Samsung stuff does integrate fairly well. But I want something that's a little bit more seamless across the board. You're right, AirDrop is a huge part of how we're able to do our jobs. And it does sort of lock us in. Some kind of AirDrop on Windows would be nice. Beyond that though, I mean look, File Explorer still seems old, like what we're looking at right now. - Oh. Look. I hate for this video to be a Mac OS versus Windows comparison. You click on the magnifying glass in Finder, you type what you want and you find it. In File Explorer it does exactly the opposite. It gives you every registry file, every little tiny nook and cranny in system 32 that you don't need. - So is the comparison that Finder helps you find things, Explorer helps you explore. (drum beat) (both laughing) - That is the best explanation you have made in your entire life. - Here is the real question. - Do I like Mac OS more? Yes. - Okay that was not my question, but I guess that answers my question. Thank you very much for watching this episode. Make sure to subscribe to the channel for other hot rumors and leaks. And make sure to also ring-a-ling the ding-a-ling bell so you're always notified the next time that Ken has a very very bad take. - I got nothing to say about that I just. - No there's, you've just had some bad takes, I'm just saying. Hypothetically speaking.",
    "transcript_keywords": [
        "Windows",
        "version of Windows",
        "lot",
        "running Windows",
        "things",
        "version",
        "Windows Insider",
        "run Windows",
        "Mac",
        "people",
        "support",
        "features",
        "Windows Central",
        "leaked",
        "Xbox",
        "Windows running",
        "running",
        "major Windows",
        "Windows app",
        "Windows devices"
    ],
    "transcript_entity_values": [
        "Windows 10 X",
        "Windows 11",
        "Mac OS 11 Big Sur",
        "only about 78 percent",
        "500 dollar",
        "Chrome",
        "iPhone",
        "third",
        "Windows 10 X.",
        "TikTok",
        "File Explorer",
        "Windows",
        "the other day",
        "20 bucks",
        "The Sun Valley Upgrade",
        "iPad",
        "Windows",
        "10",
        "first",
        "a couple of years ago",
        "Windows Central",
        "eight",
        "Ken",
        "Samsung",
        "Austin",
        "a couple more years",
        "the Xbox Series X.",
        "Windows 11",
        "Xbox",
        "two",
        "Explorer",
        "Windows 10",
        "Windows",
        "11 minute",
        "Matt",
        "Xbox",
        "Surface",
        "400",
        "UI",
        "these days",
        "one",
        "Finder",
        "Windows",
        "96 percent",
        "Baidu",
        "second",
        "32",
        "11",
        "Finder",
        "Ken] Wanna",
        "six years later",
        "Microsoft",
        "80 percent",
        "Vista",
        "another week",
        "next week",
        "Mac",
        "SLI",
        "100 dollar",
        "later this year",
        "Chromebook",
        "Xbox",
        "Windows 7",
        "last year",
        "AirDrop",
        "Mac",
        "October 2025",
        "Xboxes",
        "Timmy",
        "seven",
        "GPU",
        "First",
        "Us",
        "Android"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "LAW",
        "ORG",
        "PERCENT",
        "MONEY",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "EVENT",
        "PRODUCT",
        "FAC",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "NORP",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PERSON",
        "DATE",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "GPE",
        "ORG"
    ],
    "vector": [
        -0.1274184137582779,
        0.016954001039266586,
        0.03480386734008789,
        -0.08108553290367126,
        0.14139282703399658,
        0.02275717817246914,
        0.049652937799692154,
        -0.046448495239019394,
        -0.01698843576014042,
        0.028199007734656334,
        -0.014808280393481255,
        0.044740911573171616,
        -0.029016317799687386,
        -0.030428923666477203,
        0.02068566158413887,
        -0.06283345073461533,
        0.009399417787790298,
        -0.04562031477689743,
        -0.1385248899459839,
        -0.019797485321760178,
        -0.025343870744109154,
        -0.08054687827825546,
        -0.006551309954375029,
        -0.020347347483038902,
        0.036001306027173996,
        -0.014791430905461311,
        -2.4903194571379572e-05,
        -0.02450679801404476,
        -0.03581227734684944,
        0.028317436575889587,
        -0.011748503893613815,
        -0.00728856073692441,
        -0.08395705372095108,
        -0.05413074418902397,
        0.06328066438436508,
        -0.11685020476579666,
        0.03397361934185028,
        -0.02358740195631981,
        -0.024888621643185616,
        -0.07958558946847916,
        -0.016369886696338654,
        -0.017057009041309357,
        -0.029887085780501366,
        0.04893948510289192,
        0.03513901308178902,
        -0.02039927802979946,
        0.003598058596253395,
        -0.05865198001265526,
        -0.06661529093980789,
        0.028840042650699615,
        -0.04673042520880699,
        -0.016047049313783646,
        0.032210562378168106,
        -0.018435439094901085,
        -0.035856131464242935,
        -0.13483747839927673,
        0.012107519432902336,
        0.0028523397631943226,
        0.040669482201337814,
        0.016661837697029114,
        0.04807779937982559,
        -0.09450618922710419,
        -0.061902958899736404,
        0.03557949513196945,
        -0.017945878207683563,
        0.024756213650107384,
        -0.027475135400891304,
        0.00899578258395195,
        0.08172112703323364,
        -0.06651896983385086,
        -0.024542346596717834,
        -0.013153772801160812,
        0.011819598264992237,
        -0.03368435055017471,
        -0.015644656494259834,
        -0.032635875046253204,
        0.018172860145568848,
        0.04932251572608948,
        -0.04640890657901764,
        -0.003672665450721979,
        0.05373091250658035,
        0.03529904782772064,
        -0.02525441162288189,
        -0.06993061304092407,
        -0.00981715228408575,
        0.02301083691418171,
        -0.05314812809228897,
        0.040758389979600906,
        -0.03779202699661255,
        0.0069710444658994675,
        -0.09491757303476334,
        0.004617600701749325,
        0.07819052785634995,
        0.05301529914140701,
        0.1467345952987671,
        0.0072677889838814735,
        0.056401994079351425,
        -0.09016766399145126,
        -0.005187631584703922,
        0.026172718033194542,
        -0.05310920998454094,
        0.029864860698580742,
        0.08261499553918839,
        -0.06698798388242722,
        -0.001764383865520358,
        -0.01253855973482132,
        -0.11493442952632904,
        0.06415949761867523,
        0.051170073449611664,
        -0.04120073840022087,
        -0.04629718139767647,
        -0.012343386188149452,
        -0.05189671739935875,
        -0.05985710769891739,
        0.09938837587833405,
        -0.001009349594824016,
        -0.02784017287194729,
        0.09071775525808334,
        0.012839872390031815,
        0.00556158646941185,
        0.01569194905459881,
        -0.017126472666859627,
        -0.07116000354290009,
        -0.007811279967427254,
        0.026343872770667076,
        -0.0006337457452900708,
        -0.0860132947564125,
        1.8545450939785199e-35,
        0.11159687489271164,
        0.0016709886258468032,
        -0.024605760350823402,
        0.14790672063827515,
        0.09001480787992477,
        -0.022712964564561844,
        0.01881564036011696,
        0.033090006560087204,
        0.0024320720694959164,
        0.02645793743431568,
        0.01719900406897068,
        0.05370035767555237,
        -0.05998028442263603,
        -0.0008160120341926813,
        0.07639296352863312,
        -0.0056596011854708195,
        -0.038921456784009933,
        0.025746064260601997,
        0.02005450613796711,
        -0.034060925245285034,
        0.06164316460490227,
        -0.011816363781690598,
        0.028675081208348274,
        -0.07656329870223999,
        -0.008981556631624699,
        -0.051038194447755814,
        -0.07075461000204086,
        -0.01920165680348873,
        0.09843199700117111,
        0.05169972777366638,
        -0.133942112326622,
        0.006020418833941221,
        0.009785684756934643,
        -0.00709214573726058,
        -0.0023249925579875708,
        0.03564916178584099,
        0.0131631288677454,
        -0.07025251537561417,
        0.06372244656085968,
        0.02260725572705269,
        -0.010434359312057495,
        -0.03586062416434288,
        -0.0038423563819378614,
        -0.05263742059469223,
        0.015652865171432495,
        -0.05173666402697563,
        0.01233209390193224,
        -0.038976531475782394,
        0.012457145377993584,
        -0.03228302672505379,
        0.02034233883023262,
        0.04036068171262741,
        0.04014917090535164,
        0.026385895907878876,
        -0.024531325325369835,
        -0.027094978839159012,
        0.03914918005466461,
        0.011350276879966259,
        0.0950518473982811,
        0.13589449226856232,
        0.04198955371975899,
        0.019201010465621948,
        -0.014818442985415459,
        0.09464860707521439,
        -0.11225429177284241,
        -0.08184181153774261,
        0.09168241918087006,
        0.004612069111317396,
        -0.03627241775393486,
        0.06778489798307419,
        -0.042328741401433945,
        -0.0035953086335211992,
        -0.09421582520008087,
        -0.011791585944592953,
        0.054481830447912216,
        -0.006389479618519545,
        -0.05911966413259506,
        -0.020622797310352325,
        0.011135613545775414,
        0.05447128787636757,
        0.01261134073138237,
        0.04913763701915741,
        -0.025382954627275467,
        0.0198309738188982,
        -0.02791038155555725,
        0.032141800969839096,
        -0.04822622984647751,
        -0.05656519532203674,
        0.025785325095057487,
        -0.017427923157811165,
        -0.05532156676054001,
        -0.029542483389377594,
        0.035486478358507156,
        0.059126220643520355,
        0.048140279948711395,
        -3.1007465492478774e-33,
        -0.05312390252947807,
        -0.09276598691940308,
        -0.04801202565431595,
        -0.08102093636989594,
        -0.07523196935653687,
        0.012630398385226727,
        -0.0016914006555452943,
        -0.07456527650356293,
        0.00726685905829072,
        -0.012510237284004688,
        -0.022755086421966553,
        0.0761755183339119,
        -0.006560323294252157,
        0.04730395972728729,
        -0.04255520924925804,
        -0.06474769115447998,
        0.08145874738693237,
        -0.002700181445106864,
        0.024300694465637207,
        0.015666527673602104,
        0.060516372323036194,
        -0.03663497418165207,
        -0.028167031705379486,
        -0.08636575192213058,
        0.015288830734789371,
        -0.027845053002238274,
        0.036535389721393585,
        -0.004097702447324991,
        0.046928856521844864,
        0.07540365308523178,
        0.014473700895905495,
        0.03336092084646225,
        -0.10889587551355362,
        -0.021490920335054398,
        0.053129225969314575,
        -0.002553879749029875,
        0.051681000739336014,
        -0.0989743024110794,
        -0.036350712180137634,
        -0.060814909636974335,
        0.04002590477466583,
        -0.04880828037858009,
        -0.04371735453605652,
        0.021367188543081284,
        -0.012465416453778744,
        -0.0032987443264573812,
        0.005244083236902952,
        0.0039962162263691425,
        -0.011039352044463158,
        0.04766948148608208,
        0.10139655321836472,
        -0.019891910254955292,
        0.023832758888602257,
        0.032943274825811386,
        -0.04683690518140793,
        -0.05304563045501709,
        -0.01759207248687744,
        0.054927725344896317,
        -0.012131995521485806,
        0.03756212443113327,
        0.05371300131082535,
        0.06356585770845413,
        -0.05013665184378624,
        -0.06267396360635757,
        -0.023006107658147812,
        0.06100036948919296,
        0.10729911178350449,
        0.027393167838454247,
        -0.06280873715877533,
        -0.011899205856025219,
        -0.0017760402988642454,
        -0.055438440293073654,
        -0.08530497550964355,
        -0.025464002043008804,
        0.008026397787034512,
        0.04856119304895401,
        0.05095638707280159,
        0.000882607651874423,
        -0.027379538863897324,
        -0.013932212255895138,
        0.03289387375116348,
        -0.03985288739204407,
        0.037790607661008835,
        0.00013048101391177624,
        0.0654064491391182,
        -0.02284068427979946,
        0.027126258239150047,
        0.03078472428023815,
        -0.015352954156696796,
        -0.01329843234270811,
        -0.0009703487157821655,
        -0.0021751434542238712,
        -0.030875924974679947,
        0.14722704887390137,
        0.07291228324174881,
        -5.074117481740359e-08,
        -0.023142149671912193,
        0.030789094045758247,
        -0.026461780071258545,
        -0.009662365540862083,
        0.0055693150497972965,
        0.04575881361961365,
        -0.04168905317783356,
        0.02275705710053444,
        -0.009033381007611752,
        -0.04159025475382805,
        0.023420032113790512,
        -0.10741784423589706,
        0.010483815334737301,
        0.04254160076379776,
        -0.016341527923941612,
        0.08924636244773865,
        -0.044267043471336365,
        0.018562106415629387,
        -0.003720837878063321,
        -0.012188756838440895,
        -0.04913824796676636,
        0.08476454764604568,
        0.12193501740694046,
        -0.04141097515821457,
        -0.04190044477581978,
        -0.011437347158789635,
        0.06382174044847488,
        -0.003972687292844057,
        0.06007631495594978,
        0.050770167261362076,
        -0.03230950981378555,
        -0.052585478872060776,
        -0.05154148489236832,
        -0.000861117267049849,
        -0.024089030921459198,
        0.02459975704550743,
        0.06516022980213165,
        0.09634703397750854,
        0.042094796895980835,
        -0.005233616568148136,
        -0.01404813677072525,
        -0.04257835075259209,
        -0.005834879819303751,
        0.0232300516217947,
        -0.028409238904714584,
        -0.017447903752326965,
        -0.14642122387886047,
        -0.08310819417238235,
        -0.044055402278900146,
        -0.01564313843846321,
        -0.04149072617292404,
        0.04076913371682167,
        0.03048064559698105,
        0.1043132022023201,
        0.04520478472113609,
        0.025303293019533157,
        -0.03554796054959297,
        -0.010759411379694939,
        0.00919307116419077,
        0.07834062725305557,
        0.024984518066048622,
        0.0173003189265728,
        0.0028942616190761328,
        0.0674535408616066
    ]
}