{
    "id": "5UAvvX2uW5o",
    "title": "One Keyboard to Rule Them All - DROP x LOTR Keyboards",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-04-13T22:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=5UAvvX2uW5o",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "keyboard",
        "lord of the rings",
        "lotr",
        "fan service",
        "cool",
        "fan",
        "nerd",
        "geek",
        "orc",
        "hobbit"
    ],
    "views": 222938,
    "likes": 7291,
    "comments_count": 408,
    "description": "Download Warframe for free and use DUVIRI-VALKYR for a bonus item pack! at:  Limit one per player  Plouffe loves three things, two of which are keyboards and Lord of The Rings, so when Drop sent over their new LOTR keyboards for us to check out, he jumped with joy. Will Plouffe be impressed by the fan service or is this keyboard bound for the depths of Mordor? (if that doesn't make sense I'm sorry I'm not a huge fan of LOTR I just write descriptions)  Check out the Drop x The Lord of the Rings Products:  Buy a Keychron K4 Wireless Mechanical Keyboard:  Check out the KBDfans Odin V2 Mechanical Keyboard:  Check out Jelly Key Keycaps:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 This is special! 0:19 Black Speech keyboard 4:21 Elvish keyboard 4:57 Dwarven keyboard 6:50 Three specialty keycaps 7:54 Sponsor - Warframe 8:34 Typing impressions 11:09 Minor nitpicks 12:38 Pricing, comparisons, and overall thoughts 16:16 Outro",
    "description_links": [
        "https://lmg.gg/duviri",
        "https://lmg.gg/YbBWk",
        "https://geni.us/BxSdSl",
        "https://lmg.gg/npCtE",
        "https://lmg.gg/lkLgW",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- We've got something pretty cool here today. It's something that doesn't happen too often. It's actually one of a kind, hand-built sample, and that's because we've got the Black Speech keyboard from Drop. They've done a few \"Lord of the Rings\" keyboards in the past. We've actually got the Elvish and Dwarvish ones here, 'cause we're gonna take a quick look at those as well. But we're really excited about is the Black Speech one because it started as just a key cap set, and then you know, I think they just got way too much hype and interest for it so they decided to do a whole, oh my god, it looks good. (dramatic music) I've gotta say I was like really excited for this, and for good reason. I wanted the key cap set, myself. I was thinking about buying it, and as soon as I saw it, I was like okay we gotta just kind of unbox this thing, so that you know, maybe I can buy it from the company after, and just get my own copy? We have to send this one back because it is a sample, and I have to be incredibly careful with it, apparently, it was hand-built for us, so thank you Drop. Really appreciate it. It's currently on group buy and that's going for another two months or so, but it's supposed to ship in May, like right after the group buy's done. And you know what, while I'm not crazy about Drop keyboards for the most part, like they're okay, they're just not really my style right now. They're consistent. That's the one thing I can say about Drop is that, their stuff's gonna come out. It's not like a lot of other keyboard group buys, that it's just never gonna happen. Oh, there's actually like a pretty nice set, of stuff under that box. Okay, we got a cable, some other key caps. Okay, so basically if you don't like the red aesthetic, that they've got on a lot of these, you can change it to a black or gray key cap, to kind of fit the rest of the set. And then a key cap puller. Let's take a look at this cable, looks like just a standard USB A to C cable. One thing to note is that, this isn't gonna be wireless. I don't even know if there's RGB. In terms of features, you might be a little lacking, but you're not buying this board for extra features or anything like that. You are buying it because of the super duper cool Black Speech keycaps, and then the super duper cool like, Eye of Sauron, kind of ooh, it's like, it's got a physical like 3D feel to it, which is kind of nice and feels a bit more premium than just like a painted on Eye of Sauron or something. It's even got what I think is Narsil, like the solder's blade that gets shattered right here. Or at least it's got a sword cut into three pieces. That's kind of what that is to me. Otherwise we've got like a ring wraith, on the Windows key, which is super cool. There's the one ring on the Windows key, on the other side as well and then the big Eye of Sauron, in the top left here, as your escape key. And overall I gotta say, it's super cool. I was actually thinking of buying both the Elvish and the Dwarvish key caps and then this one came along and I was like oh my god, okay nevermind. I'm not getting those, I'm getting this guy. I do have to be a little gentle, 'cause like I said, this is a one of a kind, they're not even done yet. One nice thing in case you can't read Black Speech, or you forget where you are, these all have front legend, or if they don't have front legend, then they are on just the bottom right of the key cap, and a really small print, so that it's not something that even stands out until you go looking for it. The switches feel pretty good, they're Holy Panda X. So if you like those then I mean, hey, here's your chance to get your hand on some Holy Pandas. The one unfortunate thing as well about this board, at least in my opinion, is that it is soldered. Now in our case it's kind of cool, 'cause this was like, hand soldered one of a kind, you know, sweet. However, in most cases, especially if you're not a big fan of Holy Pandas which I mean I think they feel pretty good, I don't know, but if you don't like them for whatever reason, so you wanna switch to clickies, or you have a personal favorite that you like to put in your own favorite boards you're not gonna be able to do that. At least not easily. You can desolder switches and replace them that way. But it is, it's time consuming and it's a pain, and I would not recommend it if you can avoid it. It's part of why I love Hot Swap so much. It just kind of works. But yeah, otherwise like, in terms of sound and everything, it's not amazing. It's about what you get from a Drop control. However you can mod this thing to sound a lot better. So I definitely think, that it's not the end of the world, that this is the only way you're gonna get a Black Speech keyboard. And one thing that I gotta mention, of course, is it's got adjustable feet. Flip up feet are a big favorite of mine, that I really wish were a more common feature in more premium boards. I want to take this apart so bad, but I can't. I promised them that we would be incredibly gentle. Oh I didn't even notice this on the back. It's got like Drop plus \"Lord of the Rings.\" Let's open up the other keyboards, see if there's any real differences and then try 'em all out. Oh man, it's really pretty. So like, don't get me wrong, one thing is that, whoop, the keycaps themselves are actually very similar. It's really just the colorway. Like we've got almost the exact same. Oh no, they're a little different. Like we've got a elf tree. Oh what's the elven tree? I don't know which one it is. I'm not gonna comment. For the most part though, the keycaps are pretty much the same. The only real differences I'm seeing are like, on the Windows keys, even the escape key, is still an Eye of Sauron. I was kind of hoping that would be more unique to this set, but I do love the color difference, especially with this red and black, versus this nice, like kind of vibrant green. So let's take a look at the Dwarvish set. I didn't mention this before, but the box that's like the, the outer shell for the box is this really cool map, of Middle Earth and one thing that actually really bothers me is Gondor, there is an R here. I promise, they didn't screw it up and and put Gondo, on the map, but when I first just saw a flat image, in teams I was like oh my god, they screwed it up. - [Bell] Oh, it's just an accent, \"goin' to Gondo?\" - Gondo, yeah, you going to Gondo, mate? (laughs) No, but it's really, it's just a really nice little touch, that it, it sets it apart from just a regular Drop keyboard. Like you are getting something pretty unique here. Speak friend and enter, oh, I like this one the most! This is a clear winner for me personally, so don't get me wrong. As much as I absolutely love this Eye of Sauron, kind of printing, or artwork or whatever's going on here. I love this starry kind of motif, on the Dwarven keyboard and I love these keycaps. I really dig the gray almost stony, kind of looking keycaps, and I am in love with this, one like way more than the other ones. You know what my only real problem though is that unlike the Elvish, and the Black Speech ones, the legend isn't super hidden, like as you can see here, it's pretty clear that it's like a one, and then a rune, you know a Dwarvish rune, to indicate instead, of like a really tiny kind of just barely visible English, or I guess or Arabic numeral for the numbers. Oh, you know what the cool thing is, too? The really, okay, so the really cool thing about this one, the Dwarven one versus the Black Speech, or the Elvish is that instead of the Eye of Sauron, you get a dragon, you probably get Smaug, chilling up on the escape key. That's great. I love this thing, man, you know what? I don't know which one I like the most. I think it's the Dwarvish one, but there's something really unique and cool, about the Black Speech one that kind of just draws my eye, even though I think I like this one visually, the most, this just is very eyecatching. Okay, we've got I think all three, of the variants here, which is amazing. I can't believe they sent us these guys, too. I really wanted these but I just couldn't. Ah, my god, it's hard to get out even with the glove on. Okay, I'm just gonna- - [Bell] Oh, Plouffe... - That's not working either. Ooh, ooh, wow. - [Bell] Oh, my god. - That's fine. Mount Doom is clearly gonna go, with our Black Speech board, and then let's get Lothlorien, with our dwarves, and Anduin, for our elves. Beautiful. Now obviously I'd be taking the keycaps off, and replacing them and everything. They don't go right here, they go on the escape key, or actually you could put them on basically any of this top row and it would fit and look pretty good. So that's up to you. I think they're great. I honestly kind of want to see what I can take home, after the end of this video. - [David] We already asked. - [Bell] Yeah, it's nothing. - Nothing? Okay, I'm gonna, I'm gonna type on all of these in a sec here, but not before you check out our sponsor. Thanks, \"Warframe,\" for sponsoring today's video. \"Warframe\" is a cooperative free to play online action game with over 70 million players on PC, Series X, PS5, Switch and more. Their newest expansion, the Duveri Paradox, is a rogue light adventure where you find yourself exploring a time loop. This new story-based quest has you escaping an enormous open world that shifts, based on the mood of its ruler, the Child King, Dominus Thrax. Not only is it free for everyone, but both new and old players can jump in right now. So start living out your space ninja dreams, by using the code at the link below, and \"Warframe\" will hook you up with a bundle, that's perfect for new players. Okay, I'm gonna try it out. I'm gonna type with the finger gloves on. This is probably gonna go poorly but you know, we'll see how it goes. Oh yep, I'm gonna re- Mulligan, Mulligan. That never happened. Oof, 112, 97%, it's not bad, not the best I've done but could have been worse. There's something about the cupping, on all of these key caps. A lot of you might be familiar with feeling the home row not through cups, but through the little bars or dots on the F and J key. And that's not happening here. It's going with a more of a, I don't think these are SA, but they're almost SA, and so they're going with that really cupped feel, so that you know where your fingers just kind of sit, and it does a good job. But there's also this kind of weird raised edge, on some of them, that feels a bit exaggerated, and so this doesn't feel like a typical SA key cap set, or SA variant and because of that, I would ever so slightly sometimes, feel like I'm struggling to lift my fingers, just a little bit and they'd catch on some of the key caps. Not much and I would definitely get used to that over time. It might also help if I had the feet up, and I was typing at a bit more of an angle. So that might be something to be aware of. But other than that, like, it feels pretty good. Now in terms of sound, these aren't like the best I've ever used or heard myself. However, you can modify Drop control keyboards, without too much ease and there's tons of videos on YouTube to show you how to do that. If you're ever worried about, you know, running into a big project that you don't know how to do, my only real complaint has gotta be that this is not hot swap. I really wish it was, let's take a key cap off and take a look, and while I only typed on the Black Speech keyboard, all these other guys are using the same switches, and it's basically the same keyboard, aside from some, you know, artistic design changes. So you're gonna get the same typing experience, relatively, across each one. One of the really nice things about this, too, is that while I didn't think there was RGB, there's definitely at least illumination. So while you can't see much of it on these key caps, in particular, 'cause they're not shine through or anything if say you like the board and you like the artwork design on it, so you want to keep it, and you like the switches, you want to keep those, you can do that and just change the key caps set, to something else that's more shine through, if you want to take advantage, which is actually great, if you want to maybe just swap out WASDI, or something, for something shine through for when you're gaming, so that you, I don't know, some people do that. Like I've had rubber key caps on my WASDI, at one point just to get a feel for it. One thing to note though, is, that they do appear to be north facing, so if you prefer south facing LEDs then, that could also be a problem for you. - [David] What do you prefer? - A lot of you in the community prefer south facing, apparently you can see the shine through a little better. I've never stopped and like tested that myself, personally, so I don't know for sure, but it does, it is a sticking point for a lot of people out there. Another really minor nitpick that a lot of people might not even care about, is you can't really put the space bar upside down, and still have it fit the rest of the keyboard, because of the Elvish scripture, or Black Speech scripture on it. And other than that it's pretty nice. It's anodized aluminum and so it's a little hefty. It's also a TKL, I don't know why I didn't mention that yet, but basically you're just, you're not gonna, it's 10 key less, you're not gonna get your numpad, and all of that but it, it is a smaller profile on your desk, so for those of you who care who need that little bit of extra desk space, TKL is often preferable or even, you know, go as low as a 40% if you really want to. Why not? Don't go as low as 40%. Don't do a 40%, it's gross. Yeah, I agree. - [Man] It's the numpad challenge? - What was I gonna do? Oh, weigh it. I was gonna weigh this. Zero pound, how many pound now? 2.164. So, it's not that heavy. It's definitely enough that you've got, it's got a bit of weight to it, and you can tell that it's not just all plastic, but it's not gonna be some like six plus pound thing, that just sits on your desk and doesn't move. That being said, the rubber feet on the bottom, aren't great, they're not like bad, and it might work a little better with the feet flipped up. Oh yeah, that's a bit better. Although you're always in danger of this, where it just flops down like that. Is it the keyboard for me? Not particularly but that's mostly because I'm kinda getting away from TKLs right now. I've been really a lot more into getting that numpad back on my desk but in a compressed layout, whether that's like a full compressed keyboard, or if it's like an 1800 with like just a bit of gap kind of there. It's pretty sweet. And for the switches, the keyboard and the key caps, and the cable, like everything that you see here, except for these novelty key caps, because these are much more expensive on their own. They're beautiful though. Door Factory does a really good job. If you like these, maybe check out Jelly Key as well. They're great if you like these artisan key caps. - [Bell] Talk about the pricing. That's what I was gonna get to. These are about $65 a piece, for a one U key cap, which is actually pretty on par, for most kind of specialty custom key caps, like this range fluctuates a bit. If you are okay with that price, and you like this kind of design, where it's a 3D model and then they've resined it, over top or whatever, then check out Jelly Key as well. They do a bunch of cool stuff. I've got a few key caps on the way from them, but 65 bucks for a single escape key when I'm like, I'm a \"Lord of the Rings\" fan, but I'm not like, oh yeah, everything \"Lord of the Rings.\" Like it's just, I grew up reading the books, and I love the movies, and I've played most games- - [David] Hobbit is a banger! (tense music) - The book's great. Hey, the book's great! First movie? Not so bad. Second and third movies, we just don't speak of those. Yeah, I'm not, I'm not like the hugest fan, so I don't need this in my life. However, if you've already got like a themed setup, in your room or you're looking to do that, with like \"Lord of the Rings,\" everything, then this is absolutely kind of the best choice to go with unless you're willing to pay really big bucks, for something super duper custom. Now the keyboard itself with keycaps, with switches, with the cable, with everything else you saw in the box, this goes for right now, it's on group buy, for 169.99, so it's 170 bucks and it is 199 at launch. I don't know if they're gonna do another round, if it's all gonna sell out during the group buy, who knows. But they are looking to ship in May of this year, which is always great, at 170 or $200. There are a lot of full keyboards, that you could buy that are pretty good competitors, to this thing. Out of the box, they're honestly even better in a lot of ways in terms of, especially in terms of like sound, and maybe type feel, on the stabilizers. The reality is, you just, these days you kind of want like some really good tape, on the back and some foam silicone on the bottom maybe, just to make it all sound. Everyone's looking for that, like either that creamy thock kind of sound, or they're looking for that like high ping, like old IBM kind of sound. And this is definitely more on the old IBM kind of noise, (keyboard clacking) but for me it's just not what I'm looking for right at the moment. If you want to get something like this, that is basically the same but without the really, really cool art style, then you can get, I don't know, anything from Keychron is gonna be similar price, and maybe even a GMMK Pro, if you want one. But I gotta say they have crushed it, in terms of just \"Lord of the Rings\" stuff, they've absolutely done a number on the design here, and I'm really pleased with it, overall. When it comes to a product like this, that is attached to a very marketable IP, it can be really tough to get something down in price, that is anywhere close to this, to be perfectly honest. I've actually got a set of keycaps alone, I've got the Phyrexian keycaps ordered, and those are 150 bucks just for the keycaps. I gotta say this is a pretty good deal, if you're a big \"Lord of the Rings\" fan, and you want any of these three keyboards, or even the keycaps, like they're beautiful, and they're very well handcrafted, like absolutely stunning. It's kind of your option and I think you should go for it. That's the Drop Control, and \"Lord of the Rings\" keyboard, specifically the Black Speech set, that we've gotta be super careful with. If you want to check out any other kind of IP related stuff, I opened a \"Star Wars\" LGC2 recently. It was good. It was just also really expensive.",
    "transcript_keywords": [
        "Black Speech",
        "Black Speech keyboard",
        "key caps",
        "key",
        "kind",
        "key cap",
        "Black",
        "key cap set",
        "Speech",
        "Eye of Sauron",
        "thing",
        "pretty",
        "cool Black Speech",
        "Drop",
        "Black Speech set",
        "keyboard",
        "Black Speech keycaps",
        "caps",
        "Speech keyboard",
        "pretty good"
    ],
    "transcript_entity_values": [
        "Dwarvish",
        "F and J",
        "Plouffe",
        "Lord of the Rings",
        "USB",
        "Windows",
        "Gondor",
        "150 bucks",
        "Black Speech",
        "Second",
        "third",
        "10",
        "170 bucks",
        "Dominus Thrax",
        "another two months or so",
        "Rings",
        "Jelly Key",
        "as low as 40%",
        "today",
        "40%",
        "Drop",
        "Switch",
        "IBM",
        "Lothlorien",
        "112",
        "YouTube",
        "65 bucks",
        "first",
        "97%",
        "Zero",
        "200",
        "about $65",
        "some Holy Pandas",
        "the Child King",
        "TKL",
        "Gondo",
        "one",
        "numpad",
        "sec",
        "Eye of Sauron",
        "Drop",
        "169.99",
        "Black Speech",
        "PS5",
        "these days",
        "Dwarven",
        "Elvish",
        "First",
        "Phyrexian",
        "English",
        "70 million",
        "Black Speech",
        "May of this year",
        "Arabic",
        "Mulligan",
        "three",
        "One",
        "Anduin",
        "Holy Pandas",
        "six plus pound",
        "Smaug",
        "the Black Speech",
        "IP",
        "WASDI",
        "SA",
        "2.164",
        "the Drop Control",
        "Mount Doom",
        "Keychron",
        "Eye of Sauron",
        "Narsil",
        "170 or $",
        "Door Factory",
        "Warframe",
        "199",
        "RGB",
        "May",
        "Middle Earth"
    ],
    "transcript_entity_types": [
        "NORP",
        "PRODUCT",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "PERSON",
        "MONEY",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PERCENT",
        "DATE",
        "PERCENT",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORDINAL",
        "PERCENT",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "NORP",
        "ORDINAL",
        "ORG",
        "LANGUAGE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "LANGUAGE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "LOC",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "DATE",
        "LOC"
    ],
    "vector": [
        -0.05478815734386444,
        -0.07335475087165833,
        0.04310571402311325,
        -0.13534823060035706,
        -0.012021339498460293,
        0.025893684476614,
        0.015243468806147575,
        0.05286230146884918,
        0.010789264924824238,
        0.01580728217959404,
        0.044384829699993134,
        0.02734297700226307,
        0.1351405829191208,
        -0.07948698848485947,
        0.05701250210404396,
        0.023745469748973846,
        -0.020497595891356468,
        -0.024713631719350815,
        -0.10427013039588928,
        0.01372064370661974,
        0.031562987715005875,
        -0.07305571436882019,
        -0.002232432132586837,
        -0.03662487864494324,
        -0.03531959280371666,
        -0.013066311366856098,
        0.034755639731884,
        0.027573008090257645,
        0.0023596188984811306,
        -0.07087866961956024,
        -0.07573718577623367,
        0.048195917159318924,
        -0.003860006807371974,
        -0.010642516426742077,
        -0.06479830294847488,
        0.03415742516517639,
        0.021496253088116646,
        -0.010631650686264038,
        -0.05384833738207817,
        0.013450623489916325,
        -0.08156692236661911,
        0.006571647711098194,
        0.014537814073264599,
        0.09927213937044144,
        0.011877625249326229,
        0.008532704785466194,
        -0.024656059220433235,
        -0.05117088928818703,
        -0.0487019345164299,
        0.039227861911058426,
        0.06432733684778214,
        -0.0035602739080786705,
        0.10504331439733505,
        0.07202428579330444,
        0.015668286010622978,
        0.006384064443409443,
        -0.1254684031009674,
        -0.0671847015619278,
        0.034286320209503174,
        -0.030946165323257446,
        0.006334369536489248,
        -0.055115021765232086,
        -0.06225322559475899,
        -0.03787333518266678,
        -0.04266201704740524,
        0.028687352314591408,
        -0.020886369049549103,
        -0.007132276427000761,
        -0.08472245931625366,
        0.01448078639805317,
        0.02079170010983944,
        -0.01762595772743225,
        0.004702526144683361,
        -0.026747025549411774,
        0.0011726944940164685,
        0.01286183949559927,
        -0.022613322362303734,
        -0.0967542827129364,
        0.0029330416582524776,
        -0.0006968941306695342,
        -0.005128008313477039,
        -0.02241569012403488,
        -0.012702701613307,
        -0.026559578254818916,
        -0.005674843210726976,
        0.03553431108593941,
        0.023313099518418312,
        -0.04770451784133911,
        -0.04054497554898262,
        0.004735311958938837,
        0.06649278849363327,
        -0.05920981243252754,
        0.0934353843331337,
        0.014484533108770847,
        -0.044333893805742264,
        0.03784472495317459,
        0.031314313411712646,
        -0.03588016331195831,
        -0.01553258579224348,
        0.05149905011057854,
        0.005737001076340675,
        -0.03064674511551857,
        0.0297732874751091,
        -0.05618908628821373,
        0.0219041146337986,
        -0.04656394571065903,
        0.04397754743695259,
        0.02077467367053032,
        -0.0336931012570858,
        -0.025374721735715866,
        -0.024837544187903404,
        -0.009484149515628815,
        -0.0015451146755367517,
        0.05932515859603882,
        -0.07783761620521545,
        0.033814460039138794,
        0.04453086107969284,
        0.09461073577404022,
        0.019055280834436417,
        0.043831367045640945,
        -0.08277459442615509,
        0.0029416517354547977,
        -0.02831738442182541,
        0.04265417903661728,
        -0.06421948969364166,
        -0.036399975419044495,
        -0.10744401812553406,
        6.737892476611073e-33,
        -0.0008782446966506541,
        0.0706692710518837,
        -0.044081468135118484,
        -0.043854568153619766,
        0.04122749716043472,
        -0.004033410456031561,
        0.010565580800175667,
        0.03919897601008415,
        -0.03191206976771355,
        -0.004616418853402138,
        -0.08512941002845764,
        0.043380096554756165,
        -0.06049470603466034,
        -0.012154165655374527,
        0.061017461121082306,
        -0.09349375218153,
        0.031237637624144554,
        0.052441541105508804,
        -0.029639799147844315,
        -0.051823802292346954,
        0.0365678109228611,
        -0.0043455990962684155,
        -0.004717838019132614,
        0.013347827829420567,
        0.017846601083874702,
        -0.022794600576162338,
        0.0026855769101530313,
        -0.0423002690076828,
        0.06509140133857727,
        0.015862539410591125,
        -0.09526413679122925,
        -0.014391678385436535,
        -0.049364134669303894,
        -0.04184558987617493,
        -0.041877828538417816,
        0.043505314737558365,
        -0.07953274995088577,
        -0.052869394421577454,
        0.01356502529233694,
        -0.04690202698111534,
        -0.04230443760752678,
        -0.012440425343811512,
        -0.10842494666576385,
        -0.03473791107535362,
        -0.035448554903268814,
        -0.012881581671535969,
        0.04835941642522812,
        0.06885354965925217,
        0.015571261756122112,
        -0.011908931657671928,
        -0.05270248278975487,
        -0.010353026911616325,
        -0.06617624312639236,
        0.031649816781282425,
        0.009455387480556965,
        -0.08775661885738373,
        -0.07454334199428558,
        -0.005350884050130844,
        0.12587139010429382,
        0.09170544147491455,
        0.017176348716020584,
        0.06388085335493088,
        0.13019055128097534,
        0.04296986758708954,
        0.0030883701983839273,
        0.012730628252029419,
        -0.008331092074513435,
        -0.053519681096076965,
        -0.056866250932216644,
        -0.01070341095328331,
        0.03285786882042885,
        -0.0015560248866677284,
        -0.04277842491865158,
        0.001420369604602456,
        0.04105532169342041,
        -0.03802844509482384,
        -0.02220708690583706,
        -0.09353476762771606,
        0.014093220233917236,
        -0.04926728457212448,
        0.00944336038082838,
        0.03638380765914917,
        -0.006576493848115206,
        0.04286038875579834,
        -0.007504146080464125,
        0.01202967669814825,
        0.05824420973658562,
        -0.07522382587194443,
        -0.01496180146932602,
        -0.004506187979131937,
        -0.04837882146239281,
        -0.038961317390203476,
        -0.024930592626333237,
        -0.09490641951560974,
        -0.05218987539410591,
        -5.620655625815538e-33,
        0.024199331179261208,
        -0.06220781058073044,
        0.09380006790161133,
        0.10651795566082001,
        0.030594628304243088,
        0.07568082958459854,
        -0.018723836168646812,
        0.036209382116794586,
        0.03954540565609932,
        -0.00282883457839489,
        -0.02966771461069584,
        0.09610240906476974,
        0.03647371381521225,
        -0.07746810466051102,
        0.02914373390376568,
        0.004520818591117859,
        0.022730592638254166,
        0.011784492991864681,
        0.0611066110432148,
        -0.03141045942902565,
        0.052282802760601044,
        -0.08575641363859177,
        -0.11137569695711136,
        0.08466169238090515,
        -0.08277025818824768,
        0.038309019058942795,
        -0.014009758830070496,
        0.04233113303780556,
        -0.0943056270480156,
        0.04181749373674393,
        -0.022384855896234512,
        0.005181748885661364,
        -0.031023167073726654,
        0.004874348174780607,
        0.01729395240545273,
        -0.07893116027116776,
        0.07552730292081833,
        0.13011497259140015,
        -0.002239655237644911,
        0.05358054116368294,
        -0.01900491490960121,
        -0.037996258586645126,
        0.06623151153326035,
        0.08027005195617676,
        -0.019922049716114998,
        -0.06711755692958832,
        0.00924192275851965,
        -0.02548282966017723,
        0.16746675968170166,
        -0.026642246171832085,
        0.04275759309530258,
        -0.036504633724689484,
        0.026933008804917336,
        0.03446626663208008,
        -0.07289654016494751,
        0.03705018013715744,
        -0.06269805878400803,
        0.006287627387791872,
        0.023496143519878387,
        0.0005761053180322051,
        -0.007001983467489481,
        -0.06408669054508209,
        0.032282598316669464,
        0.06760711967945099,
        0.08104715496301651,
        -0.06717526167631149,
        0.07768885791301727,
        0.023754673078656197,
        -0.03657747432589531,
        -0.035984620451927185,
        -0.03305778279900551,
        -0.045313186943531036,
        0.04583021253347397,
        -0.01885116472840309,
        0.028699224814772606,
        0.046439461410045624,
        0.05745919793844223,
        -0.0601915679872036,
        0.014223492704331875,
        -0.042795028537511826,
        0.004813444335013628,
        -0.007947385311126709,
        0.004176677204668522,
        -0.027191532775759697,
        0.004118836019188166,
        0.029016491025686264,
        0.10029604285955429,
        0.0276090856641531,
        -0.02895263396203518,
        -0.00868453923612833,
        0.02417209930717945,
        -0.001011544605717063,
        0.0945025384426117,
        0.0351993665099144,
        0.06967467814683914,
        -5.7742930437143514e-08,
        0.06472403556108475,
        0.029115958139300346,
        -0.023589299991726875,
        0.022289549931883812,
        -0.05935906246304512,
        -0.02970578707754612,
        0.0315975658595562,
        -0.003153217025101185,
        0.038803599774837494,
        -0.010990211740136147,
        0.06561495363712311,
        0.03220091760158539,
        -0.09439901262521744,
        -0.010986323468387127,
        0.08878646790981293,
        0.05252790078520775,
        -0.004283570218831301,
        0.04818321391940117,
        -0.05687423422932625,
        0.0016532402951270342,
        0.07026903331279755,
        0.007224776782095432,
        0.13036467134952545,
        -0.049064069986343384,
        0.027924926951527596,
        0.035339124500751495,
        -0.032960597425699234,
        0.04307536035776138,
        0.05087902396917343,
        -0.04714566096663475,
        0.05749356001615524,
        -0.025930136442184448,
        0.031935498118400574,
        -0.039653003215789795,
        0.007460171356797218,
        -0.010611631907522678,
        -0.13113750517368317,
        0.08101029694080353,
        0.027075089514255524,
        0.10789840668439865,
        0.03729526326060295,
        -0.12467837333679199,
        -0.050051700323820114,
        0.03991807624697685,
        -0.012749726884067059,
        -0.017941854894161224,
        0.024129824712872505,
        -0.029576953500509262,
        0.01564199849963188,
        0.04569086804986,
        -0.0037861145101487637,
        0.017470035701990128,
        0.0851152166724205,
        0.011237855069339275,
        -0.0004642879357561469,
        0.1098996177315712,
        -0.007929902523756027,
        0.07579977810382843,
        0.022745199501514435,
        -0.03146304190158844,
        -0.02544054202735424,
        -0.06556186079978943,
        -0.07439342886209488,
        0.046162910759449005
    ]
}