{
    "id": "5Z47gXtbXjw",
    "title": "OnePlus 6 Teardown! - How Water Proof is it really?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-05-29T13:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=5Z47gXtbXjw",
    "category": "Howto & Style",
    "tags": [
        "OnePlus 6 Teardown",
        "OnePlus 6",
        "teardown",
        "disassemble",
        "how to fix oneplus 6",
        "One Plus 6",
        "Battery replacement",
        "screen repair",
        "loud speaker",
        "Water damage",
        "How water proof is oneplus 6",
        "water test",
        "imersion test",
        "liquid test",
        "OnePlus"
    ],
    "views": 1497179,
    "likes": 24952,
    "comments_count": 1411,
    "description": "OnePlus 6 does not have an official IP rating. Ingress Protection is pretty standard on smartphones these days; another layer of protection for expensive electronics is always a good thing. OnePlus has added several layers of water resistance to the OnePlus 6, and its time to teardown the OnePlus 6 and see how water resistant it really is.   More information on OnePlus HERE:   LARGE tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://goo.gl/KNfcyF",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The OnePlus 6 has been durability tested, cleared, and now it's time to review the flagship killer from the inside. I'll be focusing on water resistance this time around. OnePlus doesn't have an official IP rating on this phone like other flagships have, and it's time to find out why. Let's get started. [Intro] The back glass is our first defense against water. When I removed the back panel during the Clear OnePlus 6 video, there was plenty of adhesive all around the back side of the phone, effectively sealing off the largest hole against water. Some phones have more adhesive than others. I'd say the OnePlus has more adhesive than a LG phone, but less than a Samsung. I'll use my red pry tool to unclip the long fingerprint scanner from the motherboard, releasing the back glass panel. Then I'll unplug the red custom battery. I still have my fingers crossed the OnePlus will go back to making red batteries on their own someday, but we'll see what happens. Normally there's a green pull tab to release the 3300 milliamp hour square. I'll just leverage mine now since it's already been removed once. Now for the brains of the phone. To get at the motherboard we have 9 screws holding down the top plastics. The interesting thing about these screws is that they have red thread locker on them. Normally the thread locker is blue, but I'm always down for the little red details. I can pop off the top plastic from the frame once the screws are out, giving us our first look at the NFC coil. This does all of its communication through the gold contact pads that rest up against the motherboard on the underside of the plastic. I'll unclip the display ribbon cables, and the charging port ribbon. The mute sliding switch looks pretty cool. And then I'll remove the one screw holding down the motherboard, right there in the center. The next ingress point is the SIM card tray. Now, normally when we look at an iPhone or a Samsung, there's a little bit more substantial rubber ring around the SIM card tray. This OnePlus dual SIM slot does have rubber, but it seems to be pretty minimal at the opening. We'll come back to this later. I'll unclip two wire cables down at the side of the phone, and then one last little Lego style connector up there by the earpiece, and the whole OnePlus 6 motherboard can pull away from the frame of the phone. There are no heat pipes or thermal paste on the OnePlus 6, which you would normally find in flagships. Time will tell if that's important or not, if the phone starts lagging from heat down the road, we'll know it probably needed some extra heat dissipation for the processor. Up at the top of the phone is a microphone hole. Usually this helps with noise canceling. And the inner side of that hole is protected by a water resistant mesh...which I just punctured. So far OnePlus has done a good job of keeping water out. Another big hole to worry about is the earpiece. The earpiece speaker pulls out easy enough, and between the speaker and the outside grill is another large piece of that same mesh. This little guy is sealed around the edges, and you can see from this water droplet, it keeps water from leaking inside of the phone. Granted, there is no pressure right now on that droplet, so if the phone was submerged or there was a jet of water on the grill from like a shower head, it would have more pressure and possibly penetrate that mesh. But at least there's resistance in place. I'll get the speaker back in and move on to something else unique about his phone the button housing. It's got it's own little capsule inside of the frame where the metal button touches the electronic switch, which then transfers the signal to the golden contact pads that rest against the motherboard. And this massive metal probably also helps keep water out. The motherboard is next with its dual rear camera units. Remember, the main camera is in the center with 16 megapixels and OIS that hardware stabilization. But the top camera is a 20 megapixel sensor without OIS. Still seems a little redundant to me. I think they should swap it out for telephoto or wide angle, but it can shoot 4K at 60 frames per second, so I'm not complaining too much. The front camera is another 16 megapixel sensor with no optical stabilization just electronic. Let's jump into the bottom of the phone. It's actually pretty cool down here. There are 8 screws holding down the loudspeaker plastics, and then the whole thing can pull away from the phone. It's got it's own water resistant mesh on the opening of the speaker. And also, inside the speaker under this little circular sticker, we find a foam ball pit for ants. This probably also helps with sound dampening. I'll do a little more research and figure it out for sure, but until then, it's a party pit for ants. There are a few more ribbon cables under the plastic. The screen ribbon unsnaps like a little Lego, along with the white wire cable, the middle ribbon, and the headphone jack has it's own Lego connector as well. This little guy has a rim of red rubber around the opening just like we've seen with the water resistant LG and Samsung phones. The rubber matches the little latch we took off from the fingerprint scanner earlier. Thumbs up for aesthetics. I'll remove the circuit board and we get our look at the little circular vibration motor with its gold contacts. And then we have 2 screws holding down the USBC charging port. I'll pop that out and get some more red rubber around the opening. So far the water resistance of this OnePlus 6 is on par with other flagships that actually do have an IP rating. Every hole seems to be protected. There is even an additional screen over the loud speaker holes, so there are some ingress points that have even doubled up on water protection. I'll get the charging port screwed back into place. I personally would never risk my electronics around water, and I'm not exactly sure why OnePlus didn't get an official IP rating for the phone. But from the inside, it looks like this OnePlus 6 has all of the same protections that other IP 67 phones have. Extra protection is always a good thing, and accidents happen, so it's nice of OnePlus to add it all for us. I got the loud speaker back into place with its 8 screws, and I'll tuck the motherboard into place making sure none of the ribbons are pinched under the board. Screen replacements are pretty standard by the way. Everything has to come out of the phone, and then heat is used to separate the screen from the frame, and then the old metal frame is reused with the new screen. Pretty similar to other glass back phones. There are a few water damage indicators inside the phone just in case water does get in, OnePlus will be able to tell. The white boxes bleed red when they get wet. There's one down by the charging port, and another one here by the SIM card tray. Once again, it's always a smart idea to keep your phone away from water. The back plastics are all in place and screwed down tight. I'll slide my custom red battery in and clip the fingerprint scanner back into place after getting all of the adhesive ready for the glass. Overall it's a pretty straightforward design. Much more water resistant than I anticipated, and everything still works. Do you think OnePlus should make a foam ball pit for regular sized people? Let me know down in the comments. Come hang out with me on Twitter and Instagram. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "phone",
        "water",
        "OnePlus",
        "back",
        "red",
        "motherboard",
        "water resistant",
        "speaker",
        "phones",
        "screws",
        "time",
        "SIM",
        "SIM card",
        "inside",
        "durability tested",
        "pretty",
        "place",
        "SIM card tray",
        "glass back phones",
        "frame"
    ],
    "transcript_entity_values": [
        "OnePlus",
        "USBC",
        "iPhone",
        "9",
        "8",
        "Lego",
        "Instagram",
        "two",
        "jack",
        "Twitter",
        "4",
        "SIM",
        "3300 milliamp hour",
        "NFC",
        "the OnePlus 6",
        "60",
        "first",
        "second",
        "Time",
        "Samsung",
        "this OnePlus 6",
        "16 megapixels",
        "16 megapixel",
        "20 megapixel",
        "OnePlus 6",
        "the Clear OnePlus 6",
        "one",
        "2",
        "IP",
        "LG"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "EVENT",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "EVENT",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "LAW",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.10342995822429657,
        0.08642034977674484,
        0.09487580507993698,
        -0.060428887605667114,
        0.09270960837602615,
        -0.04263276979327202,
        0.04529782384634018,
        0.07392767071723938,
        -0.058555494993925095,
        0.07353420555591583,
        0.0456681065261364,
        -0.003510828595608473,
        -0.009038601070642471,
        0.026964789256453514,
        -0.06947283446788788,
        -0.03209497407078743,
        -0.003086415119469166,
        -0.029104573652148247,
        -0.093136265873909,
        0.043273601680994034,
        0.0319596491754055,
        0.00709741935133934,
        0.04037625715136528,
        -0.02942642942070961,
        0.0038454183377325535,
        0.006819101981818676,
        -0.007840089499950409,
        0.06642573326826096,
        -0.04810396581888199,
        -0.03647186607122421,
        0.04598718881607056,
        0.022029459476470947,
        -0.07371489703655243,
        -0.012648573145270348,
        0.017381375655531883,
        0.015709705650806427,
        0.06129831448197365,
        -0.08950153738260269,
        -0.09192169457674026,
        -0.04334530606865883,
        -0.025123286992311478,
        -0.014036852866411209,
        0.0388183556497097,
        -0.043004438281059265,
        -0.009571651928126812,
        0.04616406932473183,
        0.08924030512571335,
        -0.031374890357255936,
        0.045265499502420425,
        -0.03589033707976341,
        -0.0294316578656435,
        0.026650749146938324,
        0.07739938050508499,
        0.0064561632461845875,
        -0.09927583485841751,
        -0.06903286278247833,
        -0.034631237387657166,
        -0.019543448463082314,
        0.01528379786759615,
        -0.012851421721279621,
        0.10669197142124176,
        0.014091760851442814,
        -0.0380566269159317,
        0.09220235794782639,
        0.020381348207592964,
        -0.0059053427539765835,
        -0.003030105959624052,
        -0.03943952918052673,
        -0.0016512260772287846,
        0.026658933609724045,
        -0.056311845779418945,
        0.015626957640051842,
        0.010532398708164692,
        0.0084947869181633,
        -0.040056418627500534,
        0.02802448533475399,
        0.012053700163960457,
        -0.03269690275192261,
        0.01092927809804678,
        0.010110129602253437,
        0.055538613349199295,
        -0.05951420217752457,
        0.0344526469707489,
        0.012574038468301296,
        0.017463551834225655,
        0.07635021954774857,
        0.031059682369232178,
        0.01538104098290205,
        -0.004871872719377279,
        -0.05101391300559044,
        0.0047755856066942215,
        0.020897189155220985,
        0.030933184549212456,
        0.04548349231481552,
        0.04525148496031761,
        -0.02793993428349495,
        -0.1365983784198761,
        -0.12175159156322479,
        -0.07142553478479385,
        0.014232711866497993,
        0.008497223258018494,
        -0.0669739693403244,
        0.025353148579597473,
        0.010343378409743309,
        0.10614483803510666,
        -0.05933578684926033,
        -0.017824942246079445,
        -0.0013100916985422373,
        0.07292190939188004,
        0.04766852408647537,
        -0.014393848367035389,
        0.03465450182557106,
        -0.057926226407289505,
        0.02459440939128399,
        0.030117424204945564,
        0.036657579243183136,
        -0.10458378493785858,
        0.08042074739933014,
        0.06543203443288803,
        -0.03227612376213074,
        0.061128441244363785,
        -0.00577544653788209,
        0.011776864528656006,
        0.03770042955875397,
        0.0882350280880928,
        -0.02498924545943737,
        0.009044636972248554,
        3.594369687936773e-33,
        0.0776732861995697,
        0.03192324563860893,
        0.013079020194709301,
        -0.02156882733106613,
        -0.015884369611740112,
        -0.013898971490561962,
        0.011800413019955158,
        0.010492900386452675,
        -0.04875866323709488,
        0.061923302710056305,
        -0.03409191220998764,
        0.019738178700208664,
        -0.056851521134376526,
        0.041240256279706955,
        0.02734684944152832,
        -0.0001634254294913262,
        0.02766650915145874,
        -0.018638120964169502,
        -0.04362117126584053,
        0.02640262246131897,
        -0.02800040692090988,
        -0.08620323985815048,
        -0.0163110438734293,
        -0.00206638197414577,
        0.09786249697208405,
        0.03797953575849533,
        0.006468613166362047,
        0.02822807990014553,
        0.07120141386985779,
        0.0300423763692379,
        -0.0969923585653305,
        0.004937944933772087,
        0.04017450660467148,
        -0.005158469546586275,
        0.0066596646793186665,
        0.04156709089875221,
        -0.04283403977751732,
        -0.06395267695188522,
        -0.04249689355492592,
        -0.010696216486394405,
        -0.04989628866314888,
        -0.0029042791575193405,
        -0.013770215213298798,
        -0.07267393171787262,
        0.0604088269174099,
        -0.07428235560655594,
        -0.025610720738768578,
        0.002177925780415535,
        -0.03534058481454849,
        -0.04869168996810913,
        0.017898352816700935,
        -0.010443641804158688,
        -0.01345979142934084,
        -0.02166730724275112,
        -0.09143447875976562,
        0.02709762006998062,
        0.07631457597017288,
        -0.0003649620630312711,
        0.061984822154045105,
        0.0776095911860466,
        -0.05322210490703583,
        0.0637061819434166,
        -0.04115951433777809,
        0.020989296957850456,
        -0.08466652035713196,
        -0.010345278307795525,
        0.06627075374126434,
        0.0221518836915493,
        -0.045243214815855026,
        -0.007481798995286226,
        -0.13714304566383362,
        -0.022190310060977936,
        -0.01824921742081642,
        -0.003116187173873186,
        -0.05809791013598442,
        0.019275933504104614,
        -0.03358808159828186,
        -0.05205049365758896,
        0.04011150076985359,
        -0.011243226937949657,
        -0.04084169119596481,
        0.023770365864038467,
        0.09025932848453522,
        0.020712856203317642,
        -0.037344757467508316,
        -0.03540468588471413,
        -0.010265257209539413,
        -0.05347730591893196,
        0.0049943686462938786,
        0.06991738826036453,
        0.0483604371547699,
        -0.023242605850100517,
        -0.048389989882707596,
        -0.067241370677948,
        -0.011152702383697033,
        -6.846704315246846e-33,
        -0.073572538793087,
        -0.0274142324924469,
        -0.038251712918281555,
        0.0299980565905571,
        0.06209002807736397,
        -0.025560546666383743,
        0.10573641955852509,
        0.10322238504886627,
        0.07205131649971008,
        -0.08406681567430496,
        -0.0269691813737154,
        0.017189467325806618,
        -0.12994666397571564,
        -0.06335777789354324,
        0.030878644436597824,
        -0.03367312252521515,
        -0.014566512778401375,
        -0.0393795408308506,
        0.026347337290644646,
        -0.029531607404351234,
        0.03922190144658089,
        0.029497994109988213,
        0.11354324221611023,
        0.06367263942956924,
        -0.07515615969896317,
        0.005630583968013525,
        0.031062571331858635,
        -0.09100651741027832,
        0.03095008246600628,
        -0.0342324897646904,
        0.00477604940533638,
        0.004420101642608643,
        -0.007560053374618292,
        0.05767030268907547,
        0.02525799535214901,
        0.06781330704689026,
        0.00947663839906454,
        -0.021182045340538025,
        -0.03763369470834732,
        -0.08455384522676468,
        0.05671500042080879,
        0.042229991406202316,
        0.027130313217639923,
        -0.05478617176413536,
        -0.03320765495300293,
        -0.06909693777561188,
        0.009322653524577618,
        -0.0052390624769032,
        -0.07019209116697311,
        0.020803170278668404,
        -0.018969126045703888,
        -0.019726870581507683,
        0.03267126902937889,
        0.04507942497730255,
        0.050714101642370224,
        -0.09150790423154831,
        0.07794617861509323,
        -0.08995715528726578,
        -0.1352969855070114,
        0.044383879750967026,
        0.10927268862724304,
        0.04870570823550224,
        -0.05104833468794823,
        0.02570628561079502,
        -0.0010668478207662702,
        0.019397083669900894,
        0.03114710934460163,
        0.044751882553100586,
        -0.0026612456422299147,
        -0.01428876630961895,
        0.07700366526842117,
        -0.0644284337759018,
        0.04605274274945259,
        -0.12134286016225815,
        0.020482081919908524,
        -0.015437722206115723,
        -0.10574622452259064,
        0.0009531350806355476,
        -0.04581189528107643,
        0.007335156202316284,
        0.051546625792980194,
        0.021899336948990822,
        -0.06266117841005325,
        0.08725818246603012,
        0.1315786987543106,
        -0.04814823716878891,
        0.08245352655649185,
        -0.001926022581756115,
        0.0017808800330385566,
        0.06175009161233902,
        -0.061126675456762314,
        0.0007877727039158344,
        -0.1088460236787796,
        0.058052439242601395,
        0.012209511362016201,
        -5.36132915840426e-08,
        -0.010979796759784222,
        0.04358135908842087,
        0.0021434121299535036,
        -0.032868023961782455,
        -0.02622825838625431,
        -0.023411381989717484,
        0.06598976999521255,
        0.00525752454996109,
        0.017836783081293106,
        -0.08395270258188248,
        -0.008863290771842003,
        -0.05126126855611801,
        -0.033253107219934464,
        0.06486955285072327,
        -0.0701068565249443,
        0.0021300013177096844,
        -0.04417812451720238,
        -0.015305006876587868,
        -0.052519526332616806,
        0.01418822817504406,
        -0.05446278303861618,
        -0.051233042031526566,
        0.012363143265247345,
        -0.032587870955467224,
        0.013503394089639187,
        0.050420112907886505,
        -0.07041896134614944,
        -0.05162198841571808,
        0.05418575182557106,
        0.05841624364256859,
        -0.06740628927946091,
        -0.06269336491823196,
        -0.050836674869060516,
        0.03983002528548241,
        -0.02654206193983555,
        0.03455449640750885,
        0.018021441996097565,
        0.019518643617630005,
        0.021266436204314232,
        0.04015681892633438,
        -0.06865513324737549,
        -0.03695409372448921,
        0.08745020627975464,
        0.0219070203602314,
        0.029239526018500328,
        0.04579348862171173,
        -0.0020394257735460997,
        -0.1118292436003685,
        -0.0684872642159462,
        0.025449136272072792,
        -0.05832521244883537,
        -0.0464366190135479,
        -0.04867231845855713,
        0.06152738258242607,
        0.016793683171272278,
        0.015507908537983894,
        0.017530709505081177,
        -0.02945564314723015,
        0.001999744214117527,
        -0.006308392155915499,
        -0.0024791627656668425,
        -0.06742194294929504,
        0.04702102392911911,
        0.11095389723777771
    ]
}