{
    "id": "5ZhmuLeGVoU",
    "title": "Trying $7 AirPods from WISH",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-01-24T20:29:38Z",
    "video_url": "https://www.youtube.com/watch?v=5ZhmuLeGVoU",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "nordvpn",
        "wish",
        "fake airpods",
        "fake airpods vs real airpods",
        "best vpn",
        "vpn",
        "wish scams",
        "best wish scams",
        "airpods",
        "apple",
        "iphone",
        "airpods pro",
        "pro",
        "airpods 2",
        "ear buds",
        "wireless",
        "headphones",
        "tech",
        "airpods vs",
        "apple airpods",
        "review",
        "wireless headphones",
        "fake",
        "2020",
        "android",
        "nord vpn",
        "best vpn 2019",
        "i9s tws",
        "tws i7",
        "airpods clones",
        "copying airpods",
        "best vpn 2020",
        "i9s",
        "tws",
        "true wireless earbuds",
        "airpods 2 clone",
        "i7s tws",
        "wireless earbuds"
    ],
    "views": 430653,
    "likes": 11522,
    "comments_count": 555,
    "description": "Start protecting yourself on the web at  or use code thisis and save 70%! plus get an additional month for free!.   The WEIRD Side of CES 2020:  Sneaker Culture Explained with  @Jacques Slade:  The Pokmon Sword & Shield Controversy, Explained!:  Apple TV+ Has ALREADY Failed:  How China  Gaming:   Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://www.NordVPN.com/thisis",
        "https://youtu.be/O72IIyQiM-I",
        "https://youtu.be/w1K4ro4z__g",
        "https://youtu.be/mFx2scjbUHs",
        "https://youtu.be/OIyl0e_MAVk",
        "https://youtu.be/xsLAY8qqvvY",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome back to This Is. Today we're going deep into the bowels of Wish to see exactly what we can get when we try to purchase some Air Pods. - So the premise of this one is while we were searching through Wish for some of a mystery tech items for a Wish themed episode. - So we actually ordered three different Air Pods, which all have the exact same photos and they ranged in price including shipping between seven and 20 dollars. Supposedly they're all the same thing. - Super cheap. - So what I'm really curious about is Air Pods are generally speaking well over 100 dollars, based on sale price. So even though these are very clearly knock offs and I highly doubt that this photo of what looked to be genuine Air Pods are what we are about to get. I really want to see, Can you actually save money by getting a decent pair of headphones that just happen to be inspired by Air Pods? - Right off the bat, this is going to be interesting because this is the first one that came in. The second one- - That's a real box! - The third one, it looks on the surface like an exact Air Pod box, however, they're are some key differences here that make us think its fake. The fact that the orientation is not aligned. But then this font is not- - Fake. - This is not the Apple font. - And now this says these are wireless charging? I highly doubt they're wireless charging. Even something like this, which is very clearly inspired by Air Pods, isn't quite the same thing. There's no Apple logo, it doesn't say Air Pods, it's I7 TWS, I mean it even has the different colors here. So these are the real Air Pods. So let's start with this one the I12. So the first thing I notice is it does come with a lightning cable. So it's not micro USB, which is nice, it is much closer to the real Air Pods. - Yeah, that is definitely a key factor in this. - Wow look at the case? The main difference is that this is significantly lighter, but I mean you look at the hinge, you've got the button, it's in a slightly different location but I mean dimensions are almost the exact same. You've got the lightning port on the bottom. (clicking sound) I mean it's not bad, it's just cheap. And it just feels... Feel that, its so light weight. - I will tell you that one of my fidget spinnery-ness is I love to just flick this in my pocket. - The real ones. - Yeah, this is garbage. - The difference is with the fake Air Pods are very subtle. - And so the stem on this is- - Wow, that's significantly longer. - Huge. - They're not exact clones, they're small differences across the board, but that's very close. (beep) You know Matt, when it comes time to buy your sketchy Air Pods, you know what you need? - Would that be a reliable VPN? - Why yes it would! The wonderful sponsor of today's video, NordVPN. So with Nord you get wide support for all kinds of devices to make sure that your online browsing is safe and secure. Now I've been using NordVPN for years as its a super useful tool to not only make sure that you're protected when you're on public wifi, but even when you're in areas such as China where internet is severely limited, it actually really makes that much, much easier to, you know, use YouTube in places that you can't normally use YouTube. And on top of that, because it's so easy to install on your various different devices, I had NordVPN on my laptop, my phone, tablet, whatever the case is. So no matter where I am, no matter what sketchy wifi I need to get or whatever sketchy Air Pod site I'm going to I know that I'm going to be nice and safe. So if you are not yet on the VPN train be sure to check out NordVPN at the link in the description where you will get 70% off. That's literally $3.49 a month. Look man, I don't know what you're doing, I'm not going to judge. And guess what? The world doesn't either. NordVPN will keep you safe and secure. - Thanks NordVPN. (beep) - These are the first fakes that we tried. Look at the difference just in the case size. That's not even... That's not even close. I don't even understand, this feels light, this one feels even lighter. Do these even have batteries in them? I feel like the cases are literally just there to charge, but if you have your headphones are dead- - Yeah, I don't think these are charging cases whatsoever. This is literally, I feel like I'm not even holding anything. It's got a power button, but I mean that might- - It's probably for syncing? - Syncing? - Oh wait. Yeah, I don't know? You see the size difference? I feel like I'm a little kid putting in my dad's Air Pods. I literally want to grab this with my fist, whereas this is one finger. That's- - That's going to cause stress on your ear. - Alright let's see if these will actually pair. I'm doubtful. - So here's the thing, that has a button on it. - Also this is not powering on. Are all of these just shipped to us dead? Out of the box? - Which is not normal. Normally when a battery is usually about half charged when it's shipped to you. - So for context, these are the most legit looking fakes. The box looks very very similar. - I don't unbox things like Austin does, which, okay. - That looks pretty legit. Very similar dimensions. Still less weight, but unlike the first one, this has the hinge in the right spot, the button almost in the right spot and it says the designed by Apple in California assembled in China. This one is really trying to be real Air Pods. - But, yo! - That real, what? - It's not real, this is no... Wait. - That looks pretty legit Matt. - This looks pretty legit. This one supposedly has wireless charging. - Oh we can find that out right now. I highly doubt it though. Okay so if I put on the real Air Pod twos with the wireless charging case, the little LED lights up the charging pad is working, everything as you'd expect. Drop those on and see what happens. Nothing happens at all. - Nothing. - However, I've noticed with some of these fakes, the wireless charging is reversed. And this one... - Nothing. - Nothing. - Out of all the Air Pods we've taken a look at today, these are the ones that I think would fool most people. Especially if you've never owned a pair of Air Pods, all of the difference are very small, they're very subtle. So let's begin with the very first pair of Air Pods, which seemed to be decent, they don't have the Apple logo and anything on them, but if I try to sync them I assume... Oh wait, I7 TWS. Something is working right now. - Yes, (speaker mumbles). - Okay so I just got connected in the pairing, what? Connected and pairing. What? - That just sounds like static coming from your ears right now. - It sounds like I'm listening to the tiniest speaker in the world right now that someone shoved in my ear. - I mean that's exactly what you're doing. - I'm done, I'm already done, three seconds of that. That's some of the worst sounding headphones I've ever... - So the best way I can describe the sound of these is that if I got these out of a gumball machine - (laughs hysterically) - Out front of like a CVS. - This is Air Pod clone gen one. This is the very beginning. I think the other models... They're all confusing now. These other models are a much newer generation. Let's see if we can get any of these to pair. I don't even know, they all look so similar now. I'm getting them all mixed up. (gasping in shock) Wait, connect. Oh my.... - (laughs in shock) - They even... - Okay! - Which one did that? I don't know which one it is? It's this one right? Hang on, hang on let me... Did they actually clone... - The chip? - So this is using the real Air Pod pairing menu. I opened it up and it just works. So done. - Is that the T2 chip though that, or W2 chip that needs that? - I don't know? So I7 TWS... Was that those Air Pods that show up as real air... The fakest worst ones? - I don't think it worked the real way. I'm thinking that it is... - It's telling the Iphone that they're real Air Pods. (gasps) Oh Air Pods, okay, okay. What is that? Is that this? - I think it's this one? - Okay so it did it again. So one of these is showing up as real Air Pods. So if I press it. - And this again- - Connecting, I7 TWS. - I7, alright. - But why are the worst ones the only ones that show up and the newer much more legit ones... Like I get that these are fake and they feel- (celestial music playing) Old ugly cheap looking cheap Air Pods that sound terrible actually show up to the Iphone as Air Pods. And they basically pair like that. - Paired like it. I mean it definitely wasn't seamless. - What I want to do is I want to try the much more legit looking Air Pod clones. And the issue here is that neither of ours are functioning. One of them has as LED light which flashes when it's charging. - Well they both... I've swapped them out. They both have this LED that shows charging. - So should we just let these charge for another 30 minutes to an hour or something and then come back and give it a try? (beep) - So we have had these charging now for about an hour and it's blue. - Okay that's a good sign. - It's blue! - Do you need to take them out? Here's let's put them in. Oh, power on. I just heard it, okay. - I just got connected. - Okay I see I12. - These are the I12's. - So you have I12's okay. - It doesn't... - Whoa! - Whoa! - Wait, it's this right? - It has to be. - Connect. Oh, that's very exciting. Okay, hold on. So I'm going to use mine. So these are the really legit looking fakes. If I put these in. Yeah, see? So we have Air Pods and I12's, so if I hit this do you hear it? - Now I hear it yeah. - Okay we actually have both working at the same time. These do not sound anywhere near as bad as the other ones. - These sound infinitely better than these ones. - Agreed. - I don't think they sound as good as regular Air Pods. - I think it's not that far off. - No I agree. - These are like 80% as good as normal Air Pods, which to be fair are not great headphones. But I mean it's got the compassitive touch to put them in. Mind you it doesn't play and pause when I take them in and out of my ears. - Yeah it's still playing. - Obviously we're connected to the same phone with two pairs of headphones, which is confusing everyone involved including ourselves. But this is not bad, this is not bad at all. - I mean for one fifth the price. - They look just like Air Pods, they come in an Air Pod box, they function pretty much like Air Pods. I mean, normally when you think of clones you think of something which is very much inferior like it might look like it- - You think like this. - Like that! But when you look at these, they're almost indistinguishable from Air Pods and if you're not someone who knows what real Air Pods look and sound like, you'd be hard pressed to tell the difference. We have all these on the table, I keep picking up the wrong ones not realizing. I mean they're a little bit lighter. I don't want to whole heartedly recommend these, because they're definitely of below real quality. There's certainly some issues with it, but if you can pick these up for 10, 15 bucks, it might be worth the gamble. They're not that bad. - For just a truly wireless headphone set up, for 10, 15 bucks I don't think you're gonna get much better. - This gets me very excited. I feel like this needs to get serious. I think this is something we can go in depth on so many other products- - Well I have some good news for you. - Oh okay. - I have a whole, whole list of products in that we can test out on these. So stay tuned for that, we got phones, we got watches, we got Austin Evans, so yeah.",
    "transcript_keywords": [
        "Air Pods",
        "real Air Pods",
        "Air Pod",
        "Air",
        "Pods",
        "real Air",
        "Air Pod box",
        "fake Air Pods",
        "exact Air Pod",
        "cheap Air Pods",
        "Air Pod clone",
        "sketchy Air Pods",
        "Air Pod pairing",
        "normal Air Pods",
        "genuine Air Pods",
        "Pod",
        "Air Pod site",
        "dad Air Pods",
        "regular Air Pods",
        "real"
    ],
    "transcript_entity_values": [
        "Today",
        "Austin Evans",
        "one",
        "third",
        "Apple",
        "TWS",
        "Nord",
        "three",
        "Air Pods",
        "USB",
        "I12",
        "today",
        "15 bucks",
        "three seconds",
        "T2",
        "3.49",
        "Air Pods",
        "California",
        "Matt",
        "years",
        "70%",
        "Austin",
        "two",
        "between seven and 20 dollars",
        "Iphone",
        "Air Pod",
        "One",
        "China",
        "second",
        "VPN",
        "YouTube",
        "about half",
        "another 30 minutes to an hour",
        "first",
        "Air Pod",
        "80%",
        "W2",
        "fifth",
        "about an hour",
        "I7 TWS",
        "10"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "MONEY",
        "TIME",
        "ORG",
        "MONEY",
        "PRODUCT",
        "GPE",
        "PERSON",
        "DATE",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "TIME",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.09175822138786316,
        0.0220095943659544,
        0.0892687439918518,
        0.030176540836691856,
        0.0837845578789711,
        -0.08081738650798798,
        0.06518607586622238,
        0.007821552455425262,
        0.018245365470647812,
        0.03742901235818863,
        0.0905846431851387,
        0.001680555404163897,
        -0.013813897967338562,
        -0.01770506612956524,
        0.027197670191526413,
        -0.022109409794211388,
        0.0683281272649765,
        -0.09432920813560486,
        -0.035719700157642365,
        0.04602953791618347,
        -0.030641550198197365,
        -0.012371379882097244,
        0.040331196039915085,
        0.02906380593776703,
        0.01441438402980566,
        -0.0032917819917201996,
        -0.016194207593798637,
        -0.03971301019191742,
        -0.04206635057926178,
        0.00611819326877594,
        -0.024514395743608475,
        0.07795277237892151,
        0.037910424172878265,
        0.05927377566695213,
        0.06102023646235466,
        -0.0998101755976677,
        0.08058290928602219,
        -0.022376682609319687,
        -0.02616196870803833,
        -0.002512524137273431,
        -0.04770294576883316,
        -0.08644016087055206,
        -0.0720696672797203,
        0.037932273000478745,
        -0.062404971569776535,
        0.010582517832517624,
        0.009606658481061459,
        -0.034995757043361664,
        -0.003828582586720586,
        0.0685468390583992,
        -0.04737686365842819,
        -0.03797535225749016,
        0.03519933670759201,
        -0.0664699375629425,
        0.022804519161581993,
        0.003060007933527231,
        -0.06839679926633835,
        0.0017642932943999767,
        0.04257822409272194,
        0.004017412196844816,
        0.0023524928838014603,
        -0.07216397672891617,
        -0.003967460710555315,
        -0.04611257463693619,
        0.005558747798204422,
        -0.0399894192814827,
        -0.04878035560250282,
        -0.014077374711632729,
        0.06906340271234512,
        -0.04619241878390312,
        0.01851998083293438,
        0.05814014747738838,
        0.07069731503725052,
        0.06390593200922012,
        -0.002769225277006626,
        0.1019248515367508,
        0.08798312395811081,
        -0.05043905973434448,
        0.0007540264632552862,
        0.05243922770023346,
        0.05229959264397621,
        -0.016375388950109482,
        -0.016588566824793816,
        -0.08081765472888947,
        -0.009945515543222427,
        -0.015861207619309425,
        0.0066313655115664005,
        -0.019760120660066605,
        -0.024286555126309395,
        -0.032477278262376785,
        -0.09570170193910599,
        -0.031704168766736984,
        0.04883744940161705,
        -0.02835681289434433,
        0.012697502039372921,
        0.04642210155725479,
        0.0006284769624471664,
        0.018367376178503036,
        0.025230681523680687,
        0.011792040430009365,
        0.049823105335235596,
        0.023705746978521347,
        0.020537901669740677,
        -0.07960424572229385,
        0.0322115384042263,
        -0.06936593353748322,
        -0.07387549430131912,
        -0.04187559336423874,
        0.105087049305439,
        0.08247317373752594,
        -0.06271132826805115,
        -0.06562147289514542,
        -0.04127645492553711,
        -0.02737419493496418,
        -0.056032441556453705,
        0.039293911308050156,
        -0.04775535315275192,
        0.05202318727970123,
        0.05025232583284378,
        -0.04361336678266525,
        -0.027503667399287224,
        -0.0015397850656881928,
        0.10428598523139954,
        -0.011438029818236828,
        -0.04288949817419052,
        -0.04620606079697609,
        -0.10962023586034775,
        4.1702002893664556e-33,
        -0.0077436259016394615,
        0.05540937930345535,
        0.0026322684716433287,
        -0.057118840515613556,
        -0.03169383481144905,
        -0.07137017697095871,
        0.05705317482352257,
        0.038009945303201675,
        0.004170354455709457,
        0.07136916369199753,
        -0.1684752255678177,
        0.06885741651058197,
        -0.06564550846815109,
        0.014082063920795918,
        0.041046250611543655,
        -0.07691800594329834,
        -0.14401225745677948,
        -0.03772607073187828,
        0.0017082251142710447,
        0.03728356957435608,
        0.005587704014033079,
        -0.01834253780543804,
        0.019057482481002808,
        -0.04229498654603958,
        0.03749879449605942,
        -0.04031212255358696,
        0.0034923802595585585,
        -0.015452470630407333,
        0.05846662446856499,
        0.011040961369872093,
        -0.04474524036049843,
        0.026011712849140167,
        0.0727376937866211,
        -0.02632134035229683,
        -0.08078282326459885,
        -0.034072067588567734,
        -0.013272162526845932,
        -0.07168646156787872,
        -0.029680822044610977,
        -0.017775600776076317,
        -0.007146430667489767,
        0.031234169378876686,
        -0.06621964275836945,
        0.025825858116149902,
        0.010016857646405697,
        0.047971222549676895,
        0.0025960132479667664,
        -0.03306073695421219,
        0.06288891285657883,
        -0.045249246060848236,
        -0.07274655997753143,
        0.022736288607120514,
        -0.05895903706550598,
        0.014103522524237633,
        -0.033018339425325394,
        -0.1148173063993454,
        0.03872189670801163,
        -0.01119445264339447,
        0.08770321309566498,
        -0.026052119210362434,
        -0.014641178771853447,
        -0.01568673551082611,
        0.021865295246243477,
        0.009352327324450016,
        -0.10460712015628815,
        0.09474948048591614,
        0.06759906560182571,
        0.03823072463274002,
        -0.05086521804332733,
        0.07591717690229416,
        0.024544836953282356,
        0.04704027995467186,
        -0.031959474086761475,
        -0.14264483749866486,
        0.01870511658489704,
        -0.022392744198441505,
        0.0010204395512118936,
        0.04137665033340454,
        0.013351150788366795,
        -0.021965907886624336,
        0.0304514542222023,
        0.02444450557231903,
        0.02541273832321167,
        0.08940452337265015,
        -0.010952677577733994,
        -0.007792709395289421,
        0.023818733170628548,
        0.005772977136075497,
        -0.03148902580142021,
        0.012711802497506142,
        -0.016393478959798813,
        0.010106372646987438,
        -0.058731626719236374,
        -0.01571037620306015,
        0.0016045458614826202,
        -5.333399703963111e-33,
        0.06264456361532211,
        0.007542225066572428,
        -0.02368309535086155,
        0.01261250302195549,
        0.002043468412011862,
        0.03305269405245781,
        -0.01891772635281086,
        0.04298902302980423,
        -0.0008909842581488192,
        -0.00034002528991550207,
        -0.023270364850759506,
        0.03017314337193966,
        0.015110080130398273,
        0.05492476373910904,
        -0.05089839920401573,
        -0.07274152338504791,
        -0.005917142610996962,
        -0.046657856553792953,
        0.07869259268045425,
        -0.04491138458251953,
        -0.003405541880056262,
        0.04045602306723595,
        -0.0050898464396595955,
        0.007539855781942606,
        -0.07052633166313171,
        0.0408640019595623,
        0.04967609792947769,
        -0.024674944579601288,
        0.011524159461259842,
        0.01681647263467312,
        -0.015743590891361237,
        0.005087282042950392,
        0.044825904071331024,
        0.13975729048252106,
        0.05391741171479225,
        -0.051106516271829605,
        -0.04971574246883392,
        0.03088638186454773,
        0.013331452384591103,
        -0.09361222386360168,
        -0.0310214851051569,
        -0.03221641108393669,
        -0.01391916535794735,
        -0.029018448665738106,
        -0.022122196853160858,
        -0.09222197532653809,
        -0.01580524630844593,
        -0.017533525824546814,
        0.05072348192334175,
        -0.053190890699625015,
        0.04006686806678772,
        0.03760790824890137,
        -0.07725819945335388,
        0.025646677240729332,
        -0.11591300368309021,
        0.02618381939828396,
        -0.04397343471646309,
        0.050530243664979935,
        0.06475214660167694,
        0.014905092306435108,
        0.021599475294351578,
        -0.026495330035686493,
        -0.008837600238621235,
        -0.044363874942064285,
        -0.03227720782160759,
        0.049951307475566864,
        0.08938448876142502,
        0.0568571612238884,
        -0.027066433802247047,
        -0.03370068222284317,
        0.03832414001226425,
        -0.05545159429311752,
        0.03975725919008255,
        0.014157064259052277,
        0.021500207483768463,
        0.0031226002611219883,
        0.02355310507118702,
        0.020285045728087425,
        0.10417491942644119,
        0.0500057116150856,
        -0.00647733686491847,
        0.017556942999362946,
        0.014659603126347065,
        0.08610831201076508,
        0.06990469247102737,
        0.056155744940042496,
        -0.03342092037200928,
        0.01987590827047825,
        -0.02542727440595627,
        0.13716743886470795,
        0.025577979162335396,
        0.025798119604587555,
        -0.0086486442014575,
        0.06791464984416962,
        0.08247862756252289,
        -5.7807223896588766e-08,
        0.05158083140850067,
        0.0067781065590679646,
        0.035438213497400284,
        0.07973044365644455,
        -0.027835717424750328,
        0.0022043113131076097,
        -0.037073567509651184,
        0.030909866094589233,
        0.00473021948710084,
        -0.004904485773295164,
        0.03351233899593353,
        -0.04941415414214134,
        -0.11639171838760376,
        0.06188037246465683,
        -0.002285574795678258,
        -0.012549097649753094,
        -0.11340824514627457,
        0.07560822367668152,
        -0.006109452806413174,
        -0.005210937466472387,
        -0.10744832456111908,
        0.038463983684778214,
        0.09157782047986984,
        -0.06642631441354752,
        -0.10552310198545456,
        0.07499072700738907,
        -0.04507261514663696,
        -0.015773043036460876,
        -0.013265674002468586,
        0.0066452245227992535,
        -0.09708041697740555,
        -0.06325845420360565,
        -0.04067141190171242,
        -0.020594971254467964,
        -0.018634693697094917,
        -0.02304994873702526,
        -0.07291140407323837,
        -0.05126185342669487,
        -0.01581079699099064,
        0.028580181300640106,
        -0.0261631328612566,
        -0.1552165299654007,
        -0.027803538367152214,
        -0.0038879700005054474,
        0.02802439033985138,
        -0.03070784918963909,
        -0.01702580787241459,
        -0.040497153997421265,
        -0.006520768627524376,
        0.0811961442232132,
        0.04556107893586159,
        0.008131567388772964,
        -0.008690956979990005,
        -0.0023411810398101807,
        -0.04602710157632828,
        0.0005811054725199938,
        -0.05736486241221428,
        -0.01571032404899597,
        0.008208516985177994,
        0.08921770751476288,
        0.06261010468006134,
        -0.0756160095334053,
        -0.02280336245894432,
        0.119803786277771
    ]
}