{
    "id": "63EVXf_S4WQ",
    "title": "Google Pixel 9/Pro/Fold Impressions: They've Finally Done It?",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2024-08-13T17:00:45Z",
    "video_url": "https://www.youtube.com/watch?v=63EVXf_S4WQ",
    "category": "Science & Technology",
    "tags": [
        "Pixel 9",
        "Google Pixel 9",
        "Pixel 9 impressions",
        "review",
        "Pixel 9 review",
        "Google Pixel 9 review",
        "MKBHD",
        "Pixel 9 hands on",
        "Pixel 9 Pro",
        "Pixel 9 vs",
        "Pixel 9 first look",
        "first look",
        "Pixel 9 Fold",
        "Pixel 9 Pro Fold",
        "Pixel 9 event",
        "Pixel Watch 3",
        "Pixel watch",
        "Pixel Buds",
        "Pixel Buds Pro"
    ],
    "views": 6924262,
    "likes": 223605,
    "comments_count": 11194,
    "description": "Pixel 9s are looking like flagships for real. Plus some AI stuff, of course.  Protect your smartphone with dbrand at   Google Pixel 9:  Google Pixel 9 Pro:  Google Pixel 9 Pro XL:  Google Pixel Buds Pro 2:  Google Pixel Watch 3:   MKBHD Merch:   Tech I'm using right now:   Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "https://dbrand.com/pixel-9-series",
        "https://geni.us/R3ux",
        "https://geni.us/EHvPJ",
        "https://geni.us/XEW5L",
        "https://geni.us/A4F8W",
        "https://geni.us/EMGA",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - I think Google might have done it. The only reason I hesitate is because I've had this exact same feeling and said this same line before about, like, the Pixel 6. But Google's phones have always been all about software and we just want them to get their hardware over the hump to have a complete competitive phone, but I think they did it. So Google had their Pixel 9 event today and there's actually a bit more than just the Pixel shown off. There's also a new watch and new Pixel Buds, and I'll get to those, but I just wanna focus this video on the new phones because I've been waiting for these for a while. So there's several phones. There's the Pixel 9, Pixel 9 Pro, then the Pixel 9 Pro XL, and then a Pixel 9 Pro Fold. Now, some people are saying the names are a bit confusing. Honestly, it's not really that bad, except maybe the Fold. But the base phone, the Pixel 9 is 799. And with that you get the 6.3-inch screen size and it has this new design with the flat matte metal sides and a polished glass back in four colors, Porcelain is white, Obsidian is black, and then Wintergreen and Peony, kind of Cosmo and Wanda vibes. And then there's the two Pro phones, so the Pixel 9 Pro and Pro XL. So what's sick is the 9 Pro, it's the exact same size as the Pixel 9, just like what the iPhone's been doing. And the only thing that's different about the XL is it's just bigger. Just a bigger 6.8-inch screen and a bigger battery. But yeah, the Pro phones start at 999 and 1,099, and with that you'll get an extra third camera, telephoto camera, they have more RAM, and they switch to glossy rails with a soft-touch glass back. Again in four colors, Obsidian, Porcelain, Hazel, which looks nice, and Rose Quartz, kind of a more faded pink. So I got to handle these phones for like two hours, and the entire time right from the beginning I was like, \"Oh, wow, yes. Okay, Google's done it. These phones really feel and look like actual flagships.\" And it's not just because the trend these days is to do flat sides, like obviously I've talked about how I like that, but that's not the only thing. They feel a little bit heavier in the hand now, which gives them a more solid feel. This screens are all much brighter. So the Pixel 9's Actua display is 35% brighter than the Pixel 8 and there's thinner bezels all the way around. And yes, finally it's an ultrasonic fingerprint reader under the display, not optical. And the camera visor around the back, this is polarizing, but the huge lens opening, I think it just looks promising. Now, of course, I'm gonna have to test all these things for the full review and really see what they're made of, so get subscribed to see that. But my first impression at least is that, you know, these photos are gonna end up very Pixel-like, very punchy and contrasty, and they're just bigger sensors than before, so potentially more shallow depth of field. But I guess aesthetically, the camera bump, even though I like the older ones better, I still kind of don't mind these new ones. I know it's not the full visor all the way around like before and I miss that, but it's now this, like, perfectly flat island and that is still distinctive. It's pretty unique as like a Pixel thing, so. Now specs. Let's just get them all in one place. There, that's all the specs that I've been able to confirm. You'll notice all these phones, across the board, all the new Pixels have the same Tensor G4 chip. The new chip is more powerful, they're saying, and more efficient and should have dramatically better AI capabilities. Obviously, it's a Pixel, but we'll get there. But also notice it's the exact same primary camera and ultrawide camera between the base phone and the Pro phone. So, again, I've talked about this with Pixel before and it makes the lowest priced one look like a great deal, but there's not a lot of hardware difference between the base phone and the Pro phone, and it's a $200 difference this year. But for that in the Pro phone, what do you get? Maybe a slightly better screen, a telephoto camera, more RAM, and a better selfie camera. That's kind of it. Now, again, I don't wanna make the mistake of judging it too soon because I haven't benchmarked it and I don't know what long-term performance is like, but when Google says Tensor is 20% faster with web browsing and 17% faster with app launching, I believe them. I mean, these phones are really quick and snappy, at least from my impression. And I just wanna say again that I'm really glad they made the smaller phone with all of the benefits of the Pro, because there are a lot of people who want a better phone but not a gigantic phone. So having a Pro that's not a Pro Max is sick. But of course, these would not be Pixel phones without a boatload of AI, and so there are definitely some new AI features coming along with these Pixel 9s. The big ones are the new Weather app, the new Screenshots app, and Pixel Studio. So the Google Weather app has been redesigned for the Pixel 9s, as you can see, which is a bunch of tiles now, and this very, you know, modern-looking version of the weather. And right at the top is an AI-generated comment about the weather, maybe sometimes telling you what to wear or something. Cool, I guess. I almost never use the stock weather app on any phone and that probably won't change here, but for those who do, all right, fine, that's a good improvement. The new Screenshots app is interesting. Again, I don't think many people are going to use this, but if you do, it's basically a new app that gathers all of your screenshots specifically in one place, and then it scans each one of them for any information in them to be able to remind you later or help you search through later. But then there's the Pixel Studio app, which I guess that's the hot new thing in devices with AI, is to have an app called Studio that just lets you create AI-generated art on device with a simple text prompt. Apple has just announced that in iOS 18, but they're not shipping that yet. But the one thing I was impressed with playing with this one is it's really quick, like maybe three seconds or so to generate a new image. And it's completely on device, so it'll still be this fast when your internet connection sucks or you're offline or something like that. So yeah, I don't know, maybe your generated pictures or memes for text conversations or for Twitter or something like that, but yeah, it's another AI app on the phone. Also, Magic Editor in photos has this new Reimagine feature where you can not only erase things or reframe things in your pictures, but you can now highlight a section and reimagine it as something, and it can be whatever you type, just something completely different. So I guess you can straight-up make up new scenes and pictures now that totally didn't happen, kind of like Samsung's sketch to image. What is going on? What is a picture? But maybe the best what is a photo feature is this new one in the camera, again, built right in, called Add Me, and it's actually, I think, pretty impressive. I got to use it once, and you're about to see exactly me using it once. But basically if you ever have a group of people and you wanna take a group shot but you don't have anyone else who could take the group shot for you, okay, no problem, the Add Me feature walks you through this. So okay, first you open the camera mode and it tells you to kind of wiggle the camera around a little bit so it can get a better sense of 3D space and the environment. Then the photographer, number one, takes a picture of everyone except for them and leaves a little room for themselves. Then once they take that, they can have everybody peace out and then one of those other people becomes the new photographer and tells the first person where to pose so that they can sort of be next to everyone else. It overlays where the people were and a nice white box over the scene to help keep the framing the same. Once the second person poses, they snap the picture and Google straight-up merges the pictures together into a group photo with everyone. Another moment that totally never happened. Plus it keeps the originals too. Very 2024. What is a photo? There's some other things like better Clear Calling, Call Notes, can summarize phone calls that you're on for you, Gemini Live, which is like having literal conversations with the assistant called Gemini. It's still confusing. But generally I was most excited about the hardware of these phones. And then there's the folding phone. So this is the Pixel 9 Pro Fold. I don't know why it's called that, I don't know why it's not just called the Pixel Fold 2. Maybe it's easier to remember 'cause now they're all 9s, but whatever. They added Pro to the name for some reason, but it's a Fold, and the point is it's dramatically improved from the Pixel Fold that came last year. And it's the same price, 1,799. So, look, Google cooked with this thing. I think the last Fold I was constantly calling the best foldable to use closed, which is kind of a half compliment, but it's true. This new one has an even bigger screen. It's 6.3 inches, so right now it's about the size of the other base Pixel 9. And it's still reachable because the bezels are all pretty thin. The whole phone is thin all the way around and it's also much brighter. It's 80% brighter than the last Fold. And then on the inside it's also a larger eight-inch display that, like I said, it mirrors the home screen layout of the cover display. And the phone with the metal rails now and a soft-touch matte glass, it just all feels even more premium, like a flagship than ever before. And look at how thin this thing is. This has gotta be, I mean, it's definitely one of the thinnest foldables out now. Maybe not the thinnest, but each side is barely thicker than a USB-C port, and so combined with the flat sides, it's barely thicker than a normal phone. Now, of course, it still has this camera bump on the back, which is, okay, this one's worse. (chuckles) I don't see a lot of thoughtful design in this camera island, but I feel like I can accept it with the rest of this phone's design being so impressive. It's just so good. It feels great to use open, it's awesome closed. I feel like there's just a better version of the previous best foldable, the OnePlus Open. Of course, still TBD on battery life and camera quality with these new cameras that are different from the main Pixel 9s, but, you know, my general first impression is clearly pretty positive. It also, of course, has the Tensor G4, 16 gigs of RAM, and all the AI benefits that come from these new Pixels: Pixel Studio, Screenshot app, Weather app, all that other Pixel stuff. It is also IPX8 rated, so it can probably take a splash. And Google also mentioned that they're partnering with some number of developers to optimize some games for the interior screen, so looking forward to see what those end up being. And it also comes in two colors: Porcelain, white; and Obsidian, black. So I think consider me highly interested. You know, I've kind of been off the foldables train for my own daily driver for a while, I've gone back to dailying slab phones, but I think this Pixel 9 Pro Fold has a chance to get me back to being a foldable user if that outer screen remains just as usable as any other phone. And the bonus is a gigantic eight-inch screen whenever I want it, one of the biggest displays literally ever in a phone. So these phones feel, for now, like they've actually achieved the modernized glow-up that we've been hoping for from Google's flagship phone. Maybe Qi2 is the only thing missing that I'm actually bummed about that I can see on the spec sheet. But of course, as promised, it's not just the phones. There's also a couple other gadgets. So the new Pixel Watch 3 has basically the same design but now comes in two sizes. There's a new larger 45-millimeter size that gets you, like, 40% more screen. And the bezel is also a little bit smaller. So these screens are also a lot brighter, 2,000 nits. And there's a new body score feature, which it seems like everyone suddenly decided to copy from Garmin this year. But that will sort of summarize all of your metrics into one score at the top. And there's also some new running features as well. Potentially the biggest change is the new dual chip architecture to give you even longer battery life, they're saying up to 36 hours in Battery Saver, which isn't exactly pushing the industry limit, but it should be better than last year. And same price, 349 for the small one, 399 for the big one. And then there's the new Pixel Buds. So the Pixel Buds Pro 2, which at this point are kind of like Gemini buds. So they updated the design to be a bit smaller, as you can see, just these little bud things with no stalks. There's a little tiny stabilizer fin to keep it in your ear, hopefully. Sometimes it doesn't work with my ears, but I'll try. And then there's a new custom-designed A1 chip based on Tensor that improves active noise cancellation, improves overall sound quality, and also lets you have a back-and-forth conversation with Gemini Live. Just a straight-up, out-loud, back-and-forth convo with an assistant. I will definitely be getting my hands on these to test, but definitely let me know what you're most interested in for the full reviews of these things. I'm planning on getting my hands on as many as possible, get subscribed to see this stuff. But is it the AI features or is it the new camera stuff? Is it the new hardware, which I think looks pretty sick? Let me know in the comment section below. Now, a few years back I put up a poll on Twitter asking how many of you use a case on your phone, and, like, three quarters of you guys said you do. And I guess that actually makes a lot of sense and phones have gotten more expensive since then, so I can't blame you. So if you're thinking of picking one up, I definitely recommend checking out the Grip Case from channel sponsor dbrand. It's kind of the whole package. It comes in matte black, it's super grippy, it has clicky buttons, and it adds those nice strong magnets. And yes, obviously also super protective, so I'll leave a link down below if you wanna check it out. Either way, that's been it. Thanks for watching. Catch you guys on the next one. Peace. (upbeat music)",
    "transcript_keywords": [
        "Pixel",
        "Pro",
        "Pixel Buds Pro",
        "phone",
        "Pro phone",
        "Pro Fold",
        "Pixel Studio",
        "Pixel Fold",
        "phones",
        "Pixel Buds",
        "Pro phones",
        "Pixel Studio app",
        "Google",
        "camera",
        "Pixel phones",
        "Fold",
        "app",
        "kind",
        "Pro phones start",
        "Pixel thing"
    ],
    "transcript_entity_values": [
        "799",
        "Apple",
        "45-millimeter",
        "four",
        "1,099",
        "Tensor G4",
        "Add Me",
        "Obsidian, Porcelain",
        "three quarters",
        "200",
        "Pixel Buds",
        "Weather",
        "9s",
        "Pixel 9",
        "35%",
        "Tensor",
        "half",
        "first",
        "iPhone",
        "Studio",
        "1,799",
        "the Pixel Buds Pro 2",
        "Clear Calling",
        "Samsung",
        "the Pixel Fold 2",
        "20%",
        "Pixel",
        "today",
        "one",
        "the Pixel Studio",
        "Peony",
        "the Pixel Fold",
        "Pixel 9 Pro Fold",
        "349",
        "A1",
        "Hazel",
        "Reimagine",
        "Cosmo",
        "Fold",
        "Pixel Watch 3",
        "like two hours",
        "Screenshots",
        "Twitter",
        "80%",
        "two",
        "the Grip Case",
        "last year",
        "up to 36 hours",
        "9",
        "Obsidian",
        "a few years",
        "XL",
        "IPX8",
        "Battery Saver",
        "Magic",
        "the Tensor G4",
        "Obsidian",
        "Wanda",
        "Rose Quartz",
        "this year",
        "an extra third",
        "daily",
        "maybe three seconds",
        "40%",
        "399",
        "Gemini Live",
        "second",
        "RAM",
        "the OnePlus Open",
        "Gemini",
        "these days",
        "Pixels",
        "AI",
        "999",
        "6.3-inch",
        "Actua",
        "6.3 inches",
        "8",
        "the Pixel 9 Pro Fold",
        "iOS 18",
        "Garmin",
        "6.8-inch",
        "Google",
        "17%",
        "Call Notes",
        "2,000",
        "16",
        "eight-inch"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "LAW",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "LAW",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "LOC",
        "DATE",
        "TIME",
        "CARDINAL",
        "LOC",
        "DATE",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "GPE",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "TIME",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "EVENT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "NORP",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "EVENT",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY"
    ],
    "vector": [
        -0.13319839537143707,
        -0.07108429074287415,
        0.11655700206756592,
        -0.11832588165998459,
        0.12459922581911087,
        0.07495833933353424,
        0.08032713830471039,
        0.030570663511753082,
        -0.03673328831791878,
        -0.037397563457489014,
        -0.004005098715424538,
        0.025921383872628212,
        -0.04319480061531067,
        -0.07298368960618973,
        -0.001900527044199407,
        -0.03132450580596924,
        0.08528855443000793,
        -0.023791564628481865,
        -0.06360485404729843,
        0.014794829301536083,
        -0.02801944874227047,
        -0.0833020731806755,
        0.05340252071619034,
        0.03437129780650139,
        0.04172084107995033,
        0.07108817994594574,
        -0.0030141558963805437,
        -0.02530989609658718,
        0.03115108609199524,
        -0.03596886992454529,
        0.03992753103375435,
        0.07384786754846573,
        0.07353409379720688,
        0.07385195791721344,
        -0.046470366418361664,
        -0.06470867246389389,
        -0.0562884546816349,
        0.019058404490351677,
        -0.07464204728603363,
        -0.051817432045936584,
        0.04224555566906929,
        -0.055718302726745605,
        -0.02153330110013485,
        -0.03981852903962135,
        -0.006724729668349028,
        -0.0337117575109005,
        0.07092287391424179,
        -0.07194343209266663,
        0.01949647255241871,
        -0.016563117504119873,
        -0.042277343571186066,
        -0.058024194091558456,
        -0.013611949980258942,
        -0.05552820861339569,
        -0.09330275654792786,
        0.049557704478502274,
        0.02956032194197178,
        -0.00047772808466106653,
        0.06225793808698654,
        0.07901326566934586,
        0.015919290482997894,
        -0.006101551465690136,
        0.04081474244594574,
        0.03898705169558525,
        0.01618780754506588,
        0.0377294197678566,
        0.01641034334897995,
        -0.034121397882699966,
        0.0010581151582300663,
        0.017021983861923218,
        0.010991724207997322,
        0.053549833595752716,
        -0.030068250373005867,
        -0.03606974333524704,
        -0.046037815511226654,
        0.018458612263202667,
        -0.0355919674038887,
        -0.0734160989522934,
        -0.06799104064702988,
        -0.03815091773867607,
        0.05631805211305618,
        -0.07496809959411621,
        -0.00019849534146487713,
        -0.006515737157315016,
        -0.004727181978523731,
        -0.0211024172604084,
        0.01845947653055191,
        0.030139347538352013,
        -0.03949873894453049,
        -0.1042923778295517,
        -0.0936284288764,
        0.09920737892389297,
        -0.03925172984600067,
        0.03705180808901787,
        -0.0264710932970047,
        0.020477719604969025,
        -0.0618278905749321,
        -0.04690840467810631,
        0.034553077071905136,
        0.012281782925128937,
        0.043514810502529144,
        0.051483336836099625,
        0.0035136411897838116,
        -0.028578706085681915,
        -0.005030746106058359,
        -0.10788114368915558,
        -0.0313308909535408,
        0.03940371423959732,
        -0.0019568069837987423,
        0.02353624813258648,
        0.01556431781500578,
        0.04880460724234581,
        -0.022996993735432625,
        -0.006875524763017893,
        -0.05717695131897926,
        0.048661231994628906,
        -0.060575857758522034,
        0.039424069225788116,
        0.10196883976459503,
        0.03975728526711464,
        0.03705206140875816,
        0.0020003255922347307,
        -0.002635633572936058,
        -0.10123877227306366,
        0.004213650245219469,
        0.01622670702636242,
        -0.0832669585943222,
        2.877250543010005e-33,
        0.04652443155646324,
        0.00037824391620233655,
        -0.010796298272907734,
        -0.019324257969856262,
        -0.02562227100133896,
        0.011895292438566685,
        -0.03547702357172966,
        0.05638052895665169,
        -0.021167850121855736,
        -0.010980472899973392,
        -0.010555711574852467,
        -0.03504888340830803,
        -0.06341461837291718,
        -0.05227701738476753,
        0.0901532769203186,
        -0.03352944925427437,
        -0.09611422568559647,
        0.011942434124648571,
        -0.004363180138170719,
        -0.025072507560253143,
        -0.019748730584979057,
        -0.02771957777440548,
        -0.0018191238632425666,
        -0.010631308890879154,
        0.0022275070659816265,
        0.055792249739170074,
        0.016886692494153976,
        -0.0009919889271259308,
        0.019990099593997,
        -0.007912486791610718,
        -0.07331357151269913,
        -0.0011384414974600077,
        0.027121158316731453,
        0.025820964947342873,
        -0.033043164759874344,
        0.1050432100892067,
        -0.0463867112994194,
        -0.03845786675810814,
        0.04239049181342125,
        -0.014230789616703987,
        -0.0625975951552391,
        0.014701114036142826,
        -0.0476003922522068,
        -0.10659942775964737,
        0.03514508530497551,
        0.017004579305648804,
        -0.021564720198512077,
        -0.06515149772167206,
        -0.008567254059016705,
        -0.009561355225741863,
        0.08343514800071716,
        0.005887243431061506,
        -0.013131970539689064,
        -0.055959444493055344,
        -0.023387370631098747,
        -0.04771427437663078,
        0.020749224349856377,
        -0.0064793904311954975,
        0.05675138905644417,
        0.053640831261873245,
        0.041507892310619354,
        0.0036479688715189695,
        -0.07235514372587204,
        0.07434041798114777,
        -0.06116071343421936,
        0.057537741959095,
        0.10297933220863342,
        0.03493476286530495,
        -0.020251363515853882,
        0.06281819939613342,
        -0.03271413594484329,
        0.00023437228810507804,
        -0.009451187215745449,
        -0.06054547429084778,
        0.03146437555551529,
        0.017276398837566376,
        -0.038531310856342316,
        -0.039745230227708817,
        0.06384201347827911,
        -0.011951628141105175,
        0.0808892473578453,
        -0.02113649621605873,
        0.025542588904500008,
        0.06265732645988464,
        0.0023377679754048586,
        -0.05860286206007004,
        -0.012783232145011425,
        -0.05883484333753586,
        -0.07572558522224426,
        0.01814359240233898,
        -0.1375725269317627,
        -0.027640026062726974,
        -0.07148487120866776,
        0.008385011926293373,
        -0.018103869631886482,
        -4.9594033192795384e-33,
        -0.005545102525502443,
        -0.02789073809981346,
        0.047103337943553925,
        0.00300731067545712,
        0.044088318943977356,
        -0.014176757074892521,
        0.10334974527359009,
        -0.05513870343565941,
        -0.04555666819214821,
        -0.00674949586391449,
        -0.016701187938451767,
        -0.0339483767747879,
        0.017944470047950745,
        -0.00010048737749457359,
        -0.09189839661121368,
        -0.05651932582259178,
        0.003210432594642043,
        -0.05352402478456497,
        -0.01839015819132328,
        0.02426494099199772,
        0.05319807678461075,
        0.02160128764808178,
        0.011293550953269005,
        -0.00038798825698904693,
        -0.03783070668578148,
        -0.014908041805028915,
        0.05420006811618805,
        0.037751760333776474,
        0.039092615246772766,
        -0.0971166118979454,
        0.026325134560465813,
        -0.045803386718034744,
        -0.0808008462190628,
        0.0035815853625535965,
        0.08721891790628433,
        0.016139890998601913,
        0.047973837703466415,
        0.0031482363119721413,
        0.022686701267957687,
        -0.03194567561149597,
        -0.006475555710494518,
        0.0007234436343424022,
        -0.019270578399300575,
        -0.08893484622240067,
        0.053227733820676804,
        -0.01585981249809265,
        -0.014913525432348251,
        0.08022914081811905,
        -0.07320632040500641,
        0.07000153511762619,
        0.012387939728796482,
        0.0492018386721611,
        -0.06217188760638237,
        -0.047893837094306946,
        -0.09372560679912567,
        -0.014297747053205967,
        -0.0506141297519207,
        -0.020312609151005745,
        0.03509405255317688,
        0.0007749893120490015,
        0.07439601421356201,
        0.01134976651519537,
        -0.045964863151311874,
        -0.07547774910926819,
        -0.1065978929400444,
        0.06512894481420517,
        0.059606388211250305,
        0.027447117492556572,
        -0.004909646697342396,
        0.028569985181093216,
        -0.04093705862760544,
        -0.0003330559702590108,
        -0.03309003263711929,
        -0.043973565101623535,
        -0.015631165355443954,
        0.051069796085357666,
        -0.0586434006690979,
        -0.016370663419365883,
        0.03786745294928551,
        -0.0536920428276062,
        0.024206053465604782,
        -0.030467050150036812,
        0.09875232726335526,
        -0.009694728069007397,
        0.12488746643066406,
        0.09842147678136826,
        0.023753484711050987,
        0.005585397593677044,
        0.03350631892681122,
        0.04504365473985672,
        -0.0521215982735157,
        0.04352205619215965,
        -0.05931307375431061,
        0.06303557008504868,
        -0.012337817810475826,
        -5.5228984052746455e-08,
        0.09767919033765793,
        0.009306173771619797,
        0.04788349196314812,
        -0.01041739247739315,
        0.04253844544291496,
        -0.10647676140069962,
        -0.042317118495702744,
        -0.03226049989461899,
        0.10077166557312012,
        -0.0346471332013607,
        0.03374342992901802,
        -0.08575136214494705,
        -0.05372732877731323,
        0.12675148248672485,
        0.02917560376226902,
        0.024127807468175888,
        0.010338082909584045,
        -0.034015901386737823,
        -0.023038001731038094,
        0.0675683543086052,
        -0.07092732936143875,
        0.06592822074890137,
        0.07125315070152283,
        -0.053412191569805145,
        0.02624891698360443,
        0.00016195110219996423,
        -0.03239186853170395,
        -0.04601411521434784,
        0.09439785778522491,
        0.004106605891138315,
        -0.003596175229176879,
        0.01711556874215603,
        -0.026031287387013435,
        -0.05345626920461655,
        0.06383918970823288,
        -0.06723526865243912,
        0.03979872167110443,
        -0.017652319744229317,
        0.09705981612205505,
        0.026654470711946487,
        0.005607317667454481,
        -0.06039123237133026,
        0.04019038379192352,
        0.06182456761598587,
        0.011054983362555504,
        -0.037715841084718704,
        0.0017297499580308795,
        -0.08745396137237549,
        0.01139121875166893,
        0.10633286833763123,
        -0.06068719923496246,
        -0.029818769544363022,
        -0.05145670101046562,
        0.029729336500167847,
        0.12270981073379517,
        0.026551367715001106,
        0.05352792888879776,
        0.013986547477543354,
        -0.046034086495637894,
        0.06373187154531479,
        0.04173335060477257,
        -0.0542302280664444,
        0.04032357782125473,
        0.0770290344953537
    ]
}