{
    "id": "6aGs5X1h0Sc",
    "title": "Handheld Gaming MYSTERY TECH! What is it?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2022-08-27T15:08:09Z",
    "video_url": "https://www.youtube.com/watch?v=6aGs5X1h0Sc",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "tech",
        "unboxing",
        "austin",
        "austin evans",
        "snap",
        "snapchat",
        "pixy",
        "pixi",
        "pixie",
        "drone",
        "budi",
        "z flip",
        "samsung",
        "flip",
        "flip 4",
        "z flip 4",
        "ayaneo",
        "ayaneo air",
        "this is",
        "denki"
    ],
    "views": 997914,
    "likes": 28945,
    "comments_count": 729,
    "description": "Ken's EDC tech on @Denki:   Amazon is DONE on @thisis:   Snap Pixy:  Ayaneo Air:  Transparent Speaker:  Budi Stick on Amazon:  Samsung Galaxy Z Flip 4 on Amazon:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  Subscribe for more!  TikTok:  Instagram:  Twitter:   Chapter titles: 0:00 Snap Pixy drone 2:20 Ayaneo Air 6:09 Transparent Speaker 9:05 Budi Stick 10:12 Samsung Z Flip 4",
    "description_links": [
        "https://www.youtube.com/watch?v=Ll-AgIPZU28",
        "https://www.youtube.com/watch?v=gH2QUDukjzI",
        "https://austin.tech/pixy",
        "https://austin.tech/ayaneoair",
        "https://austin.tech/transparent",
        "https://austin.tech/budi",
        "https://austin.tech/zflip4",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Wow. You want me to do something with this? - [Jared] Yeah, I mean, your job, preferably. - [Matt] You picked the wrong day to be the unboxing man. - That's Lew. I'm the unboxing boy. - Yeah, yeah. - That's accurate. - [Austin] Is this a drone? - [Jared] Not just any drone! - Oh, is it the Snap drone? - Yes, it is. - Oh, this is some stupid, stupid (censored). All right, I'm about it. Okay, so Snap, the company formerly known as Snapchat- - Oh. - Have created the Pixy. I'm gonna be real, I don't remember my Snapchat login. I don't use it anymore. I'm not 20 years old like a baby. - [Ken] Jared, Joanna, do you guys use Snapchat? - [Joanna] I use it every day. - Oh! (laughs) - [Matt] Joanna, we no longer have things to talk about. - I still feel like Snapchat keeps making hardware because they keep trying to pitch themselves as not a social network and it's not working. I'm not gonna lie though, there's a bit of a vibe. - [Matt] I wanna beat you up so bad right now while you're wearing that. - Here, actually, Joanna, why don't you take over? Why don't you set this up? - [Joanna] Set it up? I was just gonna let you use my Snapchat. - You are a certified drone pilot. You have a license and certificate. This is the perfect product for you. You can name it Joanna's Pixy, it's fine. - How about Not Joanna's Pixy? (all laughing) The camera's like right there, I don't know if that's... (drone whirring) - [Matt] That is loud. - [Ken] That's the loudest thing. - Oh. - Okay. A-ha! - I'm gonna walk this way. - I'm not controlling this at all! (all laughing) - Has any of this video come through to your phone? - [Joanna] No. - Technology is terrible. So what is this? This is just regular selfie mode? - This is hover because this is the least dangerous mode we can put it in. - (scoffing) Look at this drone safety. There we go, okay. - Okay, okay. - Okay, so it comes down. - No, I think it's kind of like, supposed to follow you. Yeah. - Or it's following Joanna in this case. - The image quality is- - Bad. - Yeah. - Probably it's okay for Snapchat. - I guess. - No. - Okay. - We need 8K. - I guess not. - We should do an orbit. - Around you? - Let's do an orbit. - Yeah. - Uh-oh, oh, no. - Oh, it has to go pretty- - [Austin] That's pretty far away. Okay, hey. - Oh wait, wait, no, no, it stopped, look. - Okay, okay. - Oh, no, no. - Oh, barely! Oh, let's go. (all laughing) - Well, that was quite the orbit! - Well, now we've all learned how to use Snapchat a little bit. - I've immediately deleted it from my memory. - Okay. - It erased itself. Are you feeling the wave? The wave? - [Matt] That's not the wave. - You can't ride my wave. You're not riding my wave, Matt. - It's this! This! - You get off my wave. Now this, my friends, is an entire care package from our friends over at AYANEO. Now, I will admit, the last time we took a look at an AYANEO, I wasn't a enormous fan, mostly because it was expensive. But they listened to what I said and crafted a product exclusively for me using my feedback and not listening to anyone else. This is my invention and I'm gonna take none of the credit for it. No, this is the AYANEO Air, although there's a lot of stuff in here. This is a nice little care package. Thanks, AYANEO! A letter. Dear Austin, thank you for giving us the idea to create the AYANEO Air. Was such a brilliant idea, and it's really good. - [Matt] Can we confirm that was notarized? - The top line of it says, dear media friends, before- - No, no, no, it said Austin, it said Austin! - [Ken] It doesn't even have your name on it, dude! - This is what I'm really excited for. This is the AYANEO Air. - Wow, that really does look like a Switch Lite. - And this is the mid spec model, so this is the Ryzen 5 5560U with 16 gigs of RAM and 512 gigs of storage. This is actually relatively competitive with the Steam Deck, though. 16 gigs of RAM just like the Steam Deck. You're gonna lose a little bit of graphics on something like this, but keep in mind, it is gonna be significantly smaller. This starts at $550, which to be fair, is still more expensive than the Steam Deck, but keep in mind, this is a full Windows 11 system with a 1080p OLED. Oh, look how tiny it is! Look how tiny it is! Oh. - That's paper. - I was gonna say, that's the instruction manual. No (censored), Sherlock. - Look how tiny it is! Look how little it is! - [Ken] Oh, that's pretty small. - It's so little! - Oh, wow! - I like the finish. If you see, it goes from like, it's kinda like teal color over to pink in a really nice, smooth gradient. Ooh, look at that OLED. Oh, dude, this feels nice. This feels nice. Mmm, mmm! Purely on size, I'm gonna give a huge W to the AYANEO just because for me, this (censored), I might as well carry around an XPS 17 Alienware Big Chungus edition. I like the Steam Deck, but man, this thing is huge. The AYANEO, it's small. Look, look. - No, no. - I'ma do it, I'ma do it, watch, watch. - No. I hope you like stick drift, 'cause you're gonna get it now. - [Jared] No, except you won't because these use- - Hall sensors! And it's an OLED screen! One of my biggest complaints with the Steam Deck is the fact that it's got a pretty mid screen. I mean, it's 1200 by 800, which is a fine resolution, but the screen itself, it's just not great quality, especially when you look at it compared to something like a Switch OLED. And this is going to have, as far as I know, a fairly, I mean, it's a 1080p OLED, so it should be pretty damn solid. - Here's the thing, like, you say that, but the Steam Deck having a lower resolution actually just makes everything better. - No, but you can run this at 720p. I would run it at 720p, but for some very low, like, you know, graphics games, I'll run it at 1080p, and even from running at 720p, I've got the OLED quality as opposed to the crappy LCD. - [Matt] Playing a lot of games on the Steam Deck, I would have never called that screen crappy. - [Ken] Yeah, like, I've never complained about it ever. - I actually think this is too small. - [Austin] (scoffs) You're too small. - Like, where my thumbs wanna place are not... I feel like I'm cramping my hands in. - Yeah, I don't like where the stick is. - Yeah, yeah, yeah. - It needs to be up here. I'll say, though, this is very ergonomic, and the materials feel nice. This doesn't feel overtly plasticky like every other AYANEO or GPD product that I've ever tried. I don't think it's benefiting, like, a ton by being this small. I think you can get some decent, like, thermal gains, and like, you know, ergonomics, just by being 15% bigger. - Ken, here's the thing, right? As much as it pains me to say this, let you borrow it briefly to make a Denki video. - It's perfect for my one way flight to Japan. - [Matt] You're never gonna see that thing again. You know better than this. - I can see the next item. It's called Transparent. Like me, 'cause you can't see me! - Ugh. - This is where everyone laughs 'cause it's funny. - [Matt] What is the opposite of a laugh track? - A boo track? (laughs) Look, I see the name of this thing! You literally haven't even thrown it, it's literally in front of me, it says Transparent Speaker. Can I have the item yet? - [Ken] You know who also has a lot in common with the speaker? - Who? - [Ken] John Cena! (upbeat music) - [Matt] 'Cause you can't see him. - [Ken] Time is now. - What are you guys talking about? - [Ken] He doesn't know. - That John Cena's invisible? - You can't see me. - Oh, that's right. - He's saying, oh, he still has no idea. - [Bell Ringer] Shame! (bell ringing) - So this is the Transparent Speaker. Does anyone know anything about this thing? - [Jared] It's a very high end speaker. - Hold on, no, no, no. This is a very high end speaker that cost over $1,000 that we've unboxed on Mystery Tech in the past. - This one may or may not also cost more than $1,000. - [Ken] Oh. - Without any further ado, as the kids say, the Transparent Speaker. - [Matt] Oh, wow! I can't even see it! - [Ken] Wait, it comes with gloves? (laughs) Yo? - This means it's fancy. Oh, no. This is a lot of assembly instructions. Can I not just turn it on? - [Ken] That looks like an Ikea manual. - [Jared] To be fair, this company is Swedish, so. - [Ken] Oh! Yeah, they love their paper. - Behold, my friends, the Transparent Speaker. - [Ken] Oh. Well, it's the wrong way, but... - [Matt] I gotta be honest with you, after all that, that was really disappointing. (all laughing) - This looks super cool. So you've got a couple of speakers, as well as, I assume, a sub. - [Matt] Looks like Mickey Mouse, got it. - [Jared] Is that a hidden Mickey? - [Matt] It's a hidden Mickey. - So you've got this little box which has all of your actual electronics in it. So if I flip it around to the back, what you'll see is it's very, very neatly managed. - Hold on. So, does Chromecast, does Bluetooth, does Apple TV, so AirPlay 2. - AirPlay. - The cool thing is that you can actually wall mount this, so I believe- - Wow, imagine this on the wall. How sick would that be? - It'd be sick, right? Oh, that's the switch. - Ooh. - Oh, that's kinda nice. (upbeat electronic music) - Wait, we need more bass. - [Ken] Oh, whoa, okay. There's a lot of leeway there. (smooth electronic music) Oh! - So, this sounds good. How much, Jared, does this speaker cost? - [Jared] This costs $1,100. - Okay, so it does not sound $1,100 good. This is something that you're buying for the aesthetic and for the very good audio quality. I think you could probably spend 4, 500 bucks and get a speaker that is gonna sound similar. And especially if you have this in like a stereo pair of a couple of these, I think it's gonna look phenomenal, right? And that's really, I think, what you buy this for. (upbeat music) That was an aggressive throw. This is Budi, a multifunctional cable stick. - [Matt] Yeah, you know how I love to be super extra prepared in my backpack, that I have everything? - Yeah, yeah. This is cool. How much is this? - [Matt] 15 bucks. - All right. This is looking very promising, very promising. - [Ken] Nice JUUL, dude. - Vaping isn't cool, kids. Don't do drugs. All right. On one side, I have a bunch of microSD card slots, nano SIMS. Matt, how often do you carry extra SIM cards? That sounds a little sus. - [Matt] I have our Google 5 SIM. I have an AT&T SIM. - Sounds like you've been watching too much \"Better Call Saul\". - You gave me these SIMs. - Never mind. I have nothing to do with this. So I plug it into my S22, a little red light has appeared, and it shows as charging the device. The cable's good for 65 watts as well, which is enough to charge something like a laptop. Actually is really easy to put the cable back in, too. That was one of the things I figured this would be a huge pain for. Good product, Austin like. Today, we are looking at spicy things. This, my friends, is as spicy as it gets. Now, as the official president of the Samsung Galaxy Z Flip Owners Fan Club, I have had my fair share of Z Flip shenanigans and issues. But today, it's all fixed. This is my first time actually touching the Z Flip 4. I touched it. - [Ken] The Bora Purple this year looking pretty nice. - [Austin] It does look nice. - [Matt] You're telling me that those are two different phones. - Look, I am looking at these. - [Matt] You're telling me that that is two different models of phone. - There are subtle differences. The camera bumps are significantly more pronounced on the 4 compared to the 3. The bezel is a little bit smaller, and the actual crease is ever so slightly shrunken down. Honestly, if you do not have the Flip 3 and the Flip 4 side by side, you are going to notice almost none of these differences. But as the president, CEO, and treasurer of the Z Flip Fan Club, I will be remiss in my duties to not inform you of every Flip and Fold difference that could possibly exist. Every Z Flip, from the original one all the way up to the 3, has shared the same kind of mediocre camera from, I think, the Galaxy S10e, whereas the Flip 4 finally gets an upgrade to a more modern camera. It's not quite up to what you would get on the... Where'd the Fold go? Oh, Ken's already unboxed it. Ken's literally already unboxed the Fold over here. - I'm trying to be quiet. All right, well, it's unboxed now. - Let us pixel peep. - [Ken] Neon sign, the dynamic range is definitely better. It's doing less of that HDR thing, so. - You can see the larger sensor. Look how it's like a little bit softer in the background. All right, so let's flip over to portrait. Now, I will say- - Oh! - Samsung portrait mode, low-key, best in the game, right? Even on the Z Flip 3, their algorithm, even with like hair and stuff, I've been incredibly impressed, even with the 3. I immediately like this more. I think the color temperature's a little bit better. Look at the wall, it's a little too blue in the back where it's a little bit more neutral. - [Ken] The 4 did a better job at the cutout, but at least in this photo on the 3, it got it more right, skin tone-wise. - Think the 4 is naturally a little bit of a softer image, which to my eye, looks better and more natural. It's not that sort of slightly over sharp kind of thing. Now, this video actually is probably not live yet, but I'm gonna give you a little sneak peek. I recently was able to take a look at my Z Flip 3 in an X-ray machine. The hinge, it seems small, right? But when you actually have it open, the hinge is, like, that wide. Like, it is a massive, massive chunk of this phone. I know hinges always kind of work in, but it does feel very firm. in fact, so much so that like, I can tell, you've got a lot more angles where it will hold, whereas I know on the Z Flip 3, once you start to open it up at a certain level, like, you do it here, it's just gonna close, right? But the Z Flip 4, I mean, it'll stay in almost every orientation you want, which is neat. When I'm trying to watch a video in bed, I can get it at just the right angle. - [Matt] What videos are you watching in bed? - Nothing but This Is videos, Matt. - [Matt] Good answer.",
    "transcript_keywords": [
        "Steam Deck",
        "flip",
        "Yeah",
        "AYANEO",
        "Transparent Speaker",
        "Snapchat",
        "Speaker",
        "AYANEO Air",
        "thing",
        "Steam",
        "Deck",
        "Joanna",
        "nice",
        "OLED",
        "bit",
        "Joanna Pixy",
        "Transparent",
        "good",
        "wave",
        "small"
    ],
    "transcript_entity_values": [
        "Ken] Wait",
        "The Bora Purple",
        "more than $1,000",
        "65 watts",
        "first",
        "Matt] Joanna",
        "15 bucks",
        "Transparent Speaker",
        "two",
        "Matt",
        "John Cena",
        "Japan",
        "one",
        "1,100",
        "a ton",
        "Flip",
        "the Steam Deck",
        "20 years old",
        "AYANEO",
        "Apple TV",
        "Mickey",
        "Transparent",
        "Ken] Neon",
        "Better Call Saul",
        "Ken",
        "Austin",
        "John Cena's",
        "Budi",
        "Alienware Big Chungus",
        "Bluetooth",
        "15%",
        "Fold",
        "Joanna",
        "16",
        "nano SIMS",
        "Yo",
        "Denki",
        "the Transparent Speaker",
        "today",
        "1200",
        "Lew",
        "Switch Lite",
        "550",
        "GPD",
        "the Z Flip Fan Club",
        "over $1,000",
        "1080p",
        "LCD",
        "Mickey Mouse",
        "the AYANEO Air",
        "Ken] Jared",
        "AT&T",
        "the Galaxy S10e",
        "the Samsung Galaxy Z Flip Owners Fan Club",
        "One",
        "Mystery Tech",
        "Snapchat",
        "this year",
        "Jared",
        "500 bucks",
        "Swedish",
        "RAM",
        "800",
        "Samsung",
        "Windows 11",
        "Chromecast",
        "512",
        "4",
        "Austin",
        "Ikea",
        "Today",
        "AYANEO",
        "AirPlay 2",
        "microSD",
        "Ken] Time",
        "XPS 17",
        "3"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "ORDINAL",
        "PERSON",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "GPE",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "PERCENT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "MONEY",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "CARDINAL"
    ],
    "vector": [
        -0.10127058625221252,
        0.05098181962966919,
        0.03613897040486336,
        -0.15919849276542664,
        0.015848930925130844,
        -0.04777521267533302,
        0.10492944717407227,
        -0.09914998710155487,
        0.02848377451300621,
        0.03044421784579754,
        0.032126132398843765,
        0.015797195956110954,
        0.020879272371530533,
        -0.041503969579935074,
        0.004051222000271082,
        -0.01917177066206932,
        0.09696630388498306,
        -0.031239278614521027,
        -0.0549306645989418,
        0.07083650678396225,
        -0.004392239730805159,
        0.06526386737823486,
        0.014944731257855892,
        -0.03459061309695244,
        -0.028056729584932327,
        0.04242837429046631,
        0.010139846242964268,
        -0.005766493733972311,
        -0.08257364481687546,
        -0.049547191709280014,
        0.048443764448165894,
        0.11824482679367065,
        -0.03305710852146149,
        0.010097038000822067,
        -0.0042007360607385635,
        -0.01208083238452673,
        -0.011182518675923347,
        -0.011201664805412292,
        0.020110763609409332,
        -0.0442345105111599,
        -0.0012921023881062865,
        -0.07536175847053528,
        0.0551871694624424,
        -0.009693028405308723,
        -0.0137841971591115,
        0.037486862391233444,
        -0.02620699815452099,
        -0.052481718361377716,
        0.036430757492780685,
        -0.03579135239124298,
        -0.06318610161542892,
        -0.05905166640877724,
        0.11881498992443085,
        0.05931304395198822,
        0.02757471427321434,
        0.002986519131809473,
        0.06246764212846756,
        0.021116752177476883,
        0.06867819279432297,
        0.020881302654743195,
        -0.011262482032179832,
        -0.0002620800514705479,
        0.00991068035364151,
        0.0735347792506218,
        -0.017650946974754333,
        0.0029891659505665302,
        -0.013031973503530025,
        -0.015833783894777298,
        0.0028436232823878527,
        0.009613136760890484,
        0.01167156919836998,
        0.018281757831573486,
        0.05956293269991875,
        0.06661677360534668,
        0.0974491760134697,
        0.010712259449064732,
        0.06662164628505707,
        -0.04646715149283409,
        -0.012871835380792618,
        0.03267316520214081,
        0.038325075060129166,
        -0.11149147152900696,
        -0.08704710006713867,
        -0.038643643260002136,
        -0.0027678338810801506,
        0.0008879727101884782,
        0.01395039539784193,
        0.07600770890712738,
        -0.024693790823221207,
        0.0072537194937467575,
        -0.14188426733016968,
        0.018041839823126793,
        0.0681520625948906,
        0.011526420712471008,
        0.04756764695048332,
        -0.09142085164785385,
        -0.029722444713115692,
        -0.06614673882722855,
        -0.07262704521417618,
        0.09742973744869232,
        0.05783099681138992,
        -0.009731647558510303,
        0.07174286246299744,
        -0.0810374915599823,
        -0.024829719215631485,
        -0.050277091562747955,
        -0.032045286148786545,
        0.0398658849298954,
        0.00556511664763093,
        0.0033643213100731373,
        -0.055264685302972794,
        -0.03565134108066559,
        -0.033971045166254044,
        -0.007439624983817339,
        -0.00933249294757843,
        0.05324510112404823,
        -0.029200026765465736,
        0.034552786499261856,
        -0.005870362743735313,
        -0.005842383950948715,
        0.042844049632549286,
        -0.00569591298699379,
        -0.025010274723172188,
        0.05730132758617401,
        0.06886862218379974,
        0.02321222424507141,
        -0.06881891936063766,
        1.8481959723352965e-33,
        0.0323282927274704,
        0.07133761793375015,
        -0.01725774072110653,
        0.011483978480100632,
        0.027716413140296936,
        -0.012341899797320366,
        -0.027667157351970673,
        0.028614910319447517,
        -0.01743241399526596,
        0.030646957457065582,
        -0.038531530648469925,
        0.05451250448822975,
        -0.060538358986377716,
        0.0687248632311821,
        0.00978195108473301,
        -0.08638081699609756,
        -0.09328817576169968,
        -0.039971042424440384,
        -0.006729884538799524,
        -0.012465153820812702,
        0.030375149101018906,
        0.010794264264404774,
        -0.013946431688964367,
        -0.01897774077951908,
        0.05925524979829788,
        0.0395539291203022,
        -0.02154071256518364,
        -0.08238586038351059,
        0.11652049422264099,
        0.05947078391909599,
        -0.09363192319869995,
        -0.001197833800688386,
        0.005736248567700386,
        -0.049182165414094925,
        0.05701803043484688,
        -0.032433535903692245,
        -0.02289930358529091,
        -0.09840574860572815,
        -0.046483371406793594,
        0.005392994731664658,
        0.014888858422636986,
        -0.029619349166750908,
        -0.09551198035478592,
        -0.021323109045624733,
        -0.04528122767806053,
        -0.029371347278356552,
        -0.01062930840998888,
        -0.045272089540958405,
        0.0024248752743005753,
        0.04755345731973648,
        0.013262299820780754,
        0.019594093784689903,
        0.040022630244493484,
        -0.07144460827112198,
        -0.036361899226903915,
        -0.08772459626197815,
        0.03736435994505882,
        0.01308060809969902,
        0.010707002133131027,
        -0.06666810810565948,
        0.05665998533368111,
        0.017866911366581917,
        -0.022839266806840897,
        0.02318163774907589,
        -0.04059227928519249,
        0.030786463990807533,
        0.018975500017404556,
        0.036515913903713226,
        0.02706562913954258,
        0.010661112144589424,
        -0.04503827169537544,
        -0.005265792831778526,
        0.004353546537458897,
        -0.025608690455555916,
        -0.03054853528738022,
        0.0487574078142643,
        -0.07720132172107697,
        0.017451943829655647,
        0.008579010143876076,
        0.02956351637840271,
        -0.018341226503252983,
        0.03560376912355423,
        -0.041771985590457916,
        -0.030346954241394997,
        -0.11796601861715317,
        -0.1001264825463295,
        -0.010300207883119583,
        -0.05764945223927498,
        -0.013249237090349197,
        0.049650613218545914,
        -0.08657538890838623,
        0.01866530068218708,
        -0.09928469359874725,
        0.03929242119193077,
        -0.004052315838634968,
        -4.5802208004569314e-33,
        -0.0719030424952507,
        0.012071884237229824,
        -0.048558883368968964,
        0.0899030938744545,
        0.03754598647356033,
        -0.060071203857660294,
        0.09986448287963867,
        0.05272490158677101,
        -0.008904426358640194,
        -0.06607675552368164,
        -0.07985986769199371,
        0.012111949734389782,
        -0.020153624936938286,
        -0.052386123687028885,
        0.06100395321846008,
        -0.030302857980132103,
        -0.007690820377320051,
        -0.049932945519685745,
        0.002814939711242914,
        0.10111281275749207,
        0.036452632397413254,
        -0.02802995592355728,
        0.045375049114227295,
        -0.013232400640845299,
        -0.02813749760389328,
        0.04258565232157707,
        0.07287720590829849,
        0.015301612205803394,
        0.07857366651296616,
        0.009212001226842403,
        0.017361940816044807,
        -0.02006596326828003,
        0.007701392751187086,
        0.04129026457667351,
        0.004459955729544163,
        0.05890006199479103,
        0.028528200462460518,
        0.00978738721460104,
        -0.01624324358999729,
        -0.156769260764122,
        0.04467904195189476,
        0.013858253136277199,
        -0.06873372197151184,
        -0.023277973756194115,
        -0.02236127480864525,
        0.0003423843008931726,
        -0.06783711165189743,
        0.077979676425457,
        -0.08505799621343613,
        -0.003297111950814724,
        0.008375394158065319,
        0.014996609650552273,
        0.029552681371569633,
        -0.07041589170694351,
        -0.04010903835296631,
        0.02330048941075802,
        -0.000612439529504627,
        -0.0077398368157446384,
        0.08915330469608307,
        0.022897204384207726,
        0.10520459711551666,
        -0.019218983128666878,
        -0.08057788759469986,
        -0.08038745075464249,
        -0.041235994547605515,
        0.030178602784872055,
        0.05896662175655365,
        0.06431760638952255,
        -0.021450990810990334,
        -0.021751174703240395,
        0.056803081184625626,
        0.0018599898321554065,
        -0.06387730687856674,
        -0.11681412905454636,
        -0.03585052490234375,
        0.08601070940494537,
        -0.03780703991651535,
        -0.060144029557704926,
        -0.0018817769596353173,
        -0.05278950184583664,
        -0.006180897355079651,
        -0.016864562407135963,
        0.021099381148815155,
        0.06658577919006348,
        0.038052648305892944,
        0.08970170468091965,
        -0.032976437360048294,
        0.03287849947810173,
        -0.07034723460674286,
        0.004873619414865971,
        -0.000740260467864573,
        0.07321901619434357,
        -0.0017322746571153402,
        0.07212921231985092,
        -0.018696928396821022,
        -6.34525463283353e-08,
        0.02430158294737339,
        0.007140312809497118,
        0.010148010216653347,
        -0.0336228683590889,
        -0.016376053914427757,
        -0.02136627957224846,
        0.04377582669258118,
        -0.0888342559337616,
        0.07218794524669647,
        -0.056662965565919876,
        0.06461041420698166,
        -0.12170544266700745,
        -0.009203135035932064,
        0.03907614201307297,
        0.12250237166881561,
        0.05894852057099342,
        -0.11917217075824738,
        0.0005536499666050076,
        -0.04646395891904831,
        -0.004429315682500601,
        -0.014777212403714657,
        0.056156132370233536,
        0.009942430071532726,
        -0.02603479102253914,
        -0.08027627319097519,
        0.03564809262752533,
        -0.04215284809470177,
        0.024627842009067535,
        0.011488319374620914,
        0.012361194007098675,
        -0.04586748406291008,
        0.018683606758713722,
        -0.07637839764356613,
        -0.03649027645587921,
        -0.042757291346788406,
        0.021305212751030922,
        -0.03328574448823929,
        -0.023974241688847542,
        0.09074728935956955,
        0.03685136139392853,
        0.0007942809606902301,
        -0.026925668120384216,
        -0.06851401180028915,
        0.023448405787348747,
        -0.04110734909772873,
        -0.02285982295870781,
        0.0293791014701128,
        -0.14854882657527924,
        -0.012799764983355999,
        0.04466314986348152,
        0.009231602773070335,
        -0.029652172699570656,
        -0.02857709489762783,
        0.024800462648272514,
        0.08608907461166382,
        0.040486034005880356,
        0.005035465583205223,
        -0.0377994067966938,
        -0.019000083208084106,
        0.061553578823804855,
        0.07364460080862045,
        0.019409501925110817,
        -0.023109454661607742,
        0.07955124229192734
    ]
}