{
    "id": "6bkiCXa_rP4",
    "title": "This CAR is a GAMING PC",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-10-03T16:11:04Z",
    "video_url": "https://www.youtube.com/watch?v=6bkiCXa_rP4",
    "category": "Science & Technology",
    "tags": [
        "gaming pc",
        "gaming computer",
        "fastest gaming pc",
        "fastest gaming computer",
        "pc build",
        "car",
        "scion",
        "scion iq",
        "gaming pc car",
        "car gaming pc",
        "car pc build",
        "ryzen",
        "micro center",
        "microcenter",
        "amd",
        "nvidia",
        "toyota iq",
        "iq",
        "ken",
        "ken bolido",
        "audio xcellence",
        "custom",
        "build",
        "stereo",
        "tutorial",
        "how to",
        "this is",
        "the test drivers",
        "test drivers",
        "austin evans"
    ],
    "views": 2621824,
    "likes": 91694,
    "comments_count": 3687,
    "description": "No this isn't clickbait. We built the world's \"FASTEST\" gaming PC. Free 32GB Flash Drive & 32GB Micro SD Card:  Get the best prices and best selection at Micro Center:  Micro Center Custom PC Builder:  Join the Micro Center Community:   AMD Ryzen 7 3700X:  MSI B550I MPG Gaming Edge WiFi mini ITX Motherboard:  MSI GeForce GTX 1660 Super Ventus XS Overclocked:  G.Skill Trident Z RGB 32GB (2 x 16GB) DDR4-3200 PC4-25600 CL16:  Samsung 970 EVO+ 1TB SSD:  Seasonic USA Focus Plus 850 Watt 80 Plus Gold Power Supply:  Inland DisplayPort Male to HDMI Female 4K Adapter:  Micro Center TV/Monitors:   Check out Sam from Audio Xcellence:   My new podcast The Test Drivers!  Our second channel @thisis!  My Twitch channel:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://rebrand.ly/skuft0m",
        "https://rebrand.ly/btuiot3",
        "https://rebrand.ly/e5u8i7r",
        "https://rebrand.ly/higbw3l",
        "https://rebrand.ly/0q0vls6",
        "https://rebrand.ly/crl03kd",
        "https://rebrand.ly/umfpaln",
        "https://rebrand.ly/uxt8dh0",
        "https://rebrand.ly/4bd83ej",
        "https://rebrand.ly/yxpgmpq",
        "https://rebrand.ly/ej9ct5j",
        "https://rebrand.ly/6tyyipy",
        "https://www.facebook.com/Audio-Xcellence-inc-125314100879181/",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Today we are quite literally building the world's fastest gaming PC. At least if you measure it in miles per hour, instead of gigahertz. So you may have seen our recent episode of Mystery Tech, that Ken purchased this, a 2012 Scion IQ. The iQ was one of these smallest cars ever sold in America, which is interesting because actually still has four full seats. And mind you that backseat is pretty small, but all I want to do is remove the backseat, build a TV into the back, as well as build a shelf with a gaming PC, and then there's the car to deal with. So the interior is not amazing, and the exterior needs some serious work. So I want to put on new wheels, tires, springs, and really try to get this thing to now look great on the inside, but also look great in the outside. So we're doing this because our wonderful sponsor Micro Center has asked for us to build the project, as an actual showpiece for their Tustin, California location. So that means that on top of building the car in front of Micro Center, it is going to be housed inside Micro Center for four or five days. All right here comes tunnel. You ready for the tunnel? (car accelerating) Yeah, woo! - The Scion IQ might be a really small car, might not have a lot of power, but I genuinely think it has some charm to it. I do kind of wanna take it home. Can I take a car home? I'll try, I'll try. - So the thing is, Ken and I can handle a lot of the car build stuff, right? What we're not good at, is doing a full custom interior redesign. And that's why I wanted to go to my friend Sam, at Audio Xcellence shop, where he does this stuff all day long. He builds cars for SEMA. He does completely crazy stuff with fiberglass, with Alcantara, stereos, all the electrical wiring for the car battery and everything. Really, we could do this, but it would be like a TV on a couple of pegs in the back seat. Instead, I trust Sam to make this thing look like a proper show car, at least on the inside. The outside's up to us. Oh, what happened? Yo dude, look at this. Oh my God. That is so sick. So obviously instead of having a back seat now, he's completely customized it. So essentially we have a, what is this? A 40 inch TV. Wait, is this Holy? That's our inverter. So this thing is indeed capable of thousands of Watts of power, especially when you look at the battery size. Oh dude, look at this. Look at, wait, wait, can you see the size of that sub right there? Look at the size of the sub. We have two more of the speakers by here, and we still have our cup holders. Also, can you see the new headliner? So it's all this like kind of Alcantara feel. So the gaming PC will be built right about here. So, all right. I think we now have to move on to the part of the build where we have to work, and that is upgrading the computer, I mean the car, well and building the computer too. But mostly building the rest of the car stuff oh dude, this is going to be so cool. Now you might be wondering who is crazy enough, to allow us to build a gaming PC in a car, and that will be fine sponsor Micro Center, the ultimate place to build a gaming PC. Even if you want to build it inside a car. With 25 locations throughout the United States, Micro Center has you covered on the PC build side, including with their online custom PC builder, where you can get all the different parts you need, reserve them and pick them up same day at a local Micro Center. On top of that they also have right now a coupon code, which I'll have linked in the description of this video. Where you can get your hands on a free 32 gig micro SD card, as well as a free 32 gig USB drive. So the Scion needs a fair bit of work. Now with 1.3 liters and 90 horsepower, we're not exactly going to make this fast in a straight line. So we're going to go down from 16 to 15 inch wheels, to get a little bit more of a drop, and we're going to go much wider on the tire to go for a little bit more of an aggressive stance. On top of the springs, we're also going to be installing new front brakes, because the current discs are super warped, totally useless. Here goes nothing. Okay. I'm like so used to picking up like a huge ass wheel. That is actually not that bad. That's not bad at all. So much better. - Austin gave me the impression that he knew what he was doing when we were going to take off the suspension, and rebuild it and upgraded and what not. But I don't think he accounted for the fact that the Scion IQ is not exactly a normal car, and because it's not a normal car, it requires a few extra steps in order to get this done. - Look, I've worked on cars before. Ken and I have worked on things. I've done coils, I've done springs, we've done stuff. But, the IQ was such a small car. Everything is so crammed. There's no space to work on anything. Installing a pair of springs or a set of springs, should be what, two, three hours tops. But we have spent hours and hours and hours just trying to get things out. Just trying to get access to loosen bolts. I mean, the IQ does not make this easy for us at all. Are you tired of hammering on this thing yet? - Yeah, quite a bit. (Austin laughs) - You're like, I'm done why did I sign up for this. This has been all day, so bad, it's so bad. So now that we're done building the car. The next step is to build the gaming PC and the back. And so what better place to do that, then right in front of the Tustin Micro Center location. Now they've very thankfully given us a little bit of shade and a little area to build it in, but this is definitely my first time building a PC, on the sidewalk. So, you know, we'll see how that goes. So, in no particular order, we are using the MSI B550I Gaming Edge WiFi board. So we have 32 gigs of Trident Z RGB memory. We also have what is ultimately a very overkill power supply. This is a Seasonic Focus GX 850. We do have a 1TB Samsung 970 EVO +. Now, the pice de rsistance, sorry for using the accent, is the Ryzen 7 3700X. Ultimately I chose this for a few different reasons. First of all, obviously Ryzen Third Gen is excellent. And while I'm sure we'll have Ryzen Fourth Gen at some point we'll upgrade, but importantly this is actually a pretty power efficient processor. So it's easy to think, you know, you're gaming on a PC. You can pull as much power as you want. Mom's paying that electric bill so whatever, but we're running on a battery, right? So we can turn the car on and it will charge that battery. But generally speaking, this is going to be running with the engine off, which means that we're essentially running off of a big truck battery which is built into the back. So power efficiency actually matters, right? If we have a slightly more power-efficient processor, like the Ryzen 7, if we have a graphics card, which is a little bit less powerful like a 1660 Super. It can be the difference between gaming for four hours, and gaming for 12 hours on that battery, without having to fire up the car, let it run for a while, put it on a tender, something like that. So, now it's time, to put together a PC, and hope that it works. That's always the key, hope because if you don't have hope, something something bad. Hey, sup dude! Alright, let's build this thing. So this board is brand new, so it should be on sale by the time you're watching this video. But actually it was picked up by MSI HQ like an hour ago. So it is hot off the presses. Yeah, can I just say something, AMD, thank you very much for including legitimately really nice coolers, with your processors. This is actually like, I legit always use these things, 'cause they're like, they're totally fine. Especially for a build like this, - They're more than enough. - They're absolutely more than enough. And especially because you got like RGB and stuff. - It covers the aesthetic part? - Exactly. All right. So we have the build mostly assembled short of the power supply. So let's see how this fits. I'm going to do this very carefully. Oh, the power, oh the graphics card though. So I'm actually going to plug the HDMI in right now, oh, this is so, oh, it's so tight. Ooh. Oh, oh that's close. That's close, that's close. Come on, come on, come on, come on. - You're literally up against - I know, I'm like, you're not gonna tell me, that a quarter inch of clearance is gonna keep me from putting this card in. - No, I have a solution. - What's your solution? - I have a solution. - What's your solution? - Here, here. I got it. I got it. Got it. - All right, fix it. Fix this for me. - You see part of the cable was bendable. - Yeah. - Then we could do it. The problem is that our tolerance is so thin, that this rigid part, is what's stopping us from plugging in this HDMI. If we had an HDMI to DisplayPort adapter, this would work. - Well luckily, we happen to be right in front of Micro Center, the fine purveyor of many wonderful electronic gizmos and gadgets, such as exactly what you're talking about. - If building a gaming PC in the back of a car, in a parking lot sounds like something that you might be interested in, then there's the wonderful Micro Center community site, which is available of course at the link in the description, where you can hang out with tons of other people who are interested in gaming PCs, get some tips on the latest and greatest in tech. And of course you can, I don't know, maybe find someone to talk you out of doing what I'm doing right now. - Mr. Evans. - Why hello there - Here. - So I plug this into the bottom? - Maybe the second to the bottom. - All right, feed, feed, feed, feed. Oh, you smart, smart person. - Am telling you, am telling you man, look. - Ken Bolido, certified genius. This is why Micro Center sponsors me. So we're ready to attempt to test boot. So we had determined, that we don't quite have the clearance we thought, so we can't actually plug into anything, into our USB or a motherboard on the side, or our WiFi. But, if everything is working, I can flip a switch, and theoretically this system will turn on. So let's see what happens. I'm gonna turn it on from the back of the car, front panel, front panel, oh, where art thou front panel. - You know what would be great right now. - Yeah? - A power button. - You know we can go, yes. I know, there's lots of things we should have thought about that we haven't thought about. I'm well aware. Woo! Woohoo! It works, it works. Fans are on. It's actually really quite quiet. If I can get it to post, I will feel great about my life, but oh, oh yes. (laughing) Yes, yes, it works, it works! Ah, ah, that's a beautiful, beautiful thing. So now with some more creative modifications, we are going to be able to start playing some games, inside our Scion IQ. Oh dude, that is so cool. I'm so happy right now. I'm so happy. It actually works. - In all fairness to Austin, while the process of building the PC was very jank, the actual car came out really well. I do like how the PC is situated, even though it might not be perfect, it's not enclosed in anything, it's just kind of sitting there, and we can play games out of it, which is really impressive. - Yeah, I took the wrong route. - You still catch up. That's okay. I got this, there you go. Whoa. Oh, oh, oh, oh, okay. - I'm surprised at how usable this is, right? So obviously you are playing outside. So the screen is bright enough, and the audio is great. But importantly, tethering with the Z Flip actually, I mean, I'm sure there's a little bit of latency involved, but it's really not bad. - The ping is good enough for Fall Guys. And we're getting 50 megabits per second, which was enough to download the game. I mean, granted it's small, but I was in about a minute. - Where's my, where's my nitro. Where's my nitro, no. - All right, this is about to be Germany versus Brazil right here, - Too soon. -At least one. No, no, no time. Well, ah, wait, wait. that counted, that counted. So, what can we learn today? Well, of course, thank you to our wonderful sponsor Micro Center for enabling this madness, and thank you very much for watching and subscribing so we can pull off ridiculous projects like this. Stay tuned because there's more like this to come. And by more like this, I mean, no more car builds. I don't want to do another car build. - We're losing in Fall Guys? - I'll lose in Fall Guys a lot. I'll build cars, just not, I don't want to build PCs in cars. Those are the two things that do not go well together. - Can I take it home? - No. - Can I buy it? - Yeah. - Okay I'll buy it. - $50,000.",
    "transcript_keywords": [
        "Micro Center",
        "car",
        "sponsor Micro Center",
        "Micro",
        "build",
        "Center",
        "Tustin Micro Center",
        "gaming",
        "inside Micro Center",
        "world fastest gaming",
        "Micro Center sponsors",
        "wonderful Micro Center",
        "Micro Center location",
        "car build",
        "power",
        "sponsor Micro",
        "cars",
        "thing",
        "building",
        "car build stuff"
    ],
    "transcript_entity_values": [
        "two, three hours",
        "America",
        "miles per hour",
        "micro SD",
        "Gaming Edge WiFi",
        "Ryzen Fourth Gen",
        "Tustin",
        "First",
        "12 hours",
        "50 megabits",
        "first",
        "the Ryzen 7",
        "SEMA",
        "Watts",
        "the United States",
        "Ken",
        "Samsung",
        "USB",
        "Austin",
        "RGB",
        "25",
        "1",
        "two",
        "1660",
        "AMD",
        "Germany",
        "Fall Guys",
        "Brazil",
        "jank",
        "four",
        "HDMI",
        "California",
        "a quarter inch",
        "970",
        "Evans",
        "Austin",
        "TB",
        "Alcantara",
        "second",
        "Scion",
        "32",
        "Ken Bolido",
        "2012",
        "thousands",
        "90",
        "all day long",
        "Sam",
        "hours and hours and hours",
        "Alcantara",
        "50,000",
        "four hours",
        "DisplayPort",
        "16 to 15 inch",
        "all day",
        "Audio Xcellence",
        "Seasonic Focus GX 850",
        "about a minute",
        "Ryzen Third Gen",
        "Yo",
        "40 inch",
        "the Ryzen 7 3700X.",
        "the Tustin Micro Center",
        "1.3 liters",
        "Mystery Tech",
        "an hour ago",
        "MSI",
        "today",
        "Trident Z RGB",
        "four or five days",
        "Micro Center"
    ],
    "transcript_entity_types": [
        "TIME",
        "GPE",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "ORDINAL",
        "TIME",
        "QUANTITY",
        "ORDINAL",
        "FAC",
        "ORG",
        "LOC",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "WORK_OF_ART",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "GPE",
        "ORG",
        "LOC",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "TIME",
        "PRODUCT",
        "MONEY",
        "TIME",
        "ORG",
        "QUANTITY",
        "DATE",
        "FAC",
        "ORG",
        "TIME",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "EVENT",
        "ORG",
        "QUANTITY",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG"
    ],
    "vector": [
        0.02321259304881096,
        0.03378717601299286,
        -0.03228801116347313,
        -0.0021073955576866865,
        0.05073319375514984,
        -0.029194021597504616,
        0.039096649736166,
        -0.01055928599089384,
        -0.04485279321670532,
        0.003880094736814499,
        -0.021190710365772247,
        -0.04683488979935646,
        -0.012972590513527393,
        0.02520866133272648,
        -0.03023388609290123,
        0.03574758395552635,
        0.1326950639486313,
        -0.03172360733151436,
        -0.056004684418439865,
        0.04342798888683319,
        0.006879828870296478,
        -0.07968003302812576,
        0.011060542427003384,
        -0.005619318690150976,
        -0.006585299968719482,
        0.013382486067712307,
        0.00022001304023433477,
        0.049900759011507034,
        -0.009547964669764042,
        -0.05657472461462021,
        -0.0065964641980826855,
        0.04341498762369156,
        0.05821423977613449,
        -0.0010788083309307694,
        0.004066580440849066,
        -0.05600225180387497,
        0.023118402808904648,
        -0.12179961055517197,
        0.015231799334287643,
        -0.09528549015522003,
        -0.05013362318277359,
        -0.03807695955038071,
        0.04042735695838928,
        0.0502878874540329,
        0.005589336156845093,
        0.046832360327243805,
        0.003750333795323968,
        -0.027356227859854698,
        0.03437746688723564,
        -0.017709894105792046,
        -0.10254853963851929,
        -0.013644588179886341,
        0.011065919883549213,
        -0.08837026357650757,
        -0.06470107287168503,
        0.03528771549463272,
        0.00021709683642257005,
        -0.060234710574150085,
        0.06145807355642319,
        -0.048619478940963745,
        0.09145260602235794,
        -0.12143727391958237,
        0.037543538957834244,
        0.06137780100107193,
        -0.0226577315479517,
        -0.048983972519636154,
        -0.011003353632986546,
        0.0026503989938646555,
        0.020586445927619934,
        -0.02007620595395565,
        0.023067688569426537,
        0.045753467828035355,
        0.010868063196539879,
        0.02855253592133522,
        -0.008044649846851826,
        0.004866324830800295,
        0.05376001447439194,
        -0.00546205835416913,
        0.021773535758256912,
        -0.012046091258525848,
        0.03878585249185562,
        -0.04707222431898117,
        -0.021419083699584007,
        -0.05168916657567024,
        0.07526597380638123,
        -0.01915219984948635,
        0.019580120220780373,
        0.018795263022184372,
        -0.0013045608066022396,
        -0.09157220274209976,
        -0.039342641830444336,
        0.09497352689504623,
        0.03234901651740074,
        -0.02816888689994812,
        0.06470717489719391,
        0.027774589136242867,
        0.01695764809846878,
        -0.07701250165700912,
        -0.0700315311551094,
        0.05742897093296051,
        -0.014022838324308395,
        0.04612843692302704,
        0.0769788846373558,
        0.070648692548275,
        -0.020388374105095863,
        -0.018254803493618965,
        -0.042304959148168564,
        0.13631458580493927,
        -0.045808449387550354,
        0.00549271097406745,
        -0.018616771325469017,
        0.05484553799033165,
        -0.0714927390217781,
        0.020305225625634193,
        0.011713181622326374,
        -0.037518396973609924,
        -0.04265882819890976,
        0.061092574149370193,
        0.09053055197000504,
        0.04641512408852577,
        -0.0062760100699961185,
        -0.04013718664646149,
        -0.030736679211258888,
        -0.03745453804731369,
        0.09772821515798569,
        0.0037170625291764736,
        -0.031360141932964325,
        1.2208827591014285e-32,
        0.0033639119938015938,
        0.09818337857723236,
        -0.027648339048027992,
        -0.07550622522830963,
        -0.03992196545004845,
        0.040322329849004745,
        0.0359640046954155,
        0.03004078008234501,
        0.010369298979640007,
        0.016735607758164406,
        -0.04631516709923744,
        -0.04336494952440262,
        -0.0463990718126297,
        0.09876753389835358,
        0.05934465304017067,
        -0.07879132777452469,
        -0.024378158152103424,
        -0.01991787925362587,
        -0.04693916067481041,
        -0.029260598123073578,
        0.09128276258707047,
        0.03097113035619259,
        0.023514993488788605,
        -0.08304256945848465,
        0.08003593981266022,
        -0.006778643932193518,
        0.0036884681321680546,
        -0.01508330088108778,
        0.056109167635440826,
        0.04041008651256561,
        -0.06156483665108681,
        -0.09421555697917938,
        -0.0826510563492775,
        -0.06195056065917015,
        0.03805586323142052,
        -0.039254385977983475,
        -0.026551656424999237,
        -0.07226787507534027,
        -0.04558248445391655,
        0.07028184086084366,
        -0.01833290047943592,
        -0.010580029338598251,
        -0.07501094043254852,
        -0.10782545804977417,
        -0.12255728244781494,
        0.053739577531814575,
        -0.00785959605127573,
        0.008393544703722,
        0.0031509080436080694,
        0.020503252744674683,
        -0.026749303564429283,
        0.005907020531594753,
        -0.0042068553157150745,
        -0.012450014241039753,
        0.027016015723347664,
        -0.010749602690339088,
        0.0629238411784172,
        -0.005595090799033642,
        0.06595961004495621,
        0.1237855926156044,
        -0.08664216846227646,
        -0.06207763031125069,
        -0.0007474934100173414,
        0.028174256905913353,
        -0.07196216285228729,
        -0.01249298918992281,
        0.03976813703775406,
        0.07348369807004929,
        -0.018720733001828194,
        0.03252653405070305,
        0.0727769061923027,
        -0.07332538813352585,
        0.09240329265594482,
        -0.042809005826711655,
        0.07222122699022293,
        0.017514657229185104,
        -0.04099905490875244,
        -0.0767986848950386,
        -0.08128573000431061,
        -0.026030588895082474,
        -0.06802018731832504,
        0.07704358547925949,
        -0.06801620125770569,
        0.017704611644148827,
        0.02664474956691265,
        0.0028170819859951735,
        -0.04459278658032417,
        -0.05224784091114998,
        -0.00696302717551589,
        -0.01992100663483143,
        -0.07148649543523788,
        0.0192816574126482,
        0.06351280212402344,
        0.015595230273902416,
        -0.1041276678442955,
        -1.0752351886779069e-32,
        -0.025442685931921005,
        -0.05901903286576271,
        0.07954287528991699,
        0.08825444430112839,
        0.06682627648115158,
        -0.008517042733728886,
        0.0424267053604126,
        0.038098178803920746,
        0.00939817912876606,
        -0.015619151294231415,
        0.009318162687122822,
        0.024443987756967545,
        -0.000657174619846046,
        0.007059084251523018,
        -0.026293523609638214,
        0.004260499030351639,
        0.07480333745479584,
        -0.10538166016340256,
        0.015085241757333279,
        -0.029831765219569206,
        0.047430917620658875,
        0.027102943509817123,
        0.05074606090784073,
        -0.00913145113736391,
        0.005045043304562569,
        0.026948751881718636,
        0.028310058638453484,
        -0.0151321180164814,
        0.05860413983464241,
        -0.009858467616140842,
        0.01146473828703165,
        0.0644182488322258,
        -0.034911077469587326,
        0.0021886329632252455,
        0.06429838389158249,
        0.04873538017272949,
        0.04278663173317909,
        -0.03194689378142357,
        -0.025120433419942856,
        0.014514277689158916,
        0.024292899295687675,
        0.013913734816014767,
        -0.05825917422771454,
        0.06213200464844704,
        0.04913333058357239,
        0.007992974482476711,
        0.004975217394530773,
        -0.09639064222574234,
        0.05636031553149223,
        0.06889063119888306,
        0.0016002493211999536,
        -0.06417801976203918,
        0.0005987882614135742,
        0.006825100164860487,
        0.0016604344127699733,
        -0.10615959018468857,
        -0.054746873676776886,
        0.02815133146941662,
        0.028285767883062363,
        -0.0050238328985869884,
        0.12153809517621994,
        -0.016967585310339928,
        -0.08978244662284851,
        -0.025269251316785812,
        0.03334669768810272,
        -0.07024609297513962,
        0.06424997746944427,
        0.0029587431345134974,
        -0.027957817539572716,
        -0.02438841573894024,
        -0.0681890994310379,
        -0.029864422976970673,
        -0.08410989493131638,
        -0.020512748509645462,
        -0.08500630408525467,
        0.0359761007130146,
        0.053954996168613434,
        -0.0025260455440729856,
        0.09450355172157288,
        -0.029116442427039146,
        0.0197420883923769,
        -0.0031175080221146345,
        0.02914574183523655,
        -0.028037650510668755,
        0.02347487024962902,
        -0.051432397216558456,
        -0.035697877407073975,
        -0.004427068866789341,
        0.06640336662530899,
        -0.039011597633361816,
        -0.006029629148542881,
        0.06691183894872665,
        -0.048472266644239426,
        0.025834375992417336,
        -0.09604601562023163,
        -6.282309072958014e-08,
        0.04131798446178436,
        -0.04772693291306496,
        -0.029378516599535942,
        0.038794100284576416,
        0.02361607365310192,
        -0.07363384962081909,
        0.025121042504906654,
        -0.012105734087526798,
        0.025301257148385048,
        -0.03334149345755577,
        0.15359021723270416,
        -0.05247120559215546,
        -0.00013570746523328125,
        0.00588252255693078,
        0.04304144158959389,
        -0.03369762375950813,
        -0.05016538128256798,
        0.03875840827822685,
        -0.025130843743681908,
        -0.03185649961233139,
        0.05543603003025055,
        0.10063698887825012,
        0.023274021223187447,
        -0.02709227055311203,
        0.0028254312928766012,
        -0.04878630489110947,
        0.00022736925166100264,
        0.020114686340093613,
        0.07154086977243423,
        -0.0752846896648407,
        -0.03995407745242119,
        0.005543812643736601,
        0.033849526196718216,
        -0.005911113694310188,
        -0.019240424036979675,
        -0.04275177791714668,
        0.04756730794906616,
        0.14321663975715637,
        0.10185902565717697,
        0.020471682772040367,
        -0.009345903061330318,
        -0.07776778191328049,
        -0.05543118342757225,
        -0.04391844570636749,
        -0.05723277106881142,
        -0.047192398458719254,
        -0.13407063484191895,
        -0.07743045687675476,
        0.007042627315968275,
        0.02471117302775383,
        -0.060439664870500565,
        -0.002605266636237502,
        -0.01929680071771145,
        0.04790091514587402,
        0.07574018836021423,
        -0.004722244571894407,
        -0.06769280135631561,
        0.03969648852944374,
        0.03417658060789108,
        0.004619950894266367,
        0.058156322687864304,
        -0.05714964121580124,
        -0.04588699713349342,
        0.0580567866563797
    ]
}