{
    "id": "6bwRk9E34bs",
    "title": "How many screens can Smartphones have? - Teardown Axon M",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-04-03T14:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=6bwRk9E34bs",
    "category": "Howto & Style",
    "tags": [
        "Axon M Teardown",
        "Axon M",
        "ZTE",
        "W Noxv",
        "repair",
        "smartphone",
        "cracked screen",
        "dual screen",
        "tech",
        "technology",
        "mobile device",
        "android",
        "cool tech",
        "Review",
        "hands on"
    ],
    "views": 521527,
    "likes": 13828,
    "comments_count": 884,
    "description": "If you need a quick, good looking website check out these guys:  This Teardown is sponsored by Squarespace! Huge thanks to them for supporting my channel.   It takes a brave company to step out of the retanuglar box most smartphones are stuck in. ZTE has done it here with the Axon M. Adding a secondary display to compliment the first. Android is amazing. But what if we could add a THIRD screen? Is it possible? Is there room? (There is always room) Lets teardown the Axon M and find out how the thing is made.  The Axon M has two screens... but could it be possible to add a third screen to a smartphone? Only one way to find out.   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://www.Squarespace.com/JerryRig/",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "A dual screen smartphone. Pretty unique and pretty ingenious. If you remember from my durability test video, the Axon M only has 1 camera. Someone asked me in the comments of that video what would happen if I tried opening Snapchat and the normal camera app at the same time. I decided to try it on an app people actually use though, like Instagram, and then also opened up the regular camera app at the same time. And interestingly enough, both apps stayed open, but only actively displayed the camera on whatever side of the screen I touched last. So only one app works at a time. Simultaneous live streams between different apps aren't possible right now, but maybe someday. This teardown is sponsored by Squarespace. If you need a quick and easy way to build a website, I'll leave a link in the video description. Let's get started. [Intro] A question I have is can you add more than 2 screens to the smartphone. Let's jump inside this dual screen Axon M and see how it's put together. There are 7 little plastic squares covering up little screws. The exterior screws are all t5 and do a good job of securing that back panel. With the screws gone, the back panel pops up and away from the back of the phone, giving us our first look inside of the W Noxv. The battery needs to come out first. It's got it's 2 Phillips head screws holding on that silver bracket. I'll remove that and unplug the battery connector just like a little Lego. Now, ZTE added a sweet little pull tab to their battery, but don't let this fool you. It's purely decoration and doesn't actually work. Sometimes brute force is the only option. This 3180 milliamp hour battery might be a little small to be powering dual screens, but it does get the job done. There are 5 more Phillips head screws down at the bottom of the phone holding down the loudspeaker plastics. You can see the golden contact pads on the bottom which receive communication off of that charging port. The charging port itself unplugs and pulls away from the phone easy enough. This little black board is USB-C and includes two more contact points for the vibration motor off to the side. Same as the loud speaker, this circular vibration motor receives power and communication through that charging port board. I'll pull out the SIM and SD card tray next...cuz that's still in there. And while the motherboard doesn't have any extra screws holding it in place, it does have a lot of connections. The front screen extension ribbon cable, the charging port extension, a few circular wire cables, side button ribbons, and finally the interesting plug here on the left is the secondary rear display ribbon, which looks quite a bit different than a regular screen ribbon connection. We'll look at that more in a second. Now here's where I made a mistake. I assumed the small gold ribbon under the headphone jack was for the headphone jack. I was wrong. It's actually for the front sensors...so now those just won't work anymore. The singular camera on the Axon M is a 20 megapixel beast, but does not have any optical image stabilization. The Axon M's camera doubles as the front and rear camera since there are screens on both sides of the phone. It's go some pretty powerful selfies. Inside the frame we have the normal thermal foam stuff between the processor and the metal of the phone to keep things cool. And down here at the bottom we can see how the front screen is connected. Like most Androids these days, the screen is glued into the frame of the phone from the front, which means removing it is catastrophic to the screen. But if it does need to be replaced, the new little ribbon would feed through this hole and extend up to the motherboard. Now for the secondary screen, it's got two large screws holding itself to the main body of the phone, and then the whole thing lifts up and away from the phone body. Interesting to see a lot of the wire cables running through that hinge. And this is it. One screen connection, and two screws is all this secondary screen has. Just like plugging in a second monitor into your desk top computer. If ZTE were to add one more screen plug into the motherboard and another hinge on the opposite side of the phone, I don't see why we couldn't have a triple screen phone in the future. It's pretty similar to Razer's Project Valerie, or my own triple screen laptop that I built myself last year. Looking closely at the screen connector, it has the same contacts we see inside the standard ribbons, but this one's designed to be flexed over and over again inside that hinge constantly. A normal Lego style thin ribbon wouldn't be able to stand up to that kind of abuse, but these individual insulated wires can. Thumbs up for that. I'll get the round wire cables tucked back inside the hinge, and the secondary screen screwed back into place. Let me know in the comments: would you ever buy a triple screen phone? I think if they were able to shrink the bezels down a bit between the hinges it would be pretty awesome. It's kind of like having a tablet in your pocket. The motherboard is back into place with it's beautifully torn front sensors. It's kind of one less thing to worry about...right? I'll get the side buttons plugged in along with the normal front screen extension cable, and the charging port ribbon. There are 3 wire cables going back into place. These guys are fragile and their heads can pop off if you pull too hard, so I'm being gentle as I smoosh them back into place. Since the secondary screen connector is a bit different than the rest, mostly just more thin, I'll clip that in with my tweezers and plastic pry tool. The charging port board can snuggle back into place. There is no water resistance on this phone whatsoever. I'll plop the loudspeaker back over the charging port with it's 5 black Phillips head screws. And finally the battery with it's now deceivingly weak pull tab ripped off, can slip back into the square slot it came from. I always like to plug the battery in last. Before we can test the phone and see if it still works, I'll get the silver bracket back into place with it's two screws. And then I'll press the power button. So far we have at least one screen going, so that's good. I'll smash the back panel into place with it's seven screws, and it's a success both screens are fully functional, you know, minus the front sensors. If you're looking to get ahead in the online world, or even just get found, you need to have a web page. Whether you're starting a cell phone repair business, selling products, or just want your resume online, Squarespace makes it pretty darn quick and easy. I say easy because with Squarespace, there's nothing to install, patch, or upgrade, and they have 24/7 customer support to answer any questions. The internet never sleeps and neither does Squarespace. You can buy new domains or transfer over one you already own. Feel free to check out the pre-made website templates in the link below, and use that same link: www.Squarespace.com/JerryRig to get 10% off your purchase. Pretty easy. Let me know if you have any questions. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "screen",
        "phone",
        "back",
        "screws",
        "charging port",
        "secondary screen",
        "Phillips head screws",
        "front screen",
        "camera",
        "triple screen phone",
        "screen phone",
        "place",
        "front",
        "back into place",
        "charging",
        "port",
        "ribbon",
        "camera app",
        "screens",
        "front screen extension"
    ],
    "transcript_entity_values": [
        "at least one",
        "over one",
        "10%",
        "Lego",
        "SD",
        "Instagram",
        "the W Noxv",
        "two",
        "jack",
        "1",
        "ZTE",
        "Axon M",
        "only one",
        "the Axon M",
        "Phillips",
        "SIM",
        "5",
        "USB-C",
        "Squarespace",
        "first",
        "second",
        "last year",
        "the Axon M",
        "milliamp hour",
        "Razer",
        "these days",
        "more than 2",
        "3",
        "One",
        "Snapchat",
        "20 megapixel",
        "The Axon M's",
        "seven",
        "one",
        "7",
        "2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "LOC",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "FAC",
        "TIME",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.11481156200170517,
        -0.015332828275859356,
        0.002479249145835638,
        -0.13249331712722778,
        -0.012444240041077137,
        -0.0769602507352829,
        0.002675600117072463,
        0.09472670406103134,
        0.005068906117230654,
        0.05993233248591423,
        0.06679174304008484,
        -0.017917977645993233,
        0.05565971881151199,
        0.03515806049108505,
        0.03139926865696907,
        -0.026545172557234764,
        0.0061134519055485725,
        -0.01968454383313656,
        -0.00021624764485750347,
        0.09986374527215958,
        0.10526818782091141,
        -0.05605208873748779,
        0.039334941655397415,
        -0.10859853029251099,
        -0.014537841081619263,
        0.0027240782510489225,
        -0.009829595685005188,
        0.021847974509000778,
        -0.0321669839322567,
        -0.04733150824904442,
        0.05032391473650932,
        0.1020355373620987,
        -0.04037985950708389,
        0.0698535367846489,
        0.03710813447833061,
        -0.11488106846809387,
        -0.0009536247816868126,
        0.009316256269812584,
        -0.06763868778944016,
        -0.05388353765010834,
        0.003305744379758835,
        0.062424663454294205,
        0.06378474831581116,
        -0.009671570733189583,
        -0.02039518393576145,
        -0.009246283210814,
        0.020090317353606224,
        -0.08755671232938766,
        0.0487060472369194,
        -0.02867227979004383,
        -0.026652395725250244,
        -0.027239346876740456,
        -0.038288094103336334,
        0.08267690986394882,
        -0.030317232012748718,
        0.0347059965133667,
        -0.0455656461417675,
        -0.03169681876897812,
        0.027310572564601898,
        0.021678440272808075,
        0.12641344964504242,
        0.07808352261781693,
        -0.00953513104468584,
        0.055618610233068466,
        0.05668315291404724,
        0.02569998987019062,
        -0.007767052855342627,
        -0.07308698445558548,
        -0.06770158559083939,
        0.015257848426699638,
        -0.011803420260548592,
        -0.0789533331990242,
        0.03884527459740639,
        -0.08608052134513855,
        -0.051025986671447754,
        0.011674393899738789,
        0.07196170836687088,
        -0.028528764843940735,
        -0.04752006009221077,
        0.011851870454847813,
        0.03354448452591896,
        0.034121520817279816,
        -0.0062717413529753685,
        0.06247973069548607,
        -0.04213089868426323,
        -0.011334605515003204,
        -0.03849274665117264,
        0.0926835909485817,
        -0.07157783955335617,
        -0.036296069622039795,
        -0.02957909181714058,
        0.04128813371062279,
        -0.06875298917293549,
        -0.005354477558284998,
        -0.023188428953289986,
        -0.10067890584468842,
        -0.017978738993406296,
        -0.059464894235134125,
        -0.053643058985471725,
        0.05793330445885658,
        0.01572207175195217,
        0.002884835470467806,
        0.11106573045253754,
        -0.04068997502326965,
        0.00450131855905056,
        -0.027212651446461678,
        -0.0646730288863182,
        -0.03607245534658432,
        -0.04809243977069855,
        0.05829152837395668,
        -0.05106694996356964,
        0.02617320977151394,
        0.0013219822430983186,
        0.00020330787810962647,
        0.05103342607617378,
        0.06159922108054161,
        0.012388855218887329,
        0.0023284023627638817,
        0.11644313484430313,
        -0.0033523542806506157,
        0.021630290895700455,
        0.0015348828164860606,
        0.004278111271560192,
        -0.029978925362229347,
        0.14046116173267365,
        0.05028090998530388,
        -0.08757252246141434,
        2.622938585023342e-33,
        0.011805081740021706,
        0.06343004107475281,
        -0.04829684644937515,
        0.009263540618121624,
        0.036025162786245346,
        0.08384587615728378,
        0.0358058363199234,
        0.09828922897577286,
        0.03107679821550846,
        -0.040283214300870895,
        -0.017701970413327217,
        -0.053004421293735504,
        -0.0026024426333606243,
        0.04636559635400772,
        0.08172040432691574,
        -0.0498436875641346,
        0.033922985196113586,
        -0.04851853847503662,
        -0.03846440464258194,
        -0.0039051957428455353,
        -0.042546387761831284,
        -0.10262380540370941,
        -0.019253414124250412,
        -0.03585609793663025,
        0.05833332613110542,
        0.05953901633620262,
        0.04398977383971214,
        0.04062971845269203,
        0.019935090094804764,
        0.008449132554233074,
        -0.0900663360953331,
        -0.002664635656401515,
        0.026723992079496384,
        0.012690875679254532,
        -0.00900381151586771,
        -0.03299589455127716,
        -0.041998136788606644,
        -0.07514717429876328,
        0.03902066498994827,
        0.016760405153036118,
        -0.07267233729362488,
        0.02105308324098587,
        -0.013522269204258919,
        -0.04650590941309929,
        -0.01908041536808014,
        -0.0116991912946105,
        -0.013104220852255821,
        0.020793218165636063,
        -0.008637398481369019,
        -0.08766023814678192,
        0.05953167378902435,
        -0.0672907903790474,
        -0.05242638662457466,
        -0.07728935778141022,
        -0.07516229152679443,
        0.006664525251835585,
        -0.13292203843593597,
        -0.03754159063100815,
        0.11057721078395844,
        0.0208206195384264,
        -0.008084192872047424,
        -0.013354484923183918,
        -0.03827788308262825,
        0.1463956981897354,
        -0.05315369740128517,
        0.05612552911043167,
        0.010068410076200962,
        0.01823391392827034,
        -0.023232048377394676,
        0.0538330040872097,
        -0.06335418671369553,
        -0.03040163777768612,
        0.020625410601496696,
        -0.06332465261220932,
        0.06713392585515976,
        0.030949873849749565,
        0.025438137352466583,
        -0.003070650389418006,
        0.014620209112763405,
        0.014776899479329586,
        -0.018598977476358414,
        -0.0255484227091074,
        0.0800807774066925,
        0.01933334767818451,
        0.007112356834113598,
        -0.053579408675432205,
        -0.004196166060864925,
        -0.08785473555326462,
        -0.03164296969771385,
        -0.0025331133510917425,
        -0.07595774531364441,
        -0.0995597243309021,
        -0.07040122896432877,
        -0.0035129543393850327,
        -0.04312676563858986,
        -3.801117103727335e-33,
        -0.009401239454746246,
        -0.008658161386847496,
        -0.03601209074258804,
        -0.0634787306189537,
        0.03653489053249359,
        -0.06442155689001083,
        0.11417879909276962,
        0.035937972366809845,
        -0.02483959309756756,
        -0.03382144495844841,
        -0.010961209423840046,
        0.054688822478055954,
        0.05469094216823578,
        -0.06609798222780228,
        -0.037610121071338654,
        0.00011066887236665934,
        0.018211303278803825,
        -0.07731699198484421,
        0.03731141611933708,
        -0.002216240158304572,
        0.07600478827953339,
        -0.02308216132223606,
        0.039622511714696884,
        0.019109806045889854,
        0.025623086839914322,
        -0.01062557939440012,
        0.03133081644773483,
        -0.039529819041490555,
        -0.012814362533390522,
        0.03960353136062622,
        -0.0008421096135862172,
        -0.10975616425275803,
        0.02671392261981964,
        0.06814150512218475,
        0.053525350987911224,
        0.06327421218156815,
        0.008723646402359009,
        -0.016181765124201775,
        -0.06720203161239624,
        -0.000803592090960592,
        0.030720330774784088,
        0.05021603778004646,
        0.013082590885460377,
        0.004661937709897757,
        0.027414707466959953,
        4.5144857722334564e-05,
        -0.002805889118462801,
        0.017344843596220016,
        -0.01859034225344658,
        -0.04834355041384697,
        -0.028031354770064354,
        0.0361054502427578,
        -0.004558983258903027,
        -0.009351295419037342,
        0.04710720479488373,
        -0.01567859575152397,
        0.045812346041202545,
        -0.025490228086709976,
        0.005809324327856302,
        -0.05698343366384506,
        0.09159094095230103,
        -0.03270181268453598,
        -0.08729959279298782,
        -0.08488118648529053,
        0.03824823722243309,
        -0.012716453522443771,
        -0.017481189221143723,
        0.04485582187771797,
        -0.08394169062376022,
        0.059183597564697266,
        0.02487107366323471,
        -0.018800539895892143,
        0.014693466946482658,
        -0.06919889897108078,
        0.05352139472961426,
        0.0551595501601696,
        -0.05340941622853279,
        -0.05102601274847984,
        0.042708009481430054,
        -0.043201372027397156,
        0.017159048467874527,
        -0.054143935441970825,
        0.07666762918233871,
        0.03994804993271828,
        0.0532161146402359,
        0.007237795274704695,
        0.022920705378055573,
        0.11949034035205841,
        0.008338216692209244,
        -0.050660282373428345,
        -0.06667669862508774,
        -0.0205443874001503,
        0.009081022813916206,
        0.029397768899798393,
        0.035535816103219986,
        -4.743763071246576e-08,
        0.06098780781030655,
        0.016487447544932365,
        0.03019999898970127,
        -0.0378083735704422,
        -0.07223644852638245,
        -0.0980081558227539,
        0.06229783222079277,
        -0.0140742938965559,
        0.08331269025802612,
        -0.030874313786625862,
        -0.047330405563116074,
        -0.015888849273324013,
        -0.046077799052000046,
        0.10636700689792633,
        -0.02499970607459545,
        0.07772126793861389,
        -0.03950856998562813,
        -9.398663678439334e-05,
        0.01484212651848793,
        0.014326746575534344,
        -0.027641985565423965,
        0.015370592474937439,
        0.025352448225021362,
        0.007889939472079277,
        0.021955009549856186,
        0.05864619463682175,
        -0.11282307654619217,
        -0.028719190508127213,
        0.017648842185735703,
        0.03367440775036812,
        -0.012073636054992676,
        -0.054607901722192764,
        0.04254947602748871,
        -0.011165020987391472,
        -0.004697288852185011,
        -0.07273048907518387,
        -0.09037460386753082,
        0.016513319686055183,
        0.06158749386668205,
        0.005595505703240633,
        0.007002736441791058,
        -0.08734901249408722,
        0.017494462430477142,
        0.03394404798746109,
        0.0176071859896183,
        -0.056136541068553925,
        0.03243303298950195,
        -0.14287550747394562,
        -0.05461550131440163,
        -0.03199565410614014,
        0.06367480754852295,
        -0.013693227432668209,
        0.00983232818543911,
        -0.023178275674581528,
        0.04823961853981018,
        0.009653720073401928,
        0.07294952869415283,
        -0.02941782958805561,
        -0.036271173506975174,
        0.018607135862112045,
        0.02054586634039879,
        -0.001228158245794475,
        0.009201073087751865,
        0.07980572432279587
    ]
}