{
    "id": "6dRgHLqGuMI",
    "title": "Colored iMac's, M1 iPad Pro and AirTags! #AppleEvent",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-04-21T02:13:42Z",
    "video_url": "https://www.youtube.com/watch?v=6dRgHLqGuMI",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 514326,
    "likes": 19603,
    "comments_count": 1196,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Oh boy. Something I don't need after that Apple event is caffeine, but I'm gonna drink it anyway. The Apple spring loaded event just ended. I'm not going to lie, I'm pretty hyped. First of all, I feel like this is an event that we've been waiting for and a lot of stuff was announced, but let's just get into it. I want to cover a lot of stuff very, very quickly. One of the first things that they did announce was that they have a new Apple card family plan so that you'll be able to add other people, spouses, family members, to your Apple credit card so that they'll also be able to start building their credit. There's a new layout for podcasts, which is very exciting, 'cause my sister and I have a podcast. If you want to check it out, I'll put a link in the description. It's called Same Brain. Check it out if you haven't already. It's really cool. They have some new recommendations. They also have a new subscription plan which will give you added benefits. We also have a new color of the iPhone 12 and the iPhone 12 mini. It's this beautiful purple color for spring. I'm a huge fan of the color purple, so I'm really excited about this. Now, moving on to air tags. This is something that I feel like has been rumored for a very, very, very, very, very, very long time. For years, I feel like this is something that we thought was going to be released at every single Apple event and it hasn't. But today is the day. So using the find my network which I feel like I'm never just, I don't know about the whole name of find my, it's weird. But it also works because it is exactly what you're doing. You're trying to find your whatever. Find your iPhone, find your friends and now find your items. They're actually really cute and I think one of the things that is kind of unique is you're able to customize them with emojis or text. You better believe I will be customizing the heck out of my air tags. I'll be putting these on absolutely everything because I feel like I can't ever find anything. Like I would probably lose my body if it was not attached to myself. So this will work with any U1 device like the iPhone 12 and it uses precision finding to guide you to the item. It's going to be really funny to see me walk around this house, trying to find items. I'm thinking that we should have an air tag Easter egg hunt. Get ready for it. It's happening. And the price is actually not too bad. So for $29, you'll get one. And for a pack of four they are $99. Orders will start Friday and they're going to be available on April 30th, which is so soon. They also show these Herms leather accessories, which are actually really beautiful. I don't think they set a price on those because usually Herms stuff is, it's a little pricey. This is kind of exciting. There's a big update to Apple TV 4k. It has all new A12 bionic chip. And you can now play HDR and high frame rate content which is really exciting because the new iPhone obviously shoots HDR and HDR 60 frames a second. So now with this Apple TV 4k, you'll be able to take full advantage of that. They also said that there is an enhancement update for airplay. So that will also be able to support those higher frame rates. Which is something that I feel like I was kind of struggling with. I sometimes feel like airplay is just not quite there when you're streaming the content from your phone. So hopefully this update will help alleviate a lot of that. This other thing that was pretty awesome is color balancing your TV with your iPhone. And the Apple TV will use light sensors in your phone that will compare your TV to standards and automatically adjust the output. I think it's cool that this is something that's kind of coming to consumers because when we were watching his keynote, Tyler was like I spent like $250 on a monitor calibration tool. And now this is something that everyone could just do right here at home. Just be like, hmm, calibrated. We're done. Another thing that I was just, like shook, they finally freaking updated the Apple TV remote. I'm going to be putting a find my air tag on this Apple TV remote because for the life of me, I still can't, I don't know where any of the remotes are. Where do they go? They just like disappear, but they did completely redesign this remote. It's now an all one piece aluminum design with a brand new click pad. There's a Siri button on the side. You can use a circular gesture for job control. It's all touch based and you can order the remote separately. The Apple TV 4k is starting at $179 for the 32 gig version and $199 for the 64 gig version. All right. So this is where the hype train took off. When they announced the new iMacs. So these have been rumored. So this is really not like a huge surprise that they announced an M1 iMac but they didn't just announce one. They announced seven different colors. It's 50% smaller, 11.5 millimeters thin, 24 inch, 11.3 million pixel display. It also has an upgraded camera, microphone and speakers. The front facing FaceTime HD camera is now 10 ADP with a larger sensor and image signal processing. So what this is doing is it's basically using AI to try to improve your image. I'm also very excited about this upgraded microphone because it will definitely cancel out any other sounds in the house. So it's a beam forming microphone that's basically focusing on you. And they said that this is the best mic system ever in a Mac. So if they say it, it's gotta be true. 85% faster graphics than the previous 21 inch max. 50% faster graphics, three X faster machine processing, four USB-C ports and this new power connector. It just magnetically attaches to the iMac in the back. Then it has this braided cable that will then go to your power brick, which will nicely sit on the ground. But what's cool about this is it actually has an ethernet port. So if you want to plug in ethernet, you don't have to actually plug it into your Mac. You can plug it into this brick. And because of that little MagSafe connector that's transferring the data directly to your iMac. So I'm very excited about this. So obviously the highlight of all of this is these are now M1 powered. And with this M1 chip, this is giving the ability to basically scale down the logic boards and make everything so much smaller because of the system on a chip technology. Everything is now much more powerful and smaller and compact and way more energy efficient. Okay. So obviously there's new colors. And with these new colors, my first thought while I was looking at these, I was like but I want my keyboard to match, Oh I want my mouse to match, Oh, I want my track pad to match. So there's three variations of the keyboard and they obviously come in all of the colors. The magic keyboard now has keys for spotlight, dictation, do not disturb, and emoji. And for the first time touch ID. It's cool because it does come in the smaller version. They also have one with the extended keyboard with the number pad. I'm a huge number pad fan. So I will definitely be getting the number pad version. I also like that there's a lock button now on the keyboard. So if you want to quickly lock your computer you can just be like, lock done. This is me locking my computer. That's also me unlocking my computer with my fingerprint. I love that they have the mouse and the track pads to match. Mouse, mice, meese, moose, mmm. The colors match and the pink iMac, it might have my name on it. I don't know if you can do engraving in this, but if you could it would already come with my name on it, for sure. So I'm on the, by the only 24 inch iMac, it looks like there's three variations that you can purchase. So the lowest version is the eight core and the seven core and this does not have two USB three ports or the gigabit ethernet. So that's starting at $1299 and that only comes in four colors, the blue, green, pink, and the silver. And the other two models are the eight core CPU and GPU. And at $1499, that's your 256 gigs of storage and then 512 is starting at $1699. And these have all of the colors. The blue, green, pink, silver, yellow, orange, and purple. It's interesting though because they didn't do like a space gray version. So I feel like they kind of want to save that for the pro version to have that space gray, the matte black. It's gonna look good. The train continues on its way and now we're at the iPad pro. And what is exciting, the M1 is now coming to the iPad, is that's going to be so incredibly powerful that it's going to be almost overkill for most people that are going to be needing this tablet. But for people who are doing illustration, video production, design, real time, augmented reality, whatever it is that you're doing that is processor intensive, like this iPad is more pro than ever. I mean, I've seen the power, just in my own experiences with this M1 and now that M1 going to the iMac and now into the iPad, it's pretty exciting. They showed a demo of something that's really cool is this iPad is now 5G enabled. So it's kind of gonna be shifting the way I think that a lot of us are creating or consuming. I also love the frame IO got to shout outs because I'm a huge fan of frame IO. I use that for all of my storage needs, for transferring footage back and forth, for sending videos to clients for feedback. And they've been working on some really cool camera to cloud transfer. So throwing this new iPad in the mix, it's going to be game-changing really. So the iPad pro has a 50% faster CPU, 40% faster graphics. I also love that it has next gen controller compatibility. So all of the new next gen consoles like the new Xbox and the PlayStation, those controllers will not work on the iPad. It also has two X faster storage and you can configure this thing up to two terabytes of storage, which is kind of mind blowing. I mean, that's doubling the storage over the previous version. It also now has faster connectivity because those USB-C ports are now going to support Thunderbolt and USB four. And it also supports the pro display XDR at full 6k resolution. What?! They did a big update to the true depth camera. It's now ultra wide and they have this feature called center stage. So when you're on one of your FaceTime calls or whatever call it is that you're doing, I'm not sure if this will carry over to zoom calls or anything else, it'll keep you in the center frame. But here's the thing, it looks like the camera is only on the top still because most of the time when I'm using my iPad it's in this sort of orientation. So it would make more sense to have that camera in the center. (indistinct) Either way, I like the center stage feature. And I think that's going to definitely be something that's utilized. The display is something that is also incredibly impressive. They're calling this, the liquid retina XDR display and the full screen brightness is a thousand but at peak brightness you can get 1600 nits, which is pretty incredible. It's crazy because the starting price is very close. If not exactly the same as the previous version. The iPad pro 11 inches starting at $799 and the iPad pro 12.9 inches starting at $1099. And they also have a new white magic keyboard cover which I'm very, very excited about. Really the main takeaway from this is this is a 5G enabled iPad which is kind of huge. Especially if you're somebody who is traveling a lot or you need to be constantly connected on your iPad. Normally a lot of times you could just get away with using your phone as a hotspot but the fact that everything is there, color me impressed. Well, guys, that was just sort of a quick recap of what happened at the Apple event today. My sister and I are also going to be doing a podcast talking about some of the things that we saw today and discussing all of our thoughts and reactions. So be sure to check that out, youtube.com/samebrain or check out Same Brain on Apple podcasts or anywhere that you listen to podcasts. I look forward to seeing you guys in my next video and stay tuned for some coverage on all of these things. And I'll see you guys in the next video. Subscribe, hit the bell, leave a comment. Let me know your thoughts. See you guys very, very soon. Bye. (outro music)",
    "transcript_keywords": [
        "Apple",
        "Apple event",
        "iPad",
        "find",
        "feel",
        "version",
        "iPad pro",
        "kind",
        "colors",
        "Apple event today",
        "pro",
        "event",
        "faster",
        "color",
        "iPhone",
        "iMac",
        "lot",
        "cool",
        "starting",
        "single Apple event"
    ],
    "transcript_entity_values": [
        "4k",
        "meese",
        "like $250",
        "GPU",
        "21 inch max",
        "1600",
        "12",
        "second",
        "799",
        "one",
        "iPad",
        "29",
        "Apple TV",
        "USB-C",
        "A12",
        "Apple",
        "85%",
        "Siri",
        "32",
        "CPU",
        "256",
        "99",
        "Mac",
        "iPhone",
        "years",
        "three",
        "M1",
        "PlayStation",
        "XDR",
        "the day",
        "11.5 millimeters",
        "1499",
        "FaceTime",
        "5",
        "Xbox",
        "four",
        "April 30th",
        "Same Brain on Apple",
        "U1",
        "1699",
        "IO",
        "179",
        "iPad pro 11 inches",
        "1299",
        "1099",
        "24 inch",
        "FaceTime HD",
        "today",
        "iMacs",
        "iMac",
        "Herms",
        "eight",
        "seven",
        "ADP",
        "two",
        "Thunderbolt",
        "40%",
        "M1 iMac",
        "AI",
        "Tyler",
        "50%",
        "10",
        "Same Brain",
        "IO",
        "spring",
        "first",
        "a thousand",
        "11.3 million",
        "6k",
        "Mac",
        "First",
        "Friday",
        "USB",
        "512",
        "199",
        "One"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "DATE",
        "QUANTITY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "FAC",
        "MONEY",
        "GPE",
        "MONEY",
        "PRODUCT",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL"
    ],
    "vector": [
        -0.03249823674559593,
        -0.06903469562530518,
        -0.027467599138617516,
        -0.1254863739013672,
        0.041501130908727646,
        0.004607707262039185,
        0.09005474299192429,
        0.013010738417506218,
        -0.012537452392280102,
        0.09144661575555801,
        0.07852162420749664,
        -0.012129233218729496,
        -0.005063248798251152,
        0.026776308193802834,
        0.00021463540906552225,
        0.06758863478899002,
        -0.005548899993300438,
        -0.019282419234514236,
        -0.014064691960811615,
        0.03439149633049965,
        -0.040297556668519974,
        -0.04610101133584976,
        0.054955825209617615,
        0.006758562754839659,
        -0.040317460894584656,
        0.07230997085571289,
        0.05339730530977249,
        0.051900796592235565,
        -0.08401984721422195,
        -0.07736600190401077,
        -0.008450343273580074,
        -0.02176240272819996,
        0.10489199310541153,
        0.03864848241209984,
        0.0447247214615345,
        -0.06445565074682236,
        0.059344302862882614,
        0.00811834167689085,
        -0.06831128895282745,
        -0.033164724707603455,
        0.0010887297103181481,
        -0.021486105397343636,
        0.053819768130779266,
        -0.008229642175137997,
        -0.03487127274274826,
        -0.05273853987455368,
        0.00714300200343132,
        -0.07404664158821106,
        0.04292457923293114,
        0.0763988047838211,
        -0.047903332859277725,
        -0.03118658810853958,
        -0.01597508415579796,
        0.04538538306951523,
        -0.05462105572223663,
        -0.00637988094240427,
        -0.08773010969161987,
        0.00015958397125359625,
        0.07868887484073639,
        -0.032174546271562576,
        0.000403398007620126,
        -0.028285467997193336,
        -0.0022486986126750708,
        0.04531725496053696,
        -0.055387936532497406,
        -0.03399026766419411,
        0.016915859654545784,
        -0.002931839320808649,
        -0.02778378315269947,
        0.020460952073335648,
        -0.0784323662519455,
        0.02176934853196144,
        0.010401551611721516,
        0.052326299250125885,
        -0.023380162194371223,
        0.05876411870121956,
        0.028911685571074486,
        -0.08890952914953232,
        -0.04458663612604141,
        0.038759730756282806,
        0.031063176691532135,
        -0.022775577381253242,
        -0.09352079778909683,
        0.004881162196397781,
        0.040799591690301895,
        0.03583050146698952,
        -0.004450832959264517,
        -0.023282688111066818,
        -0.05499039962887764,
        -0.03251580148935318,
        -0.10915376991033554,
        0.018420452252030373,
        0.009343229234218597,
        -0.01903528906404972,
        0.005652975291013718,
        -0.03302663937211037,
        0.0030496104154735804,
        -0.04490923881530762,
        -0.04244057089090347,
        0.08053784817457199,
        0.059488970786333084,
        -0.07815831899642944,
        0.005702950060367584,
        -0.042496245354413986,
        -0.06101802736520767,
        -0.11757532507181168,
        -0.050427064299583435,
        0.020528322085738182,
        0.01808815263211727,
        0.03796231746673584,
        -0.0029527239967137575,
        0.007341085467487574,
        -0.07090350985527039,
        -0.06275133788585663,
        0.050047535449266434,
        0.06821899116039276,
        -0.02030903287231922,
        0.050549037754535675,
        0.04822118207812309,
        0.013453823514282703,
        -0.03195713460445404,
        -0.051603835076093674,
        -0.01695200242102146,
        0.0019094180315732956,
        -0.0228263009339571,
        0.033591967076063156,
        -0.06369386613368988,
        1.2727497575583326e-32,
        -0.018994340673089027,
        0.04695534333586693,
        -0.002953481627628207,
        0.05957118794322014,
        0.01087312214076519,
        -0.058367326855659485,
        0.008107633329927921,
        0.07261279970407486,
        -0.02003573812544346,
        0.021780043840408325,
        -0.01846800372004509,
        0.03338548541069031,
        -0.08192905783653259,
        0.04024341329932213,
        0.03739137202501297,
        -0.062479402869939804,
        0.022925980389118195,
        -0.0509529784321785,
        -0.07597492635250092,
        0.00035670134820975363,
        -0.03520159050822258,
        0.004766201600432396,
        0.04657457768917084,
        0.04234347864985466,
        0.0978831872344017,
        0.06529492139816284,
        0.048149850219488144,
        0.02401759847998619,
        0.08739466965198517,
        -0.0011742778588086367,
        -0.04558286815881729,
        -0.01797984167933464,
        -0.014101564884185791,
        -0.06949088722467422,
        -0.037566930055618286,
        -0.00624410854652524,
        -0.06550674140453339,
        -0.01205615047365427,
        0.020535025745630264,
        0.0011101242853328586,
        -0.04934137687087059,
        0.015179088339209557,
        -0.06826845556497574,
        -0.038092199712991714,
        0.09386659413576126,
        0.0627945214509964,
        0.026466047391295433,
        0.07035055756568909,
        -0.005700413137674332,
        -0.0018864646553993225,
        -0.025430213660001755,
        -0.031804122030735016,
        -0.027760999277234077,
        -0.024185435846447945,
        -0.028628680855035782,
        -0.04185633733868599,
        -0.0511399544775486,
        0.04672114923596382,
        0.05491545796394348,
        0.01271197572350502,
        -0.0058760978281497955,
        0.013235887512564659,
        0.012263343669474125,
        -0.003983759321272373,
        -0.07216956466436386,
        0.07761099189519882,
        0.046445395797491074,
        -0.029466422274708748,
        0.035062842071056366,
        0.046614304184913635,
        0.002478154143318534,
        0.006597852800041437,
        0.06235500052571297,
        -0.005163879599422216,
        0.03690915182232857,
        0.03184548392891884,
        -0.0928754135966301,
        -0.03303857520222664,
        -0.025683872401714325,
        0.007084436248987913,
        -0.10289688408374786,
        0.05012860149145126,
        -0.032614294439554214,
        0.12511880695819855,
        -0.053924813866615295,
        -0.03203761577606201,
        0.05631159245967865,
        -0.06205495074391365,
        -0.0049580177292227745,
        0.014775851741433144,
        -0.03271782025694847,
        0.06739608943462372,
        -0.09343647211790085,
        -0.07927896082401276,
        -0.05969895049929619,
        -1.216432557894406e-32,
        0.06807558238506317,
        0.035083234310150146,
        -0.02146756462752819,
        -0.009790683165192604,
        0.042623478919267654,
        -0.04885308817028999,
        0.04327492415904999,
        0.10927753150463104,
        0.021062467247247696,
        -0.05796518921852112,
        0.08088449388742447,
        -0.04746093228459358,
        -0.11374299228191376,
        -0.002816461492329836,
        -0.037923526018857956,
        -0.00949860643595457,
        -0.035102467983961105,
        -0.02080542780458927,
        0.0889621451497078,
        -0.02829776331782341,
        0.060103435069322586,
        0.10655296593904495,
        0.1105102077126503,
        0.01913280226290226,
        0.004489264450967312,
        0.0044614654034376144,
        0.049292098730802536,
        0.04898010566830635,
        0.06558500975370407,
        0.031998105347156525,
        -0.007767835166305304,
        -0.027739180251955986,
        -0.014976887963712215,
        0.007475350052118301,
        0.05851301923394203,
        0.042718078941106796,
        0.04698118939995766,
        0.0029030092991888523,
        -0.006392160430550575,
        -0.04600154608488083,
        0.04924613609910011,
        4.9234902689931914e-05,
        0.004732078872621059,
        -0.024930402636528015,
        -0.02496188133955002,
        -0.09813357889652252,
        -0.04745436832308769,
        0.05795704200863838,
        0.002273478778079152,
        -0.0632515475153923,
        -0.053481582552194595,
        -0.0493834912776947,
        -0.054095957428216934,
        -0.026144664734601974,
        -0.023958396166563034,
        -0.029624665156006813,
        -0.03457110375165939,
        -0.01350871566683054,
        0.043127015233039856,
        0.04192080721259117,
        0.056042369455099106,
        -0.047987259924411774,
        -0.06283506006002426,
        -0.11950313299894333,
        0.0022118715569376945,
        -0.0708141028881073,
        0.05039576068520546,
        -0.013689733110368252,
        -0.02953949384391308,
        0.03225911781191826,
        0.0014867258723825216,
        0.004051995929330587,
        0.048505011945962906,
        -0.03707588091492653,
        0.03856895864009857,
        -0.00147197674959898,
        -0.04754563048481941,
        0.01507493294775486,
        0.09453748166561127,
        -0.057493872940540314,
        -0.021251428872346878,
        0.022448573261499405,
        0.01956150308251381,
        0.11066804826259613,
        0.07830379158258438,
        0.11211631447076797,
        0.08277001976966858,
        -0.013162288814783096,
        -0.007637657690793276,
        0.07083845883607864,
        0.038301654160022736,
        0.051535215228796005,
        0.09660167247056961,
        0.11890009790658951,
        -0.12862630188465118,
        -6.078430203615426e-08,
        0.022314298897981644,
        0.02344704419374466,
        0.007505607791244984,
        0.003934376873075962,
        -0.012197058647871017,
        -0.057263296097517014,
        -0.038214512169361115,
        -0.014440353959798813,
        0.1283310502767563,
        -0.05687394738197327,
        0.0814056470990181,
        -0.03499719128012657,
        -0.034067075699567795,
        0.11562757194042206,
        -0.0168465506285429,
        0.017391646280884743,
        -0.14509370923042297,
        0.08212971687316895,
        -0.020806433632969856,
        -0.06589537113904953,
        -0.06480807065963745,
        0.07323332875967026,
        -0.013905460014939308,
        -0.0021722903475165367,
        0.019711516797542572,
        0.009683633223176003,
        -0.043627139180898666,
        -0.03632066771388054,
        0.027750536799430847,
        0.0524829626083374,
        -0.09185921400785446,
        -0.015141425654292107,
        -0.0063722203485667706,
        -0.031478602439165115,
        -0.036335594952106476,
        -0.0679411068558693,
        -0.07883110642433167,
        -0.021947728469967842,
        0.007406865246593952,
        -0.04929457604885101,
        0.014102092944085598,
        -0.14468584954738617,
        -0.05269758403301239,
        -0.008950385265052319,
        0.0032484622206538916,
        -0.062193650752305984,
        0.029825247824192047,
        -0.04840739071369171,
        -0.07989011704921722,
        0.0147398691624403,
        -0.014822601340711117,
        0.029399575665593147,
        0.07296627759933472,
        -0.007743136025965214,
        0.0327601432800293,
        -0.04352046176791191,
        0.06823820620775223,
        0.03439134731888771,
        -0.0031696101650595665,
        -0.010737829841673374,
        0.058148905634880066,
        0.007498215883970261,
        -0.056882694363594055,
        0.04344997927546501
    ]
}