{
    "id": "6dTa8Tfozzg",
    "title": "Going Off Grid with ONLY SOLAR! - No Battery Needed",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-12-02T14:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=6dTa8Tfozzg",
    "category": "Howto & Style",
    "tags": [
        "Solar",
        "diy solar",
        "solar backup",
        "off grid solar",
        "off grid",
        "battery backup",
        "solar townhome",
        "solar panel",
        "sunlight backup",
        "enphase",
        "solar panels",
        "how to install solar",
        "Off grid in the city",
        "solar permit",
        "micro inverters",
        "enphase iq8",
        "enphase energy",
        "solar power",
        "off grid homestead",
        "off grid house"
    ],
    "views": 404692,
    "likes": 17865,
    "comments_count": 926,
    "description": "It is time to turn a townhome into an off-grid Oasis. HUGE thanks to Solar Wholesale for designing my system. Get a $250 discount on your own DIY Solar kit here:  Working with electricity is very dangerous. Make sure you know your local regulations and hire a certified electrician where needed. (Like I did here on my project.)   Tesla also has a fairly priced solar setup:  (Tesla does need a battery backup to be 'off grid')  Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.solarwholesale.com/jerry-rig-everything/",
        "https://ts.la/zack10701",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Behind me are some townhomes. A townhome is a human dwelling where similar buildings share a wall and people live side by side. Today we're going to be installing some solar panels on the top, but not just any panels. This technology will allow us to have electricity even if the grid is gone - effectively putting us off grid in the middle of a city without batteries...at least as long as the sun is out. I have a lot of explaining to do and installing so let's get started. [Intro] Today we are installing a 5.5 kilowatt solar array, and I'll get to all the paperwork mumbo jumbo in a second. First we'll install the panels because that's much more interesting. Even though the pitch of this roof isn't very steep, it is very high off the ground so we are tying off and using harnesses with anchor points that we've screwed into the peak. Safety is pretty important and I have broken my wrist before falling off a ladder, and I do not want to repeat that ever again. Yeah! Woo! I am working with Solar Wholesale again since they are a one stop shop for an entire solar package and everything I need for this job. And the biggest perk of course is that they handle all the paperwork mumbo jumbo so I don't have to. All of the solar panels we're installing today are on a southern facing roof. Since we're in the northern hemisphere it means they get more sun time. However, since we are also installing a solar backup today, it could also be worth our time to put some panels on an eastern facing roof, and some panels on a western facing roof so we get more sunlight as the sun goes down, and as it rises in the morning because we only have backup power when the sun is shining, until we add batteries, but they are expensive so we'll do that later. Scoping out the valley we can see there are actually quite a lot of solar panels on these townhomes. A bunch on buildings over there. Here on these houses. Some over there as well. A lot of these...when you have a townhome, a lot of the approvals...the first round of approvals, come from the HOA. Not every HOA approves of solar panels, but I would say the majority of them are coming around to the idea. The HOA in this particular neighborhood had a rule that there were no solar panels allowed until I asked, and then they said okay. Sometimes that's all it takes. Installing the panels is actually super easy. I've made a couple videos on this in the past. We find the joist using a hammer. And once we find one, it's relatively easy to find the rest since they are equally spaced. It's not too big of a deal if we drill a hole and miss the joists because the flashing we'll put down in a second will cover up any mistakes we might have made. Now that we've found the joists and we've added the flashing underneath the shingles, it's time to install the snap and rack system. The whole system is held onto the roof with a giant lag going through an L-foot, through the flashing, into the joists, and can withstand 105 mile an hour winds. We don't see many hurricanes here in Utah. You'll notice that the flashing has a little lip, and the lag has a little rubber washer as well on the top. And so when the whole thing is tightened down, it's watertight and no liquid will be getting underneath the shingles. You'll also notice with each of these supports with the joists running this direction, we have them staggered so the weight is distributed across different joists. And of course, all of this information is found in a customized plan set for your specific project from the link in the description. It makes things a whole lot easier. Here is where the perks of the snap and rock system start to show themselves. As we lift the rails up onto the roof and snap them into place, things start to move really quickly. The little L-feed can be adjusted up and down to compensate for any fluctuations in the roof surface, keeping the panels level no matter how unlevel the roof might be. And then if we need to add two sections of rails together, there is a splice we can throw in here in the middle as long as we leave a little bit of space for an expansion. Because in the summer things get really hot and expand and if they're too...if there is no gap and they're too close together it might buckle up in the middle so we leave them separate for shrinkage and expansion. You also might notice that we're leaving a couple of the rails long here on the side. We'll just cut them off later once we have the panels set and in place. The copper wire between the rails grounds all the solar panels together. Now here's where things start to get a little more technical, and what makes this setup different than the previous systems that I've installed. This is an in-phase micro inverter, and each solar panel needs one of these underneath it. It's what allows the panels to become our sunlight backup. I'll explain more when we get down to the brains of the system that we're going to mount in the garage. These micro inverters are able to take the DC electricity from each of the panels and turn it into AC electricity that our houses are able to use - the same AC electricity that flows through the grid. So we have the micro inverters connected by a trunk cable. These are what connect to the panel, converts to AC, and then the trunk table is what brings the AC all the way down to the hole we made in the roof right here. Once the trunk cable has reached the roof junction box we can switch to romex wire to traverse inside the attic and then bring it outside to run down conduit to our brains or control unit of the enphase system. And if you didn't understand any of those words, everything you need will come in the kit to accomplish the job including the plan set, which is like the instructions. It's a lot simpler after you've seen it done once or twice. The sun's going down and it's getting super cold, so we will finish mounting the panels tomorrow. But for you guys...tomorrow is still today. Or maybe today is today. Either way, it's panel time. Each of these things are pretty massive and weigh about 45 pounds, which means that it's kind of difficult to get them up here on the roof. If we were smart we would have gotten a lift or something. But it's not impossible. Once they are on the roof and all situated and laid out so they don't slide off the edge, we can plug them into the micro inverters. Remember, the micro inverters are what change the power from DC to AC. There are 220 volts running down to the brains which I'll show you in a second...after we're done wiring up the 15 panels. It's kind of hard to mess this up. There are two cables on the back and they only go in one place. They will audibly click into place and we set the panel on top of the rail and each of the panels is held in place with 4 mid clamps. It should go pretty quick. There we have it. All the panels are laid out and installed. Now we'll drop wires through the roof, into the attic, out the eave, and down the side of the building to connect to the brains of this system, which gives us our sunlight back up. Another easy way of going green of course, is with my neon green JerryRigEverything knife. Link is down in the description. And with that, the brains of the Enphase system are now unboxed. The brains of the Enphase system is about 100 pounds. So we are taking the mounting plate, putting it on a stud with some drywall anchors on the other side so it doesn't go anywhere. We mounted the brains a little bit higher up so in the future we can possibly add some batteries here underneath. And I'll explain more in depth what all this hardware does after we get everything mounted. So you might have noticed we used two different kinds of wire. We're running the romex through the attic, and then we're running this THHN wire through some conduit going down to the junction box. The jacketed romex wire is for interiors, and this other THHN wire is more for exteriors and weather rated. Which is why we use the junction box at the eave to splice them together. Different wires for different things. So up until now people with solar panels, if the power ever went out, the solar panels would turn off and stop functioning. That's because when solar is generated, and there's excess electricity that the house isn't using, it flows out to the grid to be used by neighbors or somewhere else down the line. So if the power goes out and someone needs to go work on the power lines, that excess electricity would be very dangerous. So having the solar panels turn off when the grid is down makes a lot of sense. A lineman's job is already dangerous enough without having to worry about a bunch of individual power grids on people's houses...At least that was the case up until now. This video isn't sponsored by Enphase, but they are the ones with the hardware to allow us to do something called a sunlight backup. Effectively being off-grid in the middle of the city while keeping the power lines safe, and I'm going to explain how it all works. The breaker box in this townhome is located in the basement and this is where the real fun begins. This is where the grid power comes into the house, as well as the breakers that we need to separate from this main panel into a separate backuppable panel of its own. The reason we're picking a few breakers to back up instead of all of them is because of our lack of roof space up on top of the building. If we had more roof space on top of the building we could just back up the entire townhome. But since we're a little bit restricted, we're picking and choosing the most important breakers so that if the grid power ever does go out, our fridges still stay on, our outlets still stay on, but we're still not going to use more power than the solar panels are generating. Remember this is a 5.5 kilowatt system and power has to come from somewhere. The sun is going down yet again, so let me walk you through this entire system so you can see how the sunlight backup works. It should only take a few minutes. So up there on the roof we obviously have the solar panels. Then we have a junction box underneath the eave, and my HOA requires white conduit that comes down to this junction box right here. This is a solar panel disconnect. We can flip it and the solar panels turn off. And because we have the sunlight backup and the ability to do batteries later, we have a redundant switch as well which turns off the system. And over here is where the meters are that bring power into the house from the grid. If we walk over here, this is where the brains of the operation are. And this is where it gets a little more complicated. Stick with me. The main breaker panel for this house is in the basement. And since the power for this house is primarily coming from the grid, you know, the vast majority of the time, let's start down there. This right here is the main breaker panel. This is where the main power comes in from the grid, flows through the breakers and out to whatever outlets or appliances we might have at the other end. Because of our limited roof space though, we only have 5.5 kilowatts worth of sunlight backup to work with. So in this particular house we had to pick and choose which particular breakers we wanted to back up. We're only utilizing about 25% of the Enphase system we installed. I'll talk more about electrical flow in a second, but the breakers or loads that we chose to back up are in this secondary panel here. Important things like the fridge, the master bedroom lights, the kitchen outlets, stuff that we would still be able to live and function in the house if the grid power was down. Having electricity is kind of important for things in your fridge...or grandma's oxygen. Now back to the flow of electricity. We have the grid power here until we come down to this breaker here which goes out to the Enphase system we just installed. I'll show you that in a second. But this comes back from that Enphase system with grid power or solar power. It goes through the breakers and down here to this smart switch which has the ability to shed loads. Which means as the sun comes up in the morning, the solar power gradually increases, and as the sun goes down, the power gradually decreases. This box is a smart switch which allows the loads to be turned on and off based on their importance and can all be programmed into the Enphase system. Now back to the fun stuff. This is the brains of the Enphase system. With this there are two things we need to know. This is where the solar is coming in. And then these two white wires are coming from that breaker panel in the basement. They are the grid power. If the grid were ever to go down or shut off, these little guys right here can sense the electrical power flowing through the wires, through a magnetic field. So if the power goes off, we are instantly able to draw from the solar panels and send it back down to that secondary panel we created through these two wires right here running through the conduit. Unlike a normal system, if the grid goes out your solar panels stop working. This system would allow the solar to flow through that conduit down into our essential lows panel where they would stay on, and this particular townhome would stay functioning. The Enphase brain also keeps the solar power from flowing out to the grid, keeping the grid safe for any lineman who would be working on power lines. You might be asking how much a sunlight backup system like this one might cost. And remember the technology is pretty new. It's only been around for a couple years so it's still at a premium. Early adopters always pay more. Currently this adds about $6-7000 to the price of a solar setup. It might not be right for everyone. Remember, we're only using about a quarter of this system's capabilities so it would make quite a bit more sense on a larger system with more panels. But like always, it just depends on your needs and what you're going to use it for. And obviously, this whole setup does have the potential to be installed by yourself and personally I'm pretty okay installing solar panels and running that kind of power, but anything that involves moving breakers or connecting to the grid, personally that's where I choose a certified electrician. But like always, I'll leave links down in the description so you can price things out for yourself. And like any traditional solar setup, any excess electricity we're producing with the panels does flow out to the grid where here in Utah we get a credit so we can use our energy that we produced back at night again without paying for it. I think Rocky Mountain Power takes like 10% off the top, but that's fair because they're acting as our storage. This Enphase system does have a battery hookup so it would be extremely easy for me to add batteries in the future. It's the same smart switch that works for both the sunlight backup as well as the battery backup. But we'll save the battery backup for another video. If you have any questions go ahead and leave them down in the comments and I'll try to answer them. Feel free to come hang out with me on Instagram....and thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "solar panels",
        "panels",
        "solar",
        "enphase system",
        "power",
        "system",
        "grid",
        "panel",
        "grid power",
        "roof",
        "enphase",
        "solar panels turn",
        "solar power",
        "breaker panel",
        "installing solar panels",
        "backup",
        "back",
        "things",
        "sunlight backup",
        "brains"
    ],
    "transcript_entity_values": [
        "Enphase",
        "Enphase",
        "15",
        "10%",
        "about a quarter",
        "about 45 pounds",
        "Instagram",
        "two",
        "Enphase",
        "105 mile an hour",
        "tomorrow",
        "AC",
        "Rocky Mountain Power",
        "DC",
        "a couple years",
        "about 25%",
        "4",
        "220",
        "night",
        "5.5 kilowatts",
        "about $6-7000",
        "about 100 pounds",
        "HOA",
        "first",
        "second",
        "a few minutes",
        "First",
        "today",
        "THHN",
        "Today",
        "THHN",
        "Solar Wholesale",
        "Utah",
        "one",
        "5.5 kilowatt",
        "secondary"
    ],
    "transcript_entity_types": [
        "GPE",
        "NORP",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "TIME",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL"
    ],
    "vector": [
        -0.09628728777170181,
        0.12937018275260925,
        -0.03374513238668442,
        -0.01497190073132515,
        0.049914099276065826,
        -0.025729596614837646,
        0.06525217741727829,
        0.023914769291877747,
        -0.054280757904052734,
        0.0662577748298645,
        0.053705841302871704,
        -0.052254024893045425,
        0.03535578027367592,
        0.044527195394039154,
        0.033338308334350586,
        0.01631898246705532,
        0.0532352589070797,
        -0.04027331992983818,
        0.0005154400714673102,
        0.09288579970598221,
        -0.015273665077984333,
        -0.01068022195249796,
        0.038705140352249146,
        -0.08572894334793091,
        0.053789641708135605,
        0.04356890544295311,
        -0.05264286324381828,
        0.04112489894032478,
        -0.11021243035793304,
        -0.027851466089487076,
        -0.017083803191781044,
        0.06898153573274612,
        -0.0982491597533226,
        -0.014414113014936447,
        0.12623231112957,
        0.10615997761487961,
        0.018396833911538124,
        0.01908280700445175,
        -0.022814329713582993,
        0.002531148958951235,
        0.017076272517442703,
        -0.09479475766420364,
        -0.012092338874936104,
        -0.0734439492225647,
        -0.041064973920583725,
        0.029691943898797035,
        0.08727403730154037,
        -0.03650970011949539,
        0.05411774665117264,
        -0.03519923612475395,
        -0.045295748859643936,
        -0.02309112809598446,
        0.0631716400384903,
        -0.01359621249139309,
        -0.05056874826550484,
        -0.0252055786550045,
        -0.001683904672972858,
        -0.01154171209782362,
        0.03184247389435768,
        -0.07479686290025711,
        -0.016189195215702057,
        -0.05986548587679863,
        -0.11475354433059692,
        0.06527724117040634,
        -0.032989442348480225,
        -0.04213152453303337,
        -0.0008529462502337992,
        -0.032640136778354645,
        -0.08335734903812408,
        -0.07614750415086746,
        -0.0467260479927063,
        0.015102824196219444,
        -0.010429388843476772,
        -0.022015662863850594,
        -0.05144830420613289,
        0.023939164355397224,
        0.08036641031503677,
        -0.003809645539149642,
        0.04413779824972153,
        -0.007963612675666809,
        0.08490142971277237,
        0.0373312383890152,
        -0.045570243149995804,
        0.02914312481880188,
        0.0009029399370774627,
        0.06256460398435593,
        0.017885195091366768,
        0.11784178763628006,
        0.0171052273362875,
        -0.08317503333091736,
        -0.02383275330066681,
        0.0387791246175766,
        0.010237029753625393,
        0.01304545346647501,
        -0.014759340323507786,
        -0.007968292571604252,
        -0.017184006050229073,
        -0.07406197488307953,
        -0.0750306248664856,
        0.0494316965341568,
        0.06630270928144455,
        -0.02380473166704178,
        0.02090959995985031,
        -0.04933251813054085,
        0.031023161485791206,
        -0.03046332485973835,
        -0.06775090098381042,
        0.0838991180062294,
        0.058103449642658234,
        -0.023135703057050705,
        -0.00032689369982108474,
        0.028022514656186104,
        -0.07892797887325287,
        -0.03341670334339142,
        0.01892906054854393,
        0.05860604718327522,
        -0.023889968171715736,
        0.012706639245152473,
        0.07569744437932968,
        -0.0447937436401844,
        0.08122575283050537,
        -0.036802105605602264,
        0.008477754890918732,
        0.0674646720290184,
        0.05954180285334587,
        0.0445781946182251,
        0.034216590225696564,
        3.4270406384911126e-33,
        0.00777206989005208,
        0.14813651144504547,
        -0.005541196092963219,
        0.0035381834022700787,
        0.02089526504278183,
        0.11338482797145844,
        0.008535048924386501,
        0.08056459575891495,
        -0.017190707847476006,
        0.012677537277340889,
        0.01456439308822155,
        0.03300183266401291,
        0.05890880525112152,
        0.06364814192056656,
        0.01466043759137392,
        -0.0627932995557785,
        0.015218368731439114,
        -0.10659383237361908,
        0.01688559539616108,
        -0.05495502054691315,
        -0.022643908858299255,
        -0.013444578275084496,
        0.06856991350650787,
        0.07550665736198425,
        0.049618251621723175,
        -0.02316407300531864,
        0.07826828211545944,
        -0.06349823623895645,
        0.05349566787481308,
        0.0347943939268589,
        -0.004201750736683607,
        0.015881013125181198,
        0.07533344626426697,
        0.02943584695458412,
        -0.024646278470754623,
        0.025765346363186836,
        -0.10518613457679749,
        -0.08416187018156052,
        -0.06638111174106598,
        -0.10035959631204605,
        -0.030424533411860466,
        0.06478392332792282,
        -0.047041215002536774,
        -0.03726440668106079,
        -0.0002516068343538791,
        -0.041543759405612946,
        0.030308708548545837,
        -0.01884676143527031,
        -0.023042850196361542,
        0.016153458505868912,
        -0.007155871018767357,
        0.003512510797008872,
        -0.04332921653985977,
        -0.05208063870668411,
        -0.09948994219303131,
        0.04562152549624443,
        0.0067949783988296986,
        -0.0170851219445467,
        0.023249570280313492,
        0.004255431704223156,
        0.018102407455444336,
        -0.024130910634994507,
        -0.03190217539668083,
        0.009455706924200058,
        -0.054075468331575394,
        -0.05326511710882187,
        -0.01775338687002659,
        0.037296976894140244,
        -0.09696456789970398,
        0.025052784010767937,
        0.011093375273048878,
        -0.04603874310851097,
        0.04153206944465637,
        -0.025574129074811935,
        0.061397917568683624,
        0.05317758023738861,
        -0.03576065972447395,
        0.01907210238277912,
        -0.016445642337203026,
        -0.016339903697371483,
        -0.06377232819795609,
        -0.009115046821534634,
        0.05072188749909401,
        -0.01648162305355072,
        0.03149920329451561,
        -0.09494368731975555,
        0.004923367407172918,
        -0.00257030944339931,
        -0.017220811918377876,
        -0.051687635481357574,
        0.049902528524398804,
        -0.015337100252509117,
        -0.02233237214386463,
        -0.048260435461997986,
        -0.022819578647613525,
        -6.056949537672846e-33,
        -0.017914852127432823,
        0.033310241997241974,
        -0.0066223712638020515,
        -0.07096882164478302,
        0.09865961223840714,
        -0.003791036317124963,
        0.04775863513350487,
        -0.0035650667268782854,
        0.012690315023064613,
        -0.03292211517691612,
        -0.08317357301712036,
        0.054100360721349716,
        -0.04466046392917633,
        -0.02984067052602768,
        0.0419437400996685,
        -0.006297243293374777,
        -0.06457681953907013,
        -0.054485417902469635,
        -0.0013056870084255934,
        0.03784584254026413,
        0.01675749011337757,
        0.06388124823570251,
        0.06321898847818375,
        0.06018127128481865,
        -0.010609270073473454,
        0.03771062567830086,
        0.0023914077319204807,
        -0.026707984507083893,
        0.06914327293634415,
        0.009590967558324337,
        -0.08008906990289688,
        -0.0545489676296711,
        0.012476419098675251,
        0.04087182506918907,
        -0.009007997810840607,
        0.048045817762613297,
        0.0103710126131773,
        0.0006611171411350369,
        -0.040306102484464645,
        -0.00681330868974328,
        -0.010038611479103565,
        -0.029770614579319954,
        -0.026608414947986603,
        -0.03943555802106857,
        -0.04718569666147232,
        -0.10897532850503922,
        -0.08095201849937439,
        0.039095960557460785,
        -0.07174963504076004,
        0.06980431079864502,
        -0.08809257298707962,
        0.02295299805700779,
        -0.029247445985674858,
        0.037934016436338425,
        -0.0434456430375576,
        -0.05566524714231491,
        0.09276527911424637,
        0.049792930483818054,
        -0.061954401433467865,
        -0.04065075144171715,
        0.05343981459736824,
        -0.02756321243941784,
        0.020350901409983635,
        0.03605768829584122,
        -0.018517250195145607,
        -0.05504082143306732,
        0.06492449343204498,
        0.004538480658084154,
        0.025514818727970123,
        0.01689048483967781,
        -0.006028321105986834,
        -0.002287826035171747,
        -0.018284955993294716,
        -0.12164650857448578,
        -0.0010815765708684921,
        -0.025603560730814934,
        0.007545515429228544,
        0.004812055733054876,
        0.007561285048723221,
        -0.07132616639137268,
        0.05821522697806358,
        -0.02751309424638748,
        0.024785488843917847,
        0.02315274253487587,
        0.06955094635486603,
        -0.06510215252637863,
        0.07222777605056763,
        -0.00850472692400217,
        -0.0399656817317009,
        0.04072165861725807,
        -0.024444233626127243,
        -0.005658653564751148,
        0.03371976688504219,
        0.13532640039920807,
        -0.00038907089037820697,
        -5.8820646131607646e-08,
        0.0046732365153729916,
        0.08090101182460785,
        0.008175047114491463,
        -0.04788290709257126,
        0.029422223567962646,
        -0.07330664247274399,
        0.047947317361831665,
        0.01607200689613819,
        0.016767511144280434,
        -0.026046687737107277,
        0.050591059029102325,
        -0.04112670198082924,
        0.054426029324531555,
        0.02559046261012554,
        -0.07183757424354553,
        0.0403534434735775,
        0.003619393100962043,
        0.046021927148103714,
        -0.03480702266097069,
        0.09379769116640091,
        -0.08628926426172256,
        -0.03548085689544678,
        -0.0573718324303627,
        0.023022852838039398,
        0.04509773477911949,
        0.05529137700796127,
        -0.08306462317705154,
        -0.02438203990459442,
        0.12031866610050201,
        -0.02362135425209999,
        -0.04783126711845398,
        -0.008397838100790977,
        0.02715144120156765,
        -0.02552751824259758,
        -0.1144389808177948,
        -0.04274534806609154,
        -0.1075185164809227,
        -0.09142021834850311,
        0.04774928092956543,
        0.02245134301483631,
        0.001299707219004631,
        -0.05220787599682808,
        0.0240437351167202,
        0.014239338226616383,
        -0.04857588931918144,
        -0.009985498152673244,
        -0.029524201527237892,
        -0.16328178346157074,
        -0.0029853901360183954,
        0.09177147597074509,
        -0.04528070613741875,
        -0.0424630306661129,
        -0.03031729720532894,
        -0.026362959295511246,
        -0.0029741658363491297,
        0.06442368030548096,
        -0.03656464442610741,
        -0.011852424591779709,
        0.04965861886739731,
        0.007568289525806904,
        0.04340261220932007,
        -0.02018304541707039,
        -0.07065723091363907,
        0.008968762122094631
    ]
}