{
    "id": "6h-qr0P-JpU",
    "title": "HomePod Party 😂",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-02-11T22:43:18Z",
    "video_url": "https://www.youtube.com/watch?v=6h-qr0P-JpU",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "homepod",
        "party",
        "jenna",
        "itsmejennae",
        "homepod review",
        "homepod unboxing"
    ],
    "views": 607705,
    "likes": 13733,
    "comments_count": 1185,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, how's it going? So today is very, very exciting. Today we are having a home pod party. But before we get into what's going on today, yesterday, was Jenna Appreciation Day. - I feel very appreciated, but doesn't it carry over to today too? - It does, because I didn't get to see you much yesterday, so let's cut to yesterday; Jenna Appreciation Day. Guess what's in this box guys? It's a home pod, but it's not a home pod for me, it's a home pod for Jenna, it is a gift. Today is Friday, it is Jenna Appreciation Day. I decided to have this day in honor of my sister, Jenna, because she does a lot of stuff for me, she does a lot of stuff for all of us, a lot of stuff for all our friends. So I thought, what better way to celebrate Jenna, than getting her a present? We were gonna go to dinner, but we got tired, so instead, Jeff and I are gonna go to dinner. - Yep - And then we're also going to the Apple Store, because instead of getting an extra white one, I decided to get a black one for my desk. I'm sorry, not black, space gray. Cause I wanted it to match my new iMac. Jeff also got a home pod, do you like yours? - Yeah the sound is really good on the Home Pod, gotta say, very impressed by it. - [Justine] Maddie's also impressed with it. - [Jeff] I don't think it's gonna work. - I think it will. - [Jeff] No, it's not. - Okay, I need a protractor. - [Jeff] Maddie isn't this crazy - Jenna Appreciation: Appreciating Jenna. And guess what, the bag is functional. This is great. What do you think Maddie? What do you think, you wanna give Jenna some love? Oh shoot, I said her name. He loves that paper, bye honey, I'll see you soon okay? Should we get Jenna a candy for Jenna Appreciation Day? - Yes we should, what kind of candy would Jenna like? - [Justine] I'll get her this. There it is. - [Jeff] People are going crazy for it, there's only one out. - Really? No. There's gotta be more. Okay, we're going in, I'm gonna pick up my home pod. - [Jeff] Wanna count how many home pods are in the actual store? - Yes, let's count, yes. Yeah I feel like it's really hard to demo here, because it's very loud, so we're not gonna really be able to get to hear it. Hey Siri? (Girls Just Want To Have Fun by Cindy Lauper) That's loud Wow it fits perfect! Yes! Thank you so much! Look at this bag it fits perfectly, this is what I needed for Jenna's gift. I messed up. We'll give her this one first, this is the warm-up gift. - If it's from that store, this is what I've been waiting for. Mike doesn't have any pretzels here. Dangerous. - [Justine] I walked in I was like, no... - This is super dangerous! - [Justine] I thought this was appropriate. You guys can share it. - We'll share it. - [Justine] This I had to custom make this bag, because... Open up! Customizable. - Customizable? Can I rip this open? - You can, you have to cause I taped it to the box. - I don't have a knife. - I couldn't find wrapping paper, but like I have so much of it, surprise. - Can you believe it falls on National Peace Day today as well? - [Justine] Oh no, National Jenna Appreciation Day. - I wanted to celebrate, but I figured we'd probably have pizza tomorrow. So I think I know what it is, I knew it! - So I had bought one for myself, and then I was like you know what? Jenna's been so sweet and so nice, do you not watch my videos Matt? - Funny, because I knew it was gonna be a Home Pod - (groans) She guessed? - [Matt] When I talked to you yesterday, and I said, like, \"do you want to get a Home Pod?\" And you're like, \"I didn't order one.\" - I did cause I didn't order one. - Cause you knew I would get you one. - [Matt] You knew she was gonna buy you one? - I didn't, but I forgot what gave it away. - I think, I actually remember when I did because I said something about it coming tomorrow, and I was trying to be all, and I was like shoot. - [Jenna] And I was like the Home Pod comes out tomorrow Thanks Jus! - [Matt] Did you want white or black? - Why do you think I asked you which color I should get? I was like, which one do you like? Which one do you think that I should get? Remember? And you were like, well which one do you like? - I honestly don't know because like everything in your house is white, I thought, why is she pestering me? - [Matt] What's the difference between a Home Pod and an Alexa? - [Jenna] You gotta watch her video - Watch my video, I spent a lot of time on it. (Upbeat Music) - [Justine] (Frantically greeting people) Okay, we need to see the cake. So, could you hold this real quick? I am actually very shocked. Because I basically told them this last minute and they did a really good job. - [Camera Guy] It's the exact proportions. - Eh, proportions are a little off, but that's okay - [Camera Guy] It was a lot taller when it was in the car, but I hit a bunch of speed bumps. - [Justine] Well I needed to get it big enough so that people could eat it. - [Camera Guy] Did you get to pick the dimensions? - What's the difference between the two? - [Justine] This, you can eat, don't eat it. So we're gonna go see Matt's League of Legends match now, Hundred Thieves is playing and they are, what's their score, do you know what the record is? - Four,two? - Yeah cause there's two a week so yeah I guess you're right four and two. - I'm gonna get, I'm taking my shirt off in the arena. (play-by-play commentary) - We're here, we made it, perfect timing. So, let's go Hundred Thieves! Des are you excited? - Hi, yes, I don't know what's happening. - I was like Des, we're going to a thing, it's like sports, but it's e-sports. We're playing video games. Obviously, it's gonna be incredible. Hey Matt? Did you guys post on Instagram yet? - [Matt] Nope - It's not looking good. Let's get outta here. Wow. Well that didn't go very well, but we got a cookie. We're heading back now to the party. So, I will tell you man, League of Legends, they know how to party with the cookies. Maddie, the party is just starting, honey. Cookie! Hi Cookie! So this is definitely gonna be turning into a dog party, I think there's like five dogs that are coming, and the whole theme of the party is the Home Pod, and I haven't even opened it yet, so I'm gonna open it up right now. This is the whole theme of the party, and it isn't even open yet. - This is the only reason I'm here. - It's true! - It's beautiful. - Oh my goodness! Look at you buddy! - I wasn't sure what size it's gonna be, it's perfect. The size it is is perfect. It's smaller than I thought. - So the size is okay? Are you good with the size? - It's better than I thought now, it's like I thought it was gonna be like this much taller. - No, this is it. So, I can just hide this back here? (Shocked noises) Look, wait, it makes music! It's kind of like Alexa but not. - But how, you can talk to it? - [Justine] Yes. - What do you say to it. - [Justine] You can say whatever you want. - Play me a good song - Wait hold on I'm setting it up. - [Camera Guy] I'm trying to look at the home pod, you're showing me a phone, I've seen a phone. - [Home Pod] Now playing the eighties radio. - Hey siri, turn the volume all the way up. - [Home Pod] That's very loud, are you sure? - Yes (Don't you forget about me by Simple Minds) - Hey Siri, turn the volume down. Who is Rosanna Pansino? - [Home Pod] Rosanna Pansino is an American baker, actress, author, and YouTube personality. - Whoa... She knows me. - That's my friend! That's my friend! Nevermind that's fine. - [Camera Guy] Did you know there's an accelerometer in this? Yes, so when you move it I- Did you not watch my video? - [Camera Guy] I've been busy, I went to Disney World. - This is, okay, so Matt was like, \"so what's the Home Pod do?\" I was like did you not watch my video? I'm like guys, hello. What do you think I've been spending the last week, dedicated to? Making videos about the Home Pod. - Guess what, I have one cause you got me one, very nice of you. - [Justine] Jenna Appreciation - Jenna Appreciation Day - Want a super tiny itty-bitty crumb? - [Justine] Very small crumb - It's so small! - [Justine] Sit. - I tried to- she caught us. - [Justine] I did. I saw it. I caught them. Thank you for the pizza, Alex. Alex and Pam brought us pizza. Hi Roe, how are you? I miss you! - Good, I miss you, beautiful. - You've been busy doing a lot of things - Yes I'm working on a secret project right now so, it's been in the grind, so I haven't got to see your face in a while, but now we're hanging out. - But I wanna show her the Home Pod cake, to make sure that we have the approval of Roe. Do you approve? - I approve, you even got the texture around the side. - Yeah that's cause I didn't make it. - Wait you didn't make this? - No, you've seen what I can do. - I bet you could do this. - Oh no it's definitely. No, oh my gosh. This is not what was supposed to happen. Look we can fix this. We can fix this it's fine. Everything's gonna be fine. Totally fine. It's almost identical. So as you can see here, this is my Home Pod cake, and this is the Home Pod. You can see some slight similarities, as far as the color. - [Justine] Hi Matt - Hi Justine could you get me some ice? - [Justine] Yes. So, I tried to write your name on it but it didn't fit. - Thank you. - [Justine] It's Jordan's birthday! Happy Birthday! - So kind of you, 26 years old. There's no more milestones, until like, 65 that's it. - [Justine] That's true, except today, your favorite cookies. - I'm gonna eat my slice of pizza, eat my cookies, Swedish Fish, then I have a dinner after this. It's over calorie-wise today. - [Justine] You can take one to-go. - It's so good - Yes it's a home pod. - That looks really good - Thank you I made it. - You did a good job - I didn't make it. - This is Arty, do you want to say hi to my friends? - Hi Arty, he's actually a DJ Time to DJ, good boy, yes - [Jenna] Hey it's not plugged in. - Yeah but - You have some skills. - He does, what do you think, do you approve. - I do - You gotta go like this. - Oh my god we're gonna do a collab together. - It would be so good. - He likes this track more than the other one. - [Jenna] This one - Maddie, over here. Time to DJ Good boy, come on, let's go good boy. Yes you're an angel. - What do you think Arty? - I love it! He's incredible. - You guys gonna do a beat to beat? - No, he's gonna make it to top hundred this year. - He's gonna dethrone Martin, number one. - Yes Maddie do you remember? Do you remember when you met Martin Garrix? How about that Mariokart tournament that we had? - Listen, okay, it was rigged a little bit. I don't know why I didn't win. I should have won. I'm calling shenanigans. Alex, I'm calling Alex out. - So, you know what, I have yet to meet anybody on the street. So I still have my hundred dollars. - Oh you haven't yet? - [Justine] Yes did you give yours away yet? - No, no I didn't. - Justine's vlogging but I have to vlog too. - Is the mic on? Make sure the mic's on. I don't see a green light. - Mic is permanently on. - Well Matt just ruined my vlog so, my vlog is over. What is this song? - [Home Pod] This is, Arty Boy, featuring Emma Louise. (Flight Facilities - Arty Boy with Emma Louise) - [Justine] Is this your song? Is this Arty Boy? - That's Boy Arty it's different. - [Justine] Hey Siri, I like this song. - [Home Pod] Okay. Got it. - Okay so we're gonna cut the cake now, so this is happening. This is a huge piece, like a huge cake. In my Home Pod review I did that. Do you want a cake?",
    "transcript_keywords": [
        "Jenna Appreciation Day",
        "home pod",
        "Jenna Appreciation",
        "Jenna Appreciation Jenna",
        "home",
        "Appreciation Jenna Appreciation",
        "Appreciation Day",
        "Jenna",
        "pod",
        "Home Pod cake",
        "National Jenna Appreciation",
        "home pod party",
        "Appreciation",
        "Day",
        "good",
        "crazy Jenna Appreciation",
        "Appreciation Jenna",
        "home pods",
        "today",
        "Home Pod review"
    ],
    "transcript_entity_values": [
        "Arty Boy",
        "the Apple Store",
        "Home Pod",
        "one",
        "Flight Facilities - Arty",
        "Matt - Hi",
        "Jeff",
        "Justine",
        "Simple Minds",
        "Swedish",
        "Jordan",
        "Roe",
        "Roe",
        "Cindy Lauper",
        "65",
        "Instagram",
        "Today",
        "my hundred dollars",
        "today, yesterday",
        "American",
        "Emma Louise",
        "two a week",
        "the Home Pod",
        "Jenna Appreciation Day",
        "Rosanna Pansino",
        "Hundred Thieves",
        "Mike",
        "Alex",
        "National Peace Day",
        "Arty",
        "four",
        "this last minute",
        "Maddie",
        "Siri",
        "five",
        "Jus",
        "the last week",
        "Justine] Jenna Appreciation - Jenna Appreciation Day - Want",
        "League of Legends",
        "26 years old",
        "only one",
        "Martin Garrix",
        "today",
        "Four",
        "iMac",
        "two",
        "this year",
        "Mariokart",
        "Alexa",
        "Justine] Maddie's",
        "YouTube",
        "this day",
        "Alexa",
        "Hundred",
        "Arty",
        "first",
        "Martin",
        "tomorrow",
        "Matt",
        "Upbeat Music",
        "Disney World",
        "Friday",
        "Jenna",
        "yesterday"
    ],
    "transcript_entity_types": [
        "PERSON",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "NORP",
        "PERSON",
        "PERSON",
        "LAW",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "NORP",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "DATE"
    ],
    "vector": [
        -0.01589272730052471,
        -0.07423041760921478,
        -0.03962181136012077,
        -0.12163340300321579,
        0.02430608682334423,
        0.06088073551654816,
        0.05538492277264595,
        0.04503672942519188,
        -0.029404709115624428,
        0.06464558094739914,
        0.005547106731683016,
        0.004797539208084345,
        -0.03481977805495262,
        0.0021782314870506525,
        0.013334517367184162,
        0.033794939517974854,
        0.019760917872190475,
        -0.0037861920427531004,
        -0.012554527260363102,
        0.06668993085622787,
        -0.03002363257110119,
        -0.028865672647953033,
        0.041904594749212265,
        0.035944052040576935,
        0.008237333036959171,
        0.07808823883533478,
        0.014597052708268166,
        0.018335968255996704,
        -0.08202651143074036,
        -0.06545411050319672,
        -0.018401024863123894,
        0.030074218288064003,
        0.11392328888177872,
        -0.004052398260682821,
        0.017703063786029816,
        -0.02851320430636406,
        0.0320577397942543,
        -0.023258276283740997,
        -0.03130263090133667,
        -0.003689456032589078,
        0.02298925630748272,
        -0.030732411891222,
        0.023336660116910934,
        -0.02707558125257492,
        -0.08254822343587875,
        -0.08309753239154816,
        -0.02457142248749733,
        -0.06427590548992157,
        0.0671326294541359,
        0.08484411984682083,
        -0.09703855216503143,
        -0.03539277985692024,
        0.05459774658083916,
        0.010254660621285439,
        -0.0647897720336914,
        0.005135208833962679,
        -0.08839557319879532,
        0.023063112050294876,
        0.06539460271596909,
        -0.09095565974712372,
        0.0614638477563858,
        -0.06690870970487595,
        0.029195968061685562,
        0.029060550034046173,
        -0.02467079646885395,
        -0.08276838809251785,
        0.005181827116757631,
        0.0055480399169027805,
        0.015895143151283264,
        0.022569755092263222,
        -0.08959949761629105,
        0.08138669282197952,
        -0.03161462023854256,
        0.001816234434954822,
        -0.022410916164517403,
        0.03174600750207901,
        0.03085232339799404,
        -0.026900993660092354,
        0.005326985847204924,
        0.08845904469490051,
        0.04493080824613571,
        -0.01721491478383541,
        -0.05931859835982323,
        -0.03404015302658081,
        0.01748022437095642,
        0.0487915500998497,
        0.014191831462085247,
        0.007545214146375656,
        -0.06833785772323608,
        -0.08079710602760315,
        -0.08942221105098724,
        0.004495353437960148,
        0.003829966066405177,
        -0.051923979073762894,
        -0.018913844600319862,
        -0.06180217117071152,
        -0.018172958865761757,
        -0.0589325837790966,
        -0.03661985322833061,
        0.07784760743379593,
        0.06638500839471817,
        -0.03394589200615883,
        0.009057700634002686,
        -0.01697133667767048,
        -0.0022184986155480146,
        -0.11989754438400269,
        -0.0590229406952858,
        0.02093229629099369,
        0.025253845378756523,
        0.0260990709066391,
        -0.05022788047790527,
        0.007119062822312117,
        -0.04400676116347313,
        -0.058801572769880295,
        0.006014676298946142,
        0.12203334271907806,
        -0.034812040627002716,
        0.07549189776182175,
        0.07578165829181671,
        -0.003208449110388756,
        -0.003579196287319064,
        -0.10399556159973145,
        0.01301692333072424,
        0.026703689247369766,
        -0.0006615564925596118,
        0.01929822936654091,
        -0.058334946632385254,
        1.4130702814575153e-32,
        0.027627574279904366,
        0.06354750692844391,
        0.012916886247694492,
        0.048422861844301224,
        -0.0371931828558445,
        -0.03542653098702431,
        -0.03971090912818909,
        0.12006458640098572,
        -0.03254222124814987,
        -0.01130142156034708,
        0.007960093207657337,
        0.044335316866636276,
        -0.017584364861249924,
        0.051441699266433716,
        0.009020674973726273,
        -0.04248034954071045,
        -0.05165594071149826,
        -0.03399800509214401,
        -0.03789402171969414,
        -0.010802199132740498,
        -0.0025046260561794043,
        -0.027674615383148193,
        -0.006561248563230038,
        0.11381561309099197,
        0.07755733281373978,
        0.03876028582453728,
        0.07078183442354202,
        -0.006081700790673494,
        0.07072336226701736,
        0.011804505251348019,
        -0.0028514363802969456,
        -0.0547473169863224,
        0.0023376625031232834,
        -0.0840081200003624,
        -0.03307206556200981,
        -0.030261313542723656,
        -0.07962417602539062,
        -0.013395884074270725,
        -0.042983993887901306,
        -0.08043442666530609,
        0.0017063088016584516,
        -0.005940296221524477,
        -0.07507798075675964,
        -0.05267497897148132,
        0.05111999809741974,
        0.030153008177876472,
        0.05145157501101494,
        0.05557587742805481,
        -0.03364535793662071,
        0.018534664064645767,
        -0.02799135074019432,
        -0.00240619876421988,
        -0.05786178261041641,
        0.016646631062030792,
        -0.010044864378869534,
        -0.10815514624118805,
        -0.011633866466581821,
        0.059669699519872665,
        0.039657700806856155,
        0.02211454138159752,
        0.017047930508852005,
        -0.016058145090937614,
        0.0026478730142116547,
        -0.033495865762233734,
        -0.049774013459682465,
        0.10915011167526245,
        0.07315422594547272,
        -0.05654306709766388,
        0.0758194625377655,
        0.05407772585749626,
        0.03280801698565483,
        0.005946646444499493,
        0.030475232750177383,
        0.016248179599642754,
        0.013218936510384083,
        0.04158251732587814,
        -0.07487761974334717,
        -0.057004667818546295,
        0.004760622512549162,
        -0.010983305051922798,
        -0.10744988173246384,
        0.05937686190009117,
        -0.003854192793369293,
        0.10938385128974915,
        -0.03917233645915985,
        -0.08226391673088074,
        0.02387758530676365,
        -0.04191131517291069,
        -0.05460700765252113,
        0.030524389818310738,
        -0.005108017940074205,
        0.06298167258501053,
        -0.0890231505036354,
        -0.02506841905415058,
        -0.043400365859270096,
        -1.2644507674415272e-32,
        0.03957705944776535,
        0.040264397859573364,
        -0.016049664467573166,
        -0.02008933387696743,
        0.055705390870571136,
        -0.035805411636829376,
        0.06617986410856247,
        0.06833978742361069,
        0.0850181132555008,
        -0.0787634551525116,
        0.040079593658447266,
        -0.07567966729402542,
        -0.08400449901819229,
        0.014418965205550194,
        -0.014128214679658413,
        -0.03662481531500816,
        -0.06145830079913139,
        -0.06096490100026131,
        0.08100712299346924,
        -0.0076278322376310825,
        0.06532099097967148,
        0.11355922371149063,
        0.11494330316781998,
        0.03656598553061485,
        0.026453735306859016,
        0.0031706129666417837,
        0.05796314403414726,
        0.023090394213795662,
        0.04657040536403656,
        0.023605385795235634,
        0.017855096608400345,
        -0.08127745985984802,
        -0.05458613485097885,
        0.022075273096561432,
        0.02232961915433407,
        0.03491102531552315,
        -0.02629854530096054,
        0.07312288135290146,
        0.005659252405166626,
        -0.09272827953100204,
        0.0349326953291893,
        -0.009205217473208904,
        0.0032958402298390865,
        -0.02086746133863926,
        -3.686171112349257e-05,
        -0.15298476815223694,
        -0.0643390342593193,
        0.06256341189146042,
        0.01889675110578537,
        -0.003500034101307392,
        -0.06663239002227783,
        -0.0449984073638916,
        -0.015246693044900894,
        -0.026250027120113373,
        -0.031631145626306534,
        0.00560668483376503,
        -0.04042285308241844,
        -0.03635537996888161,
        0.022935159504413605,
        0.05201373249292374,
        0.025274259969592094,
        -0.033195048570632935,
        -0.058271605521440506,
        -0.049699485301971436,
        -0.010768002830445766,
        -0.04592832922935486,
        0.034013621509075165,
        0.054462745785713196,
        -0.010896553285419941,
        0.04030358046293259,
        -0.005474899895489216,
        0.03215000778436661,
        0.0855511724948883,
        0.04249466210603714,
        0.04715510085225105,
        0.009980661794543266,
        -0.07966973632574081,
        0.01680876314640045,
        0.1262684017419815,
        -0.052738651633262634,
        -0.07828876376152039,
        0.0018893011147156358,
        0.026472482830286026,
        0.07333080470561981,
        0.09800206869840622,
        0.0881657749414444,
        0.09819472581148148,
        -0.018367059528827667,
        -0.036095235496759415,
        0.07354521006345749,
        0.05067944526672363,
        0.05321696773171425,
        0.0561319999396801,
        0.10628478229045868,
        -0.06546882539987564,
        -6.514705575000335e-08,
        0.05928384140133858,
        0.03229369968175888,
        -0.012790646404027939,
        0.002507898723706603,
        0.01281285472214222,
        -0.07105755060911179,
        -0.012767939828336239,
        0.0005107977776788175,
        0.04745723679661751,
        -0.054464396089315414,
        0.05514899641275406,
        -0.023699896410107613,
        -0.011059555225074291,
        0.10064631700515747,
        0.02732774242758751,
        0.005153363570570946,
        -0.09157098084688187,
        0.07616668194532394,
        -0.05901142209768295,
        -0.07271093130111694,
        -0.04573936387896538,
        0.010073949582874775,
        0.032946497201919556,
        -0.009403807111084461,
        0.010824907571077347,
        0.012563329190015793,
        0.009646806865930557,
        -0.0012694760225713253,
        0.03288750350475311,
        -0.013402784243226051,
        -0.07548189163208008,
        -0.014808890409767628,
        -0.028120819479227066,
        0.008088461123406887,
        -0.05398470535874367,
        -0.023099185898900032,
        -0.0890626534819603,
        -0.03250093385577202,
        -0.007670575752854347,
        0.04122930392622948,
        0.0010765930637717247,
        -0.12524572014808655,
        -0.056140583008527756,
        -0.017587797716259956,
        0.011331337504088879,
        -0.04023771360516548,
        0.055354516953229904,
        -0.09076745808124542,
        -0.0631975382566452,
        -0.030281247571110725,
        -0.04762008786201477,
        0.015253383666276932,
        0.01967107690870762,
        -0.020697513595223427,
        0.05727506801486015,
        0.009884092025458813,
        0.044390879571437836,
        0.05401969328522682,
        -0.004288975149393082,
        0.0026873331516981125,
        0.024670735001564026,
        0.04023124277591705,
        -0.03949032723903656,
        0.05547631159424782
    ]
}