{
    "id": "6J5o4J-Ttp8",
    "title": "⌚️ Apple Watch Series 9 and Apple Watch Ultra 2 Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-09-20T13:02:39Z",
    "video_url": "https://www.youtube.com/watch?v=6J5o4J-Ttp8",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 273751,
    "likes": 7809,
    "comments_count": 350,
    "description": "New Apple watches are here!  Pre-order Oceanic+ Dive Housing:      PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "https://www.oceanicworldwide.com/product/computers/oceanic-plus-dive-housing/",
        "https://youtu.be/_3_ibMon2nU",
        "https://youtu.be/9plKXNvAQwU",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and do you know what time it is? I do because I've got two brand new watches on my wrist the Apple Watch series nine and the Apple Watch Ultra two. (upbeat music ) Now you may know, and I've said this so many times on my channel that other than my iPhone the Apple Watch is my favorite Apple product of all time. And I think this is actually true for a lot of people and that's probably because Apple has put so much effort into this piece of tech to make it so much more than just a smartwatch. They're consistently updating their watch lines with awesome features and improving the hardware with each new release, making them truly invaluable tools. For me personally, the Apple Watch has helped me stay on top of my fitness goals and it even inspired me to try new activities that I probably never would've thought to try otherwise but we'll talk more about that later. Both of these watches are powered by the new S9 SiP which has a four core neural engine enabling some new features that we haven't seen in the Apple Watch up until now. Siri can now handle the most common tasks directly on the device rather than having to connect to the internet which means hopefully it will be faster and easier to use Siri on the watch. You can also access health data via Siri now which is great, although that feature won't be coming out until later this year, so I'm excited to try that out. And thanks to the second gen ultra Wideband chip precision finding has been improved. So now when you need to find your iPhone in addition to hearing that wonderful chirp sound that we're also familiar with, the Apple Watch will show you the approximate distance and direction to your phone. I lose my phone at least 10 times a day so I'm pretty stoked about that. Another new feature coming to the Apple Watch is name drop which Apple announced during WWDC for iOS 17. I love this feature, so it's pretty cool that they're bringing this over to the watch OS as well. You can get the Apple Watch series nine either aluminum or stainless steel finishes. For aluminum you can choose between midnight Starlight silver product, red and of course my favorites pink. And for stainless steel it comes in gold silver and graphite. Both the Apple Watch series nine and Ultra two now have brighter screens as well with a series nine going up to 2000 knits which is double the brightness of the series eight. And the Ultra two is going up to 3000 knits which is 50% brighter than the original. Even with the new brighter screen with the Apple Watch Ultra two, you're still getting 36 hours of battery life and if you have it in low power mode, you can get up to 72 hours, which is a pretty long time if you think about it. But the big new feature they announced for the Apple Watch is double tap and this allows you to control the Apple Watch hands free. Now I got to try this out during the product demo and it's super cool. All you have to do is raise your wrist and double tap your thumb and index figure and this action controls the primary button in any app. So you can do things like pause and play music, answer a call, open a notification and there's tons of other operations. Now when you're at the home screen a double tap will open up your smart stack so you can scroll through all of your open notifications and widgets. I think this is a really cool feature and it's probably just the first of many gesture based features that Apple will bring to the Apple Watch in the future. Now, I also know that this is a feature that was in accessibility previously but that is something that you had to turn on. It wasn't a full-fledged built out feature. Now they're taking advantage of all of the new hardware in the Apple Watch. They have the ability to make this a wide-based feature and it's actually something that you don't have to turn on, it just works. A big point of pride for Apple this year is that both of the new Apple watches are their first a hundred percent carbon neutral product. This is part of their 2030 plan to make their entire product line carbon neutral by 2030. You are able to tell what products are carbon neutral by looking at this little logo right here. And this sport Loop one is actually one of my new favorites and I love how soft it is. They're using all different types of recycled materials, like old threads that they didn't use from previous watch bands and even these Nike ones for example these are also made from recycled ground up old Apple watch bands that they either didn't use or they're just excess materials that didn't make the cut. While I was at the Apple event, I got a chance to sit down with Lisa Jackson and John turn from Apple to learn more about their environmental initiatives. You can check that video out here if you wanna watch more. Now, last year Apple released the Apple Watch Ultra which was such a huge hit and for me it quickly became my watch of choice for my daily use. Honestly, when I first got it I thought it was gonna be way too big for my little wrist but I got over that pretty quickly. I love this thing so much, and even though we didn't get a design change or a new color option with the Ultra two there's still some really great new features. The first thing that I noticed in using this is how much brighter the new screen is and it really does make a huge difference especially when you're outside in the bright sun. Now, like I said before, it is now brighter with a peak brightness of 3000 knits and it also comes with an improved ambient light sensor. The display will adapt to your surrounding lighting conditions and it can dim down to just one knit for night mode. This is the new modular ultra watch face which takes advantage of a huge display. This has the most complications of any watch face. I mean, look at this, they're everywhere. The compass has also been reimagined with new tools and functionality. You can see important details like Elevation, Incline and even a three D view of your way points on a trail. Now, of course the Apple Watch Ultra was designed specifically for the most extreme kinds of activities. It can handle the most harsh environments, extreme hot and cold, wet and dry, high elevation, you name it. And it just so happens that I recently took on one of these extreme activities as my new hobby Scuba diving. - Alright, friends, we are hearing Catalina and it's time to go diving with a brand new Apple Watch Ultra two and the iPhone 15 pros. (upbeat music) - Oh my god, it's so cold. So when you're actually underwater when you're using this as a dive computer it'll give you your depth water temperature and it also gives you an alert when it's time to do your safety stop. It'll also give you notifications if you're descending or ascending too quickly, which is really useful because sometimes you're just focusing on either taking photos or just trying to get your buoyancy correct. So being able to have this little extra notification is really useful. Something else that's pretty awesome is if you don't have an Apple Watch Ultra but you do have an iPhone, you are able to now turn that into a dive computer as well with Oceanic Plus Housing. I did a full video on this as well if you wanna check that out. I just now want to encourage everyone to be a diver and get into Scuba because it is so much fun. Like I can't stop talking about it. Obviously, if you can't tell like I have just that's all I wanna do. That's all I wanna talk about. And it's all thanks to the Apple Watch Ultra. (upbeat music) If it wasn't for the Apple Watch Ultra there's no way that I would be doing this at all. I was terrified of water a few months ago and now it's my new favorite activity ever. You can also set it up if you wanna just snorkel and there's a new addition to do free diving which is something that I haven't tried yet. So maybe one day soon, I'm not sure. I'm not gonna hold my breath on that one. See what I did there? Yeah, isn't that good? That's good. (laughs) So that my friends is the brand new Apple watches and some of the new features. Again, I can't stress enough how much I absolutely love the Apple Watch Ultra two. So excited to do some more adventures and I really wanna get back into hiking but now that I'm diving, I just wanna be under the water. If you wanna watch any other Apple videos or anything else on my channel, I'll put some right here and I look forward to seeing you guys in the next video. Bye.",
    "transcript_keywords": [
        "Apple Watch Ultra",
        "Apple Watch",
        "Watch Ultra",
        "Apple",
        "Apple Watch series",
        "Watch",
        "Ultra",
        "Apple watch bands",
        "Watch series",
        "ultra watch",
        "ultra watch face",
        "modular ultra watch",
        "Apple watches",
        "feature",
        "watch bands",
        "watch face",
        "Justine",
        "favorite Apple product",
        "Apple product",
        "features"
    ],
    "transcript_entity_values": [
        "Scuba",
        "the Apple Watch Ultra",
        "WWDC",
        "nine",
        "nine",
        "second",
        "Nike",
        "Catalina",
        "nine going up to 2000",
        "one",
        "the Apple Watch",
        "Lisa Jackson",
        "hundred percent",
        "Apple",
        "Justine",
        "Apple Watch Ultra",
        "Siri",
        "3000",
        "between midnight Starlight",
        "iPhone",
        "three",
        "a few months ago",
        "36 hours",
        "iOS 17",
        "2030",
        "last year",
        "up to 72 hours",
        "at least 10",
        "four",
        "one day",
        "Siri",
        "night",
        "SiP",
        "eight",
        "later this year",
        "this year",
        "two",
        "15",
        "Oceanic Plus Housing",
        "50%",
        "John",
        "first",
        "Apple Watch",
        "Elevation, Incline",
        "the Apple Watch"
    ],
    "transcript_entity_types": [
        "GPE",
        "ORG",
        "EVENT",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "FAC",
        "PERSON",
        "PERCENT",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "TIME",
        "EVENT",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "TIME",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.016861753538250923,
        -0.10840114951133728,
        0.003191920230165124,
        -0.07875974476337433,
        0.021178152412176132,
        0.06136897951364517,
        0.023252282291650772,
        0.018223991617560387,
        -0.017802679911255836,
        0.02580172009766102,
        -0.0007105543045327067,
        0.0015531005337834358,
        -0.053090907633304596,
        0.0014857588103041053,
        -0.004763325210660696,
        0.018886838108301163,
        0.08983545005321503,
        -0.06072293594479561,
        0.030965028330683708,
        0.043669987469911575,
        0.00951840728521347,
        -0.08637676388025284,
        0.0759405717253685,
        0.054122406989336014,
        -0.017880147323012352,
        0.10401804000139236,
        -0.008246888406574726,
        0.04084876924753189,
        -0.06874845921993256,
        -0.06493955105543137,
        -0.04840529337525368,
        -0.010866169817745686,
        0.05870956927537918,
        0.02442299947142601,
        0.020777391269803047,
        -0.032301295548677444,
        0.06950714439153671,
        -0.016085267066955566,
        -0.08125785738229752,
        -0.041725680232048035,
        0.005776924081146717,
        0.004827848635613918,
        0.015111437067389488,
        0.03692645579576492,
        -0.03558555990457535,
        -0.0350370928645134,
        0.03307168930768967,
        -0.02406594343483448,
        0.053820256143808365,
        0.08663773536682129,
        -0.07477355003356934,
        -0.04239765927195549,
        0.04847472533583641,
        -0.0017984856385737658,
        0.005451354198157787,
        -0.014780065976083279,
        -0.09573645889759064,
        -0.016685595735907555,
        0.07890284806489944,
        -0.07823039591312408,
        0.06297735869884491,
        -0.05780070647597313,
        -0.022104347124695778,
        0.034921303391456604,
        -0.07228076457977295,
        -0.03195653483271599,
        -0.029419412836432457,
        0.003341210773214698,
        0.009433667175471783,
        0.022330787032842636,
        -0.061549603939056396,
        0.058332789689302444,
        0.02964593656361103,
        0.010476870462298393,
        -0.014060517773032188,
        0.04281812533736229,
        0.030151432380080223,
        -0.13342227041721344,
        -0.05912669748067856,
        0.008884251117706299,
        -0.019162548705935478,
        -0.07454808801412582,
        -0.06348370760679245,
        0.010532702319324017,
        0.04076448827981949,
        0.028066381812095642,
        0.015055172145366669,
        -0.023317791521549225,
        -0.060373079031705856,
        -0.03934910520911217,
        -0.03528031334280968,
        0.0157475546002388,
        0.015730153769254684,
        -0.028031423687934875,
        -0.005684469360858202,
        0.0009642223012633622,
        -0.01551102101802826,
        0.017202919349074364,
        -0.04292895272374153,
        0.045992858707904816,
        0.062091171741485596,
        -0.03750663623213768,
        0.01062301080673933,
        -0.003379634814336896,
        0.010516682639718056,
        -0.12705224752426147,
        -0.05875714123249054,
        0.030611859634518623,
        0.02736048959195614,
        0.06857027113437653,
        -0.0016807502834126353,
        0.051403988152742386,
        -0.061891768127679825,
        0.010857718996703625,
        -0.024607781320810318,
        0.1080334261059761,
        -0.05837581306695938,
        0.0617678128182888,
        0.03535868227481842,
        0.05238142982125282,
        0.05318384990096092,
        -0.01161777600646019,
        -0.009074383415281773,
        0.04452908784151077,
        0.004907119553536177,
        0.018952231854200363,
        -0.04828736558556557,
        1.1179389882649605e-32,
        -0.027222000062465668,
        0.016923846676945686,
        0.01178937591612339,
        0.017041489481925964,
        -0.05880707874894142,
        -0.05142064020037651,
        -0.009920487180352211,
        0.10888976603746414,
        0.009632517583668232,
        0.06443996727466583,
        -0.03627973422408104,
        0.04902078956365585,
        -0.03917791321873665,
        0.049454040825366974,
        0.06141374260187149,
        -0.07537297159433365,
        0.008539178408682346,
        -0.06933004409074783,
        -0.024442847818136215,
        -0.026918264105916023,
        -0.019896630197763443,
        -0.0054804603569209576,
        -0.011011957190930843,
        0.03729049116373062,
        0.013376500457525253,
        0.07668259739875793,
        0.04698118194937706,
        0.046570371836423874,
        0.07098377496004105,
        0.028442801907658577,
        -0.06254486739635468,
        -0.08119616657495499,
        -0.01139464508742094,
        -0.07373712211847305,
        0.0009448555647395551,
        -0.021463612094521523,
        -0.034088149666786194,
        0.023917648941278458,
        -0.0003634630411397666,
        -0.0171163659542799,
        -0.06298098713159561,
        0.005576272029429674,
        -0.05676167085766792,
        -0.12077692151069641,
        0.09519699215888977,
        0.01861138641834259,
        0.06394781917333603,
        0.09275485575199127,
        0.015229412354528904,
        -9.27092696656473e-05,
        -0.03495331108570099,
        -0.030428588390350342,
        -0.028459543362259865,
        -0.0458611324429512,
        -0.027582677081227303,
        -0.03159191459417343,
        0.011144728399813175,
        0.031023912131786346,
        -0.027617741376161575,
        0.05959177017211914,
        0.0002122209407389164,
        -0.020596662536263466,
        0.02197667397558689,
        0.01734330877661705,
        -0.07203509658575058,
        0.11345108598470688,
        0.05884837359189987,
        -0.0402086079120636,
        0.005546558648347855,
        0.05716213956475258,
        -0.0038348454982042313,
        0.013483753427863121,
        0.09483463317155838,
        0.011464497074484825,
        0.03732388839125633,
        0.024077029898762703,
        -0.04740834981203079,
        -0.020443197339773178,
        0.03275883570313454,
        0.0003788264002650976,
        -0.09331321716308594,
        0.062127210199832916,
        0.03688797354698181,
        0.14175653457641602,
        -0.06238957494497299,
        0.0033944372553378344,
        0.01740320399403572,
        -0.02419409342110157,
        -0.027705080807209015,
        -0.002536352491006255,
        0.014600750990211964,
        0.04564361646771431,
        -0.04661872982978821,
        -0.11043505370616913,
        -0.08850693702697754,
        -1.1711960822601089e-32,
        0.04017271474003792,
        -0.01933230459690094,
        0.02772844024002552,
        -0.07848704606294632,
        0.054433777928352356,
        -9.850061178440228e-05,
        -0.0341644212603569,
        0.08282119035720825,
        0.040173716843128204,
        -0.04427788406610489,
        0.06985560804605484,
        -0.07895415276288986,
        -0.09714231640100479,
        -0.007064426317811012,
        -0.043262284249067307,
        -0.011344202794134617,
        -0.024205435067415237,
        -0.045321617275476456,
        0.06107217073440552,
        -0.0455738864839077,
        0.11739373207092285,
        0.10828748345375061,
        0.1016371101140976,
        -0.006937742233276367,
        0.06672730296850204,
        -0.037007320672273636,
        0.061006784439086914,
        0.08955840021371841,
        0.052946947515010834,
        0.03266307711601257,
        -0.03585908189415932,
        -0.05514464154839516,
        -0.028025155887007713,
        0.044210437685251236,
        0.02729324996471405,
        0.019714174792170525,
        0.012753567658364773,
        0.017807157710194588,
        -0.035291410982608795,
        -0.07335484027862549,
        0.04809337854385376,
        0.03717982769012451,
        0.021754711866378784,
        -0.02158913016319275,
        0.04174623265862465,
        -0.02351866103708744,
        -0.06523050367832184,
        0.10236557573080063,
        -0.0382707342505455,
        -0.02746071107685566,
        -0.07652439177036285,
        -0.06571988761425018,
        -0.031445905566215515,
        -0.0165147352963686,
        -0.08056212216615677,
        0.011136285029351711,
        -0.04732629656791687,
        -0.023092972114682198,
        0.04270300269126892,
        -0.018161039799451828,
        0.03649044781923294,
        -0.031076665967702866,
        -0.07660843431949615,
        -0.05151258409023285,
        -0.004278175998479128,
        -0.04338731989264488,
        0.022125154733657837,
        -0.00432100472971797,
        -0.03396235406398773,
        0.014600449241697788,
        -0.026829777285456657,
        -0.004232408944517374,
        -0.02615983970463276,
        -0.024719921872019768,
        0.006505936849862337,
        -0.024952834472060204,
        -0.04575323686003685,
        0.006138435564935207,
        0.010841279290616512,
        -0.034003838896751404,
        -0.009914632886648178,
        0.061288535594940186,
        0.06524170935153961,
        0.08460181951522827,
        0.12978942692279816,
        0.13185901939868927,
        0.05320267751812935,
        0.014399884268641472,
        0.008480342105031013,
        0.089779794216156,
        -0.005764043424278498,
        0.05102323740720749,
        0.043000295758247375,
        0.0864419937133789,
        -0.09036990255117416,
        -5.5174336210939146e-08,
        0.02704697847366333,
        0.007200474385172129,
        -0.0036248217802494764,
        -0.052381932735443115,
        0.015186293050646782,
        -0.08572831004858017,
        -0.08016461879014969,
        0.0012766366126015782,
        0.05266993120312691,
        -0.03458806872367859,
        0.0717770904302597,
        -0.05556252598762512,
        -0.05035441741347313,
        0.08467640727758408,
        -0.01351172849535942,
        -0.028983529657125473,
        -0.05746415629982948,
        0.10483106970787048,
        -0.034080371260643005,
        -0.0608045756816864,
        -0.06443148106336594,
        0.0539369098842144,
        0.03132273629307747,
        -0.015724297612905502,
        0.043037302792072296,
        0.05710234493017197,
        -0.0666196197271347,
        -0.05438562110066414,
        0.06906677037477493,
        0.030077317729592323,
        -0.025503182783722878,
        0.022468822076916695,
        -0.018159257248044014,
        -0.04938773065805435,
        -0.0931144580245018,
        -0.10171165317296982,
        -0.061285316944122314,
        0.0032163362484425306,
        0.006070679519325495,
        0.022444214671850204,
        0.024558795616030693,
        -0.09738242626190186,
        -0.062163785099983215,
        0.034921225160360336,
        0.012157323770225048,
        -0.09514523297548294,
        0.03705848008394241,
        -0.08320903033018112,
        0.005981235299259424,
        -0.05241633579134941,
        -0.0036047648172825575,
        -0.010181413032114506,
        0.028081942349672318,
        -0.06450854986906052,
        0.02709249220788479,
        0.009752783924341202,
        0.025420641526579857,
        -0.016317229717969894,
        -0.08551830053329468,
        0.002592007163912058,
        0.11525655537843704,
        -0.016570962965488434,
        -0.07830705493688583,
        0.03396768867969513
    ]
}