{
    "id": "6J8UyNS37GA",
    "title": "Nooooooooooooo - LG Gram + View Monitor (2022)",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-11-08T21:02:06Z",
    "video_url": "https://www.youtube.com/watch?v=6J8UyNS37GA",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "LG",
        "Gram",
        "Display",
        "View",
        "Portable monitor",
        "Overheat"
    ],
    "views": 953293,
    "likes": 28523,
    "comments_count": 1391,
    "description": "Vessi is giving away a pair of socks of your choice to the first 100 shoes sold using code SocksShortcircuit . Check out their Early Black Friday sale at   LG released a couple new Gram Laptops and a new portable monitor, but it seems that LG may be getting a bit too confident as their pricing creeps higher and higher Is the LG Gram still an easy recommendation, or should you save your money and get something different?  Buy an LG Gram:   Buy the View Monitor:    Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Intro 1:00 Picking the Best One 2:40 The 2 in 1 3:40 The IO 5:20 Sponsor - Vessi 5:50 Andy, Can I Get a Microfiber 6:45 A Problematic Keyboard 9:50 The Good 11:00 Comparing Speakers 12:33 Disappointing Display 13:50 Spec Breakdown 16:09 Wasted Space 16:50 What Can I Say? 17:21 The External Display 18:02 Outro",
    "description_links": [
        "http://vessi.com/shortcircuit",
        "https://lmg.gg/Fch5t",
        "https://lmg.gg/Si2PD",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- I didn't think you'd do it LG, I thought you just killed the gram lineup. You made some fantastic laptops. I mean, I just went around to everyone at CES 2018. We're like, \"LG has that good good.\" And then they just did nothing. They did nothing for years until now. (boxes thudding) They finally updated the LG grams. I have three and a half of them here. Let's see if they're any good now. Let's start this off with the stupid thing, here. This is the LG gram + view. I'm not entirely sure what this is. Okay, we appear to have a calendar. \"Be green with gram.\" I think this is just an external display. Yes. One second, I need to build this. One... (man screams) Okay, so this is something that exists now. It's a little cardboard pencil holder. Also with our external display we get, it looks like a very nice C to C cable. (upbeat music) Yes. Be green with LG. We only have, what, like, a hundred pages of paper also in here. (laughs) (book thuds) (objects scrape on table) So I'm thinking, Andy, what we do is we open three of them, decide which one's the best, and then focus on that one. - [Andy] Sure. - Sound good? Cool. All right, so what do we have here? (box rattles) (Alex grunts) Oh my god. We can have so many pen holders. Holy frick. (cardboard thuds) What else do we have in here? Oh, here's the two in one. I'm excited about this one right here, cause I believe it's the only LG gram you can get now that has a touch screen (finger squeaking against screen) and I really like touch screens. They have a type C to HDMI adapter. Oh, okay. That- That is because there's no HDMI port on this guy. I thought that there was, but it's only on the other models. What's up, Jonathan? - [Jonathan] Oh wow, it's a G-ram. - Oh wow, it's a laptop that will actually work with external displays. (people yelling) - Alexa's built in, that's exactly what I want. - (laughs) I switched to the MacBook 16 and I'm going to stop using it because its support for external displays is ass. - The support for his external display. - Yes. Apple users always blame it on the other thing and not the fact - [Jonathan] This is- - That they have a terribly implanted GPU. - This is interesting. Oh, what's this? These are handy to have. - Yeah. - Oh, except there's a HDMI cable built in which you can use. Which is fine. - The two in one also comes with a stylus. - [Andy] Take that, Apple. - Okay, so there's the two in one. Looks nice. He we have, I think this is a 16 inch, 45 watts over USB-C. 45 watts. So these are not super powerful. This must be the 17 inch. (boxes rustling) Oh my god, I have so many boxes. Also has 45 watt USB type C charger. So probably no GPU. Which one do we want to use, Andy? - [Andy] Two in one. - It's pretty clear here that the two in one is the one that looks by far the coolest. And also it does two in one things. If there's one thing that I remember about LG grams it's they're floppy as all heck. And look at that, geez Louise. Here is the, although not at all comparable price-wise, Apple laptop. Yep. Nothing. Not moving at all. Let's see, does that improve at all on this guy? Nope. (grunts) (laughs) Oh. Is the two in one any better? Probably not. It is. This is still pretty bad, honestly, but it's not intolerable like the other two. (sighs) How do we do this, Andy? - [Andy] We peel first. - We peel first? Okay. - [Andy] And that's from my mouth. Oh my God. - [Man] \"Remove the peel. Otherwise may be fire.\" (other man yelling) (plastic crinkles) - That was a strange peel. Here we have the LG gram two in one. (cords thump on ground) It looks like a good laptop. So on this side we have two Thunderbolt 4 ports, around here we get a USB type A, love to see it. Is that the power? I'm not entirely sure what that is. Maybe that puts your computer to sleep. And also a mini SD card reader. I really wish that the SD card reader was full sized, but it is not. Oh, well. Since we have them here, I'm going to briefly go over the IO of the other two. It's the same on the 15 and the 17. We have our micro SD card reader right here. Again, wish that it's full size, but this more than makes up for it. We also have two USB type As, heck yeah, Kensington lock. Around the other side, full size HDMI. We also have dual thunderbolts and a headphone combo. Now, one of the very large differences between the touch and non-touch versions of the gram is the display and how shiny it is. On the non-touch model, we have a matte display, and on the two in one that has touch, it is nice and shiny. This one's shining at a light right now. Let's try and get that same light there. (laughs) That's a pretty big difference in how much you can see this light just in the screen. I was going to segue to our sponsor, but we need to discuss something for a second here. Watch this, Andy. - [Andy] Oh my god, that's bad. - Ugh, that's some of the worst fingerprint magneting I have seen in ages. Good god, that's terrible. But you know what's not terrible? Vessi Footwear. Vessi Footwear is known for being lightweight, easy to pack, comfortable and most importantly water resistant, with its Dyma-tex technology. Their \"Everyday Move\" lineup is made to keep up with your active lifestyle, with its added support at the midsole and better breatheability. It also has a pull tab to make putting them on and taking them off super easy, and it's made creature-free, so you can take each step in them guilt-free. You'll want to wear them everywhere. Keep your feet dry and save $25 with our offer code \"shortcircuit\" at Vessi.com/shortcircuit. Okay, let's turn one on. Turn one on, the two in one. We're going to the two. Oh my god. Okay. Andy, can we get a microfiber cloth? I actually can't use this right now. (laughs) Oh, and it's difficult to get them off too. Geez. That's on there forever now. - [Andy] Oh my god. - It looked so good before. (laughs) Anyway, let's turn it on. - [Andy] Two seconds and it's ruined. - I really wanted to like this, but before I even turn it on, I'm seeing some issues that are kind of hard to ignore here. Yeah, there's like a bulge. That's not so bad, I could ignore that. What's really terrible though, are the keys. So if you look very closely, the control key and the left key right here are super far down. It's like below the metal of the chassis. Same with the question mark. It's like, sideways. That should not make it through quality control. LG, you should see this laptop on your production line and be like, (grunts) (man screaming) (glass breaking) Anyway, let's actually use this. First thing that I'm noticing, the screen is very wobbly. You touch it here and it just starts wibbling wobbling. I wonder if that is improved (object clatter) if you don't have a desk pad. Hmm. Okay, yes. This is substantially better now that it's not on a desk pad. So I think I'm just gonna not use this for the time being just to be nice and fair to this. The first thing that I'm noticing is that this track pad is great. I believe it is glass topped. It's a little bit hard to tell here, but it is not hard to tell with the other one. So here you're able to pretty easily see, if you look at it from an angle there, can you see that, Andy? So I'm guessing it's the same here on the two in one, given that this is the more expensive, more premium version. So this keyboard on the home row feels amazing. This is an excellent keyboard that I have right here. The problem is that as I press different keys, some of them are terrible. Like U. The U key for whatever reason just feels completely different to all of the other ones that are around it. It's slightly lower in the chassis as well. This corner right here is lower down than the ones around it. I don't know if you're gonna be able to hear this, but here is J. J is a good feeling key. (key clicks repeatedly) That's fine. Here is comma, which feels terrible. (key clicks repeatedly) I don't know if you can tell the difference just based off of that, but it has a totally different feel and a totally different sound, even. This is so terrible that I think it's broken. This laptop is, I think it starts at $1,500 and this one as specced I think is 21. Not acceptable to have a keyboard that is this (bleep). We're gonna look at the other one briefly here, to see if it happens on the other ones. The problem though, is that it's really hard to judge the force when you have this much flex. But let's just go here. (keys clacking) Nope, same thing. Terrible, awful. At least this one right here, all of the keys are properly up above the chassis, but ugh. We really need to break out our keyboard tester for these guys cause it's just not acceptable, the variance in these keys. (keys clacking) - So this keyboard is way better. This is not a bad keyboard, I'd happily type on it. - Okay, okay. I'm glad I got a second opinion. Maybe I was just being a little bit too harsh. Future Alex here, I wanted to verify that the keyboard on the LG gram actually was terrible, and not just me subjectively not liking it. - It feels nice. - It turns out, I was right. Wow. So the keyboard on this, we chucked it on the keyboard tester. We found a variance of over seven grams in the amount of force required to press the keys. So that's an over 10% variance compared to about one gram for the XPS 15, which means, objectively, I'm right, this keyboard's trash. I'm really disappointed, Andy. Okay, let's go over the good things of this laptop even though you should not buy it. The screen on this is excellent. It's an IPS display. Black levels are great. It gets bright enough. I think this one right here is 350 nits peak brightness. Same with the matte display on the other one. It's not quite as vibrant. If we look at the same background here, the matte display is just not as vibrant as the glossy display, which is just a fact of how these displays work. They're both 16 by 10, I believe they're quad HD. So the resolution is 2560 by 1600, which is just the absolute perfect resolution for a laptop like this. At 4k, you're wasting battery life and wasting computational power to just have more pixels than you need. Like this right here, in order to see a pixel I need to be here or so, something like that. These even have AI built into them so they will get mad at you if you're that close to your laptop. Oh, also they're 16 by 10. 16 by 10, just so much better than 16 by 9 for productivity. Love to see it. Good job, LG. Guessing between these two, the speakers are the same, but I could be wrong. (keys click) (music plays from first computer) Oh, that's bad. (music plays from second computer) Huh. So I feel like they are the exact same speakers as far as hardware goes, but it does sound a lot better in the non two in one version. This one right here feels kind of crushed and like there's some distortion or something. Yeah, so at about 70% volume it starts sounding way better. I'm guessing that's (music plays from computer) even more pronounced here. Yeah, so the distortion goes away at about, like, 60% volume or so. That's perfectly acceptable. Now, let's just, for comparison, have a little look at what it would be like if you had a MacBook. (music plays from computer) Here's LG gram. (music plays from LG gram) (man laughs) (laughs again) Yeah, that's not close at all. Wow. Oof. Now in fairness, I don't know where I was going with that. These are all 16, 17 inch laptops. LG doesn't really have an excuse. They have a numpad. (people gasping) You get a numpad here. (crowd clapping) So if you have no ears and you do a lot of spreadsheets, the LG gram's your laptop. (words popping) I am very curious if LG is doing a vibrant display mode cause it looks way too saturated. Also, the brightness is not even comparable. The Apple looks so much more real to life than the LG. Just from a contrast and detail that you can see perspective. To be clear, you might be able to see more details on this from the camera, but that's because this is just way more brighter and the camera might not be exposing quite correctly. I don't know how much I trust my eyes. It's the sort of thing where LTT labs very soon will be giving us proper data on displays, and I'll just be able to tell you like, \"Okay it misses by a Delta E of five,\" or something. I do not want to confidently say that this is inaccurate. Actually, that's what I want to say, it's not a super accurate display. I'm so disappointed. $2,100. - [Andy] Oof. US? (man groans) - Yeah, US. - [Andy] Oh my god. - So we can get this one that we have down here that we haven't even really talked about. So the 16 inch with an i5, and this does have the 1440P or 1600P display. This one's $1,600, (sighs) no GPU, 16 gigabytes of ram, half a terabyte SSD. Ugh. Okay, before we comment too much on the price, we need to go over the specs in details. We get an i7-12 600P, which is a fantastic processor but you only get four performance cores and eight efficiency cores. Now, it's pretty hard to complain about having 12 cores in a laptop, but at the same time, this is pretty expensive. (laughs) So if we look at the XPS 15, (groans) (laughs) Andy. - [Andy] Say it. - This laptop's (bleep) stupid. (both laugh) So this laptop as specced is $2,100. (Andy laughs) For $2,050, you can get a Dell XPS 15, which is just, it has a way better keyboard, it has a better screen, cause you're getting the 4K-O lead that is one of the best on the market. You're getting 16 gigabytes of RAM as well that is replaceable and upgradeable in the future. You get RTX 3050 TI which I should not have to tell you, wipes the floor with Iris XE graphics. It's just a better laptop. Plain and simple. Geez, we haven't said that in a while, and just came out and been like, \"This is worse.\" Future Alex again. There's a saying, \"There's no bad products, only bad pricing,\" and that is, of course, the fact here. But the pricing will get better on this for a day. On Black Friday, the two in one's gonna be $500 off, and the other ones will be $450 off, which makes them sort of competitive, unless HP's Envy two in one or the Surface laptop five or the Dell XPS or basically any other laptop also goes on sale that day. So check it out then. Okay, so what might be better about this? (laughs) We have a full HD webcam. Here we go. We have a full HD webcam in this right here. I look very orange. That isn't quite accurate to how I look in real life, but at the same time, this is perfectly acceptable for a webcam. - [Voice On Computer] Here we go we have a full HD webcam. - It's terrible. (laughs) One saving grace here is the battery. We have an 80 watt hour battery, which is nothing too crazy. The XPS 15 has an 87 watt hour battery. But when you combine that with the fact that this thing is not very powerful, you can get some serious battery life out of it. Should we rip it open, Andy? - [Andy] Yeah. - See what's on the inside? Well here's the problem. You can access the inside of the gram relatively easily, but doing so means that you need to remove these feet, and you also have to remove these little (arrows popping) plastic chummies. I'm just annoyed. There's just so much wasted space in here. It's very clear that they designed a main board and stuff for like, a 14 inch laptop and just reused it across their entire lineup. You are able to upgrade the storage. So we have two SSD spots right here. Awesome. Love to see that. Cooling's pretty anemic. Single heat pipe, single fan, really little heat sink. Ugh, Andy, what do we even say? The LG gram. It used to be fantastic because even though it was not super well-built, it was very light, had long battery life and was cheap. When you take out the, \"it being cheap\" part, (groans) I don't know what to say. You just have a laptop that is worse for more money. (laughs) So the LG gram, if you're able to find one on sale as I think I've seen some of the new ones already are, then maybe it's great. If it's not on sale, don't buy it. Oh wait, also we have an external display, I forgot about it cause I was too busy (bleep) on this product. This is a matte display, very much like the one that we have on the non two in one LG grams. Okay, so we'll throw LG a bone here. (bones whooshes) Their external display is quite good. So it's the same 1600 P panel that we got in all of these. It's matte, it looks fantastic. 99% DCI-P3, I like it. It's $350. I don't know enough about portable monitors to say if that's good or not, but I can say that if you just want something you can throw in your backpack. (knocks on monitor) This seems really not all that bad. So if you like this video you definitely don't work for LG. Hit like, hit subscribe and just have a fantastic day. See you later. (laughs) (people yelling)",
    "transcript_keywords": [
        "laptop",
        "gram",
        "display",
        "Andy",
        "good",
        "external display",
        "keyboard",
        "god",
        "terrible",
        "thing",
        "Yeah",
        "matte display",
        "bad",
        "external",
        "pretty",
        "XPS",
        "grams",
        "displays",
        "HDMI",
        "full"
    ],
    "transcript_entity_values": [
        "Alexa",
        "99%",
        "XPS 15",
        "Thunderbolt 4",
        "J. J",
        "US",
        "USB",
        "USB-C. 45",
        "Dyma-tex",
        "17",
        "350",
        "1,500",
        "1600P",
        "45 watt",
        "10",
        "LTT labs",
        "that day",
        "about 70%",
        "Black Friday",
        "Cooling",
        "over seven grams",
        "MacBook",
        "gram",
        "Dell",
        "16 gigabytes",
        "15",
        "an over 10%",
        "80 watt hour",
        "Everyday Move",
        "HP",
        "4k",
        "Louise",
        "Surface",
        "9",
        "Andy",
        "Two seconds",
        "Iris XE",
        "first",
        "16 inch",
        "Andy] Oof",
        "two",
        "GPU",
        "hundred",
        "3050",
        "XPS",
        "SD",
        "eight",
        "1600",
        "4K",
        "RAM",
        "Kensington",
        "three and a half",
        "one",
        "2560",
        "87 watt hour",
        "2018",
        "1440P",
        "Vessi Footwear",
        "25",
        "second",
        "14 inch",
        "17 inch",
        "45 watts",
        "LG",
        "DCI-P3",
        "HDMI",
        "350",
        "12",
        "1,600",
        "First",
        "five",
        "Apple",
        "half",
        "2,050",
        "500",
        "450",
        "webcam",
        "Future Alex",
        "three",
        "One",
        "a day",
        "60%",
        "AI",
        "IO",
        "21",
        "16",
        "a fantastic day",
        "about one gram",
        "2,100",
        "four",
        "Two",
        "Voice On Computer",
        "years",
        "XPS",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERCENT",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERCENT",
        "EVENT",
        "PERSON",
        "QUANTITY",
        "FAC",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "TIME",
        "PRODUCT",
        "ORDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "MONEY",
        "GPE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON"
    ],
    "vector": [
        -0.13356176018714905,
        -0.07223273068666458,
        0.02021779492497444,
        -0.06651843339204788,
        0.08366939425468445,
        0.06822602450847626,
        -0.015352747403085232,
        0.07931025326251984,
        0.0015625497326254845,
        0.024090928956866264,
        0.037220343947410583,
        0.02786150574684143,
        -0.029805002734065056,
        -0.017956428229808807,
        0.009996328502893448,
        -0.032086875289678574,
        0.03593797981739044,
        -0.05330302193760872,
        -0.05863881856203079,
        -0.06893575936555862,
        -0.0070487698540091515,
        -0.06907425075769424,
        -0.010482733137905598,
        0.017784317955374718,
        0.04053625464439392,
        -0.034461427479982376,
        -0.03826599195599556,
        -0.03812199831008911,
        0.03116092085838318,
        -0.01813783496618271,
        -0.015260182321071625,
        0.056402724236249924,
        -0.0017387383850291371,
        0.020551880821585655,
        -0.053192321211099625,
        -0.03629537299275398,
        0.02028944157063961,
        -0.1054692491889,
        -0.05228237807750702,
        -0.03871366009116173,
        -0.011565486900508404,
        -0.0916021391749382,
        -0.033148277550935745,
        -0.006903258617967367,
        -0.020777838304638863,
        -0.06942085176706314,
        0.05211232975125313,
        0.007772296201437712,
        -0.019909018650650978,
        0.03808797523379326,
        -0.0010011098347604275,
        -0.0630578026175499,
        0.05072491616010666,
        -0.023633915930986404,
        -0.07562585175037384,
        0.00937880203127861,
        -0.046131495386362076,
        -0.0023228120990097523,
        0.07641462236642838,
        0.026233812794089317,
        0.005845794454216957,
        -0.005434388294816017,
        -0.07324325293302536,
        0.08068716526031494,
        -0.01521332561969757,
        -0.013683369383215904,
        0.0037993378937244415,
        0.03804941847920418,
        -0.017373500391840935,
        0.05938795953989029,
        -0.06966662406921387,
        -0.010522980242967606,
        0.06866860389709473,
        0.10142907500267029,
        -0.022117050364613533,
        0.027026863768696785,
        0.0667559951543808,
        -0.10648338496685028,
        0.07611559331417084,
        -0.018012257292866707,
        0.017651205882430077,
        -0.00629123579710722,
        -0.003455312456935644,
        0.03862214833498001,
        0.012945368885993958,
        -0.11326093971729279,
        0.07396720349788666,
        0.05633018910884857,
        -0.010948640294373035,
        -0.12078779935836792,
        0.04600217565894127,
        0.08043955266475677,
        0.024808039888739586,
        0.03290008753538132,
        -0.084231898188591,
        0.033786579966545105,
        -0.04279671981930733,
        -0.0034432336688041687,
        -0.03436076641082764,
        0.07803655415773392,
        0.07560684531927109,
        0.11371489614248276,
        0.07891344279050827,
        -0.021322159096598625,
        -0.06619198620319366,
        -0.11719685792922974,
        0.0038462805096060038,
        0.08184309303760529,
        0.022077182307839394,
        -0.01025712862610817,
        -0.031256336718797684,
        0.08034903556108475,
        -0.054760947823524475,
        -0.01929345168173313,
        -0.0426025390625,
        0.04379649832844734,
        -0.013515199534595013,
        0.017889373004436493,
        0.1120690405368805,
        0.04816151037812233,
        -0.029754023998975754,
        -0.02100222185254097,
        -0.002979452721774578,
        -0.023236680775880814,
        0.011528994888067245,
        0.04255281388759613,
        -0.01526662427932024,
        5.364253859278304e-33,
        -0.03060455247759819,
        0.08634775876998901,
        -0.07555235177278519,
        -0.1327267587184906,
        -0.0056321886368095875,
        0.04194658249616623,
        -0.0021832638885825872,
        0.08812928944826126,
        -0.043416257947683334,
        0.03470434620976448,
        -0.017726974561810493,
        0.06606940180063248,
        -0.08472539484500885,
        0.030999405309557915,
        0.023276984691619873,
        -0.006661404389888048,
        -0.027369072660803795,
        0.06218595802783966,
        -0.035377636551856995,
        -0.030664019286632538,
        -0.03260849416255951,
        -0.07094642519950867,
        0.02058173529803753,
        -0.05383378267288208,
        0.05069322511553764,
        0.05105011910200119,
        0.09334824979305267,
        0.006439608987420797,
        0.03310733288526535,
        0.044991184026002884,
        0.02865605428814888,
        -0.04934467002749443,
        0.023137053474783897,
        -0.04813668876886368,
        -0.10110732913017273,
        -0.07232613116502762,
        -0.08861062675714493,
        -0.08894810080528259,
        0.07783064991235733,
        -0.07033262401819229,
        0.016466880217194557,
        0.05620615929365158,
        -0.032538097351789474,
        -0.1060355007648468,
        0.004582493100315332,
        0.09642940014600754,
        0.041970252990722656,
        0.011261139996349812,
        0.04037731885910034,
        0.01290851179510355,
        0.014395929872989655,
        -0.03825249895453453,
        -0.09009266644716263,
        -0.08015874773263931,
        -0.014871502295136452,
        -0.014449280686676502,
        -0.018995238468050957,
        -0.009344955906271935,
        0.06975255161523819,
        -0.004114337265491486,
        -0.012469438835978508,
        0.06713518500328064,
        0.055633753538131714,
        -0.010059387423098087,
        -0.03226702660322189,
        0.0048793707974255085,
        0.05467100441455841,
        -0.01998404785990715,
        -0.13554322719573975,
        -0.01610899157822132,
        -0.021511266008019447,
        -0.06997618079185486,
        0.05188336968421936,
        0.005663638468831778,
        0.029107490554451942,
        0.011435641907155514,
        -0.013814552687108517,
        -0.03377301245927811,
        -0.035277366638183594,
        -0.029954100027680397,
        -0.04755176976323128,
        -0.029686039313673973,
        0.09694931656122208,
        0.03887740895152092,
        0.011873060837388039,
        -0.014501958154141903,
        -0.01046859659254551,
        -0.034559473395347595,
        -0.041933950036764145,
        0.01728055067360401,
        -0.037059854716062546,
        0.008102955296635628,
        -0.05879359692335129,
        0.003549213521182537,
        -0.021736782044172287,
        -6.861625746662596e-33,
        -0.03262149542570114,
        0.07135144621133804,
        -0.04008125141263008,
        0.019720785319805145,
        0.007435265928506851,
        -0.03445857763290405,
        0.06121547147631645,
        0.02295868843793869,
        0.0664207935333252,
        0.011044859886169434,
        9.034044342115521e-05,
        0.0013049881672486663,
        -0.09897494316101074,
        0.0023073595948517323,
        0.0454283244907856,
        -0.07279463857412338,
        0.014779981225728989,
        -0.08906630426645279,
        0.00606704642996192,
        -0.008864715695381165,
        0.05033474043011665,
        0.042371008545160294,
        0.0011589364148676395,
        0.08535788953304291,
        0.041640374809503555,
        0.004793188069015741,
        0.07404401898384094,
        0.07481193542480469,
        -0.0710405558347702,
        0.003937544766813517,
        0.026301169767975807,
        -0.07110165804624557,
        0.006655003875494003,
        0.011371469125151634,
        0.04796668514609337,
        -0.04226851090788841,
        0.043407145887613297,
        0.03622816503047943,
        0.007635464891791344,
        0.041250210255384445,
        0.05326581746339798,
        0.013962368480861187,
        0.04579787328839302,
        -0.03929878771305084,
        -0.0013777174754068255,
        -0.0715281069278717,
        0.015365215949714184,
        -0.04989561438560486,
        0.0028166293632239103,
        -0.022522103041410446,
        -0.06781996786594391,
        0.012856493704020977,
        0.036430373787879944,
        -0.045210834592580795,
        -0.11738158017396927,
        0.042641814798116684,
        -0.0949118360877037,
        0.032879337668418884,
        -0.06888706982135773,
        -0.024686405435204506,
        -0.004574212711304426,
        -0.011119715869426727,
        -0.04731607437133789,
        -0.0414649173617363,
        0.026391172781586647,
        -0.016558250412344933,
        0.05148348957300186,
        -0.01677902229130268,
        0.031459610909223557,
        -0.03117295913398266,
        0.03978242725133896,
        -0.023463023826479912,
        -0.028719887137413025,
        -0.06463493406772614,
        -0.03890224173665047,
        0.09127094596624374,
        0.07493823766708374,
        -0.027237743139266968,
        0.025423431769013405,
        -0.06881215423345566,
        0.04751377925276756,
        0.021996721625328064,
        0.04779893159866333,
        -0.052422408014535904,
        0.07841569185256958,
        0.0014019132358953357,
        -0.039166126400232315,
        0.037640511989593506,
        0.0010870826663449407,
        0.009465760551393032,
        -0.06070191413164139,
        0.07593676447868347,
        -0.02280576154589653,
        0.02487908862531185,
        0.09613288938999176,
        -6.010228759123493e-08,
        0.010083192959427834,
        0.03817171975970268,
        0.05241684243083,
        0.06000405550003052,
        0.001200085156597197,
        -0.10042460262775421,
        -0.0363938994705677,
        0.01575552485883236,
        0.04299624264240265,
        0.040140505880117416,
        0.006319886073470116,
        -0.11731227487325668,
        -0.0791124552488327,
        0.04143257066607475,
        -0.017834311351180077,
        0.015374165028333664,
        -0.0292971171438694,
        0.043068777769804,
        -0.07941126823425293,
        0.043246377259492874,
        0.02939482592046261,
        0.032305795699357986,
        0.082334965467453,
        0.04256482049822807,
        0.029750851914286613,
        -0.0005740850465372205,
        0.03389772027730942,
        0.01858856901526451,
        0.11371724307537079,
        -0.015042339451611042,
        0.005083668511360884,
        0.061122797429561615,
        -0.015683390200138092,
        0.007213263772428036,
        -0.0022066382225602865,
        -0.045652277767658234,
        -0.08532961457967758,
        0.02390994131565094,
        0.06654415279626846,
        0.08274640887975693,
        0.02062246948480606,
        -0.07118077576160431,
        -0.043556176126003265,
        0.025342069566249847,
        -0.003702211193740368,
        -0.01450792234390974,
        -0.0046376390382647514,
        -0.06466664373874664,
        0.005794872529804707,
        0.03635594621300697,
        -0.019030602648854256,
        -0.0990849956870079,
        -0.029368096962571144,
        -0.021234771236777306,
        0.015234759077429771,
        -0.06688083708286285,
        -0.0202212892472744,
        0.0706239715218544,
        -0.010068872943520546,
        0.059441786259412766,
        0.018327105790376663,
        -0.1398603767156601,
        -0.06775587797164917,
        0.049214862287044525
    ]
}