{
    "id": "6KPrstpPQms",
    "title": "Can You Game on a Mac? (2018)",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-05-10T16:30:47Z",
    "video_url": "https://www.youtube.com/watch?v=6KPrstpPQms",
    "category": "Science & Technology",
    "tags": [
        "mac gaming",
        "mac",
        "macbook gaming",
        "gaming on a mac",
        "macbook pro gaming",
        "best mac games",
        "geforce now",
        "macbook pro",
        "macbook",
        "gaming",
        "gaming on macbook",
        "mac games",
        "gaming on mac",
        "can you game on a mac",
        "gaming on macbook pro",
        "cloud gaming",
        "tech",
        "austin evans",
        "thunderbolt 3",
        "external gpu",
        "fortnite",
        "onecast",
        "steam",
        "steam mac"
    ],
    "views": 1441823,
    "likes": 28082,
    "comments_count": 2343,
    "description": "With Thunderbolt 3 external GPU for the Mac, MacBook gaming in 2018 is a lot more interesting. Gigabyte AMD RX 580 Thunderbolt 3 Gaming Box on Amazon:  Sign up for GeForce NOW beta:  OneCast Xbox One game stream on Mac:   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://austin.tech/gamingbox",
        "https://www.nvidia.com/en-us/geforce/products/geforce-now/mac-pc/waitlist/",
        "https://onecast.me/",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. Over the years we've done a lot of videos exploring whether or not you can game on a Mac. Spoiler alert, usually the answer is yes, but not all that well. However, it's 2018 and some things have recently changed. Now the last time we did this video we were trying it on a $200 MacBook. And as you imagine for something that is so old, the results weren't all that impressive. But today, we have a 2016 15 inch MacBook Pro in front of us as well as a whole host of toys that are fresh and ready to go. Sounds like I'm describing a pizza. I'm describing gaming computers. Because, um. Hi. Now the simplest way to game on a Mac is going to be to use a streaming service such as Nvidia's GeForce NOW. Now this is actually something that was able to work all the way onto the $200 laptop. And personally, as far as I'm concerned, it's one of the better ways of gaming here, as long as you have a decent internet connection. The way the streaming service like GeForce NOW works is that instead of running it on your computer, which could be a problem if you're running a Mac and therefore can't play a lot of games, is that instead it's going to be streaming it from the cloud. Now the main thing to keep in mind here is that you do need to have a good internet connection. So especially when you're playing like high intensity games such as Fortnite for example, having a good internet connection is going to be hugely vital. Alright, we're in the game. So there's a couple things you are going to notice with a setup like this. First of all, there's going to be latency. There's always going to be some latency. So, for this it's, I don't know, it's hard to tell just based on looking at it. I'd say maybe it's like a quarter of a second or so. It doesn't seem to be too bad. But something else that's going to be noticeable is the reduction in image quality. Because you're essentially just looking at a video feed as opposed to playing the game natively. Depending on your connection, you will see some artifacts. Although, to be honest, this looks pretty close to a native set up right now. As long as you have a good internet connection, I really feel like GeForce NOW is worth a shot. Now the only thing you should keep in mind is that while it is free, it's going to be in beta right now. And so unless you've actually signed up in the past, there is going to be a wait list, so it might be a little while before you can actually get your hands on the service. But for free, especially if you wanna be able to play games on the go on something like a Mac, it really actually does make a lot of sense. Also as a side note, GeForce NOW is available on PC as well. So if you guys want more information on how it works, and especially on the PC side of things, I did do a full video at CES this year that you guys can go check out. Continuing on the streaming train, we have OneCast. So if you guys are familiar with Xbox One streaming on a Windows PC, it's really straightforward. So basically as long as you have your Xbox and your Windows computer on the same network, you can stream games from your Xbox to your PC. And generally speaking, when you're over a very short distance, say, you know, a local network, latency's not going to be too bad. And with OneCast, that brings that same functionality to the Mac. I actually haven't tried this yet, so let's give it a try. The app is pretty straightforward, you just need to install the drivers for your Xbox One controller. Which you're going to need. And then once you log in to your Xbox account, we hit connect, it should get us on to our Xbox. Yeah, there we go. So, if I try to scroll through here, it seems to be just like I'm playing on a normal Xbox. Alright, we're in the game. The first thing I'll say is that the video quality is kind of so-so. Looks like there's more compression than there was with GeForce NOW. Yeah, it does seem like there's a little bit more lag than there was with GeForce NOW. The image quality is definitely not as nice. Now to be fair, you should always expect some latency. But considering that instead of running on a server, who knows how many miles away, I'm running on an Xbox, that's only a few feet away. That's a little bit annoying. Yeah, I mean it's a $20 program, which is definitely not going to be cheap. Luckily there is going to be a free trial, so you can give it a try and if it sucks you can bail on it. But, I've gotta say I'm actually kinda disappointed. I think, think we can do better. Now as with any computer, whether it be PC or Mac, the GPU matters when it comes to gaming. Now higher end Macs such as the iMac, as well as the MacBook Pro 15 inch that I have here, actually do have somewhat decent GPUs inside. However when it comes to lower end stuff, such as the 13 inch MacBook Pro, the 12 inch MacBook, as well as the MacBook Air, they're all going to have integrated graphics and are going to have a lot more trouble gaming. At least right out of the box. Now external Thunderbolt enclosures are nothing new. But they have gotten a lot better and they've gotten a lot more well supported. You can see, something like an RX 580 can fit in a nice small package. But on top of that, this also will work on Windows. All you need is a Thunderbolt 3 port, and it should be good to go. Just keep in mind that you should connect your display to the actual graphics card, as opposed to your computer. It will definitely help alleviate any kind of bottlenecks in the actual Thunderbolt 3 interface, but once you hook it up, it should be a very seamless setup. So to start out with, we're going to be using the MacBook Pro 15 inch with it's standard graphics card. And we're going to be using a little game called Rocket League. So using my Xbox One controller, I'm curious to see what kind of performance we're gonna get here. I was able to actually crank the graphics pretty much all the way up. And it actually is not going to be too bad. So as some of you guys are probably aware, Steam is supported on the Mac. And if you buy a game on Steam for Windows, you are going to be able to play it on the Mac, provided that there is another version. This is actually not bad at all. We're getting 68 frames per second or so here, 67, wow this is totally playable. Next up, let's try to see what we can do with the actual gaming box connected. So like I was saying earlier, the setup is going to be really straightforward. We've got Thunderbolt 3 into the box, and then we've got the box going to DisplayPort, into the monitor. This is pretty nice and smooth. Although I've gotta say, the frame rate actually is not going to be a huge difference. So as opposed to being in the mid 60s, instead we're somewhere in the 80s. Oh, there we go, alright. I will say one thing, even though this is not making a massive difference, Rocket League is surprisingly playable on Mac. I honestly really can't see any major differences. And especially with a nice high refresh rate monitor. The performance is really not going to be too bad. So to put this whole setup to the test a little bit more, we have Deus Ex: Mankind Divided. Now this is a game that is well known to be very taxing. But it's also an interesting title because it does support Metal. Essentially the macOS version of something like DirectX 12 or Vulkan. So for some context, we're running this right now at 1080p very high settings, on the MacBook GPU. As you can see, performance isn't exactly great. We're getting somewhere in the neighborhood of well, exactly 14 frames per second. So move over to the Gigabyte Gaming Box with the RX 580 inside, and we get to see something that's a lot more cinematic. With a whopping 24 or actually 25 frames per second now. Keep in mind, this is obviously not going to be an ideal scenario, we would really wanna probably turn the graphic settings down a little bit. But this does show that we're getting somewhere in the neighborhood of about double the performance by plugging in an external GPU. Next up, we have DiRT Rally. And this is a game that has some slight issues on Mac. Most notably when you have dual monitors. So I had to bust out the keyboard and close the MacBook display, so we're only running on one monitor. But, here running at 1080p on ultra settings on the MacBook's GPU, we're getting somewhere in the neighborhood of 35 to 40 frames per second. Definitely playable, but it's not going to be the smoothest experience in the world. Now if we plug in the Gaming Box, what we're seeing is there is going to be a little bit of a performance difference, but it's actually not going to be that big. So for certain scenes when you've got the full car in view, it's going to be only a few frames per second higher. And right now, we're a little bit more in the 40s, Although even here, look, it's dipping to like 38, 39. It's a little unusual, I'm not sure if DiRT needs an update to fully support it, or something's going on here, but it's a little bit better, not by a lot though. Moving right along, we have Fortnite, for what feels like the 18th time in this video. So this is running on the MacBook, and right now we're actually running it at pretty decent settings. This is going to be 1080p on high. And at least in the sky here, it's not too bad. And when it starts jumping out and it starts tanking, and ooh, wow, that's, okay. Spoke too soon. 'Kay. Nothing like a whole lotta four frames per second... Ah, there we go, that's better. So it seems like we are hovering around the 30 to 40 frames per second mark, but man that stuttering is not good. But I actually do wanna get a good sense of what the MacBook can do on the same settings as what we're going to be able to run with the RX 580. Woo, that's a, oh yeah, that's stuttery. So with our RX 580, what we're seeing here is, immediately a much higher frame rate. We're getting somewhere in the neighborhood of 40 to 50 but weirdly we're still seeing that same stuttering issue. I'm not really sure what that is. I mean it doesn't feel like it's going to be a network thing. It's not like a latency sort of issue. Because I mean, I even get it some times when I'm just sort of scrolling around here. It's interesting, generally speaking, Fortnite is a very well optimized game on everything from Windows PCs to iOS, but here on Mac, it seems like it's got some issues. Okay so now that we've actually spawned, everything seems to be smoothed out a little bit. It's a weird issue, 'cause it doesn't seem to be related to sort of the power. I mean right now, this is totally playable. I'm getting a solid 50 frames per second, 1080p high, I don't have any complaints. Oh, but there we go, we start stuttering. Oh, then, that's brutal. So as you guys can see, gaming on a Mac has evolved. The idea that you can use an external GPU really does make a big difference. Especially to lower end Macs. However, the software support is definitely not fully there yet. So I'm curious, what do you guys think about gaming on a Mac? Is it something you would ever try? Or is it something that's best left to trained professionals? Let me know in the comments below. And I will catch you in the next one.",
    "transcript_keywords": [
        "Mac",
        "Xbox",
        "MacBook",
        "game",
        "MacBook Pro",
        "gaming",
        "running",
        "frames",
        "lot",
        "bit",
        "inch MacBook Pro",
        "Windows",
        "GPU",
        "gaming box",
        "guys",
        "Austin",
        "box",
        "MacBook GPU",
        "end Macs",
        "GeForce"
    ],
    "transcript_entity_values": [
        "39",
        "only a few feet",
        "13 inch",
        "68",
        "Deus Ex:",
        "the MacBook GPU",
        "30 to 40",
        "this year",
        "Metal",
        "Vulkan",
        "MacBook",
        "18th",
        "2018",
        "MacBook",
        "67",
        "first",
        "the MacBook Pro 15 inch",
        "35 to 40",
        "RX",
        "Xbox",
        "25",
        "Windows",
        "Rocket League",
        "Xbox",
        "Thunderbolt 3",
        "the 40s",
        "four",
        "the years",
        "Austin",
        "50",
        "one",
        "Kay",
        "580",
        "second",
        "the MacBook Pro 15",
        "iMac",
        "the MacBook Air",
        "MacBook Pro",
        "CES",
        "200",
        "Nvidia",
        "Xbox One",
        "2016 15",
        "Fortnite",
        "Mac",
        "GeForce",
        "Macs",
        "DisplayPort",
        "the mid 60s",
        "1080p",
        "the Gaming Box",
        "40 to 50",
        "1080p",
        "Thunderbolt",
        "Mac",
        "38",
        "DiRT Rally",
        "14",
        "GPU",
        "today",
        "OneCast",
        "First",
        "20",
        "24",
        "DirectX 12"
    ],
    "transcript_entity_types": [
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "FAC",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "FAC",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "DATE",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "DATE"
    ],
    "vector": [
        -0.03659636899828911,
        -0.01691659353673458,
        0.0004770880041178316,
        -0.07272788137197495,
        0.01226825825870037,
        -0.040647685527801514,
        -0.0570458248257637,
        -0.040748585015535355,
        0.002420761389657855,
        0.002067484427243471,
        -0.025662461295723915,
        0.01572096161544323,
        -0.0008290901896543801,
        -0.003831573063507676,
        0.08904664218425751,
        -0.020745547488331795,
        0.13743485510349274,
        -0.024069001898169518,
        0.003309153486043215,
        0.11175499856472015,
        0.019481651484966278,
        -0.08651883155107498,
        -0.09955781698226929,
        -0.04172958806157112,
        -0.04152274131774902,
        0.04820340871810913,
        0.08651759475469589,
        0.02535785362124443,
        -0.13388878107070923,
        0.005905433092266321,
        -0.0041625830344855785,
        -0.03209654614329338,
        0.010026617906987667,
        0.008937334641814232,
        0.05168937146663666,
        -0.03707702085375786,
        0.0017213932005688548,
        -0.1068539023399353,
        -0.08955027163028717,
        -0.08311769366264343,
        -0.034401535987854004,
        -0.0004491471336223185,
        0.07818454504013062,
        0.07323859632015228,
        0.048345841467380524,
        -0.026916317641735077,
        -0.03251272439956665,
        -0.04566337913274765,
        0.0247998908162117,
        -0.019201939925551414,
        -0.06503833830356598,
        -0.05121804401278496,
        0.03271977975964546,
        0.007483736611902714,
        0.037596262991428375,
        0.06351609528064728,
        -0.015491741709411144,
        -0.0550086535513401,
        0.03789406642317772,
        0.04965777322649956,
        -0.02096116729080677,
        -0.12388183176517487,
        0.030977262184023857,
        0.09817706048488617,
        -0.01662478968501091,
        -0.04754450172185898,
        0.030767779797315598,
        -0.034827820956707,
        -0.021413326263427734,
        -0.04520560801029205,
        0.0675748884677887,
        0.007188060320913792,
        0.010034367442131042,
        0.01004716195166111,
        0.01832698844373226,
        0.057375237345695496,
        -0.0021138524170964956,
        -0.04042794927954674,
        0.025581706315279007,
        0.04090322181582451,
        -0.054120127111673355,
        -0.00103328051045537,
        -0.0407886877655983,
        -0.047726646065711975,
        -0.0031460083555430174,
        -0.01082902867347002,
        0.005055028013885021,
        0.06674432754516602,
        -0.06866499036550522,
        0.017872849479317665,
        -0.06529945880174637,
        0.008520523086190224,
        0.08837070316076279,
        0.06691446155309677,
        -0.024735769256949425,
        -0.0985003337264061,
        0.008431170135736465,
        -0.14076092839241028,
        -0.03242732211947441,
        0.0067481426522135735,
        -0.06619548052549362,
        0.07633363455533981,
        0.1142088919878006,
        0.0008468700107187033,
        0.014547116123139858,
        0.0019711514469236135,
        -0.05406336113810539,
        0.06461034715175629,
        -0.005558777134865522,
        0.04151506721973419,
        -0.04999801516532898,
        0.002495784079656005,
        -0.024554267525672913,
        0.012647205032408237,
        -0.00680334260687232,
        0.012414610013365746,
        -0.028157787397503853,
        -0.029619727283716202,
        0.01829332672059536,
        -0.0039418223313987255,
        0.027948644012212753,
        -0.030726755037903786,
        0.015457828529179096,
        0.00307490979321301,
        0.09237547218799591,
        -0.049462638795375824,
        -0.019994108006358147,
        2.1398759773796386e-33,
        -0.02293887361884117,
        -0.043836843222379684,
        0.025913093239068985,
        -0.027542924508452415,
        0.049021825194358826,
        -0.023266935721039772,
        0.09531350433826447,
        0.03965146467089653,
        -0.04549752175807953,
        0.005196248646825552,
        -0.057612065225839615,
        0.05423537641763687,
        -0.03823213651776314,
        0.08445868641138077,
        0.10605358332395554,
        0.009199678897857666,
        0.007136709988117218,
        -0.04500649496912956,
        0.00037525591324083507,
        0.032538462430238724,
        0.011616109870374203,
        -0.02995394915342331,
        0.04762702435255051,
        -0.09873349964618683,
        -0.01939522661268711,
        0.04502442479133606,
        -0.06591964513063431,
        -0.04459189251065254,
        0.0870131179690361,
        0.03651459142565727,
        -0.06121346354484558,
        -0.07188430428504944,
        -0.066031813621521,
        -0.03581542894244194,
        0.04046237841248512,
        0.017416350543498993,
        0.006039602216333151,
        -0.03359656408429146,
        -0.01543648075312376,
        0.07851872593164444,
        -0.0645439475774765,
        -0.02284778468310833,
        -0.07101300358772278,
        -0.06715643405914307,
        -0.042310863733291626,
        0.001954898703843355,
        0.05741582810878754,
        -0.029137225821614265,
        -0.15618698298931122,
        0.038195669651031494,
        0.013082350604236126,
        0.045360393822193146,
        0.02439279854297638,
        -0.004541052971035242,
        -0.037798430770635605,
        -0.030316447839140892,
        0.06129801645874977,
        0.04231921583414078,
        0.10194600373506546,
        0.04852176457643509,
        0.0002506334858480841,
        0.04049694165587425,
        0.011388136073946953,
        0.05454263091087341,
        -0.09627002477645874,
        0.05743749439716339,
        0.08451272547245026,
        0.015131606720387936,
        -0.031823478639125824,
        0.06313098222017288,
        0.029761992394924164,
        -0.017407488077878952,
        0.01693560928106308,
        -0.06144211068749428,
        0.03622547164559364,
        0.02249477431178093,
        -0.07538043707609177,
        0.005132448859512806,
        0.004286625422537327,
        0.048084668815135956,
        0.045300696045160294,
        -0.02810974046587944,
        -0.021230462938547134,
        0.01627321168780327,
        -0.08765262365341187,
        0.08887364715337753,
        0.0394614040851593,
        0.025473695248365402,
        -0.0030591636896133423,
        -0.0006832731887698174,
        -0.019244099035859108,
        -0.01661953330039978,
        0.07852697372436523,
        0.014689205214381218,
        -0.005736093968153,
        -4.59726032575607e-33,
        -0.025042761117219925,
        -0.07463415712118149,
        -0.013403743505477905,
        0.019478293135762215,
        -0.01854214072227478,
        0.03025948628783226,
        0.04178977385163307,
        -0.04623876512050629,
        -0.07040910422801971,
        -0.0932849571108818,
        -0.050398942083120346,
        0.036269742995500565,
        0.019595401361584663,
        -0.04686620458960533,
        -0.021219011396169662,
        -0.010357452556490898,
        -0.08027363568544388,
        -0.0014475233620032668,
        -0.07492887228727341,
        -0.023024173453450203,
        -0.07240203768014908,
        -0.06484629213809967,
        -0.008208021521568298,
        -0.05764973908662796,
        -0.003861221019178629,
        0.0420546717941761,
        0.04634499549865723,
        -0.0015757463406771421,
        -0.028339380398392677,
        0.009827722795307636,
        0.0015585992950946093,
        0.049620404839515686,
        0.04366573691368103,
        -0.020181363448500633,
        0.08958003669977188,
        0.07450579851865768,
        0.03748629614710808,
        -0.019110191613435745,
        0.028351210057735443,
        -0.029105035588145256,
        0.02139551006257534,
        0.006330873817205429,
        -0.03812583535909653,
        0.09532628208398819,
        0.024554016068577766,
        0.08491930365562439,
        -0.027892092242836952,
        -0.04987376183271408,
        0.041929859668016434,
        0.007998494431376457,
        -0.055133670568466187,
        -0.031751636415719986,
        0.020462986081838608,
        -0.05662625655531883,
        -0.018436426296830177,
        -0.039246950298547745,
        -0.08054597675800323,
        0.037522148340940475,
        0.03777831047773361,
        -0.06224304437637329,
        0.006331459619104862,
        -0.05450006201863289,
        0.012713071890175343,
        -0.005751041695475578,
        0.06694832444190979,
        -0.02953631430864334,
        -0.014048009179532528,
        -0.049274593591690063,
        0.05729770287871361,
        0.008641988039016724,
        -0.022990448400378227,
        0.03767162561416626,
        0.01723991334438324,
        -0.01173065509647131,
        -0.02437027543783188,
        0.04636647552251816,
        0.031228484585881233,
        -0.06336219608783722,
        -0.011082638055086136,
        0.031371988356113434,
        0.006299010012298822,
        0.06053769215941429,
        0.05975401774048805,
        0.035988517105579376,
        0.031235607340931892,
        -0.0667143389582634,
        0.05145353451371193,
        -0.020877765491604805,
        -0.08295415341854095,
        -0.03972449526190758,
        -0.0441991463303566,
        0.11716222763061523,
        -0.019573437049984932,
        -0.007020601071417332,
        -0.030278358608484268,
        -6.015581277551973e-08,
        0.008069030940532684,
        -0.018263835459947586,
        0.01060958206653595,
        0.08719341456890106,
        -0.05171829089522362,
        -0.013107567094266415,
        0.04382245987653732,
        -0.11369899660348892,
        0.1254095882177353,
        0.05450771376490593,
        0.0440589115023613,
        -0.02912565879523754,
        -0.02903360314667225,
        -0.04760219529271126,
        0.008936457335948944,
        0.05684865266084671,
        0.02895236574113369,
        0.017704306170344353,
        -0.00015917351993266493,
        0.061220500618219376,
        4.050958887091838e-05,
        0.1062912717461586,
        0.030496949329972267,
        0.01160984393209219,
        -0.042033031582832336,
        -0.003987431526184082,
        -0.05884947627782822,
        0.015730442479252815,
        -0.006469351705163717,
        0.0264742374420166,
        -0.04397289454936981,
        -0.029503634199500084,
        0.03370143100619316,
        0.07019713521003723,
        0.0643162652850151,
        -0.15616200864315033,
        -0.0013122055679559708,
        0.08141668885946274,
        0.04805385321378708,
        -0.029650654643774033,
        -0.03393898159265518,
        -0.07776609063148499,
        -0.11425910890102386,
        -0.04868733137845993,
        -0.01151120662689209,
        -0.018974991515278816,
        -0.13042370975017548,
        -0.06983692944049835,
        -0.0865500420331955,
        0.08573143184185028,
        0.027315733954310417,
        0.0797046422958374,
        -0.014275635592639446,
        0.0042656464502215385,
        0.09968879818916321,
        0.06771373003721237,
        0.021092597395181656,
        -0.04330236092209816,
        -0.013089562766253948,
        0.02525325119495392,
        0.012428785674273968,
        -0.031151775270700455,
        0.004671919159591198,
        0.07350210845470428
    ]
}