{
    "id": "6lxGU66w0NM",
    "title": "HoloLens 2: inside Microsoft's new headset",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-02-24T17:20:07Z",
    "video_url": "https://www.youtube.com/watch?v=6lxGU66w0NM",
    "category": "Science & Technology",
    "tags": [
        "microsoft hololens 2",
        "hololens",
        "microsoft",
        "holograms",
        "headset",
        "augmented reality",
        "ar headsets",
        "mixed reality",
        "mr",
        "vr",
        "ar",
        "virtual reality",
        "vr headsets",
        "development",
        "developer",
        "microsoft build",
        "windows",
        "designers",
        "tech news",
        "android",
        "mwc",
        "mwc 2019",
        "2019",
        "mobile world congress",
        "dieter bohn",
        "mwc barcelona",
        "hands on",
        "first look",
        "did you know",
        "upcoming phones 2019",
        "release date",
        "price",
        "review",
        "latest updates",
        "event",
        "gadgets",
        "tech",
        "technology",
        "apple",
        "google",
        "barcelona",
        "verge",
        "the verge"
    ],
    "views": 1138558,
    "likes": 17830,
    "comments_count": 1269,
    "description": "Microsoft is making a new HoloLens headset, called HoloLens 2. But, it's only getting sold to companies, not consumers. Meant for professionals who work with their hands and not on computers, the new HoloLens has an improved field of view and doesnt clip as much as the original. Dieter Bohn visited Microsofts campus to get an early look at the new HoloLens 2 headset.  Read more here:   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Listen to our podcasts:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2NnDqQ4",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(electronic sounds) - This is the HoloLens 2 and compared to the first version, it's a little bit lighter and little bit smaller, but when you put it on, what you see is way bigger. It's due out much later this year for $3,500, but that's only getting sold to companies, not consumers. Still, the tech inside this thing is seriously impressive, let's talk about why. By the way, I should just say now that if you've ever listened to The Vergecast, you know that I always disclose, when I talk about these things, that my wife works for Oculus, which is part of Facebook, but that doesn't affect how I think about this tech. So a lot has changed with the HoloLens in the two years since the first developer version shipped. Even though, what Microsoft is showing off is still pretty early as a prototype and it has a bunch of half-finished software in it, I think it's a big leap forward, at least from a tech perspective. All of those changes began with a decision that Microsoft had to make, to fix the original Hololens' biggest problem, the field of view was just too small. You'd see holograms in front of you, sure, but only directly in front of you and they'd clip out of existence if you just turned your head a little bit. To fix that, Microsoft had to go with an entirely different kind of display technology, like the Vaunt and the North smart glasses, Hololens 2 uses lasers to create a MEMS display, but instead of shining an image directly into your retina, Microsoft's laser goes into these wave guides that sit in front of your eyes. It works by having lasers hit mirrors that scan 54,000 times per second and they direct photons into the wave guides. So to make a bigger image, all Microsoft has to do is increase the angle of the mirrors and it can get really bright. The images that I saw were at 500 nits and each eye had the equivalent of a 2K resolution display, the result is that you get a wider field of view, the holograms don't clip as much and they just feel more natural, they have a higher density too, they just feel more real. Microsoft is thumping its chest about this technology too, here's quote, There is no competition for the next two or three years that can come close to this level of fidelity. Yeah, they believe in it. There's other tech inside here too, it has these tiny cameras on the nose bridge that authenticate you via retinal scan and they adjust the image to fit the pupillary distance between your eyes. It runs Windows of course, but it's doing it on a Snapdragon processor to maximize battery life. Now, the difference between AR and VR and MR gets really fuzzy, depending on who you talk to, but for Microsoft, this is Mixed Reality and for it to be real, the digital world needs to sort of interact with the real world. In order to pull that off, there's a new Azure connect sensor right here in the front that can scan the room and it can do so at a much higher level of fidelity. - On a spatial mapping, Hololens 1 was just one big mash, it was like dropping a blanket over the real world. - Right. - With Hololens 2, we go from spatial mapping to semantic understanding of space, as you understand, what's a couch? What is a human sitting on a couch? What's the difference between a window and a wall? - For starters, Hololens 2 understands something really important, your hand. The first Hololens made you do these really awkward little pinching motions to select stuff, the new one can see how you actually articulate your fingers, so you can just naturally grab objects and resize them and move them around. If you see a button, you can just push it. I just hit a button, which was actually really impressive, because there was a little three-dot menu and whenever there's a three-dot menu, I'm a nerd, I hit the three-dot, I hit the hamburger menu, there was an X and I just pushed it like it was a real button and away went the hologram. It's a much more instinctive way of interacting and you don't have to learn as much to use the new Hololens. So that's how some of this new tech works, but that brings us to another question. So who's this for? - For the first-line workers. - Okay. - As a matter of fact, if you think about seven billion people in the world, people like you and I, knowledge workers are by far, the minority. Majority of population of workers is not doing that, they're not all designing cars with clay models, but maybe the people that are fixing their jet-propulsion engine, maybe they're the people that in some retail space, maybe they're the doctors that are operating on you in an operating room. - [Dieter] It's designed for a different use-case. For workers who don't sit at computers at all. - People that have been in a sense, neglected, or haven't had access to technology, because PC's, tablets, phones they don't really lend themselves to those experiences and in the world that we live today, where technology is pervasive and ubiquitous in our environment, devices like Hololens empower you to have access to that and to be productive with it. - Yeah, the way that most people think about consumer-- I mean, it's right there in the name, Consumer Technology, but you're not thinking of this as a consumer technology product, - That's right, not yet. - it's a technology product. - That's exactly correct. - Is it because you don't think that the experiences are ready? - Never positioned it as a consumer product. - Right. - And that's having intellectual honesty on this state, this is the best, highest watermark of what can be achieved in Mixed Reality and I'm here to tell you that it's still not a consumer product. - Now that's not exactly true. Microsoft definitely showed off a lot of consumer use-cases with the first Hololens, even though it was technically just a developer kit. It showed games and even like a traditional web browser, but the point is that Microsoft is pivoting away from all that, now it's for people who need to work with their hands and so, have been stuck using computers in really awkward ways up until now, if they got to use them at all. If the Hololens is going to get used every day, all day, in situations like factory floors or out in the world, it needs to get a hell of a lot more comfortable. That's why the computer guts of it are in the back now, so that center of gravity is exactly the middle of your head, that makes it way more comfortable and also by the way, it also works better with glasses now. Now when you put it on, you put it on kind of just like you put on a baseball cap and then you just dial it in a little bit to tighten it up, but you don't have to get it that tight to make it feel comfortable on your head, there's a couple of speakers right here, so you can hear sound and you know what? This is probably awkward for you to watch, so let me just do this and now you can actually just look at me while I talk about the rest of the stuff that's on here. There's a whole lot of other really clever things, the way that it dials in to your head is a lot more comfortable, you can put a top strap on it if you need it. This foam here on the front on your forehead is custom designed to fit multiple body types and it also comes off if you need to clean it, 'cause it ges sweaty. So that's Hololens 2, it's coming out later this year and again, it's gonna cost companies that wanna buy it about 3,500 bucks a pop, but it's meant for workers and I like the idea of bringing computers to people who haven't benefited yet from having PC's or phones at their jobs. It might not be something you can go out and buy in a store, but that doesn't mean that it doesn't have a real shot at changing our understanding of what computers could look like. (slow intense bass music) Hey everybody, thank you so much for watching. Do you think you could use this thing in your job? Let me know in the comments and if you're sad that you can't go out and buy a Hololens yourself, don't fret. There is a ton of new gear coming this year at Mobile World Congress and we have full coverage of all of it right here at The Verge.",
    "transcript_keywords": [
        "HoloLens",
        "Microsoft",
        "people",
        "world",
        "technology",
        "consumer",
        "real",
        "tech",
        "front",
        "Consumer Technology",
        "real world",
        "put",
        "lot",
        "workers",
        "bit smaller",
        "bit lighter",
        "Mixed Reality",
        "bit",
        "talk",
        "Microsoft laser"
    ],
    "transcript_entity_values": [
        "Azure",
        "HoloLens",
        "Mobile World Congress",
        "one",
        "500",
        "MEMS",
        "Hololens 2",
        "three",
        "Snapdragon",
        "Windows",
        "Consumer Technology",
        "today",
        "2",
        "a bunch of half",
        "North",
        "about 3,500 bucks",
        "3,500",
        "Hololens",
        "54,000",
        "Hololens 2",
        "Vaunt",
        "all day",
        "Facebook",
        "this year",
        "second",
        "later this year",
        "Hololens 1",
        "about seven billion",
        "Microsoft",
        "first",
        "the two years",
        "the next two or three years",
        "Oculus",
        "a ton"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "EVENT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "MONEY",
        "MONEY",
        "GPE",
        "CARDINAL",
        "FAC",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "FAC",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY"
    ],
    "vector": [
        -0.051934801042079926,
        0.01638835482299328,
        -0.0018253775779157877,
        -0.03497002646327019,
        0.0385824590921402,
        -0.11194688081741333,
        0.038554247468709946,
        0.014668726362287998,
        0.014353402890264988,
        -0.0008723561768420041,
        -0.0013227080926299095,
        0.0575377456843853,
        -0.06048508733510971,
        -0.07844710350036621,
        0.04124290123581886,
        -0.018933825194835663,
        0.06996604800224304,
        -0.11509909480810165,
        -0.03387093544006348,
        0.011736550368368626,
        -0.03745647147297859,
        -0.010759353637695312,
        -0.014512499794363976,
        0.0819697305560112,
        0.025950901210308075,
        0.029521752148866653,
        -0.031053541228175163,
        0.008701855316758156,
        -0.07657154649496078,
        -0.040850989520549774,
        -0.0273977592587471,
        0.09733381122350693,
        0.042501676827669144,
        -0.04544365033507347,
        -0.08282763510942459,
        -0.08346366882324219,
        0.0920100212097168,
        0.0322987399995327,
        -0.07422011345624924,
        -0.09548716247081757,
        -0.018794242292642593,
        0.00031997074256651103,
        0.016230056062340736,
        0.040001802146434784,
        -0.017783021554350853,
        -0.0033853796776384115,
        -0.0664227083325386,
        -0.07077139616012573,
        -0.011349707841873169,
        -0.004906929098069668,
        -0.05574725940823555,
        -0.1774468868970871,
        0.12830835580825806,
        -0.015944281592965126,
        -0.09513398259878159,
        0.06338472664356232,
        -0.001163135515525937,
        0.067688949406147,
        -0.00899968296289444,
        0.03647063300013542,
        0.027154387906193733,
        -0.07436830550432205,
        -0.03880823031067848,
        0.034710146486759186,
        -0.003106883727014065,
        0.015134860761463642,
        -0.016203077509999275,
        -0.05215411260724068,
        -0.012292624451220036,
        -0.02618098258972168,
        0.027236880734562874,
        0.02759019285440445,
        -0.014416210353374481,
        -0.0006508703227154911,
        0.09910103678703308,
        -0.004597008228302002,
        0.06851422041654587,
        0.01236735749989748,
        0.07613867521286011,
        0.005432447884231806,
        0.03185734525322914,
        -0.03805645927786827,
        -0.028255866840481758,
        -0.016351841390132904,
        -0.00981231965124607,
        0.007638010662049055,
        -0.030173229053616524,
        -0.0009315618663094938,
        -0.09068620204925537,
        -0.04837604612112045,
        -0.07991985231637955,
        -0.020277298986911774,
        -0.00901883840560913,
        0.007495040539652109,
        0.03986751288175583,
        -0.03729114681482315,
        -0.04615575447678566,
        0.0019318955019116402,
        0.03546088933944702,
        0.013668088242411613,
        0.023450452834367752,
        -0.0018323786789551377,
        0.060425348579883575,
        -0.02867698296904564,
        -0.012355534359812737,
        -0.08461131900548935,
        0.015314320102334023,
        0.05594177916646004,
        0.05843492969870567,
        0.020398827269673347,
        -0.0466875322163105,
        -0.011455414816737175,
        -0.0017003794200718403,
        -0.011313088238239288,
        -0.05020667240023613,
        0.010699638165533543,
        -0.015894819051027298,
        0.04483659937977791,
        0.11612879484891891,
        -0.07017132639884949,
        0.042107440531253815,
        0.04702315852046013,
        -0.08502409607172012,
        -0.10288688540458679,
        0.012900647707283497,
        -0.04111091047525406,
        -0.07331512868404388,
        2.786605051211229e-33,
        -0.00543866865336895,
        0.07261677086353302,
        0.004229256883263588,
        -0.004606738220900297,
        -0.0013583243126049638,
        -0.02684929035604,
        -0.020047502592206,
        0.0029197288677096367,
        0.016264261677861214,
        0.025156116113066673,
        -0.07848981767892838,
        0.027742896229028702,
        -0.02784859947860241,
        0.06759089976549149,
        0.06674722582101822,
        -0.12731699645519257,
        -0.012501543387770653,
        0.07620278745889664,
        -0.05122560262680054,
        -0.017613951116800308,
        -0.00434589758515358,
        0.0010908793192356825,
        -0.03025338239967823,
        0.004585704300552607,
        0.01762465015053749,
        0.030448026955127716,
        -0.013119586743414402,
        -0.014243770390748978,
        0.047795265913009644,
        0.03905307501554489,
        0.0018246883992105722,
        0.009057878516614437,
        0.03318493813276291,
        -0.04412801191210747,
        -0.04639962315559387,
        0.06931719928979874,
        -0.04552142322063446,
        -0.10302885621786118,
        0.05531928315758705,
        -0.03281574696302414,
        -0.00048743540537543595,
        0.041458938270807266,
        -0.011475248262286186,
        -0.004923474974930286,
        0.0006247791461646557,
        0.017353734001517296,
        0.013830491341650486,
        0.030928030610084534,
        0.012924663722515106,
        0.05945834144949913,
        -0.07354003190994263,
        -0.005690132733434439,
        -0.035833217203617096,
        0.0913420170545578,
        0.0136863486841321,
        -0.02387862838804722,
        0.09698978066444397,
        -0.024034395813941956,
        0.08392693102359772,
        -0.008422816172242165,
        0.03798745572566986,
        0.06884662061929703,
        -0.01927100494503975,
        -0.003176881931722164,
        -0.03848966583609581,
        0.07675335556268692,
        0.0888543352484703,
        0.021643534302711487,
        -0.10998405516147614,
        0.0755595862865448,
        0.016832860186696053,
        0.027610482648015022,
        -0.03738005459308624,
        0.02787104994058609,
        -0.028170807287096977,
        0.027583226561546326,
        -0.06198647618293762,
        -0.02412223629653454,
        0.0370069295167923,
        0.07247605174779892,
        0.01345832645893097,
        -0.007271017879247665,
        0.031519100069999695,
        -0.01719403639435768,
        -0.01935129053890705,
        -0.011638911440968513,
        -0.036225415766239166,
        -0.019121702760457993,
        -0.05256551504135132,
        0.05168509483337402,
        -0.020551051944494247,
        0.038205835968256,
        -0.031851865351200104,
        0.05216982960700989,
        -0.04493754729628563,
        -3.491454790180297e-33,
        -0.08091365545988083,
        -0.011357825249433517,
        0.009708017110824585,
        0.028615795075893402,
        -0.040402431041002274,
        0.05589254945516586,
        0.02779448591172695,
        0.025606652721762657,
        0.0056709530763328075,
        -0.021174632012844086,
        0.08683082461357117,
        -0.010307520627975464,
        0.0071660676039755344,
        0.03568185120820999,
        0.013475831598043442,
        -0.0703892707824707,
        -0.034416377544403076,
        -0.05143770948052406,
        0.12666748464107513,
        -0.01282639428973198,
        0.06179488077759743,
        0.019096307456493378,
        -0.08136606216430664,
        0.018412688747048378,
        -0.02150687947869301,
        -0.03595634177327156,
        -0.004263146314769983,
        0.009615618735551834,
        0.037990961223840714,
        0.027583282440900803,
        -0.10789511352777481,
        -0.039028350263834,
        0.0012513763504102826,
        0.03377854451537132,
        0.0868975967168808,
        0.023837195709347725,
        0.03736106678843498,
        -0.04468218982219696,
        0.00671778991818428,
        -0.058085668832063675,
        -0.07405273616313934,
        -0.022316882386803627,
        0.06324214488267899,
        -0.03871873393654823,
        0.01996845379471779,
        -0.03287264704704285,
        -0.05388417840003967,
        0.01137746311724186,
        -0.015717407688498497,
        0.059607651084661484,
        0.06241907551884651,
        0.031552091240882874,
        0.041969895362854004,
        -0.04525087773799896,
        -0.09211324155330658,
        0.014916225336492062,
        -0.08468439429998398,
        -0.005692730657756329,
        -0.003148425603285432,
        -0.021917272359132767,
        0.056216444820165634,
        0.014488501474261284,
        -0.08134907484054565,
        0.04326732084155083,
        -0.03724507987499237,
        0.15022726356983185,
        0.04757530242204666,
        0.022883407771587372,
        -0.011648052372038364,
        -0.008820445276796818,
        -0.05078396946191788,
        0.011561930179595947,
        -0.014008227735757828,
        -0.09066145122051239,
        -0.04279598593711853,
        0.027363421395421028,
        -0.06963081657886505,
        -0.042711447924375534,
        0.0016315605025738478,
        0.04850468039512634,
        0.032901156693696976,
        0.008381984196603298,
        0.11798842996358871,
        0.01752956584095955,
        0.05499941110610962,
        0.009152381680905819,
        -0.060692302882671356,
        0.01357028353959322,
        -0.14288650453090668,
        0.04944660887122154,
        -0.07272857427597046,
        0.041290976107120514,
        -0.0503222681581974,
        0.11198659241199493,
        0.024880142882466316,
        -5.0859661371305265e-08,
        0.008517539128661156,
        -0.007105743512511253,
        0.03866272047162056,
        -0.054177310317754745,
        -0.030541526153683662,
        -0.054602112621068954,
        0.03324815630912781,
        0.02825305238366127,
        -0.013245158828794956,
        0.028134243562817574,
        -0.051281481981277466,
        -0.03043358214199543,
        -0.0693613663315773,
        0.0678832083940506,
        0.06957690417766571,
        0.04757031053304672,
        -0.0876198559999466,
        0.0026421144139021635,
        -0.01759568229317665,
        -0.07810071110725403,
        0.0626128539443016,
        0.04049515724182129,
        0.12313482910394669,
        -0.03375843167304993,
        0.03536186367273331,
        0.03552275151014328,
        -0.011178512126207352,
        0.13356547057628632,
        0.04201846942305565,
        -0.02627534046769142,
        -0.05567922070622444,
        0.05373107269406319,
        -0.03961710259318352,
        -0.01774982176721096,
        -0.00957398023456335,
        -0.08708928525447845,
        -0.07399200648069382,
        0.01885356567800045,
        0.037424344569444656,
        0.04736446961760521,
        -0.021992171183228493,
        -0.06557127833366394,
        -0.05818547308444977,
        0.07347371429204941,
        0.062352828681468964,
        -0.027011143043637276,
        0.061227042227983475,
        -0.05433366075158119,
        -0.038022082298994064,
        -0.05086952820420265,
        0.01290838047862053,
        0.050567883998155594,
        0.06870678812265396,
        0.05532912537455559,
        0.006295208819210529,
        0.04804261401295662,
        0.01999632455408573,
        -0.004861404653638601,
        -0.03373562544584274,
        0.10037263482809067,
        -0.02517475187778473,
        -0.04190848022699356,
        0.05574411898851395,
        0.13158725202083588
    ]
}