{
    "id": "6pnrwgIXH2I",
    "title": "There is only one thing left to do...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-11-21T14:45:00Z",
    "video_url": "https://www.youtube.com/watch?v=6pnrwgIXH2I",
    "category": "Howto & Style",
    "tags": [
        "Education",
        "Library",
        "Africa",
        "Kenya",
        "JerryRig library",
        "donate book"
    ],
    "views": 494523,
    "likes": 37407,
    "comments_count": 1594,
    "description": "YOU ARE AMAZING! Thank you so much for watching our videos and for donating books to the Library in Kenya. Here is an update on how many books we received, as well as seeing the library itself for the first time. Just by watching our videos YOU have made this all possible! Some of the books we mentioned today: Planting Trees of Kenya:  After the Fall:  Pioneers guide to living on the moon:  How Technology Works:  Thing Explainer:  Brians Winter:  Ready Player One:  The Martian:  My Side of the Mountain:  BLACK BOOK OF COLORS:  Dinosaurs:   Get my Shirts and Razor Knife here!    00:00 Collecting YOUR books 01:16 Favorite Books 03:13 The Classics 07:00 Prepping the Container 08:00 BUILDING THE LIBRARY!  09:39 Shipping the Books!  Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://amzn.to/3EKYIDI",
        "https://amzn.to/3TRwXO3",
        "https://amzn.to/3UV6ZL0",
        "https://amzn.to/3XbSxzE",
        "https://amzn.to/3tN9u66",
        "https://amzn.to/3GubtUs",
        "https://amzn.to/3tJxSpa",
        "https://amzn.to/3XlFhZc",
        "https://amzn.to/3UVyzrx",
        "https://amzn.to/3EXv1zz",
        "https://amzn.to/3Gyghs6",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "I knew when we started this project that collecting 15,000 books to send to Africa to start a library was going to be a lot. But seeing them all in person is a totally different story. -[Cambry] Yeah. This isn't even all of them. We've got a bunch more behind the camera. -We have a lot of work to do and we're bringing you along with us since all of these books are yours. Collecting them all and sending them halfway across the world is a rather big undertaking, but... -Let's get started. [Intro] -[Zack] So we are not done unboxing all the books just yet, but behind me these are stacked like 4 deep...enough that even the shelves are bending. It's been super fun unboxing everything. It's kind of like a little Christmas package every time I open a box to see what kind of books you guys have sent. It's been super, super interesting. Harry Potter has obviously made a huge impact in a lot of people's lives. This whole top shelf up there is Harry Potter with box sets. But for the most part things have been pretty spread out. Equal amounts of kids books, teenage books, adult books, text books. We have a broad selection of everything. Cambry, what's been your favorite so far? -The children's books. I am just enthralled by...like it's hard to not stop and want to read them all. So the 'Planting the Trees of Kenya' is interesting because the library's going to be in Kenya. -Yeah. -'After the Fall'...so Humpty Dumpty's story after he gets up again. So it's kind of like what do you do after you fall, which resonates with me. And then just like some really beautiful ones that I just think have some gorgeous illustrations and old tales that we all know like Aesop's fable of the lion and the mouse. So those are my favorites right now. -For me, one of the favorites I've seen are more of like the educational books. Let me show you a couple. Like this one, 'A Pioneer's Guide to Living on the Moon' with the earliest known footprints in Kenya 1.8 million years ago to landing on the moon with a side by side comparison. Super cool. We also have a mythology book. 'How Technology Works' which basically explains everything from submarines to wind turbines. Super excited about this one. I'm buying this one for my own library. Same thing with this complicated stuff in simple words. When I was little I would have loved to read this book. Seriously so much fun seeing all these books. But we're not done yet so I gotta get back to unboxing. It's not been just me. I think overall we've had about maybe 50-60 people here cycling through every couple days helping to unbox the thousands of packages we've received. And roughly organize them onto shelves in the different categories: children's, teenagers, adults, fiction, nonfiction, educational...you know, kind of how a library is supposed to be. Let me know down in the comments how many books you think we'll have at the end of this video. And honestly I think we might almost have too many books, but it's better to have too many than not enough. If you're looking for books to read in your own life, this table right here has some of the classics, which if you haven't read it might be a good time to look into. We have a stack of 'Holes' back there which is great. 'To Kill a Mockingbird'.... '1984' people like that for a few reasons. Surprisingly a bunch of 'Charlotte's Web'. 'Brian's Winter' was a phenomenal book. 'Ready Player One'. 'The Martian' super good. 'My Side of the Mountain' was one of my favorites growing up. And when you're starting a library, duplicates aren't necessarily a bad thing, it means multiple people can read the same book at the same time. Cyrus! Give kids the hardcover ones. It was only the dust cover, it's fine. Jerry Jr.'s not helping as much as he thinks he is. Especially when we have books like 'The Giving Tree' which would be super fun to read as a class. So while we do have duplicates, for the most part all of these books are one-offs. And surprisingly, just by the natural inflow of books that you guys sent our direction, it's like the perfect variety of kids, teenagers, adults, and textbooks, and education. There's something here for everyone, and it's interesting that it all just happened randomly without any guidance I guess. This project has been really, really fun. I found two more interesting books. First of all, someone has taken this little children's book and put braille stickers over the top. It's hard to see it on camera, but obviously we have the words down here, and then the sticker has little raised bumps for reading in braille. So kind of fun. And this book is kind of the same concept. 'The Black Book of Colors' where it has the words down here but then up top it has them in braille, as well as pictures that someone can feel. It's really fun seeing books that are accessible like this. These are the leaves. This is the color of the sky with the braille, and then a kit that someone can feel with the raised bumps off the page. -Going through boxes and sorting, I have a long list of books that I need to check out from the library here. There are some really cool novels I need to get my hands on. This is one I haven't read yet but it's called 'The Boy Who Harnessed the Wind' about a boy who built a wind turbine to generate electricity in Africa. And I imagine there's a certain level of jerry-rigging that had to go on to accomplish that. So that's next on my list of things to read after, of course, we finish this project. Someone basically sent a full set of Animorph books. I used to read these all the time as a kid. The bottom corner...that's awesome. At the bottom corner of every book it shows an animal morphing into a human. -We asked you guys to send us books that had some meaning to you. It's been really fun seeing the science section come to life because there are a few in here that have a little bit of nostalgia for me, like this 'Frogs and Toads.' I read every book about animals I could get my hands on. -This is the perfect example of a bunch of people all doing something small to accomplish something great. And all of this is possible through your views watching our videos as well as contributing books to this project. My mom would take us to the library probably once a week growing up, and seeing all these books come in that I used to read quite a lot of growing up is very nostalgic. 'The Hardy Boys'... We just barely found this dinosaur book that I would have loved as a kid. -Beautiful. Yeah, it says 'Dinosaurs and Other Prehistoric Life.' I want to read that. Just beautiful pictures and talking about it in a simplistic way. Yeah, I would have dug this as a kid. -You would have checked that book out from the library? -Yup. -And now kids and schools, and teenagers and adults in Kenya will have that same opportunity. But we do have a lot of work ahead of us. All of these have to get there first, which means we have a lot of unboxing to do. Literally thousands of packages have been coming in for the past two weeks. We've been bringing them in here consolidating them into kids, educational, adult novels, teenage novels. So that they'll be quicker and easier to sort once they arrive in Kenya. Come here. Can you hold this? Now we just have to get all of these books into the footprint of the shipping container using about 900 of these boxes. Turns out that the boxes that are the perfect size are actually used french fry boxes from a local restaurant that we got donated for free. Turned out pretty well, because free boxes are the best boxes. -[Philip] Hey Zack, it's me, your uncle Philip. So when you are boxing up books for shipment, in Kenya we are working on finishing up the library. [Music playing] -[Cambry] All of this is made possible because of you guys coming to watch our videos. Remember, every time someone comes to this channel and watches one of our videos, we get a small fraction of a penny. And over time it builds up enough so that we can do really cool projects like this library in Kenya. -[Zack] It wouldn't be possible without you. And while this library is a positive all by itself, a bonus side effect is the infusion of jobs and money into the local economy. We have local designers, local suppliers, and local builders doing all of the work, who then are able to take the money home and spend it with their families. -[Cambry] And then their families hopefully come to hang out at our library. Your views, your support, your books are helping in more ways than one. -[Zack] So thank you for watching. -[Cambry] It's a really big deal. [Music playing] -[Zack] Now we have to get all the books from inside to outside, inside of this container. We're spacing pallets along the bottom of the container to help with airflow and fumigation later. The pallents can't just be any pallets though, they have to be heat treated so we don't accidentally send any bugs or pests to Kenya. It is 31 degrees in Utah right now and everything is loaded and in the trailer. 100% of the books are out of the shop which is very nice. -Some interesting statistics are: the most donated book is Harry Potter with 33 box sets. Followed by Narnia at 38. And then the Lord of the Rings series with 40 box sets donated. -Which is fine though. We're sending all of the box sets because the books can be distributed to local schools and stuff. We're building a library and the schools are coming to visit. Anyway, you can't have too many books. We're all right. So we know what books are the most popular, but what's the total number of books? -We have 584 boxes back there. -Which fills up I think about 85 or 90% of the container, which is good though because we still have to fumigate which I'll talk about in a second. But we have airflow at the bottom with the pallets, on the side with the corrugation, and then about a foot of room up at the top to let the air flow and to make sure things don't get too wet on its voyage across the ocean. -But it does weigh 24,403 pounds. -That's a heavy beast. -Yeah. -And how many books is that? Drumroll... -34,399 books donated. -That's so many. I thought we were going to get like 15 hundred...no sorry, 15 thousand and you guys doubled that. That is amazing. So hopefully the library is big enough to hold it all. Either way, that's not our problem, it's when we get to Africa, and then it'll be their problem. Which is a good problem to have. -Woo it's cold! -Yeah, it's freezing. Let's talk about fumigation. Because we're shipping internationally the container has to be fumigated. We don't want any of our pests here in the United States to go over to Kenya where they don't exist yet. Basically they don't want our termites and other bugs and stuff that might be hiding inside the container somewhere or in the pallets. The fumigation grenade gets set in the middle of the container and once triggered, spews out the white mist for about 20 minutes. The container stays locked for about 2 hours while the mist permeates every crevice to eliminate any bugs that might be hiding. Once the fumigation process is done, it's time for our books to embark on their world traversing journey to Kenya. -[Cambry] The books now have a long and dangerous journey across the ocean all the way over to Kenya. And then across the country to Budalangi. -[Zack] They've got a really, really long way to go. But the good news is is that these containers don't usually fall off the ships into the ocean....usually. -[Philip] So as the library is going up, people are really excited, and they're looking forward to the completion of the library. Lots of people are looking forward to going there, spend some time reading books and just having a community of knowledge. -Cross your fingers that they make it there. And don't forget to hit that subscribe button so you can watch the video of when all the books arrive, and you can see the library that you built. -You guys are awesome. I bet that we will definitely do this again in the future. -Thanks a ton for watching. We'll see you around.",
    "transcript_keywords": [
        "books",
        "book",
        "library",
        "Kenya",
        "read",
        "Harry Potter",
        "container",
        "time",
        "super",
        "people",
        "fun",
        "boxes",
        "lot",
        "Yeah",
        "kind",
        "guys",
        "local",
        "kids",
        "side",
        "Potter"
    ],
    "transcript_entity_values": [
        "15 hundred",
        "Guide to Living on the Moon'",
        "1984",
        "french",
        "the past two weeks",
        "Kenya",
        "about 900",
        "about 85",
        "Mockingbird",
        "Cyrus",
        "50-60",
        "every couple days",
        "Philip",
        "about a foot",
        "33",
        "584",
        "Cambry",
        "Dinosaurs and Other Prehistoric Life",
        "-Which",
        "100%",
        "two",
        "31 degrees",
        "The Black Book of Colors'",
        "24,403 pounds",
        "Martian",
        "15 thousand",
        "thousands",
        "Harry Potter",
        "about 2 hours",
        "Africa",
        "Aesop",
        "Brian",
        "Humpty Dumpty's",
        "years ago",
        "Jerry Jr.'s",
        "about 20 minutes",
        "4",
        "The Giving Tree'",
        "90%",
        "a penny",
        "the United States",
        "38",
        "Animorph",
        "first",
        "second",
        "Narnia",
        "Christmas",
        "First",
        "Budalangi",
        "40",
        "15,000",
        "Charlotte",
        "The Boy Who Harnessed the Wind'",
        "Zack",
        "Pioneer",
        "Utah",
        "one"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "DATE",
        "NORP",
        "DATE",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "QUANTITY",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "TIME",
        "LOC",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "TIME",
        "CARDINAL",
        "WORK_OF_ART",
        "PERCENT",
        "MONEY",
        "GPE",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORDINAL",
        "PERSON",
        "DATE",
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "GPE",
        "CARDINAL"
    ],
    "vector": [
        -0.08399264514446259,
        0.08131267130374908,
        0.04595441371202469,
        0.00841685850173235,
        0.0065182591788470745,
        -0.012273083440959454,
        -0.07073577493429184,
        -0.03511810675263405,
        0.016788300126791,
        0.1582893431186676,
        -0.01202864944934845,
        -0.004092404153198004,
        -0.04495473578572273,
        -0.07940342277288437,
        -0.049687694758176804,
        -0.0047036949545145035,
        -0.04817962646484375,
        0.05163445696234703,
        -0.06019885838031769,
        0.00910983420908451,
        -0.006797283887863159,
        0.023910272866487503,
        0.057731520384550095,
        -0.011074383743107319,
        -0.02670087292790413,
        0.09600143879652023,
        -0.06334307044744492,
        -0.010273652151226997,
        -0.048651162534952164,
        -0.0853397399187088,
        -0.06299863010644913,
        0.03478324040770531,
        -0.047001294791698456,
        0.020533300936222076,
        -0.008124195039272308,
        0.13919895887374878,
        0.0430624894797802,
        -0.004104316234588623,
        0.05858512222766876,
        0.029127534478902817,
        0.08813221752643585,
        -0.04346011206507683,
        -0.011586997658014297,
        -0.04939846694469452,
        0.02721014991402626,
        0.0026027411222457886,
        0.019203193485736847,
        -0.06516765058040619,
        0.016413679346442223,
        0.03499159961938858,
        -0.02860882505774498,
        -0.005312527995556593,
        -0.06521376967430115,
        -0.06505771726369858,
        -0.011367944069206715,
        -0.045530084520578384,
        -0.044611185789108276,
        -0.0037681041285395622,
        0.03066137433052063,
        -0.022107629105448723,
        0.020759105682373047,
        -0.03725944459438324,
        -0.10041934251785278,
        0.038440316915512085,
        0.00808024127036333,
        -0.06533046066761017,
        -0.05550284683704376,
        0.06461656093597412,
        -0.005912434309720993,
        -0.02805401384830475,
        -0.050168320536613464,
        -0.008897789753973484,
        0.09168807417154312,
        0.0054232575930655,
        0.017920101061463356,
        0.01155701745301485,
        -0.007312348578125238,
        -0.011695386841893196,
        -0.0252684373408556,
        -0.019373197108507156,
        0.04405590519309044,
        -0.026932677254080772,
        0.013682977296411991,
        -0.04114469885826111,
        -0.06926705688238144,
        -0.0227950569242239,
        -0.022671233862638474,
        0.06177562102675438,
        0.0034838770516216755,
        -0.09343420714139938,
        0.02332696132361889,
        -0.03983238339424133,
        0.07120304554700851,
        0.025419561192393303,
        -0.045526012778282166,
        -0.03813953325152397,
        -0.026767892763018608,
        -0.021057456731796265,
        -0.021740248426795006,
        0.05178414285182953,
        -0.028927678242325783,
        0.032830752432346344,
        0.11042379587888718,
        -0.07320418208837509,
        0.042063236236572266,
        -0.09317447245121002,
        -0.09371571242809296,
        0.02785038761794567,
        0.057789742946624756,
        -0.0415300615131855,
        -0.08070551604032516,
        -0.0066605741158127785,
        -0.10630080103874207,
        -0.00501221464946866,
        0.06438403576612473,
        -0.03611214831471443,
        -0.04029234126210213,
        -0.02116047590970993,
        0.08387477695941925,
        0.0369596891105175,
        0.021176602691411972,
        -0.014486338943243027,
        0.025383783504366875,
        -0.03070242516696453,
        -0.006452044937759638,
        -0.02945024147629738,
        0.02399630844593048,
        3.1287604163378957e-33,
        0.09897145628929138,
        0.04785721004009247,
        0.019928213208913803,
        0.024268679320812225,
        0.05216396972537041,
        -0.062049463391304016,
        -0.0018152289558202028,
        -0.015605269931256771,
        -0.0867852196097374,
        -0.01590671017765999,
        0.001629342557862401,
        0.04750625044107437,
        -0.07461690902709961,
        0.03763064369559288,
        -0.057789742946624756,
        0.02574794739484787,
        -0.056583840399980545,
        -0.08808208256959915,
        -0.012856345623731613,
        0.020582133904099464,
        -0.028061021119356155,
        -0.048149824142456055,
        -0.004983946215361357,
        0.03419172391295433,
        0.10939764231443405,
        -0.03074052557349205,
        0.036728035658597946,
        -0.06382036209106445,
        0.007847269997000694,
        0.008804288692772388,
        -0.023572081699967384,
        0.005716748535633087,
        -0.05262644588947296,
        -0.12137613445520401,
        -0.06930258870124817,
        -0.020245173946022987,
        -0.11797364801168442,
        -0.06281156092882156,
        0.0609259232878685,
        -0.044013503938913345,
        -0.08290065824985504,
        -0.027411898598074913,
        -0.022481143474578857,
        -0.0117008276283741,
        0.02494247443974018,
        0.13513495028018951,
        0.08295699954032898,
        0.06843303143978119,
        0.06547804176807404,
        0.03513005003333092,
        -0.008736399002373219,
        0.002322307089343667,
        -0.004720928147435188,
        -0.02202242612838745,
        -0.03164945915341377,
        -0.04009781405329704,
        0.033394817262887955,
        0.025164740160107613,
        0.02494446374475956,
        -0.013798702508211136,
        0.08139660954475403,
        0.036964382976293564,
        0.05373385176062584,
        0.043707914650440216,
        0.01026893686503172,
        -0.007323055062443018,
        0.002221088157966733,
        0.0641394630074501,
        -0.017699021846055984,
        -0.07844454050064087,
        -0.0895441398024559,
        0.024667169898748398,
        0.05732017755508423,
        -0.032466303557157516,
        -0.002546528587117791,
        0.043826617300510406,
        0.007823607884347439,
        -0.04293432831764221,
        -0.005646387115120888,
        0.014383972622454166,
        0.014488021843135357,
        -0.012716650031507015,
        0.043881095945835114,
        -0.0305759459733963,
        -0.06223863363265991,
        -0.016888951882719994,
        0.08006337285041809,
        -0.06287803500890732,
        -0.011416246183216572,
        -0.053047582507133484,
        0.025307128205895424,
        0.013067416846752167,
        -0.0890321135520935,
        -0.10084103047847748,
        0.003230426460504532,
        -6.483207666510009e-33,
        0.1380615234375,
        -0.07335533201694489,
        -0.02952423132956028,
        0.010435317642986774,
        0.03967953473329544,
        -0.017858464270830154,
        -0.04677804186940193,
        0.0017861132510006428,
        0.03797227144241333,
        -0.05836857855319977,
        -0.017663847655057907,
        0.00835827924311161,
        0.037478115409612656,
        0.000734432484023273,
        -0.023312730714678764,
        -0.09180767834186554,
        -0.04423646628856659,
        0.06930078566074371,
        0.07594235241413116,
        -0.00985331367701292,
        0.014765691943466663,
        0.05394074320793152,
        -0.01873449794948101,
        -0.07340054959058762,
        0.0019770057406276464,
        -0.03043774701654911,
        -0.004563892725855112,
        -0.016586672514677048,
        -0.043834149837493896,
        0.018469883129000664,
        -0.005096709821373224,
        -0.012612370774149895,
        0.030224690213799477,
        -0.01918291114270687,
        -0.07808804512023926,
        0.024067064747214317,
        0.04297382012009621,
        -0.03611661493778229,
        -0.05400508642196655,
        -0.012073677964508533,
        0.11904622614383698,
        0.019935112446546555,
        0.015845350921154022,
        -0.03334420919418335,
        -0.028255071491003036,
        -0.05190334841609001,
        -0.013983340002596378,
        0.09715355187654495,
        -0.05050518363714218,
        -0.031282417476177216,
        0.04978310689330101,
        0.04563046246767044,
        -0.02914864756166935,
        -0.09388832747936249,
        0.05142486095428467,
        0.11129999160766602,
        0.03920841962099075,
        -0.039556264877319336,
        0.027977602556347847,
        -0.008127708919346333,
        -0.1205812618136406,
        -0.03453979641199112,
        -0.013613157905638218,
        -0.029771162196993828,
        -0.04986704885959625,
        -0.04274898022413254,
        0.05481109768152237,
        0.02615940570831299,
        0.02301122434437275,
        0.0409112311899662,
        -0.057665493339300156,
        -0.044778745621442795,
        -0.004567382857203484,
        -0.0640493854880333,
        0.07609452307224274,
        0.12342192232608795,
        0.01006857305765152,
        -0.00400798674672842,
        0.002077891957014799,
        -0.027518073096871376,
        -0.008405194617807865,
        -0.037346385419368744,
        0.01931648515164852,
        0.09909305721521378,
        0.06642080098390579,
        0.08505504578351974,
        0.0745076984167099,
        -0.025098243728280067,
        -0.06519865989685059,
        0.036675307899713516,
        -0.02145455777645111,
        -0.023568550124764442,
        0.06873877346515656,
        0.13654069602489471,
        -0.025964954867959023,
        -5.974587935497766e-08,
        0.014254302717745304,
        0.07068397849798203,
        -0.015867698937654495,
        -0.008342036977410316,
        0.0807681456208229,
        0.05216569826006889,
        0.0351838618516922,
        0.05534175783395767,
        -0.052319154143333435,
        0.035222094506025314,
        -0.008563287556171417,
        0.03690925985574722,
        -0.009732960723340511,
        0.03720575571060181,
        -0.0029992600902915,
        0.015148411504924297,
        0.083096444606781,
        -0.004694762174040079,
        -0.04028956964612007,
        0.016381820663809776,
        0.016594406217336655,
        -0.05097620561718941,
        0.1007271260023117,
        -0.08221125602722168,
        0.03908148780465126,
        0.10594974458217621,
        -0.029652012512087822,
        0.027827829122543335,
        0.08678136020898819,
        0.03978332504630089,
        0.029480773955583572,
        -0.00371909118257463,
        -0.04297971725463867,
        -0.04297406226396561,
        0.0412130206823349,
        -0.08410422503948212,
        -0.10634643584489822,
        -0.006272376514971256,
        -0.02231735922396183,
        0.01618659310042858,
        -0.02026520110666752,
        -0.06913821399211884,
        0.009719067253172398,
        0.0684567242860794,
        -0.03691023960709572,
        0.004660345613956451,
        0.008580784313380718,
        -0.033736564218997955,
        -0.05583015829324722,
        -0.03424034267663956,
        -0.04350755363702774,
        -0.038665469735860825,
        0.02848820760846138,
        -0.017528284341096878,
        0.04759190231561661,
        0.04243507981300354,
        0.03284965828061104,
        0.04386529698967934,
        0.012756855227053165,
        -0.009939512237906456,
        0.032441072165966034,
        -0.10681814700365067,
        -0.09893234819173813,
        0.0508740171790123
    ]
}