{
    "id": "6QDMUkIUsu4",
    "title": "AirTags Unboxing and Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-04-22T13:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=6QDMUkIUsu4",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 1036836,
    "likes": 36869,
    "comments_count": 2103,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- They are finally here, the Apple Air Tags. These have been rumored for years at this point. I feel like every time there's an Apple event, we think that they are gonna be announced, and they haven't been, but they're finally here. We've got them in the studio to test out. I'm so excited about this because I lose a lot of stuff. I'm not happy about it, but it's just who I am as a person. And that's just, I've accepted that. (gentle melodic music) They've got two different variations right now that you can purchase on the website. You can get the one pack for $29 or the four pack for 99. And what's really cool about these is they are fully customizable with emojis or text. So you are able to do that when you purchase them. We've also got some accessories. We've got a loop, a leather loop, and a leather key ring. Let's open these up, set them up, and let's chat about it. Here's the box. It is a tiny little package. Oh wow. Oh man, this is so exciting because it's been a while since there has been sort of a new product category for Apple, and this is an all new product. (gentle music) (machine beeps) Hello? So, this water and dust resistant. It has an IP67 rating, which means you can submerge it in about one meter of water for about 30 minutes. I don't recommend doing that, but just know that you should be okay. It does have a replaceable battery. This should last you up to a year. And the battery is just one of those CR2032 coin cell batteries. So it should be pretty easy just to replace the battery after a year. This looks like those little collector pins that you would get at Disney. I should honestly wear this around just so I can find myself. Look at that beautiful Apple logo. Hey Tyler, you want to see this? Isn't it cool? - Oh it's very cute. - It is very cute. - [Tyler] Oh my God. - We also have a four-pack. We also have accessories to get into Oh, look at the four pack. Look, there's four! In the four pack! Four, one, two, three, four. (gentle music) (plastic crinkling) Look at them. Okay, the customization looks very, very cool. I already have my customization picked out. I'm going to be doing a skull, a pig, a poo, and an alien. Let's open up our accessories now. First up we have our Air loop tag. Air loop tag? Air Tag loop? It's all the same really. Ooh, oh wow. I am so into this yellow color recently, ever since I saw the iMac in that beautiful yellow color. Like this looks so good. There's a little snap right there. Open that up. Pop in your Air Tag, close it up. There's going to be so many cool third party accessories with this. One of the things that I'm really excited about with these Air Tags is the endless possibility of third-party accessories. This one is by Dbrand and you can check it out in the description link below. A huge thank you to Dbrand for always being so supportive of my channel. They made this Air Tag key ring attachment that's fully customizable with the Dbrand skin in the color of your choice. It'll come with both a key ring and a lanyard attachment all for under $20. I feel like one of the most common use cases is putting Air Tags on keys. So this is a perfect, slim, cost-effective accessory for it. And then this just snaps like that. It's cute. So this has a pretty snug fit. Ooh leather loop, fancy. (gentle music) So even though this is a leather, like these both kind of feel very similar. So I feel like if you are not wanting a leather one like that's totally fine because this one feels almost the same. Obviously the difference here is you have this really nice stitching. This is a little bit higher quality but this still is pretty, pretty substantial as well. Alright, next up, we've got the leather key ring. I can't even tell you guys how many times I lose my keys. Like, I'll just be like looking for my keys mostly because I know that they have a SIM card ejector on it and I'm always needing one. So not only will I be able to find my keys but I'll always be able to find a SIM card ejector. Oh, this is very nice. Look at that. So it looks like this also has a little snap, just like so. I'm going to put a blank one on here. Yeah, that looks nice. So one of the things that makes these different than other tile trackers is this has access to the entire Find My network. And what that means is anybody who has Find My on their phone, you're going to be basically piggy-backing off of other people's phones and Bluetooth to be able to find your lost items. Now, something that's kind of cool is if I lose I don't know, like my jacket or my purse or whatever and I mark that item as lost. And then Tyler is, you know, wherever I left it he ends up seeing, oh my goodness there's a purse and he's rummaging around or there's one of these tags on there. It would send him a notification that would say, hey Justine lost this. It would take you to a webpage with either a phone number or a message to anybody that finds it on a way to contact me, to get me my last item back. That's cool. Another thing that a lot of people were saying on Twitter is they had a really big concern about privacy. This is not going to be giving away your location or the location of anybody's phone who actually was able to help you find your lost item. All of that is encrypted and completely stays private. There were also concerns about slipping one of these into somebody's bag or attaching it to something and being able to track their whereabouts. A few things to kind of keep your mind at ease. The first thing is if Tyler was to slip this into my backpack, Tyler. Anytime this sensed some sort of motion, it would make a sound. It would also send a notification to my phone saying that there was a tag nearby that did not belong to me. Which is kind of cool because you can just picture that sort of pop up that would come up whenever you open up somebody else's Air Pods next to your phone. They're like, these are not your Air Pods. I imagine it's very similar to that. It's like, yo, there's a tag nearby, it's not yours. So they definitely are keeping that in mind because I feel like that is a number one concern on anything that has tracking capabilities. It's a combination of the Find My network and Bluetooth that will help you find your items. And also if you have one of the newer iPhones with the U1 chip enabled you'll be able to use precision tracking. This is pretty cool because you could take your phone and kind of walk around and it will direct you right to your device. Now, something else that kind of crossed my mind is how incredible this is going to be for the accessibility community. And one of my friends, James Rath is making a video talking about how he's going to be able to use these as a legally blind person. So I'm so excited to see his video. He actually sent this little message for us right here. - Hi, my name is James Rath. I'm a documentary filmmaker, YouTube creator and I was born legally blind. I like to share the perspective of being visually impaired while interacting with technology or accessible experiences like traveling. One of my favorite things about the Air Tags like most Apple products it's actually designed with accessibility in mind. That means that as a blind user, I can use the Find My app and have everything narrated to me. Including the precision tracking. So it can give me sort of this scheme of hot or cold or Marco Polo to find my items. Which, as a blind person happens a lot. I never thought I'd say this, but thanks to the Air Tags. I'm actually looking forward to losing things. - Thank you for the video, James, you're the best. Make sure you guys go check out his channel and subscribe and also check out his video and say that IJ Army has sent you. So now I think it's officially time to set these up and get tracking. (light, upbeat music) Well I'm gonna go hide, while Tyler hides these so that we can have a fun little Air Tag scavenger hunt. Here you go, Tyler, are you ready? - [Tyler] You can just leave them there. - I'll just leave them here. Okay bye. (slow, upbeat music) - Is it time? Let's do this. The items, they're there. Let's go find them. So I have a list of my items here. So the first one that I'm going to try to find is the one that's labeled EWT. So I'm going to click on that. It looks like it popped up on the map. I'm going to play the sound. - That's cheating. - That's what I want to do. Okay, so I feel like when you play the sound it's kind of giving you like a sense of where it's at. And then when you click into find nearby, Oh, check this out. This is cool. Okay, so it's 13 feet away from me. I'm getting closer. It's to my left. I don't know my left and right. It's so close. (slow beeping) (rapid beeping) Oh, look it says here! I found it! That's actually incredible. Oh, it smells so good, smells like coffee. We did that, EWT. Mine. pocket. Now we're gonna try to find this one. This is in my backpack. Let me see where this looks like it might be. Signal's weak. It's weak. (gasps) 30 feet, 24, 20, 18, we're so close. Is it under here? I didn't even see it, it matches! Oh this definitely has dog pee all over it now. (rapid beeping) It's been found. Oh this is fun. Next up, we're going to try to find my bike. I hear it. (rapid beeping) It's everywhere. There it is (laughs) That's a sneaky good hiding spot Tyler. Sneaking good. Into the pocket. I'm like making record time. 17, our connection is weak. It's behind me, it's on my right. It may be on a different level than you. It's nearby, nearby. Whoa! There it is. All right, we have one more to find. (rapid beeping) (rapid beeping) (rapid beeping) (rustling through papers) (rapid beeping) It's weird because the sound is such a weird, like echoing sound that (beeping) Wait a minute, is this in my pocket? (beeping) (beeping) (beeping) (beeping) Where is it? Oh, God. It's right there. It's really accurate though. Cause like it kept saying that it was sort of right here but then it's like, no, it's right here. Here, here it is. Well, I found them. That was actually really fun. We need to do a bigger scavenger hunt, hmm... I've got some ideas. So that was a quick little scavenger hunt and a nice demonstration of how these would work if you're looking for something around your house. One of the things that I haven't got a chance to yet try is the lost mode. So when I do test that out, I'll be sure to either post it here or post it on Twitter or on Instagram. So you guys can see a demo of what that looks like. But I'm very excited about these mostly just because they are small, compact and they work perfectly in the Apple ecosystem. Tyler, are you surprised how quick I found them? Like I think I did a pretty good job. - [Tyler] A little bit, yeah. - Yeah. I mean you're hiding spots were good. - [Tyler] I could have done better. - They were no match though, for the Air Tags. If you guys are new here, I make a bunch of fun tech videos and I would love for you guys to subscribe if you're not subscribed already. Hit the bell so you'll be notified when I post new videos and of course join our fun community in the comments below. And with that, I'll see you guys in the next video. I now need to go rename these appropriately and distribute them into all of my items. I'm going to definitely put one on my bike. This matches my bike. - [Tyler] Do you lose your bike a lot? - Well no. Do you? - [Tyler] I don't have a bike. - Yeah, you do. - Oh yeah. - You have a bike. (laughs) (upbeat music)",
    "transcript_keywords": [
        "Air Tags",
        "Air Tag",
        "Apple Air Tags",
        "Air",
        "Air loop tag",
        "find",
        "Air Tag key",
        "tag",
        "Air Tag loop",
        "Tags",
        "Tyler",
        "Apple",
        "Air Tag scavenger",
        "cool",
        "Air Pods",
        "Air loop",
        "putting Air Tags",
        "Apple Air",
        "loop tag",
        "kind"
    ],
    "transcript_entity_values": [
        "Air Tags",
        "Air Tag",
        "a minute",
        "one",
        "James Rath",
        "the Apple Air Tags",
        "29",
        "13 feet",
        "the Air Tags",
        "24",
        "about 30 minutes",
        "17",
        "Apple",
        "Justine",
        "James",
        "about one meter",
        "20",
        "Instagram",
        "years",
        "Air Pods",
        "three",
        "Marco Polo",
        "Bluetooth",
        "99",
        "Dbrand",
        "Twitter",
        "four",
        "iPhones",
        "18",
        "30 feet",
        "Four",
        "iMac",
        "two",
        "third",
        "YouTube",
        "the Air Tags",
        "IJ Army",
        "Signal",
        "Tyler",
        "EWT",
        "a year",
        "under $20",
        "first",
        "IP67",
        "up to a year",
        "U1",
        "these Air Tags",
        "Air Pods",
        "Disney",
        "First",
        "One"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "TIME",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "QUANTITY",
        "LAW",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "NORP",
        "ORG",
        "CARDINAL",
        "NORP",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "MONEY",
        "ORDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "LAW",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.03626064956188202,
        -0.06801488995552063,
        -0.0607425756752491,
        -0.06827101111412048,
        0.07498842477798462,
        0.02597169019281864,
        0.05166033282876015,
        0.000710026070009917,
        -0.020806191489100456,
        0.019632749259471893,
        0.036666981875896454,
        0.04731510207056999,
        -0.010080024600028992,
        -0.02886245772242546,
        -0.03065619058907032,
        0.03973152115941048,
        -0.01914333552122116,
        -0.052583612501621246,
        -0.023388352245092392,
        0.05403651297092438,
        -0.03340119495987892,
        -0.03593368083238602,
        0.014699229970574379,
        -0.0034651446621865034,
        -0.006365451496094465,
        0.0502697117626667,
        -0.0013195325154811144,
        0.049210768193006516,
        -0.08038169890642166,
        -0.08619877696037292,
        0.02456558868288994,
        0.030084051191806793,
        0.09734383970499039,
        0.012594404630362988,
        0.028972111642360687,
        -0.061190392822027206,
        0.034053120762109756,
        0.03852939233183861,
        -0.03962716460227966,
        -0.0075112758204340935,
        -0.004646571818739176,
        -0.04470353201031685,
        -0.000622143445070833,
        0.0022674850188195705,
        -0.06450127810239792,
        -0.056557945907115936,
        -0.019674615934491158,
        -0.041235461831092834,
        0.027415387332439423,
        0.07262495160102844,
        -0.0419413261115551,
        -0.018520919606089592,
        0.05240912735462189,
        0.06484343111515045,
        -0.08105256408452988,
        0.010511287488043308,
        -0.09890244156122208,
        -0.03434928506612778,
        0.015617651864886284,
        -0.11153531819581985,
        0.010633772239089012,
        -0.001598241040483117,
        -0.012988823466002941,
        0.05015215277671814,
        -0.044295091181993484,
        -0.031854722648859024,
        0.006155561190098524,
        0.014822466298937798,
        0.01760791800916195,
        0.030609803274273872,
        -0.08652503043413162,
        0.053095873445272446,
        -0.013305420987308025,
        0.03759926185011864,
        0.03309677541255951,
        0.05837392807006836,
        -0.002712709829211235,
        -0.08966731280088425,
        0.02042611874639988,
        0.10501308739185333,
        0.048117250204086304,
        -0.06996911764144897,
        -0.10188968479633331,
        -0.036743029952049255,
        0.003548817941918969,
        0.013889119029045105,
        -0.009498914703726768,
        0.011314203031361103,
        -0.054599031805992126,
        -0.046025652438402176,
        -0.08406659960746765,
        0.01614018715918064,
        0.06467334181070328,
        0.0003417034458834678,
        0.01586555875837803,
        -0.05948638170957565,
        -0.03194790706038475,
        0.00568711431697011,
        -0.05551226809620857,
        0.06367801129817963,
        0.0313480980694294,
        -0.059859856963157654,
        -0.025186317041516304,
        -0.048180513083934784,
        -0.030744250863790512,
        -0.12372550368309021,
        -0.03271130844950676,
        0.010718265548348427,
        0.022012166678905487,
        0.007321471348404884,
        -0.06993267685174942,
        0.02731660008430481,
        -0.07811091095209122,
        -0.07615648955106735,
        0.0038859357591718435,
        0.12073024362325668,
        -0.0035339591559022665,
        0.04405791312456131,
        0.02047407440841198,
        0.006506559904664755,
        -0.051567256450653076,
        -0.08854908496141434,
        -0.0023875003680586815,
        0.010207148268818855,
        -0.018959099426865578,
        0.009601338766515255,
        -0.08031834661960602,
        1.2266120450989394e-32,
        -0.04980390891432762,
        0.06139902397990227,
        -0.02282010018825531,
        0.05347989872097969,
        0.0008193757385015488,
        -0.018712133169174194,
        -0.021062664687633514,
        0.0518999844789505,
        0.011271726340055466,
        0.06800957769155502,
        0.000912385992705822,
        0.061776742339134216,
        -0.04021983593702316,
        0.030354807153344154,
        0.03671804443001747,
        -0.08277531713247299,
        -0.013302645646035671,
        -0.02764449268579483,
        -0.08251318335533142,
        -0.014288458041846752,
        -0.016471125185489655,
        0.0028491574339568615,
        -0.015840081498026848,
        0.09898535162210464,
        0.1021156832575798,
        0.08583708852529526,
        0.018544180318713188,
        -0.0004615324432961643,
        0.11191705614328384,
        0.013796873390674591,
        -0.01563209854066372,
        -0.0335322730243206,
        -0.030428553000092506,
        -0.034382592886686325,
        -0.01998126320540905,
        -0.0004158763913437724,
        -0.10200002044439316,
        -0.01347077451646328,
        0.0006516712601296604,
        -0.017850004136562347,
        0.011519801802933216,
        -0.022962873801589012,
        -0.06436502933502197,
        -0.08072380721569061,
        0.0918416753411293,
        0.04283145070075989,
        0.014860856346786022,
        0.06364908069372177,
        -0.009168553166091442,
        -0.004885666072368622,
        0.002834805753082037,
        -0.013333178125321865,
        -0.03802087530493736,
        -0.0080410772934556,
        -0.02273658663034439,
        -0.08474761247634888,
        -0.05162454769015312,
        0.04906788840889931,
        0.049885161221027374,
        0.03372925519943237,
        -0.009895967319607735,
        -0.024939393624663353,
        0.0234727393835783,
        -0.05587536469101906,
        -0.05063081160187721,
        0.0976579338312149,
        0.07533737272024155,
        -0.041555773466825485,
        0.009893160313367844,
        0.04642805457115173,
        0.013405805453658104,
        0.013313190080225468,
        0.009519394487142563,
        0.02701699174940586,
        0.0472717359662056,
        0.05876610055565834,
        -0.040956344455480576,
        -0.03601088374853134,
        -0.007519155740737915,
        -0.008237679488956928,
        -0.06560677289962769,
        0.08223775774240494,
        -0.006633879616856575,
        0.12377309799194336,
        -0.0290679968893528,
        -0.11994477361440659,
        0.017088374122977257,
        -0.027864672243595123,
        -0.030571652576327324,
        0.02461017109453678,
        0.01859818957746029,
        0.07548782229423523,
        -0.11004757881164551,
        -0.03936391696333885,
        0.004105711355805397,
        -1.1872753021430223e-32,
        0.036522574722766876,
        0.02267257682979107,
        -0.02819475345313549,
        -0.0367276668548584,
        0.02063615992665291,
        0.009269533678889275,
        0.04805436357855797,
        0.12890873849391937,
        0.07976798713207245,
        -0.07585884630680084,
        0.03749028965830803,
        -0.06132097914814949,
        -0.15072698891162872,
        0.018885472789406776,
        -0.005380763206630945,
        -0.030388180166482925,
        -0.043207913637161255,
        -0.06497678905725479,
        0.0468100979924202,
        -0.004214929882436991,
        0.08225889503955841,
        0.11119857430458069,
        0.07718968391418457,
        0.01758795976638794,
        -0.019436148926615715,
        0.0028718034736812115,
        0.025477755814790726,
        0.06309816986322403,
        0.055887989699840546,
        0.06625574082136154,
        -0.010647407732903957,
        -0.028726542368531227,
        0.015265527181327343,
        0.04554768651723862,
        0.01976783201098442,
        0.018888138234615326,
        0.03803081437945366,
        0.040310490876436234,
        0.014504164457321167,
        -0.07706966251134872,
        0.006571318954229355,
        0.04337629675865173,
        -0.009516551159322262,
        0.0021069073118269444,
        0.008841470815241337,
        -0.10651841014623642,
        -0.03944907709956169,
        -0.011662660166621208,
        0.018589597195386887,
        -0.028645124286413193,
        -0.06827683001756668,
        -0.08012400567531586,
        -0.050107602030038834,
        -0.022559398785233498,
        -0.01719098538160324,
        0.027970580384135246,
        -0.010607607662677765,
        -0.03299270570278168,
        0.029313871636986732,
        -0.008035820908844471,
        0.05574814975261688,
        -0.014921201393008232,
        -0.063847117125988,
        -0.08180095255374908,
        -0.02236141264438629,
        -0.10091415792703629,
        0.08475431054830551,
        0.009592253714799881,
        -0.03439665213227272,
        -0.004553965292870998,
        -0.040119897574186325,
        0.017642773687839508,
        0.03192438185214996,
        0.017915526404976845,
        0.03533037379384041,
        0.015846988186240196,
        -0.03804512321949005,
        0.02602071687579155,
        0.07857592403888702,
        -0.05725686252117157,
        -0.09012026339769363,
        -0.026991942897439003,
        -0.0025256199296563864,
        0.0909082219004631,
        0.1162634864449501,
        0.0593717060983181,
        0.1009444072842598,
        -0.05614520609378815,
        -0.03706037998199463,
        0.06227562949061394,
        0.03578661382198334,
        0.037688687443733215,
        0.09703102707862854,
        0.13317692279815674,
        -0.09103018790483475,
        -6.321067758108256e-08,
        0.03119550459086895,
        0.033208347856998444,
        -0.0009527879883535206,
        -0.009812497533857822,
        -0.01579601690173149,
        -0.040192004293203354,
        -0.015053934417665005,
        0.01912420429289341,
        0.04727697744965553,
        -0.05891376733779907,
        0.0982135459780693,
        -0.011765195988118649,
        -0.049767788499593735,
        0.11254680156707764,
        0.031777650117874146,
        -0.019905896857380867,
        -0.11300654709339142,
        0.0992734357714653,
        -0.0391155481338501,
        -0.03788617253303528,
        -0.046724770218133926,
        0.08109729737043381,
        0.03496445342898369,
        0.005435636267066002,
        0.05958084762096405,
        0.037866249680519104,
        0.010622799396514893,
        -0.028441473841667175,
        0.036556292325258255,
        0.01224035955965519,
        -0.08260612934827805,
        0.019375396892428398,
        0.015362175181508064,
        -0.01963442750275135,
        -0.07880838960409164,
        -0.024734050035476685,
        -0.02480025589466095,
        -0.04164603352546692,
        -0.011319248005747795,
        0.00455327145755291,
        0.05684111639857292,
        -0.10212656110525131,
        -0.07430201023817062,
        -0.022641994059085846,
        0.04647671431303024,
        -0.06705955415964127,
        0.06849803775548935,
        -0.06346336007118225,
        -0.04766895994544029,
        -0.014338009059429169,
        -0.021672463044524193,
        0.03576167672872543,
        0.02015937678515911,
        -0.019788118079304695,
        0.0631345808506012,
        -0.027394862845540047,
        -0.019641421735286713,
        0.05659927427768707,
        0.02122923731803894,
        -0.01042198296636343,
        0.014432860538363457,
        0.05415358394384384,
        -0.07461132109165192,
        0.043804727494716644
    ]
}