{
    "id": "6RHG5xM52P4",
    "title": "PS5 Pro is HERE",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2024-09-10T18:30:07Z",
    "video_url": "https://www.youtube.com/watch?v=6RHG5xM52P4",
    "category": "Science & Technology",
    "tags": [
        "ps5",
        "ps5 pro",
        "pro",
        "playstation",
        "sony",
        "reveal",
        "announce",
        "announcement",
        "gta",
        "gta 6",
        "gta vi",
        "mark cerny",
        "austin",
        "evans",
        "austin evans",
        "PlayStation 5 Pro",
        "Sony console",
        "next-gen gaming",
        "ray tracing",
        "PSSR",
        "upscaling technology",
        "GTA 6",
        "console upgrade",
        "gaming hardware",
        "high-performance console",
        "PlayStation 5 Slim",
        "console comparison",
        "GPU upgrade",
        "frame rate boost",
        "gaming news"
    ],
    "views": 400858,
    "likes": 13196,
    "comments_count": 2617,
    "description": "Matt and I go more in-depth on PS5 Pro on @thisis:   Today Sony unveiled the $699 PS5 Pro but does this most expensive PlayStation ever actually make sense? I dive deep into Sony's surprising announcement of the PS5 Pro, breaking down its impressive specs and eye-opening $699 price tag. From its beefed-up GPU to enhanced ray tracing capabilities, I explore whether this powerhouse console is worth the steep upgrade. Plus, I speculate on how games like GTA 6 might leverage this new hardware and what it means for the future of console gaming.  Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:",
    "description_links": [
        "https://youtu.be/Qf646uOZfPs",
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- And there, my friends, is the brand new PS5 Pro. Well, pretty much at least. So the PS5 Pro is finally official and it is an interesting upgrade. So essentially what you're getting here is the PS5 at $699. So Sony just wrapped up a very brief announcement of the PS5 Pro. They literally got into it within like the first five seconds and there are some interesting things to get into. So they begin by talking a little bit about the PS5 which of course is sticking around. They don't wanna make the Pro so good that the regular PS5 is obsolete but it's clear they're setting this up as a console that is going to be best for games such as GTA 6 which you've gotta assume it will be the most powerful console to play that with. So going through the whole list, they recap some of the PS5 specs. So its Zen 2 CPU cores, its GPU, the fact that it's got the Tempest 3D Audio, DualSense. They really just kinda reiterate like hey, guess what? The existing PS5 is still really good, dot, dot dot but developers were beating down Mark Cerny's door begging for more graphical horsepower. It was not certainly the fact that they wanted to sell you a $699 PlayStation 5 or anything. No, it was, it was just because the developers were asking Sony for it, not Microsoft. So what we're getting here is essentially, really the sales pitch is PS5 Pro will be able to play PS5 games on high settings at 60 FPS. That's really, if we could boil everything down, that is what the main target is. So they talked a lot about the big three, so the first of which is the GPU. Now, interestingly, even though Mark Cerny typically goes into a lot of depth on these kind of presentations, he didn't give us a teraflop number. He didn't give us even like the RDNA 3 or whatever they're actually using. He just talked about how it is much more powerful, specifically with 67% more compute which if I could do some math, would probably put it at like 30 teraflops or something. I think, maybe, no. 20. Uh. 13, 11, 12, 16, 20 tera, ah, a lot. Combined with a little bit more memory bandwidth, the overall result is 45% faster rendering performance. So that is without ray tracing. That is just pure raw GPU horsepower and if you think about that, that does make sense. If you're playing a game that is running the quality mode at 30 FPS, 45% more GPU is probably close enough to get you to running at 60 FPS. That was very much the sort of the demos that they were showing, right? They're showing games such as The Last of Us II running with their Performance Mode at 60 FPS. Same thing with Spider-Man. There are a lot of the games, the first party titles that they're really showing off at how they're able to push those higher frame rates without sacrificing quality. Now, I will say reading between the lines a little bit, he never said it was exactly the same. There was a lot of comparisons, a lot of like, \"it's almost the same, it's nearly there.\" My guess is that you may still see a very slight sort of downgrade in sort of graphic quality like maybe you're at 1800p versus 2160p or something when you're actually playing some of these games in Performance Mode. And to be clear, he did not say that all games are dropping Performance and the Fidelity Mode but the idea behind the PS5 Pro is that with the additional GPU horsepower, you would not need to choose between the two. In fact, an interesting stat he pulled up, \"2/3 of gamers pick Performance Mode instead of Fidelity Mode,\" which makes sense. That's certainly what I do as well because that 60 FPS makes a big difference. Now, on top of just the raw GPU horsepower, they also then talk about the ray tracing. So the ray tracing is something which is going to be a bigger feature on the PS5 Pro. So as it sits right now, the existing Xbox Series S, Series X and PS5 have, let's be honest, fairly weak ray tracing compared to something like an NVIDIA GPU, right? It exists but it doesn't really do that much but with the PS5 Pro, they have enhanced the ray tracing capabilities with two to three times the performance which means the games such as GTA 7 can actually enable ray tracing not just in the little camera mode but actually in real gameplay which is nice. This is something that is I think a real selling point for these next generation consoles. Again, I'm thinking GTA 6 here. I feel like that's gonna be a game that they can really lean into the ray tracing on the PS5 Pro. It is going to be a system seller. This is also combined with PlayStation Spectral Super Resolution which is for all intents and purposes a DLSS competitor. So if you're unfamiliar, DLSS is an NVIDIA tech that essentially uses AI to upscale each frame, right? It actually works very, very well and it's pretty much the standard on PC. Intel, AMD have also kind of built their own solutions. But it seems like what Sony have done is likely made a sort of semi-custom thing. So essentially what you'll be able to do is that internally on the PS5 Pro, games will be running at say 1440p or something and then using this PSSR technique, it'll be able to upscale them to a very clean looking 4K or at least that's the theory. Now, again, based on stuff like DLSS, I can fully believe that this would be pulled off in a really sort of strong manner and that's probably how they're pulling off some of these numbers because again, if you look at it, 45% faster render, by itself is not enough to get yourself from 30 to 60 FPS, right? You would need 100% more but if you've got more raw horsepower, more memory bandwidth, more raw compute and a little bit of extra AI sprinkling on top, not useless garbage AI but actually useful AI, this does make a lot of sense. Now, on top of that, they did talk about how some of the other things that they have built are going to help kind of push the PS5 Pro forward. So they give a bunch of gameplay examples, mostly first party, although they did show some other titles such as Hogwarts Legacy where they showed that it is going to be engaging a higher level of ray tracing with things such as reflections, shadows and I quote \"it is the most powerful console that we've ever built\" and that's certainly true and it had better be because the PS5 Pro when it launches on November 7th comes in at $699. So you're talking about $700 for the PS5 Pro then if you want to buy the disc drive, presumably that will also be $80 like it is on the PS5 Slim. So you're talking about almost an $800 PlayStation. What is this, 2006? I guess the only upside to that $700 price is that it is with a two terabyte SSD as opposed to the one terabyte on the PS5 Slim. So that is nice especially considering that you know that these PS5 Pro games are gonna be freaking 300 gigs, right? How big is GTA 6 gonna be on PS5 Pro? I'm just gonna keep talking about GTA 6 'cause honestly, if I was gonna sum this whole thing up, GTA 6 feels like it's going to be the reason why you buy a PS5 Pro. That just feels like the answer because GTA 6 is not coming to PC any time soon. If you want the absolute best way to play that game, the PS5 Pro, I will guarantee you is going to be the best spot, right, like there is no Xbox answer to the PS5 Pro and I don't think we will see one until the next generation. So for the next several years, the PS5 Pro is going to be the most powerful console. It's a decent upgrade, right? Now, the price is too much. I really think that they should have tried to go for $600 like just the fact that it is a $200 upgrade over, no, no, sorry, it's a $280 upgrade over the standard PS5 Slim if you wanna get the disc drive, right, or a $250 upgrade if you wanna go from base PS5 Slim to Pro without a disc drive. That's, it's a lot of money. It's a lot of money. I think for someone who wants the ultimate in console gaming, PS5 Pro all day and of course make sure to subscribe to the channel and ring a ling that ding a ling button because as soon as this thing drops on November 7th, I'm gonna be all over it. But I gotta say like I'm excited to try this thing. I'm sure it's gonna be a very interesting console in a lot of directions but it is so expensive, right, like almost $800 if you want the fully kitted out version with the disc drive. That's a bit of a tough sell, right? And Sony have consistently raised the price of the PS5 ever since it's been launched. It's like, I mean the PS4 Pro was $100 more than the regular PS4. It was $400, right? That was not that long ago. And now we're talking about a console which is for all intent and purposes double the price. But let me know what you think about the PS5 Pro in the comments below. Until next time, my friends, I'm gonna go try to play some Concord on my brand new PS5 Pro. That was a joke 'cause Concord's dead now.",
    "transcript_keywords": [
        "Pro",
        "GPU",
        "ray tracing",
        "lot",
        "Performance Mode",
        "GTA",
        "mode",
        "games",
        "FPS",
        "performance",
        "GPU horsepower",
        "tracing",
        "ray",
        "Pro games",
        "console",
        "Fidelity Mode",
        "Sony",
        "raw GPU horsepower",
        "Slim",
        "Mark Cerny"
    ],
    "transcript_entity_values": [
        "Fidelity Mode",
        "2160p",
        "Us II",
        "30 teraflops",
        "first",
        "12",
        "280",
        "two",
        "the PS5 Slim",
        "one",
        "the Fidelity Mode",
        "DualSense",
        "the PS4 Pro",
        "Spider-Man",
        "Zen 2 CPU",
        "67%",
        "GPU",
        "two to three",
        "600",
        "45%",
        "the PS5 Pro",
        "PSSR",
        "PlayStation 5",
        "a PS5 Pro",
        "250",
        "PlayStation",
        "2006",
        "16",
        "30 to 60",
        "Mark Cerny's",
        "SSD",
        "1800p",
        "FPS",
        "GTA 7",
        "100",
        "DLSS",
        "PS5",
        "13",
        "2/3",
        "November 7th",
        "the first five seconds",
        "AMD",
        "699",
        "the PS5 Pro",
        "Hogwarts Legacy",
        "PS5 Pro",
        "400",
        "PlayStation Spectral Super Resolution",
        "Xbox Series S",
        "Xbox",
        "100%",
        "700",
        "Sony",
        "almost $800",
        "AI",
        "200",
        "Microsoft",
        "the next several years",
        "Mark Cerny",
        "60 FPS",
        "Performance Mode",
        "about $700",
        "$699",
        "three",
        "1440p",
        "80",
        "the PS5 Pro",
        "30",
        "11",
        "PS4",
        "Concord",
        "4",
        "300",
        "6",
        "Intel",
        "NVIDIA",
        "DLSS",
        "3",
        "20"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "EVENT",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "LAW",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERCENT",
        "FAC",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "PRODUCT",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "EVENT",
        "ORG",
        "PERCENT",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "PERSON",
        "MONEY",
        "WORK_OF_ART",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.033105455338954926,
        -0.03537428006529808,
        0.040434177964925766,
        -0.010144016705453396,
        0.13206999003887177,
        -0.025241075083613396,
        0.04247703775763512,
        0.0657275915145874,
        0.009888452477753162,
        0.12232847511768341,
        -0.11491580307483673,
        0.09805114567279816,
        -0.01701042801141739,
        -0.0412418432533741,
        0.04800693690776825,
        0.0038595134392380714,
        0.03457214683294296,
        -0.10097312927246094,
        -0.060234300792217255,
        -0.04194558411836624,
        -0.03193386271595955,
        -0.1540125608444214,
        -0.02071332186460495,
        0.009039751254022121,
        0.02750157006084919,
        0.02583012357354164,
        -0.01911993883550167,
        -0.016943415626883507,
        -0.0541282594203949,
        0.036063991487026215,
        -0.09657517075538635,
        0.06266218423843384,
        -0.03847464546561241,
        0.0028915544971823692,
        -0.0287734717130661,
        -0.04648592323064804,
        0.06473854184150696,
        0.012585294432938099,
        -0.06009432673454285,
        -0.0227926354855299,
        -0.025758305564522743,
        -0.013141902163624763,
        -0.08439598232507706,
        0.05328250303864479,
        0.015545153990387917,
        -0.028323298320174217,
        -0.030690185725688934,
        -0.02184012345969677,
        0.009385084733366966,
        0.009330077096819878,
        -0.019156409427523613,
        -0.038579169660806656,
        0.021442731842398643,
        -0.07555025070905685,
        -0.09672436118125916,
        0.02828790433704853,
        0.05719510093331337,
        -0.07760687917470932,
        0.07377051562070847,
        0.008370901457965374,
        -0.029591521248221397,
        -0.14791150391101837,
        -0.016292499378323555,
        -0.0037293266505002975,
        0.025370167568325996,
        -0.023968806490302086,
        0.059740129858255386,
        -0.004402452148497105,
        0.02643028274178505,
        0.035011954605579376,
        -0.06588900834321976,
        0.0880286917090416,
        0.04063519090414047,
        0.035957273095846176,
        -0.04775049909949303,
        -0.019046682864427567,
        0.035311464220285416,
        -0.028200501576066017,
        0.01070374809205532,
        0.05221249535679817,
        0.07401624321937561,
        0.022497138008475304,
        -0.1222563236951828,
        -0.04087230935692787,
        -0.002337891608476639,
        0.05317169427871704,
        0.006578913424164057,
        0.00028979539638385177,
        -0.01232842542231083,
        -0.037497628480196,
        -0.03325926885008812,
        0.03653303161263466,
        0.014205627143383026,
        -0.021879874169826508,
        -0.078816719353199,
        0.009284045547246933,
        -0.12233671545982361,
        -0.11255789548158646,
        -0.03166317939758301,
        0.03060244582593441,
        0.025077758356928825,
        0.0702911764383316,
        0.06175753101706505,
        -0.04847012832760811,
        -0.05350511148571968,
        -0.022050993517041206,
        -0.06137461215257645,
        0.08117175102233887,
        -0.002130415290594101,
        0.04310589283704758,
        -0.06348305195569992,
        0.014965320937335491,
        -0.06142548471689224,
        0.0218422319740057,
        0.028182772919535637,
        0.08327635377645493,
        -0.05516238138079643,
        0.03927671164274216,
        0.05867501348257065,
        0.0024314557667821646,
        0.024496352300047874,
        -0.017191246151924133,
        -0.062158387154340744,
        0.03193800151348114,
        -0.02425561659038067,
        -0.05619237944483757,
        -0.02360863797366619,
        5.004403447080923e-33,
        -0.039209429174661636,
        0.11319036036729813,
        0.0589166134595871,
        -0.02639196254312992,
        -0.06846186518669128,
        0.003448355942964554,
        0.019223112612962723,
        0.032143186777830124,
        -0.009030100889503956,
        0.06029767543077469,
        -0.04022117331624031,
        0.029337918385863304,
        -0.04750582203269005,
        0.031137948855757713,
        0.12745128571987152,
        -0.02935592085123062,
        -0.03894590586423874,
        0.048532914370298386,
        -0.012535091489553452,
        0.03403613343834877,
        -0.00397869385778904,
        0.0370306596159935,
        0.02154235728085041,
        -0.03465847298502922,
        0.010625277645885944,
        0.09844253212213516,
        -0.06575334072113037,
        -0.004362283740192652,
        0.03569566830992699,
        -0.008041341789066792,
        -0.11444218456745148,
        0.0151545200496912,
        0.06810728460550308,
        0.03269609808921814,
        0.048656657338142395,
        -0.02767299860715866,
        0.03567744791507721,
        -0.07309753447771072,
        0.03191547468304634,
        0.05421801283955574,
        0.013299318961799145,
        0.023406358435750008,
        -0.06773550063371658,
        0.0007494442979805171,
        0.026807207614183426,
        0.018453586846590042,
        -0.06037023663520813,
        -0.04452529922127724,
        -0.09588610380887985,
        -0.03933695703744888,
        -0.05093426629900932,
        0.077300526201725,
        -0.00990423932671547,
        0.03444285690784454,
        -0.004310487769544125,
        -0.08580534160137177,
        0.05347966030240059,
        -0.02039705403149128,
        0.08331292867660522,
        0.0685320645570755,
        0.0957806184887886,
        -0.016661547124385834,
        -0.012744476087391376,
        0.0013492214493453503,
        -0.11754970997571945,
        0.10127633810043335,
        0.07322794198989868,
        0.06625069677829742,
        -8.406356209889054e-05,
        0.054256878793239594,
        -0.022771067917346954,
        0.028682425618171692,
        -0.0005148047348484397,
        0.02160191722214222,
        0.06848675012588501,
        0.05231991410255432,
        -0.04347020760178566,
        0.018536655232310295,
        0.0001267533953068778,
        0.07428032159805298,
        -0.07378216087818146,
        0.015842821449041367,
        -0.05190207064151764,
        0.026547668501734734,
        -0.029406122863292694,
        0.10733558237552643,
        0.06922377645969391,
        -0.030487483367323875,
        -0.06882864236831665,
        -0.02427978441119194,
        0.0141382971778512,
        -0.029231993481516838,
        -0.0006639987113885581,
        0.08176254481077194,
        0.0052525498904287815,
        -6.209939760090382e-33,
        0.02569267526268959,
        -0.08505032956600189,
        0.056472018361091614,
        0.021275851875543594,
        -0.026370519772171974,
        -0.04928550496697426,
        -0.0448855459690094,
        -0.05624246224761009,
        -0.04108048975467682,
        -0.017632707953453064,
        -0.005391937680542469,
        0.036659516394138336,
        0.025034843012690544,
        0.0861971378326416,
        0.015099343843758106,
        -0.04371550679206848,
        0.020473221316933632,
        -0.05247543379664421,
        0.03995133191347122,
        -0.036520034074783325,
        0.11436696350574493,
        0.05779927596449852,
        0.01708352379500866,
        0.010525789111852646,
        0.010074982419610023,
        -0.005474747158586979,
        0.07792776823043823,
        -0.02888866700232029,
        0.024743065237998962,
        -0.0033923685550689697,
        -0.003797485027462244,
        -0.027910804376006126,
        0.03290453180670738,
        -0.005141374655067921,
        0.021752530708909035,
        0.031215982511639595,
        0.03333492949604988,
        -0.007486906833946705,
        0.03741342946887016,
        0.022791048511862755,
        -0.016583189368247986,
        0.05008019506931305,
        0.015872932970523834,
        -0.044754642993211746,
        -0.002562363166362047,
        -0.004724489990621805,
        0.015398249961435795,
        -0.008386890403926373,
        0.10411544889211655,
        0.002954494208097458,
        0.08873990923166275,
        0.02792687900364399,
        -0.06098368391394615,
        -0.032007765024900436,
        -0.07201426476240158,
        -0.09272173047065735,
        -0.10875654965639114,
        0.026598995551466942,
        -0.02155519649386406,
        -0.02326161414384842,
        0.03159581497311592,
        0.08279112726449966,
        -0.05845898389816284,
        0.032446566969156265,
        -0.038259733468294144,
        0.029337450861930847,
        0.14424113929271698,
        -0.05908261984586716,
        0.018581751734018326,
        -0.07362983375787735,
        -0.08812721818685532,
        -0.026087861508131027,
        -0.029976248741149902,
        0.012933441437780857,
        -0.010388271883130074,
        0.06696698814630508,
        0.011211171746253967,
        0.039367303252220154,
        0.04526166245341301,
        0.012051384896039963,
        -0.08779004216194153,
        -0.018485616892576218,
        -0.0252037663012743,
        -0.017207777127623558,
        -0.005468151997774839,
        -0.025833722203969955,
        -0.004871198907494545,
        -0.002007079077884555,
        -0.007578997872769833,
        0.028104647994041443,
        -0.018838193267583847,
        0.026946816593408585,
        -0.11172079294919968,
        0.007739284075796604,
        -0.03656516596674919,
        -4.927278496325016e-08,
        0.109725221991539,
        -0.04330885037779808,
        0.03966521471738815,
        0.028937246650457382,
        0.05759769305586815,
        -0.043164726346731186,
        -0.02098461426794529,
        -0.010574926622211933,
        0.038553353399038315,
        0.036715686321258545,
        0.042432546615600586,
        -0.019599977880716324,
        0.029178235679864883,
        -0.028711702674627304,
        -0.027603622525930405,
        0.07621252536773682,
        -0.039572954177856445,
        0.032295629382133484,
        0.031571678817272186,
        0.018025843426585197,
        -0.022547906264662743,
        0.01439646352082491,
        0.03982120379805565,
        -0.0879763588309288,
        -0.019292447715997696,
        -0.04901610314846039,
        -0.09302628040313721,
        -0.011792109347879887,
        0.040262170135974884,
        -0.019344648346304893,
        -0.006525293458253145,
        -0.0588003545999527,
        -0.007162659894675016,
        -0.05512722581624985,
        0.09858281165361404,
        0.00041193270590156317,
        0.014121006242930889,
        0.002013870980590582,
        0.04263690114021301,
        -0.022854909300804138,
        -0.012267411686480045,
        -0.11191965639591217,
        -0.06912332773208618,
        0.015077933669090271,
        -0.01394069753587246,
        -0.019569940865039825,
        -0.08436272293329239,
        -0.07752583920955658,
        -0.05465569719672203,
        0.007544734049588442,
        -0.04224571958184242,
        0.06970129907131195,
        -0.0012054446851834655,
        -0.01325115468353033,
        0.046002648770809174,
        -0.00271436246111989,
        0.0006200758507475257,
        -0.010946341790258884,
        -0.07967618107795715,
        0.061120301485061646,
        0.03199823200702667,
        -0.08555331081151962,
        0.020951541140675545,
        0.05225387588143349
    ]
}