{
    "id": "6RPwBOTRAnI",
    "title": "6 Monitors, 1 GPU: World's WORST Multi-Display Gaming Setup",
    "channel": "Dawid Does Tech Stuff",
    "channel_id": "UCvcRA2Hva1lULVf4GCouH8w",
    "subscriber_count": 688000,
    "upload_date": "2022-03-30T17:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=6RPwBOTRAnI",
    "category": "Science & Technology",
    "tags": [
        "dawid",
        "dawid does tech stuff",
        "PC",
        "gaming",
        "intel",
        "AMD",
        "Corsair",
        "Gaming",
        "Game",
        "Computer",
        "Gaming PC",
        "David Does Tech Stuff",
        "DDTS",
        "Tech",
        "Stuff",
        "worlds worst",
        "multi-monitor",
        "gaming setup",
        "vga",
        "six vga",
        "multi-display"
    ],
    "views": 470786,
    "likes": 20456,
    "comments_count": 1174,
    "description": "*Today's video sponsor* Go sign up to Linode here:   I use an obscure abomination of a graphics card to build the worst multi-monitor gaming setup the world has ever seen.  Go check out Free Geek Vancouver here:   Get some AWESOME Dawid merch here:   -Here is a link to my Patreon page, it would be awesome if you check it out:   -Follow me on whichever Social media you don't hate-  Discord:  Twitch:  Twitch shorts channel:  YouTube:",
    "description_links": [
        "http://linode.com/dawid",
        "https://freegeek.myhelcimstore.com/home/",
        "https://dawiddoesmerch.com",
        "https://www.patreon.com/DawidDoesTechStuff",
        "https://discord.gg/b34uVGaYVB",
        "https://www.twitch.tv/dawiddoestechstuff",
        "https://www.youtube.com/channel/UCAiMJaOrvTik7XyJethz-ig",
        "http://www.youtube.com/c/dawiddoestechstuff"
    ],
    "transcript": "In this very descriptively labeled box that seems to have been dropkicked here, all the way fromChina. There is a very special graphics card that's gonna let us build and game on the world's worst multi-display gaming setup. Oh the crosshair is actually split between the two monitors, which is not ideal but before we get into that it's time for a word from today's video sponsor: Linode! Today's video is sponsored by Linode. A company that's been awarded by me as having the best name to say. Just give it a try... Liiiinoode... It feels good doesn't it? Linode is a Linux-based, cloud computing and web hosting service that offers multiple products to manage cloud storage, websites, databases, game servers, Kubernetes and they can even handle whatever computational load you can imagine ;) and regardless of what service you decide to go with, you will get access to award-winning customer support. If all of this sounds good to you, sign up to Linode using the link in my description below to get a 60-day, $100 free credit! Thank-you Linode for sponsoring today's video! Now the first step is to have a look at our very special graphics card that took like nine million years to get here because apparently it is quite time-consuming drop kicking a box across the Pacific Ocean, which does make sense. I think this is the first graphics card I've ever seen shipped in a tin before so that's that's pretty cool. Although our tin was definitely pre-cut open. I'm assuming by border patrol? They just wanted to make sure that there wasn't a pound of cocaine in here I guess... Uh which you know, fair enough! and then under more bubble wrap we have the graphics card! Whoa that is actually a really cool looking graphics card. Now the thing that makes this blue graphics card interesting, is not that it's an AMD R7 350, because that's about as interesting as a spam call trying to sell you life insurance. What makes it special is the six Mesozoic period ports on the back now I have no idea why some Aliexpress seller thought it would be a good idea to put six Mesozoic period ports on a graphics card. But those ports in conjunction with how hilariously under-powered the R7 350 is with its two gigs of video memory and some old mismatched Mesozoic monitors I found lying around, we have a recipe for quite the gaming experience! Interestingly it seems the way in which the seller managed to staple this many Mesozoic period ports to a relatively modern GPU was by using six of these analogic chips with a very sexy name anx 9833 which seemed to be the same converter chip used in display port to Mesozoic period dongles. So basically the seller just glued one a hell of a display port to Mesozoic converter to the end of an R7 350 for some reason. Anyway with that it's time to drop this bad boy in a PC. Now considering that we're going to be powering six displays with a graphics card that's about 80 years old at this point, the rest of the system doesn't really matter considering that the graphics card is always going to be the bottleneck. So I've just dropped it into this PC with an Intel 12 400 F in it and 16 gigs of ram. So now that we've got the heart of the world's worst multi-panel gaming setup ready. It's time to have a look at the monitors that we're going to be using for this Mesozoic period panel array. Now I am quite bad at planning, which may make some of you think, \"Dawid, where did you get six mesozoic period monitors with what i can only imagine to be irresponsibly short notice?\" - well obviously I bought them at FreeGeek! Where else would you get convenient access to obscure old hardware in the greater Vancouver area? Anyway with that let's get started. Now I think how I'm going to go about this, is I'm going to start the setup with just a single monitor to see how the graphics card handles it and then we'll slowly scale it up into the full Mesozoic array. Oh oh nice, the cable is too thick to fit through that hole. Now to really sell the terribleness of the setup I am using some e-waste peripherals from my recent pre-built purchase. Hey the graphics card works which I was not worried about at all. Now AMD has decided that this graphics card is no longer worthy of support, so we only have legacy drivers for it. Luckily the legacy drivers aren't that old. They're from last year. So yeah it should still be very usable. Wow, you can really tell that the Mesozoic period port isanalog. There really is this very retro haze to the image. It's pretty cool. I quite like it. So with 1080P with the lowest settings on GTA 5. We're getting about 60 frames per second which would be fine if we were just gonna use one monitor. The problem is we're gonna end up with a lot more than just one monitor and another thing that worries me is that at 1080P we are already using the majority of the two gigs of video memory which again does not bode well for how this performance is going to scale up. But the GPU is running very cool and very quiet so that's good. So with that, we figured out that our trans-pacific hacky sac victim works - which is good! So yeah let's add a couple more displays. Wow these are significantly less chunky VGA cables than that other one. That is already a snug fit back there. I don't know, I feel like if anything wiping it down makes it worse. I'm actually surprised at how much monitor surface area we already have considering that these are all basically 22 inch. Uh it's quite impressive but okay, let's fire up the system. Wow, that monitor looks really terrible. Like if you compare it to the Dell next to it, like that is clearly the inferior monitor. Wow, I feel like I work at a security checkpoint at an airport. Um but we do need to set it up properly. At which point I proceeded to spend longer than I'd like to admit struggling to set up the monitors until I realized all I needed to do was use ifinity in AMD's driver's suite. After which setting things up got easier than beating a three-year-old at 100 meter sprint. Hey! There we go, I just needed to change the resolution it seems. So we've got 5760 x 1080P. Can we just say the graphics card is handling this relatively well. I'm actually impressed. We are now running at about a third of the frame rate we got before, which checks out. You know it's it's three times the resolution now. I've moved myself into the middle because being off to the side does ruin the effect somewhat and um the first thing that I notice is that I don't like this at all because the displays on the side are definitely a different FOV to the display in the middle so it just seems more zoomed in on the sides and then when you're driving there's so much movement in your peripheral vision that it's actually quite disconcerting but I actually think GTA 5 may not be the best game for this. So uh let's try something else. Okay, I guess dirt is better than GTA 5 like the the field of view still feels a bit weird and the fact that the bezels are so thick and not quite aligned, it does mean that it feels pretty patchy and how it's stuck together but you know this is the world's worst multi-display gaming setup, so it does make sense but you know, it's working! We've got 74 frames per second uh so frame rate's not an issue. Anyway, it's not like this is why we're here so I think it's time to finally go whole hog. Now the centerpiece of our Mesozoic multi-monitor gaming setup is going to be this which is the cheapest six monitor vasa arm I could find on Amazon. Now most of the other ones were selling for about 600-ish Canadian rubles, whereas I bought this bad boy for about 150 so I think it would fit right in with this build. Oh wow, it is really starting to look like a thing. So now we need to mount the bottom row of monitors and then we can move up to the second deck. Wait a minute oh crap it's upside down yeah good okay okay now the first thing that's obvious we do need to lift this center monitor up a little bit wow this is a stupid process okay well it's not perfect but we're definitely getting there so let's add some more monitors and see how it goes okay well the bottom row is definitely not perfect but i guess it's because they're all different monitors so obviously they don't quite line up also in terms of the stand on this monitor i couldn't i couldn't figure out how to get the little bottom bit off so um yeah it's just gonna have a bit of a dangler for the whole duration of this setup okay i think this is the right way around and then i don't know like here okay now this is starting to look like some serious tech stuff oh damn i i feel like i'm about to hook into the matrix over here this is this this is quite the view and setting it all up was even easier than before so like out running a two-year-old i think that's worked look at that okay so in terms of resolution we've got 5760 which makes sense because well we have the same horizontal resolution by 2160 which is you know 1080 and 1080. So that all checks out. We've got a nice broken up jupiter in the middle. That is quite problematic considering that we have like eight square miles worth of bezel between the various bits of image but look at that we've got some huge GTA action going on! Give credit where credit is due. I clicked like five times and it's working, so that little Mesozoic period graphics card is quite impressive! It actually looks like the parallax effect, is much less pronounced, but there is a bit of a disconnect between Franklin's body and his head. It's a bit of a weird place for the break to happen while driving. It actually works really well because you have the car monitor and then you you have all of the rest of it. Although it is very difficult to see what is immediately ahead of you so, I may crash quite a lot. In terms of frame rate it's not going super well. That is, that is 13 frames per second over there. This is definitely by far the best GTA 5 gaming experience I've ever had. Again I can't really see where I'm going but then that really doesn't matter. At this point, I lowered the resolution to 4800 X 1800 which helped the performance a little bit. We have about 19-ish frames per second here, which is more playable than 13. Okay flying is really cool. Um, yes, there is a whole lot of bezel going on here but this is pretty crazy. It is quite hard work on your neck. I think after about 20 minutes of this your head will break off because of all the looking around you'll be doing. Now I will say it's not ideal that each of the six displays have a completely different color palette going on. It makes me feel a little bit like I'm a bee that's taken acid. Like it's quite a weird experience. I actually want to do a different game. I want to try like an fps. Oh the cross-hair has actually split between the two monitors. That's not ideal. I'm not sure where I'm supposed to be looking. Okay, I think it depends on the context of the scene. Okay, I'm gonna see if I can get a kill here... a few moments later ... I got a kill! Oh nice! Oh, I killed him! Oh, I got another kill. Now, I think the best way to utilize the display like this is actually an RTS game like Age of Empires 2, because look at all that real estate you have! It kind of does feel like I'm sitting in Norad, commanding an army! Actually, the frame rate is very low. That is weird. Let's see if we can fix that. Okay, in terms of low settings we have about 30 frames per second which for an RTS is fine. Like you don't need super high frame rates for a game like this. The thing that really gets me is how different all the colors are. Like it's basically just purple over here and then from where I'm sitting, that monitor is the only one that doesn't look terrible and after just spending a little bit of time playing Age of Empires, I realized that it's actually not a great setup for this, because of all the looking around you have to do, it's really difficult to keep track of what's going on in the game. So aside from a very impressive showing from our little Mesozoic period graphics card, once the novelty wears off- which happens quite quickly - yeah this is a pretty terrible multi-monitor gaming experience. Anyway. Thank-you for watching. If you enjoyed the video, consider subscribing to the channel and maybe even watching another video. A recommendation will pop up in a second and yeah! Until a couple seconds from now, thank-you for watching, bye!",
    "transcript_keywords": [
        "graphics card",
        "Mesozoic period",
        "Mesozoic period graphics",
        "Mesozoic period ports",
        "Mesozoic",
        "period graphics card",
        "graphics",
        "card",
        "mesozoic period monitors",
        "monitor",
        "special graphics card",
        "monitors",
        "period",
        "bit",
        "Linode",
        "setup",
        "period graphics",
        "graphics card works",
        "Mesozoic monitors",
        "video"
    ],
    "transcript_entity_values": [
        "first",
        "a minute",
        "six",
        "a few moments later",
        "Dawid",
        "12 400",
        "FreeGeek",
        "three",
        "GTA",
        "1080",
        "9833",
        "about 30",
        "Linode",
        "100 meter",
        "Kubernetes",
        "five",
        "nine million years",
        "Amazon",
        "4800",
        "two",
        "74",
        "Franklin",
        "60-day",
        "Vancouver",
        "three-year-old",
        "2160",
        "about 20 minutes",
        "about 60",
        "AMD R7 350",
        "Dell",
        "Today",
        "second",
        "100",
        "two-year-old",
        "RTS",
        "today",
        "about 80 years old",
        "last year",
        "a couple seconds",
        "VGA",
        "eight square miles",
        "about a third",
        "Canadian",
        "one",
        "Linux",
        "GPU",
        "13",
        "1080P",
        "Linode",
        "GTA 5",
        "22 inch",
        "the Pacific Ocean",
        "Aliexpress",
        "Intel",
        "about 600",
        "Norad",
        "5760",
        "about 150",
        "5760",
        "FOV",
        "about 19-ish",
        "AMD",
        "5",
        "16",
        "Liiiinoode",
        "Mesozoic"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "TIME",
        "PERSON",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "TIME",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "LOC",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "FAC",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON"
    ],
    "vector": [
        -0.1048530787229538,
        -0.019727202132344246,
        0.013587730005383492,
        -0.10064595937728882,
        0.0679711326956749,
        -0.03689809516072273,
        0.0642177164554596,
        0.01045809593051672,
        -0.0026944123674184084,
        -0.020021691918373108,
        -0.051848217844963074,
        -0.03132917732000351,
        -0.03574376925826073,
        0.012688045389950275,
        -0.061748161911964417,
        0.006926604080945253,
        0.0670957937836647,
        -0.04738885164260864,
        -0.03588992357254028,
        0.003443280002102256,
        0.02053118124604225,
        -0.11263038963079453,
        0.00033895837259478867,
        -0.002369131427258253,
        0.03775826096534729,
        0.03199312835931778,
        -0.001382629619911313,
        0.016213243827223778,
        -0.04957497492432594,
        -0.11079800873994827,
        0.005687448661774397,
        0.030604656785726547,
        -0.07088938355445862,
        0.04872686415910721,
        -0.04648155719041824,
        -0.06722860783338547,
        0.006107262335717678,
        -0.016678491607308388,
        -0.0965081974864006,
        -0.03487398102879524,
        -0.018458863720297813,
        0.01936265081167221,
        0.028673332184553146,
        0.009615015238523483,
        -0.015934793278574944,
        0.004926558118313551,
        -0.03018776699900627,
        -0.029144855216145515,
        0.02913488820195198,
        -0.00489766662940383,
        -0.04648621752858162,
        -0.06463824957609177,
        0.0691356211900711,
        -0.028951331973075867,
        -0.018191568553447723,
        0.03672126680612564,
        -0.022003628313541412,
        -0.058185625821352005,
        0.03328899294137955,
        0.004976778291165829,
        0.11326722800731659,
        -0.07190371304750443,
        -0.022446701303124428,
        0.06679313629865646,
        0.014750991947948933,
        -0.038349445909261703,
        0.019261559471488,
        0.00651271129027009,
        -0.05944324657320976,
        0.03649747744202614,
        0.02485533617436886,
        0.01065914984792471,
        0.011264032684266567,
        0.014474977739155293,
        0.023892730474472046,
        0.009518884122371674,
        -0.002190602943301201,
        -0.04580705240368843,
        0.08092091232538223,
        -0.008196369744837284,
        0.0980735495686531,
        0.07483429461717606,
        -0.019196484237909317,
        -0.012761144898831844,
        0.02695968560874462,
        -0.002522334922105074,
        0.00655992841348052,
        0.025311268866062164,
        0.02017328143119812,
        -0.09422403573989868,
        -0.092744380235672,
        0.09311132878065109,
        0.10781693458557129,
        0.05073494464159012,
        0.0005900774849578738,
        -0.0443146787583828,
        0.0373295433819294,
        -0.05644809082150459,
        -0.03437887504696846,
        0.09387664496898651,
        0.018288997933268547,
        0.02872980386018753,
        0.08665575087070465,
        0.007677567657083273,
        0.029353067278862,
        -0.04914851114153862,
        -0.005280708894133568,
        0.07668983191251755,
        -0.012253887951374054,
        0.018239812925457954,
        -0.08240446448326111,
        0.06858542561531067,
        -0.03836372494697571,
        0.03942237049341202,
        -0.04607968404889107,
        0.037679072469472885,
        -0.05229448527097702,
        0.0039912122301757336,
        0.0839158222079277,
        -0.004640709143131971,
        0.012013424187898636,
        0.002526168944314122,
        0.016185171902179718,
        0.038619011640548706,
        0.045794516801834106,
        0.04525678977370262,
        -0.042509254068136215,
        2.5028544902471527e-33,
        0.02590806595981121,
        0.022710397839546204,
        -0.07695417106151581,
        0.025143656879663467,
        0.0680619478225708,
        0.04079892113804817,
        -0.024192554876208305,
        0.05938160419464111,
        -0.050380777567625046,
        0.032698459923267365,
        -0.02337087318301201,
        -0.007375654764473438,
        -0.03624991327524185,
        0.06272624433040619,
        0.07365164905786514,
        -0.07937965542078018,
        -0.0015105492202565074,
        0.022623280063271523,
        0.001409198041073978,
        -0.0333777591586113,
        0.036748241633176804,
        0.04163285344839096,
        0.00490493793040514,
        -0.02055811509490013,
        0.021099446341395378,
        0.01002452615648508,
        -0.06911147385835648,
        -0.0006350844632834196,
        0.06936328113079071,
        0.033918220549821854,
        -0.008607081137597561,
        -0.10987059026956558,
        0.07028882205486298,
        0.0004910648567602038,
        -0.0005532100913114846,
        -0.03347841277718544,
        -0.09752953052520752,
        -0.08435973525047302,
        -0.04213543236255646,
        0.10540462285280228,
        -0.05848290026187897,
        0.017479192465543747,
        -0.049341291189193726,
        -0.08770139515399933,
        -0.028191769495606422,
        0.038894474506378174,
        0.011788764037191868,
        -0.03196621313691139,
        -0.0480882003903389,
        0.006650179624557495,
        -0.09349377453327179,
        0.02658836729824543,
        0.020184557884931564,
        0.003508575027808547,
        -0.03480871766805649,
        -0.039888687431812286,
        -0.008739792741835117,
        -0.04018149524927139,
        0.03866830840706825,
        0.0011005387641489506,
        -0.0411837212741375,
        0.004629581701010466,
        -0.062044907361269,
        0.024839160963892937,
        -0.06231537461280823,
        -0.03401283919811249,
        0.07950296252965927,
        0.04966530203819275,
        -0.05295673385262489,
        0.023694314062595367,
        -0.041464664041996,
        0.03192215785384178,
        0.007229132577776909,
        -0.06290716677904129,
        0.02379000000655651,
        -0.0010401009349152446,
        -0.06472600996494293,
        0.02152954414486885,
        -0.02197687141597271,
        -0.019237050786614418,
        -0.004431746434420347,
        -0.018264908343553543,
        -0.0001917793124448508,
        -0.04791365936398506,
        -0.031481437385082245,
        0.0505581796169281,
        0.011727847158908844,
        -0.0748591348528862,
        -0.08572229743003845,
        0.004339133854955435,
        -0.10571838170289993,
        -0.011402233503758907,
        0.048570189625024796,
        -0.011904334649443626,
        0.060020942240953445,
        -3.3970332064504966e-33,
        -0.046432945877313614,
        -0.0535128116607666,
        0.061543382704257965,
        0.0466509684920311,
        0.08576256781816483,
        0.028286447748541832,
        0.06829730421304703,
        0.005326536484062672,
        0.06650066375732422,
        -0.023743821308016777,
        0.05310671776533127,
        0.0516616627573967,
        -0.060752905905246735,
        0.021477356553077698,
        0.010068965144455433,
        -0.02170015685260296,
        0.06766147166490555,
        -0.07802142202854156,
        0.023367606103420258,
        -0.03229876607656479,
        0.11856100708246231,
        0.009898093529045582,
        -0.08793666958808899,
        -0.05754588916897774,
        0.04329662770032883,
        0.06649010628461838,
        0.12925393879413605,
        -0.0625668615102768,
        0.008832147344946861,
        0.08461811393499374,
        0.05297144129872322,
        0.04162552207708359,
        -0.019885040819644928,
        0.08992201834917068,
        0.028699737042188644,
        0.06074216589331627,
        0.07615020126104355,
        -0.0035260107833892107,
        -0.1179422065615654,
        -0.029127461835741997,
        0.010632215067744255,
        0.0792703852057457,
        -0.04521258547902107,
        0.01970013976097107,
        0.043281760066747665,
        0.013925597071647644,
        -0.09154420346021652,
        -0.040274880826473236,
        -0.0049582431092858315,
        0.007966915145516396,
        -0.08301776647567749,
        -0.06553506851196289,
        0.03918226808309555,
        -0.012662903405725956,
        -0.04380914568901062,
        -0.12552514672279358,
        -0.046052202582359314,
        0.09578406065702438,
        -0.00023009211872704327,
        -0.0031169718131422997,
        0.06259104609489441,
        -0.018057838082313538,
        -0.14765097200870514,
        -0.0012963097542524338,
        0.04925747960805893,
        0.01434854231774807,
        0.008648324757814407,
        0.04473657160997391,
        -0.007485565729439259,
        -0.04024096950888634,
        -0.02591373212635517,
        0.060525208711624146,
        -0.09305980056524277,
        -0.1007532849907875,
        -0.061363812536001205,
        0.09096060693264008,
        0.09691173583269119,
        0.0075657251290977,
        0.04744468629360199,
        -0.002412685425952077,
        -0.0036222897469997406,
        -0.05516593158245087,
        0.08305463939905167,
        0.03174153342843056,
        0.0462479405105114,
        0.025211025029420853,
        0.0857623815536499,
        0.058610282838344574,
        -0.03285350650548935,
        -0.013576863333582878,
        -0.026360144838690758,
        0.047785524278879166,
        -0.01349459495395422,
        0.028924480080604553,
        0.05870622768998146,
        -5.140631387234862e-08,
        0.03553267568349838,
        -0.020932255312800407,
        -0.07455478608608246,
        0.007990905083715916,
        0.0003315481008030474,
        -0.07334005832672119,
        -0.017730411142110825,
        -0.04241786152124405,
        -0.001879925956018269,
        -0.07800345122814178,
        0.027390502393245697,
        -0.01642955280840397,
        -0.027842553332448006,
        0.005073379259556532,
        0.060320790857076645,
        -0.04284682124853134,
        -0.11153298616409302,
        0.08728596568107605,
        -0.038159776479005814,
        0.044729411602020264,
        -0.005727055948227644,
        0.05417447164654732,
        0.06730588525533676,
        -0.06487291306257248,
        -0.11453806608915329,
        0.03384280577301979,
        0.0560658723115921,
        0.013901466503739357,
        0.05800587311387062,
        -0.018288880586624146,
        -0.025490960106253624,
        0.044473979622125626,
        0.0039694285951554775,
        -0.06916365772485733,
        0.0584714412689209,
        -0.03880929574370384,
        -0.04212455451488495,
        0.046518538147211075,
        0.11606167256832123,
        0.03956099972128868,
        -0.05441700294613838,
        -0.05039015784859657,
        0.017091110348701477,
        0.02373654581606388,
        0.027877548709511757,
        0.03257853910326958,
        -0.02821800485253334,
        -0.08402323722839355,
        0.027768246829509735,
        -0.030857089906930923,
        -0.04059305042028427,
        0.016347611322999,
        0.022093098610639572,
        0.04428974911570549,
        0.04619720205664635,
        -0.058222029358148575,
        0.01743629202246666,
        0.004787610378116369,
        -0.023042110726237297,
        0.04683789983391762,
        0.052597690373659134,
        -0.06217055767774582,
        -0.019251178950071335,
        0.11043904721736908
    ]
}