{
    "id": "6S7K1mkf3nw",
    "title": "I bought FAKE Tech on Temu 😬",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2023-08-13T15:04:44Z",
    "video_url": "https://www.youtube.com/watch?v=6S7K1mkf3nw",
    "category": "Science & Technology",
    "tags": [
        "tech",
        "temu",
        "unboxing",
        "fake",
        "knockoff",
        "scam",
        "nintendo",
        "razer",
        "apple",
        "gadget",
        "gadgets",
        "mystery tech",
        "temu tech",
        "austin",
        "austin evans"
    ],
    "views": 731961,
    "likes": 19959,
    "comments_count": 540,
    "description": "Get a 4-week trial, free postage, and a digital scale at  Thanks to Stamps.com for sponsoring the video!  Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   Chapter Titles: 0:00 Ordering 2:00 Stamps.com 3:06 Embrace the Melon 3:39 It's a POV 4:32 DJ Not Duncan 6:22 I'm Probably Sorry 6:59 \"Real\" Apple Pencil 8:57 Goodbye Monetization 9:48 Explosive Head Massager 10:07 DIY Security 10:47 Another Massager I Guess 11:24 Don't Eat This 11:42 I Pumped Too Hard 12:06 Professional Temu Audio 13:27 Prepare Your Ears 15:56 Tricked Out 16:26 Don't Tell Mr Nintendo 17:29 Don't Tell Mr Razer",
    "description_links": [
        "https://www.stamps.com/austinevans.",
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- Welcome back to \"Temu Tech\". What is this? \"Cervical neck traction device\"? It's an inflatable neck pillow? What? Who wants an inflatable? This looks not good. This is an item I'm actually kinda curious about. The Lenovo ThinkPad TH30 wireless headphones. Okay, so, the reason I say this is that Lenovo actually make quite a variety of really nice looking headphones, or at least nice sounding headphones. For 18 bucks, I think these actually could be good. Professional wireless Lavalier microphone for iPhone. Wait, is this actually wireless? So, it looks like two, like, wireless mics kinda like the one that I've got on my shirt right now. And then it goes into your iPhone. Or you can go into a type C port. Oh, hey! Yo, yo, yo. Wait, this is something cool. Stylist pen for iPad, blah, blah, blah, blah, blah. It's an Apple pencil. I'll try it. \"Explosives head massager\". Now, hold on. Do we need to use the word \"explosive\" beside \"head massager\"? Are you sure that this is not like, \"The Brain Download 9,000\"? (laughs) \"Realistic Burger Pillow\" and it's the video is the person's face in the burger! Oh my god. This is the best. This is the best. There's a list of Pokemon games. So, Fire Red, Leaf Green, Ruby, Sapphire, Emerald, all the Game boy Advance, Pokemon mainline games, for $4. Now, as we all know, real copies of the games have been out of print for 20 years and are quite expensive, especially Emerald. I am gonna investigate the veracity of these claims 'cause I don't know if this is legitimate. Ah! \"Electric scraping instrument\"? Scraping? Obviously we're ordering a wide variety of items from Temu and hopefully, most of them make a wonderful, hilarious video. But I think it's also about time that we do some Temu on \"This Is\". What if I order some extra items specifically for Matt on \"This Is\"? Don't tell him what his is and make him do the electric scrape. All right, my friends. Time to hit the \"order\" button and see exactly what Temu has got in store for us today. This video is sponsored by stamps.com. Stamps.com kind of reminds me of how great it is to have a team. I used to do everything myself, from shooting to editing, and I'm not gonna lie, it was a little bit tough to give up that control, but I am so grateful to have people like Matt and Ken doing whatever it is that they do while I do what I do best, make videos. Just like my team, stamps.com works to make sure that you can focus on what you do best, growing your business. For the last 25 years, they've helped over 1 million businesses, big and small, just like yours. With partners like the US Postal Service and UPS, you can have the flexibility you need, and more importantly, discounts up to 84% off standard rates. Stamps.com is there for you day and night. All you need is a computer and printer. It's easy to schedule a pickup, meaning no traffic, no lines, and more time growing your business. Set your business up for success when you get started with stamps.com today. To sign up, it's stamps.com/AustinEvans for a special offer that includes a four week trial plus postage and a free digital scale. No long-term commitments or contracts. Just go to stamps.com/AustinEvans and a huge thank you to stamps.com for sponsoring this video. Let's take a look at what we- Whoa, my voice cracked. Oh no. (clears throat) - [Ken] What's it like being 12? - Let's take a look. (laughs) Temu Tech! Okay. (laughs) I remember ordering this one now. What the- ? Wait. Did I order this as an extra large? Hello, internet's busiest tech nerd here. Unfortunately, there was another item that was going to complete my Anthony Fantano cosplay, but unfortunately, Temu did not include it, so- Oh, wait, wait, wait. Is it- ? Okay, so this is a phone mount for POV shooting. This is like a head strap here. It looks like a, basically, like a straight GoPro strap, but then you connect your phone using this adapter. So, if you ever want to get those super cool POV shots and you don't wanna go out there and buy yourself a fancy action camera, well you can show exactly what the world looks like from your point of view using your tellular cellaphone. All right, seven bucks. I can kind of forgive a little bit of sus quality. So, I'm going to gently place this on my head. This is a little small for a head strap. Ah. Boy, this is not gonna be comfortable for long. Okay, how's it look? So, this is what it's like to be me. I'm walking around, making fun of Ken. I don't know, I'm just gonna wear this to unbox the next item. (box clatters) All right. Oh yeah! Hey Ken, you're musically inclined, right? - [Ken] I listen to music. - That means you're qualified to help me operate this piece of equipment. - Bruh! - This is a MIDI control keyboard, which is apparently battery powered. Has 25 velocity sensitive slim keys, Velocity sounds like Velociraptor, which means that it's cool. There are a lot of very high quality MIDI controllers out there and there are some cheap ones. This might be the cheapest one I've ever seen, which, I will say, I don't know anything about anything. So, this is the M-Wave. I will just say, it looks nice. Keys are fine. It seems actually relatively well built. I mean, especially considering we paid 50 bucks for this thing, including shipping. This is an iPad mini. - Yep. - We've got a USB hub with the MIDI keyboard plugged in and GarageBand. - Yeah, and I think it works at a base level. We took a little time to configure it, but- - Okay. (keyboard notes play) (Austin claps) How does this work so how much of this actually works? - In GarageBand for iPad with the keyboard part of the app, you can actually do a fair bit. Obviously, keyboard stuff works. You can change your pitch. (pitch sliding) - [Austin] Okay. Okay. - You could change octaves. So- (notes clang) - Oh, so basically, because obviously, it's a what? 20-something key, however small. - Yeah, it's not a lot. You can go three octaves above and below. You also have programmable pads. They're pre-programmed to whatever. Oh, there we go. Beat pads work. - So then, this is where we would actually load things up. (beats playing) - There you go. Okay, well. Austin's gonna start making beats. This is gonna be funny. This is the beginning of the new arc. - DJ Not Duncan. - DJ. DJ Not (slaps table). DJ Not Duncan. - You know, as a YouTuber, it's important to have a little bit of insurance 'cause you never know when you're going to get into a little bit of hot water which is why I have preemptively purchased my apology ukulele. Oh, ohhh! Oh look, it's here. Okay, so can I just, I'll sing in the key of F. Ahhhh! Ahhhhhh! (makes horrible pseudo singing sound) (laughing) Oh, I'm so sorry I probably did something that made you mad What would be our band name? - The Overclocks. - Oh! My Apple stylus pencil. Let us investigate this pencil. Okay, so, well, I mean, clearly this is meant for other stuff 'cause there's stuff that's missing in here, but that's fine. Oh. what happened to charging on the iPad, huh? Okay, so this does look, at first glance, like a pencil. It's got the same kind of like flat edge, but I'm assuming- Wait, what? No, it doesn't. What? Oh yep, there is a, in fact, a USB-C port, which, at least it's USB-C. Oh. It kind of, wait, wait, wait wait. Whoa, whoa, whoa, whoa, whoa, whoa. Hold on a second. I put it on and it immediately lit up green. I think the iPad's actually charging it. The problem is that the iPad is used to, you know, using an actual Apple pencil. So, it's not like really an interface or anything. (gasps) Wait! Wait! Whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa. Wait! It worked for like one second. Does it need to charge? So, normally I would just say \"Oh, this is like, some lame piece of tech from Temu. Don't buy it.\" But the thing is, I've seen, Quinn actually did a terrific video buying some tech from Temu and one of them was, maybe not this exact Apple pencil, but he got an Apple pencil on Temu which worked relatively well. And the fact that this did work for a second before stopping makes me think that we're missing something here. Does it work? - [Ken] Yeah, actually. Oh no, my Apple pencil just paired. - Oh. Oh wait. So, it's pairing as a new Apple pencil every time. - Turning off and on Bluetooth definitely works. - Okay. - I'm gonna try to do it lightly. Now, so here's the thing. This, as far as I can tell, for like normal use, is actually totally fine as a stylus. Now, I don't think it has quite that same level of the fidelity, especially like the pressure sensitivity of a standard pencil. But if you just want to use this as a navigation device to be able to scroll through your iPad or to be able to jot like some quick notes down, honestly, I would actually save the a hundred and whatever dollars. (strumming ukulele) (package thuds) I need more mystery tech in my life Okay, so this is quite a squashed box and I don't even know what it is 'cause the label's kind of gotten squashed with it. - [Ken] Your guess as good as mine. - Well, we're about to find out together, my friends. Just like we're about to find out if you've really hit the subscribe button. (gong sound) Did you actually hit it? - [Ken] What is that? Wait, this is not what I thought it is. - [Austin] What? - [Alex] Specifically, this is the \"Crotch Stretcher\". (laughs) - [Austin] Wait, wait, wait, wait, wait. - [Ken] (laughs) Whoa. - Sorry. Time out. (Ken keeps laughing) This is \"The Crotch Stretcher\"? Here goes nothing. (plastic hitting plastic) (Ken laughs) Is this what I thought I was gonna do when I woke up this morning? Probably not. But is it the content that you deserve? Yeah. You know what you've done. - Oh, that's a vibe. - [Austin] Nope, nope, nope, nope, nope. Here is the \"Explosive Head Massager\". That's really firm. Is my face vibrating right now? Can you tell? - [Ken] Not really. - So, it's vibrating. Every time it vibrates, my vision goes, like, you put the earthquake filter on in Final Cut. (Ken laughs) This is the metal detector with 360 side detection and pinpointing tip. I heard that someone's smuggling some metal in my studio. Okay. - You're supposed to be enforcing the law. - Stand up. Stand up. T pose. Yeah, there's no metal. (detector beeping rapidly) Ah! I found metal. Lemme find some other metal. What if it, can it detect tungsten? (rapid beeping) Yeah. (Ken laughs) I mean, this works. (chill music) I guess if you're looking for metal and you know, gold or whatever, it works. (detector beeping) Apparently, my ring is real. (Ken busting out laughing) My heated vibrating knee massager. Boy, you know, I just picked some, some items. These are some of the items on Temu. So, I dunno how well we're gonna be able to show this 'cause it just looks like I've got a knee brace on, but I've got a little screen here so I'm gonna turn it on. Unfortunately, I'm wearing jeans, which I'm realizing, probably not a smart move. As it warms up, let's go ahead and start some vibration. (massager beeps) Oh, okay. Oh, so actually it vibrates quite low. Okay, we're just gonna go full, full speed. I'm immediately gonna say this is pretty good. - [Ken] Oh yeah, no, I see what you mean. I need that on my knee cap. - [Austin] Yeah. You gotta like really hike it up. - Ooh! - (grunts) That came with some force. So this, my friends, is a big old burger. - [Ken] Wow. - Well, wish me luck, my friends. I'm gonna go take a trip to Burger Town. - [Ken] \"Hey guys, this is Austin McDuncan\". (plastic crackles) - Oh, oh, I know what this is. Why am I sinking into it? (pump pumping) Wow. So if you pump it up a little bit, it's probably pretty nice on a plane. (indistinct) I can't feel my face anymore. - Oh my God. (laughing) - I'm not kidding. - Okay, try to like, move my head around some. - Oh my god. (laughing) - This is a wireless Lavalier microphone. Much like the microphone that I wear on myself all the time. So, we use quite expensive Lavalier wireless microphones here in the studio. So, the idea that Temu will sell me a far cheaper option sounds really appealing. This was only $6, which makes me think there's no way it's gonna be good. And is it even gonna work? I mean, that's like, ridiculously cheap. I'll immediately say, I do have all my bits and bobs. - No microphone attached, at least by lightning. As you can see, I have it in my hand here. So. this is directly from the iPhone 13 mini. This is what the $6 Temu mics sound like. All right, here I am from like, whatever, 30 feet away. - It's too loud. That's my main criticism is that it feels like the gain on the mics is way too high. But we paid $6 for a double wireless mic kit. Are you kidding me? That just literally worked with zero setup? - Though it is almost outta battery. - Well it it is probably not, because it's unpaired. This thing's unplugged. - Oh, it's unpaired. - Yeah. I, I, I, I mean, for $6, I have no idea what you could ask for that's more. And because it's so loud, all I would do is maybe just hold the mic a little bit farther away and I think it actually sounds fine. - [Ken] And lower your tone of voice. - No! So, as we all know in life, paying full price is for suckers. And you know who we are? We're winners. We're winners who buy fake AirPods to look cool. Now, we've looked at a lot of fake AirPods over the years. This is... they've gotten clever. They don't put Apple logos. If you look, even though the packaging is vaguely reminiscent of an actual, although, man, it doesn't sound good. It's vaguely reminiscent of real AirPods. But they're clever enough to not put any Apple logos on it. So, technically no trademark infringement required. Well, I will immediately say while they do work, the magnets aren't right. They're too lightweight. But I mean, from here, can you tell those aren't real AirPods Pro? Five bucks, man? Look, there's a certain level of which the jank is fine and $5 is the level in which the jank is fine. - [Ken] Here's another. - Lenovo. Okay, so here's the thing. Lenovo is an actual brand. So, 18 bucks is quite cheap for over ear Bluetooth headphones. But it's starting to get to the point where you can get sort of regular options on like Amazon and whatnot. Oh, look at this. \"Cannot verify AirPods\". \"These headphones cannot be verified as genuine Apple AirPods. Would you like to connect anyway?\" I have never seen that before. Yes, I would like to connect anyway. - [Alex] That might also explain why the listing is discontinued. - Oh, have they removed this from Temu now? - [Alex] Yes. - Let me describe to you what I'm hearing right now. Let's say this is a flat frequency curve, right? So, you've got your lows, your mids, your highs. Well, here are my lows. That's it. It's like, have you ever sat beside a subwoofer? (subwoofer low sound) Oh, they actually pause when you take them out. Okay, I don't want to condone these things. They've clearly been removed. Like, they're trying to become AirPods and while they sort of function a little bit like AirPods, there's no noise canceling. And the sound quality I can only describe as hilarious. Let's try these Lenovos, which I think are going to be far, far better. Wow, that's quite the colorway. Well, you know what though? Okay, so the cushions are soft, the headband is all right. I mean clearly, quite cheap plastic, but at the price point, nothing that seems unreasonable. Oh, it's so much better. It's 17 bucks. These are not bad. The problem is, is that I almost feel like there's probably headphones you could spend like seventeen, eighteen, twenty bucks on from Amazon that are about the same. Which is, why would you buy from Temu at that point? 'Cause I feel like Temu is kinda like the budget option. They're not spectacular. However, they do work. There's nothing that's horrible about them. They're built reasonably well. They're comfortable. But they don't sound- they're, they're, they're fine. This is the most tricked out flying spinner. Boy, these kids look just like they're having a great time. So, I think the idea is that it kind of can hover and because it's got like, sort of this sort of protective ball around it, you're not gonna hurt your finger. Oh, okay. (spinner whirs) (Ken laughs) (spinner whirring) Catch. (team laughing) All right. Catch. - Whoa. - Seven bucks, man? This thing's kinda cool. As we all know, Temu is the home of the Wild West of devices and most importantly, intellectual property. So, this, my friends, is a completely real and legitimate copy of \"Pokemon Emerald\". You can tell by the suspiciously light weight of the cartridge and the odd printing. Now, if you wanna buy a proper copy of Pokemon Emerald today, you're talking about like, I don't know, 80 bucks, maybe a hundred bucks. But these reproductions supposedly are actually decent. This is $4. There we go. Look at that. So, here's the thing. I am a little bit torn on this, partially because- Also, it's really hard to see on camera. It's too big. It can you see on the bottom of this Game Boy? It like, sticks out by like, I don't know, half a millimeter, which is definitely not accurate or correct. - [Alex] I think Nintendo already talked to Temu about it, 'cause it's gone. - Oh! Oh, look at this! So, for 13 bucks, I do not expect that this is a real Razer product. I will say though, it is quite convincingly remanufactured. Looking at the box, it's got the right kind of pull tab- Oh, actually, you know what? No, it's not the right pull tab. It looks like the right pull tab. It's made out of paper instead of plastic. - There's a part of me that thinks this is real. - That's the thing. It's good enough that at least it makes you stop and think. Oh, you know what? Well... Dude, oh no, no, that's not real. Look at the fonts on the bottom. That's not real. That's definitely not real. - Ah. Dammit, I was, ugh. - It's pretty good though, man. - They had us in the first half. - [Austin] Yeah, no, like, this packaging, like, this isn't quite right. It's not like crazy far off but it's not quite right. This is very close to real Razer packaging. - [Alex] Do you want to know what happened to their listing on Temu? - Is it gone? - [Alex] Yeah. - Oh, they took the listing down. That's also a big giveaway. All right, let's plug it in. Okay, it does light up green. - And so does the wheel. - Okay. It is mousing right now. Although, wow, that, that does not look good. You can tell it's not real 'cause it's not asking me to install Synapse. (laughs) Temu, you took my money again I'm never gonna give in Because you took my money and you took my stuff And I only got half of what I want But guess what? I like views and I can't stop making Temu videos.",
    "transcript_keywords": [
        "Temu",
        "Wait",
        "Whoa",
        "Apple pencil",
        "Apple",
        "yeah",
        "real",
        "kind",
        "bucks",
        "pencil",
        "Temu Tech",
        "bit",
        "time",
        "good",
        "works",
        "work",
        "stamps.com",
        "thing",
        "wireless",
        "head"
    ],
    "transcript_entity_values": [
        "5",
        "half",
        "USB-C. Oh",
        "iPhone",
        "the Wild West",
        "iPad",
        "first",
        "Nintendo",
        "Pokemon Emerald",
        "the last 25 years",
        "Temu Tech",
        "25",
        "two",
        "Matt",
        "Duncan",
        "GoPro",
        "Razer",
        "one",
        "Explosive Head Massager",
        "Five bucks",
        "20 years",
        "MIDI",
        "stamps.com",
        "twenty bucks",
        "GarageBand",
        "the M-Wave",
        "Final Cut",
        "13 bucks",
        "Lenovos",
        "Sapphire",
        "The Lenovo ThinkPad",
        "Lavalier",
        "Fire Red,",
        "Ken",
        "USB",
        "Austin",
        "YouTuber",
        "seven bucks",
        "Seven bucks",
        "over 1 million",
        "Bluetooth",
        "Velociraptor",
        "a hundred bucks",
        "zero",
        "Yo",
        "9,000",
        "360",
        "the first half",
        "Quinn",
        "half a millimeter",
        "80 bucks",
        "today",
        "13",
        "four week",
        "84%",
        "a hundred",
        "Synapse",
        "Amazon",
        "Temu",
        "AirPods",
        "Temu Tech",
        "4",
        "the US Postal Service",
        "seventeen, eighteen",
        "Apple",
        "Emerald",
        "stamps.com/AustinEvans",
        "6",
        "this morning",
        "AirPods Pro",
        "the years",
        "the \"Crotch Stretcher",
        "Pokemon",
        "17 bucks",
        "Lenovo",
        "only $6",
        "Stamps.com",
        "The Brain Download",
        "18 bucks",
        "Burger Town",
        "Lavalier",
        "50 bucks",
        "three",
        "Anthony Fantano",
        "Temu",
        "Lavalier",
        "Pokemon Emerald",
        "12",
        "Realistic Burger Pillow",
        "second",
        "The Crotch Stretcher",
        "GarageBand",
        "30 feet",
        "Austin McDuncan",
        "20"
    ],
    "transcript_entity_types": [
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "LOC",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "GPE",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "LOC",
        "ORG",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "NORP",
        "MONEY",
        "TIME",
        "PRODUCT",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "WORK_OF_ART",
        "ORDINAL",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.12713399529457092,
        -0.0077649978920817375,
        -0.047862663865089417,
        -0.10564214736223221,
        -0.04148600623011589,
        -0.10733670741319656,
        0.0753050446510315,
        0.04735853895545006,
        0.018271319568157196,
        0.027949871495366096,
        0.14550991356372833,
        -0.0007756513659842312,
        0.04321671649813652,
        0.023019742220640182,
        -0.03281974792480469,
        -0.02120310813188553,
        0.07460246980190277,
        -0.05163928121328354,
        -0.015109828673303127,
        0.043126098811626434,
        -0.02692507579922676,
        0.08289278298616409,
        0.016147464513778687,
        0.017867684364318848,
        -0.09005270153284073,
        0.019568560644984245,
        -0.07393179088830948,
        -0.00020915940694976598,
        -0.08285672217607498,
        -0.03830638527870178,
        -0.002791352802887559,
        0.017394956201314926,
        -0.1079777404665947,
        -0.04237940162420273,
        0.024491365998983383,
        -0.0018418508116155863,
        -0.018723007291555405,
        0.036853495985269547,
        -0.028934301808476448,
        -0.04711586609482765,
        -0.036076050251722336,
        -0.10153362154960632,
        -0.007087067700922489,
        0.006164897233247757,
        0.05113654583692551,
        0.033556777983903885,
        -0.0033134138211607933,
        -0.050549834966659546,
        0.006513352971524,
        0.011006275191903114,
        -0.03168728947639465,
        -0.08305620402097702,
        0.09741158038377762,
        0.0042600128799676895,
        -0.052276141941547394,
        0.029717974364757538,
        -0.020695846527814865,
        0.04999230429530144,
        -0.042381349951028824,
        0.06440377235412598,
        0.025362754240632057,
        -0.02215704694390297,
        0.011370238848030567,
        0.041794389486312866,
        -0.047782570123672485,
        -0.021203650161623955,
        -0.019304493442177773,
        -0.0013779358705505729,
        0.008530906401574612,
        0.012388157658278942,
        0.009930428117513657,
        -0.026201868429780006,
        0.03583541139960289,
        0.04125882312655449,
        0.03944641351699829,
        -0.00585378659889102,
        0.07730525732040405,
        -0.032422326505184174,
        0.015797216445207596,
        0.09991005063056946,
        0.016450125724077225,
        -0.02503676526248455,
        0.014955628663301468,
        -0.06363869458436966,
        -0.006907451432198286,
        -0.039494361728429794,
        0.02680712379515171,
        0.06281861662864685,
        -0.05819782242178917,
        0.02806859463453293,
        0.008306059055030346,
        0.09228947758674622,
        -0.05411627143621445,
        -0.0020348881371319294,
        0.05662113428115845,
        -0.0290087703615427,
        -0.09690450131893158,
        0.03432215750217438,
        -0.017285184934735298,
        0.052278514951467514,
        -0.008321183733642101,
        -0.02714385837316513,
        0.010595781728625298,
        0.032269176095724106,
        0.0036871423944830894,
        -0.08008144795894623,
        -0.06296935677528381,
        -0.031451039016246796,
        0.05391480028629303,
        0.07070618867874146,
        -0.014990865252912045,
        -0.004690818954259157,
        -0.053278662264347076,
        -0.020441263914108276,
        -0.04566413164138794,
        0.03738247603178024,
        -0.09864922612905502,
        0.11016713827848434,
        0.03971558436751366,
        -0.03982727229595184,
        0.018988927826285362,
        0.03436299413442612,
        -0.03134414553642273,
        -0.06303814053535461,
        0.011361668817698956,
        0.014163890853524208,
        -0.09055434167385101,
        9.139166622531918e-33,
        0.0001433998841093853,
        0.0980779230594635,
        0.04963557422161102,
        -0.049960263073444366,
        -0.010350651107728481,
        -0.021291319280862808,
        -0.026817020028829575,
        0.07736457884311676,
        0.06538621336221695,
        0.0749509334564209,
        -0.06967363506555557,
        0.06677817553281784,
        -0.02354488894343376,
        -0.003988791257143021,
        0.018793843686580658,
        -0.06320539861917496,
        -0.09460581094026566,
        0.008130169473588467,
        -0.06694823503494263,
        -0.05268043279647827,
        -0.04260852932929993,
        0.0507589727640152,
        0.005144964437931776,
        -0.02444443851709366,
        -0.022299904376268387,
        0.08778427541255951,
        -0.04965481907129288,
        0.007468177936971188,
        0.0657818391919136,
        0.06469766795635223,
        -0.0931626558303833,
        -0.0706905797123909,
        0.010956840589642525,
        -0.10470317304134369,
        -0.008120974525809288,
        0.011834654025733471,
        -0.029842285439372063,
        -0.10835808515548706,
        -0.048091232776641846,
        0.011409895494580269,
        0.025059908628463745,
        -0.009634082205593586,
        -0.0020533553324639797,
        0.03177391365170479,
        -0.06608911603689194,
        0.06641671806573868,
        0.0450928620994091,
        -0.02050134912133217,
        -0.005781278945505619,
        -0.05320629104971886,
        -0.03631420433521271,
        0.007437910418957472,
        0.024302365258336067,
        -0.027729595080018044,
        -0.02593260444700718,
        0.003422168781980872,
        0.042324405163526535,
        0.05265010520815849,
        0.05393914505839348,
        0.020871389657258987,
        0.031162329018115997,
        -0.049239497631788254,
        0.03119726851582527,
        -0.08218397200107574,
        -0.10725218802690506,
        -0.010159985162317753,
        0.060599811375141144,
        -0.030335478484630585,
        -0.015863681212067604,
        0.027050049975514412,
        -0.012374878861010075,
        0.072000652551651,
        -0.0024346248246729374,
        -0.048899147659540176,
        0.02689184434711933,
        0.049610916525125504,
        0.042113855481147766,
        0.030187329277396202,
        -0.046335406601428986,
        -0.11088413745164871,
        0.002621828345581889,
        -0.010662396438419819,
        0.038680702447891235,
        0.021269334480166435,
        0.04008980840444565,
        -0.05005073547363281,
        -0.021500779315829277,
        -0.035278502851724625,
        -0.01659354194998741,
        -0.014981008134782314,
        -0.030575867742300034,
        0.04644626006484032,
        -0.07364717125892639,
        0.018174458295106888,
        -0.0569336824119091,
        -1.0080121197690358e-32,
        -0.018587063997983932,
        0.015585537999868393,
        0.004991848487406969,
        0.05794048309326172,
        0.08394519239664078,
        -0.010808280669152737,
        0.054116617888212204,
        0.06039992347359657,
        -0.007394534535706043,
        -0.029784448444843292,
        0.023905616253614426,
        -0.061507370322942734,
        -0.038897786289453506,
        -0.0008251264807768166,
        0.08790980279445648,
        -0.01377574261277914,
        -0.11035846918821335,
        -0.020247548818588257,
        -0.0493696890771389,
        0.0406966395676136,
        0.08622065931558609,
        0.11642798036336899,
        0.018148191273212433,
        0.059598732739686966,
        -0.07778347283601761,
        0.03977420926094055,
        -0.030105017125606537,
        -0.08427788317203522,
        0.055239882320165634,
        0.08258729428052902,
        -0.03455008566379547,
        -0.09294265508651733,
        0.010539543814957142,
        0.04981234297156334,
        0.01529056578874588,
        0.04783784970641136,
        0.05249674618244171,
        -0.07100575417280197,
        -0.008509591221809387,
        -0.04020153358578682,
        0.0781932845711708,
        0.031011482700705528,
        -0.0015526724746450782,
        -0.003964126575738192,
        -0.11017532646656036,
        -0.06273992359638214,
        -0.03353478014469147,
        -0.023992029950022697,
        -0.015775680541992188,
        0.04285266250371933,
        0.04747837409377098,
        0.02433990314602852,
        0.01649111695587635,
        0.018540672957897186,
        -0.0727701410651207,
        0.010270200669765472,
        -0.03457031399011612,
        -0.05501119792461395,
        -0.051062505692243576,
        0.0015770320314913988,
        0.030572133138775826,
        -0.006417915690690279,
        -0.08769431710243225,
        -0.03978230059146881,
        0.011722739785909653,
        0.036616772413253784,
        0.03559908643364906,
        -0.017094582319259644,
        -0.040504731237888336,
        0.01419689878821373,
        -0.05609573423862457,
        0.04469245672225952,
        -0.03406326100230217,
        -0.0802503451704979,
        0.04151218384504318,
        0.03286271169781685,
        -0.005179972853511572,
        -0.07109291106462479,
        0.04506981000304222,
        0.008654007688164711,
        0.014364166185259819,
        0.035408347845077515,
        0.05664904788136482,
        0.08462488651275635,
        0.056658003479242325,
        -0.005175149999558926,
        0.014559939503669739,
        -0.01760556362569332,
        -0.06142261624336243,
        0.07224155962467194,
        0.07673405110836029,
        0.09534964710474014,
        0.005994843784719706,
        0.19747836887836456,
        0.00491736177355051,
        -7.001194290978674e-08,
        -0.008339970372617245,
        0.022673679515719414,
        0.026115627959370613,
        -0.011283853091299534,
        0.008245663717389107,
        -0.020243225619196892,
        0.036459341645240784,
        -0.03820498660206795,
        -0.017471792176365852,
        0.03300623223185539,
        0.019442172721028328,
        -0.023217596113681793,
        -0.027756527066230774,
        0.007908656261861324,
        -0.019929498434066772,
        0.07407866418361664,
        -0.12242795526981354,
        0.06817691028118134,
        -0.038099128752946854,
        -0.08528055995702744,
        -0.017367219552397728,
        0.04692792519927025,
        0.07561253756284714,
        -0.07439734786748886,
        -0.014800668694078922,
        0.02498580515384674,
        -0.09147386997938156,
        0.09659443795681,
        0.039623066782951355,
        0.01811351254582405,
        -0.06699676066637039,
        -0.01846325956285,
        -0.0428001694381237,
        -0.019196325913071632,
        -0.08962637186050415,
        -0.03831610828638077,
        0.01524970680475235,
        -0.026390166953206062,
        -0.026870092377066612,
        0.08597665280103683,
        -0.011270246468484402,
        -0.11671248078346252,
        -0.0493093878030777,
        0.067860446870327,
        -0.02720227651298046,
        -0.06547760218381882,
        -0.018612103536725044,
        -0.0182809941470623,
        -0.043988507241010666,
        0.08981088548898697,
        -0.005166641436517239,
        -0.02036738581955433,
        -0.00042880536057054996,
        0.04941095784306526,
        -0.024979986250400543,
        -0.007424528710544109,
        -0.0005019971868023276,
        0.024390140548348427,
        -0.07343340665102005,
        0.04298144206404686,
        0.0353221669793129,
        -0.0367601178586483,
        0.07046432793140411,
        0.045387301594018936
    ]
}