{
    "id": "6wyirNSXmUQ",
    "title": "I Forgot How This Felt... - Sennheiser IE 600 headphones",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-04-20T18:59:46Z",
    "video_url": "https://www.youtube.com/watch?v=6wyirNSXmUQ",
    "category": "Science & Technology",
    "tags": [
        "Sennheiser",
        "Senheiser",
        "Audio",
        "Earbuds",
        "In Ear Monitors",
        "I forgot how this felt",
        "Bluetooth sucks",
        "Bluetooth",
        "Headphone jack",
        "MMCX",
        "MCX",
        "3D printed"
    ],
    "views": 1227776,
    "likes": 38908,
    "comments_count": 2214,
    "description": "If you're reading this, you probably missed your chance to get a discount on all dbrand products. Use offer code FIVEFOOTONE to get 15% off at   Sennheiser is still one of the top-level companies for audio equipment, and even though the headphone jack is gone, it still shows that it still works way better than Bluetooth. The IE 600 is their latest in-ear monitor or earbuds, but wow, it takes me back.   Buy Sennheiser IE 600 headphones:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 - Hello old friend 0:32 - Unboxing and overview 3:38 - Trying them on 4:45 - sponsor - dbrand - oof 6:19 - Noise isolation impressions 7:18 - LTT Labs update 7:50 - Sound impressions 9:25 - Other product info 9:50 - Final thoughts",
    "description_links": [
        "http://dbrand.com/shortlinus",
        "https://geni.us/HnIM",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- You know, it was over two years ago that I forsook my longtime friend and ally, the 3.5 millimeter jack, and switched full time to Apple's AirPods Pros. And it was recently I was playing a game with someone and I needed a combination headphone and mic, and for some reason, Bluetooth wasn't working properly. Anyone, anyone, Bluetooth not working properly? Yeah. And I had to pull out my old trustee Sennheiser IE 80s. And after so long, I couldn't believe how great they sounded. And if my expectations are anything to go on, that is gonna be nothing compared to this. These are the Sennheiser IE 600s. Perhaps one of the last of a dying breed, a truly high-end in-ear headphone designed for mobile use. And there's a lot of special stuff going on, starting with the housing. They're made of this AMLOY zirconium 3D-printed metal material, that is apparently so exotic that one of the primary uses for it is aerospace applications. And Sennheiser says that one of the things that got them so excited about this material, is the fact that it would allow them to achieve unusual geometries. Because, there's no inherent advantage to constructing your earphone out of metal, let's say. But, 3D printing it, according to them, they have some of the most tuned matched drivers inside it. And that, combined with this unique shape, is what gives these their outstanding sound. You can see they're ported on the back. That looks like, what is it, six millimeter? Hold on. I'm just guessing right now. Seven millimeter, sorry, seven millimeter drivers. There's no obvious way to disassemble them. I'm surprised at both how heavy they are and at how light they are, if that makes sense. Like compared to a plastic housing, obviously they're a lot heavier, but compared to what I maybe expected for a metal housing, they're really manageable. I haven't put them in my ears yet though, so we'll have to see how that goes. Another thing I haven't tested yet is the comfort. One of the reasons I stuck with the IE 80s for so long, is that they're some of the most comfortable headphones, for me, that I have ever encountered. And I have really high expectations for these. We've got a nice little travel case here. Oh wow. That's an upgrade over the old SteelSeries Flux, with the broken zipper case, that I've been using for mine. I'm actually gonna pull out some of my favorite accessories that I keep in here. This is a connector I'm not familiar with. If I had to guess, I'd say it's a balanced input of some sort, but it's not one that I own any equipment that specifically works with. So I will tuck that away. I can tell you right now, I'm annoyed with Sennheiser out of the gate here that there's no microphone included with the default cable. That was an add-on that I had to spend a whack of money on for this one. And that also makes the fit not as good. These are my IE 80s with the optional mic cable. You can see it doesn't come up high enough to hold them in place anymore. So they like come off more easily. They include both foam-type and silicone-type ear tips. These were made famous by Comply way back in the day. And like many premium earphones, they include MMCX connectors. So, this allows you to swap out your cables. Well, between the balanced one and then the normal three-pole 3.5mm. Or if you wanna get third party cables in the future, either because you wanna save a buck, or because you like throwing away money, then you could do that, as well. Now I'm not a huge fan of the stiff plastic like earpieces, but that's kind of like a your mileage may vary thing. Looks like they retain their shape reasonably well, though. They're not super hard or anything like that. I'm gonna try the small foam-type ones. No, we got the banana for scale. You see how big they are? Here's a banana. All right. You can buy a banana on lttstore.com. What you should really be doing, is signing up for a notification for when the backpack and the screwdriver come in stock. Otherwise, how will you know, other than that I'm gonna tell you constantly. Oh, they definitely don't feel heavy. Actually, they feel like slim almost. I guess part of it is that I'm so used to daily driving the AirPods, right. Which are sticking outta your ear hanging down, right? Like some kinda goofus. I mean, I guess having this cinched up nice and tight, is a bit of a goofus look too, isn't it? How do I look, boys? - [Crew] Beautiful. - Bell] Here are some eggs. Let's play egg toss. - Okay, please tell me they're boiled. - [Bell] I cannot confirm or deny that. Your only rule is you have to stay at the desk. - I have to stay at the desk - [Bell] And underhand too. - How am I supposed to toss underhand from the desk? - [Bell] That's not dbrand's problem. - These are clearly not hard boiled. Okay. - [Bell] Just a couple more. - Let's play throw and catch. - [Bell] All right, clearly too easy for you, so we got level two. - This is really stupid. - [Bell] All right, toss it straight to my voice. That sweet, sultry voice. You actually did it, okay. - [Bell] All right, I'm throwing it. Oh. Oh, okay. - That was a bad throw. Oh my God, you got it on the headphones. Yeah. - [Bell] Yes. - Woo. - [Bell] All right, that was a great job Linus. I got a letter from you from dbrand. Oh no, you're good. - Are you gonna keep throwing things at me? So, dbrand wanted us to throw this egg around to waste your time. Why waste your time? Because there's a discount for all dbrand products happening right now, but it ends 15 minutes from when this video was published. If you're watching this, you probably missed it. If not use code five foot one, right there, buddy, for 15% off at dbrand.com/shortlinus. Thanks. Dbrand, get bent. Hey, wait a minute, they're gonna kill our retention stats on this video. Dbrand, what the heck? They need to pay extra for that. - [Bell] Yes, sir. - Now I know immediately I am going to take criticism for hooking these up to such an unworthy source as a Razer dongle attached to a mere Samsung Android phone. But, I stand by that even with 600 US Dollar earphones, most people are not gonna be plugging them into a proper source. And I wanna hear them as most people will. Every time, every time I have to talk about music, I feel like my taste in music is gonna be judged. So I'm just, I'm not gonna tell you what I'm listening to. I don't even care. Oh, before I turn them on actually, let's talk noise isolation. Man, now that I'm used to active noise cancellation, like, I don't know, say something to me. - [Bell] Hello Linus. - Yeah, I can actually, I can hear you pretty well. - [Bell] Hello, hello. - Yeah, if anything, I'd say my IE 80s are a little more isolating than these 600s. I have a really exciting announcement. We actually have one of our first full-time labs hires on now, and he's an audio guy. He's working on getting us one of those dummy heads with the the microphone set up, for your frequency response curves and all that awesome stuff. And we're actually gonna be doing a video on LTT, taking, I think it's either two or three dummy heads, benchmarking which one is the most true to life. So stay tuned for that. This could be one of the last videos we ever do that's just me listening to it and telling you guys how it sounds to me. I'm expecting an app or something, but you just plug it in and they work. That's next level. I don't know how to describe the sound other than clean. Nothing is overdone. Base heads are gonna wanna EQ it up, but that's a good sign. If you have a nice, accurate headphone you can play around with the EQ and it'll still be accurate. Just EQ'd. I'm not gonna lie. I'm pretty hooked on the Encanto soundtrack, listening to Surface Pressure right now. I'm not gonna tell you what I'm listening to. I don't even care. I think I take back what I said. This feels like a proper audiophile product. This is not the kinda thing people are gonna plug into their iPhones, plain and simple. This is the kind of thing that people are gonna be plugging into a proper audiophile-grade MP3, or more likely, FLAC player, and be tuning their EQs to their tastes, and even to different genres of music. These things sound amazing. I totally underestimated what I was dealing with here. You know, what I really need to listen to, is like something older that actually has some dynamic range, something pre loudness wars-like. I have so little of that kinda stuff. It manages to be dead accurate on the hi-hat hits, without being harsh at all. Well, there's a bunch of other stuff that's cool about them. There's the steel shot blasting that gives them this really unique finish. I think it looks amazing. The material is from AMLOY Technologies. It's super durable, and it's supposed to leave practically no evidence of daily use, meaning these things should last as long as, you know, the magnets inside them work. But, none of that is really the point. The point is these sound unlike anything else I've ever heard. You know what, you know what? Yes, I do have a point of reference for them. The Etymotic ER2s I believe they were, that I had, man, I had a pair of those way back in the day. Yeah, Etymotic ER4s, but better. You better subscribe. (phone beeping) Gotta go, bye.",
    "transcript_keywords": [
        "Apple AirPods Pros",
        "switched full time",
        "friend and ally",
        "years ago",
        "forsook my longtime",
        "longtime friend",
        "switched full",
        "AirPods Pros",
        "Apple AirPods",
        "working properly",
        "Sennheiser",
        "Pros",
        "Apple",
        "dbrand",
        "Yeah",
        "Bluetooth",
        "millimeter jack",
        "Bluetooth not working",
        "kind",
        "time"
    ],
    "transcript_entity_values": [
        "AirPods",
        "five foot",
        "the day",
        "three",
        "One",
        "one",
        "Sennheiser IE 80s",
        "LTT",
        "Sennheiser",
        "Dbrand",
        "seven millimeter",
        "third",
        "daily",
        "Bluetooth",
        "first",
        "SteelSeries Flux",
        "600 US Dollar",
        "two years ago",
        "two",
        "Razer",
        "iPhones",
        "3.5 millimeter",
        "600s",
        "15 minutes",
        "600s",
        "EQ",
        "a minute",
        "Linus",
        "Etymotic",
        "15%",
        "six millimeter",
        "Seven millimeter",
        "Samsung Android",
        "Apple",
        "AMLOY Technologies"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "NORP",
        "QUANTITY",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.09982389956712723,
        -0.06036822125315666,
        0.02613501064479351,
        -0.07871190458536148,
        0.021498357877135277,
        0.05209421366453171,
        0.041172612458467484,
        0.06092892587184906,
        -0.07539146393537521,
        0.03253500163555145,
        0.002940148115158081,
        0.026092784479260445,
        -0.03005281649529934,
        -0.05307820066809654,
        0.00860405620187521,
        0.016176078468561172,
        -0.03253664821386337,
        -0.07701877504587173,
        -0.1212664246559143,
        0.005730736535042524,
        -0.09070366621017456,
        0.02017739973962307,
        0.07855181396007538,
        0.06077522411942482,
        0.036703869700431824,
        -0.03305255249142647,
        0.02372017316520214,
        -0.04478028416633606,
        -0.050888657569885254,
        0.00697041442617774,
        -0.019017964601516724,
        0.024096723645925522,
        0.04521506652235985,
        -0.046468425542116165,
        -0.02090829610824585,
        -0.04186281934380531,
        0.008577740751206875,
        -0.05397056043148041,
        -0.0767124816775322,
        -0.013902789913117886,
        -0.0332125648856163,
        0.005332848522812128,
        -0.08306267857551575,
        -0.032431215047836304,
        0.021909939125180244,
        -0.026138456538319588,
        -0.05619479715824127,
        0.004193929955363274,
        0.022010374814271927,
        0.06455177813768387,
        0.052527815103530884,
        -0.08118858933448792,
        0.07808069884777069,
        -0.030673492699861526,
        -0.059985145926475525,
        0.011980310082435608,
        -0.07834150642156601,
        0.01736241951584816,
        0.036737728863954544,
        0.03588919714093208,
        0.06927275657653809,
        0.012768430635333061,
        -0.012765810824930668,
        0.008304714225232601,
        -0.0029555680230259895,
        0.057340167462825775,
        -0.04042120650410652,
        0.03438581898808479,
        -0.08306363224983215,
        0.007067600730806589,
        -0.059484634548425674,
        -0.011063290759921074,
        0.04188358411192894,
        0.06128047779202461,
        0.0573362335562706,
        0.08993493765592575,
        0.04685613885521889,
        -0.06985320895910263,
        0.035634592175483704,
        0.08037897199392319,
        -0.10132788866758347,
        -0.048932034522295,
        0.017299380153417587,
        -0.017548702657222748,
        0.013264383189380169,
        0.0006029105861671269,
        0.03476491943001747,
        0.05094517767429352,
        -0.06003833934664726,
        -0.10770875215530396,
        -0.015948619693517685,
        0.05487759783864021,
        -0.0021564585622400045,
        -0.014667809009552002,
        -0.03841745853424072,
        0.07412460446357727,
        -0.009391308762133121,
        0.043231092393398285,
        0.010234388522803783,
        0.04466066509485245,
        0.07610151171684265,
        -0.011565107852220535,
        -0.10155349224805832,
        -0.06991948187351227,
        -0.012321197427809238,
        -0.10071104019880295,
        -0.024110127240419388,
        0.027197981253266335,
        0.04893709346652031,
        0.024983694776892662,
        -0.0031793941743671894,
        0.012651702389121056,
        -0.03843183070421219,
        0.003716395003721118,
        -0.008805885910987854,
        0.05703838914632797,
        -0.07348834723234177,
        0.05909743160009384,
        0.13498060405254364,
        -0.029614165425300598,
        -0.004339305683970451,
        0.05105916038155556,
        -0.016713369637727737,
        -0.03512536361813545,
        -0.004006121773272753,
        0.04462527483701706,
        -0.04201928526163101,
        3.136755981975395e-33,
        0.007153683342039585,
        0.02388262376189232,
        0.030126066878437996,
        -0.07479662448167801,
        -0.012445645406842232,
        -0.052729830145835876,
        -0.04532430320978165,
        0.04134759679436684,
        -0.041566282510757446,
        0.026073068380355835,
        -0.0776778981089592,
        0.054334040731191635,
        -0.027546921744942665,
        -0.04529613256454468,
        -0.016090555116534233,
        -0.017308378592133522,
        -0.02110210433602333,
        0.028394481167197227,
        -0.03543869033455849,
        0.018786875531077385,
        0.026647044345736504,
        -0.029365763068199158,
        0.03063792735338211,
        0.046103209257125854,
        0.05765548348426819,
        0.02030893787741661,
        -0.019961826503276825,
        0.06776900589466095,
        0.07057178765535355,
        0.004956621211022139,
        -0.018083618953824043,
        0.0061615766026079655,
        0.03531136363744736,
        -0.10142171382904053,
        -0.05438772216439247,
        0.013960053212940693,
        0.009251665323972702,
        0.018538355827331543,
        -0.024814695119857788,
        -0.048593733459711075,
        0.026930471882224083,
        0.04193552955985069,
        -0.09797599911689758,
        -0.039360903203487396,
        0.03309128060936928,
        0.021192677319049835,
        0.0235475841909647,
        -0.04633232206106186,
        0.044818371534347534,
        -0.06492288410663605,
        -0.12433689087629318,
        -0.02289106883108616,
        -0.03257240727543831,
        0.047389689832925797,
        0.04310021921992302,
        -0.06805982440710068,
        0.014511864632368088,
        0.03046286292374134,
        0.07231156527996063,
        0.07774999737739563,
        0.08572955429553986,
        0.011082321405410767,
        0.049796346575021744,
        -0.04893522709608078,
        -0.04916585981845856,
        0.02246124856173992,
        0.08394624292850494,
        0.01731085777282715,
        -0.1412498503923416,
        -0.06445299088954926,
        0.017585400491952896,
        0.059450820088386536,
        0.04042220488190651,
        -0.004262469708919525,
        -0.05126819387078285,
        0.04130072891712189,
        -0.040919192135334015,
        -0.013229112140834332,
        -0.03222610428929329,
        -0.024054180830717087,
        0.03403821215033531,
        0.04080236330628395,
        0.02677842788398266,
        0.0740630105137825,
        0.09742098301649094,
        0.01239478588104248,
        -0.024977805092930794,
        -0.07175798714160919,
        -0.02824842929840088,
        0.009828994981944561,
        0.030368028208613396,
        0.03440888971090317,
        -0.1430773288011551,
        -0.0661114975810051,
        -0.055740829557180405,
        -6.0363431217029314e-33,
        -0.038490716367959976,
        0.04476051777601242,
        -0.004116511438041925,
        0.0073163388296961784,
        -0.006565979216247797,
        -0.030939782038331032,
        0.10886555165052414,
        -0.054060958325862885,
        0.0040659792721271515,
        -0.04607441648840904,
        0.014258737675845623,
        0.006366893649101257,
        -0.002178863389417529,
        0.028437335044145584,
        -0.03934628143906593,
        -0.08469057083129883,
        -0.039109405130147934,
        -0.058141786605119705,
        0.07842084020376205,
        -0.020856300368905067,
        0.09223762154579163,
        -0.011047719977796078,
        0.005592496134340763,
        0.002337723970413208,
        -0.06340637058019638,
        -0.011722411960363388,
        -0.06803113967180252,
        0.04565991833806038,
        -0.026354070752859116,
        -0.052504587918519974,
        -0.03950110450387001,
        -0.03379211202263832,
        -0.039952006191015244,
        -0.06602198630571365,
        0.07199615240097046,
        -0.010003680363297462,
        -0.0018786197761073709,
        0.03852607309818268,
        0.06143329292535782,
        -0.02361452952027321,
        -0.03445734083652496,
        0.007527630310505629,
        0.04421791434288025,
        -0.09324909001588821,
        0.07913146167993546,
        -0.09384526312351227,
        -0.09971737861633301,
        -0.021903472021222115,
        0.00024339163792319596,
        0.017285281792283058,
        0.048991356045007706,
        -0.01629522629082203,
        0.06256749480962753,
        -0.005570569541305304,
        -0.07358972728252411,
        -0.05327441915869713,
        -0.07865385711193085,
        -0.047499872744083405,
        0.016393231227993965,
        0.07498709857463837,
        0.021186750382184982,
        -0.01759863644838333,
        -0.022904157638549805,
        0.011036806739866734,
        -0.026475675404071808,
        0.1295316517353058,
        0.050343096256256104,
        0.044402796775102615,
        0.050178203731775284,
        -0.05006791651248932,
        0.0025837086141109467,
        -0.04423096776008606,
        0.028903275728225708,
        -0.06202170252799988,
        -0.049349863082170486,
        0.08711439371109009,
        -0.08666561543941498,
        0.005242055747658014,
        0.05120283365249634,
        0.021558109670877457,
        0.008791444823145866,
        0.0006090528913773596,
        0.046876903623342514,
        -0.03005358763039112,
        0.04334753006696701,
        0.02059640735387802,
        0.06645336002111435,
        -0.10789632052183151,
        -0.04110700264573097,
        0.018622931092977524,
        -0.0015397191746160388,
        -0.040524937212467194,
        0.006215470377355814,
        0.08269279450178146,
        0.009409919381141663,
        -6.161408805382962e-08,
        0.03689481317996979,
        0.029471924528479576,
        0.047623343765735626,
        -0.02616463042795658,
        0.055488791316747665,
        -0.06503991037607193,
        -0.015747781842947006,
        0.025875849649310112,
        0.03266700357198715,
        0.015347800217568874,
        0.03638480231165886,
        -0.08551578968763351,
        -0.04152515530586243,
        0.07007844001054764,
        0.03696054965257645,
        0.009083610028028488,
        -0.04197091609239578,
        0.05954420566558838,
        -0.008245164528489113,
        -0.03170707821846008,
        -0.03228187561035156,
        0.055648840963840485,
        0.06440386176109314,
        -0.07407461851835251,
        0.045350272208452225,
        -0.010692122392356396,
        0.051056016236543655,
        0.08229932934045792,
        0.0741025060415268,
        -0.04048078879714012,
        -0.10105866193771362,
        0.030254747718572617,
        -0.031122082844376564,
        -0.028882138431072235,
        0.004538996610790491,
        -0.07593692094087601,
        -0.10013236105442047,
        0.08215179294347763,
        -0.04902929440140724,
        0.04669418931007385,
        -0.006345916539430618,
        -0.10841254144906998,
        -0.023836761713027954,
        0.034679997712373734,
        0.06699221581220627,
        -0.03129621595144272,
        0.04974312335252762,
        -0.019404379650950432,
        0.032989419996738434,
        0.03218652680516243,
        0.01298927515745163,
        0.05177905783057213,
        0.03618955239653587,
        -0.052760038524866104,
        -0.0067681726068258286,
        -0.02244955115020275,
        -0.0006730547174811363,
        0.01101063471287489,
        -0.09662339091300964,
        0.05470399558544159,
        -0.09218234568834305,
        -0.11909633129835129,
        0.03721313551068306,
        0.07776346802711487
    ]
}