{
    "id": "6x0bTp8JZqg",
    "title": "MYSTERIOUS Laptop Unboxing 😱 ASUS Zephyrus G14 ACRNM RMTO1",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-09-19T21:30:38Z",
    "video_url": "https://www.youtube.com/watch?v=6x0bTp8JZqg",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "ACRONYM ASUS ROG Zephyrus G14",
        "unboxing",
        "review"
    ],
    "views": 255925,
    "likes": 9406,
    "comments_count": 759,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "`- So, this is a very interesting unboxing. I'm used to opening up and reviewing a lot of tech, but never actually hearing the story behind it from the people who actually made it. This is part unboxing , part interview. Oh Justine, what are you unboxing? It's right behind me.` What's in this box? It's the RMT, which stands for reality modeling tool from ACS Republic of Gamers. Now this is an all new re-imagined laptop collaboration with Errolson Hugh, co-founder of Acronym and designer David Rudnick. I got a chance to chat with both of them. And after hearing the passion and thoughtfulness that went into their design choices with this laptop, it is definitely something that should not be overlooked. Let me have Errolson and David introduce themselves to you guys and then I'll start opening this thing out. (upbeat music) For anybody who's not familiar with Acronym or like what both of you guys kind of do and how you kind of came about this whole project. - Cause there's a lot of confused people looking at public of gamers, history of feed, right? Like what is going on? My name is Errolson. You know I'm the principal designer. and one of the co-founders of a brand called Acronym and Acronym has been around for almost almost 20 years. - Oh wow. - I guess you could call it an underground brand. It's not something everybody knows. Our whole thing has been to approach apparel, not from a truly from a fashion or aesthetic sense as if they are in a sense tool. - How did you and David meet? So how long have you guys been working together? - David and I actually met on Twitter? Actually. - Oh my God! That's incredible. That's how I meet all of my friends now. (laughs) - I got into graphic design as someone who studying artistry in college, loved music. Errolson literally happened to be fans of music that I listened to and love as well. And so he kind of got to know a bit of my design and we kind of met through that. I've always been a little bit of an outsider to design world I think because like coming in, I was self taught and I had some skepticism about certain kinds of industrial process, but Errolson has been a huge inspiration to me and someone who I'm incredibly grateful to and to have the chance to see the way that our system works. It greatly resonates with the way that I feel that naturally I want to approach design as well, which is to solve problems from the ground up. - Something that David touched on was the unboxing experience of this laptop. And how much thought actually goes into the process of packaging? - One thing we've definitely tried to do, I think hopefully this will be a fun unboxing. It's not designed to be an extravagant unboxing or something which is there to crop or to affirm preconceived expectations of what a luxury, a hardware experience might be or a conventional high end gaming experience might be. (boxes squeaking ) - Okay, here it is guys. The unboxing is happening right this second. Boxes upon boxes. Here is the power cable. So got this nice bubble packaging around it to protect it. Hello, they have their little logo, it's also etched on the power adapter. This nice I'm gonna reuse this to ship out some things. This is so sharp. (soft music) After talking to these guys, I feel like everything means something. Even if we don't know what it is yet. Clue. Oh, look at this! This is like a little USB stick, but also fashion make it USB, but make it fashion, that's what I've been saying forever. A note. What is this? Oh, is this a puzzle. This seems to be a puzzle. I'm wondering if when we put this in, this will make sense. What does it mean? We're about to find out or maybe we won't Also has the really cool bubble packaging, feel so protective. It also it feels so comfy. This feels like a camping pillow, really tired. I haven't slept in four weeks, baby. So here's all of the packaging, it's cool cause they do have their reality modeling tool logo right here. And I was like, what just this mean? Probably would have normally just looked at this and be like, that's a cool logo. Now I know what this actually means and now you do too. - The framing of the device, this phrase that we use, the reality modeling tool, this strange RMT01. It's just basically speaks to the fundamental philosophy behind what we've been talking about. This this kind of emotional design language that we've been trying to kind of approach the machine with really thinking about the view of what it means to use a laptop. The key aspect of the relationship we really wanted to emphasize is as a creator, as a gamer, your hardware, it gives you the possibility to create worlds. So if you were... You would have seen this on the promotional materials. That's what we call the RMT cascade logo. And it's the logo, the reality modeling tool but it's very simple. There are these two planes here, two kind of vertical lines and there's this transfer between them and you could view, one of them is the laptop screen, and one of them is the viewer and they both pass information back and forth. And that's it's like that very simple logo. The cascade is kind of just the visual representation of some of the philosophy behind this project. It's this screen that kind of goes two ways. This case is also to you, but it makes right. (laughs) - Any more secrets in here. I feel like this is just a machine full of secrets. I'm gonna leave no corner of this unturned. I don't trust you guys. Okay. Clear. This will be the first time that I don't throw this on the ground because I also feel like there's probably some secrets in here too. Oh, there's a secret, my serial number. I'll save this. I had to be f... I gotta be careful. It's a liability. And here it is. The actual laptop itself. Look at this! They pulled like a little velcro here, so you can open it up. Oh boy! Look at this! Look how cool. I love all these little perforations, and since I did kind of get a little preview of it, I now know that part of this is made up of led lights and it looks really cool. - That came from the ACS Republic Gamers design lab. They came up with this new idea of having an led display and making the laptop part of the environment, sort of like an output as well as input and just tried our best to work with that, make it to interesting things. The existing version of the G14, the AniMe led matrix as it's referred to, it's integrated into the hardware in a kind of rhombus shape. And one thing that we wanted to do, which we thought was interesting is very in keeping with acronyms interests, in playing with ideas. If I pass it to you, transparency of being able to hide, of being able to control when you make something visible. One of the very simple justice that we did it's the only formal change is that we requested the perforations be drilled to cover the entire top surface. When those lights come on, they kind of emerge out of the void rather than clearly being in a kind of like array that starter can turn on or off. It can be loud, but it can also be quiet. And that simple gesture adds a lot to the way that the machine even can function kind of emotionally. - One of the things that I thought was really kind of a neat perspective, they kind of hid all of other branding. Normally when you open up a laptop, you're greeted with like a logo right here. This is very minimal. They put model information over here on the side. You don't see it, but if you want to see it, you can! - Positioning of the device name on the outside edge of the post screen box. So, this here has the engraving of Zephyrus G14 acronym reality modeling, two alarms here. What that allowed us to again, create the black screen surround and to have no breath inside of the object. So when you're using it... - Cool - It's just between you and the tool. It reminds me of the very, very, to me, very beautiful type of graphic design gesture of the branding of camera lenses not concise, or when you see these engraved around the operational surface machine. (upbeat music) - And at first glance, this just seems kind of nonsensical. There's a bunch of keys, that are a bunch of different colors, but guess what? There was actually a lot of thought that went behind this. (upbeat music) - Color branding is like a huge part of so many experiences today, to come up with a color space that feels like it's not referencing some obvious thing, Like for example, explore me on spot, it's camouflage or it's this or that. I love the background behind the color space of this keyboard. There's three keys, which are different colors to the rest of the colored piece, the numbers one, two, three, if you're a gamer, those are kind of action hotkey, obviously. We also wanted to kind of put them as visual function keys in your eyes like when you're using the keyboard for the difference of pure like Bloomberg terminal, like function keys, like on the F line or something, so that the color space around where you're active is kind of it's in reference to the hand position of the user. Some of these are like traditional function keys, like the shift, but some of them kind of infiltrate the keyboard and then move on to it. And this is also again that idea of this kind of supporting synthesis where we didn't want it to just be like function keys are important, letters are for typing, but rather say something like actually think about like the system expansiveness and the harmony between these two experiences it's color is called shale. This color is kuro matsu, which is a Japanese pine. And this color is Octa. They are natural shades. They are the kind of shades that you would experience if you're out in a forest or in the woods, rather than expectation. So highly artificial, super brights that you might see on the keyboard. But I always feel there's something kind of calming sand art. This keyboard can kind of become almost like a private gadget. - Anything else in there? Don't think so. So it's time to turn it on. Hello friend. - Hello friend, do not concede the future. Do not accept extensions. The tool is memorizing. - That surprised me. I think once we put that USB stick in, we wanna have some answers. So this isn't being marketed as a gaming laptop, but it definitely is capable of being perfect for gaming. It has an eight core 16 thread AMD rise and nine processor and nvidia geforce rtx 2060, 32 gigs of Ram, a one terabyte solid state drive. It has a 60 Hertz, 14 inch IPS level display that's pantone validated for color accuracy. It also has adaptive sync variable refresh rate technology for ultra smooth gaming. It's like, what is the actual audience if it's not gamer specific, but yes, you can game on it. Who really is the audience for this? - I think I'm trying to define the current creatives by looking at an activity that they do or narrowing them down to some sort of a template is already impossible. It sort of speaks to our point of like, we don't really know what people are gonna do with it. And I think in today's day and age where the tons of multifaceted lives, everybody leaves and may be classified as a graphic designer one day and then you're gonna make a music track the next day. All of these things are so fluid right now. It's really impossible to say. The only common denominator is that you're creative. - This is based off of previous release, the Zephyrus G14. So basically they were handed this laptop and given the creative freedom to push the limits of what's possible. And my first thought was how difficult that must have been because trying to design within the hardware constraints that were already set up, that can be really difficult. So they used a lot of different custom materials, etching, machining, and specially developed pains. And they even made an entirely new custom typeface for the keyboard. Did you create this typeface then? - Yeah. So there's two primary type faces on the machine. First, access tampers Errolson and I dealt together. It's what I call a technical serif. The conventional aesthetic that people use to suggest something is highly technical, is they use a kind of sans serif modernist font, but actually an enormous part of what acronym does is almost an ancient art. You can be highly futuristic with traditional craft, but the serif and the evidence of what remains in a serif is the legacy of the hand, of the brush, of the pen, of the moment where the letter was drawn. When it came to designing a typeface back when [indistinct], Errolson, you know, everyone's gonna expect us to do a sans serif, wouldn't it be beautiful if we could somehow try and create a technical serif that had level of simplicity and poise and quiet thoughts behind it that the acronym product does. And so that's where we came to access tampers, which is this technical serif that we use on the RMT. And then there's another secondary typeface, which is a sans serif, which is a supporting typeface, which also shows that, no system should venerate purely like should be purely dogmatic. It's to say like, beauty is the human body, because we're building a tool. Beauty as the marriage of these systems when they fit together properly. - No, I think this is so great, cause I feel like nobody's gonna have, when they open this up, like this whole thought process that you guys have gone through is so intense that I feel like everybody needs to sort of understand, look down at my computer, now I'm like, Oh yeah, you're right. This is sans serif. That's weird. - But I hope that that will, even if you can't put your finger on it, like the voice of the keyboard will be different than a keyboard that you've experienced before. - So I have it all started up. I did some of the updates. The first thing that I wanted to check out was the led lights on the back of this. So there's actually this little interface that you can customize. You can add in all kinds of designs of your own, but they do have some acronym arrows in ones already on here for you. There's also a text effect. So you can type whatever you want. And it'll show up on the front of this laptop. This would have been really amazing when I used to work at coffee shops because people would always come up to me and just ask me what I'm doing. Like, do you not see that I have headphones on, I'm clearly focusing on working and you wanna come up and ask me what I'm doing. No. So what I would like to do is put on the front of laptop, 'Don't talk to me.' Don't talk to me. I am busy. Thank you. At least, I said, thank you. So right, I added in all of the graphics that they have in here and they're all running as a loop, but you can see it... Oh, there it is, there it is, there it is. Look at it. Look at it. Look at it. Oh wow! Oh yeah. That's pretty cool. Let's test out the brain. I'm officially logged into the brain. I have an account I made my first brain. Green is full of thinking and it hurts. We have a demo brain for me to look at. It says that my brain box is empty. Should I be offended? So obviously this is my first time using the software, I don't actually know how to use it yet. I'll just let Errolson tell you a little bit more about it and how he uses it. - It's actually a visual organization tool sort of like mind mapping, but it's different because it's actually, it's truly nonlinear. You get mapped things out visually and associatively and on matrix of data points, which are called thoughts athlete. And these thoughts can be attached to any type of attachment or data could be referencing a text document or an audio file or video file. It was conceived and invented by my brother. And it's a piece of software that I've used for my entire professional life basically. So we spoke to Palin, my brother, and we're like, yo, can we do a version of the brain specifically for the slabs? - And the last thing that is really, really crucial to this video is what is on this drive and what is this? It's something that we have to solve. And I'm afraid that I'm not gonna be able to solve it in the confines of this video. - It says it's empty. I don't believe that really did I just get tricked? - Yeah. - I'm not mad about it. So I thought this was gonna be a secret that doesn't answer the question of, what is this? I don't believe that they wouldn't put anything on here. I think there's gotta be something on this. Everything must be questioned. There's nothing. Wait a minute. Do not open. Wait a minute. No. Oh, hold on a second. What is this? This says do not open. Am I not actually supposed to open it? What the heck is happening? What is this? Wait... This USB key has been... I can't read it when it's the close up. I gotta back up. Wait a minute. So there was something on it. If you're reading this, our efforts to engineer the public... This UBB key has been formatted to facilitate the machine's connection. What!This was their brain that they created. Oh boy. So it looks like on USB drive is the brain, but I actually went and downloaded it before I put the drive in. So it looks like I had set up my own brain, but this gave me access to theirs. Is that gonna help me solve this puzzle? I'm gonna solve this, but not, not right now. Look, this is do not open. This says, delete me. No, I'm opening it. Where's all this stuff. What other stuff? What is all this stuff in here? I must say that I'm confused, impressed, excited and I definitely just spend some more time with this computer. But this is really cool. I mean, I absolutely love the fact that they have a very thoughtful design. Everything has a meaning. I mean, even just, Oh, these led lights are so great. Very excited to really just inspect this for some more secrets that I might have missed. (upbeat music) - You want you to think as a gamer and also as a creator, what can I do with this thing, come on, deck. How can it serve me? How can I use this to construct model? The reality, I'm interested in seeing matter of facts. - Oh, that hurts! I've hit myself.",
    "transcript_keywords": [
        "kind",
        "Errolson",
        "laptop",
        "design",
        "Acronym",
        "thing",
        "feel",
        "tool",
        "serif",
        "brain",
        "Color",
        "reality modeling tool",
        "cool",
        "keyboard",
        "David",
        "put",
        "thought",
        "guys",
        "unboxing",
        "logo"
    ],
    "transcript_entity_values": [
        "14 inch",
        "UBB",
        "a minute",
        "ACS Republic of Gamers",
        "nine",
        "Errolson",
        "second",
        "one",
        "Justine",
        "First",
        "32",
        "F",
        "Bloomberg",
        "David",
        "four weeks",
        "the Zephyrus G14",
        "three",
        "16",
        "Palin",
        "AMD",
        "the next day",
        "Twitter",
        "2060",
        "RMT",
        "David Rudnick",
        "the ACS Republic Gamers",
        "Japanese",
        "one day",
        "nvidia geforce",
        "Errolson Hugh",
        "eight",
        "today",
        "Hertz",
        "two",
        "secondary",
        "60",
        "almost almost 20 years",
        "G14",
        "first",
        "Zephyrus G14",
        "USB",
        "Ram",
        "Octa",
        "One"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "NORP",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.08470779657363892,
        -0.03798443824052811,
        -0.07200397551059723,
        -0.07099708914756775,
        0.05565493926405907,
        0.008988372050225735,
        0.0475778691470623,
        -0.0019358760910108685,
        0.003641417482867837,
        0.03212098032236099,
        0.08483899384737015,
        0.01623127982020378,
        -0.00665626022964716,
        -0.010828523896634579,
        -0.04151862859725952,
        0.024090878665447235,
        0.03740208223462105,
        -0.11102799326181412,
        -0.030609166249632835,
        -0.013339049182832241,
        -0.032657090574502945,
        -0.007587112486362457,
        0.007907764054834843,
        -0.012602945789694786,
        0.05043251812458038,
        0.0318172387778759,
        0.053064923733472824,
        -0.0209380853921175,
        -0.10173208266496658,
        -0.08351681381464005,
        -0.004939166363328695,
        0.04703989997506142,
        0.0474369116127491,
        0.04298296198248863,
        0.06812488287687302,
        -0.060137420892715454,
        0.021270612254738808,
        -0.0018565451027825475,
        -0.011005483567714691,
        -0.05358858406543732,
        -0.025829490274190903,
        -0.04500540718436241,
        0.02813866175711155,
        -0.022599972784519196,
        -0.07365602254867554,
        -0.05003298819065094,
        -0.05096974968910217,
        -0.07690826058387756,
        0.0308709554374218,
        0.019106430932879448,
        -0.009900379925966263,
        0.0031017689034342766,
        -0.0015910740476101637,
        0.05332951620221138,
        -0.11756160110235214,
        -0.001103055546991527,
        -0.04603761434555054,
        0.011903392150998116,
        0.02257033810019493,
        -0.05994880944490433,
        0.03718871995806694,
        -0.016482170671224594,
        -0.0058100479654967785,
        0.033696141093969345,
        -0.046868160367012024,
        -0.04342126473784447,
        0.015719229355454445,
        -0.01083767507225275,
        -0.0040284693241119385,
        0.03589203208684921,
        -0.030513281002640724,
        0.07064055651426315,
        -0.01599307172000408,
        0.036529093980789185,
        0.00461085420101881,
        0.054226573556661606,
        -0.010072832927107811,
        -0.044226326048374176,
        0.015367471612989902,
        0.06553764641284943,
        0.04589707404375076,
        -0.031182145699858665,
        -0.009128435514867306,
        -0.01042905542999506,
        0.01269906759262085,
        0.04778999090194702,
        -0.03551532328128815,
        -0.002277482533827424,
        -0.02370314672589302,
        -0.08668849617242813,
        -0.11677979677915573,
        -0.029041586443781853,
        0.01834680512547493,
        0.03247632086277008,
        -0.028798451647162437,
        -0.08384093642234802,
        0.04783057048916817,
        -0.015630187466740608,
        -0.048147402703762054,
        0.07313714176416397,
        0.03155061975121498,
        -0.04278929904103279,
        0.04684804752469063,
        -0.05935468524694443,
        -0.02804967388510704,
        -0.09943254292011261,
        -0.0654534325003624,
        -0.01565980352461338,
        0.014794771559536457,
        -0.022631336003541946,
        -0.07785914838314056,
        0.035334549844264984,
        -0.07404443621635437,
        -0.04475032538175583,
        -0.0076413704082369804,
        0.12424008548259735,
        0.006954771466553211,
        0.07579866796731949,
        -0.013483169488608837,
        0.014935783110558987,
        -0.0028518368490040302,
        -0.08731289952993393,
        -0.01433599554002285,
        0.003337306436151266,
        -0.011241517029702663,
        0.03552243113517761,
        -0.07718846946954727,
        1.247132649981244e-32,
        -0.011389648541808128,
        0.007776259910315275,
        0.0008362859371118248,
        0.014333476312458515,
        0.023201925680041313,
        0.000919342681299895,
        0.004957752302289009,
        0.06148425489664078,
        -0.0014261285541579127,
        0.0405651293694973,
        -0.049064137041568756,
        0.040247391909360886,
        -0.02750185690820217,
        0.03777677193284035,
        -0.011619841679930687,
        -0.06339435279369354,
        0.027227837592363358,
        -0.026686934754252434,
        -0.0796123594045639,
        -0.021323859691619873,
        0.0571773424744606,
        0.06174184009432793,
        0.010895751416683197,
        0.056221041828393936,
        0.10497681051492691,
        0.0837472528219223,
        0.0013815434649586678,
        0.014787341468036175,
        0.07384558022022247,
        0.022970149293541908,
        -0.0362938717007637,
        -0.03879529610276222,
        -0.07130879163742065,
        -0.09197726845741272,
        -0.020663877949118614,
        0.023081619292497635,
        -0.06697355210781097,
        -0.01991431415081024,
        0.04247235879302025,
        -0.028644155710935593,
        0.027672575786709785,
        -0.016160741448402405,
        -0.09379147738218307,
        -0.07845951616764069,
        0.06279901415109634,
        0.0065626478753983974,
        0.03079153597354889,
        0.0669286698102951,
        -0.03250660002231598,
        0.012214509770274162,
        -0.054159071296453476,
        0.02234126627445221,
        0.008126635104417801,
        -0.01989092119038105,
        -0.06174904853105545,
        -0.05099911615252495,
        0.004904831759631634,
        0.07127239555120468,
        0.0957096591591835,
        0.05697178840637207,
        0.0973103940486908,
        -0.019939318299293518,
        -0.019390147179365158,
        -0.03176853060722351,
        -0.0697723776102066,
        0.07558369636535645,
        0.06796809285879135,
        -0.020232368260622025,
        -0.0046320692636072636,
        0.06984278559684753,
        -0.010564410127699375,
        -0.005239355377852917,
        0.04551626741886139,
        0.02041749469935894,
        0.01186688058078289,
        0.056965913623571396,
        -0.09454866498708725,
        -0.03682410344481468,
        -0.0029215016402304173,
        -0.04774664714932442,
        -0.07398044317960739,
        0.0634310320019722,
        0.037283413112163544,
        0.06433884054422379,
        -0.07829761505126953,
        -0.02885047160089016,
        -0.007527943700551987,
        -0.051231831312179565,
        -0.06135459989309311,
        0.05683411657810211,
        0.010574698448181152,
        0.09579984843730927,
        -0.11880980432033539,
        -0.04100944101810455,
        -0.022028060629963875,
        -1.286636166198184e-32,
        0.02006298117339611,
        0.03642244264483452,
        -0.019260691478848457,
        -0.05966093763709068,
        0.06872465461492538,
        -0.0032811304554343224,
        0.029507379978895187,
        0.10984182357788086,
        0.0359673835337162,
        -0.07506440579891205,
        0.07608802616596222,
        -0.009201256558299065,
        -0.09250347316265106,
        0.0030541555024683475,
        0.020609529688954353,
        0.0013374814298003912,
        -0.029233338311314583,
        -0.024159548804163933,
        0.041891034692525864,
        0.03133470565080643,
        0.0660901740193367,
        0.10343857109546661,
        0.08683614432811737,
        -0.004364421591162682,
        -0.04047458618879318,
        -0.010007278062403202,
        0.006790593266487122,
        0.019487114623188972,
        0.05671530216932297,
        0.08177034556865692,
        0.015972090885043144,
        -0.03634941577911377,
        -0.021443743258714676,
        0.003852052614092827,
        0.07470007240772247,
        0.012790215201675892,
        -0.004333051852881908,
        -0.0011326436651870608,
        -0.0017639105208218098,
        -0.08966606855392456,
        0.021121367812156677,
        0.08833922445774078,
        0.001013570581562817,
        0.00030994974076747894,
        0.03422174230217934,
        -0.10554493963718414,
        -0.10857590287923813,
        0.0036368241999298334,
        0.02652917616069317,
        -0.05190866440534592,
        -0.07353387027978897,
        -0.040883325040340424,
        -0.0036540746223181486,
        -0.022134315222501755,
        -0.017868904396891594,
        0.018935248255729675,
        -0.09456975758075714,
        0.001576092792674899,
        0.08114643394947052,
        0.005188904237002134,
        0.08279667794704437,
        -0.026540003716945648,
        -0.10051519423723221,
        -0.08623050898313522,
        0.024184614419937134,
        -0.06269140541553497,
        0.07487791776657104,
        0.0227089561522007,
        0.003630703315138817,
        -0.03879009932279587,
        -0.000921796599868685,
        0.03410111367702484,
        -0.012480332516133785,
        -0.005492802709341049,
        0.03811311721801758,
        -0.020015500485897064,
        -0.11442936211824417,
        -0.02433728612959385,
        0.03560395538806915,
        -0.03453149273991585,
        -0.004868592135608196,
        -0.07657425850629807,
        0.02862057276070118,
        0.06722752004861832,
        0.07888627052307129,
        0.024441340938210487,
        0.07754481583833694,
        -0.01132693886756897,
        -0.02170514315366745,
        0.04635777696967125,
        0.041578710079193115,
        -0.004041795618832111,
        0.009858156554400921,
        0.14005650579929352,
        -0.057243652641773224,
        -6.048984602102792e-08,
        0.029584074392914772,
        -0.0017802459187805653,
        -0.0048121302388608456,
        0.014831732027232647,
        0.0169381070882082,
        -0.13011741638183594,
        -0.02524654194712639,
        0.018914714455604553,
        0.06806999444961548,
        -0.07416509091854095,
        0.05786678567528725,
        -0.0546012744307518,
        -0.02094494365155697,
        0.09830211848020554,
        -0.007812028285115957,
        0.03722601756453514,
        -0.12110729515552521,
        0.15199987590312958,
        -0.009313550777733326,
        -0.02111315168440342,
        0.0023995297960937023,
        0.05820954963564873,
        0.08471588790416718,
        -0.03342706710100174,
        0.10290168970823288,
        0.03477097675204277,
        -0.009194026701152325,
        0.0034199014771729708,
        0.07413291186094284,
        0.005005920305848122,
        -0.10830186307430267,
        -0.012145024724304676,
        0.0500570572912693,
        -0.01669839583337307,
        -0.06534718722105026,
        0.0016973669407889247,
        -0.040483009070158005,
        -0.018332649022340775,
        0.03451593965291977,
        0.002257999498397112,
        0.018357697874307632,
        -0.11613738536834717,
        -0.022046726197004318,
        0.010450184345245361,
        -0.02802860550582409,
        -0.057028770446777344,
        0.07933830469846725,
        -0.07050708681344986,
        -0.036603160202503204,
        -0.02216120809316635,
        -0.031489305198192596,
        0.030134521424770355,
        0.060984086245298386,
        0.003951212856918573,
        0.052239127457141876,
        -0.03644953668117523,
        -0.0019814593251794577,
        0.10187821835279465,
        -0.008701489306986332,
        -0.0036168352235108614,
        0.04189588129520416,
        0.017787104472517967,
        -0.06659696996212006,
        0.03988262638449669
    ]
}