{
    "id": "72Ggdv8b-XI",
    "title": "This is even better than I thought! - Fractal Terra",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-06-10T19:12:47Z",
    "video_url": "https://www.youtube.com/watch?v=72Ggdv8b-XI",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "fractal",
        "terra",
        "green",
        "case",
        "sff",
        "small form facter",
        "pc",
        "build",
        "cool",
        "neat"
    ],
    "views": 594912,
    "likes": 15421,
    "comments_count": 554,
    "description": "Looking for your next tech upgrade? Check out Newegg at   Fractal has been on a roll with several SFF releases that don't make you compromise power or style. Adam's here to check out the new Fractal Terra to see if this small green machine continues the trend of flexible build spaces or if this small form factor case is missing something critical.   Buy a Fractal Design Terra Mini-ITX PC Case:   Buy an AMD Ryzen 7 5800X3D CPU:  Check out AMD Radeon Halo Infinite RX 6900 XT Graphics Card on StockX:  Buy an ASRock B550 Phantom Motherboard:  Buy a Noctua HN-L9A AM4 CPU Cooler:  Buy a Cooler Master V850 SFX 850w 80+ Gold PSU:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Fractal's releasing some banger cases 0:53 What's in the box? 1:31 Case walkthrough 7:10 Sponsor - Newegg 7:34 Mac Address shares their thoughts 7:52 Building in the case 12:30 Thoughts on the build 14:15 Pricing and overall thoughts 14:53 Outro",
    "description_links": [
        "https://lmg.gg/newegg",
        "https://lmg.gg/kmUM6",
        "https://lmg.gg/1vpyG",
        "https://lmg.gg/sUYip",
        "https://lmg.gg/L1eQk",
        "https://lmg.gg/EKAxy",
        "https://lmg.gg/DzNGL",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- I really liked the last Fractal case that I covered on this channel, the Fractal Ridge. It was a great console style case that was nice and thin, but here is the Fractal Terra, a beautiful wood- clad 10.4 liter small form factor case that, I don't know, first impressions from here, looks pretty dang good, but it doesn't look as good as this. That's right, green. The best part about green is that it's a color, which is pretty crazy. I mean, we've seen tons of silver and black cases, even white cases. Getting a case that's actually in a different color is a amazing change of pace, which is why I'm getting rid of this guy. He's got a texture to him. This one has almost a painted texture on the outside and it seems like it's very prone to scuffs. We just took this out of the box and we've already kind of scuffed it up. What you get inside the box is not a whole lot. You get a manual and a card that says thank you for buying it. It's very sweet and nice. That's warranty stuff. Fractal has always done a really great job of their manuals, and a lot of the time when you're building these small form factor cases that have unusual layouts, you're actually gonna want to read the manual because it will include a lot of important tips and features that you might not immediately discover. So we're gonna keep the manual. I know that seems unusual for this channel. I will probably look at it once and then forget about it and then screw something up and this will take half an hour longer than it needs to, but heck yeah. Case dimensions are 343x153x218 millimeters. We have a USB 3.0 port, a USB A, that's USB 3.0. So five gigabit per second. And a USB 3.1 gen 2, which in case that means nothing to you, 'cause it means nothing to anybody, that's about a 10 gigabit per second port USB-C Doesn't say anything about power delivery. That's a premium feature that I would love to see in more cases is getting a power delivery port. So you can charge your phone or quick charge your controller or something out at the front of it, but that's asking for a lot. On the back of the case, that's where you plug it in. There is nothing obvious on the outside of the case for mounting fans. Looks like at the bottom there are spaces for 120 millimeter fans. So for two, but this one's blocked by your power extension. The entire case is made of incredibly well machined aluminum, par for the course for Fractal. They've always been really, really great. Like, all of these little rivets, there's not a sharp edge in sight. So really, really well done. Side panel, release. Side up push. Okay, instruction manual. Ah, okay, so at the bottom, right there, you pull out there, there's a couple of detents, and this slides up like that. That's actually really interesting. - [Bell] Gullwing doors. - Like, geez, Tesla nerd. Instead of taking off the entire panel using detents across the entire structure, you have these hinges. Thankfully if they are in your way, they've just included some Phillips screwdrivers to remove them from the hinge. Unless, what is this? Oh (bleep). Now that we have the case open, we can get a really good look at the inside layout. So it's a typical sandwich layout where you're gonna have your GPU here connected with a riser cable. This is a included gen 4 riser cable. On this side you have your mini ITX motherboard and your SFX or SFX-L power supply. Then we have a bunch of nice cables for our front IO. Now one interesting thing about this case is you can put it into two modes. You have max CPU or max GPU mode. So basically you can adjust where this midline is. In max GPU mode, you can fit a three slot GPU, but you're limited to just 43 millimeters of height on your CPU cooler. If you move it to max CPU, you get 77 millimeters of height for your CPU cooler but are limited to a two slot GPU. It's a really smart way. This is the first time I've seen this kind of feature in a mass produced case. It's been a boutique small form factor feature for a while and the great thing about it is that it allows case manufacturers to build for more people. When you get to these really, really small sizes, you start really limiting your audience because if I'm somebody who cares a lot about CPU performance, I don't want to sacrifice that, and have to do a very, very short cooler. 43 millimeters is tiny, and if you're a gamer, maybe you want the bigger GPU. With this solution, they can serve both audiences, and also it allows you flexibility in the future if you ever decide to upgrade, which is always great. I forgot to talk about the accessories. Inside we get a bunch of mounting screws, a cleaning cloth, that's kind of nice. Cable ties, Velcro spacers, and an SSD tray. That's right. This has support for up to two 2 1/2 inch SSDs or 2 1/2 inch hard drives. However, there's no 3 1/2 inch mounts to be seen. I mean, I don't know where you'd put it, and that's one of the sacrifices that you make from going with a 10.4 liter case. Back to that adjustable center. That's what these transport locks are for. This is just positioning it, oh, I didn't realize it was modular. I didn't realize there was, this is not well explained on their website. You don't just have two modes. You can actually switch the centerpiece between up to seven different settings. So you can, if you have like, a 2 1/2 slot card and you wanna squeeze in a taller CPU cooler, this gives you that advantage. I thought that this was gonna be like a flipping mechanism that meant that you could only use two different spots. This is even better than what I thought. You can also remove the PCIE. This will probably be great for when we install our GPU. Removing these two screws by this riser board and this one screw on the back, you can take out the entire GPU bracket so you can get a little bit more space to work. Install it on your card and then plunk it in. One of the problems with PCIE riser cables is that these traces, they go all the way from your slot back to your motherboard, are very delicate, and bending them too tightly can just break them and then you have, you've lost 40, $50. So what they've done is that they've actually put these little brackets that allow it to round the corner nicely without kinking. So to reduce the odds of you bending this cable beyond repair. I just wanna talk about this front panel for a second. This is really cool. So it's like one thick hunk of metal, right? But they've milled out some recesses to allow you to route your power supply extension all the way around here and reducing the amount of space it takes up. It also, that depth provides you room for your 2 1/2 inch drives. Oh, cool. Yeah, so you can fit two in there. You just sandwich 'em together and then you strap 'em in with the included Velcro tie downs and away you go. Depending on your state of cables, getting this bottom one here could be a little hard to mount. That will, we'll burn that bridge when we come to it. Also, something that I appreciate is that it looks like everything is screwed in. There's no rivets anywhere in this case as far as I can see, which means you can kind of totally take this apart if you need for any reason whatsoever. Yeah, even the standoffs are screwed in. So if you wanna replace it with different standoffs or if your motherboard has like a thick back plate or something, you can do that. It's getting hot in here. I'm getting hot and bothered by this case. Yeah, take off all your merch at lttstore.com where you can buy new stuff. Well, I guess we should start putting in some hardware, but not before we tell you about our sponsor Newegg. Look on the sunny side of technology with Newegg and their wide variety of computer hardware, software, and electronics. Is your rig at home fried? Did someone poach your favorite monitor? Newegg offers competitive prices, fast, reliable shipping, 30 day hassle free returns, and excellent customer service to ensure that you have the best shopping experience possible. It boils down to this, there's a reason Newegg is the go-to destination for all your tech needs. Check them out at lmg.gg/newegg - Green and wood? - Yeah, I know right? - It's a dream come true. - Taste in the PC space. - I'm so jealous. - [Bell] No clout. Blur him. (cheerful music) - So we're going with the theme of last gen was better. We got 5800X3D, but most of all we get to use this cool Halo edition green 6900 XT. Look at that. Isn't that classy? That's gonna go right with our color scheme really well. I also had to get a different power supply than I wanted, 'cause white I was worried was gonna show through and look weird. So we're trying to keep things mean and lean and not RGB. Another interesting thing is that they say that they have room for a 120 millimeter rad. I am not sure where. So there is space for a 120 millimeter rad. It's on the opposite side of the power supply, and what you would do is that there's some standoffs that you can plug in there and then this would go right along there. What that causes problems with is one, you're blowing heat directly into your power supply, which might not be a big issue because your power supply is mounted this way. So intake from your power supply is gonna take that heat and pump it out the exhaust. The real downside is that it really, really limits the length of your GPU to just 200 millimeters, and as you can see, that's not very long. I'm gonna save myself a headache and not use this. Yeah, even a 7600 isn't gonna fit. You're gonna have to use a small form factor GPU, but hey, it's cool that they give you the option. So credit where credit's due, they didn't have to do that. I wanted to use this ID-Cooling IS-55. It's a really, really great CPU cooler for the price and for the size. But I made a booboo with selecting RAM. And it fits really great if you want to run single channel. You don't want to run single channel. Luckily I brought some alternatives like the NH-L9a. This is the very small, low profile cooler that you would have to use if you're using the max GPU mode of the case. As you can see, very different size. Do you know what's gonna suck? I fell for the great, I fell for the age old mistake of not plugging in my CPU cable before I got my motherboard mounted. Oh, it won't be so bad. Hooray! So I was worried that I would have to route this under the motherboard, but because the power supply's there, I do not. Like, I just kinda have it here. There you go. Might as well get the 24 pin plugged in. This is unusual. Oftentimes, this is a very important part of building in a small form factor case, is figuring out what step you need to plug your cables in. They tell me to not plug my cables in and I didn't trust them, but I should have. No, they actually never tell you to plug your cables in. I trust nothing. I trust no one. I hate this world. Okay, this is a lot of cable that I have to contend with now and I gotta figure out where I wanna put it. We'll get all the cables in and then I'll just cry later. That's gonna be the plan. So, while I talked about you can have this accept some of the heat from the GPU and exhaust it out, we're gonna go this way, 'cause we don't really need to do that and because we're not using a flow-through cooler like a, we're not gonna be using a Founders Edition card that's gonna have air that passes through and needs to go somewhere. We're just gonna have normal computer. We're gonna be using the 6900-XT which blows things out the sides. I appreciate that they give you additional power supply screws in the Fractal case, because sometimes you lose your power supply screws and it sucks. Got the GPU in there and then it slots in like that. I'm wondering, and the power's on the top. This is very, very clever. I like this whole mechanism. So now we just, we'll get our thumb screws in on top here so that our GPU is fastened in our bracket. And then installing the case. And then it's a bunch of cable time. One thing that, yes, I admit, I've made a mistake, is that I didn't plug in my cables before installing the power supply, but I do kind of wish I could remove the bottom of this. That was a feature in the Dan case where you could take out a little bit of the bottom just so that you could route cables easier, and it really makes building a lot more accessible and easy as opposed to now where I'm just kind of trying to jam things in and it's kind of frustrating. I know, it's my fault, I could just take it out, but I don't want to. The nice part about the included straps is that there's lots of places that we can loop our cables thanks to the way they've done cutouts in this case. So I'm gonna be able to tie my cables kind of down along here on the bottom and that'll be, that'll help keep some of the mess outta the way. Though it doesn't really matter, 'cause it's like, it's how visible are the cables when the side panels are on? I guess we'll find out. Yeah, you don't even really need to do the cables. I think it looks pretty slick and the layout of the case does hide a lot of the mess - [David] Is there no thing on the back? Like, it looks like there is a gap. - There is no thing on the back, which is kind of interesting. So there's no way to seal it. I think that's a fine concession to make for the flexibility and I think it also will allow just for some more free airflow. One thing that's also of note, there's not a single dust filter on this. This is all just these slits. So this might be a higher maintenance than you'd want if you live in a dusty place, like if you have a couple of cats like I do, there'll be lots of dander and stuff that gets inside of it. But it is pretty cool system. And I found it surprisingly easy to build in and it's very feature rich. What I would consider doing is maybe putting slim fans at the bottom. Yes, you could pass through cables through here. I have it in the middle position right now. I have it at four, so that's why we have gaps on both sides. It's actually pretty cool, man. And I really do enjoy the fact that I could give myself a little bit more CPU cooler height and I probably would do that. If you were doing a dual slot GPU, there's no reason to not push it all the way up. It would've been nice if maybe we got a little bit of extra room on the top to get maybe like, oh, 240 millimeter rad. But it's just, it's the kind of decisions that, it's the hard decisions that you have to make when you are making a 10.4 liter case. But yeah. Oh man, it looks slick. Let's see if it boots, and if it doesn't boot I will cry and we'll just go to lunch. I heard something spin, we got some lights. It's a good sign. Green and gold on this Master Chief edition GPU looks stellar in the build, and I would actually push it towards the side to make it more visible if I was building this myself. So it costs 180 US dollars, and for that price you're getting a really premium build quality with lots of like, nice, thick, machined parts. You're getting a cool color, you're getting a nice wood accent, a very flexible building space for being 10.4 liters. I do think they might have been able to get away with some fan mounts on the side. You're very, very dependent on the airflow of the components in your case and your CPU cooler and stuff. But all in all, I think this is an awesome case. And I know I was very enthusiastic about the Dan case in our video on LTT, but this might be where I go. Thank you so much for watching. If you like this, why don't you check out my video on the Fractal Ridge? You can fit a 4090 in it. You might be able to fit a 4090, you can probably fit, you can fit a 4090 FE in this too. But yeah, Fractal keeps killing it. I love it. Fractal, this video, Fractal. Cool. I love it. - [Cameraperson] Keep going. Keep going.",
    "transcript_keywords": [
        "case",
        "GPU",
        "power supply",
        "CPU cooler",
        "CPU",
        "power",
        "cables",
        "Fractal",
        "supply",
        "Fractal case",
        "kind",
        "max GPU mode",
        "slot GPU",
        "GPU mode",
        "max GPU",
        "yeah",
        "cable",
        "great",
        "cooler",
        "lot"
    ],
    "transcript_entity_values": [
        "4090",
        "seven",
        "6900 XT",
        "Phillips",
        "24",
        "180 US dollars",
        "Fractal",
        "343x153x218 millimeters",
        "2 1/2",
        "the Fractal Ridge",
        "three",
        "One",
        "40",
        "4090 FE",
        "4",
        "Tesla",
        "one",
        "USB",
        "max GPU",
        "Newegg",
        "10 gigabit",
        "the Fractal Terra",
        "6900-XT",
        "120 millimeter rad",
        "10.4 liter",
        "120 millimeter",
        "second",
        "3 1/2 inch",
        "LTT",
        "half an hour",
        "IO",
        "2 1/2 inch",
        "just 200 millimeters",
        "77 millimeters",
        "30 day",
        "max CPU",
        "10.4 liters",
        "Halo",
        "up to two",
        "7600",
        "first",
        "the Fractal Ridge",
        "five gigabit per",
        "240 millimeter",
        "PCIE",
        "5800X3D",
        "two",
        "just 43 millimeters",
        "four",
        "GPU",
        "Fractal",
        "about a",
        "ITX",
        "10.4",
        "43 millimeters",
        "USB-C",
        "Velcro",
        "RGB",
        "CPU",
        "Dan",
        "50",
        "USB 3.0",
        "SSD"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "TIME",
        "GPE",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "PERSON",
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "LOC",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "EVENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.009923206642270088,
        0.01846475526690483,
        0.046327389776706696,
        0.025876056402921677,
        0.09795024245977402,
        0.004120867699384689,
        -0.06515245139598846,
        0.01372821256518364,
        -0.060565583407878876,
        -0.01667376607656479,
        -0.054282061755657196,
        -0.031975965946912766,
        -0.010876466520130634,
        -0.031862158328294754,
        0.0188850536942482,
        0.01147417351603508,
        0.07915288209915161,
        -0.07522755861282349,
        -0.03724074363708496,
        -0.001559045515023172,
        -0.0005592202651314437,
        -0.06643595546483994,
        -0.06602342426776886,
        0.0015377363888546824,
        -0.01909704878926277,
        0.018721437081694603,
        0.050961967557668686,
        0.025914348661899567,
        0.03362688049674034,
        -0.0642288401722908,
        -0.004098840989172459,
        0.09530507773160934,
        0.025149887427687645,
        -0.00643600570037961,
        0.035173527896404266,
        0.010197407566010952,
        0.10848551988601685,
        -0.10028445720672607,
        -0.0390569306910038,
        -0.04568022862076759,
        -0.04245853051543236,
        -0.03783228248357773,
        0.04665585234761238,
        0.10012061893939972,
        -0.04529016464948654,
        -0.015457982197403908,
        0.033088136464357376,
        -0.1192411258816719,
        0.04299744591116905,
        -0.0531456395983696,
        -0.0068460931070148945,
        -0.08381105214357376,
        0.021166862919926643,
        0.0047020381316542625,
        -0.09576341509819031,
        0.04019613191485405,
        -0.05262782424688339,
        -0.1288127601146698,
        0.061834897845983505,
        -0.07029587030410767,
        0.014995322562754154,
        -0.15821723639965057,
        -0.0026814904995262623,
        0.05239039659500122,
        0.043640054762363434,
        0.025691168382763863,
        -0.0607713982462883,
        -0.011630323715507984,
        -0.03023267723619938,
        0.03463702276349068,
        -0.02823917753994465,
        0.03877156227827072,
        0.03705962374806404,
        0.020860062912106514,
        -0.00034116339520551264,
        0.05998825654387474,
        0.05955127254128456,
        -0.11565487086772919,
        0.06300348043441772,
        0.02838619239628315,
        0.010045373812317848,
        -0.01734881103038788,
        -0.012819747440516949,
        -0.04762190580368042,
        0.01689058355987072,
        -0.03207344934344292,
        0.03283504769206047,
        0.02850915491580963,
        0.034428395330905914,
        -0.11937548965215683,
        0.01350304763764143,
        0.0825328454375267,
        0.09256771206855774,
        -0.008249313570559025,
        0.02198502980172634,
        0.023590460419654846,
        -0.017315573990345,
        -0.03513951972126961,
        -0.03145834431052208,
        0.03337540104985237,
        0.05241517722606659,
        0.06625424325466156,
        0.07910057157278061,
        0.020732615143060684,
        -0.053000155836343765,
        0.002183906501159072,
        -0.09973496198654175,
        0.04819497838616371,
        -0.010769946500658989,
        -0.030444003641605377,
        -0.08404584228992462,
        0.06693970412015915,
        -0.07913366705179214,
        0.023823019117116928,
        -0.042616259306669235,
        -0.021172847598791122,
        -0.03713268041610718,
        -0.007207273505628109,
        0.0231316015124321,
        0.0005276754964143038,
        0.031041255220770836,
        -0.03809187188744545,
        -0.014051343314349651,
        0.03503788635134697,
        0.00948897935450077,
        -0.0018419508123770356,
        -0.13275542855262756,
        1.1896315071008487e-32,
        0.00596679886803031,
        0.1284075230360031,
        -0.09312698990106583,
        -0.017353665083646774,
        0.07733339071273804,
        0.0012719091027975082,
        0.006070164497941732,
        -0.036739740520715714,
        -0.012836551293730736,
        0.07305531948804855,
        0.020978055894374847,
        0.06984715163707733,
        -0.03256664052605629,
        0.07678142935037613,
        0.026813246309757233,
        -0.11878768354654312,
        0.040466953068971634,
        0.006107180379331112,
        -0.0917581245303154,
        -0.012126028537750244,
        0.03701486438512802,
        0.03799991309642792,
        0.02937859483063221,
        0.018796492367982864,
        0.07356937229633331,
        -0.03093300200998783,
        -0.0062002260237932205,
        -0.01506770495325327,
        0.028494281694293022,
        0.0072808521799743176,
        0.0058378372341394424,
        -0.08065832406282425,
        -0.005322400946170092,
        0.02350170537829399,
        -0.010737032629549503,
        -0.016985779628157616,
        -0.04920797795057297,
        -0.07542531192302704,
        0.027214931324124336,
        -0.007572236470878124,
        -0.019998198375105858,
        0.06014758348464966,
        -0.054758913815021515,
        -0.06795109063386917,
        -0.01683066599071026,
        0.011888098903000355,
        0.049752090126276016,
        -0.025737859308719635,
        0.053679291158914566,
        -0.021924477070569992,
        -0.03074384294450283,
        0.007840542122721672,
        -0.07026444375514984,
        -0.04027743265032768,
        0.04611065611243248,
        -0.0837118923664093,
        0.01930883526802063,
        -0.003227663692086935,
        0.08922018110752106,
        0.09636792540550232,
        -0.07499655336141586,
        -0.01634521223604679,
        -0.02806023322045803,
        -0.002117385622113943,
        -0.06361402571201324,
        0.1066601574420929,
        0.03011315129697323,
        -0.006686852313578129,
        -0.042315948754549026,
        0.040120936930179596,
        0.01302002090960741,
        0.0024579218588769436,
        0.06414560228586197,
        0.04642385244369507,
        0.09879836440086365,
        0.015745189040899277,
        -0.05972714349627495,
        -0.08074755221605301,
        -0.0707545280456543,
        -0.05598494037985802,
        -0.07102138549089432,
        0.015857018530368805,
        -0.037905819714069366,
        0.07964029908180237,
        0.026254335418343544,
        -0.0003301153192296624,
        0.013982849195599556,
        0.05343905836343765,
        -0.005732239224016666,
        -0.039233818650245667,
        -0.05416397377848625,
        -0.10748643428087234,
        0.0848812684416771,
        0.03270728141069412,
        -0.043204087764024734,
        -9.719425164244354e-33,
        -0.031929861754179,
        -0.050484053790569305,
        0.007382215932011604,
        0.05856848880648613,
        0.03633873537182808,
        0.012130960822105408,
        0.11076868325471878,
        0.03921397402882576,
        0.06871362030506134,
        -0.06854575127363205,
        0.05625992268323898,
        0.08151168376207352,
        0.012946628034114838,
        0.016781596466898918,
        -0.007327939849346876,
        0.022091925144195557,
        0.030909210443496704,
        -0.10891293734312057,
        0.03143688663840294,
        -0.0246899351477623,
        0.05955144390463829,
        0.044293854385614395,
        -0.06632229685783386,
        0.010845175012946129,
        0.000543172296602279,
        0.0806974545121193,
        -0.005382196046411991,
        -0.035941705107688904,
        -0.008951372466981411,
        0.07822860032320023,
        -0.09125111997127533,
        0.020672976970672607,
        0.01591721922159195,
        -0.009598294273018837,
        0.02983335219323635,
        -0.02534886635839939,
        0.08585178852081299,
        0.0561804361641407,
        -0.027054201811552048,
        -0.0075953383930027485,
        -0.006948575843125582,
        0.015812305733561516,
        0.03842613846063614,
        0.016628239303827286,
        -0.045652929693460464,
        -6.755502454325324e-06,
        -0.014070692472159863,
        -0.06297444552183151,
        0.0857711061835289,
        0.029941601678729057,
        -0.0576784573495388,
        -0.05936445668339729,
        0.05779007449746132,
        0.0322415828704834,
        -0.06174587830901146,
        -0.06989787518978119,
        -0.04593568295240402,
        0.04788653925061226,
        -0.006645532324910164,
        -0.06026812270283699,
        0.03010817989706993,
        0.030007196590304375,
        -0.01670452021062374,
        -0.06992089003324509,
        0.0803622156381607,
        -0.030286720022559166,
        -0.030729804188013077,
        0.01383952610194683,
        -0.010941676795482635,
        0.039735469967126846,
        -0.06750259548425674,
        0.014000795781612396,
        -0.0427270270884037,
        -0.04753105714917183,
        -0.03140362724661827,
        0.06767275184392929,
        0.05560790374875069,
        -0.03919404000043869,
        0.036887042224407196,
        0.023972060531377792,
        -0.06199812889099121,
        0.025156093761324883,
        -0.0037744995206594467,
        -0.012710101902484894,
        0.09052906185388565,
        -0.03426374867558479,
        0.01880510337650776,
        0.02088405378162861,
        0.049062833189964294,
        -0.06599284708499908,
        -0.06592956930398941,
        -0.00014856997586321086,
        0.023971231654286385,
        0.07064840197563171,
        0.003649693913757801,
        -5.607234854210219e-08,
        0.00742881465703249,
        -0.02401602640748024,
        0.017416831105947495,
        0.03632839024066925,
        0.0647498220205307,
        -0.026466473937034607,
        0.018778542056679726,
        -0.05705351382493973,
        0.01204805076122284,
        0.0071078138425946236,
        0.022916149348020554,
        -0.03534990921616554,
        0.045908115804195404,
        0.0008209064835682511,
        -0.048518918454647064,
        -0.013783743605017662,
        -0.02226080372929573,
        0.06445566564798355,
        -0.004945163149386644,
        -0.07178321480751038,
        -0.039311885833740234,
        0.05781491473317146,
        0.1043822169303894,
        0.00677213491871953,
        -0.042350396513938904,
        0.02475208416581154,
        0.028595929965376854,
        -0.03427132964134216,
        0.038264378905296326,
        0.017548944801092148,
        -0.09359502792358398,
        0.02055213786661625,
        0.058570437133312225,
        -0.03517937660217285,
        0.03562241792678833,
        -0.04178022965788841,
        -0.005307071376591921,
        0.12832488119602203,
        0.05244286730885506,
        0.024050433188676834,
        0.05518217757344246,
        -0.026017501950263977,
        -0.06189167499542236,
        0.0156970527023077,
        -0.004475533962249756,
        -0.058950722217559814,
        -0.049947239458560944,
        -0.10545946657657623,
        0.03208407387137413,
        0.05319739133119583,
        0.0096867261454463,
        -0.0373779833316803,
        -0.08296708762645721,
        0.02860010415315628,
        0.07744499295949936,
        -0.02254609577357769,
        -0.08744604885578156,
        0.08362027257680893,
        0.026020079851150513,
        0.03231552243232727,
        0.0038450018037110567,
        -0.11610870063304901,
        -0.03389381989836693,
        -0.004876749124377966
    ]
}