{
    "id": "7amtrg_jbmc",
    "title": "Is it too LATE?!? -  HP Spectre X360 laptop",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-02-26T19:14:00Z",
    "video_url": "https://www.youtube.com/watch?v=7amtrg_jbmc",
    "category": "Science & Technology",
    "tags": [
        "Would be good 5 months ago",
        "Should've released this 5 months ago",
        "HP was too late",
        "The could have been a great laptop",
        "HP",
        "Envy",
        "Spectre",
        "x360",
        "2-in-1",
        "Laptop",
        "Computer",
        "PC",
        "Gaming",
        "Touchscreen",
        "OLED",
        "Display",
        "NVIDIA",
        "3050",
        "RTX",
        "Game",
        "Performance"
    ],
    "views": 450489,
    "likes": 16226,
    "comments_count": 689,
    "description": "Learn more about the MSI Immerse GV60 Streaming Microphone at   HP Spectre X360 16\" 2-in-1 laptop has everything we ever wanted in the laptop... except for the fact that it's a bit too late because this has an Intel 11th gen. But, hopefully, they will continue this trend and release it in a 12th gen or, better, a Ryzen 6000 series processor???   Check out the HP Spectre X360 laptop at   Buy Dell XPS On Amazon (Paid Link):  On Best Buy (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 - EXTREME!!! 0:26 - Unboxing 0:55 - Exterior impressions 1:54 - Sponsor - MSI! 2:20 - Turning it on 2:40 - Specs 3:03 - Intel processor thoughts 3:40 - Is HP too late? 4:05 - Pricing information 4:13 - Screen size impressions 4:50 - Keyboard and trackpad impressions 5:33 - OLED impressions 6:15 - Build quality 6:25 - Webcam and software features 7:56 - Speaker impressions 8:41 - Display impressions 9:09 - Gaming impressions 10:10 - Rubber risers thoughts 10:38 - Repairability impressions 11:30 - Final thoughts",
    "description_links": [
        "https://lmg.gg/MSIGV60",
        "https://howl.me/chrOiXjoTNe",
        "https://geni.us/062Ugc",
        "https://geni.us/8xboRj",
        "https://geni.us/P5A0BLc",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Laptop. We're unboxing one, today. It's the HP specter X360 16. And Ugh - I don't know. I felt violent this morning. Did I say what this is, Jono? - No. - Oh, this is the, HP specter X360 16 inch. And it looks awesome. This is a replacement for the HP Spectre 15, and it's the same size, but, now it has a 16 by 10 display, which is freaking awesome. Oh, we also get a pen. Love to see it, when that's included. It comes with additional tips, as I just found out, when I accidentally dropped it. See what else we got here? AC adapter. That's it, there is the charger. Let's see, how many wattages we have. 135. That's pretty good. Is it going through? Oh. - Woah - Woah. Yeah. HP, gave me, type C. So this, Specter X360, is like a full generational update, over the last one. It also comes in this nice, it's not quite black, but basically black color. Yeah. I don't know how I feel about the look. It kind of, it looks premium, but it also kind of, gives me like, Chromebook vibes, if that makes sense. So, this is what we have for I/O. We have, Thunderbolt four, one there, one on the edge, kind of easy to miss that one. We also have a headphone Jack and a micro SD card reader. Around on the other side, we have, a USB type A, with one of these funky little fold down Chamois. An HDMI, 2.1 port. And wait. Okay. Scratch what I said before, your headphone- microphone combo, is on this edge right here. And over here is the charging port. Opening up, this looks very nice. I'm glad that HP moved the speakers from, up top, down to the sides. And I imagine, that they sound really great. And what also sounds really great, is our sponsor today. MSI. Thanks to MSI for sponsoring this video. MSI has released their first microphone designed for streaming. The MSI, IMMERSE, GV60. Whether you're singing, running a podcast or gaming, this microphone offers four pickup patterns to fit your needs. It features, high resolution digital audio, offers real time monitoring , on the fly controls and plug and play functionality, to help make your stream sound great or remaining easy to run. Learn more about the, MSI IMMEERSE GV 60, streaming microphone, at the link below. All right, let's turn this thing on. Oh, just from the login screen. I can already tell, that this screen, is freaking wicked. Okay. Yep. That's OLED. Those are some deep blacks. That is an awesome background for just showing off how excellent, your black levels are, on your display. Good job, HP. What is super cool about this though? And you probably noticed it, down here below the keyboard, is that we have, RTX graphics. So, inside of this, is Nvidia RTX 3050. We also have an Intel i7-11390H, love their naming schemes. 16 gigabytes of RAM, Wi-Fi 6E. And, a 1 terabyte SSD with Optane. Now, let's go back to the processor here, for a second. 'Cause this is, kind of, my least favorite part, of this laptop. So, the 11390H, is a 4 core 8 thread processor. And as of a couple weeks ago, it sucks. So, if you buy this laptop, in a couple months, it'll probably come with, a P-series processor from Intel, and just completely wipe the floor with this thing. You'd probably be getting, 4 performance cores, 8 efficiency cores. You'll have like 10% more single threaded performance, heaps more multi-threaded, and way more battery life. It's really sad. I feel super bad for HP, because if they gave this to me, in December, I would've been like, wicked. They did such a good job. They have the RTX 3050, and this, thin, relatively light machine. They've got an awesome display. 16 by 10. They took all of the notes of everything that I would want in a laptop. That's like, this great job. And now it's like, great job, in a couple months when you refresh it. (bleep) How much is the laptop? The one you want, starts at $1,700. And this one right here, is over two grand. - Ooh - She's pricey. It is pretty interesting, seeing these two laptops, side by side, the screens are both 16 by 9, although, HP's is just so much bigger. Like, I guess it is, just the way that, they did the hinge. Dell did their hinge, kind of like, way down low. So the screen's, right beside, like your keyboard. Whereas HP, has this kind of, dual hinge on the go. Which does add, a fair bit of height. But at the same time, you can do this. And for a lot of people, especially if you're using this pen, that is going to be very awesome. Yeah, let's see how this laptop works, as an actual laptop. I'm guessing the keyboard is excellent (keyboard being pressed) and it is. This is, a different feeling keyboard, that I'm used to, from HP. I don't quite know what's different. It reminds me of, almost, more of like a razor keyboard. As for the track pad. This thing is great. I'm not seeing, any sort of, delay or anything. That's something that, HP in the past, was kind of bad for. And it seems like they have fixed that. It isn't quite as large as the one, on the XPS15. Okay. It's actually a lot smaller, but you can see like, based off, of my grease, from my hands I don't use, from here to here, or there to there. So, I think that this one, is gonna be perfectly fine. One thing that I did just notice, and this is again, the complaint that I always have with OLEDs. There is a little bit of that, kind of weird, graininess that I always find problematic on these. You're not going to care about it too much, unless you have full white displays. But at the same time, like, it's a laptop. You're going to be using things, like Word and Excel. You're going to see the graininess. I don't think that's a bad thing, because ,realistically, I'm not going to recommend you buy the OLED, on this anyway. Because it's super expensive and HP's non OLED screens, are really, really good. The Chassis rigidity, on this laptop, is fantastic. It is, one of the best built laptops on the market, easily. The whole thing's made, from Recycled CNC aluminum. I don't know. I would've never guessed, this was once, Pepsi cans. There's one part of this laptop that I've been super excited to try out. And that is the webcam. Well, there's the webcam. It's a five megapixel jolly. Which is, I can already tell you, for sure it completely, just takes a dump, on Dell's face. But there's another thing. Yes. Ah, here it is. The HP glam cam. I can already tell you that, this webcam is excellent. Like, look at my face. It doesn't look awful, but it has a couple more things. So, the first here is the Walk-away lock. This is awesome, because it just means that if, you get up and walk away, it should lock itself. We'll see if it does. Yep. It's locked. Perfect. - Yay. - That's nice. Now, Wake on approach. Let's turn that back on. So, now with wake on approach, let's see, I should be able to leave, and then when I come back, it turns back on. So, now it is asleep. Boom. Boom .Boom Sitting down. That was freaking wicked. Don't even need to touch it. Boom. You're into your laptop. And finally, there's shoulder surfing. This is a gimmick, but I think it's pretty funny. Jono, come over here and try and look at, what I am looking at. And here browsing photos. Oh, there we go. It did immediately blur it. - It's not that blurred. - Yeah. It's not that blurred. - I can Definitely tell you're looking at underwear. - What else do we talk about, in laptop reviews? Crab rave. (upbeat music playing) HP, normally has, really good speakers. And so far, these are also very good. (upbeat music playing) Nice. There's not, a lot of bass, but it's all very clear. Go, Dell. (upbeat music playing) Hmm. Now, I'm going to say right now, the Dell speakers, are better, but they sound worse. Because Dell's audio drivers, on windows 11, have been one of the worst experiences, I have ever had with a laptop. They're, actually, so bad. The image quality, is very comparable. The HP, does have the edge, on the black levels. That's for sure. Especially on this next scene. Yeah. There's just more detail, like in the trees and stuff. I don't think it's worth the downsides, of like, the weird graininess and stuff of the OLED display. And the increased power consumption. I would just, get their normal LCD display, and save myself, a couple hundred bucks. Guess, what else do we have to do? Oh, Valheim. I almost forgot, we were downloading it. So, do note, that this is going to be, performance, while also capturing. So, it's kind of, worst case, for this poor laptop, but at the same time, I imagine, it's going to be fine. Okay. So we're on, 1080P low, and we're getting like 24FPS. actually I'm going to stop OBS. So, we went from like, 23 to 26FPS by Darknet. So, Nvidia's NVENC encoder, is still good and doesn't have a large performance hit. If you just want, GPU acceleration for Photoshop and stuff, having a 3050 is going to be nice. If you want to play AAA games, manage your expectations, is what I'm going to say. Oh wow, nevermind. This thing's great. Just put in, performance mode, and my FPS doubled right there. (Vlogger laughs) Wow. We're getting F50 FPSs, in ValHeim. This is perfectly good. I'm sure that, you could play, like 1080P low, You're gonna be having a great time. One thing I wanna point at, right here, that I really don't like on HP laptops, are these rubber pieces that go straight across the bottom. I say that because, when they come off, you can't put them back on. They stretch and it's weird. And, as part of my Intel upgrade, my girlfriend got an HP NV14. Fantastic laptop overall, but the rubber foot, after just a couple months, has completely come off on the front, from just like, going in and out of a backpack. So, in here we can see that you get, an 83Wh battery. That's, a little bit bigger, than the last generation. Very similar. I think the same as the XPS 15. And given that, you only have a 4 core CPU in this, you'll definitely, beat the battery life, of the XPS15. The repairability of this, as a whole, is excellent. I watched the tear down guide. And so, you're able to remove the battery, track pads is replaceable, keyboard is replaceable, screen is replaceable. Even the webcam, you can replace. Like it's a separate little module. Awesome. It would be pretty much top tier, repairability scores, except the RAM is hard. Which sucks. 'Cause you can only buy 16 gigabytes. And, given that this has like, the GPU and a pretty decent CPU, I could see lots of people, that are like, well that would want 32 gigabytes in a laptop, like this. Cause overall, this is quite a fantastic laptop. Like, if you want, a powerful flippier, roundy laptop, this is potentially the best one. Like look at these fans. Those are nice big fans, nice big heat pipes. As far as I could tell from the gaming, like, the cooler, works just fine. It's really annoying, that you only get 16 gigabytes. So yeah, this is kind of like, this is the, super close laptop. I just wish, that they gave you, a little bit more RAM That's actually pretty much, my whole wish. But, buy this laptop when, 12th gen, gets to it. That's my conclusion. Thanks for watching. Bye.",
    "transcript_keywords": [
        "Laptop",
        "kind",
        "thing",
        "great",
        "good",
        "MSI",
        "awesome",
        "nice",
        "Dell",
        "Yeah",
        "couple",
        "keyboard",
        "pretty",
        "OLED",
        "display",
        "laptops",
        "time",
        "back",
        "super",
        "performance"
    ],
    "transcript_entity_values": [
        "16 gigabytes",
        "over two",
        "Wi-Fi 6E.",
        "Optane",
        "a couple hundred bucks",
        "the last one",
        "Excel",
        "1 terabyte",
        "11390H",
        "Valheim",
        "Photoshop",
        "15",
        "X360 16 inch",
        "Intel",
        "Specter",
        "RAM",
        "HP",
        "Chromebook",
        "4",
        "one",
        "8",
        "USB",
        "One",
        "five megapixel",
        "Vlogger",
        "HP NV14",
        "a couple months",
        "ValHeim",
        "16 gigabytes",
        "Jack",
        "OBS",
        "9",
        "NVENC",
        "windows 11",
        "second",
        "F50 FPSs",
        "AC",
        "32 gigabytes",
        "Jono",
        "Pepsi",
        "26FPS",
        "December",
        "10",
        "a couple weeks ago",
        "first",
        "135",
        "Nvidia",
        "16",
        "two",
        "MSI",
        "10%",
        "four",
        "1,700",
        "LCD",
        "GPU",
        "12th",
        "just a couple months",
        "83Wh",
        "23",
        "this morning",
        "3050",
        "CNC",
        "SD",
        "CPU",
        "2.1",
        "1080P",
        "Dell",
        "today"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "NORP",
        "ORG",
        "DATE",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.07840386778116226,
        -0.03209744766354561,
        -0.032611291855573654,
        -0.10011046379804611,
        0.04760248586535454,
        0.027157139033079147,
        -0.04967542365193367,
        0.028203941881656647,
        -0.05482343211770058,
        -0.03381986916065216,
        0.04975663125514984,
        0.02508140541613102,
        -0.04162643849849701,
        -0.015230652876198292,
        0.06742345541715622,
        0.0030656824819743633,
        0.05881557986140251,
        -0.06933771073818207,
        -0.012193485163152218,
        -0.012888065539300442,
        -0.018367651849985123,
        -0.05096259340643883,
        0.026737557724118233,
        -0.034066248685121536,
        0.08381190896034241,
        -0.048757411539554596,
        0.04226401448249817,
        -0.07158253341913223,
        -0.018841180950403214,
        0.049157533794641495,
        0.012498627416789532,
        0.030317388474941254,
        -0.010649292729794979,
        0.03553011268377304,
        0.05428837612271309,
        -0.06377920508384705,
        0.05936267971992493,
        -0.07809805870056152,
        0.01567697897553444,
        -0.12384074926376343,
        -0.026883594691753387,
        -0.08897455036640167,
        -0.013377035036683083,
        0.008192911744117737,
        0.07499764859676361,
        -0.04542487487196922,
        -0.008562624454498291,
        -0.04546274617314339,
        -0.011816455982625484,
        0.044003695249557495,
        -0.04712856933474541,
        -0.12698021531105042,
        0.05654995143413544,
        0.006800553761422634,
        -0.10265442728996277,
        0.0261695459485054,
        0.006624126806855202,
        -0.025404179468750954,
        0.012210359796881676,
        -0.005515843164175749,
        0.0476781465113163,
        -0.1587132215499878,
        -0.03706192597746849,
        0.06892827153205872,
        -0.02101963758468628,
        -0.05854557827115059,
        0.07236091792583466,
        0.0074186185374855995,
        -0.013631275855004787,
        -0.0005335246096365154,
        -0.005274077877402306,
        -0.00806234311312437,
        0.039503004401922226,
        0.011423373594880104,
        -0.04874664917588234,
        0.0764971375465393,
        0.07450301200151443,
        -0.041715141385793686,
        0.060715097934007645,
        -0.017754800617694855,
        0.0018634980078786612,
        0.007143236696720123,
        0.00410842290148139,
        -0.05877179279923439,
        0.048761140555143356,
        -0.019683100283145905,
        0.0333261713385582,
        0.013108850456774235,
        -0.011598106473684311,
        -0.09491422027349472,
        -0.05381434038281441,
        0.05264809727668762,
        -0.012991277500987053,
        0.02136794663965702,
        0.0050989845767617226,
        0.010121476836502552,
        0.052047356963157654,
        -0.017322486266493797,
        0.02011568285524845,
        0.025563430041074753,
        0.00901513546705246,
        0.022270433604717255,
        0.028692444786429405,
        -0.01075094286352396,
        -0.05403399467468262,
        -0.0643070861697197,
        -0.02931791916489601,
        0.1037273034453392,
        -0.056105565279722214,
        -0.06749576330184937,
        -0.08142382651567459,
        0.052874207496643066,
        -0.0038562084082514048,
        -0.04097522050142288,
        0.04107988253235817,
        0.04521067440509796,
        -0.03240978717803955,
        -0.017891231924295425,
        0.0921904519200325,
        -0.02261923998594284,
        -0.01722213439643383,
        0.000670345441903919,
        -0.05992119386792183,
        0.029717883095145226,
        -0.01574675366282463,
        0.06822160631418228,
        -0.12475799769163132,
        1.8043566452053486e-33,
        -0.04077988862991333,
        0.0462590716779232,
        -0.06423959881067276,
        -0.07691756635904312,
        0.014372189529240131,
        -0.027830451726913452,
        0.0003951886319555342,
        -0.047241415828466415,
        -0.08199997246265411,
        0.015117521397769451,
        -0.07556115090847015,
        -0.07294680923223495,
        -0.07034928351640701,
        0.010472150519490242,
        0.016060402616858482,
        -0.027868781238794327,
        0.003943194635212421,
        0.05814061686396599,
        0.01555110327899456,
        -0.02144092693924904,
        0.07132814824581146,
        -0.04634891450405121,
        0.02699979767203331,
        -0.018251854926347733,
        0.0442933551967144,
        0.043657269328832626,
        0.037169747054576874,
        0.001359512098133564,
        0.017803598195314407,
        0.030467692762613297,
        -0.031059013679623604,
        -0.049751993268728256,
        0.003489958355203271,
        -0.09380164742469788,
        0.009507439099252224,
        0.044990651309490204,
        -0.030623527243733406,
        -0.0352315828204155,
        0.05886271223425865,
        -0.0443049781024456,
        -0.04862360283732414,
        0.07312564551830292,
        -0.09581466019153595,
        -0.08810636401176453,
        0.009102875366806984,
        -0.00791348796337843,
        -0.042146988213062286,
        0.0029886108823120594,
        0.04253331944346428,
        -0.02778225764632225,
        -0.08898868411779404,
        -0.004050648305565119,
        -0.026462046429514885,
        -0.007210897747427225,
        0.014931444078683853,
        -0.0602581761777401,
        0.03079088218510151,
        0.01309121586382389,
        0.08201286941766739,
        0.05432145297527313,
        0.043189287185668945,
        -0.05787298455834389,
        -0.02961592935025692,
        0.013042114675045013,
        -0.008436049334704876,
        0.005789516028016806,
        0.05816633626818657,
        0.03466992452740669,
        -0.09090008586645126,
        0.05902146175503731,
        -0.02289748378098011,
        -0.02247275970876217,
        -0.0027697605546563864,
        -0.07421352714300156,
        0.05271243676543236,
        0.03404420614242554,
        -0.0742502436041832,
        -0.06262734532356262,
        -0.022215085104107857,
        0.014710139483213425,
        0.029152266681194305,
        0.08489754796028137,
        -0.016641659662127495,
        0.06618357449769974,
        0.015560365281999111,
        0.033399276435375214,
        -0.05712391436100006,
        0.02118394337594509,
        0.021432334557175636,
        0.01851819083094597,
        0.009907679632306099,
        -0.019654231145977974,
        -0.01768716238439083,
        0.023027606308460236,
        -0.004796366207301617,
        -4.043253511633372e-33,
        -0.02901490591466427,
        0.07216949015855789,
        -0.06849953532218933,
        0.05657201632857323,
        -0.019632812589406967,
        0.006484506651759148,
        0.08162647485733032,
        0.04324262961745262,
        -0.003218255005776882,
        -0.0179589856415987,
        0.02362464927136898,
        0.028016909956932068,
        -0.034008052200078964,
        0.02619784139096737,
        -0.029873846098780632,
        -0.020707322284579277,
        -0.06718728691339493,
        -0.12485331296920776,
        0.14491118490695953,
        0.025300759822130203,
        0.06515044718980789,
        0.005780693143606186,
        -0.006077046971768141,
        0.04626137390732765,
        0.0026809468399733305,
        -0.0023249879013746977,
        -0.053653325885534286,
        0.0017982057761400938,
        -0.04635906219482422,
        -0.056313399225473404,
        -0.03233715146780014,
        -0.062233805656433105,
        0.013741390779614449,
        0.011133120395243168,
        0.1391213834285736,
        -0.016689244657754898,
        0.08238343894481659,
        -0.03890201449394226,
        0.020129214972257614,
        0.08539506047964096,
        0.04719696193933487,
        0.028162723407149315,
        0.006769215688109398,
        -0.035438135266304016,
        0.07907141745090485,
        -0.009665836580097675,
        0.044883690774440765,
        -0.0842253714799881,
        0.008780747652053833,
        -0.024352168664336205,
        0.004979077726602554,
        -0.04196494445204735,
        0.0802910327911377,
        -0.0006243089446797967,
        0.021171990782022476,
        -0.11771424859762192,
        -0.02753322198987007,
        0.02311144582927227,
        -0.019909724593162537,
        -0.007649983745068312,
        0.007221808657050133,
        0.026847947388887405,
        0.021770456805825233,
        -0.06418951600790024,
        0.04502348601818085,
        0.06659291684627533,
        0.07007750123739243,
        0.050129234790802,
        -0.02560555376112461,
        -0.0036702032666653395,
        0.012480633333325386,
        -0.04644329473376274,
        -0.039615217596292496,
        -0.10468277335166931,
        -0.01504821889102459,
        0.05517735332250595,
        -0.06327345222234726,
        0.0006426768959499896,
        -0.014923294074833393,
        -0.03141751140356064,
        0.02090390957891941,
        -0.007222031243145466,
        0.03125607594847679,
        -0.0220101997256279,
        0.09648443758487701,
        -0.04606441408395767,
        0.024450941011309624,
        -0.04559709504246712,
        -0.053953975439071655,
        -0.0418282225728035,
        -0.04062006622552872,
        -0.014108045026659966,
        -0.005569194443523884,
        0.003703049384057522,
        -0.02021186426281929,
        -5.3331220328800555e-08,
        0.06078578159213066,
        0.02135409414768219,
        0.006986191030591726,
        0.008872846141457558,
        0.06315013766288757,
        -0.08031368255615234,
        0.025255858898162842,
        -0.00670586945489049,
        0.10252079367637634,
        0.07255824655294418,
        0.06468141078948975,
        -0.14541296660900116,
        0.0891992598772049,
        0.026549996808171272,
        0.025675401091575623,
        -0.01976936124265194,
        -0.06621746718883514,
        0.0812438502907753,
        -0.017996584996581078,
        -0.0364096462726593,
        0.00790251325815916,
        0.09233258664608002,
        0.0732317566871643,
        -0.06016455218195915,
        0.04865085706114769,
        -0.042116258293390274,
        -0.018577920272946358,
        0.026403572410345078,
        0.08473189175128937,
        -0.0528734065592289,
        -0.10810575634241104,
        0.04286012798547745,
        0.014963765628635883,
        0.00555014843121171,
        0.02836410142481327,
        -0.061445802450180054,
        -0.022373691201210022,
        0.12472917139530182,
        0.11889860033988953,
        0.0017670001834630966,
        -0.04886811226606369,
        -0.054398708045482635,
        -0.050941891968250275,
        -0.006407673005014658,
        0.04675222560763359,
        0.04462398961186409,
        -0.026426199823617935,
        -0.15835897624492645,
        -0.02311037853360176,
        0.12380518764257431,
        -0.036895908415317535,
        0.011037110351026058,
        0.06206265464425087,
        0.02860609069466591,
        0.004691636189818382,
        0.028661666437983513,
        -0.004173224326223135,
        0.04614127054810524,
        -0.018942173570394516,
        0.011593050323426723,
        0.0491751953959465,
        -0.09479706734418869,
        0.009237116202712059,
        0.03778776153922081
    ]
}