{
    "id": "7G62pp8gstQ",
    "title": "Samsung Z Flip 3 TEARDOWN! - Lets try something new...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-10-30T16:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=7G62pp8gstQ",
    "category": "Howto & Style",
    "tags": [
        "z flip 3",
        "samsung galaxy z flip 3",
        "samsung folding phone",
        "folding phone",
        "new smartphone",
        "best smartphone",
        "flexible screen smartphone",
        "galaxy z flip",
        "z flip 3 teardown",
        "z flip 3 repair",
        "take apart z flip 3",
        "samsung",
        "iphone"
    ],
    "views": 1694184,
    "likes": 64697,
    "comments_count": 2009,
    "description": "Its time to take apart the Samsung Flip 3! Get a 4-week trial, free postage, and a digital scale at  Thanks to Stamps.com for sponsoring this video! The Z Flip 3 is one of the most futuristic smartphones on the planet... so far.  With a folding screen in the middle it can take a pocket sized square and turn it into a full size smartphone rectangle. Cross your fingers that the new Samsung Galaxy Z Flip 3 can survive my teardown.   Grab your teardown skin here:   Get my razor knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.stamps.com/jerryrig.",
        "https://www.dbrand.com/Teardown",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today we're going to be tearing down what's probably my favorite phone so far this year the Z Flip 3. Normally, when we do a teardown on a folding phone it doesn't survive because the folding plastic screen isn't as durable as glass screens. But this time around I think it would be fun to try to keep it alive, even if it doesn't actually happen. Fun little side note, I will be getting my next shipment of Jerry Rig Knives. I know that supply shortages have affected everyone across the board including these. So if you're looking to snag one for yourself, or give away one for Christmas, I will leave a link down in the video description. And as soon as they arrive I will ship them out with Stamps.com. Huge thanks to Stamps.com for sponsoring this video. I use Stamps.com for all my shipping because it brings the services of the United States Postal Service and UPS right to my computer. So if you regularly send letters or packages for your business or side hustle, like me, it only takes a few minutes to get set up. And since 1998, over 1 million businesses, like mine, have been using Stamps.com. It's just nice not to have to stand in line at the post office. And I can ship everything I need to from my own computer. You can quickly compare carriers to get the best rates with Stamps.com's new rate adviser tool. And then I can just drop off my packages or schedule a pick up. Pretty simple. No lines or traffic. To get your free 4 week trial, free postage, discounted shipping and a free 5 pound digital scale, just head to Stamps.com/jerryrig and I'll leave a link down in the description. There are no long term commitments or contracts so it's a win-win for everyone. That link is down in the description Stamps.com/jerryrig. And now it's time to see if the Galaxy Fold 3 can survive an autopsy. Let's get started. [Intro] The goal here this time around is to have a working Galaxy Flip 3 after it gets 100% entirely disassembled, which means we're also removing that flexible screen. We've never ended up with a working folding phone after a teardown because in the past there was always something new and exciting on the screen hardware to check out, but this time around it's worth a shot...even if the attempt might be futile. We'll start from the back this time around with my heat gun. And also, not sure when this happened but my camera lens has cracked at some point between my durability test and now. Maybe one of the bends stressed out the lens enough to crack. I'm not really sure because it definitely hasn't been dropped. The lower glass is easy enough to be removed. I did, however, forget that the top glass had a full screen underneath and I did nick that with my pry tool as I was slicing the adhesive off from around the edges. But it looks like things are still working, even if that display is a little dinged. The camera is still working even when the display is separated from the body. Kind of trippy. I'll get everything turned off again and we can press forward with a little more caution. The smaller rear LCD is attached to the Flip 3 with it's own Lego-style ribbon connector. And interestingly enough, the black and colored halves of the Flip 3 are actually one solid piece of glass. For some reason I thought they would be two. So far things are looking good. I'll remove the two screws holding down the metal plate over the upper battery connection. Then I can unplug that battery just like a little Lego and then we can move down to the bottom half of the phone which has the wireless charger. It's connectors are held in place by another metal bracket with two more screws. The wireless coil can then be removed, and the lower larger battery can be unplugged. The Flip 3 does have 5G with two of it's little millimeter wave antennas tucked into the side rail, and another near the hinge. The funny thing about technology is that the more it improves, the crazier people get who don't understand how it works, while, of course, they're still using it. People are saying the same things about 5G as they said about 4G, and 3G. But the truth is, as long as you aren't sticking your head in a microwave, you'll be just fine. Where was I? Oh yeah. The balls. Inside the loudspeaker we have the same foam dampening balls that we find in most high end cell phones, including the iPhones. There is no waterproofing on the unit itself, but there is some down on the frame that I'll show you in a second. I can unclip the folding display ribbon. And then down here are the little ingress protection screens to help keep the water out of the loudspeaker and microphone holes. The Flip 3 is ipx8 water resistant just like the Fold. To get the battery out, Samsung is still making things difficult with permanently glued in batteries. This is annoying for multiple reasons, but mainly because it makes the phone much more difficult to recycle at the end of its lifespan. As of now, lithium batteries are 95% recyclable, but with each additional removal process, the likelihood of it actually getting recycled goes down. All 2,370 milliamp hours of it. The charging port does separate from its ribbon cable. It's plugged in on the underside, and it's got a red rubber ring around the opening. The other motherboard has several extension ribbons going through the hinge, along with 6 more silver screws holding down the top plastics. But even after getting all those screws out, there is still something holding the motherboard in place. Ah yes. My old nemesis the SIM card tray. Finally, with the motherboard out, we can see the top 12 megapixel ultra wide camera up top, with no optical image stabilization. Then we have the main 12 megapixel camera right below that, which does have the OIS. And both of these cameras can be disconnected from the motherboard with their Lego-style connectors. There is another battery in the top half of the phone. I imagine that this battery is less out of convenience and more there to balance out the weight of the two halves, since having one half of the phone entirely made for batteries would throw the balance out of whack. So Samsung put this 930 milliamp hour capacity battery in the top half so it doesn't yeet itself to the ground with each unfolding. With everything out of the phone, the only thing we have left to do is remove the foldable dynamic 120 hertz AMOLED with HDR 10 plus and 1200 nits. I might be stalling a bit but check out this waterproofing along the ribbons inside the hinge. The top portion has a red rubber sealant, while the bottom hinge has more of a gray color. Kind of cool that Samsung's being all color coordinated on the inside. Okay, fine, let's do it. I feel like this is a slow motion murder, but we can't tell when it actually dies since the screen is off. Luckily for us the plastic bezel that protects the edge of the screen is relatively easy to pop off. As we know from previous Fold teardowns, an accidental poke to the side of the screen will kill it. Samsung has included a metal plate along the back side of the display which hopefully should allow this to lift up on the pixels without damaging them. And I can take special care as we pry along the screen so that once we reach the bottom we won't damage the screen ribbon cable as we pull it out from the frame. The screen is much less floppy than I anticipated. It naturally just wants to sit at this slightly kinked angle. Along where it rests on the hinge, there are still metal slats integrated into the display. We've seen these on previous versions of the Fold. And unfortunately it looks like we might have inflicted some damage along the bottom edge of the screen. But fingers crossed it might just be the black protective covering on top. It looks like it's been torn a little by the adhesive. Before we find out how murdered the phone is though, let's take a look at the internal hinge. Peeling back the adhesive liner exposes the complex inner workings of the multi positional masterpiece. Once again, I'm mostly stalling. You should leave your survival predictions down in the comments. I can pretend that the phone is still alive as long as I don't actually check it's vital signs. Personally, I give it about a negative 12% chance of surviving with how fragile that screen is. With the battery back in place, along with a charge port and bottom loudspeaker, we can move up to the top battery. I'll slide the motherboard back into its slot and plug in the extension ribbons. The final plastics are in place, along with the sneaky SIM card tray. And last but not least, the metal brackets that keep all the connectors connected. I'll plug in the rear display, press the power button, and would you look at that - success. Both screens are still functioning and the phone is powered on. Basically pretty much just like new...maybe slightly used. It's kind of been through a lot but you know, we don't judge. I'm very surprised it's still functioning. Obviously though, the easiest way to see the insides of your phone from the outside is with one of my Teardown Skins. The Fold 3 is quite honestly one of the best looking Teardown Skins of all time especially with the copper wireless charging pad. It doesn't get much more futuristic than that. Maybe it is, you know, still a little floppy, but I consider this an absolute win. Nice work, Samsung. And nice work myself. Hit that subscribe button if you haven't already. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "screen",
        "phone",
        "Stamps.com",
        "Jerry Rig Knives",
        "battery",
        "top",
        "Flip",
        "Fold",
        "time",
        "working Galaxy Flip",
        "Samsung",
        "favorite phone",
        "display",
        "hinge",
        "folding phone",
        "side",
        "screens",
        "motherboard",
        "United States Postal",
        "bottom"
    ],
    "transcript_entity_values": [
        "the top half",
        "Galaxy Fold 3",
        "Teardown Skins",
        "95%",
        "6",
        "Lego",
        "Stamps.com",
        "120 hertz AMOLED",
        "Instagram",
        "100%",
        "two",
        "1200",
        "the United States Postal Service",
        "4 week",
        "Galaxy Flip 3",
        "the end of its lifespan",
        "nick",
        "3G.",
        "12 megapixel",
        "12%",
        "half",
        "HDR 10 plus and",
        "SIM",
        "1998",
        "this year",
        "5",
        "iPhones",
        "Fold",
        "second",
        "a few minutes",
        "over 1 million",
        "2,370",
        "Christmas",
        "Jerry Rig Knives",
        "LCD",
        "Samsung",
        "one half",
        "Today",
        "about 4",
        "one",
        "930 milliamp hour",
        "the Z Flip 3",
        "Twitter"
    ],
    "transcript_entity_types": [
        "DATE",
        "PRODUCT",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "DATE",
        "PRODUCT",
        "DATE",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "EVENT",
        "ORG"
    ],
    "vector": [
        -0.16411320865154266,
        0.0891142189502716,
        0.02553604543209076,
        -0.058504197746515274,
        0.02049713209271431,
        -0.09367194026708603,
        0.06061403080821037,
        0.08194801956415176,
        -0.017222309485077858,
        0.04028415307402611,
        0.07465957850217819,
        0.005745294503867626,
        -0.01295458059757948,
        0.04918358474969864,
        0.027678336948156357,
        -0.0031499741598963737,
        0.005166127346456051,
        -0.0004296231782063842,
        -0.038577090948820114,
        0.11664003878831863,
        0.03822890669107437,
        -0.03053392469882965,
        0.05186254531145096,
        -0.06519164890050888,
        -0.016446802765130997,
        0.021425174549221992,
        -0.010389650240540504,
        0.002622599946334958,
        -0.05970711633563042,
        -0.034430984407663345,
        0.05323050916194916,
        0.09462402015924454,
        -0.05539734289050102,
        0.021367086097598076,
        0.023795440793037415,
        -0.03653498739004135,
        -0.003464421955868602,
        0.027176130563020706,
        -0.05298147723078728,
        0.024746941402554512,
        -0.027757421135902405,
        0.04844651743769646,
        0.031165780499577522,
        -0.03784885257482529,
        0.045973412692546844,
        -0.02255140244960785,
        0.02450031042098999,
        -0.03675900772213936,
        0.009823368862271309,
        -0.008420142345130444,
        -0.0638066902756691,
        0.0008606106275692582,
        0.005903367884457111,
        0.02463069185614586,
        -0.05724111944437027,
        0.03725998103618622,
        0.004171331878751516,
        -0.024411337450146675,
        0.032265979796648026,
        0.00013124931138008833,
        0.08098282665014267,
        0.01345899235457182,
        -0.03945750743150711,
        0.06302696466445923,
        0.00970911793410778,
        0.009704848751425743,
        0.022608250379562378,
        -0.13409094512462616,
        -0.05769403278827667,
        -0.012289255857467651,
        -0.0991678535938263,
        -0.015610843896865845,
        0.026547545567154884,
        0.005315389018505812,
        -0.0023155948147177696,
        -0.007209116127341986,
        0.06349040567874908,
        -0.01948673464357853,
        -0.06933803111314774,
        0.043948233127593994,
        0.038129519671201706,
        -0.044505707919597626,
        -0.04689532145857811,
        0.05762152373790741,
        0.038809653371572495,
        0.02894463948905468,
        -0.01565288007259369,
        0.10353216528892517,
        -0.06648397445678711,
        -0.03363076597452164,
        -0.027253057807683945,
        0.07678623497486115,
        -0.012210937216877937,
        -0.018691862002015114,
        -0.010891509242355824,
        -0.05898657068610191,
        -0.05930963531136513,
        -0.07693186402320862,
        -0.0661797896027565,
        0.050975244492292404,
        0.047399915754795074,
        -0.043979011476039886,
        0.07111159712076187,
        -0.05205250531435013,
        0.029615983366966248,
        -0.021976163610816002,
        -0.040474940091371536,
        0.01750539429485798,
        -0.02586718089878559,
        0.02427278272807598,
        0.0068152532912790775,
        0.021068615838885307,
        -0.004687856882810593,
        -0.05004075914621353,
        -0.022061659023165703,
        0.01975320652127266,
        -0.07530994713306427,
        0.06086278334259987,
        0.10550136119127274,
        0.005501988809555769,
        0.03356906771659851,
        0.03759013116359711,
        -0.08814132958650589,
        -0.09621096402406693,
        0.03536992520093918,
        0.048251837491989136,
        -0.05803794413805008,
        2.9218956347832433e-33,
        0.03511636704206467,
        0.17212441563606262,
        -0.040532201528549194,
        0.0034394236281514168,
        -0.05429622158408165,
        0.0701901763677597,
        0.0338374562561512,
        0.041815418750047684,
        -0.0310661718249321,
        0.052150554955005646,
        -0.007990047335624695,
        0.019416574388742447,
        -0.011593119241297245,
        0.009243669919669628,
        -0.015944885089993477,
        -0.056227847933769226,
        -0.017490152269601822,
        -0.03243033587932587,
        -0.06717143207788467,
        -0.03219646215438843,
        0.018656598404049873,
        -0.039645615965127945,
        0.008959081955254078,
        0.017204005271196365,
        0.08461557328701019,
        0.052526213228702545,
        0.04579421877861023,
        -0.05265171825885773,
        0.03926306962966919,
        0.03025551326572895,
        -0.05862316116690636,
        -0.015786096453666687,
        0.035322900861501694,
        -0.02284860797226429,
        0.0029616025276482105,
        0.018703950569033623,
        -0.02348533645272255,
        -0.12746772170066833,
        -0.018915029242634773,
        -0.024097565561532974,
        -0.034842997789382935,
        0.01439974270761013,
        -0.06104765832424164,
        0.025156941264867783,
        -0.0003075395943596959,
        -0.02876400202512741,
        0.004680926911532879,
        0.01995757780969143,
        -0.01292167417705059,
        -0.05426498129963875,
        0.031086677685379982,
        -0.09207548201084137,
        -0.025322159752249718,
        -0.027224145829677582,
        -0.10576047003269196,
        -0.024648740887641907,
        0.013953941874206066,
        0.0003455665137153119,
        0.04418595880270004,
        0.05990315601229668,
        0.032304130494594574,
        -0.011985260993242264,
        -0.08656155318021774,
        0.057479724287986755,
        -0.0603221096098423,
        0.016611473634839058,
        0.039992254227399826,
        -0.008981311693787575,
        -0.09210827201604843,
        0.031470462679862976,
        -0.0377323143184185,
        -0.004449793137609959,
        0.04340007156133652,
        -0.0027068392373621464,
        0.028108883649110794,
        0.020598581060767174,
        -0.009889105334877968,
        0.02392035536468029,
        0.03768985718488693,
        -0.06465362012386322,
        -0.06056433543562889,
        -0.02250433713197708,
        0.07452993839979172,
        -0.017681526020169258,
        -0.01842099241912365,
        -0.0760984718799591,
        0.0071051716804504395,
        -0.10841043293476105,
        0.024310080334544182,
        -0.01227590348571539,
        -0.04449092224240303,
        -0.062139905989170074,
        -0.018620790913701057,
        -0.04122744873166084,
        -0.013199285604059696,
        -3.6660278235628994e-33,
        -0.04969226196408272,
        -0.004107425455003977,
        -0.008617239072918892,
        0.021899957209825516,
        0.03780797868967056,
        -0.03773023560643196,
        0.09917928278446198,
        0.07186087220907211,
        -0.009457659907639027,
        -0.10755385458469391,
        -0.029365118592977524,
        0.04799865558743477,
        0.01568235456943512,
        -0.05143522098660469,
        0.06013966351747513,
        -0.003805425949394703,
        0.016905516386032104,
        -0.0966772511601448,
        0.022761443629860878,
        0.014928248710930347,
        0.06450619548559189,
        0.04575521871447563,
        0.09915672242641449,
        0.09001602232456207,
        -0.008149445988237858,
        0.024096259847283363,
        0.07930923253297806,
        -0.05546877905726433,
        0.11386729031801224,
        0.044604502618312836,
        -0.024908285588026047,
        -0.08197776228189468,
        0.029092514887452126,
        0.05961056426167488,
        -0.0258187185972929,
        0.0861419215798378,
        -0.017115982249379158,
        -0.03264249861240387,
        0.008218761533498764,
        -0.06671283394098282,
        -0.01596206985414028,
        0.007301634177565575,
        0.008189748972654343,
        0.022460516542196274,
        -0.027765782549977303,
        -0.07439817488193512,
        -0.039786163717508316,
        0.03837794438004494,
        -0.002019539475440979,
        -0.003992132842540741,
        -0.06443839520215988,
        0.011387264356017113,
        0.0038823671638965607,
        -0.0011328364489600062,
        -0.024380067363381386,
        0.05058210715651512,
        0.056813713163137436,
        -0.10322447866201401,
        0.03456168249249458,
        -0.005409992765635252,
        0.07781753689050674,
        0.001811041496694088,
        0.02696230076253414,
        -0.020409468561410904,
        -0.024639645591378212,
        0.006909283809363842,
        0.10712429881095886,
        -0.009343493729829788,
        -0.011106656864285469,
        0.03146069124341011,
        -0.005761091131716967,
        0.014497502706944942,
        0.03704686462879181,
        -0.11698073148727417,
        0.003848487976938486,
        0.06634718179702759,
        -0.09633669257164001,
        0.028326058760285378,
        -0.0093553951010108,
        -0.017519019544124603,
        0.07501582056283951,
        -0.04959440976381302,
        0.05826675519347191,
        0.08862578123807907,
        0.06495477259159088,
        -0.02534937486052513,
        -0.005195033270865679,
        0.07000770419836044,
        -0.040532033890485764,
        3.063158510485664e-05,
        -0.1141749694943428,
        0.01349021214991808,
        -0.0044148205779492855,
        0.12204212695360184,
        0.012842675670981407,
        -5.594175433998316e-08,
        0.038918569684028625,
        0.06372392177581787,
        0.034716274589300156,
        -0.009261712431907654,
        -0.01396351121366024,
        -0.009138508699834347,
        0.030903363600373268,
        -0.0428953543305397,
        0.04172897711396217,
        -0.05424022302031517,
        -0.0015362724661827087,
        -0.06630618125200272,
        -0.01866992376744747,
        0.09864754229784012,
        0.00557688158005476,
        0.08843819051980972,
        -0.03905615583062172,
        0.04592595249414444,
        0.0037767996545881033,
        0.021773716434836388,
        -0.05025271698832512,
        -0.010913622565567493,
        0.05260774865746498,
        -0.04559970647096634,
        0.038211267441511154,
        0.058122631162405014,
        -0.1382989138364792,
        0.04804514721035957,
        0.0635250061750412,
        0.011907818727195263,
        -0.03977936506271362,
        -0.0405927337706089,
        0.02996557019650936,
        0.022484520450234413,
        -0.07859434187412262,
        -0.06528283655643463,
        -0.08392730355262756,
        -0.04510178044438362,
        0.09288565069437027,
        0.01956002041697502,
        0.05552573874592781,
        -0.021023958921432495,
        0.009238280355930328,
        0.06679996103048325,
        -0.07934897392988205,
        -0.09535238146781921,
        0.056130893528461456,
        -0.12526290118694305,
        -0.03906399756669998,
        0.03118351474404335,
        -0.03383365273475647,
        -0.0681704729795456,
        -0.11079259216785431,
        0.01951037161052227,
        0.06795769929885864,
        0.04672643914818764,
        0.049716439098119736,
        -0.024114307016134262,
        -0.010088733397424221,
        0.015004784800112247,
        -0.003241001395508647,
        -0.06178896501660347,
        -0.030964955687522888,
        0.06565171480178833
    ]
}