{
    "id": "7gan3O3PHx8",
    "title": "Is this what Millennials want? - Lenovo Thinkpad Z13 (2022)",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-10-26T18:53:58Z",
    "video_url": "https://www.youtube.com/watch?v=7gan3O3PHx8",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "lenovo",
        "thinkpad",
        "z13"
    ],
    "views": 1170435,
    "likes": 29207,
    "comments_count": 1424,
    "description": "Grab your new iFixit Fix Kit at   A killer webcam, decent speakers, solid specs, vegan leather? Does Lenovo have its pulse on the millennial market, or should they have spent more time solving some of this laptop's flaws?  Learn more about the Lenovo ThinkPad Z13:   Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 This laptop doesn't smell good 0:48 Look and feel impressions 1:48 Keyboard flex test and wrist rest feel 3:13 Sponsor - iFixit 3:37 Display and trackpad impressions 4:43 Specs 5:14 Keyboard impressions 6:31 Webcam 8:10 Speaker test and comparison 9:50 Gaming - Valheim 11:21 This keyboard gets HOT 12:39 Teardown 13:57 Overall thoughts and pricing 15:51 Outro",
    "description_links": [
        "https://www.iFixit.com/LTT",
        "https://lmg.gg/qOQ6o",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Companies sometimes do strange things when trying to appeal to millennials like this right here cause do you know what I really want on my laptop? (grunting) (metal clanking) Leather! Wow. Who would've ever thought. This is something that HP tried a little while ago and. (inhales deeply) God dammit, Lenovo, you (beep) it up already. Ah, so here's the problem, Lenovo's, new ThinkPad Z13 fold has leather on the back but it's actually leather that's made out of plastic bottles. HP's leather laptop had real cow on it. (cow moos) And it smelled fantastic. You took that thing out of the package and it was like you had an old baseball glove just sitting on your desk. You're like, oh wow mm, it smells really good. Unfortunately no cows died for this. Lenovo, what are you doing? (chuckles) Okay, but in all seriousness though this is a very good feeling laptop and also you don't have to get leather on the back. This has an option where it's just, you know normal laptop materials. Around the edge we have diamond cut edges, these look fantastic. Very fancy but in like a nice way. Also, IO is a bit lacking. So we have a USB-C on the side and USB-C on that side and we also have a 3.5 millimeter headphone jack. That's it. That's all you get for IO, both thunderbolt four. So that's actually not too bad. I don't really mind dongling around. I just chuck something in my backpack and call it a day but at the same time it would be really nice to have just like anything else, one more IO option, but how much power will it draw? Apparently 65 watts from this little type-C charger and props to Lenovo. You do have charging options on either side of the laptop. Oh yeah, here we go. This is an incredibly well-built machine. Like you can see some sort of flexing rate here if I really push on it. But this is the sort of like macro chassis flexing that is much more okay where like I'm pressing here the entire thing is yielding as opposed to like there being soft spots. So I am guessing that is going to be very good for the keyboard. We also have a nice large track pad and very little space up here. I really like to see that. Oh it's pretty borderline, pretty borderline. My hand barely fits on this and I wanna really look at this. Fortunately a little while ago I made a spreadsheet so I could tell Dell that their XPS 13 just didn't fit anyone's hands and they were dumb. Okay, so I just measured it. The palm rest length on this is 128 millimeters, which is between the Specter X360 and the XPS 13. This basically means that if you have larger hands you're gonna have a little bit of problem. Basically only 30% of males and 47% of females are going to be comfortable typing on this because otherwise your hand's gonna fall off the the back. Buy this if you have small hands. (laughing) - [Bell] That's it. - That's it. If got big hands, don't buy it. (laughing) Do you think that was worth it? - [Bell] No. - You know what Jake? I don't care. That's good information. Just like this information from our sponsor, iFixit. Thank you to iFixit for sponsoring today's video. iFixit wants to help you skip your next phone upgrade, save money by replacing your battery or fixing your screen using one of iFixit's fixed kits. Kits start at only 10.99 USD. You can compare camera lenses, screens, batteries and more. Their step-by-step guides are designed to help you along the way with photos and detailed instructions. Visit the links in the description to find a repair kit for your phone. Yeah, so 1920 by 1200p. So that means that this right here is the IPS touch screen. This is not the best display that is available on this. They do have a quad HD OLED touch model that I'm sure is just absolute eye candy and maybe it makes your spreadsheets look kind of weird so you probably want this one but until I've actually seen the OLED in person. I can't say for sure. What I can say for sure though is that the most tuning out of the box on this thing is atrocious. Okay, let's test this out. I think we're good. I lowered the sensitivity a little bit and turned off Windows enhanced pointer precision, stupid most acceleration crap. It seems pretty good now. Okay, okay I can get behind this. So what's nice about this track pad is you can change how much force is required to click it. How they do the clicks is instead of it like, you know clicking a switch, it measures the force of your finger and so I was able to go in here change the click force to low and I much prefer that to medium cause right now it just feels correct. Anyway, what are the specs of this machine? For the processor we have an AMD Ryzen 7 6850U, so that's eight cores, 16 threads. You also get 16 gigabytes. Oh 6,400 megahertz memory. That is some fast RAM. That also means there's absolutely no way that we can replace it because currently Sodimm tops out at 4,800 mega transfers per second. Anyway, moving on to the SSD. We have a 500 gigabyte model from Micron, Qualcomm Wi-Fi 6E, that's probably pretty good and of course AMD Radeon graphics. Everybody always talks about how to absolutely incredible ThinkPad keyboards are, they definitely were. Lately, depending on the model it can have a little bit of variance. (clicking) Okay, this is not what I was expecting at all from this keyboard. I normally think of ThinkPad keyboards as like the really long travel. It sort of feels like a big membrane keyboard but like somehow in a good way. This right here is different. This has not very much travel but like a really nice kind of soft feeling snap. Also in the keyboard we have the very famous track point right here. (cameras clicking) Now in the past I have been a huge fan of these not because of the track pointness of it but I haven't liked them because of what they did to the size of the track pad itself. So instead of having the two massive buttons up here that just take up all of your track pad space, we instead have just a couple little marks here. So it's super easy to know when you're in the right spot have a little click and you can track point around without sacrificing all of the usable space of your track pad. I really appreciate how they've done it this way. It's a really good sort of trade off between having a good track pad and having a good track point. Something that I don't think I've seen before. Lenovo made a big deal about their webcam and I say that because they actually laser engraved on the back. They have a full HD F1.2 and a digital mic array. How is it in practice? Hello, hello. This is me talking into the ThinkPad Z13 while also recording video at the same time. This looks pretty darn good. We do have some sort of weird graininess and blockiness but it really is not all that bad especially given how challenging this scene is. It is exposing for my face very well and at the same time like you can sort of see some detail in our sound editing up here. The blinds look like blinds instead of like either blown out or underexposed. Now of course we need to benchmark this against the XPS 15. So you can really appreciate just how good of a job Lenovo has done here. We just have to wait a second. My XPS 15 has to come out of hibernation and do you know why? Windows modern standby. It's complete (beep). Lenovo, you should really go and talk to Microsoft and tell them that it is unacceptable and they're losing customers to Apple because it is so ass. I have been complaining about it for so long. It's been what, like three years? Something like that. I'm gonna just get a MacBook, (beep) it. Okay so they're both doing not too bad of a job but the Lenovo is just clearly a better camera than the one on the Dell. Dell is more blown out and more underexposed at the same time. Yeah, good job Lenovo, you did it. This is me testing the sound on the Lenovo ThinkPad Z13 versus the Dell XPS 13. If Lenovo does not win this one, I will be very sad. Yep, easy Lenovo wins. Cool, good job. Lenovo claims that they have really good speakers on the Z13. They have a Dolby Atmos certification. Let's see how that does. (upbeat techno music) Okay, immediately this is very clear sound. If you're doing like voice calls, video calls this is going to be very good. Doesn't have the bass though. (upbeat techno music continues) Not bad, not bad. That is very respectable. Moving over. (upbeat techno music continues) Oh, God dammit, Dell. Stupid Waves max audio keeps on turning itself on and it just makes the whole thing sound like poo poo. (upbeat techno music) There we go. (upbeat techno music continues) So unsurprisingly the XPS 15 does have the better speakers once you disable the stupid Waves audio crap. But that is not unsurprising at all. This right here is the 15 inch laptop with big old speakers here and this right here is- Where the heck even are they? We have some down firing ones right there. Oh, I wonder if it sounds better without the mouse pad. Lets see. (wind whirling) (upbeat techno music) Ah, it didn't really help but that said, for a laptop of this size that doesn't even have up facing speakers. This has impressive sound. I would be totally happy with this. (computer bell) What? Restart required for this mouse that was just at- Yes windows, I'm sure I'm gonna do that. Okay, okay, it looks like we're all good now to have Logitech mouse. I was really concerned there for a second that like some of these business laptops will have brutal input latency on the display and it'll make gaming just a jelloey mess. Valheim! And the menu at 1200p I'm getting 30ish fps so I think we need to knock that down a bit. Oh wow. The keyboard's getting hot kind of fast and above the keyboard is legitimately going to burn you. So here we are at 1200p and we're getting about 40 fps, which is not great. This is low settings. It looks like ours but at the same time, it's doing it. I'm gonna just knock down the resolution, bring up the graphics a bit. I think we can. Okay, yeah, you can't even run medium settings at 720p or I guess this is 800p because it's 16 by 10 display. So instead we're just gonna run a full resolution at low. This keyboard is getting hot fast, like really, really fast. So yeah, it looks like our best bet is like 1200p, we're getting 40 fps on low. If we lower the resolution up the settings it's about the same but just a blurry mess. Oh okay. So the top spec 6860 Zed also has a 12 GPU count. So the performance is going to be about the same. I was hoping that they have a stronger APU model, not a thing. So if you are a gamer, probably sit this one out but also the performance isn't even what would make me sit this one out. I'm just gonna leave this here for a second. I'll be back. So we've been playing this for what? Like three minutes maybe and already around the keyboard we're seeing what like up to 50 degrees like up here we're at like 45 or so. The only thing that should be keeping you nice and hot is this beanie from lttstore.com. Your laptop should not be at 51 degrees especially after just three minutes. Not great. This is one of those things that Apple has done very well with their M1 and M2 chips is just keep your hands from getting literally burnt. I was really hoping that they'd have some sort of a good mode. So we have intelligent cooling which sure, okay so I've turned off intelligent cooling, we're in best performance mode. Yeah, we're still at 50 degrees. I really wish that they had like a cool mode. So for instance on the XPS here, I always just leave it in cool mode because if I sit down with it on my lap I want to like be able to have children in the future. I am really disappointed that they don't have like better cooling settings. HP and Dell both have really good like, do you want it quiet? Do you want it cool, do you want a high performance? There are trade offs between all of those but I like having the option to like pick which one I want. (plastic snapping) Okay, getting in there was super easy. So we just have a five Phillips head screws. All of them are captive so you can't even put them back in the wrong way and it just popped right off. So they have their like vapor chamber here and it goes all the way down here. But this like isn't even really touching anything. All right here it also says caution hot surface do not touch. They should have that on the other side as well. The only thing I would expect you to be able to upgrade on this is your wifi card and your SSD. Ah ha, there we go. So this is a strange SSD, so it's a 2450 so that's the 50 millimeter version which is not very standard. I think 80 is the standard or like if you have a small one it's 30. As for the rest, we have two fans here with incredibly high fin density and a nice big old vapor chamber for APU rate there. We also get, what is this? A 51.5 watt hour battery. So Lenovo claims that this will last for 18.3 hours but I think 18 and a half hours is pretty optimistic. But at the same time these AMD CPUs are very good at being power efficient. So you can probably get over 10 or so. Also, one thing that they have is fast charging for the battery so you can get 80% an hour, which is great. Now the last thing for this, is the price. I don't know it yet, but I'm guessing it is rather high. For one, we have this beautiful chassis that's made out of aluminum. We have the leather, (cow moos) Although who cares about that. But also we have Lenovo's business centric features. The biggest one for me is their BIOS. What do they call it? Smart BIOS. BIOS flashback, something something. Either way, your BIOS corrupts, you don't have to worry about it, it's gonna be just backed up on here and you'll be all good to go. All right, Jake hit me. How bad is it? Over two grand? - [Bell] Starts at $1,355. - Starts at $1,355. Not bad. Does that have a Ryzen five or a Ryzen three? - [Bell] So that has a Ryzen five. - Okay, Ryzen five for $1,300. That's not too bad, that's not too bad. What's this one? - [Bell] As specced, it is $1,705 - $1,705 as specced. Okay, that's like pretty in line with I guess like an XPS 13 or a Specter X360. Like that makes sense. It is definitely a laptop where you're paying for like this very beautiful finish around the edges and the incredibly well put together just everything about it. Oh wait, is there expandability? Look at this right there. You can put in another SSD. That is fantastic. Really good job, Lenovo. Actually, if you can just upgrade the storage that's something that you don't see on a lot of 13 inch devices. So the Lenovo Z13, it doesn't smell as good as the competition in the leather laptop space but also no cows died for it, so that's a plus I guess. If you're looking for a small 13 inch laptop that like you don't really care about performance, like it has eight cores it's gonna do spreadsheets and (beep) just fine. It's fantastically built. Keyboard, track pad, track point, screen, all incredible. So if you want like a 13 inch laptop that looks pretty cool in my opinion. I think it's a good buy. Oh and if you don't care that it's 1700 bucks, you can get something that's very similar for much less, but that always applies. Do you know what it also always applies? Have a good day. See ya.",
    "transcript_keywords": [
        "good",
        "Lenovo",
        "track",
        "track pad",
        "laptop",
        "XPS",
        "keyboard",
        "thing",
        "bad",
        "good job Lenovo",
        "Leather",
        "Dell",
        "pad",
        "pretty",
        "good track",
        "good job",
        "sort",
        "nice",
        "job Lenovo",
        "Ryzen"
    ],
    "transcript_entity_values": [
        "1,355",
        "Lenovo ThinkPad Z13",
        "1,705",
        "an hour",
        "15 inch",
        "M2",
        "65 watts",
        "Logitech",
        "6860 Zed",
        "My XPS",
        "800p",
        "10",
        "6,400 megahertz",
        "3.5 millimeter",
        "30",
        "about 40",
        "MacBook",
        "Dell",
        "today",
        "16 gigabytes",
        "Valheim",
        "Lenovo",
        "15",
        "HP",
        "47%",
        "1200p",
        "Micron",
        "18 and a half hours",
        "13 inch",
        "50 degrees",
        "50 millimeter",
        "M1",
        "2450",
        "AMD",
        "two",
        "mm",
        "GPU",
        "Ryzen",
        "XPS",
        "only 10.99 USD",
        "eight",
        "500 gigabyte",
        "SSD",
        "ThinkPad",
        "1700 bucks",
        "only 30%",
        "three minutes",
        "three years",
        "51.5 watt hour",
        "Jake",
        "1920",
        "XPS 13",
        "just three minutes",
        "one",
        "iFixit",
        "18.3 hours",
        "second",
        "1,300",
        "13",
        "Microsoft",
        "4,800",
        "AMD Radeon",
        "12",
        "Dolby Atmos",
        "jack",
        "five",
        "$1,705 - $",
        "Apple",
        "Phillips",
        "Sodimm",
        "IO",
        "Specter",
        "80%",
        "chuck",
        "40",
        "APU",
        "Qualcomm Wi-Fi 6E",
        "a second",
        "30ish",
        "IO",
        "128 millimeters",
        "51 degrees",
        "80",
        "16",
        "four"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "MONEY",
        "TIME",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "MONEY",
        "PERCENT",
        "TIME",
        "DATE",
        "TIME",
        "PERSON",
        "DATE",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "TIME",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.09193331003189087,
        -0.015919409692287445,
        0.01702466979622841,
        -0.09533073753118515,
        0.10400571674108505,
        -0.02432156540453434,
        -0.00969698466360569,
        0.035574838519096375,
        -0.05550762265920639,
        -0.04990192875266075,
        0.10018565505743027,
        0.019081048667430878,
        -0.0047067999839782715,
        -0.025409579277038574,
        0.06797982007265091,
        -0.015070107765495777,
        0.06568299233913422,
        -0.11706162989139557,
        -0.009754420258104801,
        -0.041768550872802734,
        -0.08014652878046036,
        0.045640330761671066,
        0.09367252141237259,
        0.019549911841750145,
        0.0028131946455687284,
        -0.023623604327440262,
        0.023888511583209038,
        -0.07055040448904037,
        -0.05067139118909836,
        0.06629590690135956,
        -0.01761055365204811,
        0.14623002707958221,
        -0.01076052337884903,
        -0.009799611754715443,
        -0.001975608989596367,
        0.001406581257469952,
        0.023970728740096092,
        -0.049642033874988556,
        -0.016529962420463562,
        -0.1397676169872284,
        -0.06169174611568451,
        -0.10055465251207352,
        0.038143523037433624,
        -0.012823635712265968,
        0.08700630813837051,
        -0.06982768326997757,
        0.033412396907806396,
        -0.051266320049762726,
        0.014333724044263363,
        0.007077910006046295,
        -0.0638980120420456,
        -0.049624163657426834,
        0.06642045080661774,
        -0.07154498994350433,
        -0.06349702179431915,
        -0.0202239491045475,
        0.011866716668009758,
        0.027734223753213882,
        0.022650420665740967,
        -0.01819983683526516,
        0.028997370973229408,
        -0.08665847033262253,
        -0.051834866404533386,
        0.05551385134458542,
        0.027669548988342285,
        -0.06412540376186371,
        0.005548412911593914,
        0.025363262742757797,
        -0.016266129910945892,
        0.022185243666172028,
        -0.021696701645851135,
        0.04540165513753891,
        0.03434537351131439,
        0.06590551137924194,
        -0.10127099603414536,
        -0.04324331134557724,
        0.067051462829113,
        -0.026241807267069817,
        0.03441125154495239,
        0.030079390853643417,
        0.03446443751454353,
        -0.022957440465688705,
        0.04203428700566292,
        -0.01142824999988079,
        0.017391780391335487,
        -0.026001350954174995,
        0.03075377084314823,
        -0.023855959996581078,
        -0.051521554589271545,
        -0.055469028651714325,
        -0.03927826136350632,
        0.0697021633386612,
        0.05114775896072388,
        0.041852641850709915,
        -0.03781965374946594,
        -0.015602176077663898,
        -0.0018444366287440062,
        -0.04364142194390297,
        -0.05274670571088791,
        0.08286573737859726,
        0.036422282457351685,
        0.041153308004140854,
        0.05739806592464447,
        -0.049550577998161316,
        -0.0797877237200737,
        -0.04221845045685768,
        0.041331805288791656,
        0.0866146832704544,
        0.011104165576398373,
        0.0484052374958992,
        -0.08436525613069534,
        -0.028698137030005455,
        -0.05845646932721138,
        -0.021958956494927406,
        -0.005567876622080803,
        -0.01577751711010933,
        -0.01752733252942562,
        0.02342066913843155,
        0.0755653902888298,
        0.0331185907125473,
        -0.024991702288389206,
        0.026330551132559776,
        -0.008493144065141678,
        -0.0028934201691299677,
        0.024406475946307182,
        0.017881354317069054,
        -0.08776441216468811,
        -1.864467201873577e-33,
        -0.018053295090794563,
        0.08399742841720581,
        -0.054208800196647644,
        0.000170586456079036,
        0.0385889858007431,
        0.06971845775842667,
        -0.021211223676800728,
        0.023391978815197945,
        -0.020084775984287262,
        -0.032872866839170456,
        -0.02960318699479103,
        -0.01496979407966137,
        -0.07250593602657318,
        0.04758399724960327,
        0.0497271902859211,
        -0.07974652200937271,
        -0.11308009922504425,
        0.008340967819094658,
        -0.028887229040265083,
        -0.01613062247633934,
        0.0030762571841478348,
        -0.02422744780778885,
        -0.0030316412448883057,
        -0.06389258056879044,
        0.007794829085469246,
        0.012350735254585743,
        0.03761422634124756,
        0.002048190450295806,
        -0.020008552819490433,
        0.06093441694974899,
        -0.018634453415870667,
        -0.055249541997909546,
        -0.05777071416378021,
        -0.1321239173412323,
        -0.06674598157405853,
        -0.015584356151521206,
        -0.03694848716259003,
        -0.07825961709022522,
        0.08411811292171478,
        -0.04771527647972107,
        -0.0851658508181572,
        0.0603785514831543,
        -0.08223854005336761,
        -0.01765180379152298,
        0.05818996950984001,
        0.10284191370010376,
        0.1702549159526825,
        0.05438609421253204,
        -0.03158121183514595,
        -0.02109011635184288,
        -0.07446753978729248,
        0.007048893719911575,
        -0.05438355356454849,
        -0.0602053627371788,
        -0.03760051354765892,
        -0.08273966610431671,
        -0.012692034244537354,
        0.010120591148734093,
        0.061321407556533813,
        -0.00690333591774106,
        0.03795811906456947,
        0.013747929595410824,
        0.01357163768261671,
        -0.01077054813504219,
        -0.0872776210308075,
        0.08553814888000488,
        0.0947122797369957,
        0.012569455429911613,
        -0.049008991569280624,
        0.0367516428232193,
        0.046684492379426956,
        -0.10913895815610886,
        0.009637083858251572,
        -0.024758346378803253,
        -0.03604299947619438,
        0.03351662680506706,
        -0.016139566898345947,
        -0.04131579399108887,
        0.01908542402088642,
        -0.008552140556275845,
        -0.002970576286315918,
        0.012259415350854397,
        0.051377393305301666,
        -0.011482142843306065,
        0.026100093498826027,
        0.030636802315711975,
        0.010808884166181087,
        -0.03704087436199188,
        -0.017702417448163033,
        0.038031913340091705,
        -0.011662364937365055,
        -0.05231478810310364,
        -0.015220768749713898,
        0.0027040450368076563,
        -0.020241184160113335,
        -2.1469834937692902e-33,
        -0.04470197111368179,
        0.08853238821029663,
        -0.03775849565863609,
        -0.004663246683776379,
        0.003046078374609351,
        -0.0753624439239502,
        -0.0025747681502252817,
        0.01645388826727867,
        0.05761049687862396,
        -0.030202092602849007,
        -0.01180848479270935,
        0.010912003926932812,
        -0.07963778078556061,
        0.010266335681080818,
        -0.01702794060111046,
        -0.023094508796930313,
        0.012545845471322536,
        -0.1146835908293724,
        -0.02509709633886814,
        -0.028309280052781105,
        0.017582537606358528,
        0.05403260514140129,
        -0.05762120336294174,
        0.08159628510475159,
        -0.002783956006169319,
        0.048511162400245667,
        0.01631902903318405,
        0.018383992835879326,
        -0.022503694519400597,
        0.02437620982527733,
        -0.021952008828520775,
        -0.07854874432086945,
        0.04010995477437973,
        0.008272899314761162,
        0.1300559788942337,
        -0.01083443034440279,
        0.01574491523206234,
        -0.00932804774492979,
        -0.047879237681627274,
        0.024745486676692963,
        0.08634448051452637,
        -0.03519915044307709,
        -0.07484635710716248,
        -0.002226086799055338,
        -0.038530945777893066,
        -0.046514444053173065,
        -0.05282055214047432,
        -0.019825920462608337,
        0.04371737688779831,
        -0.0391436368227005,
        0.005257801618427038,
        0.03678401559591293,
        0.07782464474439621,
        0.006276437547057867,
        -0.07358580082654953,
        -0.0005252027767710388,
        -0.01841459795832634,
        0.03205803409218788,
        -0.03518041968345642,
        0.012497877702116966,
        -0.01968323439359665,
        -0.024596519768238068,
        0.008619575761258602,
        -0.045723214745521545,
        0.029781164601445198,
        -0.06980971246957779,
        0.09246310591697693,
        0.07103489339351654,
        -0.0007817874429747462,
        -0.01862717606127262,
        0.04668443277478218,
        -0.11324892193078995,
        -0.04218766465783119,
        -0.08583300560712814,
        -0.0669693723320961,
        0.06930972635746002,
        0.044767625629901886,
        -0.046205297112464905,
        -0.026404686272144318,
        -0.0606251135468483,
        0.0049842544831335545,
        -0.00740893604233861,
        0.028348242864012718,
        -0.009468830190598965,
        0.07995402812957764,
        -0.05782643333077431,
        -0.0034901245962828398,
        -0.02573198638856411,
        -0.09508605301380157,
        0.03880391642451286,
        -0.01852165162563324,
        0.0011603470193222165,
        -0.04905501753091812,
        0.08500628918409348,
        -0.027895979583263397,
        -5.5713300639581576e-08,
        0.017754342406988144,
        -0.03167392313480377,
        0.09197848290205002,
        0.08921701461076736,
        -0.00047229265328496695,
        0.004137243609875441,
        -0.0062080370262265205,
        0.02854973077774048,
        0.07511625438928604,
        0.07122411578893661,
        -0.01259674783796072,
        -0.06464703381061554,
        -0.01824309304356575,
        0.05916931480169296,
        0.022945260629057884,
        0.06482144445180893,
        -0.08123496919870377,
        0.06247534230351448,
        -0.07056824862957001,
        -0.05549323558807373,
        0.03941342979669571,
        0.013933571986854076,
        0.08551213145256042,
        -0.05864284932613373,
        -0.031528718769550323,
        0.01864859089255333,
        -0.032485876232385635,
        0.026670202612876892,
        0.0861443281173706,
        -0.02997097186744213,
        -0.12817014753818512,
        -0.02616206742823124,
        -0.00951925478875637,
        0.027538927271962166,
        -0.000433607172453776,
        -0.062258031219244,
        -0.04519021511077881,
        0.03243669122457504,
        -0.003495578421279788,
        0.008384338580071926,
        -0.017445318400859833,
        -0.01932826079428196,
        0.030335674062371254,
        0.025104422122240067,
        0.002078848658129573,
        -0.021453866735100746,
        -0.003364366479218006,
        -0.0152182187885046,
        0.00930868275463581,
        0.09352566301822662,
        -0.04597402364015579,
        0.0015925541520118713,
        0.05911823362112045,
        0.07221153378486633,
        0.05907893925905228,
        0.009187527932226658,
        -0.032000742852687836,
        0.07826033979654312,
        -0.008810250088572502,
        0.11537279933691025,
        0.07101588696241379,
        -0.07936906814575195,
        -0.015268874354660511,
        0.057703979313373566
    ]
}