{
    "id": "7iuUVPSSMpI",
    "title": "The next next thing in AI and AR | The Vergecast",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-06-21T13:09:52Z",
    "video_url": "https://www.youtube.com/watch?v=7iuUVPSSMpI",
    "category": "Science & Technology",
    "tags": [
        "gadgets",
        "tech gadgets",
        "technology",
        "verge",
        "the verge",
        "tech",
        "tech news"
    ],
    "views": 27136,
    "likes": 536,
    "comments_count": 67,
    "description": "The Verge's Nilay Patel, Alex Cranz, and Alex Heath discuss Apple's Vision Pro team reportedly refocusing on a cheaper headset, Meta launching a new \"Wearables\" organization, a new AI company startup from former OpenAI chief scientist, and a whole lot more tech news.  Further reading:  00:00 - Intro 01:08 - The AI PC era begins 14:29 - Apple's smart home update 19:19  - \"Next Generation\" CarPlay 29:52 - Universal remotes are back? 33:37 - Framework's RISC V Laptop 37:04 - Meta's AR and VR Developments 52:03 - Apple's Vision Pro and VR Shift 53:35 - Ilya's New AI Venture: Safe Superintelligence 01:03:29 - Perplexity's Shady Practices 01:19:55 - NVIDIA's Market Dominance 01:25:42 - Adobe's Subscription Pricing Lawsuit 01:30:44 - Techies Hiring Fashion Consultants  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Tuesday and Friday:   If you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz",
        "https://www.theverge.com/ethics-state..."
    ],
    "transcript": "(bright music) - Hello and welcome to \"Vergecast\", the flagship podcast of the RM architecture. That'd be great. And then if anyone knows of a rival podcast that is a flagship podcast of like \"RISC-V\" let, I would love to know who they are so we can start a fake beef. - But only \"RISC-V\". - Right, no one wants an X86 podcast. - Yeah, no. Yeah. No one wants that. We only want the cool weird ones. (Nilay laughing) - If anyone knows of the flagship podcast of the X86, we will send them a gift basket. I mean they're, you know, someone ought to be nice to them. Hi, I'm your friend Nilay. Alex Cranz is here. - Hi. - Alex Heath is here, not David Pierce. Hi Alex. - Hi. I am not David wah, wah, but but happy to be here. - David is off this week, but we've got Alex, which is gonna be great. There's a lot of AI news. There's a bunch of VR news including some scoops out of Meta in the Reality Labs division that Alex is here to talk about and have some insight into. But we should start with like the news, which is a weird bit of news in that half of the news got delayed. Weird. Microsoft's Copilot+ PCs are now shipping. They have Qualcomm Snapdragon X chips inside them. This is the beginning of what might be the end of the Intel dominance, the X86 dominance for Windows machines. But Microsoft had to delay recall, which was the flagship feature of the Copilot+ PC because of horrible security concerns. Just a weird moment, Cranz, right, like. - Yeah, this. - A weird stutter. Even the review units like didn't arrive on time 'cause they were disabling recall. - Yeah like this is wild. We were expecting to get these a week ago to start kind of reviewing them before the embargo list and we got them the day of the embargo. Like Tom's got both the Elite and the Plus and is checking those out and a whole bunch of other people on the team all have them and are just, we are all in this one room just furiously benchmarking, constantly work. They're having a lot of fun doing it. But we've still got a lot of work to do. So far, we figured out that some stuff is working, some stuff isn't. There's still a lot of weird like emulation bugs and stuff. I think Adobe Premier was having a weird issue where it would work with the elite processor but not necessarily with the plus processor. Some games crashing. Some of this might be like alleviated with more updates from everybody. But what was supposed to be this big monumental moment for Microsoft and Qualcomm and everybody instead was like, we did it. - Yeah, here it is. We turned off half of it. Even in Best Buy, there's like signs that say recall coming later on the demo units. (Cranz laughing) So if you don't know if you, we weren't listening to show in the previous weeks, Microsoft announced these PCs and the flagship feature was recall, which even if it was working in a totally secure way is weird. The computer watches everything you do on the computer like Windows watches, everything you do, takes screenshots of it uses a local generative AI model to understand what's in those screenshots. And then you can just be like, what, there was a website I thought I liked. Did you remember what it and the computer will tell you? Or I was working on this document, do you remember what it was? No, you can talk to the computer about what you've done with it. Which some people David Pierce very excited about because David would like to be friends with the computer. That's my understanding of personality. - Just friends. - Just just friends. David is happily married and has a child. Other people would like to be more than friends with the computer. As we have learned time and time again as the AI industry has dominated the headlines. (Cranz laughing) Microsoft was storing the screenshots in basically plain text. So there's just like open database of everything you've done on your computer, on your computer, huge security hole. Microsoft has had a history of security problems recently. Nadella sent out a memo to everyone being like, if you have to choose between shipping fast and security, I want you to pick security. And then they announced recall and everyone's like, this is a huge security fault and they just delayed it. So they thought they could fix it in time. They issued a blog post about fixing it in time and then they'd realized they couldn't and they delayed it. Cranz, does that feel like, I feel like that's only half of the story here, right? That's just the background. That's part of the stutter step and part of why it's not as flashy a launch like recall is a great feature for what I think of as like the local news, right? Like. - Yeah. - This is a great demo for the local news and that is how you get a lot of mainstream attention on new things. But the real thing here on all of these Snapdragon PCs is performance and battery life where they have not been competitive with M series chips on MacBooks for a long time and now they think they are. - Yeah. Yeah. That is absolutely the big moment here. And like the other part was gonna be really cool and that was gonna be what Pete got people really excited to maybe upgrade. But for the rest of us it's okay. Is this finally the moment where Arm on Windows works? Because we've seen it so many times before and every time it has fallen super short of the mark and this time like from the early benchmarks, battery life looking pretty good, batteries in that like that M chip range we're still testing so I don't wanna say which M chip, but it's in that like M chip range, the speed is looking pretty good. Gaming is like possible. (Nilay laughing) We've still got some work to do there to figure it out, but it's a surprise. It definitely doesn't seem like this is gonna be a moment where just Qualcomm blows everybody away. Kind of like how Apple did with the M1 chip where we were like, holy crap, Apple actually did it, doesn't seem like we're gonna have that moment, but it's still kind of too early to tell. - Well it's interesting 'cause Apple hasn't even had the incremental moments after M1. - Yeah. - Like, the M2 to M1. It's faster, but it wasn't the big step from Intel to Arm, right? M3 to M2 was faster, but it wasn't the same kind of revelatory experience. So Qualcomm's coming into just a very different set of expectations. - Yeah. - Right, like if you can match the M1 you've done great, that's a big step forward over Intel. If you can beat the M3 or the M2, it's the same incremental progress as everyone else has made. - Yeah, I think that's kind of normal. We sometimes expect everybody to just blow each other out of the water, but these like Windows is hugely complicated to run. It is not an easy thing to run. There's so many like dependencies, code for old code that it has to work through and stuff. And then a lot of times that stuff isn't built for Arm and so they're having to do all this emulation more so than like a Mac would because a Mac just, it's all built from Apple and so not all of it, but most of it's built by Apple for Apple and it can kind of run and knows what to do. That big like translation moment hasn't quite happened for Windows machines. - They've been trying for a long time. - They've been trying and nobody's wanted to do it because it's like, well, nobody makes good Arm chips, so why should I build my programs for Arm? And now it's like this could change that this could change that. But it is so, so early to tell. - Yeah, I get the chip story underneath this, but does Microsoft actually think that anyone is gonna switch from Mac to Windows because of this AI stuff? - No. - 'Cause I look at this and it's like, you basically need to tell me that I'd never have to actually understand or know how to use Windows to actually switch to Windows. That's how I feel about Windows. Like an AI needs to, (Nilay laughing) it needs to be so dramatically different from what I expect from a laptop as a lifelong Mac Apple lock-in blue bubble guy. (Cranz laughing) (Nilay laughing) and like this recall thing sounds cool but it's like I you would literally have to say AI is running your laptop for you for me to consider switching. - Yeah. - Because of the software locking. - This is a pressure dressing, right? Like this is just for them to be like, no, we can't lose any more Windows people to Chrome or Mac's. Like we have to keep 'em here with cool features. Like that's pretty, it's not like let's entice these people back. It's please don't leave. - Yeah. - Help. - Well no actually I wonder about that. You know, I. - Or at least that's how I feel about it. - I've heard a lot of CEOs, Alex I'm sure you have to describe AI as a platform shift. - Mm hmm. - And I'm always like from what to where. (Alex laughing) Like what platform are you talking about and what they want, what they're trying to invoke is mobile. - Mm hmm. - Right, this is a platform shift on the order of mobile. We went from laptops to smartphones and not smartphones dominate computing and what they're trying to say is this is another platform shift on that scale. And it's like, is it like where like you still have to have a phone to use the chatbot. Like is it that, and I think part of this window stuff for Microsoft is very much, okay we own this entire stack. We have giant investment in OpenAI, we've built copilot, we have all these ideas about what a computer can be. Like here's a new way to use a computer that is meaningfully different than before. Also you have to pre-install Edge or whatever. Like we also, we'll push you towards our browser. I don't know that Apple has different ideas. We talked about it in the show after WWC, like Apple's ideas for what AI can do in its operating system are basically the same as Microsoft's ideas. So the idea that it's a platform shift I think is under some pressure. But I know that's how these companies think about it. That this will entice you to switch platforms. - But it's just features right now. It's like I still have to look at the Windows nav bar and figure that thing out, right? And it's like I'm just not gonna do that. (Cranz laughing) I'm sorry Tom Warren. Like I'm just not, so yes, I think they think of it that way. But it shows, I think this recall thing shows where the real platforms are and it's like building two decades of software lock-in on top of hardware, which is not AI, right? AI is software that you're putting on existing hardware, at least right now. - Yeah. And I'm curious, you know, people are listening if you have an idea of where this platform shift is, I'm dying to know what people think, but it is what it is, what Nadella has told me, it's what Sundar Pichai has told me. Like down the line the CEOs of the biggest companies are like, this is a platform shift we cannot get left behind. Like in particular with Microsoft, there's like a fear that they got left behind in mobile and they can't get left behind this time. And so you see them kind of, I mean they have been ahead of the curve at every single step. - You didn't hear Elon say it's gonna be trillions of dollars worth of optimist robots, that's the platform shift. (Nilay and Cranz laughing) - I mean that's the true platform shift is kicking back with a brewski and letting optimist do all your computing for you. - Yeah. - It'd be great if AI express itself not as AI integrated into operating system, but you have an optimist robot that knows how to use Windows. (Cranz laughing) And that's actually what happens. - I love that. - That would be Alex Heath. - Yeah. - And then like Tom Warren would get the one that knows how to use Macs. Yeah. (Nilay laughing) - And Eli, you joke about how, you know, you would love to not have to use software at work. You know, you just have an optimist use your software for you. - Yeah, I need a fully complete optimist robot that can use Okta and if you can just get me there. I'll do it. If Optimist can file my expenses, oh my god. (Cranz laughing) (Nilay laughing) - Those codes, they suck. - The CEOs of these companies will not come on decoder where I will just ask them to look at their own software. (Alex laughing) We'll see, we are gonna test them out. I will say that I have a running list of my favorite Slack rooms at the company and it's the ones where people have developed their own language. So my number one favorite is we have a support room for our finance team where people just file tickets. And some people have discovered and well some people come in there and they ask very nice questions like hello, I need help with da da da. And some people have discovered that this room is staffed by a bot that just files tickets and they just yell nouns. (Cranz laughing) They're just like invoice 245. Like that's all. They're just, and the other people are very polite and it's the greatest room in the entire company 'cause people have realized they can just yell at a robot. The other one is the Verge benchmarks room where it's just people communicating and increasingly arcane benchmarks. - Yep. - And they've developed their own language about windows on Arm benchmarks (Nilay laughing) and they're not using the normal rule. Like no LLM can figure out what's going on in this room. Statistically this language has never existed before. It's very good. I'm excited for it. They're gonna come, we're gonna have all the reviews. I think David is gonna do a full show with Tom and Nathan, our reviews editor just running down all this stuff on Tuesday I believe, right Alex? - Yeah. - Okay, so we'll come back around with that stuff. Qualcomm has made a lot of promises here, right? They bought that company Nuvia, which was a bunch of ex Apple engineers on the chip team who were making server chips and they said no make a consumer chip and sets, 'cause Apple didn't want to use its Arm architecture to make server chips. And they thought there was this big opportunity there but then Qualcomm bought them and said no, make the next generation of Snapdragon. So it shifted them, I dunno if you know there's some backstory here. Arm decided that Qualcomm's license didn't cover this. And so Arm is suing Qualcomm right now and Qualcomm's suing Arm back over these chips, which is bananas. It's gonna come to some resolution. There's no way this actually like ends up in anything but payments. But these chips are like very, very controversial in their way because it's a bunch of ex Apple designers who left and started a company and Qualcomm snapped them up to go compete with Apple's consumer chips. Can they deliver is a big question. I'm excited to see our reviews and see if that's true. - Same. - Also this lawsuit is just the funniest lawsuit in the world. - It's a good lawsuit. - Like if you're Arm you're like screw it, I'll sue Qualcomm. - I feel like Qualcomm gets sued a lot. - They do. - Like every time you turn around somebody's like, no, I hate you, Broadcom's like I'm suing you, Apples like I'm suing. - Yeah. - Yeah. - This company is under fire and by the way we talk a lot about 5G on the show. The level of interest in 6G is at least partially driven by people wanting to get away from Qualcomm's 5G patents. (Cranz laughing) Like what if there wasn't a dominant player in wireless that we could get away from? And so there's already talk about 6G just to get away from Qualcomm. Like Apple bought all of Intel's modem division and they still haven't produced a radio that can compete with Qualcomm in its patents. Get ready for the 6G hypes. That's all I'm saying is. People love suing this company and that's gonna drive the 6G hype cycle. (Cranz laughing) Some other stuff we should talk about. This is kind of like a like a gadget rapid fire round. - Yeah. - Is that what you wanna call it? It's not quite a linear around. We've learned some new stuff outta WWC about various Apple products. Jen had a pretty good scoop. Apple is extending home kit to use the ultra wideband ship in its phones to automatically unlock doors, which is cool. So a combination of ultra wideband Bluetooth low energy. It can sense when you are six feet away from your door on the outside and walking towards it and automatically unlock the door, - Which is just sick. If it works. (Nilay laughing) But if you have a smart door lock, you need a new door lock to enable this. - Yeah. None of them work with it. - This is, it's a lot. Alex is, he's making a face? (Cranz laughing) I got two Alex's now, this is last names. - Yeah, last name only. This reminds me of the digital ID, the driver's license thing. Like it just seems like a bad idea. Like I get that it sounds cool like you're in a product meeting and Cupertino and it's like oh we should digitize this but I don't really want my device automatically unlocking my house. - Yeah. - Yeah. - Yeah. - Well so the argument I felt this way about the feature where you can just point your phone at a door lock and it unlocks, like in express mode. But same way that if you use mass transit you can just like beep your phone at a turnstile on the subway and it just pays and like whatever. And I was like, I don't know, I definitely wanna authenticate before. And I was like, no, if you steal my house key you're in my house. Like the level of security is the same. And I think one good question is like whether that is an acceptable level of security. - Mm hmm. - Like it is I guess is the answer. Like if you have my phone, should you be able to get in my house? It's like a good question everyone should ask and then you can adjust that setting however you want. - Mm hmm. - If you have my phone, you're six feet away from my house and you're walking towards it, should the house automatically walk because like- - It's like you heard it. - A different question. Like that's a new. - I would like this feature if you could set it to where if face ID hadn't been used in say an hour or two hours, then it doesn't work. - Yeah. - But something like that, something where like the recency of me unlocking the device means that it's definitely in my hand. You know? - All right. - Yeah. - Or your phone has been stolen and another iPhone detects you shrieking into this void (Alex laughing) and your house locks down (Cranz laughing) like the bizarre use of the Find My network. It's interesting 'cause Apple has put a lot of chips and a lot of radios and a lot of things recently and hasn't really done a lot with them. So these ultra wideband chips have been in a lot of Apple devices for quite a while now and some of the uses are cool, right? Like Find My is a little bit more precise. If you have the right selection of ultra wideband devices, you can like point your phone at a home pod and send the music to it. Which is, you know, supposedly like magic. - It works half the time. (Nilay laughing) - I said supposedly like magic. Like if you were a shit magician. - Yeah. (Cranz laughing) - It works about that. - If I did magic that would be my magic trick, like look. - Yeah, you know those people are like I'm floating and they're really just like standing on their tiptoes. - That's me. That's what I'm saying. - But if you were always doing that, it's sort of the wrong angle and someone's like you're just standing on your tiptoes. (Cranz laughing) That's about how well the home pod thing works. Then they added thread radius gen, that was the other gen scoop from a couple weeks ago. Like now they're adding other radios to these devices. You see that they're like okay wifi and Bluetooth can't do all the things we want to do. They can't do it at the power level, at the location, precision level, whatever it is they just can't do it. So we need to add more radius to this thing. And then you see the animations from the new Siri and you're like oh they are super getting ready to take all the ports and buttons for these songs. - Oh yeah. - Like stop you're willing it into existence. - There's 45 different radios for every level of like precision location and power that you can think of. None of them aren't able to do much and then the buttons are gonna be capacitive very soon. - The arc of phones is that they just become panes of glass that then start to curve that we then put in front of our eyes like that is, (Cranz and Nilay laughing) the next 10 years of technology. - I wanna come back, I wanna come back to that when we talk about Meta and the Vision pro to some extent. So that's the UWB chip. We're seeing Apple start to use it in more interesting ways, especially around the home. I'm very curious if they ever acknowledge these thread radios. We were kind hoping they would at WWC. But it's interesting that there's a bunch of thread radios in these devices. You could do all kinds of things within a smart home 'cause it used basically no power compared to everything else. And then the other thing we found out, which is really interesting speaking of Apple and wireless, is that the next generation of CarPlay that no one has shipped yet, will only be wireless. Which is fascinating. So you know I'm obviously obsessed with CarPlay car COs are always on the decoder. I'm always asking, they're gonna use it. They're always like meh, we'll see. So as you just to set, just to reset everyone's like understanding of CarPlay 'cause it's very confusing right now. There's the CarPlay you have right now, which is basically just like a second monitor for your phone. That's very much what's going on. So you plug into your car, even a wireless CarPlay your phone sends out another video stream and receives touch input from your car and you've got a second monitor for a phone. And if you think about it, almost everything that's happening on that screen is just phone stuff, right? It's music, it's maps, but it's all just running on your phone and showing up on this display. Not a lot of car stuff over there. Apple has lightly extended this to be able to send a map to some instrument clusters so they can send multiple video streams out from a phone. But it's still phone stuff. Like everything's local on the phone without any understanding of the data from the car. The next generation of CarPlay, which they showed two years ago, I didn't even realize this was two years ago. I thought this was last year, two years ago, WWC 2022, they showed that mockup of like a giant screen and another screen. - Oh I remember. - And it's all CarPlay and there was like 45 clocks on it. 'Cause no one looks what to do with- - It looked sick. - All that screen, the weather in 10 different cities, which you definitely need when you're driving. And they're like, this is the next generation of CarPlay. And then they showed a bunch of car maker logos. Do you remember this? They showed a bunch of car maker logos and all those car makers like what? (Cranz laughing) That was basically what happened. Porsche and Aston Martin announced last year they would ship cars this year. Haven't heard a word about those cars. No idea when they're coming out. And that's it. So Apple had sessions at this year's WWC and I ran around and talked to a bunch of people there just about CarPlay and what's going on. And I can't tell if this is a change in strategy, if this has always been the approach or if this is just Apple softening its language. But Apple's basically saying to car makers, look people have iPhones, they love CarPlay. What if you use our design toolkit to redesign all of the stuff in your car. So it all looked really good together and then you needed an iPhone. - Is it the context here that Apple just abandoned Project Titan? So if they're not doing a fully integrated vehicle, wouldn't it make sense for them to make this more of an open, this to me is like them going the route of Apple TV plus and Airplay realizing that we are not gonna make a TV and so therefore we want TV plus everywhere. Is that not a fair analogy here? - I can't necessarily tell how much Titan played into it, right? Like this is what I'm saying. I can't tell if this was always the approach and now they're just softening the language. Like the technical approach is that you have an iPhone, you connect to CarPlay, your iPhone will go download a bunch of Apple car maker co-branded assets. Like in the videos they have posted, they refer to this as a co-branded experience. When have you ever heard Apple describe anything as a co-branded experience? That's bananas. - When. - Red. - Red, sure, Project Red. - Windows on the Mac, (Cranz laughing) like at the very beginning - That wasn't co-branded. So like there's some element of Apple designers and car maker designers like working together to design speedometers for CarPlay cars. - Huh? - Weird. And like in the, this is public, I'm not, this isn't like some- - I mean. - Deep dark reporting. This is me saying you can go watch the videos. They're public and they're calling it a co-branded experience where we're gonna work together to express your car maker brand identity inside of the Apple Design toolkit. - Weird. - It makes sense in that all the cars UIs are terrible. - It does. So the idea is you have an iPhone and you get this like upgrade to your car UI. So everything looks like CarPlay. - Yeah. - Weird. How is Apple gonna make any money doing this? - No, it this. - First of all. - I think that's like a, I mean for a super wealthy company like this, this is just like really good branding, right? - I think it's about. - You can go and- - I mean. - I mean you can show your dominance in design and show these companies kind of like how you use this. - So the specific way they're gonna show their dominance in design. It's actually my favorite part of this whole thing. - Okay. - The only font you're allowed to use in next generation CarPlay is Apple San Francisco. You can change how wide it is. (Cranz laughing) You can change how stretch it is. You can italicize it, you can make it really thin. You know, like, and they're like, look at all these different things you can do with this spot. It's a variable typeface. And it's like, yeah but it's only one like Porsche and GM don't get to use different fonts. - Comic sands. - Get right. Like that's weird. Like so there's an element of control where they're just, they're doing a very Apple thing. And then there's an element of complete chaos, which I think is really fascinating, which they have not talked about at all. Which is they will, when you have like the next generation CarPlay interface up and you're like, I want to control my massaging seats and my Aston Martin, you can push the button that says control the Apple San Francisco labeled button and instead of showing you the next nice CarPlay thing, it'll do a thing called punching through the automaker UI and it'll just show you whatever garbage Aston Martin. - No, never mind. (indistinct) Nevermind, I take it all back. - And it's like, this is crazy. - I can't. - That's horrible. - This is the concession to make it all okay. - I can't. - Because what car makers have been worried about is they have to build everything three times. They have to build their own native one. 'Cause you need to have something you need to operate the entire car without a phone, right? A non-negotiable. If you buy a car then you need the next generation CarPlay version of everything and then presumably Google will do something for Android, right? So what are you gonna do? And they don't wanna build things three times. So Apple solution is like, well build it once and then, you know, for some stuff we'll just let you show them weird stuff. (Alex laughing) - I can't wait for Siri powered by ChatGPT in my car to just like open the doors like while I'm driving when I request the massage seat to turn on and it just hallucinates and you know. - It just like freaking completely. - Just goes in reverse. - Just ejects you. - And then to bring this around, Apple wants this to only work wirelessly because their goal is that CarPlay will be connected, active in operating the interface of your car by the time you open the door. And if not, by the time you open the door, by the time the screen's light up, right? So you get in the car, you sit down, the screen's light up, it's CarPlay, it should not be, you sit down in your car, turn it on and then like you have some like loading process. And so you can only accomplish that over wireless. So CarPlay is only gonna be wireless for whatever car makers adopt the next generation of CarPlay. - I'm hesitant to say this because I am very against this move. But isn't that also just a precursor to them removing all the ports? They're like, it's gotta be wireless because we're gonna. - It's not, not a precursor to the (indistinct). (Nilay and Cranz laughing) And it's funny because to make this work, Apple also has to give up some control of what runs where, right? You don't want your speedometer running on the phone. So your Apple designed speedometer or delightful co-branded experience to be more accurate needs to run locally on the car. So this is the first time I can think of that any Apple assets are gonna get loaded onto somebody else's computer system in that way. Outside of, to your point Heath, the Apple TV plus app on like Roku, right? Which is where Apple ships and app and this is the split is kinda the same. It's like okay we're gonna give you an asset package of Apple things to run locally on the car for things that we cannot risk if there's a disconnect. The speedometer, the turn signals, da da da da, right? And there's some differentiation in how that stuff works. Like the truly critical stuff cannot be touched. They call that the overlay layer. That's your turn signals and hazard indicators, the speedometer and stuff like the needles that's those assets can get refreshed over time. So those run in a different layer called local UI and then there's everything that runs on the phone and then in the middle there's like, I don't know, you wanna like mess with your sports settings in your fast car. Like that'll just be the weird auto maker UI shining through a CarPlay and it's like, oh this kind of feels like a mess, right? It's unclear who will take this and who will use all of CarPlay like redesign the entire car to be CarPlay to be Apple. And who will say okay, we took next generation CarPlay, we fun, cool new speedometer. Every other part of the car controls will be the existing UI. 'Cause we can punch through CarPlay. And honestly based on the feedback we get on the show, it's like some of our audience will pick the car makers that use all CarPlay. Like they will make an affirmative decision to be like, you know what that car maker Toyota uses all of CarPlay we're going with them over Honda. Which is like, here's your weird heated seat teacher. - Well the third path is Rivian or Tesla, right? Where it's totally controlled by the automaker. And like Rivian is a great example of, I think you and I both test driven Rivian new line. Like I think their interface is great. It's very snappy. Obviously I miss some of the iPhone connection, but I could also see more automakers going that direction. - Yeah. - But they have to make good user interfaces. - Rivian's is good. - Like that is a big difference between, yeah, no- - Runs unreal. - Like Rivian and Tesla made good user interfaces. - Tesla, eeh. - Everybody else, eh, I said fo most part. - Tesla's getting weirder and weirder, I would say - For the most part. - Tesla like, you turn the car on and it's like you wanna play a game on Netflix. You know, it's. (everyone laughing) - Also- - But it's a lovely experience. - So Rivian just upgraded and the generation two R1 trucks just came out. They've changed the computing architecture of those is different. But then they also updated the interface to be more self shaded. I mean they have like unreal engine and that they like using it. That said, I looked at the parking lot at Apple Park when we were at WWC, a lot of those people have Rivians. - Oh yeah. - Right. And there's all these rumors about Apple and Rivian doing stuff together. Apple music just came to the Rivian interface. If Tesla's never gonna break, I feel confident about that one. Just a prediction I'll make based on nothing. (indistinct) - The Tesla UI is gonna be x.com in a few years. That's the direction Tesla's going. (Nilay and Cranz laughing) - Yeah, it's like it'll be Brock like fully just like telling dirty jokes. We try to drive the car. Rivian is still in the place where they might try some other stuff to claw back some market share, to win some new buyers. And there are an awful lot of Rivian's. - Mm. - It's California people like trucks there. But it's something I noticed. All right, moving on. I think the, see it's like a fast round, not quite lightning. - Yeah. - We're just moving. Cranz tell me about this remote because you're very excited about a home remote. I about this. - You know, I love a home remote. I'm still sad about Logitech. I still have the like the fanciest of the Logitech remotes and it had soft touch plastic. - Oh my God. - Which means it's starting to rot. - I have my, I have a TiVo remote in the corner of this house. It's like not a good. Not a good situation. - It's so bad. Like the rot on that soft touch is so gross. But there's a Kickstarter happening right now for the Haptique Rs90 and the Rs90X and they promise all the stuff, all the big universal remotes promise, which is like, you can control stuff via Bluetooth, you can control it via IR, you can control it via wifi. Usually that requires some sort of hub that you have to plug in somewhere in your house. This appears to require no hub and also it's just got a big screen on it. So it's instantly the coolest remote you can have in your house. (Nilay laughing) And they can, it's supposed to be able to control all your smart homes and stuff. And like I said, Logitech did this. I've got a control that does this doesn't have the coolest screen and it required a hub. So this is instantly cooler and this also is gonna come soon rather than discontinued. - Well it's a Kickstarter. Are they actually gonna ship? - Kickstarter. There's like the Kickstarter part of this is the really big heavy caveat because there's a whole bunch of integrations that they're promising. - No. - Not there yet. There's no matter support, there's no support for some of the other smaller like radios and stuff like that. So this is like cool neat. - We're like two minutes away from Samsung being like Bixby AI and your TV will not do everything for you. - I don't want it. We are though. - It's coming. - We are. It's coming. Yeah. Like AI is probably, you know the reason Logitech got out of this business was because they said nobody wants these. - No. (Nilay laughing) - And me and four other people were like, oh. - I want my phone to be my universal home remote. That's it. I don't want another remote. I want fewer remotes. Can we make that happen? - Yeah. That's how I use my phone. - But like I just getting like who is this for I guess is the question for me. It's me. - Me. (Alex laughing) (Nilay laughing) - What shall I (indistinct). - It's me and four other people. It's the four people who are still sad that are Logitech remote. - Whenever I see a screen like this, I just think about how slow it will be and you learn, I think about touching a button and nothing happening, right? - Yeah. - Like yeah and I love it. I'm like yeah I want a screen like this. But you know that thing you do with the touchscreen where you touch it and the button looks like something happened but nothing happened. - Mm. - That's this product. - Yeah. - Almost like a guarantee that is this product. It is, I will say it is, I love that it's called the Haptique Rs90. Great name. Great name for a universal remote fully. - Good name. - Fully good name. I just worry that actually people just use the apps on their smart TV and what this thing is trying to solve is not, I mean that's why Logitech got outta the business. So like we can't control the apps in your TV. We can't see your TV. - Yep. Yeah, so we'll see how this is it. It looks like it's gonna be funded. It looks like enough people have invested in it. - It's gonna be funded. This is like hot on the heels of that company brilliant going outta business. - Yeah. - Which Jen covered and they were like we're going outta business but like the thing we put in your wall will still work, so brilliant. And put like a touchscreen in your wall that can control everything. Which I was super hype on. 'Cause the idea of having an in-wall sonos controller screen seems sick, right? - Yeah. You walk into a room, you're like, I'm gonna pick a song like boop, I'm not using my phone like the whole thing. And then they just like went out to business, (Cranz laughing) And it's like that is always the worry I have with all of these things. - Yeah. - Speaking, oh go ahead. - This is gonna be like almost $400 probably. - Perfect - When it comes out. That's too much. - All right, speaking, oh let's do one more gadget and then I wanna talk about what's going on in AR and VR with Heath. We mentioned \"RISC-V\" at the top and we mentioned companies. I'm like Go Business. (Cranz laughing) Framework is shipping the laptop 13. Which is fascinating 'cause they're gonna have a \"RISC-V\" chip in it. This is the competitor Arm, right? This is the open source competitor Arm that has the performance per watt characteristics. I'm kind of dying to try it out. I'm also, I have no idea what software could run. - Also I think one guy pointed out that it runs, it'll run about as fast as a Raspberry Pi four. - Yes. (Nilay and Cranz laughing) You gotta start somewhere. Baby steps. - Baby steps, baby steps. Yeah. I have no idea what can run this but I wanna, like, this just is cool. This is the kind of thing I just wanna have one. - I like how the actual line from the company in the PR is the main board is extremely compelling. But we should be clear that in this generation it is focused primarily on enabling developers, tinkerers and hobbyists to start testing and creating and risky, like don't use this. (Cranz laughing) The peripheral set and performance aren't yet competitive with our Intel and a MD powered framework main words. It's like, yeah, this is just to play with. I will say. - eMMC storage. - The risk, the nerds in our audience have been very excited at Risky for a very long time. 'Cause Arm is a like dominant quasi monopolist now. Like the Arm architecture license is the thing and there hasn't been anything to compete with it. Which is why everybody is moving to it, including Microsoft. 'Cause if you want performance for what you end up on this architecture, which means companies like Qualcomm are being able to dominate the market right next to Apple. And you need an architecture license from Arm to expand beyond it. And Arm isn't giving this up anymore. Which is part of the reason they're suing Qualcomm. 'Cause Qualcomm is saying the Nuvia chips fall under its architecture license and Arm says no. So there's all this stuff that's wrapped up when you have one dominant architecture that is owned by a company and \"RISC-V\" is the thing. - Yeah. - The open source was it Nvidia? - Not quite as fast as a Raspberry Pi Four. But it's the thing that might break it. (Cranz laughing) - Was it Nvidia that tried to buy Arm a couple years ago? - Yeah, yeah, yeah. - It was. - So Arm was, I mean the finances of Arm are hilarious, right? Like it was, it's a weird English company that started licensing these designs. It got, SoftBank bought it, right? - Yeah. It was part of the vision fund. In the heady days of the SoftBank Vision Fund where Masa Son was like, everything I touch will be a monopoly. (Cranz laughing) That didn't work out. You might recall WeWork blew that entire business up. They started divesting of assets. They were gonna sell Arm. Nvidia wanted to buy it. Basically everyone yelled. Like everyone yelled, Apple yelled, like all the architectural licenses were like you cannot let our competitor buy this company. They said no, Arm is now public instead. Which is a good outcome. Mergers a bad. - Fun fact Arm going public made up for all the losses the Vision Fund has had for the last 10 years. - That's crazy. (Cranz laughing) Somewhere that WeWork people are like. (all laughing) - They're just launching a new product. Don't worry about it. - I mean it's like, I could have changed the world. (Cranz laughing) It's a lifestyle. - Flow. (Nilay and Cranz laughing) - I watched one episode of \"We Crashed\" and I was like I can't live this again. - Oh it's so bad. - I cannot be a part of this again. - Yeah. - Alright, let's wrap up by talking about AR and VR. Keith, you've got a scoop, Meta just reorganized Reality Labs. Just talk about that. The Vision Pro team is trying to make a cheaper headset. There's a lot of action here. What's going on? - Yeah, maybe we'll start with Vision Pro. The information had a good story out confirming and putting more details on what Germin and others have reported that Apple is indeed working on a cheaper Vision Pro. They hoped to release it by the end of next year and they have shelved a future iteration of V2 of the Vision Pro as it is today. So another high end, very expensive one. They're trying to get this cheaper, one more into the ballpark of a, you know, premium top of the line iPhone price. So we're talking 12 to $1,500. I had heard even before the Vision Pro came out that Apple was already working on this cheaper version. Apparently when Mark Zuckerberg was talking to me and others and basically saying I'm going to scorch the earth with cheap headsets forever (Nilay laughing) and not really care about making a business, which we will get to in the next story. Apple was like, oh okay we need to like really work on a cheap one and get it out. So they've been working on it for already a couple years. I do expect we'll see it next year whether it ships next year TBD and I think, you know, I've only used the Vision Pro once and that initial demo that we all had at WWC last year, in Nilay, but I would think that, you know, if it was in the ballpark of $1,500, I would maybe pull the trigger even if the OS and the software hadn't meaningfully gotten better just because of, you know, the immersiveness of it. I kind of, it's just at 3000 it's just like it's out of touch for most people. - Yeah. - And it's still out of touch at 1500 but it's much more of a almost impulse buy for some people at 1500. So yeah and it will get hopefully more developers interested but yeah, Apple's plugging away on and I think what the other part of this, the fact that they are canceling the more expensive one or shelving it, just goes to show that they packed so much tech into this thing that it may not actually be a good product and they may, (all laughing) we kind of like have found that out already. Nilay, you talk about how you don't use the Vision Pro anymore. It's a great demo. Honestly it was probably top three demos I've ever done of technology and it's something that I consistently hear people do not use after the first couple weeks. So. - Would you say this was a Homer car? - No, I mean it's not like that ridiculous, right? Like. - Yeah okay. - Like it had some focus. They wanted it to be something. I think about the fact that it was a great demo. So much of technology right now is like great demos to fall apart - Yeah. - As a product, right? And that was the vision pro to a t and every AI demo so far has been that from, unless you have some very narrow use case where AI can solve a problem consistently for you, every other demo is like what, what? I dunno if I would do that. The Vision Pro they have to make a big decision and here is the thing that I noticed at WWC that I've been thinking about in that opening keynote video when they were like jumping off the plane. - Yeah. - And they were like doing the introduction and everyone was wearing their flight suits. Do you remember this? - Vividly. - Ridiculous bombastic opening. They had Mike Rockwell on the plane who's the, he's in charge of the Vision Pro and he turns to the camera with the eyes on and they played it for laughs. The eyes were a joke. (Alex laughing) And why (Cranz laughing) - Those eyes aren't shipping anymore. I can tell you that. - This is what I'm saying, the idea, if you remember the initial Vision Pro stuff was like the eyes will place you in the environment. They're very, they were so serious about the eyes. - Yeah. - So serious. - Like dead serious about the eyes. I asked in one of our briefings, 'cause you know the only question I asked anybody during our Vision Pro briefings were, have two of you ever looked at each other with the eyes? (Cranz laughing) Like have two people ever existed in the same room wearing a Vision Pro? And when you looked at each other with eyes, did you laugh? And they were like, that's not funny. (Cranz laughing) 'Cause they were dead serious that this thing would bring you into the environment. They meant it. They were very- - Yeah. - It was sincere in that Apple New Age sincerity way. Like when you go to Apple Park and you walk towards the theater, they play new age music at you and they're dead sincere about it. - Yes. - And I'm like, this makes me feel like I'm in a cult. There's a gap there between like how sincere Apple can be and then the world. And they were super sincere that these eyes would be the thing that enabled you to wear a headset all the time. - No, let's be real. They did the eyes because they wanted to be able to not call it a VR headset. - Right. Well so this is what I'm getting at. - Yeah. - This next version, this cheaper version, they have to decide if this is a VR headset or an AR headset. - I will. - And playing the eyes for laughs was the thing that signaled to me, okay, this is gonna (indistinct). I will bet strongly that there will not be the eyes in any Future Vision Pro product and I'll tell you why. - Yeah, it's just a bunch of costs for reason. - Well yes. - Right? - No one's taking you on that bet. We like our money. - I'll take that bet. The eyes stay. - Well it was a Johnny Ive thing, I know this from talking to people who worked on the Vision Pro. It was Johnny Ive who insisted that the eyes ship, I don't know the exact dollar amount, but it added an absurd amount of cost and manufacturing complexity to the Vision Pro - Because they had to do that curved glass. - Well the curved glass was- - Or that curved glass in the display. It was having the front facing OLED I think it's an OLED. Right? Anyway, with the eyes. - Yeah, it's are very low. - Yeah. It added an absurd amount of cost. No one wanted to ship it except Johnny and his people and they've all left and so, and they're making a joke (Nilay laughing) about it in keynote videos. So yeah, I don't think the eyes are long for this world. - But so if you get rid of that and you're like, you're not now, you cannot be perceived by other people in the world. The thing is a VR headset. - Yeah. - Yip. - Right? And that to me is concession in one way, right? Like they talk about this thing as AR, AR, AR, AR. - Yeah. - But if you can't wear it with other people, like it's a VR headset and then everything they've announced since is immersive, right? New immersive videos, new experiences, new immersive games and it's like, oh this is becoming a VR headset. - Mm hmm. - And a $1500 VR headset right now the state of the art there, is a pretty good product, right? Like you can make something great for $1,500 in VR. - Yeah. Yeah. And I guess that maybe brings us to Meta, right? Should we go to that? - Yeah. - [Alex] So. - Yeah. - Meta obviously was first to this bought Oculus a long time ago. They restructured Reality Labs, the division that does all of their hardware and horizon that cursed platform. This week I had the scoop and command line. They're forming two new groups. So Reality Labs is now Metaverse and wearables. So you'll notice there's no VR in those two phrases, right? The Rift, I'm sorry God, look how the Rift, wow. (Nilay laughing) The Quest is now under Metaverse reporting to Vishal Shaw who used to run ads at Instagram and is a software guy. So you basically have the thing that created this whole org that the company really bet its future on is a subdivision of a software org. Meanwhile, wearables I'm told is leaning heavily into the Ray-Bans. I published this internal memo from Boz, the CTO basically saying that the Ray-Bans have been a much bigger hit than any of us anticipated. Zuckerberg and others have been kind of alluding to this throughout the year. I've heard that it's somewhere in the ballpark of a million-ish units that they've sold, which is three to four x the first version of the Ray-Bans. And they're seeing really good retention in the product. So people are actually using it consistently. I have them, I have the AI turned on in them. I wrote in Command Line a few weeks ago. I'm not trying to pat myself on the back, but I will just saying that Meta is quietly winning the AI wearable race here because the Ray-Bans are something that Meta has not done in a while. You could argue maybe ever but shipped a really good consumer product. (Alex laughing) (Nilay laughing) - Yeah, you're 100% right. Like normal people like something that tech people like because it's got the AI and yeah the AI still hallucinates but it's very fast and it's right like maybe half the time, right? So like I point it at a tree in my backyard and I say, what is this tree and how do I water it? It got it right. So like that's not, it's still a demo, right? It's not like I'm, it's not gonna like change the world but in a couple years you can see where that's going and it's like, oh if I have reliable visual AI in Ray-Bans, I may use my phone less. Which is the reason that is doing all this by the way. So they are putting way more resources behind the Ray-Ban line and they also have these full fledged AR glasses that they've been working on since 2018. Code named Orion, which are insanely expensive. They cost thousands of dollars to make, I have heard from people inside Meta that it's a again, incredible demo. They really feel like they've gotten there on the hardware. They're not sure what the software use cases will be yet. They're doing a lot of reviews of it right now. I expect we'll get a tease of that later this year at Connect their conference. So they have these two lines that they're doing with glasses. They've got the AR glasses, which I leaked the whole roadmap for Meta's Hardware a year or so ago. So we know that the Ray-Bans are gonna be updated next year with a little heads up display. So think more Google Glass, less full AR Magic Leap and they're gonna come with a wristband (Alex laughing) (Nilay laughing) that uses neural interface technology from the startup called Control Labs to control the display and to control some of the other inputs. 'Cause you can also like play podcasts through the, they have speakers in the frames right, that shipping next year that's gonna be interesting. And then the AR glasses, the full fledged ones that are gonna be more expensive and also have the band will be 2027. So this is the path Meta is on. They're going full on glasses and really deprioritizing, they hate when I say this, but it feels like that the Quest, because the Quest is still really struggling. They're not really, they have some early product market fit with gaming, but the retention is still not very good I've heard. And the Quest three they got a lot of really good things about the mixed reality right, but it's just not, I don't know why I wanna put it on. Whereas the Ray-Bans, it's like I get it, I have audio on all the time. I can take calls, I can take photos and videos and I have AI that is starting to work more and more. And by the way, they look like normal glasses, right? - Yeah. - So it's just obvious that this is the direction they should go. They seem to now be realizing that and they're putting all their chips there and laying off some people as a result. So that was the news out of Meta this week. - So what's really interesting about Quest three is the rate of innovation on the Quest three or improvement I guess in the Quest three, skyrocketed after the Vision Pro came out. - Yeah. - They're like, oh we should ship a bunch of these features. Like I guess there's some competition like here's travel mode, we took it away, it's back, they increased the fidelity of the pass through, right? Like just stuff that they should have done, but they're still not, it's not winning. And even Apple, if they come out with a $1500 version of the Vision Pro, they still have to make the case for VR, right? (Cranz laughing) Which like Meta has been trying for a long time and now if Meta is saying, alright it's these glass, it's the thing that everyone always knew was the thing, right? It's augmented reality glasses where actual light passes through to display and you're looking at actual things instead of screens and then we can put some information near or around or over those real things. Turns out that's the thing everybody has wanted the whole time. Look, why would Apple continue to boondoggle its way towards the Vision Pro even at $1,500? - Well, because they're on this path, right? Apple was working on AR glasses like Orion at Meta and they basically shelved it, semi recently in the last year or two for the headset route. They think that if they can keep iterating on the headsets, they'll figure out glasses eventually. Whereas Meta's like, no, we are going to have glasses out in a few years, and Apple's fine. - Yeah. - They're always late to this. Like, we all know that. So they'll come in late like they usually do. I don't know if it'll be as late as they were with the Vision Pro, but they're gonna be late and that's fine. But yeah, I think they're betting on productivity and being at home and coding and all these things with the Vision Pro and Meta's like, no, we want you to, Meta's goal is to use your phone less because they hate being under Apple and Google's thumb. - Yeah. - Whereas Apple is like, let's just extend what we do. And I think there's the big strategic difference. - Yeah. - Yeah. - I'll say that I have a friend like from the Brooklyn years who in the pandemic became one of those people who like doesn't live anywhere. (Cranz laughing) Like she just lives on beaches. - I know one of those folks, yeah. - She's great. Like- - Does she work? - More kinds of please- - Does she work in Nvidia or what? - She does not work in Nvidia and she was the first normal person adopter of the Meta glasses with the Ray-Bans. Like all of her Instagram pictures are a beach taken. They're Meta Ray-Bans now. - Great. - They're great. - And you can just see it like, oh, this thing worked. Like the thing worked. It looks like she's wearing Wayfairs and all the pictures. - Yeah. - But there, it's the Meta glasses and like, it worked. It's like so much, there's no chance that any of these people are wearing Vision Pros. - No. - As they like nomadically travel the world or the Quest three. But there's 100% chance that, hey, your camera is now in your sunglasses and you're looking at cool stuff and you wanna share it on Instagram, is a loop that META can close. - I was at a very fancy tech conference where I'm not even allowed to say the name earlier this week, but it was a lot of tech CEOs and there were several of them wearing the Ray-Bans, like walking around CEOs of companies that it would be very funny for me to say who they were wearing the Ray-Bans, (Nilay laughing) (Cranz laughing) and you're not supposed to record anything here, but like, they're wearing them and it's like, oh, like, yeah. This is like catching on. It's catching on with tech people, powerful people. And it's catching on with normal people, which is like, that is a circle that Meta has not been able to draw in its entirety of existence as a hardware player. - Yeah. - How good did Jensen look (Alex laughing) in the glasses? - I can't comment. (all laughing) - I'm telling you, I think it, VR is interesting. There's stuff in VR like Supernatural, they keep promoting as a hit. And there was actually, Supernatural just commissioned some study where they claim that waving bats and VRs a strenuous as running. - It feels like it. - Sure. Like sure. (Alex and Cranz laughing) Whatever man. - To me, yes, agreed. - If you can claim that Fancy Peloton Beat Saber is the same as like a swift run, like more power to you. But that's the only thing I have it sticky. Right. - Mm hmm. - And Apple doesn't have anything that sticky yet except for the monitors. We'll, see, I just think Apple moving away. The compromise of the Vision Pro was they built a VR headset with all this pass through in the eyes and stuff to make it closer to AR. And if what they're gonna do is drop the eyes and go head more towards VR, that feels like a turn. - Mm hmm. - That is notable because the real platform you wanna talk about the real platform shift has always been VR. - Yeah. - Everybody knows this. Tim Cook has talked about that. - Yeah. - As being the big platform shift and to go to, we just made it the best VR headset. We'll be very different. All right, we've been going, wait. We're way too long. This is outta control. - Does this show ever go long? I didn't think that ever happened. - No. - I don't have tears. - 10:30. - Here to hold me in. That's what's going on here. We gotta take a break. We'll be right back more on \"The Vergecast\" after this. (bright music) All right, we're back. This time we gotta talk about AI. This will just take two minutes. There's nothing going on. - Nothing. - Actually quite a lot going on AI. And a lot of it is just as, all as ever confounding decisions by AI companies. (Alex laughing) Let's start with a confounding branding decision. (Alex laughing) There's a new company, it's called Safe Super Intelligence. SSI, good name. (Cranz laughing) This is Ilya Sutskever, who, if you recall, was the CTO of OpenAI who participated in the coup against Sam Altman and then changed his mind. There's some safe super intelligence right there. Whether or not you have belief in that decision, then they couldn't figure out how to bring him back to the company. And now he's left to start to announce what is going on here. - Yeah, I mean, Ilya not just the CTO, the co-founder and really the one who is driving the research agenda at OpenAI. It was his decision to lean into the transformer, the T and ChatGPT. So I think I've heard one of the largest individual shareholders, like incredibly influential. He's someone that AI researchers look to is like a demagogue, right? And he has been totally quiet. There's been this meme of like, where's Ilya for the last, you know, six state months really since the November coup attempt. And yeah, he's back with a company that they will not describe anything about, except that they're going to invent super safe AGI, whatever the hell that means. His co-founder is Daniel Gross, who used to run AI at Apple, which is interesting. - Hmm. - And is now I would consider one of, if not the most plugged in venture capitalists in AI who's been raising a ton of money and deploying it into startups. And they are putting the call out for people to join. And I'm sure we'll be rating Ilya former org at OpenAI in very due time. And the key thing here is Ilya saying we are gonna be free from, I forget the exact wording, but we are gonna be free from the products and management day to day and only focus on long-term aligned AGI research. And we will not release anything until we hit AGI. So this is a pure research lab, which is what Ilya has been known for his entire career. - I'm gonna read this paragraph to you. - Yeah, read it. - Because anybody who has ever worked anywhere is, well, I think have the same reaction to this paragraph. \"Our singular focus means no distraction by management overhead or product cycles. And our business model means safety, security, and progress are all insulated from short term commercial pressures.\" (Alex laughing) - Sorry. - I just like, what? - Well, the business model is we just raised an ungodly amount of money and we're gonna keep raising ungodly amounts of money. - So it, but that means you don't have a business model, right? (Alex and Nilay laughing) - Yeah like. - Like that's how you get to do these things. - Yes. - Is like, you don't have the pressure of a business. - Yes. - Isn't that just all a really pointed jab at Sam Altman? - But. - Yes. - Or short - Right? Like I figured it was more that than actual, like in this case, I was assuming that he was going less like, I'm here to make money. 'Cause he's made it very clear he doesn't care about money. And more like, I'm here to like say, I don't like what Sam Altman did. And so I wanna make a company where we're couldn't (indistinct). - All I'm saying is I watched Max and two of her 6-year-old friends from kindergarten try to play lemonade stand, and they are distracted by management overhead and product cycles. (Cranz laughing) And their business model means they often compromise in safety, security and progress. Like, there's just like no way, (all laughing) you can put any group of people together and not have management overhead. It's like, it is not possible. Especially if you're trying to hire the most highly paid, sought after talent that exists in technology today. - Is- - And that's what I mean. It's like, I don't, I read this paragraph, I'm like, this doesn't, you can't do this. This is the- - VC math promise you can't keep. The VC math here is simple. We will give you whatever you want. And when you invent AGI, it will change everything. (Nilay laughing) It will be the new fire and we'll figure it out. I guarantee you that's the extent of the diligence. - I was gonna ask like, where is the money coming from to recruit all of these very highly paid people? - Well, they won't say where they've raised money from. So if you know, let me know. But if you're listening to this, I wanna find out Daniel is, they're all super wealthy. - Yeah. - And they will have no trouble raising whatever they want. Because when you co-founded OpenAI, you can raise whatever you want. - And then in particular, participated in the notable management overhead of doing a huge coup. - Yes. - Against the CEO. - Yes. - A failed coup. - Right. Yeah, it's like your track record of not having management overhead is very bad. - Also, like a question I have is, what is safe AGI, I keep hearing this and- - No it's super intelligence, it's not AGI. - Or super intelligence, which is actually now the new word for what comes after AGI apparently is the thing I keep hearing. And so we keep inventing new terms because they realize like the terms they had, no one understands or they don't actually even understand what they are. What is safe AGI, what does this mean? Like Ilya's whole thing at OpenAI was alignment, right? He set up this alignment group that was gonna get 20% of OpenAI's compute budget. Apparently they never did. That led to a lot of infighting and I think per, you know, helped him try to kick Sam out. But I always hear this and I'm like a aligning for who and under what values are we aligning and they don't seem to have an answer. - And then that's been like a consistent problem with AI, right? Is that they're always like, yeah, this is gonna be for everyone, but we only trained it with these certain data sets. We only trained it using like the pre-established knowledge of the certain people creating it. So it's actually fairly insular and doesn't work for everyone. And there are enormous edge cases every time we deploy it. - Yeah and you know, as Nilay and I uncovered when we were reporting on the coup attempts, like this gets kind of portrayed in the media as this, you know, acceleration versus deceleration, almost like religious faction war that's happening. And I do think there's part of that. I do think Ilya is almost like religious and is like fervor here. But a lot of this is just like boring company stuff. Business stuff. - Yes. - It's like you wanted budget, you didn't get it, you got layered, therefore you don't wanna work there anymore. OpenAI just hired a CPO who used to run product at Instagram and a CFO who was the CEO of Nextdoor, a public company. It's very clear where OpenAI is going. They're gonna IPO, they want to build a massive business. They're going get rid of being a nonprofit. It's very clear. And some of your- - Altman this week made some noises about not being a nonprofit. - Right. - Yeah. And so if that's the direction they're going, you're Ilya, it's like you just want to do research, right? And that's where a lot of these researchers still are is they just want to do cutting edge frontier model development. And this is him saying, come here, we'll do it. And we should also note this is now the third offshoot of OpenAI that has been created to create safer AI from OpenAI whose mission is also to create safe AI. - It's not a great look. - Yeah. - For any of them. - So you have anthropic, I would actually put XAI in this camp. Elon was the co-founder of an of OpenAI. Now you have SSI, which is also, I feel like it's a medical term or something. (Nilay laughing) One of my- - Yeah. - Yeah. - I got this once. It was you take a pill for it's fine. (Alex laughing) (Cranz laughing) - So Neo Ozempic SSI. - Yeah. (Cranz laughing) - Look, I just, it's great that everybody thinks they can accomplish these things. I actually think it's unclear at all whether Transformers and LLMs can ever do the things- - Yeah. - That people want them to do. And in fact, over time it has been more and more clear that perhaps they cannot. - Yeah. And so what I'm dying to know is if SSI or any of the other companies that think they can build AGI if they have another idea. - Yeah. - 'Cause if the only idea is we're gonna make a slightly better LLM, I actually don't I, you're not gonna make, you're not worried about whether it'll be safe. 'Cause it's not gonna be super intelligent. - I'm just, why are people trying to build an AGI like, these people are nerds. They watch movies. - That's why. You just answered your own question. - No, but they watch the movies, they play the games. (Nilay laughing) Like this man is setting out to be the audio clips you hear when you're walking through the ruins a thousand years later in a video game of the guy being like, \"I don't know what's happening. Why is my AI going and killing the world?\" - Yeah. - Like that's what he's setting himself up for if he was actually successful in his grand ambitions. And I'm just like, why? - Because the industry thinks that they have invented a new form of intelligence and that hasn't happened before. And so it's, - Okay. - I think the natural progression of this is that it's all smarter than us and replaces us. And it seems inevitable. - Right. - To the people building this stuff. What we see is like ChatGPT can't get a math equation right. Right? - Yeah. - That's like what we see, what they're seeing, what gotta keep in mind, like they gate this stuff. Like GPT-4 was in existence for like over a year before OpenAI actually deployed it in the world. - [Cranz] Mm hmm. - So they're seeing things we're not, I'm not gonna like give them too much of the credit there, but I do think there's, you know, Yann LeCun, who's the chief AI researcher at Meta has been saying what you just said Nilya that LLMs are not the path to AGI. So his group is actually working on what comes after the transformer. What is the architecture we need? Because these are parrots, right? These LLMs are are fancy prediction engines, right. And you don't really unlock intelligence that way. - Yeah, no, I mean I, yesterday I assigned our futurist team to write languages, not intelligence. Like, (Cranz laughing) I feel like we just need to say some very explicit declarative sentences that are true. Like, dogs are very intelligent and cannot generate a PowerPoint the way that like, you know what I mean? Like, we're getting confused about what intelligence is, at a very high level. I've been lately thinking a lot about the Steve Jobs slide of technology and liberal arts. You know, it's like, oh, you guys forgot about this whole street. (Cranz laughing) This whole street's missing from this conversation right now. (Nilay and Cranz laughing) And there's just a piece of this puzzle where it, you can bet on this stuff to get better at an infinite rate, but like most curves level off. And it is unclear to me what actually makes things intelligent that said, well, you know, good luck. Good luck building your company with no management overhead. - This websites. - Come on decoder. If you pull that off, boy do I have a podcast for you? (Alex laughing) Right? I spent an hour talking about management overhead every week with people. But like, it turns out, it always like three 6-year-old girls have management overhead. I promise you, maybe more than any company in America. (Nilay and Cranz laughing) Speaking of confounding decisions by AI companies, perplexity started out so hot, man. - Mm hmm. - They were the ones, right? You can pick any model, you can ask these questions. It was better searching Google. And it turns out, boy, have they been awful shady along the way? What is going on here? - Well, yeah. So perplexity, for those who don't know, is trying to unseat Google with an AI search engine. It's actually a good product most of the time I would say that I like their AI answers more than Google's on average. And now we kind of know why it's 'cause they're stealing a bunch of content. (Nilay and Cranz laughing) And yeah, so Wired did some good reporting and found out that they were going around their crawler blocker. I've heard rumors that Perplexity has been doing this at an even grander scale with even much larger corpuses of data. And this is the OpenAI playbook on steroids a little bit, which is just run fast and beg for forgiveness. And that's what they're doing. They're basically going around people who have said, no, you are not allowed to summarize this and doing it anyway. - And the way they're doing it is both shady and hilarious. - Mm hmm. - So they publish some IP ranges of their crawlers and they publish the name of their crawler. So poorrobots.txt a text file that should not bear the weight of all intellectual property law on the internet, but which currently does. You can set it to disallow these crawlers. You can set it to disallow GPT bot, which is OpenAIs. There's Google Bot plus I think. So there's Google Bot, which is the regular search index. And there's the other one which is Google's AI crawler. I feel like I need to disclose here. We used to disclose GPT bot at Vox Media and then our company signed a deal and now we don't. There you go. There's a disclosure and you could just, you could disallow perplexity. And on top of that, they did this thing where like, here are IP ranges. Like if you don't trust robots, you can disallow these IPs. And then what Wired found, and then the folks at Max Stories, which was a great indie Apple site, they found that their content was showing up anyway in perplexity. And then the investigations basically revealed these IP ranges were fake and the crawler was fake. And they were setting up headless Windows 10 machines to browse the web. - Yes. - Like, you know, those pictures of like the streaming fraud farms where hot dogs are just swiping Android phones. There's your VC money. - I love it. - Just swiping away on a Windows 10 browser. - Just imagine if those Windows machines had recall. (Nilay and Cranz laughing) - It's just like crazy. And you know, and the CEO for Plexus has talked a lot of shit about Google. - Yeah. - Like why are these results so bad? And like Google, for better or worse, is trying to play by the rules. It's still everybody off. But they're attempting to play by the rules. The publishers are laid out. - They have to, I mean, Google is under consent decrees. They're a massively regulated mega cap tech company. So they can't do this kind of stuff. - Yeah. And here's a startup being like, what if you lied? - Yeah. What if we just didn't do any of that? - And to be clear, I keep making this comparison. You call it the opening AI playbook. This was the Google playbook 20 years ago. - Yeah. - Yep. - Right, Google just allowed all of Viacom's content to be on YouTube. Google indexed every book in the world without permission. Google did image search, which we got sued over. And it won all those lawsuits because those products were new. - Mm hmm. - So they would show up in court and be like, judge YouTube. And the judge would be like, YouTube's sick. And Viacom would be like, our marketing staffers are using this anyway. - Mm hmm. - Because it's sick. Google image search so useful. Let's concoct and it's, nothing like this has ever existed before. Let's concoct some reasoning to allow Google to take all this stuff for free. Because theory is that you'll go buy the image from Getty once you found it on Google. It's unclear what that theory really came out to in the end. - I never did that. - Yeah. - Yeah. Alex is not like I opened a Getty library the next day. (Cranz laughing) A Getty account the next day. But those are theories back then. Google Books that might have worked, right? You can search all the books. Maybe you'll actually buy the book in the end. - Mm hmm. - Did it work out? Totally. Well, I don't know. But those are theories back then, because the products were so new, the experiences were so new. Perplexity is just like, yeah, we stole a bunch of stuff and what we've delivered is an incremental improvement on Google search. - Mm hmm. - And I just, I don't think that's gonna win this time. - Maybe. I am shocked at how little the people inside these AI companies and their investors, again, I was just at a very fancy tech conference of a lot of these people, how little they actually care about this problem. How it is really just like, this is a bunch of speed bumps that we'll go over to getting where we're gonna go. And maybe it's because of the fact that Google is Google and they did all this 20 years ago and they're a trillion multi-trillion dollar company. - I think its- - The proof that history shows. - It's back to us. - Yeah. - I was gonna say. - Go ahead. I think it's back to what Nilay said about liberal arts education. They just don't have any like historical context. So like, yeah, this is gonna work. (Nilay laughing) - They didn't take any history classes in Stanford. - I don't need to know about Google. This is fine. - No, these are systems people. Yeah. They don't think in terms of the values that we get mad about when it's like, hey, I made a thing, I charged people for it and you took it. That's not okay. With intellectual property, with writing and stuff like that for some reason, it's just not a thing that a lot of tech people that I know, it doesn't register for them. I don't know why, but. - Right, 'cause they didn't take liberal arts. (Alex laughing) They're like, what is an English class? - I wanna spend more time. I don't have a view of this. I haven't locked this into my brain yet. So people have thoughts. Send them to me. 'Cause I need the help. But I can feel this weird shift that I have been calling the copyright apocalypse because some people care about it a lot now more than ever before this is mine. And you took it between influencers on social media platforms, rages out of control now, right? - Yeah. - I'm a Taylor Swift fan and those three notes of a song sound like three notes an Olivia Rodrigo fan, we have to do fandom war now. - Yeah. - Until the music industry dolls out, writing credits, is a real thing that happens. Like at the craziest level, this is a real thing that happens and that is copyright maxisalism by really young people. And then over here you have nobody owns anything. It's just something I should get it for free. And those things are just in tension in a way that it feels unresolved and potentially unresolvable. Like you can't have a bunch of YouTubers being like, I made this YouTube video first. And anybody who even makes a video that looks like it is stealing from me right next to everything in the internet should be free. - Maybe that's it. Maybe there's not a lot of love for media companies, as we all know. And the fact that it's scraping wired or the verge or whatever is like whatever, they're fine. But when it's like your favorite influencer, your favorite creator, and they're on their feed going, hey, like this model, don't use it because they trained on my stuff. I do think you're right. I think people feel a lot more viscerally about that than they do. Oh, like companies, right? I think it's when it becomes the individual. - And again, what Google was up against, what Napster was up against was the big bad, right? Like the only face of the anti Napster movement was Lars Ulrich from Metallica. (Cranz laughing) (Alex laughing) - [Nilay] And- - You remember the flash. - That did not work for him. But really the face was like Hollywood in the music industry. And no one ever feels any sympathy towards Hollywood in the music industry. Like Hollywood could be like, you wouldn't steal a cigarette. Like whatever they would say you wouldn't, what was it? You wouldn't download a, - You wouldn't download a car. - Right. So Hollywood can put up the banners and say you wouldn't download a car. And everyone's like, screw you. I'm super gonna download a movie. - I will. - Yeah. - And if I could download a car, I would. - That'd be sick. - Yeah. (all laughing) The rules. - Like I've had this 3D printer for years not making cars. (Cranz laughing) But they were the big bats. Influencers are like people, like influencers, like people, you know what I mean? Influencers are actual people that you have pair social relationships with. - Yeah. - And like there's something very emotional there that is not resolved and it's gonna come to a head. 'Cause you know, the next story we have on our list here is a bunch of social networks that want to introduce AI in various ways. - Mm hmm. - Alex, you played with one. And before we get to that, I just wanna call out, TikTok is now letting people make AI avatars of creators. - Yeah. - Right? And saying, this is your ad creative and this is gonna come for every social platform. - Yeah, that's right. - Like in a massive way. Like if you are a creator and you feel the burnout and you can make 50 more ads during your brand deal using it, you might do it. - Yeah. No, this is happening. So yeah, I wrote about this new app which was, you know, I get a lot of test flights to try things and this is the first test flight I've gotten in a while that made me feel something very strongly where I was like, oh, when I opened it and it is like Instagram. It meets character AI where basically it's a bunch of AIs in a feed commenting and posting together. And there's humans, but they don't need to be there. And like, it's actually in some cases, not most, but in some cases hard to tell who is human and who is not. And they just raised a bunch of money. It's an ex Snap people. And the reason I wrote about it is because Meta is about to do the exact same thing. Zuckerberg told me so last September, and I think later this year, we're gonna see them start to roll this out where basically anyone can create their own AIs, send them into Instagram, send them into Facebook. And same thing with businesses. And the idea is that if you are an influencer and you feel overwhelmed by your DMs, maybe an AI handles that for you. Or maybe an AI actually posts on your behalf. - Yeah. - Zuckerberg is super excited about this. I know. 'Cause he's talked to me about it. It's very freaky to imagine what this actually does to our social networks. It's coming way faster than we think though. - Well it's interesting 'cause like in South Korea they've been doing a little bit of something like this, right? With, with k-pop stars where you can engage with k-pop stars on sites owned by the k-pop stars companies. - Mm hmm. - And it's not always that sometimes it's them, it's not always them, usually it is a bot. it's a person pretending to be them. And so like that parasocial, how do we automate that parasocial stuff has been happening in Korea for a long time. But I think the difference here is that was gated too. Okay. - Yeah. - You have to go download this app. - Yeah. - For this publisher and use it. Whereas this would be on Meta Instagram. - This would be like, you open Instagram and it's like, oh, is that account in AI? They may have three Arms. Okay, maybe then. - That's gross. - Yeah, well that's coming. - So there's the other part which is you send agents out on your behalf as an influencer or someone where you're like, someone wants to pay money to subscribe. And one of the things I offer is like DMs with me. - Yeah. - And then my agent will just like do that. - Yeah. - And I won't do it. And that's infinitely scalable. Which if you are an individual creator and all these platforms are organized towards tearing down collectives and enhancing individual creators. If you're an individual creator, your ability to scale is limited by your emotional capacity to do this work and your minutes in the day. - Yeah. - And so of course you're gonna let the robot talk to your fans. Like it is the biggest no-brainer in the history of the world. - Yeah. Of course you're gonna say, okay, you want to, your brand X wants to do an integration with me, but they wanted 50 different versions of this creative, I will make one and let the AI deep fake me into five more. - Yeah. - And that is already happening. Like at TikTok is enabling the feature. Like it's happening now. - Yeah. Well, Alex, to your question about why, like I was talking to Vu Tran, the CEO of Butterflies, this new app about this, the why. 'Cause I showed this app to my wife and she was like, just like, it was an immediate just like, ooh know, like. - Yeah. - I'm like, I think you're gonna meet a lot of people like that who are like, why does this need to exist? Like why do we need to like fill our time with just empty AI social media? And his point was like, yes, it feels kind of broken right now. And I wrote about this, it feels like when the hosts in Westworld break a little bit, it's not there. - Mm hmm. - But he was like, you know, I got into tech by like making friends on forums, talking to people that I never met. I only knew their username. He's like, we will get the models quickly to that quality. And as someone who also came up and got into tech in a similar way, like through like making friends on forums. Like what happens when, like I never met those people, right? I didn't know a lot of their names ever. So if they were AI, would it have made a difference? I mean we had a whole like philosophical conversation about this, but he was like, you don't actually want to talk to people. There's traits of being human that you like and AI will quickly copy all those traits. And I'm like. - Disagree. - Mind blown. And also, no, no, thank you. - But also it kind of. - But is it inevitable? That's the question. - It ignores like, in the eighties and nineties, there were the 900 numbers and you could like call (Nilay laughing) like the crypt keeper was one like Cory Ham and stuff like that. And Cory Ham was not answering the phone to talk to a little 12-year-old girl who had a crush on him. Right. Like that was a voice actor pretending to be him. And quickly this- - Wait Alex, so we just learned something very important about what you spent your money on when you were a child. (Nilay laughing) - It was not me because if I had called a 900 number, I would've not had a good time. - My dad super caught me calling 900 number once. And he was like, you're never using the phone again. - But that was like part of why, I mean, it was one that was the cost of 900 numbers, but that was the other part of it where it was like 900 numbers were a little sketchy as a kid. You weren't really supposed to call them. And it was because like yeah, it was a bunch of like, not con artists, but basically licensed con artists pretending to be other people. (Nilay laughing) And it's like, that's gross. - But, you hear this from tech people all the time. You're like, this is just the same as this other small problem that we had in the past. You're like, but now you're doing it at scale. - Yeah. Like now you're doing it at scale. And that's. - Like, what if this is a small problem and made it global? It's like. (Nilay laughing) I think maybe there's something different here. This thing by the way that you just mentioned, it's come up several times now. It is this unshakeable belief that these models are gonna get better. - Yeah. - And like on the rate of like Moore's law will get there. - Yeah. - And that metric doesn't exist. Like there isn't a Moore's law of LLM models yet. You know, we've only really experienced 3.5 to four in the public. - Mm hmm. - And I understand that they've all got stuff they're looking at that we can't see. - Mm hmm. - Sure. But someone's gotta give me the number. Like gimme the rate of change before I believe that this model will be able to simulate whatever happened to me on forums when I was a child. Like, you know, like you wouldn't last a minute in the asylum when they raised me. You know, it's like, I don't think so. (Cranz laughing) - Well, so yeah, there's no Moore's law. There's. - That's incredible. (Cranz laughing) - My God. (all laughing) I mean there's no Moore's Law. There's Scaling law. And the idea is that as you continue to put more data and compute into these models, they get exponentially better. That continues to hold true. If you compare the output, the creative output of like GPT-2 or GPT-3 to four, it's a massive difference. So- - But they're also running into how- - But you're saying the outline is not linear. That's what I'm saying. - No, I'm saying everyone who works in AI believes that it is still linear. - Yeah. - But it's not because we've just seen multiple stories about how they're all desperate for data to the point that they're like, what if we make AI machines to just create more content for us that can't go wrong. - Oh, the thing I'm hearing is it's gonna be synthetic data for training. So literally you're gonna have the AI get good enough that they start talking and then the AI train on the AIs. That's where we're going. - All right. - Create a very stupid AI person. - We gotta end this here, I can't stay here. - Sorry, sorry, I'm upset. - I'm just saying make real friends. Go to the forums while you can. All right. - Test friends. - Get in there while the getting's good. Get past the username. Get their actual name. 'Cause they may be an AI in a year. (Cranz laughing) - Request a driver's license immediately. (all laughing) We're taking a break. We'll be right back with the lightning round. (bright music) All right, we're back. It's the lightning round. I will say the first segment of the show was much more like a lightning round. And this is just going to be different. (Cranz laughing) It's fine. This lightning round remains unsponsored. But many options exist. (Alex laughing) For you, the potential advertiser. But you can't do AI ads. - Yeah. - You have to let me do it. (Nilay and Cranz laughing) - You can only do AI ads if they're trained on Nilays voice. - What's the most dangerous advertising you can buy? It's letting me do the ads. - All right. (Cranz laughing) Cranz, let's start with you. - NVIDIA's super rich. - Hmm. - Can I say, so the story right is NVIDIA's overtook Microsoft and Apple as the world's most valuable company. Microsoft and Apple been going back and forth on market cap for a while. NVIDIA's not bigger than both of them. The crazy thing about this whole story to me is one, Nvidia has been around for a million years. - Mm hmm. - Yep. Video game fans exist. - Mm hmm. - Right? - Yep. - Like people put Nvidia cards in their PCs all over the place. It has been on this run for a long time, right? - Yeah. - Like this is years now of Nvidia stock skyrocketing. And the way CNN covered it, the headline in CNN was this company whose name you can't pronounce, is now the world's most richest company. It's like. (Alex laughing) - Eh. - What? - It's actually pretty easy to pronounce, I feel like. - Yeah, it's not one, it's not that hard. - That's what you hear. - It's easier than SSI. - An editor and a writer together and they're both like, I don't know what this is. We got this. - Yeah. - It's just like at some point, like, I understand we run a tech publication, we like swim in the water, but like they've been headed here for at least two years. - Yeah. - Yeah, we had to hear about them like cryptocurrency, right? Nvidia had this big, all these big stock jumps because of cryptocurrency, because everybody was buying the GPUs because that was the best way to train. - Oh my God. This was completely outta my brain. This was gone, this information had been deleted. - You wiped it. Yeah, 'cause it was 2020. - Just like crypto. - We don't think about 2020. And so that was happening to Nvidia. And so it was like steadily ticking up and it was like, oh boy, AMD and Intel are, might be able to beat it. And then it was like, we're gonna take all the crypto stuff out of our GPUs and then everybody was like, Hey, AI's here. - Yeah. - Yeah. - And. - And others- - Lost their minds. - The effect of this- - Perfection. - The effect of this inside Nvidia is fascinating. I have heard and there's been some reporting and I wanna keep doing more reporting on it. So if you have stories, if you're listening to this and you have gotten fabulously wealthy at Nvidia, hit me up. We can talk off the record. They have a retirement problem inside Nvidia. There was a post I saw where it said if you join as a mid-level software engineer five years ago and your total comp was 700,000, which is a lot, right? But in tech, that's actually pretty middle of the road for a good engineer. Your compensation yearly now is $10 million. So. - That rules, for them. - Yeah. - They actually have people just retiring like en mass. And so like the question for Nvidia is like how, what do you do to motivate people when people have gotten so fabulously wealthy so fast and it's obvious there's gonna be a correction. It's obvious Nvidia is not gonna stay the richest the most valuable company in the world, right? So how does that collapse happen? Is it a slow collapse? Is it a fast one? And what happens to the employee base? It's fascinating. - I think it's. - We get rid of management overhead and product cycles. - There you go, that's. - It's obvious what you do. - Merge with SSI. (Nilay laughing) Like it's gonna last a while, right, because. - Yeah. - They are the only ones making the really good AI processors for server levels. Right? - Well they have software lock in too with Google. - Yeah, like. - That's the thing. Like Google's their main primary competitor, - Right? - Yeah. - Well. - Yeah. - Yeah Arm AMD I would say AMD is like an Arms dealer is probably the biggest one. - Yeah. - Google doesn't sell TPUs really as much. - But. - Yeah. - But NVIDIA's got a big headstart. This is one of the things that like has kept Intel propped up for years was because Intel had this huge headstart in the server space, 99% of the server space. So you know, they can bomb a couple of years against Qualcomm and be fine because they got the servers. And I think NVIDIA's kind of feels like not quite as cushy a position, but similarly cushy. - Yeah, I mean they have Cuda, like what they have is a software layer that makes their GPUs more valuable. - Yeah. - Which AMD does not. But if you run Azure, I mean we've had all these people in the show and Alex talks 'em all, if you run Azure or AWS or Google Cloud or whatever, you do not want to be beholden to Cuda and Nvidia. - No. - No. - You want all kinds of things to happen, so. - That's why Apple and Nvidia don't look at each other anymore. - It is very funny that Apple and Nvidia hate each other. It is, it used to be just like a little funny because Apple would insist that bad graphics cards were good graphics cards. (Cranz laughing) I mean that was just funny. Like in its way, now it's deeply funny. - Extremely good. - 'Cause all that OpenAI integration is happening in H100s that Apple does not want to talk about at all - Yeah and doesn't want to pay for. And that's the thing, market forces will ensure that Nvidia does not stay the top GPU supplier in the world because they are too expensive and it that no one wants Jensen being the king of GPUs. Right, everyone wants to have options. And so NVIDIA's challenge to justify this valuation and to keep growing is to build lock-in. And it is like, it would make a lot of sense for them to start competing directly with Google Cloud and Azure to become a one-stop shop because otherwise people will out chip them. That's just going to happen and may take time. - And we've been seen that for years with them and their, but like on the gaming side, they got really, really good at the lock-in. They got really good at being like, you can't use these AMD processors because we went out to every single game developer and made sure they were using our tools. So you had to use our, like we get the better stuff. So this it is gonna be really interesting over the next couple of years as they just like absolutely duke it out with some of these other companies. - Yeah. - And I think a lot of people are gonna be surprised at how vicious they get. - Oh yeah, but it's like one step down from that, right Alex? - Yeah. - Keith was saying these things are free, like Apple's not paying for it, if there's no business model, one step down from we paid all of the money in the world for H100s. The price of the H100 will just fall. - Yeah. - Like if the demand is there right now. 'Cause everyone thinks they're gonna monopolize something. - Yeah. What it is remains to be seen. But that's why the price is high. We'll see. All right, I'm gonna go next 'cause I want Heath to end the lightning round with this. (Cranz and Alex laughing) We just continue to track tech litigation. The United States Department of Justice has sued Adobe for deceiving subscription pricing in Creative Cloud. And it actually is deceiving. It is deceiving in one specific way, which is when you sign up for Creative Cloud, you can pick annually billed, annually billed monthly or monthly. Annually billed monthly is the default choice. So that means you pay for a year but they charge you per month and you've signed a one year contract. And if you try to cancel early, they just charge you the rest of the year. Or you can sign up for monthly or you can just cancel after every month because it's the default because it's the cheapest. People pick it and they think it's a monthly subscription and there's no fine print. It doesn't actually disclose that this will happen. They try to cancel, they get stuck with the rest of the bill. This is bad. This is straightforwardly bad, for a company with basically a monopoly market share in these tools. - Mm hmm. - It is also just beyond the pill. Like this is piddly shit. What are you doing? Like people are gonna buy Photoshop man, like - That's a local gym move on their part. - Yeah. (Nilay laughing) I really think about, I've been thinking about this a lot with Adobe. I've basically insisted the verge over cover Adobe over the past few years. 'Cause there's such a central player in everything that's going on. Like influencer media depends on the existence of Adobe. That's weird, right? Like Premier runs YouTube. Like YouTube never built creative tools, which is one of the weirdest things about YouTube. They had that one app on the phone once, but they've never built a video editor. The success of TikTok is they made a video editor that's really good and they made all those templates and they made it easy to do all this stuff. YouTube never did that. They're like uploads and videos and then people built the entire creators ecosystem on the back of Premier largely a little bit of final cut 'cause there's so many creators to use Max, but mostly Premier and like Google never built that stuff. So you just like look at this industry like Adobe's the center of everything. They're at the center of all these AI creativity battles, right? 'Cause they have Adobe stock and people use Photoshop and General Fill. And the more you cover Adobe, the more you realize there's a massive difference in how the company perceives itself and what it does and the tools it makes and how everyone else perceives Adobe. It's yawning gap. I've said this before, we had Shantanu Narayen on Decoder. He never talks to anyone really. He shows up on CNBC after earnings reports and never get his wide ranging interviews. I was so excited for that interview. This guy never talks. We asked him all the questions. Some of the questions were pretty harsh. The audience was mad at me just for paying attention to Adobe. (Nilay and Cranz laughing) They're like, why would you platform Adobe? Which is an incredible question because it's Adobe. I don't think I've seen a company burn that this much Goodwill ever. Right? And then on top of it, they had their terms of service debacle where, we've covered terms of service changes like this so many times. Like I could barely even pay attention to it. Where they change their terms of service to let them do content moderation on their cloud services. So you run a cloud service, people will put bad things on your cloud service. That is just as true effective nature as there is. Like horrific shit will end up on your cloud storage system if you have a scaled cloud storage system. And what you don't wanna do is give a bunch of contractors PTSD, which is a real thing that has happened that we have covered, by making them look through stuff on cloud services or look through reports. So you build automated systems to go through your cloud services and find the child abuse material. Like that's what you do. So Adobe changes its terms to let people know it's gonna do some Creative Cloud. People assume that they're gonna train on AI and they freak out at Adobe. And that Adobe has so little goodwill that even as they tried to explain this, people are like, we don't believe you. And so now they've updated their terms of service again and you just connect that directly to, oh, you're getting sued by the government because annual paid monthly was not clear to people and you charged them the rest of the money when they canceled it. It's just like, it's crazy to me that this company is so important but does not realize that it needs to maintain the goodwill of the people that depend on it. - Well you don't have to when you're a monopoly, you can just be a monopoly. - But it just make you like I met all their executives. They're not dumb, you know? (Nilay laughing) - Yeah. - It's like baffling to me. - Yeah. But they're, you know, they can do what they want. They're monopoly - Powerful. - What're you gonna do, go to Da Vinci? Yeah. - Maybe. Yeah. - Yeah. - Maybe. - A lot of people, yeah. - Them not acquiring Figma. I think we'll go down, we're gonna come back on the failed Figma deal, one because Figma will turn into a different company and we'll see if they can go compete with Adobe. But that was driven as much by some of this burn goodwill as anything. And I think we're gonna see the creative tools industry bifurcate on that moment over the course of history. 'Cause if they had acquired Figma a lot of things would've been a lot different, I think. - Yeah. - All right. Last lightning round one. We gotta end here. Heath. (Alex and Cranz laughing) This is like the best story in history. - Okay, yeah. The San Francisco standard has a fun story where techies are increasingly paying up to 1200 an hour for fashion consultants because of CEOs like Mark Zuckerberg deciding to wear chains. And I just encourage everyone to read this story. There is a side-by-side photo of a guy who's gone through one of these fashion consultants. I would argue he looked better before. (Nilay laughing) I'm not gonna, like, I'm not gonna judge like, you know, - I will. - Whatever. Or at least the same. It's just like, as my grandfather would say, you know, money doesn't buy sense and like reading this like techies, like just be who you are. You don't need to like try to look cool (Nilay laughing) and you don't need to pay 1200 an hour to try to look cool. Like the internet is there. Like you could just research on your own. - This side by side photo is brutal. - It's brutal. - It's not brutal because he looks better or worse. He looks the same. - Yeah. - Yeah. - The same. - And then it's the story. - Both of them are kind of just baggy outfits. - Yeah. And then like it's perfect because at the end, like the story, they're like interviewing a founder who's done this and then he is like, I'm making an AI app that will do this for people for $20 a month. (Nilay and Cranz laughing) And it's like the circle just completes itself. - That's amazing. You know Amazon tried to do that with their weird camera. - Yeah. - Super didn't work. - Yeah. - I just- - I would say, if you're paying someone this much money to take you to Bloomingdale's, you can do better than this photo. - That's what I'm saying. Like it's money doesn't- - Oh, don't think he went to Bloomingdale's. He definitely- - No, it says, that's the caption. - No, it says that. Yeah. - Does it? - This is, he's in the dressing room at Bloomies. - Oh my gosh. Get out. (Nilay laughing) Leave the store sir. No, that's a bad look, if that's what you're pulling out of Bloomingdale's, that's like, you get that at Dillard's. (Nilay laughing) - That's brutal. - All right we gotta end it here before we do more shaming. - Sorry. Sorry for your fashion shaming. - You can look cool no matter where you shop. - I love a Dillard's. - Everyone is constantly asking me where the jackets come from and all of them were pandemic purchases at either Home Depot or Walmart. I'm just telling you that's like that I had money to spend and there are only two stores to spend it at. (Nilay and Cranz laughing) It's like you can look cool no matter where you shop. - Tractor Supply. - Dillard's is fine. Just know who you are, that's a quote. - That's it. - Just know who you are. Just be that person as loudly as you. - Yeah. - Alright. That's it. And also make an agent of yourself and have it flirt with other people on Instagram for money. That's the future. (Alex laughing) So more gold chains. More gold chains. (all laughing) - All right, we'll be back on Tuesday with more of the Windows Arm, laptop benchmark scores. That's a big deal. I'm excited for those reviews to come out. And then we got all kinds of stuff. It's a summer, it's like wild time in tech. And then we're gonna get rid of all our management overhead and product cycles. Just pure intelligence. - Can't wait. - Here at \"Vergecast\". - BVI, - Thanks to Heath for filling in. Good luck to David doing whatever he's doing. That's it. That's \"Vergecast\", rock and roll. (bright music) - [Presenter] And that's it for the Vergecast this week. Hey, we'd love to hear from you. Give us a call at 866-VERGE11. \"The Vergecast\" is a production of the Verge and Vox Media Podcast network. Our show is produced by Andrew Marino and Liam James. That's it. We'll see you next week. (bright music)",
    "transcript_keywords": [
        "Yeah",
        "Apple",
        "Vision pro",
        "people",
        "thing",
        "stuff",
        "Google",
        "Vision",
        "Arm",
        "lot",
        "Meta",
        "things",
        "good",
        "time",
        "pro",
        "car",
        "Nvidia",
        "make",
        "Qualcomm",
        "Windows"
    ],
    "transcript_entity_values": [
        "Android",
        "Vox Media Podcast",
        "three",
        "$10 million",
        "UI",
        "VC",
        "six feet",
        "CarPlay",
        "Tom Warren",
        "Future Vision Pro",
        "the Ray-Ban",
        "the Ray-Bans",
        "Orion",
        "Rs90X",
        "Nilay",
        "this week",
        "third",
        "the next 10 years",
        "Viacom",
        "Tom",
        "Google",
        "da da da da",
        "CFO",
        "Amazon",
        "every week",
        "YouTube",
        "Nuvia",
        "Toyota",
        "Siri",
        "Liam James",
        "Instagram",
        "20 years ago",
        "next year",
        "Cupertino",
        "Windows",
        "AI",
        "20",
        "IR",
        "VR",
        "Control Labs",
        "a million years",
        "Safe Super Intelligence",
        "WeWork",
        "Vergecast",
        "Plus",
        "annually",
        "Eli",
        "CNBC",
        "VR",
        "Tuesday",
        "Kickstarter",
        "Heath",
        "the year",
        "1,500",
        "SoftBank",
        "Moore",
        "the eighties and nineties",
        "Goodwill",
        "one",
        "a couple years",
        "iPhones",
        "Lars Ulrich",
        "Google Cloud",
        "the Ray-Bans",
        "Google Bot",
        "Yann LeCun",
        "monthly",
        "Germin",
        "We Crashed",
        "the Vision Pro",
        "Walmart",
        "3000",
        "Optimist",
        "Figma",
        "1500",
        "Alex's",
        "CarPlay",
        "yearly",
        "Andrew Marino",
        "the last 10 years",
        "a couple of years",
        "Porsche",
        "one year",
        "the Vision Pro",
        "the end of next year",
        "a few years",
        "almost $400",
        "12 to $1,500",
        "Steve Jobs",
        "Mike Rockwell",
        "an hour",
        "Cuda",
        "This week",
        "Edge",
        "Perplexity",
        "Vergecast",
        "Kickstarter",
        "trillion",
        "GM",
        "Snapdragon",
        "these a week ago",
        "SSI",
        "the Ray-Bans",
        "CNN",
        "Vu Tran",
        "an hour or two hours",
        "first",
        "IP",
        "Windows",
        "Keith",
        "Ilya",
        "Elon",
        "South Korea",
        "Korea",
        "the next day",
        "AMD",
        "a couple years ago",
        "Vision Pro",
        "Bloomingdale's",
        "CarPlay",
        "Airplay",
        "Aston Martin",
        "later this year",
        "866-VERGE11",
        "six state months",
        "M3",
        "a few weeks ago",
        "Apple",
        "Haptique",
        "Creative Cloud",
        "Brock",
        "only half",
        "Quest",
        "Cranz",
        "Nadella",
        "years",
        "Jen",
        "Tim Cook",
        "a year",
        "half",
        "Annually",
        "David",
        "Apple Design",
        "the past few years",
        "next week",
        "LLM",
        "iPhone",
        "Nvidia",
        "Max",
        "Decoder",
        "2027",
        "CTO",
        "da da da",
        "Vishal Shaw",
        "Windows",
        "Nilay",
        "6-year-old",
        "Taylor Swift",
        "Westworld",
        "Cory Ham",
        "Nilya",
        "Alex Heath",
        "the SoftBank Vision Fund",
        "5",
        "45",
        "Project Titan",
        "Apples",
        "Rift",
        "Meta",
        "Fill",
        "One",
        "6",
        "Sam Altman",
        "Alex",
        "12-year-old",
        "Rivians",
        "Apple San Francisco",
        "YouTube",
        "Alex I'm",
        "PowerPoint",
        "David Pierce",
        "English",
        "M1",
        "Google Glass",
        "Wayfairs",
        "at least two years",
        "20%",
        "The United States Department of Justice",
        "Metaverse",
        "Bloomies",
        "a couple weeks ago",
        "2020",
        "Samsung",
        "META",
        "Zuckerberg",
        "Shantanu Narayen",
        "AI news",
        "this year",
        "AR",
        "Project Red",
        "Netflix",
        "Daniel",
        "Home Depot",
        "Roku",
        "10",
        "GPT",
        "last year",
        "Fancy Peloton Beat Saber",
        "Apple for Apple",
        "Moore",
        "Stanford",
        "GPT-3",
        "100%",
        "YouTubers",
        "Jensen",
        "Boz",
        "trillions of dollars",
        "Facebook",
        "The Vergecast",
        "second",
        "TiVo",
        "2018",
        "five",
        "the next couple of years",
        "last September",
        "Intel",
        "three to four",
        "WWC",
        "four",
        "kick Sam",
        "Johnny",
        "five years ago",
        "year",
        "Hollywood",
        "AGI",
        "about 2020",
        "every month",
        "Heath",
        "up to 1200",
        "MD",
        "earlier this week",
        "Mark Zuckerberg",
        "Rivian",
        "NVIDIA",
        "AR and VR",
        "Napster",
        "Pete",
        "about 5",
        "Meta Instagram",
        "Azure",
        "optimist robots",
        "Okta",
        "AMD",
        "yesterday",
        "the day",
        "H100s",
        "Getty",
        "two minutes",
        "Plexus",
        "only two",
        "Elite",
        "Alex Cranz",
        "a thousand years later",
        "some Creative Cloud",
        "English",
        "Tractor Supply",
        "Chrome",
        "50",
        "AR Magic Leap",
        "CarPlay",
        "TikTok",
        "thousands of dollars",
        "Reality Labs",
        "Microsoft",
        "Vox Media",
        "H100",
        "Honda",
        "Bixby AI",
        "Broadcom",
        "November",
        "the Brooklyn years",
        "Dillard's",
        "Daniel Gross",
        "the last year",
        "Nathan",
        "GPU",
        "Nilay",
        "AI express",
        "Verge",
        "the first couple weeks",
        "UWB",
        "OpenAI",
        "Max Stories",
        "Qualcomm",
        "Quest three",
        "Command Line",
        "VRs",
        "Vision Pros",
        "Olivia Rodrigo",
        "Meta Ray-Bans",
        "Ilya Sutskever",
        "245",
        "Mac Apple",
        "Rivian",
        "Snapdragon",
        "a ton",
        "only one",
        "MacBooks",
        "sonos",
        "Da Vinci",
        "1200 an hour",
        "Tesla",
        "Butterflies",
        "1500",
        "Sundar Pichai",
        "California",
        "Google Books",
        "Neo Ozempic SSI",
        "Adobe",
        "13",
        "annual",
        "Nilays",
        "H100s",
        "Macs",
        "Elon",
        "Logitech",
        "San Francisco",
        "Metallica",
        "Nuvia",
        "AWS",
        "Oculus",
        "Mac",
        "two decades",
        "99%",
        "the previous weeks",
        "700,000",
        "today",
        "3.5",
        "the Vision Fund",
        "CPO",
        "Metaverse",
        "Slack",
        "the heady days",
        "America",
        "Apple TV",
        "Siri",
        "two",
        "Nextdoor",
        "Apple Park",
        "Masa Son",
        "Apple",
        "two years ago"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "ORG",
        "FAC",
        "FAC",
        "ORG",
        "PERSON",
        "LANGUAGE",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "GPE",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "LOC",
        "DATE",
        "GPE",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "NORP",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "GPE",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "MONEY",
        "MONEY",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "ORDINAL",
        "ORG",
        "NORP",
        "PERSON",
        "PERSON",
        "ORG",
        "GPE",
        "GPE",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "LOC",
        "PERSON",
        "GPE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "NORP",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "NORP",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "PERCENT",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "NORP",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "GPE",
        "DATE",
        "PERSON",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "GPE",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "LANGUAGE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "FAC",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "LAW",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "FAC",
        "DATE",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "FAC",
        "PERSON",
        "PERSON",
        "DATE"
    ],
    "vector": [
        -0.10819123685359955,
        -0.0645391196012497,
        0.004078068770468235,
        -0.04858248680830002,
        0.11310408264398575,
        -0.03213193267583847,
        -0.009492338635027409,
        -0.029546048492193222,
        -0.0011613211827352643,
        0.02950039505958557,
        -0.008782170712947845,
        0.042742978781461716,
        -0.009964228607714176,
        -0.011041815392673016,
        0.03449586406350136,
        -7.165703573264182e-05,
        0.07874634861946106,
        -0.08506608009338379,
        -0.014203540980815887,
        0.009333807043731213,
        -0.05823846906423569,
        -0.010130306705832481,
        0.05109706521034241,
        -0.018820228055119514,
        -0.015878181904554367,
        0.022576868534088135,
        0.021911565214395523,
        -0.09601477533578873,
        -0.042165979743003845,
        -0.016627788543701172,
        -0.039492059499025345,
        0.057465311139822006,
        -0.006061187945306301,
        0.05327599123120308,
        -0.04031822830438614,
        -0.019496222957968712,
        0.0001711392105789855,
        0.021583842113614082,
        -0.041020192205905914,
        -0.03720222786068916,
        -0.05758431926369667,
        -0.0905209556221962,
        -0.05606956034898758,
        0.0247598085552454,
        0.07786712050437927,
        0.03370359539985657,
        0.017156526446342468,
        -0.06577577441930771,
        0.015373698435723782,
        0.026269713416695595,
        -0.1030019074678421,
        -0.1160825714468956,
        0.06975947320461273,
        -0.004283645190298557,
        -0.03286157175898552,
        0.0409950353205204,
        -0.0021849593613296747,
        -0.024390332400798798,
        0.0661916509270668,
        0.02346610091626644,
        0.09324543923139572,
        -0.0943828597664833,
        -0.014468523673713207,
        0.06334243714809418,
        -0.022969163954257965,
        0.022970668971538544,
        -0.029956340789794922,
        0.011004406027495861,
        0.006610249634832144,
        -0.07765766233205795,
        0.06512576341629028,
        0.016985174268484116,
        0.007835560478270054,
        0.018820011988282204,
        0.04839377850294113,
        0.04028676822781563,
        0.1175767332315445,
        -0.057462047785520554,
        0.05394742637872696,
        -0.10093571990728378,
        0.04042503237724304,
        -0.03203040733933449,
        0.002372882328927517,
        0.03814364969730377,
        -0.014282346703112125,
        0.009421764872968197,
        -0.025831133127212524,
        -0.012712628580629826,
        0.0182212945073843,
        0.0020715033169835806,
        -0.02076667919754982,
        -0.009037590585649014,
        -0.005285048857331276,
        -0.015826955437660217,
        0.09230513870716095,
        0.009522189386188984,
        -0.043366480618715286,
        -0.07456488162279129,
        -0.02875307761132717,
        0.046556007117033005,
        -0.01853746734559536,
        -0.014454549178481102,
        0.03860199451446533,
        0.007135710678994656,
        -0.03829246759414673,
        -0.029221761971712112,
        0.03819382190704346,
        -0.008738857693970203,
        0.016875501722097397,
        0.05924481153488159,
        -0.0008251193212345243,
        0.02636934258043766,
        -0.009853876195847988,
        -0.057119060307741165,
        0.03752771019935608,
        0.039205681532621384,
        -0.04494631290435791,
        0.12340647727251053,
        0.12083183228969574,
        0.014812242239713669,
        -0.0029972789343446493,
        0.07977253943681717,
        -0.03851199522614479,
        -0.004536467604339123,
        0.055000174790620804,
        0.019221631810069084,
        -0.06676001101732254,
        4.06001385702419e-33,
        -0.03425101190805435,
        0.12286943942308426,
        -0.025889527052640915,
        -0.029738981276750565,
        0.03845102712512016,
        -0.03392641246318817,
        0.024879090487957,
        0.05405734106898308,
        -0.024516835808753967,
        -0.006871647201478481,
        -0.06340143084526062,
        0.008177747949957848,
        -0.06781964004039764,
        0.08975294977426529,
        0.04375510662794113,
        -0.11540791392326355,
        0.020385924726724625,
        0.03951366990804672,
        -0.10141094028949738,
        -0.022038063034415245,
        0.024036839604377747,
        -0.03119947947561741,
        -0.02925541251897812,
        0.020651694387197495,
        -0.023387935012578964,
        0.05384640023112297,
        0.048747267574071884,
        0.005745853763073683,
        0.08219439536333084,
        0.04537038877606392,
        -0.06260041892528534,
        0.10771726816892624,
        -0.006593174766749144,
        0.0067201959900557995,
        -0.014376038685441017,
        -0.008644345216453075,
        -0.027923250570893288,
        -0.09162115305662155,
        0.0315566286444664,
        0.046221982687711716,
        -0.05302669480443001,
        0.10410589724779129,
        -0.04917753115296364,
        -0.07333584129810333,
        -0.03674984723329544,
        -0.00895881187170744,
        0.04376688972115517,
        0.016703559085726738,
        -0.035908378660678864,
        0.0567108653485775,
        -0.08625119924545288,
        0.038617756217718124,
        -0.026430292055010796,
        -0.0026791724376380444,
        -0.006174563430249691,
        -0.09169754385948181,
        -0.012028995901346207,
        -0.04892057180404663,
        0.06963320076465607,
        -0.03604063391685486,
        0.03486417979001999,
        0.030591396614909172,
        -0.024182328954339027,
        0.040804293006658554,
        -0.11470519751310349,
        0.026285342872142792,
        0.09136518090963364,
        0.018960846588015556,
        -0.0020268065854907036,
        0.11080119758844376,
        -0.026976658031344414,
        0.024785185232758522,
        -0.06280975043773651,
        -0.057515084743499756,
        -0.00026436318876221776,
        0.017140669748187065,
        -0.08627144992351532,
        0.007146959658712149,
        0.004051819443702698,
        0.030235882848501205,
        -0.0865946039557457,
        0.07924481481313705,
        0.05158653482794762,
        0.020725224167108536,
        0.06546465307474136,
        -0.031061531975865364,
        0.021466445177793503,
        -0.015538652427494526,
        -0.031393907964229584,
        0.0032347391825169325,
        -0.046041324734687805,
        -0.007293304428458214,
        -0.029340602457523346,
        0.09538877010345459,
        -0.06277879327535629,
        -4.8074420217609564e-33,
        -0.03234132379293442,
        -0.0032989473547786474,
        -0.06708867847919464,
        0.028761746361851692,
        0.012636514380574226,
        -0.06935875862836838,
        0.0265849269926548,
        -0.005627733655273914,
        0.035392407327890396,
        -0.007681290619075298,
        0.026333894580602646,
        0.010065137408673763,
        -0.02901868149638176,
        0.0017646006308495998,
        0.018969224765896797,
        -0.058683086186647415,
        0.04104304686188698,
        -0.062177874147892,
        -0.010278860107064247,
        -0.007970672100782394,
        0.12104503810405731,
        -0.013833289965987206,
        -0.08796603232622147,
        -0.01770428754389286,
        0.025425368919968605,
        0.056324925273656845,
        0.054253995418548584,
        0.05278213694691658,
        -0.05717738717794418,
        -0.001039340510033071,
        -0.036999426782131195,
        -0.04628576338291168,
        -0.03336292505264282,
        0.0979079082608223,
        0.10800892859697342,
        0.0831238180398941,
        0.0285679679363966,
        -0.02725285477936268,
        -0.043575748801231384,
        -0.007165289018303156,
        0.1110902726650238,
        -0.039387114346027374,
        -0.0050628227181732655,
        -0.018491894006729126,
        -0.055347926914691925,
        -0.03862639144062996,
        -0.055368825793266296,
        0.0428088903427124,
        -0.021395038813352585,
        -0.10199412703514099,
        -0.0027568191289901733,
        0.05314863845705986,
        -0.017832426354289055,
        -0.025635110214352608,
        -0.11553195863962173,
        -0.01657550036907196,
        -0.027027590200304985,
        0.06954259425401688,
        -0.03079301491379738,
        0.021875180304050446,
        0.019274067133665085,
        0.018292350694537163,
        0.001171913230791688,
        -0.062493860721588135,
        -0.019522394984960556,
        0.01867418736219406,
        0.03197767585515976,
        0.024836890399456024,
        -0.02195756323635578,
        -0.05427858978509903,
        0.03995606303215027,
        -0.018501896411180496,
        -0.07305365800857544,
        -0.06508013606071472,
        -0.09752877056598663,
        -0.004896651022136211,
        0.07095153629779816,
        -0.033042702823877335,
        -0.026503780856728554,
        -0.006365662906318903,
        0.027098048478364944,
        -0.0383371077477932,
        0.06602279841899872,
        0.092666856944561,
        0.04190145060420036,
        0.13232316076755524,
        -0.027239622548222542,
        0.004611209034919739,
        -0.04736506938934326,
        0.06359134614467621,
        -0.10199960321187973,
        -0.013301028870046139,
        -0.07373745739459991,
        0.11293680965900421,
        -0.06750980764627457,
        -5.6100947887216535e-08,
        -0.04570106789469719,
        0.012733787298202515,
        0.057316068559885025,
        0.017050333321094513,
        0.04890942573547363,
        -0.03962358832359314,
        -0.036396294832229614,
        0.021907716989517212,
        0.005299946293234825,
        0.01732991263270378,
        0.01494736596941948,
        -0.03607076406478882,
        0.013979480601847172,
        0.04379484802484512,
        0.0733274519443512,
        0.04380916431546211,
        -0.03471308946609497,
        -0.0004526822885964066,
        -0.034044474363327026,
        -0.07402265816926956,
        0.041711024940013885,
        0.03219492360949516,
        0.03344874456524849,
        -0.07171708345413208,
        -0.04832824319601059,
        0.008052198216319084,
        -0.06611219793558121,
        -0.011532854288816452,
        0.0032197153195738792,
        0.08505606651306152,
        -0.047272514551877975,
        0.00714457081630826,
        0.020730573683977127,
        -0.051750995218753815,
        -0.009027247317135334,
        -0.06170352175831795,
        0.009152533486485481,
        -0.007776461075991392,
        0.087113156914711,
        -0.017047064378857613,
        -0.02736111357808113,
        -0.03453259915113449,
        0.013971742242574692,
        0.023852095007896423,
        0.019864104688167572,
        -0.066366046667099,
        -0.033293019980192184,
        -0.11752980202436447,
        -0.0009039184078574181,
        -0.014727465808391571,
        -0.0133056640625,
        -0.026485279202461243,
        0.038746390491724014,
        0.10549464821815491,
        0.04693165421485901,
        -0.012292882427573204,
        0.028835756704211235,
        -0.09269414842128754,
        -0.061640169471502304,
        0.09073506295681,
        0.08683564513921738,
        -0.11078771203756332,
        -0.012402729131281376,
        0.06917275488376617
    ]
}