{
    "id": "7lhjgup4w54",
    "title": "Twitter is DONE",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-11-15T19:03:51Z",
    "video_url": "https://www.youtube.com/watch?v=7lhjgup4w54",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 62012,
    "likes": 2990,
    "comments_count": 232,
    "description": "I don't know what is more parody, this list or actual Twitter I Wasted $420.69 on Walmart Tech:  $20 MacBook:  Tech We REALLY Wish Came Back:  Microsoft Has LOST Their Minds:  TikTok Made Me Buy It:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Hello and Welcome 0:27 Jeremy Renner Official 1:20 Friendster 1:53 Bill Clinton Story Time 2:44 MySpace 3:49 Digg 4:10 CraigsList Missed Connections 5:00 LiveJournal 5:38 Parler 5:43 StumbleUpon 6:59 YikYak 7:28 Club Penguin 8:19 Google+ 9:27 What do you think?",
    "description_links": [
        "https://youtu.be/v5f_R8rtNnE",
        "https://youtu.be/MEhqzqD3MPU",
        "https://youtu.be/IF8QJEovEcY",
        "https://youtu.be/LnskLqLrq18",
        "https://youtu.be/vUBtSnsWL_0",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- What do you call a fan of Elon Musk? - An Elongenist? - No, an (person grunting). (Matt laughing) (screen beeping) - Hello and welcome to This Is. Listen Up, muskrats. - Nope. - [Matt] Twitter's a sinking ship that we all have to flee. - We're about to give you some of the absolute top tier Twitter replacements to liven up your timelines. - These are the best alternatives to using Twitter because, let's face it, that's a dumpster fire right now. Let's get into the next one. - It's always been a dumpster fire. - [Matt] Jeremy Renner Official. (both laughing) So, this was created in 2017. Let's face it, it's Jeremy Renner, my dudes. It's a way for fans all over the world to interact directly with Jeremy Renner. You don't wanna be interacting with Elon Musk. You wanna be interacting with Tag star, Jeremy Renner. - That would be like the Matt app and you download the app and it just lets you talk to Matt. (Austin laughing) It's the dumbest thing I've ever heard of. (laughing) - If you wanna have the Matt app, text 422#7 to me and we'll chat. It was unfortunately shut down to a quote from Renner, \"Clever individuals that were able to impersonate me and others.\" Can you believe someone was impersonating the owner of a social media platform? - Can you believe that this is the actual image they used? He's like. (rock scraping) - Moving on to the next one. - [Austin] Friendster was quite possibly the greatest social media platform that was founded in the summer of 2002. - I had a Friendster because for a long time their slogan was, everyone is separated by six degrees. And this was a way to prove it. Like, I know this guy who knows this guy, who knows this guy, who knows this guy. - I actually remember that as a kid. Like my parents would talk about that. Like, \"Oh, there's probably only four or five or six people between us and the president. If you go from uncle to this person to this.\" And I always used to think like- - I have one because I played poker with Bill Clinton and he cheated. - What? - Story time. - Are you trying to tell me that the esteemed former president, Bill Clinton, was a cheater? I think you should tease this. Subscribe to the channel, ring-a-ling the ding-a-ling bell for this impeccable story which apparently is true on why Bill Clinton cheated Matt out of actual money illegally. - Back in like 2007, 2008, Bill Clinton went on this like this press tour to like raise money for it and he was like playing concert halls and I was working at one. And I'm in charge of like getting them whatever they need, blah, blah, blah. So, he's got like all his like Secret Service people around him and they're playing poker. He's like, \"Hey man, why don't you come and sit in?\" Like, \"All right.\" I'm like 18 at the time, whatever. They're playing poker. He goes, \"Man, this hand sucks.\" And he just goes to one of his Secret Service guys and grabs one of his cards. He's like, \"Ha-ha, full house.\" - You're gonna get abducted to a black site now that you've told that story. We're moving on to what's even better than Friendster, which is MySpace. - No, MySpace, my man! It was inspired by Friendster, launched by the one and only, Tom, who needs to know his last name? No one, because everyone was friends with Tom. - For those of you, Zoomers, who were not fortunate enough to grow up with things such as Friendster and MySpace. Hello. Welcome to This Is. We are old and we're gonna tell you about the way it used to be back in the good old days with MySpace. - If you wanted to have the ultimate in friend drama what you did is you updated your top eight. On there it would say, here's my top eight, here's the eight people I care about most. But then what you do is you'd rank those eight people. And so your friend, Becky, she was being kind of a (person grunting) at the party, maybe she gets moved down to number eight that night. Becky's the worst, I don't know what to tell you. And in 2012, Justin Timberlake bought it. As it exists today, it's an entertainment news site. with a little bit of social networking. - I mean basically, whoever owns it, Justin Timberlake or whatever, they're basically just cashing in on the various many people who are still clicking the MySpace button in their Internet Explorer 6 computer tab. - [Together] Digg! - Why up-vote and down-vote when you can Digg and bury? Digg was the early version of like, say Reddit. Basically, instead of up-voting, you digged it, you dug it. But if you wanted to down-vote it, you buried it. In 2012, Digg was sold for a mere $500,000. Next one up is one that I miss dearly. Craigslist Missed Connections. \"Hey girl, were you the one who got hit by a car in front of Billy's last night? I was outside smoking and you were crossing the street and you got hit by a car. (horn hooting) You bounced off the hood and landed on the street yelling something about being indestructible.\" Look, I feel like I'm gonna be single forever now that Craigslist Missed Connections- - That was a problem. - Every one of my girlfriends I met through Craigslist Missed Connections. (chuckles) - Say cap. - Cap. - Okay. (laughing) (both laughing) - If you ever wanted to feel like you're not an absolute goblin of a person, you would go on Craigslist Missed Connections and realize that like, oh wait, I'm living an okay life. The unhingedness of Craigslist Missed Connections was so rich and delicious, I want to drizzle that on pancakes. - You know what's even better than Craigslist Missed Connections? - What is that? - [Austin] LiveJournal. Did you ever use LiveJournal? - [Matt] I didn't. - I used LiveJournal, baby. - [Matt] What? - I used LiveJournal. Back in the days, the early and mid 2000s, where blogs were all the rage. You wanted to be online all the time. You didn't go post your updates to Facebook or Twitter. Those didn't exist yet. Instead you had your own personal blogs that you ran via LiveJournal. Now, LiveJournal actually still exists although I know that the last major user of LiveJournal, at least as far as I was aware, was George R. R. Martin. He used that up until like literally like a year or two ago. And fun fact, he literally just replicated exactly on his website, even down to the little like emotion, happy, sad, all that kind of stuff. - Parler. (Austin laughing) Nope, moving on. - Moving right over that one. - [Matt] StumbleUpon. StumbleUpon, for those of you who don't know. StumbleUpon was basically a roulette wheel for the internet. - I've never heard of something that sounds less appealing in my entire life. (chuckling) - I don't know how I finished college. You'd sit there and you'd just stumble. That's what it was called, it was stumbling. That's how I discovered you. - You stumbled on me, Matt? - I'm not even joking about this. - Okay, I've never heard this story. Okay, go ahead. - No, like this is back in the day when like tech YouTube wasn't really a thing. You were there with your long spiky hair. (dramatic music) It would just bring up different webpages. - Right. - And whatever, like, probably gaming, was at the time, it would just bring up like your video. And so when you hit stumble it would just have all these categories and it would just be random. - Oh. - It's like, that's how I got so many, many interests. They got bought out. I forgot who they got bought out by and it was not really the same. I miss this so much, it was so fun. And it was a really good way to like, it wasn't so much a social media platform. - [Austin] Yeah. - The problem I have with like something like Pinterest is you tell your interest and then it like focuses your interests. - [Austin] Right. - Which is like you don't expand your horizons as much, but like this here, would expand your horizon like infinitely. And I loved this site. I miss it a lot. - Well, that sounds like it's better than Twitter. Sign me up. - Yes. - Can I go create an account on StumbleUpon? - No, 'cause they shut down. - Yik Yak. Yik yak paddy whack, give a dog a bone. Yik Yak had about 15 minutes of fame. - Yep. - This was as if Twitter was anonymous, location-based and had up-votes and down-votes. - So, this got shut down because, well- - Of course, it did. We don't need to describe that. Of course, this got shut down. This was a stupid idea. - [Matt] There was plenty of- - [Computer Voice] Friend requests. - [Austin] Yeah. - [Kinsey] It's back now, you can download it and make even more- - [Computer Voice] Friend requests. - [Matt] Cool. (Austin laughing) - [Austin] Wait, wait, wait. Hold up there. Matt, we're not qualified for this. Kinsey, can you please tell us why Club Penguin was better than Twitter? - 'Cause it's the real Metaverse. - So, here's the thing. Club Penguin seems silly, seems frivolous but this was wildly popular. And while it did get shut down eventually, it had a 12 year run. - [Matt] In 2008, this was the eighth tier social networking site. - It was like the eighth most popular social network. That was Club Penguin. Did you know, if you look at the analytics of This Is, 99.6% of people who watch This Is are not subscribed. Yep, That's a real fact. Look it up. You can't 'cause I made that up. But a lot of people aren't subscribed. And you too, my friend, could be part of the Cool Penguin Club and subscribe to This Is. - When we hit 1 million subscribers, I will shave Austin's eyebrows. (soft laid-back music) - Sure. - [Both] Google+! - [Matt] Look, right now. - [Austin] (indistinct). - I have really liked Google+ but, like most Google products, they're like, we have this thing and then we're gonna cancel it immediately. - [Austin] Google+ actually had a minute there where it became a real network. Now, keep in mind this is launched in 2011. - [Matt] Yeah. - [Austin] Well after Twitter, well after Facebook, the die was already kinda being cast on the big, traditional social networking sites. And Google being Google was like, \"Hey, we wanna slice of that, my dude.\" So, essentially what they did was they created a full social network. One of the things they did a lot was they really tied it in pretty tightly with YouTube, which obviously was very popular. Obviously, not really a social network. - Have you heard of YouTube? - Yeah, it's YouTube. There's some high-quality videos I've heard on some channels like the Austin Evans Channel. - The problem was how they integrated it because they required you to use your real name. I like the platform itself. - Yeah. - The way they did it. But again, it's the way they integrated it was where the downfall was because, listen here, I've seen the heinous things that you guys comment on a YouTube channel, all right? But- - Although we appreciate all the good comments. - Yeah, all six of them - Sorry, I'm gonna get on real Twitter. - This video. - Real Twitter. - Interesting and exciting. But nothing will replace my love for Elon and Twitter. All the (person grunting), I mean. (laughing) - Like, follow and subscribe. Let us know what social media platform you're jumping ship to and we'll catch you in the next elongated muskrat. Did you pay for the $8 blue check mark? - I never had Twitter blue. - Mm. I did in fact, blue myself. And I'm left with somewhat of a sticky mess on my hands. - Aaron cut this about 10 minutes ago. (switch clicking)",
    "transcript_keywords": [
        "Craigslist Missed Connections",
        "Missed Connections",
        "Craigslist Missed",
        "Jeremy Renner",
        "Twitter",
        "Bill Clinton",
        "social",
        "Jeremy Renner Official",
        "Missed",
        "Connections",
        "Matt",
        "Renner",
        "Craigslist",
        "Elon Musk",
        "Google",
        "Club Penguin",
        "social media platform",
        "people",
        "LiveJournal",
        "Friendster"
    ],
    "transcript_entity_values": [
        "2012",
        "Elon",
        "Justin Timberlake",
        "12 year",
        "the summer of 2002",
        "one",
        "six degrees",
        "8",
        "a mere $500,000",
        "Aaron",
        "Kinsey",
        "about 15 minutes",
        "the early and mid 2000s",
        "MySpace",
        "1 million",
        "Twitter",
        "the day",
        "Reddit",
        "today",
        "Tom",
        "the Austin Evans Channel",
        "Google",
        "the good old days",
        "eight",
        "2017",
        "six",
        "last night",
        "eighth",
        "Billy",
        "Matt",
        "Digg",
        "Friendster",
        "Connections",
        "number eight",
        "Craigslist",
        "Austin",
        "Bill Clinton",
        "99.6%",
        "StumbleUpon",
        "MySpace",
        "the days",
        "YouTube",
        "Club Penguin",
        "2008",
        "eighth",
        "the Cool Penguin Club",
        "Elon Musk",
        "Digg",
        "One",
        "Facebook",
        "Yik Yak",
        "Jeremy Renner",
        "Internet Explorer 6",
        "five",
        "George R. R. Martin",
        "Pinterest",
        "Yik",
        "2011",
        "YouTube",
        "LiveJournal",
        "2007",
        "422#7",
        "Becky",
        "Craigslist",
        "only four or",
        "Zoomers",
        "this about 10 minutes ago",
        "Twitter",
        "Renner"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "PERSON",
        "PERSON",
        "TIME",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "PERSON",
        "PERSON",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "TIME",
        "PERSON",
        "PERSON"
    ],
    "vector": [
        -0.08117112517356873,
        -0.03465652093291283,
        0.07824905216693878,
        -0.10747058689594269,
        0.10872520506381989,
        -0.05389942228794098,
        0.06055562570691109,
        0.022109925746917725,
        0.06380204111337662,
        0.011397316120564938,
        0.018322084099054337,
        0.0054863630793988705,
        0.0798024833202362,
        -0.11008055508136749,
        -0.017722303047776222,
        -0.0108425822108984,
        -0.006472283974289894,
        -0.07450103014707565,
        -0.00696938531473279,
        -0.06111785024404526,
        -0.027036575600504875,
        0.023290414363145828,
        -0.020576657727360725,
        0.05765900760889053,
        0.033093295991420746,
        -0.020262861624360085,
        -0.04062708467245102,
        -0.025494199246168137,
        -0.04501023888587952,
        0.03578788787126541,
        -0.06176865100860596,
        0.04026646912097931,
        0.023312566801905632,
        -0.0018675191095098853,
        -0.06473252177238464,
        0.06566054373979568,
        0.01300203986465931,
        0.03238768130540848,
        0.006614244543015957,
        0.026396507397294044,
        -1.116088060371112e-05,
        -0.13000962138175964,
        -0.04948080703616142,
        -0.03896617516875267,
        -0.023862380534410477,
        0.007992232218384743,
        0.020163780078291893,
        -0.06379181146621704,
        -0.053994715213775635,
        0.061183735728263855,
        -0.04101766273379326,
        -0.030734119936823845,
        0.0606868602335453,
        0.0023589052725583315,
        -0.05723373964428902,
        -0.018368517979979515,
        -0.003547503612935543,
        0.05983508378267288,
        0.09591765701770782,
        0.0480244904756546,
        0.016424203291535378,
        -0.07390433549880981,
        -0.009880203753709793,
        0.035050492733716965,
        0.0210874080657959,
        -0.032084885984659195,
        -0.05118919536471367,
        0.07246582955121994,
        -0.038621339946985245,
        0.05861670896410942,
        0.033123649656772614,
        0.022277163341641426,
        0.04215231165289879,
        0.10743346810340881,
        -0.01089244894683361,
        -0.005320600233972073,
        0.08633515983819962,
        -0.06722392141819,
        -0.04050068184733391,
        0.03144168481230736,
        0.02835078164935112,
        -0.050819918513298035,
        0.039516009390354156,
        -0.06902480870485306,
        -0.06431888043880463,
        -0.021748902276158333,
        0.014045760966837406,
        0.024779250845313072,
        -0.05968190357089043,
        0.03401409834623337,
        -0.0931258425116539,
        0.07060994952917099,
        0.0711660236120224,
        -0.0498020313680172,
        0.044745609164237976,
        -0.043494027107954025,
        -0.06142179295420647,
        -0.08058938384056091,
        -0.043124739080667496,
        0.06539366394281387,
        -0.0729188323020935,
        0.07157346606254578,
        0.07570338249206543,
        -0.06084592640399933,
        0.053324926644563675,
        -0.04023810103535652,
        -0.03009459748864174,
        0.01976265013217926,
        0.07488749921321869,
        0.026507627218961716,
        -0.022244244813919067,
        0.03338656947016716,
        -0.02815723977982998,
        -0.09230118989944458,
        0.08375431597232819,
        -0.007868688553571701,
        -0.04802916571497917,
        0.0013727240730077028,
        0.10690490901470184,
        0.05224082991480827,
        0.03900245204567909,
        0.07426538318395615,
        -0.012270860373973846,
        -0.015189971774816513,
        0.06991281360387802,
        0.06669536232948303,
        -0.01915028691291809,
        5.139709459016292e-33,
        0.053018633276224136,
        0.10580675303936005,
        -0.0004223401774652302,
        0.022697679698467255,
        0.06726882606744766,
        0.00937176588922739,
        -0.059706538915634155,
        0.0024228773545473814,
        -0.09518705308437347,
        -0.09075392037630081,
        0.00032093419576995075,
        0.005598805379122496,
        -0.02868768759071827,
        0.03849053755402565,
        -0.0017352584982290864,
        -0.020125189796090126,
        -0.03350331261754036,
        -0.04223327338695526,
        -0.03499768674373627,
        -0.0014430960873141885,
        0.02481955848634243,
        0.069495789706707,
        0.0041378880850970745,
        -0.030542878434062004,
        -0.0385427363216877,
        -0.05322277173399925,
        0.04714109003543854,
        -0.014857461676001549,
        0.03986530750989914,
        0.025954613462090492,
        -0.09905946254730225,
        0.023053264245390892,
        -0.006623365450650454,
        0.016259904950857162,
        0.0632689967751503,
        -0.03947565332055092,
        0.03023407608270645,
        -0.09553851187229156,
        0.0330515131354332,
        -0.06540590524673462,
        -0.04961448907852173,
        0.05867727845907211,
        -0.0917590856552124,
        -0.038442280143499374,
        -0.03674444928765297,
        0.06348256021738052,
        0.018685098737478256,
        -0.0520501434803009,
        0.11419609189033508,
        0.030813779681921005,
        0.02003408968448639,
        0.02543620578944683,
        0.008170702494680882,
        -0.014492032118141651,
        -0.005578947253525257,
        -0.02716403268277645,
        -0.040113210678100586,
        -0.05349887162446976,
        0.09756731986999512,
        0.008110539987683296,
        0.034355610609054565,
        0.027759499847888947,
        0.08875861763954163,
        -0.042718082666397095,
        -0.022312287241220474,
        0.029849953949451447,
        -0.016726365312933922,
        0.0011032202746719122,
        -0.002889466704800725,
        0.03606661781668663,
        -0.012588183395564556,
        -0.055132895708084106,
        -0.023144057020545006,
        -0.0356728658080101,
        -0.06263011693954468,
        0.016335180029273033,
        -0.03989357501268387,
        -0.05328802391886711,
        -0.0221880953758955,
        0.0761132463812828,
        0.013973445631563663,
        -0.08261451125144958,
        0.04389043524861336,
        -0.055800046771764755,
        -0.019743937999010086,
        -0.025368707254529,
        0.05680473521351814,
        -0.06030924618244171,
        -0.002236749744042754,
        0.016741763800382614,
        -0.1261230707168579,
        0.00045392673928290606,
        -0.01902281865477562,
        -4.0283302951138467e-05,
        -0.12733128666877747,
        -6.311394473457946e-33,
        -0.03301866352558136,
        0.021357713267207146,
        -0.04394423961639404,
        0.12874658405780792,
        0.0011658933945000172,
        -0.018466604873538017,
        0.01321069709956646,
        0.03382354602217674,
        0.004294964950531721,
        0.010000832378864288,
        0.013190273195505142,
        -0.032175205647945404,
        -0.09824557602405548,
        -0.08558378368616104,
        0.05641338229179382,
        -0.08643487840890884,
        0.07126032561063766,
        -0.06000388041138649,
        -0.08487507700920105,
        0.011509665288031101,
        0.052184056490659714,
        -0.03468957543373108,
        -0.09474706649780273,
        0.05778218433260918,
        0.004020887427031994,
        0.025444481521844864,
        0.04853895679116249,
        0.03628940507769585,
        2.2994856408331543e-05,
        -0.016405640169978142,
        -0.028809083625674248,
        0.05268639698624611,
        0.01885557733476162,
        0.051005858927965164,
        0.04615071788430214,
        0.03891785442829132,
        -0.022684264928102493,
        0.05294369161128998,
        0.038015712052583694,
        -0.08377378433942795,
        0.11230725049972534,
        -0.044860851019620895,
        0.02860124781727791,
        0.012584174983203411,
        -0.07732877880334854,
        -0.024832572788000107,
        -0.1293376237154007,
        -0.04979254677891731,
        -0.07981610298156738,
        0.03450494259595871,
        0.007866465486586094,
        -0.01363841537386179,
        0.004250984638929367,
        0.032337039709091187,
        -0.0985410287976265,
        -0.08504803478717804,
        -0.012141939252614975,
        0.04107321798801422,
        -0.07680606096982956,
        -0.002237883163616061,
        -0.010362072847783566,
        -0.006747579667717218,
        -0.004452175926417112,
        -0.03111550211906433,
        -0.018805356696248055,
        -0.06713182479143143,
        0.05215036869049072,
        0.0032815150916576385,
        -0.0011531331110745668,
        -0.013242438435554504,
        0.04039781540632248,
        0.03373187407851219,
        -0.08089471608400345,
        -0.08304455131292343,
        0.03407319262623787,
        0.016657372936606407,
        0.02408147044479847,
        0.00039047872996889055,
        -0.09333432465791702,
        -0.020017927512526512,
        0.02539008855819702,
        0.020213108509778976,
        0.011283592320978642,
        -0.011369913816452026,
        0.043351974338293076,
        0.019152650609612465,
        -0.04134340211749077,
        0.09457240253686905,
        -0.03352861851453781,
        0.07461552321910858,
        0.09009192138910294,
        0.01269670482724905,
        -0.0734337568283081,
        0.09084422141313553,
        0.0262242890894413,
        -6.932003060455827e-08,
        -0.10155937075614929,
        -0.055132124572992325,
        -0.05485397204756737,
        0.05359971895813942,
        0.06609290093183517,
        0.032240238040685654,
        0.037328243255615234,
        -0.01935049518942833,
        0.032290227711200714,
        0.04323369637131691,
        0.0314943827688694,
        -0.031567394733428955,
        -0.010950634256005287,
        0.016736969351768494,
        0.0336214154958725,
        -0.0063257222063839436,
        -0.05520576983690262,
        -0.07072354853153229,
        -0.02084844745695591,
        0.011970938183367252,
        -0.08328361064195633,
        0.05192725732922554,
        -0.03196270391345024,
        -0.023617085069417953,
        0.011230041272938251,
        0.0659407451748848,
        -0.10159710049629211,
        -0.002094738883897662,
        -0.013541477732360363,
        0.04782295227050781,
        -0.02610393427312374,
        -0.008813183754682541,
        -0.13315463066101074,
        -0.045037735253572464,
        0.015292749740183353,
        0.04945647716522217,
        -0.017805887386202812,
        0.014110448770225048,
        0.008160264231264591,
        0.00046514213318005204,
        0.026919754222035408,
        0.01011902466416359,
        0.07561967521905899,
        -0.020317090675234795,
        -0.024377351626753807,
        0.002955557079985738,
        -0.06725111603736877,
        -0.031025564298033714,
        0.0589100681245327,
        -0.028692830353975296,
        0.021541902795433998,
        -0.04091918468475342,
        0.007971304468810558,
        0.0647219717502594,
        0.04234449192881584,
        -0.005747981835156679,
        -0.03326766565442085,
        0.010666624642908573,
        0.01188634242862463,
        0.0008388026617467403,
        0.13107377290725708,
        -0.0546133816242218,
        0.0011838703649118543,
        -0.00044338221778161824
    ]
}