{
    "id": "7Ly0Qjg3efI",
    "title": "Best iPhone Alternatives 2017: What To Buy Instead Of The iPhone 8/iPhone X",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-09-16T02:09:26Z",
    "video_url": "https://www.youtube.com/watch?v=7Ly0Qjg3efI",
    "category": "Science & Technology",
    "tags": [
        "best iphone alternative 2017",
        "best iphone replacement",
        "iphone android comparison",
        "iphone x 2017",
        "iphone 8",
        "iphone 8 plus",
        "essential phone review",
        "oneplus 5 review",
        "google pixel review",
        "galaxy note 8 review",
        "iphone vs galaxy",
        "mrmobile",
        "android central",
        "imore"
    ],
    "views": 368514,
    "likes": 12162,
    "comments_count": 1658,
    "description": "If youre not excited for the next iPhone, youre not alone. The iPhone X is pretty neat, but if I weren't a reviewer, it's doubtful I'd plunk down $999 for the privilege of owning one. While the new iPhone 8 and iPhone 8 Plus are less expensive, theyre also less exciting, with basically the same industrial design Apple's been using since 2012. So if youve been toying with the idea of jumping to Android, this is a good year to do it  but the world of Android is so vast, it can be tough to tell whats actually worth your time. Fortunately, that's why I'm here. I'm MrMobile and these are my top picks for iPhone alternatives in 2017. Beware, though: if you're here for just another rundown of Samsung Galaxy shoutouts, you're in the wrong place. About half of these picks are not what you might call \"popular\"  and they're pretty US-focused to boot. So dive on in to the Best iPhone Alternatives of 2017, and drop your own suggestions in the comments!   [SUBSCRIBE]     [ABOUT THE BEST iPHONE ALTERNATIVES 2017 VIDEO]  MrMobile's Best iPhone Alternatives 2017 video was produced following extended review sessions with the Google Pixel, OnePlus 5, Essential Phone and Sony XZ Premium, as well as limited hands-on time with the Sony Xperia XZ1 & XZ1 Compact at IFA 2017. MrMobile has yet to go hands-on with either the iPhone X or iPhone 8/8S. All conclusions are preliminary pending a full iPhone X Review (coming soon!)    [FURTHER READING]  This Is Why Sony's Phones In The US Don't Have Fingerprint Scanners [Android Central]:   iPhone X Hands-On [iMore]:    [MUSIC]  Raiders by Cymatix, available at Premium Beat:   Days and Days by Eternity Bro, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.androidcentral.com/sony-fingerprint-sensors-us-deals",
        "https://www.imore.com/iphone-x",
        "https://www.premiumbeat.com/royalty_free_music/songs/raiders",
        "https://www.premiumbeat.com/royalty_free_music/songs/days-and-days",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Mr. Mobile] If you're not excited for the next iPhone, well, you're not alone. I think the iPhone X has a lot going for it. But if I wasn't a reviewer, I don't thin I'd pay a thousand bucks for the privilege of owning one. While the new iPhone 8 and 8 Plus are less expensive, they're also less exciting, with basically the same industrial design iPhones have had for the past three years. So, if you've been toying of the idea of jumping to Android, this is a good year to do it. But the world of android is so vast, it can be tough to tell what's actually worth your time. Well, I'm Mr. Mobile, and that's why I'm here. These are my top picks for iPhone alternatives. (techno music) Let get one thing out of the way up top, the Samsung Galaxy S8 and Note 8 are great, but I don't think they really fit on this list. Every year, everyone seems to recommend these as iPhone replacements, and I get it. Samsung is the most popular Android brand, and that's true for a reason. But as much I personally like using this generation of Galaxy phones, I tend to think they're only good for people who are so bored of the iPhone that what they want is an anti-iPhone. Where Apple has historically been pretty restrained in the features and functions it includes, Samsung has not. Name a smartphone feature, and you'll probably find it on the S8 or Note 8, sometimes in duplicate. That leads to more complexity than I think most iPhone users want, and I don't mean that in a patronizing way. There's an elegance to the simplicity of iOS, or at least the simplicity it once had, that I don't think people should have to give up when moving to Android. And while you can modify any Android phone to make it as minimalist as you like, the point is that there are other options out there besides the Galaxy phones. The most obvious of these is the Google Pixel. Now big caveat. At press time, the Pixel is about a month away from its first birthday, meaning its two replacements are weeks away from hitting shelves. But if the Pixel 2 follows the template of the existing ones, it's definitely gonna stay on this list. That template include software directly supported by Google, with Android updates guaranteed until October of 2018, and security updates through October 2019. More importantly, it means an interface totally devoid of manufacturer muck and carrier cruft. The Pixel launcher contains only a few enhancement compared to stock Android, and those make the experience better, instead of getting in the way. I'm not as big a fan of the Pixels dulls hardware. But if you're coming from an iPhone, those curved corners and that minimal adornment will probably suit you just find. As a bonus, you'll be getting one of the best cameras you can find on an Android phone, with video stabilization that's almost too good. The Pixel is still listed at $649 on the Google Store, but expect that price to come down with the launch of the sequel. My next pick is bound to ruffle some feathers, because it's a phone I couldn't really recommend to anyone when I reviewed it. The Essential phone launched later than promised with half-finished software, and a camera system that, to put it charitably... Well, you can't put it charitably. It as bad. You think those shortcomings would entitle switchers to a discount, but you'd be wrong. At 699, the Essential phone costs exactly what an iPhone 8 does. So, what's it doing on this list? Well, not everyone buys phones for the same reasons. For many folks, smartphones today are what cars were 20 years ago, an opportunity to express their own sense of style through their most used possession. Essential is on this list for all the people who bought iPhones because of their iconic minimalist design. With a ceramic backplate and titanium gunnels, this phone is likely more drop and scratch resistant than Apple's latest. And the distinctive widow's peak at the top of the display is smaller and less obtrusive than the iPhone X's big notch. On top of that, you've got a similarly simplistic stock Android experience with little, if any, bloatware. Honestly, it's almost too stark. If you take a lot of pictures, I still can't recommend it, despite the several updates that have landed since release. But if your main priority is fit and finish, and money is no object, this is a much classier choice than, say, a Vertu would have been. If you walk the line between physical refinement and tastefully tweaked software, you'll arrive at what I think is the most balanced choice for iPhone switchers in 2017, the OnePlus 5. This is the latest in a long line of excellent Android phones that few in the US have ever heard of, mainly because they're not sold by carriers. But there are two main reasons OnePlus is worth your time. Software and price. The former is called Oxygen OS, and it's very close to stock Android. And stop me if you've heard this before, but the modifications OnePlus has made give you more control over the look and feel, while still avoiding the trap of gunking up the works and slowing everything down. The dual camera system doesn't live up to the big promises OnePlus made, but it's still more than fine for everyday photographers. And while the chassis is on the generic side, it's certainly not ugly, and it feels good in the hand. If that sounds like a lot of seesawing back and forth, yep, it sure is. And you'll learn to live with that when you're saving hundreds of dollars. The OnePlus 5 is the most affordable smartphone on this list, with a starting price of $479. Of course you can find cheaper Android phones out there, much cheaper ones. But with maybe one or two exceptions, I think the OnePlus 5 is as low as you can get without starting to make the kind of performance and capability sacrifices that would turn off an iPhone switcher. Before we go, I wanna throw one honorable mention to Sony. That's a little weird, because this company makes essentially no effort to market its phones in the US. And if you do buy an American version, it has its fingerprint sensor disabled. Long story. On top of that, the company's design language hasn't changed since 2012. So why would you wanna go of importing one of these? Well, we're back aesthetic territory here. As stale as that design might be, it is iconic, and it does turn heads. On top of that, it's waterproof, which none of the other phones on this list are. So, iPhone users accustomed to boat or bathtub phoning won't have to adapt. And while the camera doesn't reach Pixel or Galaxy levels in terms of quality, the latest generation does pack a feature you can't find anywhere else. Ultra slow motion video. I know, I've brought this up constantly since I reviewed the XZ Premium this summer, and it's not because Sony pays me to promote it. In fact, the company doesn't even answer my emails anymore, which hurts my feelings. But once you've shot video at nearly a thousand frames a second, with a device you can totally leave on the table at a fancy restaurant, well, you kind of get why Sony fans are so attached to their Xperias. It's the kind of exclusive club mentality Apple fans used to have before their preferred products became so pervasive in the US. So, iPhone expats would probably feel right at home on one of these. That's why Sony gets the honorable mention. Remember folks, this list is just my own personal take. And as with most of my videos, it's heavily US focused. So if you're not already typing away, head on down to the comments and drop your own recommendations and subscribe to The Mr. Mobile on YouTube so you don't miss the next big wave of phone, laptops, smartwatch, and electric car videos to carry us into the fall. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "Android",
        "iPhone",
        "Android phone",
        "Pixel",
        "stock Android",
        "phones",
        "phone",
        "Galaxy phones",
        "list",
        "cheaper Android phones",
        "Galaxy",
        "top",
        "excellent Android phones",
        "Essential phone",
        "OnePlus",
        "Google Pixel",
        "Sony",
        "find",
        "big",
        "find cheaper Android"
    ],
    "transcript_entity_values": [
        "699",
        "479",
        "a good year",
        "2017",
        "a thousand bucks",
        "October of 2018",
        "weeks",
        "the Google Store",
        "half",
        "this summer",
        "Xperias",
        "Samsung",
        "nearly a thousand",
        "October 2019",
        "Apple",
        "American",
        "YouTube",
        "Mobile",
        "Pixel",
        "the Google Pixel",
        "today",
        "US",
        "OnePlus",
        "iPhone",
        "2012",
        "first",
        "Oxygen OS",
        "Google",
        "two",
        "Galaxy",
        "the past three years",
        "Pixels",
        "second",
        "OnePlus 5",
        "20 years ago",
        "iPhones",
        "hundreds of dollars",
        "Samsung Galaxy S8",
        "Vertu",
        "Every year",
        "649",
        "about a month",
        "iPhone 8 and 8 Plus",
        "the XZ Premium",
        "Sony",
        "S8",
        "one",
        "Android",
        "8"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "DATE",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "NORP",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.052297115325927734,
        -0.011338743381202221,
        0.13730834424495697,
        -0.058248937129974365,
        0.03470923379063606,
        -0.006145290099084377,
        -0.0018552818801254034,
        0.10151207447052002,
        -0.05265582725405693,
        0.021795552223920822,
        0.005575459450483322,
        -0.014316200278699398,
        -0.009691677987575531,
        0.029179025441408157,
        0.026833735406398773,
        -0.010657968930900097,
        0.08550479263067245,
        -0.03762184455990791,
        -0.0019474612781777978,
        -0.006460191681981087,
        -0.04901144653558731,
        0.005787739530205727,
        0.0576813630759716,
        0.00809349026530981,
        0.05853859707713127,
        0.07087437808513641,
        -0.09950849413871765,
        -0.04511751979589462,
        -0.048004355281591415,
        0.037362467497587204,
        0.005480279214680195,
        0.10959557443857193,
        0.018748190253973007,
        -0.034614987671375275,
        -0.09008904546499252,
        -0.10230186581611633,
        0.005176973063498735,
        0.024903669953346252,
        0.05460205301642418,
        -0.019069647416472435,
        -0.017695888876914978,
        -0.02154267393052578,
        -0.010852918028831482,
        0.03890480101108551,
        -0.00978868082165718,
        -0.046113140881061554,
        0.056771405041217804,
        -0.013343999162316322,
        0.006167122162878513,
        0.03732362389564514,
        0.007148086559027433,
        -0.04316813126206398,
        -0.011671511456370354,
        0.0034965386148542166,
        -0.08568926900625229,
        -0.021998487412929535,
        -0.050405800342559814,
        -0.015828298404812813,
        0.07356821745634079,
        -0.054147399961948395,
        0.049756329506635666,
        -0.031329743564128876,
        0.012569059617817402,
        0.029331808909773827,
        -0.028272094205021858,
        -0.03646925091743469,
        -0.001319394214078784,
        0.007288073189556599,
        0.045077551156282425,
        0.030770570039749146,
        0.0191938579082489,
        0.04693777486681938,
        0.06433230638504028,
        0.01388369221240282,
        0.04970017820596695,
        0.05817297846078873,
        0.05932353809475899,
        -0.0339076854288578,
        -0.04510938376188278,
        0.001049346523359418,
        0.03014598786830902,
        0.001890468061901629,
        -0.06855496764183044,
        -0.022138992324471474,
        -0.008905460126698017,
        -0.02463308349251747,
        -0.045656412839889526,
        0.08013606071472168,
        -0.032203853130340576,
        -0.03061315417289734,
        -0.043632086366415024,
        0.10102643817663193,
        0.03306505084037781,
        -0.025080962106585503,
        0.043318431824445724,
        0.041298218071460724,
        -0.02675108052790165,
        -0.0757691040635109,
        -0.053192950785160065,
        -0.00035219648270867765,
        0.01869671419262886,
        0.028577378019690514,
        -0.022287266328930855,
        0.017062978819012642,
        0.013066718354821205,
        -0.07575549930334091,
        -0.023905815556645393,
        -0.0359940379858017,
        0.0230447668582201,
        0.08265753835439682,
        -0.00014355032180901617,
        -0.04781278967857361,
        -0.057359740138053894,
        -0.06434154510498047,
        -0.02611948922276497,
        0.011407770216464996,
        0.018432755023241043,
        0.040774326771497726,
        0.09484992176294327,
        0.08564872294664383,
        -0.04516283795237541,
        0.015501033514738083,
        -0.07748834043741226,
        -0.04467441514134407,
        0.0004354302363935858,
        0.02534244768321514,
        -0.06925047188997269,
        1.319537867368616e-33,
        -0.018762607127428055,
        0.11757604032754898,
        -0.02463046833872795,
        1.6425767171313055e-05,
        -0.04275744408369064,
        -0.024175697937607765,
        0.004838739056140184,
        0.007130489218980074,
        -0.007894483394920826,
        -0.00016613041225355119,
        -0.031458985060453415,
        0.02346661314368248,
        -0.06165671348571777,
        -0.013706416822969913,
        0.14208783209323883,
        -0.08584777265787125,
        -0.06654007732868195,
        -0.06684219092130661,
        0.005515913479030132,
        -0.024259649217128754,
        -0.019436009228229523,
        -0.03993111848831177,
        -0.02076527662575245,
        0.02890591137111187,
        0.004147182684391737,
        -0.04931715503334999,
        0.09917211532592773,
        -0.05865360423922539,
        0.0032115126959979534,
        -0.034453678876161575,
        -0.08294486254453659,
        0.0057076564989984035,
        0.030017515644431114,
        -0.03592171519994736,
        -0.06874661147594452,
        0.022235548123717308,
        -0.07281818240880966,
        -0.07653022557497025,
        0.05382472276687622,
        -0.015346229076385498,
        -0.1243259534239769,
        0.049443211406469345,
        -0.04290922358632088,
        0.05396830290555954,
        0.1188356801867485,
        0.06682226806879044,
        -0.052725546061992645,
        -0.02225968986749649,
        0.01993645168840885,
        -0.06695513427257538,
        -0.01652051880955696,
        -0.026066472753882408,
        -0.028787964954972267,
        -0.019164318218827248,
        -0.08336658775806427,
        -0.014868075028061867,
        0.021032555028796196,
        -0.01872088387608528,
        -0.007145773619413376,
        -0.03013641946017742,
        -0.04837809503078461,
        0.02674390934407711,
        -0.061124179512262344,
        0.013602694496512413,
        -0.06372637301683426,
        0.0558907650411129,
        0.026504140347242355,
        -0.06462093442678452,
        -0.05407192185521126,
        0.08318747580051422,
        0.033116891980171204,
        -0.07349853217601776,
        0.07247558981180191,
        0.0013449160614982247,
        0.06236405670642853,
        0.09173808991909027,
        0.06845100224018097,
        -0.0766838788986206,
        0.018231887370347977,
        -0.02926960401237011,
        0.03481738641858101,
        0.009559066966176033,
        -0.010771858505904675,
        0.04447178170084953,
        0.07612751424312592,
        -0.016788551583886147,
        -0.014032126404345036,
        -0.08280158787965775,
        0.06253963708877563,
        0.06932118535041809,
        -0.06733240932226181,
        0.03104383498430252,
        -0.021077826619148254,
        0.06972790509462357,
        -0.0028719238471239805,
        -2.1590403923888805e-33,
        -0.010776838287711143,
        -0.05391542613506317,
        0.0339527428150177,
        0.03126268833875656,
        0.03130022808909416,
        -0.04570696875452995,
        -0.03707016259431839,
        0.018349818885326385,
        -0.004122901242226362,
        -0.06565442681312561,
        -0.06781817227602005,
        0.019152449443936348,
        0.052281204611063004,
        0.07070667296648026,
        -0.00725373812019825,
        0.00728311063721776,
        -0.036360546946525574,
        -0.11167514324188232,
        -0.00659631472080946,
        0.0044166166335344315,
        0.02956443652510643,
        0.08244173973798752,
        -0.02412928268313408,
        0.04300743713974953,
        -0.03545866534113884,
        -0.037791911512613297,
        -0.06522661447525024,
        0.031092878431081772,
        -0.005759548861533403,
        -0.06719382107257843,
        -0.017903368920087814,
        -0.13368164002895355,
        0.05606312304735184,
        0.0008813173044472933,
        0.0848245769739151,
        0.06361094117164612,
        -0.011221899650990963,
        -0.00629397900775075,
        -0.0034243199042975903,
        -0.007980795577168465,
        0.006143481470644474,
        -0.004679366946220398,
        0.11614873260259628,
        0.0094894515350461,
        0.06345032155513763,
        0.011378034017980099,
        -0.07043053209781647,
        0.04665565863251686,
        0.01176008302718401,
        0.032379429787397385,
        -0.005228775087743998,
        0.053066324442625046,
        -0.07754567265510559,
        -0.007692907936871052,
        -0.025321682915091515,
        0.018550772219896317,
        0.017734818160533905,
        -0.030497783794999123,
        -0.010514706373214722,
        -0.015279417857527733,
        0.04644903168082237,
        0.04644789919257164,
        0.019033288583159447,
        0.001169721712358296,
        -0.08398979157209396,
        -0.06408528983592987,
        0.049479831010103226,
        -0.028600219637155533,
        -0.05987934768199921,
        0.02692596986889839,
        -0.06710922718048096,
        -0.04207747057080269,
        -0.022100279107689857,
        -0.07174087315797806,
        0.0233281459659338,
        0.07110600918531418,
        0.01451064646244049,
        0.008297302760183811,
        -0.035407181829214096,
        -0.05039128288626671,
        0.04765781760215759,
        0.1674366295337677,
        0.0455966517329216,
        -0.004425351042300463,
        0.09604446589946747,
        0.09807600826025009,
        0.03443457931280136,
        -0.0016204952262341976,
        -0.034682922065258026,
        0.024109605699777603,
        0.017981184646487236,
        -0.013730187900364399,
        -0.048543840646743774,
        0.029156280681490898,
        0.011242439970374107,
        -5.049503926102261e-08,
        0.08784019201993942,
        -0.03881756588816643,
        0.06151032820343971,
        -0.04565666615962982,
        0.012777687981724739,
        -0.027327919378876686,
        -0.07932458817958832,
        -0.01519422885030508,
        0.19146785140037537,
        0.029447104781866074,
        0.024336937814950943,
        -0.06517883390188217,
        -0.04580090939998627,
        0.13552626967430115,
        0.031678732484579086,
        0.04418855905532837,
        0.008458185009658337,
        -0.007266014814376831,
        -0.01322952751070261,
        -0.01208146009594202,
        -0.026865027844905853,
        0.05994125083088875,
        -0.005421702284365892,
        -0.02709759771823883,
        0.01592934876680374,
        0.012052026577293873,
        0.011148921214044094,
        -0.0485554039478302,
        0.028494928032159805,
        0.01019924134016037,
        -0.00423428975045681,
        -0.017958512529730797,
        0.04478684812784195,
        -0.04970616474747658,
        -0.038619499653577805,
        -0.010488430969417095,
        0.031431857496500015,
        -0.03403603658080101,
        0.03347295522689819,
        -0.006960771512240171,
        0.03381211310625076,
        -0.06921865791082382,
        0.008713075891137123,
        0.002979998243972659,
        -0.0029763493221253157,
        -0.11691295355558395,
        0.01771005429327488,
        -0.11904679238796234,
        0.027081472799181938,
        0.07924544811248779,
        -0.020894715562462807,
        -0.07315714657306671,
        0.0340510755777359,
        -0.0567866675555706,
        0.11123804748058319,
        0.006608026102185249,
        -0.037518762052059174,
        0.016557486727833748,
        -0.012299967929720879,
        0.0202285535633564,
        0.10162520408630371,
        -0.12008639425039291,
        -0.03970535099506378,
        0.10659734904766083
    ]
}