{
    "id": "7R71uDa3DNw",
    "title": "How to build a Library in Africa? - IT IS FINALLY FINISHED!!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-03-12T13:13:00Z",
    "video_url": "https://www.youtube.com/watch?v=7R71uDa3DNw",
    "category": "Howto & Style",
    "tags": [
        "Kenya Africa",
        "Library Project",
        "Jerryrig library",
        "Africa library",
        "service",
        "build library",
        "schools for africa",
        "books for africa",
        "education",
        "kenya",
        "I need your help",
        "uplift Pamoja"
    ],
    "views": 496893,
    "likes": 56586,
    "comments_count": 3494,
    "description": "A project a year and a half in the making - We are finally finished with the Library in Budalangi Kenya. THANK YOU to everyone who donated books and Thank you again for watching my videos. It took us an entire YEAR - The Library is now COMPLETE! If you ever visit the library - PLEASE send us pictures!  My grandma befriended Philip in South Africa about 15 years ago - and hes been an honorary member of my family ever since. Coming to family reunions - weddings - and even though we aren't actually related - he definitely feels like a member of the family. If you want to help out the community in Kenya - you can donate to his foundation here:   Watch the Well Drilling video here:  Watch the Original video here:  See more of the books in our library:   And I cant say it enough... but THANK YOU SO MUCH FOR WATCHING!!   Get my Shirts and Razor Knife here!    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.upliftpamoja.com/",
        "https://youtu.be/qUKg8Y-0dWs",
        "https://youtu.be/EHWQs2v_NS8",
        "https://youtu.be/6pnrwgIXH2I",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Normally a library is supposed to be peaceful and quiet, but since today is opening day here in Kenya, I'll make an exception. All of these kids and even more outside are super excited to read the books you have donated. Getting ahead of myself a little bit. Let's get started. [Intro] [African music playing] Almost 6 months ago my Kenyan uncle and I came to you with what seemed like an impossible dream to build an entire library halfway around the world in Kenya, Africa. The library will be built in a town where Philip grew up called Budalangi. And this library would be the only library within 100 miles. And amazingly when we mentioned this project and asked for help, books came pouring in from all across the USA over 34,000 books to be exact. And for the last 3 months all of that precious cargo has been navigating its way around the globe and has finally safely made it to Africa. Does this container look familiar? It's the one that was parked outside of our shop in Utah full of books, ready to go into the library. They have arrived. Oh no! When it comes to organizing the books, luckily most of that was done when we consolidated the books at our warehouse in Utah. All the boxes inside of the library are already labeled. Let me give you a little tour. Coming in here through the front doors. We set all the boxes initially over here in the corner. We're going to have a kids' space right here...we're going to have teenagers...and as we go around the library they will get older and older to the adult section. You know, the adult fiction, the educational books, the adult self-help, anything that you can use to learn...maps, biographies, all kinds of books. History, nonfiction, and we have a bunch of shelves that we're filling up here in the middle. It's coming along very nicely and it'll all look much more organized when we're finished. And we have quite a lot of little helpers. The very last box. Good job, buddy! Now that the books are out it's time to organize them. It's been amazing seeing my community and Philip's community come together to accomplish something that will ripple through generations. Knowledge is power and these books that you've sent will help create a solid foundation for anyone who wants to walk through the front doors. This library is 100% free and 100% open to the public. So if you ever find yourself in Budalangi, Kenya feel free to stop by. So it has been a year and a half with hundreds of thousands of people. How does it feel to be this close to being done? -[Philip] Man, it feels good. It feels really good. Just looking around, everything looks amazing. -How many books did you have access to growing up? -So there are a couple of books here that I'm just so happy they're here. The Hardy Boys were my favorites, but we didn't have the whole series. We just had one or two books and we'd share the whole book through the whole class. And so when I see them here I'm just like...it's amazing. I'm really excited about this. -So when you were trading the books around did they survive being handed around back and forth? -They have to. I mean, because the book...you didn't own the book...maybe one of your friends just had the book and you had to take really good care of it because if you mess it up they're not going to give you the book again or another book. And so it was always like...it was so precious you know. Now that I think about it, I don't think I ever finished the Hardy Boys series but that's because...I mean nobody had the whole series. People had one...it wasn't like the whole set. -Now the whole set is here so you can come check it out from the library whenever you're back. [Laughing] -I feel like I'm going to do that. -So my YouTube channel's named after my grandpa, if you didn't know. And so we decided to name this library after Philip's grandma. -Yeah, her name is Teresa Oyiolo. I grew up with my grandma and she was always very intelligent and was always very encouraging and just very helpful. She was an amazing woman and I feel like this is the best way to honor her name. I grew up around here, not very far from the library, without lots of things around me. Me and my grandma, we used to live...and my brothers, we all used to live in a mud hut with a grass roof and we didn't have that much. But the idea of an education is the key around here because most people probably are still in the same situation. But not being able to provide this avenue of learning, it kind of opens up to the next generation just being able to access the knowledge, be able to read, be able to learn. I think that's the only thing that is an equalizer. You can come from whatever background, but that puts you on the same level with everyone else. -One of the reasons I like books so much is because they remove so many of the potential for failure. There are no batteries, there's no updates, there's no moving parts that might break just pure knowledge ready for anyone at the turn of a page. And they also need no electricity. If the entirety of humanity were to fail, libraries like this one would be the building blocks for where it can be recreated from scratch. A little bit extreme there but you get my point. There's no real alternative for a tangible, physical library like this one. And knowledge cannot be taken away. Thanks to you guys we dedicated probably about a quarter of the library to children's books because that's just how the books naturally came in...how they were naturally donated. Since we didn't ask for specific books, people just sent in their favorites and it turned out really well. -This is where it all begins. This is the foundation. It's really cool. So guys thank you so much for this. -Let Philip know if you would sign up for Story Time with Philip down in the comments. [Laughing] -Maybe we can do story time tomorrow. We can get some parents here tomorrow morning with their kids and sit them there and read some books to them. -Pretty amazing that all of these books came from people all across the United States, and the world, consolidated in Utah, and then brought down here to Kenya. And then in this room right here we were expecting about 15-20,000 books, but at the end of the day we got 34,000 and so this pile of boxes here are books we couldn't fit on the shelves. And that pile back there are duplicates, you know, like box sets of Harry Potter and stuff like that that are going to be distributed to other libraries all throughout Kenya because we're transitioning and handing this library off to the government and the Kenyan National Library. And so all of these books will be able to be circulated throughout Kenya at some point which is pretty amazing. -[Child] What's your name? -[Zack] Zack. -[Child] Zack. -[Zack] Nice to meet you. -[Child] Nice to meet you. [Cheering] [African children singing] -[Zack speaking to the crowd] This library is a result of my community working with your community to bring together a massive collection of books and knowledge. It's great to be here and I'm honored to be in your presence. -[Child] Zack, look here! -[Zack] Kenya has two official languages: Swahili and English. And during the opening ceremony, the Kenyan National Library brought over a few thousand books from Kenyan authors to be included with ours here as well. And of course we finished drilling the water borehole as well, but I'll save that for another video. [Children speaking at the opening ceremony] -And there you have it. An absolute success. Thank you so much for donating all of these books and for watching my videos and for making this happen. One of the coolest experiences of my entire life. -[Children] Thank you for the books! -And thank you for watching. I see you around. [African singing and music from the opening ceremony]",
    "transcript_keywords": [
        "books",
        "library",
        "Kenyan National Library",
        "Kenya",
        "book",
        "Philip",
        "peaceful and quiet",
        "make an exception",
        "National Library",
        "amazing",
        "Kenyan",
        "Kenyan National",
        "Utah",
        "Knowledge",
        "people",
        "feel",
        "Hardy Boys",
        "Good",
        "community",
        "Africa"
    ],
    "transcript_entity_values": [
        "a few thousand",
        "about 15-20,000",
        "Kenya",
        "hundreds of thousands",
        "Philip",
        "morning",
        "about a quarter",
        "the Kenyan National Library",
        "100%",
        "two",
        "Kenyan",
        "a year and a half with",
        "Harry Potter",
        "Africa",
        "Story Time",
        "tomorrow",
        "African",
        "English",
        "Teresa Oyiolo",
        "Almost 6 months ago",
        "USA",
        "the United States",
        "opening day",
        "the end of the day",
        "100 miles",
        "Philip",
        "Swahili",
        "34,000",
        "today",
        "Budalangi",
        "One",
        "YouTube",
        "Utah",
        "one",
        "the last 3 months"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "PERSON",
        "TIME",
        "DATE",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "NORP",
        "DATE",
        "PERSON",
        "LOC",
        "WORK_OF_ART",
        "DATE",
        "NORP",
        "LANGUAGE",
        "PERSON",
        "DATE",
        "GPE",
        "GPE",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "NORP",
        "CARDINAL",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "DATE"
    ],
    "vector": [
        -0.09150028228759766,
        0.11010103672742844,
        -0.005700690671801567,
        0.012727866880595684,
        -0.022385356947779655,
        -0.02047305926680565,
        -0.07997670024633408,
        -0.02909582480788231,
        -0.06056743860244751,
        0.08580099046230316,
        0.005474961828440428,
        -0.069475919008255,
        -0.015156150795519352,
        -0.061028238385915756,
        -0.030303196981549263,
        0.015105894766747952,
        -0.01785731501877308,
        0.02379920706152916,
        -0.134795144200325,
        0.024178827181458473,
        -0.020531028509140015,
        0.006490950006991625,
        0.10902567952871323,
        -0.01878007873892784,
        -0.009325288236141205,
        0.07338188588619232,
        -0.05585641786456108,
        0.0017573621589690447,
        0.01509066391736269,
        -0.013911797665059566,
        0.03788672015070915,
        0.022385641932487488,
        -0.06866789609193802,
        0.05129987373948097,
        0.04526946693658829,
        0.0943518579006195,
        -0.0016752106603235006,
        0.07620762288570404,
        0.025260770693421364,
        -0.015115389600396156,
        0.07842769473791122,
        -0.028398241847753525,
        0.06968042254447937,
        -0.06376561522483826,
        0.01819635182619095,
        -0.026025457307696342,
        0.04649984836578369,
        -0.0105820307508111,
        -0.02428969368338585,
        -0.009295320138335228,
        -0.030428240075707436,
        0.016948625445365906,
        -0.010176518931984901,
        -0.11139165610074997,
        -0.030106019228696823,
        -0.01101358886808157,
        -0.004635747987776995,
        -0.03892279788851738,
        0.014851944521069527,
        -0.0121056092903018,
        0.07884282618761063,
        -0.008660745806992054,
        -0.07082147896289825,
        0.04180903360247612,
        0.00482566561549902,
        -0.06284141540527344,
        0.006852679420262575,
        0.0448823980987072,
        0.04403895512223244,
        -0.05610333010554314,
        0.017700903117656708,
        -0.05469541251659393,
        0.08869367837905884,
        0.01422672625631094,
        0.057626720517873764,
        0.04712163284420967,
        -0.013770118355751038,
        0.0058151730336248875,
        -0.042194344103336334,
        -0.04397769644856453,
        0.025434384122490883,
        0.003625740297138691,
        0.0708765909075737,
        -0.035708799958229065,
        -0.06114935502409935,
        -0.02411344088613987,
        0.035705264657735825,
        -0.023527704179286957,
        -0.011769385077059269,
        -0.0691535547375679,
        0.015508757904171944,
        0.009175274521112442,
        0.05735953152179718,
        -0.0010781021555885673,
        -0.01419899519532919,
        -0.052441831678152084,
        0.012508001178503036,
        0.040161002427339554,
        -0.09569450467824936,
        0.07243768870830536,
        -0.04124930500984192,
        0.008138258941471577,
        0.0904117077589035,
        -0.05183813348412514,
        0.011298974975943565,
        -0.0036976023111492395,
        -0.06499693542718887,
        0.08997565507888794,
        0.04141634330153465,
        -0.0032830119598656893,
        -0.08703376352787018,
        -0.010853061452507973,
        -0.0964791402220726,
        -0.008112926036119461,
        0.0401373915374279,
        -0.08412745594978333,
        -0.052070021629333496,
        -0.03988397866487503,
        0.016403917223215103,
        -0.0011456296779215336,
        -0.017895348370075226,
        -0.04743095859885216,
        -0.05223149061203003,
        -0.10249044001102448,
        -0.054917920380830765,
        -0.03950316458940506,
        0.014556069858372211,
        1.8854224090578998e-33,
        0.10508269816637039,
        0.08314520120620728,
        0.0038704094476997852,
        0.028639063239097595,
        0.05425760895013809,
        -0.016717804595828056,
        -0.02384050004184246,
        -0.0065839774906635284,
        -0.1247376948595047,
        -0.0008446515421383083,
        0.05142864212393761,
        0.04700618237257004,
        -0.022298308089375496,
        0.050020184367895126,
        -0.10759905725717545,
        0.0028193709440529346,
        -0.022774048149585724,
        -0.08838848024606705,
        0.011446647346019745,
        0.02771059051156044,
        0.012395471334457397,
        -0.045153696089982986,
        -0.0030794914346188307,
        0.029270634055137634,
        0.126679927110672,
        -0.030321910977363586,
        0.04971202462911606,
        -0.044033098965883255,
        0.005660232622176409,
        0.0323416069149971,
        -0.0328093096613884,
        0.00822884775698185,
        -0.051886141300201416,
        -0.16872256994247437,
        -0.05927012860774994,
        -0.03943195566534996,
        -0.0763770043849945,
        -0.11273795366287231,
        -0.03464732691645622,
        -0.056392911821603775,
        -0.02329430729150772,
        -0.04089067131280899,
        -0.007320729084312916,
        0.07358679175376892,
        -0.057319555431604385,
        0.06711689382791519,
        0.1224449872970581,
        0.026668749749660492,
        0.120273657143116,
        0.02994528040289879,
        -0.0026714943815022707,
        -0.038936734199523926,
        -0.07119502872228622,
        0.014263156801462173,
        -0.00649208202958107,
        -0.04823240265250206,
        -0.007138955872505903,
        0.04865049943327904,
        0.11234290152788162,
        -0.07171344757080078,
        0.12036506086587906,
        -0.014341038651764393,
        -0.0030014398507773876,
        0.07181838154792786,
        0.041194576770067215,
        -0.0701274648308754,
        -0.028509346768260002,
        0.038128260523080826,
        0.04284465312957764,
        -0.11445336043834686,
        -0.012544737197458744,
        0.05547317489981651,
        0.0006861459114588797,
        -0.02493324689567089,
        -0.001451031886972487,
        0.11027614027261734,
        -0.01801098696887493,
        0.023565534502267838,
        0.030417636036872864,
        0.030598962679505348,
        -0.0031079212203621864,
        0.061461690813302994,
        0.02119031921029091,
        -0.020562835037708282,
        -0.015753792598843575,
        -0.025211943313479424,
        0.01634567230939865,
        -0.06342819333076477,
        -0.06429416686296463,
        -0.012810691259801388,
        -0.009952663443982601,
        0.00400261115282774,
        -0.03896322846412659,
        -0.08369743078947067,
        -0.0013475306332111359,
        -4.70821560487217e-33,
        0.13733068108558655,
        -0.039103951305150986,
        0.04309540614485741,
        -0.007685869000852108,
        0.07494381070137024,
        -0.0813216120004654,
        -0.058625783771276474,
        0.005777296144515276,
        0.0633305236697197,
        -0.03836153447628021,
        0.020771093666553497,
        -0.03350580483675003,
        0.12795720994472504,
        -0.0021400556433945894,
        -0.03653470054268837,
        -0.05271364375948906,
        0.013398267328739166,
        0.028812287375330925,
        0.07561154663562775,
        -0.034931331872940063,
        0.012191792950034142,
        0.04571950435638428,
        0.014567469246685505,
        -0.04180612787604332,
        -0.04212171956896782,
        -0.005124952644109726,
        -0.04160727187991142,
        -0.04112207889556885,
        -0.0585695244371891,
        0.00407234113663435,
        -0.06552335619926453,
        0.0509684756398201,
        -0.04289868846535683,
        -0.009418178349733353,
        -0.08175181597471237,
        0.024983618408441544,
        0.03276301175355911,
        -0.0584835521876812,
        -0.06000857427716255,
        -0.07285282015800476,
        0.09157249331474304,
        0.08083874732255936,
        -0.00014121798449195921,
        -0.00862728338688612,
        0.018356401473283768,
        -0.030519651249051094,
        -0.006428600288927555,
        0.021101798862218857,
        -0.000423482182668522,
        -0.05314331874251366,
        0.06656604260206223,
        0.0597175769507885,
        0.0030506043694913387,
        -0.04935198649764061,
        0.1015893742442131,
        0.08667629957199097,
        0.0601111575961113,
        -0.04227391630411148,
        -0.001384622068144381,
        -0.011201662942767143,
        -0.10037259757518768,
        0.019469603896141052,
        -0.02845936454832554,
        0.04991602525115013,
        -0.05681566894054413,
        0.008958668448030949,
        0.016216082498431206,
        0.006210761144757271,
        -0.005324151366949081,
        0.011744092218577862,
        0.006580824498087168,
        -0.043136730790138245,
        0.0038752059917896986,
        -0.032244592905044556,
        0.0484209768474102,
        0.10434167832136154,
        0.058428581804037094,
        0.03422863781452179,
        0.027417002245783806,
        -0.013326385989785194,
        0.012068198062479496,
        -0.054677028208971024,
        0.011990802362561226,
        0.056808024644851685,
        0.04298056289553642,
        0.008082381449639797,
        0.044167038053274155,
        -0.08277314156293869,
        -0.0050737010315060616,
        0.04876766353845596,
        -0.051892172545194626,
        -0.05566754564642906,
        0.03661137446761131,
        0.06230694800615311,
        0.045553721487522125,
        -5.950191450665443e-08,
        0.04844280704855919,
        0.07290313392877579,
        -0.05503256618976593,
        -0.02195907197892666,
        0.04074888676404953,
        0.058355290442705154,
        -0.01889924332499504,
        -0.013614794239401817,
        -0.052485391497612,
        0.021748732775449753,
        -0.018904976546764374,
        0.03737363964319229,
        -0.07953152805566788,
        0.033594466745853424,
        -0.022391177713871002,
        -0.029706837609410286,
        0.05916697904467583,
        -0.005482357926666737,
        -0.01947113685309887,
        -0.008506529033184052,
        0.04512321203947067,
        -0.044707052409648895,
        0.10217809677124023,
        -0.005986206699162722,
        0.04429680481553078,
        0.06289681792259216,
        -0.029302500188350677,
        -0.024697374552488327,
        0.03762528672814369,
        -0.002071026246994734,
        0.003843356389552355,
        0.017552202567458153,
        -0.07082891464233398,
        0.011820186860859394,
        0.0431239940226078,
        -0.08515267074108124,
        -0.06269261986017227,
        -0.016758976504206657,
        -0.02455400675535202,
        0.028724106028676033,
        0.021789994090795517,
        -0.07772306352853775,
        0.020159762352705002,
        0.029093267396092415,
        0.00011661712051136419,
        0.04276442527770996,
        0.033176593482494354,
        0.025921108201146126,
        -0.11010478436946869,
        -0.04934477433562279,
        -0.06533750146627426,
        -0.020371301099658012,
        -0.025635037571191788,
        0.01805950701236725,
        0.037702012807130814,
        -0.02154865860939026,
        0.028359806165099144,
        0.0443619005382061,
        0.009039254859089851,
        0.012411227449774742,
        0.027602583169937134,
        -0.07105320692062378,
        -0.07797901332378387,
        -0.019631683826446533
    ]
}