{
    "id": "7szwZ3xigro",
    "title": "Fixing a Viewer's BROKEN Gaming PC? - Fix or Flop S3:E12",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2023-01-09T22:43:18Z",
    "video_url": "https://www.youtube.com/watch?v=7szwZ3xigro",
    "category": "Science & Technology",
    "tags": [
        "fix or flop",
        "fix",
        "fixing a viewer's broken gaming pc",
        "broken gaming pc",
        "fixing a pc",
        "how to fix a pc",
        "pc no post",
        "how to troubleshoot",
        "greg salazar",
        "how to build a pc",
        "broken computer",
        "pc doesnt turn on",
        "how to fix a computer",
        "how to fix a broken pc",
        "pc wont post",
        "fix or flop season 3",
        "fof",
        "season 3",
        "episode 12",
        "s3e12",
        "pc doesn't post",
        "gaming pc"
    ],
    "views": 130026,
    "likes": 8424,
    "comments_count": 374,
    "description": "SPONSOR: Shop VIP-SCDKey OEM Windows 10 Pro keys for $16 and use code 'SKGS' for a 25% discount:   Welcome to Fix or Flop! We're up to Season 3, Episode 12. This viewer's gaming PC doesn't POST! Is it something we can quickly fix? By the way, if you live in the Orlando, FL area and have an issue with your PC, apply to have it (possibly) fixed for free today!   Check out other Fix or Flop episodes in this playlist:    Consider supporting us on Patreon!    My troubleshooting gear: FLIR C5 Thermal Camera:  Skybasic Digital Microscope:  YIHUA Soldering Station:  Helping Hand Soldering Board:  Xool 80 Precision Tool Set:  PassMark Inline PSU Tester:    My cleaning gear:  SYINE Respirator Mask:  Scott Shop Towels:  Electric Air Duster:  ONSON Cordless Vacuum:  Medical Grade 99.9% Isopropyl Alcohol:  Q-tips Cotton Swabs:  Xool 80 Precision Tool Set:  Hizek Black Disposable Gloves:    My studio gear: Sony a6600 (Primary):  Sony a6400 (Secondary):  2x Pixio PX277 Prime 165Hz IPS Monitors:  Neewer LED Lighting Kit:  Audio-Technica AT2035:  Yamaha MG10XU Mixer:  Neewer Microphone Arms:  Arrowzoom Sound-Damping Foam Panels:    Follow me on social media: TWITCH:  FACEBOOK:  TWITTER:  INSTAGRAM:    Join our public Discord server:   DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our Rakuten account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.  #FixOrFlop",
    "description_links": [
        "https://bit.ly/Win10SKGS",
        "https://gregsalazar.com/fix-or-flop",
        "https://youtube.com/playlist?list=PLyReHG5dDxXXSgTLdfvdzJpFei941MX6H",
        "https://www.patreon.com/gregsalazar",
        "https://geni.us/3ALEI",
        "https://geni.us/6zurf",
        "https://geni.us/DbjS",
        "https://geni.us/7DDrL",
        "https://geni.us/1IfxDSw",
        "https://bit.ly/3BoBHoQ",
        "https://geni.us/V4uA",
        "https://geni.us/rIy5O6Y",
        "https://geni.us/RALt4",
        "https://geni.us/aABrFWE",
        "https://geni.us/tBVQ",
        "https://geni.us/nQhVVQm",
        "https://geni.us/1IfxDSw",
        "https://geni.us/MBCJaf",
        "https://geni.us/k8VBToq",
        "https://geni.us/24nqw",
        "https://geni.us/bCg4nD",
        "http://geni.us/9VTXr0",
        "http://geni.us/xvQc",
        "http://geni.us/d4VvGM",
        "http://geni.us/1w5Sx2Y",
        "http://geni.us/EKFxZc",
        "http://www.twitch.tv/GregSalazar",
        "http://www.facebook.com/GregSalazarYT",
        "http://www.twitter.com/GregSalazarYT",
        "http://www.instagram.com/GregSalazarYT",
        "https://discord.gg/jYA9Xvp"
    ],
    "transcript": "- [Greg] This here is another viewer's broken gaming PC. This was assembled with some older parts, and it does not POST which means it doesn't send a picture out to the monitor. This rig is the Thermaltake Smart BM2 550-watt power supply, which should be plenty for this combination of hardware here, a GTX 750 TI from EVGA. Oh, it's a shame EVGA doesn't make graphic cards anymore. (chuckles) They made some really good ones, especially in this generation and the two generations after that. I really loved the Maxwell and Pascal stuff. The Ryzen 5 4500 CPU in this rig is paired with an A320 motherboard, I believe 16 gigs RAM. Now, the very astute of view, probably already no, or at least suspect, what the issue could be here with the no POST but we're gonna give it the run through anyway. This could be an easy one, or it could be a super-difficult one. We've run into our fair share of both here. So without further ado, let's jump straight into this one right after this. Stay with me. (air whooshing) To get rid of that annoying Windows activation watermark, head on over to VIP-Scdkey and purchase a Windows 10 Pro OEM key for a fraction of the price of retail. Just use a secure payment method like PayPal, enter your product key into your PC settings window and say bye-bye to the watermark and be sure to use our offer code S-K-G-S for a sweet discount. (air whooshing) Hey there and welcome to the Fixer or Flop playlist. For those who are new, the premise here is simple. We offer to fix viewer systems in and around Orlando, Florida for free. If you have a broken computer, maybe it doesn't turn on, or it doesn't send a signal out, as is the case here, feel free to reach out to us directly via the link in this video's description, and we'll do our best to get back to you as quick as possible and attempt to repair it. You won't pay anything at all. Even if we have to throw hardware into the rig to get it up and running again, $0 and 0 cents. I'll either dip into my own pocket and buy a secondhand replacement on a site like eBay, especially if the system's old. I have no choice. I can't buy new, or we'll have vendors send replacement hardware out. They appreciate the exposure. We're able to make videos on this content, (chuckles) so we can monetize it, and that's, yeah. Just, I think it works the best for everyone involved. First things first, we need to power the system on and make sure that what we see in person matches with what the owner is describing. In this case, again, no signal to the monitor, which implies that the system should at least power on. That's like half the process. Let's see. (computer whirling) Okay, so it does power on. I can hear the pump. I don't even know what kind of AIO this is. I do hear churning fluid though. That's a good sign. Fans in the graphics card... are spinning. Chassis fan's not spinning. It's not plugged in. That's why, but no picture out. So, alright, we're on the same page. Now, those who I said were fairly astute probably have an idea what could be wrong with this. This being an A320 motherboard, and the fact that it's paired with a Ryzen 5 4500 apparently means we might have a BIOS incompatibility issue. If the A320 board was purchased without the necessary BIOS needed to run Zen+ CPUs outta the box, then you'll get this right here, a system that looks like it should be working, but you'll get no picture out, and the fact that this is an A320 motherboard from a few years ago means that we do not get the BIOS flashback function built into this board. So if you bought this CPU motherboard combo thinking they'd work outta the box, well, you'd actually need a compatible CPU already in hand to update this motherboard's BIOS with before installing the newer chip. That's the problem a lot of folks ran into in the beginning. Thankfully a lot of newer boards have the BIOS flashback function or an equivalent of that. So you don't need a compatible CPU already in the socket. This one, though, will definitely need one. That is, of course, assuming that it's a BIOS problem. The owner has no idea and for that matter, neither do I, just the hunch I have. So it's a bit of a chicken before the egg dilemma. I mean, honestly, in this case, maybe borrow a friend CPU if you have to. AMD used to send out loaners in dire situations to folks who had no other way of updating the BIOS. In this case, the fact that we're talking about a Ryzen 5 4500 paired with an A320 board I mean, I am very doubtful that those two are compatible out of the box. Unless that motherboard was manufactured far, far into the product's lifecycle, it's probably running an inferior BIOS revision, but all that said, I wanna try a couple of other things first. Usually clearing the CMOS is, like, literally, like, a few seconds process. I had to remove the graphics card in this case because, well, JBAT1 is right under the 16-lane PCIe slot. Kind of annoying but anyway, we're already here so why not? So once this clears, we'll try powering the system back on. So we'll try for a post, and then we'll also check RAM seating. That takes literally seconds. I'll swap his DIMMs out for one of my known working DIMMs as well just to rule that out but of course, it has to be difficult just because this cooler is wedged right against the tops of these DIMMs. There's no way to get these DIMMs out without removing the AIO or the radiator assembly at least, and that's pretty annoying. (chuckles) So I'm gonna go with my gut here. At this point, again, I would be swapping DIMMs out or swapping, yeah, swapping modules just to rule them out because they're so easy to do but in this case, they're really not. So what I actually want to try is swapping out. We could rule out the graphics card first just to be on the safe side. I already had to remove that once. Let's go ahead and swap the card out. Again, I still think it's a BIOS issue, but we're just gonna rule out the 750 TI being an issue because it is an older card. So we're gonna slide our tiny XFX unit in here. No supplemental power needed, and I'm kind of hoping this doesn't work because that would rule out the card and would, again, point to, more than likely, the BIOS being the problem, which means we don't need to replace any hardware and sure enough, a whole lot of nothing. So I think this card's fine. Granted, I can't try different slots on this board because there's only one primary 16-lane slot, and the other slot is a very small one that his Wi-Fi card is plugged into. So really no other option (chuckles) there. The the next step is to replace the CPU. Normally this wouldn't be required with more modern boards, but we have no choice here. So I'm going to put a native compatible Zen 1 CPU in here. I think the only one I have is a Ryzen 7 1700X, and try for a post. If we do get that post, then, at that point, we can hop into the bios, update it and then swap his newer CPU back in. Hopefully we'll also get a post. (chuckles) That's the plan anyway. Oh my gosh, (chuckles) I can't judge 'cause I've done this before, but can you believe this? That's literally the sticker, the warning sticker. It's still on the cold plate, which means this cooler is doing literally nothing. I don't know about you guys, but I think it's a really good thing this system never actually worked. (chuckles) That's not gonna get you anywhere. The CPU, by the way, is indeed a Ryzen 5 4500. I haven't personally come across too many of these and just a quick physical inspection. Everything on the underside of his CPU looks to be fine, no missing pins, no bent pins, and same goes for the socket, very clean. All right, and let's see if I was right. Let's see if our 1700 works. I have high hopes. if I'm wrong, well, at least it's all on camera, right? (chuckles) So there's that. I'm expecting a post though. We should get something here because these two chips should work natively with each other, even though it's an A320 board, which is now something you normally pair with a 1700X. Yes, there we go. That's our post. So that was literally all this was. It came down to the BIOS revision on the board. So we need to hop onto the vendor's website, download the latest bio that's compatible with Zen+ Zen 2 CPUs. We'll get that on the board and then throw his chip back in. We should get the same result. Now, the only worrying thing here is that there are only a few BIOS revisions posted for this board, and none of them mention anything about CPU compatibility. So I'm just gonna choose the latest, the most recent non-beta revision, and we're gonna get that on his board. I'm gonna hop into M-flash. I didn't expect it to shut off. (chuckles) Some of these older, cheaper boards have slightly slower ways of updating things. So when this powers back up, we should be in the M-flash portal and from there, we can pull in the new BILOS from our thumb drive. I'm hoping that's where we end up. Okay, entering flash. That's a good sign. So that's our SanDisk. BIOS file does not exist. The system will auto... Oh my gosh, okay, round two. Just, yeah, in some cases, again, older boards. I should have known this. Just put the ROM file in the root of the drive that you've connected, and then it should find it no problem. We'll click that and let the BIOS update. During this process, do not turn the system off. Don't touch anything, just go get a coffee, come back. Hopefully it's sunny outside, and you don't doing this in the middle of a thunderstorm. I've been there. It's not pretty. Oh, and won't you look at that? Loaded right into windows. So the storage drive in here, obviously, had to be pulled from a working system, or maybe the system was working by itself at one point with an older CPU in it. I don't know the full story. That said, let's go ahead and get the 4500 back in his rig and hope that the BIOS update fixed the issue. You can see we've got it re-pasted. Now we'll just sandwich the block back down. All right, let's quickly check. I'm gonna power on the unit in the rear, power button up front and I also, when I was rewiring things, I realized that this case fan doesn't really have a header. There's only two fan headers on the entire board, and that's one of the downfalls of going with a cheaper A320 chipset. I don't have a splitter or a hub that I can give him. I looked around for a bit. So it's not the end of the world but yeah, it's just gonna be sitting there, not turning. (laughs) Come on, we're gonna get a signal. No signal, no signal, we keep getting the same prompt. Something needs to pop up, please. Yes! There it is. (laughs) Okay, all right. Oh, okay, it's not even giving me time to show stuff. That's the 4500 in the rig, and this is Windows loading up now. So that's great news. So the last thing we need to do is swap his graphics card back in here that we tried to rule out earlier and clean things up at tad, and his system will be ready to go. - [Narrator 2] A few moments later. - All right, and here we are with all of his original hardware back in, cables sorted a bit. I wanna triple-check here. Let's make sure that it posts, and I expect that it will because his card, I think, was perfectly fine. There is always a bit of a delay, (laughs) a bit of suspense to deal with, but that right there is what we're looking for. Awesome, so this just came down to a BIOS update, though, I am very glad it came in for that because attempts would've been awful and might have even damaged the chip. Although, it's fairly rare with new chips just 'cause they throttle back so hard when they realize that they're thermally limited. (chuckles) That cover on the cold plate was definitely not a good thing. So really glad that we were able to take care of that for him, even though it was kind of like an inadvertent potential issue down the line, and the only other issue with this build right now is just the fact that that last fan can't receive power. It's not plugged in. A simple $2, $3 adapter will take care of that. So, looks good. We're into Windows now and yeah, mission accomplished. Thank you so much for watching. Hopefully you found this at least entertaining. Maybe you learned a thing or two. This is not the first time we've run into a BIOS incompatibility on this channel, specifically in this playlist. So this might not be all that thrilling of an episode to some of you, but it's important to reiterate, again, the need to verify BIOS revisions on boards that you're buying, especially for some older Zen platforms. So if you are, let's say, buying on eBay a Ryzen 5 3600, and you're shopping for a used B450 motherboard, you're gonna have to be very careful about the board that you buy if, especially if it doesn't support something like BIOS flashback because unless the seller discloses that the BIOS has been updated to support Zen 2, in this case, you could be in this person's shoes here, in need of an older chip to update the BIOS and yeah, it's just a weird predicament, like I said, chicken-before-the-egg-type deal. So I'm glad we could get this one back up and running again, and he's super excited. I already sent him the message and showed him the picture of it booted up. So that'd be cool to see his reaction when we give it back to him. Again, thanks for watching and let me know in the comment section below what you thought of this one. Consider subscribing, leaving a like and supporting us on Patreon, joining our public Discord server, et cetera, et cetera. All of that is greatly appreciated. My name is Greg. Thanks for learning with me.",
    "transcript_keywords": [
        "BIOS",
        "CPU",
        "back",
        "BIOS update",
        "board",
        "system",
        "BIOS flashback",
        "card",
        "POST",
        "Ryzen",
        "BIOS revision",
        "Zen",
        "case",
        "power",
        "compatible CPU",
        "BIOS incompatibility",
        "motherboard",
        "boards",
        "graphics card",
        "issue"
    ],
    "transcript_entity_values": [
        "first",
        "A320",
        "2",
        "Orlando",
        "only two",
        "3",
        "SanDisk",
        "TI",
        "half",
        "Maxwell",
        "1700X.",
        "a few years ago",
        "GTX",
        "Fixer",
        "PayPal",
        "Ryzen 5 4500",
        "two",
        "Wi-Fi",
        "Patreon",
        "a few seconds",
        "Discord",
        "BIOS",
        "only one",
        "CPU",
        "750",
        "2",
        "0",
        "4500",
        "Florida",
        "A320",
        "Windows",
        "Zen 2",
        "0 cents",
        "Zen 1 CPU",
        "one",
        "1700",
        "eBay",
        "XFX",
        "EVGA",
        "RAM",
        "Windows",
        "AIO",
        "Greg",
        "Windows 10",
        "First",
        "CMOS",
        "AMD",
        "Thermaltake Smart",
        "POST",
        "16",
        "550-watt",
        "JBAT1",
        "Pascal"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "GPE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "LAW",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "WORK_OF_ART",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON"
    ],
    "vector": [
        -0.12489061057567596,
        -0.07210177183151245,
        0.023334071040153503,
        -0.0682210624217987,
        0.0956554114818573,
        -0.003932769410312176,
        0.020116707310080528,
        -0.021449679508805275,
        -0.06293316930532455,
        0.012261595577001572,
        0.07065936923027039,
        0.0804210752248764,
        -0.09279651939868927,
        0.026792090386152267,
        0.0324300155043602,
        -0.014768511988222599,
        -0.007449534721672535,
        -0.026580730453133583,
        -0.03972252830862999,
        0.04682071879506111,
        -0.0638132318854332,
        -0.06722643226385117,
        -0.026209063827991486,
        -0.0036128151696175337,
        -0.039497364312410355,
        0.01691165380179882,
        -0.050166621804237366,
        0.015422070398926735,
        -0.08654548972845078,
        -0.019507315009832382,
        -0.016542796045541763,
        0.049832507967948914,
        -0.02611699141561985,
        0.037685327231884,
        0.1393195241689682,
        -0.032875437289476395,
        0.0031139410566538572,
        -0.03343792259693146,
        -0.10805993527173996,
        -0.00205505033954978,
        -0.03522729128599167,
        -0.007407138589769602,
        -0.01238060463219881,
        0.03397329896688461,
        0.0648854449391365,
        -0.008978510275483131,
        0.022616373375058174,
        -0.016354456543922424,
        0.033576369285583496,
        0.02099226787686348,
        -0.0787438452243805,
        0.02894958108663559,
        0.07096784561872482,
        -0.0754883885383606,
        -0.03810695558786392,
        -0.014604433439671993,
        0.026949595659971237,
        0.0014125150628387928,
        0.023568471893668175,
        -0.04616883769631386,
        0.07111287862062454,
        -0.030959732830524445,
        -0.05223165452480316,
        0.0636240690946579,
        0.0052010901272296906,
        0.06354551762342453,
        0.054570361971855164,
        -0.06933338195085526,
        0.00036267831455916166,
        0.021160654723644257,
        -0.0784001424908638,
        0.01027414295822382,
        -0.028727831318974495,
        0.032207414507865906,
        0.002387290820479393,
        0.052744198590517044,
        -0.00416647270321846,
        -0.11164971441030502,
        0.04418988153338432,
        -0.0017617375124245882,
        0.019073398783802986,
        -0.0772697776556015,
        -0.02261549048125744,
        0.04776468127965927,
        0.04483279958367348,
        0.012612558901309967,
        0.001914806431159377,
        -0.02293097972869873,
        -0.013501645065844059,
        -0.01762467809021473,
        -0.07585067301988602,
        0.024982118979096413,
        0.08050049841403961,
        -0.0017359107732772827,
        0.06480979174375534,
        0.031022818759083748,
        0.07302297651767731,
        -0.04907180368900299,
        -0.09374906122684479,
        0.05994168296456337,
        -0.025633418932557106,
        -0.005616649053990841,
        0.10029302537441254,
        -0.08474601805210114,
        0.016776487231254578,
        -0.01719735749065876,
        -0.03195728361606598,
        0.03033630922436714,
        -0.063219353556633,
        -0.015778420493006706,
        0.015059848316013813,
        0.035164766013622284,
        -0.026552893221378326,
        -0.017746159806847572,
        0.08004613220691681,
        -0.0017706119688227773,
        -0.029297824949026108,
        0.04703103378415108,
        0.007383937947452068,
        -0.018386557698249817,
        0.034697726368904114,
        0.005926166195422411,
        -0.04242749139666557,
        -0.017842113971710205,
        0.06287308782339096,
        0.007774261757731438,
        0.00023976001830305904,
        6.730034296875826e-33,
        0.013515285216271877,
        0.03654850646853447,
        -0.010190143249928951,
        -0.0380944162607193,
        0.004286889918148518,
        -0.0064359400421381,
        0.09375838935375214,
        0.026330549269914627,
        -0.005050021223723888,
        0.10238508135080338,
        0.035961877554655075,
        -0.006845759693533182,
        -0.028658811002969742,
        -0.05126946046948433,
        0.0002422614343231544,
        -0.023728154599666595,
        -0.0014832245651632547,
        0.03615511953830719,
        -0.12759749591350555,
        0.017654547467827797,
        0.011040708981454372,
        -0.05491802468895912,
        0.032426271587610245,
        -0.004172428511083126,
        -0.008684317581355572,
        0.049612633883953094,
        -0.08481486886739731,
        0.028412893414497375,
        0.12326694279909134,
        0.021280137822031975,
        -0.027506809681653976,
        0.012900055386126041,
        0.008920673280954361,
        -0.016597930341959,
        -0.06695147603750229,
        -0.03938745707273483,
        -0.034103475511074066,
        -0.08686493337154388,
        -0.0016408967785537243,
        0.003691751742735505,
        -0.06279215961694717,
        0.022018099203705788,
        -0.023803986608982086,
        -0.03539993613958359,
        0.018580233678221703,
        -0.018720462918281555,
        0.008749132044613361,
        0.04640892520546913,
        0.03750009834766388,
        0.02327415533363819,
        -0.07834348827600479,
        0.0312783345580101,
        0.019464872777462006,
        -0.01602589525282383,
        -0.08068697899580002,
        -0.027075517922639847,
        0.06232469156384468,
        0.005557353608310223,
        0.04129401594400406,
        0.06750106066465378,
        0.07694167643785477,
        0.00727840606123209,
        0.029347911477088928,
        -0.043303247541189194,
        -0.04507016763091087,
        -0.02292647957801819,
        0.08176541328430176,
        0.06439322978258133,
        -0.018457863479852676,
        -0.0308973491191864,
        -0.01692432351410389,
        0.010004429146647453,
        0.0006729749729856849,
        0.009260294958949089,
        0.05344872549176216,
        0.0036031324416399,
        -0.0460219569504261,
        -0.011332487687468529,
        -0.0520569309592247,
        -0.0010351379169151187,
        0.021307403221726418,
        -0.01837155409157276,
        0.029531527310609818,
        -0.00517025962471962,
        -0.05960855260491371,
        -0.045865681022405624,
        -0.038636524230241776,
        0.06789998710155487,
        -0.03059438243508339,
        -0.02500697784125805,
        -0.014742876403033733,
        -0.04978066682815552,
        0.015051170252263546,
        0.018227946013212204,
        -0.001617999980226159,
        -6.986295738774931e-33,
        -0.044143639504909515,
        -0.11307298392057419,
        0.006071928888559341,
        0.059881653636693954,
        -0.022566882893443108,
        -0.02766718715429306,
        -0.009587001986801624,
        0.0035489259753376245,
        0.08530665189027786,
        -0.07199044525623322,
        -0.04758409783244133,
        0.04213728383183479,
        -0.09326083213090897,
        -0.03372611105442047,
        -0.004005353432148695,
        0.025000277906656265,
        -0.09172512590885162,
        0.013001170009374619,
        0.044056739658117294,
        0.04868089780211449,
        0.09985685348510742,
        0.0497647188603878,
        0.0272211991250515,
        0.08234434574842453,
        -0.020037809386849403,
        0.06975925713777542,
        0.05679407715797424,
        -0.02920936606824398,
        0.04143510013818741,
        0.05611327663064003,
        0.07526503503322601,
        0.055357012897729874,
        -0.031775329262018204,
        0.05711878091096878,
        0.05152019485831261,
        -0.04039081558585167,
        0.03320765867829323,
        -0.038452256470918655,
        -0.06936737149953842,
        -0.03523120656609535,
        0.06476893275976181,
        0.06116028130054474,
        -0.034734517335891724,
        0.07999929040670395,
        0.025091057643294334,
        0.007957679219543934,
        -0.007458628620952368,
        -0.08245348930358887,
        0.026670800521969795,
        0.04850592464208603,
        -0.036780353635549545,
        -0.04307915270328522,
        -0.02900281734764576,
        -0.01414739154279232,
        -0.0203191377222538,
        0.05480420961976051,
        -0.071218341588974,
        -0.013336130417883396,
        -0.08442378789186478,
        -0.028423266485333443,
        0.010302092880010605,
        0.029990609735250473,
        -0.0300471018999815,
        -0.052080973982810974,
        0.07555683702230453,
        0.03959273546934128,
        0.12582920491695404,
        0.06555511057376862,
        -0.0008575874380767345,
        -0.03597903251647949,
        -0.05397886782884598,
        0.03966743126511574,
        -0.010622420348227024,
        -0.12186963856220245,
        0.059661027044057846,
        0.07925941050052643,
        -0.07235110551118851,
        0.007064179051667452,
        0.02710908092558384,
        0.011564480140805244,
        0.01543204952031374,
        -0.11951829493045807,
        -0.034930985420942307,
        0.07639293372631073,
        0.05485287681221962,
        0.003743184730410576,
        0.02695600874722004,
        0.0679691731929779,
        -0.015349171124398708,
        -0.063883937895298,
        -0.05043851584196091,
        0.016400223597884178,
        0.0471297912299633,
        0.050792209804058075,
        0.02678072638809681,
        -5.940447778129965e-08,
        0.03690742328763008,
        0.0877808928489685,
        0.014056943356990814,
        0.027267683297395706,
        0.017288055270910263,
        -0.04049272462725639,
        -0.00696150166913867,
        0.05864250659942627,
        -0.004604982677847147,
        -0.026711178943514824,
        -0.019804732874035835,
        -0.0606314055621624,
        0.008391428738832474,
        -0.0485646016895771,
        0.057619042694568634,
        -0.06547364592552185,
        -0.13282354176044464,
        0.14825211465358734,
        -0.08146947622299194,
        -0.09168083220720291,
        0.009342840872704983,
        0.03319113701581955,
        0.13194218277931213,
        -0.04807513952255249,
        -0.018391549587249756,
        0.013054153881967068,
        -0.03293263539671898,
        0.034009624272584915,
        0.0891907811164856,
        -0.03461606055498123,
        -0.06067508086562157,
        -0.07847068458795547,
        0.06583695858716965,
        -0.05173260718584061,
        0.03038712404668331,
        -0.0718853697180748,
        0.056677911430597305,
        0.043830279260873795,
        0.11700209230184555,
        0.027560094371438026,
        -0.05356738343834877,
        -0.10417930781841278,
        -0.061727214604616165,
        0.008250776678323746,
        -0.0626629963517189,
        -0.018812483176589012,
        -0.05663757398724556,
        -0.032064005732536316,
        -0.023214390501379967,
        -0.07112247496843338,
        -0.044586844742298126,
        0.0274217389523983,
        -0.08422259241342545,
        0.06486592441797256,
        0.0442034937441349,
        0.010952742770314217,
        0.010095158591866493,
        0.043252356350421906,
        0.05619234964251518,
        0.07146836817264557,
        -0.033031150698661804,
        -0.05415443331003189,
        -0.11193842440843582,
        0.062450770288705826
    ]
}