{
    "id": "7ZiVVHnIM6Y",
    "title": "iBook G3 Clamshell (ft. 512 Pixels and Michael MJD) - Vintage Apple Vault #1",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2018-08-30T20:00:24Z",
    "video_url": "https://www.youtube.com/watch?v=7ZiVVHnIM6Y",
    "category": "Science & Technology",
    "tags": [
        "iBook G3 Clamshell (ft. 512 Pixels and Michael MJD) - Vintage Apple Vault #1",
        "iBook G3 Clamshell (ft. 512 Pixels and Michael MJD)",
        "Vintage Apple Vault",
        "Apple",
        "Macintosh",
        "Mac",
        "iBook G3 Clamshell",
        "iBook",
        "Steve Jobs",
        "512 Pixels",
        "Stephen Hackett",
        "Michael MJD",
        "Computer",
        "Tech",
        "Vintage",
        "Vintage Tech",
        "Old Macs",
        "old Macintosh",
        "old Computers",
        "apple computer",
        "AirPort",
        "Wi-Fi",
        "Wireless networking",
        "iBook G3 Clamshell 20th Anniversary!"
    ],
    "views": 50613,
    "likes": 1612,
    "comments_count": 238,
    "description": "20 years ago, on July 21, 1999, Steve Jobs introduced the first iBook; it solidified Apples new product strategy, and set the bar for future notebook computers. Join Ken, Stephen Hackett from 512 Pixels, and Michael MJD, as they explore this vintage Mac. Plus, another collector swings by and shows how he uses this 90s computer in a modern setting.  Get more vintage Apple tech!   Dont miss future tech videos!   Want a chance to be featured?    See more of Michaels collection    Like the CC on Facebook   Follow the CC on Twitter    Special thanks to our special guests: Stephen Hackett -  Michael MJD -   Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?    THE AWESOME PEOPLE BEHIND VINTAGE APPLE VAULT Brent Penrose (PenroseFilms) Will Dylan Hopf Carl P. Ken Hoerz Zach Unferth Druaga1 (@druaga_1) Stephen Hackett (@ismh) Colin Wirth (@ThisDoesNotComp) Michael MJD (@mjdtweets) Nauta (Sinneau) Nic (Lilz) Ken Amazon links are powered by the Amazon Associates Program.  #AppleProductHistoryCC #Apple #ComputerClan",
    "description_links": [
        "http://applevault.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://thecomputerclan.com/vault",
        "http://bit.ly/2Nt11xY",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://bit.ly/clan2MF88Xb",
        "http://bit.ly/clan2wgiKl6",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- Hey how's it going? Question for you. Have you ever used a laptop before? That was probably a dumb question. You probably have used a laptop before but do you know what they were like in the late '90s? That brings me to what I want to show you guys today. And I'm going to be helped out by fellow YouTubers, Michael MJD and Stephen Hackett from 512 Pixels. And I found another Mac collector that has a few tips and tricks to keep this particular computer still functioning in today's environments, despite it being from the '90s. When Steve Jobs came back to Apple, he wanted to revamp the product strategy. Which left us with this blank square. Enter, the iBook G3 Clamshell. So, the iBook G3 Clamshell. This thing came out before the MacBook even existed. This thing goes back aways. And it was one of Steve Jobs' new ideas for the company. So when Steve Jobs came back to Apple in 1997, the company was on the verge of bankruptcy and there like a zillion product platforms. It was so frickin' confusing. So Steve Jobs said how about we just have four great products? That's all we need. Let's do a laptop and a desktop and make a consumer and professional version of each of those. So, four products. He introduced three of them. And then got to the blank square. The blank square, was the iBook G3 Clamshell. It was revealed at Macworld New York 1999 and it was officially released on June 21st, 1999. This particular model is the graphite version. This was released a little bit later, on February 16th, 2000. The computer actually came in a bunch of different colors and it had a lot of interesting design changes that you really didn't see on the market. So, let's take a closer look at the design and the specs. Essentially the goal of this computer was to be an iMac to go. And that kind of makes sense because it kind of follows some of the iMac design in a more compact form factor. And it looked totally different than what you would normally see in a laptop on the market at the time. So this particular iBook featured 192 megabytes of RAM. Yeah, megabytes, that's what we dealt with back then. And a 300 megahertz PowerPC G3 processor. The display was 12.1 inches big and it ran at a resolution of 800 by 600. This computer actually had quite a few types of IO on it. It had a 12 megabit per second USB port, a 56K modem port, a 10 base 100 Ethernet port, and unlike the iPhone 7, a headphone jack. And on the right side, we had a tray loading optical drive. And honestly, all those specs are fine and dandy but the killer feature of this computer was AirPort wireless networking. Steve Jobs literally picked the computer up and like ran a hula hoop around it to show that hey there's no cord connected to this thing. - There's this great demo where Steve Jobs is browsing on the iBook and then he just walks away from the table. People freak out when they realize what's going on. - Here let me show them the, show these guys how it works. (audience cheering) - Wireless network connectivity, like browsing the internet without plugging in a cable, in 1999 for a consumer laptop, what the heck? That was unheard of. So, AirPort introduced that to the mainstream. And coincidentally, the night before we shot this episode, Apple officially discontinued AirPort. It lived a long life, and it introduced wireless networking to the masses. So cool thing about upgrading this computer and getting into the internal components was that you could actually do it right through the keyboard. These two notches on top, would just flip up and the keyboard would lift right out. Giving you access to components. Including the AirPort card. So, that was kind of an easy open solution with this old iBook. - [Michael] And then this is so unlike Apple. At least today by the way. - So with this being a portable machine, and with it having wireless networking. Can it still actually be usable nowadays if you're out in a coffee shop or somewhere where you can't plug in and you just want to browse the web? It may be from 1999 but there might be some ways to make it fit in a modern environment still even almost 20 years later. We'll revisit that in a bit. So some other unique features about this laptop include this. Watch carefully. You'll notice it closed just like a flip phone. There's no latch. There's no hook. There's no button you need to press to unhook it and open it back up. It just worked kind of like a flip phone. A rather unique, but still very fun feature of the iBook G3 Clamshell. The iBook G3 actually came in a bunch of different colors. It initially came in two colors, blueberry and tangerine. But, more were introduced later and stick around because my buddy Michael MJD, he's actually going to show you a different color of the iBook G3. But again, I have the graphite, and the colors were just kind of like, this nice rubber, like it was this clear see through plastic and then you had this nice rubber coating which is something you didn't see on any other laptop at the time. But probably the most fun feature which maybe doesn't fit in nowadays is, the built in handle. So you can carry it with you around the office, to school, you know, across the quad. You know, kind of looks like a clutch purse when you kind of carry it by the handle. But, that was one thing Apple did. They built handles into a lot of their products. And the iBook G3 Clamshell was no exception. In fact, that's kind of similar to what they did with the Apple 2C, how it had a handle on the back. All right, so I have some guests that are going to show off their own iBook G3s so stay tuned for that. They got some cool stuff to share. And also, we're gonna be showing some audience photos of your own computer setups. So feel free to stick around for that and submit your own for next time and you know what? I'm not perfect when filming these episodes, so we got a blooper reel for you. So we'll be playing that at the end. So now, let's take a look at some other collectors that I've collaborated with as they show off their iBook G3 Clamshells. - Hello computer client and viewers, my name is Michael, known as Michael MJD here on YouTube. I run a tech centered channel and I've been doing so for the past eight years. A little bit about me, I've actually been collecting Apple products since early 2010. Actually around the same time that I started my YouTube channel. This machine was actually the second Apple computer that I ever got. The first one was the Power Mac G4 Cube. So this one was number two in my Apple computer collection. And I saw this ad on my local craigslist for an iBook G3 Clamshell but there were no pictures so I was really, you know intrigued by the ad. Because of what he was offering. He was not offering just the iBook, but also the original box and all of the different accessories that it came with. So things like the charger and the original software CD. So he was offering kind of a whole bundle which was pretty awesome. And we ended up actually meeting up. He did email me back and say yeah, you know this is for sale. It's in great condition. And I ended up paying him $100 and I walked away with not just the iBook but also all those other accessories. - Hang on a second! A hundred dollars! Are you kidding me? I paid like $250 for this thing and it doesn't even have a freakin' like first party charger. Who were you talking to? Sorry, sorry, it's your time to shine. I'm sorry. I'll let you get back to it. I'll be over here if you need me. - [Michael] So when I first got this machine in 2010, I never really used it as my main computer. I really only use this as a secondary machine and also just to kind of have up on a shelf to act as a display piece and a collector's item. When I would have people over they would usually ask me hey that looks cool. Where'd you get it? And I would tell them this whole story that I'm telling you guys basically. And that's pretty much it for me. That's my whole experience with it. So thanks for watching my segment. - Hi, my name is Stephen Hackett and I'm the host of the 512 Pixels YouTube channel. I want to talk to you today a little bit about the iBook G3. And I brought to the table a couple of interesting things. It was the first Mac to come with AirPort wireless networking. It also brought some of the fun from the iMac G3 down to a notebook. Colorful design that was actually pretty rugged, 'cause it had that rubber injected edges that brought the color to it. You saw a bunch of these in schools and given to kids because they were basically indestructible. Now some of those design trends didn't make it to later iBooks, let alone the computers we have today. I mean when's the last time you saw a notebook with a handle? However the iBook showed that Apple can make a consumer notebook that people really wanted. And today, the consumer notebook line's a little bit messy with Apple. But for a really long time, Apple had a compelling offering sort of in this price range. These things ran OS 9 and early stages of OS X. In fact, when I got my iBook, it was really the first time I'd ever really used OS 9. I came to the Mac well into the OS X era and this iBook which was the very first computer in what would become my collection, really showed me where Apple had been in the past. And I think if we know where computing has been, we can make better guesses about where it will be in the future. Now today I don't use my iBook all that often. When I want to run OS 9, I've got a G4 that I have installed on, 'cause it's a lot faster. But that doesn't mean this computer doesn't hold a special place in my heart. My original blueberry seen here really is beautiful but the other colors are just as much fun. Something I wish Apple would bring back to the Mac line beyond just shades of space gray. - [Ken] For my last collector guest of the day, I traveled to the Twin Cities to mean up with a person named Nauta. Who actually collects vintage Apple products and uses them in modern environments sometimes. And he has some tips to make that possible. - This model is a conservative graphite colored instead of the tangerine or blueberry also available at the time. This also has an Apple logo that as you can see when opened, faces the wrong way. This is the last Apple laptop to have this feature. This model was given to me by a friend who moved to England. Didn't want to take it with him but knew that I would take care of it. While graphite carried over from the first generation clamshell to the second generation, blueberry did not. Blueberry was one of the colors available in the first generation along with tangerine. This became indigo in the second generation. Which also featured, the rare key lime color. Which, apparently nobody wanted in a portable laptop because hardly any of them are available today on the used market. But hey, I got it for 40 bucks and they go on eBay for 200 plus, so I'm happy. I like coffee shops a lot. And one of the things I like to do at coffee shops is to bring a little computer that wouldn't normally be seen there. The clamshell iBook is a great example of this. Because it was the first Apple laptop to feature wireless internet technology. My current clamshell iBook is a blueberry model that was originally only supported up to 10.3 Panther. To implement some useful features, I had to find a way to install 10.4 Tiger on it and I did this by using the CD version of the installer and using XPostFacto, a third party client that allows you to install OS's that didn't normally come supported on those machines. The next hurdle to overcome was to use a web browser that actually allowed you to still browse the internet and use websites that are available today. TenFourFox is a fork of the popular Firefox browser that implements later features but retains compatibility with earlier versions of the macOS. Wireless technology has moved on quite a bit since the iBook was made in the year 2000. Therefore, you have to find another way to implement the wireless technology to circumnavigate things like WPA encryption and five gigahertz routers. I do this by using my cell phone to tether or so it's called, to use as a wireless access point that's open without any form of encryption. To keep it secure, I only allow one connection. And that connection is my iBook. This way I can use my old technology anywhere I want. And I don't have to worry about wireless compatibility. - So our collectors had some cool stuff to show but guess what? I know you guys do too. So it's time to show off your setup. And the showoff your setup winner from this episode is, Ryan from iTekApple, and look, it's an iBook. Bonus points, my man. Well thanks for your submission Ryan, and congratulations. Feel free to submit photos of your own computer setups. They don't have to be Mac setups. They can be PC setups, I don't care. Just feel free to send in some photos with the link in the description down below and maybe your photo will be featured in the next episode of Vintage Apple Vault. So there you have it. The Apple iBook G3 Clamshell. The final piece to Apple's revamped product strategy. And you know, I think it's fair to say that a lot of features we still use today in notebooks were kind of rooted in this bundle of colorful plastic and silicone, it's kind of cool. Oh, and I didn't forget, I still have bloopers I want to share with you guys, so wait until the end. So I hope you had fun coming along with me today in taking a look at the iBook G3 Clamshell. And you know what? Guess what, bring a friend next time. I'm cool with that. It'll be fun and I have a lot more to share with you guys. So feel free to let me know in a comment down below what other products you want to see on Vintage Apple Vault. I'm all ears. Aside from that, that's all I have for you guys today. So, thanks for watching, I really appreciate it. And I'll see you in the not too distant future. - I just realized something really bad, cut. (laughing) This was Apple's first iBook, before the notebook. Before the notebook existed. (laughing) - [Man] That screen, it went dark, [inaudible]. - Oh [muted], nice. Cut, one take wonder! So I hope you had fun coming along and tech, tech, tech, teching out, teching out, actually that could be a new verb. I'll be over here if you need me. Oh the wall's there, alright, cut.",
    "transcript_keywords": [
        "Apple",
        "iBook",
        "Steve Jobs",
        "computer",
        "Clamshell",
        "vintage Apple",
        "Apple computer",
        "kind",
        "Vintage Apple Vault",
        "clamshell iBook",
        "today",
        "time",
        "Apple laptop",
        "laptop",
        "Apple products",
        "Steve",
        "wireless",
        "Apple Vault",
        "Apple iBook",
        "show"
    ],
    "transcript_entity_values": [
        "Michael MJD",
        "two",
        "the Twin Cities",
        "YouTube",
        "10.3",
        "jack",
        "Vintage Apple Vault",
        "zillion",
        "four",
        "one",
        "iBook",
        "Ethernet",
        "G3",
        "iBooks",
        "early 2010",
        "56",
        "1999",
        "G3 Clamshell",
        "AirPort",
        "the iBook G3",
        "YouTubers",
        "Firefox",
        "Stephen Hackett",
        "Apple",
        "12.1 inches",
        "100",
        "A hundred dollars",
        "five gigahertz",
        "12 megabit",
        "Mac",
        "first",
        "iBook",
        "iMac",
        "100",
        "almost 20 years later",
        "G3",
        "the Power Mac G4 Cube",
        "Nauta",
        "192 megabytes",
        "the Apple 2C",
        "TenFourFox",
        "MacBook",
        "AirPort",
        "three",
        "the year 2000",
        "USB",
        "the iPhone 7",
        "9",
        "300 megahertz",
        "like $250",
        "WPA",
        "600",
        "40 bucks",
        "June 21st, 1999",
        "today",
        "AirPort",
        "YouTube",
        "iBook G3 Clamshells",
        "Steve Jobs",
        "1997",
        "10",
        "the late '90s",
        "IO",
        "10.4",
        "Michael",
        "England",
        "2010",
        "800",
        "200",
        "third",
        "XPostFacto",
        "eBay",
        "Pixels YouTube",
        "512",
        "Mac",
        "iBook G3 Clamshell",
        "February 16th, 2000",
        "Macworld New York 1999",
        "RAM",
        "Steve Jobs'",
        "G4",
        "iMac G3",
        "the '90s",
        "iBook G3",
        "second",
        "the past eight years",
        "Ryan",
        "the day"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "FAC",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "EVENT",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "DATE",
        "FAC",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "GPE",
        "CARDINAL",
        "PERSON",
        "GPE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "PERSON",
        "DATE"
    ],
    "vector": [
        -0.09594976156949997,
        -0.03263890743255615,
        -0.005907372105866671,
        -0.12565450370311737,
        0.005264123436063528,
        -0.007262322120368481,
        0.030660534277558327,
        0.03843807801604271,
        0.025866316631436348,
        -0.01972508803009987,
        0.012423600070178509,
        -0.03450401499867439,
        -0.03782696649432182,
        0.000970900000538677,
        -0.02071543224155903,
        0.006583633366972208,
        0.07774863392114639,
        -0.006949139758944511,
        0.005217314697802067,
        0.02846679836511612,
        -0.01569865643978119,
        -0.05440041422843933,
        0.024707958102226257,
        -0.046044401824474335,
        0.025465304031968117,
        0.04479950666427612,
        0.06869550049304962,
        -0.035718344151973724,
        -0.062354426831007004,
        -0.040383707731962204,
        -0.015579169616103172,
        0.010562037117779255,
        0.018719693645834923,
        0.04682161659002304,
        0.022175947204232216,
        -0.0695958361029625,
        0.08970380574464798,
        0.02169785462319851,
        -0.08405886590480804,
        -0.07591383159160614,
        -0.1124945655465126,
        0.04469827190041542,
        -0.0016826288774609566,
        0.05628146603703499,
        0.04765848442912102,
        -0.04387635365128517,
        0.07595224678516388,
        -0.11425114423036575,
        0.02446668967604637,
        0.019864996895194054,
        -0.015311897732317448,
        -0.05029954016208649,
        0.03442776948213577,
        0.016369575634598732,
        0.016354309394955635,
        0.018657611683011055,
        0.05165643244981766,
        0.009257179684937,
        0.05085933580994606,
        0.010735179297626019,
        0.031793251633644104,
        -0.11141499131917953,
        -0.043954458087682724,
        0.03158564865589142,
        0.03785677254199982,
        -0.04402674734592438,
        -0.026649462059140205,
        0.017022814601659775,
        -0.013762504793703556,
        -0.05292866379022598,
        -0.016193807125091553,
        -0.039680831134319305,
        0.010805424302816391,
        -0.006857046391814947,
        -0.009531399235129356,
        0.008485984988510609,
        -0.0007304688333533704,
        -0.06785349547863007,
        -0.03000040166079998,
        -0.07048481702804565,
        0.02464868314564228,
        -0.013369102030992508,
        -0.003290377091616392,
        0.014040141366422176,
        -0.025924434885382652,
        0.021686753258109093,
        -0.02163410745561123,
        -0.03681144118309021,
        -0.03948414698243141,
        0.05953648313879967,
        0.029857506975531578,
        0.06618647277355194,
        -0.001818499295040965,
        -0.01132918894290924,
        0.03151796758174896,
        -0.06528951972723007,
        0.029731374233961105,
        -0.018948441371321678,
        -0.029397856444120407,
        0.07723184674978256,
        -0.00924394279718399,
        0.08446778357028961,
        0.11500242352485657,
        -0.03289537504315376,
        -0.03589756041765213,
        -0.058153826743364334,
        0.05203090235590935,
        0.02485019341111183,
        0.004034864716231823,
        0.03040682151913643,
        -0.00023824683739803731,
        0.012868329882621765,
        -0.06505607068538666,
        0.014667649753391743,
        0.07682843506336212,
        -0.035003434866666794,
        -0.08548103272914886,
        0.10411836206912994,
        0.07363712042570114,
        0.026608813554048538,
        0.03203338384628296,
        0.0665062889456749,
        -0.06930068135261536,
        -0.002274843165650964,
        -0.03398095443844795,
        0.07011574506759644,
        -0.007604057434946299,
        9.557606611910158e-33,
        -0.034935206174850464,
        0.049698811024427414,
        -0.06612243503332138,
        0.04356928914785385,
        0.021572640165686607,
        -0.06927107274532318,
        0.011990221217274666,
        0.048751212656497955,
        -0.04211876913905144,
        -0.030307399109005928,
        -0.005437527783215046,
        0.01924321800470352,
        -0.11846820265054703,
        0.015239843167364597,
        -0.010504287667572498,
        -0.009049731306731701,
        -0.08999688178300858,
        -0.024650054052472115,
        -0.027357717975974083,
        0.013997390866279602,
        0.054446760565042496,
        0.007890015840530396,
        -0.011935786344110966,
        -0.06360725313425064,
        0.006841563619673252,
        0.0031046224758028984,
        0.045688845217227936,
        -0.0056346626952290535,
        0.13030441105365753,
        0.026812352240085602,
        -0.06565377861261368,
        0.04132459685206413,
        0.009089340455830097,
        -0.13446833193302155,
        -0.010346573777496815,
        -0.0261346697807312,
        -0.005734781268984079,
        -0.07683277875185013,
        0.047774769365787506,
        -0.003656241111457348,
        -0.05142539367079735,
        0.025581659749150276,
        -0.03571251034736633,
        -0.060839179903268814,
        0.0026327096857130527,
        0.004741900134831667,
        0.06947905570268631,
        0.07581959664821625,
        0.06143103539943695,
        0.03237219527363777,
        -0.05265963077545166,
        -0.04934864491224289,
        0.01373335812240839,
        -0.014985533431172371,
        -0.03854485601186752,
        -0.030835697427392006,
        0.02683260291814804,
        -0.038663607090711594,
        0.06121985241770744,
        0.08314664661884308,
        0.01879197359085083,
        0.13199208676815033,
        0.03299470245838165,
        0.05185963585972786,
        -0.09273936599493027,
        0.06020451337099075,
        0.04624968767166138,
        0.05118711665272713,
        -0.08266723901033401,
        0.07235310971736908,
        -0.08623702079057693,
        -0.05177491903305054,
        0.034397512674331665,
        -0.09503345191478729,
        0.002959808800369501,
        -0.07706573605537415,
        -0.06570493429899216,
        0.058650773018598557,
        -0.10618587583303452,
        -0.04237932711839676,
        -0.03769870847463608,
        -0.036135368049144745,
        -0.01791197434067726,
        0.016269298270344734,
        -0.028779197484254837,
        0.08356424421072006,
        0.0006659452337771654,
        -0.019641699269413948,
        -0.004123767837882042,
        0.056905582547187805,
        0.03863596171140671,
        -0.012842539697885513,
        -0.016155457124114037,
        0.062307365238666534,
        -0.07228107750415802,
        -8.534553307238382e-33,
        0.07475331425666809,
        -0.0867253839969635,
        -0.058553919196128845,
        0.014132439158856869,
        0.0039307232946157455,
        0.05387093871831894,
        -0.031531721353530884,
        -0.003540563629940152,
        -0.010064786300063133,
        -0.10131779313087463,
        0.024354180321097374,
        0.06645024567842484,
        -0.037765104323625565,
        -0.029697997495532036,
        -0.042352210730314255,
        -0.047552917152643204,
        -0.060304783284664154,
        -0.06006358936429024,
        -0.032293811440467834,
        -0.04982730746269226,
        0.11333626508712769,
        0.010841680690646172,
        -0.036701273173093796,
        -0.014017002657055855,
        0.03509410098195076,
        -0.01793636754155159,
        0.0514477901160717,
        0.08022075891494751,
        0.009916704148054123,
        0.012110010720789433,
        -0.007580925710499287,
        -0.028477992862462997,
        0.05177362635731697,
        0.046834979206323624,
        -0.004274650942534208,
        0.005196747370064259,
        0.07204863429069519,
        -0.04366341978311539,
        -0.06812623888254166,
        0.010527119971811771,
        0.0574755035340786,
        0.03852129355072975,
        -0.11110582202672958,
        0.010375135578215122,
        -0.018422815948724747,
        0.045753125101327896,
        -0.0775582417845726,
        0.06639695912599564,
        0.05197211354970932,
        -0.018641451373696327,
        -0.023710284382104874,
        0.010269385762512684,
        -0.015118824318051338,
        -0.055105529725551605,
        -0.031032994389533997,
        0.011076659895479679,
        -0.0099734365940094,
        0.005774672608822584,
        0.07156970351934433,
        0.046401578933000565,
        -0.08376443386077881,
        0.016797823831439018,
        0.07081257551908493,
        -0.10588043183088303,
        0.02813434787094593,
        0.00025127362459897995,
        0.024671049788594246,
        0.09659496694803238,
        -0.035668034106492996,
        0.01827065832912922,
        0.02868548221886158,
        -0.02185111679136753,
        0.015867991372942924,
        -0.09927763789892197,
        0.027153845876455307,
        0.07603909820318222,
        0.021996082738041878,
        -0.04145146533846855,
        -0.012131394818425179,
        -0.0070486729964613914,
        0.0016419367166236043,
        0.08091747015714645,
        0.04639395326375961,
        0.11846974492073059,
        0.07833583652973175,
        0.11790764331817627,
        -0.008964414708316326,
        -0.004810377024114132,
        -0.052323732525110245,
        0.07812296599149704,
        -0.004720164928585291,
        -0.01002029050141573,
        0.08159752935171127,
        0.052511103451251984,
        -0.08623725920915604,
        -6.418092368676298e-08,
        -0.08195065706968307,
        -0.007848533801734447,
        0.040379345417022705,
        -0.013044594787061214,
        0.00012980711471755058,
        -0.05388703569769859,
        0.01959538273513317,
        0.07475925236940384,
        0.05501168593764305,
        0.04028630629181862,
        0.011391960084438324,
        -0.08340900391340256,
        -0.04028536379337311,
        0.05789165571331978,
        0.023892534896731377,
        0.03284428268671036,
        -0.019673485308885574,
        0.05816265568137169,
        -0.042415689677000046,
        -0.03894474729895592,
        0.013141057454049587,
        0.0026346947997808456,
        0.1159081906080246,
        -0.006055403500795364,
        0.007392487488687038,
        0.047942426055669785,
        -0.05978168174624443,
        0.02933024801313877,
        0.05662371963262558,
        0.02119799703359604,
        -0.07096269726753235,
        0.011043974198400974,
        0.04380086436867714,
        -0.030111247673630714,
        0.020067304372787476,
        -0.059597305953502655,
        -0.0627669170498848,
        0.07963146269321442,
        -0.005315334536135197,
        -0.027807367965579033,
        -0.025781044736504555,
        -0.14779643714427948,
        -0.025695744901895523,
        -0.04178550839424133,
        -0.028063295409083366,
        0.021335816010832787,
        -0.03660626336932182,
        -0.0156400203704834,
        -0.029168985784053802,
        0.03590545058250427,
        -0.001745043438859284,
        -0.03794427588582039,
        0.042425259947776794,
        0.1265711933374405,
        -0.006350986659526825,
        0.014340364374220371,
        -0.011659764684736729,
        -0.027165798470377922,
        0.035478245466947556,
        0.04697846248745918,
        0.10268064588308334,
        -0.10492066293954849,
        -0.05701575055718422,
        0.05256406217813492
    ]
}