{
    "id": "8-gkxzDMWTk",
    "title": "Does Anyone Remember Apple's iWeb? - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2022-05-12T15:58:44Z",
    "video_url": "https://www.youtube.com/watch?v=8-gkxzDMWTk",
    "category": "Science & Technology",
    "tags": [
        "Does Anyone Remember Apple's iWeb? - Krazy Ken's Tech Misadventures",
        "Apple",
        "Mac OS X",
        "iMac",
        "iWeb",
        "iLife",
        "FTP Server",
        "FileZilla",
        "Adobe Muse",
        "Adobe",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Tech",
        "Computer",
        "Comedy",
        "Humor",
        "Funny",
        "Computer Clan"
    ],
    "views": 73953,
    "likes": 3268,
    "comments_count": 255,
    "description": "Sign up with Linode today and get a 60-day $100 credit   You can support this channel on Patreon! Link below Remember Apple's (forgotten?) iWeb software? Today we're going to flashback to it and explore. We'll also try to make a \"new\" website with it.  Watch more Tech Misadventures!   Download our epic wallpapers   Support our channel and get cool stuff    Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord    Check out the iWeb site    Support the Computer Clan on Patreon   Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  0:00 - Introduction 1:32 - Brief History of iWeb 2:26 - First Launch 4:36 - Exploring My Old Sites (Oh, No) 9:36 - Making a \"New\" Website  #KrazyKen #ComputerClan",
    "description_links": [
        "https://linode.com/computerclan",
        "http://krazyken.thecomputerclan.com",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://old.thecomputerclan.com/iWeb",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Do you remember Apple's iWeb software? It was a simple way for people to build their own websites, but it hasn't received a major update in 13 years and that's because it was discontinued. So today we're gonna bust open this time capsule and see if there's any leftover surprises from when I used to use this program back in the day. And we'll also try to use it to make a modern website, and I invite you to join me, sponsored by Linode. (upbeat music) Hey, guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken, and I have been working on a new website recently, an all new website. And it's getting me kind of nostalgic for iWeb because I used this program back in 2008 to make my first websites. So today I wanted to open it for the first time in years. I haven't done anything with this app probably since 2014 or so. That's when I transitioned to Adobe Muse because Apple discontinued iWeb. And for years, I still milked it, but I needed something to use to make my websites. And I needed a WYSIWYG editor because I wasn't a developer. I couldn't really code and write markup languages and all that stuff. So I needed something easy, and that's where Adobe Muse came in. And then of course, Adobe Muse got killed off like four years later, and support ended six years later in 2020. And it's just like, \"Okay, that's just my luck.\" So now I'm on the prowl for some new platform to build websites on, WordPress. So iWeb, quick backstory, iWeb was first introduced in 2006 in an iLife suite update. And the last version came out in 2009, and it was part of the iLife '09 suite back when Apple had software on DVDs. Remember those days? So the thing about iWeb is, it was supposed to be not necessarily a companion product but a product that worked well with Apple's service at the time called .Mac and then later MobileMe. MobileMe is pretty much like think of iCloud today but maybe like 1/20th of the features, and it was a paid service. So with MobileMe, you had web hosting capabilities, and you can publish your websites right from iWeb to MobileMe. So now let's bust this app open, see what it was like, and then we'll explore some of the old websites I built way back in the day. And then we'll try to make a new website and actually get it on a server so you guys can click a link and go to it. So let's open it up for the first time. Okay, so opening, and there's the template browser and getting started video with a little tutorial. That's good, well, we don't need tutorials here. We skip the tutorials and then later wonder why things aren't working. So I'm gonna close out of there, and here's the template browser. Apple was pretty good with templates. I mean, these are pretty cool-looking, like the notebooks and all that stuff. They did a good job with their graphical design and everything. Just to poke around a bit, I won't try to build a website right now, but let's just poke around with a welcome page here. And we'll choose so we can actually get into the software here. All right, this is starting to come back to me. So MobileMe, this is what I was talking about earlier, but you could publish to an FTP server. You can even just publish to a local folder on your hard disk. So yeah, here's our template. And the widgets was cool. I believe this was a new feature in iWeb '09 specifically. You could have your MobileMe galleries here. You can put in some Google Map stuff. A countdown clock, I actually used these a lot for my live shows. I was like, \"Hey, we're starting soon,\" and you can like set the clock here. And it was so customizable and nice. It was a pretty cool thing. HTML snippets were great 'cause you can just embed any iFrame or whatever, and it would just work. Yeah, down here, you could change the themes, so we can go to \"Cowboy Bebop.\" Just kidding, it's just called BeBop. This was a really cool solution to build websites, though, back in the day 'cause easy and affordable web design solutions weren't really too present. Social media was a thing, but it wasn't as present as it is now. So having a website was kind of the more common thing as opposed to like Twitter and Facebook profiles and all that. I think you could even have pages with common sections. So like if you built a blog, you can add your entries in here. And there was an archive page as well, and you can edit the entries. And then I think you could enable a common section, but I don't remember. Yeah, oh, it would even generate an RSS feed for you. That was pretty sweet. In the Inspector, you can click Allow comments, and then comments are now allowed. Boom, comment would show up right there. We can try that out when we build a website later. And if it works, maybe you guys can leave some comments for me on my awesome iWeb site. What we're gonna do is we're gonna quit out of here and not save the changes. What I have here is the domain file from back when I used iWeb. It still has all of these goodies in it. And what I'll do is I'll go to the library folder where iWeb accesses the domain information. I'm gonna delete the files that are in there, and I'm gonna throw my old domain file in here. And how old is this? Let's see, it was created Saturday, August 8, 2009. Yeah, the last modified date was October 2nd, 2016. Interesting, so long story short, this hasn't been touched in a long, long time. I don't even remember the last time I used this thing and hopefully it works. Boom, there, oh my gosh. Red letter day, that was like my high school film project. Oh my goodness. So if the pages are red, it means there are changes that haven't been pushed to the server yet. Since this is all offline, I can't imagine any of the pages would be blue. For some reason, our RSS feed is, that's right, when the Computer Clan used to have an RSS feed, and I actually just published it through iWeb. I mean, it was free to me. Holy cow, there is so much in here. Oh, dude, the Spoof OS series, longtime viewers probably know what I'm talking about. This used to be a series of parody operating systems I used to do years ago. It was actually one of the earliest things that put The Computer Clan on the map back when YouTube was much smaller. The iPhone 6, oh, (beep) oh, this goes way back. Oh my goodness, Hack OS X, oh yeah. Yeah, so I made actual product pages. And you could download some of these software programs and interact with them. I made them in GameMaker years ago. Buy an iPhone, oh, cool, that's a great deal. Dude, Computer Showdown, that was another one of the earliest things that put The Computer Clan on the map. This was a cartoon I used to do where like computer programs would fight each other. It was like Animator vs. Animation, except like 1/20th of the budget. (Krazy Ken laughs loudly) The homepage I think was done in a different program. Yeah, it was done with some sort of like HTML5 animation software. The iFrame is here, but that's broken 'cause that connection is probably long gone. Apparently I put a disclaimer in here. Some browsers and network connections will not display iFrames correctly. Please use the links above if this occurs. All right, I thought this through. The main thing I'm curious about is this honking part right here. This is what used to be the Computer Clan website years ago. I had all these other like \"sub sites\" or whatever the heck you wanna call them. But this was the main one with all of these fricking pages on it. Let's go take a look. It looks like there were some like carousel areas here and like a nav bar thing up here that were embedded, and they were showing like an HTML5 canvas. Probably not the best practice, but like this was years ago inside of iWeb. Copyright 2013, holy crap, dude, home old. Holy, look at this old page, and it's trying to pull in the RSS feed. We had RSS widgets in here. Oh my goodness, dude. Here's like our live stream announcement. Oh, shoot, copyright 2012 down there. See, there's the countdown timer I was talking about earlier and these like hyperlink buttons and another countdown timer here. Something is coming soon, zero seconds left. Where is it? I guess we'll never know. I seriously don't remember what that even was. This was 10 years ago. \"Portal 2\" maps, oh gosh. This was before like the Workshop thing, like you had to download Valve's Hammer software and the SDK and do it the old fashioned way. And that's what I did. They would probably suck nowadays, but I was still kind of proud that I made, I made three apparently, wow. Oh, dude, I used to make fricking applications, applications, that's right. This was my web browser called Lightning Link. The Simple Man, this one was okay. It was actually like a gooey-based like Terminal guide. And Simple Typer, this was like a very primitive like word processor that I made back in the day. This was me just experimenting with like Xcode and Interface Builder. This was way before Swift was a thing. This was way before Swift Playgrounds, good old Objective-C, and all that. So this is what an old version of our iPhone app looked like. We had a mobile website and like this brushed metal toolbar. Hey, we got it in the App Store. So that's something, but that's what that used to look like. GZC, okay, Game Zone Central is closed until further notice. Well, I know that now. Oh, here it is, it's under Site 2. I guess I never gave it an actual name. And hey, my MobileMe is not signed in, ugh, bummer. I think we got like one review in. We did a review of \"Battlefield: Bad Company 2.\" Yeah, that's about it. Oh, this is what the website looked like. Oh my gosh, dude. Okay, wow, this is horrible. Missing plug-in, I don't know, this was probably Adobe Flash or something. I have no idea. Old CC site homepage, oh my goodness. Dude, what was this design? Oh my gosh. All right, but now, speaking of design, I'm gonna see if I can use iWeb to make a website that I can actually publish to my server and you guys can visit. It's probably not gonna be super complicated, but we're gonna see what we can do. And what I'm gonna do is, I'm gonna take the domain file out of here. And that should reset iWeb, and it should open up blank. Okay, so template, what template should we do? Let's see, dark room, I mean, that looks pretty cool. I'm not a huge fan of that, actually. Let's do a, let's just go black. 'Cause once you go black... you stay there. So the nav bar should automatically populate up here if I remember correctly as you add pages. So like if we add a blog, it should automatically populate. So there we go. So the nav bar just generates itself automatically, cool. So, hey, Made on a Mac, should we leave that on there? Let's leave that on there for a nostalgia, right? So I do have a couple assets with me just to kind of spice up the graphics a bit. Let's make a banner sort of thing. And if my memory serves me correctly, you should be able to drag this in here, and it should automatically like make a mask, which it did. And we'll take my logo here. We'll plop that in there, a nice PNG. So it should render with an alpha channel transparency right there, beautiful. Welcome to the Computer Clan Nostalgia Site. Well, actually, let's maybe put a couple more graphics in here. I do have some other PNGs in here. And this actually, the file compatibility is actually pretty good. It's all still working, and all the alpha channel works. There's a transparent background. It just overlays beautifully. My Blog entries, oh, we should probably put like a picture in there, huh? I don't really have more picture. Oh, I have my signature. I can put like my signature in there, my signature of approval. (Krazy Ken laughs loudly) We'll just put that in there, and we'll call this My Signature. Yep, allow comments, so now comments are allowed. And you, guys, when you visit this website can leave a comment. And I guess you could also subscribe to my RSS feed. That's probably not gonna work. (Krazy Ken laughs loudly) Oh, comments aren't gonna work. They only work on MobileMe, which makes sense, because I'm guessing there's some sort of back end that needs to be in place for that to function properly. One of you guys could probably explain it to me better. So yeah, you can't leave a comment on the website, but, hey, you can leave comments on the YouTube episode. (bell chimes loudly) So MobileMe isn't a thing anymore. We could just push it to an FTP server. FTP should just be ftp.thecomputerclan.com. Directory path, it should just make a new folder. So I'll just make /iWeb, Test Connection. Ah, yes, please work. Oh, it failed. Oh, the path can't be, well, I probably don't, oh, I don't have one. I gotta go make one. Okay, off to Cyberduck. No, wait, I use FileZilla, off to FileZilla. I have really no idea how this all works, and it's also SSL. I have no idea if iWeb's gonna be compatible with SSL. So let's do thecomputerclan.com/iWeb. If I accidentally overwrite my whole directory with this, I will be very not that upset actually because I'm kind of wiping it all out soon anyway, Test Connection. Testing failed, the path couldn't be found. It might be /public_html/iWeb. That might be the change I have to do. And we'll go ahead and test that. What's taking longer? I'm not a web administrator expert, but I'm guessing it's stuck on the SSL part 'cause it probably is trying to go. But it probably is, like no idea what to do with the SSL certificate. It's like, \"Ugh, what?\" Fear not, what we can do is we can just publish it to a local folder, and I'll just take that folder, put it on the server myself, and maybe it'll work. Folder location, let's throw it onto, we'll just put it on the desktop for now, and I'll put it on a flash drive later. Publish error, can't create the index file. The disk may be damaged or full, what? Or you don't have access privileges. I have access privileges. It's my computer. Let's try the Documents folder, publish. Okay, now it's actually creating pages. Your site has been published, okay. So visit site, and boom, there it is, it works. I can click on blog, maybe. Oh no (laughs) I think I borked it. Maybe the blog template doesn't work for local sites. It has to be on a web server. I'm gonna take these files and put them on a server and see if I can get them to work. Okay, so I uploaded the files with FileZilla. And for some reason, I still couldn't get the website to load, but I guess I wasn't capitalizing the W in iWeb. And I guess it's case sensitive. So once I changed that, it worked, even the Blog button did. Unfortunately, I can't connect to it on this older system because of the SSL. And I'm guessing this older version of Safari just doesn't understand the newer security so it can't connect to it. Have fun with it. I'm a little surprised it worked. That's actually pretty cool. So iWeb is great and all. But if you have a more demanding website or application that needs to be scaled and deployed, iWeb might not be the solution for you, but Linode is. Linode has the infrastructure and the 24/7 support in place for you. But Linode is much more than just a bunch of data centers. Linode offers out-of-box apps for game servers like TF2, CS:G0, and even Minecraft. You can run your own virtual private network with OpenVPN, build an online application with Joomla's content management system, or build a video streaming site with a multitude of app choices. There's so much you can do with Linode's affordable Linux virtual machines. And to boot, they offer award-winning 24/7 technical support. To put it simply, if it runs on Linux, it runs on Linode. Visit linode.com/computerclan and click the Create Free Account button. And when you do that, I'll give you a 60-day $100 credit just for watching this episode. And you're also supporting the Computer Clan, so thank you very much. So that's iWeb. And I think it's another great example of how Apple made software so accessible and easy to use. Without this, I don't think I would've started making websites as early as I did. Thank you iWeb, and thank you everyone who came on this time travel trip with me. And hey, feel free to subscribe for more tech episodes coming out every week. I love making episodes about rare and retro tech, new tech, and, of course, scam tech. And hey, if you like this episode, you know what to do. Thanks, and I'll see you next time. Catch the crazy, and pass it on. (upbeat music)",
    "transcript_keywords": [
        "iWeb",
        "Computer Clan",
        "website",
        "put",
        "Computer",
        "thing",
        "Computer Clan website",
        "back",
        "websites",
        "Adobe Muse",
        "make",
        "years",
        "Apple",
        "MobileMe",
        "RSS feed",
        "yeah",
        "Clan",
        "Linode",
        "RSS",
        "Hey"
    ],
    "transcript_entity_values": [
        "Swift",
        "Cyberduck",
        "Interface Builder",
        "1/20th",
        "2006",
        "YouTube",
        "2",
        "SSL",
        "iFrame",
        "'09",
        "one",
        "HTML5",
        "Game Zone Central",
        "Lightning Link",
        "FTP",
        "Twitter",
        "Adobe Flash",
        "Workshop",
        "four years later",
        "Hack OS X",
        "Swift Playgrounds",
        "2020",
        "Battlefield: Bad Company 2",
        "WYSIWYG",
        "2014",
        "Cowboy Bebop",
        "GameMaker",
        "Facebook",
        "Blog",
        "10 years ago",
        "years",
        "Apple",
        "Linux",
        "13 years",
        "100",
        "the App Store",
        "Documents",
        "60-day",
        "2013",
        "Mac",
        "Terminal",
        "iLife",
        "MobileMe",
        "Joomla",
        "first",
        "Valve",
        "iCloud",
        "Adobe Muse",
        "Linux",
        "Linode",
        "years ago",
        "Simple Typer",
        "three",
        "Spoof",
        "FileZilla",
        "2009",
        "those days",
        "MobileMe",
        "BeBop",
        "zero seconds",
        "24/7",
        "thecomputerclan.com/iWeb",
        "TF2",
        "today",
        "YouTube",
        "Krazy Ken",
        "RSS",
        "iWeb",
        "SDK",
        "Xcode",
        "Safari",
        "six years later",
        "iPhone",
        "Minecraft",
        "the Computer Clan Nostalgia Site",
        "the Computer Clan",
        "WordPress",
        "The Computer Clan",
        "FileZilla",
        "every week",
        "Google",
        "October 2nd, 2016",
        "Test Connection",
        "iWeb",
        "2008",
        "Saturday, August 8, 2009",
        "One",
        "Site 2",
        "Linode",
        "2012",
        "Computer Showdown",
        "the day"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "NORP",
        "FAC",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "FAC",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "GPE",
        "PERSON",
        "TIME",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "DATE",
        "GPE",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "LAW",
        "PRODUCT",
        "DATE",
        "PERSON",
        "DATE"
    ],
    "vector": [
        -0.11475978791713715,
        -0.08995864540338516,
        0.020457318052649498,
        -0.12941399216651917,
        0.09809116274118423,
        0.009316346608102322,
        0.023063013330101967,
        -0.02738524228334427,
        -0.032733116298913956,
        -0.020274072885513306,
        0.02486496791243553,
        0.02480807714164257,
        -0.010426457040011883,
        -0.04703323543071747,
        0.02089347504079342,
        0.03858722746372223,
        0.03522619605064392,
        -0.01923532970249653,
        -0.029231475666165352,
        -0.02560073509812355,
        -0.04471876844763756,
        -0.10526279360055923,
        -0.011983193457126617,
        -0.013118143193423748,
        0.08114185929298401,
        -0.019144929945468903,
        -0.029228361323475838,
        0.021303344517946243,
        0.003737225430086255,
        -0.08891857415437698,
        0.04510046914219856,
        -0.03444674611091614,
        0.058237720280885696,
        0.03426234424114227,
        0.01869894377887249,
        -0.03419367969036102,
        0.02974051795899868,
        -0.005774012301117182,
        -0.09429198503494263,
        0.009149501100182533,
        -0.008499816060066223,
        0.010860559530556202,
        -0.02397475764155388,
        0.07403493672609329,
        -0.03320193290710449,
        -0.008123299106955528,
        -0.0019058383768424392,
        -0.07025068998336792,
        0.04523472860455513,
        0.08018197119235992,
        -0.007896899245679379,
        -0.09651552140712738,
        0.06476843357086182,
        -0.0027065412141382694,
        -0.04508133977651596,
        0.0016075210878625512,
        0.05145775526762009,
        -0.030230918899178505,
        0.08383070677518845,
        0.007442906964570284,
        0.07685181498527527,
        -0.09231649339199066,
        0.022652670741081238,
        0.013768746517598629,
        -0.02301148511469364,
        -0.030369017273187637,
        0.03933464363217354,
        0.10626509040594101,
        0.006068884860724211,
        -0.11174006015062332,
        -0.03302880749106407,
        -0.0028514761943370104,
        0.004545845091342926,
        0.09383142739534378,
        0.04689036309719086,
        0.030527282506227493,
        0.011975543573498726,
        -0.060256388038396835,
        0.0025611016899347305,
        -0.07721380889415741,
        0.017393620684742928,
        -0.0012904321774840355,
        -0.013959558680653572,
        -0.012439937330782413,
        -0.0019836442079395056,
        -0.02214062213897705,
        -0.03717024624347687,
        0.014092768542468548,
        -0.014010977931320667,
        0.010775119066238403,
        -0.03552968055009842,
        0.08085207641124725,
        0.10521401464939117,
        -0.03010305017232895,
        0.022384464740753174,
        -0.012102589942514896,
        0.05565918982028961,
        -0.07475627958774567,
        -0.04832993075251579,
        0.06877445429563522,
        -0.01466146670281887,
        0.0380825474858284,
        0.007739925757050514,
        -0.08647248893976212,
        -0.004253805615007877,
        -0.034105557948350906,
        -0.0016963278176262975,
        0.11787694692611694,
        0.10999350249767303,
        0.08129159361124039,
        -0.00993267074227333,
        0.01931297779083252,
        -0.06511420011520386,
        -0.016352888196706772,
        0.033075202256441116,
        0.019985197111964226,
        -0.052194468677043915,
        0.08510837703943253,
        0.14638492465019226,
        -0.036164697259664536,
        0.06004805490374565,
        0.09391041845083237,
        0.002192638348788023,
        -0.01192778442054987,
        0.014943066984415054,
        -0.03155547007918358,
        -0.029854897409677505,
        3.5967056156170475e-33,
        0.03548895940184593,
        0.08897282928228378,
        -0.09534650295972824,
        0.00418348191305995,
        0.05506473407149315,
        -0.08350996673107147,
        0.0025102361105382442,
        0.07902718335390091,
        -0.11643893271684647,
        -0.0005713732680305839,
        0.030260374769568443,
        -0.029552428051829338,
        -0.07406582683324814,
        -0.01753021962940693,
        -0.022015755996108055,
        -0.0657239556312561,
        -0.08536546677350998,
        -0.09073831140995026,
        0.04262223094701767,
        0.02442074567079544,
        0.018361732363700867,
        -0.010794438421726227,
        0.02541980892419815,
        0.025665927678346634,
        0.008399969898164272,
        -0.02938479371368885,
        -0.015138890594244003,
        0.018865808844566345,
        0.12210771441459656,
        0.029462238773703575,
        -0.04566454514861107,
        -0.0016573008615523577,
        0.03006936050951481,
        -0.034960225224494934,
        0.0280191320925951,
        -0.03870487958192825,
        -0.014891907572746277,
        -0.13834865391254425,
        0.030332094058394432,
        0.007816611789166927,
        -0.07705028355121613,
        -0.01286514662206173,
        -0.0662933737039566,
        -0.07473655045032501,
        -0.03607824072241783,
        -0.021358530968427658,
        0.031204456463456154,
        0.007658463902771473,
        0.08356774598360062,
        -6.317399675026536e-05,
        -0.06611950695514679,
        0.02391672506928444,
        -0.05093025416135788,
        -0.004559923429042101,
        -0.04222548007965088,
        -0.00033880866249091923,
        -0.015002195723354816,
        -0.033997636288404465,
        0.05592787265777588,
        -0.030335482209920883,
        0.06433951109647751,
        0.057828180491924286,
        0.08021558076143265,
        0.005697592161595821,
        -0.14106819033622742,
        0.012886996380984783,
        0.029913434758782387,
        0.0451110303401947,
        -0.011173459701240063,
        0.07143910974264145,
        -0.05731247365474701,
        -0.03487376123666763,
        0.017505301162600517,
        -0.06757238507270813,
        -0.052441079169511795,
        0.017329812049865723,
        -0.09020259976387024,
        -0.005782811436802149,
        -0.10053116828203201,
        0.004660037346184254,
        -0.014280576258897781,
        -0.012975492514669895,
        0.02712992951273918,
        0.0642959251999855,
        0.05974172055721283,
        0.03990893065929413,
        0.09018220007419586,
        -0.01044061966240406,
        -0.033650364726781845,
        -0.011274793185293674,
        -0.03341023623943329,
        0.015290292911231518,
        0.012792548164725304,
        0.042007315903902054,
        -0.04107631742954254,
        -3.595233676284627e-33,
        -0.0073207225650548935,
        -0.019694669172167778,
        -0.010244427248835564,
        -0.01699312962591648,
        0.06612806022167206,
        0.013987226411700249,
        0.02225291170179844,
        0.04871552065014839,
        0.01219375804066658,
        0.030552752315998077,
        0.05481816828250885,
        0.03553280606865883,
        -0.1372489333152771,
        -0.08081501722335815,
        0.004019476938992739,
        -0.05146392062306404,
        -0.019737746566534042,
        -0.026157598942518234,
        -0.010846199467778206,
        -0.042397767305374146,
        0.02437155321240425,
        -0.02599203586578369,
        -0.03663879260420799,
        0.014208726584911346,
        0.03286478668451309,
        0.007981663569808006,
        0.03428413346409798,
        0.08185237646102905,
        0.05375153198838234,
        0.04801839962601662,
        0.0717514380812645,
        0.01679796539247036,
        -0.04213227704167366,
        -0.07630525529384613,
        0.0422949492931366,
        0.02715444564819336,
        0.02487236261367798,
        -0.030622409656643867,
        -0.06753640621900558,
        -0.04933357983827591,
        0.06867298483848572,
        0.012489753775298595,
        -0.09531094133853912,
        0.016177436336874962,
        -0.0701109990477562,
        0.029329471290111542,
        -0.08232410997152328,
        0.0761222392320633,
        0.011739901266992092,
        -0.012758461758494377,
        0.01895483210682869,
        -0.03943649306893349,
        0.06864400953054428,
        -0.026712913066148758,
        -0.06496710330247879,
        0.053048793226480484,
        0.06981213390827179,
        0.09338147193193436,
        0.0278468057513237,
        -0.0031488912645727396,
        -0.08313227444887161,
        -0.0245984997600317,
        -0.043005120009183884,
        -0.0568719245493412,
        0.00671498104929924,
        0.013868512585759163,
        0.05640522018074989,
        0.06166878715157509,
        -0.05184168368577957,
        0.059427812695503235,
        0.03705442696809769,
        0.045674581080675125,
        -0.027623340487480164,
        -0.06437017768621445,
        -0.03798681125044823,
        0.052482783794403076,
        0.08659644424915314,
        0.0091759217903018,
        -0.03169209137558937,
        -0.04153260961174965,
        -0.00973583571612835,
        0.13068774342536926,
        0.06979604065418243,
        0.007652156054973602,
        0.12356550991535187,
        0.030989378690719604,
        0.008986225351691246,
        0.07924123108386993,
        -0.047225985676050186,
        0.020511792972683907,
        -0.011549421586096287,
        0.021705450490117073,
        0.02117399498820305,
        0.05376015976071358,
        -0.0025622942484915257,
        -5.759549637218697e-08,
        -0.03533019870519638,
        0.05624789372086525,
        -0.0044283317402005196,
        -0.026094183325767517,
        0.06358732283115387,
        -0.06972212344408035,
        -0.011042045429348946,
        -0.007244201842695475,
        0.006114182062447071,
        0.010304602794349194,
        0.03159351274371147,
        -0.023447277024388313,
        -0.06598148494958878,
        0.04697619378566742,
        0.037043239921331406,
        -0.021483246237039566,
        -0.016406649723649025,
        0.04715486615896225,
        -0.010473080910742283,
        -0.08874411135911942,
        -0.024342840537428856,
        -0.02458782307803631,
        0.06348680704832077,
        -0.022482581436634064,
        -0.00897879060357809,
        0.05093367397785187,
        0.004922004882246256,
        0.07031282037496567,
        0.027596604079008102,
        0.014025550335645676,
        -0.05444302037358284,
        0.007394425570964813,
        -0.021520739421248436,
        -0.10264428704977036,
        0.05391751974821091,
        -0.015055361203849316,
        -0.10478392988443375,
        -0.03001306764781475,
        -0.0033372181933373213,
        0.00788930431008339,
        0.031849443912506104,
        -0.05294814705848694,
        0.0698031410574913,
        0.012010288424789906,
        -0.0010346610797569156,
        0.0582217238843441,
        -0.08054187148809433,
        -0.03430652990937233,
        0.04402829706668854,
        -0.018946586176753044,
        -0.045317020267248154,
        -0.06311298906803131,
        0.0068304347805678844,
        0.07730822265148163,
        0.03816623613238335,
        -0.016361333429813385,
        0.017649637535214424,
        -0.0036504275631159544,
        0.04454180970788002,
        0.04850165173411369,
        0.0908508151769638,
        -0.04716622084379196,
        -0.050494659692049026,
        -0.04068134352564812
    ]
}