{
    "id": "81QZ3u4wD38",
    "title": "All iPhone XR Colors Unboxing + Comparison",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2018-10-27T07:33:22Z",
    "video_url": "https://www.youtube.com/watch?v=81QZ3u4wD38",
    "category": "Science & Technology",
    "tags": [
        "iPhone XR all colors",
        "all colors",
        "iPhone XR Blue",
        "iPhone XR coral",
        "iPhone XR red",
        "iPhone XR Yellow",
        "iPhone XR Black",
        "iPhone XR White",
        "iPhone XR review",
        "Apple iPhone XR Review",
        "iPhone XR Camera Review",
        "iPhone XR",
        "iPhone XR Unboxing",
        "Apple",
        "Apple iPhone XR",
        "iPhone XR camera",
        "iPhone Xr vs Xs",
        "iPhone Xr colors",
        "iPhone Xr hands on",
        "iPhone Xr camera",
        "iPhone Xr case",
        "iPhone Xr vs iPhone X",
        "iPhone Xr display",
        "tld",
        "jonathan morrison",
        "iPhone Xr vs Pixel 3",
        "iPhone XR official"
    ],
    "views": 801439,
    "likes": 64707,
    "comments_count": 72654,
    "description": "Massive iPhone XR Unboxing & All Colors Comparison Review! Unboxing all 6 new iPhone XR colors!   Subscribe to Justine's channel:    Subscribe to mine:   Justine's iPhone XR Unboxing:   The Definitive iPhone XR Review:  iPhone XR Unboxing & Impressions!:   TLD Behind the Scenes!  Mobile users:   Music via Musicbed:   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "http://www.youtube.com/subscription_center?add_user=tldtoday",
        "https://www.youtube.com/watch?v=wTR1xSJuU7M",
        "https://youtu.be/i0JV95H1TDM",
        "https://youtu.be/Bat05NtQ4y8",
        "http://bit.ly/TLDBreakdown",
        "https://www.youtube.com/channel/UCDlQwv99CovKafGvxyaiNDA/join",
        "http://share.mscbd.fm/tldtoday",
        "https://youtu.be/v9hu-Avj2oE?list=PLq...",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0u...",
        "http://www.instagram.com/tldtoday"
    ],
    "transcript": "- Hey guys, Johnson here, happy iPhone XR day! I know some of you have seen my initial iPhone XR unboxing in blue. Thank you guys so much for the love on that video but today we're taking it up a notch and I swear those will stop soon but as you see behind me, I got quite a few iPhones. Bam! So, we got white, yellow, coral, red, blue, black. All of 'em! I will say just the attention to detail with everything from the iPhone text to the Apple logos matching the color to the top of the box is kind of cool but with that said, I thought it'd be fun to give you guys a chance to win one of your own or actually two. I guarantee all of you out there know Justine. She picked up every color as well so it's gonna be cool to team up and give you guys a chance to win two brand new iPhone XRs and you guys choose the color. So, to enter, it is crazy simple. Just make sure you subscribe to both channels, \"TLD\" and Justine's channel then go to leave a comment on both videos, saying your favorite color. Which is blue, but I'll accept coral as well. Now, it's not required but if you guys are feeling like being awesome, I will appreciate it if you guys drop a 'like' down below and I'll throw a fist bump your way but let's go ahead and crack into every one of these iPhones. For those of you guys who love plastic sounds, we got a ton of that so I'll de-plastic everything first. (crumpling plastic) One down. Some people out there like it slow. (crumpling plastic) Some people like it fast. Like Lamar Wilson. (maniacal laughter) - Sorry. - Oh, that coral has like this nice little glowy, almost like rose-goldy glow on the Apple logo. It's reflective and shiny. It's like Jenga but iPhones. That'd be a fun game. Now this yellow one right here, again has got that like gold side, gold Apple logo. It is really, really, really nice. I'm gonna wait though. We gotta get through these together. Last but not least, we got the white power ranger, aka, the old green power ranger, who was the best of all time. And I wanna ask you guys, if there were a tech Power Rangers team, let me know who is who. Who is which color with a comment down below and why. Back to the plastic though. There we go. From there, it is time to bring all these out, so we'll start with a little shake and bake. We got that white iPhone XR. That is clean. Like I'm usually a fan of stormtrooper looks, and this does not disappoint. We got that aluminum side that kind of is very reminiscent of the Apple watch. Kind of the sport series but it looks good. It's a great combo. You guys have seen an Apple unboxing before so we don't need to talk about the lack of accessories in there. That is a completely different complaint for a different day. White iPhone. We'll do like a joint... Oh, I'm excited for this. So I've heard... I'm getting ahead of myself. It's like a Pikachu yellow, I've heard that. Paired with this like gold side, so you got the yellow back with the gold edges. It's pretty classy. I am still partial to blue I think, but not gonna lie this yellow looks really good. Stack! Now if you guys picked up an iPhone XR on launch day, let me know what you think. There's been a little bit of controversy with the screen but for my initial testing, I'm gonna say people kinda jumped the gun on that. It's a pretty solid phone. If you guys missed my full review, that's already up, so, card here, link down below. We are on to Rick's favorite phone. Oh! That's like bright, in your face! Now, coral is the technical color but I'm gonna say like shout out to Sara Dietschy because this hands down like the peach phone. Like this bright, neon peach and it definitely pops. This is paired with a very similar side. It's more of like this rose-goldish, coral pink color but overall, yeah I think maybe blue and coral are my top two favorite colors. Stacks on stacks on stacks on, here we go, product red. I feel like it's either red or blue for a lot of people out there; I've seen a lot of people in my iPhone XR unboxing of the blue version comment, \"Where's the red?\". Here's the red. Oh, that's like a candy apple red. Like I feel like Apple constantly changes up the actual hue of the reds on their product red products but yeah, this is like, not like Ferrari red but definitely like a candy apple, you're back at school, like classic apple red. Looks good though! Those sides though. See, a lot of people were disappointed, the fact that this has aluminum sides versus stainless steel but I think it's actually like a pro in this case. I've seen one, those stainless steel sides, they get shredded and beat up and again, the aesthetics here (blows kiss) That stack is getting bigger. Blue; I've seen blue but I'm still a little excited again. We got the blue front, the blue text, the blue Apple logo. Ah, so good! It's like North Carolina blue. It's just satisfying. Like it pops, it's bright and the aluminum is just... I just like blue, if you couldn't tell. So, I'm gonna put this one aside and get to that last one. You know what I wish Apple would do? Is give you colored Apple stickers to match the phone. Tim Cook, let's get it in the phone, make that happen. Colored Air Pods, please. We got colored things everywhere. Let's bring some colored stickers, some colored Air Pods. I am in for that. Back to black! I almost made a terrible AC/DC joke right now but just ignore that. Oh, that's like, yeah, it's like stealthy. Marquez, I know you wish it was matte black everything, but yeah, the aluminum sides, like this is just a super slick, clean looking phone. Not my favorite but definitely very, very classy. We are through the boxes now it is time for more plastic. You guys can, I guess grade me, correct me, we'll do this together. Better, better? Let me know. Alright, so, there is the black iphone XR undressed. My personal favorite, blue. So much plastic, so many phones. Product red! I'm gonna have to speed through this, otherwise we're gonna be here all day. Ain't nobody got time to unwrap six iPhone XR's. Ah, the coral's really nice. Then we got... So if you watched Power Rangers, I think I was a little partial to the pink ranger but yellow ranger was pretty awesome too. Finally, the white's clean. Like, I am seriously digging what Apple did with the color iPhones and as someone who's used the iPhone XS and XS Max, I like the colors a lot. With that said though, we got all of the colors; yellow, coral, it's like a stack of cards. Damn, that is clean. Shabam! - Kazam! - Next, we're gonna take a quick commercial break and set these iPhones up because I got six of them. (80's music playing) Whoo! All six set up, that is... I don't think I've ever set up six iPhones like that, but we are through. We got those beautiful iPhone XR wallpapers on the desk. We're gonna go through 'em right now. We got yellow, shabam! And I know it's a little weird to get excited over wallpapers but it was a nice touch. We got the product red; this would probably look cool with maybe a black wallpaper or a blue wallpaper. We got coral; my second favorite. That peach colored wallpaper. Again, you got those rose-goldish sides. These are good looking phones. Like, whether you love Apple or you hate 'em, I think they are really good looking phones. We got the whites like that alpine, stormtrooper white. My favorite; blue. And last but not least, the Black Power Ranger was Zack so that's all I can think, I'm just associating all of these with Power Rangers right now. Again, if there was like a tech Power Rangers squad, let me know who's who and why. So, you guys know I've covered the iPhone XR pretty extensively from my initial unboxing to the full like full on, blown out, in depth review. I think they're great phones and honestly, I think these are the iPhones that most people should buy this year. This was more so just kind of a fun video. I wanted to check these out. I saw them way back when they announced them but it's been a while. And again, they're great looking phones and I wanna give back to you guys so again, if you guys want a chance to win one of your very own, you guys pick the color, go ahead and check out Justine's video and I'll catch you guys later. Again, if you're feeling like being awesome, make sure you guys smash that Like button, and I'll catch you guys very soon with a video you're not gonna wanna miss. And Zack, Mr. Jerry-Rig-Everything, I'm calling you out!",
    "transcript_keywords": [
        "guys",
        "Apple",
        "blue",
        "iPhone",
        "Power Rangers",
        "red",
        "power",
        "color",
        "iPhones",
        "coral",
        "yellow",
        "Apple logo",
        "Johnson",
        "ranger",
        "apple red",
        "people",
        "favorite",
        "phone",
        "white",
        "black"
    ],
    "transcript_entity_values": [
        "two",
        "all day",
        "iPhone",
        "Lamar Wilson",
        "Marquez",
        "One",
        "iPhone XR",
        "launch day",
        "the white's clean",
        "Apple",
        "iPhones",
        "Pikachu",
        "XR",
        "a ton",
        "the iPhone XS",
        "Kazam",
        "six",
        "North Carolina",
        "XR",
        "Zack",
        "second",
        "Ferrari",
        "Air Pods",
        "first",
        "one",
        "Sara Dietschy",
        "Tim Cook",
        "AC/DC",
        "Power Rangers",
        "Justine",
        "Johnson",
        "today",
        "XS Max",
        "Rick",
        "Jenga",
        "Jerry-Rig-Everything",
        "this year",
        "80",
        "Bam"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "NORP",
        "NORP",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "GPE"
    ],
    "vector": [
        -0.030108680948615074,
        -0.008302407339215279,
        0.10536900907754898,
        -0.04619638994336128,
        0.08368821442127228,
        -0.007534881122410297,
        0.07880191504955292,
        -0.08134882152080536,
        0.052834995090961456,
        -0.04628397896885872,
        0.028457971289753914,
        0.008838018402457237,
        0.0451829731464386,
        0.012487499974668026,
        -0.024317307397723198,
        0.08186902850866318,
        0.024327661842107773,
        -0.07944375276565552,
        -0.16303396224975586,
        0.05909350514411926,
        -0.03066420927643776,
        -0.022630400955677032,
        0.020429112017154694,
        0.003259854158386588,
        -0.058171823620796204,
        0.018644480034708977,
        -0.045881032943725586,
        -0.0250628050416708,
        -0.0648844763636589,
        -0.06249222904443741,
        0.01171168964356184,
        0.06644804030656815,
        0.06865742057561874,
        0.04212341085076332,
        -0.01844729110598564,
        -0.0998421385884285,
        -0.01461657602339983,
        0.012406786903738976,
        -0.0015291087329387665,
        0.011256137862801552,
        -0.05234605818986893,
        -0.028290947899222374,
        0.037074193358421326,
        0.0972992405295372,
        -0.014303895644843578,
        0.05056902393698692,
        0.07109525799751282,
        -0.04264314845204353,
        -0.07459082454442978,
        -0.07338361442089081,
        0.054840173572301865,
        0.011207401752471924,
        -0.010108079761266708,
        0.04026909917593002,
        -0.04213878512382507,
        0.04288638010621071,
        0.005552869755774736,
        -0.056272201240062714,
        0.0982031300663948,
        -0.019193746149539948,
        -0.026408441364765167,
        0.06893441081047058,
        0.039902251213788986,
        0.06187158077955246,
        0.04497756436467171,
        -0.009113738313317299,
        -0.024052685126662254,
        0.0070246746763587,
        -0.027792563661932945,
        0.010934953577816486,
        0.0410950668156147,
        0.04154668748378754,
        0.0843634232878685,
        0.04575003683567047,
        0.055907879024744034,
        0.056464385241270065,
        0.03175099194049835,
        -0.020421026274561882,
        -0.10576722025871277,
        0.017880942672491074,
        0.08556053042411804,
        -0.019648101180791855,
        0.02888106182217598,
        0.010907184332609177,
        0.06557647138834,
        0.020838506519794464,
        -0.0618346743285656,
        0.0151031743735075,
        -0.11688675731420517,
        -0.03754037991166115,
        -0.07902180403470993,
        0.07146037369966507,
        0.0279286690056324,
        -0.022640231996774673,
        0.02232980728149414,
        -0.03060140646994114,
        -0.006523455958813429,
        -0.05187562108039856,
        -0.05030699446797371,
        -0.005463173147290945,
        0.11709149926900864,
        -0.07464414834976196,
        0.045355092734098434,
        -0.04696481302380562,
        0.017618270590901375,
        -0.1203303188085556,
        -0.03118138387799263,
        0.021713009104132652,
        -0.00863037258386612,
        0.11236415058374405,
        0.019034065306186676,
        -0.05131763964891434,
        -0.041133955121040344,
        0.008750741370022297,
        -0.04508666321635246,
        0.05170523002743721,
        -0.005645224824547768,
        0.10903586447238922,
        0.04033294692635536,
        -0.03096306324005127,
        0.035351261496543884,
        -0.06914445012807846,
        -0.08846539258956909,
        -0.013482182286679745,
        -0.024628618732094765,
        -0.07582665234804153,
        -0.017226824536919594,
        6.840768068775193e-33,
        -0.004093445837497711,
        0.07246053218841553,
        -0.03356039896607399,
        0.05275982245802879,
        0.07677289098501205,
        -0.013011514209210873,
        -0.006215582136064768,
        0.03203317150473595,
        -0.04215918853878975,
        0.03697066381573677,
        0.02282135933637619,
        0.06244448572397232,
        -0.06147005781531334,
        0.058541055768728256,
        0.0005681833135895431,
        -0.0429411455988884,
        -0.07132872939109802,
        -0.08887501806020737,
        -0.10592332482337952,
        0.011009554378688335,
        -0.041950125247240067,
        0.0008886018767952919,
        -0.031134678050875664,
        -0.009233439341187477,
        -0.030336054041981697,
        0.046874016523361206,
        0.04599684476852417,
        -0.017811007797718048,
        0.009623927064239979,
        -0.025521432980895042,
        -0.07549624890089035,
        0.045009270310401917,
        0.058701373636722565,
        0.027598833665251732,
        -0.055298227816820145,
        -0.00027896964456886053,
        0.03838647902011871,
        -0.04687297344207764,
        0.021029969677329063,
        0.05621692165732384,
        -0.04822909086942673,
        0.002076969714835286,
        -0.04780716076493263,
        -0.0050809625536203384,
        0.04738149791955948,
        0.03362266346812248,
        0.002351397881284356,
        -0.02293291874229908,
        -0.023184863850474358,
        0.007762297056615353,
        -0.010475621558725834,
        -0.08795467019081116,
        -0.00886875856667757,
        -0.06352817267179489,
        0.005750520154833794,
        -0.02168249897658825,
        -0.006259476765990257,
        0.007493503857403994,
        -0.014680346474051476,
        0.03231513500213623,
        -0.0004947492270730436,
        0.01877719908952713,
        0.01856335997581482,
        -0.01543576642870903,
        -0.03299252688884735,
        0.06734299659729004,
        -0.030131986364722252,
        -0.03391208127140999,
        -0.044640373438596725,
        0.03715204447507858,
        -0.029072750359773636,
        0.019881874322891235,
        0.019328273832798004,
        -0.06223021075129509,
        0.018880100920796394,
        0.018538953736424446,
        0.008951647207140923,
        -0.05139261484146118,
        0.034703899174928665,
        0.026958931237459183,
        0.04050643742084503,
        0.03435295820236206,
        -0.024545175954699516,
        0.02593975141644478,
        -0.07869472354650497,
        -0.05142700672149658,
        0.0076859514228999615,
        -0.0036781884264200926,
        0.00316960783675313,
        0.09391835331916809,
        -0.009212756529450417,
        -0.04865884780883789,
        -0.06301483511924744,
        -0.052158184349536896,
        -0.06833737343549728,
        -8.345873974303927e-33,
        -0.005342239513993263,
        -0.012187420390546322,
        0.004730983637273312,
        0.01980743743479252,
        0.062162574380636215,
        -0.027652567252516747,
        0.07191689312458038,
        0.09825779497623444,
        0.0716133639216423,
        -0.024089854210615158,
        0.043377138674259186,
        0.04757055640220642,
        -0.07855965942144394,
        0.050907108932733536,
        -0.07965610921382904,
        0.015190569683909416,
        0.015471255406737328,
        0.06470143049955368,
        -0.048250675201416016,
        0.06742704659700394,
        -0.03778061643242836,
        0.026982629671692848,
        -0.01765836961567402,
        -0.008180295117199421,
        -0.06598848104476929,
        0.06283416599035263,
        0.03727477788925171,
        0.0177843626588583,
        0.06758835166692734,
        -0.03347035497426987,
        -0.03296990320086479,
        -0.048184677958488464,
        -0.002539385575801134,
        -0.014214161783456802,
        0.04733937978744507,
        0.0048021781258285046,
        0.029560772702097893,
        -0.01471441425383091,
        -0.048631660640239716,
        0.002640468068420887,
        -0.012105955742299557,
        0.035304486751556396,
        -0.06262075155973434,
        -0.013517899438738823,
        -0.029917128384113312,
        -0.057716332376003265,
        -0.07716550678014755,
        0.05584581568837166,
        0.01922347955405712,
        0.055860407650470734,
        0.0030763468239456415,
        -0.046581950038671494,
        -0.025247283279895782,
        0.02204168774187565,
        -0.08806385099887848,
        0.01753976009786129,
        -0.013677970506250858,
        0.01544295996427536,
        0.07890056073665619,
        0.07515020668506622,
        0.005084055941551924,
        0.07201477885246277,
        -0.10804498195648193,
        -0.09139545261859894,
        -0.03685582056641579,
        -0.11557424068450928,
        0.05302423983812332,
        -0.016091449186205864,
        -0.04068790003657341,
        0.004020595457404852,
        0.0038463426753878593,
        -0.0715283676981926,
        -0.07224352657794952,
        -0.046423252671957016,
        0.087623730301857,
        -0.02181871607899666,
        -0.04925360530614853,
        -0.07857061922550201,
        -0.09512968361377716,
        -0.02693859674036503,
        -0.017422853037714958,
        0.09376154094934464,
        0.07710403203964233,
        0.018962547183036804,
        0.11694265902042389,
        0.07121487706899643,
        0.044597115367650986,
        0.004510126542299986,
        -0.024471882730722427,
        -0.08558456599712372,
        0.05222992226481438,
        0.05734669417142868,
        0.07663469761610031,
        0.05648715794086456,
        0.008819015696644783,
        -5.6796803704628473e-08,
        0.05606069043278694,
        -0.010159817524254322,
        0.024549664929509163,
        -0.06730461120605469,
        -0.009528441354632378,
        -0.0519464835524559,
        -0.012300542555749416,
        -0.020230961963534355,
        0.016953548416495323,
        -0.017521116882562637,
        0.045046545565128326,
        -0.04598493129014969,
        -0.16645517945289612,
        0.05521648749709129,
        0.03237142786383629,
        0.04295454919338226,
        -0.062381450086832047,
        -0.002810806268826127,
        0.022047152742743492,
        -0.014651689678430557,
        -0.04805057495832443,
        0.06743482500314713,
        0.019678281620144844,
        -0.05701352283358574,
        -0.052149247378110886,
        0.03939850628376007,
        -0.014670951291918755,
        0.00592917250469327,
        0.054531898349523544,
        -0.02808774821460247,
        0.0002895936486311257,
        0.014969510957598686,
        0.03445576876401901,
        -0.022535154595971107,
        -0.06423313170671463,
        -0.06362928450107574,
        -0.04435023292899132,
        -0.03158540278673172,
        0.052048515528440475,
        -0.012073507532477379,
        0.0162790697067976,
        -0.13682925701141357,
        -0.020880645141005516,
        0.04120539873838425,
        0.010100764222443104,
        -0.09500398486852646,
        -0.0026015338953584433,
        -0.09046756476163864,
        0.008847047574818134,
        0.018168995156884193,
        -0.028769424185156822,
        -0.09003104269504547,
        -0.022839106619358063,
        0.0009484587935730815,
        0.1010105237364769,
        -0.08036293834447861,
        0.02968178130686283,
        0.09546545147895813,
        -0.019096530973911285,
        0.07117243856191635,
        0.06171666830778122,
        -0.016340646892786026,
        -0.07488051056861877,
        0.02594153955578804
    ]
}