{
    "id": "84U9eweJjhU",
    "title": "This TV is ONLY for super fans - LG C2 Star Wars Edition",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-08-11T22:30:23Z",
    "video_url": "https://www.youtube.com/watch?v=84U9eweJjhU",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "LG",
        "Star wars",
        "c2",
        "gaming",
        "xbox",
        "ps5",
        "pc",
        "next gen",
        "vrr",
        "gsync",
        "freesync",
        "disney",
        "limited edition",
        "rare",
        "starwars"
    ],
    "views": 372407,
    "likes": 14131,
    "comments_count": 683,
    "description": "Grab your Moray and Minnow toolkits at   Jedi Master Plouffe wields his TV remote light saber and tries to defeat the evil Sith lor-- okay I don't know anything about Star Wars, but we got the new LG C2 Star Wars edition to see if there are enough extra goodies included to warrant the increased pricing over the regular (boring?) C2.  Check out the LG OLED Evo C2 Special Edition:   Enter to win your very own Star Wars Special Edition OLED Evo C2 TV from LG at  (US Only)  Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 The Sith has been defeated 0:24 Unboxing 1:23 You may need some help with this TV 1:50 Custom Imperial backplate 2:33 Mounting the stand and pricing impressions 3:34 Ranting about Star Wars for a bit 4:20 Initial Star Wars remote impressions 4:36 The problem with ultra-thin TVs 5:19 Sponsor - iFixit 5:44 Attempting to turn on the TV and the awful remote instructions 6:17 The worst peel 6:41 TV Setup 7:44 Display impressions and features 8:58 Star Wars features 9:35 Overall impressions 10:12 Outro",
    "description_links": [
        "https://www.iFixit.com/LTT",
        "https://lmg.gg/gcOf4",
        "https://lmg.gg/LGStarWarsSC",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "(laser noises) - Ooh, yeah! Get blasted, Darth Vader. Except it's a lightsaber. I'm sorry, we don't have a blaster. I really wish we had any more props, like a Jedi robe or something, because today we've got LGC2, the Star Wars edition. How do you make a TV Star Wars? It's otherwise a pretty nice TV. We did the thing recently, and it's very similar to the G2. We're gonna see if it compares at all. The screen is Millennium Falcon shaped. It's powered by force lightening. My best guess is it's powered directly by the force. (laughs) So the one awesome thing about TVs is it's a 65 inch, and I'm a small person. So, as you can see, my hands aren't big enough to take the whole shell off of the box. I thought for sure we were gonna get the small boy, but no. Okay, it's a box within a box. I still need the knife then, I guess. I don't know what I was expecting for a Star Wars TV, but I wasn't expecting this. OLED Evo, it's got the new Gen 2 panel. It's got the Alpha 9 Gen 5 processor. It's 4K, 120 htz, HDR. I think we measure almost like, 1,000 nits. Let's get the box off. (groans) No, I can get this one. I'm just big enough. Okay, maybe I do need help (laughs). Can you help? Editor, please don't put any of that in. Yeah, so this thing kinda sucks to lift. This is my problem with a lot of modern displays. Yeah, it's super thin, awesome. There's a problem though. You've got to move these things around. And especially if you don't have help, highly recommend doing this with at least two people. Or honestly, get it professionally mounted. I don't usually want to spring for the service from Best Buy, or wherever you're buying stuff from, but the reality is, you don't want to get this all the way home after paying like two, $3,000, and then screw it up by like, just lifting it wrong, or whatever. Oh, neat, check this out. It's got this weird texture on the back as well. It's like a weird finish, that I've never experienced before, but I kinda like it. It's also got what, the Imperial symbol on the back, which is pretty cool. Pretty sure that's the Imperial symbol, right? To be fair, the Emperor was kind of a good guy. He was supposed to be protecting against the incoming threat of the Thrawn. But Disney destroyed the extended universe, so. - [David] Thrawn's back. They're in the Disney books now. - (bleep) there's Disney books now? Why didn't they just keep the (bleep). Let's put the TV mount on. What's up with the pattern on the back? Is it the Lightsaber? Oh, Vader's front panel thing? Now I have heard, that the remote is basically a lightsaber. So let's- I don't care about this right now, I wanna find the remote. - [David] No-no wait, finish mounting the stand. (styrofoam scratching) - How much is this guy? Have they added Star Wars pricing or anything to it? - [Bell] So it costs $3000. - For the C2? You know, I guess the blessing in disguise here is that it's limited quantity, so, just a few hundred units or something like that. So I mean, the only people who are really gonna get this thing are really dedicated fans who wanna buy all the merch. All I've seen so far, is the back. Which is kind of cool, and the box. But I'm a little upset that they added that much to the cost of this thing. We've got some extra screws, David thinks we're supposed to screw this thing in. Dude, this thing is on. I'm honestly not so sure about that. - [David] What the hell are these? - [Nicholas] Those look like screw holes. - [David] Yes! - [Nicholas] I hear you. - [David] Yes! - Okay fine, fine, fine. - [David] Yeah (bleep) off! Screw it in! - Booty, booty, booty, booty, rockin' everywhere. David feels more comfortable now, so we're gonna keep goin'. I don't really like what Disney's done with the franchise, all that much. The Mandalorian was fun. I haven't watched Kenobi yet, but I've heard really mixed things about it, to be honest. I really don't like how much they're also using the Tatooine set. It's like they spent a ton of money on this thing and then they're like, \"Yeah, how many ways can we use this?\" \"I don't know, let's just make, like, four shows that happen on Tatooine.\" Honestly, the reality is, I'll probably watch them all. I just don't have Disney +. It's so frustrating, as someone who loved the original trilogy, I liked the prequel trilogy, only because I grew up with it as a kid, but then on top of that, all of the games, and all of the books, that I read and played as I grew up. Man that was like, prime Star Wars, all the spin-off stuff is like, prime Star Wars. And then Disney comes in, and they say- - I miss the part where that's my problem. - I've heard good things about this remote. You know what though, I'm not gonna lie, I've used the LG remotes quite a bit. I don't know if it's worth (laughs) spending the extra money to get the Star Wars version. But this is a pretty sweet remote and I strongly prefer it to the regular LG remote. And now we're gonna lift this bad boy up, put it on the short circuit set there. The only problem, like I said before, is this is a really thin TV. It's nice and light, but I am always terrified of bending these things. Especially when they do this style, where it's all encompassed in the back. But anyway, let's pick it up without breaking it. The S95B from Samsung uses a similar design where it's like a big, thick, piece and the rest of it is laser thin. And we have had to take that thing out of the box, several times, because there's no other QLED TVs on the market And we- It's easier to bend And not only that, but we looked it up afterwards, and other people have also had similar problems. So be very careful when moving it. That's all I gotta say. Alright, now that we've got that out of the way, we're gonna power it on, and see if there are any other cool Star Wars features in the UI. But before that, a word from our sponsor, iFixit. iFixit makes compact tool kits with all the essential bits to fix small electronics. The Minnow has 16 driver bits that work with most laptops, desktops, and smart phones. The Moray has 32 bits with the additional ones for fixing things like home appliances and furniture. Both have sweet magnetic lids, built in sorting trays. And a 4 mm swivel top driver. These things are great. Fix your stuff today and learn more using the links down in the description. Let's turn it on, where's the remote? Where's the cool lightsaber remote? Oh, my God. (lightsaber noises) Oh, we didn't plug it in. No! I'm tryna- How do I open this guy? It's like, pull the thing out of the bottom, But how do I pull that thing out of the bottom? I tried the typical remote things of just pushing the back, or the front. - Oh, It's got like a SIM removal. Whoa, Jesus Christ we need the SIM- Does it come with the (bleeping) SIM removal tool? - The instructions are bottom to top. - Wow, and then out pops the battery case. - [David] Why? - Wow. We're gonna get this peel off here, That's not Star Wars themed peel. I would actually be jazzed if the peel had little, just Star Wars logo printed across the whole thing. Oh, yeah, speed lines would be good too. Like when you're going into hyperspace. And then you could peel it and be like, \"We're going into hyperspace!\" But no, we're just gonna... (peel squeals) It made me a little uncomfortable. I'm going to throw this away. First time setup. Oh, can I sit on the couch now? Let's go with LA, they're the same as us, I think. Oh, I gotta read the Terms and Conditions. Don't you love smart TVs? Skip, next! The way to watch TV. None (laughs) (gasps) Oh my God! Okay. I'll be honest though, I'm pretty sold on this lightsaber for the magic remote. Almost nothing about this is Star Wars, except for the Star Wars logo. The rest of it could just be remote. Another interesting feature is, they actually have Star Wars stuff displaying right here. Normally, when you're going through all this, it's all just whatever, LG stock material. So, it's the little things. But you're paying $500 for it, so I hope there's a lot of little things. Is there anything else that's Star Wars? Like all of the UI, even if you go to home, it just looks like a regular LG TV. Which is fine, their UI is kind of not bad. It's better than some other people's. You know what would be really cool? When they were doing the intro with the voice, at the start, if that was in Darth Vader's voice, or something. 'Cause otherwise, yeah, it's just kind of a TV. Oh, yeah. Yes! (laughs) Okay, hold on, hold on. Are they doing another show on Tatooine? I was working on EA when the new Battlefront came out. And, yeah, it's totally my fault. Whether you're a Star Wars fan, or not. The C2 is still a really nice TV. It's 4K, 120 htz, it's got really good HDR as well, with both HDR 10 and Dolby vision, for some of that really insane, peak brightness. Why's he have a gun? Why's he got a (bleep) AK? When OLED first came out there were just so many issues when it came to to Burnon. But these days, you don't really have to worry about it anywhere near as much. Even if you use this as a giant 65 inch computer monitor. I wouldn't really recommend that, but you can. Wow, it's the senate. This this is also really good for gaming. It's got four HDMI 2.1 ports on the back. And check it out, if you've got something plugged into one of those HDMI 2.1 ports, for the 4K 120 experience, when you hit the Settings button, you get the new game menu. Which is awesome, it shows you the variable refresh rate's on, show's you what screen mode you're in, let's go to FPS for no real reason. I usually just stick to standard here. It's got tons of Rarible refresh options. You got G Sync, you got Free Sync, you got Auto Low Latency Mode stuff on. It's great. It gets better. I was dubious, at first, I was very dubious because you're paying a lot of money for this TV. And as- If someone's a superfan and they're trying to get that collector's item, you need a bit more. Check this out. (lightsaber activates) (Nicholas laughs) That's awesome! When you go to turn it off, it actually does a big Star Wars logo as it powers off. And then they're giving us concept art. Another thing we just learned, is that when you turn it off, \"May the force be with you.\" Aw, that's so nice. Do I think it, you know, really is worth the 500 to $800? - [Bell] Yes. - Not necessarily. But it's a really cool feature and they did a better job of this than I thought they would. For one of your best gaming experiences, you do want a brand new TV, that can do 4K 120 with HDMI 2.1. If you're a PC gamer, then this is even better for you, because you can actually take advantage of 4K 120 in a lot of games. Our Xbox here, can probably only do it in a couple really. Other than that though, it's a pretty sweet TV. I think that if you want to save some money, then get a C2 over a G2. If you want the Star Wars version, it might be kind of hard to find, because there's only so many of these made. And on top of that, you're paying an extra premium of like, at least $500. So, would I buy it? No. Thanks for watching everyone. Subscribe to Short Circuit if you want to see more. And if you also want to see more right now, then go check out the Sony M9 Endzone Monitor. That thing was pretty cool.",
    "transcript_keywords": [
        "Star Wars",
        "Star Wars logo",
        "Star",
        "Wars",
        "prime Star Wars",
        "Star Wars version",
        "thing",
        "cool Star Wars",
        "Star Wars stuff",
        "big Star Wars",
        "Star Wars features",
        "things",
        "Star Wars edition",
        "added Star Wars",
        "Star Wars fan",
        "Star Wars pricing",
        "Star Wars themed",
        "remote",
        "yeah",
        "Wars logo"
    ],
    "transcript_entity_values": [
        "Vader",
        "4 mm",
        "500",
        "David] Thrawn's",
        "32",
        "Darth Vader's",
        "LA",
        "a ton",
        "at least two",
        "Kenobi",
        "Thrawn",
        "Moray",
        "4",
        "one",
        "Rarible",
        "at least $500",
        "1,000",
        "iFixit",
        "Minnow",
        "the Terms and Conditions",
        "C2",
        "500 to $800",
        "Jesus Christ",
        "EA",
        "K",
        "a 65 inch",
        "Battlefront",
        "Dolby",
        "Imperial",
        "3,000",
        "David",
        "Samsung",
        "Disney",
        "Darth Vader",
        "LG",
        "3000",
        "first",
        "Evo",
        "Nicholas",
        "LG TV",
        "these days",
        "senate",
        "16",
        "a Jedi robe",
        "120",
        "the Sony M9 Endzone Monitor",
        "four",
        "Tatooine",
        "Short Circuit",
        "Mandalorian",
        "First",
        "2.1",
        "Xbox",
        "Gen 2",
        "Millennium Falcon",
        "65 inch",
        "Burnon",
        "Best Buy",
        "today",
        "UI"
    ],
    "transcript_entity_types": [
        "PERSON",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "FAC",
        "QUANTITY",
        "PERSON",
        "ORG",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.04000921919941902,
        -0.07329673320055008,
        0.06381631642580032,
        -0.12314756214618683,
        0.08841381967067719,
        0.09439535439014435,
        -0.09906656295061111,
        0.09143789857625961,
        0.06747037917375565,
        0.06133241951465607,
        -0.02137140743434429,
        -0.021125225350260735,
        0.0018389917677268386,
        -0.049237776547670364,
        0.02587321773171425,
        -0.08589033037424088,
        0.06693531572818756,
        -0.09142380207777023,
        -0.01818804256618023,
        -0.02866428904235363,
        0.011914952658116817,
        0.0031815862748771906,
        0.02731645479798317,
        0.0001692199002718553,
        0.11099863797426224,
        -0.09081915020942688,
        -0.02235911786556244,
        -0.005404681898653507,
        -0.00792895257472992,
        -0.06594017893075943,
        0.058128464967012405,
        0.04102880880236626,
        -0.051986634731292725,
        0.007809350732713938,
        0.013480527326464653,
        -0.12372087687253952,
        -0.019920725375413895,
        -0.10241647809743881,
        -0.03801286220550537,
        -0.009110677987337112,
        0.015558131970465183,
        -0.07690729200839996,
        -0.03427146375179291,
        -0.034986045211553574,
        -0.013976597227156162,
        -0.019119098782539368,
        0.005202394910156727,
        -0.03961341455578804,
        0.027275925502181053,
        0.05391263589262962,
        0.04344886913895607,
        -0.021573835983872414,
        0.024588443338871002,
        -0.0346505269408226,
        0.01113563310354948,
        -0.06277716904878616,
        -0.018174706026911736,
        0.030558466911315918,
        0.07543175667524338,
        -0.006210002116858959,
        0.053481072187423706,
        -0.04035911336541176,
        -0.036148909479379654,
        0.07377275824546814,
        -0.052440982311964035,
        -0.09851305931806564,
        0.03721833601593971,
        0.060513854026794434,
        -0.06737592816352844,
        -0.023305626586079597,
        -0.09067031741142273,
        0.026238709688186646,
        0.09688658267259598,
        0.07481461018323898,
        -0.0018147880909964442,
        -0.0015833083307370543,
        0.0999666303396225,
        -0.08383607864379883,
        0.0777541995048523,
        -0.010705065913498402,
        0.015280008316040039,
        -0.021591199561953545,
        -0.06652276962995529,
        0.013046791777014732,
        0.02376660890877247,
        -0.059189580380916595,
        0.07454691082239151,
        0.006042191758751869,
        0.042391691356897354,
        -0.02896958775818348,
        0.001377432607114315,
        0.05203714594244957,
        0.029460683465003967,
        0.05828606337308884,
        -0.08887898176908493,
        0.03346860036253929,
        0.045596398413181305,
        -0.059182681143283844,
        -0.027562523260712624,
        0.07588032633066177,
        0.016097966581583023,
        -0.0007938136113807559,
        0.0023446788545697927,
        -0.06620807945728302,
        -0.06216682493686676,
        -0.03975251317024231,
        0.027173833921551704,
        0.043387092649936676,
        -0.008445845916867256,
        -0.018084349110722542,
        -0.09508171677589417,
        0.07196854054927826,
        -0.08630213141441345,
        -0.020128386095166206,
        -0.030241822823882103,
        0.06137211248278618,
        0.034134432673454285,
        -0.04975193366408348,
        0.04691050946712494,
        -0.08340472728013992,
        0.016172107309103012,
        -0.06997241079807281,
        0.046968013048172,
        0.0669344961643219,
        0.015882091596722603,
        -0.04570735991001129,
        -0.00663137249648571,
        4.944151280077619e-33,
        -0.09076324850320816,
        0.025693023577332497,
        -0.05433078855276108,
        -0.10784325748682022,
        -0.01928991824388504,
        0.045367080718278885,
        -0.0008974267402663827,
        0.06669653952121735,
        -0.0751839131116867,
        -0.006541748996824026,
        -0.08058174699544907,
        0.034532975405454636,
        -0.03736964985728264,
        0.03388015180826187,
        0.013382439501583576,
        -0.04352301359176636,
        -0.03244806081056595,
        0.013904133811593056,
        -0.03507162258028984,
        -0.02998781017959118,
        -0.03737228363752365,
        -0.018531743437051773,
        0.03827793896198273,
        -0.021531347185373306,
        0.07248175144195557,
        -0.009943952783942223,
        0.0562552809715271,
        -0.03682436794042587,
        0.06453274935483932,
        0.033968180418014526,
        -0.03225724399089813,
        -0.0014344219816848636,
        0.05657714605331421,
        -0.018345415592193604,
        -0.05005241557955742,
        -0.05659760907292366,
        -0.1252150982618332,
        -0.09610868990421295,
        0.006507582031190395,
        -0.00047324143815785646,
        0.05368157848715782,
        0.06961841881275177,
        -0.11925729364156723,
        -0.0179506316781044,
        -0.033386241644620895,
        0.061788879334926605,
        0.039623528718948364,
        -0.023201975971460342,
        0.006029384210705757,
        0.04913671687245369,
        -0.010251452215015888,
        0.006954316981136799,
        -0.10842651128768921,
        -0.09102763235569,
        0.03337383642792702,
        -0.002455600770190358,
        -0.06553015857934952,
        -0.02634347788989544,
        0.0536237470805645,
        -0.03024395927786827,
        -0.016591837629675865,
        0.053244542330503464,
        0.054999131709337234,
        0.006891774013638496,
        -0.08627665042877197,
        0.06085139885544777,
        0.033742133527994156,
        -0.03197507932782173,
        -0.07106702774763107,
        -0.04887058213353157,
        -0.042270563542842865,
        -0.04221084341406822,
        0.0683002769947052,
        -0.08877328783273697,
        0.03707866743206978,
        0.01584620587527752,
        -0.03504890203475952,
        0.009706392884254456,
        0.05309218540787697,
        -0.00012194705777801573,
        -0.016175027936697006,
        -0.007088647689670324,
        0.05601002275943756,
        -0.0024428514298051596,
        0.07834577560424805,
        -0.013763799332082272,
        -0.10715416818857193,
        0.01445059571415186,
        -0.014569727703928947,
        0.004533500876277685,
        0.02158358320593834,
        -0.044735535979270935,
        -0.008234427310526371,
        0.010429993271827698,
        -0.011064678430557251,
        -6.97667505219742e-33,
        -5.237559162196703e-05,
        0.0414145290851593,
        -0.03593098372220993,
        -0.03699848800897598,
        0.050754059106111526,
        0.02683386579155922,
        -0.04377952590584755,
        -0.007960761897265911,
        -0.005022035911679268,
        -0.04437018558382988,
        -0.015232517383992672,
        0.023345131427049637,
        -0.11654757708311081,
        0.01309816911816597,
        0.0297955684363842,
        -0.11007364094257355,
        0.04597097262740135,
        -0.03615164756774902,
        0.030845480039715767,
        -0.010019838809967041,
        0.11768698692321777,
        0.011174260638654232,
        0.008847247809171677,
        0.07515573501586914,
        0.06960701942443848,
        -0.020380733534693718,
        0.01034587249159813,
        0.09067194163799286,
        -0.047001902014017105,
        0.02265818975865841,
        0.025539441034197807,
        -0.05200114846229553,
        -0.036653269082307816,
        -0.003007076680660248,
        0.07336173951625824,
        0.02766365557909012,
        0.0764460414648056,
        0.06019584462046623,
        -0.050942324101924896,
        0.03687455505132675,
        -0.0020969274919480085,
        -0.007518167607486248,
        -0.014766335487365723,
        -0.022149913012981415,
        0.004141084849834442,
        -0.07888609915971756,
        -0.0031242475379258394,
        -0.10656527429819107,
        0.061782680451869965,
        0.024890456348657608,
        -0.011909940280020237,
        -0.04567556083202362,
        0.07155794650316238,
        -0.04065492004156113,
        -0.07194637507200241,
        0.0421261265873909,
        -0.04517829790711403,
        0.0562475323677063,
        0.015979459509253502,
        -0.01945347525179386,
        0.04818950966000557,
        -0.005126016680151224,
        -0.06797540932893753,
        -0.010109121911227703,
        0.021596061065793037,
        -0.02316727489233017,
        0.08572384715080261,
        0.0355663001537323,
        -0.01841416209936142,
        -0.056478872895240784,
        0.020088976249098778,
        -0.08119563013315201,
        -0.03787519782781601,
        -0.06334133446216583,
        0.013614985160529613,
        0.0675959661602974,
        0.032708540558815,
        -0.0429048128426075,
        0.02366221323609352,
        0.004814302083104849,
        -0.008542542345821857,
        0.03792685270309448,
        0.0855042040348053,
        -0.003926743287593126,
        0.05929906666278839,
        -0.009391014464199543,
        -0.009008357301354408,
        -0.013282358646392822,
        0.015279899351298809,
        0.010381610132753849,
        0.018414722755551338,
        0.0033066028263419867,
        0.04798440262675285,
        0.0390598326921463,
        0.10857115685939789,
        -6.204593461234253e-08,
        -0.020191140472888947,
        -0.02090848796069622,
        0.0478423610329628,
        0.03581222519278526,
        0.004684776533395052,
        -0.09998616576194763,
        -0.04183131083846092,
        -0.028696440160274506,
        0.04829441010951996,
        0.010205176658928394,
        0.04168142378330231,
        -0.015790103003382683,
        -0.01731058955192566,
        -0.009011285379529,
        0.048548612743616104,
        0.010366188362240791,
        -0.06767001748085022,
        0.05096239224076271,
        -0.03378071263432503,
        0.03785821795463562,
        -0.014461150392889977,
        0.008840329945087433,
        0.07657714933156967,
        -0.0038845245726406574,
        0.054643530398607254,
        0.0373966209590435,
        -0.007270495872944593,
        0.016026509925723076,
        0.10709930956363678,
        -0.08204393833875656,
        -0.04881927743554115,
        0.02722029760479927,
        -0.02059975452721119,
        -0.0187811441719532,
        0.038015302270650864,
        -0.04276508837938309,
        -0.049015577882528305,
        0.04210861772298813,
        0.028317755088210106,
        0.11018668115139008,
        0.03027677722275257,
        0.0035856501199305058,
        0.03339460492134094,
        0.0084015391767025,
        0.014734890311956406,
        0.08286429941654205,
        -0.01612180657684803,
        -0.12535563111305237,
        0.019927483052015305,
        -0.07767044752836227,
        0.04731963947415352,
        0.010475103743374348,
        -0.07965181767940521,
        -0.016956442967057228,
        -0.030938338488340378,
        -0.04854722321033478,
        -0.025449704378843307,
        0.05674496293067932,
        0.027900630608201027,
        0.0021153546404093504,
        0.051800746470689774,
        -0.0893775075674057,
        -0.04233822226524353,
        0.1102752536535263
    ]
}