{
    "id": "85_fSnZ6NUM",
    "title": "Wireless Earbuds That Don't Suck!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-12-15T19:31:34Z",
    "video_url": "https://www.youtube.com/watch?v=85_fSnZ6NUM",
    "category": "Science & Technology",
    "tags": [
        "dave2d",
        "dave lee",
        "2017",
        "earpod 2017",
        "earpod",
        "earphones",
        "earpiece",
        "zolo",
        "zolo liberty",
        "liberty",
        "crazybaby",
        "air",
        "crazybaby air",
        "apple",
        "apple airpods",
        "airpods",
        "bluetooth",
        "wireless",
        "AAC audio",
        "siri",
        "water resistant",
        "sweat resistant",
        "best earpods",
        "best earphones",
        "best earpiece",
        "best earbuds"
    ],
    "views": 2746632,
    "likes": 33325,
    "comments_count": 2270,
    "description": "Dave2D comparison of the Zolo Liberty Plus, Crazybaby Air Nano & Apple AirPods. These are some of the best earphones on the market for inexpensive wireless earbuds. Zolo Liberty Plus -  Apple AirPods -  Crazybaby Air Nano -    Apples AirPods are great but they're not cheap and they have some issues. Zolo and crazybabys earpods are a great alternative to Apples AirPods that work with Android and Apple devices. Anyone looking to pick up some good bluetooth earphones should take a look at the AirPod, Air Nano and the Zolo Liberty Plus.  Music: Fili - H2O  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2BdQ9Pd",
        "http://amzn.to/2yFaqKT",
        "http://amzn.to/2AV3iQn",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going? Dave2D here And in front of me are three wireless earbuds that don't suck. Everyone knows this one the Apple AirPods. These are great. I would consider these to be one of Apple's best products from this year, but there's three issues with them. First, they're expensive. $160 is a lot of money for any kind of wireless earphones, and secondly, they fall out pretty easily when I'm running with them or if I'm doing anything active. If I have them in my ear, if I'm like, moving my head a little too much, they will fall off and I think a lot of people have that issue. And I know there are third-party products that you can kind of hook up to it to make it stay in your ear, but if you don't have them, they fall out pretty readily. But, the thing that I think is, kind of \"universally known,\" is that they are pretty ugly in your ear. So, they've been around for like, what? Six, seven months now, maybe more? And still, when people have them in their ears, they just look... they just don't look good. It's very iconic, it's like the super ugly Apple Q-tips, and I just don't like the way they look. So, I have found two I guess, new products that have come out that I've been testing, that I like a lot. And...let's go through them. So, the first one is a Zolo Liberty+... (I should take these out of my ear...) ...Zolo Liberty+. So these are, I guess, the second generation of their wireless earbuds? This is like the parent company to...this is Anker. They normally make like battery packs and charging devices, but they make some good wireless earbuds. Now, the original wireless Liberty were not great, I had connectivity issues. These new ones don't, and I think that's a really important thing when it comes to any kind of wireless device. If it ever drops connection, like, to me that just makes me not like the product, but these ones do not have connectivity issues. They're very reliable and that's one of the great things about the Apple AirPods. So, the Liberty+ comes in this pretty premium looking box. It's all metal and it's heavy. It definitely has some weight to it, and I think a lot of that weight comes from the battery. It does have a relatively large battery in there, and I think the aesthetic of the earbuds themselves look nice. It's a larger design than the Apple AirPods, but there's no appendage so you don't have that Q-tip look going. And, I would say that the unit is kind of bulky like, it's just bulkier than the AirPods but, they don't feel heavy. I mean, when you put them your ear, you don't notice their weight or anything like that. The connection is good, it's very easy to pair and setup with your phone, and I find that the audio is good not amazing though. I don't find that any of these have amazing audio. I think that these are slightly, ever so slightly, better than the AirPods. But, again, similar sound quality between the three. And when it comes to fit, the Liberty+ has these rubber tips that you can attach to it, and I find that they fit my ears really well. Obviously, everyone's gonna have a different ear shape or ear size, so everyone's gonna have a different experience with this, but they work well for me. All right, some other thoughts. I don't like how this thing uses micro USB to charge. It's 2017, and this thing's made by Anker, right? Anker has a ton of USB-C products. I just find it really weird that they would use Micro-USB on this device. So if you're unfamiliar with how these things work or just how any of these things work It's like, you have this case that holds a battery and then the wireless earbuds themselves have batteries inside them, so you use them for a few hours and then when you're done when those things are depleted or just when you're done using them you put them back in the case, and the case has a battery inside and that in turn, charges the batteries inside the little earbuds. So, you gotta charge the thing pretty frequently. It's just really weird that they use Micro-USB in late 2017, that's a bit of a bummer, but the thing I do like about this thing a lot is how easy it is to put the actual earbuds into the case. And I know it sounds like really simple because we've seen the AirPods they do it really well, you just drop it in and it works perfectly. Same thing with these guys you just put it in, there's no fiddling around as long as we have the left and right one sorted out. You just drop it in and you're good to go. Now when it comes to battery life, they claim three and a half hours per charge for the earbuds I'm actually getting closer to four hours and then you can get up to 48 hours of use just by charging it up through the case, which is a relatively long lasting set up. Okay, let's talk about this thing. This is the crazybaby Air (NANO) that is a mouthful of a name. This is a much less premium feeling case. It definitely has more plastic to it, and it just feels a little more flimsy, but the product is good. So, this thing uses USB-C to charge which I love but there's definitely a less premium vibe to this casing. It's not super cheap or anything, but it's not as good as this thing. This is all metal, this is all plastic. And even compared to the AirPods. Like, this is a polycarbonate case, very plastic case obviously, but it does feel more, no. Just feels more refined. This is definitely more flimsy. Okay, the actual devices themselves. They come out readily, and they're small. So these are white these come in a bunch of colors, but I got the ones in white. But strangely enough, these don't stick out like a sore thumb when you wear them in your ear. And I think part of it or, a big part of it is that they don't have the appendage like the AirPods. These just sit in your ear and they look normal to me. But if you want, you can get them in a bunch of different colors. In terms of fit, again, It comes with a bunch of rubber tips and rubber hooks that you can use to make this thing more custom to your ear, but I don't find these as comfortable for my ear. But everyone's gonna be a little bit different. Audio quality, again, is good not amazing but, it's earbuds right? Unless you're paying huge amounts of money, You're never gonna get great audio quality from earbuds especially not wireless ones. But these ones, I would actually say are the worst of the three, just by a bare amount. I mean they're all very similar, but if I had to just label them in terms of rank, I would say Zolo sounds the best by a little bit. AirPods in the middle, and then the Air (NANO) last. Now battery life on these are short, relatively short. These are three hours, and I'm getting maybe a little bit more but close to three hours. But charging these things are not my favorite things. So, when you open up the case, Unlike the other two, you have to line these up quite well to get them to charge properly. Now it's not so much an issue of getting used to it, because I've been using them for a while, it's more about just how the charging mechanism works. You have to place it and kind of rotate it perfectly, and it's just hard to line it up each time. But, it's not bad. It's still relatively easy to charge all of these. I do like the size of the (NANO) air. It's a very small and clean looking device when you have it in your ear. It's just unobtrusive and then, same thing when it's in the case. It's just a relatively small and lightweight case. It's just smaller and lighter than the case on the Liberty+. So all three of these are relatively good options, I don't think you can go wrong with either of them. Here's a comparison chart, so you can guys make your own decision. But to wrap it up, if you're an Apple user and you have $160 to spare, the Apple AirPods are an obvious choice. But if you're not, and you want to spend a little bit less money on your earbuds, these two are great options. Okay, hope you guys enjoyed this video! Thumbs if you liked it, subs if you loved it. See you guys next time.",
    "transcript_keywords": [
        "thing",
        "Apple AirPods",
        "Apple",
        "ear",
        "case",
        "earbuds",
        "AirPods",
        "Liberty",
        "good",
        "wireless",
        "things",
        "wireless earbuds",
        "Zolo Liberty",
        "battery",
        "kind",
        "charge",
        "hours",
        "pretty",
        "lot",
        "make"
    ],
    "transcript_entity_values": [
        "the Apple AirPods",
        "Anker",
        "up to",
        "three",
        "late 2017",
        "third",
        "48 hours",
        "close to three hours",
        "AirPods",
        "NANO",
        "seven months",
        "USB",
        "a few hours",
        "this year",
        "Apple",
        "Anker",
        "three hours",
        "First",
        "second",
        "160",
        "secondly",
        "a ton",
        "Zolo",
        "two",
        "first",
        "2017",
        "Micro-USB",
        "four hours",
        "Liberty",
        "Six,",
        "Air",
        "three and a half hours",
        "Thumbs",
        "USB-C"
    ],
    "transcript_entity_types": [
        "FAC",
        "WORK_OF_ART",
        "TIME",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "TIME",
        "TIME",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "ORDINAL",
        "ORDINAL",
        "MONEY",
        "ORDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "TIME",
        "PRODUCT",
        "DATE",
        "ORG",
        "TIME",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.0475192554295063,
        -0.04908471554517746,
        0.06774664670228958,
        0.013834354467689991,
        0.034645333886146545,
        -0.05020608380436897,
        0.09013186395168304,
        0.023433076217770576,
        -0.07729393988847733,
        0.03318438306450844,
        0.006748341489583254,
        0.01957767643034458,
        0.006872411817312241,
        -0.04790308699011803,
        0.03251797333359718,
        0.02262110263109207,
        0.11285477876663208,
        -0.045369550585746765,
        -0.012233360670506954,
        0.015728875994682312,
        -0.04867863282561302,
        0.026564547792077065,
        0.11548489332199097,
        0.04414739832282066,
        -0.0029282337054610252,
        -0.0006240555667318404,
        -0.013005515560507774,
        -0.024953506886959076,
        -0.06672312319278717,
        -0.022461483255028725,
        -0.02491314709186554,
        0.0695660337805748,
        0.004670660011470318,
        -0.06800542771816254,
        0.02080128900706768,
        -0.1278480738401413,
        0.07804502546787262,
        -0.015407176688313484,
        -0.06129571422934532,
        -0.0396868959069252,
        -0.015377180650830269,
        0.056627336889505386,
        -0.05409282445907593,
        0.02873172052204609,
        -0.055404096841812134,
        -0.05030344799160957,
        0.003618755144998431,
        -0.029067251831293106,
        0.010418043471872807,
        0.029963988810777664,
        -0.006914163939654827,
        -0.10052482783794403,
        0.08407856523990631,
        0.061864785850048065,
        -0.01757909171283245,
        0.08036843687295914,
        -0.12202228605747223,
        0.004177575930953026,
        -0.005499640014022589,
        -0.021757664158940315,
        0.06780724972486496,
        -0.0379449799656868,
        0.03655488044023514,
        -0.030192695558071136,
        0.010762058198451996,
        -0.00051977758994326,
        -0.02692972496151924,
        0.05982904136180878,
        -0.007392373867332935,
        0.01910351775586605,
        -0.09476617723703384,
        0.04780837520956993,
        0.0014475655043497682,
        0.032999224960803986,
        0.061135582625865936,
        0.06287657469511032,
        0.08961602300405502,
        -0.10503406822681427,
        -0.006234032567590475,
        0.0783749520778656,
        -0.04479386657476425,
        -0.07271666079759598,
        0.018266135826706886,
        -0.07206153869628906,
        0.08274360001087189,
        -0.020304067060351372,
        0.014226008206605911,
        -0.019858339801430702,
        -0.13006266951560974,
        0.018544664606451988,
        -0.07215999811887741,
        0.10937447845935822,
        0.0254198145121336,
        -0.058508098125457764,
        0.04208417981863022,
        -0.0015824143774807453,
        0.02862197905778885,
        0.031655535101890564,
        -0.008858726359903812,
        0.040905535221099854,
        0.03777389973402023,
        0.011727474629878998,
        0.018307587131857872,
        -0.10304069519042969,
        0.027759592980146408,
        -0.10206951946020126,
        -0.060254596173763275,
        -0.05917719006538391,
        0.06232146546244621,
        0.10197924077510834,
        -0.03729075938463211,
        -0.08810015767812729,
        -0.027954204007983208,
        -0.032959919422864914,
        -0.030295269563794136,
        0.06952869147062302,
        -0.02556248940527439,
        0.13568635284900665,
        0.032887052744627,
        -0.027635937556624413,
        -0.0071813627146184444,
        0.0022791142109781504,
        0.01281195692718029,
        0.003024098929017782,
        -0.04938753321766853,
        0.03469333425164223,
        -0.15076573193073273,
        3.329762603488814e-33,
        -0.0001678216503933072,
        0.06506967544555664,
        -0.04468559846282005,
        -0.010025609284639359,
        -0.06018980219960213,
        -0.03669962286949158,
        -0.042473677545785904,
        0.01045109424740076,
        -0.014511586166918278,
        0.08317423611879349,
        -0.15121059119701385,
        -0.009521658532321453,
        -0.04967659339308739,
        -0.05194518342614174,
        0.04526376351714134,
        -0.10895691812038422,
        -0.12641116976737976,
        -0.028272492811083794,
        -0.04389520734548569,
        0.07562558352947235,
        0.03858044371008873,
        0.004205452278256416,
        -0.010018725879490376,
        0.07851289957761765,
        0.10106509178876877,
        -0.06584644317626953,
        0.03634725883603096,
        -0.024051090702414513,
        0.024633513763546944,
        0.010657730512320995,
        -0.06644416600465775,
        -0.0026417397893965244,
        0.017867498099803925,
        -0.03564347326755524,
        -0.02516566589474678,
        -0.009422785602509975,
        -0.06736133992671967,
        -0.004982060752809048,
        0.01763387955725193,
        -0.15225620567798615,
        -0.028383618220686913,
        0.013273922726511955,
        -0.041839633136987686,
        0.02972346358001232,
        0.08600205928087234,
        0.034088317304849625,
        -0.0004906908725388348,
        -0.0047785635106265545,
        0.08702034503221512,
        -0.06924140453338623,
        -0.09511525183916092,
        0.01543407328426838,
        -0.10106389224529266,
        0.05740642547607422,
        0.005673243198543787,
        -0.07580184191465378,
        0.00792181957513094,
        0.080288365483284,
        0.004548972938209772,
        -0.021562201902270317,
        0.01389723177999258,
        0.04501478374004364,
        -0.008411005139350891,
        -0.05948476865887642,
        -0.06800515949726105,
        0.06189848482608795,
        0.05404556915163994,
        0.01776786334812641,
        -0.09551778435707092,
        -0.004714184906333685,
        0.04664355516433716,
        0.04375172033905983,
        0.06327273696660995,
        -0.03533921018242836,
        0.011495979502797127,
        -0.01241411454975605,
        0.019197357818484306,
        -0.06115768477320671,
        0.031915586441755295,
        -0.04605038836598396,
        0.05779189616441727,
        0.018919039517641068,
        0.017890354618430138,
        0.06463731825351715,
        0.02606283500790596,
        -0.052313465625047684,
        -0.029387133195996284,
        -0.05116158723831177,
        -0.022276796400547028,
        0.025740869343280792,
        0.01859275810420513,
        0.03911922127008438,
        -0.030383028090000153,
        -0.025940269231796265,
        -0.05896852910518646,
        -4.1951611772221976e-33,
        0.015404799953103065,
        0.012925777584314346,
        0.04824985936284065,
        0.05116211995482445,
        0.003346803365275264,
        0.024868221953511238,
        0.00841005053371191,
        -0.016357293352484703,
        0.024989182129502296,
        -0.040520284324884415,
        0.006464660167694092,
        0.011685575358569622,
        -0.027336392551660538,
        0.06234829127788544,
        0.011814659461379051,
        -0.07418574392795563,
        0.004789778962731361,
        -0.10636710375547409,
        0.10285373032093048,
        -0.02594035305082798,
        0.01143408752977848,
        0.060972217470407486,
        0.03092518448829651,
        -0.03473057597875595,
        -0.0762195959687233,
        -0.0011334706796333194,
        0.002100534038618207,
        0.037773504853248596,
        0.034841664135456085,
        0.025528239086270332,
        0.0009336602524854243,
        0.05117107555270195,
        -0.019789883866906166,
        0.004183981101959944,
        0.08240204304456711,
        0.0006434420356526971,
        -0.03404628485441208,
        -0.0010304080788046122,
        -0.029925556853413582,
        -0.044757843017578125,
        -0.018096264451742172,
        0.004802851006388664,
        0.050811827182769775,
        -0.04329986125230789,
        0.028516637161374092,
        -0.046437181532382965,
        -0.06634265184402466,
        -0.0052459049038589,
        -0.05775826796889305,
        -0.01609089784324169,
        0.023799864575266838,
        0.03291865810751915,
        -0.060074593871831894,
        -0.01674472913146019,
        -0.05553644150495529,
        0.01480738166719675,
        -0.034349359571933746,
        0.02650836482644081,
        0.019929960370063782,
        0.01301412470638752,
        0.0029767954256385565,
        0.000986904022283852,
        0.03101193904876709,
        0.05650746077299118,
        -0.07109536230564117,
        0.027716416865587234,
        0.06439436227083206,
        0.06208692863583565,
        -0.0024154665879905224,
        0.05489315837621689,
        0.01822247914969921,
        0.029111867770552635,
        0.0124927693977952,
        -0.018532872200012207,
        0.018291393294930458,
        0.07643386721611023,
        -0.024050582200288773,
        0.014662952162325382,
        0.014922226779162884,
        0.00043405205360613763,
        -0.013793010264635086,
        0.14433158934116364,
        0.03270169347524643,
        0.06550130248069763,
        0.04330367594957352,
        0.024387311190366745,
        0.01800650730729103,
        -0.015794914215803146,
        -0.081725113093853,
        0.07702036201953888,
        0.0372607558965683,
        -0.007107424549758434,
        0.00893576629459858,
        0.05148450657725334,
        -0.020289158448576927,
        -4.0542502688367676e-08,
        0.005084074568003416,
        -0.020522277802228928,
        0.035407327115535736,
        -0.01778700388967991,
        0.023652274161577225,
        -0.051364775747060776,
        -0.03369607776403427,
        0.03297344595193863,
        0.04862111806869507,
        -0.006342029664665461,
        0.035120755434036255,
        0.006962219253182411,
        -0.06144242361187935,
        0.06453022360801697,
        0.06749419122934341,
        0.024206046015024185,
        -0.09777522087097168,
        0.06158645078539848,
        -0.008657311089336872,
        -0.03277483209967613,
        -0.05405969172716141,
        0.08814072608947754,
        0.009527336806058884,
        -0.017241572961211205,
        0.01426855567842722,
        -0.0033479370176792145,
        0.0012887055054306984,
        -0.0008986604516394436,
        0.05145937204360962,
        -0.04065116122364998,
        -0.08994410932064056,
        0.017228679731488228,
        -0.0002778195485007018,
        -0.05030733719468117,
        -0.07132995128631592,
        -0.06295540928840637,
        -0.04322314262390137,
        -0.033589642494916916,
        -0.10275477916002274,
        0.014175266027450562,
        0.017853522673249245,
        -0.04124210774898529,
        0.005651555955410004,
        0.029336722567677498,
        0.018907474353909492,
        -0.12863408029079437,
        0.08601360768079758,
        -0.005502181593328714,
        -0.0021722777746617794,
        0.033852510154247284,
        -0.024545956403017044,
        0.0253311637789011,
        0.027562923729419708,
        -0.0454154871404171,
        0.046576596796512604,
        0.01267276145517826,
        -0.003412883961573243,
        -0.010329367592930794,
        -0.07331930100917816,
        0.04715096578001976,
        -0.07381229102611542,
        -0.04420597478747368,
        -0.018116889521479607,
        0.11292492598295212
    ]
}