{
    "id": "8BxVi6YiicQ",
    "title": "I Made This for Under $10. You Can Too - Handy Tech Under $100",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-03-19T16:58:55Z",
    "video_url": "https://www.youtube.com/watch?v=8BxVi6YiicQ",
    "category": "Science & Technology",
    "tags": [
        "bargain",
        "LTT",
        "Linus Tech TIps",
        "Linus",
        "Linus Sebastian",
        "Tech",
        "Budget",
        "Handy Tech",
        "Handy",
        "Under 100",
        "Under $100",
        "Gamer",
        "Gaming",
        "Computer",
        "Technology",
        "$100",
        "USB",
        "usb valve",
        "usb safety",
        "volume control",
        "air blower",
        "charge-o-matic"
    ],
    "views": 2250004,
    "likes": 82010,
    "comments_count": 2054,
    "description": "Try Rocket Money for free:  #rocketmoney #personalfinance  Check out the compact, yet powerful Nexode X 65W wall charger:  Ugreen Nexode X 65W:  Ugreen Nexode Series:    Purchases made through some store links may provide some compensation to Linus Media Group.  Handy tech is back to protect your batteries, tame Windows volume control, avoid dangerous USB ports, and cut down on the environmental impact of PC repair.  Discuss on the forum:   Buy a Charge-O-Matic:  Check out Deej on GitHub:  Buy Altoids Mints:  Buy Prusament PLA Prusa Galaxy Black 1KG:  Check out the USBvalve on GitHub:  Buy a CAGIWIRU Electronic Air Duster:   Purchases made through some store links may provide some compensation to Linus Media Group.  STL files for our Deej Enclosure are attached to the Forum Post here:     GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:34 Charge-O-Matic 2:48 Deej Volume Mixer 8:12 USBvalve 11:31 USB Air Duster 12:23 Disclosure Time 14:17 Outro",
    "description_links": [
        "https://RocketMoney.com/ltt",
        "https://bit.ly/3x5a0RS",
        "https://bit.ly/4cmbh77",
        "https://linustechtips.com/topic/1563243-everyone-needs-this-and-it%E2%80%99s-under-10-handy-tech-under-100/",
        "https://geni.us/DjqV",
        "https://lmg.gg/v8TYM",
        "https://geni.us/oOZDXC",
        "https://lmg.gg/NlhQu",
        "https://lmg.gg/8ilyf",
        "https://geni.us/m8LzrF",
        "https://linustechtips.com/topic/1563243-everyone-needs-this-and-it%E2%80%99s-under-10-handy-tech-under-100/",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "The beard is gone, which means nothing can slow me down as I dive head first into this rapid fire roundup. Wanna keep your devices' batteries fresh for longer? Is that USB device hacking you? Ooh, you can control app volume without digging into the software menus. How cool is that? We're gonna build one for ourselves for less than 10 bucks. Oh, and we're gonna clean up after ourselves when we're done with a bottomless can of air. It's time again for Handy Tech Under 100. Let's go! Back here, which is where we're doing it. You may already know that leaving your portable electronics plugged in all the time can be really hard on the batteries, causing them to die, bulge, or even light on fire. But the issue is that it's getting harder and harder to find a phone or a laptop that you can pull the batteries out of in order to protect them when they're being stored or when they're being used in a permanent fixture. Now, some devices have smart charging or other battery saving features, but many of them don't. And that is where the $30 Charge-O-Matic comes in. Now, the inventor suggests using it to protect battery powered tools, to prolong the life of USB charged devices, and to top up generator batteries, which gave us some ideas of our own, like keeping our emergency battery banks ready to go at a moment's notice, or my personal favorite, plugging into a power bar to help protect the hundreds of battery powered devices that sit in our warehouse, slowly dying. Now, unfortunately, wow, that is really tight. Hey, there we go. Now, unfortunately, in spite of the claims, it's not especially smart, meaning it's essentially a Christmas light timer with extra steps, but the Chargomatic lets you choose how long the power stays on, anywhere from one. To 99 hours. That's this guy right here. Then this one controls how long it stays off, anywhere from one to 99 days. So if your manual calls for trickle charging once a month for no longer than 48 hours, something no one is actually gonna bother to do manually, you just dial it into the Charg-O-Matic and you never have to think about it again. And in all that time we save by not dealing with dead batteries, we can segue to our sponsor. Ugreen. Their Nexode X65 wall charger is small, light, and powerful with two USB-C ports and one USB-A port so you can charge up to three devices at the same time with a maximum output of, you guessed it, 65 watts. Check it out at the link down below. Okay, okay, guys, I'm coming, I'm coming. Oh crap, that game is loud. Now I can't hear you guys. You know, someone should make a volume knob for... Oh, perfect. Meet the Deej, an open source hardware volume control for Windows and Linux PCs. With this minty little guy, I have independent control over my PC's master volume, voice chat, and my games. And it is super simple to build your own. Ooh, that doesn't smell minty at all. To build our own, all we need is an Arduino or similar microcontroller, one or more potentiometers, pots for short, some wires, and some kind of enclosure. It doesn't even need to be anything fancy. It just has to be big enough to hold the electronics, but small enough to fit on your desk. This Altoids tin is a great choice for these rotary pots and an RP2040-based board. While this shipping box that we stole from Colton has plenty of room for sliding pots and an Arduino Pro Micro. Now, before you even ask, no, you do not need to know how to solder to make one of these if you pick your parts carefully. Look at this. We're using a small breadboard, some male-to-female jumper wires, and a Pro Micro that came with the header pins pre-attached. Anyone can do this. Now, for our part, we've got a Justin and a small army of 3D printers to try and keep busy, so we got a little fancy and we whipped up this slick enclosure, which we're gonna have the files for in the description, along with a link to the Deej project where they go into way more detail about building your own. We're still gonna give you the quickish version here, though. Hardware-wise, it is surprisingly simple. Each of our potentiometers gets wired up to common ground and to a power pin, and then that third connector, the wiper, is gonna be doing the bulk of our heavy lifting. Now, you might remember that a potentiometer is effectively a user-adjustable resistor, and the position of the wiper determines the resistance. So then each of our wipers gets connected to an individual analog input on the controller, and once everything's wired up, we can close up our enclosure with the new LTT precision screwdriver and put on our knobs. By the way, sign up on lttstore.com for an in-stock notification. We are very excited about this thing. It's also a delightful fidget toy. Speaking of, so far, that's all this does too. We need to program the controller in order for it to do something useful. Thankfully, the Deej Project has done almost all of the work for us, including providing a pre-written Arduino sketch file. With that said, it's not quite plug and play, and we're gonna need to tweak it depending on how many pots we're using, and which pins those pots are connected to. So in this case, we've got five pots using pins A0 through A3 and pin A7. Compile that, upload it to the controller, taking a second to note which COM port the controller is using, and now, if you open up the serial monitor in the Arduino IDE, you should see a stream of numbers flowing constantly, and if you move a slider, the corresponding number should change. Using any text editor at this point, even good old-fashioned notepad, open up config.yaml. The first thing to do is change the com port down here to match what our controller is using. Then we get to decide what each one of our pots is going to control. Looking at this slider underscore mapping section, each section can specify a single program, a list of programs, a device name, or one of a few keywords that have special functions. It's documented pretty clearly in the comments at the top of the file. If you want to experiment. Media players, browsers, communications, games. Obviously guys, I can't sit here for the next 12 hours with my camera crew watching me type in every game I've ever heard of. But thankfully, Deej has us covered, again. Keyword Deej.unmapped tells this slider right here to control all apps that aren't mapped to a different slider. Then we wrap things up with another keyword master on the last slider giving us an overall volume control. Now we did find that the master keyword didn't work as expected on all setups on a system with a pair of SteelSeries Arctis Nova Pro headphones, for example, master ended up adjusting the volume of system sounds rather than the main output which we think is because those headphones have their own external volume control and just have no interest in their Windows volume setting being anything but 100%. But aside from that little snag, this is flipping amazing. No more getting your ears blasted off when you fire up a new game for the first time or missing what your buddies are saying in Discord because some jackass website is blasting an ad for skin cream that... Oh, de-ages and moisturizes? Sorry, sorry. Anyway, the Altoids Tin version is 10 bucks and even our fancier one is still well under 20. And if you wanna get even fancier, there are forks of the Deej code base that add support for screens and buttons with this awesome gallery that shows Deej builds that are done by folks around the world to give you some inspiration. We're gonna have all of that linked in the video description. What's next? Ooh, this is cool. Are you on the go enough that you find yourself plugging your devices into random USB ports to charge? Do you feel a little sketched out when you do so? Well, the USB valve is for you. Think of it kind of like a pocket STD test for USB ports that you can perform before you plug in something that you care about. It shows up to Windows as just a normal Kingston Data Traveler USB storage device, but in reality, what it is... is a monitoring device that outputs everything that's happening over that USB port on this teeny-tiny little screen. If the line starts with a plus, that means it is expected. So if the port is just providing power, all we should see is the self-test line. If the port is connected to a harmless Windows PC, though, you'll see the PC read, there it is, the autorun file. But if a line starts with an exclamation point, that means something has happened that... isn't expected. So, uh, whoa! In this case, it says the PC has read the readme file. Now, it is possible that something like that could be caused by an antivirus that's automatically scanning USB devices when they're plugged in. But it's also possible that something else running on that PC is reading the file. What would be even more concerning though, would be if whatever we've plugged into tries to write to my device. Again, you'll get the exclamation point and the line will just say writing. Don't worry about it damaging the USB valve though. It's only pretending to be a USB drive and it will be reset at the end of your session, ready for the next. And it gets even better. If you build the DIY version with USB pass-through, it can also monitor untrusted USB peripherals. So watch this. I'm gonna plug in a seemingly harmless USB drive and BOOM! The USB valve immediately recognizes it's behaving as an HID device and is sending data to my computer. Turns out, the USB valve caught a rubber ducky, which the pen testing nerds out there are gonna know acts like an automatic keyboard typing in pre-programmed scripts that will do literally anything the attacker wants on the host machine. If we want to learn exactly what the rubber ducky is trying to do, the USB valve can even set itself up on a COM port, so that you can connect into that port and see exactly what's being typed on the virtual keyboard. Get hacked, hackers! To build your own, all you need is about 10 bucks worth of microcontroller and screen, and then if you've got another 10 bucks burning a hole in your pocket, you can get a custom PCB printed up for it like this one, or you can just use a generic breadboard. Ooh, one other option if you don't feel like doing any of that. Is you can take advantage of their recently added support for the Pi Pico watch platform. Just load on the software and you're good to go. You'll find more information on their GitHub or if you like this form factor but don't wanna build it yourself, the inventor is looking into creating a dedicated board. So reach out and let them know that you're interested. We love seeing community support for grassroots tool creators like this. Now we should have called this handy tech under 50 bucks. Everything has been so affordable and freaking awesome. As for the next thing. It honestly kind of blows, get it? Cause it blows air. These USB rechargeable air dusters are nothing new. In fact, Luke and I saw something similar in that all AliExpress cleaning product video. Hilarious by the way, check it out. But this one really deserves to be in handy tech. For less than 50 bucks, you get a three speed USB rechargeable handheld blower, a bunch of alternate tips to help direct air flow. In the way that is best for you and a handy carrying bag. This is really gonna help us clean up the mess that we've made today. And, whoo, there's even a light on it. And this one-time investment of 40 bucks could save you from wasting hundreds of dollars on canned air or if you're a business, even thousands of dollars, which leaves us just with disclosure time. Because our handy tech videos are more of a, you should buy this or you should build this, we like to give a little bit of extra disclosure about why we picked a product or project. The Chargomatic was sent to us by the inventor for possible review. We liked it, not only are we covering it in our video, but we're gonna actually buy a few of them as a way to keep the countless batteries in our warehouse healthy. Jordan stumbled across the Deej product and had actually already bought all of the parts he needed when he pitched it in our weekly writers meeting. So the only difference is that we built a better one for him instead of him actually using what he had planned to use. The USB valve showed up on Hackaday and we thought it was worth checking out. So we reached out to the creator who sent over a couple of assembled examples and custom PCBs to show you guys. And finally, the USB blower was first bought for that cleaning supplies video, and we have since bought a bunch more of them for our own use. Just about every set and work area has one of these close at hand because we absolutely love these things. And with that, it's time to hand things over to our sponsor. Rocket Money. You and I both know that you're not using every streaming service that you're subscribed to, and yet your bank account is still being drained every month. And in this economy, that really adds up. Well, RocketMoney wants to help by making it simple to cancel unwanted subscriptions. No need to go digging around in a bank statement to solve the mystery of who, what, and where your money is going. One click, and just like that, you can cancel all of those services that are bogging down your finances, which means more money for your next rig upgrade. On top of that, they can also assist with negotiating any bills that you may be overpaying. And it's easy to set up a smart saving system where they deposit a set amount of money into your account as often as you'd like. So start saving by downloading the app for free at rocketmoney.com slash LTT, or by clicking the link down below. If you guys enjoyed this video, there's a whole playlist full of handy tech, and we're going to link the latest one down below.",
    "transcript_keywords": [
        "USB",
        "USB valve",
        "USB ports",
        "rapid fire roundup",
        "Deej",
        "port",
        "volume",
        "USB device hacking",
        "Handy Tech",
        "dive head",
        "time",
        "control",
        "device",
        "devices",
        "build",
        "USB device",
        "pots",
        "volume control",
        "USB port",
        "batteries"
    ],
    "transcript_entity_values": [
        "the Deej Project",
        "PCB",
        "no longer than 48 hours",
        "one",
        "hundreds of dollars",
        "second",
        "thousands of dollars",
        "Windows",
        "Altoids",
        "first",
        "100",
        "one to 99 days",
        "STD",
        "One",
        "65 watts",
        "Charg",
        "USB-C",
        "Discord",
        "up to three",
        "Kingston Data Traveler",
        "30",
        "Chargomatic",
        "Christmas",
        "40 bucks",
        "Deej",
        "Pro Micro",
        "To 99 hours",
        "AliExpress",
        "SteelSeries Arctis Nova Pro",
        "Arduino",
        "today",
        "five",
        "Hackaday",
        "Justin",
        "less than 50 bucks",
        "Colton",
        "100%",
        "weekly",
        "10 bucks",
        "less than 10 bucks",
        "Arduino Pro Micro",
        "LTT",
        "A7",
        "A0",
        "A3",
        "three",
        "the next 12 hours",
        "Luke",
        "Altoids Tin",
        "50 bucks",
        "USB",
        "third",
        "Linux",
        "GitHub",
        "Handy Tech",
        "two",
        "DIY",
        "Rocket Money",
        "Jordan",
        "hundreds",
        "Windows"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "NORP",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "MONEY",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "GPE",
        "PERCENT",
        "DATE",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "ORDINAL",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.14004862308502197,
        0.08034634590148926,
        -0.005632493644952774,
        -0.03639499470591545,
        0.09251993149518967,
        -0.013627496547996998,
        0.028229571878910065,
        0.06951182335615158,
        -0.05006972327828407,
        0.030698994174599648,
        0.04575470834970474,
        -0.027102436870336533,
        0.0300570297986269,
        0.042251214385032654,
        -0.0007020863122306764,
        -0.008951020427048206,
        0.004943316802382469,
        -0.0035613365471363068,
        -0.021668054163455963,
        0.03220352157950401,
        -0.016065040603280067,
        0.04549408331513405,
        0.00792375672608614,
        -0.0884711816906929,
        -0.006139167584478855,
        -0.03588976711034775,
        0.03954235464334488,
        -0.10104086995124817,
        -0.014532574452459812,
        -0.12729795277118683,
        0.013951234519481659,
        -0.0018146007787436247,
        -0.053495053201913834,
        -0.01462508738040924,
        0.08773312717676163,
        -0.07004694640636444,
        0.03342614322900772,
        0.014710279181599617,
        -0.056674908846616745,
        -0.06202458217740059,
        0.012760809622704983,
        0.002020159037783742,
        -0.028117811307311058,
        -0.01385805755853653,
        -0.049169495701789856,
        -0.03252881392836571,
        0.050624120980501175,
        -0.01099592074751854,
        0.0918654054403305,
        0.017872843891382217,
        0.04841088131070137,
        -0.047842252999544144,
        0.026710283011198044,
        0.05282213166356087,
        -0.04468566179275513,
        -0.006263240706175566,
        3.0256474929046817e-05,
        -0.023760702461004257,
        -0.005000864155590534,
        -0.15948200225830078,
        -0.01641794480383396,
        -0.04987878352403641,
        -0.013403485529124737,
        0.006150378845632076,
        -0.07354597002267838,
        -0.00943381804972887,
        0.002623911015689373,
        0.08593161404132843,
        -0.03837193176150322,
        0.030090101063251495,
        -0.018774274736642838,
        -0.020764458924531937,
        -0.020991956815123558,
        0.0514855682849884,
        -0.00859104748815298,
        0.06088506057858467,
        0.072762630879879,
        -0.020033858716487885,
        -0.00065221096156165,
        0.02940310537815094,
        0.013724797405302525,
        0.0446021668612957,
        -0.08816024661064148,
        -0.003083088668063283,
        0.07240978628396988,
        0.002643422456458211,
        0.025450963526964188,
        0.057335853576660156,
        -0.002959983889013529,
        -0.10038533061742783,
        0.02492738701403141,
        0.09977582097053528,
        0.027760425582528114,
        -0.0691881999373436,
        -0.02285313606262207,
        0.012531023472547531,
        0.007622644770890474,
        -0.03702904284000397,
        -0.027864642441272736,
        0.048107344657182693,
        0.052663080394268036,
        0.023422330617904663,
        -0.00021089540678076446,
        -0.11267800629138947,
        -0.04957430437207222,
        -0.07586497813463211,
        -0.03260335698723793,
        0.003150621894747019,
        0.029361402615904808,
        -0.020948801189661026,
        -0.05667079985141754,
        0.020582495257258415,
        -0.1256624311208725,
        -0.01785924844443798,
        0.05465259030461311,
        -0.00996297225356102,
        -0.021487325429916382,
        -0.011933395639061928,
        0.03632389008998871,
        -0.09471447020769119,
        0.060761433094739914,
        -0.03752497211098671,
        -0.000224306175368838,
        -0.04409213364124298,
        0.05168764665722847,
        0.015280601568520069,
        -0.03187175467610359,
        8.646894567662499e-33,
        -0.0036809705197811127,
        0.06472233682870865,
        -0.07646849751472473,
        -0.031333450227975845,
        0.00927959568798542,
        0.014370505698025227,
        0.06281380355358124,
        0.08642785996198654,
        0.023058604449033737,
        0.03611476346850395,
        -0.0427187941968441,
        0.052353061735630035,
        -0.09166350960731506,
        -0.0007866734522394836,
        0.008262149058282375,
        -0.05123136565089226,
        0.013180526904761791,
        -0.0031064616050571203,
        0.02536146156489849,
        -0.008127080276608467,
        -0.09965614229440689,
        0.0014205706538632512,
        0.023507414385676384,
        0.031130705028772354,
        0.08257098495960236,
        -0.01057630218565464,
        0.07546580582857132,
        -0.04354047030210495,
        0.09118419140577316,
        0.009719249792397022,
        -0.05891944095492363,
        -0.002534785307943821,
        0.08199315518140793,
        0.04084958881139755,
        -0.06920664757490158,
        0.035952795296907425,
        -0.12918724119663239,
        -0.06932290643453598,
        0.06353425979614258,
        -0.04692569375038147,
        -0.04700639843940735,
        0.07062103599309921,
        -0.03257233276963234,
        -0.046089980751276016,
        0.012322415597736835,
        -0.06013820692896843,
        0.03790658712387085,
        -0.01970447041094303,
        0.03188047185540199,
        -0.01869290880858898,
        -0.053361572325229645,
        -0.03154001384973526,
        -0.05295560136437416,
        0.013233983889222145,
        -0.0062964968383312225,
        -0.035939253866672516,
        -0.012826026417315006,
        -0.010618604719638824,
        0.06433607637882233,
        0.01777579076588154,
        0.014569851569831371,
        -0.009642858058214188,
        0.03780680522322655,
        -0.05019339174032211,
        -0.07182034105062485,
        0.009599857032299042,
        -0.041475847363471985,
        0.03631125018000603,
        -0.07889742404222488,
        -0.02760864794254303,
        -0.026209911331534386,
        0.002893970115110278,
        -0.007122552953660488,
        -0.07412894070148468,
        -0.006344321183860302,
        0.06689437478780746,
        -0.008030278608202934,
        -0.041469838470220566,
        -0.01054497342556715,
        -0.08244195580482483,
        -0.0713220089673996,
        -0.04071030765771866,
        0.016983123496174812,
        0.036798425018787384,
        0.004327428061515093,
        -0.0323055125772953,
        -0.009210793301463127,
        0.035352107137441635,
        -0.013492531143128872,
        -0.07923310995101929,
        0.031024210155010223,
        -0.009914037771522999,
        -0.03132394328713417,
        -0.025115281343460083,
        -0.03382245451211929,
        -8.450131507014233e-33,
        0.04032502323389053,
        -0.05926642194390297,
        0.04593254253268242,
        0.005509679671376944,
        0.06414301693439484,
        0.014056569896638393,
        0.0012775117065757513,
        0.03292148932814598,
        0.020272010937333107,
        -0.032204195857048035,
        -0.12233315408229828,
        0.08062570542097092,
        0.024019431322813034,
        -0.002276940969750285,
        0.1136901006102562,
        0.0035040718503296375,
        -0.0272970050573349,
        -0.005668024066835642,
        0.043648332357406616,
        -0.040144167840480804,
        0.05464234575629234,
        0.09379079192876816,
        0.06274352967739105,
        0.05705481022596359,
        0.0009749325108714402,
        0.015359653159976006,
        -0.01011145394295454,
        -0.03388755023479462,
        0.04676881805062294,
        0.09825373440980911,
        -0.028849361464381218,
        -0.03476787358522415,
        0.017146293073892593,
        0.048507995903491974,
        0.07803452759981155,
        -0.05868230387568474,
        0.15210983157157898,
        0.035483233630657196,
        -0.0074004363268613815,
        -0.07769153267145157,
        -0.004711409565061331,
        0.05464364215731621,
        0.04814771190285683,
        0.00881047174334526,
        -0.005259939003735781,
        -0.07414347678422928,
        -0.10703824460506439,
        -0.03487643599510193,
        0.013243135996162891,
        0.11421845853328705,
        -0.02081742323935032,
        -0.07471805810928345,
        0.022851409390568733,
        0.06326130032539368,
        -0.03832414001226425,
        -0.018630482256412506,
        0.06245945766568184,
        0.04602428898215294,
        -0.011346773244440556,
        -0.04833250120282173,
        -0.007151368539780378,
        -0.016195470467209816,
        -0.0478329211473465,
        -0.013969121500849724,
        -0.07841663062572479,
        -0.011844862252473831,
        0.11093425005674362,
        0.05153428763151169,
        -0.05098366737365723,
        0.0479855053126812,
        0.015125988982617855,
        0.04114796593785286,
        -0.006213011685758829,
        -0.06691361963748932,
        -0.03085208125412464,
        0.03787827864289284,
        0.04292093962430954,
        -0.0550469271838665,
        0.054784342646598816,
        -0.030353497713804245,
        -0.022714726626873016,
        0.022018343210220337,
        0.0036827833391726017,
        -0.08178393542766571,
        0.008484690450131893,
        -0.018940305337309837,
        0.04654882475733757,
        0.052084457129240036,
        0.025143424049019814,
        0.012388259172439575,
        -0.09890779852867126,
        -0.009443337097764015,
        0.033092986792325974,
        0.09395945817232132,
        -0.004890821874141693,
        -6.152938425429966e-08,
        -0.04481196030974388,
        0.05490517616271973,
        -0.000706141407135874,
        0.05360869690775871,
        -0.02694101445376873,
        -0.10442488640546799,
        -0.026324497535824776,
        0.01694599539041519,
        0.08800844103097916,
        -0.01534802746027708,
        0.06933791935443878,
        -0.06050695851445198,
        0.01477011013776064,
        -0.044880785048007965,
        -0.037653855979442596,
        0.06355661898851395,
        -0.048799775540828705,
        0.10319576412439346,
        -0.005003578495234251,
        -0.012424711138010025,
        0.00553888501599431,
        0.06094701588153839,
        0.029880467802286148,
        0.03248791769146919,
        0.05045325309038162,
        0.02458612434566021,
        -0.040578700602054596,
        0.024285579100251198,
        0.12591545283794403,
        -0.08566135913133621,
        -0.10382281988859177,
        0.010908721946179867,
        0.0671597421169281,
        -0.013470413163304329,
        0.07328324764966965,
        -0.05473322421312332,
        -0.058984704315662384,
        -0.018156271427869797,
        0.07835083454847336,
        0.04479299858212471,
        0.03932264819741249,
        -0.07018095999956131,
        -0.05247047170996666,
        -0.023134134709835052,
        0.02195199765264988,
        -0.04676472768187523,
        -0.02526802383363247,
        -0.05952880159020424,
        -0.05602359399199486,
        0.09107772260904312,
        -0.021968943998217583,
        -0.012717841193079948,
        -0.004582966677844524,
        -0.01753515936434269,
        -0.04371456429362297,
        0.04802609980106354,
        -0.08132029324769974,
        0.08452761173248291,
        0.06628262996673584,
        0.01777026429772377,
        0.035310082137584686,
        -0.061904534697532654,
        -0.034735094755887985,
        0.10612954199314117
    ]
}