{
    "id": "8e1a_8N9rgY",
    "title": "Smartphone Durability Awards 2022!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-12-31T15:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=8e1a_8N9rgY",
    "category": "Howto & Style",
    "tags": [
        "smartphone durability awards",
        "smartphone awards",
        "best phones",
        "2022",
        "best smartphones 2022",
        "most durable smartphone",
        "most repairable smartphone",
        "technology",
        "mobile phone",
        "smartphone",
        "iphone",
        "android"
    ],
    "views": 972606,
    "likes": 67121,
    "comments_count": 97846,
    "description": "The most Durable (and Repairable) smartphones of 2022! Grab your 'Think Dongle' shirt here:  To enter the phone giveaway - just leave a comment on this video. I will pick 1 random winner for each phone within the week. YouTube is not a sponsor of this contest. Lets take a look at the 2022 Smartphone Durability Award winners. Spoilers below:   My Teardown Grip Case from dbrand:   Most repairable smartphone of 2022 Pixel 7 Pro:  Least repairable smartphone of 2022 Z Flip 4:  Most innovative Smartphone Nothing Phone (1):  Best looking smartphone on the inside Pixel 7 Pro:  Least durable smartphone ROG 6 Pro:  Most Delusive Smartphone: Not this year. Most durable smartphone AMG H5:   2021 Smartphone Durability Awards:  2020 Smartphone Durability Awards:  2019 Smartphone Durability Awards:  2018 Smartphone Durability Awards:  2017 Smartphone Durability Awards:  2016 Smartphone Durability Awards:",
    "description_links": [
        "https://www.jerryrigknife.com/",
        "https://www.dbrand.com/teardown",
        "https://youtu.be/DRQ5wzCDK84",
        "https://youtu.be/LwQZDDMeLRw",
        "https://youtu.be/Ro971vwsgPg",
        "https://youtu.be/rnPPygtQH-w",
        "https://youtu.be/vnxt0jP10io",
        "https://youtu.be/EhGCurD9P0w",
        "https://youtu.be/If0ISjRjcBo",
        "https://youtu.be/8XuexCeeaqg",
        "https://youtu.be/YqxrcEiFJtI",
        "https://youtu.be/QkuAvC3zHEc",
        "https://youtu.be/Uvh3v1BkJ-A",
        "https://youtu.be/0oChYfB96lo"
    ],
    "transcript": "[Intro] We have reached the end of 2022, and it's been a pretty big year. We've accomplished quite a bit. The electric Hummer is officially rolling on its own power. The Whisper Project is far from over by the way. It's still definitely a work in progress and we have a long way to go before it's done. Our off-road wheelchair project kind of took priority this year. We got some new machines installed at the shop to help make off-road wheelchairs cheaper and better for those who need them. And the coolest machines we have I haven't even shown you yet. We got a sweet tour of Ford's new Lightning facility where they make the new electric Ford F-150s. And we also got to see a light bulb recycling facility where they can reclaim mercury found inside fluorescent bulbs. And another facility showed us how glass bottles are turned into insulation for residential homes. Absolutely fascinating process. One of the coolest things though, that has probably ever happened to me was seeing everyone come together to collect 34,000 books to stock the library we're building in Africa. The books should be arriving in Kenya very soon and I'll have an update for you as soon as that happens. And all of that is made possible of course because you come here to watch my videos, so thank you. And speaking of watching my videos, the phones this year were pretty decent. We had three phones break in 2021, and we had another three phones break here in 2022. And it's time to give out those durability awards. There were a few phones that I didn't get around to testing this year though - lucky for these phones. But also, lucky for you. I'm giving these away to some subscribers down in the comments of this video. Up here at the top we have the 2022 Motorola Razr, the folding one that I didn't get around to. We have a Nothing Phone, and iPhone 14 Pro Max....yup. I didn't get around to testing this one because the iPhone 14 Pro I felt like was the better phone. Either way, sealed in the box untested. We have some TCL's, some Vivos, and even this guy, Realme phone's down here. This guy's called the Unihertz Tank with a 22,000 milliamp hour battery. I wish we'd had time to take this one apart. It has a standby of 100 days. Either way it is not my phone anymore. It is now going to be one of your phones because I'm picking some random people in the comments to DM and hand these off. So make sure you are subscribed and make sure you do leave a comment down there so I can find you. And make sure that you're very vigilant there are still scams happening on YouTube. So if it doesn't have my name and a checkmark next to the username, it's not me and don't respond. Now let's begin. Let's start with the most repairable smartphone of 2022 from a screen repair perspective. And that award goes to the Pixel 7 Pro. With zero screws needed for the screen replacement, the whole thing can be done with a hot plate and a pry tool in about 60 seconds, and genuine replacement parts are easy to find across the internet, like over on ifixit.com. And as a runner up, and this might be rather surprising, but actually Apple has stepped up their repair game quite a bit with the iPhone 14- not the iPhone 14 Pro just the regular iPhone 14, which now has a removable back glass and removable display. Apple's still being weird with the whole locking the whole locking the parts to the device thing, but as far as the physical repairability of the iPhone 14, it does win an honorary runner up. I do like the direction Apple is headed, but that doesn't mean we have to stop making fun of them. Now for the least repairable smartphone of 2022. You might be thinking to yourself that it's probably going to be one of the Folding Phones, like the Galaxy Fold 4. Or maybe even the Galaxy Flip 4. But as a matter of fact, I was able to completely disassemble the Flip 4 and put it all back together including the super soft Mohs 3 plastic screen in the center. So repairing it is possible. However, you are still correct because replacement parts are extremely difficult to find non-existent. Samsung can repair it for you, $500 without insurance or $29 with insurance, but there is absolutely no fixing your phone on your own unless you harvest parts from a broken unit. So the folding phones, the Fold 4 and the Flip 4, do win the least repairable smartphone of 2022. But to be fair, it is a novelty device and people who are buying this smartphone do understand the risks at least if they, you know, watch my videos they do. Now for the most innovative smartphone of 2022, and that has to go to the Nothing Phone. This guy right here with 972 LEDs on the back. We did count each and every one of them. And those 972 LEDs do produce some exquisite illuminations on the back so it's definitely the most innovative smartphone of 2022. And while the internals might not be super unique or interesting, it would be pretty safe to say that nothing about any of these phones have really changed a lot in the last three years. In my opinion, innovation has been slightly lacking, so at least aesthetically we see something extremely new and extremely unique with the Nothing Phone. Which brings us to the best looking phone on the inside with, you know, the Nothing Phone does look pretty good with a semi-transparent back glass, but it's not necessarily showing off the internals. We do have the Xiaomi 12S with its massive 1 inch sensor which looked pretty cool from the inside. But if I had to pick just one, it would probably come back to the Pixel 7 Pro, with its pretty sweet looking wireless copper coils in the back and even the camera module is visible up here inside of the hump. The Pixel lineup is pretty much always coming out looking pretty fresh on the inside. Now let's go to the least durable smartphone of 2022, and that one was kind of hard to pick. I mean we do have the OnePlus Phones, the OnePlus 10 Pro which snapped in half. And then we have the OnePlus 10T, which also snapped in half in the exact same spot. But we also have another phone that broke easier, even easier than the new iPad, and that was the ROG Phone 6 Pro. And it snapped in half incredibly easily. The only thing that hurt worse than the sound of this snapping in half, was the sound of the price tag. At least the OnePlus Phones did provide some resistance. I can't say the same for the ROG Phone 6 Pro, so that is the phone that wins the least durable smartphone award of 2022. Now for the most durable smartphone, and that has to go, since we didn't review any sapphire Kyocera phones this year, that has to go to the AGM H5. It's actually one of the cheapest phones on the table. At $300 this rugged monster is also the world's loudest smartphone, with an IP68 waterproof rating and built in rubber bumpers around the outside that can withstand two meter drops onto concrete. This guy goes to show that durable phones don't have to be expensive. Which also means that any of these smartphones on the table could also be the most durable phone if they had a case. Personally, I always have a case on my phone. It's practical and saves money in the long run. My personal phone, the Note 10 Plus, probably would not have lasted its 3 years without one. You can buy whatever you want, of course, but the case that I have on my phone is the grip case from dbrand. After 3 years of very hefty abuse, it's got some paint on the bottom, the Teardown Skin is a bit scratched up, and there is some separation near the bottom where I always pull it out of my pocket. But, I mean, for 3 years it's held up very well and I use my phone far more than the average person. The price of this case factored out over, like, 3 years is 3 cents a day. Protection is always cheaper than the alternative. And you can quote me on that. Also, if your current phone is less than 3 years old, you're not missing much with these newcomers. I don't plan on upgrading my phone any time soon since my phone can still hold its own against anything else on this table. However, for people who are looking to upgrade, our work here is still very important since repairability and durability are two factors to consider when upgrading your smartphone. So our work here at JerryRigEverything continues. Hit that subscribe button. I do have some phones I need to get rid of down there in the comments. Come hang out with me on Instagram. And remember that everything we accomplish here on my channel, like building the library in Africa, and making inexpensive off-road wheelchairs for people happens because of you coming back here to watch my videos. So I know I say it a lot, but thank you. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "Phone",
        "phones",
        "Pro",
        "smartphone",
        "ROG Phone",
        "Folding Phones",
        "back",
        "pretty",
        "OnePlus Phones",
        "years",
        "phones break",
        "pretty big year",
        "iPhone",
        "reached the end",
        "year",
        "durable smartphone",
        "repairable smartphone",
        "make",
        "Realme phone",
        "durable"
    ],
    "transcript_entity_values": [
        "2022",
        "22,000 milliamp hour",
        "Kenya",
        "the Nothing Phone",
        "iPhone",
        "two meter",
        "OnePlus 10",
        "Hummer",
        "about 60 seconds",
        "the Note 10 Plus",
        "Instagram",
        "two",
        "three",
        "Africa",
        "1 inch",
        "100 days",
        "half",
        "972",
        "TCL",
        "zero",
        "iPad",
        "this year",
        "YouTube",
        "Apple",
        "29",
        "OnePlus 10 Pro",
        "the Nothing Phone",
        "Kyocera",
        "less than 3 years old",
        "3 years",
        "the Folding Phones",
        "3 cents",
        "the Unihertz Tank",
        "Ford",
        "500",
        "34,000",
        "a Nothing Phone",
        "Samsung",
        "the OnePlus Phones",
        "DM",
        "2022",
        "3",
        "One",
        "The Whisper Project",
        "the Galaxy Fold 4",
        "the last three years",
        "2021",
        "the Teardown Skin",
        "14",
        "AGM",
        "Realme",
        "the Pixel 7 Pro",
        "300"
    ],
    "transcript_entity_types": [
        "DATE",
        "QUANTITY",
        "GPE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "FAC",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY"
    ],
    "vector": [
        -0.16030530631542206,
        0.03001563437283039,
        0.15147697925567627,
        -0.025338612496852875,
        0.04232441261410713,
        -0.03177984431385994,
        0.025216201320290565,
        0.06438242644071579,
        -0.09825477749109268,
        0.022279424592852592,
        0.005560876335948706,
        0.016779586672782898,
        0.041063033044338226,
        0.021316928789019585,
        -0.013139799237251282,
        -0.003912378568202257,
        0.03162740170955658,
        -0.11017636954784393,
        -0.01246687863022089,
        0.02097906544804573,
        0.015772731974720955,
        0.031297679990530014,
        0.01523665152490139,
        0.009222147054970264,
        0.02101084031164646,
        0.01564149744808674,
        -0.05612320825457573,
        0.018430490046739578,
        -0.03846642002463341,
        -0.06382578611373901,
        -0.001978805521503091,
        0.13485200703144073,
        -0.04513225331902504,
        0.031497545540332794,
        -0.022058073431253433,
        -0.053308941423892975,
        0.007146069314330816,
        -0.025773508474230766,
        -0.03437713906168938,
        -0.05226200819015503,
        -0.039681050926446915,
        -0.1327955573797226,
        0.0149177061393857,
        -0.0191652812063694,
        0.06401609629392624,
        -0.06305117905139923,
        0.06196604669094086,
        -0.06546972692012787,
        0.007110539358109236,
        -0.008644758723676205,
        0.02262340672314167,
        -0.030331261456012726,
        0.08381775766611099,
        0.001516453456133604,
        -0.05352971330285072,
        0.04506818577647209,
        -0.016039539128541946,
        0.014818031340837479,
        0.05960766226053238,
        -0.014651544392108917,
        0.0518653430044651,
        -0.03210319206118584,
        -0.020564254373311996,
        0.04740849882364273,
        0.03536532074213028,
        -0.0011213863035663962,
        0.013236851431429386,
        -0.06971970200538635,
        -0.0027149792294949293,
        0.11911375820636749,
        0.010928908362984657,
        -0.04572327435016632,
        -0.028909064829349518,
        -0.029871618375182152,
        0.0517180897295475,
        0.10226511210203171,
        0.012422044761478901,
        -0.00643374165520072,
        -0.05854756385087967,
        -0.010691951029002666,
        0.03893613442778587,
        -0.12516525387763977,
        -0.008004091680049896,
        -0.004113091621547937,
        0.03211653605103493,
        -0.03910902887582779,
        0.012370629236102104,
        0.03650955483317375,
        -0.04105845093727112,
        -0.08882324397563934,
        -0.05608123168349266,
        0.15841741859912872,
        -0.0013684009900316596,
        0.04054649546742439,
        -0.038599465042352676,
        0.01010939758270979,
        -0.03501570597290993,
        -0.0519496388733387,
        -0.04187968000769615,
        0.04482884705066681,
        0.004661078564822674,
        0.07590815424919128,
        0.018290197476744652,
        -0.021631522104144096,
        0.018723661080002785,
        -0.057982709258794785,
        -0.04524560272693634,
        -0.03288394585251808,
        -0.016107290983200073,
        0.013097608461976051,
        -0.019505809992551804,
        0.015941109508275986,
        -0.009324559010565281,
        0.03292791172862053,
        -0.03668840602040291,
        -0.012130936607718468,
        -0.08441708236932755,
        0.09032003581523895,
        0.1388273686170578,
        0.006790934596210718,
        0.018471717834472656,
        0.023401370272040367,
        -0.04203563183546066,
        -0.11648708581924438,
        0.03589458391070366,
        0.00028257464873604476,
        -0.018422696739435196,
        8.98316823660223e-33,
        -0.00461084907874465,
        0.05308718606829643,
        0.010425236076116562,
        0.03858477622270584,
        -0.05896753445267677,
        0.019800513982772827,
        -0.016443416476249695,
        0.05687614157795906,
        -0.03872258588671684,
        -0.01768800988793373,
        -0.009415967389941216,
        0.020002784207463264,
        -0.06645176559686661,
        0.027260499075055122,
        0.10550294071435928,
        -0.04491288959980011,
        -0.02004815824329853,
        -0.06391293555498123,
        -0.08287587761878967,
        -0.012394722551107407,
        -0.006999226287007332,
        -0.0328630730509758,
        0.005604206118732691,
        0.01312966551631689,
        0.07043203711509705,
        0.03532756119966507,
        0.11898179352283478,
        -0.0499248281121254,
        0.05565875023603439,
        0.02174256183207035,
        -0.01784845069050789,
        0.021225664764642715,
        0.012065442278981209,
        -0.008119739592075348,
        -0.080245241522789,
        0.03016730770468712,
        -0.06243272125720978,
        -0.04998139292001724,
        0.013116594403982162,
        -0.02342343144118786,
        -0.06397714465856552,
        -0.002824707655236125,
        -0.0647832378745079,
        -0.025938624516129494,
        0.06393758952617645,
        -0.015769073739647865,
        0.04256773367524147,
        0.00561140850186348,
        -0.0030838237144052982,
        -0.0010914700105786324,
        -0.046162474900484085,
        -0.0384519137442112,
        -0.047732122242450714,
        -0.029946861788630486,
        -0.050090037286281586,
        -0.05409896373748779,
        0.005440478213131428,
        -0.06121126562356949,
        0.02755894511938095,
        0.061209987848997116,
        0.014319040812551975,
        0.021078364923596382,
        -0.05148749053478241,
        -0.04701819643378258,
        -0.024827146902680397,
        0.07597135007381439,
        0.045016054064035416,
        -0.002302938373759389,
        -0.06288380175828934,
        0.061198391020298004,
        0.05019321292638779,
        -0.04099270701408386,
        0.02755138650536537,
        -0.028291314840316772,
        0.05854415148496628,
        0.012135454453527927,
        -0.012998360209167004,
        -0.019521208480000496,
        -0.008800119161605835,
        -0.020967168733477592,
        -0.07945531606674194,
        0.020823875442147255,
        0.06088205426931381,
        0.013217809610068798,
        0.0400397852063179,
        -0.0787956565618515,
        -0.01150076650083065,
        -0.10879706591367722,
        -0.02534186653792858,
        0.0494321770966053,
        -0.041341472417116165,
        -0.05377225577831268,
        0.01234473567456007,
        0.0345609188079834,
        -0.03112879954278469,
        -9.320002469410511e-33,
        0.000640582584310323,
        0.04523555561900139,
        0.058811698108911514,
        0.08393401652574539,
        0.023922011256217957,
        -0.07444656640291214,
        0.03512677177786827,
        0.13090527057647705,
        0.002172646578401327,
        -0.071550153195858,
        0.021367240697145462,
        0.06124431639909744,
        0.06084020063281059,
        -0.027131302282214165,
        -0.01599774695932865,
        -0.028422562405467033,
        -0.05925358459353447,
        -0.12685626745224,
        -0.005040689371526241,
        0.036685824394226074,
        0.13068310916423798,
        0.07536005228757858,
        -0.014452606439590454,
        0.0840628445148468,
        -0.022109342738986015,
        0.04846099764108658,
        0.0031970408745110035,
        -0.038358498364686966,
        0.03363515064120293,
        -0.02007671631872654,
        -0.04911523684859276,
        -0.05579760670661926,
        -0.02482251077890396,
        0.046505071222782135,
        0.088612861931324,
        0.027060361579060555,
        0.03380599617958069,
        -0.018212128430604935,
        -0.018866555765271187,
        -0.038677725940942764,
        0.034871336072683334,
        0.0008718575118109584,
        -0.0021672022994607687,
        -0.004618323873728514,
        0.08722233772277832,
        -0.12662199139595032,
        -0.05951812490820885,
        0.010470774956047535,
        0.04908711463212967,
        0.02786465734243393,
        0.07307398319244385,
        0.010552451945841312,
        -0.04983791336417198,
        0.030497228726744652,
        -0.012788277119398117,
        0.019553856924176216,
        0.022863877937197685,
        -0.05417470633983612,
        -0.022731494158506393,
        -0.004019583575427532,
        0.024248113855719566,
        0.04098660126328468,
        0.03577098622918129,
        0.0009343514684587717,
        -0.04114793613553047,
        -0.04315917193889618,
        0.07039153575897217,
        0.027847683057188988,
        -0.016495542600750923,
        -0.013000370934605598,
        -0.0207085981965065,
        0.040124814957380295,
        -0.055709440261125565,
        -0.11156298965215683,
        -0.017041634768247604,
        0.07864092290401459,
        -0.05689707770943642,
        0.012902726419270039,
        -0.02707650326192379,
        -0.05645398795604706,
        -0.008137507364153862,
        0.03553110361099243,
        -0.016415784135460854,
        0.01718623749911785,
        0.07361914217472076,
        -0.03023020550608635,
        0.03138500079512596,
        -0.022324085235595703,
        0.02037576399743557,
        0.036584220826625824,
        -0.05909125134348869,
        0.014763466082513332,
        -0.08828765898942947,
        0.101870596408844,
        -0.009201377630233765,
        -5.4811632566043045e-08,
        0.06802234053611755,
        0.09408095479011536,
        0.004821139387786388,
        -0.03452828526496887,
        0.04699375480413437,
        -0.07189328968524933,
        0.0028933887369930744,
        -0.01623275876045227,
        0.09733636677265167,
        0.002262494759634137,
        0.0030799589585512877,
        -0.06841544061899185,
        -0.011963416822254658,
        0.05957914888858795,
        -0.04556981474161148,
        0.06601562350988388,
        -0.09046313166618347,
        0.056386012583971024,
        -0.03974587470293045,
        -0.02659006603062153,
        0.013090219348669052,
        -0.023388506844639778,
        0.03690899536013603,
        -0.02426622249186039,
        -0.007012112531810999,
        -0.033841028809547424,
        -0.09176624566316605,
        -0.02878301776945591,
        0.011175848543643951,
        -0.01903751865029335,
        -0.02720401994884014,
        -0.04618098959326744,
        0.031409479677677155,
        -0.045504361391067505,
        -0.001198437879793346,
        -0.031322650611400604,
        0.019681699573993683,
        -0.05978516489267349,
        0.0782833993434906,
        -0.007411304395645857,
        0.040972139686346054,
        -0.06477707624435425,
        0.008299614302814007,
        0.057348012924194336,
        0.018617721274495125,
        -0.14707374572753906,
        0.008011353202164173,
        -0.09440281987190247,
        -0.04992999508976936,
        0.05585495010018349,
        -0.021920176222920418,
        -0.06581846624612808,
        -0.05263485014438629,
        -0.03257004916667938,
        0.0585954487323761,
        0.03696577250957489,
        0.016664758324623108,
        0.010838103480637074,
        0.011725609190762043,
        0.04106688126921654,
        0.07334541529417038,
        -0.1219765916466713,
        0.02249491587281227,
        0.1166340708732605
    ]
}