{
    "id": "8gM4x12RSzE",
    "title": "The Smart Glasses of the Future are here! - (Teardown)",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-03-15T16:32:51Z",
    "video_url": "https://www.youtube.com/watch?v=8gM4x12RSzE",
    "category": "Howto & Style",
    "tags": [
        "Nreal air",
        "wearable tech",
        "augmented reality glasses",
        "technology",
        "smart glasses",
        "mixed reality",
        "nreal air review",
        "nreal gaming",
        "nreal smart glasses",
        "best vr glasses",
        "best vr headset",
        "mobile gaming",
        "best smart glasses"
    ],
    "views": 575391,
    "likes": 30338,
    "comments_count": 27290,
    "description": "Today we take apart the Nreal Air:  huge thanks to Nreal for sponsoring this video! I've been on the lookout for ways to augment my gaming experience - and what better way than with augmented reality glasses? Yeah these sweet looking spectacles can take mobile multitasking to the next level - but I'm more interested in the 200 inch video and gaming displays that can fit in your pocket.  Would you Rock a pair of Virtual Reality Glasses?  Will EVERYONE be wearing smart glasses in the future?!   Get my Shirts and Razor Knife here!    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://amzn.to/3DTMyIn",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Lady and gentlemen, I present to you the smart glasses of the future. Now obviously, these are already partially torn down. Fully clothed they look like this and are called the Nreal AR. I'm personally not much of a gamer, with Breath of the Wild 2 right around the corner I am curious to see what it'll look like on a 200 inch display which is what these are the equivalent of. And as you can see behind me, I am a fan of multiple displays. Nreal sent a few of these over for me to try out, as well as take apart and give away to you guys. Huge thanks to Nreal for sponsoring this video. Let's get started. [Intro] I've had these Nreal AR glasses for a couple weeks now. And while showing a 3D experience in a 2D space is fairly difficult, I'm going to give it my best shot. At first glance these glasses look normal like larger Ray-Bans. But with two seconds of analysis you can tell something else is going on. I do prefer the stealth aspect of these AR glasses. Prisms are set behind the lenses that direct light from micro OLED panels above the frame. We'll see exactly how it works from the inside here in a second. But when viewing, it's pretty cool. When plugged into a phone the Nebula app gives the Nreal AR glasses a three dimensional workspace and the ability to have multiple windows open at once, all done through a USB-C connection in the back. More screen real estate equals more productivity...or at least that's what I tell myself. And a 3DoF tracking system uses gyros in the glasses themselves that monitor the movements of your head and control where you're looking. This works great in the app and all, however, when you plug it into something else, for example the Steam Deck, basically the Nreal AR glasses turn into a mirrored display. A large one of course. And the large 15 foot vertical screen moves with your head, which is a bit discombobulating at first, but then you get used to it. If we move to try out Breath of the Wild on the Nintendo Switch we find out that the Switch does not have a digital output through the USB-C port like the Steam Deck does. Instead we have to plug in an HDMI adapter to the Switch dock and then we're able to broadcast the Nintendo Switch in its full 130 inch glory through the glasses. I'm not going to lie, it's pretty legit. The screen is massive and does look better in real life. Right now you're only seeing through one eyeball and through the lens of a smartphone camera instead of having the full immersion. There are included Lin shades which add a backdrop to the VR and make it more visible in well lit rooms. But I'm pretty pleased with it, especially given the current pricing. Sitting right around $380 on Amazon. I'll put a link in the description. I can see this being really useful while traveling or while someone else is using the main TV in the house and you still want to play the Switch on a big screen. But now that we have a taste of how it looks from the outside, let's see how it works from the inside, from the Metaverse into the Jerryverse. The glasses are extremely lightweight. At 79 grams they have the smallest profile of any of the augmented reality systems I've seen so far. In order to reveal the inner workings we first remove the interchangeable nose piece, three different sizes of which come included with Nreal layer. Then we can pop off the upper plastics that surround the electronics and this is where things start to look futuristic. The proximity sensor is sitting right over the nose bridge on top of what looks like a machined aluminum core structure. Both arms of the glasses do contain electronics of their own, so I'll pop off the aesthetic chrome sleeves and the long plastic inside cover that protects the internal speaker and charging port on the left side. Same thing happens on the right side. With another downward loudspeaker and dual microphones for noise canceling. The arms themselves can be removed. Just a little hokey pokey to turn themselves around, and that's what it's all about. The arms have little springs on the end of them since the glasses can expand for wider faces, as well it has three positioned gaze adjustments since all human heads are different. Obviously I say this as an observer and not a collector. We can remove a few more screws to get a closer look at the loudspeaker, which sits right above the wearer's ears. It's nice to see some waterproof mesh over the speaker opening. Finally we get to the meat of the virtual reality glasses. The metal skeleton is held to the frame with 6 screws. With just the tiniest dab of caulking around the edges where the virtual reality glasses meet up with the reality glasses. Probably to prevent dust from getting between the two layers. The frames honestly look pretty normal now that all the high-tech components have been removed. The VR prisms and corresponding metal skeleton are surprisingly lightweight. There's a thin ribbon of circuits that connect the USB-C port to the two individual displays above each eye. You might have noticed that there is no internal battery for the Nreal AR. It pulls power through the USB-C port from whatever it's streaming from, whether that be a phone, computer, Xbox, Steam Deck, PlayStation, or Nintendo Switch. Things are always simple inside when a battery doesn't have to be included, and the glasses don't require any additional charging. There are four more screws holding down each of the micro OLED panels, one above each eye. Each of the panels can display over 16 million colors, full high definition, 1080p, with a 60 hertz refresh rate, not to mention a cute little dollop of thermal paste which helps transfer heat from the panel into the metal frame of the glasses. Not too shabby. We have successfully taken the Nreal AR and disassembled it into the smallest micro OLED TV in existence. If we take it one step farther, we can pop that TV out from the redirection prisms to see what kind of magnification it takes to bring us from one inch to 200 inches. All in all I think it's a pretty fascinating little unit and I'm excited to see where the future is headed. I don't think these are quite ready to replace my desktop just yet, but I do think it adds a very fun twist to gaming or watching movies especially while traveling. A full-size TV that fits in your pocket is hard to beat. I'm looking forward to trying them out more when Breath of the Wild 2 comes out. Which brings us to the giveaway. Nreal was kind enough to send over a few extra units. I only have two eyes of my own though so I'm giving these away to you. All you have to do to enter is leave a comment right below this video, be subscribed to my channel, and I'll pick a few winners over the next few days and ship them out. If you have any questions leave them down in the comments. Let me know what game you would play with these. And as always, thanks a ton for watching and I'll see you around.",
    "transcript_keywords": [
        "glasses",
        "Nreal",
        "Nintendo Switch",
        "Steam Deck",
        "Switch",
        "Lady and gentlemen",
        "reality glasses",
        "smart glasses",
        "USBC port",
        "Nreal AR glasses",
        "virtual reality glasses",
        "USBC",
        "pretty",
        "micro OLED",
        "micro OLED panels",
        "Steam",
        "Breath",
        "Wild",
        "Deck",
        "Nintendo"
    ],
    "transcript_entity_values": [
        "the Steam Deck",
        "Nintendo Switch",
        "HDMI",
        "VR",
        "a couple weeks",
        "Metaverse",
        "6",
        "1080p",
        "four",
        "two",
        "three",
        "Jerryverse",
        "Nebula",
        "the Nintendo Switch",
        "130 inch",
        "Nreal",
        "PlayStation",
        "2D",
        "79 grams",
        "Amazon",
        "16 million",
        "around $380",
        "Switch",
        "60",
        "larger Ray-Bans",
        "first",
        "second",
        "the next few days",
        "two seconds",
        "Lin",
        "Nreal AR",
        "one inch to 200 inches",
        "200 inch",
        "Xbox, Steam Deck",
        "15 foot",
        "one"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "FAC",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "TIME",
        "PERSON",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL"
    ],
    "vector": [
        -0.047640763223171234,
        0.013106091879308224,
        0.0016092198202386498,
        -0.11770226061344147,
        0.05552840605378151,
        -0.038434721529483795,
        0.10093660652637482,
        -0.008141615428030491,
        -0.09132631868124008,
        0.09758513420820236,
        0.005250536371022463,
        0.009249018505215645,
        -0.0050093368627130985,
        0.024861110374331474,
        0.03373989090323448,
        -0.015435237437486649,
        0.04067542031407356,
        -0.03908400237560272,
        -0.022136731073260307,
        0.1466231793165207,
        0.051588743925094604,
        -0.01832505501806736,
        -0.0033355983905494213,
        -0.031871989369392395,
        -0.008169823326170444,
        0.03563627600669861,
        -0.0183158740401268,
        -0.030813666060566902,
        -0.09277677536010742,
        -0.017586247995495796,
        0.002061085542663932,
        0.01989736035466194,
        -0.05557415261864662,
        0.015596838667988777,
        0.029401687905192375,
        -0.022008731961250305,
        0.013998378068208694,
        -0.010435809381306171,
        -0.10860155522823334,
        -0.06265585124492645,
        -0.07289422303438187,
        -0.0528278686106205,
        -0.0330694243311882,
        -0.017816618084907532,
        0.040554653853178024,
        -0.00689766276627779,
        0.05556655675172806,
        -0.04075630009174347,
        -0.003685927717015147,
        0.0016358478460460901,
        -0.12354598939418793,
        -0.06503923237323761,
        0.03778292238712311,
        -0.057930730283260345,
        0.02754894830286503,
        0.051739778369665146,
        -0.016303282231092453,
        -0.05559919774532318,
        -0.01844710111618042,
        0.027973003685474396,
        0.10631389170885086,
        -0.017058469355106354,
        -0.019744042307138443,
        0.07910893857479095,
        -0.0525626465678215,
        0.030103368684649467,
        0.0795959010720253,
        -0.037851281464099884,
        0.004977772943675518,
        -0.043656181544065475,
        -0.08974312245845795,
        0.041047487407922745,
        0.03349946811795235,
        -0.05185342952609062,
        0.05150369927287102,
        -0.006568457931280136,
        0.02895323373377323,
        -0.11594398319721222,
        0.025656895712018013,
        0.040005482733249664,
        0.04664317145943642,
        0.007624880410730839,
        0.006174891255795956,
        -0.014515021815896034,
        -0.05256630852818489,
        0.008454224094748497,
        -0.04664299264550209,
        0.042249295860528946,
        -0.003043874865397811,
        -0.08210486173629761,
        -0.03143720701336861,
        -0.011872679926455021,
        0.014643475413322449,
        -0.007206252310425043,
        0.07502839714288712,
        -0.08458543568849564,
        -0.06164715811610222,
        -0.09487340599298477,
        -0.02434656023979187,
        0.03501497209072113,
        0.045488886535167694,
        -0.04526086524128914,
        0.06174304708838463,
        -0.033521413803100586,
        0.03219890967011452,
        0.03419429436326027,
        -0.0013731039362028241,
        0.02495560050010681,
        0.022436777129769325,
        0.028743034228682518,
        -0.036106519401073456,
        0.056868113577365875,
        -0.016416937112808228,
        -0.03963776305317879,
        -0.0005960025009699166,
        0.08637842535972595,
        -0.06177002564072609,
        0.08243120461702347,
        0.14485134184360504,
        -0.029948949813842773,
        0.041088640689849854,
        -0.003983567003160715,
        0.04323524609208107,
        0.07584411650896072,
        0.09932592511177063,
        -0.00681856507435441,
        -0.038582850247621536,
        2.3517147530772e-33,
        -0.006680095102638006,
        0.1421615183353424,
        0.000982687110081315,
        0.0020731918048113585,
        0.033869512379169464,
        0.016998128965497017,
        0.032882966101169586,
        0.016260555014014244,
        -0.008477547205984592,
        0.00014941947301849723,
        0.04133501648902893,
        0.049058254808187485,
        -0.01326611265540123,
        0.09074895828962326,
        0.06682144105434418,
        -0.04890161007642746,
        -0.007333007641136646,
        0.03311293572187424,
        -0.06985126435756683,
        0.02938566543161869,
        -0.05053093284368515,
        -0.10574794560670853,
        -0.018524708226323128,
        0.0886131078004837,
        -0.0031012496910989285,
        0.07950110733509064,
        0.007913739420473576,
        0.0139289116486907,
        0.05133199691772461,
        0.04264345020055771,
        -0.0164689589291811,
        0.037133265286684036,
        -0.0027276703622192144,
        -0.012915011495351791,
        0.004304887261241674,
        0.008140170946717262,
        -0.07151750475168228,
        -0.042080070823431015,
        -0.03408576175570488,
        -0.010524503886699677,
        -0.007993385195732117,
        0.08875114470720291,
        0.029695913195610046,
        -0.050144750624895096,
        -0.037298206239938736,
        0.01894270069897175,
        -0.00280625163577497,
        0.08701053261756897,
        -0.11627138406038284,
        -0.023172667250037193,
        -0.035646870732307434,
        -0.044865112751722336,
        -0.09206753969192505,
        -0.08295459300279617,
        -0.08021523058414459,
        -0.040728192776441574,
        -0.012945083901286125,
        -0.0033022675197571516,
        0.04763653129339218,
        -0.08521604537963867,
        -0.01764887385070324,
        -0.0367608442902565,
        -0.013747032731771469,
        0.05137867107987404,
        -0.09659939259290695,
        -0.04431133344769478,
        0.090206578373909,
        0.028094040229916573,
        -0.07564620673656464,
        0.038468632847070694,
        0.0070479074493050575,
        0.03754580765962601,
        -0.014937418513000011,
        -0.05913262069225311,
        0.040886085480451584,
        0.022833602502942085,
        -0.027163611724972725,
        0.009892483241856098,
        -0.01784663274884224,
        0.039486244320869446,
        -0.03629884868860245,
        0.037958767265081406,
        0.002009787131100893,
        -0.032414209097623825,
        0.014606984332203865,
        -0.04634186625480652,
        0.0024743841495364904,
        -0.09321237355470657,
        0.00582038564607501,
        -0.05239281803369522,
        0.006293134298175573,
        -0.06178334727883339,
        -0.023839030414819717,
        -0.054647449404001236,
        -0.1115444079041481,
        -4.458326444380476e-33,
        0.025300266221165657,
        -0.004204201512038708,
        0.022131331264972687,
        0.0022614903282374144,
        0.06885494291782379,
        -0.06933045387268066,
        0.10805203765630722,
        0.06629268825054169,
        0.03966768458485603,
        -0.10310044139623642,
        -0.025716053321957588,
        0.039509788155555725,
        -0.09905713051557541,
        -0.02199978567659855,
        0.006959353573620319,
        -0.06345906853675842,
        0.039550114423036575,
        -0.09725228697061539,
        0.00421531405299902,
        0.038615137338638306,
        0.07865550369024277,
        -0.03942318260669708,
        0.03441925346851349,
        -0.006648802664130926,
        0.0017841036897152662,
        0.03613715618848801,
        0.02855142205953598,
        -0.03531818464398384,
        -0.026608308777213097,
        0.02834884636104107,
        0.025400470942258835,
        -0.002878989093005657,
        -0.0028406099881976843,
        0.029045676812529564,
        0.06300784647464752,
        0.06863637268543243,
        0.0265603419393301,
        -0.052115656435489655,
        -0.07124938815832138,
        -0.07099660485982895,
        -0.004588830750435591,
        0.04843898117542267,
        -0.012121692299842834,
        -0.012575906701385975,
        0.008112151175737381,
        -0.055064961314201355,
        0.00019476894522085786,
        -0.011734932661056519,
        -0.06896654516458511,
        -0.026975098997354507,
        -0.03017960675060749,
        0.04077953100204468,
        -0.0033919289708137512,
        -0.08425478637218475,
        -0.08018055558204651,
        0.002242122543975711,
        -0.03160931542515755,
        0.023763902485370636,
        0.013653510250151157,
        -0.028906796127557755,
        0.015624401159584522,
        0.029075177386403084,
        -0.07769645005464554,
        -0.031078768894076347,
        -0.033969294279813766,
        0.0473722442984581,
        0.002114778384566307,
        0.06514904648065567,
        0.013406649231910706,
        -0.015268784947693348,
        0.031831640750169754,
        -0.009606960229575634,
        -0.00943593867123127,
        -0.0023333949502557516,
        0.008069912903010845,
        -0.012101042084395885,
        0.03970718756318092,
        0.047687213867902756,
        0.06878132373094559,
        0.037145961076021194,
        0.037330202758312225,
        -0.011449283920228481,
        0.0895337164402008,
        0.10286223888397217,
        0.025048526003956795,
        0.02177470177412033,
        0.04323096573352814,
        -0.022285064682364464,
        -0.09722582250833511,
        0.01631489396095276,
        -0.06639841198921204,
        0.04500490799546242,
        -0.013244480825960636,
        0.07648226618766785,
        0.03000619262456894,
        -5.453863494153666e-08,
        0.03338133916258812,
        0.08266414701938629,
        0.012033098377287388,
        -0.013768283650279045,
        -0.058357808738946915,
        -0.054750606417655945,
        4.574532067636028e-05,
        0.013404943980276585,
        -0.010603287257254124,
        -0.06158674880862236,
        -0.01288433838635683,
        -0.037628453224897385,
        0.028769776225090027,
        0.09261634945869446,
        0.03595351427793503,
        0.04169217497110367,
        -0.017154976725578308,
        0.030868874862790108,
        -0.06602247059345245,
        0.050973255187273026,
        0.01712762750685215,
        0.0054557668045163155,
        0.0503862127661705,
        0.0021197099704295397,
        -0.034900207072496414,
        0.07578247040510178,
        -0.08256806433200836,
        -0.04366398602724075,
        0.0631503164768219,
        0.08168385177850723,
        -0.014466158114373684,
        -0.003180364379659295,
        -0.04044342786073685,
        0.040636103600263596,
        -0.02954653464257717,
        -0.11207547038793564,
        -0.08736317604780197,
        0.008341116830706596,
        0.05933042988181114,
        0.021341850981116295,
        -0.03590448200702667,
        -0.1164625808596611,
        0.07285530120134354,
        0.055269304662942886,
        0.0017713607521727681,
        -0.08817031234502792,
        0.009068059735000134,
        -0.14054127037525177,
        -0.06314317882061005,
        0.025353718549013138,
        -0.032894596457481384,
        0.025422217324376106,
        -0.02419167011976242,
        0.05941038206219673,
        -0.023899970576167107,
        -0.013084933161735535,
        0.14113280177116394,
        -0.003454935969784856,
        -0.048149071633815765,
        0.03341613709926605,
        0.004397689830511808,
        -0.02249404415488243,
        -0.09954430907964706,
        0.04084531590342522
    ]
}