{
    "id": "8HAq3bOmrvA",
    "title": "I broke this in under one hour... - Eurorra Carbon Fibre Laptop",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-08-09T18:36:41Z",
    "video_url": "https://www.youtube.com/watch?v=8HAq3bOmrvA",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy"
    ],
    "views": 1565949,
    "likes": 59140,
    "comments_count": 3885,
    "description": "Get 10% off all Jackery products with code LinusTechTips at   Eurorra sent over one of their bespoke carbon fibre laptops for Linus to check out, but the wide Linus meme hand-crafted into the Linux laptop's lid may have been a bad omen...  Learn more about Eurorra at   Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Omg... 0:07 Too heavy to unbox? 0:50 I think we're being trolled... 2:00 Specs and what's in the box 2:53 Build quality impressions 3:49 Ports/IO 4:28 The issues begin... 5:10 Preparing to game ft. Colton 5:47 Included warranties 6:09 Opening up the laptop 7:24 A pleasant surprise! 8:05 Our first call to Anthony 9:04 Taking a look under the cooler 10:10 Linus' Linux curse  10:42 More about Eurorra and laptop pricing 11:38 Sponsor - Jackery 12:04 Attempting to game ft. Anthony call 2 13:14 Crowd reactions 13:55 Gaming? (Barely) 15:43 She's dead, Jim 16:19 Outro",
    "description_links": [
        "https://lmg.gg/Smek8",
        "https://www.eurorra.com/",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Oh, my God. It's so heavy. Okay. One moment please. Oh my. Okay. Hear me out. You make a carbon fiber laptop but the packaging for it is so heavy. You can barely lift it. What is inside here? It's a Eurorra. The chassis for this is apparently handcrafted, takes over 250 hours for the types of artisans who work on freaking space equipment to make out of carbon fiber. And it features top tier specs. We're talking Ryzen 5900 H RTX 3070. How do I open it? (clasps open) Ah, (upbeat music in case) Really? Did you know that was going to happen? - No. - Okay. Oh God. I started it again. (shrill music) It's got a light sensor on it. Okay. Eurorra, are you kidding me? A. You put that theme music in the case. B. You put this sticker on my laptop. It's not just a sticker. It's actually raised. They handcrafted a wide Linus face top cover for a laptop. It's not even removable. This is permanent. Why? Handmade by master craftsman for Linus Media Group. I've just received word for my producer, Bell that this may not actually be an AMD based machine. We're not sure what's in it. But we can get to that later. First, let's go ahead and have a look at the accessories here. (Lively music from case) (clap stopping music) Oh, specifications. All right. Here's our specs. Oh, wow. This is really beefy. 12700 core i7, RTX 3070 Ti, 240 Hertz IPS 15.6 inch 1080P display, 32 gigs RAM, one terabyte SSD. And it's running Linux Ubuntu custom. Battery shipped separately. Wait, where do you go? Is this a second battery? Now that's a paradigm I've not seen in a long time. Given that the batteries screw in. I would say that quick swapping between them throughout the day is not something that most people are likely to do. The batteries are 62 watt hours. That is not especially beefy for a high powered gaming machine like this one. They claim up to eight hours of battery life. Obviously not wild gaming. And I would expect it to probably get somewhere in the neighborhood of around 45 minutes if you're really taxing it. So that's a battery swap that we just did. I can't believe these guys do custom carbon fiber lids and they spent their talents on this. There are a few more things Eurorra wanted us to mention. Apparently the molds are custom, they're hand polished. They use a UV printing process for color here. So when I said, this is permanent Bell, it's not a sticker. This is on there forever. We have 81 quality checks before the machine makes it to your door. And apparently, yes that custom case is part of the experience. Oh wow. This is very custom feeling. So the whole top panel is carbon fiber actually, it's 2.2 kilograms in total. So while it's a thick boy, it doesn't feel crazy thick although it's probably a relatively small weight difference that I'm actually feeling here. Or maybe it just like, feels lighter. 'cause when you lift up the lid like that's noticeably super light. Let's have a look at IO. Sorry. I'm getting my getting my groove back a little bit here. Kensington lock dual USB 3a's. I'm assuming this is gigabit ethernet. They don't actually specify micro SD. Other side, we've got another type a. This one's USB 2. Dedicated microphone and headphone jacks. Lots of venting for cooling. As well as power in, mini display port 1.4 and HDMI port that is not specified. It's a 3070 Ti though. So I would expect it to be HDMI 2.1. As well as a type C that access both display port and USB. Fingerprint scanner on the touch pad. Not a very big touch pad. The whole machine has a bit of a clevo feel to it. What was that? As far out as the screen opens? It's the content, not the view. What does that even mean. What just happened? What just happened? Extension updates was, Ubuntu is ready. What is happening? Experience an internal error. I swear I did nothing. - (laughing) I do nothing and Linux breaks. You saw me. I didn't do anything. Listen of those fans go CPU sitting at about 60 degrees so I can see why that kicked in. Just to be clear, you can get your Eurorra with windows 11. They just decided to, I think have some fun with me by sending me one with Linux on it. Anyway, I've got my screen recording working. Let's go ahead and see if we can find a game to play. I mean obviously CSGO will work right? Should be fine. Wow, that fan though. Spicy! Makes me wanna have a look at that cooling solution. Hi Colton, what can I do for you? - Nothing. How's this going? - Good. - Oh yeah, yeah. Actually I think I'm the one that got them to do that. - This was your doing? - Well, they did it. How's the laptop itself? - It's a laptop it's preparing for takeoff right now. It's got a carbon fiber lid as advertised. - Cool. Can confirm. May I have an ethernet cable please? We could talk warranty. It's got a three year warranty which is pretty unusual in the electronics industry. The SSD is apparently five years with a 15 year warranty on the chassis. That means these are probably off the shelf SSD and Ram upgrades, which by the way is something that they fully support you doing on your own. Oh my God, it doesn't even, it doesn't even sit flat. 'Cause of the thing. Just looking through the vent here. I'm expecting this cooling solution to be fricking beeftastic. And the thing to remember is you might look at a machine like this and go, wow, that's really thick for an RTX 3070, you know, 12 700 machine. Unfortunately the laptop game has gotten really confusing these days. And just because two laptops have the same specs doesn't mean that they will necessarily perform the same. So you have to actually build a cooling solution that is capable of cooling the hardware which I would guess again, based on just looking through the top here, bottom, that they have done. Okay. Please tell me these screws are all the same at least. Right now, as far as the sleekness or elegance or sex appeal of the machine goes. I would say they're behind. So hopefully they can make up some ground on performance. Got a couple of good Ram SSDs. I guess that's how we got to two terabytes. Eurorra is apparently white labeling their own DRAM. These are 3,200 mega transfer per second. Yes. That was very easy to get access to. Wait a second. That explains how thick it is. This has a fricking desktop chip in it. You aren't gonna tell me that you? - You found it. - Okay. I get it now. Ram SSD, even CPU are actually upgradable on this machine. That's pretty cool. That also explains why it sounds like an aircraft. It's a 65 watt chip but it'll apparently turbo up to 180 Watts. I'd be surprised if we manage to suck 180 watts in a configuration like this. Well, what is this, 37 ETI even a notebook version? It's gotta be, it's gotta be there's no way NVIDIA would let them ship a desktop chip in it. Oh my God. I need Anthony. Someone call Anthony. Update and software. Ubuntu software. Is this the one? Is that what it's called? Or is it a utility? I don't know. I need to know what hardware's in here. And I don't know how to hwinfo Linux. - So you could LS PCI in the terminal. - Yeah, yeah. That, oh my God. - Right? Yeah. You can't do that. - Why would I wanna control C in here? That would be stupid. Can I- - Well, I mean you control C to break. So like if you got an application that's running. - It's a laptop version of the 1070 ETI. Okay. Confirmed. Cool. I think that was really all I needed to know. Do you like my laptop? - It's wide. - Oh my God. Yes. I know it needs to be, you know what? Fine. It I'll install it now. Oh. And now I killed my OBS recording probably. - Uh yes. - OOOOH - I think I'm good. - Okay. - Thank you. 7, 6, 5, 1. Oh there's an 8. Oh, there are different lengths of screws. Good luck Linus. Oh boy. And then these seem to be pull tabs. Wow. Can confirm very beefy cooler. We got one large heat sink element over here. This guy is focused on CPU cooling. We got the two thick heat pipes right over to the CPU. And VRM, that's gonna be a key component of a laptop like this because you wanna provide desktop power. Right? They've got really robust VRMs for the GPU as well. This is flipping crazy. I've seen laptop main boards that devote less space to the CPU and GPU entirely. And this is just power delivery here. There you have it ladies and gentlemen. Desktop CPU in a laptop, because why not? Oh wow, there's a two and a half inch SSD mount here too. Holy crap. Can you ever fit a lot of stuff in here? I'll be a minute. I touched nothing. What? I was not touching it. Why did it do this? You, you watch like there are so many people who thought I set out to smear Linux and I just fabricated the random quality of life problems I had with it, or, oh it was specific to the the one you were using or the software you tried to run. I, I did nothing. Windows is horrible too. Just to be very clear, but I did nothing. You saw. Some more about your Eurorra. Apparently a portion of the proceeds of each sale go to the artisan who worked on the shell and as for why they exist. Apparently it's because they felt like mass produced designs do not address the individuality of, well, individuals. So, for people who want something bespoke, they exist. Hopefully those people who want a bespoke laptop experience also have a lot of money because a machine like this is gonna cost you somewhere in the neighborhood of about $5,000. What doesn't cost $5,000 is the all new short circuit hoodie. It's got so many pockets. And if I do say so myself, it looks really sharp. - (impressed whistle) - Thank you. - Thanks to Jackery for sponsoring today's video. The Explorer 1500 Portable Power Station has enough juice to keep even the hungriest of devices powered and connected. It's a 1500, one hour capacity and 1800 watt output rate. Allow up to seven devices to charge simultaneously. Only four hours of charge time is needed to go from zero to 80%. So, check out the Explorer 1500 at the link below and get 10% off with code LinusTechTips. - Well, this is a pretty cool 10 frames per second that we've got going on here. Uh-huh. (upbeat gaming music) To be clear, I'm not blaming your Eurorra for this at all. Other than that, they chose to send me this laptop with Ubuntu on it. Knowing that I am cursed when it comes to Linux. Okay, so you've got Ubuntu software. You've got software. You've got software updater and software end updates. - Yes. You may need to install flat pack. That'll probably be the easiest way to do it. - I just wanna know my GP temperatures. This is painful. Okay. Apparently it's gone. It doesn't matter. The point is with some help from Anthony, we tried to grip NVIDIA in the terminal and found out that the driver's not running at all. Which means we were probably running CS GO in software, on the CPU. A CPU that was also handling encoding for our screen capture. I mean, look, I didn't, I didn't set this up. It's a laptop. Custom carbon fiber top. - Who did this? Ooh - Yeah. - Oh no. This is the monstrosity. - Yeah, I know. - It might be the worst thing I've ever seen. - Thanks. - (laughing) - We are now using a recommended driver. - Did you reboot? - Cool. Do I need to reboot? - Yeah, you should probably reboot. - Oh my God. I'm so unhappy right now. - Is that the carbon laptop? - Yep. - What are you unhappy about? - They shipped it with Linux on it and no GPU driver, 'cause apparently they just are suckers for punishment and wanted me to hate it. It's processing Vulkan shaders this time instead of launching like OpenGL mode, or whatever. So something's different. Play CS Go Dust II. Here we go, boys. Why is this cut off? It's a 1080 P display. How is that even Possible? This is Valve software. Steam was pre-installed. All I did was install CS Go and try to play. I'm cursed, Anthony. Linux hates me. - Did you do something to offend a penguin at some point in your life? - I have never, never attacked a penguin. - (mumbling) It's running better but like a hundred FPS on a 3070 Ti. That is dog . (lighthearted laugh) This feels and looks horrible. Look at that tearing. That is not a Gen 4 nvme experience. - I have a command for you. So right click CS Go then in launch options type. - That's our launch option. Well, let's try that again. Shall we? This was what the whole Linux challenge was like for me. Every time I thought I had a solution, I'm not in the mainframe. Yeah, that did not work. We're only getting a hundred FPSs in the menu. Let's see if we can at least just force it to use the NVIDIA GPU for everything and try to at least just run a game so I can stop making this video. The number of times too, that I was criticized for pointing out that, hey, you actually do need to restart your system a fair bit in Linux. It's like's happened like three times already in an hour. I'm not trying to be like a jack about it. Like I told you so. But like, come on guys! It's just, if you say that it doesn't have to be done. You are just obviously just diluted. I'm sorry. This is even gonna boot. How funny would it be if I managed to brick a Linux install in an hour? By simply trying, having the audacity to try to play a game. - That would be poetic. - We should do just an uncut float plain exclusive. - Stay tuned for that. - Of just proving I did nothing. I think it's bricked, man. It's not booting again. - (Laughing) - So there it is. Eurorra laptop. It's got a desktop CPU in it and their big claim to fame is their bespoke carbon fiber handcrafted top panels. Hopefully if you guys decided to get one you chose one that was a little more tasteful than the one that they made for me. Hope you enjoyed this short circuit. (laughing) Subscribe. I didn't do anything!",
    "transcript_keywords": [
        "laptop",
        "Linux",
        "CPU",
        "carbon fiber",
        "God",
        "Eurorra",
        "apparently",
        "yeah",
        "machine",
        "software",
        "carbon",
        "fiber",
        "SSD",
        "Linux Ubuntu custom",
        "Ubuntu",
        "wow",
        "custom",
        "top",
        "custom carbon fiber",
        "cooling"
    ],
    "transcript_entity_values": [
        "an hour",
        "1.4",
        "15 year",
        "37 ETI",
        "8",
        "Ram",
        "USB",
        "NVIDIA",
        "Eurorra",
        "Bell",
        "Gen 4",
        "The Explorer 1500 Portable Power Station",
        "Ram SSD",
        "Colton",
        "10",
        "AMD",
        "Anthony",
        "7",
        "up to seven",
        "1800 watt",
        "1080",
        "Vulkan",
        "Linus",
        "1500",
        "today",
        "two terabytes",
        "5",
        "Hertz",
        "Linus Media Group",
        "3070 Ti",
        "3,200",
        "zero to 80%",
        "micro SD",
        "Only four hours",
        "USB 3a's",
        "Linux Ubuntu",
        "3070",
        "Watts",
        "11",
        "62 watt hours",
        "the Explorer 1500",
        "Linux",
        "two",
        "Jackery",
        "GPU",
        "hundred",
        "CS GO",
        "one hour",
        "about $5,000",
        "CPU",
        "2.1",
        "LinusTechTips",
        "SSD",
        "up to eight hours",
        "2.2 kilograms",
        "32",
        "65 watt",
        "nvme",
        "Kensington",
        "over 250 hours",
        "one",
        "VRM",
        "second",
        "CS Go",
        "CSGO",
        "Linux",
        "12 700",
        "10%",
        "five years",
        "Eurorra",
        "First",
        "81",
        "about 60 degrees",
        "the day",
        "12700",
        "three",
        "One",
        "around 45 minutes",
        "a hundred",
        "5,000",
        "6",
        "240",
        "Valve",
        "IO",
        "three year",
        "USB 2",
        "1",
        "180 watts"
    ],
    "transcript_entity_types": [
        "TIME",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "PRODUCT",
        "LOC",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "GPE",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "NORP",
        "GPE",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY"
    ],
    "vector": [
        -0.03786458075046539,
        -0.00955651979893446,
        -0.04158922657370567,
        -0.07377488911151886,
        0.18224173784255981,
        -0.01209452748298645,
        -0.041845932602882385,
        -0.0036413874477148056,
        -0.01211861614137888,
        -0.013239013962447643,
        0.002600714098662138,
        -0.02551862969994545,
        -0.06521362066268921,
        -0.001863015815615654,
        -0.0110408840700984,
        -0.028419887647032738,
        -0.029215553775429726,
        -0.09040220826864243,
        -0.01745130494236946,
        0.010128267109394073,
        0.05004269629716873,
        -0.050792112946510315,
        0.05133968964219093,
        -0.0027092942036688328,
        -0.01633351482450962,
        -0.05103083699941635,
        0.03805583342909813,
        -0.04442571848630905,
        -0.01984025351703167,
        -0.06569283455610275,
        0.05070360749959946,
        0.035565085709095,
        -0.06389214843511581,
        0.017786184325814247,
        0.07798972725868225,
        -0.08817686885595322,
        -7.804843335179612e-05,
        -0.12796416878700256,
        -0.13271284103393555,
        -0.054410435259342194,
        -0.004592006094753742,
        -0.08958153426647186,
        0.004019115585833788,
        -0.005919905379414558,
        0.018390553072094917,
        -0.015179288573563099,
        0.019987760111689568,
        -0.044895172119140625,
        0.013388769701123238,
        -0.019880594685673714,
        -0.042486194521188736,
        -0.04391908645629883,
        0.022203756496310234,
        -0.08767477422952652,
        -0.045563288033008575,
        -0.021624941378831863,
        -0.002203315496444702,
        -0.017350733280181885,
        0.060416556894779205,
        0.007150988094508648,
        0.12240739911794662,
        -0.030822724103927612,
        -0.06389406323432922,
        0.08898723125457764,
        0.004737015347927809,
        -0.0006788542377762496,
        -0.003823748789727688,
        0.04186152666807175,
        -0.09393180906772614,
        0.003313179360702634,
        -0.0005219394224695861,
        -0.07318756729364395,
        -0.029976874589920044,
        0.09896259754896164,
        -0.001224153907969594,
        -0.028647735714912415,
        0.031118672341108322,
        -0.06812326610088348,
        6.133360147941858e-05,
        0.0682123675942421,
        -0.00017566970200277865,
        -0.00012108191731385887,
        0.022938238456845284,
        0.011157811619341373,
        -0.0005194535478949547,
        0.033418819308280945,
        0.07193618267774582,
        -0.022446462884545326,
        -0.0485866442322731,
        -0.10250721871852875,
        -0.09179022908210754,
        -0.025717725977301598,
        0.047612547874450684,
        0.04188867285847664,
        -0.05410531535744667,
        -0.062093522399663925,
        0.04307180643081665,
        0.0018994593992829323,
        -0.06422232836484909,
        0.10241609811782837,
        -0.010957487858831882,
        0.01428432296961546,
        -0.007410417310893536,
        -0.06457643210887909,
        -0.1058889850974083,
        -0.04026632383465767,
        0.052560511976480484,
        0.08666057139635086,
        0.012200218625366688,
        0.014902858063578606,
        -0.1117817834019661,
        0.030408628284931183,
        -0.08653920888900757,
        -0.023848528042435646,
        -0.0025337610859423876,
        0.003406838048249483,
        0.01131210196763277,
        -0.013482778333127499,
        0.035780154168605804,
        -0.026255732402205467,
        -0.0027503729797899723,
        -0.0435253269970417,
        -0.023744961246848106,
        0.019419658929109573,
        -0.015488198027014732,
        0.01454305462539196,
        0.014932317659258842,
        2.9872055039842046e-34,
        -0.00636533135548234,
        -0.025400010868906975,
        -0.04226021096110344,
        -0.027105282992124557,
        0.106534443795681,
        0.0037751514464616776,
        -0.02674286440014839,
        -0.02675250917673111,
        -0.08559460192918777,
        0.01854506880044937,
        -0.0419418029487133,
        0.010997278615832329,
        -0.09161376953125,
        0.07682734727859497,
        0.0028934041038155556,
        -0.08138206601142883,
        0.020314132794737816,
        0.028000757098197937,
        -0.04603344202041626,
        -0.08978753536939621,
        -0.018129950389266014,
        0.03641977906227112,
        0.051589176058769226,
        -0.0474417470395565,
        0.04306253790855408,
        0.023894373327493668,
        0.018376847729086876,
        -0.02129058539867401,
        0.07728379964828491,
        0.06199141964316368,
        0.0015490168007090688,
        -0.02795564755797386,
        -0.037694647908210754,
        -0.032174862921237946,
        -0.07901141792535782,
        0.014971764758229256,
        -0.11256351321935654,
        -0.06591971963644028,
        0.0045444779098033905,
        0.016520177945494652,
        0.050262510776519775,
        -4.681008431361988e-05,
        -0.05817531421780586,
        -0.08532232791185379,
        -0.03463192284107208,
        0.009910824708640575,
        0.03710338473320007,
        0.03930459916591644,
        0.006831855978816748,
        -0.040538057684898376,
        -0.01450443733483553,
        0.02797667682170868,
        -0.056915320456027985,
        -0.07238516956567764,
        -0.016761599108576775,
        -0.016245152801275253,
        0.037323180586099625,
        -0.01925034448504448,
        0.11484449356794357,
        -0.02629588171839714,
        0.042456187307834625,
        0.046285051852464676,
        0.07235005497932434,
        -0.07832618802785873,
        0.012723531574010849,
        0.039341315627098083,
        0.059048786759376526,
        0.03684254735708237,
        -0.08232777565717697,
        -0.008655261248350143,
        -0.06034800410270691,
        0.0071744155138731,
        0.07565075159072876,
        -0.009395325556397438,
        -0.0058356281369924545,
        0.03522486984729767,
        -0.0692717581987381,
        -0.02356097474694252,
        0.0014559950213879347,
        0.002589602954685688,
        -0.00852880533784628,
        -0.044669803231954575,
        0.10815590620040894,
        -0.06453092396259308,
        -0.00808210764080286,
        -0.040715061128139496,
        -0.015318121761083603,
        -0.005491072777658701,
        -0.04935963451862335,
        0.05919251963496208,
        -0.019088687375187874,
        0.017674773931503296,
        -0.005050657317042351,
        -0.047543641179800034,
        -0.054092567414045334,
        -3.756059303234363e-33,
        0.00038765938370488584,
        0.032771334052085876,
        -0.047432467341423035,
        0.01837902143597603,
        0.11177350580692291,
        0.08308138698339462,
        0.0703444555401802,
        -0.006070576608181,
        0.046554386615753174,
        -0.027004528790712357,
        0.0009435996180400252,
        -0.030626429244875908,
        -0.07084759324789047,
        -0.04308219999074936,
        0.032870110124349594,
        -0.03161563351750374,
        0.04291326552629471,
        -0.051777444779872894,
        -0.050009120255708694,
        -0.03456311672925949,
        0.006602760870009661,
        0.009484849870204926,
        0.01529589481651783,
        0.02118237502872944,
        -0.029563579708337784,
        -0.006621033418923616,
        0.05616597831249237,
        0.059527620673179626,
        -0.03693206235766411,
        -0.0015050068031996489,
        0.026137888431549072,
        -0.03559182211756706,
        -0.03560878708958626,
        0.053578637540340424,
        0.08921884000301361,
        -0.017586160451173782,
        0.06086631864309311,
        0.054181504994630814,
        -0.03177580237388611,
        -0.022716861218214035,
        -0.018846744671463966,
        -0.019573016092181206,
        -0.09396235644817352,
        -0.061732545495033264,
        0.060477547347545624,
        -0.11495635658502579,
        -0.12854427099227905,
        -0.10078392922878265,
        0.021628806367516518,
        -0.049815572798252106,
        0.0037093323189765215,
        -0.018403101712465286,
        0.09673269093036652,
        0.004188377410173416,
        -0.0036305654793977737,
        0.024014368653297424,
        -0.01718391664326191,
        0.06160954758524895,
        0.06037907302379608,
        0.01730022393167019,
        0.04139406979084015,
        -0.02304556407034397,
        -0.016322148963809013,
        -0.09134219586849213,
        0.0831342414021492,
        -0.04874062538146973,
        -0.02428656816482544,
        0.018852457404136658,
        -0.042970649898052216,
        -0.02765987627208233,
        0.055254094302654266,
        0.02890942245721817,
        0.03918687626719475,
        -0.007737981621176004,
        -0.02631070464849472,
        0.0036016693338751793,
        0.01338896807283163,
        -0.020667865872383118,
        0.013797657564282417,
        -0.023295367136597633,
        -0.009527051821351051,
        -0.036905210465192795,
        0.04451268911361694,
        0.03570840135216713,
        0.07752133905887604,
        -0.01841844618320465,
        0.10575315356254578,
        -0.0154397739097476,
        -0.012344181537628174,
        0.019325613975524902,
        -0.005146382376551628,
        0.043057091534137726,
        0.016064949333667755,
        0.09316236525774002,
        0.09055264294147491,
        -6.392463802740167e-08,
        -0.056595247238874435,
        -0.006692836061120033,
        -0.000704537145793438,
        0.10418248921632767,
        -0.03127269819378853,
        -0.03552818298339844,
        0.0615944042801857,
        -0.013070767745375633,
        0.03527923673391342,
        -0.07210750132799149,
        -0.0067376731894910336,
        -0.09071844071149826,
        0.015720553696155548,
        0.0563635490834713,
        -0.009848547168076038,
        0.012582383118569851,
        -0.06867140531539917,
        0.10445242375135422,
        0.0011071142507717013,
        0.049040764570236206,
        0.018428204581141472,
        0.029871458187699318,
        0.12143813073635101,
        -0.04831879213452339,
        -0.04024466499686241,
        0.024451876059174538,
        -0.005893462337553501,
        0.09107328206300735,
        0.11248009651899338,
        -0.061104804277420044,
        -0.11565866321325302,
        0.012536689639091492,
        0.001910776481963694,
        0.02992091327905655,
        -0.07010743021965027,
        0.0038247096817940474,
        -0.03696441650390625,
        0.09059825539588928,
        -0.00675535760819912,
        0.045224159955978394,
        0.037617042660713196,
        -0.023288443684577942,
        -0.0015301031526178122,
        -0.006559950299561024,
        0.04543965682387352,
        0.06259182840585709,
        0.0286699365824461,
        -0.01611819677054882,
        -0.06279835104942322,
        0.07071687281131744,
        0.031713660806417465,
        -0.008735894225537777,
        -0.009790787473320961,
        0.09472912549972534,
        0.051571667194366455,
        -0.06510647386312485,
        -0.039757341146469116,
        0.056489504873752594,
        -0.015257028862833977,
        0.05845804512500763,
        0.046141427010297775,
        -0.06696020066738129,
        -0.02322450466454029,
        0.11248648911714554
    ]
}