{
    "id": "8mRJwyoVy_A",
    "title": "M2 vs. M1: MacBook Pro review",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-06-23T14:00:09Z",
    "video_url": "https://www.youtube.com/watch?v=8mRJwyoVy_A",
    "category": "Science & Technology",
    "tags": [
        "m2 macbook pro",
        "macbook pro",
        "macbook pro m2",
        "macbook pro 2022",
        "macbook pro 13 inch",
        "macbook pro 13 inch m1",
        "macbook pro 13 vs 14",
        "m2 macbook air",
        "macbook air m2",
        "m2 macbook air vs m2 macbook pro",
        "apple",
        "wwdc 2022",
        "best laptop 2022",
        "best laptop",
        "best laptop for students",
        "tech",
        "review",
        "the verge"
    ],
    "views": 258781,
    "likes": 6073,
    "comments_count": 341,
    "description": "Apple has updated its 13-inch 2020 MacBook Pro with its new M2 processor. Its an improvement over the older M1 chip, especially in single-core performance. But the M2 will also power Apples cheaper MacBook Air, which will have a brand-new design and a host of other benefits. Heres what weve seen from the M2 so far  but until we see the MacBook Air, its hard to say whether its worth the money.   If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:   You can get the MacBook Pro here:   Read the review here:    Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "http://bit.ly/2TQsqjB",
        "https://bit.ly/3N9R6eU",
        "https://bit.ly/3bq9WkV",
        "http://goo.gl/G5RXGs​",
        "https://goo.gl/2P1aGc​",
        "https://goo.gl/XTWX61​",
        "https://goo.gl/7ZeLvX​",
        "http://apple.co/3kH4uup",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts​",
        "http://www.theverge.com​",
        "http://bit.ly/2D0hlAv​",
        "https://bit.ly/2xQXYJr​"
    ],
    "transcript": "- Apple has released a new MacBook Pro and it's a game changer. (gentle music) I think it's going to transform the tech industry: revolutionize our concept of a laptop as we know it. I'm just kidding. The new MacBook Pro is exactly the same as the previous MacBook Pro. Look at this screen. Look at this keyboard. There's even a touch bar. They literally didn't change anything that is on the outside. On the inside, there are a couple of differences. Specifically, there's now a 24 gigabyte memory option, increased memory bandwidth. The headphone jack now supports a few more types of headphone. The charger is a little bit more powerful. Oh! And there's a new processor. The M2 which is the M1 but with a couple additional GPU cores and Apple claims some other performance improvements. So models of the 13-inch M2 MacBook Pro start at 1,299 for an eight core CPU and 10 core GPU, eight gigabytes of unified memory, and 256 gigabytes of storage. This review unit is 1,899 for the 10 core GPU, 16 gigabytes of unified memory, and one terabyte of storage. It is significantly cheaper than a 14-inch MacBook Pro with the more powerful M1 Pro inside. That device has at minimum a 14 core GPU, and it would cost 2,199 for comparable specs. The 14-inch Pro is an incredible laptop but it's going to cost more money than a lot of folks want to pay. So since the M1 and the M2 versions of the 13-inch MacBook Pro are the same in almost every other way. The question for me as a reviewer is pretty simple: how much better is the M2 than the M1? To answer this question, I know some of you will want to see benchmarks. We did run a bunch of those, and I will spoil a surprise for you because it's not really a surprise. The processor is about as much of an improvement over the M1 as we expected it to be, that is, the CPU results are somewhat better. The GP results are in some cases substantially better, but these numbers are not going to be useful for everyone, and I don't expect they'll be particularly useful to this MacBook's target demographic. The reality is that the M1 was already really good, and while many professionals do care about performance gains beyond that point, someone like me might not necessarily. So I also tried all kinds of tasks from my daily workload on the M2 MacBook and the M1 MacBook side by side to figure out how big of a difference someone like me might actually expect to see. The services that I use most often during my workday without exception are Google Docs and Google Sheets. I'm generally using Intel machines at work, and I often run into slow down when I'm working in big files. So using the two side by side, the M2 was actually a lot faster, like a few seconds faster to open up a 350 page Google Doc. That was the most in your face improvement I saw during this testing. My spreadsheets with hundreds of rows were also noticeably faster to scroll through on the M2, and the newer MacBook was also quicker to swap between tabs and run calculations. Again, it's not like the M1 is slow, but I did see a difference here. Gaming is another area where I saw a significant difference, which makes sense since the M2 has more GPU cores. The previous MacBook ran \"Shadow of the Tomb Raider\" at an average of 20 frames per second, while the M2 device averaged 29 frames per second, which is close to a 50% increase. That is the sort of difference I noticed while I was watching the benchmarks run. I don't expect most MacBook shoppers to be running AAA Games on them all the time, but these results do speak to the extent of the improvements that Apple has made. But those were the only two tasks where I really saw a difference in my workload. When I was playing around in Swift Playgrounds 4, which is Apple's fun little program where you can practice coding, the M2 was a smidge faster to load some new interfaces, but they were both fine. And when making an image black and white in Photoshop and adding a lens flare, which is just a thing I do with photos sometimes, please don't judge me, my editing experiences on the two MacBooks were literally identical. Lightroom: same deal. I used Audition to add some CPU heavy effects to an audio clip, and the M2 was very, very slightly faster to complete them, but everything else like playback and hopping through the track, that was exactly the same. The M2 did beat the M1 on the Puget Systems benchmark for Premiere Pro, but that didn't translate to our real world export test where we didn't see a sizable difference in export time. Premiere can be weird about those sorts of things though, so that's hard to conclude too much from. I will also report that the MacBook was able to sustain these heavy loads for long periods of time. Its 30 minute Cinebench score was actually a bit higher than its 10 minute Cinebench score, which is not something you see all that often. Results were also the same regardless of whether the device was on power or battery, which you never see with Windows laptops. And I never heard the fans, not even when I was running games or Cinebench. Now, this was all true of the M1 device as well. I'm just letting you know that none of that has gone away or gotten worse with the M2, which is certainly good. Now, I can already hear you all in the comments section, \"But what about professional video editors? What about VFX people, and engineers, and architects?\" I'm going to address that very clearly. If you are one of those people, you should be buying the 14-inch MacBook Pro with the M1 Pro or M1 Max. That device is a bit more expensive than this one, but the types of stuff that you folks are doing will be hugely impacted by the M1 Pro's extra GPU cores. The 14-incher has displayed significant gains in things like export time and playback speed compared to what this 13-incher can achieve. Now, these results would make it easy for me to tell you that the M2 MacBook Pro isn't too much better than the M1 if it weren't for the battery life. This M2 MacBook Pro does not die. I have never said this about a laptop before: I was not able to run this device's battery down during my testing period. From the results I am seeing, I would expect it to last around 17 and a half hours which is not actually too far from the 20 hours Apple promised in its Keynote. Remember, I'm being somewhat hard on this thing. I've been Photoshopping, I've been Auditioning, I've been Lightrooming, and even Tomb Raidering at various points, and I'm still consistently seeing over half the battery left after eight to nine hours of consistent use. That is longer than we saw from the M1 Pro models, and it is much longer than we saw from the M1 MacBook Pro. That is a category topping lifespan, and it means that a lot of people will likely be able to use the thing for a couple days without touching the charger. While not everyone needs a laptop that will last that long, there certainly are people for whom those eight hours alone are worth paying for. So, at the end of the day, there are two questions I need to answer for you about the M2 MacBook Pro. First, is the M2 better than the M1? The answer is yes, and on GPU benchmarks, it's a big yes. But the M1 was already so fast that many workloads probably don't need more. And, second, should you buy it? The answer to that is pretty much the same as it was for the M1 model: I actually think the most plausible audience for this laptop is people like me. It's people who don't need the 14-inch model and probably can't afford the 14-inch model, but who do need a machine that can do things here and there in Photoshop, Lightroom, and the like. I think this is a good model for us, and the battery life is a huge factor, but, there is one thing worth considering before you put in your order: the new MacBook Air. There is an M2 powered MacBook Air coming soon with similar performance as well as all kinds of other benefits: to better webcam, a better keyboard, MagSafe, and a whole new design. If you can wait, I'd suggest you wait. We will need to sort out who should buy the Air and who should buy the Pro once we've gotten our hands on that. So, good luck with that, future Monica. In the meantime, if you're able to wait and see what the new M2 Air is going to bring, it's probably worth waiting. Can I just say one more thing? It is so frustrating that Apple has one computer called the MacBook M1 Pro and a processor called the M1 Pro, but the M1 MacBook Pro doesn't have the M1 Pro in it. The M1 Pro is in a totally other laptop called the M1 MacBook Pro, and Apple, what are we doing here? What are we doing?",
    "transcript_keywords": [
        "MacBook Pro",
        "Pro",
        "MacBook",
        "previous MacBook Pro",
        "GPU",
        "GPU cores",
        "core GPU",
        "MacBook Pro start",
        "Pro extra GPU",
        "Apple",
        "MacBook Air",
        "difference",
        "Pro models",
        "Premiere Pro",
        "laptop",
        "results",
        "device",
        "people",
        "Air",
        "thing"
    ],
    "transcript_entity_values": [
        "M2",
        "13-incher",
        "Premiere Pro",
        "Monica",
        "Shadow of the Tomb Raider",
        "17 and a half hours",
        "Air",
        "AAA Games",
        "the end of the day",
        "CPU",
        "the MacBook M1 Pro",
        "20",
        "MagSafe",
        "Google Sheets",
        "10 minute",
        "Lightrooming",
        "a couple days",
        "jack",
        "29",
        "50%",
        "over half",
        "Photoshop",
        "Keynote",
        "M1 MacBook Pro",
        "webcam",
        "the M1 Pro",
        "Cinebench",
        "2,199",
        "M1",
        "hundreds",
        "1,899",
        "GPU",
        "eight gigabytes",
        "the M1 Pro",
        "M1 Max",
        "the M1 MacBook Pro",
        "MacBook Pro",
        "Photoshop",
        "VFX",
        "MacBook Air",
        "MacBook",
        "MacBook",
        "Tomb Raidering",
        "30 minute",
        "M2",
        "350",
        "a few seconds",
        "10",
        "Google Doc",
        "Auditioning",
        "256 gigabytes",
        "one terabyte",
        "MacBooks",
        "Audition",
        "14-inch",
        "M2",
        "M2 MacBook Pro",
        "Lightroom",
        "Puget Systems",
        "The M1 Pro",
        "M2 Air",
        "eight to nine hours",
        "second",
        "Intel",
        "M1 MacBook",
        "First",
        "16 gigabytes",
        "one",
        "Apple",
        "Cinebench",
        "14",
        "Swift Playgrounds 4",
        "eight",
        "MacBook",
        "two",
        "1,299",
        "M1 Pro",
        "MacBook Air",
        "eight hours",
        "13-inch",
        "Google Docs",
        "the M1 Pro's",
        "GP",
        "24 gigabyte",
        "the 20 hours"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "LAW",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "FAC",
        "PERSON",
        "TIME",
        "NORP",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "PRODUCT",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "TIME",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "TIME"
    ],
    "vector": [
        -0.02805515192449093,
        -0.04658525809645653,
        0.03447214514017105,
        -0.036047279834747314,
        0.09021974354982376,
        -0.016308577731251717,
        -0.07734297215938568,
        0.029919853433966637,
        -0.021791817620396614,
        0.027774088084697723,
        0.0288811307400465,
        0.0795932412147522,
        0.03879883885383606,
        -0.08625970035791397,
        0.08250556886196136,
        0.05692490190267563,
        0.14559759199619293,
        -0.10286962240934372,
        0.032025840133428574,
        0.02113928273320198,
        -0.01889183558523655,
        -0.005028381943702698,
        -0.0048184264451265335,
        0.00835590623319149,
        0.008678262121975422,
        0.01175832562148571,
        0.04795707389712334,
        0.010580968111753464,
        -0.06467904895544052,
        -0.038763951510190964,
        -0.005539295729249716,
        0.07817703485488892,
        0.03723762929439545,
        -0.0002570725046098232,
        0.031159916892647743,
        -0.09817063063383102,
        0.09059444069862366,
        -0.04201880842447281,
        -0.053794015198946,
        -0.13234436511993408,
        -0.05769834294915199,
        -0.04159221798181534,
        0.08363994210958481,
        -0.002259720116853714,
        0.05154942348599434,
        -0.002884214511141181,
        0.04082928225398064,
        -0.04363579303026199,
        0.00037022639298811555,
        0.035080745816230774,
        0.015235726721584797,
        -0.1455046832561493,
        -0.014732874929904938,
        0.008994786068797112,
        -0.019393764436244965,
        0.056377340108156204,
        -0.0034860665909945965,
        -0.02310972288250923,
        0.02985529601573944,
        0.011990964412689209,
        0.01556552667170763,
        -0.10759392380714417,
        -0.029566822573542595,
        0.03096877969801426,
        0.04335689917206764,
        -0.07352422177791595,
        0.03370249643921852,
        -0.04376545548439026,
        -0.024335578083992004,
        0.030639000236988068,
        0.0627637654542923,
        -0.04897378757596016,
        0.05503532662987709,
        0.03481687605381012,
        -0.042815644294023514,
        -0.007509476039558649,
        0.024540942162275314,
        -0.028703598305583,
        0.01469020452350378,
        0.04781122878193855,
        0.02456088922917843,
        0.02683677338063717,
        -0.018520699813961983,
        -0.053734004497528076,
        -0.003222627332434058,
        -0.07617304474115372,
        -0.01977708749473095,
        -0.02156647853553295,
        -0.06582880020141602,
        0.0025499535258859396,
        0.020546935498714447,
        0.051919858902692795,
        0.020136211067438126,
        0.027731651440262794,
        -0.00044392564450390637,
        -0.03591693937778473,
        -0.04044567421078682,
        -0.018225613981485367,
        0.016297820955514908,
        0.0140634560957551,
        0.017153581604361534,
        0.09646805375814438,
        0.06977497786283493,
        -0.08958382904529572,
        -0.011155742220580578,
        -0.021477079018950462,
        0.0379737950861454,
        0.08112592995166779,
        0.04909169301390648,
        0.06317916512489319,
        0.03153388947248459,
        0.02178020589053631,
        -0.05006687343120575,
        0.03431122004985809,
        0.05347723513841629,
        2.577853410912212e-05,
        0.021344924345612526,
        -0.008383121341466904,
        0.08836943656206131,
        0.09270384162664413,
        0.010016301646828651,
        0.019513476639986038,
        0.014903346076607704,
        -0.04743938520550728,
        -0.029636496677994728,
        0.036996662616729736,
        -0.12032312899827957,
        -2.866158571427984e-35,
        0.0008130391361191869,
        0.07862473279237747,
        -0.0342981331050396,
        -0.06046159937977791,
        0.04367069900035858,
        -0.0343157984316349,
        0.04304774850606918,
        0.0004909448907710612,
        0.020337438210844994,
        0.01456892304122448,
        -0.09964720159769058,
        0.011722908355295658,
        -0.0647294893860817,
        0.02930486761033535,
        0.057561375200748444,
        -0.11108610033988953,
        -0.04023977369070053,
        -0.03348575532436371,
        -0.0406869538128376,
        0.02661500871181488,
        0.03134407103061676,
        0.020503699779510498,
        0.003442672546952963,
        -0.04215355962514877,
        0.014043159782886505,
        0.018134893849492073,
        0.0580618642270565,
        -0.0202528964728117,
        0.0523497574031353,
        0.043728746473789215,
        -0.08111029118299484,
        -0.023951731622219086,
        -0.05644452944397926,
        -0.0997650995850563,
        -0.04929875209927559,
        0.0041846767999231815,
        -0.017722968012094498,
        -0.10711532086133957,
        0.02483305335044861,
        -0.07064980268478394,
        -0.1111852303147316,
        0.06114890053868294,
        -0.09562286734580994,
        -0.038038283586502075,
        0.028449509292840958,
        0.03826785460114479,
        -0.013171848841011524,
        0.006405484862625599,
        0.018245048820972443,
        -0.046635840088129044,
        -0.0370868556201458,
        0.0011041165562346578,
        0.01325571071356535,
        0.012859869748353958,
        -0.02244430221617222,
        0.01744196191430092,
        0.034723665565252304,
        -0.006576553452759981,
        0.09166138619184494,
        0.031777482479810715,
        0.022191572934389114,
        0.013212095946073532,
        -0.005928779486566782,
        0.07470134645700455,
        -0.0644959807395935,
        0.1214853823184967,
        0.09068164229393005,
        0.039632368832826614,
        -0.06302950531244278,
        0.028257478028535843,
        -0.05786968395113945,
        -0.05785173177719116,
        0.007289308123290539,
        -0.061287056654691696,
        -0.0023260670714080334,
        -0.05391175299882889,
        -0.07496330887079239,
        0.00618828134611249,
        -0.020074818283319473,
        0.03030417673289776,
        0.009654599241912365,
        0.02397201769053936,
        0.0050631193444132805,
        -0.021516194567084312,
        -0.013082998804748058,
        0.09452992677688599,
        0.05927916616201401,
        0.004737612325698137,
        0.017695430666208267,
        0.03153194487094879,
        0.008671046234667301,
        0.04810500890016556,
        -0.015283290296792984,
        0.08187535405158997,
        -0.027716999873518944,
        -7.981670008575681e-34,
        -0.009675417095422745,
        -0.007919885218143463,
        0.005718583706766367,
        0.11095645278692245,
        -0.06697148084640503,
        -0.03675443306565285,
        0.004284518305212259,
        0.014824475161731243,
        -0.09590659290552139,
        -0.041153017431497574,
        -0.03743536397814751,
        0.045163679867982864,
        0.007767749484628439,
        0.0031084564980119467,
        0.027546552941203117,
        -0.05695641040802002,
        -0.03471042960882187,
        -0.10517079383134842,
        0.04040409252047539,
        -0.059796493500471115,
        0.08999072015285492,
        -0.00021476109395734966,
        0.010964374989271164,
        -0.06224950775504112,
        -0.029427217319607735,
        -0.0185106098651886,
        -0.04381928592920303,
        0.0342741385102272,
        0.01471642404794693,
        -0.011889434419572353,
        0.016181228682398796,
        0.027903852984309196,
        0.028962334617972374,
        -0.01745712012052536,
        0.06519559025764465,
        0.03754813224077225,
        0.0011884602718055248,
        -0.03420044854283333,
        0.01951652206480503,
        0.020220406353473663,
        0.052991244941949844,
        -0.010275086387991905,
        0.0017330419505015016,
        -0.05868244916200638,
        0.017555177211761475,
        0.020760493353009224,
        0.0065318220295012,
        -0.04160674661397934,
        0.09038139879703522,
        -0.11737210303544998,
        -0.008350585587322712,
        0.01739455759525299,
        0.0043000164441764355,
        -0.022942662239074707,
        -0.01611660234630108,
        -0.08002406358718872,
        -0.07663325220346451,
        0.011630969122052193,
        0.0351121760904789,
        0.01159491017460823,
        0.01996379904448986,
        0.01653573289513588,
        -0.022333402186632156,
        -0.04997868463397026,
        0.0023829226847738028,
        0.06269192695617676,
        0.038606904447078705,
        -0.03147045895457268,
        -0.013285884633660316,
        0.055924952030181885,
        -0.017771193757653236,
        -0.004824100062251091,
        -0.04111828655004501,
        -0.04430712014436722,
        -0.04494227096438408,
        0.07453248649835587,
        0.05072431266307831,
        -0.05917889252305031,
        -0.10373631864786148,
        -0.012675085105001926,
        -0.01098915096372366,
        0.018887612968683243,
        0.009026349522173405,
        -0.0023825913667678833,
        0.0020024054683744907,
        0.007585616782307625,
        0.030075453221797943,
        -0.029513435438275337,
        -0.10410192608833313,
        0.03997441753745079,
        -0.07018522173166275,
        -0.02379004657268524,
        -0.09210361540317535,
        -0.03423689305782318,
        -0.07995696365833282,
        -4.641020012741137e-08,
        -0.025363607332110405,
        -0.04618583619594574,
        0.07763636857271194,
        0.06818066537380219,
        0.015429428778588772,
        -0.016900695860385895,
        -0.009566978551447392,
        -0.00024741367087699473,
        0.12992987036705017,
        0.07177563011646271,
        0.0806349590420723,
        -0.11730983853340149,
        -0.05418850854039192,
        0.0254790298640728,
        0.03206651657819748,
        0.07986932247877121,
        -0.03163941204547882,
        0.012655398808419704,
        0.001693105325102806,
        0.004880519583821297,
        0.03123422898352146,
        0.07142970710992813,
        0.07939393818378448,
        -0.014110577292740345,
        0.006691660266369581,
        0.05482643097639084,
        -0.06972614675760269,
        0.04205576702952385,
        0.01448828261345625,
        0.04623905569314957,
        -0.11813914030790329,
        0.02685924805700779,
        0.03148943930864334,
        0.011981994844973087,
        -0.03501863405108452,
        -0.09997239708900452,
        0.014710746705532074,
        0.07982561737298965,
        0.06632550805807114,
        0.018361184746026993,
        -0.005279324948787689,
        -0.08701165020465851,
        -0.07282254099845886,
        -0.009396946057677269,
        -0.018967939540743828,
        -0.02238411456346512,
        -0.04778901860117912,
        -0.04695146158337593,
        -0.07950029522180557,
        0.08405200392007828,
        0.05054367706179619,
        -0.007171712350100279,
        0.06582871824502945,
        0.05680317431688309,
        0.00452516321092844,
        0.06629335880279541,
        -0.007034379988908768,
        -0.007722587790340185,
        -0.04504866525530815,
        0.04375937208533287,
        0.13861368596553802,
        -0.14927366375923157,
        0.017257336527109146,
        0.05963525176048279
    ]
}