{
    "id": "8PTjPzw9VhY",
    "title": "This goofy fridge has a really clever design. It's also kinda terrible.",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2023-06-26T14:34:13Z",
    "video_url": "https://www.youtube.com/watch?v=8PTjPzw9VhY",
    "category": "Science & Technology",
    "tags": [],
    "views": 3337744,
    "likes": 91546,
    "comments_count": 10458,
    "description": "Seriously. Sometimes it's not worth having so much information.  Here's that video I mentioned of Big Clive's:   Technology Connextras (my second channel where stuff goes sometimes)   Technology Connections on Mastodon:   This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!   00:00 Intro / A Story 02:01 The basics of a fridge 05:32 Auto-defrost and the complexity of modern refrigerators 07:53 The little red fridge is cleverly simple 13:29 It's not perfect, though 16:53 But... how bad is it? 19:42 Test 1: How quickly can it cool things down? 24:58 Some unexpected weirdness 28:59 Test 2: How uniform are the temperatures inside? 32:18 Attempts to make it better with fans 39:44 Figuring out the thermostat and its weirdness 47:06 Replacing the thermostat with something better 50:19 A note on compressors, the oil in them, and upright operation 52:47 A repeat of Test 1 and improved results 59:58 Why I was bothering with all this 1:02:31 Bloops",
    "description_links": [
        "https://www.youtube.com/watch?v=oZTfYqgYExY",
        "https://www.youtube.com/@TechnologyConnextras",
        "https://mas.to/@TechConnectify",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "An hour-long video on a fridge, huh? Yup. And it starts with a story. Early last year I moved into a new home, and due to a miscommunication about an appliance package and the timing of its delivery, as well as the various supply chain issues that were all the rage back then, the fridge that I had already paid for wouldnt get delivered for an indeterminate period of time. And I got a really good deal on it, so I was happy to wait. But since I happen to be of the mind that a refrigerator is a pretty essential part of a home, I went out to the store with the intent of buying a basic mini fridge to tide me over. But, thanks again to everything still being all wonky, a really basic mini-fridge was like $200 and for another $150 I could get this silly thing. So I did! And Im glad I did! This fr - okay this isnt gonna work. [struggling noises] [noises intensify] Ok, its on the floor. I ended up needing to use this as my kitchen fridge for about six months. While its a bit on the small side, its much bigger than a typical mini-fridge and served me well as a decently competent refrigerator. Yet, Ive also become completely exasperated with this red... iculous fridge. Not because it stopped working or anything - its still working fine, and I suspect it will for years to come. That was going to be the point of this video. The design of this fridge is really clever and about as simple as you could possibly make it. But in an attempt to correct what I thought were fairly minor flaws, its been taunting me with unforeseen nuances and complexities. And now I invite you to come along as I retrace my steps and arrive upon the single modification that I can make to turn this from a C+ fridge into a fridge worthy of a B, probably. Ill begin with my original video premise. this fridge was clearly designed with the following question in mind: how simply (and, lets be honest, cheaply) can you build an upright fridge and freezer to modern sensibilities? These days, we expect a refrigerator to have two compartments at very different temperatures, and we expect it to just sit there and refrigerate for years at a time without any effort on our part. However, meeting those two requirements involves more complexity than you might imagine, and that increases the cost of the fridge while also making it more prone to issues down the road. To understand why, first we need to understand what makes a fridge a fridge. A fridge is really just an insulated box that you can put stuff in which can remove heat energy from its interior and reject it to the surrounding air, thus keeping the boxs insides at a consistently cold temperature. Usually this is done with a small vapor-compression based heat pump. Now, you know I love a good heat pump, and the Refrigeration Cycle Powered by the Latent Heat of Vaporization is very much my jam, but Ill keep it brief for once and just say theres a compressor that pumps a chemical refrigerant around a circuit with two locations at different pressures. By strategically controlling the pressure the refrigerant experiences, we can force it to absorb energy in one location and release it in another. In practical terms, one part of the circuit gets cold and the other part gets hot. So, just put the cold part inside the box and the hot part outside the box, right? Well, yes! And the earliest refrigerators were literally just that. The classic monitor-top fridges from General Electric were effectively just an old-fashioned ice box with a small refrigeration system quite literally bolted on top. Inside the box was the evaporator which absorbed heat energy and got cold, and up top was the compressor and condenser, the latter of which rejected the previously absorbed heat to the outside air, getting warm in the process. This is pretty much the simplest fridge design possible. Just a box with a thing inside the box that gets cold when the compressor runs. Use a thermostat to switch the compressor on and off based on the temperature inside the box and congratulations! You just built a fridge. For best results, make sure you put the cold part at the top of the box so that, as it chills the surrounding air, that air gets more dense, sinks to the bottom and mixes it around real good. Oh! And if you make the shape of the thing that gets cold into a little compartment that mostly separates the air inside from the rest of the fridge, it will stay so cold inside of there that you can make ice cubes! This design may be basic, but plenty of mini-fridges are on the market today that are essentially this exact design so hey - it works. But as years went by, we wanted more. The arrival of frozen foods in grocery stores meant the freezer compartments duties expanded beyond ice cubes and it had to get bigger. At first, it simply got wider. Eventually it got so wide that it took up the entire width of the top of your fridge. And before long wed give it its own door and separate it from the fridge compartment. And at that point we had settled into the form factor of the modern fridge. It hadnt really gotten any more complex, we just moved stuff around a bit and made it more convenient to use. But theres a wrinkle. Water in the air condenses on cold things. And because a refrigerators evaporator gets so cold that you can make ice cubes, that wet water turns to the solid kind and ice builds up on the evaporator with time. In ye-olden days, and in fact to this day with many mini-fridges and chest freezers, this was just a thing you had to deal with. Every once and a while youd empty out your fridge, shut it off, leave the door open, and let that ice melt. Or maybe stick a pot of boiling water in there and shut the door if ya want to speed it up. We humans are clever, though, so we started incorporating electric heaters that wrapped around the evaporator to do the defrosting for us. With the help of a timer, the refrigerator would periodically stop refrigerating and switch on that heater to melt any ice buildup. A drain pan would direct that melted water to a holding area of some sort where it could evaporate to surrounding air, sometimes with the aid of a second heater. After either a predetermined period of time or with the help of a defrost termination sensor, it would shut off those heaters and get back to refrigerating. And now, defrosting was a thing of the past. But automatic defrost added complexity and that came with costs: first, cost. Thats more parts you have to put into a fridge, more wires to run to those more parts, and more time to spend paying people to run those more wires to those more parts, all of which is expensive. And secondly, reliability. Thats more stuff which can go wrong and as the great Murphy taught us, anything that can go wrong will go wrong. Faulty defrost timers, burnt out heaters, and clogged up drain lines are some of the most common ways modern refrigerators break down. And of course we just couldnt help ourselves and we kept on adding more and more complexity - now we like to put the freezer compartment below the fridge or to its side, and that means we need fans to move air between the two compartments. The condenser often has its own fan, too, which allows us to put fridges in tight, quasi-built-in spaces. Weve moved away from mostly mechanical thermostats and defrost timers to microcontrollers and sensors and relays, and now... we stick TVs in them and WiFi. For reasons. But then, theres this little red fridge. Its decided to reject modernity and embrace tradition, and not just in its retro styling. Youll find absolutely none of that modern complexity here. In fact, there are only four components to this fridge. Half of which are the door switch and the 10W incandescent light bulb. As far as what makes it refrigerate, theres a mechanical thermostat which controls whether the compressor runs or not, the compressor itself, and thats it. Theres no fans. Theres no sensors. Theres no defrost heaters or timers. Theres no WiFi or Bluetooth, its just a single refrigeration circuit and a thermostat and thats it. I love it. But hold on a sec. Where is the evaporator? Looking inside we find nothing that looks like a thing that gets cold. Its just a bunch of white plastic walls and glass shelves. Same goes for the freezer compartment. And heres a puzzler: this freezer compartment is entirely separated from the fridge. Theres no pass-through for air to travel between, its just a big tub of nothing. Come to think of it, wheres the condenser? This is a refrigerator, it has a compressor, there has to be a part that gets warm and a part that gets cold. Where are those parts? And how can it be maintaining two different temperatures in two different compartments with a single thermostat and a single refrigeration circuit? Well, it turns out that this thing is built like a chest freezer. When the compressor is running, it squeezes gaseous refrigerant into a long snake of a tube that travels up and down and up and down the sides of the fridge body, directly beneath its plastic skin. Since its under high-pressure inside that tube, the refrigerants boiling point has increased and it wants to condense into a liquid. It will slowly but surely give off heat as it condenses, which causes the sides of the fridge to get warm. And eventually that heat is dissipated to the surrounding air. At the end of this serpentine path of tubing, a metering device (most likely a simple capillary tube) restricts the flow of refrigerant, causing liquid refrigerant to bunch up at that spot. The point of that restriction is to create a pressure differential, and once refrigerant manages to make it past there, it finds itself in another long snake of a tube. As before, it goes up and down and up and down beneath the plastic skin of the fridge but this time its beneath the skin on the inside. This right here is the evaporator and when the fridge runs it gets nice and cold because in these tubes the pressure is low and the refrigerant wants to boil (or you might say evaporate). In order to do that, it has to get energy from somewhere, and that somewhere is, well, the insides of the fridge. The upshot is that it gets cold. After running for a while, youll see the back wall start to form a layer of ice. And thats the power of a heat pump! And I said I wouldnt explain heat pumps again. I wonder how many of you just lost a bet. Anyway, the location of this evaporator panel, lets call it, is very strategic. Like those antique GE fridges, its at the top of the compartment so that the air it makes cold will sink to the bottom and mix with the rest. The supports for the shelves are even shaped to prevent them from reaching all the way to the rear. The resulting gap ensures these convection currents arent blocked. Pretty clever. Even cleverer is that the evaporator is self-defrosting. Since this is a vertical surface inside the only mildly-cold fridge compartment, once the thermostat satisfies and the compressor shuts off, that ice buildup will have time to melt into water and simply fall down. It collects in this little sloped drain here and gets dumped into an adorable little pan that the compressor wears as a hat. Why do that? Well, after its been running for a while the compressor gets fairly hot, and that warmth will help encourage the water in the pan to evaporate. And just like that youve made a self-defrosting fridge, no heaters or timers required! Pretty cool, right? But, I hear you asking, what about the freezer? Well, heres where things get even clevererer. This evaporator is too small - on purpose. When liquid refrigerant makes its way into the tube snaking behind the plastic wall here, it does start boiling and absorbing energy. But theres not enough surface area here to allow the refrigerant to completely boil off. After snaking through this flat section, the refrigerant line moves to the freezer compartment where it loops around the circumference multiple times, front to back. This extra long run of piping spread over a large surface area is what actually allows the refrigerant to completely vaporize and absorb all the energy it can before it heads back to the compressor. And thanks to extra thick walls with tons of insulation, this compartment naturally stays much colder than the fridge at true freezer temperatures. Isnt this just so clever? This is an extremely elegant way to make a single refrigeration circuit maintain two very different temperatures in two locations with no moving parts (other than the compressor, of course). I would never have thought that splitting the evaporator into two sections in series like this would work, but it does! There are, however, downsides, of course. When the compressor first kicks on, only the fridge section gets cold. It takes a while for the freezer section to start seeing liquid refrigerant, most likely because at startup the refrigerant lines and walls are so warm that the refrigerant can get all the energy it can possibly absorb from right here. Only once this section is actually cold does the freezer start to see any cooling. Thats not a huge problem, but it means we need fairly long cycle times to ensure the freezer works properly. However, they were clever enough to make sure that the front of the freezer gets that cooling first, helping ensure areas near to the vulnerable door seal get chilled immediately. Still, I would imagine that having the correct refrigerant charge in here is pretty critical for proper operation. Theres actually very little refrigerant in this system, barely over an ounce of R600a which, fun fact, is explosive! Yay! Im not planning on setting fire to it so I dont really mind, and besides theres hardly any in there, but with such a miniscule charge, I can only imagine that the tiniest leak is going to cause enough capacity loss to where the freezer section basically just doesnt work anymore. Also, in case you hadnt already guessed, this fridge only gets to claim partial automatic defrost. The freezer compartment does build up an ice layer on the walls with time. In my experience this was pretty minimal, however I was using this fridge from January to June and so the bulk of its use was in the cooler, drier parts of the year. Although, because the refrigerant lines are behind plastic walls, you can use a plastic ice scraper without doing any damage, and in fact it even came with a little one for this purpose! Plus, you can leave the fridge running and maintaining proper temps while you defrost the freezer section, so thats a nice bonus. Lastly, because theres only one thermostat and its in the fridge compartment, the freezer wont react to changes such as, oh I dont know, putting literally anything in it. Its much more of a keeps things frozen compartment than it is a makes things frozen one. Thats not necessarily bad, but you do need to keep it in mind. It will freeze things such as a reusable ice pack or anything you might want to put in the freezer to preserve it indefinitely but its gonna take a very long time freeze solid and, if what you put in there is large enough, other things in the freezer will be affected as the average temperature goes up. But hey, its better than no freezer at all. Now, I should note that its not like this is a totally unique fridge. Plenty of mini-fridges with separate fridge and freezer doors appear to use this split-evaporator design, but this is the first time Ive encountered it and I love it! Chest freezers have a reputation of lasting forever, and I think this is largely from the fact that theyre so darn simple and theres hardly anything to break. Assuming this fella was put together correctly, which judging by some of the corrosion around these braze joints Im not super convinced is the case but assuming they hold up and it doesnt leak, this could also just keep going and going for decades to come. But just because somethings clever doesnt necessarily mean its good. When I was using it as my main fridge, I had a fridge thermometer hanging from this shelf on the door to make sure it stayed within food-safe temperature. And I'm happy to report that it did. But... barely. It was clear that its refrigeration circuit is adequate at best - just putting in the mildly warm leftovers in a casserole dish would elevate the temperature beyond safe limits for an hour or two. I mean, the compressor is an adorable little thing and somehow thats gotta cool down a fairly large fridge so that wasnt much of a surprise. But it was still concerning. I wanted to know for sure just how bad (or maybe good) this fridge is at being a fridge, so I needed to test it somehow. Actually, I wanted to test two specific things: first, how long does it take to cool down a large quantity of stuff? And second, how uniform are the temperatures inside the fridge? My experience with it gave me low hopes for its ability to chill things quickly, and with the evaporator being at the very back, I suspected there would be a pretty severe temperature gradient inside. But I couldnt really get a sense of how uniform the temperatures inside were with a single thermometer, and monitoring its temperature manually would be pretty annoying. So I bought five of these things. These are temperature data loggers. Theyre actually quite neat - powered by a coin cell battery, theyll take temperature readings periodically and store them in memory. You can choose how often you want them to take a reading, and even if you want a reading every minute they have enough memory to last several weeks. Then, you just plug em into a USB port and use their provided software to grab the data. Now, theyre not claiming to be the most accurate things out there but they all agree with each other within a few tenths of a degree Fahrenheit, and since I really just want to make comparisons, thats good enough for me. Note that because they have thick plastic cases they dont react that quickly to changes in temperature, but for the purposes of monitoring the performance of a fridge, thats not really a problem. Oh, and just as a programming note, yes, Im using Fahrenheit, thats how my brain works. Theyre just numbers, they cant hurt you, but Ill put conversions up when it makes sense. And here, folks, is where things started unraveling. I thought this would be a simple affair. It was not. I did get the results I wanted, and they were conclusive enough. But this opened up a can of worms from which I have yet to completely escape. And now, Im dragging you in with me! The first test I devised was to take 48 warm cans of soda and/or sparkle water, load em up in the fridge, and see what happens. Id also do this with a, lets call it, more serious fridge. As a matter of fact, I tested two other fridges: a relatively basic KitchenAid from 2022 (thats the fridge I was waiting on for my new home), and a Samsung Twin Cool model from 2012 (which is the fridge I have here at the studio). I started here at the Studio. I put the temperature probes in different locations throughout the fridge, and I started logging at the same time I put in all those cans. We can see that the fridge was able to maintain temperature just fine. We can tell all those warm cans did slightly influence the air temperature inside, but only by a few degrees. Whatever else was in the fridge would have stayed cold. I also want to point out that, even though I had the probes in various locations throughout the fridge, they all read very similar temperatures throughout the test. Going by the average temperature metric in the report (which is skewed a bit by the beginning and end but thats the case for all the probes) the interior temperature only varied by about 2 degrees Fahrenheit. Then I did the test again at home. This time I started logging before I put in the cans, and then I loaded them up. Now, a quick note, the reason the Samsung data and the KitchenAid data look so different is because the Samsung fridge has separate evaporators for the fridge and freezer compartments, and they can operate independently or together. But, they both share the same compressor and condenser, meaning the total cooling capacity is split between them, and that means the rate at which each compartment cools down varies depending on whether the other compartment also wants some cooling at the same time. Thats why the data looks like a mountain range. The KitchenAid, meanwhile, is more old-fashioned with a single evaporator in the freezer and a means to move air between the freezer and fridge compartments so its either running and cooling down or not running and warming back up. Anyway, heres where I loaded up all the cans of water. Honestly I dont know what happened here, I might have put something else in the fridge earlier. Also, yes, this is very cold. Im surprised nothing ever freezes in there. We do see the measured temperature increase slightly as it works to cool down all those cans, but again - its not a lot. In some locations its barely noticeable, and here its a bit more so but still not much. This probe saw this biggest change, and it was placed in one of the shelves of the door. But it only just cracked 38 degrees, and slowly crept back in-line with time. Oh, and again, the temps in here are pretty consistent. Not quite as good as the Samsung fridge, but even in the door were only about 5 degrees warmer than the coldest spots, and just a few degrees above average. For grins and giggles, I placed a probe in the freezer and you absolutely cannot tell when I added the cans. And this huge spike here is from a defrost cycle. But now for what Im sure youve all been waiting for: how does the little red fridge do in this test? Not. Well. In fairness to it, I did this test with the fridge completely empty which was not the case for the other two fridges. But, uh, its so much worse that I assure you that wasnt much of a contributing factor. This probe was placed on the top shelf next to the thermostat, and you can see it maintaining a temperature between 28 and 38 degrees. Thats a pretty wide swing which is a bit concerning, but its really the average that matters and thats 33 degrees. Just above freezing. And heres what happened when I added all that soda. The temperature shot right up to just shy of 50 degrees. Importantly, this probe was not near the cans. This is pretty representative of what the average air temperature was inside the fridge, and it was confirmed by the other probes. All these cans add up to 4 and a half gallons (or about 17 liters) of room temperature water, and thats quite a lot of thermal mass to cool down. The serious fridges manage that just fine but unsurprisingly, the rediculous little fridge with its adorable compressor struggled a lot. Compare the downward slopes between the empty fridge and the full-of-water fridge to get a sense of how hard this is for its itty bitty heat pump. Speaking of itty-bitty, I snuck a probe in the freezer, too! Lets take a look at that data! Given how this fella works with its two-section evaporator, the freezer gets colder whenever the fridge is running. And since at this point the fridge has been running for several hours straight, the freezer is getting COLD. In fact, its apparently bottoming out and -19 is as cold as it can possibly get. Prior to adding all the soda water it was swinging between about -7 and 10 degrees which is just a tad on the high side, but with the fridge completely empty thats not much of a surprise. But I havent shown you the graph beyond this point yet. See, heres where things took a turn for the weird. If this fridge works like any fridge ought to, this line will just keep on going until were back down to 28 degrees. After all, the fridge has a thermostat and the thermostats entire job is to keep its insides at a consistent temperature. And until we put the stuff in, it switched the compressor on at 38 degrees, and switched it off at 28 degrees. But look what happened about five hours into its cooling task. It stopped. We hadnt even gotten down to 42 degrees and the thermostat was satisfied for some reason. And it let it get all the way back up to 46.6 degrees before it decided hmm, we better start cooling again. Something has gone really off-the-rails here. And by the way, this is the best probe. Probe 4, placed in the bottom door shelf, only got down to 46 degrees before the fridge shut off, and got all the way back up to 49.1 degrees before it decided maybe it should start cooling again. These temperatures are well within the temperature danger zone and thats not good. Your fridge should be at 40 degrees Fahrenheit or less. Granted, simply putting all those cans in meant we were in the temperature danger zone for 5 hours which is also not good but the thermostat should not have satisfied this early. If I keep showing you the data, though, youll see that the thermostat kept on shutting the compressor off way too early. But, each time it did it got a little bit colder, and it would kick the compressor back on just a tad earlier than it did the last time. So it was very slowly working to bring the temperature down, but 12 hours after I put the cans in there, it still wasnt back to its original temperature. And in fact was still firmly in the temperature danger zone. Thats not great! And judging by this downward slope, it was still working its way back down. My original plan was to run this test for 24 hours, and thats when I took out the probe. It seemed as though it was approaching a stable condition at this point, but I put a couple of the other probes back in for another 12 hours to confirm. Sure enough, the fridge had stabilized pretty much right at the 24 hour mark. Thats bad enough on its own, but despite not changing the thermostat setting at all, we were now maintaining a significantly higher temperature than we were previously at every measured location. And at this point I broke down and said what is happening? No fridge should have its set point influenced by its contents! Thats just not how refrigerators are supposed to work. Yet this fella, simply though having more stuff in it, has drifted upward by quite a lot. In fact, that probe on the bottom shelf? Yeah, now it was consistently reading in the temperature danger zone and at this point the fridge is officially failing to do its job properly. But thats OK. I mean, no its not OK at all, but really the whole point of this saga was to experiment with ways to improve this fridges performance. The thermostats behavior was definitely puzzling, but I decided to ignore it for now. I thought that perhaps the thermostat was being influenced by the location of all the thermal mass somehow, and if that were the case, then moving onto the thing I really wanted to try and improve could perhaps fix it. And that was internal temperature consistency. Remember how, in the proper fridges, their internal temperature varied by, at most, 5 degrees in my tests? Well, the variance in this little red fridge was unsurprisingly worse. To quantify it, I ran a very long trial with the five probes placed in several different locations and the fridge filled with another 16 candles. I mean cans. I put 7 cans in the middle shelf of the door, as well as a boxed 8 pack down in the crisper drawer (with the 8th pineapple Bubbly can). For this five day test, I put probe 1 right at the back of the top shelf, probe 2 below the thermostat, number 3 right in the corner of the top door shelf, number 4 behind all those cans in the door and right up against the door, and probe number five was all the way at the bottom in the crisper drawer. Those additional 16 cans were added warm at the start of this long trial and, good news here, the fridge handled them a little more elegantly this time. They did still raise the interior temperature slightly, but probably thanks to the thermal mass of all those already-cold cans (as well as the fact that this was a third as many cans as the original torture test) probes 1, 2, and 3 only show a slightly elevated temperature at the beginning. Probes 4 and 5 showed a much higher initial temperature, but I placed them right near those warm cans. But how it handled a few more cans wasnt really the point. I wanted to see how much the temperature varied once it had stabilized out, and, well, its quite a lot. Probe 1 at the back of the fridge near the evaporator averaged right around 32 degrees. Probe two, which was just a few inches ahead of there on the same shelf, averaged 37 degrees. Weve already tied the temperature variance of the KitchenAid fridge and these two probes were almost right next to each other. That bodes well. Probe three averaged about 40 degrees, so were just clinging onto food-safe temperatures on the top door shelf, and probe 4 settled around 38.5 degrees once all those cans had cooled down. And then the crisper drawer, well, yeah that never managed to stay out of the temperature danger zone with an average of about 43 degrees. That means that theres an eleven degree variance between locations inside this fridge, and thats pretty bad. Although, if we exclude the crisper drawer, it improves to an 8 degree variance which isnt terrible, I suppose. A little mindfulness on what goes where would pretty much take care of you. And besides, the crisper drawer is traditionally reserved for gene resequencing experiments I mean vegetables and stuff. So long as you keep it to fresh veggies and other non-temperature-critical stuff it should be fine, and if you only used the top shelf of the door for beverages well then I suppose this fridge is perfectly acceptable. Still, I wanted to make it better. And I know a thing or two about tinkering. Proper refrigerators these days usually benefit from some sort of fan which blows air around the interior. The specifics of that vary a ton depending on the design of the fridge, but a little forced airflow can do a great job of keeping interior temperatures more consistent. A simple fan could, in theory, turn this from an ordinary fridge to a convection fridge. And I can obtain fan. So I did! I got some small 5V fans so I could wire them to a USB plug, stick a big power bank inside the fridge, and run some additional tests. I started with a single 40mm fan that ran at a whole three quarters of a watt. Supposedly it moves about 5 cubic feet per minute, so it should turn over nearly the entire volume of air inside the fridge about once every minute. This style of fan isnt very directional, but I figured thatd be fine - I really just want to churn up the air a little bit. I hot glued it to the top of the fridge and pointed it at the door. That would hopefully move the very cold air near the evaporator towards the door and reduce the temperature gradient from front to back. Heres how that went. This probe was, again, placed on the top shelf near the thermostat. I put the fan and power bank inside the fridge and let it run for 24 hours without turning on the fan. And I put a bunch of stuff in the fridge for this test - lots of soda cans, cheese, condiments, water bottles, a big jar of pickles, and all at various locations to simulate a well-stocked fridge. With all that thermal mass the fridge ran infrequent and long cycles, kicking on once about every three hours. And then I turned on the fan. And what happened was really, really weird. I could tell as soon as I switched the fan on that now the fridge was running for a strangely long time. And it kept running. And running. And running some more. But, that wasnt entirely unexpected - if the fan was doing the job I expected it to do, then the fridge would have to work for a while as all the thermal mass of the door shelves and what was in those shelves brought the average temperature up now that the fan kept moving air from front to back. So at first, I thought this was a good sign! A little after midnight it finally shut off, and I went to bed. The next day, it wasnt running when I first checked on it. Good, I thought, its probably maintaining temperature. It kicked back on a little after 9:00 that morning and I went about my day checking on it every once and a while. At 11:00 it still hadnt shut off. Then noon came and went, then 1 oclock, then 2 oclock and it was still running. I was starting to get pretty worried here - it was probably a bit below freezing inside by now. At 2:40 it still had not stopped running, and by this point I had to take the probes out and look at the data. And heres what it looked like. What. The heck. Is happening? Yes, I put a little fan inside the fridge, key word: little. Just doing that widened the dead-band of the thermostat significantly. Where previously it had been kicking on at 38 degrees and satisfying a hair below freezing, now it wasnt kicking on until the interior reached a bit over 39 degrees and worse it would stay running until we were down to 27 degrees. Thats -2.7 C. Thats weird, but did we at least make the temperatures inside more consistent? Nope! We made it worse! OK, thats not entirely true. If we look at Probe 2, which I placed on the top shelf of the door, we used to be averaging right around 40 degrees like we were before. But adding the fan brought the average down to, like, 37? So thats good I guess. You could now feel safe keeping whatever you wanted up there. But, uh, probe 3 (which was in the doors bottom shelf) got much worse and so did probe 4, the one in the crisper drawer. Yeah. We made the top shelf more consistent, but everywhere else in the fridge got warmer. Perturbed but undeterred, I tried several different fan configurations. Maybe sticking the fan up top, combined with the overlap of the door shelves and the main shelves, was just forming a trapped loop of air recirculation and nothing was actually moving to the bottom of the fridge. So I tried moving the fan, and making it two this time, to the very back of the fridge, right to the little gap between the shelf and the evaporator, pointing downward to hopefully force more airflow to the bottom of the fridge. You only see one in this picture but theres another on the left side. [voiceover] Pardon the interruption but I see now that Ive misremembered this particular test. The fans are indeed pointing upward. I honestly dont think that was my intention - I probably just forgot which side was the intake. Regardless, this configuration cured the weirdly long cycle times, but as far as the overall temperature consistency it had pretty much the same exact effect as the previous test: the top door shelf got colder, but everywhere else got warmer. So, in other words, it didnt work. Still, I tried several more things. I got this giant fan which moves a heckuva lotta air and stuck it up top. That also didnt help. I then tried turning it around to blow onto the evaporator and hopefully sneak some air down through the slots behind the shelves. Not only did that not help, but it also reduced the effectiveness of the freezer most likely because all that forced airflow made the fridge section of the evaporator more effective. The fan also took up a lot of room so that wasnt super great. Uh, maybe using three of the small fans, one at each level, near the back, and pointing forward, would make things better. No. It did not. And as a last-ditch effort, I got one of these blower-style fans. I tried putting it up top and forcing air to the bottom, which didnt help, and I also tried putting it at the bottom and forcing air to the top. Which also didnt help. In this very long data-logging session, all this junk at the front is me trying these different configurations. The big spikes are from me keeping the door open to move things around. I didnt even bother offloading the data from the probes because I could tell no matter what I did there were serious airflow dead-spots. Id try a new arrangement, leave it alone for a half-hour, and check the probes. If the fans were doing what I expected, they should all more or less agree but instead I was reading 32 degrees up top and 43 or 44 down below. That was way worse variance than I had ever seen before, so clearly the fans were hurting and not helping. So, ok, theres more to this whole thermal design thing than I figured. The convection currents made by the sheet of cold, dense air falling to the bottom of the fridge are apparently very delicate and messing with them in even the slightest of ways makes the fridge even worse. Go figure. Now, one last thing to try would be fans on some sort of a timer. Maybe a 60 second blast followed by 10 minutes of stillness would churn up the air enough to mix it around, but not so much to form those apparent dead spots. But honestly, I was getting real sick and tired of these fan experiments, and besides we still had the utterly baffling thermostat to deal with. And boy did the weirdness there not let up. In my test with the really big fan, when I had it pointed at the evaporator the fridge just wouldnt shut off. I even adjusted the thermostat all the way down to 1 and it just kept running... and running... and running with the interior starting to dip well below freezing. At this point, I finally decided to do the thing I should have done ages ago and took the dang thermostat apart to see what the heck was going on there. See, all this time I had assumed the thermostat was, yknow, here. This is the dial, its pretty much halfway between the door and the back wall, so why not just take the reading here? In hindsight, the 10W light bulb that gets nice and hot is a pretty good reason to not put it there but that hadnt occurred to me just yet. Through the gargantuan effort of removing a single screw, I finally discovered that the thermostat has a remote sensing bulb. In other words, the dial may be here but the temperature sensing bit is somewhere else. Its shoved within the walls of the fridge and going down, but I didnt know how far down it went. So I yanked it out. Turns out it went quite far down. The sensing bulb ends up sitting somewhere around here, though without cutting away at the walls I cant know for sure. This felt pretty silly to me - why take such an indirect measurement? The point of a fridge is to keep its insides at a certain temperature, and somewhere inside the walls of the fridge is not quite the same inside as the inside that actually matters. To fix this utterly baffling situation, I drilled a little hole in the thermostat housing so I could poke the sensing bulb out of there and just let it hang in the air. Guess what? This also did not work and broke the fridge in a new and unexpected way! Now, the fridge just wouldnt shut off. Ever. Not even set to the least-cold setting, and not even once the measured air temperature inside was below freezing. I even tried wrapping the sensing bulb in a frozen teriyaki sauce packet, but the fridge just kept on running. Why would that be? Well, I noticed when I pulled out the sensing bulb that the capillary tube connecting it to the thermostat felt extremely cold. Now, its metal so its gonna feel quite cold thanks to its very good thermal conductivity but, like, it was frosting up a bit. That suggested to me that where it lives actually gets colder than the interior of the fridge, likely due to its close proximity to the embedded evaporator lines. And this finally explains all the weirdness I had been seeing. The sensing bulb is almost certainly right up against the plastic lining of the fridge interior so it is influenced by ambient temperatures. After all, putting in all those warm soda cans did cause the fridge to run for five hours straight. But since its capillary tube travels so close to the embedded evaporator lines, its probably getting directly chilled by them when the fridge is running. And, if the thermal conductivity of the capillary tube manages to influence the sensing bulb, then the thermostat will think its colder than it actually is. That alone isnt really a problem. The thermostat could be (and in fact is) calibrated to account for this discrepancy. Thats why it wouldn't shut off when the sensing bulb was directly exposed to air. The real trouble here is that we have a sensing bulb which is sandwiched between the place we actually want to measure and something that gets much too cold after the fridge has been running for a while. With still air and contents that are all down-to-temp we can dial in a thermostat calibration that more or less works. But this balance is extremely delicate, and if we change any variable at all this scheme simply breaks down. For instance, when we look back at the soda test data, we find something puzzling. The fridge had nearly identical cycle times when empty and when full. Prior to adding all the soda, here the fridge ran for around 33 minutes before shutting off. And here, 24 hours after being loaded up with all those cans of sparkle water and mostly stabilized in temp, it again ran for 33 minutes. Thats not normal. It simply shouldnt be behaving like that, and no sensible fridge design would. With more thermal mass inside, it should need to run longer to achieve the same drop in interior temperature. But it doesnt. In fact, it just doesnt bother trying to attain the same drop in temperature at all. You can tell because these spikes are less spiky. Once it managed to get down to about 42 degrees, the fridge settled back into the same relatively fixed on and off cycle that it had when it was empty. And since it wasnt back down to temp yet, it was a dreadfully long slog back down to food-safe temperatures. Oh, right, except we never actually made it back to food safety in some of the probe locations. What seems to be the case is that the thermostat is influenced far more by how long the refrigeration circuit has been running than anything else, likely because the sensing bulb gets cold so much faster than the rest of the fridge does. And with more thermal mass inside the fridge, the temperature rise back up to whatever point the thermostat kicks in at will happen more slowly, so the net result is the more stuff is in the fridge, the less overall time is spent running, which elevates the interior set point. Fantastic. Speaking of fans, the fan experiments likely wreaked havoc on the overall set point because the new airflow patterns, even though they may have been miniscule, kept tipping the balance between the internal chilling effect on the sensing bulb and the fridges actual temperature. More airflow near where the sensing bulb sits would skew its reading towards the actual air temperature and diminish the importance of the internal chilling effect. Also possible was that in the tests where lots of air was blowing on the evaporator, the internal chilling effect itself was diminished as the refrigerant vaporized more completely in the evaporator. But honestly, Im not super confident in those explanations. All I know is adding the fans made really weird stuff happen and its not gonna help. So now what do we do here? This fridge clearly has far more weaknesses than I thought. The temperatures inside arent that uniform despite my best efforts. Its weak little heat pump means that its competence at refrigeration leaves something to be desired. And the thermostat is just awful. I mean, it did OK when it was my only fridge but I wasnt watching it that closely. It could be that every time I put leftovers in there it got way warmer than I realized. Well, the thermostat it came with might not be any good but whos to say we have to keep it? Not me, thats for sure. And for a whole twenty bucks I got this fella here: an honest-to-goodness temperature controller. Yeah it was cheap but its actually pretty decent and features relays that can (supposedly) handle up to 10 amps of current. Which is plenty for this little fridge which normally pulls about 1.2 amps. You simply supply the controller with line voltage, wire whatever load you wish to control across the appropriate switch, and finally wire in the included temperature sensor. Itll do heating or cooling, and you can specify your set point as well as the differential - which is good because, due to how the freezer gets fed refrigerant, it probably needs a fairly wide temperature differential to ensure the freezer actually gets properly cold. All I needed to do now was figure out how to wire this up to the fridge. I figured itd be pretty simple since, ya know, this is a pretty simple fridge and yes indeed it was pretty simple. Under this cover lies the compressor terminals and - surprise! support components! A whole two of em! First we have an overload protection device which will cut power for a minute or two in case the compressor rotor becomes locked up, which might happen if the compressor tries to start with a pressure differential in the system which might happen due to a brief power interruption. And then we have a PTC motor starting device which upon power-up briefly allows current through the compressors start winding to get it started. Big Clive did a video on these things in case you want to learn more about what it does. But anyway, thats it. These two support components, the compressor itself, and the thermostat are literally the only four electrical devices in the entire fridge (and if we count the light bulb and door switch, we have a whopping six). To get this working, I just needed to bypass the existing mechanical thermostat and send power through here instead. After a quick look at the amazingly included schematic on the back of the fridge, it appeared that live, ground, and neutral were sent up into the fridge to power the light, and the thermostat just sent power back down to the compressor on the red wire whenever it called for cooling. After a sanity check with an ohmmeter to confirm this is what happens, it was a simple matter of cutting and taping off that red wire, then running a new hot wire through the controllers cooling terminals and back to where that red wire used to go. Of course I needed to get the temperature sensor wired in, so I drilled a hole through the fridge behind the crisper drawer. I didnt think there would be any refrigerant lines here and thankfully that was correct. Then it was just a matter of configuring the controllers settings and deciding where to put the temperature sensor. To bring things full-circle, I decided to tape the sensor to the wall near the original thermostats dial. Now, this was all a pretty rough-and-ready install using wire nuts and spare wires I had lying around so dont judge me too harshly here - really I just wanted to run a test with this controller. So lets get to that. Before I could turn it on, though, since I had the fridge on its side to do these modifications Id need to let it sit upright for at least an hour. You need to do this for anything with a compressor-based refrigeration system in it like an air conditioner, dehumidifier, fridge, freezer, or even a water cooler. If youve ever wondered why, well this black ball-shaped thing is just a sealed enclosure for the actual pumpy parts of the compressor and the electric motor that spins them. You can hear it knocking against the enclosure when I rock it back and forth. And since the pumpy parts are made of metal and they move past each other really fast it needs lubrication. That comes in the form of oil, and the compressor and motor are basically just sitting in a pool of it. The system relies on gravity to keep the oil in the right location, and so every refrigeration system with a compressor like this can only be operated in an upright position. When I had it on its side, some of its oil will have drained out of the enclosure and into the refrigerant lines, and turning it on in that condition would have starved the compressor of lubrication, potentially damaging it. It might also have tried to force a big ol slug of oil through the system which could go poorly. Small amounts of oil end up getting pumped throughout the system in normal operation, but it eventually makes its way back to the compressor. And really, thats all youre doing by letting it sit upright for a while - youre allowing whatever oil might have ended up in the wrong places to drain back to the compressor housing prior to starting it up. A good hour and a half later, I switched it on and, happily, it started up and sounded normal. I configured the controller with a set point of 38 degrees and a three degree differential. I didnt yet know for sure what that meant - would it go three degrees below 38? Three above? Or perhaps three above and below? The only way to know for sure was to watch it. So yes, I spent a thrilling evening watching my fridge and its fancy new temperature controller. Right when the display read 38 degrees, the fridge shut off. [click, and the compressor slows to a stop] And it switched back on at 41. [click, compressor spins to life] So thats how that works. Next, it was time to repeat the soda test. I loaded up all my probes again and monitored the fridge empty for a while, then in went the soda cans. As before, it really really reallllllly doesnt like doing this and it took several, by which I mean 14 hours to dig its way down to the set point but it didnt stop until it got there. These little blips here are me checking on the temperature probes a few times to make sure the new controllers displayed temperature wasnt wildly far off from reality, but had I not opened the door this would have been an essentially straight line all the way back down to 38 degrees. This is how a refrigerator is supposed to behave! When its too warm inside, it kicks the compressor on. And once its cold enough, it shuts it off. Thats it. It shouldnt matter what you put in the fridge, it should just do it. And in this data, we can actually see the widening of the cycle times now! Its honestly less significant than I thought it would be with 4 and a half gallons of water in there, but the triangular shape is a bit wider with all that water in compared to an empty fridge. In numbers terms, empty the fridge ran for 25 minutes then spent 33 minutes off, and full it ran for 33 minutes and spent 37 minutes off. Those numbers probably arent exact because of the data fuzziness but its definitely noticeable. And by the way, theres no reason the fridge has to have an electronic thermostat to work properly. With how cheap microcontrollers are these days Im somewhat surprised that this was built with a mechanical thermostat but its mechanicalness wasnt ever the issue - its where they put the dang sensing bulb and how they ran the capillary tube to it. If it actually measured the air temperature inside the fridge, thatd be fine! But instead they buried it deep within the walls for some unknown reason and made a weirdly bad fridge as a result. But Ive fixed it. And Im happy about that. And guess what? The manufacturer seems to have fixed it, too. They continue to make plenty of these silly retro fridges (and other appliances as well), but this particular model has been discontinued. They sell even smaller ones than this which appear to have more or less the same design so if youre looking at gettin one of those be wary of its thermostat. Hopefully they ran the sensing bulb somewhere more sensible. But when we get up to the size that this fella is, well theyve gotten a lot more expensive because they got their wish to become a real fridge! With automatic defrost and everything! We can even see the air pass-through between the two compartments. The evaporator is now entirely in the freezer, and it just lets some of that air fall into the fridge when required. However, these new offerings have gained pretty much all of the complexity of a modern fridge. Which, to be honest is probably mostly a good thing, but I still really admire how incredibly simple this design is. Yes, its still not great at chilling large quantities of stuff, and the freezer has its own peculiarities in addition to requiring the occasional defrosting. But so long as you remember its limitations and are OK with them, this fridge was mainly let down by a bad thermostat. It makes me wonder if perhaps they had just gone that extra step to an electronic controller and a well-placed sensor, they would still be offering this model. It was really quite inexpensive for such a large fridge. Still, while Ive made it miles better than it originally was, theres still room for improvement. For a start, the designers may have been correct to put the sensing bulb towards the bottom of the fridge compartment. Its apparently warmer down there on average which honestly surprises me. Warm air rises after all but I guess enough warmth from the compressor infiltrates through the bottom (which would also explain why the crisper drawer consistently stays just a little too warm). Hmm I wonder if a fan down by the compressor on the outside might help with that [from off-camera] NO! STOP IT! And speaking of too warm, the set points for this test are definitely a little too warm. I mean, for soda, its fine but I do want this maintaining food-safe temperatures. And hopefully, with the accuracy afforded to me with the new controller, I can get it to just touch freezing in the coldest parts of the fridge. Ill also need to properly calibrate the sensor so the displayed number is accurate. Right now I think its reading a few degrees too high based on what the closest sensor probe read, and those seem pretty accurate. Ill still have to play around with the location of the sensor to see whats best, and also - I probably need to encase the sensor in a glob of silicone or something. Right now it reacts a little too quickly to changes in temperature, so leaving the door open for even just 30 seconds is liable to raise the measured temperature enough to kick the compressor back on. Luckily the control features a compressor lock-out timer so I dont need to worry about damage or anything, but giving the sensor some extra thermal mass to dull its sensitivity is probably wise. Oh, and the freezer. Earlier I mentioned that wed need fairly long cycle times for it to work properly. Well, the three degree temperature differential appears to be just fine, hovering right around zero degrees - at least with the probe where it is now. Now, I dont remember why, but I started this test with all five probes in the fridge (I think I had this in the top door shelf) and then remembered I wanted a probe in the freezer so ignore the front bit. Oh, and after 14 hours of running continuously, the freezer actually made it down to -21. Good for it. The last thing Ill need to do is tidy up this wiring. This was hastily thrown together for testing and now I cant fit the compressor terminal cover back on. Ill button that up a little better off-camera. But I want to keep the actual temperature controller where I can see it - Im thinking of just gluing it onto the top of the fridge. Which makes me kind of annoyed with how the wires come out of the controller, but oh well. And then, theres one more optional thing: It might be worth revisiting the fan experiments now that theres a proper temperature control in control of the temperature properly. Maybe I actually can get it to a much more uniform temperature in there, and I wont have to worry about that changing the set point. However, the original tests still had those apparent airflow dead spots, so the drifting set point was only one issue. As I said before, perhaps running the fan (or fans) periodically would solve the problem - and now that I think about it, it seems thats how most fridges operate. But I dont know if Im ready to try that again. If I do, itll be on Connextras. Now, you might very well be asking, why was I going through all this trouble in the first place? Well, honestly, I really like this little fridge! I like its silly retro design. I like that its red. And I like how simple and earnest it is. Ive held onto it and brought it here to the studio because quite frankly I no longer trust the Samsung fridge thats here. It had a clogged drain line a couple years ago which was not fun to deal with, the screw covering the evaporator panel has rusted quite badly and I dont even know if I could open it back up if I needed to. Plus, when I was in there, I found pretty severe discoloration around the defroster heater which is concerning. I just dont know how much life might be left in it, and besides its kind of loud, the door seal is constantly getting moldy, the way it defrosts in the fridge compartment leads to a bunch of condensation getting on everything every time that happens it just bugs me and I kind of want to get rid of it. I dont need that much of a fridge here anyway, I basically just keep beverages and condiments in there. The only thing Id be giving up is some freezer space but theres a chest freezer here, too, so yknow, theres that option. The red fridge will save a bit of energy, too. Though, not all that much to be honest. Mini-fridges tend to have fairly thin walls which means they dont have as much insulation and heat intrusion affects them more severely. However, it doesnt have defrost heaters, and when I tested it with my Kill-a-watt I found that it used significantly less energy than the energy-guide label it came with would suggest. It only used about 650 watt-hours per day in my testing \\ compared to over 1000 on the label. So thats interesting. Anyway, I need to end this video. Did I think this would turn into a months-long saga of perplexing data logging and experimentation? No. Absolutely I did not. I thought I was gonna show you this silly red fridge, see how much of a temperature gradient it had in there, then fix it with a fan and praise the power of convection. But everything went right off the rails and now were here. Which leads me to this warning: If you should buy some of these data loggers - beware the rabbit holes they may open. Knowledge is power but sometimes ignorance can really be bliss. chillingly smooth jazz exasperated with this ridiculous fridge. Not because it stopped working or anything, it still work - yeah. I did not emphasis RED enough. Without any effort on our [big snotty throat clear] whats happening with my nasal voices? What? monitor top fridges from general electric were essentially. I just, its effectively. Hmm!! cools down varies depending on whether the freezer also wants some of that cooooohhhhwwwa. Hwuh. That was almost a burp. That would hopefully for- and how they ran the capillary tube. [thunk] If it actually measured the air t yeah what was that? Was that the cat? .fridges from General Electric were efflec. Efflectively! Alright! So... did you make it to the end? This video absolutely got out of hand. But, it was also among the most puzzling and frustrating things I've gone through, in no small part because had I just investigated the thermostat earlier, I would have avoided a lot of confusion and anguish. Anyway, the fridge is running, so I better go catch it.",
    "transcript_keywords": [
        "fridge",
        "temperature",
        "freezer",
        "back",
        "thermostat",
        "air",
        "degrees",
        "compressor",
        "fridges",
        "air temperature inside",
        "inside",
        "fridge compartment",
        "cold",
        "fan",
        "probe",
        "put",
        "running",
        "pretty",
        "time",
        "red fridge"
    ],
    "transcript_entity_values": [
        "1 oclock",
        "around zero degrees",
        "a half-hour",
        "GE",
        "a minute",
        "10W light",
        "two",
        "about 43 degrees",
        "3",
        "months-long",
        "every minute",
        "six",
        "a thrilling evening",
        "2",
        "about 2 degrees Fahrenheit",
        "37 degrees",
        "only four",
        "several hours",
        "37",
        "one",
        "four",
        "Bubbly",
        "around 33 minutes",
        "The next day",
        "a few degrees",
        "39 degrees",
        "around 38.5 degrees",
        "fed",
        "60 second",
        "37 minutes",
        "about every three hours",
        "eleven degree",
        "ye-olden days",
        "50 degrees",
        "2 oclock",
        "Half",
        "43",
        "38 degrees",
        "Three",
        "years",
        "7",
        "five hours",
        "49.1 degrees",
        "up to",
        "44",
        "8",
        "about 5 cubic feet per minute",
        "another 12 hours",
        "January to June",
        "8th",
        "the Latent Heat of Vaporization",
        "A little after midnight",
        "11:00",
        "5 hours",
        "number five",
        "Murphy",
        "hour",
        "33 degrees",
        "first",
        "a few tenths",
        "4",
        "these days",
        "24 hour",
        "16",
        "27 degrees",
        "Connextras",
        "KitchenAid",
        "around 32 degrees",
        "ages ago",
        "sec",
        "150",
        "10 degrees",
        "three",
        "8 degree",
        "USB",
        "the Refrigeration Cycle Powered",
        "the year",
        "Fahrenheit",
        "between 28",
        "1",
        "secondly",
        "only one",
        "2",
        "about five hours",
        "around 40 degrees",
        "twenty bucks",
        "three degrees below 38",
        "33 minutes",
        "decades",
        "Samsung",
        "today",
        "46.6 degrees",
        "Big Clive",
        "just 30 seconds",
        "Early last year",
        "200",
        "32 degrees",
        "41",
        "10",
        "about 17 liters",
        "about 40 degrees",
        "this five day",
        "40 degrees",
        "a couple years ago",
        "10 minutes",
        "48",
        "about 42 degrees",
        "4 and a half gallons",
        "over 1000",
        "third",
        "about 1.2",
        "5 degrees",
        "25 minutes",
        "5V",
        "10W incandescent",
        "2022",
        "Samsung Twin Cool",
        "COLD",
        "about 650 watt-hours",
        "12 hours",
        "only about 5 degrees",
        "28 degrees",
        "These days",
        "24 hours",
        "General Electric",
        "a little after 9:00",
        "46 degrees",
        "14 hours",
        "this day",
        "noon",
        "about six months",
        "42 degrees",
        "five",
        "an hour",
        "a single 40mm",
        "First",
        "second",
        "A good hour and a half later",
        "2012",
        "at least an hour"
    ],
    "transcript_entity_types": [
        "DATE",
        "QUANTITY",
        "TIME",
        "ORG",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "TIME",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "TIME",
        "TIME",
        "TIME",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "DATE",
        "ORDINAL",
        "ORG",
        "TIME",
        "TIME",
        "TIME",
        "CARDINAL",
        "PERSON",
        "TIME",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "TIME",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "TIME",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON",
        "TIME",
        "DATE",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "DATE",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "ORG",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "EVENT",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "TIME",
        "ORG",
        "TIME",
        "QUANTITY",
        "TIME",
        "DATE",
        "TIME",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "ORDINAL",
        "ORDINAL",
        "TIME",
        "DATE",
        "TIME"
    ],
    "vector": [
        -0.11400316655635834,
        -0.026900315657258034,
        0.032841023057699203,
        0.029566019773483276,
        0.03731881082057953,
        -0.03226291388273239,
        -0.07277467846870422,
        0.08612686395645142,
        -0.016540542244911194,
        -0.010707383044064045,
        -0.06859485805034637,
        0.03548194840550423,
        0.018245922401547432,
        0.009618639945983887,
        -0.012085733003914356,
        -0.08992409706115723,
        0.013431355357170105,
        -0.1372942477464676,
        -0.05092543736100197,
        -0.0762501060962677,
        0.01108803041279316,
        -0.03844626620411873,
        0.018825529143214226,
        -0.008759967051446438,
        -0.043403465300798416,
        0.03887747600674629,
        -0.07485935837030411,
        -0.03024997003376484,
        -0.0812259092926979,
        0.010969140566885471,
        -0.06729377061128616,
        0.048979632556438446,
        0.013898246921598911,
        -0.06797195971012115,
        -0.017933281138539314,
        -0.010025201365351677,
        0.10216796398162842,
        0.005351258907467127,
        0.019024694338440895,
        -0.028796745464205742,
        0.03896269574761391,
        -0.06884311139583588,
        0.10417980700731277,
        0.055310849100351334,
        0.00010619239037623629,
        0.04473256319761276,
        -0.03287673369050026,
        -6.960222526686266e-05,
        -0.034851863980293274,
        -0.07925578206777573,
        -0.10040734708309174,
        -0.0016530845314264297,
        0.07424189895391464,
        -0.02046281285583973,
        0.02303142659366131,
        0.1085486114025116,
        0.03636375069618225,
        -0.0732286348938942,
        0.04228011518716812,
        -0.0019005395006388426,
        0.1109515056014061,
        -0.01666259951889515,
        -0.08688420802354813,
        0.01414086390286684,
        0.07654909789562225,
        -0.023917116224765778,
        -0.01688041165471077,
        0.0700206607580185,
        0.06078844517469406,
        0.015597749501466751,
        -0.04825771227478981,
        -0.008383160457015038,
        0.08344483375549316,
        0.06855189055204391,
        0.04991304501891136,
        -0.03298076614737511,
        0.021749569103121758,
        -0.060422319918870926,
        -0.010553741827607155,
        -0.020000621676445007,
        0.06657634675502777,
        -0.07548965513706207,
        -0.05599451810121536,
        -0.025544261559844017,
        -0.032470811158418655,
        -0.05729850009083748,
        0.10139449685811996,
        -0.02677076868712902,
        0.010594213381409645,
        0.010528352111577988,
        -0.017460379749536514,
        0.020019974559545517,
        0.04860248789191246,
        -0.01273479126393795,
        -0.009557563811540604,
        0.07104272395372391,
        -0.009349390864372253,
        -0.01643497869372368,
        -0.05133673921227455,
        0.03766970336437225,
        -0.008818634785711765,
        0.07913557440042496,
        0.031361788511276245,
        -0.03850185126066208,
        -0.008926842361688614,
        -0.074208565056324,
        -0.09418879449367523,
        0.0484248623251915,
        0.06579462438821793,
        0.0023323914501816034,
        -0.03499583899974823,
        0.05823149159550667,
        -0.023766135796904564,
        -0.024010179564356804,
        0.026501895859837532,
        -0.025160014629364014,
        -0.045736148953437805,
        -0.06532086431980133,
        0.013820338062942028,
        0.05456499755382538,
        0.02127423882484436,
        0.05226261541247368,
        0.021433884277939796,
        -0.04029211774468422,
        0.08636490255594254,
        0.004755009431391954,
        -0.05363979563117027,
        7.874558779657762e-33,
        0.012686255387961864,
        0.04445728659629822,
        0.026774238795042038,
        0.054762907326221466,
        0.10265833884477615,
        -0.0006682099192403257,
        -0.10088187456130981,
        0.06184295937418938,
        0.0317191444337368,
        0.058531906455755234,
        0.11528381705284119,
        0.01348662469536066,
        -0.06775686144828796,
        -0.0005322718643583357,
        0.020824242383241653,
        -0.04276253655552864,
        -0.04951253905892372,
        -0.00615669833496213,
        -0.024721655994653702,
        0.004087695851922035,
        -0.04515881463885307,
        0.025063978508114815,
        0.01386379636824131,
        -0.04855596274137497,
        0.07191117852926254,
        -0.022905929014086723,
        0.05178138241171837,
        0.04095343500375748,
        0.09298033267259598,
        0.0213144663721323,
        0.006437035743147135,
        0.003060531336814165,
        -0.10179676115512848,
        -0.017448946833610535,
        0.03800339624285698,
        -0.13092243671417236,
        -0.024246633052825928,
        -0.13109901547431946,
        -0.04760757461190224,
        -0.024346107617020607,
        -0.03613720089197159,
        0.03866131976246834,
        -0.034912362694740295,
        0.11171961575746536,
        -0.006976691074669361,
        0.05922801420092583,
        0.0858447253704071,
        -0.01566634140908718,
        0.005921337753534317,
        0.004236665088683367,
        -0.007620415650308132,
        -0.0012924651382490993,
        0.024846112355589867,
        -0.0325678288936615,
        -0.00392059376463294,
        0.0011259142775088549,
        0.033426836133003235,
        -0.0370466411113739,
        0.0385027676820755,
        -0.06943379342556,
        -0.004864745307713747,
        -0.016001349315047264,
        -0.01464888732880354,
        -0.07186044007539749,
        0.016872409731149673,
        0.07657764106988907,
        0.00756031321361661,
        0.04070810228586197,
        -0.015615830197930336,
        0.03930798918008804,
        -0.022978395223617554,
        -0.03634462505578995,
        -0.03176775947213173,
        -0.09807028621435165,
        -0.0004743870231322944,
        0.04540080949664116,
        0.01583569310605526,
        0.029111461713910103,
        -0.07724752277135849,
        -0.08499373495578766,
        0.06564657390117645,
        -0.06375284492969513,
        0.09891220927238464,
        0.02715163864195347,
        -0.023197364062070847,
        -0.03924008458852768,
        -0.012162122875452042,
        0.04088997468352318,
        0.04931088164448738,
        0.058828286826610565,
        -0.001872798427939415,
        -0.050466280430555344,
        0.07282736152410507,
        0.05789582058787346,
        0.002700603799894452,
        -6.872776779948084e-33,
        -0.01903853565454483,
        -0.0740928202867508,
        -0.04043414816260338,
        0.06023094058036804,
        0.0171064380556345,
        -0.08009342849254608,
        -0.06595373153686523,
        0.022846516221761703,
        0.058971647173166275,
        -0.04855165258049965,
        0.016779035329818726,
        0.004865869414061308,
        0.032760750502347946,
        -0.06959816068410873,
        -0.02207021787762642,
        0.01814114861190319,
        0.02305944263935089,
        -0.06554272770881653,
        -0.03562816232442856,
        -0.027164500206708908,
        0.03834958001971245,
        0.007220363710075617,
        -0.11972174793481827,
        0.016452234238386154,
        -0.06757885217666626,
        0.12342524528503418,
        -0.06202051416039467,
        0.010952786542475224,
        -0.0042020902037620544,
        -0.04621587321162224,
        -0.01982581615447998,
        -0.0036608721129596233,
        0.02618027850985527,
        0.04589436203241348,
        -0.04635335132479668,
        0.051760945469141006,
        -0.011375907808542252,
        -0.03284485265612602,
        -0.034885652363300323,
        -0.0752306804060936,
        0.06672712415456772,
        0.01931064948439598,
        -0.04770391806960106,
        -0.04515280947089195,
        -0.0007963733514770865,
        -0.009020637720823288,
        -0.07307006418704987,
        -0.07488954812288284,
        0.020280038937926292,
        0.10239267349243164,
        0.03528249263763428,
        -0.05337713286280632,
        -0.05576062202453613,
        -0.07917047291994095,
        0.009196162223815918,
        -0.04080783948302269,
        0.003332593012601137,
        0.00179312436375767,
        0.08187242597341537,
        0.03270246088504791,
        0.03769073262810707,
        -0.0740421935915947,
        -0.01219178456813097,
        -0.0428110770881176,
        -0.007255811244249344,
        -0.038717299699783325,
        0.047930169850587845,
        -0.006278015673160553,
        0.037516336888074875,
        0.029011273756623268,
        0.0946483165025711,
        0.03023838810622692,
        -0.06962350755929947,
        -0.07017058879137039,
        0.036890726536512375,
        0.06657440960407257,
        0.07485877722501755,
        -0.07445906847715378,
        -0.13394245505332947,
        0.07348554581403732,
        -0.019660266116261482,
        0.007582186721265316,
        -0.02231442555785179,
        0.018209336325526237,
        0.04808288440108299,
        -0.03938273340463638,
        0.07849789410829544,
        0.039202868938446045,
        0.018101878464221954,
        0.09633415192365646,
        -0.01977301388978958,
        0.04646465554833412,
        -0.023628732189536095,
        0.057496365159749985,
        0.04791491851210594,
        -6.730466139970304e-08,
        0.013703849166631699,
        -0.01625213772058487,
        0.0153038976714015,
        0.04203270748257637,
        0.014426583424210548,
        -0.05410994216799736,
        -0.032768651843070984,
        -0.01809830777347088,
        -0.03599359840154648,
        0.011535653844475746,
        0.008511938154697418,
        0.03803512081503868,
        0.024776486679911613,
        0.05375915393233299,
        0.00561793427914381,
        -0.03436273708939552,
        -0.038861677050590515,
        0.02072756364941597,
        -0.06407687813043594,
        -0.0474042147397995,
        -0.004295166581869125,
        0.000971200643107295,
        0.06571666896343231,
        -0.018862325698137283,
        0.0028137373737990856,
        0.08217776566743851,
        -0.0009789369069039822,
        0.07023373246192932,
        0.04498211294412613,
        0.008885631337761879,
        -0.09267091006040573,
        -0.0425204299390316,
        0.043912407010793686,
        0.026527488604187965,
        -0.014057585969567299,
        -0.02250087633728981,
        -0.012648808769881725,
        -0.013949522748589516,
        0.0031305744778364897,
        -0.021248038858175278,
        0.07408912479877472,
        -0.05367501080036163,
        -0.12373558431863785,
        0.12341754138469696,
        -0.021377256140112877,
        -0.03922500088810921,
        -0.08452419936656952,
        0.008073575794696808,
        -0.005676434841006994,
        0.1142975240945816,
        0.0414336659014225,
        -0.015288463793694973,
        0.005260210484266281,
        -0.019586477428674698,
        0.0397786907851696,
        -0.006887958850711584,
        -0.017611641436815262,
        0.01087252888828516,
        -0.032708894461393356,
        0.08097992837429047,
        0.05733514949679375,
        -0.011154943145811558,
        -0.056722767651081085,
        0.05079369992017746
    ]
}