{
    "id": "8Q4_9HPdZco",
    "title": "Apple iPhone XS and XR 2018 event in 12 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-09-12T19:39:36Z",
    "video_url": "https://www.youtube.com/watch?v=8Q4_9HPdZco",
    "category": "Science & Technology",
    "tags": [
        "apple event",
        "apple event 2018",
        "apple",
        "apple keynote",
        "tim cook",
        "apple iphone",
        "iphone xs plus",
        "iphone xs",
        "iphone x",
        "iphone 9",
        "steve jobs",
        "apple watch",
        "apple watch 4",
        "apple watch 2018",
        "ios 12",
        "iphone x plus",
        "apple music",
        "iphone",
        "iphone 2018",
        "ipad",
        "new ipad",
        "event",
        "apple 2018",
        "iphone 11",
        "what to expect",
        "2018 iphone",
        "2018",
        "hands on",
        "first look",
        "review",
        "technology",
        "top 10",
        "gadgets",
        "rumors",
        "tech",
        "latest updates",
        "mkbhd",
        "verge",
        "the verge"
    ],
    "views": 1909683,
    "likes": 19836,
    "comments_count": 4077,
    "description": "Apple has announced its latest collection of gadgets; the iPhone XS, XS Max, iPhone XR and the Apple Watch Series 4. This year, they introduced three new iPhone models that build off the companys 10th anniversary edition iPhone X and accessories that come with it.   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Welcome to the Steve Jobs Theater. Today, we're going to tell you about two of our most personal products. Let's get started with the Apple Watch. Apple Watch Series 4, everything about it has been redesigned and re-engineered. It all starts with a stunning new display. We pushed the screens right to the edges and we curved the corners to perfectly match the shape of the watch. The screens are significantly larger. In fact, they're over 30 percent larger. We've done this with minimal changes to the case size. Series 4 is thinner, so there's actually less total volume than in Series 3. You'll see more in Maps and Photo and Calendar. We've created new complications. They look beautiful and they show even more information and detail. We've also designed a brand-new watch face with up to eight complications that really brings them to life. You can add loved ones to your watch face and simply tap to connect with them. Or if you're traveling, you can customize a watch face to track the different time zones. Or maybe you want to create the ultimate health and fitness watch. The digital crown's been completely re-engineered and it now includes haptic feedback, giving you a more responsive and mechanical feel. It's especially great in apps like Podcasts and Calendar, where you precisely flip through each item. The speaker has also been completely redesigned. It's 50 percent louder, which is great for phone calls and walkie-talkie or Siri requests. We moved the microphone on Series 4 to the opposite side, as far away from the speaker as possible to reduce echo, making phone calls even clearer. The back of Series 4 is absolutely beautiful. It's made entirely of black ceramic and sapphire crystal. Radio waves can now pass through both front and the back, resulting in improved cellular reception. The brain of Series 4 is our fourth-generation Silicone in Package, or SiP. We call it S4. S4 contains a powerful new dual-core, 64-bit processor and a new GPO, both custom-designed by our Apple Silicone team to deliver up to two times faster performance. Series 4 has a next-generation accelerometer and gyroscope, with twice the dynamic range, measuring up to 32 g-forces and can sample motion data eight times faster. Apple Watch Series 4 can detect a fall with the new accelerometer and gyroscope, the Watch analyzes risk trajectory and impact acceleration to determine when a fall occurs. After detecting a fall, Series 4 delivers an alert. From that alert, you can initiate an emergency call. We wanted to do even more in this space, and so we're announcing three new heart features. First, a notification if your heart rate appears to be too low. The second feature is related to heart rhythm. Apple Watch can now screen your heart rhythm in the background, and it sends you a notification if it detects an irregular rhythm that appears to be atrial fibrillation. The third feature is made possible by a new electrical heart sensor on Series 4. We've added electrodes into the back sapphire crystal and the digital crown, allowing you to take an electrocardiogram. With all of these features in a slimmer design, you're probably wondering about battery life. Well, I'm pleased to tell you this Series 4 has the same, 18-hour, all-day battery life that our customers enjoy. Series 4 will be available in three aluminum finishes, silver, gold, and space gray. The stainless collection is absolutely beautiful, with polished and space black. All band colors and band styles fit any generation of Apple Watch. Apple Watch Series 4 with GPS starts at $399. Series 4 with cellular starts at $499. We're keeping Series 3 in the line at more affordable prices, starting at just $279. You can order Series 4 starting Friday, and it will be available the following Friday, September 21st. Series 3 at the new price is available right after the show. And watchOS 5 will be available on September 17th. Now let's talk about iPhone. (applause) This is iPhone Xs. It is the most advanced iPhone we've ever created. It is made of a surgical grade stainless steel. It has a gorgeous new gold finish on the front and on the glass. It's covered on the front and the back with a new formulation of glass that is the most durable glass ever in a smartphone. iPhone Xs comes in three finishes, gold, silver, and space gray. They're protected from dust and liquids to an even higher level now. IP68, the screen on iPhone Xs is a super retina display. The best we've made yet. It's an OLED display, 5.8 inches on the diagonal, has 2.7 million pixels, 458 pixels per inch, the highest quality display on an iOS device. Well, the iPhone Xs has not just one, but two sizes of display. The 5.8 inch and a new 6.5 inch super retina display. It is an OLED display as well. 3.3 million pixels, 458 pixels per inch again. You can see it's about the same size phone with a much larger display. We call it the iPhone Xs Max. The team has worked so hard to make every generation of the A-series chip better than any ever in a smartphone, and this year is no exception. What the team has done is truly breakthrough. It's called the A12 Bionic, and the A12 Bionic is the industry's first seven nanometer chip. It is an Apple-designed 6-Core CPU. This is a fusion system. It has two high performance cores, four high efficiency cores. You are going to be blown away with the pictures you can take with the iPhone Xs' camera. It has a 12 megapixel wide camera, a 12 megapixel telephoto camera, and an even more improved True Tone flash. On the front side, you have the true depth camera system. That's a new sensor as well, a seven megapixel that's twice as fast. Increasingly, all smartphone users want more performance, bigger screens, but longer battery life too. iPhone Xs gets you up to 30 minutes longer in your day than iPhone X did, and that's really great. iPhone Xs Max has the biggest battery we've ever put into an iPhone, and it can get you up to an hour and a half longer in your day. One thing we've had requests for is Dual SIM capability. To do this into iPhone Xs and Xs Max, we built a technology called DSDS, or Dual SIM Dual Standby. We want to reach as many customers as we can with this incredible technology. So that's why we are very excited to show you one more iPhone. It is incredible. We are so excited to introduce you to the iPhone Xr. It's made from 7000-series aerospace-grade aluminum. It has more durable glass. It is absolutely stunning. It comes in incredible new finishes. White, black, blue, coral, yellow, each beautifully designed with that aluminum finish. There's even an incredible Product Red one as well, and it is beautiful. All of these are protected from dust and liquids to IP67. This display is really what strikes you though. It's an LCD display that's called the Liquid Retina display. It's 1.4 million pixels and it's 326 pixels per inch, so true retina image quality. Now let's bring that iPhone 8 Plus next to it, because it's really interesting. It is a bigger display than the iPhone 8 Plus in a smaller design. It supports tap to wake. It has that 120 Hertz touch-sensitive layer so it scrolls super fast. It doesn't have 3D touch but here again, the team came up with something really smart. It has a new feature we call haptic touch. So to get to the camera from the Home screen, you just press on it, you'll feel a haptic tap, and you're taken right to the camera. It has Face ID, and there's a true depth camera system, the same true depth camera system on iPhone Xs and Xs Max. It's infrared camera, flood illuminator, proximity sensor, ambient light sensor, dot projector, front camera, speaker, microphone. Inside the iPhone Xr is nothing but the best chip we make, a brand-new seven nanometer A12 Bionic chip. This is a powerhouse, and it has a great new camera system as well. It's a 12 megapixel wide-angle camera, exact same wide-angle camera in the Xs and Xs Max, so it's our new generation. A sensor that's larger with bigger pixels, optical image stabilization, fast f1.8 aperture, Apple-designed lens, and the new improved True Tone flash as well. It takes beautiful photos, like this one. There's probably something you've noticed about this photo though. It's a portrait-mode photo with that beautiful background blur, taken from a single camera system. This is remarkable. What the team is able to do with my hardware and software to create a depth segmentation map, using the focused pixels and neuronet software so that we can create portrait-mode photos in the brand-new iPhone Xr. What about battery life? Well, here the story continues to be just great. So let's compare it to the iPhone 8 Plus. So many customers love the long battery life of that. Well, iPhone Xr gives you up to an hour and a half more in your day than the iPhone 8 Plus. You have iPhone Xs, Xs Max, and Xr, three new models of iPhone. The iPhone Xr will come in six finishes and in three sizes. 64 gigabytes, 128 gigabytes, and 256 gigabytes of storage, that will start at $749. (applause) That's less expensive than the iPhone 8 Plus. You can order it in just over a month, October 19th, and it'll start to ship a week later than that, October 26th. iPhone Xs will come in three configurations, 64 gigs, 256 gigs, and that new 512 gigabyte storage capacity. It starts at $999. An iPhone Xs Max, same three configurations with its larger screen, larger battery, it'll be just $100 more, starting at $1099. So iPhone Xs, Xs Max, you can start pre-ordering on Friday, September 14th, and it'll ship a week later, September 21st. It'll start shipping in all of these markets. A week later, it'll start shipping in all of these locations as well. I'd like to thank everyone for joining us this morning, including those watching us online. I'd especially like to thank all the people at Apple who made this magical day possible, thank you.",
    "transcript_keywords": [
        "Steve Jobs Theater",
        "Jobs Theater",
        "Steve Jobs",
        "Apple Watch Series",
        "iPhone",
        "Series",
        "Apple Watch",
        "Watch Series",
        "Watch",
        "camera",
        "Max",
        "display",
        "watch face",
        "Apple",
        "camera system",
        "pixels",
        "iPhone Xs Max",
        "Theater",
        "Steve",
        "Jobs"
    ],
    "transcript_entity_values": [
        "18-hour",
        "October 26th",
        "Series 3",
        "499",
        "2.7 million",
        "three",
        "digital",
        "S4",
        "up to an hour and a half",
        "5",
        "October 19th",
        "Series",
        "Xr",
        "seven nanometer",
        "the Liquid Retina",
        "5.8 inch",
        "5.8 inches",
        "One",
        "6",
        "12 megapixel",
        "749",
        "64",
        "Bionic",
        "September 17th",
        "Friday, September 14th",
        "over 30 percent",
        "third",
        "Dual SIM Dual Standby",
        "up to eight",
        "50 percent",
        "399",
        "iPhone Xs",
        "this morning",
        "crown",
        "iPhone X",
        "Apple Silicone",
        "Podcasts and Calendar",
        "seven megapixel",
        "iPhone Xr",
        "Friday, September 21st",
        "32",
        "this year",
        "first",
        "Friday",
        "Series 4",
        "DSDS",
        "Today",
        "LCD",
        "256 gigabytes",
        "iPhone Xs",
        "3.3 million",
        "GPS",
        "128 gigabytes",
        "64 gigabytes",
        "just $100",
        "Watch",
        "7000",
        "a week later",
        "256",
        "4",
        "up to 30 minutes",
        "iPhone 8 Plus",
        "second",
        "the Apple Watch",
        "iPhone Xs Max",
        "just over a month",
        "about two",
        "First",
        "326",
        "just $279",
        "1099",
        "A week later",
        "the iPhone Xs'",
        "one",
        "Apple",
        "four",
        "fourth-generation",
        "999",
        "day",
        "Xs Max",
        "the Steve Jobs Theater",
        "eight",
        "458",
        "six",
        "120",
        "a week later, September 21st",
        "1.4 million",
        "3",
        "Hertz",
        "the iPhone Xs",
        "Xs",
        "GPO",
        "Siri",
        "two",
        "Series 4",
        "Home",
        "6.5 inch",
        "Apple Watch",
        "this Series 4",
        "iPhone",
        "512 gigabyte",
        "Product Red"
    ],
    "transcript_entity_types": [
        "TIME",
        "DATE",
        "LAW",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "DATE",
        "EVENT",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "PERCENT",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "MONEY",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "DATE",
        "LAW",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "PERSON",
        "CARDINAL",
        "EVENT",
        "ORG",
        "QUANTITY",
        "ORG",
        "EVENT",
        "ORG",
        "QUANTITY",
        "ORG"
    ],
    "vector": [
        -0.004063652362674475,
        -0.016404662281274796,
        0.07515919953584671,
        -0.05747514218091965,
        0.048750028014183044,
        -0.012206164188683033,
        -0.03258689492940903,
        0.03934469819068909,
        0.06961516290903091,
        -0.03554379194974899,
        -0.001339571550488472,
        0.02725920081138611,
        0.011409630998969078,
        0.07041545957326889,
        -0.03699919581413269,
        -0.01607128046452999,
        0.09797988831996918,
        -0.09014438092708588,
        -0.036545220762491226,
        0.04904618859291077,
        0.02460637129843235,
        -0.12393199652433395,
        0.03299829363822937,
        0.019251657649874687,
        -0.006459986791014671,
        0.04372592642903328,
        -0.04533103480935097,
        -0.061857473105192184,
        -0.0016355987172573805,
        -0.017986921593546867,
        -0.01040837075561285,
        0.09220361709594727,
        0.03179822489619255,
        -0.022802717983722687,
        -0.06182707101106644,
        -0.11098417639732361,
        0.07292753458023071,
        -0.0023354659788310528,
        -0.04133399575948715,
        -0.06568584591150284,
        0.008184012025594711,
        -0.002118161180987954,
        0.03646029159426689,
        0.0986645370721817,
        -0.012215915136039257,
        0.033686354756355286,
        0.03462827205657959,
        -0.004856538493186235,
        -0.0024300753138959408,
        0.024608958512544632,
        0.01398609671741724,
        -0.07292000949382782,
        -0.009688162244856358,
        0.008357398211956024,
        0.025277385488152504,
        -0.0017586415633559227,
        -0.04774953052401543,
        -0.010039115324616432,
        0.05254238843917847,
        0.01618080586194992,
        0.09329245239496231,
        -0.0056132180616259575,
        -0.004448622465133667,
        0.05670112743973732,
        0.004683528561145067,
        0.010319184511899948,
        -0.030795101076364517,
        -0.00174911436624825,
        -0.017258228734135628,
        0.015750283375382423,
        0.023401420563459396,
        0.043128564953804016,
        0.03348638862371445,
        -0.047416724264621735,
        0.022426407784223557,
        0.0065472982823848724,
        0.046979062259197235,
        -0.011618072167038918,
        -0.06208321824669838,
        -0.018741512671113014,
        -0.05923857539892197,
        -0.007152315229177475,
        -0.010232011787593365,
        0.0028388588689267635,
        -0.026392431929707527,
        -0.023273231461644173,
        0.005368474405258894,
        -0.08152756839990616,
        -0.04993664473295212,
        0.011860559694468975,
        0.044279761612415314,
        0.07227681577205658,
        -0.05411447212100029,
        -0.019018787890672684,
        0.03032797761261463,
        0.010038178414106369,
        0.0002151280641555786,
        -0.0027947560884058475,
        0.07627134770154953,
        -0.0017900591483339667,
        0.07289895415306091,
        0.0033800865057855844,
        0.055077776312828064,
        0.03193444013595581,
        0.03658450394868851,
        -0.08377276360988617,
        -0.03291839361190796,
        -0.00806285161525011,
        -0.04516715556383133,
        0.1513891965150833,
        0.0166938416659832,
        -0.005026659462600946,
        -0.019830230623483658,
        0.07170692831277847,
        -0.0335407517850399,
        0.04495199769735336,
        -0.0007295008981600404,
        0.0918547734618187,
        0.08712885528802872,
        0.023524712771177292,
        0.053273364901542664,
        0.05580814182758331,
        -0.03418442979454994,
        -0.035148926079273224,
        0.07143855094909668,
        -0.0052178530022501945,
        -0.062056977301836014,
        2.1949559692393247e-33,
        -0.08463501185178757,
        0.06539121270179749,
        -0.04004031419754028,
        0.011637656949460506,
        0.01566249132156372,
        -0.01463282760232687,
        0.06150543689727783,
        0.09960513561964035,
        0.03361267223954201,
        0.07148608565330505,
        -0.03470343351364136,
        0.02892327681183815,
        -0.027325239032506943,
        -0.003919469192624092,
        0.0779179185628891,
        -0.11555256694555283,
        -0.06843214482069016,
        0.025174377486109734,
        -0.07774566113948822,
        -0.028109900653362274,
        -0.04032495617866516,
        -0.0442037433385849,
        -0.030684001743793488,
        0.007852805778384209,
        -0.040994804352521896,
        0.0608978308737278,
        0.06898250430822372,
        0.04679857939481735,
        -0.03235593065619469,
        -0.013753145933151245,
        -0.06778863072395325,
        0.01699301041662693,
        0.015556101687252522,
        -0.0575469471514225,
        -0.046979110687971115,
        0.02010073885321617,
        0.04773445054888725,
        -0.06917042285203934,
        0.04979824274778366,
        0.026008201763033867,
        -0.12800081074237823,
        0.019239330664277077,
        -0.06887445598840714,
        -0.09984095394611359,
        0.0008171614608727396,
        0.0492020845413208,
        0.021186232566833496,
        -0.04238010197877884,
        -0.002210519276559353,
        -0.03011186234652996,
        -0.007959785871207714,
        -0.06354314088821411,
        -0.024660184979438782,
        -0.06803394854068756,
        0.027405429631471634,
        -0.025464173406362534,
        -0.0126358512789011,
        -0.09216765314340591,
        -0.014141757041215897,
        0.04174366593360901,
        -0.05385544151067734,
        0.017691221088171005,
        -0.029301945120096207,
        0.08494681864976883,
        -0.06212249770760536,
        0.06495214998722076,
        0.05531277135014534,
        -0.06317310780286789,
        -0.08834707736968994,
        0.08916953206062317,
        -0.04644614830613136,
        -0.007217404432594776,
        0.01470994483679533,
        -0.03874887898564339,
        0.06015912815928459,
        -0.009655673988163471,
        -0.008559344336390495,
        0.019610192626714706,
        0.03086620755493641,
        -0.021873334422707558,
        -0.05061356723308563,
        0.02213696390390396,
        0.08402552455663681,
        0.028981301933526993,
        -0.061632104218006134,
        -0.034629061818122864,
        -0.005014211870729923,
        0.032699521631002426,
        0.022463738918304443,
        -0.013793174177408218,
        0.012537410482764244,
        -0.06738346070051193,
        -0.016367198899388313,
        0.005247375462204218,
        -0.07743339985609055,
        -3.49854338845774e-33,
        -0.055433716624975204,
        -0.06330637633800507,
        0.03553873300552368,
        -0.024877231568098068,
        0.03108573891222477,
        -0.02626783959567547,
        -0.008145980536937714,
        0.05256055295467377,
        0.03296799585223198,
        -0.030820414423942566,
        0.0684761181473732,
        0.04117249697446823,
        -0.052033379673957825,
        0.04452422261238098,
        -0.06574447453022003,
        0.05012902617454529,
        0.03201732039451599,
        -0.09303036332130432,
        -0.05002818629145622,
        -0.020222024992108345,
        0.11602704972028732,
        0.03917022794485092,
        -0.02696266584098339,
        -0.028160234913229942,
        0.043502386659383774,
        -0.006756794638931751,
        0.0689072459936142,
        0.013514053076505661,
        0.05526725575327873,
        -0.04890475422143936,
        -0.08400478214025497,
        -0.13864749670028687,
        0.0583219900727272,
        0.05059666931629181,
        0.07258829474449158,
        -0.00012421634164638817,
        0.03160718083381653,
        -0.013701261952519417,
        -0.009529863484203815,
        -0.06591632962226868,
        0.03786033019423485,
        0.09337782114744186,
        0.07587732374668121,
        0.02792188711464405,
        0.03437061607837677,
        0.048258133232593536,
        0.0249720998108387,
        0.09854122996330261,
        0.011788011528551579,
        0.010865635238587856,
        -0.029446912929415703,
        -0.021060192957520485,
        -0.010888379067182541,
        -0.0005568196065723896,
        -0.10812569409608841,
        0.02605108730494976,
        0.007308713160455227,
        -0.031621549278497696,
        -0.03925327584147453,
        0.00813919398933649,
        0.03404282405972481,
        -0.03981712460517883,
        -0.018333768472075462,
        -0.0689975917339325,
        -0.027833612635731697,
        -0.02088441513478756,
        0.005350836552679539,
        -0.018996164202690125,
        -0.009394709020853043,
        0.03644349053502083,
        -0.005692509934306145,
        -0.040008142590522766,
        -0.06476286798715591,
        -0.12152974307537079,
        0.02633652091026306,
        0.017216404899954796,
        0.004476604983210564,
        -0.05198489874601364,
        -0.08819644898176193,
        -0.03815339133143425,
        -0.03470327705144882,
        0.09860053658485413,
        0.11478736996650696,
        -0.04330854117870331,
        0.06999946385622025,
        0.13581450283527374,
        0.004958746489137411,
        0.05822297930717468,
        -0.021030979230999947,
        0.053887590765953064,
        -0.030141595751047134,
        0.029159927740693092,
        0.0006183927762322128,
        0.04479776322841644,
        0.024450009688735008,
        -5.49454064469046e-08,
        -0.00390897411853075,
        -0.009243031032383442,
        -0.0037046705838292837,
        -0.07995539903640747,
        -0.04460183531045914,
        -0.04035787284374237,
        -0.06586392968893051,
        0.018651850521564484,
        0.026323392987251282,
        0.00013222456618677825,
        0.016183635219931602,
        -0.06623689085245132,
        -0.12199749797582626,
        0.053922444581985474,
        0.053825896233320236,
        0.020246358588337898,
        -0.06990662962198257,
        0.03535802662372589,
        -0.03680659085512161,
        -0.02688639424741268,
        -0.014561985619366169,
        0.04225932061672211,
        0.03240713104605675,
        -0.05861383303999901,
        0.014899390749633312,
        0.0708872377872467,
        -0.0788908377289772,
        0.028248440474271774,
        0.03772876039147377,
        -0.02984646148979664,
        0.02251093089580536,
        0.03789008408784866,
        0.018818164244294167,
        0.0019993463065475225,
        -0.0312337726354599,
        -0.08851980417966843,
        -0.06143394857645035,
        0.01400407962501049,
        0.11614681780338287,
        0.07093716412782669,
        -0.006578679196536541,
        -0.12986795604228973,
        -0.04265422746539116,
        0.08554820716381073,
        0.028988860547542572,
        -0.09574555605649948,
        0.023868534713983536,
        -0.12858626246452332,
        -0.01240947749465704,
        0.001558814779855311,
        -0.006838445086032152,
        -0.0696658343076706,
        -0.012401577085256577,
        -0.05487740412354469,
        0.08681684732437134,
        0.06041593849658966,
        0.027852710336446762,
        0.002754633082076907,
        -0.03320048004388809,
        0.029127459973096848,
        0.0870707556605339,
        -0.07415927201509476,
        -0.013373004272580147,
        0.08774416148662567
    ]
}