{
    "id": "8WMpjcl8_uw",
    "title": "Tempo Studio Review - Home Fitness Gym",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-07-31T20:19:14Z",
    "video_url": "https://www.youtube.com/watch?v=8WMpjcl8_uw",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 168301,
    "likes": 5762,
    "comments_count": 531,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and today I'm gonna show you this all new home fitness product. This is the Tempo Studio. (upbeat music) Now I partnered with Tempo to make this video for you guys but before I agreed, I had to make sure I tested this thing out thoroughly to make sure I actually really liked it. And so for the past several weeks, I've been using this. I just started a four-week program and today is gonna be the day that I'm doing my last workout in this four-week program. For the past few months, I've been spending so much time at home, unable to go to my gym like I normally could but this thing has so far surpassed all of my expectations for what I can actually do while I'm at home with virtual trainers. It's incredible and I can't wait to show it to you. (upbeat music) This is the Tempo Studio. It's an all-in-one home gym that takes performance tracking to a whole new level and it's the only system that gives you instant feedback to improve your form. It uses 3D motion sensors and AI to analyze your movements and count your reps, weight lifted, calories burned and more. As you progress, it will increase your weight recommendations and customize the programming to help fit your fitness goals, whatever they are. The weights are Olympic grade steel barbells and dumbbells that adjust from 7.5 to 115 pounds. And there's a nice neat place to store them when they aren't in use. You'll use these plus body weight and strength, cardio and HIIT classes led by certified trainers. This whole cabinet just feels premium. Everything about it feels so nice and this is a 42-inch touch screen so that's how you're able to navigate different classes and what's really awesome about this, I've taken 18 classes so far and if I scroll down here, it's giving you all of the stats of everything that you've done throughout the course of your classes. I am not too thrilled with my personal records but I've actually never really done much weightlifting before so this has completely changed the way that I've started to work out. So I'll show you guys the interface. It feels just like a big phone. It's so crazy. So since I first got this, I just decided to try the four-week challenge so that it would guide me through a course, just to be able to get a sense of all the classes that they had to offer. I also liked that you can choose what part of the body you wanna work out. So here's like a legs and glutes, you have core, upper body. So it'll show you all of the things that you're gonna be doing before you actually do them and this is super helpful because if you do have an injury or something, you'll be able to say, \"Okay, I'm not able to do planks today \"so let me choose a different workout.\" I also really love the social aspect of this because I'm able to compete with my friends and challenges just to add that extra motivation. So as soon as my sister gets one of these, it's on. So this is the class that we're gonna be doing. This is the 30-minute full body strength and conditioning. It shows you everything that we're gonna be doing in this course and this is at beginner, which is probably pretty good for me, our equipment, the music, duration. Let's freaking do it. This bar is already heavy enough. (laughs) So let's put on our recommended amount of weights and what's really cool with the AI tracking is it's able to recommend heavier or lighter weights as you progress or if you think it's too heavy, you're able to change the weights manually just to let them know, \"Hey, I'm not ready.\" So with this sensor, it's able to pick up your body movement and give you real time adjustments. So one of the things that this has helped me with so much is I never realized how bad I was at doing squats until this started giving me the real time correction. It let me know every time my knees went over my toes and I was able to make that adjustment and it gave me that feedback and then it was like, \"Good job.\" And directly under the sensor, is where all of your weights are and I honestly just cannot get over how great this looks. This also comes in a black finish but this is the white version. And all of your weights are stored here so if you're 10 pounds, you're five pounds, 2 1/2 and 1.25 and these are the barbell clips. So these are what clips onto the barbells, which are conveniently stored behind this entire machine. So let me take you guys back there to see where all of those are stored. This is so great because you can just pop these right off very quickly, come back over here, pop on your weights. And then when you're done, they're stored very nicely right behind and you never have to see them. If you've got one of these and you're looking for the Power button, it's right here. (upbeat music) All right, weights are on. These might be a little heavy for me but we're gonna hit Continue and I can adjust as we get started. (upbeat music) So up here is where you'll be able to adjust your weights. So this is the recommended weight that we're using right now but you can click Adjust Weights. So if I want it to be heavier, add. It also gives you the color coordinations and it's easy to switch. (upbeat music) I love they have a nice mixture between weights, cardio and body weight. So it is a nice mixture in all of these classes. So calf raises. (upbeat music) Oh, time to switch. We're gonna go on to the barbell. So here's the recommended weights. I think this might be a little heavy for me so I'm going to adjust it here manually 'cause I already know that I think we should turn this down. And what's great is this will learn the weights. So as I adjust this to what works for me, the system gets smarter and it'll know next time, did I do a good job with this weight? Do I need to add some? Do I need to take some off? So it gets smarter as you get more fit. (gentle music) (upbeat music) So that was the feedback that I was talking about. So it would let me know that my knees were over my toes and I'm able to correct that as I continue on to do that exercise. I'm out of breath. Okay, deadlift time. (upbeat music) Looks like we're moving on to the floor to do some chest presses. So we have another weight change on the dumbbells. So let's put those on and get to it. (upbeat music) And that was it for that class. At the end, it gives you the option to rate the class. You can leave some comments. This is your strength profile. So based on your performance, will adjust your starting weights for similar exercises in the future. This is really interesting because it does use AI to determine what you'll be able to lift next time, if you want to go up in weights. So having used this for the past several weeks, it's been amazing because I'm the type of person before, who would only go to group fitness classes. That's how I would do almost all of my own workouts. I'm not very good at figuring out what things I should be doing and what I shouldn't be doing. So this is like having one of those personal fitness trainers in your house. I really love the weights because the barbell itself is a stainless steel Olympic grade barbell and dumbbell. And these weights are rubberized, so these are less likely to damage your floors if you have hardwood floors. This also comes with a foam roller. So this is great for after or before workouts. I love this because it's also being updated with new classes and new features and this just happens real time over the air. You can just update it through Wi-Fi and they do have a future integration with the Apple Watch, which I cannot wait for that update to roll out. All in all, I absolutely love this and I really have tested this out for the past month just to make sure that this was something that actually did work. The classes were solid but the equipment was well-made. Everything about it is really amazing. And what is really so great is the fact that it does look like a small cabinet that could be put anywhere in your house and still look pretty cool. I really can't say enough good things about it. So I'm very excited and maybe in a few months, I'm gonna be so ripped and shredded. It's getting there. Well, thank you guys so much for watching. This was really a fun video and I really did test this out for the past several weeks just to make sure that this was something that I could completely stand by and say this is awesome, it works and I love it. So if you guys are interested in checking this out and getting more information, I'll put a link in the description. Anyway, thank you again for watching and I will see you guys in the next video, bye. (upbeat music)",
    "transcript_keywords": [
        "weights",
        "Tempo Studio",
        "weight",
        "time",
        "classes",
        "Justine and today",
        "Tempo",
        "adjust",
        "guys",
        "Justine",
        "body",
        "make",
        "love",
        "body weight",
        "good",
        "past",
        "great",
        "home",
        "home fitness product",
        "show"
    ],
    "transcript_entity_values": [
        "Olympic",
        "one",
        "five pounds",
        "1.25",
        "Power",
        "four-week",
        "Justine",
        "Olympic",
        "Tempo",
        "2 1/2",
        "the past several weeks",
        "the day",
        "30-minute",
        "HIIT",
        "18",
        "10 pounds",
        "the past month",
        "115 pounds",
        "today",
        "7.5",
        "AI",
        "Wi-Fi",
        "first",
        "a few months",
        "42-inch",
        "Adjust Weights",
        "the past few months",
        "the Apple Watch"
    ],
    "transcript_entity_types": [
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "WORK_OF_ART",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.05271833762526512,
        -0.059363141655921936,
        -0.030987057834863663,
        -0.07066350430250168,
        0.020760051906108856,
        0.07261922955513,
        0.05866914987564087,
        0.03036036156117916,
        -0.038149140775203705,
        0.002679631346836686,
        0.0230210293084383,
        -0.031729623675346375,
        0.003076945198699832,
        -0.014427891001105309,
        0.06794366240501404,
        0.03795633465051651,
        0.06833569705486298,
        -0.0008900025277398527,
        0.04080116003751755,
        0.03730899095535278,
        -0.060633331537246704,
        -0.043450016528367996,
        0.049054890871047974,
        0.05656837299466133,
        -0.06439629197120667,
        0.11884572356939316,
        -0.04490049183368683,
        0.059009626507759094,
        -0.08603215217590332,
        -0.06261102110147476,
        -0.04294750466942787,
        0.031748756766319275,
        0.10155583918094635,
        -0.01699526607990265,
        -0.00437549501657486,
        -0.007293659262359142,
        0.03129070624709129,
        0.03062964230775833,
        -0.06481564044952393,
        -0.0022806571796536446,
        -0.03346948325634003,
        -0.021380247548222542,
        0.05491182580590248,
        0.027241695672273636,
        -0.04262503609061241,
        -0.048909615725278854,
        0.007537005003541708,
        -0.06717102974653244,
        0.06947112083435059,
        0.05237812176346779,
        -0.07678662985563278,
        -0.07924865186214447,
        0.10230493545532227,
        0.006495111156255007,
        -0.06608700752258301,
        0.022122131660580635,
        -0.05928998440504074,
        0.05838092416524887,
        0.02823599800467491,
        -0.06088043004274368,
        0.008492974564433098,
        -0.05724761635065079,
        -0.039780303835868835,
        0.03924502059817314,
        -0.0051028854213654995,
        -0.03972814977169037,
        -0.01114195492118597,
        0.07084933668375015,
        0.03401537612080574,
        0.000801427464466542,
        -0.04493774473667145,
        0.004536840133368969,
        -0.020767955109477043,
        0.022463347762823105,
        0.007960619404911995,
        0.05778896063566208,
        -0.05362056568264961,
        -0.050196047872304916,
        -0.011954217217862606,
        0.045147158205509186,
        -0.0034862712491303682,
        -0.07092301547527313,
        -0.07123426347970963,
        -0.03205263614654541,
        0.019818443804979324,
        0.02741856500506401,
        0.03522052988409996,
        0.014341753907501698,
        -0.004909400828182697,
        -0.0320800244808197,
        -0.082138292491436,
        0.048541359603405,
        -0.06573338806629181,
        -0.009272970259189606,
        0.04250830039381981,
        0.011198751628398895,
        -0.08214439451694489,
        -0.01777731440961361,
        -0.045055825263261795,
        0.07042359560728073,
        0.052284810692071915,
        -0.0004185846191830933,
        -0.007977012544870377,
        0.012770285829901695,
        -0.060015659779310226,
        -0.126255065202713,
        -0.022988595068454742,
        0.05117695406079292,
        0.029851451516151428,
        0.05102827399969101,
        0.004324302542954683,
        0.025099750608205795,
        -0.03647032752633095,
        -0.035688601434230804,
        0.04405442625284195,
        0.10065067559480667,
        -0.042249277234077454,
        0.08095349371433258,
        0.01989796757698059,
        0.0524667464196682,
        0.0014770954148843884,
        -0.09645779430866241,
        -0.026644282042980194,
        0.008857589215040207,
        0.00014382723020389676,
        0.021026525646448135,
        -0.07274693250656128,
        1.3665115950837338e-32,
        -0.00999434944242239,
        0.052346181124448776,
        0.04259343445301056,
        0.05933459475636482,
        0.009842351078987122,
        -0.06650573760271072,
        -0.048141960054636,
        0.04306407645344734,
        0.0123763931915164,
        0.03499141335487366,
        0.014132672920823097,
        0.03686777502298355,
        -0.06600170582532883,
        0.055647533386945724,
        0.04116792976856232,
        -0.0860060453414917,
        -0.018792927265167236,
        -0.007833927869796753,
        -0.06110323220491409,
        -0.011880113743245602,
        0.005025982856750488,
        -0.014569652266800404,
        -0.01498876977711916,
        0.08406157791614532,
        0.06873465329408646,
        0.12365517020225525,
        0.05144356191158295,
        0.0357096828520298,
        0.050497766584157944,
        0.017026422545313835,
        -0.06918863952159882,
        -0.07919760793447495,
        -0.04837346822023392,
        -0.07277752459049225,
        -0.012067383155226707,
        -0.015095104463398457,
        -0.07350026816129684,
        0.013972524553537369,
        -0.03728415071964264,
        -0.06478562206029892,
        -0.03505653515458107,
        0.007260350044816732,
        -0.04159374535083771,
        -0.07943347096443176,
        0.035182010382413864,
        0.031123366206884384,
        0.08207888156175613,
        0.04582994803786278,
        0.025251485407352448,
        0.004982693120837212,
        -0.020928313955664635,
        -0.029060302302241325,
        -0.0626412108540535,
        -0.03718230500817299,
        -0.004014134872704744,
        -0.05489423871040344,
        -0.02102663554251194,
        0.05289669334888458,
        -0.0056609236635267735,
        0.0701049268245697,
        0.052202433347702026,
        0.00725227827206254,
        0.004419602453708649,
        -0.005576631054282188,
        -0.01543646864593029,
        0.09614718705415726,
        0.009627419523894787,
        -0.06834571063518524,
        0.08724617958068848,
        0.057453691959381104,
        -0.0018200866179540753,
        -0.037935011088848114,
        0.03456071391701698,
        0.02802596054971218,
        0.13053587079048157,
        0.030033590272068977,
        -0.04769360274076462,
        -0.030794771388173103,
        -0.013427517376840115,
        -0.050761766731739044,
        -0.08235404640436172,
        0.024180520325899124,
        -0.055574554949998856,
        0.10988323390483856,
        -0.0176287442445755,
        -0.05179448798298836,
        0.0023388508707284927,
        -0.024524057283997536,
        -0.02392585389316082,
        0.014720207080245018,
        -0.0010320948204025626,
        0.048933953046798706,
        -0.0744808241724968,
        -0.00874615553766489,
        -0.09707044810056686,
        -1.3018798300028535e-32,
        0.038961417973041534,
        0.030510393902659416,
        0.048503562808036804,
        -0.05464249104261398,
        0.11737045645713806,
        0.032466087490320206,
        0.012786505743861198,
        0.06984032690525055,
        0.06528264284133911,
        -0.016802944242954254,
        0.07188734412193298,
        -0.08673518896102905,
        -0.13192954659461975,
        -0.001317376270890236,
        -0.05402336269617081,
        0.010292228311300278,
        -0.03441177308559418,
        -0.04088359698653221,
        0.02395191602408886,
        -0.009692770428955555,
        0.08840164542198181,
        0.12093387544155121,
        0.05872030556201935,
        -0.0054715885780751705,
        0.006090131588280201,
        0.0015581330517306924,
        0.009397346526384354,
        0.06194327026605606,
        0.06273344904184341,
        0.06978005170822144,
        -0.0160506721585989,
        -0.026350710541009903,
        -0.032560959458351135,
        -0.017773915082216263,
        0.021336354315280914,
        0.04060370475053787,
        0.02487321011722088,
        0.047580063343048096,
        -0.030550554394721985,
        -0.04292887821793556,
        0.030107984319329262,
        -0.01932523027062416,
        -0.005219846963882446,
        -0.010846181772649288,
        -0.015355054289102554,
        -0.10091496258974075,
        -0.05882757157087326,
        0.01421049702912569,
        -0.045466527342796326,
        0.021928345784544945,
        -0.038461171090602875,
        -0.0722813606262207,
        -0.049906566739082336,
        -0.08728841692209244,
        -0.00830469187349081,
        -0.006906512659043074,
        -0.054117351770401,
        -0.07267677783966064,
        -0.01242891512811184,
        -0.03038056008517742,
        -0.003516019321978092,
        0.001623242860659957,
        -0.09147307276725769,
        -0.05139217898249626,
        0.02101065218448639,
        -0.019864795729517937,
        0.0451354943215847,
        0.04074391722679138,
        -0.06408646702766418,
        0.05898277834057808,
        -0.04083012416958809,
        0.040914297103881836,
        0.06398254632949829,
        0.025885559618473053,
        0.001425315742380917,
        -0.03138746693730354,
        -0.029790833592414856,
        0.018705755472183228,
        0.060503870248794556,
        -0.06871262192726135,
        -0.05388695374131203,
        -0.030959216877818108,
        -0.0004653820360545069,
        0.04201386123895645,
        0.08331787586212158,
        0.13249115645885468,
        0.024766048416495323,
        -0.00019739412527997047,
        -0.00072453822940588,
        0.08035323023796082,
        0.05062860995531082,
        0.05309850350022316,
        0.07293473184108734,
        0.1548810601234436,
        -0.08036097884178162,
        -6.70839241934118e-08,
        0.007275925949215889,
        0.04285226762294769,
        -0.0227813720703125,
        -0.023424632847309113,
        -0.0013460469199344516,
        -0.05273596569895744,
        -0.040070921182632446,
        0.007025169674307108,
        0.04665590077638626,
        -0.011716557666659355,
        0.09261073917150497,
        0.004571275319904089,
        0.05046899616718292,
        0.08445349335670471,
        -0.018308833241462708,
        -0.020476749166846275,
        -0.10751059651374817,
        0.11796049028635025,
        -0.07810608297586441,
        -0.09233107417821884,
        0.01216328889131546,
        0.026070082560181618,
        0.021753879263997078,
        -0.009524717926979065,
        0.06303183734416962,
        -0.039134569466114044,
        -0.049063827842473984,
        0.02101769857108593,
        0.026539728045463562,
        -0.0007822580519132316,
        0.003840018529444933,
        0.02684224769473076,
        -0.025673996657133102,
        -0.030563872307538986,
        -0.08471452444791794,
        -0.04424523189663887,
        -0.048331309109926224,
        -0.034219056367874146,
        -0.0194261372089386,
        0.06645987927913666,
        -0.06568007916212082,
        -0.09247393906116486,
        -0.06209997087717056,
        0.02182583138346672,
        0.011360345408320427,
        -0.0938430055975914,
        -0.007345342542976141,
        -0.1046985536813736,
        -0.062533900141716,
        -0.014235267415642738,
        -0.0541912317276001,
        0.026873676106333733,
        0.030015859752893448,
        -0.025695856660604477,
        0.06857559084892273,
        0.07065340131521225,
        -0.027372166514396667,
        0.05095478147268295,
        -0.05757266283035278,
        -0.029942652210593224,
        0.01945464126765728,
        -0.009638462215662003,
        -0.024332966655492783,
        0.006211108528077602
    ]
}