{
    "id": "9aCg7jH4S1w",
    "title": "Mark Zuckerberg on Threads, Elon Musk, AI, the Quest 3, and more",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-09-27T18:00:08Z",
    "video_url": "https://www.youtube.com/watch?v=9aCg7jH4S1w",
    "category": "Science & Technology",
    "tags": [
        "mark zuckerberg",
        "meta",
        "elon musk",
        "AI",
        "artificial intelligence",
        "threads",
        "Quest 3 headset",
        "quest 3",
        "meta quest 3",
        "quest 3 release date",
        "meta quest",
        "twitter",
        "x twitter",
        "facebook",
        "instagram",
        "ray ban",
        "ray ban smart glasses",
        "smartglasses",
        "virtual reality",
        "meta quest pro",
        "quest 3 news",
        "quest 3 specs",
        "meta quest 3 news",
        "the verge",
        "tech",
        "alex heath"
    ],
    "views": 227053,
    "likes": 4820,
    "comments_count": 452,
    "description": "In a rare interview, Meta CEO Mark Zuckerberg joined The Verges deputy editor, Alex Heath, to discuss where AI is going next, the new Quest 3 headset, Threads, and his ongoing rivalry with Elon Musk. #Meta #Technology #AI   Read more:   0:01 Mark Zuckerberg vs. Elon Musk MMA fight 2:45 Threads launch; Twitter under Musk 8:41 ChatGPT and AI 9:50 Threads feedback (real time feeling, news coverage) 11:44 Decentralized social media 17:00 AI regulation (AI summit) 20:38 Open vs. closed source AI 28:45 Metas AI agent and characters 31:35 AI business and consumer use cases; Kylie Jenner AI assistant; AI use cases (gaming, travel) 43:42 Metaverse and VR (holograms, smart glasses, Ray-Ban) 48:55 Meta Quest 3 (gaming, social, productivity; VR chat, Horizon Worlds, Roblox) 51:43 Apple Vision Pro competition 56:44 AR glasses 1:02:44 Motivation  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "https://bit.ly/46bsexF",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "- Mark, I gotta be honest, not long ago I was thinking we may be doing this as like a post-fight interview in Las Vegas, right outside of the Octagon after you get out of a fight with Elon. - Maybe next year. - Maybe next year. - No, not Elon, but, but someone, I wanna keep competing, but I just need to find someone to ask. - Do you think he was ever serious about fighting? - I don't know, you'd have to ask him. But I don't know, I mean this is like a thing that just, I really enjoy doing it as a sport so- - Yeah. - So for me there's a sort of level of it's competition. It's a sport. And so, I mean, I love doing it. I trained with a bunch of guys and I definitely want to compete more, but- - Are there any other tech CO rivals you would wanna fight if you could or- - No, I think it'll be more fun to fight someone who actually fights. - Takes it seriously. - Yeah. - Yeah. - Yeah, so this is like their, yeah. - So settling tech business rivalries by combat, you don't think that's gonna become like a thing now? - No, I don't think so. I think that's not generally the direction that our society is heading. - It's probably for the best. - It probably is for the best. I think a little bit of a channel to get some aggression out is good. - Yeah. - I think the one that was proposed with Elon could have been fun, but it's okay. - Well I guess what I'm saying is like, if he told you, if he came back to you and said, I'll fight on your terms, you pick the venue, would you still do it? - I don't think it'll happen. - Okay. - I don't think it'll happen. - Okay. Fair, I agree with you. - Yeah, I just think that it's like, there's sort of a valorization where people look at this stuff and are like, oh, I could do that. But I mean, you have to train, you know? - Yeah. - It's like you wanna, it's very technical. It's very fun. - Yeah. - Very intellectual. I mean, I used to, when I was a lot younger, I used to fence competitively and a lot of the striking aspects, I mean obviously it's different cuz I've been fencing, you're playing for points, right? So when you get a touch, the point is, and the sequence is done. Whereas here you have to worry about being countered and all that. But it's very intellectual. I used to, I really enjoyed, you know, thinking about all the different combos and moves and all that. And there's a period where you're ramping up and like learning all the basic stuff before you can really get to the intellectual part of it. But once you're there, I don't know, it's super fun. I love doing it with friends and it's- - So your mind isn't just like shut off when you're doing it? - No. - Like you actually find it to be mentally stimulating. - Yeah. - Interesting. Last year when Elon was close to taking over Twitter, I asked you for if you had any advice for him. I'm not gonna ask you to give him advice this time, but a lot has changed in a year. You've got threads now out, and I'd love to get into why you did threads when you did, and the approach that you took and kind of when you made that decision. Cuz it seemed like it happened pretty quickly. - Yeah, you know, I've always thought that the, I think the aspiration of Twitter, right, to build this, you know, text-based discussion should be a billion person social app, right? I mean, there are certain kind of fundamental social experiences that I look at them and I'm just like okay, like if I were running that I could scale that to reach a billion people. And that's one of the reasons why over time we've done different acquisitions and why we've considered them is when I've looked at different products, I'm like, okay, yeah, I think that that is like something really good there we can get that to be a billion people. - You tried to buy Twitter way back in the day, right? Like many, many years ago. - Yeah, I mean we had conversations. I think this was, gosh, this was I think when Jack was leaving the first time. And look, I get it I mean different entrepreneurs have different goals for what they wanna do, and some people wanna run their companies independently. And that's cool. I mean, it's good that there's sort of a diversity of different outcomes, but I guess Twitter was sort of plodding along for a while before Elon came and I think the rate of change in the product was pretty slow, right? So it just didn't seem like they were on the trajectory that would maximize their potential. And then with Elon coming in I think there was certainly an opportunity to change things up. And he has, right? I mean he's definitely a change agent. - Yeah. - Right? And I think it's still not clear exactly what trajectory it's on, but I do think he's been pretty polarizing. So I think that the chance that it sort of reaches the full potential on the trajectory that it's on is, I don't know, I guess I'm probably less optimistic or just think there's less of a chance now than there was before. - [Interviewer] Hmm. - But I guess just watching all this play out just kind of reminded me and rekindled the sense that like someone should build a version of this that can be more ubiquitous. And I look at some of the things around it. Like I think these days people just want kind of a, well, let's put it this way, I think a lot of the conversation around social media is around sort of like information and the utility aspect, but I think an equally important part of designing any product is how it makes you feel, right? What's the kind of emotional charge of it and how do you come away from that feeling? And I think Instagram is generally kind of on the happier end of the spectrum. I think Facebook is sort of in the middle because it has happier moments, but then it also has sort of harder news and things like that, that I think tend to just be more critical and maybe make people see some of the negative things that are going on in the world. And I think Twitter index is very strongly on just being quite negative and critical. - [Interviewer] Yeah. - It's not, you know, I think that that's sort of the design, it's not that the designers wanted to make people feel bad, I think they wanted to have like maximum kind of intense debate, right? Which and I think that that sort of creates a certain emotional feeling and load. And I always just thought you could create a discussion experience that wasn't quite so negative or toxic. And I think in doing so it would actually be more accessible to a lot of people. I think a lot of people just don't want to use an app where they come away feeling bad all the time. Right? I think that there's a certain set of people will either tolerate that cuz it's their job to get that access to information, or they're just warriors in that way. - Yeah. - Where they wanna be a part of that kind of intellectual combat. - Yeah. - But I just, I don't think that that's the ubiquitous thing. - [Interviewer] Right. - I think the ubiquitous thing is like people they wanna get fresh information. I think that there's a place for text-based, right? Even when the world is moving towards richer and richer forms of sharing and consumption. I think that text isn't going away. It's still gonna be a big thing, but I think how people feel is really important. So that's been a big part of how we've tried to emphasize and develop threads and over time, if you want it to be ubiquitous, you obviously wanna be welcome to everyone, but I think how you see the networks and the culture that you create there, I think ends up being pretty important for how they scale over time. Or with Facebook we started with this real name culture and it was grounded to your college email address and now it obviously hasn't been grounded to your college email address for a very long time, but I think the kind of real authentic identity aspect of Facebook has continued and continued to be an important part of it. So I think how we set the culture for threads early on in terms of being a more positive, friendly place for discussion will hopefully be one of the defining elements for the next decade as we scale it out. We obviously have a lot of work to do, but I'd say it's off to a quite a good start. I mean it's, and obviously there was the huge spike and then not everyone who tried it out originally is gonna stick around immediately. But I mean, the monthly actives and weeklies, I mean I don't think we're sharing stats on it yet- - You can if you'd like. - But it's good. No, I mean, I feel quite good about- - Really? - About that. - Cuz there's been the reporting out there that engagement kind of, which I think is natural with any spike like that- - Yeah. - Your engagement's not gonna sustain, you guys kind of set I think the original industry standard on engagement for these kind of products. So I assume you're guiding towards a similar kind of metric that you- - Yeah, we just have this playbook for how we do this. - Yeah. - And there's like phase one is build a thing that kind of sparks some joy and that people appreciate. Then from there you want to get to something that is retentive so that way people who have a good experience with a thing come back and want to keep using it. And those two things are not, they're not always the same. There are a lot of things that people think are awesome, but may not, you know, always come back to, I mean, I think some of what people are seeing now around like chatGPT is part of that. It's like, I mean this is like this level of AI is, it's like a miracle, right? It's awesome. But I mean that doesn't mean that everyone is gonna have a use case every week. Right? - Right. - So I think that there's first is like create the spark. Second is create the retention. Then once you have retention, then you can start encouraging more people to join. But if people aren't gonna be retained by it, why would you ask people to go sign up for something? - [Interviewer] Sure. - Right? So kinda step one, spark, step two, retention, step three, growth and scaling the community. And then only at that point is step four, which is monetization. And I mean we take a while to go through all those. I mean we're really in some sense only getting started on the monetization of the messaging experiences. Like WhatsApp now with stuff like business messaging- - Took a while. - Two billion people use the product every day, right? - Right. - So I mean, we scaled it pretty far, but I think with our model that that sort of works so. - To really, I don't, I mean, I know you're saying you want to not necessarily, you are competing with Twitter, but you're trying to do it differently. To me as a Twitter addict for way too long and a very early threads user and I've been seeing similar feedback from others like Adam Oseri has been asking for feedback on threads. Is that it kind of still lacks that real time feeling when you first open it of like, I'm gonna be getting fresh cuz like what's what I go to Twitter for is news. - Yeah. - And I know you guys aren't necessarily trying to emphasize news in this experience, which is a whole nother topic really, but like how do you get that kind of Twitter like this is what's going on right now feeling? I don't know if you agree. - Yeah no, I think it's a thing that we'll work on improving, but I mean, hard news content isn't the only fresh content. - [Interviewer] Sure. - I think even within news there's a whole spectrum between sort of hard critical news and like people understanding what's going on with the sports that they follow. - [Interviewer] Right. - Or the celebrities that they follow or things like that. And a lot of those things don't kind of leave people with the same, it's not like as cutting right, as a lot of the kind of hard news and especially the political discussion, I think is just so not, it's so polarized that I think it's hard to come away from reading news about politics these days feeling good. - Yeah. - Right? And so I think that that's, but that doesn't go for everything. And part of this overall is just how you tune the algorithm to basically encourage either recency or quality, but less recency. So I'm not sure that we have that balance exactly right yet it may be the case that in a product like Threads where people may want to see more recent content as opposed to something like an Instagram or Facebook where it's more visual and the balance might just be towards balancing towards maybe a little more quality even if it's 12 hours ago instead of two hours ago. So I think that this is the type of stuff that we need to tune and kind of optimize, but yeah, I think I agree with that point. - This hasn't happened yet with Threads, but you're eventually gonna hook it into Activity Pub, which is this decentralized social media protocol. - Yeah. - It's kind of complicated in layman's terms, but essentially people run their own servers. So instead of having a centralized company run the whole network, people can run their own fiefdoms. It's federated. - [Mark Zuckerberg] Yeah. - So Threads will eventually hook into this. - [Mark Zuckerberg] Yeah, yeah. - This is the first time you've done anything I think really meaningful in the decentralized social media space. - Yeah and we're building it from the ground up. - Yeah. - I mean, I've always believed in this stuff, I mean, a lot of this hasn't- - I mean, because you run the largest centralized social media platform. - But I mean it didn't exist when we got started, right? And I think the project of like, I mean I've had our team at various times do the thought experiment of like, all right, what would it take to move all of Facebook onto some kind of decentralized protocol? And it's like, that's just not gonna happen. There's so much functionality that is on Facebook that like it's way too kind of complicated- - And well the technical data- - Support all the different things. - Yeah. - And it would just take so long and you'd not be innovating during that time. And I think that there's value in being on one of these protocols, but it's not the only way to deliver value. So the opportunity cost of doing this massive transition is is kinda this massive thing, but when you're starting from scratch you can just design it so it can work with that. And we wanted to do that with this because I thought that that was one of the interesting things that's evolving around this kinda the Twitter competitive space as a lot of the others. There is a real ecosystem around that and I think it's interesting. - So what does that mean for a company like yours long term if people gravitate more towards these decentralized protocols over time? Where does a big centralized player fit into that picture? - Well, I guess my view is that the more that there's interoperability between different services and the more content can flow, the better all the services can be. And I guess I'm just confident enough that we can build the best one of the services that I actually think that we'll benefit and we'll be able to build better quality products by our products making sure that we can have access to all of the different content from wherever anyone is creating it. And like I get that not everyone is gonna wanna use everything that we build. I mean, that's obviously the case. I mean, it's like, okay we have 3 billion people using Facebook, but not everyone wants to use one product. And I think the making it so they can use an alternative, but can still interact with people on the network will make it so that that product also is more valuable. You can increase the quality of the product by making it so that you can give people access to all the content, even if it wasn't created on that network itself. - Hmm. - So, I don't know. I mean, it's a bet. - Yeah. - I think it takes some confidence, but I don't know. I think it's both good to give people choice. I dunno, there's kind of this funny counterintuitive thing where I just don't think that people like feeling locked into a system. - Yeah. - So in a way I actually think people will feel better about using our products if they know that they have the choice to leave. - Hmm. - Right? And if we make that super easy to happen and obviously there's a lot of competition and I mean we do download your data on all our products and like people can do that today. But like the more that that's designed in from scratch, I think it really just gives creators for example, the sense that okay, like I'm not, it's I have a- - Agency. - Yeah. - Yeah. - Yeah, so in a way that actually makes people feel more confident investing in a system if they know that they have freedom over how they operate. So, I don't know, I think it's maybe for phase one of social networking it was fine to like have these systems that people felt a little more locked into, but I think for the mature state of the ecosystem, I don't think that that's gonna be where it goes. So I dunno, I'm pretty optimistic about this. And then if we can build Threads on this then maybe we can over time as the standards get more built out, it's possible that we can spread that to more of the stuff that we're doing. - Hmm. - We're certainly working on Interop with messaging. - Yeah. - And I think that that's been an important thing. The first step was kind of getting Interop to work between our different messaging systems. - Right, so we can talk to each other. - Yeah and then the first decision there was, okay, well WhatsApp, you know, we have this very strong commitment to encryption. So if we're gonna Interop, then we're either gonna make the others encrypted or we're gonna have to decrypt WhatsApp. And it's like, all right, well we're not gonna decrypt WhatsApp, so we're going to go down the path of encrypting everything else, which we're making good progress on, but that basically has just meant completely rewriting Messenger and Instagram direct from scratch. So you're basically going from a model where all the messages are stored in the cloud. It's like you're completely inverting the architecture where now all the messages are stored locally and just the way that they're- - While the plane's in the air. - Yeah, yeah. So I mean, that's been sort of this like, heroic effort by just like a hundred or more people over like a multi-year period. And we're basically getting to the point where it's starting to roll out now, but you know now that we're at the point where we can do encryption across those apps, we can also start to support more Interop. Which I think is gonna be interesting too. - With other services like Meta that Meta doesn't own other messaging apps. - Yeah well I mean, the plan was always to start with Interop that between our services, and then to get to that, but yeah, we're starting to experiment with that too. - I promise to stop bringing up Elon, but you and he were together with Senator Chuck Schumer at the White House recently for this big AI summit and a lot of it was closed. - Along with a lot of other people. - Along with a lot of other people. You guys were sitting at opposite sides of the table. I thought that was an interesting choice. What was your takeaway from that and kind of where the government is in the US on regulating AI? What do you think is gonna happen? - Well, I didn't really know what to expect going into that conversation, but it was quite substantive. And I think it, you know, I think we covered a lot more ground than I expected. And the thing that was interesting, I mean, your question you asked about what does it say about where the government is? But aside from Senator Schumer who basically moderated the discussion, it was really an opportunity for I guess for them to hear from the people in the tech industry, but also folks in civil society. I mean, you had people running unions, you had people from Hollywood and representing all the kind of creative industry and intellectual property. You had researchers, people focused on AI safety. And one of the things that I actually thought was the most interesting was the senators didn't really speak that much. There's sort of the meme that it's like, okay, like a lot of these politicians, they'll go to a place where they'll get attention for themselves- - Yeah. - But this was a three hour event and I think there were like 40 senators like sitting and listening and taking notes and not really participating in the discussion, but just there I think to learn. And I thought that was super interesting. - Yeah. - Right? In a way that I think sort of reflects pretty well on our system and the intellectual curiosity of the people who are ultimately gonna be making those kind of legislative decisions. So I thought that was fascinating to see. - Yeah. - But no, I mean, I didn't come away, you know, apart from seeing their heads nod when certain people made certain points, it wasn't a time for us to really get their sense on where they are. I think it was more just they were hearing the discussion of the issues. - Have you seen some of the, I don't think it's necessarily focused at you specifically, but the criticism that the tech industry is performing regulatory capture right now with AI and is essentially trying to take the drawbridge up with them here, are you worried about that at all? - I have seen that concern and I'm somewhat worried about it myself. I mean, look, I think that there are real concerns here. So I think that- - [Interviewer] Sure. - I think a lot of these folks are truly earnest in their concerns. And I think that there is valuable stuff for the government to do. I think both in terms of protecting American citizens from harm and preserving I think what is a natural competitive advantage for the United States compared to other countries. I think this is just gonna be a huge sector and it's gonna be important for everything, not just in terms of the economy, but there's probably defense components and things like that. And I think the US having a lead on that is important. - [Interviewer] Sure. - And I think having the government think through, okay, well how do we wanna leverage the fact that we have the leading work in the world happening here, and how do we wanna kind of control that and to what restrictions do we wanna put on that getting to other places? I think that that makes sense. So I know there are a bunch of concerns there that I think are real. You know, one of the topics that I've spent a lot of time thinking about is open source. - Yeah. - Right because we do a lot of open source work at Meta, obviously not everything we do is open source. There's a lot of closed systems too. I'm not like a zealot on this, right? But I think I'm probably, I lean probably a little more pro open source than most of the other big companies. And we believe that it's generally positive to open source a lot of our infrastructure for a few reasons. I mean, one is like, we don't have a cloud business, right? So it's not like we're selling access to the infrastructure. So giving it away is fine. And then when we do give it away, we generally benefit from innovation from the ecosystem. And when other people adopt the stuff, it increases volume and drives down prices. So if you look at stuff like- - Like PyTorch for example, - Well, when I was talking about driving down prices, I was thinking about stuff like open compute. - Yeah. - Where we open sourced our server designs and now the factories that are making those kind of servers can generate way more of them because other companies like Amazon and others are designing this or like ordering the same designs that drives down the price for everyone, which is good. PyTorch is great because it basically makes it, that it's like the standard across the industry as people develop with this, which means that more libraries and modules are created for it, which just makes it better and it makes it better for us to develop internally too. So, and then all that stuff is true and works well for open source. And also I think it's pretty well established that open source software is it's generally more secure and safer because it's just more scrutinized, right? When more people can see stuff, every piece of software has bugs and issues. But the more people who can look at it, you know, the more you're gonna basically identify what those issues are and have eyes on fixing them. And then also because there's sort of a standard and that's deployed across the industry, those fixes get rolled out everywhere, which is a big advantage for safety and security. And when I think about AI safety, I think one of the big issues, if there's like a single super intelligence and it's closed and someone figures out how to exploit it, then like everyone kinda gets screwed at the same time. Whereas in an open source system, it's like okay, people find issues and just like your Mac or whatever gets patched right, it's like people find the issues and then it just gets rolled out across the industry. - Yeah. - So I think that's generally positive, but there's obviously this whole debate where when you open source stuff, I mean, we can build in safeguards, but if you open source something you're not fundamentally gonna be able to prevent bad guys from taking that and running with it too. Something that there is sort of this debate around, okay, well what's the balance of, how capable do you want the models that are open source? And I think that there is a real debate there. I do sometimes get the sense that some of the folks whose business model is to basically sell access to the closed models that they're developing. I do think that they have to be careful because they are also talking their book when they're talking about dangers of open source. - [Interviewer] Right. - And I think that there are dynamics like that that happen that I hear eithe- - [Interviewer] Sure. - You know, overtly or sometimes behind closed doors, something will get back to me that's like, oh, like this company was kind of talking about why they're kind of against open source and it's like, yeah well their whole business depends on selling access to proprietary models. So I think you gotta be careful about that. So I do think the regulatory capture thing I think you need to be careful about for things like that because I do think one of the big benefits of open source is it also just decreases the cost of adoption for small companies and a lot of other folks. So I do think that's gonna be a big thing. - Which I think Llama and the Llama Two release has been a big thing for startups because it is so free. - Yeah. - Or just easy to use access. - Yeah. - And I guess I'm wondering, did you ever, was there ever debate internally about should we take the closed route you spent? - Oh yeah. - I mean you spent so much money on all this AI research, you have one of the best probably AI labs in the world I think it's safe to say. You have huge distribution. Why not keep it all to yourself? You could have done that. - Yeah, you know, the biggest arguments in favor of of keeping it closed were generally not proprietary advantage. - Or competitive advantage? - No, no, it wasn't competitive advantage. I think it's, the two, and there was a fairly intense debate around this. - And did you have to be dissuade? Did you know we have to have it open and you- - My bias was that I thought it should be open. - Okay. - But I thought that there were novel arguments on the risks and I wanted to make sure we heard them all out and we did a very rigorous process. And my guess is that when we're training the next version of Llama now and I think we'll probably have the same set of debates around that and how we should release it. And again, I sort of like lean towards wanting to do it open source, but I think we need to do all the red teaming and understand the risks and before making a call. But I think the two big arguments that people had against making Llama Two open were one is, is just that it takes a lot of time to prepare something to be open. So, I mean, our main business is basically building consumer products, right? And that's where we're launching at Connect. - Right. - Llama Two is not a consumer product, it's sort of the engine or infrastructure that powers a bunch of that stuff, but there was this sort of this argument, especially after we sort of did this partial release of Llama One and there was like a lot of stir around that and then people had a bunch of feedback and were wondering when we were incorporate that feedback, which kinda like, okay, well if we release Llama Two is that gonna distract us from our real job, which is building the best consumer products that we can. So that was one debate. I think we sort of got comfortable with that relatively quickly. And then the much bigger debate was around the risk and safety. - [Interviewer] Hmm. - And I think it's sort of like how do you, what is the framework for how you measure kind of what harm can be done and how do you compare that to other things, you know? So for example someone made this point recently, and this was actually at the Senate event. I mean, someone made this point that's like, okay, well you know, we took Llama Two and our engineers in just several days we're able to take away the safeguards and ask it a question to can you produce anthrax? And it answered and it's on its face that sounds really bad. Right? That's obviously an issue that you can strip off the safeguards until you think about the fact that you can actually just Google how to make anthrax and it shows up on the first page of the results in five seconds, right? So I do think that there's a question when you're thinking through these things about what is the actual incremental risk that is created by having these different technologies. And maybe like, I think a lot of this stuff, we've seen this in like protecting social media as well. If you have like Russia or some country trying to create a network of bots or inauthentic behavior, it's not that you're ever gonna stop them from doing it, it's sort of an economics problem. You wanna make it expensive enough for them to do that, that it is no longer their best strategy because it's cheaper for them to go try to exploit someone else or something else, right? And I think the same is true here, right? So for the risk on this, you wanna make it so that it's sufficiently expensive that it takes engineers several days to dismantle whatever safeguards we built in instead of just Googling it, right? So, so- - [Interviewer] You feel generally good directionally with the safety work on the- - For Llama Two I mean I think that we did leading work on that, I think the white paper around Llama Two where we basically outlined all the different metrics and all the different things that we did. - [Interviewer] Yeah. - And we did internal red teaming and external red teaming. And we've got a bunch of feedback on it. So because we went into this knowing that nothing is gonna be foolproof, right? It like said we're gonna, some bad actor is going to be able to find some way to exploit it. We really knew that we needed to create a pretty high bar on that. So yeah, no, I felt good about that for Llama Two, but it was a very rigorous process. - And you guys have now announced the Meta AI agent, which is your proprietary, I'm sure it's using Llama technology, but it's a closed model. You're not really disclosing a lot about the model and its weights and all that. - Yeah. - But this is the new agent that people are gonna be seeing in the apps. - Yeah, yeah., so I mean, at Connect we announced a bunch of different things on this. So Meta AI and the other AI's that we released they're based on Llama Two, right? So it's not like exactly the same thing that we open sourced because we used that as the foundation and then we kind of like built on top of that to build the consumer products. But yeah, there were a few different things that we announced. So like Meta AI- - I feel like that part, the AI to me feels like the biggest deal in the near term cuz a lot of people are gonna be seeing it. It may be the first time, even with all the coverage of like GPT, it may be the first time that a lot of people experience a chat bot like this actually. - Yeah I mean, I'm really curious. - Which is different because- - Yeah, I'm very curious to see how this stuff gets- - I used it for a little bit and it has web, you know it can pull in web results so it's got recency, which is nice. It wouldn't give me advice on how to break up with my girlfriend, but it- - [Mark Zuckerberg] It wouldn't? - I don't, I know of a girlfriend. I was just trying to see like what I'm married, but I was trying to see what it won't and will answer. It seems relatively safe. - It seems like the type of thing that it should be fine giving you advice. - Well, I'm just telling you. But what do you imagine people using this for? Cuz it's got that search engine component, but it can do a lot of things. Is this a pure GPT, Chat GPT competitor in almost every way in your mind? Or how do you think about it? - Well, I think that there's a bunch of different spaces here so that I think people are gonna wanna interact with AI around. Take a step back. I think that the vision for a bunch of folks in the industry when I look at like open AI or Google is the sense that there's gonna be like one big super intelligence and they want to be it. - [Interviewer] Yeah. - I just don't think that that's the best future. I think the way that people tend to process the world is we don't have one person that we go to for everything. We don't have one app that we go to for everything. I don't think that we want one AI. - It's overwhelming. I find this with the current chat bots, I'm like I feel like it can do so much that I'm not actually sure what to ask it. - Yeah, so I mean our view is that there are actually gonna be a lot of these, right? That people talk to you for different things and one thought experiment that I did to sort of prove to myself that this would be the case is like, all right, let's say you're a small business and you want to have an AI that can help you interface with customers to do sales and and support. You wanna be pretty confident that your AI isn't gonna be promoting your competitor's products. - [Interviewer] Sure. - Right? So you want it to be yours, you want it to be aligned with you. So you're gonna want a separate agent then your competitor's agent. So then you get to this point where, okay, well there are gonna be a hundred million AI just helping businesses sell things. Then you get the creator version of that where like every creator I think is gonna want an AI assistant or something that can help them build their community and people are gonna really want to interact with it's like there's just way more demand to interact with creators and celebrities. - There's only one Kylie Jenner. - Yeah. - And like you can you- - So it's this, I mean there's I think a huge need here. People wanna interact with Kylie, Kylie wants to cultivate her community, but there are only so many hours in a day. - Right. - So creating an AI that's sort of an assistant for her or it'll be clear to people that they're not interacting with like the physical Kylie Jenner. It would be kinda an AI version and that'll help the creators and I think it'll be fun for consumers. That one's actually really hard. There's a lot of work on, I guess you can call it brand safety concerns cuz like you really wanna make sure that these AI's like reflect the personality of the creator and don't talk about things that the creator doesn't want to get into or- - [Interviewer] Right. - Don't say things that are gonna be problematic for the creator and they're endorsing fields. - I feel like having input in all of this, they should be able to like say I don't want this. - Oh yeah, yeah, but I think in some ways the technology doesn't even exist yet to make it that trained. I mean this isn't code in the deterministic sense. It's like a model that you need to be able to train it to stay within certain bounds. And I think a lot of that is still getting developed. - So that's more next year. - Yeah. So anyhow, there's businesses, there's creators. That stuff is fun where the business stuff is I think more useful. And then I think that there's a bunch of stuff that's just interesting kind of consumer use cases. So there's more of like the utility, which is what Meta AI is like answer any question, you'll be able to use it to help navigate your Quest3 and the new Ray-Ban glasses that we're shipping, which we should get to that in a second. - Yeah. - Because that'll be pretty wild, is having Meta AI that you can just talk to all day long on your glasses. So yeah, I think that'll be pretty powerful. But then there are also gonna be all these other new characters that are getting created. - [Interviewer] Yeah. - Which is somewhat of an easier question to start with than having AI that are kind of acting as a real person because there aren't as many kind of brand safety concerns around that, but they could still be pretty fun. So we're experimenting with a bunch of different AI's for different interests that people have, whether it's interested in different kinds of sports or fashion or- - The one I tried was a travel agent type. - Yeah travel, yeah. There's some that are more around giving people advice. There's like life coach and like an aunt, right? And then there's some that are more gamey, right? So there's like Snoop Dog is playing the Dungeon Master and that I think is there's like a few that are just these text-based adventure games and the ability to just drop that into a Thread and play a text-based game I think is gonna be super fun. So I think like part of this is we want to create a diversity of different experiences to see what resonates and what we want to go deeper on. This is sort of the first step towards building this AI studio that we're working on that will make it so anyone can build their own AI's. Sort of just like you create your own UGC, your own content on across social networks. So you should be able to create your own AI and publish it. And I think it's gonna be really wild. - I do agree it's gonna be wild. There's a bit of an easiness to it for me of just the idea that we as a society are going to be increasingly having relationships with AI. I mean there's stories about like character AI, which has a similar kind of library of personas you can interact with and people literally like falling in love with some of these chatbots. I mean, what do you think about that phenomenon? Is it just inevitable with where the tech is going? - That's not where we're starting. So I think that there's a lot of use cases that are just a lot more clear than that right, in terms of someone who can help you make workouts, right? Someone who can help you with cooking- - More utility. - Help you figure out travel, right? Or even like the game type stuff. I think that there's more kind of, I think that a bunch of these things can help you in your interactions with people. And I think that that's more our natural space. One of the things that I think is gonna be, that we can do that's harder for others to do is the ability to make it so you can drop these into group chats, right? So we're starting with Meta AI, you can just invoke it in any Thread. Like I could be having a one-on-one thread with you and I could just ask meta AI something. I can do that in a group chat thread. So I think that that's gonna be really fun, right? It's just having these kind of fun personalities in these threads I think will create sort of an interesting dynamic. I think especially around image generation. And we haven't talked about that as much. - I used that it was pretty impressive and it was fast. - I think the team has made awesome progress. I mean we're at good photorealistic quality, but yeah like you said, I think that- - For people who haven't used it yet, you just type into the bot what you want the image to be and it'll just make it. - Yeah and the fact that it's fast and free I think is gonna be pretty game changing. There are photo realistic image generators out there, but a lot of them, they take a minute. - They're hard to use. You have to have the discord or whatever. - Yeah and you have to pay a subscription fee. - [Interviewer] Yeah. - So I think having it be free, fast, able to exist in group chat threads. I think people are just gonna create a ton of images for fun. And I don't know, I'm really curious to see how this gets used, but I think it's gonna be super fun. I mean, I already just sit there with my kids and we'll just keep on like, I mean the word that you say to get it to make an image is imagine. And like my daughter's just like, oh, I just wanna play imagine. And I'm just like, imagine this. And it's like we get an image and it's like, oh, well I actually wanna change it. So imagine this and like edit the prompt. But because it's just a five second turnaround, you could do that so easily and you could do it over the internet with group chat. I'm not doing that sitting there with my daughter, but I think that that's gonna be really fun. So I think that there are all these things where you can use these tools to facilitate connections and just create entertainment, which is actually probably more what the technology is capable of today than even some of the more utility use cases because there is the factuality issue. - Yeah. - But I mean with the hallucinations and all that, and we're trying to address that by doing the partnerships with search engines right, that you mentioned. So I mean you can type in a question and ask real time like who won this fight this weekend and it'll be able to go do a search and bring that in. But there's still, you know, I think hallucination hasn't been solved completely in any of these. So I think to some degree the thing that these language models have really been best at is, I mean, it's kind of what the name Generative AI suggests being generative, right? Suggesting ideas, coming up with things that could be interesting or funny are much better than like I wouldn't necessarily yet want it to be like my doctor and ask it for a diagnosis and have to rely that it's not hallucinating. So I think having it fit into a consumer product where the primary goals are- - Interacting. - Interesting content and entertainment is actually maybe a more natural fit for what the technology is capable of today than some of the initial use cases that people thought about. It was like, oh, it's gonna be this kind of like all intelligent assistant or it's gonna be my new search engine or something. - Right. - I mean it's fine for those a bunch of the time and I think it will be, it'll get there right, over the next few years, but I think the consumer thing is actually quite a good fit today. - It seems like a key differentiator for Meta in the whole model race is you have probably second to maybe Google the most user data to train on. And I know a lot of it's private and you wouldn't train on like ever train on like private chats or WhatsApp. - No, we don't. - WhatsApp's encrypted too, but like public stuff, reels, public Facebook posts. - Yeah. - That seems pretty natural for this. Is that in feeding Meta AI right now? - Yeah, I mean, like you said, we don't train on kind of private chats that people have with their friends or things like that, but yeah- - But you're sitting on this just massive cord of data. - Yeah, I- - That could be interesting in a model like this. - I actually think a lot of the stuff that we've done today is actually still pretty basic. So there's a lot of upside and I think we need to experiment with to see what ends up being useful. But I mean, one of the things that I think is interesting is these AI problems, they're kinda so tightly optimized that having the AI basically like live in the environment that you're trying to get it to, get better at, is pretty important. So like, so for example, you know, you have things like chatGPT, they're just in like a kind of abstract chat interface, but having it's getting an AI to actually live in a group chat for example, is actually a completely different problem because now you have this question which is, okay, when should the AI jump in, right? And so it actually, like in order to get an AI to be good at being in a group chat, you need to have experience with AI's in group chats, which even though like, I don't know, Google or Open AI or other folks may have a lot of experience with other things, that kind of like product dynamic of having the actual experience that you're trying to deliver the product in. I think that that's super important. Similarly, one of the things that I'm pretty excited about, I think multimodality is pretty important interaction, right? I think a lot of these things today are like, okay you're an assistant, I can chat with you in a box, you don't change, right? It's like you're the same assistant every day. And I think that that's not really how people tend to interact, right? It's like in order to make things fresh and entertaining, even the apps that we use, they change, right? They get refreshed, they add new features and I kind of think that people will probably want the AI's that they interact with. I think it'll be more exciting and interesting if they do too. So part of what I'm interested in is this isn't just chat, right? Chat I think will be where most of the interaction happens, but these AI's are gonna have profiles and Instagram and Facebook and they'll be able to post content and they'll be able to interact with people and interact with each other, right? And I think that there's this whole like interesting set of flywheels around how that interaction can happen and how they can sort of evolve over time and I think that that's gonna be very compelling and interesting and I mean obviously we're kind of starting slowly on that, but I think that having them sort of exist in that environment and then, you know, including, so we wanted to build it so that it kind of worked across the whole Meta universe of products, including having them be able to in the near future be embodied as avatars in the Metaverse, right? So you go into VR and you have an avatar version of the AI and you can talk to them there. I think that that's gonna be really compelling, right? It's at a minimum creating much better NPCs and experiences when there isn't another actual person who you wanna play a game with. You can just have AI's that are much more realistic and kind of compelling to interact with. But I dunno, I think having this crossover where like you have an assistant or you have some, I don't know, someone who tells you jokes and kind of cracks you up and entertains you and then like they can show up in some of your metaverse worlds and be able to be there as an avatar, but you can still interact with them in the same way, I think it's pretty cool. - So you think the advent of these AI personas that are way more intelligent will accelerate interest in the Metaverse and VR? - Well, I think that all this stuff makes it more compelling. So I'm not, I mean, so yes, I think that this will kind of make all these things more useful. - [Interviewer] Yeah. - I think it's probably an even bigger deal for smart glasses than for VR. - You need something, you need a kind of visual or a voice control for someone. - Well I kind of thought, you know, when I was thinking about what would be the key features for smart glasses, I kind of thought that we were gonna get holograms in the world and that was one, so that's kind of like augmented reality, but then there was always some sort of vague notion that you'd have like an assistant that could do something. But I thought that things like Siri or Alexa were very limited, right? So I was just kinda like, okay, well like over the time period of building AR glasses, like hopefully the AI will advance and now it definitely has. - Yeah. - So now I think we're at this point where it may actually be the case that for smart glasses, the AI is compelling before the holograms and the displays are, which is sort of where we got to with the new version of the Ray-Bans that we shipped that we're shipping this year, right? It's when we started working on the product, all this generative AI stuff hadn't happened yet. So we actually started working on the product just as an improvement over the first generation, right? So that the photos are better, the audio's a lot better, like the form factor's better, it's lighter. So it's just sort of like a much more refined version of the initial product. And there's some new features like you can live stream now, which is pretty cool right, you can live stream what you're looking at. But it was only over the course of developing the product that we realized that hey, we could actually put this whole generative AI assistant into it and you could have these glasses that are kind of stylish Ray-Ban glasses and you could be talking to AI all throughout the day about different questions you have. And you know this isn't in the first software release, but sometime early next year we're also gonna have this multimodality. So you're gonna be able to ask the AI, Hey, what is it that I'm looking at? Like what type of plant is that? Like where am I in order to use a camera? Like how expensive is this thing? - Yeah, I mean it has a camera built into the glasses. So you can just like look at something and you're like, all right, and you're filming with some Canon camera. It's like where do I get one of those? I think that that's, I think it'd be very interesting. - Yeah. - And again, this is all like really novel stuff, so I'm not pretending to know exactly what the key use case is or how people are gonna use that. But I think the idea, smart glasses are very powerful for AI because unlike having it on your phone, glasses as a form factor can see what you see and hear what you hear from your perspective. So if you wanna build an AI assistant that really has access to all of the inputs that you have as a person, glasses are probably the way that you wanna build that. - [Interviewer] Yeah. - And so, I don't know, I think that that's just really interesting and compelling, and it's sort of this whole new angle on smart glasses that I thought might materialize over a five to 10 year period. But in this odd twist of the tech industry, I think actually is gonna show up maybe before even super high quality holograms do. - Is overall interest in the Ray Bands and the Quest line kind of tracking with where you thought it would be at this point? - Well, I think you, let's take each of those separately. - Yeah, they're separate products, but- - So for Quest, we had Quest One was the first kind of standalone product, and it did well, but all the content had to be developed for it. So it was really when we developed Quest Two, which was the next generation of it that already had all the content built, and it was sort of the kind of refinement on it, that one blew up. So Quest Two was like a huge hit, tens of millions, right? And just that did very well and was sort of like the kind of defining VR device so far. Then we shipped Quest Pro, which was making the leap to mixed reality, but it was $1,500. And what we've seen so far is that at least consumers are very cost conscious. So we didn't expect to sell, well sorry, we expected to sell way fewer Quest Pros than Quest Twos and that beared out. - Yeah. - So I think it was like, it's always hard to predict exactly what it'll be when you're shipping a product at $1,500 for the first time. But like, I'd say it was kinda fine with expectations. It wasn't like a grand slam, but it was, it did fine. And now Quest Three is sort of the refinement on mixed reality, kind of like Quest One was, but with Quest Three we're sort of at the point where we've gotten mixed reality, which is even higher quality than what was in Quest Pro, but it's a third of the price right, so it's $500. So I'm really excited to see how that one will go. - It seems like you all, based on my demos, still kind of primarily think of it as a gaming device. Is that fair that the main use cases for Quest Three are gonna be, and these kind of gaming meets social, so you've got Roblox now. - Yeah, yeah, so I think social is actually the first thing, which is interesting. I mean cuz Quest used to be primarily gaming, and now if you look at what experiences are people spending the most time in, it's actually just different social metaverse type experiences. So things like Rec Room, VR Chat, Horizon, Roblox, when it shows up, but that's not, I mean, it's there. It's starting to scale, but I think Roblox can be a lot bigger than it is. But even with Roblox just kind of starting to grow on the platform, social is already more time spent than gaming use cases. - Hmm. - So now it's different if you look at the economics, because people pay more for games. - Sure. - Whereas social kind of has that whole adoption curve thing that I talked about before where first you have to kind of build out the big community and then you can enable commerce and kinda monetize it over time. But this was, I mean, this is sort of my whole theory for VR was people looked at it initially as a gaming device, and I thought, Hey, like I think this is a new computing platform overall. Computing platforms tend to be good for three major things. Gaming, social and communication and productivity. And I'm pretty sure we can nail the social one. If we can find the right partners on productivity, and if we can support the gaming ecosystem, then I think that we can help this become a big thing. So I'd say broadly that's sort of on track. I mean, it was like, I thought it was gonna be a long-term project, but I think the fact that social has now overtaken gaming is the most thing that people are spending the most time on, is an interesting software evolution in how they're used. - Mm-hmm. - But yeah, like you're saying, I mean, entertainment, social, gaming, still the primary things, productivity I think still needs some time. - Yeah. - To develop. - Yeah, I tried the Quest three. It's definitely a meaningful step change in terms of graphics and performance and all the things you guys have put into it. It feels still like we're a little ways away from this medium becoming truly mainstream, becoming something that new. - When you say mainstream do you mean- - Well, I know you're already at kind of console level sales, so you could say that's mainstream, but I guess in terms of like what you could think of as a general purpose computing platform. So even like PC or something like that, like, seems- - Well in what sense? I think there's a few parts of this. I think for productivity, you probably want somewhat higher resolution screens. - Right. - Right? So I think that that's, and that I think will come, and I think we're waiting for the cost curve to basically, we could have super high resolution screens today, it's just that the device would be thousands and thousands of dollars right, which is basically the trade off that that Apple made with with their Vision Pro. - Have you tried it yet? - No, I haven't, no. - Yeah. - But, but I- - You're right, they guided towards that one spec. You can tell that they guided towards resolution. - Yeah and you just have to imagine that over the next, you know, five plus years, like there will be displays that are that good and they'll come down in cost, and we're just sort of riding that curve. But I know, so for today, when you're building one of these products, you basically have the choice of if you have it at that expensive, then you'll sell hundreds of thousands of units or something. But we're trying to build something where we build up the community of people using it. So we're trying to thread the needle and have the best possible display that we can while having it cost $500, not $3,500. - Yeah, I reported on this some comments you made to employees after Apple debuted Division Pro, and you didn't seem super phased by it. Like it seemed like it didn't bother you as much as it maybe could have. I have to imagine if they released a $700 headset we would be a diff we'd be having a different conversation. - But yeah, I mean- - There should be low volume and they're probably three to four years out of a general, like a lower tier type release that's at any meaningful scale. So I guess, I mean, is it because the market's yours foreseeably then for awhile? - Well, I mean Apple is obviously very good at this, so I don't wanna be dismissive, but because we're relatively newer to building this, the thing that I wasn't sure about is when Apple released a device, were they just gonna have made some completely new insight or breakthrough that just made our effort - - Blew your R&D up. - Yeah, that it was just like, oh, like, well now we need to go start over or something. And to me that was the thing that I thought we were doing pretty good work, so I thought that was unlikely, but you don't know for sure until you see it. They show up with their thing and there was just nothing like that. Right, so I think that there are some things that they did that are clever. I think, well when we actually get to use it more, I'm sure that there are gonna be other things that we'll learn that are interesting, but mostly they just chose a different part of the market to go in it's sort of, I think it makes sense for them, right? I mean I think that they sell, it must be what 15 to 20 million MacBooks a year. And from their perspective if they can replace those MacBooks over time with things like Vision Pro, then that's like a pretty good business for them. - [Interviewer] Yeah. - Right? And it'll be many billions of dollars of revenue. And I think they're pretty happy selling 20 million or 15 million MacBooks a year. It's good. But we play a different game, right? I mean we're not trying to sell devices at a big premium and make a ton of money on the devices. Going back to the curve that we were talking about before, we wanna build something that's great, get it to be so that people use it and want to use it like every week and every day, and then over time scale it to hundreds of millions or billions of people. And I think if you want to do that, then you have to innovate not just on the quality of the device, but also in making it affordable and accessible to people. So I do just think we're playing somewhat different games and that I think makes it, that over time, they'll I'm sure build a high quality device in the zone that they're focusing on and it may just be that these are in fairly different spaces for a long time. - Yeah. - But I'm not sure. I think we'll see as it goes. - You could lean too much I guess into the Android versus iOS analogy here, but yeah I guess where do you see that going? Does Meta really lean into and the Android approach and you start licensing your software and technology to other early agents? - Yeah, I'd like to have this be a more open ecosystem over time. I mean my theory on how these computing platforms evolve is there will be a closed integrated stack and a more open stack. And there have been in every generation of computing so far. The thing that's actually not clear is which one will end up being the more successful, right? I think we're looking, we're kind of coming off of the mobile one now, where Apple has truly been the dominant company where even though there are technically more Android phones, there's way more economic activity in the center of gravity for all this stuff is clearly on iPhones. In a lot of the most important countries for defining this, I think iPhone has a majority and growing share and I think it's clearly just the dominant company in the space, but that wasn't true in computers and PCs. - Right. Microsoft. - And so our approach here is to focus on making it as affordable as possible. We want to be the open ecosystem and we want the open ecosystem to win. - [Interviewer] Yeah. - Right? So I think it is possible that this will be more like PCs than like mobile where it's like where maybe Apple goes for this for kind of a high end segment, and maybe we end up being the kind of the primary ecosystem and the one that ends up serving billions of people. That's the outcome that we're sort of playing for. - On the progress that you're making with AR glasses, it's my understanding that you're gonna have your first kind of internal at least dev kit next year. I don't know if you're gonna show it off publicly or not if that's been decided, but is that progressing at the rate that you have hoped as well? It seems like Apple's dealt with this, that everyone's been dealing with kind of the technical problems with this. - I don't think we have, I don't think I have anything to announce on that today. - You said AR glasses are a kind of end of this decade thing. And I guess what I'm trying to get at is- - To be at more of a mainstream consumer product, not like a V1. But I don't have anything new to announce today on this. And we have a bunch of versions of this that we're building internally. We're kind of coming at it from two angles at once. We're starting with Ray-Ban, which is like, all right if you take stylish glasses today, what's the most technology that you can cram into that and make it a good product? And then we're coming at it from the other side, which is like, all right, we want to create what is our ideal product with like full holograms, you walk into a room, like there's like as many holograms there as there are physical objects, like you can interact with like people as holograms, AI's as holograms, like all this stuff. And then how do we get that to basically fit into glasses like form factor at as affordable of a price as we can get to. And I'd say the Ray-Ban one, I'm really curious to see how the second generation of the Ray-Bans does. And the first one I think the reception was pretty good. I mean there was a bunch of reports about the retention, right, being somewhat lower, right. And yeah I think that there's a bunch of stuff that we just need to polish where it's like the cameras are just so much better. The audio is so much better. A lot of people, and we didn't realize that a lot of people were gonna wanna use it for like listening to podcasts when they go on a run, right? That wasn't what we designed it for, but it was a great use case. So it's like, okay, yeah great. Like let's make sure that's good in V2. So it's the cycle for iterating on this, if you're doing like a threads release or Instagram, the cycle's like a month. - Yeah, it's very different. - For hardware it's like 18 months, two years. So it's but I think this is the next step and I think we're gonna just gonna climb up that curve. But the initial interest I think is there, I think this is an interesting base to build from, so I feel good about that. Going the other direction, I mean the technology is hard, right? And we are able to get it to work. It's currently very expensive. So if you wanna reach a consumer population, it's- - Gotta wait for the cost curve to come down. - Yeah. - So that's kind of the main limiting factor. - Well, I think there's that and we, yeah, I mean we want to keep on improving it. So I think, but look you learn by trying to assemble and integrate everything. You can't just like do a million R&D efforts in isolation and then like hope that they come together. I think part of what lets you get to building the ultimate product is having a few tries practicing building the ultimate product. And it's like, oh, well we did that, but I dunno, it like wasn't quite as good on this one dimension as we wanted, so let's not ship that one. Let's hold that one and then do the next one. So I think that's sort of some of the process that we've had is we have like multiple generations of how we're gonna build this. You know, when I look at the overall budget for reality labs I mean it's, augmented reality and the glasses I think is the most expensive part of what we're doing. - That's why I ask cuz I think people are wondering like where's all this going? - No, it's, I mean, but look, I think at the end of the day I'm quite optimistic about both augmented and virtual reality. So I think AR glasses are gonna be the thing that's like mobile phones that you walk around the world wearing. VR is gonna be like your workstation or TV. - [Interviewer] Right. - Which is when you're like settling in for a session and you want a kind of higher fidelity, more compute rich experience, then it's gonna be worth putting that on. But you're not gonna walk down the street wearing VR headset. - [Interviewer] Right. - I mean, at least I hope not. I mean that's not the future that we're working towards, but I do think that there's somewhat of a bias, maybe this is in the tech industry or maybe overall where people think that the mobile phone one, the glasses one is sort of the only one of the two that will end up being valuable, but I think like there are a ton of TVs out there, right? And there are a ton of people who are kind of like, spend a lot of time in front of computers working. So I actually think the VR One will be quite important too. But I think that there's no question that the larger market over time I think should be smart glasses. And I mean now I think you're gonna have both, all the immersive quality of being able to interact with people and feel present no matter where you are in sort of a normal form factor and you're also gonna have like the perfect form factor to deliver all these AI experiences over time because they'll be able to see what you see and hear what you hear. So I don't know. I mean it's, yeah, I mean this stuff is challenging. I think making things small is also very hard. - [Interviewer] Yeah. - Right, it's like there's this funny kinda counterintuitive thing where I think humans get super impressed by building big things like the pyramids, but I think a lot of time building small things like cures for diseases at a cellular level or miniaturizing a super computer to fit into your glasses are like maybe even bigger feats than building some like really physically large things, but it like sort of seems a less impressive for some reason. But I don't know, it's super fascinating stuff. - Yeah, I feel like every time we talk there's a lot has happened in a year. You seem really dialed in to managing the company. And I'm curious kind of what motivates you these days cuz you've got a lot going on and you're getting into fighting, you've got three kids, you've got the philanthropy stuff. There's a lot going on and you seem more active in kind of day-to-day stuff, at least externally, than ever. You're kind of the last I think founder of your era still leading a company of this large. Do you think about that? Do you think about kind of what motivates you still? Or is it just kind of still clicking and it's kind of more subconscious? - Yeah, I don't know. I mean I'm not sure that that much of the stuff that you said is that new? I mean kids are, seven years old, almost eight now, right? So that's been for a while. Yeah, the fighting thing is relatively new over the last few years, but I've always been very physical. But I dunno, we go through different waves in terms of like what the company needs to be doing and I think that that calls for somewhat different styles of leadership. And I think we went through a period where a lot of what we needed to do was tackle and navigate some important social issues and I think that that required a somewhat different style. And then we went through a period where we had some quite big business challenges handling in a recession and revenue not coming in the way that we thought and needing to do layoffs and that required a somewhat different style. But now I think we're squarely back in developing really innovative products, especially because of some of the innovations in AI. I think that in some ways that just like plays exactly to, I think my favorite style of running a company. But I don't know, I think these things evolve over time. - It seems like you're having more fun. - Well, how can you not? I mean this is like, I mean I think what's great about the tech industry is like every once in a while you get something like these AI breakthroughs and it just changes everything and like yeah, I mean that can be threatening if you're behind it, but I just think that that's like when stuff changes and when awesome stuff gets built. So maybe that's exciting. I don't know. I mean I guess personally, I think a lot of people, I mean the world has been so weird over the last few years, right? Especially going back to the COVID pandemic and all that stuff. And I think that that was an opportunity for a lot of people to just sort of like reassess what they found meaningful in their lives. And there's obviously a lot of stuff that was tough about it, but the silver lining is I got to spend a lot more time with my family and we got to just like I could spend more time out in nature cuz I like wasn't coming into the office quite as much and like it was definitely a period of reflection where I sort of, I felt like since the time I was basically, I was like 19 when I started the company. And like every year it's just, okay, we want to connect more people, right? It's like connecting people is good. That's sort of what we're here to do. Let's like make this bigger and bigger and kind of connect more people and build more products that allow people to do that. And I guess we just sort of hit the scale where I think to me what I found sort of satisfaction in life from and what I think is like the right strategy, I think both for like me personally and for the company is less to just focus on like, okay we're gonna just like connect more people and more like, let's do some awesome things and- - Sounds very technical. - I mean there are a lot of different analogies on this, but I mean someone made this point to me that doing good things is different from doing awesome things. And like in social media in a lot of ways it's good, right, like gives a lot of people a voice and it lets them connect and it's like sort of warm and it's taking like a basic technology and bringing it to billions of people, but and that there's an inherent awesomeness of like doing some technical feat for the first time. And I guess I'm for the next phase of what we do, just a little more focused on that. I think we've done a lot of good things. I think we need to make sure that they stay good, right? I think that there's like a lot of work that needs to happen on making sure the balance of all that is right. But for the next wave of, I guess my life and for the company, but also outside of the company, what I'm doing at CZI and it was just some of my personal projects It's like I sort of define my life at this point more in terms of getting to work on awesome things with great people who I like working with. So it's like I work on all this reality lab stuff with Baz and a team over there and it's just super exciting and I get to work on all this AI stuff and it with Chris and Ahmed and like the folks who are working on that and it's really exciting and like we get to work on some of the philanthropy work and helping to cure diseases with Priscilla and a lot of the best scientists in the world and that's really cool. And it's like, okay, and it's like, so just then there's like personal stuff. It's like we get to raise a family. It's like that's really neat and like there's no other person I'd rather do that with. And I don't know, to me that's just sort of where I am in life now. - Sounds like a nice place to be. - Ah, I mean I'm enjoying it. - Mark Zuckerberg, the optimist. - I mean, always somewhat optimistic. - Yeah, thanks for the time, Mark. - Yeah, appreciate it. - Thank you.",
    "transcript_keywords": [
        "Yeah",
        "people",
        "kind",
        "lot",
        "things",
        "sort",
        "Las Vegas",
        "thing",
        "time",
        "stuff",
        "good",
        "open",
        "pretty",
        "product",
        "make",
        "Quest",
        "open source",
        "Meta",
        "Interesting",
        "thought"
    ],
    "transcript_entity_values": [
        "American",
        "Chris",
        "Android",
        "just several days",
        "Elon",
        "Jack",
        "three",
        "PyTorch",
        "Roblox",
        "the day",
        "almost eight",
        "Interop",
        "the last few years",
        "18 months",
        "the end of the day",
        "be many billions of dollars",
        "seven years old",
        "the White House",
        "Generative AI",
        "3,500",
        "tens of millions",
        "Meta",
        "Two billion",
        "Snoop",
        "Two",
        "One",
        "15 to 20 million",
        "five second",
        "Metaverse",
        "the Ray-Bans",
        "the Ray Bands",
        "Microsoft",
        "AI",
        "500",
        "every day",
        "hundreds of millions or billions",
        "three hour",
        "Ahmed",
        "a hundred",
        "meta AI",
        "five seconds",
        "Quest One",
        "Second",
        "Metaverse",
        "Twitter",
        "hundreds of thousands",
        "Thread",
        "15 million",
        "many years ago",
        "Google",
        "Llama One",
        "Octagon",
        "every week",
        "Senate",
        "Russia",
        "Baz",
        "Connect",
        "Priscilla",
        "Kylie",
        "Activity Pub",
        "this year",
        "700",
        "Quest Pros",
        "AR",
        "WhatsApp",
        "Llama",
        "two hours ago",
        "first",
        "Instagram",
        "a hundred million",
        "Rec Room, VR Chat",
        "Quest Pro",
        "40",
        "a ton",
        "Mark",
        "UGC",
        "Twitter",
        "GPT",
        "next year",
        "Elon",
        "three to four years",
        "MacBooks",
        "3 billion",
        "five to 10 year",
        "AI",
        "VR",
        "US",
        "CZI",
        "20 million",
        "Vision Pro",
        "Alexa",
        "Las Vegas",
        "early next year",
        "Last year",
        "Facebook",
        "Adam Oseri",
        "12 hours ago",
        "billions",
        "these days",
        "second",
        "Horizon",
        "Threads",
        "Chuck Schumer",
        "Messenger",
        "Meta AI",
        "a minute",
        "1,500",
        "five plus years",
        "several days",
        "one",
        "Apple",
        "four",
        "Quest",
        "the next few years",
        "iPhones",
        "Kylie Jenner",
        "today",
        "the next decade",
        "only so many hours",
        "Hollywood",
        "AI labs",
        "two years",
        "Quest Two",
        "a year",
        "monthly",
        "Division Pro",
        "the United States",
        "million",
        "Siri",
        "two",
        "Ray-Ban",
        "Amazon",
        "Llama Two",
        "thousands and thousands of dollars",
        "a third",
        "Mark Zuckerberg",
        "Schumer",
        "iPhone",
        "Mac",
        "Quest Three",
        "this weekend"
    ],
    "transcript_entity_types": [
        "NORP",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "TIME",
        "FAC",
        "FAC",
        "ORG",
        "ORG",
        "GPE",
        "MONEY",
        "DATE",
        "MONEY",
        "TIME",
        "PERSON",
        "CARDINAL",
        "ORG",
        "TIME",
        "PRODUCT",
        "ORDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "NORP",
        "ORG",
        "PERSON",
        "TIME",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "TIME",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "GPE",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "TIME",
        "MONEY",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "NORP",
        "PERSON",
        "DATE",
        "DATE",
        "TIME",
        "GPE",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "PRODUCT",
        "DATE"
    ],
    "vector": [
        -0.019803447648882866,
        -0.04417027160525322,
        0.007598015014082193,
        -0.07715830206871033,
        0.12351474910974503,
        -0.02900858037173748,
        0.05135113373398781,
        0.05524483323097229,
        0.051220089197158813,
        0.03984728083014488,
        -0.1074158102273941,
        -0.06506014615297318,
        -0.012076940387487411,
        -0.023632032796740532,
        0.05314312502741814,
        0.04329189658164978,
        0.09607937186956406,
        -0.0592072568833828,
        -0.05154236778616905,
        0.03627992793917656,
        -0.006703391671180725,
        -0.012932264246046543,
        0.022049257531762123,
        -0.017951002344489098,
        -0.02568487450480461,
        -0.017051387578248978,
        0.0013180270325392485,
        -0.0342828705906868,
        -0.042028263211250305,
        -0.013260086067020893,
        -0.026070721447467804,
        0.01974780112504959,
        0.02545180357992649,
        0.046112388372421265,
        -0.06675389409065247,
        0.018016446381807327,
        0.0008791902801021934,
        0.018756849691271782,
        -0.020344994962215424,
        -0.003503930289298296,
        -0.001968452474102378,
        -0.062109339982271194,
        -0.06836937367916107,
        -0.04388966038823128,
        0.0647381991147995,
        -0.01875017210841179,
        -0.030144331976771355,
        -0.08392442017793655,
        -0.006896826904267073,
        0.07053430378437042,
        -0.17146553099155426,
        -0.110773965716362,
        0.07693196088075638,
        0.032938212156295776,
        -0.004689473658800125,
        0.018308239057660103,
        -0.05234567075967789,
        0.053569186478853226,
        0.08562928438186646,
        0.03224622830748558,
        0.01666848734021187,
        -0.12188355624675751,
        -0.004725087434053421,
        0.057973552495241165,
        0.05570084974169731,
        0.02204138971865177,
        -0.0647672563791275,
        0.008026642724871635,
        -0.06961342692375183,
        -0.019783399999141693,
        0.01695224642753601,
        0.030925218015909195,
        -0.02655346319079399,
        -0.016150306910276413,
        0.02192976325750351,
        0.02998494915664196,
        0.025699563324451447,
        -0.01043314766138792,
        0.06564246118068695,
        -0.004051819909363985,
        0.06329590827226639,
        -0.048274558037519455,
        -0.02954626828432083,
        0.011650498025119305,
        -0.024016574025154114,
        -0.043255213648080826,
        -0.040026288479566574,
        0.002900918247178197,
        -0.0013167806901037693,
        0.00852467305958271,
        -0.023550691083073616,
        0.056405846029520035,
        0.057650938630104065,
        0.023666419088840485,
        0.09822779893875122,
        0.012843477539718151,
        -0.06543700397014618,
        0.005283781792968512,
        -0.03383217379450798,
        0.09279614686965942,
        -0.0029254546388983727,
        0.025436777621507645,
        -0.0078074075281620026,
        -0.022360585629940033,
        0.023682167753577232,
        0.009731573052704334,
        0.01821812614798546,
        0.003088496858254075,
        -0.018862906843423843,
        0.00782459694892168,
        -0.04210434481501579,
        -0.0021854073274880648,
        -0.003706228220835328,
        -0.05858553573489189,
        0.04046165943145752,
        0.04533415287733078,
        0.01391786802560091,
        0.1275791972875595,
        0.09096632152795792,
        0.010953552089631557,
        0.07996224611997604,
        0.033996742218732834,
        -0.018658991903066635,
        -0.008973068557679653,
        0.0820852518081665,
        0.0516083687543869,
        -0.11800142377614975,
        8.922747092285996e-33,
        -0.03294586390256882,
        0.058002397418022156,
        0.01598125509917736,
        0.021871251985430717,
        0.04748150706291199,
        0.04036683961749077,
        -0.049917109310626984,
        0.01321911346167326,
        -0.07482543587684631,
        -0.08194097876548767,
        -0.03179362416267395,
        0.024657314643263817,
        -0.009000844322144985,
        0.03223258629441261,
        -0.010854905471205711,
        -0.04540964961051941,
        0.030819591134786606,
        -0.04171523079276085,
        -0.13329187035560608,
        -0.003954604733735323,
        0.07911805808544159,
        -0.09034161269664764,
        -0.0495162159204483,
        0.06854589283466339,
        0.023525796830654144,
        0.015268231742084026,
        0.04958704486489296,
        -0.07666581869125366,
        0.03016425296664238,
        0.038634490221738815,
        -0.09353857487440109,
        0.08417750149965286,
        -0.04052015766501427,
        0.03345347195863724,
        -0.0016122920205816627,
        0.007551610469818115,
        0.0068935067392885685,
        -0.04435135796666145,
        0.026222655549645424,
        -0.04878813400864601,
        -0.10585001111030579,
        0.03188382089138031,
        -0.012893526814877987,
        -0.08979103714227676,
        -0.062094200402498245,
        -0.010677801445126534,
        -0.00263917981646955,
        -0.05274999141693115,
        0.0513816773891449,
        0.007444207090884447,
        -0.04831776022911072,
        -0.000900975544936955,
        -0.02387796714901924,
        -0.03693939745426178,
        0.024465996772050858,
        -0.08606620132923126,
        -0.01970549300312996,
        -0.020548684522509575,
        -0.01772516407072544,
        0.05318768694996834,
        0.012933121994137764,
        0.02743556722998619,
        -0.004783044569194317,
        0.09764326363801956,
        -0.04848572239279747,
        0.0698028951883316,
        0.006545511540025473,
        0.007326871622353792,
        -0.03804734721779823,
        0.0842224657535553,
        0.033804457634687424,
        0.030654795467853546,
        -0.04927249997854233,
        -0.031861480325460434,
        -0.08350139111280441,
        -0.017346924170851707,
        -0.06591284275054932,
        -0.026054805144667625,
        -0.04573656991124153,
        0.0364900566637516,
        -0.038441743701696396,
        0.006138852797448635,
        0.0143712367862463,
        -0.056437551975250244,
        -0.0030068925116211176,
        -0.06921536475419998,
        -0.025084620341658592,
        -0.029191570356488228,
        0.0174445528537035,
        0.03175322711467743,
        -0.06401488184928894,
        -0.0007445813971571624,
        -0.002173691987991333,
        0.11462420970201492,
        -0.16502691805362701,
        -8.749167718971823e-33,
        -0.08690660446882248,
        0.003451679600402713,
        -0.03677685186266899,
        0.05882668122649193,
        0.0327470563352108,
        0.0035992925986647606,
        0.03009496070444584,
        -0.022099414840340614,
        0.0770733579993248,
        0.0033424515277147293,
        -0.01844516210258007,
        -0.008686983957886696,
        -0.03780345991253853,
        -0.018077228218317032,
        0.04621347784996033,
        -0.02874276041984558,
        0.03672364354133606,
        -0.08493565022945404,
        -0.0318804606795311,
        -0.044974301010370255,
        0.13808977603912354,
        0.05294635519385338,
        -0.0678977444767952,
        0.00024216456222347915,
        0.02922731265425682,
        0.010387892834842205,
        0.06941245496273041,
        0.05825063958764076,
        -0.007700103800743818,
        0.023771680891513824,
        -0.14236578345298767,
        -0.06486232578754425,
        -0.03115645796060562,
        0.013851402327418327,
        0.08581998199224472,
        0.09546662122011185,
        0.02933400124311447,
        -0.036948077380657196,
        -0.020711127668619156,
        -0.012640933506190777,
        0.05234295874834061,
        -0.04639113321900368,
        -0.007669374346733093,
        -0.003773705568164587,
        -0.03568931296467781,
        0.030582113191485405,
        -0.055305369198322296,
        -0.006695214193314314,
        -0.02608143724501133,
        -0.05480523407459259,
        -0.009903749451041222,
        0.0196534376591444,
        -0.002768362406641245,
        0.010290543548762798,
        -0.1349734216928482,
        0.010812236927449703,
        -0.09563186019659042,
        0.043286941945552826,
        -0.023683564737439156,
        -0.032378628849983215,
        0.05716249719262123,
        0.02812550589442253,
        0.016062702983617783,
        -0.020922953262925148,
        0.034074682742357254,
        0.026300307363271713,
        0.0691404938697815,
        0.0270980317145586,
        -0.01662438176572323,
        -0.02533619850873947,
        0.03153999522328377,
        -0.007364783436059952,
        -0.07372721284627914,
        -0.04377419129014015,
        0.011189230717718601,
        0.13127419352531433,
        -0.05244407802820206,
        0.0023512316402047873,
        -0.054108381271362305,
        0.044079575687646866,
        0.01094237994402647,
        0.03787658363580704,
        0.08011278510093689,
        0.053307726979255676,
        0.060722414404153824,
        0.10843551158905029,
        -0.0027105265762656927,
        0.0023906950373202562,
        -0.035832855850458145,
        0.039413150399923325,
        -0.004979885648936033,
        -0.04897240176796913,
        -0.063944511115551,
        0.10312150418758392,
        -0.06608114391565323,
        -6.305258182237594e-08,
        -0.04585002362728119,
        -0.04914041981101036,
        0.002047539222985506,
        -0.031082162633538246,
        0.06769800931215286,
        -0.019673094153404236,
        -0.027874257415533066,
        -0.019151344895362854,
        -0.024237103760242462,
        0.08937738835811615,
        0.026800407096743584,
        -0.02912127412855625,
        0.001801150618121028,
        0.02481301687657833,
        0.10646573454141617,
        -0.036568887531757355,
        -0.05843306705355644,
        0.022960849106311798,
        -0.013347424566745758,
        0.017946671694517136,
        0.06741541624069214,
        0.02039186842739582,
        0.02345758117735386,
        -0.0037564525846391916,
        0.0256215687841177,
        0.008493218570947647,
        -0.06919731199741364,
        0.04908667504787445,
        -0.0006896393024362624,
        0.08897639811038971,
        -0.050615094602108,
        0.03331610560417175,
        -0.008281758986413479,
        -0.06711632758378983,
        -0.05201645568013191,
        -0.03213150426745415,
        -0.06658177077770233,
        -0.008747381158173084,
        0.01882416196167469,
        0.035936836153268814,
        0.00925072655081749,
        -0.025261742994189262,
        0.07086221128702164,
        0.021707167848944664,
        -0.011701560579240322,
        -0.05698506906628609,
        -0.10148714482784271,
        -0.08304952085018158,
        0.05388998985290527,
        -0.050923656672239304,
        -0.010274644941091537,
        -0.05399327352643013,
        0.04513664171099663,
        0.08253805339336395,
        0.071275494992733,
        -0.0261139627546072,
        0.028441600501537323,
        -0.043345626443624496,
        -0.026425480842590332,
        0.03443387895822525,
        0.12276802211999893,
        -0.030325662344694138,
        -0.05820179358124733,
        0.01195338275283575
    ]
}