{
    "id": "9aIaH9lZRvY",
    "title": "Galaxy Book S Review: Featherweight, Ultra-Thin – And No WiFi Needed",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-03-24T14:30:00Z",
    "video_url": "https://www.youtube.com/watch?v=9aIaH9lZRvY",
    "category": "Science & Technology",
    "tags": [
        "galaxy book 2 review",
        "galaxy book review",
        "samsung galaxy laptop",
        "samsung laptop",
        "best laptop 2020",
        "best acpc",
        "always connected pc 2020",
        "snapdragon 8cx"
    ],
    "views": 561455,
    "likes": 12483,
    "comments_count": 627,
    "description": "Sponsored by Blinkist. Be one of the first 100 to click for one week of unlimited access  and 25% off a full membership! Click here:    [GALAXY BOOK S REVIEW]  The first Apple computer I ever bought was a MacBook Air in 2009. When I think back on my favorite laptops of all time, that machine ranks very highly to this day. Why am I talking about a MacBook Air, on a review covering a Samsung Windows laptop? To make this point: if what you want is a super portable notebook with powerful features  you dont always need to look for an Apple logo.  In today's video: the Galaxy Book S. And while the first thing your eye might go to is the Samsung logo, or the impossibly thin casing  the biggest deal for me, is this: its the first Always Connected PC Id actually buy. Come find out why in MrMobile's Samsung Galaxy Book S Review!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S SAMSUNG GALAXY BOOK S REVIEW]  MrMobile's Samsung Galaxy Book S Review was produced following two weeks with a Galaxy Book S review sample provided by Samsung. The unit was tested on Verizon LTE in Brooklyn NY and Eastern Long Island, NY. The lone sponsor of this video is Blinkist; neither Samsung nor any other company paid a fee or otherwise offered compensation in exchange for this coverage.  Additional video by Michael Ezrachi.    [PRODUCTS IN THIS VIDEO]  Samsung Galaxy Book S:    [LINKS]  Galaxy Book S Review [Windows Central]:   MacBook Air 2020 Review [Rene Ritchie]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase. See our affiliate link policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #galaxybook #galaxybooks #samsung #alwaysconnectedpc #acpc #windows10 #laptops",
    "description_links": [
        "https://www.blinkist.com/mrmobile",
        "https://www.youtube.com/channel/UCSOp...",
        "http://mrmobile.tech/1PM",
        "https://www.windowscentral.com/samsung-galaxy-book-s-review",
        "https://www.youtube.com/watch?v=9y1rrRGJHUg",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- Sponsored by Blinkist: big ideas in small packages. Did you know the first Mac I ever bought was a MacBook Air? It's true; bought it like a decade ago. It's still one of my favorite computers. Why am I talking about MacBooks on a video about a Windows Laptop? Well, to make this point. If you what you want is a super portable notebook with powerful features, you don't always need to look for the Apple logo. (upbeat music) If you're not familiar with the term \"always connected PC\", basically they're supposed to bring the best parts of your smartphone to your laptop. That means waking up instantly, delivering better battery life, and of course, always staying connected to the internet. Now, the road to a solid ACPC hasn't been a smooth one. Two years ago, my initial experience with an affordable Asus model was rough enough to sour me on the platform for a whole generation. A few months back, my time with Microsoft Surface Pro X was much better, but I still found it a little slower than a conventional Windows laptop, and thanks to its smaller battery, it also died a lot sooner than it should've. Well, I've been using the Galaxy Book S for two weeks, and great news; one of the things that's made it so much more enjoyable will also do the same for other ACPCs. But before we get to that, though, let's talk about this hardware. In the intro, I compared this to Apple's new MacBook Air, but the Galaxy Book S is actually 25% lighter, and it's 26% thinner with the same size display. Now, that screen is lower in resolution, which you definitely do notice. It's probably the second biggest bummer of this device. But it's also a touchscreen, so maybe we'll call it a draw. And all that portability does exact a penalty. Its lightweight construction means it fails the one-handed opening test, and here's the biggest bummer; the shallow base means these keys don't have much of a place to go when you press them. As a result, the keyboard feels mushy, and a further frustration is the wimpy backlight. It's so dim that, at first, I thought Samsung didn't even install one. Are those compromises livable given the portability you get in exchange? Tell em', Harry Kim. - Yes! (explosions) - Speakers are pretty intense. I haven't been this enamored of a lightweight, low-profile laptop since my first LG Gram a couple years ago. And the Gram didn't give me the always-on 4G connection this one does. My review device came with a Verizon sim alongside the micro SD slot, and even though I say it on every ACPC video, I don't care, I'll say it again. Not having to worry about finding a connection is a freedom that just never gets old. I don't need to ask the barista what the wifi password is, or make sure my phone is plugged into a battery pack so I don't kill it with mobile hotspot. I just open my laptop and I'm already connected. Yes, it costs extra every month, and yes, it's the quintessential first-world problem, but for the target customer of the busy business person with a lot of bread in the expense account, not a lot of time to mess around, it's perfect. Because those same business folks are bound to bludgeon their batteries. Part of the promise of the always connected PC is that it lasts a long time. That's a big reason the heart of this thing is based on the Qualcomm's smartphone processor designs. It doesn't need fans, and thanks in part to the fact that there's a modem built right into it, it's much more power efficient than your typical CPU. Qualcomm used to site a crazy 20 hours of battery life, but in reality, I've averaged about seven and a half hours per charge. That's mixed usage at home on wifi, and out and about on 4G and an average of 40% brightness because this panel is so bright, I honestly don't usually need more than that. Contrast that with the six hours I topped out at on the Surface Pro X, and consider that I was able to space that usage out over a few days, so overnight, I was losing about 10% in standby, and it's pretty good. Even if it's not up to the eight hours I squeezed out of Google's Pixelbook Go. Windows Central got even better endurance during their review, and has a bunch of battery benchmarks, too. I'll link you to that in the description. While you're down there, please subscribe to the Mr. Mobile as well. Now, viewers, I do listen to you. Everyone dogged me for using Chrome during my Surface Pro X review, so for my time with the Galaxy Book S, I used Microsoft Edge exclusively, and you know what? It was pretty impressive. That's because the new version of Microsoft Edge is built to run on machines like this. See, there's a huge architectural difference between the arm processors that power an always connected PC, and the more traditional X86 Silicon. Thanks to that, and just some raw capability differences, hardcore games or photo and video editing, all that is right out. If you need that, do not buy this machine; it's not for you. Also, many Windows programs either won't run, or will only run in emulation, which means generally they're slower and more power intensive. I spent my first few days with this computer running those older apps and just hating it, until Daniel Rubino showed me the way. Not to get all Forbes-y about it, but that one neat trick that saved me after a quick word from my sponsor. Everyone my age talks about what they miss about school. Parties, the friends, the fashion choices, but in my geekier moments, I admit I kinda miss the learning part, too. So if you feel like your life is just too busy to pick up a book, check out today's sponsor. Blinkist takes the critical information; the essence of what you need to know from thousands of non-fiction books, and boils it down into just 15 minutes. Blinkist tells me if I'm into cutting-edge science, which I am, I might enjoy Physics of the Future, which I do. And if you don't even have 15 minutes to read, you can listen to the blink instead. It's a great way to learn more and improve yourself, even if you don't think you have the time. The first 100 people to try Blinkist at the link below will get unlimited access for one week. You'll also get 25% off a full membership. Hit the link in the description to start learning now, and thanks to Blinkist for sponsoring this video. - Now, the best way to tell you about web apps is just to show you. This is the old emulated EverNote program for Windows, and this is the web app. This is the Amazon Kindle program for Windows, and this is the web app. It's not just that the web apps look better; they run incredibly well. That's a cat. I learned about these because I was complaining to Rubino over Slack about my keystrokes always lagging behind when I use an ACPC. Well, in the 30 seconds it took him to teach me how to turn a webpage into a web app in Edge, he changed everything about my relationship with this computer, at least the software side of it. For my needs, which, on a machine like this, are almost entirely online, web apps are great. Seriously, the only downsides I've run into are that I need to re-login to some apps every day, and of course they don't work so well when you're not connected, but it's an always connected PC, so you know, you get it. In fact, I like web apps so much that I've thought about revisiting older ACPCs to give them another shot. But honestly, the Galaxy Book S is so good that I don't feel any desire to, say, rush back to the Surface Pro X. While Samsung's keyboard is pretty bad, like I said, at least it's included with the price. Microsoft charges between $140 and $270 extra if you want a keyboard. The Galaxy Book S is on sale now for $999. Again, graphics or gaming-oriented users should not buy it. And even mobile run and gunners should still cross shop the cheaper Pixelbook Go from Google. But if what you need is an ultra portable, always connected Windows machine for the road, the Galaxy Book S delivers the best combination of battery life, performance, and portability that I've seen. Folks, this review is produced following two weeks with a Galaxy Book S review sample provided by Samsung. Mr. Mobile does not produce paid reviews, nor do I give the subjects of those reviews any editorial input or copy approval rights. What that means is Samsung is seeing this for the first time right alongside you. Again, please subscribe to the channel on YouTube if you'd like to see more videos that put the viewer first. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "Galaxy Book",
        "Surface Pro",
        "Book",
        "Galaxy",
        "Windows",
        "connected",
        "web apps",
        "small packages",
        "ideas in small",
        "Microsoft Surface Pro",
        "Windows Laptop",
        "web",
        "time",
        "web app",
        "apps",
        "battery",
        "Laptop",
        "Blinkist",
        "MacBook Air",
        "connected Windows machine"
    ],
    "transcript_entity_values": [
        "Blinkist",
        "Edge",
        "Daniel Rubino",
        "Blinkist",
        "between $140 and $270",
        "my first few days",
        "Rubino",
        "Galaxy Book S",
        "MacBooks",
        "Verizon",
        "Qualcomm",
        "Samsung",
        "40%",
        "100",
        "MacBook Air",
        "about seven",
        "15 minutes",
        "Microsoft",
        "Slack",
        "Silicon",
        "Apple",
        "the six hours",
        "a few days",
        "YouTube",
        "the Galaxy Book S",
        "thousands",
        "Microsoft Surface Pro X",
        "ACPC",
        "Two years ago",
        "ACPC",
        "Mobile",
        "one week",
        "the 30 seconds",
        "25%",
        "Windows Central",
        "today",
        "just 15 minutes",
        "a crazy 20 hours",
        "a couple years ago",
        "first",
        "the Galaxy Book S",
        "two weeks",
        "the micro SD",
        "Mac",
        "Asus",
        "Google",
        "The Galaxy Book S",
        "26%",
        "4",
        "CPU",
        "a decade ago",
        "Gram",
        "Harry Kim",
        "second",
        "the eight hours",
        "Pixelbook Go",
        "Forbes",
        "Blinkist",
        "Pixelbook Go",
        "Windows",
        "Chrome",
        "the Surface Pro X.",
        "A few months back",
        "about 10%",
        "Windows",
        "the Surface Pro X",
        "999",
        "one",
        "Amazon",
        "Microsoft Edge"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "PERSON",
        "NORP",
        "MONEY",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "LOC",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "EVENT",
        "PERSON",
        "DATE",
        "TIME",
        "PERCENT",
        "ORG",
        "DATE",
        "TIME",
        "TIME",
        "DATE",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "TIME",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "PRODUCT",
        "FAC",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.08573403209447861,
        0.03870103508234024,
        0.045470863580703735,
        0.02368113584816456,
        0.04057211056351662,
        0.023844506591558456,
        -0.012399334460496902,
        0.056882549077272415,
        0.07164803892374039,
        -0.0007753606769256294,
        0.04594443365931511,
        0.11030860245227814,
        0.06244726479053497,
        -0.022802341729402542,
        0.007316843140870333,
        -0.032956432551145554,
        0.0354803204536438,
        -0.15557080507278442,
        0.012203899212181568,
        0.029950030148029327,
        0.03263844922184944,
        -0.02194809541106224,
        0.009467332623898983,
        -0.04387490451335907,
        0.06655405461788177,
        -0.06620806455612183,
        0.027190908789634705,
        -0.01970934495329857,
        -0.035512980073690414,
        -0.028094671666622162,
        -0.016936633735895157,
        0.0706859827041626,
        -0.011116095818579197,
        0.02082572504878044,
        -0.020828692242503166,
        -0.14841702580451965,
        0.10776712745428085,
        0.024769708514213562,
        0.016385488212108612,
        -0.1287732571363449,
        -0.0658101961016655,
        -0.027288520708680153,
        0.05376039072871208,
        0.11029832810163498,
        0.07380926609039307,
        0.006627318449318409,
        0.04252639040350914,
        -0.011280199512839317,
        0.023949671536684036,
        -0.015742050483822823,
        -0.009304676204919815,
        -0.0587051697075367,
        -0.016821296885609627,
        -0.02619784325361252,
        -0.033332459628582,
        0.04232073202729225,
        -0.015982380136847496,
        -0.06993654370307922,
        0.03512711822986603,
        -0.02738085947930813,
        0.0626056119799614,
        -0.11063876003026962,
        0.0022004081401973963,
        0.04429733008146286,
        0.02376696839928627,
        -0.056322697550058365,
        -0.028720702975988388,
        -0.07004247605800629,
        0.017754927277565002,
        0.0084561537951231,
        0.03321325406432152,
        -0.003000276628881693,
        0.06719482690095901,
        0.06539829820394516,
        -0.0425853356719017,
        0.016144514083862305,
        0.04265649989247322,
        -0.041813235729932785,
        0.01834907755255699,
        0.0028193583711981773,
        -0.04094482585787773,
        0.057164061814546585,
        -0.02457425370812416,
        -0.022399388253688812,
        0.0386929027736187,
        -0.009122686460614204,
        -0.05352606996893883,
        -0.015419249422848225,
        -0.13476404547691345,
        -0.020914152264595032,
        0.03794007748365402,
        0.06733424961566925,
        0.019534453749656677,
        -0.055056702345609665,
        -0.0330650620162487,
        -0.010697264224290848,
        -0.018399864435195923,
        -0.01957920752465725,
        -0.03877881169319153,
        0.025423970073461533,
        -0.002412049565464258,
        0.07178069651126862,
        0.1597621887922287,
        -0.02569546364247799,
        0.018447594717144966,
        -0.07683219760656357,
        -0.007579777855426073,
        -0.004793432541191578,
        0.03546971082687378,
        0.00824330560863018,
        -0.034768469631671906,
        -0.010601178742945194,
        -0.08451315015554428,
        0.046372756361961365,
        -0.05147301405668259,
        -0.03237837925553322,
        0.02856457605957985,
        0.06560686230659485,
        0.11251761019229889,
        0.062410905957221985,
        -0.07085525989532471,
        0.010205522179603577,
        -0.03538050130009651,
        -0.1339520514011383,
        0.013850090093910694,
        0.01342209056019783,
        -0.04198689013719559,
        4.346432239151656e-33,
        -0.018089598044753075,
        0.07360681891441345,
        -0.047356851398944855,
        -0.014909019693732262,
        -0.0012080848682671785,
        -0.10537072271108627,
        0.05651579797267914,
        -0.05863361805677414,
        0.006611460819840431,
        0.07135835289955139,
        -0.08760758489370346,
        0.0324033722281456,
        -0.05713067948818207,
        0.07858285307884216,
        0.04950816556811333,
        -0.013925564475357533,
        -0.0710391253232956,
        -0.06585665792226791,
        -0.05099162831902504,
        -0.022155845537781715,
        0.00728925596922636,
        -0.05208786576986313,
        0.04377727955579758,
        -0.0951402559876442,
        0.05636221170425415,
        -0.019367562606930733,
        0.045998331159353256,
        -0.01895342767238617,
        0.05461936071515083,
        0.0445343442261219,
        -0.08801580220460892,
        -0.037103671580553055,
        -0.034257445484399796,
        -0.13425762951374054,
        -0.04013312980532646,
        -0.01254134252667427,
        -0.026642415672540665,
        -0.10651316493749619,
        0.10683496296405792,
        -0.04411075636744499,
        -0.09138989448547363,
        -0.012338328175246716,
        -0.06110694259405136,
        0.007195499259978533,
        0.03818604722619057,
        0.07645283639431,
        -0.011709487996995449,
        0.054171085357666016,
        -0.010839860886335373,
        0.006191073451191187,
        -0.038735464215278625,
        -0.054671961814165115,
        0.04717237502336502,
        -0.029952624812722206,
        -0.06466620415449142,
        -0.01352459006011486,
        0.02888231910765171,
        -0.020636968314647675,
        0.05535934120416641,
        0.08244452625513077,
        0.006080471910536289,
        0.03620588406920433,
        -0.024402307346463203,
        0.0653732568025589,
        -0.07126844674348831,
        0.0636708065867424,
        0.06142481416463852,
        0.0365341417491436,
        -0.07467661798000336,
        0.02624358981847763,
        0.027764281257987022,
        -0.04498996585607529,
        0.00013306233449839056,
        -0.1252368837594986,
        0.014764879830181599,
        -0.037543315440416336,
        -0.015331815928220749,
        0.008824729360640049,
        -0.0782674178481102,
        0.030551273375749588,
        -0.009891263209283352,
        -0.03935374692082405,
        0.011757636442780495,
        0.011690586805343628,
        -0.07707936316728592,
        0.06593631953001022,
        0.04358506575226784,
        -0.07366890460252762,
        -0.04713386669754982,
        0.004831575322896242,
        0.02672387845814228,
        0.08699368685483932,
        0.0016617816872894764,
        0.059812258929014206,
        -0.01727794110774994,
        -5.9650086143652655e-33,
        -0.016348475590348244,
        -0.10961273312568665,
        0.0666351392865181,
        -0.022747591137886047,
        -0.02358480542898178,
        -0.0013672992354258895,
        -0.03181515261530876,
        0.017343122512102127,
        -0.09438462555408478,
        -0.06411099433898926,
        0.023367702960968018,
        0.028198007494211197,
        -0.034654729068279266,
        -0.026293057948350906,
        0.0588105134665966,
        -0.028339553624391556,
        -0.040800247341394424,
        -0.08729618787765503,
        0.0003964576171711087,
        -0.000962252204772085,
        0.016906466335058212,
        0.026230312883853912,
        0.03029716946184635,
        0.018153132870793343,
        0.014743945561349392,
        -0.030953731387853622,
        -0.03277506306767464,
        -0.017916196957230568,
        0.017719190567731857,
        0.041525162756443024,
        0.015699531883001328,
        -0.020175514742732048,
        0.027574876323342323,
        0.06399595737457275,
        0.0648353099822998,
        0.013471140526235104,
        0.006844026502221823,
        -0.032281920313835144,
        0.03850726783275604,
        0.039329253137111664,
        0.060125209391117096,
        0.07019148021936417,
        -0.04591885209083557,
        -0.006843237206339836,
        0.0354435108602047,
        -0.03029884397983551,
        -0.025941012427210808,
        -0.039980147033929825,
        0.0025920229963958263,
        -0.04226245358586311,
        0.037497758865356445,
        0.019927578046917915,
        0.020416945219039917,
        0.010995753109455109,
        -0.047594550997018814,
        0.03295004367828369,
        -0.024606827646493912,
        0.02140693925321102,
        0.08166736364364624,
        -0.004116662312299013,
        0.034148648381233215,
        -0.02894015796482563,
        -0.04855918139219284,
        -0.016324041411280632,
        -0.0844549760222435,
        -0.04133226349949837,
        0.08277876675128937,
        0.04320639744400978,
        0.016610221937298775,
        0.014134003780782223,
        -0.09612144529819489,
        -0.026824435219168663,
        -0.03376707062125206,
        -0.04985658451914787,
        -0.021526334807276726,
        0.11382412165403366,
        0.03630673512816429,
        -0.044765304774045944,
        -0.09478285163640976,
        -0.004262812901288271,
        0.019812792539596558,
        0.08257357031106949,
        -0.035200390964746475,
        0.03365419805049896,
        0.06162301078438759,
        -0.03383127972483635,
        0.02038370817899704,
        -0.032113198190927505,
        -0.07712236046791077,
        0.04427117481827736,
        -0.032246071845293045,
        -0.015307806432247162,
        -0.08027603477239609,
        0.05483942851424217,
        -0.059457000344991684,
        -5.311025930154756e-08,
        -0.042690426111221313,
        0.018983738496899605,
        0.10019037127494812,
        0.006112533155828714,
        0.03443937376141548,
        -0.014455017633736134,
        0.016783006489276886,
        -0.04600300267338753,
        0.0894310399889946,
        0.039086516946554184,
        -0.009094184264540672,
        -0.11260149627923965,
        -0.09678079932928085,
        0.04820390045642853,
        0.0004215562075842172,
        0.05509291961789131,
        -0.002786820288747549,
        0.06537675112485886,
        0.008513785898685455,
        0.028195248916745186,
        0.005842878017574549,
        0.0221344456076622,
        0.044950537383556366,
        -0.007890838198363781,
        0.03620881214737892,
        0.0423000231385231,
        -0.06507954746484756,
        0.0052341981790959835,
        0.015354437753558159,
        0.036474164575338364,
        -0.07560545951128006,
        0.04136986657977104,
        -0.006983762141317129,
        0.016800837591290474,
        -0.03629375249147415,
        -0.038678258657455444,
        0.06044580787420273,
        0.012676337733864784,
        0.044494178146123886,
        0.010361485183238983,
        -0.00020824241801165044,
        -0.055818941444158554,
        -0.011364095844328403,
        0.005685864482074976,
        -0.014429330825805664,
        -0.0383625365793705,
        -0.036214180290699005,
        -0.029896330088377,
        -0.04022155702114105,
        0.06550268828868866,
        0.07179196178913116,
        -0.11834774911403656,
        0.038904525339603424,
        0.011418738402426243,
        -0.01602593995630741,
        -0.008264554664492607,
        0.015394111163914204,
        0.0005277831805869937,
        -0.02192085050046444,
        0.02323974296450615,
        0.13333134353160858,
        -0.03064941056072712,
        -0.02391904965043068,
        0.08711905032396317
    ]
}