{
    "id": "9kqzGu9PulI",
    "title": "BROKE vs PRO Flight Simulator",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-09-12T16:12:38Z",
    "video_url": "https://www.youtube.com/watch?v=9kqzGu9PulI",
    "category": "Science & Technology",
    "tags": [
        "broke vs pro",
        "broke",
        "pro",
        "pro vs broke",
        "austin evans",
        "flight simulator",
        "microsoft flight simulator",
        "flight simulator 2020",
        "2020",
        "flight",
        "simulator",
        "microsoft",
        "pc",
        "gaming pc",
        "cheap gaming pc",
        "budget gaming pc",
        "budget",
        "cheap",
        "microcenter",
        "micro center",
        "vs",
        "ken",
        "ken bolido",
        "amd",
        "ryzen",
        "radeon",
        "graphics",
        "unboxing",
        "tech",
        "review",
        "steelseries",
        "thrustmaster",
        "this is",
        "the test drivers",
        "test drivers"
    ],
    "views": 1578728,
    "likes": 48383,
    "comments_count": 2515,
    "description": "This time we take on Microsoft Flight Simulator 2020 for BROKE vs PRO. Free 32GB Flash Drive & 32GB Micro SD Card: Get the best prices and best selection at Micro Center: Micro Center Custom PC Builder: How to Choose Parts for Your Custom Computer Build: Limited Time Offer, Valid In-store only, Limit 1 Coupon Per Customer  Kens Pro Setup: PowerSpec G464 Gaming Computer: Thrustmaster T-16000M FCS Flight Stick: Thrustmaster TWCS Throttle: Thrustmaster TFRP T.Flight Rudder Pedals: SteelSeries Arctis Pro + GameDAC Wired Gaming Headset: SteelSeries Rival 600 Gaming Mouse: SteelSeries APEX 7 Mechanical Gaming Keyboard: SteelSeries QcK Prism Cloth  XL: Dell Alienware AW3420DW 34\" WQHD 120Hz Curved IPS Monitor:  Austins Broke Setup: AMD Ryzen 3 3100: Gigabyte B450 AORUS M Motherboard: PowerColor Radeon RX 570 Red Dragon: Corsair Vengeance LPX 16GB (2 x 8GB) DDR4-3200 CL16 RAM: Inland Professional 240GB SSD: PowerSpec 550 Watt 80 Plus Bronze Power Supply: Thermaltake V100 Mid-Tower Computer Case  Black: AOC E2070SWHN 19.5\" Monitor:  My new podcast The Test Drivers!  Our second channel @thisis!  I stream on Twitch now!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://rebrand.ly/sclb1dz",
        "https://rebrand.ly/11qqqf2",
        "https://rebrand.ly/yxg0ouv",
        "https://rebrand.ly/rfsjkdu",
        "https://rebrand.ly/pezkdm8",
        "https://rebrand.ly/fev2txb",
        "https://rebrand.ly/9bpkzjs",
        "https://rebrand.ly/v9jyd6w",
        "https://rebrand.ly/x8i1ryb",
        "https://rebrand.ly/yolj10w",
        "https://rebrand.ly/4thypdq",
        "https://rebrand.ly/zqivcc9",
        "https://rebrand.ly/gvnrnsn",
        "https://rebrand.ly/xgip5xv",
        "https://rebrand.ly/29425dw",
        "https://rebrand.ly/wv3f2ft",
        "https://rebrand.ly/qrlulg8",
        "https://rebrand.ly/tvvgjcv",
        "https://rebrand.ly/w94tptc",
        "https://rebrand.ly/x9vdiiq",
        "https://rebrand.ly/ovsv4vo",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Today we are building the ultimate, broke versus pro flight Simulator, Gaming PCs. So we were flying from LAX to Ontario airport. They're very close, which means that it's all about the skill who can get up, fly and land the quickest. - So I don't know if Austin quite got this, but it's a flight, simulator. And most of the flights that happen are commercial flights or private flights that go from point A to B. I don't know why he wants this to be a race. I mean, maybe I do know why, if it's a race, then he could probably just zoom really quick and hope to get to the airport without dying. - And so I have all the components I need for my broke set up. Now this is all of course, thanks to Micro Center who have 25 convenient locations all throughout the US. So the nice thing is they actually do have a full PC build configurator, which is actually what I used for the setup. So you can see that it will give you a little compatibility check for all the various different accessories and peripherals that you want. And they also do have a community available. So if you need some help, they lots of inspiration on all kinds of builds. If you check out the link in the description, they're actually giving away a free 32 gig flash drive and a free 32 gig micro SD card, just by signing up for their email list. You can pick it up Next time you go into the store. So that's some free stuff. I mean, come on what could be more broke gamer than getting some free stuff? But for now, it's time to build my, actually wait, now I won't build my PC. You, you have something I'm sure right? - So to start off with Micro Center in AMD hooked me up with this Ryzen 9 3900X and 5700xt pre-built system from Power Spec, and I'm ready to rise up gamers. - [Austin] Yo, that was a smooth delivery My friend - Got it. - I Felt that, I'm rising up with you. I'm rising up, you're rising nineing I'm rising threeing. - Alright, here we go. - [Austin] Let me see the big reveal of... Ooh oh, see, you do an AIO. Oh, you got a 240 ML Cooler Master AIO. - Nice. - And a 5700xt. - Not bad, not bad. Look when our fine sponsor Micro Center, wants me to look at a PC in particular for broke versus pro for the pro setup, I'm not gonna say no, but even if it wasn't for that, the name of the game, isn't to make the best thing in the world, the name of the game isn't to over exert myself. If I know I got the game in the bag, I'm going to take that opportunity with the least minimal effort, right? - With, some of my components here, actually do think it will be a pretty solid system. So, essentially I use the PC configurator on Micro Center to basically match the minimum spec of the build. So, first of all, I have an AORUS B450 M, I have my Power Color, Red Dragon RX 570. This card actually I've done videos on it in the past, is probably the best bang for the buck 1080p card, that you can buy right now, it's really pretty affordable and you get decent performance out of it and hopeful, it will be enough to run flight simulator, at least decently. Of course, I have my Ryzen 3 3100 which is powered by the exact same Zen 2 cores inside your Ryzen 9, except they just have fewer of them. So instead of 12 cores, I have four cores. So with all of the components ready, let me, begin building, I've built a fair few PCs recently, that were, let's say a little bit challenging to build. There were some maybe difficult circumstances. So going into this one, I feel confident. I'm sure it's going to post first try. I'm gonna, get a windows installed Flight Simulator downloaded and I'm sure it's fine. I will say this has been an incredibly simple PC to build. It might not be a, pro set up, but I think it's actually going to end up looking pretty clean when we're all is said and done. I really can't think of any corners I cut on this build. I, didn't use a wrist strap maybe, probably could use some more thermal paste, but you know, I'm not the diverge. So I'm going to do my best. It's fine, I'm not worried. I'm sure that this system will be completely, totally, and absolutely capable of running a BIOS. (upbeat music) Ah, well, something's happening. - [Ken] Fans are spinning. - That's good, it's always a good sign. All right, so I think we're pretty much set up here. So we have our B454 board, we have our 3100, we have our SSD, we have our memory. So now, is time, to, install copy of Windows, Get that Flight Simulator downloading, tomorrow going down my friends, going down, like a plane, as it crashes. 'Cause you, you suck. - [Matt] Okay. Austin Evans. So I got a bunch of other things here, to help my, setup along. - [Austin] That's so over the top, do you really need all of that for Flight Sim? What do you need to have here? - What do you mean, do I need all of this stuff for flights? Of course I do. So, we have a lot of steel series peripherals to start out. So we have their Arctis Pro, plus Gamedac, - Wait. - headset. - Wait. - Set up. - Wait, wait. I just realized I had no audio 'cause there's no speakers on my setup. - What a shame, Austin? (Austin laughs) - What a shame. You have their Apex 7 mechanical keyboard. - Oh, this is the one with the oled, right? - It has the oled screen on it, look at that. - Ah, that's so cool. - Oh, your flight gear. The T.1600, 16000 wow. That's one extra zero. - That's more than 16,000 (both laughing) - The T.16000M from Thrustmaster. It comes with the throttle, the rudder, pedals and the joystick as well. - So I'm just noticing a problem here. - Mh mhh. - So normally when we do broke versus pro, I set up my setup here, you set up yours here, but with the size of your monitor and your stuff, I don't have any space. So, after last episode of broke versus pro where you had a box, guess what? Our friends from Microsoft sent over a flight simulator box for mystery tech, which has sadly cannot use any of the actual, stuff from that episode. What I can use, is the box. So umm. - Wow, You're, you're doing, you're doing it. Leave it to Austin to steal other people's ideas. He's done it with Linus Tech Tips, he's done it with Unbox Therapy, and of course he's done it with broke versus pro stealing the whole cardboard box idea. - So once I get all folded in here, you'll see that I am running the game at minimum settings at 1600 by 900 thanks to my RX 570 look, I get like 20 to 25 frames per second. It's usable, so why don't we race? I'm just going to take off now. So I'll just see you later. I can see each individual frame, Look how smooth it is out the window. See frame, frame, frame. So I'm taking it off right now. I don't know where you're at. - You know, for someone that watches F1 religiously, you would think that he would know how to start a race. No, he just he's just like, \"I'll see you there. \"If I, if I get there first. \"Cool, I win. \"Hope you load.\" - Are you, are you setting up your controls over there huh? - Well, you kinda didn't really give me enough time to do this. So, this, we might actually have to change settings on this. - Oh, no, that sounds terrible. - [Matt] Yo, it looks like he's playing a PowerPoint. - Yeah, no, we actually have to change that. Hold on, we need to actually set. No, I'm actually being legit, we have to set these up properly. One second. She don't really wanna record this - Oh, are there problems in paradise over here? - Well, you're the one that wanted to record this. - Yeah, of course we need footage. Are you taking off now? Can you hear me at all? Wow, what a great headset. I'm look at this, I'm only 39 nautical miles away. Are you reloading the game right now? What happened? What's going on over there huh? Oh, he's awfully quiet. I think he's getting tilted. You know what's sweet? When you spend all this time building a broke setup and Mr. Fancy pants, Ken, over here with all his gadgets and gizmos and newfangled technology, can't even get into his game. You can't record something as simple as a little bit of gameplay on that system. Look man, I'm feeling good? What, what, what can you possibly go wrong now? Oh, did he take off the other way? Wait, you didn't have to bank around? You're gonna piss everyone off. Old people who have houses right by the airport, you're gonna get it. You're gonna get a fine for that one. - That's not bad, the stick is actually giving me pretty good control. The only problem, is that, there is a learning curve when you have been playing this game with a controller for quite a while, but at the very least, all of these buttons are programmable in the game and the game actually recognizes the stick completely. So if I actually go into the settings real quick, you can actually see here, actually it shows up. So you can manually, based on the numbers out here on the diagram, program all of these buttons, which is kinda cool. All right, I made a slight technical error. I did not follow my path into the airport. So I'm now currently, hard turning to get over to where I need to be - So I'm gonna start throttling down. I can't do that. I legitimately can't slow the plane down besides adding more flaps Here we go, let's hit up my landing gear out here. Oh, Oh, more throttle, more throttle. - Are You already landing? - Yeah, man. - What? I'm doing my approach. How did you do that? - [Matt] You had to bank. - I did have to bank, actually did have to bank. (Austin yells) - Wait, wait, here we go, here we go, here we go. - Come on, come on - Ready? (Austin yells) - Oh come one, we're going in fast boys, we're going in fast. (Austin yells) - How do I do negative throttle though? That's the thing. (Austin yells) - It's gonna, it's gonna hurt. Oh, Oh, Oh, we're down we're down, we're done - [Matt] You put the landing gear? - I don't know, I think I did, but it doesn't sound like it. Oh yeah. Okay so landing gear, not down. - So everyone died, is what you're saying. So this being the first time using actual purpose, built peripherals for flight simulator, I had a lot of fun playing the game with the accessories. Even if you don't know how to use it, exactly. Having the right gear can actually help you win. I truly think that there was, an element of control that comes with using the peripherals a lot of better control, more finer control that comes with that versus using a controller. I just wish I practice more, but it doesn't matter, 'Cause I won. - The broke life was not, the smooth life. It doesn't run well even when you're on, minimum spec. I mean this game is, demanding you need a high-end rig. It might not have gone according to plan, but, I have a plan for next episode (upbeat music) nefarious right? Ah, nope. I'm good, I got it. Whew, see. - It's a very strong box. - It's a really strong box. Thank you very much for watching, this episode of broke versus pro. Definitely be sure to subscribe not only to the channel as well as check out our wonderful sponsor, Micro Center and AMD and also feel free to watch some of our other, broke versus pro episodes right here. (upbeat music) See, they're right there. You can watch multiple episodes in Benji, as the kids say. (upbeat music) - Mh mhh.",
    "transcript_keywords": [
        "broke versus pro",
        "Micro Center",
        "flight Simulator",
        "versus pro",
        "broke versus",
        "flight",
        "broke",
        "game",
        "pro",
        "LAX to Ontario",
        "Micro",
        "Gaming PCs",
        "Simulator",
        "pro flight Simulator",
        "versus",
        "set",
        "Center",
        "build",
        "wait",
        "versus pro flight"
    ],
    "transcript_entity_values": [
        "1600",
        "AIO",
        "Ryzen 9",
        "2",
        "micro SD",
        "AMD",
        "16000",
        "3100",
        "Austin Evans",
        "Thrustmaster",
        "first",
        "RX 570",
        "one extra zero",
        "B454",
        "Flight Sim",
        "Ken",
        "Austin",
        "more than 16,000",
        "25",
        "T.1600",
        "Austin] Yo",
        "Ryzen 3 3100",
        "Matt",
        "Red Dragon RX 570",
        "four",
        "F1",
        "Apex 7",
        "12",
        "Gamedac",
        "Ontario",
        "my Power Color",
        "5700xt",
        "Austin",
        "20 to 25",
        "second",
        "Matt] Yo",
        "PowerPoint",
        "32",
        "Benji",
        "Microsoft",
        "tomorrow",
        "only 39 nautical miles",
        "240 ML",
        "SSD",
        "Power Spec",
        "Unbox Therapy",
        "One",
        "US",
        "Linus Tech Tips",
        "AIO",
        "Micro Center"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "LAW",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "LAW",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "LOC",
        "CARDINAL",
        "PERSON",
        "GPE",
        "ORG",
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.019977189600467682,
        -0.06374043226242065,
        0.026036065071821213,
        -0.04980551451444626,
        0.02434215508401394,
        0.04000093787908554,
        -0.01769774779677391,
        0.019825931638479233,
        -0.08596859127283096,
        0.06283323466777802,
        0.010155679658055305,
        -0.01164751872420311,
        -0.02648920752108097,
        -0.018265606835484505,
        0.06134709715843201,
        0.05755716934800148,
        0.09412269294261932,
        -0.1091875433921814,
        0.03965763747692108,
        0.019552908837795258,
        0.003313687862828374,
        -0.051817551255226135,
        -0.045577213168144226,
        -0.0133590092882514,
        -0.021065428853034973,
        0.08234651386737823,
        0.056834615767002106,
        0.05822738632559776,
        -0.05880765989422798,
        -0.060590874403715134,
        0.01465698704123497,
        0.007955053821206093,
        0.0035698346327990294,
        -0.005320305470377207,
        0.05670708790421486,
        -0.0818789005279541,
        0.06841579079627991,
        -0.0951332375407219,
        -0.07168998569250107,
        -0.1137002632021904,
        -0.1338503211736679,
        -0.011486509814858437,
        -0.01394785288721323,
        0.10348735004663467,
        0.06709551811218262,
        0.025791162624955177,
        0.04336726665496826,
        -0.041348621249198914,
        0.0707186833024025,
        0.03915781527757645,
        -0.030089395120739937,
        -0.10219328850507736,
        0.08439572900533676,
        -0.016162527725100517,
        -0.005160000175237656,
        -0.0042868368327617645,
        -0.02009313926100731,
        -0.021398315206170082,
        0.01597161963582039,
        -0.08860427141189575,
        0.014044777490198612,
        -0.08744466304779053,
        0.024361353367567062,
        0.048888642340898514,
        -0.0663449689745903,
        0.007187621667981148,
        -0.0219039898365736,
        0.0005989664350636303,
        0.03867905214428902,
        -0.03337181732058525,
        -0.07119526714086533,
        0.03739476948976517,
        -0.038277290761470795,
        0.03887908533215523,
        0.022766180336475372,
        0.045172128826379776,
        0.03452306613326073,
        -0.1240553930401802,
        0.025742307305336,
        -0.016268549486994743,
        -0.022215351462364197,
        -0.06497529149055481,
        -0.10219138860702515,
        -0.015485292300581932,
        0.08168061822652817,
        0.004060100764036179,
        0.018010634928941727,
        0.012664261274039745,
        -0.015235939994454384,
        -0.031020784750580788,
        -0.012438331730663776,
        0.007041902747005224,
        0.11211133748292923,
        0.022474635392427444,
        0.019135279580950737,
        -0.020883016288280487,
        0.0090939961373806,
        -0.07559669017791748,
        -0.028018219396471977,
        0.02625170722603798,
        -0.04370999336242676,
        0.011345640756189823,
        0.1191791519522667,
        0.05708274617791176,
        -0.012407662346959114,
        -0.009301304817199707,
        0.010493220761418343,
        0.007141508627682924,
        -0.0008234444539994001,
        -0.08361544460058212,
        -0.015451833605766296,
        0.006920159328728914,
        -0.0643751472234726,
        -0.010153919458389282,
        0.04782869666814804,
        0.0025468419771641493,
        -0.10428942739963531,
        0.04800381511449814,
        0.06610480695962906,
        0.0019901152700185776,
        -0.0331752747297287,
        -0.04748045280575752,
        -0.012752624228596687,
        0.006852530874311924,
        0.021168578416109085,
        0.03560906648635864,
        -0.0565280057489872,
        1.673993146204806e-32,
        -0.054790299385786057,
        0.03306916356086731,
        -0.08711916208267212,
        0.02052939683198929,
        0.014503936283290386,
        -0.011997764930129051,
        0.07989632338285446,
        -0.0010957954218611121,
        -0.00823783315718174,
        0.023177729919552803,
        -0.0700494721531868,
        -0.01783016324043274,
        -0.034934137016534805,
        0.062884122133255,
        0.10546615719795227,
        -0.09734725952148438,
        -0.006524818483740091,
        -0.006443113088607788,
        -0.05713615566492081,
        -0.005968259647488594,
        0.02910647913813591,
        -0.012282520532608032,
        0.01531657762825489,
        -0.06019026041030884,
        0.06298828125,
        0.05630676448345184,
        -0.011677553877234459,
        0.01147393137216568,
        0.07081469148397446,
        0.03792934492230415,
        -0.14117422699928284,
        -0.058819256722927094,
        -0.0009472088422626257,
        -0.008773948065936565,
        0.02345348708331585,
        0.014277146197855473,
        0.004952897317707539,
        -0.09490310400724411,
        -0.06257297098636627,
        0.05940721556544304,
        -0.10042435675859451,
        0.028224820271134377,
        -0.048952385783195496,
        -0.04884043335914612,
        -0.02716561034321785,
        -0.04266328364610672,
        -0.016947882249951363,
        0.01887465827167034,
        0.0529867447912693,
        0.044653888791799545,
        -0.1251923143863678,
        0.04390667751431465,
        0.0341804102063179,
        -0.03736741095781326,
        -0.06511586904525757,
        -0.06391852349042892,
        0.07604765892028809,
        0.025022299960255623,
        0.052833590656518936,
        0.1038723811507225,
        -0.04427088797092438,
        -0.031084032729268074,
        0.025970684364438057,
        -0.0029110379982739687,
        -0.007944004610180855,
        0.10176309198141098,
        0.06115013360977173,
        0.01632530242204666,
        -0.05781190097332001,
        0.09148240089416504,
        -0.034128349274396896,
        0.00033865578006953,
        0.0609310157597065,
        -0.04488024115562439,
        0.0526052862405777,
        0.027773231267929077,
        -0.08863762766122818,
        -0.044355183839797974,
        -0.08557117730379105,
        -0.018273627385497093,
        -0.05547168478369713,
        0.0444730743765831,
        -0.006104572676122189,
        0.07129070907831192,
        0.012143407016992569,
        0.012392278760671616,
        -0.0170925110578537,
        0.021269790828227997,
        0.017193598672747612,
        -0.014652937650680542,
        -0.04589712619781494,
        -0.028113333508372307,
        0.03322996944189072,
        0.03203584998846054,
        -0.027869556099176407,
        -1.388622790759495e-32,
        -0.03379012644290924,
        -0.01980135776102543,
        0.030791569501161575,
        0.06478416919708252,
        -0.007648507133126259,
        -0.0180661678314209,
        0.029911968857049942,
        0.04342207312583923,
        0.031694818288087845,
        -0.07743693888187408,
        0.008000895380973816,
        0.019647542387247086,
        -0.0028697573579847813,
        0.02686190977692604,
        -0.04873654991388321,
        -0.046618737280368805,
        -0.07133199274539948,
        -0.06978534907102585,
        0.12078268080949783,
        -0.006361023988574743,
        0.09126395732164383,
        0.06191258504986763,
        -0.019664986059069633,
        -0.04974350705742836,
        0.006198890972882509,
        0.04323406144976616,
        0.04341309517621994,
        0.00523071875795722,
        0.02700716070830822,
        0.042482778429985046,
        0.002065396634861827,
        0.03304986283183098,
        0.06336386501789093,
        0.08023542165756226,
        0.07087972015142441,
        0.017862385138869286,
        0.045283157378435135,
        0.01591559872031212,
        0.0038746888749301434,
        -0.0487096793949604,
        0.03910496085882187,
        0.013982417061924934,
        0.005993810947984457,
        0.05271552503108978,
        0.05971240624785423,
        0.005747720133513212,
        -0.043595097959041595,
        -0.07157812267541885,
        0.07918790727853775,
        -0.004753693472594023,
        -0.09296851605176926,
        -0.0663335770368576,
        0.019496949389576912,
        -0.01091894693672657,
        -0.015689346939325333,
        -0.10316956788301468,
        -0.0030538239516317844,
        0.020969202741980553,
        0.016860662028193474,
        -0.05725798010826111,
        0.009525734931230545,
        0.057541847229003906,
        0.0005804370157420635,
        0.004837583284825087,
        0.03582417219877243,
        -0.013432773761451244,
        0.04870828241109848,
        0.057288479059934616,
        -0.0010103130480274558,
        0.0024640595074743032,
        -0.11988171190023422,
        0.04291107505559921,
        -0.013359883800148964,
        -0.0721869021654129,
        -0.003874705173075199,
        0.03690949082374573,
        -0.05432780832052231,
        0.03931489214301109,
        0.07623671740293503,
        0.037141211330890656,
        0.013394190929830074,
        -0.036573588848114014,
        0.018467146903276443,
        0.01889345794916153,
        0.009464551694691181,
        0.05282067507505417,
        -0.0243700984865427,
        0.05406476929783821,
        -0.016527753323316574,
        -0.11066333204507828,
        -0.03207141160964966,
        0.01319892518222332,
        0.03262507542967796,
        0.06284034997224808,
        -0.049436651170253754,
        -6.606023816857487e-08,
        -0.030328121036291122,
        0.05216869339346886,
        -0.016799168661236763,
        0.02500597946345806,
        0.067087322473526,
        -0.05043919384479523,
        0.0037496567238122225,
        -0.01596768945455551,
        0.01608933135867119,
        -0.008718203753232956,
        0.054330646991729736,
        -0.0597769133746624,
        -0.048883404582738876,
        0.01689649373292923,
        -0.004416573327034712,
        0.03220087289810181,
        -0.10537225008010864,
        0.09013630449771881,
        -0.017181115224957466,
        -0.04305758327245712,
        0.005800479557365179,
        0.05620025470852852,
        0.08446747064590454,
        -0.03733861818909645,
        0.0340685211122036,
        0.0075229499489068985,
        -0.076199471950531,
        -0.02540288120508194,
        0.06361044198274612,
        -0.015886809676885605,
        -0.05727405846118927,
        -0.01747543178498745,
        4.2392850446049124e-05,
        -0.02419135719537735,
        0.059196487069129944,
        -0.05666682496666908,
        -0.0016834160778671503,
        0.1184297427535057,
        0.10970698297023773,
        0.03008141554892063,
        -0.006180322729051113,
        -0.07107483595609665,
        -0.05994531512260437,
        -0.04663100466132164,
        0.026247398927807808,
        -0.02795897237956524,
        -0.12512195110321045,
        -0.0865907073020935,
        -0.04427541419863701,
        0.012788012623786926,
        -0.024812227115035057,
        -0.006216700654476881,
        -0.03227580711245537,
        0.06611306965351105,
        0.03941825032234192,
        0.06639514118432999,
        -0.030315710231661797,
        0.055253367871046066,
        0.0386849045753479,
        0.04275452345609665,
        0.07322990894317627,
        -0.07826259732246399,
        -0.05916109308600426,
        0.03792008012533188
    ]
}