{
    "id": "9pbCuFxRuqs",
    "title": "The truth about the Apple iPhone X - Review!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-11-16T02:34:28Z",
    "video_url": "https://www.youtube.com/watch?v=9pbCuFxRuqs",
    "category": "Science & Technology",
    "tags": [
        "iPhone X Review",
        "iPhone 10 Review",
        "iPhone 10",
        "iphone x",
        "iphone x unboxing",
        "iphone x review",
        "unboxing",
        "review",
        "iphone 2017",
        "apple iphone x",
        "iphone x hands on",
        "iphone x vs",
        "iphone x vs iphone 8",
        "2017",
        "apple",
        "iphone x specs",
        "new iphone",
        "iphone 10",
        "iphone",
        "animoji",
        "iphone 10 review",
        "iphone x vs 8",
        "face id",
        "smartphone",
        "iPhone X Camera",
        "iphone x vs iphone 8 plus",
        "iphone ten",
        "tldtoday",
        "tld",
        "the truth about the iphone x"
    ],
    "views": 1374917,
    "likes": 35409,
    "comments_count": 3638,
    "description": "My review of Apple's iPhone X. It's not perfect but it's the best and most exciting iPhone ever.  Check out Anker's Power Delivery (Chance to win prizes)    Anker PowerCore+ 26800 PD USB-C Charger -   Batman Neon LED:  Check out Kevin's Xbox vs PS4 Review!  SnazzyQ Animoji Parody!  Austin Evans iPhone X Review:  Lamarr Wilson's iPhone X unboxing!  The Best iPhone X Accessories!   Reading Mean iPhone X comments -   Background music via Epidemic Sound:   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://www.anker.com/deals/usb-c?country=us",
        "http://amzn.to/2zqmOCs",
        "https://fanfitgaming.com/product/batman-light-neon-night-light/",
        "https://www.youtube.com/watch?v=ewwOOvqoLU8",
        "https://www.youtube.com/watch?v=qkNDdc_ErVY",
        "https://www.youtube.com/watch?v=_rMm_Qz8wmI",
        "https://www.youtube.com/watch?v=ljAUFkikMTw",
        "https://youtu.be/1yClDITvctI",
        "https://youtu.be/lHQ4kwXfLbo",
        "https://goo.gl/rMbhQL",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "Today's video is sponsored by Anker. For deals on the latest USB-C chargers including one that can charge a MacBook and a chance to win a ton of different prizes Including an iPhone X. Check out the links below. The iPhone X [\"TEN\"] (said like this throughout the whole video except where noted), it's not perfect, but it is really good. Yo guys, Jonathan here and today I am diving deep into the iPhone X both the good and the bad, and if you picked one up I would love to know what your experience has been so far. So with the iPhone X, there are a couple key, elements that make this phone what it is. The first of which being the display. It's a 5.8 inch OLED panel with a classically weird Apple resolution of 2436 by 1125 and weird numbers aside it looks Really good. I think any doubt or concern with the display not being bright enough has been put to rest It's super bright the colors are extremely accurate and honestly the display is one of the most enticing features of the iPhone X. Now for the million dollar question of \"Is there any blue shift?\" And yeah, if you look for and you tilts it off access you will definitely see a little bit of that. It is by no means Pixel 2 XL status, but there's no denying if you're a little tilt and shift crazy you are gonna see a little bit of blue. Now the reason Apple is able to squeeze so much screen into the iPhone X because Of what is probably The biggest change to ever come to the iPhone and that is the omission of the home button. It is completely gone. Honestly, I got used to this and adjusted to it way Way faster than I thought I would no joke every time I pick up a phone that is not the iPhone X, I find myself Wanting to swipe up to go home. Now for the most part this works incredible And I don't find myself missing the home button, but there are a couple dumb things. One is Control Center. That used to be a one-handed move Where you swipe up and that's how you access Control Center, but now you got to swipe down all the way on the top. Right and most of the time to comfortably do that you need to use two hands. Conversely, You can enable reachability Which is not enabled by default, so pro-tip head in to Settings > General > Accessibility Once you have it enabled you can access for reachability by doing this really Really precise swipe down at the bottom edge of the phone It's definitely easier than having to reach all the way towards the top right of the phone and then swiping down But it's still two steps, and I don't think it's a foolproof solution. Now, I know Snazzy Q is busting out of the seams and has this well thought out to elaborate solution to this But I would also love know what you guys think is a better alternative to this weird Control Center option We have now. From there the other slightly dumb thing That's not really a huge deal is how you exit out of apps before all I used to do is open up multitasking and swipe Up and that was it Now once, you're in the multitasking window you actually got to hold the app wait for that little minus icon And then you can swipe out and exit out. Yeah, it's not the biggest deal in the world and before anybody yells at me I totally get it technically you don't have to exit of apps, but for me It's just kind of one of those unnecessary Two-step movements. Now with the lack of home button, the way You enable Siri is by one saying Hey [Siri], Not gonna say that and trigger your phone or two Holding the side button. Now one slightly annoying thing is if you have Do Not Disturb enabled, unless you are in Control Center There is no way to know that it's on whether you're in the lock screen or actually in the phone There is no icon in the top right-hand corner Which makes it super easy to forget that it's on. Now from there that kind of leads into the next Controversial thing with the iPhone X that is the notch. Initially every Mostly angry tech fans on Twitter seem to hate it Honestly though the notch really isn't a big deal like 95% of the time I don't realize it's there. The only time I do notice it is when I'm watching Widescreen video because the way that's formatted that notch is creeping its way in there And there is nothing you can do about it. Now the flip side of that for most YouTube videos that are in 16:9 you are not seeing the notch whatsoever. Yes, you can zoom in, but for the most part That's not the optimal viewing experience because you are chopping off heads #PrayForLamarr Over the weekend both Kevin Kenson and Austin Evans dropped some Incredible looking widescreen video and watching those back on the iPhone X, it kind of got me thinking Is this the future of content especially with more and more of these phones headed in that direction? the video you are watching right now is also in widescreen so if you're watching on an iPhone X or Galaxy S8 I would love to know how it looks on your phone Next is FaceID that feature that anyone anti-Apple deep down really wanted to fail, but it actuality It was really well done and well executed. Just like the iPhone X FaceID isn't perfect But it's really good for me. It has to have worked like 98% of the time there really hasn't been too many times where it's failed. It absolutely works at night, in the dark, whether you're in a car. I've been in planes where it's worked flawlessly. On the opposing end of that spectrum. It's worked great outdoors, in sunlight with glasses on, with a hat on. The only time I've ever really had trouble with it is in the middle of the nights when I wake up. I got one Eye closed and then it kind of trips up but for the most part It's worked really well, and I haven't really missed TouchID. I think where FaceID really shines is for password based applications especially when you're browsing online you're already looking at the phone So it kind of becomes this instant thing that you don't really think about The other pro with FaceID in the case where your hands are wet or it is crazy cold outside And you're forced to wear gloves Yes, the same argument could be made with FaceID in the situations where it doesn't work, but overall as a whole I think it's a step in the right direction Hasn't slowed me down at all. Now because of all that tech required for FaceID that is also yielded Animojis I guarantee you by now You've probably seen some an Animoji Karaoke in your feed, but I want to give a shout out and some credit to Mr. Snazzy Q for the best one on the internet right now I kind of wish I had a dollar for every time someone said \"The iPhone X [Ecks], the thousand dollar emoji machine. One, It's an Animoji and two, it's kind of fun man. So are Animojis is the sole reason why you would buy an iPhone X? Absolutely not. If you want to use them, they're there, but if you don't, no one's forcing you song- what does the fox say God, I remember that now as far as performance that A11 Bionic chip inside the iPhone X is no joke. Everything from Multitasking to gestures to gaming is buttery smooth. Now with all that power one area where the iPhone X and even 8 and 8 Plus For that matter excels at and are kind of in a league of its own is AR It's still really early in terms of the development of apps and games, but there's some pretty incredible stuff out there And if you own an iPhone X or 8 or 8 Plus and haven't checked out augmented reality yet It is a lot of fun. I will say it's worth mentioning This is the exact same chip also found in the iPhone 8 and 8 Plus so it's kind of a testament to their performance as well But as far as smartphone performance goes it is not even close right now. 3, 2, 1... \"But the iPhone X doesn't have as many cores as...\" Clearly it is not about the cores because there is some insane performance Coming out the iPhone X as well as the 8 and 8 Plus. So now that we're fired up and before anyone asked. What about the iOS bugs? Why did I have to bowl? Yes, performance on the iPhone X is incredible, But there is no denying iOS has been a little weird especially No one can forget that weird stupid. \"I\" glitch where you typed an \"I\" and it autocorrected it into some weird characters and a question mark Someone singing... I think. It has been since updated and fixed But it was out there for a long time and honestly that was one of the weirdest, dumbest, most annoying bugs I've ever dealt with on a smartphone so to say the iPhone X has been an overall smooth experience isn't quite the case From there shift into some positive, the camera in the iPhone X has been incredible. Again, this features dual lenses, a wide-angle and a telephoto lens, But the big thing here is that telephoto lens now features optical image stabilization. Now we first saw this dual lens with OIS on the Note 8 It's something the iPhone 8 Plus does not have and it definitely makes a difference. The biggest thing I've noticed jumping from wide-angle to telephoto is that you're getting a much more consistent image in terms of low light and low light performance Portrait mode in terms of the rear facing camera is excellent I think Apple does a really great job with this. As a whole there really isn't much to complain as far as the camera goes on the iPhone X. Images are crisp, they're sharp, they're vibrant, they're saturated. Now as far as the front-facing camera goes I would say it is equally as impressive as the rear camera my only real gripe with it Portrait selfies. Regular selfies look great; lighting, color, skin tones. My only complaint is I wish it was just a little wider something I've always liked on Samsung phones, but as far as those Portrait selfies go it just seems like it's not quite there yet. The actual image quality and skin tones and color all look great, but for whatever reason it seems to have a real hard time with both hair and in my case Ears where it just doesn't get those correctly. With the Pixel 2, the images sometimes over sharpened whereas with the iPhone I much prefer the more natural look so if we could somehow combine both these elements That would be amazing now. I think the Pixel 2 might have the slight edge on the iPhone X as far as photos Go there is no comparison in terms of video. The color, the ability to go up to 4K 60 frames per seconds The image stabilization on the iPhone X is second to none. You have slow motion at 1080p, up to 240 frames per second which is ridiculous Music playing... So if you use your phone to capture and create video, the iPhone X is kind of in a league of its own as far as that goes. From their notable mentions, battery life on the iPhone X has been surprisingly good. It's not as good as something like that from 8 Plus or 7 Plus for that matter, but it is definitely better than both the iPhone 7 and 8. For me I've been averaging about 6 to 8 hours of usage, so getting through day is not a problem whatsoever. The stereo speakers in the iPhone X yeah, they're not gonna blow your mind But I do enjoy having that feature and it does make a difference over phones that don't have stereo speakers. As a whole I think The iPhone X is the best and most exciting thing Apple's put out in a very long time. I'm excited to see where this goes in the future not only with Apple specifically, but with the smart phone game as a whole. What I'm saying is that it's a great time to be alive in terms of smart- phone technology and technology in general right now. The iPhone X is definitely a part of that. I've enjoyed it Hopefully enjoyed this video if you do and you're feeling like being awesome make sure to go Batman on that Like button, this is Jonathan, and I will catch you guys later.",
    "transcript_keywords": [
        "iPhone",
        "sponsored by Anker",
        "Control Center",
        "phone",
        "time",
        "USBC chargers including",
        "kind",
        "thing",
        "video",
        "weird Control Center",
        "Apple",
        "Anker",
        "swipe",
        "good",
        "Control",
        "Center",
        "FaceID",
        "access Control Center",
        "weird",
        "performance"
    ],
    "transcript_entity_values": [
        "two",
        "Siri",
        "Animoji",
        "Batman",
        "iPhone",
        "an Animoji Karaoke",
        "about 6 to 8 hours",
        "1125",
        "Snazzy",
        "Today",
        "night",
        "One",
        "the middle of the nights",
        "240",
        "Twitter",
        "4",
        "Control Center",
        "MacBook",
        "8 Plus",
        "thousand dollar",
        "Holding",
        "Apple",
        "16:9",
        "7 Plus",
        "YouTube",
        "the weekend",
        "emoji",
        "a ton",
        "Pixel 2 XL",
        "95%",
        "2436",
        "Two",
        "Galaxy S8",
        "8 Plus",
        "iPhone X",
        "3",
        "98%",
        "2",
        "5.8 inch",
        "#",
        "1",
        "Portrait",
        "second",
        "first",
        "A11 Bionic",
        "1080p",
        "one",
        "Austin Evans",
        "TEN",
        "Samsung",
        "8",
        "Anker",
        "Control Center",
        "Next",
        "the iPhone X",
        "OLED",
        "Kevin Kenson",
        "anti-Apple",
        "Yo",
        "Jonathan",
        "USB-C"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "TIME",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORDINAL",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "FAC",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.0928572565317154,
        0.045742396265268326,
        0.04662139713764191,
        -0.04389330372214317,
        0.03872751072049141,
        0.027276791632175446,
        0.07126986235380173,
        0.02995244413614273,
        0.00826094951480627,
        -0.0012489916989579797,
        0.09501602500677109,
        -0.021519800648093224,
        0.061354897916316986,
        0.058663900941610336,
        -0.01537683792412281,
        0.046253181993961334,
        0.10730737447738647,
        -0.016429053619503975,
        -0.0622515007853508,
        0.06380462646484375,
        -0.004194218199700117,
        -0.06264155358076096,
        0.05954711511731148,
        -0.02961144782602787,
        0.0074003031477332115,
        0.008054071106016636,
        -0.004269783850759268,
        -0.08014849573373795,
        -0.08590111881494522,
        -0.032914187759160995,
        -0.03239959850907326,
        0.051661036908626556,
        0.011473573744297028,
        0.031836140900850296,
        -0.02091793157160282,
        -0.07820773124694824,
        0.046923503279685974,
        0.022291703149676323,
        -0.037542786449193954,
        -0.04266394302248955,
        -0.008412220515310764,
        -0.06454984843730927,
        0.10157300531864166,
        0.04650969058275223,
        -0.041233912110328674,
        0.006568362936377525,
        0.03587121143937111,
        -0.04597688093781471,
        -0.012228514067828655,
        0.00321981287561357,
        0.07798896729946136,
        -0.013395832851529121,
        -0.014260741882026196,
        0.03771955892443657,
        0.006508450023829937,
        0.0294533409178257,
        -0.03691929951310158,
        -0.027224240824580193,
        0.06221988424658775,
        -0.04643703252077103,
        0.05251872166991234,
        0.010981110855937004,
        -0.013410788960754871,
        0.047825898975133896,
        0.00010665029549272731,
        -0.0647507905960083,
        -0.05498350411653519,
        -0.00498076481744647,
        -0.08667759597301483,
        0.04521724209189415,
        0.07584633678197861,
        -0.01871407963335514,
        0.008383016102015972,
        -0.03874673321843147,
        0.015465988777577877,
        0.07600817829370499,
        0.025221455842256546,
        -0.05113128945231438,
        -0.1096307709813118,
        0.05704965069890022,
        0.05274945870041847,
        0.016472093760967255,
        -0.00769362086430192,
        -0.0566554069519043,
        0.024016788229346275,
        -0.05422493442893028,
        0.013316136784851551,
        5.993399827275425e-05,
        -0.09345139563083649,
        -0.024794885888695717,
        0.00457706768065691,
        0.12904240190982819,
        0.025554589927196503,
        -0.021889060735702515,
        0.004396071657538414,
        -0.022196518257260323,
        0.012578558176755905,
        -0.001340563059784472,
        -0.0975920632481575,
        0.009147725999355316,
        0.08729860931634903,
        0.07924452424049377,
        -0.001483710017055273,
        -0.024816351011395454,
        0.07179229706525803,
        -0.12077996879816055,
        -0.07219924032688141,
        0.02116827294230461,
        0.004590942524373531,
        0.027556322515010834,
        0.01470236573368311,
        -0.031781576573848724,
        -0.08407993614673615,
        -0.006454246584326029,
        0.0437660850584507,
        0.03743632510304451,
        -0.025193918496370316,
        0.11126774549484253,
        0.08147644996643066,
        -0.029334504157304764,
        -0.02578149549663067,
        0.010386702604591846,
        -0.07260822504758835,
        0.009541007690131664,
        -0.02499549463391304,
        -0.005944646429270506,
        -0.024700000882148743,
        4.49040678724037e-33,
        -0.080851249396801,
        0.04210774600505829,
        -0.03479866683483124,
        0.019396517425775528,
        0.013161498121917248,
        -0.07050871849060059,
        0.027508961036801338,
        0.11191823333501816,
        0.006210548337548971,
        0.06567033380270004,
        -0.058712415397167206,
        0.024143580347299576,
        -0.04110157862305641,
        0.03763251379132271,
        0.029552359133958817,
        -0.05769684910774231,
        -0.12424512952566147,
        -0.05265221372246742,
        -0.03638681769371033,
        0.02466370165348053,
        0.02759707160294056,
        -0.05016953870654106,
        0.01368391141295433,
        -0.01763615384697914,
        0.015857217833399773,
        0.0002210160600952804,
        0.03338100388646126,
        -0.011291376315057278,
        0.05494808778166771,
        -0.011850720271468163,
        -0.13841985166072845,
        0.02841358073055744,
        0.031918082386255264,
        -0.05169876292347908,
        -0.05448678508400917,
        0.0634400025010109,
        0.09539137035608292,
        -0.04620080813765526,
        0.056438203901052475,
        -0.0155619652941823,
        -0.13620562851428986,
        -0.04553792625665665,
        -0.061620987951755524,
        -0.03963029757142067,
        0.037747688591480255,
        0.024594349786639214,
        -0.007483986206352711,
        -0.09427644312381744,
        -0.02908428944647312,
        -0.07176187634468079,
        -0.05889541655778885,
        -0.07695001363754272,
        0.04509662464261055,
        0.04661130905151367,
        -0.006729842163622379,
        -0.039314039051532745,
        0.040810830891132355,
        0.03581799939274788,
        -0.021526215597987175,
        0.04193660616874695,
        0.0495540127158165,
        -0.028765399008989334,
        -0.055022552609443665,
        -0.01560236793011427,
        -0.12317399680614471,
        0.09384128451347351,
        0.009459994733333588,
        -0.03984943777322769,
        -0.02698185108602047,
        0.06749802082777023,
        -0.014488489367067814,
        0.03578346222639084,
        0.03658394515514374,
        -0.13198842108249664,
        0.08645404875278473,
        0.031520601361989975,
        -0.03921642526984215,
        0.006467547733336687,
        0.0017468169098719954,
        -0.05890391767024994,
        -0.003922327421605587,
        0.008924758061766624,
        0.034153200685977936,
        0.048406682908535004,
        0.023937365040183067,
        0.0011257943697273731,
        -0.04798000305891037,
        -0.023973461240530014,
        0.03017832338809967,
        0.08524290472269058,
        -0.005240932106971741,
        -0.01297497097402811,
        -0.019058652222156525,
        -0.049693819135427475,
        -0.0235295407474041,
        -5.376718507500836e-33,
        -0.012822918593883514,
        -0.03938325121998787,
        -0.04700019583106041,
        0.055042706429958344,
        0.03138265013694763,
        0.027421947568655014,
        0.0037451342213898897,
        0.02972693368792534,
        0.02231137454509735,
        -0.07281102240085602,
        0.00926264189183712,
        0.06684765219688416,
        -0.048031795769929886,
        -0.006593015510588884,
        0.03169102594256401,
        -0.04846023768186569,
        -0.031099343672394753,
        -0.01639460399746895,
        -0.002666292479261756,
        0.017402876168489456,
        0.07281926274299622,
        0.07240922003984451,
        0.031613364815711975,
        -0.029519418254494667,
        -0.02452821098268032,
        0.006508895196020603,
        0.009944403544068336,
        -0.01544043980538845,
        0.08808271586894989,
        -0.0008519183611497283,
        -0.025839027017354965,
        -0.07319563627243042,
        0.012179180048406124,
        0.03262053057551384,
        0.03236205875873566,
        0.020090971142053604,
        0.012131070718169212,
        -0.0047411611303687096,
        0.005648958496749401,
        -0.0091005340218544,
        0.02970065362751484,
        0.017334209755063057,
        -0.015934716910123825,
        -0.009581104852259159,
        0.02461264282464981,
        -0.010203602723777294,
        -0.0690949335694313,
        0.053793929517269135,
        0.06328241527080536,
        0.07642149925231934,
        0.0015313251642510295,
        -0.058494579046964645,
        -0.0673624649643898,
        0.09431665390729904,
        -0.16180004179477692,
        0.009826683439314365,
        0.003769636619836092,
        0.025137655436992645,
        0.03844520077109337,
        0.0329999178647995,
        -0.050293177366256714,
        0.05730549991130829,
        -0.007565428502857685,
        -0.059794772416353226,
        -0.08186301589012146,
        -0.0669732391834259,
        0.030776236206293106,
        0.03064664825797081,
        0.004591420758515596,
        -0.0019562626257538795,
        -0.054535385221242905,
        -0.008696634322404861,
        -0.03712674602866173,
        -0.055868785828351974,
        -0.027051139622926712,
        0.032564450055360794,
        0.021883344277739525,
        -0.014344805851578712,
        -0.014464029110968113,
        -0.036734744906425476,
        0.011877862736582756,
        0.12596549093723297,
        0.06288140267133713,
        -0.0030598710291087627,
        0.08733601123094559,
        0.055313870310783386,
        0.08209525793790817,
        0.0031740644481033087,
        -0.017518190667033195,
        0.03425341472029686,
        0.04340038448572159,
        0.02393496409058571,
        -0.05924243852496147,
        0.056840039789676666,
        -0.020257893949747086,
        -5.6049465513297037e-08,
        0.002527947537600994,
        0.023797936737537384,
        -0.025981124490499496,
        -0.05169817432761192,
        0.02462851256132126,
        -0.017216293141245842,
        -0.014626107178628445,
        -0.018816102296113968,
        0.07932411134243011,
        0.007192639634013176,
        0.12195859849452972,
        -0.07353680580854416,
        -0.13626699149608612,
        0.06433860957622528,
        -0.03929559141397476,
        -0.004762569442391396,
        -0.01243263203650713,
        0.036668386310338974,
        0.010665416717529297,
        0.01708153262734413,
        -0.057316072285175323,
        0.0837094634771347,
        0.00449873274192214,
        -0.08281072229146957,
        -0.014626004733145237,
        0.04513417184352875,
        -0.037004776298999786,
        -0.0033894141670316458,
        0.03280188888311386,
        -0.05657791346311569,
        -0.04263385012745857,
        -0.003495418466627598,
        -0.05953374132514,
        0.025524279102683067,
        0.00033301382791250944,
        -0.005584298633038998,
        -0.014687986113131046,
        -0.02281125821173191,
        0.10773850977420807,
        -0.022097226232290268,
        -0.01188658643513918,
        -0.15122628211975098,
        -0.04314856976270676,
        0.011146108619868755,
        -0.029639970511198044,
        -0.06224297732114792,
        0.008129783906042576,
        -0.1001066267490387,
        -0.012402582913637161,
        0.12229548394680023,
        -0.04212973266839981,
        -0.027661748230457306,
        -0.03934856131672859,
        -0.08071501553058624,
        0.08022517710924149,
        -0.031270261853933334,
        -0.003818882629275322,
        -0.037441253662109375,
        -0.02259621024131775,
        0.04313089698553085,
        0.11754416674375534,
        -0.03027760237455368,
        -0.0013605145504698157,
        0.07298172265291214
    ]
}