{
    "id": "9plKXNvAQwU",
    "title": "NEW iPhone 15 Review - It's more than you think..",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-09-19T14:44:59Z",
    "video_url": "https://www.youtube.com/watch?v=9plKXNvAQwU",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 514815,
    "likes": 14099,
    "comments_count": 768,
    "description": "Click the link here  and use code ijustine to get 10% off!     PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "https://url.rhinoshield.io/ijustine15",
        "https://youtu.be/_3_ibMon2nU",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, it's Justine and today we are checking out the brand new iPhone 15. We've got the Plus in green and the regular iPhone 15 in pink, which obviously we know that I'm excited about. Now, a lot of people are saying that this year's release was a little bit underwhelming and I actually think that this is probably Apple's most impressive base model release that they've had in a really long time. And here's why. (upbeat music) First of all, I think the actual physical design of this new iPhone is really under hyped. This new design with the rounded edges and the matte glass back completely changes the feel of the phone in your hand. It's a big departure from the sharp edges and glossy finish of the previous models which has a huge impact overall on the feel of this device. It feels super premium and with the new color infused glass it looks really amazing too. I can't remember the last time that a base model iPhone felt and looked this good. And of course, one of the biggest and most anticipated changes to the iPhone's design is the move to USBC. This has been such a long time coming and to finally have this connectivity is really awesome. Being able to charge multiple Apple devices with a single cable is gonna make the whole experience so much more streamlined. Now there is a difference between the regular iPhones and iPhone 15 Pros. The iPhone 15 just has USB 2.0 speeds and the Pros have USBC 3.0 speeds which is much faster for data transfer, which is something that we'll definitely be using in those pro phones because we can now shoot in ProRes log and some of those files can tend to be on the larger side so we'll be able to transfer them much quicker. The iPhone 15 comes in two sizes with a 6.1 inch and 6.7 inch super retina XDR display with super durable ceramic shield glass. It comes in five colors, pink, yellow, green, blue and black, and they all look so nice. The colors are really subtle, but also vibrant at the same time, if that makes any sense. It's a little tough to describe, but I'm such a big fan. And obviously the pink finish is my favorite. (upbeat music) (plane buzzing) Now, along with the changes to the hardware design the I iPhone 15 has been upgraded with many Pro features of last year's Pro models. It now has the 48 megapixel main camera that we got with the iPhone 14 Pro. It shoots super high resolution photos and with that resolution you get three different optical quality zoom levels, an ultra wide lens, regular lens, and a 2x lens that all produce photos with incredible detail. And all of these cameras are made better by sensor shift optical image stabilization. (upbeat music) The smooth zoom is also really nice. This allows you to get some super detailed zoom shots and you can zoom in very smoothly optically and digitally switching between the lenses. Something else that is a really cool option is they now have a HEIF Max photo option. So when you have this turned on, you have the ability to take the full 48 megapixel images, but it's not in that huge raw file size that you'll see on the pros. With this, for most people, they're gonna be super happy with the output. (upbeat music) Night mode, and portraits have new upgrades as well. So night mode will activate automatically in dark scenes and with a new high res camera, colors and detail come through so much better. Now this is true for portrait mode as well, and now after you've taken a portrait, you can tap into the image to change the focus from one subject to another. This is pretty awesome. It's ice cream time. This is the first video that I'm filming on the new iPhone 15. And of course we have to get a little mint chocolate chip to match the new, well I'm gonna call it mint green foam. If they don't have mitt chip, I'm gonna be so upset. (beeping) We interrupt this iPhone 15 review to bring you a word from our sponsor, Rhino Shield. They sent me so many cases to check out for my new iPhone 15 and a discount code for all of you guys if you want to check out some of their new cases and some of their older cases for previous gens you can use ijustine for 10% off at checkouts. They also have cases for Apple watches, AirPods, and again if you aren't upgrading and getting a new phone this year, you can upgrade with cases from some previous generations. I mean, there are so many to choose from. They're MagSafe compatible have an 11 foot drop protection with their shock spread technology and 360 degrees of protection. It's also cool that their clear cases come with a five year warranty against yellowing or discoloration. They have a lot of new colors for the iPhone 15 and even an improved grip on solid suitcases. I also love these three D impact screens. They have a transparency one and a privacy shield to protect your screen from sneaky eyes trying to see what's on your screen. The Mod NX are really fun, because they allow you to accessorize your clear cases with different bumpers. They also sent this aqua stand that I'm so excited to test out. It's a water bottle, but it also has a Magsafe flip on the top. So if you're somebody who likes to film your workouts in the gym, this is definitely the water bottle for you. Flip it up, put the phone on it, and that's it. Again, for 10% off, you can use ijustine at checkout. I'll put a link in the description. Thank you again to Rhino Shield for sponsoring a portion of this video. (beeping) (upbeat music) - Can I get a mint chip in waffle cone? - Mint chip waffle cone? - Yes, thank you. Look at this. Oh my goodness, my mint phone and mint chocolate chip ice cream. I'm so excited. The cone was basically staged for the the shot. I gotta eat it like this. It's still good. I'm so happy. The iPhone 15 also now has Dynamic Island. Last year's base models were still rocking the old school notch at the top of the screen, but now all of the models get to enjoy this added functionality. Now if you're not already familiar with it, Dynamic Island takes what used to be just black cutout for the front camera and sensors and it uses that space to display alerts and live activities. So when you get a call or you order food, or things like that, you'll get these cool dynamic animations. Something else I'm excited about is this new integration with iOS 17 called name drop. So you can bring your phones close together, just like this, and you can instantly share your contact information. Now I use Airdrop all the time, so I love that in iOS 17 Airdrop is now taking advantage of wifi and cellular. So if I'm airdropping a file and I happen to not be close to that phone anymore, as I venture off into the world, I can continue sending this through cellular or sending it through the internet when I get home to wifi. Something else that's really fun is FaceTime voicemail. So if I don't answer a call, like this call from Tyler that's coming in and I decide to ignore it, you can actually leave me a voicemail video. - Hey Justine, I'm in your studio right now. I'm just wondering why you're not here. 'cause we have to shoot. So just let me know. Call me back, thanks, bye. - I also really like the live voicemail transcription. I don't like talking on the phone really so I get a lot of voicemails, because everyone knows that I don't answer my phone. So this is cool because I can watch the voicemail text transcribe itself live and decide if it's actually important and I have to answer. Hello, are you okay? - [Tyler] Oh yeah, I'm good. I'm just recording this fake voicemail for the video. - Okay, bye. Now, powering all of this is of course Apple's A16 bionic chip and this is the same chip that we had in last year's pro models. So the iPhone 15 is getting a big performance upgrade. This is a six core CPU with two performance cores and four efficiency cores which is what creates all that power and performance while keeping great battery life. It also has a five core GPU and 16 core neural engine power and computational photography and graphics intensive activities like gaming. So that's it for the iPhone 15s. This is a really fun review to do, because I'm really impressed with how incredible these phones are this year. And like I said, the design change and everything about them is pretty exciting. So if you're looking to upgrade from an older phone and you don't think that the Pro is for you, I'm confident that the base model iPhone 15s are something that you're gonna be super hyped about. If you wanna check out more videos they are here at the end. And of course, subscribe. Hit the bell to be notified when I post new videos and leave me some comments below. I can't wait to hear from you, bye.",
    "transcript_keywords": [
        "iPhone",
        "year Pro models",
        "base model iPhone",
        "pro",
        "phone",
        "Pro models",
        "model iPhone",
        "super",
        "year Pro",
        "year",
        "cases",
        "chip",
        "time",
        "models",
        "Apple",
        "mint",
        "Pros",
        "design",
        "base model",
        "voicemail"
    ],
    "transcript_entity_values": [
        "Plus",
        "Last year's",
        "AirPods",
        "The Mod NX",
        "GPU",
        "five year",
        "one",
        "2x",
        "iOS 17 Airdrop",
        "Pros",
        "iPhone 15",
        "17",
        "Apple",
        "Justine",
        "48 megapixel",
        "A16",
        "CPU",
        "iPhone",
        "USBC",
        "USB 2.0",
        "XDR",
        "three",
        "Dynamic Island",
        "16",
        "11 foot",
        "360 degrees",
        "year",
        "6.1 inch",
        "iPhones",
        "four",
        "last year's",
        "10%",
        "five",
        "six",
        "iPhone 15 Pros",
        "today",
        "this year",
        "6.7 inch",
        "two",
        "Tyler",
        "Airdrop",
        "FaceTime",
        "Rhino Shield",
        "first",
        "ProRes",
        "First",
        "iPhone 15s",
        "15"
    ],
    "transcript_entity_types": [
        "FAC",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "NORP",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL"
    ],
    "vector": [
        -0.05960459262132645,
        -0.039510972797870636,
        -0.009297702461481094,
        -0.12423282861709595,
        0.03241300955414772,
        0.01089860312640667,
        0.03275656700134277,
        0.03698737919330597,
        -0.0014352613361552358,
        0.060643136501312256,
        0.09075392782688141,
        -0.015903417021036148,
        -0.02878987044095993,
        0.052862271666526794,
        -0.020997894927859306,
        0.09218292683362961,
        0.0660962462425232,
        -0.010458867065608501,
        -0.024763520807027817,
        -0.010666589252650738,
        -0.030195288360118866,
        -0.05592162162065506,
        0.0727250874042511,
        0.02459494210779667,
        0.0066659641452133656,
        0.10026566684246063,
        -0.008080849424004555,
        -0.003960794769227505,
        -0.120075523853302,
        -0.07313598692417145,
        -0.014168289490044117,
        -0.001068715238943696,
        0.09069189429283142,
        -0.016230929642915726,
        0.006091830786317587,
        -0.06205781549215317,
        0.007521919906139374,
        -0.013132726773619652,
        0.004004424903541803,
        -0.019204286858439445,
        -0.008055617101490498,
        -0.011960221454501152,
        -0.002737625502049923,
        -0.003987929318100214,
        -0.05067848414182663,
        -0.07353463768959045,
        0.010034067556262016,
        -0.01867355965077877,
        0.03895864635705948,
        0.04905790090560913,
        -0.07364336401224136,
        0.008881666697561741,
        0.02415146864950657,
        0.05079035088419914,
        -0.0586455762386322,
        0.013473478145897388,
        -0.09301628172397614,
        0.01700960285961628,
        0.08506286889314651,
        -0.053791847079992294,
        0.04010193422436714,
        -0.0006539263413287699,
        -0.053041670471429825,
        0.03464244306087494,
        -0.06265739351511002,
        -0.05437334254384041,
        -0.006298954598605633,
        -0.012395708821713924,
        -0.03263648599386215,
        0.054389674216508865,
        -0.10416353493928909,
        0.0341729111969471,
        -0.0067794546484947205,
        -0.025117194280028343,
        -0.02752138301730156,
        0.06923327594995499,
        0.03776182606816292,
        -0.034513361752033234,
        -0.03894302248954773,
        0.050230834633111954,
        0.027178199961781502,
        -0.010445387102663517,
        -0.05086882412433624,
        -0.022283047437667847,
        0.016124414280056953,
        0.03391972929239273,
        0.002502953866496682,
        0.02871869131922722,
        -0.026096997782588005,
        -0.051529958844184875,
        -0.10585075616836548,
        0.023386884480714798,
        -0.023749765008687973,
        0.007058393210172653,
        -0.01742265373468399,
        -0.03253326565027237,
        -0.03697899356484413,
        -0.06972557306289673,
        -0.058183275163173676,
        0.03562350198626518,
        0.06714730709791183,
        -0.09351503849029541,
        0.025952445343136787,
        -0.04608875513076782,
        -0.059175506234169006,
        -0.11278124898672104,
        -0.03470423445105553,
        -0.006325778551399708,
        0.007224705535918474,
        0.07216212153434753,
        -0.010704685002565384,
        0.06088148057460785,
        -0.06670137494802475,
        -0.07336598634719849,
        0.04211770370602608,
        0.12688623368740082,
        -0.04802541434764862,
        0.07868592441082001,
        0.04497925937175751,
        0.007614385336637497,
        -0.006666243076324463,
        -0.08329592645168304,
        -0.04257127642631531,
        0.029668429866433144,
        -0.009610667824745178,
        -0.021549949422478676,
        -0.07355373352766037,
        9.953405845407592e-33,
        0.01652597077190876,
        0.04702990874648094,
        0.0046955980360507965,
        0.03532347083091736,
        -0.010000845417380333,
        -0.03285237029194832,
        0.019617024809122086,
        0.11190197616815567,
        -0.014021141454577446,
        0.013828516006469727,
        0.0004464420198928565,
        -0.007326490245759487,
        -0.04176199436187744,
        0.00635896623134613,
        0.006989282090216875,
        -0.038722798228263855,
        -0.010499674826860428,
        -0.06103237345814705,
        -0.03929195553064346,
        -0.00045481498818844557,
        -0.026112668216228485,
        -0.012985127978026867,
        -0.008463310077786446,
        0.07334351539611816,
        0.07966155558824539,
        0.06568904966115952,
        0.05180635675787926,
        0.013310853391885757,
        0.06070653349161148,
        0.005153254140168428,
        -0.0638405904173851,
        -0.029699357226490974,
        -0.030818626284599304,
        -0.08322776108980179,
        -0.018258070573210716,
        0.026524601504206657,
        0.02129642479121685,
        -0.015971479937434196,
        0.012871627695858479,
        -0.030680786818265915,
        -0.011816166341304779,
        0.01655605621635914,
        -0.03675590455532074,
        -0.02328009530901909,
        0.11846565455198288,
        0.11005303263664246,
        -0.0008823925163596869,
        0.06739027798175812,
        -0.03219328075647354,
        0.0336587093770504,
        0.0004889885894954205,
        0.006215080618858337,
        -0.06742484122514725,
        -0.01319093257188797,
        -0.058990225195884705,
        -0.009463357739150524,
        -0.020920321345329285,
        0.05366699770092964,
        0.030687900260090828,
        0.058129217475652695,
        0.013255313038825989,
        -0.0007979478104971349,
        -0.028458481654524803,
        -0.01635664328932762,
        -0.0872192308306694,
        0.09732239693403244,
        0.03204508498311043,
        -0.0401562936604023,
        0.055438172072172165,
        0.10178874433040619,
        -0.0138620063662529,
        0.03481345996260643,
        0.06581101566553116,
        0.046063996851444244,
        0.03297612443566322,
        0.031119847670197487,
        -0.06786451488733292,
        -0.06269990652799606,
        0.04571685194969177,
        0.006844793446362019,
        -0.12328393012285233,
        0.061550308018922806,
        -0.013778694905340672,
        0.04344252124428749,
        -0.010543396696448326,
        -0.09220175445079803,
        0.017764180898666382,
        -0.044239629060029984,
        -0.003985913470387459,
        0.0526873879134655,
        -0.03552135452628136,
        0.01838926039636135,
        -0.06804513931274414,
        -0.018134867772459984,
        -0.051536284387111664,
        -1.0781842835989292e-32,
        0.0225930567830801,
        0.018114425241947174,
        -0.01905866339802742,
        -0.02624940313398838,
        0.01385559979826212,
        -0.03068794123828411,
        0.0295418594032526,
        0.10888286679983139,
        0.06210080906748772,
        -0.06166372448205948,
        0.07031228393316269,
        -0.051028165966272354,
        -0.09292086213827133,
        0.02877236157655716,
        -0.03724067285656929,
        -0.03840148076415062,
        -0.06784209609031677,
        -0.06431762129068375,
        0.03150920569896698,
        0.005719156935811043,
        0.09340331703424454,
        0.11100123822689056,
        0.07314834743738174,
        0.026897534728050232,
        -0.0009111141553148627,
        0.007199238054454327,
        0.025898614898324013,
        0.04250921681523323,
        0.05950090289115906,
        0.004578561522066593,
        0.01409732922911644,
        -0.08289660513401031,
        -0.031128717586398125,
        -0.033359505236148834,
        0.04471337050199509,
        0.04817897081375122,
        0.00558176264166832,
        0.011853487230837345,
        0.01903098076581955,
        -0.08887970447540283,
        0.05245683342218399,
        0.012526340782642365,
        0.015368754975497723,
        0.0027580668684095144,
        -0.030564500018954277,
        -0.04655757546424866,
        -0.03431324660778046,
        0.023259736597537994,
        -0.004229211714118719,
        -0.010068928822875023,
        -0.04983256757259369,
        -0.03555823117494583,
        -0.07129248231649399,
        0.014973297715187073,
        -0.04820701852440834,
        0.0001375329156871885,
        -0.05311691388487816,
        -0.01624002680182457,
        0.07219580560922623,
        0.005022112280130386,
        0.06584639847278595,
        -0.02206953801214695,
        -0.058856405317783356,
        -0.10565923899412155,
        -0.007245650514960289,
        -0.0977945476770401,
        0.04691224917769432,
        -0.007984541356563568,
        0.00397219555452466,
        0.08124829828739166,
        -0.042087372392416,
        -0.007786562666296959,
        0.06640557944774628,
        0.009936514310538769,
        0.02427070215344429,
        0.012625548988580704,
        -0.05312139540910721,
        0.001942502218298614,
        0.06739921867847443,
        -0.04043625295162201,
        0.009969630278646946,
        0.03329058736562729,
        0.021240992471575737,
        0.05186866223812103,
        0.1053382009267807,
        0.12381811439990997,
        0.07291124761104584,
        -0.014513988979160786,
        0.012663339264690876,
        0.13399840891361237,
        0.01810966059565544,
        0.04541358724236488,
        0.06171220541000366,
        0.11334070563316345,
        -0.11573443561792374,
        -5.5664457931925426e-08,
        0.041072700172662735,
        0.027040595188736916,
        -0.014353794977068901,
        -0.004284970462322235,
        -0.010559603571891785,
        -0.07422894984483719,
        -0.03209943696856499,
        0.023128079250454903,
        0.12033528834581375,
        -0.0478430800139904,
        0.08049363642930984,
        -0.029322132468223572,
        -0.04554518312215805,
        0.12771843373775482,
        0.01286769937723875,
        -0.029093582183122635,
        -0.06297992169857025,
        0.07000698894262314,
        -0.003331500804051757,
        -0.09034142643213272,
        -0.05259447917342186,
        0.07531078904867172,
        0.029435211792588234,
        -0.026664208620786667,
        0.04179585352540016,
        0.010612010955810547,
        -0.05200744420289993,
        -0.029830334708094597,
        0.013956263661384583,
        0.012264838442206383,
        -0.05628469958901405,
        0.00916789285838604,
        0.036051444709300995,
        -0.02110699564218521,
        -0.06208533048629761,
        -0.027104351669549942,
        -0.08333831280469894,
        -0.034815073013305664,
        0.044041264802217484,
        -0.030584853142499924,
        0.0013138821814209223,
        -0.11492566764354706,
        -0.039650581777095795,
        0.0020602610893547535,
        0.00984768383204937,
        -0.09804090857505798,
        0.06696073710918427,
        -0.09820804744958878,
        -0.02018394134938717,
        -0.03581387922167778,
        -0.08967245370149612,
        0.0057158200070261955,
        0.030121315270662308,
        -0.06014522165060043,
        0.089543417096138,
        -0.014888596720993519,
        0.030199214816093445,
        0.01857062429189682,
        -0.04982795938849449,
        -0.051825862377882004,
        0.03491920977830887,
        -0.01787295565009117,
        -0.07406807690858841,
        0.04444659873843193
    ]
}