{
    "id": "9uGViv7ntQY",
    "title": "Does Rivian *really* have 7777 batteries inside?! - Battery Pack Teardown!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-09-26T13:45:00Z",
    "video_url": "https://www.youtube.com/watch?v=9uGViv7ntQY",
    "category": "Howto & Style",
    "tags": [
        "Rivian",
        "electric truck",
        "tesla",
        "electric vehicle",
        "R1t",
        "r1s",
        "7777",
        "Rivian r1t",
        "rivian review",
        "ford lightning",
        "owners review",
        "hummer ev",
        "jerryrig",
        "rivian truck",
        "rivian teardown",
        "rivian battery",
        "sandy munro",
        "electric pickup truck"
    ],
    "views": 933799,
    "likes": 29677,
    "comments_count": 1369,
    "description": "Get a new Rivian and 6 months of free charging on the Rivian Adventure Network HERE:  Today we find out if Rivian really installed 7777 batteries inside their Electric Truck. I've always been curious how many tiny batteries it takes to move a massive truck. And today we are with Munro Live to find out. Check out the 4680 battery teardown HERE:  they have a super cool channel. I was like a kid in a candy shop exploring all of the different electric vehicles Munro has taken apart. Super glad they let me come be a part of the battery module teardown.   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.rivian.com/configurations/list?reprCode=ZACK1594426",
        "https://youtu.be/VEBY7rEUZiI",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Behind me I have a fully torn down Rivian R1T electric truck and we're going to get an exclusive look of the insides. I'm at Munro and Associates, they do this for a living, and it should be very interesting. Plus we'll be getting the first ever look inside of a Rivian battery pack. We can see if it has the 7,777 cells that Rivian claims. Let's get started. [Intro] With an electric vehicle there are some things that are more interesting than others - namely the motors as well as the battery pack. Today we're going to see if Rivian really does have 7,777 batteries inside of this thing, as well as take a tour of stuff that's not normally visible. And we can start, I think, with the motors. The motors inside of the Rivian come in two modules, each with two motors inside of them. One motor for each of the 4 tires which used to be placed at each corner of the vehicle. Back here is a complete module, and this module here up front has been torn down by none other than Sandy Munro. -Thank you. [Laughing] It's good to have you here. -So tell us a little bit what's going on with this motor right here in front. -We call these things the powertrain module. And in essence you've got two motors, an inverter, and then in the center a gear train. So in this particular case the gear train is very very simple because really and truly you don't need much more than a couple of gears. Here what you've got is the rotor. The rotor goes inside the stator, and the stator goes inside this housing. And you can see this housing right there. And then you've got an output shaft. -So basically power comes in from the battery to this portion here, which causes this magnet to rotate, which moves the half shafts and powers the vehicle. -That's correct. -The motor then sits on this cradle here which is positioned between the two front tires. The battery pack is what we see sitting inside between the two frame wells, and we'll get to that in a second. I want to show you something interesting back here. This is the air tank for the adjustable suspension. If you remember from some of my off-roading vehicles, the Rivian has a suspension that can adjust up or down about 6 inches, and all of the air for that adjustment, as well as the air compressor in the back is stored inside this tank. The compressor, interestingly enough, is actually set inside of this foam which I assume is for noise and sound dampening. And that's the compressor itself. These are the air shocks which are just up and down with the four bar suspension link. And I think this is one of the half shafts here. Everything is really torn down. This is where the front trunk used to be...where the driver's seat, passenger seat...we can see the storage area underneath the seats, as well as the pass-through compartment which used to be here. All the electronics are gone, all of the glass is gone. They've really done some work on this thing. If I put it back together do I get to keep it? Is that what the rules are? [Laughing] -If you put it back together I'll give you a gold star. -Oh yeah. If you remember, the only issue I'm having with my truck currently is with the tonneau cover where it won't open all of the way and kind of retract back inside of the cab. That. So I'm hoping that Sandy can help explain how come that's breaking so often on these trucks. -The Rivian's tonneau is a series of slats and this side doesn't really tell you much. What you really want to see is this side. And from here you can see how this is actually working. So you can see here that this is a rack. This rack then interfaces with a couple of gears here that you'll see on this side. They interface with that gear. What happens is you've got what we would call a regulator motor here. So some...the same kind of motor that you use for raising and lowering your windows. When this goes on, the tonneau will go back and forth. Now to help that you've got this helper spring. This spring is basically pretty strong. And what it does is it pushes the component tree up so it can be deployed out. The problem comes when you start bringing it back, and when you bring it back, this gear interfacing with the rack here, it starts to overcome or try to overcome the spring and the friction that you've got going on. -So basically as it's retracting the springs get compressed making it harder for the motor to work, putting more stress on this rod, which puts the gears on that end and this end out of sync and it binds up making that clicking noise that we have on my truck which makes a lot of sense. -This is something that could be fixed. Either you could have a stronger motor here, or a bigger diameter here. Bigger, stronger diameter here. Or the easiest way is to put one motor at each end so that they would turn in synchronous motion. -That's free advice for Rivian on how to fix that component. Now let's get to my favorite part, the battery pack. Behind me is the battery pack for the Rivian R1T. It's made out of 9 different battery modules that each weigh about 150 pounds. And right now we're going to find out how many battery cells are inside each of those modules. Each of the modules sit inside of the battery pack just like this with cooling lines, inlets and outlets plugging into the battery to keep all the cells cool. The cells are about this size right here. This is a 2170 and it looks like it's a double stacked module, meaning a row of cells up top and a row of cells in the bottom. Each of the modules are wired in series, meaning that as they're connected the voltage adds together reaching a total of 400 volts per battery pack. Now obviously we don't want to work on the battery modules when they are fully charged, so this is discharged and we're sitting right around 36 volts which is still very dangerous but much better than fully charged. Behind me is a module that we're going to take apart and actually count the cells inside. We'll see if Rivian was telling the truth or not about the 7,777 cells that make up their truck. You'll notice the yellow foam on the top, we'll cover this more in a second, but it's a polyurethane fire retardant foam, meaning that if anything does catch fire it'll just char and not continue to burn. But hopefully we don't end up with any situation like that here today. If we look close I think we find our first cell right here next to the Rivian logo. I think the first part that needs to come off are the side plates which are part of just keeping all the modules together. And the only way of doing that is with brute force. [Hammering] Oh hey. Nice. We have the bottom of the pack and then we can see the side layout, which we do have all of the cells stacked on top of each other with a bunch of glue and then more of that foam on the top. Now for the other side. We have the Rivian logo right there on the side plate. And now this has to come off. At first glance you might think that because all the batteries are glued together recycling would be a complicated task, but it turns out each of these battery modules, since it's mostly just batteries, are thrown into a giant blender and ground up into little pieces. Then the different minerals and components can all be sorted out as if it was just mined from the ground. Some of the metals can just be lifted out magnetically and then other metals have different buoyancies, and sink or float in a tank and can be separated that way. Currently about 92% of the materials that make up these batteries can be recovered through recycling. Yes. That was a lot harder than I thought. So while the batteries might not look recyclable, they indeed still are. The batteries are most definitely not designed to be disassembled this way, unless of course you are a hobbyist or want to just collect the cells individually. Either way we're going to find a way inside of the pack. Each of the battery modules inside of the Rivian R1T are around 15 kilowatt hours a piece which means each module has about the same power holding capability as a Tesla powerwall. If anyone is planning to attempt to use these on their own projects, you know, building an electric hummer or something, this would be above 14 inches wide, 7 inches tall, and about 23 inches long. The ribbons we're taking off right now is the voltage sensor harness which manages groups of cells in parallel and makes sure all the voltages line up and keeps the battery safe. It takes the voltage information and relays it to the BMS or battery management system. So far everything we've seen is very, very, very similar to the same modules that I used in my military hummer conversion which makes the possibility of using Rivian batteries in the future very interesting. The more electric vehicles we see on the road, the more opportunities we'll have to use them for parts later. [Hammering] Since the modules are double stacked, we have bus bars aligning each of the far ends. Bus bars for the top set of batteries, and different bus bars for the bottom set. The negative bus bar is made from copper and the positive bus bar is made from aluminum. Something sciency about how different metals corrode in different voltage conditions. I won't pretend to understand any of that. Alright, so we have the plastic top and bottom taken off. We have the metal sides taken off. We have the aluminum bus bar here, copper bus bar there. We're left with a solid pack of batteries, which I still think we have some plastic to get through, some foam, basically we're super close to seeing the inside but still very far away. Throughout all of this we found the Rivian logo in all kinds of different places like on this ribbon, as well as right here on the battery. I'm starting to think that the reason these trucks are so expensive is because they wrote Rivian all over the place. Nice. [Hammering] This works. Woo! So right now the way all the cells are connected are with these busbar type things, and the reason we're trying to keep them from touching each other is because if they do touch each other, the different sections...[electric spark sound]...whoa guys! Obviously in a normal situation this pack has zero chance of sparking on its own with how much glue, plastic, and adhesive, and foam is inside of it. It only sparked because I intentionally made it happen. Just saying. [Hammering] Nice. Making progress. Nice. The first battery is out the first of thousands. This battery is called a 2170 which just kind of describes the form factor of the battery. The batteries inside of my hummer are an 18650 slightly smaller. And the cells inside of the structural battery packs that Tesla's making for the Model Y and Cybertruck are the 4680s. I'll give you a side by side comparison. This is the smaller 18650 inside of the Model S, Model X, and my electric hummer conversion. 2170 inside of the Rivian pack, we'll get to counting these in a second. And then this behemoth here is what's going to be inside of the Cybertruck. Not only is the 4680 gigantic when compared to the Rivian cell, but it's also constructed entirely differently, it has something called a tabless design. I'm not going to take apart the battery cell specifically, but Munro Live has a video where they explain the tabless design and roll out the battery. It is 11 feet long inside. So if you've never seen a lithium battery disassembly, I would go check that out. Even though these batteries are quite a bit bigger than say a double A battery. The concept is kind of the same. We have the positive terminal right there in the center, and then the negative terminal is just the entire battery which includes the bottom down here. What Rivian's done though is incredibly interesting instead of connecting the top and the bottom of the batteries, they've connected the positive here and the positive here while connecting the negative sides of the battery. And just putting nothing below the battery, meaning that all of the laser welds and all of the connections happen on just one side of the battery...well top and bottom since we're double stacked. Speaking of which, the cooling plate right here with its inlet and outlet does not run through the battery modules like we see on the Tesla packs. This is just a flat plate with the coolant inside helping to pull the heat away from the battery and take it to some radiator somewhere. The way we can tell Rivian is using generic batteries for their pack is because of this right here where it says 'Samsung' on the side for the brand, as well as 'fire hazard, not for vape.' So if anyone was planning on taking apart their Rivian to replenish their Vape batteries, that is not allowed. Now let's count how many batteries are inside of the Rivian. This Rivian battery module has 24 batteries in 18 rows which means we have 432 batteries in the top half and 864 batteries in the entire module. And if you remember there are 9 modules in the whole truck, which brings us to 7,776 little cells. And when we factor in the flashlight, we get 7,777. So Rivian was definitely telling the truth with how many batteries it takes to move their trucks. With the battery removed, I'm still very impressed with how densely packed this battery is. 150 pounds worth of glue, plastic, and foam all designed to make sure that the batteries never move and never rip these little tiny tabs. Overall that was a super fun project. Very glad I didn't have to take apart my own truck to find out the answer. Huge thanks to Munro and Associates for letting me help out, take apart their battery module. If you haven't seen the inside of one of these cells definitely check out the teardown of the 4680s. The technology in these and where the technology is headed is fascinating. I will leave that video right here. As always, leave any questions down in the comments. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Rivian",
        "battery",
        "inside",
        "Rivian battery module",
        "battery pack",
        "battery modules",
        "batteries",
        "Rivian battery pack",
        "Rivian battery",
        "cells",
        "modules",
        "battery modules inside",
        "pack",
        "module",
        "side",
        "Rivian logo",
        "motor",
        "Back",
        "batteries inside",
        "cells inside"
    ],
    "transcript_entity_values": [
        "the top half",
        "Munro and Associates",
        "the 4680s",
        "4680",
        "Rivian",
        "Vape",
        "tonneau",
        "9",
        "Model Y",
        "18650",
        "about 23 inches",
        "Instagram",
        "four",
        "two",
        "Rivian",
        "864",
        "thousands",
        "Rivian R1",
        "7,776",
        "half",
        "4",
        "zero",
        "Model X",
        "11 feet",
        "about 6 inches",
        "Cybertruck",
        "7 inches",
        "the Model S",
        "Sandy Munro",
        "first",
        "second",
        "7,777",
        "about 150 pounds",
        "2170",
        "Tesla",
        "Munro Live",
        "today",
        "Samsung",
        "18",
        "This spring",
        "14 inches",
        "about 92%",
        "Today",
        "432",
        "24",
        "150 pounds",
        "One",
        "around 15 kilowatt hours",
        "BMS",
        "one",
        "Sandy",
        "Twitter",
        "400 volts"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "FAC",
        "PERSON",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY"
    ],
    "vector": [
        -0.09224767237901688,
        0.04883511736989021,
        -0.06199396029114723,
        -0.008332391269505024,
        0.09616344422101974,
        -0.036902960389852524,
        0.03284884989261627,
        0.04038504883646965,
        -0.06751847267150879,
        0.05849809572100639,
        0.006675217766314745,
        0.0010913051664829254,
        0.02675347961485386,
        0.02207120880484581,
        0.04239530488848686,
        -0.020639820024371147,
        -0.0008849614532664418,
        -0.05323933809995651,
        -0.015794629231095314,
        0.0593634657561779,
        0.047672007232904434,
        0.035884637385606766,
        0.043738339096307755,
        0.007913713343441486,
        0.05006704106926918,
        0.07077936083078384,
        0.019823575392365456,
        0.019247686490416527,
        -0.05638420954346657,
        -0.11804515868425369,
        -0.007264406885951757,
        0.07223545014858246,
        -0.015474243089556694,
        -0.0013934182934463024,
        0.053804926574230194,
        0.08448228985071182,
        0.03599539399147034,
        0.01754719577729702,
        -0.009434513747692108,
        -0.010122104547917843,
        -0.031948965042829514,
        0.005536509212106466,
        0.07723351567983627,
        -0.006701772101223469,
        -0.0681135505437851,
        0.0037954188883304596,
        0.01683027110993862,
        -0.09176544845104218,
        0.07866833359003067,
        -0.0448448546230793,
        -0.018430905416607857,
        -0.03104538284242153,
        0.04757962003350258,
        0.04058821126818657,
        -0.05353033170104027,
        -0.08391539752483368,
        -0.10561821609735489,
        -0.1382199376821518,
        0.03177729621529579,
        -0.02063063532114029,
        0.02538219653069973,
        -0.02641201764345169,
        0.008412227965891361,
        0.033353883773088455,
        -0.06419923156499863,
        -0.03322917968034744,
        -0.005765105132013559,
        -0.09761396795511246,
        -0.055970437824726105,
        -0.10283505171537399,
        0.05883944034576416,
        0.06620605289936066,
        0.05780738219618797,
        0.025311939418315887,
        -0.007538231089711189,
        0.07035154849290848,
        0.07635942101478577,
        0.11935597658157349,
        0.011051375418901443,
        -0.06186070293188095,
        0.055546533316373825,
        -0.05241011828184128,
        0.03269791603088379,
        0.04277930408716202,
        0.03534415736794472,
        0.006667494308203459,
        0.05664622783660889,
        0.0011663720943033695,
        -0.0261825118213892,
        -0.04514652490615845,
        0.05720732361078262,
        0.056882698088884354,
        0.04768276587128639,
        -0.030503960326313972,
        -0.05933909863233566,
        -0.00783106405287981,
        -0.07575317472219467,
        0.028494102880358696,
        -0.06000993028283119,
        0.07950932532548904,
        0.05073229968547821,
        0.07827577739953995,
        0.02666531875729561,
        -0.10827980935573578,
        -0.05761460214853287,
        -0.020858347415924072,
        -0.06891678273677826,
        0.0730474665760994,
        0.0410412959754467,
        -0.02167528308928013,
        0.028292881324887276,
        0.020024601370096207,
        0.07062533497810364,
        0.0453619509935379,
        -0.028283508494496346,
        0.001333647989667952,
        -0.06519293785095215,
        0.03244788572192192,
        0.07914123684167862,
        0.05510735139250755,
        0.0448899120092392,
        0.021957524120807648,
        0.03669596090912819,
        0.046222981065511703,
        0.04547445476055145,
        0.10508351027965546,
        -0.025993194431066513,
        4.048687968954017e-33,
        -0.06048744544386864,
        0.020771700888872147,
        0.02580922842025757,
        0.0008566192118450999,
        -0.06832117587327957,
        -0.003198628779500723,
        -0.05330390855669975,
        0.03639518469572067,
        -0.008969392627477646,
        -0.01471138745546341,
        -0.07384920120239258,
        0.03646217659115791,
        0.01816566474735737,
        -0.02825755625963211,
        0.011051644571125507,
        -0.04071704298257828,
        -0.0007068527629598975,
        -0.10317466408014297,
        -0.021832691505551338,
        -0.057688359171152115,
        -0.0514039471745491,
        0.06027057394385338,
        0.006645906250923872,
        0.09175611287355423,
        0.09190764278173447,
        0.11904997378587723,
        0.08996042609214783,
        -0.015397748909890652,
        0.06390165537595749,
        0.059972599148750305,
        -0.06523784250020981,
        0.030733583495020866,
        0.05096957087516785,
        0.053199946880340576,
        -0.04794654995203018,
        0.03127025440335274,
        -0.08051353693008423,
        -0.1130683645606041,
        -0.0858621820807457,
        -0.046202339231967926,
        -0.006465449929237366,
        0.04937734454870224,
        -0.1092439740896225,
        -0.023822493851184845,
        -0.08474305272102356,
        -0.032051634043455124,
        0.01934046670794487,
        0.06247051805257797,
        0.022620173171162605,
        0.034417539834976196,
        -0.06369192898273468,
        -0.04655010625720024,
        -0.03477475419640541,
        -0.03015984781086445,
        -0.05358804017305374,
        -0.02772962488234043,
        -0.003465804737061262,
        -0.057140495628118515,
        0.10058682411909103,
        -0.019435901194810867,
        0.06831885129213333,
        0.017504889518022537,
        -0.03836589679121971,
        -0.0026796942111104727,
        0.008565215393900871,
        0.02939264290034771,
        -0.03659859299659729,
        -0.02089121751487255,
        -0.10932441055774689,
        0.022278783842921257,
        0.006165062543004751,
        -0.1057857796549797,
        0.029197195544838905,
        -0.07685928791761398,
        0.00585147924721241,
        -0.016330230981111526,
        -0.009182619862258434,
        -0.01638740673661232,
        0.04094047099351883,
        -0.001411876524798572,
        -0.06644506752490997,
        -0.03310583159327507,
        0.01282393466681242,
        0.02933371439576149,
        0.02426214888691902,
        -0.09203865379095078,
        -0.0011375944595783949,
        -0.07761549204587936,
        -0.00893954187631607,
        -0.024044042453169823,
        0.032466474920511246,
        -0.03628566116094589,
        -0.04258633404970169,
        -0.014027384109795094,
        -0.020420657470822334,
        -5.2167047063371364e-33,
        0.012301983311772346,
        0.008009729906916618,
        -0.00537008885294199,
        0.00282382033765316,
        0.037686027586460114,
        0.051234111189842224,
        0.01615835167467594,
        0.06162217631936073,
        -0.028949812054634094,
        -0.09635502845048904,
        -0.005925898905843496,
        0.005566918756812811,
        -0.0681273341178894,
        -0.027219299226999283,
        0.07798761129379272,
        -0.03010619431734085,
        0.062498338520526886,
        -0.03942323476076126,
        0.021874679252505302,
        -0.017523018643260002,
        0.03262340649962425,
        0.02363237738609314,
        0.023716021329164505,
        0.0759199857711792,
        0.08090516924858093,
        0.023035338148474693,
        0.025037875398993492,
        -0.004792950116097927,
        0.06076366454362869,
        -0.006148478947579861,
        -0.039289332926273346,
        -0.07952883839607239,
        -0.02051476575434208,
        0.12565118074417114,
        -0.1066930741071701,
        -0.02937863953411579,
        0.0356430858373642,
        0.06632032245397568,
        -0.004017469007521868,
        -0.06326330453157425,
        -0.021518157795071602,
        -0.0516844242811203,
        -0.02540474943816662,
        -0.007651717867702246,
        -0.08362928032875061,
        -0.09244859963655472,
        -0.01128779724240303,
        0.013530399650335312,
        -0.021709732711315155,
        -0.029264315962791443,
        -0.039073605090379715,
        0.034516580402851105,
        -0.08693622052669525,
        0.025171181187033653,
        -0.08463151007890701,
        0.040781013667583466,
        0.01639658957719803,
        0.051643937826156616,
        0.026087064296007156,
        -0.027308963239192963,
        0.05816107615828514,
        -0.047340184450149536,
        -0.01320184487849474,
        -0.0025114405434578657,
        -0.037584494799375534,
        -0.03455560281872749,
        -0.007087971083819866,
        0.011493945494294167,
        -0.0011779750930145383,
        -0.07001414895057678,
        -0.01480939146131277,
        -0.028164364397525787,
        0.01984490267932415,
        -0.04762199893593788,
        -0.03197939693927765,
        -0.04214183986186981,
        -0.010198798961937428,
        -0.07199782878160477,
        -0.0012669656425714493,
        -0.05672102048993111,
        0.00991353765130043,
        -0.051081523299217224,
        -0.001454640063457191,
        0.032408565282821655,
        0.023690933361649513,
        0.05201343446969986,
        0.13040028512477875,
        0.05803211033344269,
        0.026824915781617165,
        0.014584858901798725,
        0.009310225024819374,
        0.026493435725569725,
        -0.006856421008706093,
        0.09020192921161652,
        -0.03096191957592964,
        -5.516353951406927e-08,
        -0.004371196031570435,
        0.027026083320379257,
        -0.006287891883403063,
        -0.04906824231147766,
        0.05681910738348961,
        -0.014547532424330711,
        0.034032829105854034,
        0.11848077923059464,
        -0.09207706898450851,
        0.07174573838710785,
        0.11733750253915787,
        0.037268076092004776,
        0.04742148891091347,
        0.012558952905237675,
        -0.03442851081490517,
        0.07405684888362885,
        0.013050276786088943,
        0.0738559439778328,
        -0.014976846054196358,
        0.05086866021156311,
        -0.026817936450242996,
        -0.08189669996500015,
        0.041922274976968765,
        0.060873210430145264,
        0.021546700969338417,
        0.009543445892632008,
        -0.1184108704328537,
        0.01963833160698414,
        0.044971685856580734,
        -0.06839322298765182,
        -0.0593503974378109,
        -0.006651104893535376,
        0.01983463764190674,
        -0.01827041059732437,
        -0.07297024130821228,
        -0.04575464129447937,
        -0.012897987850010395,
        -0.01695159263908863,
        0.0702243521809578,
        -0.03264807537198067,
        -0.03099323809146881,
        -0.048742763698101044,
        -0.03605042025446892,
        0.05321257561445236,
        -0.05072084814310074,
        -0.0207911878824234,
        0.009291727095842361,
        -0.06467179208993912,
        -0.044061657041311264,
        0.01399276778101921,
        0.03231207653880119,
        0.008974487893283367,
        -0.040190137922763824,
        0.015588350594043732,
        -0.000645408988930285,
        -0.006018574349582195,
        -0.05370136722922325,
        -0.010739954188466072,
        -0.010191414505243301,
        -0.00854777917265892,
        0.08340668678283691,
        -0.08934681117534637,
        -0.008359115570783615,
        0.024003811180591583
    ]
}