{
    "id": "9vqjSl_h3z4",
    "title": "Best of CES 2022",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-01-07T14:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=9vqjSl_h3z4",
    "category": "Science & Technology",
    "tags": [
        "CES",
        "CES 2022",
        "best of ces 2022",
        "ces bmw color changing",
        "ces bmw 2022",
        "color changing car",
        "color changing bmw ces",
        "color changing bmw",
        "psvr 2",
        "samsung freestyle review",
        "samsung freestyle portable projector",
        "sony car",
        "ces 2022 highlights",
        "ces 2022 samsung",
        "asus laptop",
        "best tv",
        "best laptops",
        "electric cars 2022",
        "ev",
        "electric cars",
        "gm",
        "supercuts",
        "gm ces",
        "gm ces 2022",
        "dieter bohn",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge",
        "ces"
    ],
    "views": 841365,
    "likes": 19181,
    "comments_count": 583,
    "description": "CES 2022 is over and we have a recap of all of the biggest gadgets, cars, and concepts from the event. The announcements included incredible TVs, weird laptops from Dell and Asus, electric cars from GM and even Sony(?!), and much more. Dieter Bohn breaks down the concepts from big tech companies and the reality of what might actually ship this year.   Read more:   Watch more of our CES coverage: Alienware at CES 2022:   Lenovo ThinkPad Z-Series first look:    Dell XPS 13 Plus:   AMD at CES 2022 in 10 minutes:   Nvidia CES 2022 keynote in 6 minutes:   Intel at CES 2022 in 4 minutes:    Sony at CES 2022 in 5 minutes:    0:00 Intro 1:11 HDMI 2.1a 1:19 Sony quantum dot OLED TVs 1:39 New display technology (mini LED, micro LED, Neo QLED, and OLED EX) 1:55 Sony tv camera concept 2:05 Samsung TV NFT integration 2:15 Remote charges over radio waves 2:19 Samsung Tizen TV os update 2:48 LG 42-inch OLED TV 3:10 Intel Alder Lake CPU 3:48 AMD Ryzen 7000 desktop processor 3:59 AMD Ryzen 6000 laptop processor 4:10 Nvidia 3090 Ti, 3080 Ti, 3070 Ti 4:26 Nvidia G-Sync monitor update  4:39 Dell XPS 13 plus 4:57 Lenovo ThinkPad Z-series 5:18 Lenovo ThinkBook Plus Gen 3 5:31 ASUS 17-inch foldable OLED laptop 5:40 ASUS ROG Zephyrus G14 and G15 5:52 Mercedes-Benz EQXX electric concept 6:15 Color-changing BMW iX Flow 6:36 Sony Vision S electric SUV 6:39 More car announcements 7:04 Electric Chevy Silverado 7:20 Electric Equinox and Blazer 7:29 BMW iX M60 SUV 7:55 Google CES announcements 8:47 Samsung Galaxy S21 FE 9:03 OnePlus 10 Pro spec announcement 9:27 Lightning round 11:18 Conclusion  Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://www.theverge.com/e/22635284",
        "https://bit.ly/339CcnA",
        "https://bit.ly/3F4FR3c",
        "https://bit.ly/3qYBt0I",
        "https://bit.ly/3qYC4zF",
        "https://bit.ly/3G5o0L4",
        "https://bit.ly/3t9s8WD",
        "https://bit.ly/3zysPd8",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(mellow dance music) - Hi, everybody. Good to see you again. Be seen by you again. I'm back, and I'm here to talk about CES 2022, the biggest gadgets and trends and concepts that we saw at the show this year. And I actually think this was a better than average CES. Even though this was a very weird CES, because even though technically you could have gone to Las Vegas, and some people did, most of us didn't. Every year at CES, we talk about the difference between concepts and reality. And so this was the concept of what CES was supposed to look like. And this is the reality. (dance music) There's a lot of vaporware at CES, but I think that people who complain about that are kind of missing the point. A lot of the concepts at CES are about floating ideas to see what consumers' reactions are to it. And also, there's actually just a lot of stuff that actually does ship that is shown at CES. So I want to talk about both of those things. If you know anything about CES, do you know that it is a TV show and the TVs at CES are concepts and there's also some real stuff. So let's talk about the concepts first. The first concept to be aware of is HDMI 2.1a, a new version of the spec, because it wasn't confusing enough before, whatever. To me, the most exciting concept was Sony announced quantum dot OLED TVs. I'm sure they'll ship one, but the idea here is that OLED is a little bit dimmer than it needs to be because it has to shine the light through a filter. But quantum dots can make color without a filter, and so they could be much, much brighter. They beat Samsung to it. I'm really excited to see what Sony does with it. The other TV technology at CES are mini LED and micro LED and Neo QLED and OLED EX, which is even brighter OLEDs from LG. Just have all that stuff in the back of your mind, just stuff that might exist in TVs you actually want to buy someday. There are some other concepts. So for example, there's a camera that Sony is going to sell that will change the sound based on where it sees you in the room, or it will scold you if you sit too close to the TV, which is incredible. Samsung is putting NFTs on their TVs. Don't buy an NFT from Samsung's on their TV. Just don't, just don't do that. That's a bad idea. They're also making a remote that can be powered off of the radio from your router, because why not? Okay, but what's the reality of TVs in 2022? Well, first, Samsung is shipping new versions of its Tizen software with a new home screen, the ability to watch together with somebody else remote. But most importantly to me, a new gaming hub. It's going to support Geforce from Nvidia, and Stadia game streaming. But it's also going to work better with local consoles. And if you manage to get a next gen console, like a PS5 or an Xbox one series X, whatever they're called, hopefully that will be a little bit easier to set up your TV with. But the sleeper hit of the show might be LG's 42-inch OLED TV. Normally you think of TVs being impressive because they're huge, but the smaller one is interesting because it could be used as a gaming monitor maybe. But at the very least, you will have a TV with just perfect picture quality in a smaller size that you might actually want to put in a smaller room. The next big thing that happens at CES is we get a lot of chip announcements. Those are the concepts, and then the reality is you want to buy a laptop. So let's talk chips. So Intel announced the 12th gen Alder Lake chips, and they say they're going to be the most powerful laptops ever, that they're going to beat Apple's M1 Max chip on performance because they've got a dramatically increased core count, and maybe they will, but Intel didn't say much about battery life. And that's one of the reasons people are so impressed with these MacBook Pros is they have the power and they have the increased battery life. Now, Intel I think is the more important company to talk about, because frankly, most laptops are still shipping with Intel chips. But I think AMD is the much more interesting chips to talk about. They announced their Ryzen 7000 desktop chips with the Zen 4 architecture, five nanometer process. They're coming in the second half of 2022. It should be a step change in performance, we hope. They also announced the Ryzen 6000 laptop chips. Now, this is Zen 3 architecture and 6 nanometer process, but it should have double the graphics performance. So if I buy a gaming laptop this year, that's probably what it's gonna be. And then lastly, Nvidia announced some stuff, 3080 Ti, T-I, 3070 Ti, T-I, whatever they call it. They don't even know themselves. There's also the 3090 Ti. But are these real or are they just concepts, because nobody can buy Nvidia graphics cards because they're never in stock. Who knows? There's also a new version of the G-SYNC monitors that let you switch dynamically between 1440p and 1080p. That's cool. So conceptually, know what the chips are, but reality, what kind of laptops are you gonna be able to buy? Well, I think the most interesting laptop to me is the Dell XPS 13 Plus. And it's interesting because, yo, it's weird. They have like a touch bar that's not a touch bar. The track pad is like completely invisible. The keyboard is redesigned. We have a great hands-on video from Monica. You should go check it out because again, it's super weird. There's also the new Lenovo ThinkPad Z series, Z series. It's a new version of ThinkPads that a little bit less enterprised, a little bit more designed for consumers or Gen Z. They've got a new look. You can get them with vegan leather. The camera on the front of it actually sticks out of the top of the monitor. So instead of a notch inside, you've got a neganotch on the outside. I think that's clever. Finally, there are a bunch of laptops that are gonna ship, but they're they're concepts. They're like real concepts. There's the Lenovo ThinkBook Plus Gen 3, which has an eight-inch secondary screen on the keyboard deck. ASUS says it's going to release a 17-inch foldable OLED laptop this year. Sure. To me, the most practical, exciting laptop is probably gonna be the ASUS ROG Zephyrus G14 and G15 because they're finally adding webcams to these laptops. Next up, cars. CES is a car show this year, and oh my God, it was a super year for concepts. Concept cars out the wazoo. Mercedes-Benz unveiled a ultra long range vision EQXX electric concept car. It looks ridiculous, but it's supposed to have 600 plus miles of range. It's there to prove that EVs can have that much range, but it's never gonna sell. There is this new BMW that had color change technology, where it could change from black to white dynamically because it uses E ink on the outside. And it just looks sick. Also, Sony has this vision S concept. They showed off a car a couple of years ago. They had an SUV this year, and they say they're starting a brand new company to explore actually making cars. Okay, Sony. Chrysler had a concept Hyundai, said that they're gonna have robots everywhere. General Motors says that they're going to get to autonomous vehicles by the middle of the decade. Volvo says they're going to have unsupervised highway driving mode in California. All of the self-driving stuff is very unlikely to actually be as good as they claim, but I'm glad they're still pushing forward, I guess. Okay, but what about the real cars? Well, I think the most important one is probably going to end up being the Chevy Silverado electric truck, because Americans like buying trucks. However, it's not due to ship until late 2023, and it's based on that Hummer base. And I just think that that ship date is not likely to happen. So is it real or is a vaporware? Who knows? GM also announced that they're going to have electric versions of the Equinox and the Blazer. The Equinox in particular is important because it's supposed to have a $30,000 starting price. Finally, BMW has a new car. It's the M60. it's a dual motor performance EV with 280 miles of range. This one's important because it's got that M branding for performance. It's supposed to go to zero to 60 in 3.6 seconds. To me, the interesting thing is that BMW claims they don't have rare earth metals in the electric motor. You think of EVs as being more environmentally friendly, but most of these companies aren't talking about rare earth metals. So good on BMW for trying to push that forward. Now, as far as phones go, CES is not a big phone show, but there is always some phone stuff to talk about. So on the concept side, the big news is that Google is going to be making a bunch of new features for Android that will make that ecosystem feel a little bit more integrated, a little bit more like what Apple users enjoy. So for example, Bluetooth headphones should be able to automatically switch between Android phones and, say, a Google TV. You should be able to have your text messages on your Chromebooks. So it'll mirror your apps from your phone directly to the Chromebook. You should be able to use Nearby Share, which is kind of like Airdrop, to squirt files from your phone to a Windows PC, but only select Windows PCs, not everything. The hassle with all of these concepts is they're concepts. They haven't shipped yet. Google says they're all coming in the coming months. So we gotta wait for those updates to actually arrive. What about reality? Well, there is a real phone coming. It's a Galaxy S21 FE, the fan edition. It's a mid-range phone that I find a little bit weird because it's not that far in price from the regular Galaxy S21, and the Galaxy S22 is right around the corner. Hopefully this thing gets some major discounts so it actually makes sense for consumers. There's also the OnePlus 10 Pro. That has been coming out in multiple announcements because that's how phones seem to be announced these days. So we know what it looks like. I think it looks pretty good. We know the specs, their flagship specs for 2022. We know it's coming to China. As of this recording, I don't know when it's coming to the rest of the world or what the price is going to be. I'm sure there'll be six more announcements between now and we find out that information. Okay, lightning round. Concept, reality, whatever, I just want to talk about stuff that's cool. There is a home robot that is basically just like a self-driving shelf and box that follows you around. That sounds silly, but if you have mobility issues, having something to help you carry stuff is actually super important. So I hope this thing ships. Withings has a new smart scale with a handle and you pull up the handle and that's used for EKG, but also for body composition, which to me is more important than just your raw weight. This is nerdy, but NXP has a chip that makes it easy to add WiFi 6, Bluetooth 5.2, and Thread to a smart home gadget. What are the big stories of the show is Matter, this new smart home spec, that makes it easier to make smart home gadgets work with anything. And so this should mean that we'll see more of those next year and the year after. Samsung has a portable projector. It's the freestyle projector. And actually it's really cool, because it solves a lot of practical problems that portable projectors have. That is a lot of Ps, and I managed to get it right that time. So it shows up on different colored walls, it auto fixes the color, it does keystoning. It can go in different directions. You can put little caps on it to make a light show. You can screw it into a light bulb. It's just a ton of fun. Speaking of Samsung, there's the Odyssey Ark, its largest curved monitor yet. And instead of looking at it like this, you can turn on its side so it goes over your head like an Omnimax screen, and that's dope. There's a new Skydio 2 Plus. They're going to have a software update for it later this year, where you can program it as a camera man, instead of just having it follow you. So you can do more complex actions without having to have a drone pilot around. Last and I don't think least, there's a new smart dog collar. We've seen these before, it's got GPS, but this one also tracks vitals, heart rate and activity. And that's kind of neat because getting that into a relatively loose dog collar is a hard technical challenge, and they say they solved it. So that was CES 2022. We've got a lot more coverage on theverge.com. I have barely scratched the surface because this was actually a relatively good year, both for concepts, and, I hope, for real products that are really going to ship. So what's my big takeaway for the difference in the concept and reality at CES? Well, it's simple. We're living in a simulation where the distinction between concept and reality doesn't actually exist. No, I'm just kidding. No, to me, the thing that surprised me this year is I actually am a little bit hyped up about some of this hype. And I think that that is okay. And if you're hyped too, just remember that hype isn't real, it's not real until it ships. So don't pine for something until it really seems like it's gonna hit store shelves, and don't buy it until you see a review. So CES has kicked off the year end gadgets, just like it does every year. I really hope this year is a better year than last year. So not to get too sincere about it, I hope that you will have a better year this year than last year. And I really do appreciate you watching all the videos that we make here, and we're excited to make a bunch more for you in 2022.",
    "transcript_keywords": [
        "CES",
        "year",
        "concepts",
        "concept",
        "talk",
        "reality",
        "stuff",
        "real",
        "Samsung",
        "OLED",
        "bit",
        "Sony",
        "chips",
        "lot",
        "laptop",
        "show",
        "buy",
        "announced",
        "coming",
        "phone"
    ],
    "transcript_entity_values": [
        "zero",
        "Android",
        "G15",
        "Monica",
        "the middle of the decade",
        "Google TV",
        "NFT",
        "Hyundai",
        "Silverado",
        "EV",
        "the coming months",
        "a better year this year",
        "a couple of years ago",
        "Mercedes-Benz",
        "every year",
        "Equinox",
        "Equinox",
        "NXP",
        "12th",
        "Omnimax",
        "late 2023",
        "M60",
        "Chrysler",
        "the Galaxy S22",
        "600 plus miles",
        "the year end",
        "OnePlus 10 Pro",
        "GM",
        "M1 Max",
        "Lenovo ThinkPad Z",
        "17-inch",
        "ASUS",
        "280 miles",
        "Stadia",
        "Google",
        "Geforce",
        "Samsung",
        "the second half of 2022",
        "Galaxy S21",
        "42-inch",
        "Hummer",
        "this year",
        "Xbox",
        "China",
        "OLED",
        "BMW",
        "first",
        "3080 Ti",
        "next year",
        "last year",
        "PS5",
        "Dell",
        "Americans",
        "30,000",
        "Volvo",
        "Windows",
        "LG",
        "AMD",
        "General Motors",
        "Nearby Share",
        "California",
        "Chevy",
        "Alder Lake",
        "a super year",
        "Airdrop",
        "Las Vegas",
        "these MacBook Pros",
        "4",
        "6 nanometer",
        "these days",
        "later this year",
        "five nanometer",
        "XPS 13 Plus",
        "the Lenovo ThinkBook Plus Gen 3",
        "Intel",
        "Galaxy S21 FE",
        "CES",
        "Withings",
        "the year after",
        "Apple",
        "EKG",
        "Every year",
        "Skydio 2 Plus",
        "ThinkPads",
        "2.1a",
        "60",
        "six",
        "Gen Z.",
        "Tizen",
        "Ryzen 7000",
        "eight-inch",
        "Chromebook",
        "3",
        "3.6 seconds",
        "a better year than last year",
        "Sony",
        "Nvidia",
        "Ps",
        "2022",
        "Blazer"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "NORP",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "GPE",
        "ORG",
        "LOC",
        "DATE",
        "PRODUCT",
        "GPE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "FAC",
        "QUANTITY",
        "FAC",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT"
    ],
    "vector": [
        -0.07299652695655823,
        -0.004863755777478218,
        0.04664522409439087,
        -0.07158739119768143,
        0.05907515808939934,
        -0.001233148155733943,
        -0.08079938590526581,
        0.089213527739048,
        0.018147582188248634,
        -0.012013321742415428,
        -0.034254640340805054,
        -0.005502320826053619,
        0.04456840455532074,
        0.0008156621479429305,
        0.018967365846037865,
        -0.07499050348997116,
        0.1291615515947342,
        -0.153639018535614,
        0.07076384872198105,
        -0.04494771361351013,
        0.012118322774767876,
        0.011881696060299873,
        -0.024764008820056915,
        -0.029647057875990868,
        0.0013540778309106827,
        0.02578885853290558,
        0.03567315638065338,
        -0.03601878881454468,
        -0.03019838221371174,
        -0.020218076184391975,
        0.007697898894548416,
        0.08240847289562225,
        -0.028371673077344894,
        0.04532913118600845,
        -0.05958693102002144,
        -0.09227567166090012,
        0.04691215232014656,
        -0.0839926153421402,
        -0.017158035188913345,
        -0.12114781141281128,
        -0.03728438913822174,
        -0.08770021051168442,
        -0.01829073764383793,
        0.023734629154205322,
        0.10294162482023239,
        -0.05782940983772278,
        0.03320853412151337,
        -0.07591158151626587,
        -0.035642027854919434,
        -0.03242582455277443,
        -0.034961920231580734,
        -0.05394866690039635,
        0.03797608241438866,
        0.00408564368262887,
        -0.019992521032691002,
        0.048682380467653275,
        -0.02035767212510109,
        -0.037466082721948624,
        0.029630206525325775,
        -0.0011369946878403425,
        0.04752752557396889,
        -0.12482757121324539,
        0.020156487822532654,
        0.05794868245720863,
        0.012555254623293877,
        -0.0018589083338156343,
        0.00021430950437206775,
        0.034604448825120926,
        0.007943023927509785,
        -0.018938828259706497,
        -0.08113955706357956,
        0.029218478128314018,
        0.07073001563549042,
        -0.02238711155951023,
        0.02767876163125038,
        0.012904824689030647,
        0.09790525585412979,
        -0.06822808086872101,
        0.04076807573437691,
        -0.09999588876962662,
        0.016491606831550598,
        -0.054581087082624435,
        -0.08754930645227432,
        -0.025764625519514084,
        -0.001501871389336884,
        0.00911499559879303,
        0.0019361412851139903,
        0.04425784945487976,
        -0.03172590956091881,
        -0.042865097522735596,
        -0.013404160737991333,
        0.009065975435078144,
        -0.009163002483546734,
        0.025023240596055984,
        -0.037201978266239166,
        0.021815000101923943,
        0.031322039663791656,
        -0.06651607900857925,
        0.044889118522405624,
        -0.004253145772963762,
        -0.004919008351862431,
        0.08360376209020615,
        0.05984249711036682,
        -0.028322339057922363,
        -0.03484724834561348,
        -0.05541784688830376,
        0.06139061599969864,
        0.025857295840978622,
        -0.009553954005241394,
        0.008568157441914082,
        -0.012268533930182457,
        0.03532818332314491,
        -0.07586276531219482,
        -0.05330966040492058,
        -0.031147489324212074,
        0.05626422166824341,
        -0.004071046598255634,
        0.06035539135336876,
        0.09614723175764084,
        -0.010808344930410385,
        0.005870668217539787,
        0.030508412048220634,
        -0.08413903415203094,
        -0.019025683403015137,
        -0.015346524305641651,
        0.04218044877052307,
        -0.04175334796309471,
        1.0547180368102577e-32,
        -0.07503312826156616,
        0.05598563700914383,
        -0.07214147597551346,
        -0.013820868916809559,
        0.01157577708363533,
        0.09610269218683243,
        0.006996875163167715,
        0.08949257433414459,
        0.014852955937385559,
        -0.021903982385993004,
        -0.03553576022386551,
        -0.010502246208488941,
        -0.06186157092452049,
        0.008092092350125313,
        0.032352596521377563,
        -0.12358876317739487,
        -0.03346451744437218,
        0.034805651754140854,
        -0.08448007702827454,
        -0.013061730191111565,
        0.04583548381924629,
        0.00010375498095527291,
        -0.010449315421283245,
        -0.0907658040523529,
        0.10687781870365143,
        0.034045882523059845,
        0.014371179975569248,
        0.021360836923122406,
        0.020605754107236862,
        0.029416730627417564,
        -0.031139137223362923,
        -0.013790418393909931,
        -0.007279515732079744,
        0.00812656618654728,
        -0.005860448814928532,
        -0.01297213789075613,
        -0.0323326475918293,
        -0.08383550494909286,
        0.006505266297608614,
        -0.016690272837877274,
        -0.026234710589051247,
        0.12426391988992691,
        -0.0946447104215622,
        -0.026622073724865913,
        -0.002607997041195631,
        0.02663452737033367,
        0.03873104974627495,
        -0.009373660199344158,
        0.05598893389105797,
        -0.019811231642961502,
        -0.08018890768289566,
        0.019931787624955177,
        -0.03258998319506645,
        -0.03766688331961632,
        0.071539007127285,
        -0.05844888463616371,
        0.01860645040869713,
        -0.09129450470209122,
        0.030368562787771225,
        0.07870791107416153,
        -0.03750483691692352,
        0.009537084959447384,
        -0.07493117451667786,
        -0.034718479961156845,
        -0.06760258972644806,
        0.10929174721240997,
        0.09148360788822174,
        0.08280986547470093,
        -0.09049220383167267,
        0.06459561735391617,
        -0.027664287015795708,
        -0.0029355869628489017,
        0.05133025720715523,
        -0.05266401916742325,
        0.03441641479730606,
        0.04751177877187729,
        0.010389340110123158,
        -0.011126737110316753,
        0.01185724325478077,
        0.0056763398461043835,
        -0.05148397013545036,
        0.004399578552693129,
        0.030560672283172607,
        0.006686322391033173,
        0.08370688557624817,
        0.04001905769109726,
        -0.07040353119373322,
        0.03624440357089043,
        -0.020242473110556602,
        -0.047520220279693604,
        -0.031671732664108276,
        -0.05717077851295471,
        0.06770668178796768,
        0.06397970020771027,
        -0.04161179065704346,
        -1.036832522920512e-32,
        0.00960379559546709,
        0.04527496546506882,
        -0.046431053429841995,
        0.009102578274905682,
        0.03461958467960358,
        -0.08395618200302124,
        -0.011867005378007889,
        0.04987628012895584,
        -0.0030518788844347,
        -0.025521237403154373,
        0.024876978248357773,
        0.026055961847305298,
        0.01503775268793106,
        0.030378324910998344,
        -0.017516333609819412,
        -0.04119725152850151,
        0.03177618235349655,
        -0.1137685552239418,
        0.044629793614149094,
        -0.011404681950807571,
        0.08402502536773682,
        0.035961881279945374,
        -0.0753335952758789,
        -0.02816183678805828,
        0.027894988656044006,
        0.053456541150808334,
        0.02034686878323555,
        -0.003866596380248666,
        0.005575368646532297,
        -0.010058657266199589,
        -0.06944571435451508,
        -0.0747251957654953,
        0.002420694101601839,
        0.07705943286418915,
        0.10925614088773727,
        -0.003860955825075507,
        0.04817289486527443,
        -0.017123181372880936,
        -0.020954595878720284,
        0.001405640272423625,
        0.0665808841586113,
        0.05809875577688217,
        -0.06163286417722702,
        0.07735183089971542,
        0.043114934116601944,
        0.024937445297837257,
        -0.042728301137685776,
        -0.007153892889618874,
        0.023082297295331955,
        0.010069923475384712,
        -0.0512692965567112,
        0.01396921742707491,
        -0.031067773699760437,
        -0.02361779659986496,
        -0.011776898987591267,
        -0.046887997537851334,
        -0.024916434660553932,
        0.07590680569410324,
        0.005764934699982405,
        -0.029188266023993492,
        0.037428826093673706,
        0.010056501254439354,
        -0.01906491257250309,
        -0.05978630110621452,
        -0.002309112111106515,
        -0.0169588103890419,
        0.023980701342225075,
        0.12594780325889587,
        -0.0013056884054094553,
        -0.030803926289081573,
        -0.012878273613750935,
        -0.08220677822828293,
        -0.12211071699857712,
        -0.12039078027009964,
        -0.09991965442895889,
        0.06421606242656708,
        0.03168588504195213,
        -0.047543466091156006,
        0.04964147135615349,
        -0.004363734740763903,
        0.002080863807350397,
        0.0379355251789093,
        0.06778261810541153,
        0.010091153904795647,
        0.035709198564291,
        0.06154748797416687,
        -0.0013293809024617076,
        -0.052290886640548706,
        -0.010764462873339653,
        0.0010202715639024973,
        -0.11138468980789185,
        0.02363852597773075,
        -0.02909146435558796,
        0.07182204723358154,
        0.024295464158058167,
        -5.475003916899368e-08,
        0.0021344730630517006,
        0.0006988351233303547,
        0.0038216947577893734,
        0.008097902871668339,
        0.04154345765709877,
        -0.0913395881652832,
        -0.029576754197478294,
        0.010114125907421112,
        0.06349669396877289,
        0.022559668868780136,
        0.004194373264908791,
        -0.04767678678035736,
        -0.004316873382776976,
        0.018548164516687393,
        0.04237118363380432,
        0.07526145130395889,
        -0.05829455330967903,
        0.014869428239762783,
        -0.0028532661963254213,
        -0.017378535121679306,
        0.018894104287028313,
        0.004173537250608206,
        0.06861963123083115,
        -0.01943628117442131,
        -0.01656363159418106,
        0.011994503438472748,
        -0.03528180718421936,
        -0.014394618570804596,
        0.06338736414909363,
        -0.03495755419135094,
        -0.07108405977487564,
        -0.043842628598213196,
        -0.026015372946858406,
        -0.024688800796866417,
        0.06141185015439987,
        -0.07771354913711548,
        -0.02179255709052086,
        0.002365713007748127,
        0.15894918143749237,
        0.07807182520627975,
        0.04648148640990257,
        -0.0633954182267189,
        -0.03498141095042229,
        0.06725230067968369,
        0.03419310599565506,
        -0.07989620417356491,
        -0.028288325294852257,
        -0.09844131022691727,
        -0.02945796400308609,
        -0.02268948219716549,
        -0.032056551426649094,
        -0.037644531577825546,
        -0.04052773118019104,
        0.0002396667405264452,
        0.05204170197248459,
        0.03891327232122421,
        -0.01691747084259987,
        0.04134724289178848,
        -0.02527914196252823,
        0.06555665284395218,
        0.09508413076400757,
        -0.08126272261142731,
        -0.014302344061434269,
        0.1162429079413414
    ]
}