{
    "id": "9YA2CE2PP9g",
    "title": "This thing keeps impressing me! - Alienware AW2723DF",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-10-28T22:19:15Z",
    "video_url": "https://www.youtube.com/watch?v=9YA2CE2PP9g",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "alienware",
        "alien",
        "monitor",
        "gaming",
        "desk",
        "peripheral",
        "good"
    ],
    "views": 690459,
    "likes": 17272,
    "comments_count": 1029,
    "description": "Communicative effectively with the right tone at work! Sign up for an account and get 20% off Grammarly Premium:   Plouffe is a big fan of Alienware's monitors, and their new AW2723DF looks like it could be another great addition to the lineup, but do the specs live up to the actual gaming experience?  Buy an Alienware AW2723DF:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 What a time to be alive! 0:48 Unboxing and specs 1:37 Horst reads Plouffe like a book 2:15 Alienware used to be cool 2:46 What else is in the box? 3:15 Unboxing Tech Tip 3:36 RGB, Ports, and stand adjustments 5:37 Sponsor - Grammarly 6:23 Plouffe tries to defend his purchase 6:38 Going through the settings 8:59 Thoughts on HDR ft. Horst 9:50 Gaming impressions 11:29 UFO Test 12:28 Overall thoughts 13:20 Outro",
    "description_links": [
        "https://grammarly.com/shortcircuit",
        "https://howl.me/cin1lFUeMxM",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- What a time to be alive if you love PC gaming! Don't get me wrong, 40 series, complete disappointment, but monitors. They have been getting better and better and better in the last few years both in terms of panel technology as well as refresh rates and color gamut coverage. It's just insane. Today, I've got the AW2723DF. Sorry, I've got to read it off the box because I absolutely hate monitor naming conventions and they're not always the easiest to remember, but at least with Alienware, they kind of keep it similar. You've probably heard me rattle off the AW3423DW several times, it's the one I have at home, it's a QD-OLED, it's pretty nice. Today, we've got this guy and it is unfortunately not QD-OLED, it's IPS, but it's got a few tricks up it's sleeve that I'm actually really excited to check out for myself and show you guys. So let's get it out of the box and take a look. It's 1440p, 240Hz, fast IPS, 1 millisecond gray to gray response time, and it can go up to 280Hz overclock. It also covers 95% of the DCI-P3 color space, and comes factory calibrated which is great for anyone who actually cares about color accuracy. - What's this? - It's an Alienware monitor. - I know you like those. - It's for gaming! (laughs) Well, I like one. - What makes this one so special? - It does 240 or 280Hz, it's DC-IP3 is like 95% coverage of that. - Your games will look so accurate! - Okay, they will but it's $650 which for a display with these specs, that's actually pretty good. We honestly thought it would be more. - You're one of those people who doesn't put on these panel covers and it drives me up the wall! - Oh yeah, I don't bother. - Just do it! Here's what I need the viewer to hold proof to account is that he's gonna put the back panel on this 'cause I have to say Alienware makes nice looking monitors- - Sure. - And they need that just little bit of help. - We don't need that, don't listen to him, it's okay. You're never gonna look behind your monitor. - [Horst] Not true! - Unless you're set up in the middle your room, you're not gonna look back there, so I just personally don't. If you want a cable cover and make it real nice and tidy and never look at it again, by all means, please feel free, it does feel satisfying when you actually stop and take the time to do that. We've got the big Alienware branding on the side. It's a love it or hate it kind of relationship. It's funny, me and David were just talking about this. We grew up when Alienware was actually pretty cool. I grew up in the boutique scenes so lots of Voodoo PC, back when ibuypower was really good, but because I grew up with it before they got bought out by Dell, I've actually got fond memories of Alienware. I don't know, Horst says he likes these, I actually think they look pretty clean once they're all setup, it's just a really pure white stand and a white panel, we'll show you that in a sec. What else is in here? We've got USB-B. HDMI, I think it's 2.0, doesn't have 2.1 but that's okay. Display Port. This is what? Display Port to Display Port Mini? That's what it looks like. I don't know if this guy has a power brick, it looks like it, oh no. We'll have to get our own C13 because as has happened many times in the past, unless we get some kind of converter in the box, I don't think this is gonna plug into any of our walls unfortunately. And we're gonna do the old click it in and then pull it out method which works wonders. I highly recommend, if you're setting up a display, try to do it that way, it works really well and you're not gonna damage anything and all the packaging stays nicely here. It's not curved, it's a flat panel, but for 27 inches at 16:9, that's totally okay. Yeah, it's got this really cool 27 on the back here. I like the little alien badge on the back. I think this is RGB, there are two or three places that this has RGB on it so that might be one of them. I should have shown you guys this before I put it on the stand while it was nice and flat but that's okay. We've got our power plug here, USB-B, USB-A right beside it, and another USB-A. I think there's a Kensington lock right here and then we've got two HDMI 2.0 ports, a DisplayPort 1.4. I almost missed this but further along the bottom we've actually got two more USB-A ports and then a headphone jack on the bottom here which is actually a really big selling point for me personally. If I've got a hub, let me put it on the bottom or on the side, somewhere that's really easy to plug in and out of. It's got height adjustment all the way down, all the way up, and then it's got a bit of swivel. That actually has quite a bit of swivel to be honest, that's pretty good. It's got some tilt. Honestly, this thing's pretty adjustable and it's got my favorite trick, you can do portrait mode with a 90 degree pivot. It's also got a handy little headphone hanger here. Click it in, pull it out, not bad. It's not the most sturdy. Ah, it's actually not bad. Here's the thing though, when are you ever gonna use this in portrait mode? You can go both ways by the way, which is really nice, but I find it hilarious, this is a 240Hz display, you are not gonna use this in portrait. It's gonna be wild the day where you turn this portrait because it's literally now your secondary display because you've got something better. Probably five years down the line or something but hey, it's a nice feature to have, and even if you don't like the stand, pretty sure it's vesa mountable. It'd be crazy for them to not make it vesa mountable. Yep, 100x100 vesa mounts. And then if you do want to stick it on the stand, you've got a ton of cable management options. Well, it's one option really but it can fit quite a few cables. It just goes in this hole here and then right out the bottom and out the back. Boom! All right as for now, oh I love that click, it's so satisfying, we're just gonna get this set up at our sweet gaming rig over there, play some games on it, but not before a word from our sponsor. Thanks to Grammarly for sponsoring this video. Communicating online through email, Slack, or Discord can be easily misinterpreted and become a huge time block. This is why all working professionals need a desktop app like Grammarly. Grammarly provides comprehensive spelling and grammar suggestions, and ensures your writing is mistake free, professional, and polished. Simply install the free desktop app, log in, and start typing. There's also Grammarly premium which provides more in-depth feedback on your writing such as tone transformations to adjust your tone and sound confident. You'll be more productive with their clarity full sentence rewrite feature that helps you rephrase hard to read sentences so you come across more clear and confident. Work smarter not harder, go to grammarly.com/shortcircuit to sign up for a free account and get 20% off Grammarly premium today to help you be more productive and get your projects moving forward. Even when I post pictures of my monitor they're always like oh, but the Alienware branding, it's so ugly, but I mean how much do you really see? Looking at this from here, there's a little alien head down here, okay, and then sure, if you look from the side, yeah, it says Alienware there, and there's an alien on the back. We've got a power button on the bottom here, lights up, that's always cool. Another thing I hadn't mentioned yet was this is g-sync compatible and then it is also free sync premium pro. And look at the cable management. Look how good this looks! - [David] That looks pretty good. - Right? Please, if you're buying a nice monitor, make sure to set it up right. Set it to whatever refresh rate it can actually do, don't leave it at 60 or you're probably gonna be disappointed. We're gonna turn HDR on. It's vesa certified HDR 600, I don't think there's dimming zones so we'll see how good it does the HDR. And refresh rate, already detected the monitor correctly, our refresh rate's 60. Oh baby, 240! Now, it can do 280, it says so on the box. We're gonna use our navigation nipple to open the OSD. Usually when it comes to overclock you have to actually enable the overclock before it'll show up as an actual setting in Windows and we've got it right here. Game overclock off, pft! Oh, I like this! They've actually got a number of options that are in between 280 and 240. If you go to enable 280 and it doesn't quite work, it crashes, you get flickers, whatever, boom, go down to 270, see if that's more stable for you. Let's go to 280 'cause we're not messing around here. Wow! - [David] That's smooth as (bleep). - Wow! What else we got here? We got response time, fast, super fast, extreme. They do say on the box that it's 1 millisecond gray to gray for extreme settings, so to be fair, just on fast it's probably not gonna be the fastest response time so I'll go to super fast, we'll go in the middle. This should do 600 in its peak and I think they mentioned 450 in its typical which is fine for HDR, we're gonna crank it. Oh yeah, let's see where the RGB is. So they mentioned three zones and I can see them here and they're all set to the Alienware turquoise blue color. We've got it here on the alien head. I love the 27. It's hilarious how I mentioned we're just gonna put this up against a wall and that's why we're not putting the cable cover, but then I like the RGB on the back. (laughs) Oh well, whatever. And then the bottom one is probably on the bottom of the display. Actually, I can't find it. It must be the power LED which is weird they've got that labeled as RGB. Oh, and it does 10 bit! Okay, so the only reason I saw 8 bit before is because it kicked us out of HDR when we did our overclocking adjustments, now that's all set back to HDR on, 280Hz, and we're getting 10 bit color which is even better. Yeah, this thing just keeps impressing me, especially at the $650 price point, that's not bad. Let's watch some HDR content. It's nothing impressive so far, it looks okay. We're not seeing any really weird tone mapping like we've seen on some other displays. So now it's really a matter of the local dimming and I don't think there's zones, so it's just single panel. That's that 95% DCI-P3 coverage, it really helps colors pop. Oh, that's a good one. Having trouble? - No, just making sound. - Oh. Does it look prettier now? - [David] Ah, I can really tell from this side. - Yeah, you can really see it, eh? - [David] Yeah. - Huge difference. This is why I don't bother with these (bleep)in' things! - [David] Oh wait, we need to plug in the USB. - Do you though? - No but that's the problem! Maybe you do it a little- - You set it and forget it! - No, no, no, no, no. - You set it up right the first time, and then it looks beautiful the rest of the time. - It's not as bad as others we've seen where the whole thing turns into a blurry (bleep)in' field of green basically. Admittedly though you're right, it's not the crispiest motion clarity but man, the frame rate does feel good! - [David] Yeah, it looks really smooth. - Yeah! 280, maybe that's where it is 'cause I've had 240 before and I'm like yeah, it's not that much better than 140, but I guess maybe once you go to 280, maybe 300 or so, it really starts to kick up. But yeah you're right, this is a little blurry as I move around, a little less clear than I'd like it to be. - [David] It's almost cinematic though, it's weird. I like it! - Yeah, I want to be clear, it's not the same kind of blur that we've complained about in terms of motion clarity on some displays where this is like we've turned on motion blur almost. It is really just the edges, hey? I can actually make out even this logo up here, PO5 or whatever. It might be the game, it might also be because we're only in faster instead of extreme is where they're talking about that 1 millisecond gray to gray. I just don't like turning up the motion response too much. I don't like turning it up to extreme or whatever because you usually end up with a lot of inverse ghosting 'cause they're trying to overdrive it a little too hard. That's pretty good. As much as this looks not the greatest, you're never really gonna do that in a real world environment, you're gonna flick right to try to headshot someone and these are catching up right away. That's just crisp, like instantly. So it's a little bit bad in between but that's okay, I can totally deal with that. This looks pretty good though. - [David] Yeah, it's not bad. - That much shine there and the darkness around it. Yeah, I will give this thing a pass in terms of HDR, it's not bad. It's not amazing, if you get a bunch of dimming zones in here it's probably better, but you know what? That is definitely acceptable. You know what? For the UFO test, I'm gonna crank this up to extreme. And there's also preset modes, we're in standard right now. Sports, creator, whoa, creator's so dim! Oh, it's got picture in picture and picture by picture for anyone who cares about that, I'm not crazy about it 'cause I never use it but it's actually a really handy feature for those who need it. One thing I absolutely love is when you just go into the OSD, it brings up this top bar here that shows you a bunch of stuff. It shows me my mode that I'm in, shows me that I'm in smart HDR for desktop, shows I'm in response time extreme, and the dark stabilizer stuff. It's stuff that you often want to know quickly without having to go into some kind of sub menu. It's having some issues but it's pretty good for the most part. There's no ghosting though and no inverse ghosting. I'm gonna go to none 'cause I find the stars a little distracting, and I'm gonna crank up the speed. I want these to go ... They're at 960 pixels per second, let's basically double that. Okay, that's a bit too fast, I'm crazy, I'm crazy, 1200! Yeah, there's a little bit of a trail on the back end of the ship. Pretty crisp! I'm pretty sold! Yeah, I don't know, there's not a whole lot else to say, it's a pretty decent display for an actually ... Not inexpensive price, $650 is still a lot of money to a lot of people, I totally understand that, but if you want a 280Hz IPS display that does okay HDR, this might be the monitor for you. Now, if you're really against Alienware and you can't deal with the logo or the branding or whatever, feel free to just put it on a vesa mount. This thing is not too thin, but it will still fit on your wall pretty nicely. For those of you who are interested, it's already available in, I think, Japan and China, and it's gonna be available to the rest of the world on October 6th. So maybe by the time this video comes out, you can just click buy and check it out for yourself. Otherwise, you might just have to wait a little while. I don't, it's right here and I like it! Thanks for watching, that's Short Circuit. If you want to watch another fun Short Circuit maybe check out the Zoom 65, that should be coming up sometime soon. It's a really nice keyboard. Not a monitor, but another expensive hobby that I have. Yeah, (laughs) see you later.",
    "transcript_keywords": [
        "yeah",
        "Alienware",
        "pretty",
        "HDR",
        "pretty good",
        "display",
        "good",
        "time",
        "back",
        "bit",
        "monitor",
        "Display Port",
        "nice",
        "thing",
        "set",
        "RGB",
        "bottom",
        "response time",
        "bad",
        "Grammarly"
    ],
    "transcript_entity_values": [
        "David] Ah",
        "100x100",
        "1 millisecond",
        "the day",
        "Windows",
        "three",
        "One",
        "1.4",
        "40",
        "Display Port",
        "C13",
        "one",
        "Kensington",
        "USB",
        "DCI",
        "Slack",
        "90",
        "20%",
        "60",
        "8",
        "Japan",
        "240",
        "sec",
        "27 inches",
        "280",
        "DC",
        "Today",
        "OSD",
        "Grammarly",
        "Horst",
        "600",
        "650",
        "the last few years",
        "David",
        "Discord",
        "China",
        "DCI-P3",
        "10",
        "DisplayPort",
        "Alienware",
        "first",
        "300 or so",
        "270",
        "two",
        "280Hz",
        "USB-B. HDMI",
        "five years",
        "1200",
        "450",
        "27",
        "960",
        "Short Circuit",
        "16:9",
        "RGB",
        "October 6th",
        "2.1",
        "240Hz",
        "jack",
        "95%",
        "Dell",
        "today",
        "2.0"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "DATE",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "ORG",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.035120684653520584,
        -0.060492124408483505,
        -0.03219927102327347,
        -0.07435542345046997,
        0.08631384372711182,
        0.008723440580070019,
        0.0025120896752923727,
        -0.016425592824816704,
        -0.012342079542577267,
        0.024239882826805115,
        -0.06301812082529068,
        -0.03625562787055969,
        0.06962782889604568,
        -0.0821194052696228,
        0.07164361327886581,
        -0.06890720874071121,
        0.034622736275196075,
        -0.11118167638778687,
        0.000875140365678817,
        -0.022406529635190964,
        -0.08315017074346542,
        0.009853923693299294,
        0.04566795006394386,
        0.0009219468338415027,
        -0.009142334572970867,
        -0.0022926439996808767,
        -0.026679255068302155,
        0.042536161839962006,
        -0.007019830867648125,
        -0.07178990542888641,
        0.04053814709186554,
        0.07820307463407516,
        0.025056777521967888,
        -0.009905295446515083,
        -0.03251391649246216,
        -0.040702980011701584,
        0.006359185092151165,
        -0.1221887469291687,
        -0.09411650151014328,
        -0.049961868673563004,
        -0.05066734179854393,
        -0.05505346134305,
        -0.005333808716386557,
        -0.003078556852415204,
        -0.05845345929265022,
        -0.08444918692111969,
        -0.02460622228682041,
        -0.059815987944602966,
        -0.030681727454066277,
        0.10110416263341904,
        0.0006001507281325758,
        -0.10400982201099396,
        0.04670504108071327,
        -0.002372685819864273,
        -0.003655791049823165,
        0.053901318460702896,
        -0.042897678911685944,
        -0.00666795251891017,
        0.008450841531157494,
        -0.060624755918979645,
        0.050778668373823166,
        -0.13974134624004364,
        -0.01956271007657051,
        0.0487651564180851,
        -0.017351599410176277,
        -0.009509658440947533,
        0.01008124090731144,
        0.05850227177143097,
        -0.01168875489383936,
        -0.02093866467475891,
        -0.036319147795438766,
        0.012596303597092628,
        0.01580074615776539,
        0.05773244425654411,
        0.0624399296939373,
        0.018521621823310852,
        0.07645770162343979,
        -0.08919082581996918,
        0.04927200824022293,
        0.027479000389575958,
        0.013168762437999249,
        0.007947605103254318,
        -0.06994789838790894,
        0.008751085959374905,
        0.02173878625035286,
        -0.07850028574466705,
        0.08479447662830353,
        0.028501875698566437,
        -0.018987109884619713,
        -0.04756811261177063,
        -0.01956208050251007,
        0.060243431478738785,
        0.07660862058401108,
        0.032533198595047,
        -0.07425851374864578,
        0.028051340952515602,
        0.027791732922196388,
        -0.07469625771045685,
        -0.05368554964661598,
        0.09557104855775833,
        0.04627356678247452,
        0.05174403637647629,
        0.04797067493200302,
        -0.05384593456983566,
        -0.09592460840940475,
        -0.08371248841285706,
        -0.007767034228891134,
        0.12333597987890244,
        -0.014890506863594055,
        -0.006776334252208471,
        -0.037014201283454895,
        0.02920737862586975,
        -0.0938321053981781,
        -0.009871035814285278,
        0.016681324690580368,
        0.06701504439115524,
        -0.07379522919654846,
        0.00018796982476487756,
        0.08577583730220795,
        -0.007424077484756708,
        0.007192089222371578,
        0.010472457855939865,
        -0.014720086939632893,
        0.004549921024590731,
        0.03836851194500923,
        0.03374505415558815,
        -0.07621961086988449,
        1.6941933554081147e-33,
        -0.004852990619838238,
        0.05811005458235741,
        -0.037261176854372025,
        -0.05826275050640106,
        0.08104824274778366,
        0.0382378026843071,
        0.004665614105761051,
        0.08454644680023193,
        -0.05418393760919571,
        -0.024280760437250137,
        -0.028082022443413734,
        0.10314124822616577,
        -0.047830402851104736,
        0.06745947897434235,
        0.043819572776556015,
        -0.11113867908716202,
        0.0019281560089439154,
        0.0380999892950058,
        -0.053648531436920166,
        0.0036149227526038885,
        0.029692277312278748,
        -0.03453972935676575,
        -0.016740543767809868,
        -0.055722564458847046,
        0.06765381246805191,
        -0.014785746112465858,
        0.0006179045303724706,
        0.042459290474653244,
        0.06522618234157562,
        0.040619637817144394,
        -0.07373447716236115,
        -0.06885085254907608,
        -0.0024188775569200516,
        -0.09404148906469345,
        -0.02016657404601574,
        -0.05391407757997513,
        -0.08539149910211563,
        -0.06343059241771698,
        0.04232243075966835,
        0.03423669561743736,
        -0.007851863279938698,
        0.06373699009418488,
        -0.09103552997112274,
        -0.07431280612945557,
        -0.03652913123369217,
        0.03286456689238548,
        0.07785765826702118,
        0.010265856049954891,
        0.030530577525496483,
        0.05699630826711655,
        -0.08653631061315536,
        -0.015520441345870495,
        -0.03243286907672882,
        -0.04791659861803055,
        0.010627711191773415,
        -0.07177354395389557,
        -0.004075577948242426,
        -0.03639018535614014,
        0.01230339240282774,
        -0.04665228724479675,
        0.013486318290233612,
        -0.0012853670632466674,
        0.07367320358753204,
        -0.033863749355077744,
        -0.020566103979945183,
        0.08007439970970154,
        0.09906533360481262,
        0.04479081556200981,
        -0.0966891273856163,
        -0.023223254829645157,
        -0.03350716456770897,
        0.030168600380420685,
        0.03724566474556923,
        -0.07828060537576675,
        -0.006762410514056683,
        0.02669966220855713,
        -0.13263298571109772,
        -0.07061640918254852,
        0.030452411621809006,
        0.02071162685751915,
        -0.03495417907834053,
        -0.006316135171800852,
        -0.02201756462454796,
        0.014632321894168854,
        -0.03080177493393421,
        0.015176289714872837,
        -0.0010217521339654922,
        -0.016497507691383362,
        -0.06120616942644119,
        0.008669801987707615,
        -0.04999826103448868,
        -0.048128414899110794,
        -0.020416060462594032,
        -0.007939943112432957,
        -0.05453729256987572,
        -4.487435357926682e-33,
        -0.042411260306835175,
        0.033554498106241226,
        -0.04242455214262009,
        0.028681505471467972,
        0.04090462252497673,
        -0.013819556683301926,
        0.051701467484235764,
        0.05060064047574997,
        -0.011132878251373768,
        -0.017299480736255646,
        -0.007941430434584618,
        0.01534271240234375,
        -0.11282963305711746,
        -0.07451242953538895,
        -0.02204127050936222,
        -0.10724812000989914,
        0.029386280104517937,
        -0.048353273421525955,
        0.06194460764527321,
        -0.035100143402814865,
        0.053171489387750626,
        -0.04688804969191551,
        -0.0696856677532196,
        0.07917347550392151,
        0.005919824354350567,
        0.020862532779574394,
        0.07564602047204971,
        -0.008548076264560223,
        -0.032514315098524094,
        0.024838492274284363,
        -0.015309978276491165,
        -0.02894638292491436,
        0.028679288923740387,
        0.007848351262509823,
        0.07826747000217438,
        -0.0390377976000309,
        0.0907721146941185,
        0.09396553039550781,
        -0.048777986317873,
        -0.025339772924780846,
        0.006697537377476692,
        -0.019424067810177803,
        -0.02939199097454548,
        -0.0044698212295770645,
        0.02362276054918766,
        -0.02712530829012394,
        -0.022462330758571625,
        -0.041248638182878494,
        0.02325001358985901,
        -0.027964575216174126,
        -0.06489180028438568,
        -0.0235553290694952,
        0.08303401619195938,
        -0.017506558448076248,
        -0.07102195918560028,
        -0.00028692398336715996,
        -0.03277299180626869,
        0.04905872419476509,
        0.03175131976604462,
        -0.010532919317483902,
        0.03157862275838852,
        -0.019675472751259804,
        -0.06508827209472656,
        -0.017162509262561798,
        0.01487218588590622,
        -0.061369430273771286,
        -0.00988998543471098,
        0.04192168265581131,
        0.004315719474107027,
        0.0123831108212471,
        -0.04747568070888519,
        -0.08685409277677536,
        -0.0584808811545372,
        -0.07246138155460358,
        -0.05241808295249939,
        0.02491387166082859,
        0.08031735569238663,
        -0.05531097576022148,
        0.004715371411293745,
        -0.02602807618677616,
        0.009267410263419151,
        0.023104196414351463,
        0.04485407471656799,
        -0.04067252576351166,
        0.05346095934510231,
        0.017126252874732018,
        0.013253878802061081,
        -0.0453043058514595,
        -0.05451134964823723,
        0.05840284004807472,
        -0.06429450958967209,
        0.06956769526004791,
        -0.0008794812019914389,
        0.05331460386514664,
        0.011244355700910091,
        -5.906225908347551e-08,
        0.004863283131271601,
        -0.042201682925224304,
        0.011587056331336498,
        0.10189284384250641,
        -0.05527651309967041,
        -0.013191577047109604,
        0.024605751037597656,
        -0.03189167007803917,
        0.051620058715343475,
        -0.01788468286395073,
        0.03199005126953125,
        -0.1456354707479477,
        0.03359963744878769,
        0.02558075822889805,
        0.07260128855705261,
        0.06337998062372208,
        0.04297677427530289,
        0.07172175496816635,
        -0.07301793992519379,
        -0.015078069642186165,
        -0.005687129218131304,
        0.05507931485772133,
        0.08167503029108047,
        -0.03730187565088272,
        -0.01854395493865013,
        0.07154320925474167,
        0.02353566139936447,
        0.07617571204900742,
        0.06500647217035294,
        -0.047377776354551315,
        -0.0709381252527237,
        -0.01025320217013359,
        -0.017848839983344078,
        0.0006592246936634183,
        0.022729065269231796,
        -0.044417884200811386,
        -0.024628134444355965,
        0.04836780205368996,
        0.0661664679646492,
        0.06443227827548981,
        -0.014241487719118595,
        8.989070920506492e-05,
        -0.04922356456518173,
        0.014991664327681065,
        0.07008016854524612,
        -0.025387004017829895,
        -0.051253512501716614,
        -0.03150549158453941,
        0.02760709449648857,
        0.037489816546440125,
        -0.0008935151272453368,
        -0.005136537831276655,
        -0.0011107350001111627,
        0.06594428420066833,
        0.05314002186059952,
        0.04816590994596481,
        -0.023228025063872337,
        0.07058162987232208,
        0.004288333468139172,
        0.11262902617454529,
        0.06254631280899048,
        -0.08830369263887405,
        -0.03927946463227272,
        0.0950075164437294
    ]
}