{
    "id": "_3JZRxVPuew",
    "title": "Essential Phone Review - The Hype Is Real.",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-08-19T17:32:48Z",
    "video_url": "https://www.youtube.com/watch?v=_3JZRxVPuew",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Essential Phone",
        "Essential Phone unboxing",
        "Essential Phone Unboxing",
        "Essential Phone versus",
        "vs",
        "versus",
        "Best Android Phone",
        "Best Google phone",
        "iphone 7",
        "iphone 7 plus",
        "iphone 8",
        "apple",
        "essential phone hands on",
        "essential video",
        "ceramic phone",
        "titanium phone"
    ],
    "views": 1153497,
    "likes": 26046,
    "comments_count": 2559,
    "description": "Dave2D unboxing and review of the Essential phone in Pure White. This is THE best phone I've seen from a startup. Pre-order at TELUS today:   For US customers -   This titanium and ceramic phone from Andy Rubin is one of the best built phones on the market.  Phone Skins -   Music Credits: Background: Fili - Closure  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)  *Thanks to Telus for partnering with me for this video",
    "description_links": [
        "http://telus.my/geXg25",
        "http://amzn.to/2BQawBi",
        "https://dbrand.com/shop/essential-phone-skins",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going? Dave2D here and this is the Essential phone. And I wanted to thank TELUS for partnering with me on this video. They're the exclusive launch carrier for this phone in Canada. So if you're interested in the Essential phone and you live in Canada, you should check out their website. There is a link in the description. So, I'm going to start off with a quick unboxing here. We get a slide out tray inside and you get the phone itself, a 27-watt charging brick, a braided USB-C cable and then a braided USB-C headphone jack adapter. You also get a sim tool shaped like the Essential logo. One of the headlining features of the phone is the build. It's made from titanium and ceramic. And when I first heard that Essential was doing this with their phone, it didn't seem that special. I mean, it sounded cool but I didn't think that the build materials would make that much of a difference in how the phone feels. but, it does. Titanium is a very hard metal. If you look at the tensile strength of some metals, titanium alloys can get way harder than even the best aluminum alloys, so the frame should be pretty resistant to damage. The ceramic slab on the back is also super durable. I thought it was glass at first because it's so shiny, but it's actually polished ceramic, and this surface is very resilient to scratches. I'm not going to call it scratchproof, because there are very few things in this world that are actually scratchproof, but my keys can't mark this surface at all. And I think they've done a really good job combining the two materials. It's a very nice device to hold in your hand. In terms of the design, it's a very simple and clean aesthetic. It's comfortable to hold, but because of the ceramic material it's heavier than you imagine a phone of this size to weigh. It's not heavy per se, it's just heavier than you might think it would be. The earpiece is pretty much invisible. It's tucked away into this tiny crevice between the screen and the ceramic perimeter. There's a notification LED tucked in there and the earpiece sounds good. The fingerprint scanner on the back is quick. I can hear the verification sound right away but sometimes the screen can take a split-second to fire up. On the back there are two contact points and these are where the wireless accessories can connect. These pins are just for power; any kind of data transfer is done wirelessly and there's a 360 degree camera module that looks pretty cool. There's no headphone jack, and even though they give you this USB-C adapter, I still miss the headphone jack. But that's the path. That's the path that the entire phone industry has chosen to take and we'll have to live with that. Now in terms of the speaker on the bottom it sounds pretty good and it gets loud, but it is a mono-speaker and I really wish they'd've gone for a stereo set-up. It's just something I really like when it comes to smartphone speakers. Now if there's one thing I would knock about the design, it would be the back panel. It looks almost too simple to me, there's no branding or design lines. But you can always put skins on the back to give it some texture and some grip. This is a marble one from dbrand and I think it looks nice Alright, let's talk about the screen This phone caught a lot of people's attention because of the screen It has very thin bezels, it has rounded corners But the camera is still positioned at the top and you have this gap or cut out in the screen where the camera is And some people may not like it because it looks so different from your regular smartphone But I think it looks good Now if you're wondering why they didn't put the camera at the bottom, if you're taking a picture using Google Hangouts This is what the image looks like with the camera at the top, it's a normal image, but when you put it at the bottom This is what the image looks like, it's just a bad angle and you can look up your nose You can still swipe down from the top of the camera and it works the same, you don't have to adjust your swipes because of it And when you're watching videos it's just a black bar along the side, the image doesn't have to go up to that point And when you're browsing the web, using the cameras, playing games, very few apps actually put content up there You might have a strip of UI buttons or something, but most apps have a black bar So functionally right now this super-thin bezel at the top doesn't do anything super useful But where this thing shines is base level UI So the lock screen, home screen, and settings and stuff, it just looks so cool to me And every time I use my phone it feels like a very futuristic device. The display itself is an IPS panel, QHD resolution The colors are on point, but it's not super bright though It's a 500 nit screen - excellent for indoor use But the screen can get hard to see on really bright days. Looking at performance the components in here are very fast. It's got a Snapdragon 835, Adreno 540, with fast UFS 2.1 storage. All the technical components in here were obviously picked to give this thing some really good speed. The performance feels like a 2017 flagship phone One thing I noticed: this phone doesn't get that hot, So even after running a bunch of loops and stuff for benchmarks, it felt cool to the touch Not like cold, but lukewarm at most. I'm not sure if it's the ceramic material or something, but yeah, it's kind of neat The camera has two lenses, one has an RGB sensor, the other is a monochrome sensor And the idea here is that they're taking two photos and then combining the data To produce something that's as clean as possible, and the images are pretty good. Now to be honest I thought that the Essential Phone wouldn't have an amazing camera Because they don't emphasize it that much on their website, but they're good Photos taken in good lighting are nice, not that these are difficult to capture with a 2017 flagship But the low light photos are also not bad Dynamic range could be better in general, but overall I do like the camera I'm not into black and white photography but it has a dedicated monochrome option. I don't love the stock camera app, it's a little too basic. If you're big on photography you'll probably want a different camera app The front camera looks good as well and both cameras, the front and back, shoot video in 4K Pricing off contract isn't cheap It's a premium, 128 GB phone It starts at $700 in the US, and I think $1050 in Canada It's on par with any big screen flagship phone I wish they offered this phone in a cheaper 64 GB variant But $700 for a titanium, thin-bezeled phone like this feels very normal right now. Battery life on this thing is average to maybe a little bit less than average because of the bigger screen So normally screens of this size are fueled by bigger batteries, right? But because it's a small phone with a large screen, the battery is only 3040 mAh, so it's not huge I can comfortably get a full day of heavy use, but not much more than that It does support quick charge and it takes about an hour and a half for a full charge. It's running Android 7.1.1, and it feels very stock to me, which I love The two apps that they've included that aren't very stock are their profile migration app that's called SwitchBack, I never used it And their camera app - It's called Click, and I don't love the icon And like I mentioned before it's not a very full featured camera app, but everything else feels like stock Android As for updates, I can't tell I mean every phone company promises an unending stream of superfast updates but they often don't deliver As for this phone, because of Andy Rubin's involvement, my gut feeling is that we'll get pretty fast and frequent updates Essential does promise two years of major software updates, and then another year of security updates And even this pre-release phone, this thing did receive the August 5th update on time So that's probably a good sign Okay, the Essential Phone with this device you're getting excellent ergonomics and build quality The titanium and ceramic materials are really nice Up front, the ultra-thin bezels look really cool It's not highly functional, but it adds to the super clean aesthetic of the phone The front facing and rear facing cameras are both strong performers Clean images, even in low light The fingerprint scanner is reasonably quick And the ceramic material on the back gives the phone a very unique feel, but it adds a little bit of weight Inside, the Snapdragon 835 delivers awesome performance, as expected The storage is also really fast, but the phone only comes in a massive 128 GB variant So you're forced to go pretty big, and the battery will last about a day of heavy use So the feature list isn't massive. It's missing things like wireless charging, it doesn't have official waterproofing So if you're trying to 1-Up your friends with a spec-list on your phone, this is not that phone There are plenty of other phones for that, but with this thing you're getting a highly functional device That has all the important specs, but looks and feels very unique and just straight up awesome Okay, that about wraps it up If you guys are interested in this phone there's a link in the description If you're in Canada check out TELUS, they're the exclusive launch partner for this company Okay, hope you enjoyed this video. Thumbs if you liked it, subs if you loved it. See you guys next time",
    "transcript_keywords": [
        "phone",
        "Essential phone",
        "camera",
        "Essential",
        "screen",
        "good",
        "camera app",
        "ceramic",
        "thing",
        "feels",
        "back",
        "pretty",
        "ceramic material",
        "screen flagship phone",
        "Canada",
        "flagship phone",
        "app",
        "titanium",
        "phone feels",
        "updates"
    ],
    "transcript_entity_values": [
        "GB",
        "Andy Rubin's",
        "TELUS",
        "27-watt",
        "4",
        "Android 7.1.1",
        "USB",
        "one",
        "August 5th",
        "SwitchBack",
        "700",
        "jack",
        "128",
        "RGB",
        "only 3040",
        "about a day",
        "1050",
        "Android",
        "835",
        "jack adapter",
        "two",
        "the Essential Phone",
        "first",
        "2017",
        "US",
        "IPS",
        "Canada",
        "a full day",
        "Google Hangouts",
        "2.1",
        "UI",
        "two years",
        "about an hour and a half",
        "K Pricing",
        "500",
        "USB-C",
        "One",
        "another year",
        "64 GB",
        "Essential"
    ],
    "transcript_entity_types": [
        "GPE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "GPE",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PERSON"
    ],
    "vector": [
        -0.10948019474744797,
        0.02769003063440323,
        0.09149980545043945,
        -0.048498574644327164,
        0.033082835376262665,
        -0.0005858972435817122,
        0.07244527339935303,
        0.09381939470767975,
        -0.02373824082314968,
        0.004467953462153673,
        0.0013027822133153677,
        0.00947793759405613,
        0.04274294152855873,
        -0.04781506583094597,
        0.026693716645240784,
        -0.037669241428375244,
        0.09971093386411667,
        -0.130803644657135,
        -0.0804903656244278,
        0.0020950378384441137,
        -0.025701913982629776,
        -0.027517307549715042,
        0.026165755465626717,
        -0.028383485972881317,
        0.040651679039001465,
        0.031023608520627022,
        -0.05136401206254959,
        0.05186781659722328,
        0.023806318640708923,
        -0.02092842385172844,
        0.009250755421817303,
        0.16415847837924957,
        0.07384324818849564,
        -0.0007592246984131634,
        -0.015424896962940693,
        -0.09163732081651688,
        -0.032333891838788986,
        -0.008712215349078178,
        -0.08615118265151978,
        0.0010130167938768864,
        0.0079572182148695,
        0.010259277187287807,
        -0.07746143639087677,
        0.059316955506801605,
        0.01115427166223526,
        -0.05103601515293121,
        0.03185750171542168,
        -0.03009592369198799,
        -0.02633519098162651,
        -0.06788258999586105,
        0.002736549125984311,
        -0.005920846480876207,
        0.03416092321276665,
        0.0264432355761528,
        -0.05988239124417305,
        0.09863025695085526,
        -0.04283484071493149,
        0.008313222788274288,
        0.08530034869909286,
        -0.0370679572224617,
        0.03698964789509773,
        -0.021305302157998085,
        -0.02631734311580658,
        0.05958673730492592,
        0.004411798901855946,
        0.02397173084318638,
        -0.06488128751516342,
        -0.0007414785795845091,
        0.008320332504808903,
        -0.03716009482741356,
        -0.01084068976342678,
        0.024766186252236366,
        -0.009075206704437733,
        0.050679780542850494,
        0.029999755322933197,
        0.048696331679821014,
        0.09722256660461426,
        -0.01507672667503357,
        -0.07792819291353226,
        0.012993833981454372,
        0.007227515336126089,
        -0.025055445730686188,
        0.0036612481344491243,
        -0.09594335407018661,
        0.044154345989227295,
        0.024889355525374413,
        0.05916699022054672,
        0.08380002528429031,
        -0.12052728980779648,
        -0.036262862384319305,
        0.021026499569416046,
        0.1542075127363205,
        -0.025860249996185303,
        -0.03498595580458641,
        -0.015849368646740913,
        0.023563610389828682,
        -0.015816686674952507,
        -0.08685652166604996,
        -0.10816866904497147,
        0.026299552991986275,
        0.0042920196428895,
        0.004444481339305639,
        -0.007027221843600273,
        -0.03458753228187561,
        -0.03623618930578232,
        -0.14637871086597443,
        -0.046973176300525665,
        0.03565727174282074,
        0.06328003108501434,
        0.033338237553834915,
        -0.06204741820693016,
        -0.01932067982852459,
        -0.062088221311569214,
        0.028490116819739342,
        -0.04582767188549042,
        0.03360706940293312,
        0.009154223836958408,
        0.06680062413215637,
        0.1813575178384781,
        -0.055929165333509445,
        0.023914072662591934,
        -0.03213756904006004,
        -0.07304169982671738,
        -0.014803914353251457,
        -0.05262429267168045,
        -0.050053924322128296,
        0.005957168061286211,
        1.6387324299103653e-33,
        -0.012776532210409641,
        0.1198476254940033,
        -0.05496055632829666,
        0.04439866170287132,
        -0.010445690713822842,
        -0.03823253512382507,
        -0.027163241058588028,
        -0.030841778963804245,
        -0.06621956825256348,
        0.060903385281562805,
        -0.07392462342977524,
        0.05278770253062248,
        -0.05106908082962036,
        0.04263713210821152,
        0.003298673080280423,
        -0.06479766964912415,
        -0.054616473615169525,
        -0.039121516048908234,
        0.05248420313000679,
        -0.030150290578603745,
        0.03751445561647415,
        0.07438397407531738,
        0.0070452261716127396,
        0.014576318673789501,
        0.09443532675504684,
        0.023513898253440857,
        0.05700582265853882,
        -0.04801543056964874,
        0.12609988451004028,
        0.019328191876411438,
        -0.1333307921886444,
        -0.036232076585292816,
        0.009328700602054596,
        0.02468150109052658,
        -0.019793009385466576,
        0.05528460443019867,
        -0.08432134985923767,
        -0.09318292886018753,
        -0.03424065187573433,
        -0.03481139987707138,
        -0.0253401268273592,
        0.025171823799610138,
        -0.1166573092341423,
        0.03881995379924774,
        0.030628295615315437,
        -0.0215863399207592,
        0.019971555098891258,
        -0.015622863546013832,
        0.09386558085680008,
        -0.017668869346380234,
        -0.06478255987167358,
        0.006047774571925402,
        -0.011359085328876972,
        -0.018991222605109215,
        -0.053207751363515854,
        -0.03861919790506363,
        0.03455683961510658,
        -0.060978833585977554,
        0.02653760276734829,
        0.007262375205755234,
        0.03909273445606232,
        -0.059960849583148956,
        -0.05668222904205322,
        0.05683255195617676,
        -0.0254062432795763,
        0.02762746997177601,
        -0.08122976869344711,
        -0.06019521504640579,
        -0.021993916481733322,
        0.012585046701133251,
        -0.03521007299423218,
        -0.007076127454638481,
        0.10204915702342987,
        -0.025341512635350227,
        0.051628477871418,
        0.03566848114132881,
        -0.013318310491740704,
        -0.04244107007980347,
        -0.008066324517130852,
        0.05908837914466858,
        0.024252373725175858,
        0.02580903470516205,
        0.06574288755655289,
        0.04846063256263733,
        0.06872552633285522,
        -0.03425789624452591,
        0.028771359473466873,
        -0.05596064031124115,
        -0.03287054970860481,
        0.1095782220363617,
        -0.05762891098856926,
        -0.015452616848051548,
        0.0011847034329548478,
        0.07425205409526825,
        0.024481654167175293,
        -2.8664457295450328e-33,
        -0.03873956948518753,
        -0.04171893373131752,
        0.0530998669564724,
        0.0059954519383609295,
        0.01554795354604721,
        -0.021906817331910133,
        -0.006256238557398319,
        0.08456463366746902,
        0.056275609880685806,
        -0.009786874987185001,
        0.053152140229940414,
        -0.004080682061612606,
        0.009914910420775414,
        -0.005380657501518726,
        -0.03354578837752342,
        -0.027968211099505424,
        -0.007536136079579592,
        -0.06758595257997513,
        0.05847075954079628,
        -0.005435017868876457,
        0.06977351754903793,
        -0.013334700837731361,
        -0.04661396145820618,
        0.03746037557721138,
        -0.04939256235957146,
        0.008762282319366932,
        0.03109903074800968,
        0.08359681069850922,
        -0.020627863705158234,
        -0.028095616027712822,
        -0.036613862961530685,
        -0.02375379577279091,
        -0.05712239816784859,
        0.09258659183979034,
        -0.0107335289940238,
        0.05960807576775551,
        0.02759765274822712,
        0.024547141045331955,
        -0.01387827005237341,
        0.013148332946002483,
        -0.03720344603061676,
        -0.010331944562494755,
        -0.03731048107147217,
        -0.025189898908138275,
        -0.008124109357595444,
        -0.0636635422706604,
        0.04361772909760475,
        0.002232538303360343,
        -0.09080097824335098,
        -0.0008259465685114264,
        0.057395800948143005,
        0.021992797031998634,
        0.011167621240019798,
        0.021272091194987297,
        -0.02690943330526352,
        0.004372783936560154,
        0.07245684415102005,
        -0.013343176804482937,
        0.02174605429172516,
        -0.04461800307035446,
        0.1320284605026245,
        0.0353873036801815,
        -0.010113506577908993,
        -0.04425250366330147,
        -0.07478825002908707,
        -0.002727360464632511,
        0.11030266433954239,
        0.025336841121315956,
        -0.014302585273981094,
        -0.011103780008852482,
        -0.0722166895866394,
        -0.06388790905475616,
        -0.04239455983042717,
        -0.10444954037666321,
        0.05094459280371666,
        0.022971637547016144,
        -0.05933752283453941,
        -0.00860044825822115,
        -0.00838919822126627,
        -0.03847193345427513,
        -0.0032206897158175707,
        0.045938435941934586,
        0.0229265745729208,
        0.0009663548553362489,
        0.06083041429519653,
        0.03337183594703674,
        0.034915290772914886,
        0.007562285754829645,
        -0.045436788350343704,
        0.018222777172923088,
        -0.039612334221601486,
        0.04394131898880005,
        -0.027304861694574356,
        0.062208276242017746,
        0.0207924023270607,
        -5.920241363810419e-08,
        0.026041164994239807,
        -0.030892478302121162,
        -0.0013232261408120394,
        -0.04066549986600876,
        0.04681507870554924,
        -0.08523084968328476,
        0.03429732471704483,
        -0.012278894893825054,
        0.03598719835281372,
        0.028851602226495743,
        -0.04082809388637543,
        -0.11454028636217117,
        -0.1109713762998581,
        0.03387805446982384,
        0.013779634609818459,
        0.11205914616584778,
        -0.023393165320158005,
        0.06956256181001663,
        -0.0018517037387937307,
        0.01559156458824873,
        -0.04011847823858261,
        0.055094219744205475,
        0.05516078695654869,
        -0.022388624027371407,
        0.0505477711558342,
        0.043948229402303696,
        -0.005232143681496382,
        0.018571941182017326,
        0.09584866464138031,
        0.010575838387012482,
        -0.03985581919550896,
        -0.009342800825834274,
        0.006797534879297018,
        -0.031005851924419403,
        -0.06704892963171005,
        -0.060174524784088135,
        -0.004179952200502157,
        -0.04376887157559395,
        0.02250726893544197,
        -0.01261295285075903,
        0.09693247079849243,
        0.013068574480712414,
        0.00965211819857359,
        0.030135614797472954,
        -0.029375741258263588,
        -0.08903385698795319,
        -0.02546437829732895,
        -0.06529494374990463,
        0.01365899108350277,
        0.02174213156104088,
        0.021541066467761993,
        -0.03955404460430145,
        -0.05903976038098335,
        -0.06255777925252914,
        0.02410014159977436,
        -0.0007155940984375775,
        0.016050631180405617,
        0.011492867022752762,
        0.008431247435510159,
        0.060124557465314865,
        -0.006916417274624109,
        -0.037738751620054245,
        -0.009986881166696548,
        0.044822949916124344
    ]
}