{
    "id": "_7OYYMEbKrU",
    "title": "Fairphone 3+ Durability Test! - it feels like cheating...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-02-18T14:15:04Z",
    "video_url": "https://www.youtube.com/watch?v=_7OYYMEbKrU",
    "category": "Howto & Style",
    "tags": [
        "Fairphone 3",
        "fairphone 3+",
        "fair phone",
        "modular phone",
        "budget smartphone",
        "android",
        "iphone",
        "technology",
        "mobile tech",
        "most repairable smartphone",
        "easy to fix smartphone"
    ],
    "views": 1075369,
    "likes": 61164,
    "comments_count": 3742,
    "description": "The Fairphone 3 is a modular smartphone that suposidly is super easy to repair, and replace parts of. But is the Fairphone 3 durable? The only way to find out is with a JerryRigEverything Durability Test. This time, we'll start off by exploring the FairPhone 3's insides, since that is what it is desigend for. Then we will see what the phone is made of and if the FairPhone 3 can survive every day life.   Get my razor knife here!    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   Anker is named as the Official Charging Partner of JerryRigEverything:    TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "http://ankerfast.club/JREpartnership",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Well, here we are, back again for another video with this guy a phone that's supposedly made for you. The Fairphone 3. The Fairphone has been on my radar for a few years now, but this is the first time our paths have actually crossed in real life. And I know I'm supposed to be impartial, but I'm kind of rooting for this one since it comes with its very own screwdriver already in the box. Let's get started. [Intro] Inside the box there isn't a whole lot else besides the phone and that niblet of a screwdriver. No charging brick either. Fairphone's whole deal is trying to build the least wasteful smartphone and does that by making the device super modular, with common and sometimes older components. It's so modular that the 3,000 milliamp hour battery can be replaced in seconds by just popping off the back. Something that used to be super common but we haven't seen in years. Every other piece of hardware in the phone can also be replaced with just one screwdriver, with parts that Fairphone supplies themselves directly from their website. This might be the only phone in existence that gets a tear down before the durability test since it's specifically designed to be torn down, and taking it apart won't compromise any of its structural integrity. It even says over here on the side designed to open. I'm all about that life. With all the screws gone, the modular screen can fall away from the body. No Lego-style ribbons to disconnect. Just a thin and totally modular display. With every other phone being so much more difficult to take apart, this almost feels like cheating. The little gold pins do all of the communicating with the motherboard, and replacement screens can be purchased for about $100. My grandma could probably fix this phone by herself. The modularity doesn't stop there either. There are more screws of course, but when those are gone, the Lego-style connectors can be unsnapped and each component safely and easily removed from the phone. The front camera module and earpiece. And then over here we have the singular rear camera module that comes out the same way. These little parts are not the bare components and circuit board, but more of a modular plastic puzzle piece that's pretty foolproof to swap out. Same thing goes for the loudspeaker and charging port. The cool thing is, if I understand it right, some of the parts can even be upgraded within model years as well. Like if you bought the Fairphone 3 and the Fairphone 3 Plus comes out, you can just purchase the newer camera modules and plop them into your older phone...and boom, new phone. Who dis? It's kind of an abnormally reasonable concept. Computer components have been upgradeable since the beginning. (Unless you own a Mac.) So it's cool that Fairphone is attempting to do the same thing. It's got dual SIM card slots, as well as expandable memory with an SD card slot...which is actually pretty important this time around since the motherboard only has 64 gigs of onboard storage. With everything back in place and both cameras still working, it's time to really get started. Keep in mind that this phone is in the $500 price range and it's overall goal isn't to contain the best of the best. We'll get the scratch test going. As you know, if the screen starts scratching at a level 3 it's made from plastic, and a 5 or a 6 would be glass, and an 8 or a 9 would be sapphire. The Fairphone 3 is using Gorilla Glass 5 and we start seeing scratches at a level 6 with deeper grooves at a level 7. The front camera is protected under that same front glass. It's a 16 megapixel selfie camera tucked into the top bezel, along with the weird looking plastic earpiece. No other buttons, just another large bezel with the Fairphone logo down at the bottom of the phone. Rotating the phone to the side, we see the designed to open letters engraved into the plastic edges. It's a soft plastic though and is the same color all the way through. The top of the phone has a microphone and a headphone jack. Nice to see him again. Then we have metal volume buttons, a textured metal power button, and more plastic next to the back panel removal slit and loudspeaker, which is indeed over here on the side of the phone. Then of course, we have the USB-C port down at the bottom. From the outside, and kind of from the inside, it looks like this phone belongs in 2018 instead of 2021. But remember, being mainstream isn't the goal of the Fairphone. Fairphone is all about making a phone that's good for the environment. All of the components are ethically sourced with factory workers getting fair wages, and is repairable for longevity. And as we see, the whole thing is made from 40% recycled plastics, all of which are very noble endeavors for any company and definitely deserve a thumbs up. The scene of the rear camera is 48 megapixels and does not have optical image stabilization, but is covered in scratch-resistant glass which is good. The fingerprint scanner is also here on the back. It's capactivite and can be scratched. But even with that extreme damage on the surface it's still able to read my fingerprint and unlock the phone most of the time. We've seen a lot of things today that we haven't seen in a while and the screen is no different. It's a 5.6 inch 1080p display. And as you can tell from the way the pixels go black and can't turn off, it's using an IPS LCD instead of an AMOLED. The average person on the street, of course, won't notice the difference or even really care, but super nerds like us know that the flame has once again spoken and revealed all. I mean, so far the Fairphone 3 has been assembled much more securely than I expected. It's a thick, heavy and beefy phone with a lot of screws. It might not have the water resistance or the latest hardware, but I am optimistic that it might survive the bend test. When bent from the back we do get a decent curve to the phone, but it locks out and does not break or shatter. The screen does stop working though. I imagine one of the gold contact pads lost connection on the inside just for a moment, or maybe it touched a pin that it wasn't supposed to. But after turning the screen off and back on again, everything recovered and went back to normal. Bending from the front has another curve. The back panel wants to come off. But the phone, once again, does not break. The internal removable battery has a hard shell which helps. And since the phone is pretty thick and heavy, there is no major surprise that the whole thing is structurally sound. I'm a pretty big fan of this Fairphone concept. But I do think that in order for this idea to go more mainstream, there does need to be a few more mainstream components, like specifically the cameras. A telephoto and wide angle perspective have been the norm for a few years now and a single camera dates the Fairphone 3 pretty hard. I'm still a fan though. And judging by the amount of people who watch my videos, there's definitely a market for solid, repairable smartphones. And I think we can all look forward to seeing what Fairphone comes out with next. Nice work. Let me know what you think of this new contender down in the comments. And come hang out with me on Instagram and Twitter. Thanks a ton for watching, I'll see you around.",
    "transcript_keywords": [
        "phone",
        "Fairphone",
        "back",
        "camera",
        "plastic",
        "components",
        "modular",
        "thing",
        "screen",
        "pretty",
        "glass",
        "years",
        "front camera",
        "time",
        "front",
        "camera module",
        "Fairphone concept",
        "Fairphone supplies",
        "screwdriver",
        "supposedly made"
    ],
    "transcript_entity_values": [
        "just one",
        "The Fairphone 3",
        "6",
        "SD",
        "Lego",
        "Instagram",
        "years",
        "a 5.6 inch 1080p",
        "40%",
        "5",
        "a few years",
        "seconds",
        "64",
        "2018",
        "48 megapixels",
        "Mac",
        "about $100",
        "first",
        "500",
        "AMOLED",
        "8 or a 9",
        "today",
        "Fairphone",
        "3",
        "16 megapixel",
        "niblet",
        "2021",
        "3,000 milliamp hour",
        "model years",
        "the Fairphone 3 Plus",
        "Twitter"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "MONEY",
        "ORDINAL",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.15830157697200775,
        0.008179625496268272,
        0.007425379473716021,
        -0.10935527086257935,
        0.011123097501695156,
        -0.08902576565742493,
        0.08680491149425507,
        0.0034484395291656256,
        -0.05364466458559036,
        0.08753184974193573,
        0.0789262130856514,
        -0.007910793647170067,
        0.009139765985310078,
        0.024091966450214386,
        0.04225765913724899,
        -0.033776555210351944,
        0.053233638405799866,
        -0.0385209321975708,
        -0.1047288030385971,
        0.12255045026540756,
        0.05724477395415306,
        0.019445952028036118,
        0.04127855226397514,
        -0.03416837006807327,
        0.015294297598302364,
        0.03642098978161812,
        -0.012475446797907352,
        0.01790555939078331,
        -0.0524015948176384,
        -0.10519830137491226,
        0.06517907977104187,
        0.09561200439929962,
        -0.022107869386672974,
        -0.004781155847012997,
        0.04919552430510521,
        -0.03511793166399002,
        -0.018240563571453094,
        -0.019537892192602158,
        -0.07239780575037003,
        0.021107828244566917,
        -0.04797980561852455,
        4.924759196001105e-05,
        -0.020119430497288704,
        -0.048142243176698685,
        -0.02418624423444271,
        -0.02085680328309536,
        0.07185843586921692,
        -0.05572032928466797,
        0.023135405033826828,
        -0.023451562970876694,
        -0.031034167855978012,
        -0.018254347145557404,
        0.07645437121391296,
        0.022278614342212677,
        -0.027936378493905067,
        0.022972801700234413,
        -0.007745520677417517,
        0.01962198130786419,
        -0.012826921418309212,
        -0.03044254146516323,
        0.05969719588756561,
        0.07123015075922012,
        -0.02017817832529545,
        0.06389500200748444,
        0.048369623720645905,
        0.028093324974179268,
        0.004292575176805258,
        -0.10301582515239716,
        -0.02016068622469902,
        0.011604564264416695,
        -0.0859605222940445,
        0.019616195932030678,
        -0.0007020544726401567,
        -0.0003877257404383272,
        0.05282505974173546,
        0.08036930114030838,
        0.04331463575363159,
        -0.030353961512446404,
        -0.06458877772092819,
        -0.0035955861676484346,
        0.024687224999070168,
        -0.04552396014332771,
        0.01822013407945633,
        0.01828893832862377,
        0.016570555046200752,
        0.028549032285809517,
        -0.025598417967557907,
        0.07030786573886871,
        -0.08309362083673477,
        -0.09558359533548355,
        -0.0007979875081218779,
        0.12517249584197998,
        -0.04198964312672615,
        0.007020552176982164,
        0.008081449195742607,
        0.001190837356261909,
        -0.09265457093715668,
        -0.08253181725740433,
        0.0016472082352265716,
        0.068662129342556,
        -0.002790374681353569,
        -0.02167448401451111,
        0.00792811531573534,
        -0.018830083310604095,
        0.04235588386654854,
        -0.02781382016837597,
        -0.07789954543113708,
        -0.020784305408596992,
        -0.012710046954452991,
        0.01974310725927353,
        0.00513632595539093,
        -0.0008203227771446109,
        -0.014198330231010914,
        0.040946830064058304,
        -0.013842680491507053,
        0.0388951450586319,
        -0.08948919922113419,
        0.07868131250143051,
        0.1300058513879776,
        -0.030265064910054207,
        0.04917921870946884,
        -0.0006699009682051837,
        -0.010556367225944996,
        -0.033672578632831573,
        0.05305081233382225,
        0.02423548325896263,
        0.02324933558702469,
        3.300266144148821e-33,
        0.03616299480199814,
        0.12049386650323868,
        -0.005929926410317421,
        0.0030213131103664637,
        -0.054662708193063736,
        -0.012587967328727245,
        0.05302634835243225,
        0.08747763186693192,
        -0.03745260834693909,
        0.009041531942784786,
        0.01647130399942398,
        0.053693145513534546,
        -0.023578429594635963,
        -0.031146353110671043,
        0.027514422312378883,
        -0.0029310667887330055,
        -0.08231491595506668,
        -0.07043483108282089,
        -0.04390448331832886,
        -0.0018894552486017346,
        -0.016374332830309868,
        -0.05784618481993675,
        -0.018585262820124626,
        0.01797366514801979,
        0.06969084590673447,
        0.04352466017007828,
        0.08591744303703308,
        0.002640590537339449,
        0.06903370469808578,
        0.02871640771627426,
        -0.06906013935804367,
        0.008450864814221859,
        0.028266094624996185,
        0.038317274302244186,
        -0.07285729050636292,
        0.0881522074341774,
        -0.058529578149318695,
        -0.05638302490115166,
        -0.08153775334358215,
        0.004747910890728235,
        -0.05530472472310066,
        -0.048749420791864395,
        0.0004553020989987999,
        -0.04249171167612076,
        -0.02192576788365841,
        -0.05359945446252823,
        -0.03335067257285118,
        0.006005533505231142,
        -0.021046146750450134,
        -0.01370352040976286,
        0.02716311253607273,
        -0.07217889279127121,
        0.0406477116048336,
        -0.032597631216049194,
        -0.07922245562076569,
        -0.012131139636039734,
        0.023423656821250916,
        -0.009043867699801922,
        0.04423985257744789,
        0.0570264607667923,
        0.03351646661758423,
        -0.036594901233911514,
        -0.08183712512254715,
        0.08263396471738815,
        -0.03981589525938034,
        0.03287998586893082,
        0.0003959419555030763,
        0.019747726619243622,
        -0.01885010302066803,
        0.02355233021080494,
        0.011150321923196316,
        -0.015667026862502098,
        -0.007854792289435863,
        0.009588594548404217,
        0.008832549676299095,
        0.01189358253031969,
        -0.054424501955509186,
        0.048763129860162735,
        0.035175781697034836,
        0.004854891914874315,
        -0.08054529130458832,
        0.026123201474547386,
        0.020996948704123497,
        0.024125836789608,
        -0.04610573872923851,
        -0.0709257498383522,
        0.024150041863322258,
        -0.16243702173233032,
        0.031010836362838745,
        0.02895963191986084,
        0.007978013716638088,
        -0.03989528864622116,
        -0.03403929993510246,
        -0.0382157564163208,
        0.012568842619657516,
        -5.68221773433604e-33,
        -0.037265025079250336,
        0.01178164966404438,
        0.0448608435690403,
        0.06734943389892578,
        0.029502151533961296,
        -0.08036186546087265,
        0.04252734035253525,
        0.11603214591741562,
        -0.017651228234171867,
        -0.09568758308887482,
        -0.028336752206087112,
        0.019534463062882423,
        -0.011038755066692829,
        -0.0670032724738121,
        0.07137318700551987,
        -0.03223840519785881,
        -0.037717320024967194,
        -0.1382964849472046,
        0.04317323490977287,
        0.0024302422534674406,
        0.09616726636886597,
        0.043394699692726135,
        0.044977348297834396,
        0.05752880498766899,
        -0.07723189890384674,
        -0.0027408686000853777,
        -0.009046422317624092,
        -0.10313604027032852,
        0.05820302292704582,
        0.018767517060041428,
        0.0007225829176604748,
        -0.08834850788116455,
        -0.020942941308021545,
        0.05851534381508827,
        0.029518524184823036,
        0.05755287781357765,
        0.00903136096894741,
        -0.005910771433264017,
        0.023332232609391212,
        -0.0439324676990509,
        0.0037016947753727436,
        0.035954371094703674,
        0.04800933972001076,
        -0.00832326989620924,
        0.008265572600066662,
        -0.08042548596858978,
        -0.0019271251512691379,
        -0.004179283510893583,
        0.04256216436624527,
        0.007492250297218561,
        0.03859374299645424,
        0.015553965233266354,
        0.014755148440599442,
        0.028649261221289635,
        -0.04807792231440544,
        0.07041533291339874,
        0.05406751483678818,
        -0.07849828153848648,
        0.008678728714585304,
        0.010392547585070133,
        0.0516483299434185,
        -0.004006023984402418,
        -0.018862789496779442,
        0.024059254676103592,
        -0.031546927988529205,
        -0.01911480911076069,
        0.048828572034835815,
        0.004641810432076454,
        0.038204871118068695,
        0.046747174113988876,
        0.04352956637740135,
        -0.02486308105289936,
        -0.021118398755788803,
        -0.09201101213693619,
        0.04225992038846016,
        0.019649138674139977,
        -0.1293477714061737,
        0.02215184085071087,
        -0.043762922286987305,
        0.010848824866116047,
        0.08323700726032257,
        -0.028125787153840065,
        0.02632451057434082,
        0.016222022473812103,
        0.03553392365574837,
        -0.0261900182813406,
        0.042837854474782944,
        0.005185293033719063,
        -0.06787664443254471,
        -0.008433278650045395,
        -0.06111026927828789,
        0.04429546371102333,
        -0.037328124046325684,
        0.13287393748760223,
        -0.00351135665550828,
        -5.877315700786312e-08,
        0.04393091797828674,
        0.08872194588184357,
        -0.034249234944581985,
        -0.034823112189769745,
        -0.026315752416849136,
        -0.055601347237825394,
        0.04188469052314758,
        -0.04733617603778839,
        0.040572453290224075,
        -0.047886647284030914,
        -0.008734739385545254,
        -0.08805879950523376,
        -0.040149301290512085,
        0.1034432202577591,
        -0.01873728074133396,
        0.07052051275968552,
        -0.002165535232052207,
        0.017410213127732277,
        -0.03271040320396423,
        0.023443758487701416,
        -0.07261409610509872,
        0.025924095883965492,
        0.04942208528518677,
        -0.06592284888029099,
        -0.05950315669178963,
        0.08970937877893448,
        -0.08223450183868408,
        -0.04500802233815193,
        0.07649675756692886,
        0.05172266438603401,
        -0.06144815683364868,
        0.024390138685703278,
        -0.007989883422851562,
        0.01581001468002796,
        -0.08010286092758179,
        -0.07594884932041168,
        -0.06638123095035553,
        -0.05888577923178673,
        0.05311070755124092,
        0.04242509976029396,
        0.03132380545139313,
        -0.02366497553884983,
        -0.00025832190294750035,
        0.04663538932800293,
        0.038351912051439285,
        -0.08337000757455826,
        0.025639843195676804,
        -0.1376938372850418,
        -0.09642494469881058,
        -0.003847747342661023,
        -0.06957704573869705,
        -0.02697385661303997,
        -0.08355958759784698,
        -0.03397778049111366,
        0.003471784060820937,
        0.007544184569269419,
        0.04292910918593407,
        0.026767650619149208,
        -0.020048750564455986,
        0.01670049875974655,
        0.011336659081280231,
        -0.03929438441991806,
        0.07245246320962906,
        0.06594368070363998
    ]
}