{
    "id": "_DV3UAItPIY",
    "title": "A preview of what future phones could look like 🔮",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-03-03T15:00:31Z",
    "video_url": "https://www.youtube.com/watch?v=_DV3UAItPIY",
    "category": "Science & Technology",
    "tags": [
        "mwc",
        "mwc. 2023",
        "best of mwc",
        "Mobile World Congress",
        "best phones",
        "best phones of 2023",
        "oneplus",
        "lenovo",
        "Nokia G22",
        "nokia",
        "Xiaomi 13 Pro",
        "Realme GT3",
        "Honor Magic VS",
        "samsung",
        "foldable phones 2023",
        "rollable phone",
        "best new phone",
        "concept phone",
        "bigges news mwc 2023",
        "tech",
        "tech news",
        "the verge"
    ],
    "views": 46025,
    "likes": 1326,
    "comments_count": 104,
    "description": "At MWC 2023 the Nokia G22, the Xiaomi 13 Pro, and the Realme GT3 all give us a glimpse into the future of what our phones could (and should) look like. It can be tempting to write off a show like MWC as being too niche or European-focused. But I think its smartphone launches offer an interesting look at where the market is heading next. #MWC #Tech   0:00 Intro 0:37 Nokia G22 repairability 3:30 Realme GT3 240W Fast-charging 5:48 Xiaomi 13 Pro Camera 7:47 Foldables 8:48 Conclusion  Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Subscribe to The Vergecast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "http://bit.ly/3Yjfnoj",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "https://bit.ly/3I6nJtz",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "(upbeat music playing) - At trade shows like Mobile World Congress, there are loads of devices that you might not want to buy and use yourself but which have that one amazing new feature that you just wish you could get your hands on. For example, at CS 2018, we put our finger on the first under display fingerprint center on a Vivo flagship. And at MWC 2019 we saw the most rear cameras we'd ever seen on a smartphone, with the Nokia 9. So here are some of the coolest phone features we've seen at MWC 2023 that we hope will become mainstream in just a few years time. The first phone I want to talk about is the Nokia G22. Now that's because the work that HMD, which is the company that currently owns the rights to produce Nokia branded handsets, has done to make it easier to repair. It's partnered with the repair specialist so IFixit just sells spare parts for the phone for five years after it's release. And there are also gonna be repair guides online for carrying out common repairs like replacing a broken screen, dead battery or dodgy charging ports. Now, thankfully that's not particularly unusual in 2023. Both Samsung and Google have also partnered with IFixit to sell replacement parts for their phones. And even Apple has launched a self-service repair program of its own. But what's more interesting is that HMD has consulted with IFixit on the actual design of the device to make it more repairable in the first place. Making spare parts easily available is one thing, but actually doing the repairs is a whole nother kettle of fish. So I wanted to try replacing the Nokia G22's battery for myself. Now, full disclosure, I didn't go into the repair process completely blind. HMD's Adam Ferguson had already given me a thorough demonstration of the process of replacing the phone's battery. And I had a team of IFixit employees standing just feet away from me who I could tell were just waiting to offer me advice. Adam gave me a neat overview of what's involved in the repair process and to HMD's credit, I was able to successfully swap out the battery and that was in a noisy convention center while also trying my best to show off the process to camera. There was no need to apply a heated pad to the phone to melt away any adhesive like with recent Samsung and Google devices because the phone was held together with simple plastic clips and I didn't have to use a suction cup to delicately get the phone open. Once inside, there were just two screws to undo, compared to the half a dozen or more you'll encounter in some other handsets. Yes, there were two fairly delicate ribbon cables to remove but that was the trickiest part of the job. Now, some of the more experienced repairers in the stand were getting a little bit competitive. There was talk of being able to do the repair in under five minutes or under three minutes, but for me, as a first-timer on camera, it was closer to seven. But honestly, speed isn't really the point here. The point is that me, as someone that has never done this sort of repair before, found the whole process pretty approachable. And it's something that I'd recommend that other people try for themselves. It feels like a really positive step forward. Now, I don't wanna claim it was a perfect experience. Obviously if HMD had used a fully removable battery like what Fairphone uses, it would've been a far simpler process. But HMD says it's gone with this approach to allow it to offer a bigger battery in a thinner phone. Both Adam and I also managed to rip off one of the tabs he used to pull the battery out of its housing which did make the process a little bit more tricky. But hey, we got the job done. And finally, over on the software side, it would be great to see HMD offer more than just two years of Android updates and three years of security updates with the phone. So it's not just the hardware you can keep spick and span for years to come. I think HMD has achieved something really impressive with the Nokia G22 and I can't help but hope that more manufacturers take note. (gentle music playing) Next up, charger. Now over on iPhone land, charging speeds are kind of hovering around the 20 to 30 watt mark. But in the world of Android, things are starting to get truly wild. The latest company to take a shot at the fast charging crown is Realme. It's Realme GT3 is getting an international launch at MWC Barcelona this week and it can fast charge at 240 watts. Now Realme has almost immediately been overtaken by Redmi which announced its own 300 watt proof-of-concept fast charging device this week. But Realme's device is actually getting a widespread international release. So we're gonna focus on that one for the time being. Those 240 watts translate into some truly bananas charging speeds. Realme says it's enough to fully charge the phone's 4 to 600 000 000 power battery in just nine and a half minutes flat. Okay, so I know the idea of a phone that fully charges in under 10 minutes kind of sounds like overkill, especially in an era where people like to keep things simple by just charging their phone overnight. But hear me out. What if the 240 watt fast charging was only for emergencies? What if most of the time you used the same old basic five watt power adapter you've been using for years? But then, say you forget to charge your phone overnight and you've got a flight, or you are on an important work call and your phone goes dead and you know that just 30 seconds of charge with the 240 watt charger can give you an extra two hours of talk time. And that's a true stat by the way. I mean nine and a half minutes is like, put the phone on charge, get in the shower, come out and it's already fully charged. Now, I know plenty of people have legitimate concerns about the kind of impact that these kind of fast charging speeds will have the longevity of their devices, but Realme at least is claiming the GT3's battery should maintain about 80% of its charging levels even after 1600 charging cycles, which, at one charge a day, works out to a little over four years of use. But again, these are lab tests and I entirely understand if people are still skeptical about real world durability. I mean hell, I don't even know if I'd use this fast charging tech every single day. But as a backup feature to use in emergencies, I'm really into the idea of more phones having access to these ridiculously quick kinds of fast charging speeds. I'll continue to charge my phone overnight, thank you very much. But I wouldn't say no to an emergency 240 watt boost, just in case, and who knows how much faster charging speeds are gonna get next year. Let's talk cameras. And now you can't talk about cameras around MWC 2023 without discussing this, the Xiaomi 13 Pro, which got its international launch at this year's show. Now our Samsung made a big deal about the Galaxy S23 Ultra's 200 megapixel main camera. Xiaomi is taking a slightly different approach. So no, the Xiaomi 13 Pro doesn't have the highest resolution camera center in the world. At 50 megapixels, it's IMX989 Sony Center almost sounds kind of unremarkable at first glance but what's special about it is its size. It's a 1-inch type sensor, which might not literally mean that it measures 1-inch corner to corner but nevertheless, that means it's a lot larger than most other smartphone camera sensors. All else being equal, bigger sensors mean bigger pixels which leaves you with a camera that's better at gathering light. Bigger sensors can also lead to a shallow a depth a field so it's slightly easier to get nice blurry backgrounds in your photographs. Now, I have spent far too little time taking photos with the Xiaomi 13 Pro to offer any kind of conclusive thoughts about how good this phone's camera is, but the photos I've taken on it so far, I've really liked. Daylight shots look crisp and clean and night shots just look really nice and natural. It almost looks like something you'd normally expect to have come out of a standalone camera. I've included some comparison shots with the iPhone 14 Pro just to give you an idea of how it compares. Now, the Xiaomi 13 Pro is far from the first smartphone to have included a 1-inch type sensor. Panasonic made one years ago. Vivo's recent X90 Pro came equipped with one and even Xiaomi itself used Sony sensor in last year's 12S Ultra. But the 13 Pro feels significant because it's a regular-looking mainstream phone from a brand that's become pretty popular in a lot of countries outside of the US and it's not exclusive to the Chinese market like the 12S Ultra. In recent years, the story of smartphone photography has been the story of computational photography. It's about using powerful processes to overcome the limitations of smartphones, comparatively small camera sensors. But the Xiaomi 13 Pro has been excited for a future where smartphones offer the benefits of both powerful camera software and hardware, alike. And I really hope the rest of the industry is paying attention. Finally, I just wanna take a moment to recognize that 2023 might be the year we actually start seeing some serious foldable competition internationally. Samsung has been releasing its Z fold and Z flip devices for years, but outside of China it's been running more or less unopposed, say for the occasional release from Motorola or Huawei. But this year it feels like there's a shift happening. Just prior to the show, Oppo held the international launch for its Find N2 flip and then Honor announced the Magic Vs foldable at the show itself. There was also the announcement that OnePlus plans to release a foldable in the second half of this year. And of course, there are early concept devices from the likes of Motorola. I don't think any of these announcements herald the imminent arrival of foldables into the mainstream but they certainly suggest the market's heating up and more devices means more pricing and functionality competition. With the Find N2 flip, Oppo made a serious case for bigger cover displays that are good for more than just checking notifications. And with the Magic Vs that's thinner and rated to survive more folding cycles than Samsung Z Fold 4. The competition has been a long time coming and I'm glad to see it finally arrive. Whether it's repairable devices, faster charging, bigger camera sensors, or more foldable competition, I think there's a lot of cool stuff on the way for future smartphones and a lot of it has a potential to become staple features in the years ahead. I just hope these features will actually become available to devices that are widely sold in the US. Um... Oh, what's gonna be my terrible pun? - [Cameraman] MWC, more like- - More like more wicked... - [Cameraman] Coverage? - Coverage. Okay, cool. If you're after MWC, by which I of course mean more wicked coverage, then check out thebadge.com. - [Cameraman] Oh, that's so bad.",
    "transcript_keywords": [
        "Mobile World Congress",
        "phone",
        "charging",
        "HMD",
        "years",
        "fast charging",
        "Pro",
        "camera",
        "World Congress",
        "Mobile World",
        "Nokia",
        "Xiaomi",
        "charging speeds",
        "repair",
        "battery",
        "MWC",
        "devices",
        "Realme",
        "year",
        "process"
    ],
    "transcript_entity_values": [
        "4 to 600 000 000",
        "Android",
        "MWC Barcelona",
        "Panasonic",
        "three years",
        "five watt",
        "20 to 30 watt mark",
        "nine and a",
        "IFixit",
        "every single day",
        "just nine and a half minutes",
        "Oppo",
        "IMX989 Sony Center",
        "the Galaxy S23 Ultra's",
        "Magic Vs",
        "Adam Ferguson",
        "240 watts",
        "Huawei",
        "OnePlus",
        "Redmi",
        "Mobile World Congress",
        "this week",
        "overnight",
        "200 megapixel",
        "Google",
        "1-inch",
        "one years ago",
        "Samsung",
        "about 80%",
        "this year",
        "China",
        "MWC",
        "first",
        "recent years",
        "Adam",
        "Chinese",
        "just a few years",
        "a little over four years",
        "next year",
        "Realme GT3",
        "US",
        "1600",
        "the second half of this year",
        "13",
        "Realme",
        "Vivo",
        "the Magic Vs",
        "2019",
        "Xiaomi",
        "the year",
        "one",
        "five years",
        "Apple",
        "Samsung Z Fold 4",
        "14",
        "Nokia",
        "50 megapixels",
        "the years ahead",
        "year",
        "300 watt",
        "the half a dozen",
        "years",
        "X90 Pro",
        "just 30 seconds",
        "Fairphone",
        "2023",
        "two",
        "Motorola",
        "240 watt",
        "Sony",
        "10 minutes",
        "CS 2018",
        "iPhone",
        "GT3",
        "an extra two hours",
        "last year's",
        "seven",
        "Oppo",
        "under five minutes or under three minutes"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERCENT",
        "DATE",
        "GPE",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERSON",
        "NORP",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "ORG",
        "TIME"
    ],
    "vector": [
        -0.1630869209766388,
        -0.028028413653373718,
        0.044834136962890625,
        -0.04662197455763817,
        0.06221632659435272,
        -0.016927583143115044,
        -0.0234310831874609,
        0.06735645234584808,
        -0.001326628029346466,
        0.01920090802013874,
        0.015314818359911442,
        0.00020591299107763916,
        0.041049882769584656,
        0.02983143925666809,
        0.06514239311218262,
        -0.03842882066965103,
        0.08466291427612305,
        -0.09276150912046432,
        -0.004840933717787266,
        0.028206847608089447,
        0.023143526166677475,
        0.051391638815402985,
        0.04113790765404701,
        0.030232461169362068,
        0.023512380197644234,
        -0.014473343268036842,
        -0.039449725300073624,
        -0.04134707897901535,
        0.005980492103844881,
        -0.0344167985022068,
        -0.008954686112701893,
        0.14251267910003662,
        0.02217026799917221,
        0.031717799603939056,
        -0.0057466658763587475,
        -0.09843871742486954,
        0.04420830309391022,
        -0.04053131863474846,
        -0.04354438930749893,
        -0.06343357264995575,
        -0.03630216792225838,
        -0.06316395848989487,
        0.024429118260741234,
        0.029573481529951096,
        0.03839537873864174,
        -0.0733889639377594,
        0.03202086314558983,
        -0.04440093785524368,
        -0.05024200677871704,
        0.006008225027471781,
        0.03665847331285477,
        -0.1089366152882576,
        -0.022563477978110313,
        0.00037203734973445535,
        -0.032565511763095856,
        0.014603360556066036,
        -0.05858039855957031,
        0.02619682066142559,
        0.12194404006004333,
        -0.02090264856815338,
        0.0683712586760521,
        -0.06229925900697708,
        -0.021524367853999138,
        0.022761983796954155,
        -0.005262934602797031,
        -0.004977729637175798,
        0.0003813477815128863,
        0.04045388102531433,
        0.02777486853301525,
        -0.014936985448002815,
        -0.03323373198509216,
        -0.016260096803307533,
        -0.006946340203285217,
        -0.03557028993964195,
        -0.01818927191197872,
        0.0789300724864006,
        0.07667984813451767,
        -0.012416533194482327,
        -0.08985751122236252,
        -0.006930631119757891,
        0.07674907147884369,
        -0.04457389563322067,
        -0.0003669846919365227,
        -0.0053207408636808395,
        0.037415310740470886,
        -0.08899127691984177,
        -0.01380319893360138,
        0.04882391169667244,
        -0.08089879155158997,
        -0.08912323415279388,
        -0.10403920710086823,
        0.10673104226589203,
        -0.05651586875319481,
        -0.0148415956646204,
        -0.03642214089632034,
        0.019788270816206932,
        -0.032171063125133514,
        -0.1318470984697342,
        -0.02481721341609955,
        0.07306233793497086,
        0.03801168501377106,
        0.03239698335528374,
        0.07751623541116714,
        -0.014354451559484005,
        -0.027897361665964127,
        -0.061959158629179,
        -0.039487335830926895,
        0.06102241203188896,
        0.0072852326557040215,
        0.03764597699046135,
        -0.05005286633968353,
        0.03498056158423424,
        -0.10836701095104218,
        -0.041156742721796036,
        -0.01290915347635746,
        0.007022713776677847,
        0.016698140650987625,
        0.06401163339614868,
        0.11576194316148758,
        0.007202352397143841,
        -0.00717763788998127,
        0.0028032485861331224,
        -0.09785722941160202,
        -0.10545625537633896,
        0.0030605243518948555,
        0.05027419701218605,
        -0.05220041051506996,
        5.462689021532193e-33,
        0.018501652404665947,
        0.06543707102537155,
        -0.03004417195916176,
        0.017981063574552536,
        0.03428780660033226,
        0.04046858102083206,
        -0.008466945961117744,
        -0.0033636228181421757,
        0.023239517584443092,
        0.0029990551993250847,
        -0.014512588270008564,
        0.05334462597966194,
        -0.07201258093118668,
        0.04124270752072334,
        0.06176787614822388,
        -0.10335593670606613,
        -0.06391666829586029,
        -0.037827782332897186,
        -0.030716460198163986,
        0.0014669476076960564,
        0.003995778504759073,
        -0.014669544994831085,
        0.031466253101825714,
        -0.046269454061985016,
        0.053048986941576004,
        0.02641603909432888,
        0.0942571610212326,
        -0.05992264300584793,
        0.08043526113033295,
        0.010505545884370804,
        -0.07156199216842651,
        0.0027721538208425045,
        0.00013533585297409445,
        -0.045778460800647736,
        -0.041552457958459854,
        0.07439273595809937,
        -0.07385242730379105,
        -0.15259775519371033,
        0.06562506407499313,
        -0.02852977253496647,
        -0.05244695395231247,
        0.031146857887506485,
        -0.0967596173286438,
        -0.030215663835406303,
        0.039082035422325134,
        0.05034268647432327,
        0.03190600499510765,
        0.004628934431821108,
        -0.042223475873470306,
        0.01561382319778204,
        -0.0029768289532512426,
        -0.013414670713245869,
        -0.09458005428314209,
        -0.028856545686721802,
        0.01222961489111185,
        -0.03874560073018074,
        0.004406715277582407,
        -0.012180386111140251,
        0.03786177560687065,
        0.008311513811349869,
        0.027558965608477592,
        -0.037299539893865585,
        -0.04653666168451309,
        0.023675311356782913,
        -0.08535123616456985,
        0.06362473219633102,
        0.028967510908842087,
        -0.008775068446993828,
        -0.08329655230045319,
        0.1184995248913765,
        -0.03756886348128319,
        -0.015810037031769753,
        0.02588232420384884,
        0.005610626190900803,
        0.030978549271821976,
        0.04060250520706177,
        -0.027009667828679085,
        -0.0369860902428627,
        -0.020648950710892677,
        0.027675142511725426,
        -0.06995781511068344,
        0.006804727949202061,
        0.02969498001039028,
        0.03067987784743309,
        0.04067084193229675,
        -0.015323283150792122,
        0.05203469842672348,
        -0.09745784103870392,
        -0.02758905291557312,
        -0.006963633466511965,
        -0.0629100352525711,
        -0.012029080651700497,
        0.042074985802173615,
        0.05453386902809143,
        -0.04737062752246857,
        -5.960117088497906e-33,
        0.017973920330405235,
        -0.021020984277129173,
        -0.006495560519397259,
        -0.010710926726460457,
        0.005728169344365597,
        -0.06617152690887451,
        0.03658876195549965,
        0.03758663311600685,
        -0.01702994666993618,
        -0.033138856291770935,
        0.021604053676128387,
        0.0072019039653241634,
        0.027994537726044655,
        0.018854163587093353,
        -0.03307333216071129,
        -0.049231573939323425,
        0.05501062422990799,
        -0.12231539189815521,
        0.028294382616877556,
        0.020338263362646103,
        0.08997876197099686,
        0.0036947380285710096,
        -0.03956810384988785,
        0.042628247290849686,
        -0.055417872965335846,
        0.017669085413217545,
        0.015463936142623425,
        -0.004321570973843336,
        -0.012615448795258999,
        -0.031216982752084732,
        -0.06856483221054077,
        -0.08378320187330246,
        0.015729475766420364,
        0.020753322169184685,
        0.09949543327093124,
        0.04168126359581947,
        0.05141659453511238,
        -0.017905574291944504,
        -0.000145921076182276,
        -0.014177185483276844,
        0.037360597401857376,
        -0.006790109910070896,
        0.0008253238629549742,
        0.00997787807136774,
        -0.01237256545573473,
        -0.06915032118558884,
        -0.009614423848688602,
        0.060268670320510864,
        0.008840207010507584,
        -0.009878420270979404,
        0.04689127951860428,
        0.06321310997009277,
        -0.017838982865214348,
        0.0036008816678076982,
        -0.08837512880563736,
        -0.050859641283750534,
        -0.00925880391150713,
        -0.08034539967775345,
        0.027217097580432892,
        0.043614014983177185,
        0.05377790331840515,
        -0.0018361146794632077,
        -0.040488723665475845,
        -0.05486162006855011,
        -0.04863281548023224,
        -0.005339835304766893,
        0.07677768915891647,
        -0.001430104486644268,
        -3.578813266358338e-05,
        0.06983046978712082,
        -0.0066907587461173534,
        -0.06895799189805984,
        -0.06388512998819351,
        -0.08566273003816605,
        0.00707149226218462,
        0.023524895310401917,
        -0.028851818293333054,
        -0.018718570470809937,
        0.01277011539787054,
        -0.06490172445774078,
        0.03872321546077728,
        0.07623541355133057,
        0.0455968901515007,
        -0.019631944596767426,
        0.1502193808555603,
        0.016200244426727295,
        0.007354325149208307,
        0.07412699609994888,
        0.010855617001652718,
        0.014709431678056717,
        -0.07390610873699188,
        0.04248620942234993,
        -0.0761280357837677,
        0.09437991678714752,
        0.018197327852249146,
        -5.5914735952455885e-08,
        -0.010028026066720486,
        0.00792057067155838,
        0.020135516300797462,
        -0.005317843519151211,
        -0.054134249687194824,
        -0.0729762464761734,
        0.0005408565048128366,
        -0.012473920360207558,
        0.0921497493982315,
        0.013086661696434021,
        0.020425595343112946,
        -0.08815515041351318,
        -0.07571057975292206,
        0.09146544337272644,
        0.03450556844472885,
        0.10550496727228165,
        -0.04102369397878647,
        0.06597081571817398,
        -0.011700242757797241,
        0.05163612216711044,
        0.03782310336828232,
        0.04976356402039528,
        0.0720105990767479,
        -0.04952457919716835,
        0.02023444138467312,
        0.016254842281341553,
        -0.0801263302564621,
        0.010348368436098099,
        0.07311052083969116,
        0.019069282338023186,
        0.020644282922148705,
        -0.015537536703050137,
        0.029114698991179466,
        -0.047125086188316345,
        -0.03274841234087944,
        -0.03208561986684799,
        0.03074044920504093,
        0.001766658155247569,
        0.07494686543941498,
        0.03415273129940033,
        0.018343018367886543,
        -0.07630516588687897,
        -0.007514056283980608,
        0.052461616694927216,
        -0.01456025056540966,
        -0.12119688093662262,
        0.03365069255232811,
        -0.0890931785106659,
        -0.0478694774210453,
        0.08340831845998764,
        -0.023966427892446518,
        -0.06554973125457764,
        0.021795058622956276,
        -0.021052518859505653,
        0.06055319309234619,
        0.03142359480261803,
        0.05709397792816162,
        0.03652428463101387,
        -0.024246159940958023,
        0.06308639049530029,
        0.03509148582816124,
        -0.08945947140455246,
        0.016672996804118156,
        0.09404080361127853
    ]
}