{
    "id": "_IvNqh8z4C0",
    "title": "BLIND Mystery Tech Challenge",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-11-03T17:15:53Z",
    "video_url": "https://www.youtube.com/watch?v=_IvNqh8z4C0",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "tech",
        "technology",
        "mystery tech",
        "mysterytech",
        "rtx 2080ti",
        "xbox",
        "xbox 360e",
        "microsoft",
        "sony psp",
        "psp go",
        "radeon vii",
        "game",
        "blindfold challenge",
        "challenge",
        "google",
        "stadia",
        "trivia",
        "weird tech",
        "weird technology",
        "gadgets",
        "usb rock"
    ],
    "views": 143145,
    "likes": 6932,
    "comments_count": 241,
    "description": "Can Austin guess this mystery tech?! What PS5 & Series X Are Missing:  Xbox Series X vs Series S Unboxing!  Is the iPhone 12 Pro Worth It?  Pixel 5 - I Was Wrong:  iPhone 12 Mini vs iPhone 12 Pro Max:   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/MugTyyYrTlM",
        "https://youtu.be/3B2OzImgn1g",
        "https://youtu.be/crjVuHr-j4M",
        "https://youtu.be/5dE9gwwMoKY",
        "https://youtu.be/PjaQ96i_BkE",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome to \"This Is.\" Today, I have a mysterious challenge in front of me. I, with a blindfold on, need to recognize just how well I really know technology. So we saw a video from iJustine and her sister, Jenna, where they did this, well, exact same thing. We thought it looked fun so we're gonna steal it. - In front of us we have the mystery box, where I have a bunch of items in here that you should know what they are. - Okay. - By feeling them. And you need to tell me what it is. You need to give me the model-- - Easy, I have touched so much technology, I think I'll do okay. - I'll give you some leniency-- - Okay. - But you need to be specific with like makes and models. - Okay, yeah, yeah. I have done a lot of things with blindfolds on in my life. This is nothing that's gonna scare me. - First item is on the table. - Already? - Yes. - Okay, that's a 2080 TI, easy, Founders Edition. - What makes you say that? - Well, because it's a 2080 TI. It says is RTX 2080 TI right here. It's the shroud. It's the shroud, like it's obviously a graphics card, but like no one else has this sort of metal shroud with like the bend here. One fan, two fan, RTX 2080 TI. I don't even need to take off the blindfold. - Do you want to take off the blindfold? That's kind of what we said we were going to do is that we take off the blindfolder-- - Oh look, it's 2080 TI. - Okay. Good news for you in true \"This Is\" fashion. It only gets harder from here. - Alrighty. Matt, what you got for me next? - All right. Next up, let me get something out of the box. - Oh, my Sanyo Xacti CG10. Pew pew, pew pew. Dude, this is easy, man. Look, thank you very much for watching. Make sure to subscribe-- - Stop ending the video after 30 seconds. All right? - These are so distinctive. That is like I used to. Okay. So for reference, not only have I done a video on this, but this was my very first YouTube camera. I don't know if I'm facing toward any of the cameras. I'm just gonna keep talking to this way. This is what I started the channel on, the main channel on. I love this camera, it was so useful because like it's such a unique sort of design. It did, I think 720P, which was pretty good for back in like 2009. It had like a decent little zoom lens. You can flip it around and do the whole selfie thing. I think it's a selfie. Yeah, so you can do like this. It was great. - Again, they get harder as they go. - Yeah, sure, tease me all you want. \"Oh, it's going to get harder.\" - So, we didn't talk about what happens, if you-- - Nothing happens. - Nothing happens? - No stakes. - No stakes. Love it. Love it. You have to tweet out that \"This Is\" is the main channel, and that Austin Evans is just a side project. - This is the main channel now. Okay. Deal, deal. All right, okay. Is this the Galaxy camera? This is the Galaxy camera, huh? But let me not be too hasty. This is a little bit harder than the other ones. So obviously this feels like a smartphone-sized screen. Okay. So here's the thing. Back in my early tech days, when I first started getting invited to events, Samsung were actually, fun fact, the very first company to ever invite me to any real tech event. And at one of those first launch events, I think it was the Note 2, I believe? They also launched the Samsung Galaxy camera, which was literally a fusion of a Samsung Galaxy phone on the back, and a one of their point-and-shoots on the front side, or I guess back and front, whatever, regardless, I may or may not have taken advantage of their wonderful green screen, and use the background that looked almost identical to my giant oversized stupid looking white shirt, giving this wonderful footage-- - [Matt] It wasn't even white. It was like silver. - That was my default thumbnail background at the time, I had it on a flash drive, so like the guy was like \"Hey, we can key whatever you want on this.\" I'm like, \"Oh yeah, I've got this background. Here you go.\" So they rendered it. Not my finest hour, but this, I will say with a lot of confidence is Samsung Galaxy camera, and I'm almost positive it's the two because I don't think we have the one. Throw a CPU at me. I will definitely not one. (Austin laughing) [Narrator] Two seconds later. - All right, so this is definitely a chip. So this is an SoC of some variety. Is this what I think it is? Did you take this off my desk? This is a Radeon 7 like SoC. I can tell because it's got the HBM2 memory on the side, and I only know this because this is a cool little gift that I got from AMD. I think for the Radeon 7 launch, they sent us like a dead chip, but like, it's still has the full package. I know this because it sits on my desk. I stare at it basically every day. So this is the actual like sort of GPU, and this is the HBM2 memory on its side. - So that was one I'm like, okay, let's see. Like I knew-- - How many, like GPU dies are sitting around, 'cause you can feel on the bottom that it's not any kind of like CPU, and that like narrows it down to like three. - So I did, I was considering using an actual CPU, but like, you know, you're not going to sit there counting pins or whatever. - Okay. Well, hang on. So, feels like a pixel. So it's got the fingerprint sensor here. (suspenseful music) It's got the power buttons here. It also has that pretty distinctive kind of like rolled edge. Oh wait, wait, hold on. Hold on. That's glass. Okay. So it's actually metal and glass, I think. Is this the way this all plastic? Oh, wait, hang on. Okay. So I feel a headphone jack, which definitely dates it to being Pixel. Oh God, when did they drop the headphone jack? I don't think they had it for 3. I think they had it on Pixel 2. Yeah, I think that's plastic. Okay, so I'm going to say this is probably the Pixel 3a. I just don't remember the Pixel 3a have this like little, like shiny bit on the top. - [Matt] It is in fact the Pixel 3a. - [Austin] Yes. - [Matt] So, you are a hundred percent so far. - Okay. That one, by far, the hardest one that could have been a couple of phones I could have definitely got that one wrong. - [Matt] I know I could have thrown you like generic phones, but like there's no way you're going to get that. I mean again, once again, I'm glad I didn't put any actual stakes up. 'Cause you know that would've made me sad. - What about the stakes for the audience? Why are they still watching the video, man? Are they, they're clearly not here for the riveting content? Why is anyone watching this video right now? - I don't know. What do you, what do you guys want? - You know what, here's the thing, subscribe \"This Is,\" and I promise that our next videos will be better than this one. See? That seems like a great pitch. I mean, this might not be exciting-- - Every time you pitch it, you're like \"I'm sorry our videos suck.\" - You know what, it's called self-- - Self-deprecating? - Yeah. That one. I was about to say something else. That's like, that's not the correct phrase. Sorry. - I'm sorry, we're a piece of crap. - All right. All right. Hit me with that sweet, sweet tech. - [Matt] I already did. - Oh. Huh? What the, okay. Controller. So wait, so okay, my sticks are down here, which makes me think like Switch Pro controller. Actually, yeah, maybe this is. Oh boy, but hang on. What is this? No, no, this is Stadia, I think this is Stadia. So we've got the d-pad, which is all one piece. I think this is a Stadia controller. This feels Stadia-like to me, but I haven't-- - Maybe a turbo button? - What? Turbo button? - Yeah. - What is the turbo button? - Did you never play the Mad Catz controllers with the turbo button? - Yeah, but this is a wireless, and also it feels much more modern. I think you just trying to (beep) with me right now. Stadia controller. Final answer. - Stop hitting the mic. - I'm blindfolded, Matt. What else am I supposed to do? - Situational awareness, yes this is a Stadia-- - Woo! I see, I could tell by the tone of your voice that you were trying to throw me off. However, I know you well enough to know that I will not be fooled by such shenanigans and trickeries, Matthew. Oh, okay. I actually think I, this is obviously a tiny graphics card. I think you just grabbed something from the top of my GPU shelf because this is a 1030. - God dammit. - I know this because I was literally using this card last week for a video. - Why were you using this card? Why do we have this card? - I needed something that was super low profile and didn't need any external powers. This I believe is Gigabyte GT1030 with two GB of RAM. And I know that entirely because you just grabbed it from the top of my GPU shelf. - It wasn't on the top. - Yeah, also how many of these low profile, single slot cards do I have, not a lot. - I don't know. I didn't know, even realized that we had that, so-- - Yes, well, to be fair I forgot we had it, but I needed it for a video. And I started looking through the shelf. I was like, \"Oh right. This thing.\" - [Matt] There's a new item on the box. - I'm afraid to talk about. Okay. Okay. Okay. This is the Thermal camera. This is the Seek. - Dude. - This stuff is so like, this is the newer one because it has the rotating like little like thing. I'm sorry to say that these items are all things that I use on a very regular basis. This is so for reference, this is a thermal camera that you can connect as a lightning port. So you can drop it into an iPhone. We have a couple of these, but this is the, I believe with the XR version of the Seek Thermal, which is something that again, as I've been using with a lot lately. Yeah? Oh no, I don't like this. This feels like a laptop slot loading optical disc drive that for some reason doesn't have the shell on it. Probably because we did, I feel that this may be from like a MacBook or something because I think we actually took apart a DVD drive for a video on the main channel, like nine months ago or so. This part's from like a Blu-ray drive, but this part's from like the DVD drive. And then we tried to Frankenstein it together. It didn't quite work. So we just hoped it would work and it didn't. But-- - Yeah, yeah. I hate you. I hate you. - Oh God. I don't like the way that sounds. Oh, this is Roboraptor X 'cause he's way bigger than normal Roboraptor. Yeah, okay. What, Roboraptor X is 33% larger than standard Roboraptor. This is common knowledge. I don't know why you gave him hands to try and trick me, real Roboraptor's right here. 'cause he's the \"This Is\" mascot and we just bring him in for you know, his tryouts on main channel. Roboraptor X is always behind me on the main channel, mostly because he looks bigger on camera. I'm feeling pretty good right now, man. How are you feeling over there? What's your confidence level, Matt? Do you think you'll be able to win the game? He's just not gotta talk to me anymore. - No, I like-- - USB rock. USB rock from Mystery Tech. - [Matt] That one was a joke one. - [Austin] Yes, like I don't even know why we still have this, but this is from, it's probably a couple years ago. This is USB rock. - That's before my time. - This is a pet rock that you plug in via USB, and it does literally nothing. There's a whole hole in it right here, there's a USB cable that comes out. That's the entire gag, can't spend too much money on this, but yes, the USB rock. Oh wait, what is this? Ooh. Oh, is this a PSP? Oh, it's a PSP Go, isn't it? It's the one that lives on Jimmy's desk, right? - God dammit. - Is it the white one? - Stop even knowing where I'm taking these from. - I look at this a lot because PSP Go was a later model of the PSP. This was a digital only PSP. So, if you remember the original PSP used the UMD disk drives, which was a questionable decision for a handheld portable-- - I'm going to rant about that for a second. Why did they not just continue using mini disc? - Look man, mini disc sounds like a very 2001 problem, but the PSP Go was way ahead of its time. The problem was that it was just a little too far ahead because at the time I don't think a lot, some PSP games were available digitally, but not a lot. And this may have been one of the very first digital only like consoles. PSP Go was rad. I wish I had one, but I never did until-- - You're literally holding one. - I have now stolen Jimmy's property. Jimmy, I'm gonna enjoy my PSP Go now. Thanks for donating it. This is the, Oh God, the iPod Nano seventh gen? This is the one with the lightning port right here. This is the last iPod Nano I believe. And I can tell you this also sits right beside me every day because it sits on Ken's desk, and I stare at it at least three times a week. - [Matt] How can you see anything on Ken's desk? It's just covered in-- - Look, man, I happen to be a bit of a busy person, a lot of the time, but also as I'm writing videos, I almost always, like my eyes aimlessly wander around. - [Matt] See, you say that you're busy, and yet every time I have one of these, he's like, \"Oh yeah, I just stare at this all day.\" So, it sounds like you do a whole lot of not working. - I listen to music, I write, and then I look around the room for inspiration. - I also don't think he actually listens to music. He just puts his headphones in, and then pretends he can't hear us-- - I put full noise cancellation on, and I'm just listening-- - Austin, the payroll didn't go through. (Austin sings) Oh, I can't hear you, I got headphones. - I said, hey. And I wake in the morning and I step outside, and I do do do, and I get real high, and I screamed at the top of my lungs, what's going on? Jimmy, if you use that, you're fired. Jimmy, if you use it, I quit. (Austin laughs) - [Matt] It's on the box. I almost want to say it's the Palm phone, but I don't think it is. You might have me on this one. - Oh, he's gonna throw me this bone. - No, I'm not actually playing with you right now. It's a small phone. It's a mini phone, obviously. I feel a little camera here. It does feel a little bit like the Palm phone, but I seem to recall the Palm phone being a little heavier. We did if you've watched \"This Is\" religiously, like we all obviously have. You will probably know that we've done a couple of videos on some small phones. I know that we specifically did an entire video on just these tiny, tiny devices. And in that video we did three or four. And honestly they all felt the same to me. I would guess it's from that video, it feels relatively modern, but it's not helping me that much. I'm actually going to say, I don't remember the name of any of those phones that we did on the episode. I think it's one of those. So just as a backup, I'm gonna say it's the Palm phone. - I'll give you credit for that. - Really? - [Matt] It's not the Palm phone. It is from that video. This was the only smartphone we did. The other ones were like plastics, so I don't know what the hell you're talking about there. - I forgot that they were feature phones. Huh? Wait, I get the point? - You said it was from the other, I mean-- - I did call that video out I guess. - You said it was from that video. You just didn't know the name of it. It was the Melrose. - Oh yeah. - Yeah. - If I kept my eyes open, I still wouldn't get that name right. - We're down to our last item. - Last item. Have you subscribed to \"This Is\" yet? I haven't. - Mystery box is gone. - Xbox 360 E. Thank you very much for watching this episode of Mystery Tech. I think my Xbox is upside down, but you can make sure to follow us on Twitter to get the latest updates on \"This Is\" content. And until next time we're going to make Matt wear the blindfold. I think he's gone.",
    "transcript_keywords": [
        "yeah",
        "video",
        "PSP",
        "Samsung Galaxy camera",
        "Palm phone",
        "Galaxy camera",
        "camera",
        "Samsung Galaxy",
        "phone",
        "lot",
        "USB",
        "pixel",
        "main channel",
        "time",
        "Roboraptor",
        "USB rock",
        "Galaxy",
        "feels",
        "Samsung Galaxy phone",
        "channel"
    ],
    "transcript_entity_values": [
        "iPod Nano",
        "iJustine",
        "2080 TI",
        "2080",
        "1030",
        "Today",
        "Radeon 7",
        "Frankenstein",
        "at least three",
        "the model-- - Easy",
        "Austin Evans",
        "one",
        "four",
        "Palm",
        "GPU",
        "three",
        "a hundred percent",
        "Blu-ray",
        "2001",
        "USB",
        "Jimmy",
        "AMD",
        "seventh",
        "a couple years ago",
        "Two seconds later",
        "listening-- - Austin",
        "UMD",
        "standard Roboraptor",
        "Twitter",
        "Stadia",
        "the Seek Thermal",
        "XR",
        "Samsung Galaxy",
        "Matt",
        "the Mad Catz",
        "CPU",
        "GB",
        "3",
        "nine months ago",
        "PSP Go",
        "Austin",
        "Samsung",
        "33%",
        "Gigabyte GT1030",
        "YouTube",
        "PSP",
        "Mystery Tech",
        "two",
        "jack",
        "Galaxy",
        "Pixel 2",
        "2009",
        "Matthew",
        "One",
        "SoC",
        "Roboraptor",
        "Roboraptor X",
        "Switch Pro",
        "MacBook",
        "Jenna",
        "iPod",
        "Xbox",
        "last week",
        "2080 TI",
        "second",
        "Melrose",
        "HBM2",
        "first",
        "Ken",
        "early tech days",
        "RAM",
        "Sanyo Xacti",
        "First",
        "30 seconds"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "LAW",
        "PERSON",
        "CARDINAL",
        "FAC",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "GPE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERCENT",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "FAC",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORDINAL",
        "GPE",
        "EVENT",
        "ORDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORDINAL",
        "TIME"
    ],
    "vector": [
        -0.12397868186235428,
        0.0030517936684191227,
        0.10130411386489868,
        -0.06976287811994553,
        0.09229099750518799,
        0.018446512520313263,
        0.13103631138801575,
        -0.029829151928424835,
        0.01298623438924551,
        0.03087649680674076,
        0.061666443943977356,
        -0.03181581571698189,
        -0.008037116378545761,
        -0.02841523103415966,
        -0.10542478412389755,
        -0.031798653304576874,
        0.05490710213780403,
        -0.04774101451039314,
        -0.1444782167673111,
        0.04653759300708771,
        0.07181021571159363,
        -0.04425620287656784,
        0.04938768222928047,
        -0.03708595782518387,
        0.006918741390109062,
        0.09806796163320541,
        -0.015087448991835117,
        -0.07910843938589096,
        -0.03137733414769173,
        -0.08918758481740952,
        -0.0003991716366726905,
        0.08553032577037811,
        -0.012337951920926571,
        -0.004248324781656265,
        0.03865835815668106,
        0.02150029130280018,
        -0.019399384036660194,
        -0.004723341204226017,
        -0.02705666422843933,
        -0.0902838185429573,
        -0.11102147400379181,
        -0.040086474269628525,
        0.03551090508699417,
        0.04079706594347954,
        0.014895079657435417,
        0.030418068170547485,
        0.02752969227731228,
        -0.04064193740487099,
        -0.012590322643518448,
        -0.07770279794931412,
        -0.0356963574886322,
        -0.027958564460277557,
        -0.012808333151042461,
        0.02039400115609169,
        -0.018141066655516624,
        0.015964623540639877,
        0.0386822372674942,
        -0.0278158001601696,
        0.048074837774038315,
        0.020442182198166847,
        0.05663323029875755,
        -0.07669200748205185,
        0.01492212899029255,
        0.03668145462870598,
        0.02765359729528427,
        0.008412589319050312,
        -0.013950780034065247,
        -0.020936165004968643,
        0.010193802416324615,
        -0.020817985758185387,
        0.009450254961848259,
        0.041304025799036026,
        0.03126593306660652,
        0.0271659754216671,
        0.12059981375932693,
        0.0038184341974556446,
        0.0485803447663784,
        -0.025998372584581375,
        -0.029025116935372353,
        0.029284853488206863,
        0.02653711475431919,
        -0.08163518458604813,
        -0.04033781588077545,
        0.03545897454023361,
        0.02685800939798355,
        0.025622641667723656,
        -0.0575096495449543,
        0.05368773639202118,
        -0.030376985669136047,
        -0.06634613871574402,
        -0.12006200104951859,
        -0.0022833957336843014,
        -0.032356925308704376,
        0.006153349298983812,
        0.04412340372800827,
        -0.04249017313122749,
        -0.010869571939110756,
        -0.006045996211469173,
        -0.0819350928068161,
        0.049072958528995514,
        0.0938829556107521,
        0.04947662353515625,
        0.03802395984530449,
        -0.031587906181812286,
        0.017334382981061935,
        -0.061207033693790436,
        -0.028320379555225372,
        -0.014463452622294426,
        0.06883718818426132,
        0.037728991359472275,
        0.0025100994389504194,
        -0.0215061753988266,
        -0.06374462693929672,
        0.0700392797589302,
        0.008505872450768948,
        -0.00945484172552824,
        -0.03400265425443649,
        0.03552459552884102,
        0.00843077152967453,
        -0.04306810349225998,
        0.012617243453860283,
        -0.004567042924463749,
        -0.06904999166727066,
        -0.01876690238714218,
        0.01773494854569435,
        0.02657218836247921,
        -0.0494040809571743,
        -1.4748681500637538e-33,
        0.0348728783428669,
        0.09978745132684708,
        0.029098622500896454,
        0.05505963787436485,
        0.073911651968956,
        -0.045531485229730606,
        0.0061145988292992115,
        0.0756346732378006,
        -0.0812310129404068,
        0.07803231477737427,
        -0.022000664845108986,
        0.012997089885175228,
        -0.0643451064825058,
        0.02218860760331154,
        0.03686480224132538,
        -0.0663885846734047,
        -0.049378421157598495,
        -0.07985633611679077,
        -0.014708498492836952,
        -0.04713565111160278,
        0.031407032161951065,
        0.013171426951885223,
        0.014782557263970375,
        -0.05295675992965698,
        0.03456498682498932,
        0.06770195811986923,
        -0.02060016803443432,
        -0.046952132135629654,
        0.08932490646839142,
        0.025513364002108574,
        -0.11702042818069458,
        0.04061836376786232,
        -0.0003600050986278802,
        0.002701074117794633,
        -0.020877378061413765,
        -0.01964966021478176,
        0.09339292347431183,
        -0.09909620136022568,
        0.07434859126806259,
        0.019705969840288162,
        -0.03937530517578125,
        -0.003977565094828606,
        -0.009232172742486,
        -0.05836792662739754,
        -0.03072584979236126,
        0.016590483486652374,
        0.06678453087806702,
        -0.01630522310733795,
        -0.06288323551416397,
        0.024264715611934662,
        -0.02188924141228199,
        -0.002570861717686057,
        0.04161631315946579,
        -0.0947544127702713,
        0.0012643340742215514,
        0.011158294044435024,
        0.009283705614507198,
        0.012216978706419468,
        0.06979437172412872,
        0.07196708768606186,
        0.07877064496278763,
        0.034647680819034576,
        0.030478911474347115,
        0.03542502224445343,
        -0.046683743596076965,
        0.03746391087770462,
        0.02297484315931797,
        -0.031169157475233078,
        0.0028135015163570642,
        0.08538603037595749,
        -0.11114034801721573,
        0.06085040420293808,
        -0.018700487911701202,
        -0.049166999757289886,
        0.061600927263498306,
        0.04257126525044441,
        -0.059455741196870804,
        -0.02710253931581974,
        -0.03957439213991165,
        -0.003582371398806572,
        -0.03522617369890213,
        -0.011353758163750172,
        -0.02178642898797989,
        0.03572916239500046,
        -0.09539802372455597,
        -0.06391707807779312,
        -0.014143113046884537,
        -0.07284075766801834,
        -0.03791390359401703,
        0.03279395401477814,
        -0.04488740488886833,
        -0.06056595221161842,
        -0.06443753838539124,
        -0.014829134568572044,
        -0.016666462644934654,
        -2.178583536984278e-33,
        0.0012413251679390669,
        -0.06030702590942383,
        -0.016446884721517563,
        0.0019627439323812723,
        0.08746602386236191,
        -0.0975784882903099,
        0.01476740837097168,
        0.008567621931433678,
        0.008838173933327198,
        0.008677688427269459,
        0.018122170120477676,
        0.022248616442084312,
        -0.07952906936407089,
        -0.030851325020194054,
        -0.0653083324432373,
        0.013787543401122093,
        -0.016692569479346275,
        -0.04686562344431877,
        0.030906280502676964,
        -0.001071422710083425,
        0.06089339032769203,
        0.061382539570331573,
        -0.07230562716722488,
        -0.031540706753730774,
        -0.06321771442890167,
        0.06980511546134949,
        0.062466565519571304,
        -0.016174625605344772,
        0.04060230404138565,
        0.0005138277192600071,
        0.010975576937198639,
        -0.06185367703437805,
        0.028368106111884117,
        0.014351177960634232,
        -0.011038272641599178,
        0.0779927670955658,
        -0.009701833128929138,
        -0.08452003449201584,
        -0.03775705769658089,
        -0.057727277278900146,
        0.05175595358014107,
        0.0680810734629631,
        -0.08435066789388657,
        -0.01685662940144539,
        -0.00875562522560358,
        -0.04585530608892441,
        -0.06870013475418091,
        0.06368274241685867,
        0.047650959342718124,
        0.06950775533914566,
        0.1318376362323761,
        -0.02226322330534458,
        -0.04065588489174843,
        -0.03888564184308052,
        -0.0952787697315216,
        0.03656914830207825,
        -0.035291317850351334,
        -0.019558781757950783,
        0.08340101689100266,
        0.03547046333551407,
        0.0615413524210453,
        -0.02226637303829193,
        -0.11697207391262054,
        -0.004921413958072662,
        -0.019244758412241936,
        0.01712982915341854,
        0.07620491087436676,
        -0.0026189193595200777,
        -0.042309824377298355,
        0.002148230327293277,
        0.012260926887392998,
        0.05548800155520439,
        -0.012004351243376732,
        -0.09410679340362549,
        0.07155116647481918,
        0.05379858240485191,
        -0.09161584824323654,
        -0.008256790228188038,
        0.003140139626339078,
        -0.04641392081975937,
        0.02433907240629196,
        -0.03595864400267601,
        0.06286963075399399,
        0.05804573372006416,
        0.09972861409187317,
        0.07012545317411423,
        0.030439451336860657,
        0.11067498475313187,
        -0.07115855813026428,
        -0.018720945343375206,
        -0.06018684804439545,
        0.048875436186790466,
        0.011048691347241402,
        0.0822625681757927,
        -0.0330171175301075,
        -5.993396001713336e-08,
        -0.004693798255175352,
        0.016293063759803772,
        -0.05158518999814987,
        -0.10889892280101776,
        0.025401243939995766,
        -0.0070554097183048725,
        -0.04794148728251457,
        0.03367717191576958,
        0.0122831417247653,
        -0.05081396549940109,
        -0.018438251689076424,
        -0.06595955789089203,
        -0.0610758438706398,
        0.08992498368024826,
        0.04901178926229477,
        0.06799723953008652,
        -0.097514308989048,
        0.02940472587943077,
        -0.04412433132529259,
        -0.055076997727155685,
        0.020093780010938644,
        0.018419809639453888,
        0.03802163898944855,
        -0.0246919933706522,
        -0.013625703752040863,
        0.005919200833886862,
        -0.04041221737861633,
        0.014338519424200058,
        0.017238162457942963,
        0.011137268505990505,
        -0.04645238816738129,
        -0.03266675025224686,
        -0.022689513862133026,
        0.010102027095854282,
        -0.03951100632548332,
        0.01385586615651846,
        -0.012686463072896004,
        -0.03298904001712799,
        0.024782495573163033,
        -0.0018743604887276888,
        0.008237459696829319,
        -0.08107030391693115,
        -0.02466835267841816,
        0.03257553279399872,
        -0.03588429093360901,
        -0.04985961318016052,
        0.038746196776628494,
        -0.18382173776626587,
        -0.003442564280703664,
        0.03429873287677765,
        -0.021608194336295128,
        -0.0013294372474774718,
        -0.00959181971848011,
        0.045758847147226334,
        0.0645017996430397,
        0.02315625362098217,
        0.043685924261808395,
        -0.02430523745715618,
        -0.021606648340821266,
        0.05797414109110832,
        0.07548919320106506,
        0.006312269251793623,
        -0.028980642557144165,
        0.05175832286477089
    ]
}