{
    "id": "_JI08e3mgOI",
    "title": "Inside the wild plan to reengineer coral reefs",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-11-28T15:00:33Z",
    "video_url": "https://www.youtube.com/watch?v=_JI08e3mgOI",
    "category": "Science & Technology",
    "tags": [
        "coral reef",
        "coral reef preservation",
        "reef",
        "coral",
        "florida",
        "florida keys",
        "florida coral reef",
        "environment",
        "climate change",
        "climate",
        "heat wave",
        "climate crisis",
        "coral reef video",
        "coral reefs",
        "coral bleaching",
        "global warming",
        "great barrier reef",
        "climate change news",
        "ocean",
        "climate emergency",
        "climate action",
        "climate science",
        "science",
        "technology",
        "the verge"
    ],
    "views": 229001,
    "likes": 649,
    "comments_count": 42,
    "description": "This past summer, conservationists in Florida did something remarkable: they took corals out of the ocean en masse to save them from an ocean heat wave. Its just one new strategy of many that researchers are trying out around the world to save coral reefs from climate change. Theyre also mapping reefs like never before, cloning huge numbers of corals to plant in the wild, and even breeding new heat-resistant species. Will it be enough? Presented by Meta for Work. #Science #ClimateChange #CoralReef  Read more:   0:00 Introduction 0:34 Coral migration mission 2:42 Importance of coral reefs 3:25 Visiting the saved coral and looking towards the future 6:20 Mapping coral reefs with photomosaics 8:44 Welcome to our eternal pets  11:20 What the future of coral looks like  The Verges sponsors play an important role in funding our journalism, but do not influence editorial content. For more information about our ethics policy, visit   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "https://www.theverge.com/e/23736688",
        "https://www.theverge.com/ethics-state....",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "- Scientists in Florida are on an urgent mission to try-- - [Justine] The Florida Keys are in the grip of an unprecedented ocean heat wave. - [Speaker] Causing a crisis for coral reefs. - Today, we are moving into phase two of the rescue mission. - [Justine] The region's coral reefs are in critical danger and conservationists are doing something as unprecedented as the heat. They're taking corals out of the ocean to save them. - All those crates with corals will come here and there, as I said. - [Justine] A non-profit called the Coral Restoration Foundation is leading today's charge. They operate a series of coral nurseries across the Keys, tree-like structures where they grow corals to plant in depleted briefs. The corals here have been bleaching with alarming speed. They're expelling the algae that gives them their color, a telltale sign of stress. If the heat wave continues, all the corals in these nurseries could be wiped out. The solution, wild as it sounds, is a mass migration of corals. - Well today, we're focusing on quantity to get as many large colonies as possible from our nursery and bringing them to these land-based nurseries to then safeguard them. - [Justine] The rescuers are focusing on Staghorn and Elkhorn corals, two threatened species that are key to restoration efforts and it becomes clear that the crew arrived in the nick of time. - See how pale these corals are top. So you are already seeing some signs of breaching. - [Justine] The rescued corals are transported back to land, and then trucks to aquariums and labs across Florida. About 3,500 end up here at a field station called the Keys Marine Lab. - These are quarantine tables until they get moving to the final tanks. - [Justine] The operation is a success. The prized corals are safe, but now what? This mass migration was a desperate short-term move. From here on out, the playbook for saving corals gets rewritten on the fly. That's after the break. - Climate change is undeniably a real challenge for businesses around the globe and Meta for Work is already creating tools, enabling businesses to meet these challenges head on. Meta for Work's virtual mixed reality solutions allow people to collaborate from anywhere in the world as if they're in the same room together, working on new products, directly in a virtual space or allowing teams to work shoulder to shoulder in a virtual office. It's all saving on company travel, shipping and flights. Now, Meta doesn't influence our editorial videos, but they do help us make important videos like this possible. Alright, back to the team. - [Justine] Coral reefs, climate change and people are all tied tightly together. As weather events get more extreme, reefs are key to protecting communities from flooding and coastal erosion. But that same extreme weather is cooking corals and adding to a raft of threats already decimating reefs around the world like disease, pollution and overfishing. Without quick action on climate change, research points to a more than 90% loss of all coral reefs globally. - The alarming water temperatures off Florida tonight-- - The heat wave in Florida got the world's attention for its speed and intensity. Whatever happens next, the world will be watching that too. It's been a couple of months since that race to take corals out of the sea. Summer's over and we're in the Florida Keys to see what happened to them. - We are looking at the Elkhorn Coral Acropora Palma. Okay, this one that you can see here. - [Justine] Phanor Montoya-Maya is a marine biologist with the Coral Restoration Foundation or CRF. He's caring for the rescued corals and reckoning with a scale of damage from the summer. CRF lost half of all the corals in its nurseries. Entire restoration sites were wiped out. But Phanor and the team still need to plan for the future so they're looking carefully at which corals fared best, whether here on land or in the ocean. It could help inform the next phase of the rescue. - Remember that we are working with individuals at the end of the day. It belong to species, but within the species there are different genotypes that behave individually. So some corals will do really well under conditions and we're seeing that that some survive, some died really quickly. - [Justine] One thing is obvious. These corals need to get back to the wild ASAP. The ocean is starting to cool down and these tanks are actually a little too cozy. - You cannot babysit this coral because out there, that's the wild west for the corals. We rather have them grow on those stressful conditions so that they can adapt to them and be resilient for the next event. - [Justine] While CRF maintains its land-based sanctuaries, the federal government also set up a temporary nursery in deeper cooler waters. Good conservation means lots of hedging. - We have the backup of the backup of the backup. - [Justine] Hanging over all this is a realization that this mass migration could be needed again next summer. And again and again. - I never thought about it. I never imagined, I've never imagined it was possible, but honestly, in the last eight to 10 years, it's become more and more of, we have to be prepared for this. - Cindy Lewis is the director of Keys Marine Lab. She's already stockpiling equipment for next summer. - We're already prepared. We have a lot of equipment on site. Kind of like a NASCAR crew, we can run in and replace a a three horse pump quicker than you can blink. And I keep telling them, what can I do for you guys? They say, just keep the corals alive. Just keep the corals alive. - [Justine] Despite its losses this summer, CRF is forging ahead, growing corals at scale and replanting them in the wild and they've gotten more sophisticated about tracking their efforts. - So we load up all of the images, we set some settings, and then what is produced first is a three-dimensional model of the area. - [Justine] This is a photo mosaic of a nearby reef where CRF is working. It's stitched together from GoPro footage that the team takes at the restoration sites. With this view of the reef, it's easy to track the progress of every new coral that they plant. Right now, I'm learning to spot Elkhorns. Are these little chicken cutlets, those are all corals that-- - So this is one of the two main species that we work with. And when we outplant them like this, yes, they look like little chicken tenders or pieces of you get in a KFC bucket or something. But eventually they'll grow into really large branching plating colonies. - [Justine] The team documents their work sites over time to assess progress. Here's that same location a year later. - You skip to a year, and now we're really close in some parts to getting fusion, which is where the corals that are the same, that are clones of each other, the same genetic strain will fuse together and create that really strong almost lattice structure that these colonies are known for. And from there, they just grow out and up and really create a complex three-dimensional habitat that also protects from erosion and storm surge and things like that. - So you're seeing the birth of a reef. - You're seeing the birth of a reef. And even more important, we're able to see it in the context of a full area, a full habitat. - Not just any habitat, we're looking at a place called Sombrero Reef. It's a spot where temperatures spiked so fast this summer, the corals died before they even had a chance to bleach. And we're looking at Sombrero Reef, I remember the name. This is one of the hardest hit areas, right? - Yeah, absolutely, there are, unfortunately, a lot of these corals that don't exist anymore. But there are a few that remain. And just because one summer, the bleaching event at Sombrero was so bad that it killed a bunch of corals, that doesn't mean we don't go and try and restore Sombrero. It just means that we've got our work cut out for us going forward. - One thing is clear. Conservationists can't just think about getting through next summer or the summer after that. They need a long-term backup plan too, a fail safe in case nothing else works. We're headed into West Palm Beach and we're visiting another organization with a completely different strategy for saving coral reefs. - So welcome to the Reef Institute. - The Reef Institute is a land-based research and restoration facility. Like the Keys Marine Lab, they took in rescued corals from CRF nurseries. And these are the Elkhorn? - There's Elkhorn and Staghorn in here. - But unlike the corals at Keys, some of the fragments here will become permanent residents, very permanent. I was just curious how long you can keep them here. I mean, are we talking decades, hundreds of years? - Welcome to our eternal pets. - [Justine] Each piece of this coral is actually a colony of tiny identical animals. Individuals die, but the colony can keep growing indefinitely by cloning new individuals. - They could live here forever and that's our goal. It's called a mother colony. So you always keep a piece of the genetics kind of aside. The really amazing thing about coral as an animal is that if everything continues to go sideways in the ocean, welcome to Groundhog Day. We can keep starting over. - [Justine] Should it come to that, the eternal pets could repopulate reefs a couple of ways. Break a coral into fragments and the fragments will grow into their own colonies. That's how CRF grows so many corals so quickly. - So we don't know how often that will be, but once a year, once every couple of years, pieces of these corals will keep going back out to replenish the ocean. - [Justine] Corals can also reproduce sexually by spawning. Learning to control that process will help conservationists build healthier, more diverse reefs, and it could produce corals that are more resilient to extreme heat. - These were born in the spring. These are just a couple months old. - For now, they're raising babies spawned at other rescue centers, thousands of them in this cradle. You need a microscope to see each individual. I kinda see it. In theory, if corals vanish from the sea, these babies could bring them back. It's one way to undo Armageddon, which might sound like dystopian science fiction, but that's not how Lanita sees it. - Do you ever find yourself fighting this kind of narrative that if you're doing this, you've sort of given up a little bit on what's happening in the ocean? - 100%, I always say it's a both end approach and it's going to take all of us to do the work. It doesn't look very exciting. It looks like a bunch of tanks with a bunch of fuzzy rocks, but this is what hope looks like. This is what the future of coral looks like. - [Justine] At the end of the day, there's no silver bullet for saving coral reefs. Success still depends on what's happening in the wider world. On whether we can give these corals a better home in the ocean, get rid of pollution, stop temperatures from rising much higher, it all needs to come together. - You know, sometimes you wonder, is there really anything you can do about it? We all need to try to reduce those carbon emissions. So hopefully we can slow some of this temperature change, give these corals a chance to adapt to the new world. - [Justine] This isn't Cindy's first coral crisis. When she began this work some 20 years ago, she had to race to save another species called pillar coral. - Those are my babies, they really are. - [Justine] We actually saw some pillar corals at the Reef Institute. Over the years, they've been decimated by a disease that tore through the local population. Today they're considered functionally extinct in Florida's reefs. But with Cindy's help, some of them are still in gene banks today. - We may not have wild pillar coral out here in Florida anymore, or not very much of it, but we've got over 500 chunks of it and our partners are holding it in these land-based nurseries, and they're spawning in captivity. So there's the silver lining. - [Justine] It's the kind of story that everyone here in the Keys is working so hard to avoid, to give Elkhorns and other species a different fate. But it also shows what happens when people who care about these corals refuse to give up. They find a way. A few weeks after we visited, CRF began to return rescued corals to the sea. About 1300 corals survived long enough on land to make the trip. Whatever happens to them next, Phanor and all the others will react and adapt and go from there. It's all they can do. - We're definitely better prepared to respond to the next bleaching event, which there is a certainty that is gonna happen again. This is not the first time that I, for instance, I lost corals. But every time, we come back stronger.",
    "transcript_keywords": [
        "corals",
        "coral reefs",
        "coral",
        "Keys Marine Lab",
        "reefs",
        "Coral Restoration Foundation",
        "saving coral reefs",
        "Keys",
        "reef",
        "Florida",
        "Florida Keys",
        "CRF",
        "Keys Marine",
        "rescued corals",
        "Reef Institute",
        "Coral Restoration",
        "Elkhorn Coral Acropora",
        "Work",
        "Summer",
        "Sombrero Reef"
    ],
    "transcript_entity_values": [
        "Sombrero",
        "Elkhorn",
        "CRF",
        "Today",
        "Armageddon",
        "one",
        "the last eight to 10 years",
        "GoPro",
        "500",
        "Elkhorns",
        "Cindy Lewis",
        "three",
        "the Reef Institute",
        "the summer",
        "today",
        "Summer",
        "Groundhog Day",
        "the Keys Marine Lab",
        "Sombrero Reef",
        "Justine]",
        "next summer",
        "Cindy",
        "the end of the day",
        "Florida",
        "a couple of months",
        "the Coral Restoration Foundation",
        "About 3,500",
        "a more than 90%",
        "mosaic",
        "The Reef Institute",
        "the years",
        "100%",
        "Justine] Coral",
        "the spring",
        "Meta",
        "nick",
        "half",
        "thousands",
        "About 1300",
        "two",
        "Justine",
        "Meta for Work",
        "Cindy",
        "hundreds of years",
        "One",
        "Elkhorn",
        "some 20 years ago",
        "West Palm Beach",
        "one summer",
        "a year later",
        "NASCAR",
        "Staghorn",
        "every couple of years",
        "just a couple months old",
        "A few weeks",
        "first",
        "KFC",
        "Staghorn",
        "this summer",
        "Keys Marine Lab",
        "Elkhorn Coral Acropora Palma",
        "Work",
        "Justine",
        "Phanor"
    ],
    "transcript_entity_types": [
        "GPE",
        "GPE",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "LOC",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "EVENT",
        "ORG",
        "LOC",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "GPE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "DATE",
        "PERCENT",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "LOC",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORG",
        "LOC",
        "DATE",
        "ORG",
        "LOC",
        "ORG",
        "PRODUCT",
        "ORG"
    ],
    "vector": [
        -0.048603348433971405,
        0.0009900170844048262,
        0.02983890287578106,
        0.032219454646110535,
        0.0974891409277916,
        -0.06086605042219162,
        -0.12196344137191772,
        -0.05086616054177284,
        0.005422975867986679,
        0.031681954860687256,
        -0.01017262227833271,
        -0.05238693580031395,
        -0.047003135085105896,
        0.08011506497859955,
        0.012873073108494282,
        0.03268147259950638,
        0.0052879550494253635,
        0.025631509721279144,
        -0.0452972948551178,
        0.03021937981247902,
        0.000793050101492554,
        0.05277546867728233,
        0.004336345475167036,
        0.0021527279168367386,
        -0.14532636106014252,
        -0.06768391281366348,
        -0.060850489884614944,
        0.01686055213212967,
        -0.03747877478599548,
        0.009197776205837727,
        -0.008019472472369671,
        0.11737527698278427,
        0.04052409157156944,
        -0.03401390090584755,
        0.03669525682926178,
        0.014378109946846962,
        -0.034934151917696,
        -0.04595048353075981,
        0.015211192891001701,
        0.04831210896372795,
        -0.045181214809417725,
        -0.09756068885326385,
        0.029395435005426407,
        0.06911901384592056,
        -0.07316648215055466,
        -0.09848551452159882,
        0.025193996727466583,
        -0.033213745802640915,
        -0.011646016500890255,
        -0.0866820365190506,
        -0.022552235051989555,
        -0.06968280673027039,
        -0.06727756559848785,
        -0.09332861751317978,
        -0.052184272557497025,
        0.0004985517589375377,
        0.0005241079488769174,
        -0.08194585889577866,
        0.04255961254239082,
        -0.127969428896904,
        0.1273881196975708,
        -0.020651550963521004,
        0.008222972974181175,
        0.0442810133099556,
        -0.06072864681482315,
        0.04456165432929993,
        -0.011216942220926285,
        0.07847362756729126,
        0.017978375777602196,
        -0.03635275736451149,
        -0.043016333132982254,
        0.004084821790456772,
        0.0535949245095253,
        -0.036344386637210846,
        0.017266761511564255,
        0.01887431927025318,
        0.031372200697660446,
        0.04323089122772217,
        0.04800709709525108,
        -0.11887969076633453,
        0.08126890659332275,
        -0.09190421551465988,
        0.06168312579393387,
        0.00927433930337429,
        0.03223089128732681,
        -0.03853574022650719,
        0.014486385509371758,
        -1.6427540685981512e-05,
        0.0456688366830349,
        0.01058395765721798,
        -0.0021051911171525717,
        -0.04219410568475723,
        0.02230161428451538,
        -0.034749291837215424,
        -0.08276255428791046,
        0.08496063202619553,
        -0.09102216362953186,
        -0.07753905653953552,
        -0.02562609873712063,
        -0.03030773438513279,
        0.005216882098466158,
        -0.05117843672633171,
        -0.006434713490307331,
        -0.08645952492952347,
        0.02128145657479763,
        -0.01750645972788334,
        0.021183842793107033,
        0.014668522402644157,
        0.05756548419594765,
        0.04354022815823555,
        -0.10833863914012909,
        0.10585851967334747,
        0.00929623655974865,
        0.009353630244731903,
        0.023218298330903053,
        0.062156643718481064,
        -0.03873072937130928,
        -0.018268363550305367,
        0.07680074870586395,
        0.0464555025100708,
        0.008778465911746025,
        0.016612695530056953,
        -0.009394114837050438,
        0.01533091813325882,
        0.06022842600941658,
        -0.03386518731713295,
        -0.0428461916744709,
        6.133742746902143e-33,
        0.04543053358793259,
        0.1040235087275505,
        -0.018866637721657753,
        0.013771280646324158,
        0.13978447020053864,
        -0.007412840612232685,
        -0.03342203423380852,
        -0.11509576439857483,
        -0.10647227615118027,
        -0.007211724761873484,
        0.020362671464681625,
        0.051548171788454056,
        -0.0230884850025177,
        0.10497970134019852,
        -0.01778440549969673,
        -0.043853797018527985,
        -0.04755120724439621,
        -0.0013175606727600098,
        -0.1069224402308464,
        -0.04816647246479988,
        -0.006810013670474291,
        0.0409616157412529,
        0.013640631921589375,
        0.0009053957764990628,
        0.026440782472491264,
        0.00910953152924776,
        -0.01934167928993702,
        -0.007181154098361731,
        0.025997351855039597,
        0.06011340394616127,
        -0.009349837899208069,
        -0.03977861627936363,
        -0.03929618373513222,
        -0.022290345281362534,
        0.04680898040533066,
        0.059222783893346786,
        0.013473291881382465,
        -0.07833877205848694,
        -0.013960146345198154,
        0.007658638991415501,
        0.01738874800503254,
        0.05339319258928299,
        0.023773306980729103,
        0.03216804563999176,
        0.03892439231276512,
        -0.02505803480744362,
        0.06214248389005661,
        0.07408121228218079,
        0.03426271677017212,
        0.03412080556154251,
        0.0011402304517105222,
        -0.04951445758342743,
        -0.06579836457967758,
        -0.0664387121796608,
        0.015599900856614113,
        -0.03863129764795303,
        -0.005094192456454039,
        -0.029331861063838005,
        -0.07952149212360382,
        -0.09359966963529587,
        0.026059873402118683,
        -0.03911177068948746,
        -0.0606548935174942,
        -0.0267805103212595,
        0.003584287827834487,
        0.09658245742321014,
        -0.021486597135663033,
        0.02671991102397442,
        -0.04989380016922951,
        -0.045406028628349304,
        -0.05028241500258446,
        -0.015563352033495903,
        -0.05448835343122482,
        -0.016768716275691986,
        -0.022549116984009743,
        0.047915443778038025,
        0.0430472195148468,
        -0.011445416137576103,
        0.04630279541015625,
        0.07492884993553162,
        -0.03567562252283096,
        0.06347917020320892,
        -0.06691353023052216,
        -0.08487296849489212,
        0.028637563809752464,
        -0.03782312572002411,
        0.055559054017066956,
        0.0456855334341526,
        0.09216737002134323,
        0.05274273455142975,
        0.03368706628680229,
        -0.04020087048411369,
        0.01108880527317524,
        0.04429970681667328,
        -0.03566424921154976,
        -7.76500711426494e-33,
        -0.11239680647850037,
        0.032506074756383896,
        0.044860824942588806,
        0.002271315548568964,
        -0.03672143071889877,
        -0.06863916665315628,
        -0.009995433501899242,
        -0.03142359480261803,
        0.07388662546873093,
        -0.09634638577699661,
        -0.12661467492580414,
        0.0027421226259320974,
        0.019694067537784576,
        -0.07153544574975967,
        -0.03465290367603302,
        -0.03540686145424843,
        0.05387808755040169,
        -0.07746376842260361,
        -0.04839605838060379,
        -0.025918133556842804,
        -0.018580444157123566,
        0.024913394823670387,
        -0.0642855167388916,
        0.07341586798429489,
        -0.029678521677851677,
        0.09347747266292572,
        0.05016959458589554,
        0.02880770154297352,
        0.01694687083363533,
        -0.05894239619374275,
        -0.044170647859573364,
        0.025286223739385605,
        -0.06158393621444702,
        -0.017302975058555603,
        -0.03980199992656708,
        0.045372821390628815,
        0.0169835202395916,
        0.002218057634308934,
        -0.0586840994656086,
        -0.034751251339912415,
        0.029129033908247948,
        -0.06625726073980331,
        -0.06168133765459061,
        -0.018713267520070076,
        -0.09755298495292664,
        0.015594162978231907,
        0.014986822381615639,
        0.03816822171211243,
        -0.0077016097493469715,
        0.006013039965182543,
        -0.009828408248722553,
        -0.0025451271794736385,
        0.0055362810380756855,
        0.002187150763347745,
        0.010458419099450111,
        0.003790154354646802,
        -0.020501207560300827,
        0.075372114777565,
        0.028428291901946068,
        0.022760989144444466,
        -0.0003394205996301025,
        0.08184932917356491,
        -0.04926881939172745,
        0.020128635689616203,
        0.018780384212732315,
        0.04273686930537224,
        -0.029297439381480217,
        0.008317846804857254,
        -0.02609134092926979,
        0.045298777520656586,
        0.036877717822790146,
        0.0487745963037014,
        -0.10580705106258392,
        -0.07612992823123932,
        0.024879325181245804,
        0.0059217126108706,
        -0.06790053099393845,
        -0.12081225216388702,
        -0.11056430637836456,
        0.0679096058011055,
        0.0008194277761504054,
        0.003379934001713991,
        0.016057446599006653,
        -0.01842624321579933,
        0.026099227368831635,
        -0.06716812402009964,
        -0.012633584439754486,
        0.007947977632284164,
        0.02648886851966381,
        -0.012767977081239223,
        -0.049908265471458435,
        -0.03849422559142113,
        -0.09160919487476349,
        0.09409743547439575,
        0.030233003199100494,
        -5.542543135561573e-08,
        0.024136679247021675,
        0.020359154790639877,
        0.017970573157072067,
        0.03797397390007973,
        -0.0078281806781888,
        -0.05213349685072899,
        0.025646429508924484,
        -0.0010076852049678564,
        -0.031139938160777092,
        0.024514883756637573,
        0.03644265606999397,
        0.07227384299039841,
        0.06667739897966385,
        0.07390118390321732,
        0.06366847455501556,
        0.007718919310718775,
        0.10743128508329391,
        -0.07087964564561844,
        -0.015990009531378746,
        -0.025431498885154724,
        0.009567159228026867,
        -0.0067214700393378735,
        -0.015801185742020607,
        -0.031812142580747604,
        0.01242354791611433,
        0.0640602707862854,
        0.0016534088645130396,
        0.019770853221416473,
        0.036145858466625214,
        0.017787430435419083,
        0.02730141393840313,
        -0.014648513868451118,
        -0.016096075996756554,
        0.10680709034204483,
        -0.04350367560982704,
        -0.05902055650949478,
        -0.05874798074364662,
        -0.00877586379647255,
        0.025155119597911835,
        0.02380330115556717,
        0.05375899001955986,
        0.07001883536577225,
        -0.02284557931125164,
        0.08213811367750168,
        -0.0005151215009391308,
        -0.007408732548356056,
        -0.027799472212791443,
        0.06480791419744492,
        0.0433688685297966,
        0.012251115404069424,
        -0.006335550919175148,
        -0.09196765720844269,
        -0.02245747670531273,
        0.05003667622804642,
        0.020622914656996727,
        0.013655182905495167,
        0.046507060527801514,
        0.08153289556503296,
        -0.018446171656250954,
        0.08980534225702286,
        -0.024959638714790344,
        -0.06914718449115753,
        0.0023343784268945456,
        -0.023013366386294365
    ]
}