{
    "id": "_Jxwz7ZXynQ",
    "title": "I Don't Hate Them Anymore - OnePlus Buds Pro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-08-23T12:01:16Z",
    "video_url": "https://www.youtube.com/watch?v=_Jxwz7ZXynQ",
    "category": "Science & Technology",
    "tags": [
        "OnePlus",
        "Buds Pro",
        "EarBuds",
        "Headphones",
        "Ears",
        "Wireless",
        "Turly Wireless",
        "Bluetooth",
        "Audio",
        "Music",
        "Connect",
        "Base",
        "Touch Controls",
        "Battery Case",
        "Active Noise Cancellation",
        "ANC",
        "One Plus",
        "Buds",
        "Pro",
        "James",
        "Unboxing",
        "First Impressions",
        "First Impression"
    ],
    "views": 495883,
    "likes": 17318,
    "comments_count": 620,
    "description": "Get 10% off all Jackery products with code LinusTechTips at   The OnePlus Buds Pro has made me confident that OnePlus can make solid wireless earbuds. Of course, there are a few bugs to work out, but so far, I'm really liking these!  Check out the OnePlus Buds Pro at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.jackery.com?aff=27",
        "https://lmg.gg/W1stZ",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- All right OnePlus, they're back with their buds. This time their Buds Pro. Famously, I was kind of a hater of the original OnePlus Buds. I thought the interface totally made them unbuyable. Let's give these a fair shake, I read the reviewer's guide. I'm intrigued- (paper rips) Especially for $150. I like the box, It's very gropey. This is not an ASMR channel. Do I just need to shake a bunch? Ugh. How embarrassing. This is what they want you to see okay. That's the presentation that OnePlus is about. They always have good pay packaging. (melodious music) Just joking. I don't want that there. One Plus. Never settle. Unless you're the founder, and in which case you just leave and make another headphone company. They wanted to sell. He didn't want it. Or he did sell. I don't know what happened. You get a paper thing. Oh, look a hidden box beneath. Whoop. And there's more. This is just getting insane. It's showing me where on the bud I actually need to make contact. I guess it wasn't intuitive. But at least from the picture, that seems like an ergonomic way to adjust them. So we will investigate that. Yeah, come on don't embarrass me. This is the same cable that came with the other OnePlus buds except that one had a red inner wrapper on the inside of their cable, which is something they typically do for their one plus branding which I like. The inside of both of these is just white which doesn't matter. You're not buying a cable. You're buying earphones. Oh, I'm sorry. That's not perfect anymore. (tosses box) It looks like you know maybe you got medium on the buds and then you've got the small and large here. Pretty typical white tips because we got the white glossy white variant of the headphones. There are two variants. The other one is matte black. Warranty and safety. I like to live dangerously. I don't wash my rice. (laughs) Jono just threw up in his mouth a little bit. It's a glossy white box. I, yeah, it's got a shiny OnePlus text on the top not the logo. It has a USBC charging port on the back of it beside its glossy chrome hinge. It's a little creaky even now. (clicks earphone package) And here's the sound of the open and close. (open and closing sound) Pretty good closing sound. All right let's open it up. And there they are. What a sweet presentation. These have a very premium look. These look awesome honestly. Here's some AirPods pros for comparison. So you can see that the OnePlus ones here compared to the apple AirPods pro here, the OnePlus ones are more matte. They kind of more tactile texturey, less glossy, even though they are called glossy. They don't have this big black thing on the end so they look a little simpler and cleaner. Both of these have these meshes. AirPods pros actually have a filter in their ear tip that goes in front of the buds mesh. That goes on very easily. These ones that's just a hole baby. All right let's pair these starting with a OnePlus device, which I don't own, but Brandon does. So can I borrow that thing? And the reason is there's usually a kind of a magic apple like pairing process with one plus devices. - [Brandon] It already gave me a notification. Whoa. His phone is already detecting them. What does it say? I just hit connect. Connecting. I don't even have to press the button on the case really? Connected. And now it's going right into a tutorial telling me to pinch the stems for playing pause and oh, it's telling me the battery level. Oh it's gone. Just like that. It was gone. Wow. That's cool. I don't want to look at that now though. I now I'm going to unpair them and see what it's like on a normal Android phone. Open. One plus buds pro they're sitting at the bottom of the list there. You can choose if you're gonna use AAC as your codec. You gonna use this for phone calls or not, media audio or not. However, there is an app which I already downloaded called HeyMelody. Your phone is trying to connect to these things again. (laughs) Earbuds controls. Now this is it guys. Because the thing I hated about the last ones is they only had one interface function- double-tap. And only if you had a OnePlus device, I think it would one of the newer ones. Only then could you customize the interface. And you could only customize the double tap. You can change double tap to do different functions. You could not say I want you to single tap or triple tap. And said there was no swipe, there was no hole, the long press- nothing. So I really am interested to see if they've remedied that on this device. Quick squeeze earbud stem. Double squeeze earbud stem. Triple squeeze earbud stem. Squeeze and hold. Long touch and hold. You cannot change the quick squeeze from being play and pause. That is set. Okay, well let's get them out of the case and into my ears right after this message from our sponsor Jackery. Jackery's explore 1500 portable power station has enough juice to keep all your devices powered and connected. It's huge 1500 watt hour capacity and 1800 watt output rate allows up to seven devices plugged in simultaneously. It takes only four hours to recharge from zero to 80%. That's crazy for that much capacity. So check out the Explorer 1500 at the link below and get 10% off using the code LinusTechTips. All right I actually can't wait to put these in. They have a kind of a chalky feel. Okay there's already some kind of whoa. I'm listening to a podcast suddenly. Ah, Kevin, O'Leary shut up. What is this? This is just what's playing. Smooth kind of reggae beats. It sounds really spacious. I think these have better bass than the Non Pros, which I remember being kind of, they had kind of a sizzling highs and not a lot of bass. Now let's the interface here. Quick squeeze. First try paused it. Not too bad. There's a little feedback sound. It is very subtle and quiet. I like that. It has like, almost like a, like a wooden quality to it. Like it's a little twig getting stressed or flex or something. I don't know. It just works. The latency is not too bad. This is squeeze paused, squeezed playing. Ah, let's see if they pause when you pull it out and I'm going to try not to squeeze. Yeah, it paused. I am just a ruiner of new tips. Oh, it started playing again. I wonder why. Can I do any volume on these things? It doesn't look like it. I'm gonna try squeezing and holding. It went bring, but I don't know what happened. Transparency mode? Now it went bring. And this sounds more like noise canceling, but it's very gentle. So on these ear buds. Oh my God the tip came off in my ear. That's so scary. Was this even the one that I messed with. Ah, oh my God. Help! I need some tweezers here. I just cut my fingernails so. - [Jono] That's like everyone's nightmare right there. I know once when I was a kid, a bug flew in my ear and then it just died in there when I was trying to get it out. I think it's like a mosquito. Oh, oh hold on. No wait I might've had it. Another time there was like a small little piece of plastic, like shaped like a heart that I just found in my ear in bed once when I was like eight. It just like came out. I was like yeah anyways, didn't need the tweezers. Thank you. Scariest thing imaginable. Ah, let's see if I can get these on properly now. Okay. Hope confidence. Confidence. So the claim to fame for these is that not only are they active noise-canceling, but they have different levels of active noise canceling. It will adjust automatically depending on the ambient noise around you. So again, there are three microphones in here. And so let's say you're walking and it's a quiet nice day in a meadow. You don't need a lot of noise canceling, but then suddenly a large truck drives by you and it'll up it. And then you arrive at your destination which is an airplane. It'll up it again. So you never have to touch these, the sensitivity of the ANC. It just scales automatically. That is the claim. I'm not here to test that. This is just an unboxing, but I do want to see where in the app. I can just the sensitivity of the ANC. Right there front and center. Noise cancellation settings. Noise cancellation off right now. Let's put these back in. Oh, I put them in it automatically went to transparency for a second before automatically going to noise cancellation. It might've done that cause I touched it. Now you can see I've got smart which is on now. This is gentle. It went (makes phone noise). This is max. I feel at max noise cancellation only a very slight amount of extra pressure on the drums. It's really, it doesn't really feel any different from minimum. Transparency is on. It barely feels like it's on. Can you talk to me? - [Brandon] Hey James, how's it going? These are still isolating. Honestly, it doesn't feel like there's transparency on at all right now. What if I turn that off? - [Brandon] One, two, three, four, five, six. No, that didn't help. My voice sounds a little different, but that didn't help you at all. So yeah. Transparency could be a little stronger and I'd like to have an option. Lots of headphones give you an option of how strong that is. Okay what else do they have in here? Zen mode air. This song is silly. What is? He's the greatest dancer (laughs) It's hilarious. Okay Zen mode air, squeeze and hold the earbuds. then for three seconds to play white noise. (makes earbud noise) It actually just sounds like transparency mode is on. So squeeze and hold versus long touch and hold. But then down here it says squeeze and hold. Hello. I'm gonna check... At least two items need to be selected. Why do they do this? Like just let me do whatever I want. Why is this one locked? Like just let me do whatever I want. Okay what else you got in here? Zen mode just didn't work. So that's about everything in the app. I think I want to listen a little bit more. And I just want to listen to Papa Roach now. (laughs) I want to, I want to do. Doodoop doodoop doodoop. Oh, don't go loud guys. Ah this hurts! Yeah they go louder than I want. And they don't sound their best when they're that loud. Unsurprisingly it's kinda how it goes. Pretty bassy. This song right now. There's like a Tom drum breakdown. (makes drum noise) And it's pretty bassy, but it doesn't sound necessarily wrong. I haven't heard this song a long time. It's possible that this band tuned their drums like that low and spaciously, but it might not be flat. It might be a little bassy. These are sweet. I like them. I like these 150 bucks is a good deal for headphones of this quality. I think the industrial design is cool. The interface feels pretty good. It sucks that there's no volume control, but that's fine. I'm excited to explore the ANC- the smart ANC. That's a cool feature. I hope it works well. These are playing again. These are really they're kind of sensitive, but get them back in the box. I like the size of the box and the battery life. I haven't even talked about. But they are at claiming 38 hours with the charge case with ANC off. 38 hours is a lot and it's 28 hours with ANC. That's still a lot. And then it has fast charging. So they're claiming that battery life is just not gonna be a thing for you because you can charge it so fast and it lasts so long. So that's cool. As far as ingress protection goes, typically you see IPX4, which is what the case has. But the buds themselves actually have IP55, which is low pressure jets streams on them. So you could maybe wear these in the shower. Probably definitely wear them in hard rain. Yeah I think these are gonna be very popular because of the price and the brand recognition and just an overall it's a pretty good product. I don't like that squeakiness, but the belts themselves look cool. They look really cool in black and they are cheaper than the competition. You know it's $280 for the Sony truly wireless ANCs. And that's comparable to the AirPods pro. So I think these are a great budget option. Yeah these are gonna be great. I like them a lot more than the non pros. Enjoy everybody. If you liked this video, please like and subscribe. Check out our other headphone reviews. Riley does some, I do some. But these I think stand out in 2021. These are not bad. Check 'them out.",
    "transcript_keywords": [
        "squeeze",
        "buds",
        "kind",
        "OnePlus",
        "noise",
        "ANC",
        "Yeah",
        "Buds Pro",
        "hold",
        "OnePlus Buds",
        "thing",
        "white",
        "squeeze earbud stem",
        "squeeze earbud",
        "Pretty",
        "Transparency",
        "cool",
        "sound",
        "Noise cancellation",
        "Pro"
    ],
    "transcript_entity_values": [
        "USBC",
        "only four hours",
        "Buds Pro",
        "AirPods",
        "HeyMelody",
        "five",
        "38 hours",
        "eight",
        "At least two",
        "Kevin",
        "three",
        "One",
        "OnePlus",
        "nice day",
        "Tom",
        "Riley",
        "one",
        "zero to 80%",
        "2021",
        "Papa Roach",
        "ANC",
        "three seconds",
        "second",
        "150 bucks",
        "max",
        "Whoop",
        "28 hours",
        "the Explorer 1500",
        "ASMR",
        "Jono",
        "AAC",
        "Brandon",
        "280",
        "Sony",
        "the Non Pros",
        "two",
        "150",
        "Jackery",
        "1800 watt",
        "Android",
        "1500 watt hour",
        "up to seven",
        "10%",
        "four",
        "OnePlus Buds",
        "six",
        "First",
        "IPX4",
        "James",
        "1500",
        "O'Leary",
        "Doodoop"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "PERSON",
        "ORG",
        "TIME",
        "ORDINAL",
        "MONEY",
        "PERSON",
        "PERSON",
        "TIME",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.08952265232801437,
        -0.03358935937285423,
        0.04017854481935501,
        -0.08513627201318741,
        0.08859100937843323,
        0.003961470443755388,
        0.06437189131975174,
        0.04396253079175949,
        -0.025731589645147324,
        0.016697721555829048,
        0.013406195677816868,
        0.05030050128698349,
        -0.008956750854849815,
        -0.0593545101583004,
        0.06586428731679916,
        -0.04978170990943909,
        0.04179295524954796,
        -0.08792126178741455,
        -0.015856295824050903,
        0.013910802081227303,
        -0.006570802070200443,
        0.0007941416115500033,
        0.08107991516590118,
        0.014095083810389042,
        0.0069153765216469765,
        -0.07620713114738464,
        -0.022542016580700874,
        -0.06212063133716583,
        -0.022080019116401672,
        -0.08881203085184097,
        0.03753266856074333,
        0.0584496334195137,
        0.028548266738653183,
        -0.03657342866063118,
        -0.025276826694607735,
        -0.08127183467149734,
        0.05467815324664116,
        -0.03495774418115616,
        -0.10901021957397461,
        0.03848342224955559,
        0.02266266942024231,
        0.01128498837351799,
        -0.05640310421586037,
        0.008948876522481441,
        -0.013964284211397171,
        -0.0762549340724945,
        -0.016926748678088188,
        -0.009854298084974289,
        0.011778558604419231,
        0.061012446880340576,
        0.10821612924337387,
        -0.08594799041748047,
        0.09812869876623154,
        0.027426468208432198,
        0.0019284439040347934,
        -0.017191872000694275,
        -0.09555496275424957,
        0.04830323904752731,
        0.017538154497742653,
        -0.028335895389318466,
        0.07290031015872955,
        -0.04495646059513092,
        0.005548596382141113,
        0.007959919981658459,
        -0.012814154848456383,
        0.05357808992266655,
        -0.013405364006757736,
        0.08343282341957092,
        -0.035706065595149994,
        -0.030639391392469406,
        -0.05625059828162193,
        0.021469157189130783,
        0.0181437861174345,
        0.06604935973882675,
        0.05309129133820534,
        0.05383387580513954,
        0.03630896285176277,
        -0.02133290283381939,
        0.03531627729535103,
        0.045510802417993546,
        -0.07429727166891098,
        -0.038150567561388016,
        -0.01006427314132452,
        -0.06851782649755478,
        0.061321716755628586,
        -0.02862541377544403,
        0.009648478589951992,
        0.032360177487134933,
        -0.049608856439590454,
        -0.07899113744497299,
        -0.045535534620285034,
        0.0745081752538681,
        0.03933018818497658,
        0.02298782207071781,
        0.02704584412276745,
        0.002442695898935199,
        -0.030360547825694084,
        -0.053867142647504807,
        -0.05446280166506767,
        0.033480577170848846,
        0.02002548985183239,
        0.0349908247590065,
        0.03644554316997528,
        -0.06480561196804047,
        -0.030054008588194847,
        -0.06409838050603867,
        -0.09232093393802643,
        -0.026950621977448463,
        0.11506004631519318,
        0.07236490398645401,
        -0.01637461595237255,
        -0.024118700996041298,
        -0.03332046419382095,
        -0.028163766488432884,
        -0.0010848494712263346,
        0.04594757407903671,
        -0.08673613518476486,
        0.0982857421040535,
        0.08448541164398193,
        -0.09695751965045929,
        -0.004508710466325283,
        0.002172898268327117,
        0.0002014493802562356,
        0.0004155402712058276,
        -0.01136896200478077,
        0.03148763254284859,
        -0.09137723594903946,
        1.684163633530716e-33,
        -0.043547097593545914,
        0.0568084754049778,
        -0.07852740585803986,
        -0.018243039026856422,
        0.007242353167384863,
        -0.05010171979665756,
        -0.05777634680271149,
        0.008631832897663116,
        -0.031126458197832108,
        0.039781611412763596,
        -0.12386993318796158,
        0.05428251251578331,
        -0.06338967382907867,
        0.03793343901634216,
        0.010311626829206944,
        -0.09441112726926804,
        -0.03402497246861458,
        0.012648317031562328,
        -0.0005652803811244667,
        0.03424827381968498,
        0.011053074151277542,
        0.0026099674869328737,
        0.02843235805630684,
        0.03608362376689911,
        0.11282496154308319,
        -0.01400923915207386,
        -0.010791550390422344,
        -0.0254201777279377,
        0.10875016450881958,
        0.035261981189250946,
        -0.10631761699914932,
        -0.036254800856113434,
        0.04176277667284012,
        -0.056031011044979095,
        -0.005249422043561935,
        0.010697475634515285,
        -0.09165806323289871,
        -0.017497573047876358,
        0.023845748975872993,
        -0.06727129966020584,
        -0.023382017388939857,
        -0.01131022721529007,
        -0.05877548083662987,
        -0.026016749441623688,
        0.030536120757460594,
        0.005776415579020977,
        0.01292905118316412,
        0.030523130670189857,
        0.04548465088009834,
        -0.06147171929478645,
        -0.07283559441566467,
        0.029082924127578735,
        -0.07353786379098892,
        0.0025544629897922277,
        0.056359946727752686,
        -0.07912823557853699,
        0.007343948353081942,
        0.01003158837556839,
        0.034726426005363464,
        -0.005271354224532843,
        0.04502958059310913,
        0.07286152243614197,
        0.00600564805790782,
        -0.07916814088821411,
        -0.07797437161207199,
        0.0533326230943203,
        0.04372967407107353,
        0.040324363857507706,
        -0.06266290694475174,
        -0.03955160081386566,
        -0.01688246987760067,
        0.030956175178289413,
        0.0045961965806782246,
        -0.03278211131691933,
        -0.02529047429561615,
        0.022276824340224266,
        0.017377512529492378,
        0.022180475294589996,
        0.06933782249689102,
        0.0005657463916577399,
        -0.0169011652469635,
        0.059822503477334976,
        -0.015298774465918541,
        0.01872440055012703,
        0.03661526367068291,
        -0.028769798576831818,
        0.017658688127994537,
        -0.0413823202252388,
        -0.06457457691431046,
        0.05151355266571045,
        0.03206901252269745,
        0.05292264372110367,
        -0.04767504334449768,
        -0.024831729009747505,
        -0.050440747290849686,
        -3.810511874984298e-33,
        -0.11254607886075974,
        -0.0126927075907588,
        -0.0157148540019989,
        0.012283914722502232,
        0.023632053285837173,
        0.014556530863046646,
        0.08605410158634186,
        -0.017603430896997452,
        0.025303177535533905,
        -0.06794662028551102,
        -0.008987672626972198,
        0.004573713056743145,
        -0.11660046130418777,
        -0.010845947079360485,
        0.022280126810073853,
        -0.09811098128557205,
        0.03359820693731308,
        0.004701063968241215,
        0.03200165927410126,
        -0.06429721415042877,
        0.03836063668131828,
        -0.005851192399859428,
        -0.016379857435822487,
        0.04467204213142395,
        -0.09001915156841278,
        0.020191233605146408,
        0.00488625094294548,
        -0.0024147420190274715,
        0.02674240991473198,
        0.02264586091041565,
        0.026862289756536484,
        0.05193878337740898,
        -0.08528167754411697,
        -0.04327396675944328,
        0.09124906361103058,
        -0.01120689045637846,
        0.021961497142910957,
        0.08175428956747055,
        0.01325198169797659,
        -0.11467479914426804,
        0.013987804763019085,
        -0.016944603994488716,
        0.022114573046565056,
        -0.012955042533576488,
        0.05070098116993904,
        -0.07067009806632996,
        -0.10917674005031586,
        -0.008434672839939594,
        -0.05219947546720505,
        0.029502982273697853,
        0.029343772679567337,
        0.027395345270633698,
        0.03559468686580658,
        -0.0822066068649292,
        -0.06965496391057968,
        -0.043845199048519135,
        -0.0339525081217289,
        -0.01476287841796875,
        -0.0349363274872303,
        0.006105016451328993,
        -0.0085003562271595,
        -0.059557657688856125,
        -0.021942803636193275,
        0.03574976325035095,
        -0.03784080222249031,
        0.012915834784507751,
        0.05538385733962059,
        0.042285509407520294,
        0.008279241621494293,
        0.02251717820763588,
        0.03580458462238312,
        -0.018745848909020424,
        -0.015522596426308155,
        -0.0699511468410492,
        -0.00645914813503623,
        0.0795818343758583,
        -0.04572829604148865,
        -0.01830259896814823,
        0.029941396787762642,
        -0.035211436450481415,
        -0.04864327237010002,
        0.10514620691537857,
        0.03362297639250755,
        0.0026962128467857838,
        0.06927156448364258,
        0.05211351811885834,
        0.03238974139094353,
        -0.0070576719008386135,
        -0.017481502145528793,
        0.054963383823633194,
        0.022016379982233047,
        0.03365074098110199,
        -0.05186201632022858,
        0.11043822765350342,
        0.04359491169452667,
        -5.729820173883127e-08,
        0.004792863503098488,
        0.04105755686759949,
        0.08201496303081512,
        -0.0803145244717598,
        -0.004886674229055643,
        -0.07673127949237823,
        0.02535158395767212,
        -0.03147821128368378,
        0.03534930199384689,
        -0.01613721437752247,
        0.05007937550544739,
        0.008879169821739197,
        -0.09720203280448914,
        0.0155692920088768,
        0.09140206128358841,
        0.06177026778459549,
        -0.07368913292884827,
        0.08748570084571838,
        -0.034224800765514374,
        -0.10823500901460648,
        -0.012466322630643845,
        0.08292728662490845,
        0.013977196998894215,
        -0.05431794375181198,
        0.020318470895290375,
        -0.02629135549068451,
        0.07517172396183014,
        0.05324552208185196,
        0.09851835668087006,
        -0.022993968799710274,
        -0.04674207419157028,
        -0.005509591195732355,
        -0.06397165358066559,
        -0.011358640156686306,
        -0.006311723962426186,
        -0.08981121331453323,
        -0.013111908920109272,
        0.11231934279203415,
        0.0034547164104878902,
        0.04893862456083298,
        -0.052924565970897675,
        -0.07550567388534546,
        0.04470779001712799,
        0.014554270543158054,
        -0.028837991878390312,
        -0.04206583648920059,
        0.07623174041509628,
        0.017178043723106384,
        -0.01279155258089304,
        0.07455023378133774,
        -0.07227685302495956,
        0.022617267444729805,
        0.019450530409812927,
        -0.036260079592466354,
        -0.011776970699429512,
        -0.005104678682982922,
        -0.02387774921953678,
        0.029870225116610527,
        -0.056903108954429626,
        0.032506685703992844,
        -0.06910137087106705,
        -0.11402831226587296,
        0.027497485280036926,
        0.14419347047805786
    ]
}