{
    "id": "_qHqox5GbeM",
    "title": "Is DKOldies REALLY a Scam?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2023-03-18T15:02:20Z",
    "video_url": "https://www.youtube.com/watch?v=_qHqox5GbeM",
    "category": "Science & Technology",
    "tags": [
        "dkoldies",
        "dk oldies",
        "console",
        "game console",
        "scam",
        "ps3",
        "xbox",
        "xbox 360",
        "playstation",
        "playstation 3",
        "ps3 super slim",
        "super slim",
        "playstation 3 super slim",
        "game boy",
        "game boy color",
        "dreamcast",
        "sega",
        "nintendo",
        "sony",
        "microsoft",
        "retro",
        "unboxing",
        "tech",
        "austin",
        "austin evans",
        "this is",
        "denki"
    ],
    "views": 3986434,
    "likes": 81880,
    "comments_count": 6405,
    "description": "on @thisis   on @Denki   Subscribe for more!  TikTok:  Instagram:  Twitter:   Chapter Titles: 0:00 What is DKOldies? 1:55 \"Refurbished\" 2:39 Unboxing Dreamcast & Wii 4:34 Unboxing GameCube & PS3 6:00 Unboxing Xbox 360 & Game Boy Color 7:33 Testing Xbox 360 8:32 Testing PS3 9:03 Testing Wii & GameCube 10:10 Testing Game Boy & Dreamcast  11:19 Xbox 360 Teardown 14:38 PS3 Teardown 18:14 Is DKOldies a Scam?",
    "description_links": [
        "https://www.youtube.com/watch?v=rGQHdBUa4pE",
        "https://www.youtube.com/watch?v=f8F-9At8PpE",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- This is every single console from DKOldies, but why did I buy this? So there's one video by MoistCr1TiKaL that people have sent me so many times, so let's find out what DKOldies is all about. - I've been hearing a lot about a company called DKOldies. So they sell old consoles, old games, just anything and everything related to old school gaming. And over the last week or so, they've been getting dunked on, everyone's been calling them a scam. Now, I didn't know a whole lot about this situation until recently. - This feels very meta. I'm watching a video from Charlie where he's like, \"I don't know anything about this. I just learned about it.\" Now I'm watching his video where he just learned about the thing. (Austin laughing) - DKOldies' prices are significantly higher than pretty much anyone else in the market, but after learning more about the situation, they make claims saying that they refurbish their console that they're- - Ah, refurbished, okay. That is the keyword here, calling it refurbished. And this is not just a DKOldies thing, right? I've purchased GameStop refurbished consoles that showed up instead being pre-owned, which meant that they were filthy, disgusting. I remember there was an Xbox that was literally just caked in dirt before. So if DKOldies is doing this, that's not great. I made fun of GameStop for doing it. I made fun of Walmart for doing it. Obviously, I've had problems like Wish and everything like that, but that is kind of what everyone does. I think it's worth kind of considering that context. It doesn't make it right, but it also doesn't single out DKOldies. At least that's my first impression. Okay, maybe we should go to the DKOldies website. \"DKOldies Retro Game Store. Shop all of our vintage 100% authentic products with a free one-year warranty.\" A free one-year warranty, actually a pretty big deal. Almost all of these kind of things that I have purchased in the past come with basically no warranty, maybe return policy of a week or two or a month or something, but having warranty, that is worth something, especially when it comes to old consoles that even if they are in pretty good shape when you get them and a lot of things this can be 15, 20, 30 years old, having a warranty is a big deal. There's actually, they do have a video on how they refurbish consoles. I'm curious about this. - Every day, tons of new collections get sold to us here at DKOldies. Let's take a look at this one for example and let's check out everything that has to happen to this Wii before we can list it for sale and it finds a new home. - Okay, how do they refurbish the Wii? - First, it gets picked up by our testing department and it gets thoroughly checked out to see if there's anything that needs to be repaired. - Okay, they check it out, makes sense. - In this case, the Wii isn't reading disks, so it's going to need to head to our repairs department to get a new laser installed. - It's one thing to show me how you should be refurbishing consoles. If they do what they do in this video every time, wonderful, two thumbs up. It's another though to actually deliver. And clearly the internet has found a number of times in which this process was not followed. So let's find out, shall we? So when we started working on this video, the site was down after that MoistCr1TiKaL video, and in fact, we had a lot of problems. So when the site finally came back up and was accepting orders, almost none of the actual consoles were available so we actually found all of these via Googling it and then finding the links that way, which it did actually allow us to add to cart. Now, one thing I will say, I did not order these. My name is not on this packaging, right? - No. - Dude, I'm so nervous now. What if they actually did figure out it was us or figured out it was a YouTuber and like Googled the name and like made sure it was a good one? Because we ordered a lot of consoles in one order. I'm getting all paranoid now. I'm getting paranoid. Okay, I feel something. An old school GameCube controller, not a first party controller, but a new one in the box. What else is in here? So this is a Dreamcast, hmm. Not in bad condition. This is actually where the sniff test makes sense. I think this is an actual like properly cleaned console. Value on this $165. Even if this is fully perfect, without actually turning it on yet, it does look quite clean, like honestly much cleaner than the average console you find, but $165 is a lot for Dreamcast. This is Wii, all right. Again, I will say this has been cleaned. Now, it's got some damage. Like there's the rubber foot's a little sort of chunked off there, but just you can feel that it's not dirty. You feel it, but feel it though, right? That that feels like it's clearly been like they they gave it a once over. - Yes. - I mean, like a lot of the complaints are mainly about what the inside of it is, so that's, we'll see. - I mean see a copy of Super Mario Sunshine. So this actually came with the GameCube bundle. It actually does come with the instruction manual, cool. And we've got the disk which, ooh, is quite scuffed on the top, actually, wow, how would you scuffle that much on the top? Looks okay on the bottom though. All right, all right, all right, we got a big boy here. Is this the GameCube? It is the GameCube. All right. If you buy a black GameCube, it's going to be a little scuffed and this one I would say is probably in the worst condition of them all. Although, again, you could just feel it. It's in relatively good sort of like clean condition. It's got some damage, it's got some scuffs, but this is all cosmetic stuff. None of it is worse than the average GameCube, I would say. Well, actually, I will say one thing, the handle is loose. (handle gently banging) Hear that? That's the handle. So maybe was just put together a little bit incorrectly or something. I got a big one. This is the PS3, I believe. Oh boy, this is gonna be a good tell if they've actually properly done a good job because these PS3s look gross very quickly. Whew, they cleaned it all right. It smells strongly with chemicals. So unlike some of these consoles, like the Dreamcast I think actually cleaned up pretty well. This looks terrible. Part of this is just down to the fact that these PS3 Super Slims, you can't really clean them. It's that glossy like piano black. I understand that they were trying to clean this up. I would actually say that this is in by far the worst condition, mostly just because of the design of the console. Once you start to like really hit it with anything abrasive and you know most cleaning chemicals and stuff, it is going to start really wrecking this finish. Also, that... I haven't used a Super Slim in a couple years, but like the door shouldn't be be that bad. Look at that, (door clicking) it doesn't, keep sticking. What the? What is this big? I didn't recognize, this is an OG Xbox 360. It was so fat with all of the wrapper, I actually didn't recognize it. Cosmetically this is great, but at this kind of price, it had better be because keep in mind, this is the OG 360. This does not have wifi, so you either need to plug it in via ethernet or buy one of the USB dongles, and at $180 for one controller, that's like double what you should actually be able to buy one of these for. Mind you, it does have the warranty, which is worth something, and it also is cosmetically in good shape, but that is an enormous amount of money for a very old console. This is 15 years old. Ah, the Game Boy, okay, how much, before I open that, how much did we pay for the Game Boy? Oh my god, did we actually? $150 for a Game Boy Color Grape. Good lord, I don't know, maybe like 10 years or so ago, I used to go to my video game shop, they sold Game Boy and Game Boy Colors for five bucks each and they were all in pretty good shape. It's the fact that this is $150, bro. So I appreciate the fact that this definitely has new screen. They didn't take off the screen protector so we'll should peel that off here. Battery door is intact. I will say the contacts are clean. Oftentimes you'll see on these Game Boys that things have been corroded after battery's been left in for a while. All right, I think that's it. Boy, that's satisfying. All right, so first off, let's try the Xbox 360. Fire it up and see. There's no click to that button. Okay, everyone be very quiet. Listened to the lack of click on this button. There's really nothing to that. Let's try the actual eject button. Totally. Okay, what is that? Come around here. Did that come off? Look, it's like grease. Do you see that? - [Joanna] No, thank you. - That's like straight grease. No, they didn't clean this at all. Look, there's literal dust. Can you see this right here? There's literal dust caked up inside. All right. (disk drive chirping) Is that Morse code? That disk drive does not sound good. I mean it's clearly functioning so it can't be that bad, but I don't think I've ever heard a 360 sound like that. - [Joanna] Stream now on HBO Max. - Wow, what a terrific game to play on the Super Slim PS3. This I already know has a problem. This does not work very well. Although you know now that I say that, this is better than it was yesterday when I tried it. It's actually kind of works now. I wonder if it needed to be worked in 'cause it actually is now functioning. Okay, cool, magically fixing stuff overnight, wonderful. Okay, I don't wanna play the rest of \"Last of Us\" right now, but PS3 seems functional. - Two- - Widescreen Wii. - I'm wide, I'm the big Wii. (crew grunting) - [Crew] No, no. (Austin evil laughing) - I think it's pretty safe to say gameplay functional. The disk drive is not making any kind of weird noises. From the outside, this seems completely fine. Next up we have the GameCube. Did you realize this is a Japanese GameCube? - [Music] Yo! - JPN. Everything's Japanese. All right, this seems to be totally fine. What I'm curious about though, this is a United States region game running in a Japanese GameCube, which to me means one of two things. Either they modded this, which if they did, I would assume that you know, if you had a toggle or something that they would wanna advertise that, or potentially they took an American GameCube and they just put a Japanese shell on it, which is super interesting. It also might explain why the handle is so loose. It's been opened up in the past. Hmm, okay. Next we have the Game Boy Color. Now to be fair, this is a new screen. This is not a upgraded screen, which I will say for the amount of money that we spent on this, we probably should have gotten one that was like, had like a backlight or whatever. A lot of people mod these. So for context, my buddy Jake, he sells Game Boys, he mods them and look like you can get here, right? So Jake will sell you a $200 Game Boy, so a little bit more than this, but it has a custom-printed shell, all brand new stuff, including an IPS display, which I can guarantee you will look a million times better than what you've got with this. So the great thing about ordering a console-only bundle is that you have to provide all of your own accessories and we didn't have a Dreamcast AV cable, so couple days later it's in. So let's try it, shall we? So this is our controller, right? Since it didn't come with any accessories. These used to be the same color. That's white. This is beige and mm, not good. - [Game Voice] Come on over and have some fun with Crazy Taxi. - Luckily this is a profession that will never go anywhere and could never be replaced by an app on my phone. Oh yeah, Dreamcast works. All right, first up we have the Xbox 360. I actually had one of these that I did a video on back in like 2009 because it red ringed, but instead of fixing it, I did the towel trick, which is to suffocate it until the solder reflows and it works for five seconds until it stopped. That's the extent of my knowledge of opening up the 360, so we'll see how this goes. All right, we're going to carefully remove our warranty void sticker, which I will say was never stuck down to begin with. I'm mostly curious about this one. The power button doesn't do anything. So there's your your problem. This is supposed to be attached to both sides. This is just not attached. That's broken here. So that's why the click does not actually not work. That's immediately strike one. Xbox sticker here. What is this Xbox sticker? Hmm, you see that? It's like a weird paper sticker. This could have actually been opened and repaired before DKOldies even got their hands on it, which doesn't absolve them of anything, but I'm kind of curious like with something that's this age and still functioning, it's not outside the realm of possibility that it has been opened multiple times over the years. Oh, ooh, interesting. Okay, well, I've immediately seen something. There's like a piece of like tape or something here to hold the disk drive in and it has clearly been cut. There's like plastic that's just broken. Like I wasn't even anywhere near that. That's broken. What the? What is going on here? This isn't dust, it's grease. You can see my finger. Like it's literally, it's not dust, it's like actual grease. Like, so this is the same kind of stuff that was sitting in the disk drive. This is supposed to be a refurbished console. Come on out. There we go. Now I will say one thing, that's pretty clean, like in fact impressively clean considering, and the warranty seal is still on it for the actual disk drive. So my next question is, is there new thermal paste? That's the only other thing I can think of that could be a potential problem. Let's go ahead and crack open this heat sink and see what we find underneath. Now this is the point where no one should really ever do this. Opening up to this point is not like massively difficult. Taking off the thermal paste and the actual like heat sink is a bad idea. There we go. Fans are loose-ish. Actually, there's a little dust on the backside of the fans. Actually, yeah, you know what, wait a minute. There's dust on the backside of the fans and this is the side that you can actually get access to from the outside. Like this is the part if, I owned a 360, that I can actually keep clean myself without tearing the whole thing apart. Okay, so this is classic heat sink (censored). Come out. There you go. So there you go, that's what 15-year-old thermal paste looks like. It's now thermal goop. Cool. All right. Aah! Oh, that's worse Dude, I could just touch that. Like it is not dried out, but that's pretty, it feels like rubber. For the amount of money that I paid for this console, I would expect someone to have gone all the way down to the CPU like I'm doing right now, clean off this rubber. Oh my god, dude, that is like, I mean that is almost not even coming off. That is ridiculous. But I would've expected someone to fully have cleaned this off, repasted it and put it back together. Otherwise, while, yes, it's nice to have an exterior clean, it's not the same thing as actually having like a proper console that's gonna be good for years to come. All righty, friends, next up we have the PS3 Super Slim. Does the door work today? 'Cause it didn't work last time we used it. Yep. I can't believe the door just fixed itself. That makes me so mad. Oh, okay, well here's something interesting. I actually did not notice this when I did the unboxing. Clearly this has been opened up in the past because you can see there's like chunks of the plastic missing here, here, and especially here. Whoever did that was clearly not doing it right because it pops up from the bottom, not from the top. Oh! All right, I've seen a problem. Look at the dust! Okay, so I think it's kind of safe-ish to say immediately that they did not open this up. That is gross. Look, there's literally like dust bunnies in here. Like, and just to be clear, every single console, this one included, that we purchased from DKOldies, was labeled as refurbished. And while the 360 was actually opened up and cleaned, I feel pretty confident in that, this PS3 was absolutely not. There's just, look, look, look, look at this, look at this. There's literally just caked-on. - Oh! - Ew. - This looks refurbished, right? So I now understand why the door was sticking. There is a broken little piece of black plastic that is just floating in here. So as I move it, you see all these little like gears. See it sticking? It just sucked it in, great. There it goes, never to be seen again. I can't completely blame DKOldies 'cause it's a terrible design, but at least it explains why it is the case. If it looks this gross just under the plastic bezel, which I don't think gets that much airflow or anything, imagine what this thing's gonna look like on the inside. Aah! Aah! It's like sticky on it. Look! Look at how much is caked on here, around here, over here on the intake. It's all caked on, on the inside too. Me opening it up, I think that little piece of plastic that was jamming it up is actually now gone 'cause it works again. I fixed it. (air spritzing) Oh! (Austin coughing) (bottle spraying) - [Ken] Wait, that's not okay. - I'm blowing the dust away. Remember, this was $240, you know, like what it cost brand new 10 years ago. All right, let's, ugh! What's all this? Ew! Ew! Aah! Okay, I think I understand more now. It's dusty and it got wet at some point. Do you see all these like streaks? This is from like wet goo or whatever that was inside the system. Look, it's all caked around the USB ports. Look, there's actually like rust here. There's literally rust on the bottom of this PS3. Oh my god. It's literally rusting! What the! What! The bottom of the PS3 must have been wet at some point because it came in through the top and through the bottom. The bottom was much worse where it's actually rusting, but the top still has all this stuff. So this thing was dirty and disgusting and then got slightly submerged or was around a butt load of humidity. If they would've done their research, they would've known that this thing is in absolutely like gross condition. Oh. Aah. Oh my goodness. It's everywhere. It's literally coated. Look at this bottom edge. Look how as nasty it is. See. Let's go over the couch. I have some thoughts. I wanna be fair here because everyone is piling on to DKOldies right now. If anyone from DKOldies is watching this video, may I offer a suggestion? If you are going to charge premium prices for a \"refurbished\" good condition console, maybe actually refurbishing. Clean them up, replace the thermal paste, make sure that they are just a solid on the inside as that you can do a pretty good job making them on the outside. I will say the best part of DKOldies for the unboxing in the first experience is that these consoles actually look good, which most used consoles don't. Some do, but a lot of them are in pretty rough condition. There's clearly some care and love that goes into the exteriors of these consoles, the problem though is what lurks inside, and until that is addressed, there is no way I could recommend anyone to buy from DKOldies. Thank you very much for watching. Make sure to subscribe to the channel if you enjoyed and definitely be sure to stay tuned. It's not the last time we're taking a look at some very sus consoles. (light upbeat music fades)",
    "transcript_keywords": [
        "Game Boy",
        "Game Boy Color",
        "Game",
        "DKOldies",
        "consoles",
        "boy",
        "console",
        "good",
        "thing",
        "Game Boys",
        "clean",
        "pretty",
        "video",
        "GameCube",
        "lot",
        "DKOldies Retro Game",
        "Wii",
        "Super Slim",
        "kind",
        "dust"
    ],
    "transcript_entity_values": [
        "15",
        "15 years old",
        "Wii",
        "Jake",
        "million",
        "Wii",
        "Ken] Wait",
        "a Super Slim",
        "DKOldies",
        "Wii",
        "so couple days later",
        "Super Mario Sunshine",
        "Walmart",
        "first",
        "Last of Us",
        "the Super Slim PS3",
        "Game Boys",
        "USB",
        "OG Xbox 360",
        "five seconds",
        "Austin",
        "DKOldies Retro Game Store",
        "yesterday",
        "GameCube",
        "two",
        "GameStop",
        "165",
        "150",
        "HBO Max",
        "Xbox",
        "one-year",
        "2009",
        "a couple years",
        "overnight",
        "the years",
        "one",
        "10 years ago",
        "Everything's Japanese",
        "Game Boy and Game Boy Colors",
        "years",
        "the last week",
        "PS3",
        "200",
        "Dreamcast AV",
        "Charlie",
        "Dreamcast",
        "Joanna",
        "two or a month",
        "United States",
        "YouTuber",
        "a week",
        "180",
        "five bucks",
        "15-year-old",
        "30 years old",
        "PS3 Super Slims",
        "CPU",
        "our vintage 100%",
        "20",
        "Crazy Taxi",
        "a minute",
        "the PS3 Super Slim",
        "the Game Boy Color",
        "Morse",
        "American",
        "10 years or so ago",
        "Japanese",
        "today",
        "240"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "FAC",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "TIME",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "GPE",
        "NORP",
        "DATE",
        "MONEY",
        "MONEY",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PERCENT",
        "DATE",
        "FAC",
        "TIME",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "NORP",
        "DATE",
        "NORP",
        "DATE",
        "MONEY"
    ],
    "vector": [
        -0.07882119715213776,
        -0.045361120253801346,
        0.016098350286483765,
        -0.08515211194753647,
        0.043134380131959915,
        -0.049696505069732666,
        0.027714945375919342,
        0.02755211666226387,
        0.006415576674044132,
        0.045834656804800034,
        -0.04578723385930061,
        0.09696318209171295,
        -0.034198299050331116,
        -0.024322081357240677,
        0.021867850795388222,
        -0.017510462552309036,
        0.05628114566206932,
        -0.02368260733783245,
        -0.07703552395105362,
        -0.011483064852654934,
        -0.009498847648501396,
        -0.051081832498311996,
        -0.02664514258503914,
        -0.007178665604442358,
        0.005049016326665878,
        0.034460149705410004,
        -0.02421361766755581,
        0.024800514802336693,
        -0.07583834230899811,
        -0.028261803090572357,
        -0.020406534895300865,
        0.060415271669626236,
        -0.02226497419178486,
        -0.02870549075305462,
        0.09926598519086838,
        -0.036850545555353165,
        -0.037411339581012726,
        -0.010292395949363708,
        -0.12796346843242645,
        -0.02377164550125599,
        0.007186777424067259,
        -0.04490893334150314,
        -0.05554807931184769,
        0.03664250671863556,
        -0.04340289905667305,
        0.060132741928100586,
        -0.09913988411426544,
        -0.0018950783414766192,
        0.027809850871562958,
        -0.03125998377799988,
        -0.006705081090331078,
        -0.03363669291138649,
        0.15221987664699554,
        -0.030725516378879547,
        0.0034426411148160696,
        0.02298976667225361,
        -0.009183909744024277,
        0.06121976301074028,
        0.0811576172709465,
        -0.04127666354179382,
        0.0775395929813385,
        -0.0750950276851654,
        -0.011343350633978844,
        0.01079589780420065,
        0.0016481000930070877,
        -0.02606523223221302,
        -0.016134241595864296,
        0.030015628784894943,
        -0.0031073428690433502,
        -0.034115564078092575,
        0.05494215339422226,
        -0.028523245826363564,
        0.04927501827478409,
        0.03827203810214996,
        0.012804857455193996,
        0.04478771239519119,
        0.032755009829998016,
        -0.0515437088906765,
        0.0014461521059274673,
        -0.04871153086423874,
        0.06364265084266663,
        -0.0209007877856493,
        0.011083245277404785,
        -0.04658501595258713,
        -0.0717502012848854,
        0.07893118262290955,
        0.015795022249221802,
        -0.06651438027620316,
        -0.0009951961692422628,
        -0.013581043109297752,
        0.021914228796958923,
        -0.04798324778676033,
        0.05906379967927933,
        0.020472627133131027,
        -0.023077525198459625,
        -0.023999135941267014,
        0.021588262170553207,
        -0.014648296870291233,
        -0.012435054406523705,
        0.024155177175998688,
        -0.005317086353898048,
        0.019345268607139587,
        0.054595477879047394,
        -0.07476644217967987,
        -0.005483864340931177,
        -0.06427360326051712,
        -0.0997362807393074,
        -0.0023072788026183844,
        0.03237683326005936,
        0.06231294199824333,
        -0.0749378502368927,
        -0.011609207838773727,
        -0.010868343524634838,
        0.07974236458539963,
        0.01786879263818264,
        0.00010478643525857478,
        -0.052216146141290665,
        0.03027467057108879,
        0.01857215166091919,
        -0.047786906361579895,
        0.12823355197906494,
        0.010334418155252934,
        0.023176871240139008,
        -0.003741865511983633,
        0.02379659377038479,
        -0.010094823315739632,
        0.019896481186151505,
        8.018587694360201e-33,
        0.02468034252524376,
        0.06474901735782623,
        -0.05107324197888374,
        -0.027826985344290733,
        -0.015889441594481468,
        -0.07294543832540512,
        0.04722210764884949,
        0.08568158745765686,
        -0.06629086285829544,
        0.11115490645170212,
        -0.0953814759850502,
        0.10806745290756226,
        -0.0385897196829319,
        0.0662255510687828,
        -0.026837458834052086,
        0.02683820202946663,
        0.00923850480467081,
        0.010390613228082657,
        -0.0015333390329033136,
        0.06582140922546387,
        0.08274337649345398,
        0.0534994974732399,
        -0.001338191912509501,
        -0.015324536710977554,
        -0.026595717296004295,
        -0.015210265293717384,
        -0.1006130799651146,
        0.0294061079621315,
        0.1230916827917099,
        0.03264617174863815,
        -0.09839684516191483,
        -0.07346387207508087,
        0.007353548891842365,
        0.003900952637195587,
        0.0031922010239213705,
        0.021597035229206085,
        0.002828768687322736,
        -0.11148612201213837,
        -0.030790410935878754,
        0.040117744356393814,
        -0.022632300853729248,
        -0.06944708526134491,
        -0.11719559133052826,
        -0.006140450015664101,
        0.010941589251160622,
        0.04549257829785347,
        0.015647904947400093,
        -0.1049453541636467,
        -0.08768650144338608,
        0.04979511350393295,
        -0.04274197295308113,
        -0.001880978001281619,
        -0.0055171106941998005,
        -0.019340503960847855,
        -0.03684001415967941,
        -0.057277899235486984,
        0.03193563595414162,
        -0.06108016520738602,
        0.10503840446472168,
        0.03645223751664162,
        0.0191287063062191,
        -0.031224476173520088,
        0.015136448666453362,
        -0.027296431362628937,
        -0.06706944108009338,
        0.005643946584314108,
        0.11683531850576401,
        0.016558384522795677,
        -0.07192147523164749,
        -0.05772298946976662,
        0.019463354721665382,
        -0.009053096175193787,
        -0.031361013650894165,
        -0.032856300473213196,
        0.09053996950387955,
        -0.03186846524477005,
        -0.01872636377811432,
        0.10730937868356705,
        0.05995604768395424,
        -0.014393316581845284,
        0.08704233914613724,
        0.009106386452913284,
        -0.037135470658540726,
        0.04077700152993202,
        0.028277350589632988,
        0.05019635707139969,
        -0.02614489011466503,
        -0.008074265904724598,
        -0.032349325716495514,
        -0.013587914407253265,
        -0.10745204240083694,
        -0.06626608222723007,
        -0.010150283575057983,
        0.06749524176120758,
        0.09360946714878082,
        -9.566995873037351e-33,
        -0.06733541935682297,
        0.02071976847946644,
        -0.060634758323431015,
        0.062064819037914276,
        0.034305088222026825,
        0.009167574346065521,
        -0.07460834085941315,
        0.05238676443696022,
        0.03628963604569435,
        -0.046618781983852386,
        -0.002272171899676323,
        -0.030543968081474304,
        -0.03774469718337059,
        0.002760929986834526,
        -0.014857021160423756,
        -0.020571760833263397,
        0.017097940668463707,
        -0.027025260031223297,
        -0.01951662078499794,
        -0.07884787768125534,
        0.08068229258060455,
        0.025667646899819374,
        -0.04857708141207695,
        -0.005934898741543293,
        -0.04633425921201706,
        0.009439187124371529,
        0.029964763671159744,
        -0.014377019368112087,
        0.0014391385484486818,
        0.06295304745435715,
        0.043275970965623856,
        0.05127432942390442,
        0.015028133057057858,
        0.09795796126127243,
        0.006723438855260611,
        0.020989935845136642,
        0.034313298761844635,
        -0.0023076024372130632,
        -0.033890802413225174,
        -0.0645112544298172,
        0.0024949973449110985,
        0.02841881848871708,
        -0.02128937840461731,
        -0.030885830521583557,
        -0.02213272638618946,
        -0.02961692027747631,
        -0.013737532310187817,
        -0.028361598029732704,
        0.19370169937610626,
        0.014643339440226555,
        0.016448842361569405,
        0.03246504068374634,
        0.05729851499199867,
        -0.005988813005387783,
        -0.11100870370864868,
        0.02664019539952278,
        -0.014238839037716389,
        0.08745981752872467,
        -0.0031661393586546183,
        0.09234634041786194,
        0.02930523455142975,
        -0.02441210113465786,
        -0.01643756777048111,
        0.02915262244641781,
        0.006114964373409748,
        0.018860267475247383,
        0.1053413525223732,
        -0.010487510822713375,
        0.0034357402473688126,
        -0.0920572578907013,
        0.005824356339871883,
        -0.05140211805701256,
        -0.01824754662811756,
        0.007515168748795986,
        -0.02897137589752674,
        -0.035907283425331116,
        -0.05664021521806717,
        0.01174850668758154,
        0.03674269840121269,
        0.011043923906981945,
        -0.004479893483221531,
        -0.024180585518479347,
        0.05857216194272041,
        0.0889577716588974,
        0.0220271535217762,
        -0.06090344861149788,
        0.04635871201753616,
        -0.05392647162079811,
        -0.051245056092739105,
        -0.04117423668503761,
        0.042270127683877945,
        -0.010068843141198158,
        -0.06680351495742798,
        0.13233499228954315,
        0.07081501930952072,
        -5.003269620829087e-08,
        0.11930188536643982,
        0.009853119030594826,
        -0.012296276167035103,
        0.04262813180685043,
        0.016151871532201767,
        -0.10097438842058182,
        0.03976810351014137,
        0.10875130444765091,
        -0.042704060673713684,
        0.029082413762807846,
        -0.005625823978334665,
        0.006280906032770872,
        -0.10981329530477524,
        -0.021502235904335976,
        0.056695207953453064,
        0.026637816801667213,
        0.023264620453119278,
        0.01749962754547596,
        -0.017054028809070587,
        0.04795810207724571,
        0.07670854032039642,
        -0.015676574781537056,
        0.07419964671134949,
        -0.14326490461826324,
        -0.047170452773571014,
        -0.0170027706772089,
        0.0508216992020607,
        0.0039415075443685055,
        0.05438507720828056,
        -0.005796342622488737,
        -0.06425546109676361,
        0.00017857723287306726,
        -0.036249179393053055,
        0.0006802714196965098,
        0.032701630145311356,
        -0.08627776801586151,
        -0.05477152764797211,
        0.0017165503231808543,
        -0.0007370444945991039,
        -0.03100311942398548,
        -0.05528980493545532,
        -0.07342308014631271,
        -0.009773717261850834,
        0.03690671548247337,
        -0.04588903859257698,
        -0.0012030203361064196,
        -0.12278855592012405,
        -0.03126552328467369,
        0.014869577251374722,
        -0.04006515443325043,
        -0.042290154844522476,
        0.028274890035390854,
        -0.01498215552419424,
        0.009717774577438831,
        -0.01897243969142437,
        0.012194599956274033,
        -0.023860441520810127,
        0.03640153259038925,
        -0.017046693712472916,
        0.013897974975407124,
        -0.035080332309007645,
        -0.083584725856781,
        -0.02851729840040207,
        0.039587296545505524
    ]
}