{
    "id": "_RKYQdUUttc",
    "title": "Trying The Cheapest Keyboards on Amazon...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-10-27T16:18:46Z",
    "video_url": "https://www.youtube.com/watch?v=_RKYQdUUttc",
    "category": "Science & Technology",
    "tags": [
        "keyboard",
        "cheap keyboard",
        "best keyboard",
        "gaming keyboard",
        "budget keyboard",
        "best gaming keyboard",
        "pc gaming",
        "rgb",
        "gaming accessories for pc",
        "bluetooth keyboard",
        "amazon",
        "gaming",
        "gaming pc",
        "rgb keyboard",
        "austin evans"
    ],
    "views": 6262879,
    "likes": 105182,
    "comments_count": 5109,
    "description": "The cheapest keyboards available on Amazon: are they worth it? Updated version of the cheap RGB keyboard on Amazon:  Verbatim Slimline keyboard on Amazon:  JETech Bluetooth keyboard on Amazon:  AmazonBasics keyboard on Amazon:   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Check out our new channel!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://austin.tech/rgbkeyboard",
        "http://austin.tech/verbatimkeyboard",
        "http://austin.tech/jetechkeyboard",
        "http://austin.tech/amazonbasicskeyboard",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin and these are the cheapest keyboards on Amazon. But the question is, are they actually any good? So we take a look at a lot of expensive things on the channel, but what I was really curious about is whether it actually makes sense to go extremely cheap. What better way to start than with well, a bunch of keyboards of varying degrees of quality but all of which are actually really affordable. To start out with, we have the Verbatim Slimline Corded keyboard. When we purchased this, it was only $5.21 on Amazon but now it's available with a mouse for $10.21. So you know, quality. Not only do we have adjustable tilt legs, a stylish and slim design as well as advanced tactile keys. Something I look for in all of my five dollar keyboards but importantly, it supports Windows XP, 2000, Vista, 7 and 8. So if you need a sweet Windows XP keyboard, they've got you covered. There are tons of dedicated gaming keyboards, things like mechanical stuff, but I think really the question I want to answer with this video is, do you really need to spend 30, 40, 50, 60, or even a hundred dollars plus on a keyboard? Of course you don't have to but what's the real difference you're getting really something like this, which is only going to cost you about five dollars. Well, you get better packaging on the other ones. That's for sure. I'll give them this. This is about as slim as a keyboard gets. It's definitely one of the most lightweight keyboards I've ever used. (laughs) Shout out to the not a Windows key that's on the bottom here. It's not Windows, it's the square key. You know, the square key. At first glance, the layout seems to be fine. We have basically all the keys we would expect, including a slightly weird looking Enter key and a smaller Backspace. We also interestingly have power, sleep and wake. Does that actually work? Oh, it works. Wait, can I wake up? Wake up. I don't think anyone's going to think that this is a gaming keyboard, but it doesn't feel too bad, so one of the things I really noticed is that it is a little bit on the springer side and that's definitely because this is very much a rubber dome style keyboard, but I don't know, I can live with it. Is it going to last a long time? Probably not. Can you use it for a little while and actually be completely competent at gaming and a little bit of typing and basic use? Absolutely. Next up we have the Amazon Basics wired keyboard at a whopping $13.22. Now with something like 3600 reviews. It seems to be one of the more popular keyboards on Amazon full stop. What they've done here is it's a little bit more of a slimmer design, so it does have a sort of built in rest as opposed to the other one which did have the feet. It's also got a lot of glossy black plastic. Oh boy, all right. So yeah, that glossy black plastic, as you can probably see with three seconds of usage, it's going to get a little fingerprinty, a little dirty, but I guess you can look past that when you're spending 13 bucks on a keyboard. The layout thankfully is a lot nicer. We have a full size Backspace key. The Enter key, it's all as you would expect. We have a few things like Media keys, which is a nice little addition on such a cheap keyboard. Oh, we can get a little shortcut to the calculator. I guess that's useful and most importantly of all, we have an actual Windows key, not a weird square. I'm sure the licensing cost was tremendous on such a cheap keyboard. I can tell this immediately has a better feel. Now it is definitely still a membrane keyboard it's not going to be anywhere near as nice as something like a mechanical keyboard to type on, but it's a lot less mushy than the Verbatim and I really do appreciate that it does have a standard layout. We even have the media control keys. I will say almost immediately that while I do prefer this for typing, I actually don't quite like the feel for gaming. It just feels like there's maybe a little bit more latency or a little bit of input lag. It just feels a little different. And a big part of that actually could be the fact that the key switches aren't quite as responsive. That's a little weird. Next up we have a Bluetooth keyboard, or more specifically the cheapest Bluetooth keyboard with Amazon Prime that we could find. So at $15 this... Well, it's a lot smaller, I'll say that, it's a whole lot smaller. Wait is this actually a full size keyboard? Okay well that looks exactly like an Apple keyboard. It's really weird at how light it is though. We don't have a battery in, do we? No, we need a ... Is that AA you think? Oh wait, they're AAAs, I lied. Yeah, those are...be right back. One of the advantages of going with the Bluetooth keyboard is it does support multiple devices including Macs as well as iOS devices, which is especially evident when you look at the keyboard layout, which I just realized is the Mac layout with the Command and the Option and the Control. So, we do have a Windows key and a Windows mode if we switch over to it. If I can figure out how to do that. Due to a slight oversight in that the PC we're testing with doesn't have Bluetooth, we're going to use my phone. Oh boy I love being prepared for videos like this. (clears throat) Anyway, let's give this a try. So thankfully it is full size. One thing I do immediately notice though, is that it's kind of flimsy. If you look, I can barely bend it and there's a lot of flexing. It shouldn't be a big deal unless you're very aggressive typer. Are there aggressive typers? Oh yeah, dude look at that. If you really press down the whole thing flexes. It should be okay though but... No, I disconnected it. Why does... Okay, so maybe super cheap Bluetooth keyboards: not the move. I actually will say the keyboard doesn't feel too bad. Actually know what it feels like? It kind of feels like the original version of this Apple keyboard, which is like what, 80 bucks or something? It's not quite as nice to be fair. It's all made of plastic, but it doesn't feel bad at all. Look at that, I can change the brightness. What? That's actually kind of cool. For 15 bucks this isn't too bad. Yes, you should plan ahead and make sure your computer supports Bluetooth, but even if you are syncing it to something like your iPad or iPhone or something, this really is surprisingly decent for $15. I'm kind of impressed. Last but not least, we have the Rii RK100+. The cheapest RGB keyboard on Amazon, which we picked up for about $15. However right now it's actually available for $10 and seventy three cents. So yeah, this is actually the cheapest keyboard here technically as of this very second. This is another one of the options that we chose not only just because it was the cheapest, but also it has a fairly decent amount of reviews. It's got 492 on Amazon right now and that looks like a much more beefy keyboard even though it's still incredibly lightweight. Plug this guy in and holy RGB Batman. That is actually kind of a cool look. Now, unlike most RGB keyboards that do have a much more comprehensive set of software that kind of allow you to customize the zones with this guy, we can either turn on or turn it off, which conveniently replaces our right Windows key, but regardless we have RGB. So let's give this guy a try. All right yeah. This is actually a lot better than that Amazon keyboard. One of the things that I immediately noticed is that where that one felt a little bit sticky. The keys actually pop up a lot quicker here. Now I'm sure if you open it up it's still going to be a membrane keyboard, but between that and the RGB, I've got to say this is actually totally a decent looking keyboard. Now no, the key caps themselves aren't RGB and it is of course all made of plastic, but I kind of like the look of sort of illuminating the backside with the RGB as opposed to doing the individual keys. It's not customizable but it looks legitimately different than pretty much any other gaming keyboard out there. Something I immediately noticed is that there's a nice little bit of texture on the keys themselves. It doesn't make a big difference, but it does give you a little bit more grip with your fingers. It's not something huge or anything that sort of blows me away, but it is a nice little bit of an addition. Importantly, it feels good for gaming. It is not as good as a mechanical keyboard for example, but realistically, unless you're actually really skilled unlike me, it's probably not going to notice a huge difference. I know I'm not any better with this than a Mechanical keyboard or vice versa. Here we go. Yeah, there we go. Well that was worth it. (laughs) So should you buy the cheapest keyboard on Amazon? It's actually not a totally crazy idea. Now the Rii is definitely my favorite. I like the RGB for gaming, it has a good feel and it's got a decent layout and realistically if you're spending less than say $30, $40, this really should be the keyboard you pick up. I'm very, very impressed.",
    "transcript_keywords": [
        "keyboard",
        "Windows key",
        "Amazon",
        "Windows",
        "key",
        "RGB",
        "Bluetooth keyboard",
        "keyboards",
        "bit",
        "lot",
        "keys",
        "Bluetooth",
        "Slimline Corded keyboard",
        "Austin",
        "mechanical keyboard",
        "gaming",
        "feel",
        "kind",
        "Verbatim Slimline Corded",
        "cheapest RGB keyboard"
    ],
    "transcript_entity_values": [
        "the Amazon Basics",
        "13 bucks",
        "3600",
        "iPhone",
        "2000",
        "three seconds",
        "10",
        "the Rii RK100+",
        "about $15",
        "iPad",
        "Mechanical",
        "first",
        "492",
        "Amazon",
        "50",
        "five dollar",
        "15 bucks",
        "Austin",
        "40",
        "60",
        "a hundred dollars",
        "Backspace",
        "RGB",
        "30",
        "30",
        "Windows",
        "Apple",
        "40",
        "Command",
        "8",
        "Windows XP",
        "Bluetooth",
        "second",
        "about five dollars",
        "13.22",
        "Vista",
        "Macs",
        "Rii",
        "Mac",
        "7",
        "One",
        "80 bucks",
        "only $5.21",
        "15",
        "XP",
        "10.21"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME",
        "MONEY",
        "EVENT",
        "MONEY",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "MONEY",
        "PERSON",
        "DATE",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "MONEY",
        "PRODUCT",
        "MONEY"
    ],
    "vector": [
        -0.044347260147333145,
        -0.13658824563026428,
        0.07101397961378098,
        -0.014599747024476528,
        -0.04145760461688042,
        0.033242516219615936,
        0.0030416552908718586,
        0.08637424558401108,
        0.04397837445139885,
        0.08608819544315338,
        0.02645105868577957,
        0.07903999090194702,
        0.06818228214979172,
        -0.0276374202221632,
        -0.005809078458696604,
        -0.016929665580391884,
        0.04161131754517555,
        -0.049741681665182114,
        -0.07785360515117645,
        -0.01915856823325157,
        -0.05755835771560669,
        -0.021803995594382286,
        0.005766476970165968,
        0.007147250697016716,
        0.022880399599671364,
        0.006886912975460291,
        -0.0018927924102172256,
        -0.005790284834802151,
        0.007199912331998348,
        -0.03913291171193123,
        -0.0848826989531517,
        0.026997361332178116,
        0.005068632774055004,
        -0.05290062353014946,
        -0.014026174321770668,
        -0.05299985036253929,
        0.12309178709983826,
        -0.030847759917378426,
        -0.11163223534822464,
        -0.007618987467139959,
        -0.02595551684498787,
        -0.04184383153915405,
        0.019303377717733383,
        0.07616037130355835,
        0.040022771805524826,
        0.009278510697185993,
        0.010179433040320873,
        -0.020716048777103424,
        -0.03965212404727936,
        0.04125002399086952,
        -0.033513642847537994,
        -0.045408811420202255,
        0.0885549932718277,
        -0.041010357439517975,
        -0.02959597483277321,
        0.0591488853096962,
        -0.042950589209795,
        -0.004116957075893879,
        0.06205977499485016,
        -0.0424724780023098,
        0.037364836782217026,
        -0.050917062908411026,
        -0.029671629890799522,
        0.005775757133960724,
        -0.018195653334259987,
        0.02167138084769249,
        0.020542507991194725,
        -0.01912567764520645,
        0.06579755991697311,
        -0.01648676209151745,
        0.006583820562809706,
        -0.07652915269136429,
        0.0010874076979234815,
        0.027800513431429863,
        0.010228621773421764,
        -0.01137594599276781,
        0.09920698404312134,
        -0.07982029020786285,
        0.0030847182497382164,
        0.03914801403880119,
        -0.04243309050798416,
        -0.08453801274299622,
        -0.044927410781383514,
        -0.03427676483988762,
        -0.014780540019273758,
        -0.019779536873102188,
        0.031067980453372,
        0.011964306235313416,
        -0.030317576602101326,
        -0.009962694719433784,
        0.07981616258621216,
        0.05708976089954376,
        0.02005685679614544,
        -0.03192410618066788,
        -0.059247247874736786,
        0.05536222830414772,
        0.04162226617336273,
        -0.008040354587137699,
        0.0050384351052343845,
        -0.001831771689467132,
        0.023410344496369362,
        0.018829407170414925,
        0.0285323616117239,
        -0.07975511997938156,
        -0.023107141256332397,
        -0.06122879311442375,
        0.041661716997623444,
        0.00043369390186853707,
        0.07799584418535233,
        -0.020314987748861313,
        -0.018924325704574585,
        -0.06396428495645523,
        -0.0912393108010292,
        0.043619994074106216,
        -0.028152674436569214,
        0.008446549996733665,
        0.016889113932847977,
        -0.026616118848323822,
        0.13915976881980896,
        0.03893514350056648,
        -0.03704932704567909,
        -0.055368561297655106,
        -0.07610858976840973,
        0.026563847437500954,
        -0.08156230300664902,
        -0.05002446100115776,
        -0.07480324804782867,
        1.7601128745503208e-33,
        0.02550395578145981,
        0.13505232334136963,
        -0.04415374994277954,
        -0.11364862322807312,
        -0.024014919996261597,
        0.00942237488925457,
        0.029169771820306778,
        0.08648385107517242,
        -0.04769250378012657,
        0.05345800891518593,
        -0.08103690296411514,
        0.02439415082335472,
        -0.07847286015748978,
        0.005637498572468758,
        0.06713522225618362,
        -0.07713836431503296,
        -0.045628733932971954,
        0.012395814061164856,
        -0.052478522062301636,
        0.036266643553972244,
        -0.018281126394867897,
        0.04032369330525398,
        0.07273547351360321,
        -0.006770106963813305,
        0.04475897550582886,
        -0.10697939991950989,
        0.0208795964717865,
        -0.004211078397929668,
        0.08969368040561676,
        -0.003164035500958562,
        -0.08367074280977249,
        -0.007901719771325588,
        -0.020607739686965942,
        -0.05970281735062599,
        -0.07671508938074112,
        -0.06755615025758743,
        -0.038190994411706924,
        -0.02766060084104538,
        -0.004802308510988951,
        -0.008451125584542751,
        -0.03775148466229439,
        0.09970863163471222,
        -0.04126204550266266,
        -0.02363484352827072,
        0.09056917577981949,
        0.019272413104772568,
        0.04905109107494354,
        0.029292844235897064,
        0.03824964910745621,
        -0.06823007762432098,
        -0.11357074975967407,
        0.015814220532774925,
        0.0071997977793216705,
        0.033331386744976044,
        0.03915001451969147,
        -0.08062369376420975,
        -0.019976459443569183,
        0.04596957936882973,
        0.0766533762216568,
        0.09646210074424744,
        0.029271598905324936,
        0.07015249133110046,
        0.05740290507674217,
        -0.006870884448289871,
        -0.013122640550136566,
        0.018081793561577797,
        0.06912197172641754,
        0.04994220659136772,
        -0.05796016380190849,
        -0.06465590000152588,
        -0.007653355598449707,
        -0.003252699738368392,
        -0.003453209763392806,
        -0.049441467970609665,
        0.041576165705919266,
        0.00013794025289826095,
        0.0047304341569542885,
        -0.03788311406970024,
        0.06389801949262619,
        0.003637447487562895,
        0.023928090929985046,
        0.08617353439331055,
        -0.01914508268237114,
        0.08800879865884781,
        0.0005513816140592098,
        0.026634054258465767,
        -0.0005863069090992212,
        -0.018053850159049034,
        -0.038022056221961975,
        0.024118822067975998,
        0.0015491093508899212,
        -0.034396566450595856,
        -0.07602652907371521,
        -0.04415946081280708,
        0.01893085055053234,
        -2.2818365730376076e-33,
        -0.03645613044500351,
        -0.020790277048945427,
        -0.013916763477027416,
        0.14426898956298828,
        -0.040535811334848404,
        0.020249877125024796,
        -0.022632639855146408,
        -0.01722046360373497,
        0.044822536408901215,
        -0.03918996825814247,
        -0.030215054750442505,
        0.0806049332022667,
        0.033620066940784454,
        -0.010494928807020187,
        0.009716860949993134,
        -0.019734032452106476,
        -0.02155754715204239,
        -0.01686341129243374,
        0.07848136872053146,
        -0.10871487855911255,
        0.03820696845650673,
        -0.00863675493746996,
        -0.10161224007606506,
        0.008245497941970825,
        -0.013869518414139748,
        -0.0016021280316635966,
        -0.04842254891991615,
        0.07036389410495758,
        -0.08206251263618469,
        0.06634332984685898,
        0.015506869181990623,
        0.07894771546125412,
        -0.005939381662756205,
        0.04002483934164047,
        -0.013054333627223969,
        0.038558315485715866,
        -0.024079833179712296,
        0.0590481162071228,
        0.03265981748700142,
        -0.004631537478417158,
        0.03406846150755882,
        -0.0028498368337750435,
        0.051743071526288986,
        -0.06153940036892891,
        0.02306487411260605,
        -0.046250782907009125,
        -0.04894159361720085,
        -0.05778750404715538,
        0.0656694546341896,
        0.03894712030887604,
        0.05105602368712425,
        0.005983924027532339,
        -0.019425563514232635,
        -0.034357376396656036,
        -0.12004436552524567,
        -0.06607474386692047,
        -0.07356888800859451,
        0.07648536562919617,
        0.021257909014821053,
        -0.018023304641246796,
        -0.05172009766101837,
        0.0027306571137160063,
        0.052227143198251724,
        0.018734455108642578,
        0.001193435862660408,
        -0.038380879908800125,
        0.15225154161453247,
        -0.00411706930026412,
        0.012159761972725391,
        -0.019364789128303528,
        -0.00964704155921936,
        -0.04224114492535591,
        0.04055343195796013,
        0.029112644493579865,
        0.002433230634778738,
        0.11330775171518326,
        0.10784512758255005,
        -0.02548159658908844,
        -0.01786802150309086,
        -0.008849984034895897,
        0.03719843924045563,
        -0.002582227811217308,
        0.037439074367284775,
        -0.037312883883714676,
        0.031530652195215225,
        0.12357720732688904,
        -0.036002017557621,
        0.03568284958600998,
        -0.043007250875234604,
        0.08042403310537338,
        0.0376417338848114,
        -0.05211392045021057,
        0.0177370086312294,
        0.0124224703758955,
        0.02628938853740692,
        -4.523965202452018e-08,
        0.06942494213581085,
        0.02548857219517231,
        0.06754696369171143,
        0.050717372447252274,
        -0.039545558393001556,
        -0.05134730413556099,
        0.07326438277959824,
        0.0060089086182415485,
        0.03057556040585041,
        0.0012961662141606212,
        0.0014879385707899928,
        -0.07003537565469742,
        -0.028939958661794662,
        0.03080831840634346,
        0.03420376777648926,
        0.11411385983228683,
        -0.0012090093223378062,
        0.05270063877105713,
        -0.02095535583794117,
        0.01689279079437256,
        0.001279131742194295,
        -0.0018775573698803782,
        0.026621347293257713,
        -0.03370985388755798,
        -0.019062940031290054,
        -0.009100382216274738,
        -0.0684182420372963,
        0.05870020017027855,
        0.038286272436380386,
        -0.08975638449192047,
        0.024312317371368408,
        -0.01367158442735672,
        0.08773975074291229,
        -0.0006320993998087943,
        0.02241128869354725,
        -0.12798961997032166,
        -0.09732315689325333,
        0.05007138103246689,
        -0.08237779140472412,
        0.010897191241383553,
        -0.013204568065702915,
        -0.08923499286174774,
        -0.06811228394508362,
        -0.030414164066314697,
        0.025991130620241165,
        -0.05035802349448204,
        -0.031303245574235916,
        0.016334056854248047,
        -0.02206866256892681,
        0.05748051777482033,
        -0.03985114023089409,
        0.0036876543890684843,
        0.004896892234683037,
        -0.035370901226997375,
        -0.008199671283364296,
        0.06166563555598259,
        0.05345284938812256,
        0.05673576891422272,
        0.01907426118850708,
        -0.0011538813123479486,
        -0.010365723632276058,
        -0.11559616774320602,
        -0.08079402893781662,
        0.033625781536102295
    ]
}