{
    "id": "_s7o66tSnDo",
    "title": "This phone is SO CLOSE. - Sony Xperia 5 IV",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-09-29T19:02:49Z",
    "video_url": "https://www.youtube.com/watch?v=_s7o66tSnDo",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy"
    ],
    "views": 438674,
    "likes": 15778,
    "comments_count": 992,
    "description": "Get a 30-day trial of Epidemic Sound at    A headphone jack, excellent cameras, and a small form factor -- this phone seems to have it all, but does Brandon think Sony has struck the perfect balance between Professional-grade and a phone you actually want to use?  Buy a Sony Xperia 5 IV:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 This is exciting... 0:35 Unboxing 0:48 Design, cameras, buttons and ports 2:44 Display specs and other new features 4:34 Sponsor - Epidemic Sound 5:12 Lets talk cameras 6:22 Selfie camera and mic test 7:23 Quick main camera test and display impressions 7:52 Speaker impressions 8:27 Testing out the camera 10:15 Taking a closer look at the photos and videos 13:51 Listening to the Music Pro \"enhanced\" audio 15:10 Doing another Music Pro test 16:15 Overall thoughts 16:58 Outro",
    "description_links": [
        "https://share.epidemicsound.com/linustechtipsJUN22",
        "https://lmg.gg/XCgm8",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Today's gonna be a really fun phone video for me, because I'm considering switching to this phone. But we have to find out how good it is. In front of me today, I have the Xperia 5 IV. The naming convention is confusing at best. We have the Xperia Pro I, which we've done a video on, the most recent XPERIA 1 IV, which is coming out soon actually! Shipping along around the same time as this phone in September. And then now the Xperia 5 IV . Sony please change this naming scheme. It's not great. But the phone is potentially great. In the box we have just the phone and some very eco-friendly packaging. This is paper, there is no charger or cable. So they've taken the Apple route. Now here's the phone. You might think this looks pretty similar to the 1 IV, and it does. That is a very good thing. There are a couple key differences. So on the back here we have this like soft touch metal finish, which I actually love on Sony phones. It doesn't really attract fingerprints that much. It will if you got like super sweaty hands or whatever and you're holding your phone. But like it really is a one of the best finishes on a phone in my opinion because I hate, you know, like I have a OnePlus 8 which is pretty old at this point. But look at this thing. It is a mirror. On the rest of the back are three cameras, our 16 mil, 24 mil, and 60 mil. Now if you watch the 1 IV video or you know anything about that other predecessor phone, we're actually missing the telephoto 85 to 120 mil lens that they had was actually an optical zoom. Really cool technology. There's also no time of flight sensor, but again, this is the more affordable version of a similar phone. On the right of thumb, we have a power button, shutter button, which actually this time around isn't narrowed or marked or textured in any way. It's still there, which is nice, so when you turn the phone on, yeah, you long press for your camera app, and it's just opened and then you have a shutter button in relatively the same position as a camera when you hold it like this. I think the fingerprint sensor is built into the power button, and then we have a volume rocker on the right. And then on the left of the phone we have nothing, which is not a bad thing. I actually don't mind everything being on one side. This phone, and this is probably one of my favorite things of Xperia phones, has a headphones jack. (children cheer) It's 2022. Most smartphones don't have headphones jacks. You might not care. On top of using headphones, you can actually use a mic. What you have a mic input and that is very important, because high quality audio, especially if you're shooting on just your phone, very necessary. On the front we have a 2520 by 1080p full HD display. It is OLED, which is very nice, and 120 hertz. The 120 hertz is actually off by default, which I assume is just a battery saving measure, but I'm gonna turn it on so that we get the full experience. Speakers are front firing, and they've actually apparently changed the housing on the speaker so that there's less vibration in the phone, which in theory should make them sound better. On top of that we have a new 12 megapixel selfie camera on this phone over its predecessor, the 5 III. This is also one of the first phones, along with the 1 IV, they tease this in the 1 IV, but this is the first time I'll try this in person. They have this Music Pro app, which is just supposed to be able to allow you to do voice recording. It's an app that you can literally record an instrument on if you really wanted to, and then actually you can send it off to Sony to their servers and it will remove background noise for you. You can also edit it on the phone, which is kind of cool. Okay, this phone is also IP 68/65 so you can drop it in a puddle and not cry. And on the bottom of the phone, we have your typical type C and a toolless SIM and microSD expansion. Thank you Sony for still doing this because again, a lot of phones you get these days do not have microSD expansion. Obviously it's going to be slower than the memory built into the phone, which is I think this model is 128 gigs. Final couple specs on this phone, it has the Snapdragon 8 Gen 1, and it also has eight gigs around built in. The other new feature on this phone is actually has wireless and reverse wireless charging, which I'd love to see, 'cause I haven't personally used a wireless charging phone. And on top of wireless charging this phone, just like the 1 IV has 5,000 milliamp hour battery, which is pretty respectable. Before we get to the cameras, I'm gonna tell you about today's sponsor, Epidemic Sound. Thanks to Epidemic Sound for sponsoring today's video. Epidemic Sound provides high-quality, professionally-produced music and sound effects for you to use, whether you're a video creator on YouTube or need it for work at an agency. Epidemic Sound has a license to cover through their personal and commercial plans. Choose from tens of thousands of diverse and original sound effects and tracks. Epidemic's ear feature lets you also select specific portions of any track to search for music in their catalog that sounds similar to the sound you're looking for. So sign up today in the link in the video description for a free 30 day trial. Thank you, Epidemic Sound. Okay. Cameras. So I have heard that this thing will overheat at certain resolutions for long periods of time, and as this warning is telling me, the videography pro app is just kind of a slightly nicer UI to toggle things like your Zoom, you got your manual auto focus, it's laid out very similarly to an Alpha camera, ISOs right here, like I really like this UI. Photo Pro, similar you got a couple modes. The basic is pretty much like your standard smartphone camera app. The 16 millimeter and the 24 millimeter cameras on this phone are the same as the 1 IV. The main difference is the 60 mil, because this is a fixed 60 mil versus the 85 to 120 mil. You get your venice color, different LUTs, warm, cold strong, all that kind of stuff. That's awesome. Similar layout to the video pro app, but with a couple extra things, like the Kodak is here in display, you have audio levels, it's a little bit more professional, it's got shutter angle, that kind of thing. Frame rate is here. Oh also, each camera on this phone just like the 1 IV has 120 FPS 4K shooting, which is very nice. This is what the selfie camera looks like. This is also what the mic sounds like. So I'm gonna just keep talking and you guys can tell me in the comments what you think of the mic. I'll listen to this later on the laptop, but selfie camera in HDR, and this is what the mic sounds like. Let's test how this looks. So it's assuming I'm in a back flip portrait. This is kind of optimal lighting, but honestly, my impression of this on the phone display anyway is it looks a little bit on the bright side the way that the camera thought to meter the shot. Also, let me just check if there's any skin softening. Oh please, Sony! I understand, but please don't have the soft skin effect on by default. Let's do that again without the skin softening feature. Well you can see texture in my skin versus less if you looked at the other photo. There is eye auto focus on every single one of these cameras which is again an excellent thing. Looking at it, I really like the display. It feels snappy as I would expect a 120 hertz display. And I actually agree with this resolution more than the 4K OLED that was in the 1 IV, because the pixel density, you're not really gonna notice 4K versus 1080P on a display this small, and if you are the one person who does, well, good for you. Why don't we actually try listening to the speakers? (upbeat pop music) Oh, that's so weird. So there's this feature when I press the volume rocker of dynamic YouTube vibration, and so it's like vibrating the phone along with the song. I mean on its own, without comparing it side-by-side to another device, this sounds pretty good to me. Most phones these days have much tinnier mids and aren't really great on the low end. I mean again, this is just a phone speaker that is front firing which is nice. The last thing I wanna test is going over some of the photos we actually shot on the weekend 'cause I have been using this phone for about three days and we're gonna do some tests live. So we're gonna go outside with Adam and take a couple photos and video. First thing I wanna test is the 60 mil lens on this phone, because it is different than the other two cameras which are the same as the one on the 1 IV. This will also test the image stabilization and how good it is as we walk backwards. So Adam's here, we're gonna just walk around here in a circle, and then we're gonna come back and I'm gonna follow him the entire, or he's gonna follow me. - [Adam] Oh, I missed those instructions. (upbeat rock music) I'm walking here! - Thanks a lot. And one, two. So the main thing I want to test here is mainly the 60 mil, just because we've seen the performance of the 16 and the 24 mil. Both of them are good but I will do a couple shots with both as well. Nice. The last test I wanna do is how the selfie camera handles a back lit situation. So one thing I don't like about the Video Pro app, in this instance, I'm using the selfie camera, but the UI is still in the horizontal setting. So this is what the selfie camera looks like in 4K backlit situation. It's also shooting in HDR. So it does seem like I can't do any manual control in the selfie camera, at least not in the video oro app which is a bit unfortunate, because I really like a lot of things about this app. I should just be able to go into this and change the settings. The last thing I wanna test, we have some background noise right now, there's a train that way, there's some people doing garden work that way. I'm gonna record a voiceover on this phone and then we'll send it off to Sony and see how this process is. Okay, we're back inside. I actually took this phone on a weekend trip to Seattle, so we're gonna take a look at some of the photos from that trip. Also, we're gonna look at some of the photos we just took of Adam outside as well as the video. Now one interesting thing I'll note before I even get through any of this really is the DNG on this phone don't actually perform amazingly. So this is one of the JPEGs on the 60 mill that I got. Camera performance, pretty good. Sharpness is decent in comparison to the raw DNG of the same photo. Yeah, so you'll see in the DNG, quite a bit noisier. You can obviously edit this so I can take down the exposure, I can take down the highlights, I don't believe it's clipping as badly. The autofocus on this phone is excellent. This photo of these birds, I was just walking down the sidewalk not really slowing down to take this photo. I snapped it really quick as these birds flew by and bam, there was this giant Norwegian cruise ship. I was really pushing the ultra wide to see if I could fit the entire thing in. This ship is massive, like if you can see this tiny little boat here. and then you look at this thing, it's like the size of a building. I believe this is on the telephoto. And you can actually like see individual people. Obviously we can't see their faces, but you can make out people and that's pretty awesome. Here's another wide shot from a different perspective. Again, a little bit earlier in the day, so you can see the sun's kind of on the right, shining this way. Dynamic range held everything really well. We even have the shadows in this tree on the left, perfectly balanced. I just, I like using this phone as a camera. I think I was never really unhappy with the performance of this one, especially in a daylight setting when you're outside. If you're using it in that situation, a lot of the time then it does pretty well. Here's a couple photos of my son on the inside of our hotel room. Now the struggle here was I believe he was moving a lot and even the auto focus could not always keep up with him at a close distance, though it did nail a couple. Like here's one that was in focus and perfectly fine. Still a one over 100. Here's the selfie that I took just earlier. It actually doesn't look overexposed at all on the computer. It's on the higher end. Here's the photo of Bell and Mark, and it's a little bit on the noisy side 'cause it's ISO 800, but if you actually punch in, Bella is perfectly in focus, and he was a tiny head in this photo. But the focus nailed him even though he's in the darker part of the image. The HDR video of the selfie camera again also didn't turn out as dark as it looked on the phone because obviously the full sun was on that display, so it was kind of hard to tell. There is a little bit of what feels like shadow clipping because it's really trying to balance both the sky and me, but it is completely usable. So this new selfie camera is solid. So here's the telephoto video. The stabilization, guys, excellent. And it managed to keep Adam, like it looks like I'm not just walking. Like it looks like it's almost on a gimble or something. Auto exposure is doing a pretty good job here. It's not the highest quality video, not the sharpest I've seen, I feel like the telephoto in the 1 IV was quite a bit better, but obviously that's what you're paying for. Also, let's have a listen to the music pro voiceover both the unedited process voiceover and here is the Sony-edited process voiceover. Okay, so this is a test of the Sony Xperia 5 IV's mic using the Music Pro app to record a voiceover. I've got some background noise from a person doing some yard work behind Mark, and then behind me there's going to be a train, and I think I actually hear a plane, so there's a lot of background noise here to deal with. All right, it's been a couple of days, 'cause I actually had a couple issues setting up the account for the Music Pro app, but you guys just heard both the original and the processed VO and I just listened to the myself. I mean I didn't know what I was expecting, but I think Sony did what they set out to, where they made the voice in the voiceover sound a little bit more separated from the background noise. The yard worker, you could hear a little bit less, but things like wind noise and you can kind of hear a little bit of compression throughout the recording. So obviously still not an ideal place or setting to record a voiceover, and that's to be expected if you start with a bad recording. No level of post-processing is really gonna fix those problems, especially not one that's AI based. To be fair to Sony though, I do wanna actually do one more recording right here right now to see what it sounds like kind of in a studio environment more like maybe this is similar to a hotel room if you were to record your voiceover, which is probably more likely what people will do if they're even going to use this feature. So this is the test of the Xperia 5's mic indoors. (record reels) Select the settings that you want. I'm gonna just de-noise. Let's see what dereverb does. Do some mic simulation and studio simulation. Let's do all of them. So here's the original. So this is a test of the Xperia 5 IV's mic indoors in a studio setting. So this is the test of the Xperia 5 IV's mics indoors in a studio setting. Second time around, I'm actually pretty impressed! I think Sony did exactly what they set out to with this AI based program. The tuned version of this VO does sound a decent amount better and it kind of eliminates that echo-y-ness of this being such a large room. It's not perfect, but I'd say to my ears it's pretty good. This phone checks so many boxes, especially in terms of the specs, expandable storage, all that kind of stuff, headphone jack, it is definitely squarely aimed at creators. So I am probably fitting within the niche of a phone like this, but I really like what Sony's been doing with their Xperia line and I do really hope that they're successful, because there are very few other smartphone makers really kind of packing all of these features into one device. So yes, 999 US is expensive. And this is not a review, it is only a first impressions, but this phone is awesome. Could it be better? Yes. But I think they're going in the right direction, so I hope for Sony's success on this one. Anyways, thank you guys for watching. If you want to see more on the Xperia lineup, maybe you can watch the 1 IV video if you haven't. It's a slightly bulkier, better version of this film, but also more expensive. And I hope you have a great day. Take care. I'm looking at Andy. He is wanting me to wrap this up.",
    "transcript_keywords": [
        "phone",
        "camera",
        "selfie camera",
        "Sony",
        "Xperia",
        "video",
        "thing",
        "Epidemic Sound",
        "sound",
        "Pro app",
        "Music Pro app",
        "fun phone video",
        "Pro",
        "video pro app",
        "Music Pro",
        "kind",
        "test",
        "app",
        "phones",
        "bit"
    ],
    "transcript_entity_values": [
        "16 millimeter",
        "FPS",
        "24 millimeter",
        "the day",
        "Snapdragon 8",
        "Norwegian",
        "three",
        "Adam",
        "Xperia",
        "the weekend",
        "999",
        "4",
        "one",
        "60",
        "US",
        "tens of thousands",
        "12 megapixel",
        "5,000 milliamp hour",
        "Photo Pro",
        "Mark",
        "Bell",
        "the Video Pro",
        "Alpha",
        "a couple of days",
        "Andy",
        "16 mil",
        "ISO 800",
        "Seattle",
        "AI",
        "60 mil lens",
        "120 hertz",
        "30 day",
        "the Xperia 5's",
        "128",
        "85",
        "2022",
        "5",
        "September",
        "68/65",
        "Second",
        "jack",
        "Xperia",
        "microSD",
        "oro",
        "first",
        "the Xperia 5 IV's",
        "1",
        "Sony",
        "these days",
        "XPERIA 1 IV",
        "16",
        "two",
        "120",
        "the Xperia Pro I",
        "1080p",
        "one over 100",
        "120 mil lens",
        "about three days",
        "VO",
        "Bella",
        "24 mil",
        "Kodak",
        "the Xperia 5 IV",
        "the 1 IV",
        "60 mil",
        "YouTube",
        "2520",
        "Xperia",
        "1080P",
        "eight",
        "First",
        "DNG",
        "Apple",
        "today",
        "venice",
        "UI"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "DATE",
        "LAW",
        "NORP",
        "CARDINAL",
        "PERSON",
        "FAC",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "LAW",
        "LOC",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "ORG"
    ],
    "vector": [
        -0.05288826301693916,
        -0.007803682237863541,
        0.06515615433454514,
        -0.12136058509349823,
        0.02373467944562435,
        0.01961711421608925,
        0.005618113558739424,
        0.06375967711210251,
        -0.039695870131254196,
        0.052894625812768936,
        0.030200794339179993,
        0.007430138066411018,
        -0.006476471200585365,
        -0.006745624355971813,
        0.03995157778263092,
        -0.04289856180548668,
        0.03468950092792511,
        -0.023215124383568764,
        -0.09106647223234177,
        0.05541716143488884,
        -0.004813761450350285,
        -0.018029356375336647,
        0.03462699428200722,
        0.00769304484128952,
        0.010277921333909035,
        -0.005953522864729166,
        0.011013161391019821,
        -0.02048926055431366,
        -0.044650912284851074,
        -0.05517440289258957,
        -0.04688901826739311,
        0.09955928474664688,
        0.07853930443525314,
        -0.048829302191734314,
        -0.04859326034784317,
        -0.06571698188781738,
        0.017665918916463852,
        -0.04085702449083328,
        -0.05745134875178337,
        0.02086993120610714,
        -0.011905346997082233,
        -0.03971053659915924,
        -0.0019630673341453075,
        0.020683055743575096,
        -0.005687571596354246,
        -0.09358984231948853,
        0.0025955098681151867,
        -0.02605378068983555,
        -0.015023931860923767,
        0.05241675302386284,
        -0.01781466044485569,
        -0.026523005217313766,
        0.06136041879653931,
        -0.015181517228484154,
        -0.16444362699985504,
        -0.011694238521158695,
        -0.014377256855368614,
        -0.01875656098127365,
        0.04796368256211281,
        0.03777722269296646,
        0.048347216099500656,
        0.027674203738570213,
        -0.031019829213619232,
        0.08377043157815933,
        -0.029964692890644073,
        0.05299149081110954,
        -0.0559699609875679,
        0.05785777047276497,
        -0.00700314249843359,
        -0.000806621101219207,
        -0.019210224971175194,
        0.01546516828238964,
        0.01731216348707676,
        0.1277971714735031,
        -0.03406710922718048,
        0.00683403667062521,
        0.06523431837558746,
        -0.10303331911563873,
        -0.01196930930018425,
        0.07274700701236725,
        0.04124843329191208,
        -0.03456573188304901,
        -0.11116190999746323,
        -0.04929732903838158,
        0.050377096980810165,
        -0.020006146281957626,
        0.03341534733772278,
        0.044492628425359726,
        -0.0860116183757782,
        -0.08010739088058472,
        -0.06707015633583069,
        0.10331044346094131,
        -0.01114294957369566,
        -0.009443303570151329,
        -0.05584493651986122,
        -0.011204400099813938,
        -0.04774998873472214,
        -0.06335974484682083,
        -0.08406230062246323,
        0.06909237802028656,
        0.014576379209756851,
        0.018137965351343155,
        -0.028137480840086937,
        0.00914992019534111,
        -0.07592925429344177,
        -0.12748752534389496,
        0.036513134837150574,
        0.041564080864191055,
        -0.011896745301783085,
        0.018170559778809547,
        -0.10738778114318848,
        -0.043217942118644714,
        -0.10613830387592316,
        -0.042345233261585236,
        0.03952226787805557,
        0.04919083043932915,
        -0.027152230963110924,
        0.03400753438472748,
        0.0904838889837265,
        -0.08465564996004105,
        0.034773316234350204,
        -0.00554488692432642,
        -0.09626797586679459,
        -0.03775284066796303,
        0.019320253282785416,
        -0.03264293074607849,
        -0.029372649267315865,
        -2.8511220586561104e-33,
        -0.05340715870261192,
        0.1162637248635292,
        0.028110241517424583,
        0.0011099284747615457,
        0.05541415140032768,
        -0.008413477800786495,
        -0.0061138407327234745,
        0.027713526040315628,
        -0.052066221833229065,
        0.009265230968594551,
        -0.05584488436579704,
        0.019214706495404243,
        -0.010058025829494,
        0.014361818321049213,
        0.021275311708450317,
        0.008635667152702808,
        -0.021697504445910454,
        -0.0045135486871004105,
        -0.02405301108956337,
        -0.009767686016857624,
        -0.001553649315610528,
        -0.04026307165622711,
        -0.021537071093916893,
        -0.043135687708854675,
        0.12281041592359543,
        0.003651620354503393,
        0.0683681070804596,
        -0.041504502296447754,
        0.09310875087976456,
        0.008954189717769623,
        -0.08862309902906418,
        0.014793246984481812,
        0.011176526546478271,
        -0.0978742465376854,
        0.036092609167099,
        0.04893019050359726,
        -0.029014088213443756,
        -0.008596633560955524,
        0.050375547260046005,
        -0.05288493633270264,
        -0.007009380031377077,
        0.05540071427822113,
        -0.11174093186855316,
        -0.011804121546447277,
        0.04466904699802399,
        0.07412481307983398,
        -0.02700026147067547,
        0.016529692336916924,
        -0.058314964175224304,
        -0.07669957727193832,
        0.015033607371151447,
        0.019565463066101074,
        -0.11369246989488602,
        0.02159661240875721,
        -0.027831068262457848,
        -0.019478341564536095,
        0.00040522211929783225,
        0.0365338996052742,
        -0.0074601490050554276,
        -0.0012325291754677892,
        0.148605614900589,
        0.0374007411301136,
        -0.008843416348099709,
        -0.004101983271539211,
        -0.04118042811751366,
        0.09349343925714493,
        -0.003658813424408436,
        -0.05674741044640541,
        0.026578199118375778,
        -0.011994687840342522,
        0.0014175863470882177,
        0.04099313169717789,
        0.05280296877026558,
        0.019350765272974968,
        -0.0384519137442112,
        0.0619625449180603,
        -0.04677193984389305,
        -0.09803745150566101,
        0.021086160093545914,
        0.05117335543036461,
        -0.048668116331100464,
        -0.0055187600664794445,
        0.07048363983631134,
        0.024724898859858513,
        0.05924201384186745,
        0.034086283296346664,
        0.024227449670433998,
        -0.05962669849395752,
        -0.06771073490381241,
        0.0915054902434349,
        -0.01406405121088028,
        0.02685464173555374,
        -0.05892707780003548,
        0.023506104946136475,
        -0.06402859836816788,
        -1.3697297312743006e-33,
        -0.043763674795627594,
        0.0103164566680789,
        -0.007952097803354263,
        -0.012771938927471638,
        -0.0002927325258497149,
        -0.021580951288342476,
        0.00888351071625948,
        0.042157236486673355,
        0.013871069066226482,
        0.020924057811498642,
        -0.008329377509653568,
        -0.027501728385686874,
        -0.041989654302597046,
        -0.0356844961643219,
        0.004358089994639158,
        -0.0784178301692009,
        0.028753910213708878,
        -0.08409242331981659,
        0.01591905578970909,
        -0.0002887560403905809,
        0.1011015921831131,
        0.04196194186806679,
        0.02288718894124031,
        0.08139816671609879,
        -0.027403000742197037,
        -0.024103088304400444,
        0.012173570692539215,
        0.030565010383725166,
        -0.03093305602669716,
        -0.03538043424487114,
        -0.041053857654333115,
        -0.06214432418346405,
        0.03183349221944809,
        -0.12585018575191498,
        0.04189145565032959,
        0.06295739859342575,
        0.014346186071634293,
        0.01943892054259777,
        -0.007478897459805012,
        -0.009224293753504753,
        -0.04476828873157501,
        -0.0537589006125927,
        0.00018185794760938734,
        -0.035845424979925156,
        0.03997083008289337,
        -0.08936826884746552,
        0.00209219753742218,
        0.007381466217339039,
        0.048721544444561005,
        -0.009114098735153675,
        0.04113101214170456,
        -0.03887264430522919,
        -0.005241718143224716,
        0.032844919711351395,
        -0.026777369901537895,
        0.005959981121122837,
        -0.03822770714759827,
        -0.09788241237401962,
        -0.0019402108155190945,
        -0.013823048211634159,
        0.04555096477270126,
        -0.00434102863073349,
        -0.06324499845504761,
        -0.04764772206544876,
        0.002068175235763192,
        -0.029119590297341347,
        0.10525427758693695,
        0.028623774647712708,
        -0.036757007241249084,
        0.009707453660666943,
        -0.006519516464322805,
        -0.0276442002505064,
        0.020792726427316666,
        0.015850219875574112,
        -0.016038378700613976,
        0.019591299816966057,
        -0.07607470452785492,
        0.035855066031217575,
        0.021125223487615585,
        0.005133320111781359,
        -0.04196346551179886,
        0.0058604334481060505,
        0.029198653995990753,
        0.00032291788375005126,
        0.0750468447804451,
        -0.006362489890307188,
        0.028517169877886772,
        -0.1136450543999672,
        -0.06525114178657532,
        0.06683129072189331,
        -0.03739104047417641,
        0.03813553974032402,
        -0.032686300575733185,
        -0.021290238946676254,
        -0.027374934405088425,
        -5.892944798802091e-08,
        0.076496921479702,
        -0.056381504982709885,
        0.051121603697538376,
        -0.008457129821181297,
        -0.033625755459070206,
        -0.030683141201734543,
        -0.06851772964000702,
        -0.06322678178548813,
        0.19646045565605164,
        0.013190927915275097,
        0.0037260258104652166,
        -0.06725312769412994,
        -0.019958501681685448,
        0.09087679535150528,
        -0.019099093973636627,
        0.07644899934530258,
        0.03592567518353462,
        0.09415189176797867,
        -0.033301062881946564,
        -0.016579877585172653,
        0.009567192755639553,
        0.081227146089077,
        0.004757030867040157,
        -0.07183381915092468,
        0.044655691832304,
        -0.03096059337258339,
        -0.017972512170672417,
        0.02711356244981289,
        0.10430074483156204,
        -0.05539568513631821,
        -0.06469219923019409,
        0.0057851579040288925,
        0.0152586093172431,
        -0.013124335557222366,
        -0.01440222468227148,
        0.002956558484584093,
        -0.01205790787935257,
        -0.009300013072788715,
        -0.025361178442835808,
        0.005654758773744106,
        0.047642819583415985,
        -0.017216751351952553,
        0.00046248140279203653,
        0.04651957005262375,
        0.07793883234262466,
        -0.06762015074491501,
        0.02945082075893879,
        -0.10764790326356888,
        0.00898980163037777,
        -0.011690537445247173,
        -0.07195837795734406,
        0.025691505521535873,
        0.0033034959342330694,
        -0.015423871576786041,
        0.06831257790327072,
        0.0205121748149395,
        0.010672356002032757,
        0.04591270163655281,
        -0.08738511055707932,
        0.09504707902669907,
        0.038656409829854965,
        -0.07150798290967941,
        -0.02942439541220665,
        0.1451999843120575
    ]
}