{
    "id": "_UyZRfJp17A",
    "title": "Building a camera: the plan was simple until it wasn’t",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-07-01T13:00:31Z",
    "video_url": "https://www.youtube.com/watch?v=_UyZRfJp17A",
    "category": "Science & Technology",
    "tags": [
        "raspberry pi 4",
        "raspberry pi",
        "python",
        "pi camera",
        "raspberry pi camera",
        "camera",
        "ninoka",
        "mirrorless",
        "mirrorless camera",
        "coding",
        "coding knowledge",
        "raspberry pi code",
        "raspberry pi coding",
        "vintage camera",
        "cameras",
        "custom camera",
        "how to build a camera",
        "how to",
        "python script",
        "selfie stick",
        "diy camera",
        "high quality",
        "how to build",
        "becca farsace",
        "camera mount",
        "film camera",
        "camera parts",
        "camera software",
        "full frame",
        "dslr cameras",
        "camera lenses",
        "technology",
        "gadgets",
        "tech",
        "verge",
        "the verge"
    ],
    "views": 246533,
    "likes": 11160,
    "comments_count": 618,
    "description": "We built a DIY camera with the Raspberry Pi High Quality Camera using C-mount and CS--mount lenses. The Raspberry Pi is a super tiny computer that is highly programmable. People have used these to program everything from smart mirrors, to portable arcades, to COVID-19 case counters, and even greenhouses. They are tiny boxes that  if you know how to code  can do pretty much anything. Heres our video showing the challenges for someone without that coding experience.  Read more:   If you buy something from a Verge link, Vox Media may earn a commission. Seeour ethics policy:   Here is what Becca used for the build: Jumper wires:  Mini push button switch:  3.5 inch touchscreen:  USB-C portable 10,000mAh charger:  Raspberry Pi 4 Model   HQ Camera Mod:  Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/3dTJvzj",
        "http://bit.ly/2TQsqjB",
        "https://amzn.to/3gkEEZT",
        "https://amzn.to/2Zq5UPH",
        "https://amzn.to/3ggSjkG",
        "https://amzn.to/2BrEzol",
        "https://amzn.to/2YLFxEO",
        "https://www.raspberrypi.org/products/raspberry-pi-high-quality-camera/",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- Dudes, I own so many old cameras (lighthearted funky music) and most of them don't even work, but I just love the look, and the feel, and the history that every single one of them holds. And it's always been a dream of mine to repurpose them and get them working! So in the height of quarantine, when Raspberry Pi released what's in this box, whoo, I knew exactly what I wanted to do with it. I don't know if y'all are ready for this. To be frank, I don't know if I'm ready. Who's Frank? That's such a bad joke. Ah, every time I just makin' bad jokes, open the box, Becca! (lighthearted funky music) You see friends, the word code, command, Python, are all terms I really had no interest in knowing more about until I saw that Raspberry Pi put out this new camera mod. It supports interchangeable lenses, and natively, it supports C and CS mount lenses that my 16 millimeter Bolex uses. Hold on, I got one more. They're literally the cutest little lenses. Aren't these so adorable? Dudes, thousands of camera systems exist. So I'm gonna take some old parts and some new parts, and I'm gonna finally learn how to code, and I'm gonna build a camera that's completely my own. We're building the Becca cam, buckle up. (drums thumping) This is a Raspberry Pi 4, it's a super tiny computer that is highly programmable. And folks have used these to program everything from smart mirrors, the portable arcades, to COVID case counters, and even the hella smart, super techie greenhouses. I mean, these are tiny boxes that if you know how to code, can do pretty much anything, and this is Raspberry Pi's HQ Camera mod that connects right to the Raspberry Pi. So, so far, so good, until (sighs) hello from the floor on day one. This is what it's come to. Dot get, not found. At its most basic level, to take a photo with the Raspberry Pi cam, you have to type code into a terminal. What? See, the Raspberry Pi cam uses a coding language called Python. And honestly, wait, it's not even about the coding language. It's about the fact that I don't know any coding languages. Oh my God. (screams) The (camera clicks) does too many arguments mean? That means nothing to me, that literally means nothing. Stay calm, Becca. I mean, there's no camera interface here. There's no easy way to just click a button and bring up the camera preview. Literally on every single step, there is a problem. So I was able to take a couple photos today, which is hella exciting, but tomorrow's gonna be all about finding a program that I can run so that I don't have to type a code into the terminal every time I wanna take a photo. Basically, I don't wanna have to carry a keyboard around when I'm using this camera. And I have this 3.5 inch touch screen that I'd really like to be using instead. So day two, baby day two. Oh God, I need help. So we're reaching out to the IG buds because shout out to all my IG buds, you know I frigging love you guys. Hopefully someone comes through. (energetic drumming) (sighs) Okay, while we wait for the buds to get back to us on what code I should be writing into my Pi, I wanna get the button set up that's gonna become our shutter button. So a little bit of hardware, thank God, let's do it. (lighthearted funky music) You gotta love a good button. Mm, just like I knew you would, the IG buds came through for your girl. Basically, you were like, Becca, you should've read the manual, like three more chapters. This is the official Raspberry Pi camera guide. I love her. I love her so much. Y'all were like, there's a code in there for programming a selfie stick, and I'm not making a selfie stick, but I am making a camera that uses a button to take photos, which is what a selfie stick does. The only problem with this code is that every time I was pushing the button, it was freezing the preview. So I called a friend, who called a friend, who wrote me a line in the code that basically cuts the program after it takes a photo. And then I created a desktop shortcut that opens the program and runs it every time I wanna take a photo. It's not quite as perfect as I would have liked, but I will take what I can get at this point, and it gets my camera working, which means I can move on to hardware. I woke up this morning and I thought, finally, it's hardware day. Ah, let's go! (energetic drumming and snapping) (joyful jazzy music) Okay, buds, today we say goodbye to the nk-700 and hello to Becca cam. (joyful jazzy music) (torch hisses) Buds, it's the moment of truth. And I'm really nervous, and I'm really freaking excited. We're gonna plug this camera in, and we're gonna see if it powers up. We're gonna see if it takes a photo. We're gonna pop one of those old vintage lenses on from my Bolex. (sighs) I'm just like taking a moment to soak in the happiness, just in case everything comes crumbling down. (gentle electronic music) All right, dudes, here we go. (Becca sighs) It worked, it worked, it worked! I just built a freaking camera. Tomorrow, we shoot. (camera shutter clicking) (relaxing music) To take a photo on the Becca cam, you need to open Thonny, which runs Python scripts. There, I've already preloaded the script for the selfie stick. You run that program, it opens up a preview of what the camera's seeing, where you can focus and frame up before hitting the shutter button to take a photo. It then quits the program and saves the photo. (camera shutter clicking) And then, every time you want to take another photo, you have to run that script again. (camera shutter clicking) (camera shutter clicking) (sighs) Okay, buds, so there's a little bit of movie magic in that last sequence, because when I first came back from shooting with the Becca cam for the first time, the photos actually looked like this. I truly don't know what I'm doing wrong at this point. But what I do know is that when I just use the terminal and type a simple command into the camera, it takes higher-res photos. So I got my keyboard and just a totally normal day out shooting with my computer. I'm gonna link all of the parts that I used to make this below, and if you get those parts or if you already have all of this and you had some code, put it down below, or shoot me a message on Instagram, I'd love to see what you guys are coming up with. And hopefully you're having better luck than I am. So the Becca cam, would I send those to anybody to review? No. Is it as first gen as they come? Yeah, absolutely, it is. Do I know what I'm doing? No, I still have absolutely no clue what I'm doing, but this was actually a really fun challenge, now that I'm done with it. In the heat of it, not so much. But now we're good. But outside of the software hellscape I have been truly living in for the last week, the sensor's actually really cool and super capable for the $50 it'll run yet. And I mean, that's not even the point. The point is I jumped into this project with a large amount of knowledge of camera hardware, and zero knowledge of camera software. And I did come out of it with a semi-working camera, but I now appreciate all other already built cameras so much more. And I can not wait to use a camera that doesn't require a keyboard. Oh yeah, and buds, welcome to Full-Frame. This is a place for us to talk anything and everything cameras, from the tech that surrounds them to the new lenses that are coming out, to, I don't know, maybe building something again soon. What fascinates you about the camera world? What do you want to know more about? What do you want me to build next? I really appreciate you being here, and I hope that you and everyone that surrounds you is well. And (sighs) we'll be seeing you again real soon. Be well buds.",
    "transcript_keywords": [
        "camera",
        "Raspberry",
        "Becca cam",
        "Becca",
        "code",
        "photo",
        "buds",
        "button",
        "cam",
        "time",
        "love",
        "program",
        "photos",
        "cameras",
        "lenses",
        "day",
        "Python",
        "God",
        "run",
        "camera mod"
    ],
    "transcript_entity_values": [
        "zero",
        "the Raspberry Pi",
        "one",
        "16 millimeter",
        "Bolex",
        "Python",
        "Tomorrow",
        "three",
        "IG",
        "Raspberry Pi's",
        "today",
        "the last week",
        "Bolex",
        "this morning",
        "Becca",
        "50",
        "Raspberry Pi",
        "day one",
        "Buds",
        "thousands",
        "two",
        "Mm",
        "Becca cam.",
        "Thonny",
        "Raspberry Pi",
        "3.5 inch",
        "the Becca cam",
        "the Becca cam",
        "CS",
        "first",
        "Frank",
        "Instagram",
        "tomorrow",
        "Full-Frame"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "TIME",
        "PERSON",
        "MONEY",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "FAC",
        "LOC",
        "GPE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.06010710075497627,
        0.004073280841112137,
        -0.029263095930218697,
        -0.10049080848693848,
        0.07132716476917267,
        -0.002030131407082081,
        -0.03359373286366463,
        0.11840521544218063,
        0.004379886668175459,
        0.08423683047294617,
        0.05303367227315903,
        -0.022659163922071457,
        0.009586282074451447,
        0.06425213813781738,
        -0.007193099707365036,
        0.0014597788685932755,
        0.06282766163349152,
        -0.06955665349960327,
        0.010351588949561119,
        -0.0031547655817121267,
        -0.06979461014270782,
        -0.13154102861881256,
        0.0186918992549181,
        -0.06078314036130905,
        -0.031850796192884445,
        -0.009916062466800213,
        -0.022500604391098022,
        -0.05628948658704758,
        -0.05726666375994682,
        -0.02732078544795513,
        0.005813173018395901,
        0.008717256598174572,
        0.01780436560511589,
        0.0016591085586696863,
        0.008460137993097305,
        -0.04218796640634537,
        0.09120414406061172,
        -0.09698045998811722,
        -0.06698703020811081,
        -0.06205093860626221,
        -0.06046328693628311,
        0.012396077625453472,
        0.06560663878917694,
        0.05087867006659508,
        0.015206225216388702,
        0.01641201414167881,
        0.06550896167755127,
        -0.05892225354909897,
        -0.007547041866928339,
        -0.08944071829319,
        -0.06493668258190155,
        -0.03402252122759819,
        0.06241295859217644,
        -0.040994782000780106,
        -0.033822569996118546,
        -0.02027040533721447,
        -0.05574365705251694,
        -0.010445679537951946,
        0.05654767155647278,
        -0.017564503476023674,
        0.06025462597608566,
        -0.05376585200428963,
        0.01815761812031269,
        0.020327722653746605,
        0.011369207873940468,
        0.05197020620107651,
        0.006395585369318724,
        -0.018444132059812546,
        0.06932292878627777,
        -0.054629597812891006,
        -0.07483839243650436,
        -0.0007707088952884078,
        -0.019158780574798584,
        0.010882969945669174,
        -0.05336831510066986,
        -0.005150988698005676,
        0.006370605435222387,
        -0.032718926668167114,
        -0.03147304430603981,
        -0.05507857725024223,
        0.06120121851563454,
        0.0339701846241951,
        -0.04292556270956993,
        0.040944188833236694,
        0.009555885568261147,
        0.006865937262773514,
        0.04803676903247833,
        0.04826181381940842,
        -0.024626512080430984,
        -0.11584583669900894,
        -0.0370505228638649,
        0.0035401831846684217,
        -0.03372446075081825,
        -0.07446707040071487,
        -0.010673106648027897,
        -0.04177844524383545,
        -0.025490695610642433,
        -0.11851464956998825,
        -0.047685783356428146,
        0.029206354171037674,
        0.022603662684559822,
        -0.0021827269811183214,
        0.08002076297998428,
        -0.0854223370552063,
        0.04893813654780388,
        -0.06719882041215897,
        -0.009276429191231728,
        0.08687824010848999,
        -0.00029419525526463985,
        0.03697172924876213,
        -0.04643817991018295,
        0.06730367988348007,
        -0.06618383526802063,
        -0.031039828434586525,
        0.04906767979264259,
        0.0009520375751890242,
        -0.02215278521180153,
        0.002272035228088498,
        0.07596457749605179,
        0.012893310748040676,
        0.07295436412096024,
        -0.0268052127212286,
        -0.0704633817076683,
        -0.0013984754914417863,
        0.013698894530534744,
        -0.011499308981001377,
        -0.012077957391738892,
        4.8740223891335154e-33,
        0.06533517688512802,
        0.13196495175361633,
        -0.04851682856678963,
        0.02521803043782711,
        0.0655372366309166,
        0.028652537614107132,
        0.09342543035745621,
        0.0968606099486351,
        -0.06025301292538643,
        0.017401261255145073,
        0.057619914412498474,
        -0.004289585165679455,
        -0.0215363297611475,
        0.08746850490570068,
        0.09040413796901703,
        -0.060793280601501465,
        -0.045181769877672195,
        -0.05354591831564903,
        -0.013895396143198013,
        -0.045593276619911194,
        -0.021356115117669106,
        -0.03691638261079788,
        0.058118924498558044,
        0.09053997695446014,
        0.07295745611190796,
        0.03636778146028519,
        0.030599936842918396,
        0.006442117504775524,
        0.11429057270288467,
        -0.01445062831044197,
        -0.08819185197353363,
        0.014029200188815594,
        0.036305103451013565,
        -0.04810458794236183,
        0.06220623478293419,
        0.031088506802916527,
        -0.05594557896256447,
        -0.0861581489443779,
        0.022625822573900223,
        0.005169891286641359,
        0.026876352727413177,
        0.06204161047935486,
        -0.02818736806511879,
        -0.08182477951049805,
        0.025627389550209045,
        0.04133882746100426,
        0.003929717931896448,
        0.03214462846517563,
        -0.0995655506849289,
        -0.0015280634397640824,
        0.016426967456936836,
        -0.01901068165898323,
        -0.0698218047618866,
        -0.03958212211728096,
        -0.05410817265510559,
        -0.042342301458120346,
        -0.07226581126451492,
        -0.05934207886457443,
        0.07388167083263397,
        0.03147011995315552,
        0.049844127148389816,
        0.025999216362833977,
        -0.07513345777988434,
        0.011689161881804466,
        -0.1628721058368683,
        0.014055750332772732,
        0.021532736718654633,
        0.04000371694564819,
        -0.037362679839134216,
        0.060322053730487823,
        -0.00606538774445653,
        -0.028847668319940567,
        -0.026889445260167122,
        -0.1051669493317604,
        0.061817996203899384,
        0.10019469261169434,
        -0.10047829896211624,
        -0.07288781553506851,
        -0.043201763182878494,
        0.0065505169332027435,
        -0.07912006974220276,
        0.0195959210395813,
        0.051309894770383835,
        0.053026266396045685,
        0.07230278104543686,
        -0.0149415647611022,
        0.0006655172910541296,
        -0.007184525486081839,
        -0.07173257321119308,
        -0.0396951325237751,
        -0.003998616710305214,
        0.014784801751375198,
        0.01709730550646782,
        0.020856425166130066,
        -0.055498093366622925,
        -5.149272105560231e-33,
        0.018181515857577324,
        -0.03595675155520439,
        -0.03391961753368378,
        -0.023581339046359062,
        -0.0017337538301944733,
        -0.030669070780277252,
        0.035853177309036255,
        -0.04204162210226059,
        0.07230155169963837,
        -0.009480581618845463,
        -0.06152546405792236,
        -0.04573092237114906,
        0.030259672552347183,
        0.029636172577738762,
        0.01931631937623024,
        0.008420731872320175,
        -0.010803060606122017,
        -0.07525292038917542,
        -0.024656090885400772,
        0.024110639467835426,
        0.04967327043414116,
        0.08739450573921204,
        -0.01429310254752636,
        0.003678755136206746,
        0.005026392173022032,
        0.08028773218393326,
        0.037066180258989334,
        -0.04804995283484459,
        0.07166110724210739,
        -0.013314960524439812,
        -0.05215086787939072,
        -0.08500641584396362,
        0.0015860358253121376,
        0.02988903969526291,
        0.03297339379787445,
        0.06135741248726845,
        0.06218069791793823,
        0.006977208890020847,
        -0.01457130629569292,
        -0.06628945469856262,
        0.017065949738025665,
        0.023115569725632668,
        0.0007283602608367801,
        -0.02683212049305439,
        -0.022705411538481712,
        -0.011587444692850113,
        -0.029537558555603027,
        0.03149859234690666,
        -0.0480465292930603,
        0.02084464393556118,
        -0.072456493973732,
        -0.009132299572229385,
        0.004709835164248943,
        0.015779277309775352,
        -0.05829774588346481,
        -0.05283055081963539,
        -0.04420680180191994,
        0.04006332531571388,
        0.06807317584753036,
        0.022359628230333328,
        -0.0018066129414364696,
        -0.050886835902929306,
        -0.02973155304789543,
        -0.02352537028491497,
        -0.048198435455560684,
        0.003828486194834113,
        0.03588942438364029,
        0.037658534944057465,
        -0.08429629355669022,
        0.03685007989406586,
        0.06793151050806046,
        0.013715052045881748,
        0.0710747241973877,
        -0.08709808439016342,
        -0.03693414852023125,
        0.03568819537758827,
        -0.020394377410411835,
        -0.020306764170527458,
        0.01390837226063013,
        -0.018134474754333496,
        0.017551500350236893,
        -0.0715203508734703,
        0.09830088913440704,
        0.04178740456700325,
        0.0842641070485115,
        0.012906000949442387,
        0.02813086099922657,
        -0.01649046130478382,
        -0.014534559100866318,
        0.060349419713020325,
        -0.06921056658029556,
        -0.004495244938880205,
        0.04253055900335312,
        0.09719550609588623,
        0.06740020215511322,
        -6.333936397595608e-08,
        0.02097094990313053,
        0.037054676562547684,
        0.00766208628192544,
        0.021458802744746208,
        -0.032075729221105576,
        -0.0751955658197403,
        0.028344694525003433,
        0.022223392501473427,
        0.05704754218459129,
        -0.015396283939480782,
        0.048827216029167175,
        -0.0643148198723793,
        -0.056888945400714874,
        0.05461115390062332,
        0.006892714183777571,
        0.11685308814048767,
        0.0023589686024934053,
        0.04087552800774574,
        0.007207954302430153,
        0.06590612232685089,
        -0.07602950930595398,
        -0.02663821540772915,
        -0.015268297865986824,
        -0.010366820730268955,
        -0.0037091777194291353,
        0.03514418005943298,
        -0.00875826831907034,
        -0.010780912823975086,
        0.054445672780275345,
        -0.028295021504163742,
        -0.005247077904641628,
        -0.008620289154350758,
        0.06039417162537575,
        0.022205589339137077,
        0.0007374765118584037,
        -0.12388260662555695,
        -0.054080780595541,
        -0.012513971887528896,
        0.06296337395906448,
        -0.012754409573972225,
        0.016896503046154976,
        -0.04010196030139923,
        -0.06566403806209564,
        0.02715328335762024,
        0.005814686883240938,
        -0.05497314780950546,
        -0.034666482359170914,
        -0.0865553766489029,
        -0.07478741556406021,
        0.10641321539878845,
        -0.05489746853709221,
        0.014188225381076336,
        0.012645128183066845,
        0.09189434349536896,
        0.12476178258657455,
        0.025217663496732712,
        0.10192001610994339,
        -0.02860935404896736,
        -0.03724592179059982,
        0.07007995992898941,
        0.052065301686525345,
        0.05384759232401848,
        -0.030147626996040344,
        0.06495942175388336
    ]
}