{
    "id": "_Z45ii8zZPQ",
    "title": "UVLEN Scam Follow-Up (Good News and Bad News) - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2021-02-18T19:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=_Z45ii8zZPQ",
    "category": "Science & Technology",
    "tags": [
        "UVLEN Scam Follow-Up (Good News and Bad News) - Krazy Ken's Tech Talk",
        "UVLEN",
        "Tech Scam",
        "Scam-Busting",
        "iPhone",
        "UVA",
        "UVB",
        "UVC",
        "Far-UVC",
        "UV Light",
        "Bacteria",
        "Disinfecting",
        "Hand Sanitizer",
        "Pandemic",
        "Germs",
        "CRT",
        "Ultraviolet Light",
        "Green Laser Pointer",
        "KTP",
        "Potassium titanyl phosphate",
        "Infrared Light",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Tech",
        "Computer Clan",
        "Apple",
        "AidPods Max",
        "AirPods Max Knock-Off",
        "StarScope Monocular"
    ],
    "views": 214070,
    "likes": 8998,
    "comments_count": 428,
    "description": "It's time to follow up on the UVLEN scam-busting, and Krazy Ken has some good news and some bad news. Quick recap, the UVLEN claims to be \"digital hand sanitizer,\" but is it really? Check out part 1 of the initial scam-busing below  Watch part 1 of the UVLEN scam-busting   Watch part 3!    Watch more scam-busting episodes   Download our epic wallpapers   Support our channel and get cool stuff    Subscribe and listen to our podcast   Subscribe for more tech videos!    Follow us on Twitter   Like us on Facebook    Krazy Ken's Tech Talk - UVLEN Scam Follow-Up (Good News and Bad News)  Special thanks to @bartek_chmiel1 (Twitter) for calling UVLEN, and helping out with the episode.   Patrons got to see this episode early (and in much higher playback quality). They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program. #KrazyKen #ComputerClan",
    "description_links": [
        "https://youtu.be/DcaDKF1wb5I",
        "https://www.youtube.com/watch?v=iNxh6CfM-Hg",
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1riKzQK3dHt6c9_6D2lVwr78",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "https://anchor.fm/computerclan",
        "http://subscribe.thecomputerclan.com",
        "http://twitter.com/thecomputerclan",
        "http://facebook.com/computerclan",
        "http://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- In this day and age, during a pandemic a device which can convert your phone's flashlight into UVC light to disinfect your hands sounds like a miracle, right? Too bad, it's a load of crap. Now I talked about this scan product in the past episode but now it's time for a follow-up. Hey guys how are you all doing? If you're new here welcome. My name is Krazy Ken. And today we're revisiting the UVLEN product. I promised you guys a follow up and here we are. I'm all about setting expectations. So I'm just gonna get this out of the way right now. No, they have not sent me the product yet. They haven't even given me a tracking number. They are being very uncooperative but I'm not giving up yet. Now, if you haven't seen the first part of this whole shenanigan, go ahead and check that out first. But in summary, here's what UVLEN claims to be. UVLEN claims their product can convert light from your smartphones flashlight into far-UVC light allowing it to disinfect your hands and other surfaces. I'd paid the $15 over a month ago for this product. And I still haven't received it or a tracking number. So with that disappointing news out of the way here are the next things I need to address the science behind the product, science, how I'm gonna test the product's effectiveness, if it ever arrives and how I'm trying to get a hold of the company. So let's take a look at number one. In the original episode, I said there's no way a color filter which is what this thing looks like. Can magically increase the frequency of a wavelength from visible to far-UVC light. Judging by the small size and low price of this product. I think it's safe to say this is merely a color filter which only allows certain frequencies of visible light to pass through. No magical disinfecting can take place. Plus the wording on their website appears to be a bunch of nonsense, nothing that actually explains how this product works in the real world. However, I should have done a better job at explaining how matter can increase the frequency of a wavelength. And I appreciate everyone who mentioned this in the comments. For example, certain green laser pointers will emit infrared light internally which is a lower frequency than visible light. But when that infrared light passes through KTP the frequency doubles, creating green light. So in the world of science, this is very possible. But again, it's very hard to justify that this is what's happening with the UVLEN product but let's say this product magically does work. How would I test it? Well, I have a few ideas. The first test is simple. I will shine the UV light at an object which would normally react to UV light like a monochrome CRT special thanks to Tech Tangents for reminding me of this simple trick. Then to test for UVC light, I would use a UVC testing card which will glow if it detects UVC light. And finally the most important experiment would be to test the disinfecting capabilities of the product, because that's why it exists in the first place. So I got some Petri dishes, prefilled with agar and some fun little swabs here so I can collect some samples and see if the product actually can kill bacteria. I would simply swab a germ infested surface like an uncleaned iPhone screen. Then rub the swab onto the egg york. Then I would shine the UVLEN at the iPhone screen for the recommended 10 seconds and repeat the process with another Petri dish. I would set the dishes in a dark room temperature environment and check for bacteria growth. But alas, my lovely Petri dishes go neglected because the UVLEN product isn't here but there are some species that are taking advantage of this because I already have a bacteria colony growing and haven't even done anything yet. So what the fricking heck is going on here? Well, it seems like the company doesn't have any real product. I can't think of another reason why they wouldn't ship anything to me that or there's some other reason, I don't know Chinese new year is the excuse I hear from pretty much everybody. So I tried getting a hold of these guys in the last episode I attempted to call the phone number on the website but I kept getting an error. And I'm guessing this has to do with me calling a number outside of the United States but I'm not a hundred percent sure on that one. Oddly enough, the phone number was removed from the website shortly after I posted my episode, strange. Thankfully one of my international viewers saved the number and tried calling them. - [Man] Yes, you're talking right now with UVLEN technology. How can I help you? - [Customer] I want to ask how does the UVLEN actually work? - [Man] That is actually with our tech department you're calling sales department right now. If you want, I can set up a call for you and then they will call you back. - [Customer] When could you set it? - [Man] I will suggest to you to send an email on our website suggesting for technical support. They will reply as soon as possible. - So unfortunately not much help there. He tried calling back, he couldn't get through. He assumed his phone number was blocked. He even tried calling with a friend's phone or he asked his friend to call so completely different phone number and no one would still answer. And it's not just with the phones. He sent the email. They said, they'd get back to him in 48 hours. It's been weeks and we've still heard nothing. So these UVLEN guys are acting real shady but for grins and giggles, I thought, hell I'll just email them with the email info in my receipt. And they responded in eight hours. They said that they're sorry, and the product is on its way. So then I followed up asking for a tracking number and they didn't reply. It's been a week despite them replying to the first email in only eight hours. They haven't said anything in over a week big red flag guys, if you're doing business with the company and they will not give you tracking numbers and you're supposed to have them, run. So I'm gonna follow up again with another email. But honestly, guys, I wouldn't keep your hopes up. I don't think this product is ever gonna arrive which is a big shame because I was really looking forward to doing my little experiments but they know they're caught. That's why they're not replying or anything. So whatever, I'm only out 15 bucks, but while we wait I am working on other episodes. I typically work on multiple scam busting slash knock-off investigations at once. And I'm really excited for the future. One of them has to do with these AirPods Max knock-offs. I have a really fun plan in mind for that but I can't say anything about it because it might blow my cover. So stay tuned for that. If it ever arrives, it will be really fun. And I also received a lot of requests for the StarScope telescope that you can attach to your iPhone. Yeah, my bullsh*t detector was going off like a pinball machine. So I'm really excited to dig into that one too. And if any of you guys have suggestions for other knock-off tech or scam tech just feel free to send me a DM on Twitter and I can look into it. And if you wanna help support the Computer Clan and fund our future and get some awesome perks along the way, feel free to pledge to my Patreon and you can help me buy some more scummy products. Thanks in advance for your support. And hey, if you liked this episode, you know what to do. Thanks for sticking with me catch the crazy and pass it on.",
    "transcript_keywords": [
        "product",
        "UVLEN product",
        "UVLEN",
        "light",
        "number",
        "UVC light",
        "phone number",
        "day and age",
        "pandemic a device",
        "guys",
        "UVC",
        "phone",
        "email",
        "tracking number",
        "UVLEN claims",
        "episode",
        "test",
        "calling",
        "Tech",
        "Petri"
    ],
    "transcript_entity_values": [
        "only eight hours",
        "a hundred percent",
        "Chinese",
        "15",
        "StarScope",
        "15 bucks",
        "KTP",
        "weeks",
        "Patreon",
        "10 seconds",
        "today",
        "Krazy Ken",
        "eight hours",
        "a month ago",
        "this day",
        "first",
        "one",
        "48 hours",
        "Tech Tangents",
        "a week",
        "UVLEN",
        "One",
        "the United States",
        "iPhone",
        "AirPods Max",
        "Twitter",
        "the Computer Clan",
        "UVC",
        "Petri"
    ],
    "transcript_entity_types": [
        "TIME",
        "PERCENT",
        "NORP",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "DATE",
        "PERSON",
        "TIME",
        "DATE",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "NORP"
    ],
    "vector": [
        -0.1390954703092575,
        -0.018519101664423943,
        0.01006496325135231,
        -0.056842442601919174,
        0.03170348331332207,
        -0.0060420893132686615,
        0.13141818344593048,
        0.02902204357087612,
        -0.02609681338071823,
        0.000464742595795542,
        0.03895854949951172,
        0.049806833267211914,
        0.07241366058588028,
        0.01689101941883564,
        -0.034806717187166214,
        -0.031563371419906616,
        0.08807455748319626,
        -0.08125337958335876,
        -0.0852690190076828,
        0.06916545331478119,
        -0.05501995235681534,
        -0.07322978228330612,
        0.04250717535614967,
        -0.04087495431303978,
        0.02951144240796566,
        0.0342479944229126,
        -0.052484333515167236,
        -0.07122433930635452,
        -0.03449256718158722,
        -0.06228630617260933,
        -0.019499490037560463,
        0.04810779541730881,
        -0.007571402937173843,
        0.007077283225953579,
        0.04065755754709244,
        -0.004328502342104912,
        0.02611572854220867,
        -0.04028718173503876,
        -0.07289500534534454,
        0.056197673082351685,
        -0.015917545184493065,
        -0.12173881381750107,
        -0.05640373378992081,
        0.04525088891386986,
        -0.04427405446767807,
        0.0042181541211903095,
        0.07065466046333313,
        0.017010901123285294,
        0.042375411838293076,
        0.0019401450408622622,
        -0.04522959142923355,
        -0.08010783046483994,
        0.0849747508764267,
        0.010591146536171436,
        -0.08060602098703384,
        -0.047662507742643356,
        0.02172301523387432,
        -0.0083151338621974,
        0.025926170870661736,
        -0.009153557941317558,
        0.047346197068691254,
        -0.06778256595134735,
        -0.02281069941818714,
        0.0536489263176918,
        0.036829233169555664,
        -0.01272598560899496,
        0.027629930526018143,
        0.053610991686582565,
        0.026627354323863983,
        -0.04712934419512749,
        -0.02105366252362728,
        0.002826907206326723,
        -0.001507571549154818,
        0.08987396955490112,
        0.05407920479774475,
        0.03991681709885597,
        0.06348074972629547,
        -0.04838135838508606,
        0.06738200783729553,
        -0.031548839062452316,
        0.0492495633661747,
        -0.0045850276947021484,
        -0.02917790226638317,
        -0.013876431621611118,
        0.03926074877381325,
        0.04721483960747719,
        -0.019091403111815453,
        -0.003155487822368741,
        0.060078270733356476,
        -0.03354131802916527,
        -0.04552485793828964,
        0.04407026618719101,
        0.04093046486377716,
        -0.05262671038508415,
        -0.004552232101559639,
        0.017736099660396576,
        -0.022807665169239044,
        0.021117914468050003,
        -0.07057424634695053,
        0.049068011343479156,
        -0.024065587669610977,
        -0.030077900737524033,
        -0.05953032523393631,
        -0.11605900526046753,
        0.0549326166510582,
        -0.0755956694483757,
        0.0012189785484224558,
        0.07219591736793518,
        0.025898033753037453,
        -0.02782226726412773,
        -0.023861344903707504,
        0.07393570244312286,
        -0.018520347774028778,
        -0.0350739061832428,
        0.037981513887643814,
        0.11000388115644455,
        0.0017401501536369324,
        0.02424630895256996,
        0.05544814094901085,
        -0.07060930132865906,
        0.05492718517780304,
        0.038466062396764755,
        -0.03223646432161331,
        0.0030620999168604612,
        0.045654959976673126,
        -0.008534914813935757,
        0.030232669785618782,
        4.9935139612884933e-33,
        0.0032700446899980307,
        0.11285927891731262,
        -0.07537707686424255,
        -0.0434219054877758,
        0.03230893239378929,
        0.05275334417819977,
        -0.034690018743276596,
        0.044077012687921524,
        -0.08496759831905365,
        -0.031223108991980553,
        -0.0705970823764801,
        0.0022939087357372046,
        -0.03174665570259094,
        0.03334473446011543,
        -0.013900618068873882,
        -0.052769821137189865,
        -0.02063233032822609,
        0.013588020578026772,
        -0.1104421392083168,
        -0.059744469821453094,
        0.0824202224612236,
        0.04037044569849968,
        0.0208418108522892,
        0.04178652539849281,
        -0.04987175017595291,
        0.005497046746313572,
        -0.05009175464510918,
        0.02728607878088951,
        0.1343124806880951,
        0.04240027442574501,
        -0.09356112033128738,
        -0.00021351831674110144,
        0.020595649257302284,
        0.04285931959748268,
        -0.01682005636394024,
        0.04820789024233818,
        -0.11722079664468765,
        -0.0808960348367691,
        0.04042103886604309,
        0.001045052777044475,
        -0.09001090377569199,
        0.07159034162759781,
        -0.07373552769422531,
        -0.027147207409143448,
        -0.07100629806518555,
        -0.023327568545937538,
        -0.0156441330909729,
        0.011212778277695179,
        -0.016101395711302757,
        -0.0047375475987792015,
        -0.07403861731290817,
        0.04830782115459442,
        -0.023788955062627792,
        0.03066539764404297,
        -0.044087138026952744,
        0.017404265701770782,
        0.07255914062261581,
        -0.02855451963841915,
        0.00652132835239172,
        -0.008056456223130226,
        0.055556703358888626,
        0.03657094016671181,
        0.006113618612289429,
        0.07954593002796173,
        -0.043093856424093246,
        -0.020593592897057533,
        0.08096585422754288,
        0.07337378710508347,
        0.009790100157260895,
        -0.03216150775551796,
        -0.0348297581076622,
        0.06363177299499512,
        0.008064578287303448,
        -0.01728934608399868,
        -0.008277194574475288,
        -0.06041839346289635,
        -0.022887328639626503,
        0.01647571101784706,
        -0.019157279282808304,
        0.07435084879398346,
        0.006173276342451572,
        -0.02424299158155918,
        0.07739158719778061,
        -0.012829386629164219,
        -0.07933537662029266,
        0.012556097470223904,
        0.027598852291703224,
        -0.021755477413535118,
        -0.044746026396751404,
        -0.02260356955230236,
        0.021511811763048172,
        -0.048754774034023285,
        -0.009487567469477654,
        -0.028186095878481865,
        -0.01813308149576187,
        -5.63954324863936e-33,
        -0.022137247025966644,
        -0.012970873154699802,
        0.00230183033272624,
        -0.010543441399931908,
        0.015414299443364143,
        -0.028043825179338455,
        -0.03323635086417198,
        0.012708977796137333,
        -0.02904806099832058,
        -0.044057492166757584,
        0.028739996254444122,
        0.014677450060844421,
        -0.07850517332553864,
        -0.03095737285912037,
        0.015653472393751144,
        -0.02041039802134037,
        0.05624490976333618,
        0.008160694502294064,
        -0.010056358762085438,
        -0.09035638719797134,
        0.1203497052192688,
        0.04231433570384979,
        -0.09405907988548279,
        0.09873640537261963,
        -0.04417557269334793,
        -0.03086499497294426,
        0.051521703600883484,
        0.05929221212863922,
        0.050000712275505066,
        0.0528324730694294,
        -0.03758563846349716,
        0.04252318665385246,
        -0.04105449467897415,
        0.03413788974285126,
        0.06253352016210556,
        -0.0027512984815984964,
        0.09133175760507584,
        0.03847406432032585,
        -0.08186271041631699,
        -0.059161845594644547,
        0.13186964392662048,
        -0.026005826890468597,
        -0.11536683142185211,
        -0.015284530818462372,
        -0.03738517686724663,
        0.02490413561463356,
        -0.09849957376718521,
        -0.003635822795331478,
        0.007541843689978123,
        0.02009079046547413,
        -8.11129721114412e-05,
        -0.04747561365365982,
        0.056539323180913925,
        0.008012596517801285,
        -0.09372376650571823,
        0.022716455161571503,
        -0.0045250700786709785,
        0.04677770286798477,
        0.04781683161854744,
        0.005738488864153624,
        -0.005363399162888527,
        -0.006610408425331116,
        -0.028025738894939423,
        -0.03569107502698898,
        0.03455661982297897,
        -0.009572000242769718,
        0.047448012977838516,
        0.03622407838702202,
        -0.05771927908062935,
        -0.04719563573598862,
        0.04750727489590645,
        -0.02015705779194832,
        0.003162149339914322,
        -0.08912930637598038,
        -0.0009445834439247847,
        0.008086709305644035,
        -0.054913319647312164,
        0.0032921696547418833,
        -0.09897228330373764,
        0.0029878709465265274,
        0.030908500775694847,
        -0.04329371452331543,
        0.017432324588298798,
        0.05908730626106262,
        0.08817847073078156,
        0.06034281849861145,
        0.03377179056406021,
        -0.019189326092600822,
        -0.09470777958631516,
        0.02522122487425804,
        -0.09506326168775558,
        -0.04349958151578903,
        -0.02151963673532009,
        0.1453881859779358,
        0.089992955327034,
        -6.044948008820938e-08,
        0.06686167418956757,
        0.04517611861228943,
        -0.011184257455170155,
        0.003896219190210104,
        0.013479555957019329,
        -0.009557555429637432,
        -0.08510429412126541,
        0.08340345323085785,
        -0.021479349583387375,
        0.007109285332262516,
        0.030739564448595047,
        -0.0053686220198869705,
        0.0027729892171919346,
        -0.024221578612923622,
        0.026756059378385544,
        0.04338373988866806,
        -0.06066837161779404,
        -0.008122630417346954,
        -0.03562192618846893,
        -0.08266479521989822,
        0.028186079114675522,
        -0.046961065381765366,
        0.11437595635652542,
        -0.03122156672179699,
        -0.05015145242214203,
        0.07738083600997925,
        0.012448546476662159,
        0.1046336218714714,
        0.04970387741923332,
        -0.044847436249256134,
        -0.038341619074344635,
        -0.014157061465084553,
        -0.005976331885904074,
        0.018121784552931786,
        -0.06517865508794785,
        0.043201904743909836,
        -0.06725089251995087,
        -0.018339520320296288,
        0.03723285719752312,
        0.1344480812549591,
        -0.020356755703687668,
        -0.0509602352976799,
        0.026283210143446922,
        0.05759529769420624,
        -0.019109398126602173,
        -0.017413662746548653,
        -0.04380625858902931,
        -0.060693416744470596,
        0.10256838798522949,
        -0.06201429292559624,
        0.0210006944835186,
        -0.03794412687420845,
        -0.028741518035531044,
        0.05820092931389809,
        0.0061020394787192345,
        0.012291474267840385,
        0.023810047656297684,
        -0.0459219329059124,
        0.025373319163918495,
        0.060913849622011185,
        0.021905671805143356,
        -0.0829462930560112,
        -0.005868513602763414,
        0.04764962196350098
    ]
}