{
    "id": "a12_ztNJ87c",
    "title": "This Made Me So HAPPY!!! - Fanatec CSL DD Racing Sim Motor",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-08-28T18:54:38Z",
    "video_url": "https://www.youtube.com/watch?v=a12_ztNJ87c",
    "category": "Science & Technology",
    "tags": [
        "Fanatec",
        "Racing",
        "CSL",
        "DD",
        "Motor",
        "Direct DRive",
        "Direct Drive",
        "Accuracy",
        "Precision",
        "Real",
        "Realism",
        "Simulation",
        "Gaming",
        "Games",
        "BMW",
        "Porsche",
        "Electric",
        "Steering",
        "Force Feedback",
        "Shifting",
        "Jake",
        "Unboxing",
        "Newton Meter",
        "Torque"
    ],
    "views": 1380759,
    "likes": 39011,
    "comments_count": 1704,
    "description": "Fanatec's CSL DD Racing Motor completely changed driving simulator games for me. Most times, force feedback is a rumble, but this almost made it feel like I'm driving on a real race track!   Sign up for Private Internet Access VPN at    Check out the Fanatec CSL DD Racing Sim Motor at   Buy Logitech G915 TKL Keyboard On Amazon (PAID LINK):  On Best Buy (PAID LINK):  On Newegg (PAID LINK):   Check out the Glorious Model D Wireless at   Check out the Maingear Turbo Gaming PC we used at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - Intro 0:30 - Unboxing 1:39 - Motor impressions 2:29 - Motor internals 3:27 - Why direct drive is great! 4:45 - Assembly 9:10 - Sponsor - Private Internet Access!! 9:34 - Gaming and first impressions! 12:22 - Andy's impressions 13:24 - Final thoughts",
    "description_links": [
        "https://www.privateinternetaccess.com/ShortCircuit",
        "https://lmg.gg/A9IZe",
        "https://geni.us/UOVq",
        "https://geni.us/sk0kMYd",
        "https://geni.us/XqL19B",
        "https://geni.us/EvQ9ddC",
        "https://lmg.gg/bFhcS",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Wow. The feedback is crazy. Wow. I just want to keep playing it. Can you see the smile on my face? (Grunts) (Slams) Here I have some fantastic new kit from Fanatec. This is the CSL DD a direct drive wheel from Fanatec that promises to deliver the performance of a $1000, $2000 or $3000 racing wheel for like $400, - $500.(Chuckle) That's insane. Let's check it out. Every driver has their limit. Yeah, that's definitely for sure. (Chuckle) My limit is further than others. Oh, this is like a flex thing here. - (Guest Speaking) - Go away, Riley. Okay. We got the manual in the box. Oh, it's a quick, quick guide. Presumably to Mount the thing and plug the stuff in. We don't need that. We get some stickers. Oh, this is so cute. Look at this, Andy, do you want a sticker here give me your forehead. Thanks, Andy. Woah, look at this. This is actually really, really smart. They put holes in the cardboard. Pretty Cool - (Guest Speaking) Yeah. It's probably Stuff in the box, I reckon. I think these are for, if you have a racing wheel stand, you would slide these into like the grooves in this metal housing and then thread the bolts into there. So we won't Need those. We have, oh, look at that type C. - [Guest] Yaay. Wow. Throw the box Away. (Chuckle) This thing is chunky. Oh. (Grunts) Wow. It's really heavy. (Grunts) It's really heavy. Ohh, Oh My Gosh, Wow. Oh, they didn't put holes on the other side. That's it? That's all. That's all that's in the box. This Is impressive. Oh. (Grunts) This This, Totally makes sense. I mean, what you have is a giant aluminum housing here and then inside the motor in here is going to be basically, just a ton of copper. So the fact that this is really heavy, it makes sense. Oh we got a Wow, that scale is terrible. Why would anybody want that? Ohh. 11 pounds, Wow. It is. Like I said before, a really nice machine to aluminum housing. It looks like it sort of splits off in the back. You could probably take this apart. Should we take this apart? - No, really? Oh, they're just hacks. Oh, we're totally taking this apart, John. Oh, John oh we must, There's not really any moving parts. Like this shaft should just be held in the motor magnetically and the rest of it should just be like electronic and crap. So yeah. We're totally taking this apart. It's got some torque. Oh, this is plastic. Oh, interesting. Yeah. Okay. So the, the ends are plastic, but the main housing is definitely still aluminum. Oh my God. You ready Brandon? (suspenseful music) Oh, no. He can't see anything. Damnit. It's all hidden. Oh. - [Guest] You can't go farther than that - No. I can't, But look at that machining. Oh, so nice. Is this the type of aluminum extrusion? Somebody in the comments? Let me know. Anyways. So if we could see inside, we're going to, we're going to show you some screenshots from their website. You would see the star of this show, which is the custom built direct drive motor. They made specifically for this unit. Now, if you don't know anything about steering wheels, there's a couple of different types. You can either get a direct drive. You can get a belt driven or you can get a gear-driven. And now typically for budget wheels, which I mean can be anywhere from like a hundred to $500, which is sort of your budget to mid-range category. You're going to see a lot of belt-driven and gear-driven. And basically what those have is a, a much smaller motor, which will then use gearing or a belts ratio to increase the torque. But on a direct drive, you have none of that belt. And none of that gear, that means there's going to be a lot less play and you're gonna get way more accurate feedback. And in the case of this unit, we're also gonna get a lot more powerful feedback. Now, the wheel I usually use at home Is a thrust master T-300 I'm not like a crazy expensive baller SIM racer. Umm, and that guy, I think outputs around 3.9 Newton meters of torque. Whereas this unit with the optional boost pack, will do eight Newton meters. Which is, which is double. That's uhh. That's a lot of torque. Okay. So a bit of a correction here. Uhh. It turns out this is just the regular power supply. Umm. It's a 90 watt unit. And then the boost pack is 180 Watts. We don't have that one, unfortunately, but we will at least get to experience it in 5 newton meter mode Okay, Let's put this thing back together though. - (Guest speaks) I don't know if you can read this as part of our standard QC process. This wheelbase has passed a durability test, which causes slight marks on the quick release surface this product, whereas this marks with the marks with pride. Oh, that's cute. Before connecting the wheelbase to your PC, please install the latest Fanatec driver, then update the wheelbase firmware. Okay. We can do that. Let's try mounting it to the desk first. Oh, the sticker is terrible. Oh No, Fanatec why? The goo is coming off. It's just a lot of paper. You got a knife? I'll use this plug. See how this Goes. Cool that worked. All right. This worked I'm good. So I think I need to affix this before I can quick release, but maybe not. I mean, does this have a quick release on it right now. I think I'll read the manual. It's probably a safe bet. Cool. This is useless. Says nothing about the steering wheel. Nice. Sweet. You Know, it's always weird to unbox a steering wheel. You're like, this should be in a car. (Funny Noise) - [Brandon] It has plastic handles. - It Does have flappy paddles. They feel like garbage, but this guy goes on here and then it clips onto this. I'm pretty sure. Ooh. (Sratching Noise) Remove with care. Oh, Oh yeah. This one's plastic. Like it's, it's a, it's a plastic-y material that like doesn't rip. How do I, oops. Oh, oh. Oh, I see. Cool, that's like the, uh the electrical connectors for like the buttons and stuff Its backwards, there we go, oh nice. Wow. This is a lot of, there's a lot of set-up fantasy. I like that they use Loctite, this is nice. All right, I'm done. Cool. All right. So we've got our quick release hub, attached. Oh There we go. Wow. Nice. (sigh) Now just one more thing to do. It is a substantial amount of stuff to do. (Guest Speaks) Like, I am not denying in any way, shape, Or form that this is a quick set up process. (Chuckle) Well it depends how much you play 1 category of game because I, it is so much better when you want to play a racing game. So I think that has to go in there. This guy definitely goes into here and this will be under the table? And then I think we get this guy to go on there for extra torque. It's like the it's the boost kit, but for this handle, and then, no... there we go. (Grunts) Oh it's so heavy LTT store.com (Chuckles) That is janked. I mean, I can tighten it a lot more. I'm worried this Ikea table is going to like crush itself or break some of this plastic. Okay. Yeah. That's, that's totally fine. Yes. There's pedals. Oh we haven't even done that yet. (Honking Noise) Please tell me the pedals don't have to be put together. Whoa. That's got a little Spongy. See that little sponge in there. I get it. The reason there are so many pieces is so you can customize it. If I put it like this, though, is it going to wobble? Like maybe I just have to move them over and ignore the fact that we have a clutch pedal. I actually, I have experienced the reason that you're not supposed to drive with flip-flops and I go to press the brake as I'm going around the corner, like in the parking garage and my foot slipped off. And then my flip- flop got stuck behind the pedal, so I couldn't press it. And I ended up like scraping my bumper against the wall. Okay. We got gas. We have brake, squishy brake. I guess it's time to go set this up on our computer, but not before I tell you about our sponsor Private Internet Access private internet access is a VPN that allows you to access services and websites as if you were in a different country. Not only that, but Pia encrypts, all of your internet traffic and uses a safe, protected IP. And you can connect up to 10 devices at once with clients, for windows, Mac, OS, Android, iOS, and Linux. Whew. So check it out at the link in the description and you can get a one-year plan for only 39.95. I got the wheel and the pedals plugged in and hooked up. And we actually had to update the firmware on both. The steering wheel itself which was just kind of crazy and the motor and we've loaded up a Assetto Corsa, which is usually my preferred game of choice. It's got presets, but they never really work. So we kind of have to set this up manually there's our steering axis, brake, brake. Press that. That needs to be inverted Specifically. I wanted to import the car that I own right now, which is an E60 M5 And we're going to do it on the Nordschleife and see how that goes. (Chuckles) Oh yeah. Oh wow. The force feedback is, oh, this almost feels like a real car. Oh that, oh, oh. Oh man. The pedals are too close together. The force feedback is incredible. And this is not even with the boost kit. That's incred..this..that's crazy. What is that number? Is that miles per hour? Oh, I'm going to go on the dirt. I'm going in the dirt. I'm going to the dirt. Wow. The feedback is crazy. Oh boy, I'm going way too fast oh, come on baby. Oh. Oh, Oh man. - Whoa, the steering is not. You see what that's not right. I think I have some @#!% misconfigured here. There's so much feedback in this wheel. It's shaking the whole desk. Uhh these pedals. Look at this. There we go. That's proper. Now I have no excuses for sucking. Oh boy, (laughter) I should have picked an easier car. This thing's a boat. Oh, oh, (laughter) come on. Oh man. I definitely started to get the hang of it a little bit more there, but wow. That's (chuckle), I've never actually played on a direct drive wheel and the, the sharpness and the aggressiveness of the feedback is, is unlike anything I've played before. Like this is so much better. And when you consider the marginal increase over like a high-end belt-driven wheel, uh high-end a good belt driven wheel. Like a thrust master T-300. This is so much better. And we don't even have the boost pack. Holy Crap. Wow. I just want to keep playing it. Can you see the smile on my face? Oh my God. The pedals feel good. It's just. They're not mounted to anything. So, they're kind of flopping around everywhere. I'm impressed. Good job. Fanatec. I am I'm genuinely impressed. Should we get somebody else to try it? (chuckle) Andy's a drift guy. - Oh Wow - Forgot. It's 500 horsepower. - Oh My God. This is steering wheel feels so good. - (Laughter) Ohhhh, (Laughter) - And there's deer. This car sucks. (Laughter) - Do you want a different car really quick? I'll give you a Porsche or something. You are, you are just pegging it at red line. Whoa, this car's fast. Does it feel like it handles better? - Oh yeah, - Definitely a little. Oh, oh you're going a little fast. But it recovers so easily. Wow. - Yeah So compared to like the Logitech wheel you were using before, What do you think? - This is like a hundred percent improvement. This feels like driving a real car. - I want your you're out of 10. Have you, have you tried anything better than this? - No, no, no. I give you like 9.5 but the 0.5 is because it doesn't really have a clutch. - Well, we can add a clutch - But yeah. So this setup 9.5 - Yeah, yeah, yeah. Okay. All right. Well there you have it. Clearly, this is a fantastic product. I mean, I still have (exploit) grin on my face and I'm not even driving. I don't think that speaks for it enough. So maybe check out my short circuit that I did on the flight SIM set up, which was pretty fun. I think Andy, did you fly in that? - Yeah, yeah, yeah I did. - Yeah he flew in that. We didn't get. - Off camera We didn't get to the office, he wasn't in the video. - I did. - Oh you did Like off camera though. - It wasn't in the video. It doesn't matter. Didn't happen. Get subscribed and uhh, maybe uhh, leave a like if you liked this video.",
    "transcript_keywords": [
        "Yeah",
        "Wow",
        "wheel",
        "steering wheel",
        "lot",
        "feedback",
        "quick",
        "car",
        "steering",
        "Fanatec",
        "direct drive",
        "pedals",
        "drive",
        "thing",
        "nice",
        "direct drive wheel",
        "quick release",
        "Cool",
        "Andy",
        "direct"
    ],
    "transcript_entity_values": [
        "400",
        "up to 10",
        "0.5",
        "Newton",
        "2000",
        "1000",
        "one-year",
        "11 pounds",
        "only 39.95",
        "Sratching Noise",
        "Riley",
        "one",
        "90 watt",
        "Assetto Corsa",
        "Pia",
        "Mac",
        "Logitech",
        "500.(Chuckle",
        "IP",
        "Andy",
        "Mount",
        "Porsche",
        "John",
        "Watts",
        "Newton",
        "Ikea",
        "Linux",
        "3000",
        "Brandon",
        "first",
        "10",
        "1",
        "180",
        "Fanatec",
        "Android",
        "Fanatec",
        "T-300",
        "500",
        "5 newton meter",
        "Loctite",
        "an E60 M5",
        "CSL",
        "hundred percent",
        "VPN",
        "9.5",
        "Nordschleife",
        "eight",
        "a hundred to $500",
        "LTT store.com"
    ],
    "transcript_entity_types": [
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "LOC",
        "ORG",
        "PERSON",
        "LOC",
        "GPE",
        "ORG",
        "PERSON",
        "MONEY",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG"
    ],
    "vector": [
        -0.10543002933263779,
        -0.038915492594242096,
        0.07398327440023422,
        -0.06332401931285858,
        0.035958826541900635,
        0.018103143200278282,
        -0.018953152000904083,
        -0.02090662531554699,
        0.03296511992812157,
        0.01570039987564087,
        0.025669222697615623,
        -0.004544162191450596,
        -0.0247492715716362,
        -0.1014239713549614,
        0.0039094784297049046,
        -0.012966384179890156,
        0.1745554655790329,
        -0.02811567671597004,
        -0.05345050245523453,
        -0.015735460445284843,
        -0.022682474926114082,
        -0.05692567676305771,
        0.04920392483472824,
        0.022778639569878578,
        0.004228361416608095,
        -0.031753867864608765,
        0.013572171330451965,
        0.049444589763879776,
        -0.009813523851335049,
        -0.07899509370326996,
        -0.001494015334174037,
        -0.01170479878783226,
        -0.029345830902457237,
        -0.007281858939677477,
        -0.004009725991636515,
        -0.12401485443115234,
        0.014535597525537014,
        -0.0862112045288086,
        -0.08394820988178253,
        -0.04813864454627037,
        -0.010843122377991676,
        -0.02179185301065445,
        0.07495113462209702,
        0.05061791092157364,
        0.03265899047255516,
        0.018332574516534805,
        0.06231464445590973,
        -0.011827182024717331,
        0.031064389273524284,
        0.025483764708042145,
        0.013789504766464233,
        -0.10287527740001678,
        0.12850376963615417,
        -0.056464098393917084,
        -0.054919980466365814,
        0.042745206505060196,
        0.0355251170694828,
        0.015430189669132233,
        0.056856948882341385,
        0.013314592652022839,
        0.10754294693470001,
        -0.05491090193390846,
        -0.07887805253267288,
        0.021922286599874496,
        -0.04969864711165428,
        -0.0014961707638576627,
        0.010976143181324005,
        0.06156754493713379,
        0.018007677048444748,
        -0.04159126803278923,
        -0.026347031816840172,
        -0.007430037017911673,
        0.0451776422560215,
        0.036270201206207275,
        -0.006144501734524965,
        0.019970081746578217,
        -0.026567619293928146,
        -0.06961051374673843,
        0.11258231103420258,
        0.008246988989412785,
        0.04396751895546913,
        -0.0549725703895092,
        -0.019355954602360725,
        -0.04574566334486008,
        0.03960658982396126,
        -0.053868476301431656,
        0.07637948542833328,
        0.0730898305773735,
        0.019287290051579475,
        -0.057015709578990936,
        0.03920125216245651,
        0.07985711097717285,
        0.03138856589794159,
        0.055104151368141174,
        -0.06025092676281929,
        0.009061369113624096,
        0.019788693636655807,
        -0.03022562339901924,
        -0.025000451132655144,
        0.061417434364557266,
        -0.030485564842820168,
        0.047801315784454346,
        0.04573720321059227,
        0.006361143663525581,
        -0.09039082378149033,
        0.030374590307474136,
        -0.03295394405722618,
        0.08546268194913864,
        0.024902891367673874,
        -0.043659038841724396,
        -0.09732821583747864,
        0.046229470521211624,
        -0.08604989945888519,
        0.06376415491104126,
        -0.014689953066408634,
        -0.017083311453461647,
        -0.09947113692760468,
        0.032702889293432236,
        0.06234641745686531,
        -0.022331509739160538,
        -0.04223181679844856,
        -0.05550080165266991,
        -0.0436258502304554,
        0.01009298861026764,
        0.11278776824474335,
        -0.009404977783560753,
        -0.033704373985528946,
        6.538776957893224e-33,
        -0.034979045391082764,
        0.08227968961000443,
        -0.028672941029071808,
        -0.008213629014790058,
        -0.0034476020373404026,
        0.036200109869241714,
        0.04331684857606888,
        -0.044075917452573776,
        -0.08194927126169205,
        0.043961476534605026,
        -0.057804904878139496,
        0.014795529656112194,
        -0.08193272352218628,
        -0.009051792323589325,
        0.009256355464458466,
        -0.08875460922718048,
        -0.09949088096618652,
        -0.06161908805370331,
        -0.0014509176835417747,
        -0.013234547339379787,
        0.08500108867883682,
        0.02544110268354416,
        0.009680270217359066,
        -0.010400752536952496,
        0.03221585229039192,
        0.045522380620241165,
        -0.04574906826019287,
        0.023942891508340836,
        0.12014202028512955,
        0.04742235690355301,
        -0.03662661090493202,
        -0.04618752375245094,
        -0.021392691880464554,
        0.007429983466863632,
        -0.007961119525134563,
        0.04915304854512215,
        -0.06276654452085495,
        -0.09560266137123108,
        -0.01102416031062603,
        0.03685484826564789,
        0.0032851125579327345,
        -0.021240321919322014,
        -0.16167297959327698,
        -0.08682779222726822,
        -0.07761473953723907,
        0.009289883077144623,
        -0.010467557236552238,
        -0.016992079094052315,
        0.0035002517979592085,
        0.014202895574271679,
        -0.10909785330295563,
        0.02426380105316639,
        -0.06480181217193604,
        -0.021466081961989403,
        -0.01821723021566868,
        -0.0535145029425621,
        0.07961466908454895,
        -0.016504863277077675,
        0.006596135441213846,
        0.05639081448316574,
        0.0035465259570628405,
        0.04195540398359299,
        0.020947158336639404,
        -0.10646481812000275,
        -0.053898610174655914,
        0.037026021629571915,
        0.01949489675462246,
        -0.023715049028396606,
        -0.05628671497106552,
        -0.04275806248188019,
        0.016456181183457375,
        0.016628731042146683,
        0.022223232313990593,
        0.0304160974919796,
        0.02055334858596325,
        -0.009016388095915318,
        -0.11712940037250519,
        0.0012573124840855598,
        -0.10642380267381668,
        -0.018324322998523712,
        -0.04673878848552704,
        0.02341281808912754,
        -0.03343179076910019,
        0.03745877742767334,
        0.06284601241350174,
        -0.025315403938293457,
        -0.049801263958215714,
        -0.03439638018608093,
        -0.03137864172458649,
        0.034750889986753464,
        -0.09131009876728058,
        0.00872698426246643,
        0.06678816676139832,
        0.08110276609659195,
        -0.02423454076051712,
        -7.479173907918993e-33,
        -0.12164095044136047,
        0.005255815107375383,
        -0.0046256594359874725,
        0.08552006632089615,
        -0.0025939769111573696,
        0.039392173290252686,
        0.08810915052890778,
        -0.0025449751410633326,
        0.057452909648418427,
        -0.0417841412127018,
        0.023734819144010544,
        -0.017588231712579727,
        -0.0022957741748541594,
        0.023822562769055367,
        0.024873832240700722,
        -0.12293296307325363,
        0.009284802712500095,
        -0.07987651973962784,
        0.016297688707709312,
        -0.010168162174522877,
        0.08329425007104874,
        0.026415586471557617,
        -0.012223416939377785,
        0.037703342735767365,
        0.0665452778339386,
        -0.005472647026181221,
        0.01059814915060997,
        0.038914985954761505,
        0.03039265051484108,
        0.051169365644454956,
        -0.002436109585687518,
        0.0783853828907013,
        0.025652829557657242,
        -0.025321274995803833,
        0.054330192506313324,
        0.0007892418070696294,
        0.06717135012149811,
        0.08601053804159164,
        -0.004920911975204945,
        -0.043213311582803726,
        0.01648702844977379,
        -0.006973666604608297,
        0.014566251076757908,
        0.03241810202598572,
        0.026591448113322258,
        -0.00937593262642622,
        -0.032633643597364426,
        -0.14490604400634766,
        -0.011476260609924793,
        0.06767705827951431,
        0.06942713260650635,
        -0.039700888097286224,
        0.0654660239815712,
        0.01689711958169937,
        -0.02543051913380623,
        -0.01112212985754013,
        0.03830360621213913,
        -0.005984331015497446,
        -0.007507137954235077,
        0.003477114951238036,
        0.04166276752948761,
        0.02226327545940876,
        -0.07585599273443222,
        0.05042300373315811,
        0.07548746466636658,
        -0.05039934068918228,
        0.017129071056842804,
        0.04123175889253616,
        0.05885816738009453,
        -0.009947594255208969,
        -0.03968566283583641,
        0.05904485285282135,
        -0.00922210793942213,
        0.003005491802468896,
        -0.018511809408664703,
        -0.005375306587666273,
        0.008544639684259892,
        0.03423233702778816,
        -0.014541184529662132,
        0.00011276350414846092,
        -0.03586991876363754,
        0.10802801698446274,
        0.10865654051303864,
        -0.05516082048416138,
        0.04977341741323471,
        0.045749641954898834,
        0.015301011502742767,
        -0.03302024304866791,
        0.018944183364510536,
        -0.03748607262969017,
        0.008451184257864952,
        0.0330510251224041,
        0.02484520711004734,
        0.062192417681217194,
        -0.010205814614892006,
        -6.255262263721306e-08,
        -0.014571726322174072,
        0.02057512104511261,
        0.028202833607792854,
        0.002584126777946949,
        0.03867786377668381,
        -0.03159787133336067,
        -0.006942837964743376,
        -0.09366326779127121,
        -0.013848770409822464,
        0.005554257892072201,
        0.0780629962682724,
        -0.035997409373521805,
        -0.012610170058906078,
        0.021291259676218033,
        0.0022018845193088055,
        -0.006588857155293226,
        -0.04586736857891083,
        0.04548123478889465,
        -0.02038678526878357,
        -0.0708819329738617,
        0.008855562657117844,
        0.046092938631772995,
        0.012472523376345634,
        -0.026104411110281944,
        0.05670835077762604,
        -0.003433240344747901,
        -0.01937093585729599,
        0.05998949706554413,
        0.026101430878043175,
        -0.06359823048114777,
        -0.04351549968123436,
        -0.031313586980104446,
        0.00838725920766592,
        -0.06584938615560532,
        -0.01591069996356964,
        0.0244572926312685,
        -0.00869297981262207,
        0.08948203921318054,
        0.10257960855960846,
        0.046296775341033936,
        -0.05396263301372528,
        -0.05430997535586357,
        -0.040527112782001495,
        -0.01579565554857254,
        0.036805763840675354,
        -0.03549082204699516,
        -0.07448992133140564,
        -0.11478264629840851,
        0.013563203625380993,
        0.045242082327604294,
        -0.02048066444694996,
        -0.011160030029714108,
        -0.05412245914340019,
        0.019222963601350784,
        0.07348641753196716,
        0.03768334165215492,
        -0.027155093848705292,
        0.037314482033252716,
        -0.06283432245254517,
        0.04829075187444687,
        -0.006604879163205624,
        -0.09289976209402084,
        -0.11748470366001129,
        0.07327675074338913
    ]
}