{
    "id": "a1uLMiUmseQ",
    "title": "M1 Mac Review - Which M1 Mac Should You Get?",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-11-19T21:05:16Z",
    "video_url": "https://www.youtube.com/watch?v=a1uLMiUmseQ",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 701894,
    "likes": 27919,
    "comments_count": 1924,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- [Announcer] What up fam? Do you love Apple computers, but not quite sure which one is best for you? Then pop into IJustine's virtual Mac Depot. Yeah, look, that's Justine right there. She's got old Macs, new Macs, big Macs, small Macs. She's even got a Mac for your freaking dog, man. Good boy. Looking for a new iPhone, boom. Need some accessories, duh. Plus we now have the all new lineup, of 2020 Macs featuring Apple's very own M1 chip. Super cool dude. So, don't wait. Come visit IJustine's virtual Mac Depot today. You'll be glad you did, and so will Justine 'cause she's very lonely. (upbeat music) (phone chimes) - Hi, thank you for coming into Justine's virtual Mac Depot. I'll be right with you. (phone chimes) (computer keyboard clucking) Hi, I'm Justine. How can I help you? Oh, Adrian, hi, very nice to meet you. I'm Justine. This is my Mac Depot, welcome. So, you currently don't have a computer. You do have an iPad. You have an iPhone, and iMac is currently on your agenda, okay. Oh, Adrian, I wish that we had an M1 iMac, that I could sell for you today. Now, we still do have Intel Macs. We have one of the new iMacs back here, that has the nano-texture glass which is beautiful. What, Apple's kind of working, on this little two year transition period, where they're transitioning all of their current Intel Macs, to the M1 chip. We don't have any iMacs with the M1 chip here yet. So, check back later. We probably will be working on those, secretly in the back room somewhere, but I can't give you any information, as to when that's gonna be. But if you are looking for something stationary, I think this Mac Mini might just do the trick. Now, the problem though is it doesn't come with a keyboard, or mouse or a monitor but if you have those already, you can basically use anything. (bell dings) They're sold separately. This is the least expensive Mac, in the entire lineup right now. So, this is starting at just $699, and you can configure this up to 16 gigs of memory, and even with a two terabyte Solid State Drive. So, you're gonna be getting it three times faster CPU, an 8 core GPU for six times faster graphics. There's also an ethernet port. We have HDMI 2.0. You have two USB-C four ports which are also Thunderbolt compatible, and this is also very, very interesting, because this is also compatible, with the new Pro Display XDR displays. So, you can get a full 6K resolution, if you hook this up to one of those displays. Now, those displays are about $6,000. So, at that point, you could probably buy eight and a half Mac Minis. So, think about it. You can start a render farm. I don't know. Maybe that's something that you're into. You could also use either one of these new laptops, as a desktop machine. You just have to plug it into a monitor, so you can basically be using it as a desktop. We got dongles for that of course, so they're sold separately but I got them. But then you can just unplug it, and take it to the other room, or if you are someone who does leave the house, you can take it anywhere. I take mine to bed. That's it. So, just wanna mention that like these three Macs, these are not like top of the line computers. These there's more entry-level Macs, but what's really exciting is we've been able... Well, I don't actually work for Apple. This is a Mac Depot. So, we're kind of just like a little, you know... We're not affiliated, but they have put a lot of pro features, into these entry level devices with this new M1 chip, and it's really, really exciting. So, normally I'm editing, on one of the highest end 16 inch MacBook Pros, and I'm editing a lot of 4K footage, a lot of 120 from the A7S III, and this MacBook Pro, it didn't even skip any frames. I, me, I was impressed. Adrian, I think you would also be pretty impressed as well. The MacBook Air is pretty impressive. I mean, this is a very small device. It's also fanless. So, it is completely silent. So, if you do a lot of like conference calls or zoom calls, or whatever kind of conference call type thing, that you're into there's no fans. It is so quiet. So, you'll never have to worry about that fan noise. And something else that's really cool, is I was editing some 4K footage in Final Cut, and it was seamless. And the fact that I'm editing silently is very impressive. I don't know if you've ever used MacBooks before. They can be a little loud with fans, with the cooling, but because of the M1 chip it's way more power efficient, and that's how they're able to get this fanless design. Now, if you need a little bit more power though, we've got this MacBook Pro 13 inch, and this is very, very interesting, because this is the MacBook, that has the longest battery life of any Mac ever. The other thing that's impressive, is being able to edit 8K ProRes footage, on this small tiny little MacBook. And Adrian, I'm not sure if you're doing 8K footage, but if you are, I mean, you probably aren't gonna be looking at this, to be your main editing machine, but knowing that you're able to do that, it's pretty cool, huh? So, I know you're probably torn, because just looking at these two side by side, the specs are very similar, but with a pro, it does have the fan, so it does consume a little bit more power, because it does have a larger battery. The screen is a little bit brighter, and it does have this touch bar. So, if you do think, that you're gonna be doing more processor intensive things, a lot of photo editing, a lot of video, I would probably recommend the MacBook Pro. I do just wanna remind you, these are the first three M1 devices that Apple has created. There's gonna be more in the future, that will be more powerful than these. So, if you don't think that these could handle the job, of what you need to get done on a daily basis, then I would either, number one, I would wait, or they have a ton of other computers in their inventory, that are still Intel based, that will be supported for many years to come. So, you don't have to worry. You're gonna get an Intel Mac, because you need something more powerful. That's okay. We're not gonna fault you. The one thing I do wanna note, is the storage options on some of these lower end models, is not a lot. It's like 256 gigs. For me that would be one single video and then it's full. But I don't really ever edit any of my footage, off of the system drive. I mostly use that for software. You can upgrade the storage of the two terabytes, but that's where things get spendy. If you're still interested I can do some demos in the back. Just give me a second to set up. (upbeat music) (air blowing) (upbeat music continues) So, the first demo that I'd like to show you is instant on. I completely shut this computer down. It's off. Now watch. This is pretty cool. (computer chimes) Wow, did you also notice, that that little startup chime is back? For our first test let's open up Final Cut, and I will try to edit some 8K footage, and let's see how that works out. The thing that I've really loved a lot, is how quickly this opens. Like the apps are (fingers snapping) super snappy. Look how quick this opens, Final Cut. We just opened up a library, instant. It really is almost instant. This has some 8K footage already in it. I'm just gonna select all of this. I mean, look how quickly I'm editing. I'm moving all of these 8K clips all around. This is all 8K ProRes just for the record. (mellow music) Get out of sharpie and color me impressed. Now, let me drop in some of my 8K ProRes footage. Oh, wow, look at that. My God, look at that. Well, you guys, I'm impressed. We shot this on the RED. This is so freaking fast. Okay, let's get this colored up. (upbeat music) All right, so that was some 8K RED ProRes converted footage. Now, here's a raw clip right from the Sony A7S III. This is shot in 120, 10-Bit. Oh my Gosh. Look at this. This is crazy. This is working so well. I'm not gonna lie. I've definitely been struggling, with some of the A7S III footage, when we've shot it in 120 on some of my Intel Macs. So, I'm gonna slow this down by 50%. (mellow music) This is running so well. So, we're playing right now better performance. So, let's click better quality. And we're gonna start this from the beginning. (mellow music continues) Wow, I'm pretty impressed. Let's drop in some drone footage. Let's see what I've got. Oh, yeah, look at that. Look at that, look at that, look at that. Epic, epic, epic, epic. This is running very well. All right, let's export it. Let's take this bad boy into compressor, and see what you got. Let's just export this full Res see what happens. Just full thing. Here we go. We're sharing it. The fans have not even turned on yet. This is an 8K timeline. Like what the heck? Here it is. This is a full 8K video that just exported. (upbeat music continues) Oh my God, does that look good. (upbeat music) Wanna see another demo? Okay, let's show you how quick things open up, Lightroom. (upbeat music continues) This is loading in a bunch of my files, that I already have uploaded from the Cloud. I mean, this is crazy. Like we can just cruise through these, and then if I wanna import some more let's do that as well. So, here's some photos that were shot on the Sony A7R IV. Let's review these for import. Let's just add them all at 63 photos in the library. Why not? Let's just edit this. How about that one? (upbeat music continues) Let's maybe just click and edit this in Photoshop, 'cause usually this takes a little while, to just sort of pop over into Photoshop from Lightroom. So, we'll see how quick this is. (upbeat music continues) And that was surprisingly also quite quick. Yeah, but here's my photo that I edited in Lightroom, brought into Photoshop. Another demo that I'd like to show you. This is in Affinity Publisher and this is super impressive. I could not believe what I witnessed. So, we've got this really cool vector image here. Now, we're gonna zoom in. We're at 200% right now. Looks cool. Okay, 300, 400, 500%. All right, things are looking good. Everything looks very nice and smooth. Let's keep going, shall we? We're gonna zoom into this toy shop. We are now 2400%, okay? 3,800, oh, look at this suitcase. Oh, hold on a second. We're gonna keep going. Oh, there's a picture on the suitcase. Let's see what's on the picture. Oh, look, another town. Should we keep zooming? Oh, we are now inside of the picture on the suitcase. Look at this. So, I can't even read this number, how zoom in we are. We're like 136 million times zoomed into this. Here we go. (upbeat music continues) Yeah, oh my God. Another thing is very exciting is now on the M1 Macs, we're able to open iPhone and iPad Apps on your Mac. Pretty cool. This is Kitchen Stories. This is an iPad, an iPhone app, and now it's running on my Mac. So, this is gonna kind of open up a whole new world, for developers to start developing not only just for iOS, or iPad iOS but they're able to cross develop. So, they'll be able to work on your Mac. Let's play a game. What's this? Whoa. [Mans Voice] You are comrade Ivanovic Prevalov. - This fan still hasn't turned on. I promise you if I even just opened my 16 inch MacBook Pro, the fan is gonna turn on. So, now that you've seen a little demo, on the new 13 inch MacBook Pro, let's do the same thing on the MacBook Air, and see how this one performs. (upbeat music) So, the demo I'd like to show you on the MacBook Air, this is gonna be a little 4K timeline in Final Cut. This has some ProRes footage. Ready to go, look at this. (upbeat music) Cool, okay, now let me drop in some of my 4K content, see what we can get. Also could just gonna drop in that 8K piece of footage too, and just see how that handles it. You know, I mean, we might as well. I mean, this is a 4K timeline, but this is still handling this 8K clip like a champion. Let's see what else. One of the clips I've gotten here, we've got some content from the A7S III. This is all shot in 120. And I will say that sometimes, using this 120, 10-Bit 422 footage, just right straight off the camera, does give my MacBook Pro 16 inch stutters a little And let's remember this is a MacBook Air, okay? We're doing better performance right now. (upbeat music) So, slow this down to 25%. (upbeat music) I'll do this also to 25. (upbeat music continues) Should I try opening the 8K timeline, and just see what happens? We might as well, right? (mellow music) This is the 8K. It's running quite well. What the heck? Look at this. Let me confirm. Look at this. Look, Adrian, do you see it? This is 8K on MacBook Air. (mellow music continues) And we have a few frames dropped there, but that was two streams of 8K. (mellow music continues) Let's set up the Mac Mini so I can give you a demo of that. (upbeat music) We've now got our Mac mini all set up. The cool thing about the Mac Mini, is that it does have a speaker built into it, and it's not that impressive but it does have one. Obviously, as you can see this is connected, to the Pro Display XDR, and it is running very, very beautifully. So, I just opened up the 8K Library, that we were using on both of the other Macs as well. And here we go. (mellow music) I mean, are you surprised that it's running? Look how big I can make this. Oh my gosh, wow. Normally when I'm editing, I don't edit with a screen that's this large. I'm usually editing, with like a bunch of different screens open. I've got my levels. I've got all kinds of stuff happening. I've got all kinds of things going on. So, having a bigger monitor like this, allows me to have all of my different windows open, and be able to access, a lot of different content even quicker. Wow. All right, let's bring in some of my content, into this timeline. Decided to drive over to the camera. I was like, \"Is this a good idea or is it not a good idea?\" It's probably not. Oh, my gosh and there I was. I was like, \"Whoa, dude, (mumbles)\" Landed there. Yeah, watch this. Oh yeah, that's nice. Okay, so there's a little bit of frames dropping there. So, we are in better performance. Again, this is an 8K timeline. I have a Mac Pro and then I'm using a Mac Mini, to edit 8K footage, and I'm questioning everything Adrian, questioning it all. Well, look at this. (mellow music) (car engine roaring) Wow. Okay, I probably should have turned the audio off. (mellow music continues) So, what's cool now about this Mac Mini is this. It does have an HDMI output. So, you really can use this, as kind of like an entertainment device. You can hook this up to a TV. Anything that is HDMI you can use it. (indistinct talk) No, I thought I wasn't gonna make it. - [Man] But you won't understand. - Editing 8K on the Mac Mini, check. Gaming on the Mac Mini, check. If you'd like I can meet you up at the register. I'm just gonna finish this level very quickly. I hope that I was able, to answer some of your questions today, about the new M1 Mac. Thank you so much for coming into the Mac Depot. I had so much fun chatting with you, but if you have any further questions, feel free to leave them in the comments below. But now I gotta get back to work. I've got a lot of email to take care of. (computer keyboard clucking) (upbeat music) (beep) Okay, I'm gonna get out of the tree. (laughs) (beep) - [Director] Ready to pop up. (laughs) (beep) And go. (laughs) (beep) (laughs) (beep) Down lower and then, yeah. (items falling) - Oh, that wasn't-- (upbeat music)",
    "transcript_keywords": [
        "Mac Mini",
        "Mac",
        "Mac Depot",
        "virtual Mac Depot",
        "Macs",
        "Intel Macs",
        "MacBook Pro",
        "Pro",
        "MacBook",
        "footage",
        "virtual Mac",
        "Justine virtual Mac",
        "Mac Depot today",
        "MacBook Air",
        "Mac Pro",
        "Mini",
        "Mac Minis",
        "Pro Display XDR",
        "Depot",
        "Final Cut"
    ],
    "transcript_entity_values": [
        "about $6,000",
        "one",
        "K ProRes",
        "CPU",
        "16",
        "the MacBook Pro",
        "136 million",
        "a ton",
        "K RED ProRes",
        "just $699",
        "422",
        "Final Cut",
        "Photoshop",
        "the Mac Mini",
        "Pro Display XDR",
        "6",
        "six",
        "Mans",
        "iMac",
        "MacBooks",
        "25%",
        "50%",
        "the Mac Depot",
        "first",
        "Macs",
        "IJustine",
        "Mac",
        "this Mac Mini",
        "MacBook Pro",
        "this MacBook Pro",
        "iPad",
        "25",
        "Ivanovic Prevalov",
        "Mac",
        "4",
        "iPad Apps",
        "M1",
        "MacBook Pros",
        "the MacBook Air",
        "Affinity",
        "Intel Mac",
        "M1 Mac",
        "iMacs",
        "today",
        "Intel Macs",
        "MacBook Air",
        "Mac Minis",
        "3,800",
        "120",
        "eight and a half",
        "iPad iOS",
        "second",
        "MacBook",
        "500%",
        "Justine",
        "this MacBook Pro 13 inch",
        "Sony",
        "iPhone",
        "2020",
        "three",
        "Adrian",
        "this little two year",
        "the M1 Macs",
        "13 inch",
        "8",
        "Final Cut",
        "The MacBook Air",
        "10",
        "ProRes",
        "MacBook Pro 16",
        "400",
        "63",
        "GPU",
        "Intel",
        "Thunderbolt",
        "Mac Depot",
        "many years",
        "Apple",
        "2400%",
        "256",
        "Solid State Drive",
        "300",
        "the MacBook Air",
        "four",
        "number one",
        "Lightroom",
        "200%",
        "daily",
        "16 inch",
        "two",
        "a Mac Mini",
        "M1 iMac",
        "K Library",
        "One"
    ],
    "transcript_entity_types": [
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "FAC",
        "WORK_OF_ART",
        "FAC",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "ORG",
        "ORG",
        "PERCENT",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "FAC",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "FAC",
        "PERCENT",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.01776050589978695,
        -0.0818030908703804,
        0.006482039578258991,
        -0.10635949671268463,
        0.008992579765617847,
        -0.0070046065375208855,
        0.01735212467610836,
        0.032846540212631226,
        -0.06278853863477707,
        0.07927535474300385,
        0.06966889649629593,
        -0.0022653653286397457,
        -0.030047057196497917,
        0.0007575185736641288,
        0.010160032659769058,
        0.058967601507902145,
        0.06357696652412415,
        -0.030554473400115967,
        0.06789848208427429,
        0.046204179525375366,
        -0.008879343047738075,
        -0.03133714199066162,
        0.026397911831736565,
        0.03081040270626545,
        -0.01512820553034544,
        0.09075827151536942,
        0.08114240318536758,
        0.04107450693845749,
        -0.08797024935483932,
        -0.04011444374918938,
        -0.043124984949827194,
        0.00538604473695159,
        0.10183844715356827,
        -0.021679388359189034,
        0.05341697856783867,
        -0.07385092228651047,
        0.0908866748213768,
        -0.05576633661985397,
        -0.0967373251914978,
        -0.07182968407869339,
        -0.07675211876630783,
        -0.008455770090222359,
        0.1080155074596405,
        -0.014444277621805668,
        0.014055885374546051,
        -0.0561031699180603,
        0.017704615369439125,
        -0.05735708400607109,
        0.04658161848783493,
        0.09764364361763,
        -0.007836862467229366,
        -0.07420139014720917,
        -0.009756641462445259,
        0.06625309586524963,
        -0.008237353526055813,
        0.016333885490894318,
        -0.1215311586856842,
        -0.016401441767811775,
        0.04320107772946358,
        -0.039442028850317,
        -0.04206938296556473,
        -0.029398532584309578,
        -0.02721766196191311,
        0.03616034984588623,
        -0.030474748462438583,
        -0.04477610066533089,
        0.04479406401515007,
        -0.027209816500544548,
        -0.011340495198965073,
        0.0450269840657711,
        -0.03830494359135628,
        -0.02313356101512909,
        -0.023018689826130867,
        0.043745603412389755,
        -0.07550907880067825,
        0.025835378095507622,
        0.0240241177380085,
        -0.06946726143360138,
        -0.015579022467136383,
        0.04884898662567139,
        0.04376041516661644,
        0.021039603278040886,
        -0.06814747303724289,
        -0.044959090650081635,
        0.02401108480989933,
        -0.028725994750857353,
        0.008567232638597488,
        0.018042495474219322,
        -0.04054899513721466,
        0.0462435707449913,
        -0.02401263825595379,
        0.030811989679932594,
        -0.02431722916662693,
        0.008557606488466263,
        0.0011203907197341323,
        -0.06216531991958618,
        -0.004788856487721205,
        0.006091502960771322,
        -0.018953945487737656,
        0.040408097207546234,
        0.07782566547393799,
        -0.02403099276125431,
        -0.02086358144879341,
        -0.04778122901916504,
        -0.019340738654136658,
        -0.07802639901638031,
        -0.013904213905334473,
        0.04245731234550476,
        0.06001626327633858,
        0.06453891098499298,
        0.02563554234802723,
        0.030550777912139893,
        -0.06469537317752838,
        -0.032218772917985916,
        0.036125585436820984,
        0.07616197317838669,
        -0.0021513504907488823,
        0.0038973698392510414,
        0.04810567572712898,
        0.05814025551080704,
        -0.03980334848165512,
        -0.05513910576701164,
        0.011572672985494137,
        0.04243878647685051,
        0.011085575446486473,
        0.06531323492527008,
        -0.06377634406089783,
        1.0132795834234674e-32,
        -0.023352859541773796,
        0.026095354929566383,
        -0.022000618278980255,
        0.01566019468009472,
        0.01568923331797123,
        -0.05447719246149063,
        0.06942529231309891,
        0.05043112859129906,
        -0.011416259221732616,
        0.005415561143308878,
        -0.06719479709863663,
        0.02810072712600231,
        -0.0976107269525528,
        0.038611363619565964,
        0.021796466782689095,
        -0.06072349101305008,
        0.03466864675283432,
        -0.04296111315488815,
        -0.06336367875337601,
        0.020107444375753403,
        -0.015409707091748714,
        0.01731305755674839,
        0.04228115454316139,
        0.030340729281306267,
        0.11751712113618851,
        0.06599939614534378,
        0.040969327092170715,
        0.03142338618636131,
        0.08491765707731247,
        0.022510338574647903,
        -0.07403159141540527,
        -0.08411696553230286,
        -0.03198687732219696,
        -0.12895752489566803,
        -0.008412620984017849,
        -0.02353501319885254,
        -0.07218414545059204,
        -0.05357782915234566,
        -0.01588323339819908,
        -0.049510519951581955,
        -0.06501900404691696,
        0.04021156579256058,
        -0.06250094622373581,
        -0.08717375993728638,
        0.07902243733406067,
        0.02284088172018528,
        -0.003453639568760991,
        0.06963597983121872,
        -0.028130104765295982,
        -0.03577224537730217,
        -0.013373074121773243,
        -0.030399322509765625,
        -0.011968852952122688,
        0.021276675164699554,
        -0.06135242059826851,
        -0.015299986116588116,
        -0.011937474831938744,
        0.05702091380953789,
        -0.0011844330001622438,
        0.040463708341121674,
        0.027583248913288116,
        -0.013004472479224205,
        0.039203014224767685,
        0.027068546041846275,
        -0.03646660968661308,
        0.07746831327676773,
        0.03606630861759186,
        -0.027965571731328964,
        -0.02347000688314438,
        0.05577215179800987,
        -0.002781823743134737,
        -0.026461657136678696,
        0.04356004670262337,
        -0.0015999650349840522,
        0.04645169526338577,
        0.0013482777867466211,
        -0.10178012400865555,
        0.044799186289310455,
        -0.03803042694926262,
        0.02519063465297222,
        -0.060999758541584015,
        0.05015929788351059,
        -0.03395649790763855,
        0.10621912777423859,
        -0.060508545488119125,
        0.034431762993335724,
        0.0981397032737732,
        -0.030583012849092484,
        -0.003890709485858679,
        0.05225671827793121,
        -0.03577015548944473,
        0.07868555188179016,
        -0.058976780623197556,
        -0.033143628388643265,
        -0.05416085198521614,
        -9.937472754166165e-33,
        0.05816850811243057,
        0.032225873321294785,
        0.035186342895030975,
        0.035285212099552155,
        -0.05263097956776619,
        -0.03001927025616169,
        0.01347043365240097,
        0.06585325300693512,
        -0.008347917348146439,
        -0.08915335685014725,
        0.06292680650949478,
        -0.039623014628887177,
        -0.1061757355928421,
        -0.020906055346131325,
        -0.01328740268945694,
        -0.03891056776046753,
        -0.06245836988091469,
        -0.07587284594774246,
        0.055510375648736954,
        -0.05407531559467316,
        0.13515262305736542,
        0.08106406033039093,
        0.0925387442111969,
        -0.01770855113863945,
        0.00860623363405466,
        -0.045432787388563156,
        0.02077908255159855,
        0.03186264634132385,
        0.020213203504681587,
        -0.011739053763449192,
        -0.01266133226454258,
        0.01823018118739128,
        0.02875332348048687,
        -0.02372020296752453,
        0.044201310724020004,
        0.06136228144168854,
        0.007172185927629471,
        0.05510305240750313,
        0.03304112330079079,
        0.03812604397535324,
        0.06400667130947113,
        0.01751009188592434,
        0.0058257849887013435,
        -0.03756047040224075,
        -0.009021955542266369,
        -0.05678416043519974,
        -0.03686988726258278,
        0.047100137919187546,
        0.056114695966243744,
        -0.05055157095193863,
        -0.10130564123392105,
        -0.040122974663972855,
        -0.043717160820961,
        -0.034436725080013275,
        -0.021465379744768143,
        -0.058210328221321106,
        -0.09708746522665024,
        -0.03688238561153412,
        0.025971023365855217,
        0.017912711948156357,
        0.03788745403289795,
        -0.003129381686449051,
        -0.062168046832084656,
        -0.09785189479589462,
        0.010113973170518875,
        -0.018401548266410828,
        0.017956219613552094,
        -0.05095406621694565,
        -0.0034165955148637295,
        0.050330113619565964,
        2.8309434128459543e-05,
        0.0038323241751641035,
        0.07631895691156387,
        0.006172909867018461,
        0.017794037237763405,
        0.024717535823583603,
        -0.046950530260801315,
        -0.012724480591714382,
        0.09385589510202408,
        -0.060019154101610184,
        0.0034380394499748945,
        0.030576862394809723,
        0.009706296026706696,
        0.13307398557662964,
        0.00602948060259223,
        0.06715329736471176,
        0.10621528327465057,
        -0.047171905636787415,
        -0.032677486538887024,
        0.043416909873485565,
        0.011544213630259037,
        -0.002710463711991906,
        0.04674458131194115,
        0.034280866384506226,
        -0.1694677323102951,
        -5.3549978673572696e-08,
        0.003047788981348276,
        0.009832588024437428,
        -0.016589293256402016,
        0.027197815477848053,
        -0.011926800943911076,
        0.0030146974604576826,
        -0.07084356993436813,
        0.006772665306925774,
        0.12591873109340668,
        0.014182323589920998,
        0.11134706437587738,
        -0.04936382547020912,
        -0.06296247988939285,
        0.03735821694135666,
        -0.03673584759235382,
        0.0010600372916087508,
        -0.04699934273958206,
        0.029906976968050003,
        -0.027380477637052536,
        -0.054470427334308624,
        -0.019250746816396713,
        0.08152545243501663,
        0.021892307326197624,
        0.0006839028792455792,
        0.03091191127896309,
        0.008587012998759747,
        -0.06132103130221367,
        0.05004410818219185,
        0.023182395845651627,
        0.037066519260406494,
        -0.09312845021486282,
        0.019380714744329453,
        -0.044568635523319244,
        0.041288573294878006,
        -0.021365061402320862,
        -0.06454633921384811,
        -0.07362043112516403,
        0.04713044315576553,
        0.06239056587219238,
        -0.0181320458650589,
        0.007364027202129364,
        -0.1558324694633484,
        -0.025115130469202995,
        -0.04739585518836975,
        -0.04804784432053566,
        -0.05182084068655968,
        -0.010885548777878284,
        -0.07138443738222122,
        -0.1041969284415245,
        0.024875318631529808,
        0.03469949960708618,
        0.006791597697883844,
        0.0752306580543518,
        0.0043558902107179165,
        0.013215913437306881,
        0.016715871170163155,
        0.07936793565750122,
        -0.004247522447258234,
        -0.06992493569850922,
        -0.030673431232571602,
        0.06716655194759369,
        -0.02718503773212433,
        -0.067411407828331,
        0.05703195556998253
    ]
}