{
    "id": "a9Y1ZryyDQw",
    "title": "Now THIS is how you make an entrance! - Beyerdynamic Free BYRD",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-07-28T19:01:34Z",
    "video_url": "https://www.youtube.com/watch?v=a9Y1ZryyDQw",
    "category": "Science & Technology",
    "tags": [],
    "views": 414880,
    "likes": 14809,
    "comments_count": 630,
    "description": "Get $25 off all pairs of Vessi Footwear with offer code shortcircuit at:    Beyerdynamic released their first truly wireless earbuds - the Beyerdynamic Free BYRDs - so Adam gave them a listen to see if these can compete with the current champion of wireless audio, the Apple AirPods Pro.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Play Freebird! 0:06 Who is Beyerdynamic? 0:33 Unboxing and features 1:27 What's in the box? 2:40 Case and aesthetic impressions 3:41 Sponsor - Vessi Footwear 4:11 Touch controls and setup 4:52 App impressions and customizations 5:39 ANC/Transparency impressions 6:30 Audio quality impressions 7:23 Audio personalization and custom EQ 8:19 Comparing to AirPods Pro 9:15 Battery life 9:37 Mic test and comparison to AirPods Pro 10:29 General thoughts 11:10 ANC comparison to AirPods 11:44 Outro",
    "description_links": [
        "https://www.vessi.com/shortcircuit",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Ba bee da bee da do do bee da do da do do Do do do da do do wee do boo boo bee doo bee doo. Free Byrd Beyerdynamic. It's the new hotness. Beyerdynamic has taken their first step into the truly wireless audio space with their Free Byrd headphones. Beyerdynamic is a massive longtime player in the audio space. They make some of the de facto studio recording equipment like the DT 770 Pros. So Beyerdynamic is bringing years of experience in the audio game to these wireless headphones. But, just because you make good sounding headphones doesn't mean you make good wireless headphones because there's a lot of other tech that is expected of wireless headphones, such as noise canceling, microphones for doing voice calling and stuff like that. Get off of there. And these have a lot of that tech built in. They support Qualcomm aptX Adaptive, as well as AAC. I'm not sure if they support LDAC. I really hope they do just because Beyerdynamic's an audio company, lossless audio from LDAC. It features Qualcomm CVC microphone technology which is a noise canceling technology for microphones. So, if you're in a noisy room or there's wind, it'll help cut out some of that noise. But yeah. Beyerdynamics. Hitting a lot of the things we want and also looking pretty slick. But before we get to those let's see what else is in the box 'cause it's telling us, it's telling us right here. See. Find out more. Paper. Whoa, holy cow. Look at all them ear tips. We have a USB C to A connector for charging your case. And a whole lot of ear tips. We have five silicone ear tips and three sets of foam ear tips which is amazing because everybody's got different ears. Having this kind of selection makes sure that you get a proper seal and things sound great. And also having foam tips is great cuz there's people who have silicone allergies or get irritation from silicone and foam tips tend to be a little bit softer on the ear. And we should mention price. These are $250, which puts them at about $30 more expensive than AirPods Pros. But in terms of features and what you're getting in the box, it looks like a good start. Also, you know what else is nice is that they color coded the insides of the ear tips so that if you don't have them in the box anymore you can still tell which sizes are which because they won't have labels on them. But, at least you have this tiny little piece of paper. So you can just keep this and then not have a box taking up space. These also support fast pairing with Android phones, which is nice. It's basically the magic pairing equivalent for Android. So, you just kind of open these near your phone, your phone recognizes it and then you're off to the races. Also, something I've just noticed now is that I think this is all recyclable packaging. So, kudos Beyerdynamic. That's great. Oh, these kind of looks sick. Hinges a little bit, mid-tier. Not gonna lie. Beyerdynamic. Your hinge game is a little bit weak. But uh... Look at those. Don't those look pretty? I mean, just look at these. These are pretty big. They're thick boys. Also, these are rated IPX4, which is sweat resistance. So, splashes stuff like that. Don't take them swimming, but if you're gonna work out in these, they should hold up to sweat. Sweet. These I'm actually so stoked about these. These look great. They kinda look like guitar picks. They look like a plectrum. Oh! They designed them to look that way too. That's kind of cute. Sweet. I'm very excited to listen to these. I'm gonna get some ear tips on these. Let's try the foam ones today. Something to note is that your choice in ear tips can affect the sound. A lot of times foam ear tips can soften things a little bit. Kind of makes sense if you think about how foam absorbs sound waves and stuff like that. It's tough to say but it depends on what fits in your ears the best. That's the most important thing, is what works for you. But before we listen to these, let's talk about our sponsor, Vessi. Vessi footwear is known for being lightweight, easy to pack, comfortable, and most importantly water resistant with its Dimetix technology. Their Everyday Move line is designed with added support at the midsole and better breathability to keep up with your active lifestyle. Take them off, put them on with ease thanks to the handy pull tab. It's also made creature free. So every step you take will be guilt free. Your feet will thank you for wearing these. So say goodbye to wet socks and save $25 with our offer code shortcircuit at Vessi.com/shortcircuit. I like buttons. I didn't see any buttons on these, which I don't like. I like buttons, personally. It looks like they use this central band across the middle. That's where the touch commands actually happen. Tap and hold to activate the voice assistant. Oh yeah, speaking of voice assistants, apparently these have Alexa. I'm not 100% sure what that means because I think it would just use the voice assistant that you have active on your phone. So, maybe these have Alexa at any time if you're not connected to something, or if you're connected to your computer that doesn't have a smart assistant. These do have fast pairing to like... With AirPods on an iPhone, you just open them and then they go, wow. Apparently you have to press the buttons on these. Tap, tap hold. Oh and there you go. They popped up right there. Okay. And in the app we have ways to select our ANC modes, on off and transparent. Our low latency mode, which is great. You can see up time, playback time, phone time, and starts which is kind of interesting. So, if you like keeping stats, I don't know maybe you're a last FM kind of person. I know I am. ANC sound profiles. Personalize your sound with Mimi. Oh, okay so you do a hearing test. Set a volume that is loud yet comfortable. How, how do these look? Do they stick out pretty far? It feels like they stick out pretty far. - [Bell] Yeah. Equalizer. Oh, do they not have a, they don't have a real equalizer. They only have sound profiles, which is kind of a bummer but they have lots of different ones. Okay. They have a control demonstration in here which is cool. Open manual online. We're gonna take a listen. Before I do any sort of app personalization we're gonna take a listen. The ANC is currently on. It's quite nice. A lot of ANC, a lot of automatic noise canceling will cause a small hiss to occur. I hear nothing. This is just like, silence. At least it doesn't sound like anything's coming from the headphone. There's not a lot of sound on set right now but it's doing a good job of blocking the low hum of the HVAC that's going around the building. Like it just completely disappears when I put the ANC in. ANC off I am now hearing the HVAC system come back on. Transparency mode. - [Bell] Hello. Hi. - [Bell] How are you? Oh, I'm absolutely great. It's tough to tell. Can you talk quietly? Talk like, yeah. Talk like you're telling a secret to David. - [Bell] Hey David, (Bell whispering) - I hear you. The transparency mode sounds good and relatively natural Audio quality. Lossless. Okay. We're in. First thing that I notice is that these have quite a wide sound stage. This seems like the high hats in this song they're usually panned pretty far to the right. Whereas the snare is like right in the middle, it's very positional. There's quite a lot of detail. Like in this song you can hear it feels like I can almost hear the bass is, like plucking the bass as opposed to just a bass note. These sound really good. Listening to like Sufjan Stevens. It sounds very, the intimacy of the track comes through his voice. It sounds like he's almost singing directly to you. At the same time I still feel like I'm capturing the grandeur of all of his orchestrations in this track. While everything also is very distinct and separated it feels like I can hear every single instrument that's in the mix. Out of the box they sound great. But let's do their audio personalization. Maybe my sound will be the best sound. It says during the test, you will have to focus on the beeping sound. The beep will disappear into the noise. The background noise will always be there. They give you a sample of what to expect. Okay. Let's start. Let's practice round. Oh, whoop. I did it wrong. Range of details I usually hear versus range of details restored by sound personalization. Oh, apparently I am very suboptimal. I'm going to listen to something that I know very well. Also, these have in ear detection. They keep pausing when I take them out. Okay. So basically what it's doing is that it's applying customized EQ based on my results on the hearing test. I think there was a little bit of a performance error on my part. To me, it's a little bit overbearing. They do bring up the highs because I do have like some hearing loss at my age. Like, it's the natural thing. You just kind of lose the higher end of your hearing. It didn't ruin the music, but it did change it a little bit. So, let's do a quick AirPods comparison just to, probably the most direct competitor. You can see a little bit thicker, a little bit longer, a little bit shorter, very similar shape though. You know, they both sound really good. These definitely have more presence in the low end compared to the AirPods. And it definitely may, they might have a bit of a V curve applied to them. So, a V curve is where the mids are kind of recessed. And you hear a little bit of a bump at the very low bass end to get extra oomph and thump. And then at the high end you get a little bit of extra detail and sparkle because they crank up some of the higher frequencies. Yeah. These sound so good. That extra kind of, they bring that kind of extra life to the mix and the extra little bits of detail that I'm hearing don't seem just to be from an equalizing curve. It sounds like they're just actually a little bit of a more detailed response. So, these get up to 11 hours of battery life on a single listen. I assume that's without noise canceling on. These get five hours without noise canceling on. Even if noise canceling is on and assuming they're not just straight up totally lying, you're still gonna be expecting probably eight hours of listening time. That's ridonkulous. This is a mic test for the Free Byrd, the Beyerdynamic Free Byrds. If I leave here tomorrow, would you still remember me? For I must be traveling on now cuz there's too many places I've gotta see. But if I stay here with you, girl, things just couldn't be the same. Cuz I'm as free as a bird now. And this bird you cannot change. I've learned how not to miss the age of tenderness that I'm so lucky to have seen once. And now that I've become older, I've learned how to brush over my history and how it's sequenced. Listening back to the microphone quality, you can tell that there's a lot more processing on the Beyerdynamics than on the Apple AirPods. But, the AirPods did sound better. And that's probably because they put their mics on the little sticks. They're just literally closer to your mouth. That's always gonna be better. I'm trying to do the volume. Tap tap. Oh, okay. So it's tap hold, and then it will go up step, step, step, step, step, step step. So it's not like tap, hold, tap, hold, tap hold. There's no delay. The control seemed to be working well. I haven't... They're definitely like, you can brush against them and stuff will happen. It's still touch controls, but they're pretty responsive. I like that. From the time I've spent with these, I can wholeheartedly recommend them. They sound excellent. The app needs some work still. There's features missing like a full EQ. And it's kind of wonky with the connection sometimes. Like sometimes I'll have them beside me and in the case and it won't let me edit them or anything. Let's see how the ANC sound works on these. We'll start with the AirPods 'cause we know that they work really well. Apple AirPods. They have good ANC. Who would've thunk? Now let's see the Beyerdynamics. It definitely, it's cutting out less than these but it sounds more natural. I dunno. Yeah. The ANC is definitely working better on the AirPods. So, I think if ANC is really important to you, then you might want to stick with AirPods Pros. I'm going to keep them. I'm gonna, I'm probably gonna keep these around. I definitely wanna spend more time with these. So, yeah. That's the second fun thing-- This is the second pair of headphones that I've really enjoyed on here.",
    "transcript_keywords": [
        "bee doo bee",
        "boo boo bee",
        "boo bee doo",
        "bee doo",
        "boo bee",
        "doo bee",
        "bee",
        "sound",
        "Free Byrd Beyerdynamic",
        "Beyerdynamic Free Byrds",
        "ear tips",
        "bit",
        "ANC",
        "kind",
        "Free Byrd",
        "Beyerdynamic",
        "boo boo",
        "ear",
        "tips",
        "Free Byrd headphones"
    ],
    "transcript_entity_values": [
        "AirPods",
        "Qualcomm",
        "250",
        "three",
        "100%",
        "tomorrow",
        "about $30",
        "Vessi",
        "up to 11 hours",
        "the DT 770 Pros",
        "Free Byrd",
        "iPhone",
        "Mimi",
        "Adaptive",
        "Apple AirPods",
        "25",
        "Bell",
        "the Apple AirPods",
        "ANC",
        "second",
        "Everyday Move",
        "eight hours",
        "Beyerdynamic",
        "Alexa",
        "David",
        "Vessi",
        "AAC",
        "first",
        "Sufjan Stevens",
        "Android",
        "AirPods Pros",
        "EQ",
        "five hours",
        "Free Byrd Beyerdynamic",
        "LDAC",
        "HVAC",
        "IPX4",
        "five",
        "First",
        "bee da do da",
        "years",
        "Beyerdynamic",
        "today"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "MONEY",
        "PERSON",
        "TIME",
        "ORG",
        "FAC",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "FAC",
        "ORG",
        "ORDINAL",
        "ORG",
        "TIME",
        "PERSON",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.04955168068408966,
        -0.05693104490637779,
        -0.010901344940066338,
        -0.06290338188409805,
        0.10763378441333771,
        0.045799825340509415,
        -0.008361606858670712,
        -0.048314064741134644,
        -0.03204362094402313,
        -0.020744627341628075,
        -0.040151868015527725,
        -0.020994100719690323,
        -0.03751551732420921,
        -0.0478963702917099,
        0.023961400613188744,
        -0.014063041657209396,
        0.04428014159202576,
        -0.027765732258558273,
        -0.0334574319422245,
        -0.04056025668978691,
        -0.06088709458708763,
        0.0009184029186144471,
        0.09118335694074631,
        0.04522070661187172,
        -0.016531091183423996,
        -0.028411200270056725,
        -0.014343888498842716,
        -0.016268160194158554,
        -0.002115415409207344,
        -0.06315363198518753,
        0.0662963017821312,
        0.028681853786110878,
        0.026108380407094955,
        0.0153443468734622,
        -0.004583068657666445,
        -0.038439761847257614,
        -0.028567573055624962,
        -0.038045670837163925,
        -0.08382151275873184,
        0.0017420928925275803,
        -0.051085129380226135,
        -0.051427945494651794,
        -0.05146697536110878,
        0.025027964264154434,
        -0.07083461433649063,
        -0.03418261930346489,
        -0.04235844686627388,
        -0.015295622870326042,
        0.015458524227142334,
        0.06499703228473663,
        0.0003781256382353604,
        -0.0845177099108696,
        0.04904932901263237,
        0.005457306280732155,
        -0.05122532695531845,
        0.021023662760853767,
        -0.05874660611152649,
        -0.006382162682712078,
        0.02303463965654373,
        -0.00665601622313261,
        0.043833453208208084,
        -0.06638330221176147,
        -0.0031870973762124777,
        0.009417364373803139,
        -0.006583746988326311,
        9.003390732686967e-05,
        -0.043055105954408646,
        0.10860420018434525,
        0.030890541151165962,
        -0.0037363183218985796,
        -0.014014484360814095,
        -0.0065427194349467754,
        -0.033765923231840134,
        0.06558132916688919,
        0.0033043010625988245,
        -0.017517777159810066,
        0.034513264894485474,
        -0.01534210704267025,
        0.0026066983118653297,
        0.10663238167762756,
        -0.013376519083976746,
        -0.092527374625206,
        -0.002460769610479474,
        -0.07279329746961594,
        0.05494244769215584,
        0.005380556453019381,
        -0.006590873468667269,
        0.00024790994939394295,
        -0.09876355528831482,
        -0.0367431640625,
        -0.15211519598960876,
        0.053994596004486084,
        0.033920932561159134,
        -0.050302792340517044,
        0.01757175289094448,
        -0.042754799127578735,
        -0.06609964370727539,
        -0.0536961667239666,
        -0.0316707007586956,
        0.08001852035522461,
        0.017648907378315926,
        0.020298007875680923,
        -0.04214315116405487,
        -0.044361662119627,
        0.0125582255423069,
        -0.12939685583114624,
        -0.010600270703434944,
        0.06184178218245506,
        0.08025303483009338,
        0.07292083650827408,
        -0.04647301137447357,
        -0.03356229141354561,
        -0.017085004597902298,
        -0.03648409992456436,
        -0.01148158684372902,
        0.08317052572965622,
        -0.09410719573497772,
        0.0887170284986496,
        0.08220750838518143,
        0.004418613854795694,
        0.022773897275328636,
        -0.018094375729560852,
        0.029968783259391785,
        -0.023126043379306793,
        -0.04010174050927162,
        -0.061589717864990234,
        -0.07110870629549026,
        1.009470697036765e-34,
        0.015349569730460644,
        -0.02728443220257759,
        -0.05512399971485138,
        -0.014633486047387123,
        0.0931258425116539,
        0.03526243939995766,
        -0.04175816848874092,
        0.02768479660153389,
        -0.08496706187725067,
        0.05892563611268997,
        -0.062264639884233475,
        0.022539647296071053,
        -0.0339507982134819,
        0.028770431876182556,
        0.0034043483901768923,
        -0.08626917004585266,
        -0.08561985939741135,
        0.008633745834231377,
        -0.05485807731747627,
        -0.02181500941514969,
        0.004195265006273985,
        0.007024101912975311,
        -0.05147942900657654,
        0.07810194790363312,
        0.08757159113883972,
        0.0049097188748419285,
        -0.02535104937851429,
        -0.08270996063947678,
        0.09538096934556961,
        0.03970305621623993,
        -0.06404199451208115,
        -0.06825146824121475,
        -0.04229047894477844,
        -0.08559021353721619,
        0.019329862669110298,
        -0.022964974865317345,
        -0.08206235617399216,
        -0.041572488844394684,
        0.028152721002697945,
        0.012514946050941944,
        0.07865890860557556,
        -0.08554665744304657,
        -0.07240590453147888,
        -0.11219290643930435,
        -0.0071753221563994884,
        0.0270466897636652,
        0.039722952991724014,
        0.04786626249551773,
        0.052672069519758224,
        -0.0687294453382492,
        0.01576443761587143,
        0.002455561188980937,
        -0.09560740739107132,
        -0.09569407254457474,
        0.046822309494018555,
        -0.09243269264698029,
        0.0208901334553957,
        0.073944091796875,
        0.07130080461502075,
        -0.02142052911221981,
        -0.026289798319339752,
        0.060609329491853714,
        0.03181115537881851,
        -0.07598993927240372,
        -0.06497125327587128,
        0.01598249562084675,
        0.011214164085686207,
        -0.02418675646185875,
        -0.0724562481045723,
        0.0023693882394582033,
        -0.009888017550110817,
        0.04680747911334038,
        0.018602008000016212,
        -0.04454585164785385,
        0.0118046710267663,
        0.04092966392636299,
        -0.03538166359066963,
        -0.0657983273267746,
        0.07217060774564743,
        0.026463599875569344,
        -0.025258850306272507,
        0.03404156491160393,
        0.07702988386154175,
        0.02532586082816124,
        0.043426573276519775,
        -0.06411309540271759,
        -0.01585652492940426,
        -0.08686328679323196,
        -0.07650207728147507,
        -0.01041750144213438,
        -0.039191603660583496,
        0.08988344669342041,
        -0.09669677913188934,
        -0.023948268964886665,
        0.009981165640056133,
        -3.9192080008949115e-33,
        0.03001689538359642,
        0.09426122903823853,
        0.02276952750980854,
        -0.019765734672546387,
        0.11601481586694717,
        0.06591319292783737,
        0.09199950844049454,
        0.03217213973402977,
        0.09876357764005661,
        -0.0011224208865314722,
        -0.014807316474616528,
        -0.03101947531104088,
        -0.09639057517051697,
        -0.03419986739754677,
        0.013740926049649715,
        -0.12078822404146194,
        -0.00821433961391449,
        -0.04922639578580856,
        0.0065872808918356895,
        -0.0050211078487336636,
        0.03197266906499863,
        0.03621545061469078,
        0.0524115152657032,
        -0.011255846358835697,
        -0.07673104107379913,
        -0.02683865651488304,
        0.13795273005962372,
        0.07447905838489532,
        0.003463482717052102,
        0.03695229813456535,
        -0.009015696123242378,
        -0.045520078390836716,
        -0.05152454599738121,
        0.03330599144101143,
        0.050037629902362823,
        0.017855707556009293,
        0.03647802025079727,
        0.057107891887426376,
        -0.053436145186424255,
        -0.049166928976774216,
        0.03355317562818527,
        0.0006418171105906367,
        -0.042071983218193054,
        -0.04933617264032364,
        0.004883134737610817,
        -0.0876649022102356,
        -0.14422911405563354,
        0.04394664615392685,
        -0.019011901691555977,
        -0.059112921357154846,
        0.024146612733602524,
        0.004526188131421804,
        0.015405098907649517,
        0.022884495556354523,
        -0.07832448929548264,
        0.04998805373907089,
        -0.06733410805463791,
        0.032754670828580856,
        0.08786359429359436,
        0.015948543325066566,
        0.026406025514006615,
        -0.03484930098056793,
        -0.008486485108733177,
        -0.015462495386600494,
        0.00381472148001194,
        -0.005641392432153225,
        0.00927368551492691,
        0.09391169250011444,
        -0.0076385969296097755,
        0.02465478517115116,
        0.023681294173002243,
        0.027343332767486572,
        0.03024589642882347,
        0.03012869320809841,
        0.02537979744374752,
        0.08175324648618698,
        0.007843025960028172,
        -0.0011916578514501452,
        0.07430778443813324,
        -0.04880782589316368,
        -0.05892108753323555,
        0.06079361215233803,
        0.019884945824742317,
        -0.02431495115160942,
        0.15644551813602448,
        0.03945264592766762,
        0.06505158543586731,
        -0.027462415397167206,
        -0.05138503760099411,
        0.07933388650417328,
        0.0018263774691149592,
        0.03479957953095436,
        0.0528535358607769,
        0.08564571291208267,
        0.027745475992560387,
        -6.081912573563386e-08,
        -0.013734964653849602,
        0.03529014438390732,
        0.01487979106605053,
        0.02715631201863289,
        0.027552781626582146,
        -0.009926768951117992,
        0.013391746208071709,
        -0.05554669350385666,
        0.05982736498117447,
        -0.0021258569322526455,
        -0.009614251554012299,
        -0.04056544229388237,
        -0.04591613635420799,
        0.08616034686565399,
        0.01927924156188965,
        0.02880450151860714,
        -0.05578218400478363,
        0.026618342846632004,
        -0.012662932276725769,
        -0.0221538208425045,
        0.0013793923426419497,
        0.06776643544435501,
        0.08098272979259491,
        -0.0589311420917511,
        -0.045749563723802567,
        0.019681673496961594,
        0.061041802167892456,
        0.04088527709245682,
        0.0494520403444767,
        -0.012052013538777828,
        -0.08673363924026489,
        0.011631100438535213,
        -0.05664049834012985,
        -0.0374501496553421,
        -0.04519938677549362,
        -0.048007309436798096,
        -0.07968954741954803,
        0.009621591307222843,
        -0.04670553654432297,
        0.03296265751123428,
        -0.015193073078989983,
        -0.01927519589662552,
        0.04643279314041138,
        -0.0027944573666900396,
        -0.01786132901906967,
        -0.025975994765758514,
        0.0698150172829628,
        -0.05090021714568138,
        -0.00244250800460577,
        0.04615425691008568,
        -0.01530148833990097,
        -0.0030597976874560118,
        -0.012598217464983463,
        -0.0003612105792853981,
        0.06205795705318451,
        0.06033170968294144,
        -0.005450570955872536,
        -0.015872452408075333,
        -0.07774149626493454,
        0.0436871163547039,
        -0.02937774546444416,
        -0.02767081931233406,
        0.03467718884348869,
        0.04772788658738136
    ]
}