{
    "id": "AbBpmGX7K4w",
    "title": "We were WRONG about RAM – Or were we?",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-08-20T17:02:12Z",
    "video_url": "https://www.youtube.com/watch?v=AbBpmGX7K4w",
    "category": "Science & Technology",
    "tags": [
        "ram",
        "memory",
        "system",
        "speed",
        "ddr",
        "ddr3",
        "ddr5",
        "mt/s",
        "megatransfers",
        "latency",
        "gaming",
        "productivity",
        "incorrect",
        "methodology",
        "cpu",
        "gpu",
        "software",
        "operating system",
        "complexity",
        "bandwidth",
        "textures",
        "3D models",
        "assets",
        "performance",
        "testing",
        "benchmark"
    ],
    "views": 1595800,
    "likes": 66770,
    "comments_count": 2321,
    "description": "Check out the $14.99 Minnow set and the $19.99 Moray set at:   For CPUs back in 2013, we said RAM speed didnt matter. But as CPUs and GPUs have gotten faster and we move to DDR5, everyones suddenly very interested in memory. What changed, and were we wrong then, too?  Discuss on the forum:   Buy an Intel Core i9-12900K:   Buy a ASUS Maximus Z690 Hero:   Buy a RTX 3080:   Buy a DDR5 RAM 6000Mhz Ram Kit:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:46 Theory 1: Test methodology was bad 2:50 Theory 2: Software is more complex now 4:12 Theory 3: GPUs are MUCH faster now 5:50 Theory 4: CPUs are MUCH faster now 7:46 So which theory was most right? 8:57 Conclusion: Why does RAM speed matter now?",
    "description_links": [
        "https://www.ifixit.com/LTT",
        "https://linustechtips.com/topic/1450503-we-were-wrong-about-ram-%E2%80%93-or-were-we/",
        "https://geni.us/F14VY0",
        "https://geni.us/OpTR1c",
        "https://geni.us/TKBrXv",
        "https://geni.us/JiANMU",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- This video from 2013 has 2.5 million views, and yet it's straight up wrong. Can you imagine how many gamers, for all these years, we convinced RAM speed didn't matter? We now know it does matter. But here's a question for you: when did RAM speed start to matter? Were we wrong before? Or did something change since baby faced Linus was still using Windows 7? And if so, what? I can tell you nothing changes about these segues to our sponsor. - iFixit, for repairs on the go, iFixit has you covered. Find out more about the ultra portable Minnow and Moray sets, and how they can make your repairs easier at the end of the video. (upbeat dance music) (upbeat dance music) (upbeat dance music) - We've got a few theories about why the impact of RAM speed is different for gaming today, than it was nine years ago. And while we all agree that each of them is probably true, we don't know which is the most influential. Since I'm already here, let's start with my theory, which is this: the benchmarks themselves were flawed, and so our results were also flawed. Looking at the old video, where we claimed RAM speed didn't matter, we ran a GTX 660Ti at 1080p max settings with anti-aliasing enabled. We are GPU-bound out the wazoo, which isn't going to tell us much about how the RAM is behaving. I need to redo these tests with reasonable settings, so I pulled those old parts out from the archives and built a similar enough system to rerun Metro: Last Light. The numbers won't quite line up since we don't have our 660Ti anymore, but we can see how it does with this factory overclocked 660. At the original benchmark settings, we're once again looking at very little difference between the RAM speeds. Technically our 2666 kit runs over 5% faster in minimum frame rates, but that translates into less than a whole frame per second in the real world. So... yeah. If we turn off anti-aliasing, we're still seeing a similar result, despite the lesser load on the GPU. And so when we switch over to more modest in game settings that we see almost no difference across the board. What? Okay, then. I expected that the higher our frame rates, the more RAM speed would matter. I guess the result makes some sense, seeing as the higher the settings, the more data needs to pass through the CPU to the GPU. Maybe if I run a notoriously CPU-bound title at eSports settings, we'll get more of an impact on RAM speed? Kinda. Minimum frame rates creep up as we go up in RAM speed, but it's not by a lot, and average FPS doesn't change by much. Cinebench R15 also doesn't show much of a difference in CPU rendering. Although, we depart from our original review here by mostly even jumps, as we go up the stack in OpenGL. Did I just accidentally prove our old video right? Well, not so fast. Let's hear Jake's theory. - Games have gotten a lot bigger over the last nine years. And because of that, a ton of data has to go to the GPU very quickly. Top that off with more intense physics, calculations, and heavier operating systems with more going on in the background, and you've got yourself a RAM bottleneck. So my theory, or at least part of it, is that RAM speed just didn't matter as much back then, and what changed is actually the games. - Which is a good point. We saw this in reverse when we dropped the settings down in Metro, and got less disparity between our RAM kits. Cinebench OpenGL gave us another clue, which is in its CPU utilization. It seems like three, to four threads are in use at any given time. So larger, more modern games, with bigger assets that use more threads, should show a greater disparity between our RAM kits. So let's test Jake's theory. The most modern title we have, that I can easily run on Windows 7 is Shadow of the Tomb Raider, which is both pretty large, and uses multiple threads. And, well, slow RAM hurts a bit at 1080p ultra, but there's no tangible difference going from 1600 to 2666, despite the immense cost difference when it was new. Cutting the detail level to low, narrows the gap even further, which tracks with what we saw in Metro. Bigger assets need faster RAM, or a bigger bag. Hey! Back orders for the backpack are up, and so are the reviews! Go check 'em out, you can fit so many assets in there. So Jake's onto something. Assets are a factor, but now we had to ask: is that all there is? Let's hear Linus's thoughts. - Since we made that video, GPUs have gotten ridiculously powerful. Even just three years later, we went from a GTX 660 with two gigs of RAM and an anemic processor, to the 1060, a mid-range GPU that had up to six gigabytes of VRAM, not to mention that it was much more powerful. So my theory is that as GPUs have gotten more, and more powerful, they've also become more, and more demanding on the rest of your system. Whether we're talking about PCI express slot bandwidth, or, you got it, system memory bandwidth. - This is probably the most obvious difference between our old test setup and today's. So let's test that. I slotted an RTX 2080 Ti into the old bench, in place of the GTX 660, and oh boy does it ever make a difference. Not just that it's so much faster than the 660, but we finally see scaling between our memory speeds. The difference in Metro is at minimum, about 5% going from 1600 to 2666, and the absolute chasm between 800 and 1600, is staggering. Shadow of the Tomb Raider, similarly slams the slow memory, and gives the fast stuff a roughly 10 to 12% advantage over the typical frequency, back in the day. CS:GO, despite being notoriously CPU-bound, is ironically less sensitive here. Perhaps due to the settings, or those old assets, but the biggest difference being in average frame rate. So, Linus was onto something here. But there's a twist. Cinebench, again, doesn't seem to care, until we boot up the OpenGL test where we get similar scaling to the GTX 660. That test must be CPU limited, since we've removed all the other variables. Which is where Alex's theory comes into play. - Since 2013 CPUs have gotten bonkers fast. We've gone from dual cores being fine, and quad cores being high end, and they couldn't even break four gigahertz. Now quad cores are low end, and we're easily pushing past five gigahertz on eight core processors, it's crazy. Plus, CPUs have gotten way faster in terms of IPC, and they have way bigger caches. Keeping that many cores fed means you need faster RAM. So, my theory is that in 2013, we simply didn't have enough cores, and general CPU speed, for RAM speed to really make a difference. - Another good point, and illustrate it, I've taken our modern Core i9-12900K and tweaked its DDR5 to be as slow as possible. Yes, that says DDR5-1600. It benchmarks close to, but still a little bit faster than the DDR3-1600 on our old bench. But, with about 2.5 times the latency. It's as close to apples to apples as we'll get, and we'll have the benches parts linked down below. With the RTX 2080 Ti, the difference RAM speed makes is material in Metro, but it's not as major as you might think, at less than 10% going from DDR3 to DDR5. And that carries over to CS:GO, too. And again, there's virtually no difference in Cinebench, whatsoever. We need something more modern to really see the difference here. So I fired up F1 2021 and Far Cry 6 with and without HD textures. And, yeah, the difference between 1600 and 6000 is incredible, especially in Far Cry 6, where we're looking at upwards of 50%. But something magical happens when we look at the numbers for 4800 megatransfers per second RAM, versus 6000. Look at that. Does it remind you of something? Yeah, it's more or less in that zero to 5% range just like our old bench tests. This time, the 2080 Ti is the bottleneck. There's always something isn't there? For the sake of completeness, when we pair the GTX 660 with the modern system, it's predictively GPU-bound in every scenario, except CS:GO, where the extra RAM speed did help pretty significantly in both minimum and average frame rates. With all the testing done, it's time to answer the question: what changed? Our old testing methodology didn't actually end up playing a major role. In fact, it turns out that, anti-aliasing aside, running games at higher quality is a good benchmark for testing RAM speed. Software, on the other hand, did in fact change things, sometimes dramatically. But, only to a point. If your CPU and GPU are being properly fed, and fully utilized, it becomes a question of how fast that hardware is, rather than how fast the RAM is. And, if they aren't being fully utilized, then faster RAM will nudge them closer to peak performance. That means that faster memory today may, or may not significantly improve performance, depending on the application and your hardware. But, later on down the road, when you upgrade your GPU, you'll be bottlenecked far less if you have faster RAM. In other words, our old video wasn't technically wrong. But there's far more to the story than we understood back then. And almost certainly more that we didn't uncover today. What we did learn today, was that compared to CPUs, GPUs are more sensitive to changes in RAM speed, or at least the RTX 2080 Ti is more sensitive to RAM speed than our 12900K is. Our test suite was limited, so Radeon or Ryzen may scale differently. The big takeaway, is this: it's that combination, of software complexity, more available bandwidth and more data hungry GPU cores, that makes memory speed matter. And it does matter. And so is our sponsor. - iFixit. You break it. iFixit. Not me, of course, but iFixit's Moray and Minnow kits are the toolkits for the tinkerer on the go. The pocket size Minnow driver kit is only $14.99, with an easy to open magnetized case, a built in sorting tray, 16 different bits, and a handle with a built in eSIM Eject Tool. Pretty fancy. For something slightly bigger and longer; the Moray driver kit is only $19.99, and comes with 32 different bits, with extended reach necks for digging into those hard to reach nooks and crannies. And all iFixit kits come with a lifetime warranty as well, so you're sure to end up in a landfill somewhere, before your iFixit kit does. So check out our links in the description to get yours today. - Thanks for watching guys. Instead of throwing you to that old video, how about checking out our much more recent video, exploring whether eight gigs of RAM is still enough in 2022? The answer might surprise you.",
    "transcript_keywords": [
        "RAM speed",
        "RAM",
        "faster RAM",
        "speed",
        "difference RAM speed",
        "difference",
        "RAM speed makes",
        "convinced RAM speed",
        "RAM kits",
        "RAM speed start",
        "GPU",
        "testing RAM speed",
        "RAM speeds",
        "faster",
        "CPU",
        "matter",
        "claimed RAM speed",
        "difference RAM",
        "settings",
        "video"
    ],
    "transcript_entity_values": [
        "Far Cry 6",
        "iFixit",
        "second",
        "1080p",
        "only $14.99",
        "Jake",
        "four",
        "Minnow",
        "2021",
        "Radeon",
        "DDR3",
        "2022",
        "Metro",
        "1060",
        "eight",
        "five gigahertz",
        "IPC",
        "R15",
        "32",
        "four gigahertz",
        "nine years ago",
        "the last nine years",
        "fed",
        "OpenGL",
        "three years later",
        "GPU",
        "between 800 and 1600",
        "Cinebench",
        "today",
        "5%",
        "Windows 7",
        "Alex",
        "6000",
        "2013",
        "OpenGL",
        "about 2.5",
        "4800",
        "16",
        "up to six gigabytes",
        "PCI",
        "RAM",
        "660",
        "Last Light",
        "a ton",
        "Moray",
        "Cinebench",
        "FPS",
        "about 5%",
        "1600 to 2666",
        "12%",
        "three",
        "GTX",
        "CPU",
        "Shadow of the Tomb Raider",
        "2.5 million",
        "max",
        "2666",
        "Ryzen",
        "eSports",
        "Linus",
        "the day",
        "less than 10%",
        "2080 Ti",
        "DDR5-1600",
        "DDR5",
        "two",
        "only $19.99",
        "upwards of 50%"
    ],
    "transcript_entity_types": [
        "EVENT",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "PERCENT",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "EVENT",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "DATE",
        "GPE",
        "ORG",
        "PERSON",
        "DATE",
        "PERCENT",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PERCENT"
    ],
    "vector": [
        -0.031732846051454544,
        -0.0012090554228052497,
        -0.022641785442829132,
        -0.004167868290096521,
        0.06038536876440048,
        0.021994132548570633,
        0.018765101209282875,
        0.04285461828112602,
        -0.009082193486392498,
        -0.019071709364652634,
        -0.011298874393105507,
        0.07174386084079742,
        -0.02469329535961151,
        -0.0439765527844429,
        0.05415930226445198,
        -0.03855177387595177,
        0.06897623836994171,
        -0.09660268574953079,
        -0.07041846960783005,
        -0.07497712969779968,
        -0.05658438429236412,
        0.024325333535671234,
        0.0015702969394624233,
        0.008207968436181545,
        0.04078495875000954,
        0.033953115344047546,
        -0.024681081995368004,
        -0.12526018917560577,
        0.03832193836569786,
        -0.05081455036997795,
        0.05754468962550163,
        0.09056103229522705,
        0.017311211675405502,
        -0.034010469913482666,
        0.043224725872278214,
        0.014295623637735844,
        -0.019940627738833427,
        -0.04776642471551895,
        0.005263513419777155,
        -0.042836837470531464,
        0.06500530987977982,
        0.007614361587911844,
        -0.007306573446840048,
        0.05265047401189804,
        0.011273824609816074,
        0.021189305931329727,
        0.022522639483213425,
        -0.0038357351440936327,
        0.009979569353163242,
        0.03107725828886032,
        -0.0226375013589859,
        -0.021307215094566345,
        0.051137786358594894,
        -0.05461233854293823,
        -0.14487828314304352,
        0.05153718590736389,
        0.006550789810717106,
        3.874763933708891e-05,
        0.004516703076660633,
        -0.007075964007526636,
        -0.021935274824500084,
        -0.11430277675390244,
        0.006677122786641121,
        0.02559330314397812,
        -0.050916384905576706,
        -0.04748791828751564,
        0.09526721388101578,
        -0.011066782288253307,
        0.020946044474840164,
        0.042538486421108246,
        0.01755908504128456,
        0.02685471810400486,
        0.06084427610039711,
        0.056820765137672424,
        -0.048610132187604904,
        -0.018970543518662453,
        0.07925786077976227,
        -0.05712601915001869,
        0.08328323811292648,
        -0.08030233532190323,
        0.0017231956589967012,
        -0.04745068773627281,
        0.03714348003268242,
        -0.06555875390768051,
        0.06176107004284859,
        -0.009644617326557636,
        0.07817929983139038,
        -0.013175330124795437,
        -0.006904634181410074,
        -0.10714512318372726,
        0.04584049433469772,
        0.030745867639780045,
        0.08914275467395782,
        0.009323954582214355,
        0.01925233192741871,
        0.07048314064741135,
        -0.020200766623020172,
        -0.027296602725982666,
        -0.027745559811592102,
        0.02738417685031891,
        0.0728386715054512,
        0.07446753978729248,
        0.039839476346969604,
        0.009019164368510246,
        -0.060967981815338135,
        -0.012212664820253849,
        -0.020568793639540672,
        0.06671974062919617,
        -0.048965323716402054,
        0.02769917994737625,
        -0.04345167800784111,
        0.10279874503612518,
        0.033992949873209,
        0.021337609738111496,
        0.030621256679296494,
        -0.08893244713544846,
        -0.08380447328090668,
        -0.07926585525274277,
        0.045522477477788925,
        0.021209757775068283,
        -0.04514196142554283,
        -0.027294304221868515,
        -0.03779957816004753,
        0.029774228110909462,
        -0.03412442281842232,
        -0.01304554846137762,
        -0.12211456894874573,
        3.708099868404783e-33,
        -0.04471839219331741,
        0.004095771349966526,
        -0.051137153059244156,
        -0.07438604533672333,
        -0.051102571189403534,
        -0.04301965609192848,
        -0.010085241869091988,
        -0.010263951495289803,
        -0.0122543228790164,
        0.060400139540433884,
        -0.03746984153985977,
        -0.09846490621566772,
        -0.04313249513506889,
        0.08137080818414688,
        0.07096009701490402,
        -0.03870726004242897,
        -0.03925710171461105,
        0.01074802316725254,
        0.020887531340122223,
        0.03460165113210678,
        0.011672260239720345,
        0.046639855951070786,
        -0.027133706957101822,
        -0.03762035444378853,
        0.03856944665312767,
        -0.020364688709378242,
        0.0021838240791112185,
        -0.015102122910320759,
        0.059772782027721405,
        -0.010887584649026394,
        -0.00981729757040739,
        -0.06528244912624359,
        0.03794388473033905,
        -0.02237456664443016,
        0.07531682401895523,
        0.006316888611763716,
        0.03148011490702629,
        -0.08706267923116684,
        0.02671709656715393,
        -0.06962618976831436,
        0.03423397243022919,
        0.10126342624425888,
        -0.09910713136196136,
        -0.12948767840862274,
        -0.03405526652932167,
        0.056549254804849625,
        0.0322936587035656,
        -0.0005730431294068694,
        -0.036339715123176575,
        -0.05306052789092064,
        -0.04064026102423668,
        0.033075325191020966,
        -0.07452023029327393,
        0.055027641355991364,
        0.0351954884827137,
        -0.0241305660456419,
        0.0006571407429873943,
        0.01846316270530224,
        0.10216691344976425,
        0.12988661229610443,
        0.02438701130449772,
        -0.046067964285612106,
        -0.00858826283365488,
        -0.019988255575299263,
        -0.04280085489153862,
        0.03179401904344559,
        0.15366318821907043,
        0.11971136927604675,
        -0.10266999155282974,
        -0.031260617077350616,
        -0.043275877833366394,
        -0.019898150116205215,
        0.011171799153089523,
        0.025848491117358208,
        0.01651415042579174,
        0.03081861324608326,
        -0.015834294259548187,
        -0.016846908256411552,
        -0.062188178300857544,
        -0.022740907967090607,
        0.05320627614855766,
        0.04752378910779953,
        0.0011432417668402195,
        0.04875178635120392,
        -0.01967344805598259,
        0.06215529143810272,
        0.06955315172672272,
        0.023338263854384422,
        0.009412793442606926,
        0.04349587857723236,
        0.016959944739937782,
        0.007301656994968653,
        0.016081202775239944,
        0.02516789548099041,
        -0.07593594491481781,
        -5.34538350152776e-33,
        -0.039984576404094696,
        -0.015348996967077255,
        -0.04343295842409134,
        0.09630990028381348,
        0.012081082910299301,
        -0.0326770544052124,
        0.028440378606319427,
        -0.048112936317920685,
        -0.026814362034201622,
        -0.08118093013763428,
        0.0020739480387419462,
        0.04032064229249954,
        -0.043084923177957535,
        0.061614323407411575,
        -0.01646280102431774,
        -0.046025849878787994,
        -0.015236081555485725,
        -0.05807950720191002,
        0.05703740566968918,
        -0.03669130802154541,
        0.06285318732261658,
        0.08052796870470047,
        0.0025222685653716326,
        0.0011945508886128664,
        -0.03952483832836151,
        0.04502613842487335,
        -0.06644996255636215,
        0.06692440062761307,
        -0.019845373928546906,
        -0.022276083007454872,
        -0.022990858182311058,
        -0.01581679657101631,
        0.014556136913597584,
        -0.039078351110219955,
        0.05882765352725983,
        -0.03314861282706261,
        0.04920244961977005,
        -0.020489059388637543,
        -0.017085639759898186,
        0.0008417109493166208,
        0.050389356911182404,
        0.052950289100408554,
        -0.005215189885348082,
        -0.045089200139045715,
        0.05269003286957741,
        -0.015090684406459332,
        -0.042100124061107635,
        -0.0737343356013298,
        0.0758882388472557,
        0.002331892494112253,
        0.002989494940266013,
        -0.06428825110197067,
        0.06163885444402695,
        -0.015009410679340363,
        -0.0269323643296957,
        -0.07032807171344757,
        -0.009958100505173206,
        -0.060962334275245667,
        0.08224395662546158,
        -0.015845946967601776,
        0.033295948058366776,
        -0.021868593990802765,
        -0.05192539095878601,
        -0.07403453439474106,
        0.01745520904660225,
        -0.007088071666657925,
        0.05988866463303566,
        -0.005626884289085865,
        -0.06268499791622162,
        -0.010523277334868908,
        -0.013998753391206264,
        -0.07095663994550705,
        0.007345310412347317,
        -0.01369241438806057,
        -0.04200556501746178,
        0.061098307371139526,
        0.0007678435649722815,
        0.028978517279028893,
        0.006851322948932648,
        -0.044309478253126144,
        -0.05687034875154495,
        0.07552304863929749,
        -0.019208181649446487,
        -0.06579231470823288,
        -0.01181772444397211,
        0.009447295218706131,
        -0.009299928322434425,
        -0.0632265955209732,
        -0.04162215813994408,
        -0.06313346326351166,
        -0.06925303488969803,
        -0.07063988596200943,
        0.008782293647527695,
        0.04580674692988396,
        -0.03570220246911049,
        -5.817160797505494e-08,
        0.043001994490623474,
        -0.016038255766034126,
        0.029329439625144005,
        0.030215349048376083,
        0.026888985186815262,
        -0.0833844318985939,
        -0.027060866355895996,
        0.04721676558256149,
        0.11138303577899933,
        0.035505764186382294,
        0.10736560076475143,
        -0.06722071021795273,
        -0.0321531668305397,
        -0.030443118885159492,
        0.048844434320926666,
        0.04433518648147583,
        -0.09108109772205353,
        -0.024332068860530853,
        0.03822512924671173,
        -0.132699117064476,
        0.0021596963051706553,
        0.07377704977989197,
        0.07570935040712357,
        -0.03303435817360878,
        0.0448562316596508,
        0.03917248547077179,
        0.033789243549108505,
        0.034500107169151306,
        0.0775672122836113,
        0.004039210267364979,
        -0.0939173698425293,
        0.012937916442751884,
        0.06045052036643028,
        -0.08573232591152191,
        0.09358830004930496,
        -0.050929173827171326,
        -0.05359794944524765,
        0.07531559467315674,
        0.1282094120979309,
        0.02020839788019657,
        -0.05928057059645653,
        -0.022096527740359306,
        0.027809161692857742,
        0.014101694338023663,
        0.011408193036913872,
        0.016940925270318985,
        -0.04056728631258011,
        -0.03385480120778084,
        0.01723514124751091,
        -0.041130028665065765,
        -0.03487814590334892,
        0.010904747061431408,
        0.014920479618012905,
        0.044114138931035995,
        0.0719403401017189,
        -0.04259877651929855,
        -0.05683883652091026,
        -0.01163591630756855,
        -0.03737310692667961,
        0.021251950412988663,
        -0.0351969450712204,
        -0.13335643708705902,
        -0.09681123495101929,
        0.027933288365602493
    ]
}