{
    "id": "aBiNaro5pAU",
    "title": "Vector: Anki’s tiny robot that wants to hang",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-08-08T13:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=aBiNaro5pAU",
    "category": "Science & Technology",
    "tags": [
        "vector",
        "anki",
        "robot",
        "cozmo",
        "robot cozmo",
        "robot toys",
        "robots",
        "programming",
        "ai",
        "artificial intelligence",
        "robotics",
        "kickstarter",
        "robot pets",
        "anki cozmo",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "how to",
        "how to make",
        "mkbhd",
        "marques brownlee",
        "apple",
        "google",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 781171,
    "likes": 15375,
    "comments_count": 1541,
    "description": "Anki launched a Kickstarter for Vector, a new home robot that looks a lot like their last product, Cozmo. Vector is always-on and a lot more powerful. It basically has the guts of a smartphone including a faster processor and Wi-Fi. In the season finale of Processor, Dieter visits Ankis office to talk to the people that made Vector. Enjoy, and see you again in September!  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hey Vector. (robot chimes) My name is Dieter. (robot chimes) - [Vector] Diter. Diter. - [Andrew] You're Diter apparently. (upbeat music) - This little guy right here, he's named Vector. He's a home robot from Anki, and here's a question, what can you do with him? Now if you're familiar with Anki, you know that they make another robot called Cozmo that looks a lot like this little dude, but the differences are that this thing is way more powerful. It's designed to be always on, it's connected to wifi, and it knows what's going on around it all the time. It's just sort of lookin' around, hanging out. And it has a lot more powerful technology in it too. So there's a laser sensor on the front, little capacitive sensor here so it can feel if you're petting it. It has four microphones so it can hear you say its name and respond to you and answer questions like what's the weather like? To understand what all of that means, we came to Anki's offices here in San Francisco to talk to the people that made Vector and find out what they think you can do with it. Anki calls Vector a home robot, which makes you think about Rosie from The Jetson's, but Vector can't really do that much. It can do some very basic assistance stuff, like Alexa, but Anki is spending way more time working on the robot's personality than its utility. - You can think of him as an older brother for Cozmo, but definitely not Cozmo. Hey Vector. (robot chimes) I have a question. (robot chirps) What's the distance from San Francisco to Los Angeles? (robot chimes) - [Vector] The distance is approximately 347 miles from San Francisco to Los Angeles. (both laugh) - Hey Vector. (robot chimes) Set a timer for 10 seconds. (robot alarms) (both laugh) Every one of our products will be a character, it'll have a name, it'll be different personalities, because if you have a robot that helps you with something more functional, where he's meant to do something in healthcare, or security, or something like that, it's a very different type of personality, but it still has to be an interface that's actually very intuitive and very warm. - [Dieter] A robotic personality could very quickly become very gimmicky, so Vector doesn't actually talk too much, it just sort of chirps and beeps, like a little droid, unless you specifically ask it a question. But more importantly, its actions are designed to react to the environment, which makes it feel a little bit more alive. - We really placed close attention to have behaviors be based on either sensors, or what the user is doing. So that was a big piece for us, not just having a robot who is entertaining briefly, but something that felt very alive over the course of the day. The thing that's really different is that he has interactions that are physical and based on you hanging out with him. So if you turn on music, he'll pick up the exact beat, he'll start dancing to the beat, right? Like that's new. Or if I pet him, he'll get really blissed out by it. (robot chirps) (laughs) And then there's things that we didn't design that just happened. So if you turn on the TV, he will watch that TV because he's listening to the sound, and then the screen triggers his motion detectors so he gets really interested by different things. - [Dieter] Personality may go a long way, but is that really enough reason to buy a quote, unquote home robot? - When you think about kind of that stereotype of the humanoid robot, you end up going into a bad place for two reasons. One is you hit a price point that is totally impractical for the level of capability that's possible today, and you end up pigeon holing yourself because you end up trying to match the strengths and weaknesses of a human, which don't map perfectly to the strengths and weaknesses of robotics today. And if you miss anything, you hit the uncanny value, which is basically creepy and unnatural. By making a character, it is very humanistic in his qualities, but not trying to sound, or look, or feel like a human, you actually can better match your strengths and avoid your weaknesses. - You can set expectations. - And you set expectations right away. And so the fact that he's still a cute little character. - Means I don't expect him to get me a beer, which is the test for all robots, right? - That's exactly right. - [Dieter] So Vector can't bring you a cold one, but that doesn't mean it's not technologically advanced. It basically has the guts of a smart phone inside it, including a faster processor, and wifi, which means that it can always stay connected to the internet, and doesn't really need you to take care of it. It can hang out on its own, find its own charger, and not fall off the table. It does a lot of that with surprisingly advanced computer vision for such a tiny package. - So what you're seeing here is a visualization of the robot, and as I turn him, he can feel it by virtue of that gyro I talked about, so he knows he's turning in space, and you can also see he's slowly building a map. So I'm gonna manually drive him around. So you can see he can see his cube in 3D, and like I was saying before, that's using the marker, and if I move that around, you can see it moves in 3D with him. Now I'm gonna show him the cube in space. - [Dieter] Oh he sees it, and he's able to position it floating around in space. - [Andrew] He knows exactly where it is, really down to the millimeter, 'cause that's what it takes for him to pick it up. - So is it able to place our faces in space as well on this map? - Yeah, seein' your eyes, nose, and mouth there, and if we introduce ourselves to him, he'll eventually associate a name with each of these faces. You're the green lamp shade, and I'm the blue lamp shade. - And we're movin' in space. - We're movin' in space, and you can see, if I move closer, it will also move closer. - This thing can recognize faces, how are you doing facial recognition on a little, tiny robot? - What's interesting is most people's eyes are about the same distance apart, so that's a known distance, which is all we really need. So by realizing how far apart my eyes are in the image, I can tell how far away the face is, roughly. But it lets him remember where I am in space, which means that if he decides he's gonna go pick up that cube, and he turns around and drives over here, he remembers I'm here, and that allows him to do something we call referencing, which is something kids also do right before they wanna do something, they'll often sort of look up at you, make sure you're watching them. He can do that as well, he can turn back and check me out, and then go and pick up his cube, and what's powerful about that is it takes it from being an experience where you're watching a robot pick up a cube, to one where you're sort of drawn into the experience and doing it with him, or being involved. And he can tell if you're making eye contact he can tell if we're looking at each other instead of him, so we can also use that information to drive his behaviors. - Hey Vector. (robot chirps) - Fist bump. (robot chirps) - He can tootle around, drive around, he's sittin' in his home right now. I imagine I'm gonna put him on a counter, sit on the floor, a coffee table, like where does he live? - Yeah, so living room, coffee table, kitchen table, we even have an accessory that's kind of like his habitat, and the key is that he's always on, you should forget that there is an on/off switch, he'll charge himself, go back to his charger, he'll be sleeping for part of the day, he'll wake up when something interesting happens, and a lot of this is gonna be the magic that builds out all of the subtleties around him being alive. - Anki is launching the Vector robot on Kickstarter today, and when it ships in October, it's gonna retail for about 250 bucks, but if you get this thing, don't expect it to have the same utility as even a $50 Amazon Echo. After all, this thing is only part digital assistant, it's also part toy, and part I don't know, little, cute robot pet thing. But what it actually is, is a chance to experience what it's like to have an autonomous robot in your house. It turns out the main utility of the Vector robot is something we don't talk about very much in tech, it's fun. Thanks so much for watching, and I wanna know, what would you do if you had a little, tiny robot in your house. Let me know in the comments, and oh hey, one more thing, we're gonna be taking a little break. I've got jury duty, people have got vacations, and we'll be back sometime in September. And so, I'm just gonna roll this on for a little bit longer, 'cause that's what I do. Goodbye.",
    "transcript_keywords": [
        "Vector",
        "robot",
        "Hey Vector",
        "Vector robot",
        "San Francisco",
        "Anki",
        "Anki calls Vector",
        "thing",
        "space",
        "home robot",
        "Francisco to Los",
        "Los Angeles",
        "Hey",
        "cube",
        "pick",
        "Diter",
        "Cozmo",
        "Francisco",
        "San",
        "turn"
    ],
    "transcript_entity_values": [
        "Los Angeles",
        "September",
        "Amazon Echo",
        "Jetson",
        "one",
        "four",
        "the day",
        "today",
        "Alexa",
        "October",
        "Dieter",
        "about 250 bucks",
        "50",
        "10 seconds",
        "Vector",
        "Rosie",
        "approximately 347 miles",
        "two",
        "Anki",
        "Cozmo",
        "One",
        "Kickstarter",
        "San Francisco",
        "Diter"
    ],
    "transcript_entity_types": [
        "GPE",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "MONEY",
        "MONEY",
        "TIME",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "GPE",
        "GPE",
        "PERSON"
    ],
    "vector": [
        -0.10903221368789673,
        -0.017833944410085678,
        -0.014117637649178505,
        -0.08889484405517578,
        0.01018650270998478,
        -0.12652847170829773,
        0.04576995223760605,
        0.00045201924513094127,
        -0.06953468173742294,
        0.010567225515842438,
        0.07095085829496384,
        -0.003515900345519185,
        -0.02154766395688057,
        0.008906335569918156,
        0.025441713631153107,
        0.015159185975790024,
        0.06326289474964142,
        0.020968759432435036,
        -0.013074362650513649,
        -0.000884618260897696,
        -0.030522746965289116,
        -0.017586544156074524,
        0.010610997676849365,
        -0.005162185523658991,
        0.00563982455059886,
        0.07206471264362335,
        0.07619493454694748,
        -0.003362784394994378,
        -0.014989424496889114,
        -0.1202659010887146,
        0.015646211802959442,
        0.0764048621058464,
        -0.0026319685857743025,
        0.06677449494600296,
        -0.10420878976583481,
        0.11040385067462921,
        -0.0018581715412437916,
        0.016023628413677216,
        -0.059095341712236404,
        -0.0516241192817688,
        -0.029949935153126717,
        0.04563869163393974,
        0.019489778205752373,
        0.03060244396328926,
        0.004211321007460356,
        0.05503000319004059,
        -0.06259896606206894,
        -0.12808167934417725,
        0.10218098014593124,
        -0.028001533821225166,
        -0.12087848782539368,
        -0.0920369029045105,
        0.10333903133869171,
        -0.007654549553990364,
        -0.07377726584672928,
        0.039957910776138306,
        0.009186667390167713,
        0.0429377444088459,
        0.05475173518061638,
        -0.05075389891862869,
        0.01596307009458542,
        -0.02016395889222622,
        0.020267782732844353,
        0.03939474746584892,
        -0.037208784371614456,
        -0.04185301810503006,
        -0.012675987556576729,
        -0.02061520516872406,
        0.019156957045197487,
        0.007715950254350901,
        0.05312849581241608,
        0.0199047289788723,
        0.018601683899760246,
        0.009160141460597515,
        -0.03217550739645958,
        -0.020227450877428055,
        0.06088738143444061,
        -0.043294407427310944,
        0.009550949558615685,
        -0.011357396841049194,
        0.036902908235788345,
        -0.016786864027380943,
        -0.05351250618696213,
        -0.01671300269663334,
        -0.015144662000238895,
        0.08733980357646942,
        0.009836065582931042,
        -0.03673724830150604,
        0.022305862978100777,
        0.020482584834098816,
        0.013017627410590649,
        -0.004488272126764059,
        0.075929656624794,
        -0.04579645395278931,
        0.02568776160478592,
        -0.0006031034863553941,
        0.033478230237960815,
        -0.008455940522253513,
        -0.05123785510659218,
        0.06019151955842972,
        0.04898810386657715,
        -0.0007517531048506498,
        0.038053084164857864,
        0.0621941015124321,
        0.009425299242138863,
        0.025503655895590782,
        0.06502603739500046,
        0.028454206883907318,
        0.10911460220813751,
        0.03322460874915123,
        -0.047590192407369614,
        -0.04284133389592171,
        0.020656464621424675,
        -0.03878556936979294,
        -0.037379227578639984,
        0.015557062812149525,
        -0.03600260242819786,
        0.08910467475652695,
        0.06854527443647385,
        0.006565552204847336,
        0.09752596914768219,
        0.015211374498903751,
        -0.10244924575090408,
        0.01657935604453087,
        0.07224462926387787,
        0.044519878923892975,
        -0.08613979071378708,
        -8.14193121456603e-34,
        -0.001346989651210606,
        0.1253076195716858,
        -0.0008036314975470304,
        0.0838991180062294,
        -0.015807857736945152,
        -0.031265392899513245,
        0.0012928748037666082,
        0.05097063258290291,
        -0.08677423745393753,
        -0.027131669223308563,
        -0.0727396085858345,
        0.05523911491036415,
        -0.0443907305598259,
        0.088823601603508,
        -0.000481597293401137,
        -0.06711729615926743,
        0.09504229575395584,
        -0.053101181983947754,
        -0.054088521748781204,
        0.03861407935619354,
        0.05859055742621422,
        -0.026736335828900337,
        -0.04158224165439606,
        0.027410421520471573,
        0.06814412027597427,
        -0.02268390543758869,
        0.04519590362906456,
        -0.04647621139883995,
        0.04476269707083702,
        0.01669892482459545,
        -0.13209353387355804,
        0.09132559597492218,
        -0.0011847249697893858,
        0.146817147731781,
        0.008949571289122105,
        -0.013589976355433464,
        -0.07497424632310867,
        -0.10828129202127457,
        -0.022084223106503487,
        -0.07861890643835068,
        0.05667092651128769,
        -0.0023929851595312357,
        -0.15131746232509613,
        -0.0192748811095953,
        -0.0746050700545311,
        -0.03115633875131607,
        0.05678384751081467,
        0.0009870518697425723,
        0.009487987495958805,
        -0.05610022321343422,
        -0.019045718014240265,
        0.0988723486661911,
        -0.037526581436395645,
        -0.013518058694899082,
        -0.02864457666873932,
        -0.08623802661895752,
        0.01397667545825243,
        -0.0166228748857975,
        0.03844134509563446,
        0.0025024712085723877,
        0.0106084905564785,
        0.0761689692735672,
        0.016814537346363068,
        0.08708608150482178,
        -0.013693863525986671,
        -0.08380049467086792,
        0.0067832209169864655,
        0.009636987000703812,
        0.05135996267199516,
        0.06508184969425201,
        -0.03517995402216911,
        0.01501159742474556,
        -0.039011601358652115,
        -0.04385916888713837,
        -0.006085585802793503,
        0.030023859813809395,
        -0.06431484967470169,
        -0.07934721559286118,
        -0.03951350972056389,
        0.04507894068956375,
        -0.0036949068307876587,
        -0.06214332953095436,
        -0.04285132884979248,
        -0.06872326880693436,
        -0.02138422429561615,
        0.014456336386501789,
        -0.0055957757867872715,
        -0.05325654521584511,
        -0.012738929130136967,
        0.0057246931828558445,
        -0.026801325380802155,
        -0.022545846179127693,
        -0.012886377982795238,
        0.03540171682834625,
        -0.07355223596096039,
        -9.662629685316437e-34,
        -0.08254256844520569,
        -0.03438659757375717,
        -0.023640263825654984,
        0.03419365733861923,
        -0.026742033660411835,
        -0.01317671500146389,
        0.01913078874349594,
        0.012491670437157154,
        -0.0006641513900831342,
        -0.04340614750981331,
        -0.06805442273616791,
        0.010769819840788841,
        0.06260082870721817,
        -0.04640432819724083,
        0.07404883950948715,
        0.09994223713874817,
        0.004570988938212395,
        -0.03749610856175423,
        -0.022090304642915726,
        -0.02850070595741272,
        0.01096201129257679,
        0.11339887231588364,
        -0.027394313365221024,
        -0.017661703750491142,
        0.031828898936510086,
        0.041230458766222,
        0.04402795433998108,
        0.05829157307744026,
        -0.03649470955133438,
        0.04243537038564682,
        -0.08591161668300629,
        -0.10580060631036758,
        0.04523841291666031,
        0.011125053279101849,
        0.038799937814474106,
        0.05104980245232582,
        -0.05575237050652504,
        -0.062248632311820984,
        0.01583193801343441,
        -0.01770343817770481,
        0.04044373333454132,
        -0.013133003376424313,
        0.015888523310422897,
        -0.02974754013121128,
        -0.0034900291357189417,
        -0.06008739396929741,
        -0.026779983192682266,
        0.07428331673145294,
        -0.0013173683546483517,
        -0.023571163415908813,
        0.06511833518743515,
        0.04193125665187836,
        0.0017126959282904863,
        -0.049245499074459076,
        -0.04728447273373604,
        0.027407178655266762,
        -0.01272538211196661,
        0.008921713568270206,
        0.03092627041041851,
        -0.004001982975751162,
        0.019861403852701187,
        -0.05288223177194595,
        0.04835011065006256,
        0.07473363727331161,
        -0.04004610702395439,
        0.02056083269417286,
        0.037026502192020416,
        -0.02153830975294113,
        -0.004078452009707689,
        -0.05059782415628433,
        0.043302491307258606,
        0.11197973787784576,
        0.034387391060590744,
        0.004163710866123438,
        0.011803481727838516,
        0.02596352994441986,
        -0.004069625400006771,
        -0.06370668858289719,
        -0.0382198765873909,
        -0.08628261834383011,
        -0.048814743757247925,
        0.006515613291412592,
        0.09956438839435577,
        0.06190377473831177,
        0.007985682226717472,
        0.042158063501119614,
        -0.06500683724880219,
        0.037202827632427216,
        -0.02643289975821972,
        0.05257420241832733,
        -0.005928396247327328,
        0.05442589148879051,
        -0.026541458442807198,
        0.08735375106334686,
        -0.02601291425526142,
        -5.16231217773111e-08,
        0.031131848692893982,
        -0.058588143438100815,
        -0.0030035129748284817,
        -0.054954253137111664,
        0.060338519513607025,
        0.03213584050536156,
        0.040722254663705826,
        -0.08178077638149261,
        -0.03283003345131874,
        0.041793275624513626,
        -0.010947339236736298,
        0.009391606785356998,
        -0.02282845973968506,
        0.06399800628423691,
        0.09303475171327591,
        0.023485325276851654,
        0.027976756915450096,
        0.033415041863918304,
        -0.040035098791122437,
        -0.009033272974193096,
        0.03597947582602501,
        -0.018720455467700958,
        0.04437018185853958,
        0.07953548431396484,
        -0.0569109171628952,
        -0.004760180599987507,
        -0.01783178374171257,
        0.05122437700629234,
        0.04470393806695938,
        -0.043390676379203796,
        -0.10401623696088791,
        0.0180861484259367,
        0.0039204563945531845,
        -0.03534785285592079,
        0.032455556094646454,
        -0.012160823680460453,
        -0.04302956536412239,
        -0.007374958600848913,
        0.0023219578433781862,
        0.06271769851446152,
        0.016243085265159607,
        0.03064098209142685,
        -0.00858702976256609,
        0.0354277640581131,
        -0.04364640638232231,
        -0.058412134647369385,
        -0.024273721501231194,
        -0.20736649632453918,
        0.026235198602080345,
        0.003810099558904767,
        0.021829502657055855,
        0.0068280575796961784,
        -0.006260441616177559,
        0.08805001527070999,
        0.05227002128958702,
        -0.03800433501601219,
        -0.018906589597463608,
        -0.05026578903198242,
        -0.05344760790467262,
        -0.00957666989415884,
        -0.009100579656660557,
        -0.006813301704823971,
        0.013870728202164173,
        0.029402956366539
    ]
}