{
    "id": "ABOfr6nbOIY",
    "title": "Flip 3 - WORTH IT",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2021-09-11T17:08:28Z",
    "video_url": "https://www.youtube.com/watch?v=ABOfr6nbOIY",
    "category": "Science & Technology",
    "tags": [
        "z flip",
        "samsung",
        "z flip 3",
        "flip 3",
        "flip3",
        "z flip3",
        "samsung galaxy z flip 3",
        "samsung galaxy z flip3",
        "android",
        "smartphone",
        "folding",
        "foldable",
        "samsung fold",
        "samsung flip",
        "fold",
        "flip",
        "review",
        "is it worth it",
        "iphone",
        "apple",
        "google",
        "moto",
        "tech",
        "pixel",
        "austin",
        "austin evans",
        "the test drivers",
        "test drivers"
    ],
    "views": 496727,
    "likes": 21362,
    "comments_count": 1152,
    "description": "Thanks to the Eufy RoboVac X8 & HomeVac H30 for sponsoring this video!   Check out my podcast @TheBackmarkers!   The Samsung Galaxy Z Flip 3 on Amazon:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  I have a TikTok!  My Twitch channel:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://eufyofficial.com/3qIl5m2",
        "https://www.relay.fm/testdrivers",
        "https://austin.tech/flip3",
        "https://www.tiktok.com/@austintechtips",
        "https://www.twitch.tv/austinevans",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- The Z Flip is one of my favorite pieces of tech ever. So as soon as I laid my hands on it at the original launch event, man, I was hooked. I bought a Z Flip with my own money on the spot, and ever since then, the first generation and it's nearly identical 5G sequel have found a home in my pocket. I'm privileged enough to get to test a lot of phones, but believe me when I say that basically no device ever spends more than a year as my daily driver. So now with the new Z Flip3, a lot has been upgraded. But before we dive into that and what's new and everything, I want to talk a little bit about the last year and a half, and why I truly believe that this is the future. Well, maybe not this one, but the folding phone, the Z Flip gang is about to grow much, much stronger. The number one question is always, why? Well, I mean, usually right after people are like, \"Are you worried about breaking it?\" Which yes, there's certainly a durability conversation to have, and we'll talk about that in a second, but the \"why\" I think is a valid question, because the Flip is hardly the only folding phone around. For a lot of people, the Galaxy Fold seems like the true foldable future. A smartphone when you need it, that transforms into a small tablet that fits in your pocket. Even something like the Moto Razr, for all its many, many flaws, does some things right. And yet, the Z Flip is really the phone that has completely and totally captured my heart. Even if you ignore the eye-wateringly high price tag of the original Z Flip, there were some serious sacrifices. A 60 Hertz display that's almost painfully dim when you're viewing it outdoors, slightly below average battery life, and the durability. As part of the first round and a half of foldables, there's a lot of new technology here, right? But the big thing that I think is most relevant to actually making these folding phones work, is what Samsung dubs Ultra Thin Glass. If you watch JerryRigEverything, you'll know that, sure, there's some glass in there, but it is hardly the sturdy Gorilla Glass that we pretty much take for granted on normal smartphones these days. And I'll be honest, the last year and a half of daily driving the Z Flip has not been a perfectly smooth process for me. Now, if I was making this video a couple of weeks ago, I would say that short of like some minor scratches on the screen and stuff, it's held up completely fine. However, right before my Z Fold3 showed up... I said fold didn't I? It's a flip! You stupid idiot. I've just, just started to see a little stress crack forming on the right edge of my screen, which is square in the middle of the crease. You look at a lot of other people's Z Flips, they're far worse, where the screens are nearly unusable due to whether it's stress, whether it's heat, whether it's so many folds, whatever the case is, it's clear that this first generation of the flip is okay, but nowhere near as durable as it needs to be. I'll give Samsung some credit, not only the Z Flip, but also the Z Fold, they do come with what they call the Galaxy Z Premier Service, which honestly comes with a lot of stuff that's kind of weird like Clear support to get through airports and it's a little bit odd, but one of the things that is important is some protection against things like the cracking or the breaking of a screen. So I actually look forward to, in the pretty near future, sending my Z Flip 5G back to Samsung to see if they'll replace the screen, if they even charge me for it. But there are a lot of good stories about their excellent customer service. In fact, actually my buddy Quinn from Snazzy Labs, he had a problem with the little tiny rubber foot on the bottom of the Z Flip, and they just replaced his phone for him, for like a quarter of a cent piece that I imagine they could just glue in place. Instead, they just swapped out the whole phone. So all of the things I've heard from their Premier Service, it's very good as far as the customer service side goes. With that being said, if your phone's breaking, that's certainly not the best look. I think it's pretty fair to say that 18 months later, there's a lot to dig into with the Z Flip and why I'm still using this quirky, flawed little phone as it enters its third generation. So right off the bat, I will say that many of these drawbacks have now been addressed with this, the brand new Samsung Galaxy Z Flip3. There's a lot to talk about here, but perhaps the biggest upgrade is the price. It's actually kind of reasonable at a thousand dollars, which is a major cut from the 1,450 bucks that the first phone launched at. Now look, this is certainly not cheap, but for context, a thousand dollars, that's the same price point that the base model of the Galaxy S20 came out with last year. Consider this. Foldables have essentially slotted into the defacto flagship roll for Samsung, pretty much taking the place of what was the Galaxy Note's domain. The S22 next year will almost certainly have to now come in cheaper than the Flip. And sure, it'll have better cameras and whatnot, but for Samsung, this is where they have an absolutely undeniable edge over the competition. No one has folding tech that's anywhere near to the level of Samsung right now, and you better believe that they're gonna lean into that as far as they can with what is truly a next generation bit of smartphone tech. - [Ken] What about Xiaomi? - They're making stuff. Motorola is making stuff. - [Ken] We don't talk about them. - Samsung not only has the display technology, but they now have the years of R&D and things like the hinges, making these things waterproof, designing these phones and getting them to a price point that I'm not going to say is attainable, but certainly far better than anyone else is at this point. Then, there's the durability, which has been majorly improved this time around. Not only does Samsung claim that the screen on the Z Flip3 is 80% more durable compared to the last generation, but they've added something that's pretty much expected on flagships these days. Water resistance. This is, let me tell you, no small feat. On a traditional phone, the way you make something water resistant is just by taping and gluing pretty much anywhere that a little bit of water could sneak into a device. It's not simple, but it's absolutely doable. But with a folding phone, I mean, this is a far more challenging task. The hinge alone adds an enormous amount of complexity with moving pieces and cables and ribbons that all need to stay not only watertight, but they need to stay watertight after tens, if not hundreds of thousands of folds in and out. I mean, sure, time will tell exactly how well they did, but I think it's pretty reassuring that the Z Flip3 sports an IPX8 rating, which means that it's good for up to 30 minutes of being submerged in fresh water. Although, it is important to note that it is still not rated against any kind of dirt or dust, so maybe blame that trick hinge next time you have a pocket full of sand. In fact, actually, just don't do that at all. - [Ken] Yeah, I... - Don't do that, yeah, it's bad. - [Ken] I'm gonna leave my pockets of sand at home. - You could leave it at the beach too. - [Matt] Dale Gribble? Pocket sand. - It really is the hinge where, if you'll permit me to get just a little bit carried away, the magic of the Z Flip I think really comes in for me. A lot of those concerns about the durability of the screen, they do start to disappear when you realize that as soon as you flip that phone closed, well I mean, the screen is protected, right? Which, especially in comparison to a normal phone, that the screen is sitting there exposed all day long to all the dirt and dust and debris that's in your pocket, it actually makes a little bit of sense. And then there's the size, the size. Okay, just bear with me for one second, because not too long ago, the large phones were like, what? 4 inches, 4.3 inches? I mean, I even remember when the first Galaxy Note came out, really the device that introduced the idea of a fablet, had a massive 5.3 inch display, which at the time people thought, \"Oh, how would we ever fit that in the pocket, blah, blah, blah?\" It's actually kind of small by today's standards. I'm not going to sit here and tell you that the evolution of smartphones is bad. We do far more with our phones today than in the early days of smartphones. But something I think that we've just accepted, really, is how much pocket space we give to our phones. Sure, the iPhone 12 Pro Max Chungus Edition will fit in your pocket maybe. What if you can get a very decently sized display in a form factor that's absolutely tiny? Especially if you're used to carrying your phone in a bag or a purse, or worse still still, you're stuck using the poor excuse for pockets that some pants come with. There's real utility to a foldable device. The first Z Flip was kind of panned for its very tiny little outer display, but I'll argue that while it certainly could have done more, it did serve a real function. For example, when you wanted to take a selfie, it was a decent little screen when you could use those far superior rear facing cameras, as opposed to the front facing one. And on the Z Flip3, the screen is four times larger, which does make things a lot easier to see, not only when it comes to framing up photos and videos, but you've got additional widgets on there and you could actually read more than like 17 characters of a notification. I also can't tell you how many times I flipped my phone half open to work as like a little tripod to take photos or videos hand free. That same flip mode is also a lifesaver for watching video. Yes, I know, I watch a lot of portrait video, which means that of course, it's tiny, but I've watched so many hours of video on the Z Flip, not to mention using it for video calls. It's so nice to have the Z Flip just posted up sort of standing completely by itself. This, paired with the fact that yes, look, there's certainly an element of, I like using something different. Everyone has an iPhone or a Note or whatever in their pocket, but these days, who has a Z Flip, right? I've had so many conversations with total strangers when they just see me flip this little guy open they're like, \"Yo, what's that phone? Did that just flip? Does that just fold?\" I mean, it's a cool party trick. - [Ken] We get it, you like to flex. - But no, for real though, it gives me some excitement about technology. I mean, in the good old days, people were excited about seeing the white iPhone or whatever, but these days, I mean, what's really cool? It's like, \"Oh congratulations, I have seven cameras in rainbow RGB colorway.\" But like, the Z Flip to me absolutely passes the vibe check of being actually cool. This video is sponsored by Eufy with two brand new products. the RoboVac X8 and the H30 cordless vacuum. The X8 helps to keep your space even cleaner than ever with its twin turbine tech. With an 80% increase in airflow over previous models and 57% improved pick up, this is especially handy for those living with cats and dogs. With its reliable path laser navigation and AI map technology, the X8 builds a real-time map of your home to optimize the cleaning path and identify the various rooms and floor surfaces, all of which you can monitor and control with the Eufy app. And with the H30 vacuum, hard-to-reach places aren't left out of the equation either. It might be small, but it's got some real power. With a 100,000 RPM motor and 2500 milliamp hour battery, all of this, despite weighing a little over 800 grams. Plus, there will be plenty of time to clean up with up to 20 minutes of battery life while in eco mode. You can check out the X8 and the H30 at the link below to get your own, and if you act quick, you can also take advantage of an early bird pre-order discount as well. And of course, huge thank you to Eufy for sponsoring this video. What a beautiful day to talk about a beautiful phone. With the original Z Flip, as much as I like it, and I still like it, it was hard to kind of divorce yourself too far from the compromises. It was never quite there. It was good, but you know, you're get in the daylight, screen's hard to see. The is Z Flip3 doesn't have these same compromises. Now, one of the things I think that really helps to push it over the edge is the build quality. Not only has the hinge been pretty significantly redone this generation, where it will stop in all kinds of angles, whereas, you try to do something with the original Z Flip, kind of go like this, go further back, it doesn't stay. Closes. The hinge feels a lot nicer. But on top of that, the tolerances feel nice. The fact that it has got not this sort of almost like chromey kind of finish, but it's a much more sort of smooth aluminum that they've got here. It also really nicely claps together. I mean, just this (clicking), this noise feels good. It's something that's sort of more tactile. - I have no issues with the screen, and I would say I was not babying my Z Flip, like I wasn't treating it with like kid gloves. Like I was being, I was just treating it like a phone. Using it, and I was never really trying to be casual about how I was pressing it or anything like that. I had no issues with mine. - One of the things that's most noticeable going from the original Z Flip to the Z Flip3, is the screen. It's a nice sunny day out. Got a little bit of shade here. And if I try to open up the screen on the regular Z Flip, I mean, I can see it, but it's dim. On the Z Flip3, not only is this a very viewable screen in broad daylight, it's brighter than something like my iPhone 12 Mini's display, which is a very nice, very bright panel. The fact that they've not only upgraded to 120Hz, but almost more importantly than that, they've improved the brightness, makes a big, big difference. I've been critical in the past of folding phones, but specifically, again, the Z Flip and the Moto Razr, that one of the issues with these phones is cooling. Now, if you look at a Z Flip, what you've got is essentially all the guts of the phone are in the top half. On the bottom, it's primarily the battery and some of like wireless charging. There's a little bit of a battery here, but primarily, this is where your CPU, all the cooling apparatus is. And therefore, you can kind of think about this as, the phone as it starts to heat up, only has about half a phone to actually dissipate that heat. It's the same thing with the Z Flip3, however, whatever they've done to redesign it this time around, at least for my initial experience, has made an improvement. With the original Z Flip, there would be times where I would be on a video call, where I would be doing some split screen multitasking, and the phone would be not only really hot to my hand, but it would straight up telling me like, \"Oh, hey, your phone is starting to overheat. You've got to close your second app or whatever.\" I've had none of those issues with the Z Flip3, and I've used this on some pretty warm days in some pretty extreme situations. And again, it kind of plays into the idea that the Z Flip3 is really a phone that is ready for the mainstream. Thousand dollars, not cheap, but when you consider how much more you can do with this phone, the compromises that you have to make feel totally worth the trade off in my opinion. Now, you might disagree, and one of the big trade offs that I will certainly say with the Z Flip3 that is absolutely here, is the battery life. The original Z Flip and the Z Flip3 both have the exact same 3300 milliamp hour batteries. This is the exact same battery, except it has a brighter 120Hz display. That, paired with the fact that this has not only 5G but also sub-6 and millimeter wave 5G, I can make it through a full day on the Z Flip. I do usually make it through a full day with the Z Flip. It is not the easiest thing to do. I wish that Samsung had found some way, even if it was something as simple as they had to make the phone slightly thicker to fit even a little bit more battery life in here. As someone who uses two phones on a daily basis, I can kind of get away with it. If this is your primary device, for anything more than like an average day I would say, you're gonna start to struggle, you're gonna want to start looking for a charger before the end of the day. Something else. There's a compromise on a thousand dollar phone. Are the cameras. I can sum this up really quickly. The camera solution on the Z Flip3 is a 12 megapixel main wide angle camera, as well as an ultra wide camera, and then you have a 10 megapixel front facing selfie camera. That is the exact same as the Z Flip 5G, which was the exact same as the first Z Flip, which is basically the exact same as the several year old Galaxy S10e, a $700 phone from like 2018. - We were talking on the podcast about the cameras. The cameras, they're just fine, but this is not in a \"just fine\" price category. I'm really pleased that they put modern chip in this, this is one of our first issues with the first ones, but now it's got to kind of hold its own in the classes that its in. - Some of the upgrades on the Z Flip3, that while aren't super headline making or whatever but I think work worth a mention, are the fact that it now has stereo speakers, something that was a bit of a pain point on the tiny little speaker on the original Z Flip. On top of that, Samsung have also done a lot of sort of behind the scenes software updates, which, to be fair, have now trickled down to the original Z Flip. One of my personal favorites is that you can now force apps into flip mode, which essentially means that while some apps like YouTube and Google Duo and a lot of the Samsung apps, when you have it in flex mode, it will automatically just put it on the top half of the display, and maybe it'll give you some additional stuff on the bottom half. But you can actually, manually, if you go into the Samsung Labs feature, you can manually toggle on apps, that as soon as you put it into flip mode, they will shrink themselves to the top of the screen. What I really look forward to seeing is some of the upgrades they can do to the outer display. So they've already, just since I've started making this video, they've added a widget for the voice memos, but there's also a lot more you could do with this, right? Like as of right now, this little exterior display, it's nice for taking selfies. It's nice to be able to read more than like eight words on a notification, but it's still a little limited, it doesn't really do that much more. But as more and more apps and widgets are updated to take advantage of that outer display, I think it could become a legitimate asset. Something else I want to mention, especially if you are considering buying a Z Flip, a feature I highly recommend turning on is this side key swipe feature. So it's in the settings, and essentially what it allows you to do, because when you open up this phone, I mean, its tall, but instead of trying to reach down and pull your stuff down, you can use the side key to do it instead. Super, super useful thing, that especially if you've never used a Z Flip before, you may not even know that option exists, but I use it all the time. I mean, obviously I'm biased here because it's a phone I like, but it's a phone I like not because of any other reason besides it's something I'm passionate about. It not only feels cool to use, but it feels like the future in a way that's not just a gimmick. It's easy to make a phone with a million cameras and blah, blah, blah, blah, blah, or some crazy colorway. But phones, generally speaking, have been very samey for a long time. Android, iPhone, OnePlus, Samsung. There are differences, and I mean, I'm not saying that they're not significant, but they all kind of do the same thing. The Z Flip, and to, I guess, a slightly lesser degree, at least in my opinion, the Z Fold, which has its own set of trade-offs that I think the Z Flip kind of avoids, this phone is the full package of not only cool and sure, gimmicky, but the gimmicks that come with the foldable form factor are legit. This is not for everyone. You may be better off buying an S21 or an S21 Ultra or whatever, but the Z Flip, to me, is not only the first folding device that I can very confidently recommend, but on top of that, this device, I think, is the first of the foldables that has really started to capture the imagination of people. - This is a phone that will turn heads. People are gonna look at you when you're using it, maybe you like that, maybe you don't. But it's also when it's closed. It's one of the coolest looking phones out there right now. I love it for that. It really does look and feel really cool, even more so than the original. - They can improve the battery life and give me a slightly better cameras. This is a slam dunk, but as of right now, I am incredibly happy to spend the next 12 months plus using the Z Flip3 as my main daily driver. Thank you very much for watching. If you were interested in more Z Flip talk, you would likely find my podcast, The Test Drivers, illuminating, because we talk about this thing every single episode, basically. So feel free to go check that out. Not only are the episodes available on YouTube, but also you can go subscribe at relay.fm/testdrivers. And until next time friends, I'm gonna go and enjoy a fliptastic year of being a hipster and ahead of the curve, 'cause now everyone likes the phone that I like.",
    "transcript_keywords": [
        "Flip",
        "phone",
        "original Z Flip",
        "Samsung",
        "phones",
        "screen",
        "lot",
        "flip mode",
        "kind",
        "Galaxy",
        "folding phone",
        "Flip kind",
        "display",
        "things",
        "bit",
        "pretty",
        "original",
        "pocket",
        "time",
        "video"
    ],
    "transcript_entity_values": [
        "Google Duo",
        "100,000",
        "Xiaomi",
        "5",
        "half",
        "iPhone",
        "Mini",
        "120Hz",
        "hundreds of thousands",
        "iPhone 12",
        "first",
        "one second",
        "a million",
        "two",
        "the Galaxy Fold",
        "Matt",
        "four",
        "1,450 bucks",
        "4 inches",
        "only 5",
        "one",
        "60",
        "tens",
        "4.3 inches",
        "S21",
        "Flip",
        "last year",
        "the last year",
        "OnePlus",
        "Galaxy S10e",
        "the early days",
        "Z Flip3",
        "next year",
        "18 months later",
        "a full day",
        "a half",
        "2500 milliamp hour",
        "Samsung Galaxy Z Flip3",
        "third",
        "2018",
        "the Z Flip",
        "Snazzy Labs",
        "a Z Flip",
        "10 megapixel",
        "a thousand dollars",
        "The Test Drivers",
        "80%",
        "Galaxy S20",
        "up to 20 minutes",
        "the end of the day",
        "5.3 inch",
        "Hertz",
        "these days",
        "YouTube",
        "more than like eight",
        "Ultra Thin Glass",
        "a little over 800 grams",
        "57%",
        "the Z Flip3",
        "Samsung Labs",
        "Thousand dollars",
        "Yo",
        "Quinn",
        "seven",
        "today",
        "daily",
        "millimeter",
        "their Premier Service",
        "the last year and a half",
        "the next 12 months",
        "the Z Fold",
        "the several year old",
        "the Z Flip3",
        "RGB",
        "700",
        "a couple of weeks ago",
        "X8",
        "Gorilla Glass",
        "CPU",
        "a thousand dollar",
        "One",
        "3300 milliamp hour",
        "more than a year",
        "up to 30 minutes",
        "so many hours",
        "Pro Max Chungus Edition",
        "more than like 17",
        "12 megapixel",
        "Motorola",
        "Eufy",
        "Samsung",
        "the Z Flip3",
        "12",
        "Galaxy Z Premier Service",
        "Galaxy Note",
        "second",
        "the Galaxy Note's",
        "H30",
        "about half",
        "IPX8",
        "Dale Gribble",
        "the Z Fold"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "MONEY",
        "WORK_OF_ART",
        "PERCENT",
        "PRODUCT",
        "TIME",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "EVENT",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "DATE",
        "FAC",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "TIME",
        "TIME",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.12035010755062103,
        -0.030221002176404,
        0.1010957732796669,
        -0.03559990972280502,
        0.06122111901640892,
        -0.08902944624423981,
        -0.016805261373519897,
        0.0566956102848053,
        0.0028864589985460043,
        -0.026278935372829437,
        -0.007954863831400871,
        0.028136568143963814,
        0.023485315963625908,
        -0.041298240423202515,
        0.05012085661292076,
        -0.028540706261992455,
        0.021058639511466026,
        -0.07297240942716599,
        -0.04344562441110611,
        -0.037897221744060516,
        0.007645536679774523,
        -0.05333695188164711,
        0.03278813138604164,
        -0.01675570383667946,
        0.00706035690382123,
        0.025492949411273003,
        -0.028251824900507927,
        -0.01942863129079342,
        -0.058976203203201294,
        0.02707643434405327,
        0.007465286646038294,
        0.1501581370830536,
        -0.015530732460319996,
        -0.0440862774848938,
        -0.041108231991529465,
        -0.12000808119773865,
        -0.013234540820121765,
        -0.007657250389456749,
        -0.016252759844064713,
        0.02561558037996292,
        0.00030709351995028555,
        -0.029897751286625862,
        0.020670942962169647,
        0.011368795298039913,
        0.0067849233746528625,
        -0.0029531503096222878,
        0.02236548624932766,
        -0.030816342681646347,
        0.010969278402626514,
        0.010759149678051472,
        -0.01656402088701725,
        -0.045045722275972366,
        -0.015105213038623333,
        -0.03588275983929634,
        -0.023827029392123222,
        0.09203238040208817,
        -0.013601561076939106,
        0.026779109612107277,
        0.046277258545160294,
        -0.020092856138944626,
        0.08350574225187302,
        -0.05111117288470268,
        -0.04631069675087929,
        0.020870797336101532,
        0.040080104023218155,
        -0.025464540347456932,
        -0.017060553655028343,
        -0.006006296258419752,
        -0.013604656793177128,
        0.03520822152495384,
        -0.0693584755063057,
        0.008090468123555183,
        0.05121883749961853,
        0.03518086299300194,
        0.03592889383435249,
        0.009753555059432983,
        0.13793374598026276,
        -0.0075493864715099335,
        -0.017197467386722565,
        -0.013966195285320282,
        0.05236375704407692,
        -0.06573735922574997,
        -0.05106501653790474,
        -0.007895347662270069,
        0.017270904034376144,
        -0.04443975165486336,
        -0.004674192052334547,
        0.08942869305610657,
        -0.04546879604458809,
        -0.023649295791983604,
        -0.034345149993896484,
        0.10120603442192078,
        0.038143642246723175,
        -0.011647064238786697,
        0.023983443155884743,
        0.08136911690235138,
        -0.05991513654589653,
        -0.07745896279811859,
        -0.0033588684163987637,
        0.06153898313641548,
        0.06311377137899399,
        -0.010147747583687305,
        0.08333448320627213,
        0.017168808728456497,
        -0.0042526694014668465,
        -0.022163698449730873,
        -0.0276799276471138,
        0.03953855112195015,
        -0.09553015232086182,
        0.05043325200676918,
        0.0018477304838597775,
        -0.0021314341574907303,
        0.038402456790208817,
        -0.04457753524184227,
        -0.0673755556344986,
        0.030650325119495392,
        -0.06784453988075256,
        0.08228015154600143,
        0.057833995670080185,
        0.0366479754447937,
        0.016046054661273956,
        0.015749193727970123,
        -0.02226828783750534,
        -0.0723901316523552,
        -0.011063073761761189,
        0.0282107125967741,
        0.004899634048342705,
        3.606754990290624e-33,
        -0.04751450568437576,
        0.12449243664741516,
        -0.08971444517374039,
        0.01871565356850624,
        -0.05476376414299011,
        0.09793702512979507,
        0.022782331332564354,
        0.046102628111839294,
        -0.021134115755558014,
        0.03418627753853798,
        -0.02120528370141983,
        0.06119467318058014,
        -0.0582759790122509,
        -0.018139729276299477,
        -0.013668178580701351,
        -0.03788704425096512,
        -0.09854409843683243,
        -0.02360435575246811,
        -0.022950146347284317,
        -0.0400235541164875,
        0.08486158400774002,
        -0.0504603236913681,
        -0.022207988426089287,
        -0.05466043949127197,
        0.10073430836200714,
        -0.024781255051493645,
        0.07672359049320221,
        -0.10133736580610275,
        0.021726524457335472,
        -0.013384614139795303,
        -0.02707189880311489,
        0.011281399987637997,
        0.02460547164082527,
        -0.12178930640220642,
        0.023568391799926758,
        -0.0049674659967422485,
        0.001300631440244615,
        -0.13653187453746796,
        -0.0035738141741603613,
        -0.04383639246225357,
        -0.01127840206027031,
        0.006425553001463413,
        -0.09660880267620087,
        0.03854458034038544,
        -0.011958963237702847,
        0.014228046871721745,
        0.022617783397436142,
        -0.03778372332453728,
        -0.04909934848546982,
        -0.04240567609667778,
        0.009747899137437344,
        -0.047551240772008896,
        -0.10520598292350769,
        -0.009817305020987988,
        -0.0370170883834362,
        -0.02810393087565899,
        0.025591745972633362,
        -0.005674181040376425,
        0.060152243822813034,
        0.015682974830269814,
        0.0194215327501297,
        0.0022755886893719435,
        -0.06980205327272415,
        0.015107843093574047,
        -0.08286254853010178,
        0.09412899613380432,
        0.0491115003824234,
        -0.01017820555716753,
        -0.04223020374774933,
        0.06029697507619858,
        0.03147188201546669,
        -0.08882758766412735,
        -0.03636953979730606,
        -0.01415953692048788,
        0.062436167150735855,
        0.030681703239679337,
        -0.03421367332339287,
        0.015398700721561909,
        -0.035637207329273224,
        -0.029569784179329872,
        0.0029703385662287474,
        -0.05917193368077278,
        0.010173260234296322,
        0.05668063461780548,
        0.056367479264736176,
        -0.025705046951770782,
        0.035722989588975906,
        -0.07377143204212189,
        0.018056437373161316,
        0.05671011656522751,
        -0.04407874122262001,
        -0.02531544677913189,
        0.04933805391192436,
        0.044607073068618774,
        0.018986139446496964,
        -3.674443261088833e-33,
        -0.08468581736087799,
        0.013675187714397907,
        0.0004248067853040993,
        0.023740902543067932,
        0.01184121984988451,
        -0.08582169562578201,
        0.011755308136343956,
        0.025925079360604286,
        -0.04188034310936928,
        -0.06936559081077576,
        -0.02008429728448391,
        0.06004423275589943,
        0.0624971017241478,
        -0.035825423896312714,
        -0.0367010198533535,
        -0.07191891223192215,
        0.03223852440714836,
        -0.1402980387210846,
        0.029132341966032982,
        0.01978577859699726,
        0.049206897616386414,
        0.0708962008357048,
        -0.02054082788527012,
        0.029643703252077103,
        -0.049924448132514954,
        0.042943816632032394,
        0.043154798448085785,
        0.055742297321558,
        0.04881405085325241,
        0.01978396251797676,
        -0.05355391651391983,
        -0.06883677840232849,
        0.06435160338878632,
        -0.015123862773180008,
        0.03012513369321823,
        0.08867491781711578,
        0.07039149850606918,
        -0.03606336563825607,
        -0.05402836948633194,
        -0.02705235220491886,
        0.04063672199845314,
        -0.04868609458208084,
        0.012269038707017899,
        -0.015460705384612083,
        -0.002006368013098836,
        -0.00392538495361805,
        -0.021871959790587425,
        0.08370382338762283,
        0.026028065010905266,
        0.001389494282193482,
        0.046464961022138596,
        0.007383408956229687,
        -0.0005432778270915151,
        -0.012073651887476444,
        0.011440898291766644,
        0.027021484449505806,
        0.1198791041970253,
        -0.04981818422675133,
        0.030921896919608116,
        0.0006853353115729988,
        0.04264874756336212,
        0.0025344891473650932,
        0.05074997991323471,
        -0.024150079116225243,
        -0.016456136479973793,
        0.012853633612394333,
        0.10399655997753143,
        -0.02695636637508869,
        0.03404930233955383,
        0.007438346277922392,
        -0.06958681344985962,
        0.043647393584251404,
        -0.03538059815764427,
        -0.14729440212249756,
        -0.01724306121468544,
        0.09141773730516434,
        -0.03213462233543396,
        0.04533946514129639,
        0.006778436247259378,
        -0.0582093670964241,
        -0.04833551496267319,
        0.06592722237110138,
        0.10343518108129501,
        0.040752340108156204,
        0.04496204853057861,
        0.01039791852235794,
        -0.04489263519644737,
        -0.013055352494120598,
        0.0037433963734656572,
        -0.004448337014764547,
        -0.09434407204389572,
        -0.025181764736771584,
        -0.11006490141153336,
        0.07412078976631165,
        0.024006327614188194,
        -5.4842526964193894e-08,
        0.05118474364280701,
        0.052831944078207016,
        0.0630052238702774,
        0.038816966116428375,
        0.01693754270672798,
        -0.04018228128552437,
        0.011009825393557549,
        -0.035708773881196976,
        0.0903281643986702,
        0.009620975703001022,
        0.0178145170211792,
        -0.0439118966460228,
        -0.008509915322065353,
        0.07642261683940887,
        0.07353188842535019,
        0.10089536756277084,
        -0.010916300117969513,
        -0.005906064063310623,
        -0.015322722494602203,
        0.028567073866724968,
        0.03451428562402725,
        0.03844312205910683,
        0.04038982093334198,
        -0.013944505713880062,
        0.08196620643138885,
        0.014769775792956352,
        -0.029850231483578682,
        0.04635244980454445,
        0.06303632259368896,
        -0.054819051176309586,
        -0.043269041925668716,
        -0.06126868352293968,
        0.05399129167199135,
        -0.01279904693365097,
        -0.044732823967933655,
        -0.09653255343437195,
        -0.0433410108089447,
        -0.02402452751994133,
        0.05957736074924469,
        -0.0011342475190758705,
        0.03936729207634926,
        0.014346905052661896,
        -0.004046288784593344,
        0.060928668826818466,
        -0.08481132984161377,
        -0.14773358404636383,
        -0.031099285930395126,
        -0.1126462072134018,
        0.015216352418065071,
        0.022606253623962402,
        -0.0469869002699852,
        -0.08522477746009827,
        -0.012867962010204792,
        0.026125842705368996,
        0.10029718279838562,
        -0.007182391360402107,
        -0.028996244072914124,
        0.030287133529782295,
        -0.06762540340423584,
        0.08822304755449295,
        0.021785825490951538,
        -0.06944671273231506,
        -0.07003365457057953,
        0.0654364824295044
    ]
}