{
    "id": "AC1Uk7s7k3o",
    "title": "The best entry level drone - NEW Mini 3!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-12-15T19:25:21Z",
    "video_url": "https://www.youtube.com/watch?v=AC1Uk7s7k3o",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 130214,
    "likes": 4194,
    "comments_count": 212,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, it's Justine, and today, we have the brand new DJI Mini 3. Now, the last drone that came out in the Mini category was the Mini 3 Pro, and now we have the Mini 3. Now, the main difference is the price. You're gonna have a huge price difference. So this is coming in at a more affordable price for people who may be beginners. Maybe this is your first drone. This is gonna be a great one to start with. You're not gonna be able to shoot 4K60 like you could on the Pro, but you will be able to shoot 4K30. The transmission won't be as far, and it is lacking the obstacle avoidance on the front and on the top, but you will have the obstacle avoidance on the bottom. So I'm excited to try this out. I'm gonna be going to Hawaii for an event, so of course we're gonna be taking this with me. I love this drone so much because of the size. It's so small, it's portable, it's compact, and you can get some incredible footage. I also love that this comes with a controller, so you really don't even need a phone. Everything that you need is here in the box. This does use the same batteries as the Mini Pro. It's got a nice carrying case. Let's open it up. (zipper whining) Controller, accessories, batteries, and the drone. It's so shockingly small, I just cannot get over it. Oh my God, I never hit record on the top camera. No! We have had a tragedy. I can't recreate it. (laughs) It's already open. So here's the tiny little drone. It does have these small little sensors at the bottom, so that's your obstacle avoidance, and it is lacking the front obstacle avoidance sensors, but this thing is just so small that I just can't get over it. And here's the controller. So you'll see in the back, we've got our C2, C1 buttons. This is actually a pretty slim controller, and I even like having the display be below the joysticks. Even though it is a large display and it is kind of a large controller, it's pretty slim, so it does fit very nicely into all of my travel bags. I love it. We've also got some batteries. This does have the charging dock with it, which is very nice. This was so light, I didn't even realize that there was a battery in it. It's like paper. (upbeat music) And this is 249 grams, which means it is light enough that you don't have to register it with the FAA. Let's see what else we've got. Got some cables. And these propellers do need to be screwed in and out, so you've got your little screwdriver here. We've got extra propellers. There they are. These always remind me of a little packet of candy, but they're propellers. (music continues) So here's everything that comes in the box. We have our battery charger. So this allows you to charge 3 batteries. It does come with two extras, and there is one already inside the drone. We've got extra propellers. We've got our USB cables to charge. We've got a little screwdriver here that lets you adjust the props if you need to make a change, swap those out. Sometimes we hit things. And of course, we have our controller, and I love this controller so much. It's so beautiful, and it's so nice having an integrated screen inside of your controller. You don't need to have a phone, don't need to worry about anything. It's just all right here. So this is the whole kit. I'll put a link in the description if you wanna check this out, get more information, or to purchase, but for now, I'm gonna go pack this up and take it to Hawaii. Are you ready, my little friend? Pack your bags. We're going on a road trip. It's a plane trip, actually. We're going on a plane trip. (gentle upbeat music) (music continues) All right, good morning. We are here in Maui, and I'm gonna be taking this little baby Mavic 3 on its first flight. It's so beautiful here. I tried to get out a little bit earlier before the sun came out so that we'd have a little better lighting. So let's get this thing booted up and into the air. (music continues) One of my favorite things is this controller, because you don't need to use your phone. Right now, I'm using my phone to film this video. It's just a beautiful screen, the display looks incredible, and this drone so far feels super responsive. I'm up really high right now. I have reached our maximum altitude. I can't actually... Oh, I can see it. (laughs) There you are. Oh, yeah, the sun just popped. Looking lit. (music continues) One thing that is really cool that you can do with this is you have the ability to flip it into vertical, so if you don't wanna film horizontal, you wanna film something for TikTok or for Instagram Reels, you just hit this button right here, and look at us. We are now recording in vertical. It's really hard to film and talk and fly a drone at the same time, not gonna lie. Another thing that I love about DJI software and a bunch of their drones is they have this thing called Quickshots. If you've watched any of my drone videos before, you've definitely seen me do these. So I'm gonna test out a couple of these. There are a lot of people on the beach, so I may not be able to test out all of them, but I definitely think that my favorite is the \"Dronie.\" We're gonna highlight ourselves, and then I'm gonna hit \"start,\" and here we go. That man was (laughs) very close to my drone, and just ran right under it, so we love to see it. (bright upbeat music) Okay, the next one that we're gonna try is \"Rocket.\" (music continues) I really like this one. This is the \"Circle,\" and I think I can probably pull this off. You can't adjust the diameter of the circle, so you are able to confine yourself to a smaller space, and which I'm gonna have to do, because the tide is up and people are out. So however far out you put it is how far it will continue around, so it's basically just circling around you, which is what's happening right now. This does also have Photo Mode, so you can take some photos, which is crazy, because until I went on my last trip to Indonesia, I actually... Not that I forgot that my drone could take photos, I just never did. It was something that I didn't focus a lot on. So I've been taking more photos with my drones recently. And this has a Pano Mode, which is really cool, because it takes a bunch of photos in different angles. Then it automatically stitches them together. It's doing it. It's doing it. Dude, the battery life is incredible. I've been flying for a very long time, and it wasn't even fully charged, and I'm at 21% right now. That's the one thing about this smaller drone is the fact of the battery life. Mm, so, so good. (bright upbeat music) We're in Sport Mode now, baby. Whoa. Oh, yeah, that's fast. Way faster. (music continues) Sport Mode makes such a huge difference. It's so fast. This also has a Cinematic Mode, which will allow you to get some super smooth, very crisp cinematic shots, but man, there's nothing more satisfying than flying in Sport Mode. Another cool thing that you can do is this does have a digital zoom. So right now, I'm at 1X. I can zoom into 2X. Looks pretty good, actually. The thing I will advise you is if you ever do fly a drone zoomed in, you will lose perspective of where you are, because the zoom definitely is deceiving, so be very careful if you are flying with the zoom on. (music continues) All right, I'm gonna bring you back down. This was so much fun to get a chance to check out, and I'm such a huge fan of the Mavic Mini line, because they are so small, so portable, so compact, but also very quiet, so they're not gonna be disturbing a lot of people if you are out flying it, and it is one of my favorite drones. I think the real question is, are you gonna get the Pro version or this new Mavic 3? I do like the Pro version because it does have a few of the extra obstacle avoidance sensors, so if that is something that you are concerned with, then I definitely recommend getting the Pro. But now that they do have this smaller, less expensive version, it's pretty much the same. It flies the same, the footage already looks incredible, so I'm super excited about this. So if you guys wanna get more information about the new Mavic Mini 3, I will put a link in the description. Feel free to check it out. If you guys have any questions, feel free to leave them in the comments below, and I'll see you guys in the next video. Where are you? You're so... It's so far away. (waves crashing) (bright upbeat music) (beep) I love chatting with people, but it is very hard to chat and fly and make sure your drone is staying in the air, so if you ever wanna chat with a drone pilot, it's probably best that... (laughing) It's really best that you don't. (bright ambient music)",
    "transcript_keywords": [
        "drone",
        "Mini",
        "Pro",
        "controller",
        "Mavic Mini",
        "thing",
        "Mode",
        "Mini Pro",
        "Sport Mode",
        "obstacle avoidance",
        "love",
        "Justine",
        "Mavic",
        "Pro version",
        "avoidance",
        "obstacle",
        "small",
        "DJI Mini",
        "people",
        "drones"
    ],
    "transcript_entity_values": [
        "DJI Mini 3",
        "Circle",
        "DJI",
        "one",
        "the Mini 3.",
        "249 grams",
        "4K60",
        "Justine",
        "Mavic Mini 3",
        "Hawaii",
        "Mavic 3",
        "Dronie",
        "C2",
        "21%",
        "C1",
        "Mm",
        "Maui",
        "Pano Mode",
        "FAA",
        "a Cinematic Mode",
        "Instagram Reels",
        "3",
        "Photo Mode",
        "Mavic Mini",
        "Sport Mode",
        "today",
        "Indonesia",
        "two",
        "the Mini Pro",
        "Mini",
        "first",
        "Sport Mode",
        "USB",
        "TikTok",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "FAC",
        "QUANTITY",
        "DATE",
        "PERSON",
        "ORG",
        "GPE",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "PERCENT",
        "PRODUCT",
        "PERSON",
        "LOC",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.007188750896602869,
        -0.07329800724983215,
        -0.049539197236299515,
        -0.12627066671848297,
        0.025324610993266106,
        0.025323228910565376,
        0.02613232098519802,
        0.05718620866537094,
        -0.04628842696547508,
        0.10254324972629547,
        0.008290015161037445,
        0.00028917298186570406,
        -0.007620526012033224,
        0.006812839303165674,
        0.02804410643875599,
        0.05552170053124428,
        0.07882622629404068,
        -0.0025113539304584265,
        0.032032135874032974,
        0.012920813634991646,
        -0.04345409572124481,
        -0.03622619807720184,
        0.04543674364686012,
        0.004163259174674749,
        -0.017517372965812683,
        0.06763243675231934,
        -0.010366271249949932,
        0.056050047278404236,
        -0.077934131026268,
        -0.07135596871376038,
        -0.014197587966918945,
        0.03738060221076012,
        0.09917093813419342,
        -0.02797308936715126,
        0.028510624542832375,
        -0.026630382984876633,
        0.08039446175098419,
        -0.02991655096411705,
        -0.009898832999169827,
        -0.023211484774947166,
        -0.016498446464538574,
        -0.01699203811585903,
        -0.0007319999276660383,
        -0.04584683105349541,
        -0.06181151047348976,
        -0.08184370398521423,
        0.015244740061461926,
        -0.0619976632297039,
        0.05523218587040901,
        0.03753187879920006,
        -0.07124313712120056,
        -0.04839855059981346,
        0.03196704387664795,
        0.022265397012233734,
        -0.07327274978160858,
        -0.007319519761949778,
        -0.10291220247745514,
        0.0014044218696653843,
        0.03951149806380272,
        -0.09139834344387054,
        -0.010694723576307297,
        -0.04432516172528267,
        0.02041676640510559,
        0.018185781314969063,
        -0.061038535088300705,
        -0.08291228860616684,
        -0.0027013549115508795,
        -0.01228558924049139,
        0.0330975316464901,
        0.024860458448529243,
        -0.11944077908992767,
        0.05294061824679375,
        -0.054662518203258514,
        0.03930952399969101,
        -0.024159712716937065,
        0.048269569873809814,
        0.09903452545404434,
        -0.05710791051387787,
        -0.03634991869330406,
        0.04716436564922333,
        0.034762877970933914,
        -0.0313216894865036,
        -0.1208048090338707,
        -0.03096623905003071,
        -0.03351433202624321,
        0.0024461376015096903,
        -0.009915409609675407,
        0.032149143517017365,
        -0.0195494145154953,
        -0.04691101983189583,
        -0.051183611154556274,
        0.005613061133772135,
        -0.02341512404382229,
        -0.001299109193496406,
        0.020741788670420647,
        -0.05883270502090454,
        -0.008378404192626476,
        -0.09570971876382828,
        -0.008533092215657234,
        0.06647597998380661,
        0.05412803217768669,
        -0.07108316570520401,
        0.0032777509186416864,
        -0.037751492112874985,
        -0.0023151880595833063,
        -0.07095778733491898,
        0.0010626328876242042,
        0.005137303844094276,
        0.02664704993367195,
        -0.0025785602629184723,
        -0.0619201697409153,
        0.019782323390245438,
        -0.07751139998435974,
        -0.056582506746053696,
        0.010332639329135418,
        0.10279706120491028,
        -0.006935295183211565,
        0.0636817067861557,
        0.029488971456885338,
        0.05143800750374794,
        -0.006505883764475584,
        -0.10032681375741959,
        0.0298666562885046,
        0.05657273530960083,
        0.027927614748477936,
        0.03628332167863846,
        -0.06735910475254059,
        1.1995243206205752e-32,
        -0.019307995215058327,
        0.1062060222029686,
        -0.009122483432292938,
        0.06736452132463455,
        0.0017385903047397733,
        -0.005441047251224518,
        0.011340387165546417,
        0.06786423176527023,
        -0.012249631807208061,
        0.006963662803173065,
        -0.031150177121162415,
        0.040569715201854706,
        -0.04373500868678093,
        0.047025084495544434,
        0.077566958963871,
        -0.05967996269464493,
        -0.043288104236125946,
        -0.044343166053295135,
        -0.059350211173295975,
        -0.011792687699198723,
        -0.01050115842372179,
        -0.02705463394522667,
        0.014687768183648586,
        0.09280042350292206,
        0.15463043749332428,
        0.04660391807556152,
        0.0718437135219574,
        -0.03848947584629059,
        0.048344697803258896,
        0.003967165481299162,
        -0.022157208994030952,
        -0.08316727727651596,
        -0.017969554290175438,
        -0.08057624846696854,
        -0.016204776242375374,
        0.01904238387942314,
        -0.0738455131649971,
        -0.025374677032232285,
        -0.04145004227757454,
        -0.05509257689118385,
        -0.032502926886081696,
        0.019388435408473015,
        -0.01824464648962021,
        -0.0680384486913681,
        0.06768506020307541,
        0.03241194412112236,
        0.029052000492811203,
        0.09083732217550278,
        -0.027981359511613846,
        0.008185022510588169,
        -0.011065744794905186,
        0.007284001912921667,
        -0.04163732752203941,
        -0.00412170123308897,
        -0.04116792976856232,
        -0.06571466475725174,
        -0.011580769903957844,
        0.03825750946998596,
        0.025568583980202675,
        0.04161358252167702,
        -0.0006353199714794755,
        -0.045802511274814606,
        -0.05157109349966049,
        -0.008800163865089417,
        -0.06140585243701935,
        0.08805383741855621,
        0.07441185414791107,
        -0.02407611347734928,
        0.05135350674390793,
        0.06266293674707413,
        -0.01024527009576559,
        -0.0004600878164637834,
        0.06258926540613174,
        0.016394037753343582,
        0.056370195001363754,
        0.07668007910251617,
        -0.08509460091590881,
        -0.05170205608010292,
        0.03963750600814819,
        -0.03325647488236427,
        -0.1084287092089653,
        0.10542608052492142,
        -0.034776292741298676,
        0.11860882490873337,
        -0.03152753785252571,
        -0.055055126547813416,
        0.02405664511024952,
        -0.034709881991147995,
        -0.0262379739433527,
        0.024878017604351044,
        -0.03984953835606575,
        0.06187576428055763,
        -0.06365398317575455,
        -0.022065702825784683,
        -0.030335189774632454,
        -1.1428996557155117e-32,
        0.04041784256696701,
        0.016617510467767715,
        0.03355362266302109,
        -1.2869410056737252e-05,
        0.0416838601231575,
        -0.03626233711838722,
        0.03910449892282486,
        0.09633069485425949,
        0.06141920015215874,
        -0.05297238752245903,
        0.01631998084485531,
        -0.019324645400047302,
        -0.06262315809726715,
        0.019854582846164703,
        -0.014097250066697598,
        -0.0126616470515728,
        -0.07205871492624283,
        -0.09230317175388336,
        0.124857097864151,
        -0.03202340751886368,
        0.10801594704389572,
        0.1348758339881897,
        0.05835704877972603,
        0.021072832867503166,
        0.044949885457754135,
        0.003276680363342166,
        -0.019068952649831772,
        0.050159208476543427,
        0.032548688352108,
        0.0017125942977145314,
        -0.02084263786673546,
        -0.0603603757917881,
        0.03619334101676941,
        0.008699560537934303,
        0.040083661675453186,
        0.05710088089108467,
        0.014870940707623959,
        0.028803665190935135,
        0.0033090582583099604,
        -0.022283684462308884,
        0.039916835725307465,
        0.01906103454530239,
        0.0239386186003685,
        -0.04225168004631996,
        -0.005702008027583361,
        -0.09845854341983795,
        -0.046861033886671066,
        0.059722382575273514,
        -0.010437265038490295,
        0.010450534522533417,
        -0.10188543796539307,
        -0.059330862015485764,
        -0.010812750086188316,
        0.002490401966497302,
        0.019619591534137726,
        -0.004523651208728552,
        -0.07226839661598206,
        -0.013994610868394375,
        0.03661217913031578,
        0.019072890281677246,
        0.034944552928209305,
        -0.02539735659956932,
        -0.07166701555252075,
        -0.020913850516080856,
        -0.025336990132927895,
        -0.05096370726823807,
        0.07691456377506256,
        0.04980781301856041,
        -0.04487401992082596,
        0.010347378440201283,
        -0.004469203297048807,
        0.014298837631940842,
        0.059569984674453735,
        -0.010676426813006401,
        -0.00683968560770154,
        -0.010118361562490463,
        -0.08144256472587585,
        0.017316419631242752,
        0.08615471422672272,
        -0.07146881520748138,
        -0.05303124710917473,
        0.009058378636837006,
        -0.01878967694938183,
        0.07915997505187988,
        0.1015176996588707,
        0.12084688991308212,
        0.06568159908056259,
        -0.04963094741106033,
        -0.004853760823607445,
        0.037462010979652405,
        0.02858184650540352,
        0.03054235316812992,
        0.09035483747720718,
        0.072585329413414,
        -0.10766629129648209,
        -5.88839839110733e-08,
        0.03828534483909607,
        0.04044457525014877,
        -0.02726166509091854,
        0.005767594091594219,
        0.02877807430922985,
        -0.04607558250427246,
        -0.04921847954392433,
        0.03274480998516083,
        0.0662572979927063,
        -0.011248709633946419,
        0.10892908275127411,
        -0.06460393220186234,
        -0.004584543406963348,
        0.07233331352472305,
        0.029851505532860756,
        0.02138928696513176,
        -0.08158072084188461,
        0.04530717059969902,
        -0.030032072216272354,
        -0.060579944401979446,
        -0.06366781890392303,
        0.09141180664300919,
        0.00873133260756731,
        -0.00868466217070818,
        0.032043684273958206,
        -0.0011296940501779318,
        -0.04039916768670082,
        -0.04853137210011482,
        0.03376240283250809,
        0.00011082686251029372,
        -0.0925130695104599,
        0.032019902020692825,
        0.0013895342126488686,
        0.0025466883089393377,
        -0.05656703561544418,
        -0.02268592268228531,
        -0.06531573832035065,
        -0.010015500709414482,
        0.0020371731370687485,
        0.005664651747792959,
        0.04529973864555359,
        -0.10476798564195633,
        -0.06463681161403656,
        -0.039010077714920044,
        0.01002467516809702,
        -0.06263052672147751,
        -0.0014685195637866855,
        -0.11986865848302841,
        -0.05049724876880646,
        -0.04712595418095589,
        -0.042785126715898514,
        0.04409819096326828,
        0.01187774259597063,
        -0.01005201693624258,
        0.056939929723739624,
        0.04570833593606949,
        -0.004953661002218723,
        0.036047209054231644,
        -0.006134313531219959,
        -0.022374410182237625,
        0.04531605914235115,
        0.020265910774469376,
        -0.05860335752367973,
        0.05715851113200188
    ]
}