{
    "id": "AJpPrOg34vM",
    "title": "Does Austin Evans Actually Know Tech!?",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-09-02T17:36:39Z",
    "video_url": "https://www.youtube.com/watch?v=AJpPrOg34vM",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "this is gameshow",
        "trivia",
        "game",
        "quiz",
        "honor",
        "view 10",
        "tiger and bunny",
        "kriem",
        "newton messagepad",
        "newton",
        "siemens",
        "xelibri",
        "xelibri 6",
        "google",
        "pixel 3a",
        "toshiba",
        "Toshiba g450",
        "bluboo s1",
        "ape escape",
        "ps1",
        "canon notejet",
        "canon",
        "igame",
        "colorful",
        "gtx680",
        "samsung",
        "sph-p9000",
        "flippy boy",
        "mkb",
        "ijustine",
        "jerryrigeverything",
        "ken bolido",
        "smartphones",
        "tech",
        "technology",
        "review",
        "gameshow",
        "austinnotducan",
        "ducan33303"
    ],
    "views": 109147,
    "likes": 4941,
    "comments_count": 282,
    "description": "Let's see if Austin has been paying attention... The IMPOSSIBLE Gaming Challenge ft.  @Kevin Kenson   Can you TRUST Gameranx?! ft. Jake Baldino:  I Showed You My Tech Tip ft.  @Linus Tech Tips  The IMPOSSIBLE Apple Challenge ft.  @iJustine:  EXPOSING Dave2Ds Tech   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/1PNBEqw_Fmk",
        "https://youtu.be/e15q1y6cxtw",
        "https://youtu.be/N_VoajKuBhs",
        "https://youtu.be/sd8UfamDJOg",
        "https://youtu.be/53RBwdzW6fs",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to the, this is game show. Austin loves to host these episodes. What we're gonna find out today is, does it Austin actually pay attention to these questions? - (Austin laughing) - or is he just reading off - the note card that I have provided for - I'm reading , I will just say this straight up, I am reading. - What we're going to test today - Okay, - is how well, you have been paying attention, - Not well, - to the, this is game show? - not well. - let's move on, to question number one, - you even have the right intonation, that's good. = Yeah.It's almost like I pay attention, to the game show. - (Austin laughing) All right. All right. All right, sir. - [Austin] That is the, okay.The honor. That is an honor device. So I believe, this is, - walk me through, what are you looking for? - Okay, I'm looking for my memory, of when Sarah and I did this video, So, I believe that this is the honor, I wanna say, it's either the 6 X or the V 10, I think it's the V 10, This is the video, that Sarah, John and I did, as a sponsored video for honor back in the end of 2017. I'm gonna say, that this is the honor of the 10, I am not a 100%, sure on that. It also could be a 6 X, but I'm gonna say, final answer, your honor, V 10. - Austin Evans, - Yes. - the illustrious, - I do pay attention. - the wonderful, - Yeah. - I'm not even gonna joke with you right now, You got that 100% correct. That is the honor View 10 from 2017, - Excellent. - Which you did do a video, on with, John and Sarah, that we may or may not have a clip right here. - [Man] (mumbles) - Can I just say a guess right now, is the last question, one of those weird motherboards that line has had to do, is that like, my final question? - it's kind of presumptuous, that you'd think that I would use that. Let's move on to question number two. - [Austin] Okay. So, this is from the, never before seen, episode of does Ken know anime, which sadly never saw the light of day. So, I remember, the cards or the card symbols, like the spades, in the hearts and the diamonds around her head. That was definitely a big clue. I seem to recall her name was something to do with cards, not joker, but like something like, I don't remember, I'm gonna throw a name, I'm pretty positive this isn't correct, but this is one of the only animates that I remember from this episode, was it Violent Ever garden? And her name was like, I don't think Ken got this one right? But, I think her name was like Spade. Not correct, No, Johnny just said Joker. Joker from Violet Everett Garden is my final answer. - [Ken] for the record, I love Violet Ever garden. - And this is not it, is it? - [Ken] How dare you, I got that one right. - What am I looking at? - Martin not Duncan, - Stop Pretending to be me, it only worked with IVL dramatic. - after two - (Austin laughing) - grueling questions. I regret to inform you that you got zero points on that. - Okay. - That is Kline from tiger and bunny. - [Austin] Oh yeah. so I was 100% off. Okay, cool. - But I'm very happy to report that after two questions, you're still at 50%. So, you're completely in the running. - I swear Mark you can be replaced with, a Austin Evans soundboard and it would still sound the same. - I think, that means that you could be replaced with an Austin Evans soundboard. - Yup. Very true. - Let's move on, to question number three. - [Austin] I think this is the, Apple Newton message pad 3000. I'm gonna say this was 1993. So the Apple Newton message pad 3000 from 1993. I think I'm correct on this one - Austin, - Yes. - I know your middle name Evans. - How dare you. - For question number three? You are, 15% correct. - Okay. - So while you love to just give points out all Willy nilly, I'm going to make you be much more specific because, again, at one point you had the right answers in your hand. - True. - So this is in fact the Newton message pad 2000. - Okay. - But it is in fact from 1993. - All right. So, three questions in, I will preemptively answer my own question. I'm feeling pretty confident right now. I've seen all these answers before and I remember at least 50% of them. I think I can get 50%. - Let's move on, to question number four, - please. Let's let's move on. Okay, So this is the Siemens celebrate. So, this is one of the ones we either had it for the Mr. Mobile show or the Mark show. I think this was the one of the Mr. Mobile question. I am not a 100% sure on which model of the celebrate it is. I think it's a number. I think it's like the celebrate 7, celebrate 3, The celebrate 2. I'm not super sure on that. I am pretty sure that this is from 2003 though, by my answer, by do I get a phone again? - [Interviewer] You do get a phone again. - I'm not gonna use it now, but I do get that. - [Interviewer] And by phone-a-ken, I mean, you're just going to talk to him cause he's right there. - Alright. Siemens celebrate three 2003 final answer. - 50%, correct. - Okay. - This is the, Siemens celebrate 6, six. - Okay. - But it is in fact from 2013. - 2003. - Yes, So you are still, Yes. See, look. - That's so easy. Is it? so wait, that was question 3 or 4? - That was the question 4. So you are at 50%. - Okay. I need to get a little ahead though. Cause I think that we're gonna get harder towards the end. - Yes. That's how the game show works. - It is. I know. Cause I host most of the time. - [Ken] Is there any episode, that you feel like would throw you off? - Yes. The slow-mo guys episode. That would definitely throw me off. - [Ken] We don't have that. - Excellent. So I'm not worried then? - Well, we don't have the slow-mo guys. We do have another friend of ours, in question number 5. - [Austin] Oh no.Okay. So, this is obviously from the Zack episode, looking at the phone. Oh God, nothing jumps out to me at all about this. This looks generic, Tom, 5000. - One of these days, I'm going to find the generic town 5,000 that you keep referring to. - [Austin] It looks like it's got a decent fair bit of cooling. So, I don't think this is a very old phone. I would say no later than 2017 or 2018. I'm looking at that, like the camera modules. It's very strange. - I'm gonna break the rules for a second. - [Interviewer] NO - [Ken] NO - Jimmy, can you shrink the size of it, to like this big to show everyone what I can see right now. Thanks. I appreciate it. I'm glad that I have some (murmurs) - you're on thyristor equal playing field as the contestants that we have on this game, - everyone puts their phones close to their face - Fact. - I'm gonna say that this is, a Google pixel 3. And that would have been in 2018. Yeah. 2018. So this is a Google pixel 3. So three from 2018 final answer. - for question number 5, you are still at 50%, because, while this is actually a pixel 3A, - [Austin] Aargh - it is from 2019, which is in that one year handicap. - Okay - So you're still at 50%. This is the point in the game where I like to say, you're while you're still in this, we do have a wager available. - Okay. - If you will. - Yes, please enlighten me. - If you can get 50% correct. You will be at, this is winner and no one can take that away from you. - However, - Fact. - At the end, we have a double or nothing, question, - [Austin] Am not gonna, take that I have ruin your suspense. I'm not gonna take that cause you guys are definitely gonna vote with me on this one. - And by the way, it's not optional. - (Austin laughing) - If you lose it, - Yes, - You have to make a 32nd commercial, for this is on an Austin Evans video. And if you lose, Ken and I get to tweet out, whatever we want each from your account. - Wait, - Not that this is account. - Wait. Okay. Hold on. - So, if I lose you guys tweet, you each get a tweet on my account. - Yes. - Okay. - If I win, I have to promote, this is no, we get to promote, this is on your channel. - No, we get to promote this is on your channel. - So at what point do I win here? - You don't. - It sounds like I lose. - You don't, - No matter what you don't, - you're the meme here. - We're just making fun of you - No. - That's like the whole point of this. - If you win, I'll do my job. All right, We've already moved on to the next question - [Ken] It's true. - Look at that, Ken jumped ahead and find out what this thing is. This is stupid. So this is weirdo 9,000. This is definitely from the Mr. Mobile episode, coz we gave him the worst stupidest phones, they've ever been designed. Nokia's coming to mind. But that's really weird for a Nokia. I don't think it's not a celebrating, The year, I still think the early 2000s, that was peak weird phone, when like the smartphone really wasn't fully, fleshed out yet, but the feature phone was a little bit too boring and sort of stale. So everyone were trying these wacky ideas. So I'm going to say, this is a Nokia 71 10. - You've made countless videos, - over a 1000. - And, - You can count them. - That did not help you in any way, shape or form - I know. - For question number 6, because, not only is this not a Nokia and it's not from 2003, but it's also not from the Mr. Mobile episode. - Was this (murmurs) episode? - Nope. This is the 2008 Toshiba G 450, from the snazzy labs Quinn Nelson episode. So not only did you get zero points, I'm actually going to take one away from you. - Why? - So, no, you are no longer at the 50% threshold - Well, I already wasn't, but now I basically have to get every question perfectly right. To even have a shot. - Oh yeah. And you're not gonna do that. So let's move on, to question number 7. - [Austin] So, this is a dogie, I believe, it's a meant to be that show me the oblique. Was it the me mixer? The super high end phone from like end of 17. I think that this is... There's a couple of versions. This is from the Dave 2D video. - I don't know, - I think it was Dave, but I remember that this one was tricky because it was either dogie or it was like some other, like, sort of much more obscure Chinese brand. I don't think it was Dogie though. I think it actually was something else. I'm gonna say, this is the point where I'm going to use my phone again. - This is your phone again, - This is my phone again. - Okay.So, can we get Ken on the phone - Yes. - and buy on the phone? Just yell. - I'll dial Ken, - he's right here. - 1006969420, Ken, Hi. How's it going? How's it going? - Am just gonna, oh - Hi Ken how is it going? - Hi - Hey - so do you know what this phone is? - No. - Okay, cool.Well, - And by no, I mean, I have the list there, - So you saying you will help me. - No. - Well, you know what, even though you didn't help me, I'm gonna still say thank you very much for trying and goodbye, I'm not gonna just hang up on you unceremoniously, Like everyone else does - Its true. - No ever says goodbye. - Goodbye Ken - They do just hang up on Ken. - [Austin] (murmurs)and this is from 2017, final answer. - Austin Evans. - Yes. - So many times on this show, our guests have a gut feeling and then they ignore that gut feeling. - Yeah - And they end up getting the question wrong but you know what? I'm actually gonna reward you, for going with your gut. This is the blue boom. S1 From 2017. I will give you full credit for that. - Thank you. - Just to show that I am an honorable host. I would say let's move on to question number 8. But Ken is standing behind me. - He has to hit the button over here. - And he's the one who's supposed to be handling the button (music playing) - Ape escape. 1999, 1989. Ape escape. I remember this one cause Kevin did not get this one right. And then, do you have the whole story about how Ape Escape, is your favorite game? This is like the little, intro East side effect thing. - You did get it correct, this is in fact ape escape from 1999. And it is in fact, my favorite game of all time. So let's move on to question number 9. - I'm not gonna get the name of it, right. And I'm not gonna get the year of it, right either. But yeah, this is the one where they've called you and you gave them the correct answer and then he didn't take it and lost. - I am, so offended by that, Dave. - So, this is the cannon, I wanna say like 600 CE or something. It's like the note jet, I think, the Canon note jet, it was early 90s, I wanna say like 1993. I'm not gonna get more specific than that. I'm just gonna say seven CE, from 1993, it would be my final answer. The whole gimmick with this one, is that there's a printer built into the laptop, because I guess they thought that, that was a good idea. - Austin, not Duncan, for question number 9, you have reclaimed the lead. That is a 100% correct. This is the Canon note jet from 1992. - Okay. - So that is within that one here, Handicap. So let's move on to question number 10(laughing). - Is it time for scenes out of the hat yet or no, we do a hoedown. - Yeah.that's, a baddest from the last episode. - [Austin] That is a, I think it's a colorful GTX, 680. The thing that made this unique was, it had the dual eight pens, which is a bizarre choice, but this is a completely passively cooled graphics card. So essentially, that back little like add on do Hickey fast, that's essentially if you want it to overclock it. So, I don't even think that was, I think it was an optional card, but essentially, it would fill up like three or four slots in your car on your case. But the advantage would be that with this particular graphics card, you didn't need fans or anything. You could put it as long as you had decent airflow in your case, it would work. So yeah, I'm going to say that's the colorful GTX 680, Oh God. When was 680... 680 is probably like 2012 I think. - Awesome. I'm not even going to keep you in suspense. You are 100% correct. This is the colorful I gained GTX 660 - 680. - 680 - Still can't read the card. You can't make fun of me.Nope - That. - That was my stutter. That wasn't even me misreading. That was me. Stuttering the word 6. Thank you. Thank you for making some fun of someone with a speech impediment. Cool. I don't even want, I want you want to do this anymore. Let's move on - Are just salty. Cause I did. Okay. - I am a little salty cause I definitely tell you to do way worse than you did. - I should do kind of pay attention. - Cue it up, Ken. - [Austin] Oh, that Q face 9,000. All right, This is a Samsung. It's running windows XP. This was something we showed to both Marquez as well as I believe Mr. Who's the boss. It's like the SPH 7,000, I believe, something along those lines. This was a later model, even though it's running windows XP. I think it was like Adam powered. It was like in the netbook era. So, I think it was actually much later than you would expect. Like I think it was like 2008 or 2009. I'm gonna say the Samsung S P H 7,000 from 2007 is my final answer. - Austin Evans. - Yeah. - We have gone on a journey over the past 6 months of doing these game shows. - It's been a great, great ride. - We've had highs. We've had lows. - Yap. - This is one of them. - Yep.Cause I got it wrong. - This is the Samsung S P H P 9,000 From 2007. - You are in fact this is winter. No one could take that away from you. However you don't walk away with anything, - anything, - but you do get the opportunity to tweet out. Subscribe to this is linked from your account. That is what you win. - Oh boy. That was the Sox. I was close on that man. I was really close. - I thought this one would have been ingrained. This is your Z flipped, great, great grandfather. - True. - And you completely disrespected him. - [Austin] So now the rule is I have to hand you each my phone. You get to tweet whatever you want. - [Interviewer] Yes. - Well, I said that you're this is Cause you know how the, you say that like you're this is winter and no one can take it. - [Austin] Yeah. - I just took it away from you. Thank you so much for watching this episode of this is if, If you want more content like this, just keep watching because we're going to keep making it. So like, subscribe, - not like this though. Not like this. - and we'll catch you in the next hour. - Not like this",
    "transcript_keywords": [
        "question number",
        "question",
        "Austin Evans",
        "Ken",
        "number",
        "phone",
        "Austin",
        "final answer",
        "episode",
        "Evans",
        "correct",
        "answer",
        "Yeah",
        "move",
        "show",
        "fact",
        "game",
        "Austin Evans soundboard",
        "final",
        "honor"
    ],
    "transcript_entity_values": [
        "zero",
        "Kline",
        "1989",
        "2013",
        "Samsung S P H",
        "15%",
        "Apple Newton",
        "three",
        "Willy",
        "one year",
        "6 X",
        "2",
        "windows XP",
        "5",
        "9,000",
        "the 50%",
        "7",
        "50%",
        "GTX 680",
        "One",
        "6",
        "Toshiba G 450",
        "CE",
        "IVL",
        "SPH",
        "3A",
        "East",
        "Spade",
        "Newton",
        "Marquez",
        "Duncan",
        "2000",
        "Tom",
        "John",
        "Google",
        "Zack",
        "2017",
        "the early 2000s",
        "Violet Everett Garden",
        "three 2003",
        "Austin",
        "Samsung",
        "2008",
        "2009",
        "Hickey",
        "1000",
        "the past 6 months",
        "Adam",
        "1992",
        "32nd",
        "Chinese",
        "Mark",
        "10",
        "Quinn Nelson",
        "Sarah",
        "Mobile",
        "The year",
        "8",
        "Canon",
        "1999",
        "1993",
        "100%",
        "Sox",
        "2003",
        "Evans",
        "Handicap",
        "4",
        "winter",
        "2019",
        "2018",
        "second",
        "GTX",
        "Kevin",
        "the end of 2017",
        "Austin Evans",
        "one",
        "four",
        "7,000",
        "5000",
        "today",
        "Johnny",
        "Nokia",
        "Siemens",
        "eight",
        "the next hour",
        "six",
        "at least 50%",
        "Austin",
        "17",
        "3",
        "two",
        "Dave",
        "Goodbye Ken -",
        "9",
        "Dogie",
        "early 90s",
        "S1",
        "680",
        "3000",
        "Ken",
        "600",
        "Joker",
        "2007",
        "seven",
        "Samsung S P H P 9,000"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "LOC",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "ORDINAL",
        "NORP",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "PERCENT",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PERCENT",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.015608456917107105,
        -0.018919574096798897,
        0.08342660218477249,
        -0.07923954725265503,
        -0.000774211366660893,
        0.003283543512225151,
        0.17838627099990845,
        -0.020375210791826248,
        -0.003941991366446018,
        0.0036796797066926956,
        -0.051363952457904816,
        -0.04245621711015701,
        0.03784027695655823,
        -0.030114810913801193,
        -0.006169753614813089,
        -0.06059728190302849,
        0.08348885923624039,
        -0.057948172092437744,
        -0.0551971010863781,
        0.03584390506148338,
        0.05639519542455673,
        0.056388530880212784,
        0.03896138444542885,
        -0.01796845905482769,
        -0.021949157118797302,
        0.04224265366792679,
        0.03287579491734505,
        -0.0003532736445777118,
        -0.03919258713722229,
        -0.002138004172593355,
        -0.019987301900982857,
        0.02631957083940506,
        -0.0028112223371863365,
        -0.010536495596170425,
        0.02420242503285408,
        -0.004636337980628014,
        -0.02273818477988243,
        -0.018512533977627754,
        -0.06670871376991272,
        -0.03768526762723923,
        -0.04626641422510147,
        -0.04846404492855072,
        0.016658490523695946,
        0.022197585552930832,
        0.0010737188858911395,
        -0.037967976182699203,
        0.02478991076350212,
        -0.0627252459526062,
        -0.02526116371154785,
        -0.01266223844140768,
        -0.1296832263469696,
        -0.053745757788419724,
        0.14875228703022003,
        -0.0035758137237280607,
        0.008508914150297642,
        0.09155900776386261,
        0.024511374533176422,
        0.07609783858060837,
        0.06654630601406097,
        0.03296063840389252,
        0.017847102135419846,
        -0.12187501043081284,
        0.007888060994446278,
        0.09223858267068863,
        -0.0063273110426962376,
        0.002386608626693487,
        -0.036808889359235764,
        0.035217657685279846,
        -0.021583059802651405,
        -0.06019829213619232,
        0.021801946684718132,
        0.014138833619654179,
        0.03831612691283226,
        0.012109874747693539,
        0.1195501759648323,
        0.052042990922927856,
        0.03226366266608238,
        -0.020828556269407272,
        0.0406033918261528,
        -0.00859102513641119,
        0.064644455909729,
        -0.10582596808671951,
        -0.037409428507089615,
        -0.05793873965740204,
        -0.01196860522031784,
        -0.00375440064817667,
        0.008165744133293629,
        -0.01807062327861786,
        0.004027831368148327,
        0.05119090527296066,
        -0.08903621137142181,
        0.02475791983306408,
        0.027567602694034576,
        -0.005479098297655582,
        0.10645508021116257,
        0.050179339945316315,
        -0.018110407516360283,
        -0.03543630242347717,
        -0.12640520930290222,
        0.062416691333055496,
        0.05606960132718086,
        0.0775524452328682,
        0.05224220082163811,
        0.00820325966924429,
        -0.0015292001189664006,
        0.007663387339562178,
        -0.06304461508989334,
        0.03761402517557144,
        0.0603262335062027,
        -0.029970085248351097,
        0.006482338532805443,
        -0.018152950331568718,
        0.014618844725191593,
        0.030947545543313026,
        0.03901819512248039,
        0.02927018515765667,
        0.02557770349085331,
        0.07877695560455322,
        0.016849108040332794,
        -0.03767344355583191,
        0.09124986827373505,
        0.011352687142789364,
        -0.00864163227379322,
        0.08192931860685349,
        0.08631188422441483,
        0.028034299612045288,
        -0.04761790484189987,
        1.0348495741532702e-33,
        0.034760817885398865,
        0.08166839927434921,
        0.034627221524715424,
        0.057235583662986755,
        -0.011066603474318981,
        -0.031395550817251205,
        -0.06810888648033142,
        0.01489243283867836,
        -0.05399315431714058,
        -0.012867625802755356,
        -0.01370603684335947,
        0.06717721372842789,
        0.015538288280367851,
        0.07293890416622162,
        -0.0065329913049936295,
        0.012811225838959217,
        -0.041291944682598114,
        -0.06758948415517807,
        -0.0048297313041985035,
        0.01440898422151804,
        0.06692507117986679,
        0.02378854900598526,
        0.037667255848646164,
        -0.03819618001580238,
        -0.016157733276486397,
        0.0035126188304275274,
        0.011514496989548206,
        -0.053400564938783646,
        0.08566358685493469,
        0.007497960701584816,
        -0.1997210681438446,
        -0.05493410304188728,
        -0.037308868020772934,
        -0.04446956142783165,
        0.04573486000299454,
        -0.04613472893834114,
        -0.0012308444129303098,
        -0.06671886891126633,
        -0.04415056109428406,
        0.0563662014901638,
        -0.010483910329639912,
        0.061617765575647354,
        -0.04010811820626259,
        0.011313000693917274,
        -0.10057924687862396,
        -0.040615711361169815,
        0.008603829890489578,
        -0.023786071687936783,
        0.03273948282003403,
        0.038176581263542175,
        -0.025368181988596916,
        -0.023345746099948883,
        0.05726536363363266,
        -0.1341095268726349,
        0.06937670707702637,
        -0.013890592381358147,
        0.025629745796322823,
        -0.023168358951807022,
        0.06484216451644897,
        0.05364026129245758,
        0.014645767398178577,
        0.011770413257181644,
        0.0750388354063034,
        0.03393406420946121,
        -0.0409693568944931,
        0.029910067096352577,
        -0.0011813788441941142,
        0.02976427786052227,
        0.02730759046971798,
        0.008208625949919224,
        -0.06818073987960815,
        0.049348294734954834,
        -0.013033466413617134,
        -0.06618645787239075,
        -0.01933191902935505,
        0.03812532126903534,
        -0.10563049465417862,
        -0.027568092569708824,
        0.02047981508076191,
        0.026617910712957382,
        0.054481908679008484,
        -0.08491334319114685,
        -0.09548602253198624,
        0.002625196473672986,
        -0.08536290377378464,
        -0.07375485450029373,
        -0.004822226706892252,
        -0.02271842397749424,
        0.03603658080101013,
        0.004843749105930328,
        -0.02465667575597763,
        0.019020145758986473,
        -0.02115669846534729,
        0.021552665159106255,
        -0.007114520762115717,
        -3.2952383344051636e-33,
        -0.004225057549774647,
        -0.042363736778497696,
        -0.07019106298685074,
        0.044400282204151154,
        -0.006236198823899031,
        -0.060317616909742355,
        0.03431466594338417,
        0.04015873745083809,
        0.08427292108535767,
        -0.058517828583717346,
        0.008956607431173325,
        0.045633696019649506,
        -0.07766887545585632,
        -0.08161216229200363,
        -0.04067732021212578,
        -0.08920023590326309,
        0.030843719840049744,
        -0.016202183440327644,
        -0.028594251722097397,
        0.019122373312711716,
        0.009065039455890656,
        -0.027361463755369186,
        -0.09059926867485046,
        -0.00953521579504013,
        -0.041203636676073074,
        0.05166209861636162,
        0.05292420834302902,
        0.045585643500089645,
        -0.0972704365849495,
        0.001035091350786388,
        -0.019960878416895866,
        -0.002363892737776041,
        -0.0105079784989357,
        0.07954037189483643,
        0.02099965699017048,
        0.09814576804637909,
        0.04127345606684685,
        -0.005900799296796322,
        -0.03684615343809128,
        -0.01038772240281105,
        0.07217875868082047,
        0.02053162269294262,
        -0.062005672603845596,
        -0.028945690020918846,
        -0.032364167273044586,
        0.045049332082271576,
        -0.005803209729492664,
        0.010229985229671001,
        -0.06432109326124191,
        0.05546189472079277,
        0.023355260491371155,
        -0.04645480960607529,
        -0.05296977609395981,
        -0.03322654962539673,
        -0.05674958974123001,
        -0.010866266675293446,
        -0.0175552386790514,
        0.10029561072587967,
        -0.005778545513749123,
        0.003473948920145631,
        0.017102736979722977,
        -0.05246703699231148,
        0.07269905507564545,
        -0.037919800728559494,
        -0.01789086125791073,
        0.015187890268862247,
        0.02240712381899357,
        -0.0064029996283352375,
        0.05742160603404045,
        -0.05139916017651558,
        -0.022058196365833282,
        -0.025061866268515587,
        -0.07851725816726685,
        -0.1256864219903946,
        0.035649076104164124,
        0.1536533534526825,
        0.013728429563343525,
        -0.06918064504861832,
        -0.04697488620877266,
        -0.08248337358236313,
        0.00968005321919918,
        -0.0008253424894064665,
        -0.04226363077759743,
        0.03360842540860176,
        0.053593870252370834,
        0.10487527400255203,
        0.018107961863279343,
        0.06221236288547516,
        0.015803776681423187,
        -0.01038951613008976,
        0.020512785762548447,
        0.024614838883280754,
        0.0036510282661765814,
        -0.02277441695332527,
        -0.055433835834264755,
        -6.280437503392022e-08,
        -0.1117141842842102,
        0.009866422042250633,
        -0.07643666863441467,
        -0.05062184855341911,
        0.051148027181625366,
        0.062420107424259186,
        -0.028624199330806732,
        -0.007096540182828903,
        0.002734498120844364,
        -0.03164683282375336,
        0.06380344927310944,
        -0.0005995443789288402,
        -0.03616717830300331,
        -0.02472730539739132,
        0.092166468501091,
        0.08606064319610596,
        -0.07252927869558334,
        0.01959141716361046,
        -0.07164634019136429,
        -0.03555385768413544,
        0.002375163836404681,
        0.04656968638300896,
        -0.015430446714162827,
        0.05227771773934364,
        -0.0406029187142849,
        -0.007411851081997156,
        -0.007248970679938793,
        0.046604786068201065,
        -0.0013869768008589745,
        -0.022515542805194855,
        0.01867704465985298,
        -0.047696564346551895,
        -0.09275691211223602,
        -0.03300520405173302,
        0.05458967387676239,
        -0.0775967389345169,
        0.03025931864976883,
        0.05699248984456062,
        0.08343780785799026,
        0.04243169724941254,
        -0.11215387284755707,
        -0.03703037649393082,
        -0.026493728160858154,
        0.02427913248538971,
        -0.07066971808671951,
        -0.0052733286283910275,
        -0.032491978257894516,
        -0.026351379230618477,
        -0.05133539065718651,
        -0.06645236164331436,
        -0.03122079372406006,
        -0.044589221477508545,
        -0.05060523748397827,
        0.00694222142919898,
        0.05630876496434212,
        -0.010040594264864922,
        0.017204266041517258,
        0.0004241790156811476,
        -0.0927657037973404,
        0.005872798152267933,
        0.047090910375118256,
        0.021887611597776413,
        -0.037158187478780746,
        0.012832017615437508
    ]
}