{
    "id": "ANb_LRt0Ylg",
    "title": "I've been on YouTube for 16 YEARS!!!!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-02-17T16:56:15Z",
    "video_url": "https://www.youtube.com/watch?v=ANb_LRt0Ylg",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 108765,
    "likes": 7575,
    "comments_count": 1182,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- So question, who's ready for a flashback to 12 years ago? Everybody's got a question on their mind on their minds On their mind So now it's time, so now it's time To ask Justine anything Hey, hey, you can ask IJ Hey, hey, you can ask IJ So I recently have been kind of reflecting on my YouTube career, and it's safe to say that I think that I'm officially old. Like I cannot even believe the fact that my YouTube channel that I started in 2006, there are people watching my channel right now that were not even born when I started my channel, like that to me is absolutely mind blowing. And why it's so shocking to me is because my attention span is pretty much nonexistent. So the fact that something can hold my attention for that long, still to this day I absolutely love it and have been really enjoying seeing this entire space just evolve like right before my eyes. And it it's evolved over the past, oh my goodness, what is that? What is the math on that like, 16 years? How many years has it been since May of 2006? Oh yes, 16. Like some of you who are starting to drive right now, like I was starting a YouTube channel. And about 12, 13 years ago, I started this show called Ask IJ, and it was kind of like the beginning of ask me question videos. So I thought today in honor of that I would answer some of your questions. I've already screenshotted some that I asked you guys on Twitter. If you wanna follow me on Twitter, @IJustine. Oh my God. This is so weird. I feel like I'm just kind of time traveling back to the first episode of Ask IJ. Watching this old video of the first episode of ask IJ is honestly kind of shocking, because I'm just picturing the studio apartment that I had. My studio that I'm shooting this video in right now is larger than that entire apartment combined, my bedroom, my kitchen my bathroom, like it was a very, very small apartment. So it's so strange kind of sitting here many years later to really kind of reflect on how grateful I am to really be able to be doing this for so long. And I don't really think about it that often, to kind of think of like where I started and where I am now. And that's a very long time to be doing something. So if any of you are currently working on a project or you wanna do something in the future, like sometimes things take a very long time. There's ups, there's downs. And my journey to here, there has been so many ups and downs, things that I've never shared publicly on the internet. And it's just kind of interesting, because I've sort of crafted this entire strange career from the very beginning, and who knows where I'll be in 10 years, which somebody actually asked me one of those questions. But without further ado I wanna hop into some of these questions. Okay, Zach wants to know, will you include the original theme song? Of course, didn't you just hear it? Geoff Smith, thank you so much for that original piece of art. It is such an iconic song. Emily is asking what the favorite thing is about my job. And actually it's ironic that she would ask this because I got a chance to meet Emily back at vlog university. She has been following my channel for the past couple of years. It is so awesome to really get a chance to meet you guys. Like the people that see my content, you watch my videos, you watch whatever it is that you're watching of mine, following me on Instagram, following me on Twitter, whatever it is. And then I actually get to meet you guys in person. And that was honestly like the coolest part about my job, is seeing you guys in person, seeing the impact that I've had on some of your lives. And like that is so incredibly meaningful, because I never really had I guess a role model when I was growing up of someone who was doing something that I wanted to do. There weren't many women in tech. There really wasn't many women at all that I knew doing the types of things that I liked, like playing video games, editing, coding, and now with the internet, like you can find people who are doing things that you like and you can follow them and you can talk to them and you can reach out. So the fact that like I can be that for some of you out there is so freaking awesome, and it honestly means the world to me. So thank you again for watching, and however you guys found my channel or found me, I appreciate you and you are all so awesome. And I'm so excited that I get to do this for a job. It is a very, very difficult job. I don't think a lot of people understand how difficult it is, but it is something that I genuinely really do enjoy. And I am so excited for the next question, which is from Mike Krisza! Hello, Mike. Oh my God. It's so good to hear from you as well. How many external hard drives did you have to go through to find that original theme song? Thankfully, Gmail, I had it in my email. I just did a quick little, and there it was. This is so awesome seeing so many of you guys from back in the day, Greg who said, well, I think I was a part of that first ask IJ. So I gotta keep it going. What are some of the similarities that you're seeing between the rise of social media boom in 2006 and the rise of NFT market now? I would say the NFT market is so much more volatile than social media back then, just because there is money at stake, there are so many more scammers and there's so many more people on the internet that have access to these types of things that you have to be super, super careful. But the thing that I am excited about in the NFT, in the crypto, in the blockchain in the web3 space is what the future of that is going to look like. Like right now there are environmental impacts but what I am most excited about is the future of what this space looks like with web3 with the blockchain tech, with NFT technology. Now I know it's such a huge controversy but I promise you, as someone who has been criticized in the past for being made fun of, for playing video games I used to go to land parties. Some of my friends in high school back in the nineties were competing in gaming tournaments and we were getting made fun of they're like video games. You're never gonna actually be able to professionally play that and make it a career. Hmm, that's weird. Because then I was hosting Call of Duty tournaments where the prize pool was a million dollars. So went from getting made fun of for playing video games to hosting million dollar tournaments. Oh, let me remember. The times that I had people tell me that their friends were making fun of me for making YouTube videos back in 2006. And it's very interesting because some of those people who I remember were making fun of me were asking for collabs many years later. Interesting. So with people making fun of me for my interest in web3, NFT, blockchain tech, I get it. I understand where you're coming from because it is something that is completely new. There are a ton of things that are wrong with it but that is how things start. There are environmental impacts, especially with Ethereum and how much processing power it takes to actually mine Ethereum, a lot of this tech that is so early right now it will be used in future iterations of what web3 will become and what you currently see it. Now, I know I know the click save JPEGs, the screenshot, whatever with a lot of these future iterations of Ethereum, like Ethereum 2.0 and even Solana these will all be consuming way less energy. So a lot of those environmental impacts of things that we have currently those will hopefully all be taken care of. I know a lot of people have a lot of strong opinions about it. They either love it or they hate it. I feel like there's no, no kind of middle ground. And the interesting thing is a lot of the information that people are saying is it's a lot of not true things. Would you guys like to see me kind of explain my thought process in sort of this web3 space in the crypto, in the NFT world and I'm not going to be giving you any financial advice like I'm not and go out and buy these. I'm not telling you to start investing in crypto. I just want to kind of dispel, I think some of the myths and some of the misconceptions, because I think that's one of the things that's kind of upsetting is a lot of people don't have all of the information. And when you go to sort of look up this information it's really hard to find because everything is so polarizing. And I would say that if this is something that you are interested in you have to do your research. You need to find trusted people because there are a lot of scams. There are scams everywhere. I mean, if you look in my YouTube comments it's basically a ton of bots, just spamming and scamming and that is nothing new, but it is very, very prevalent in the NFT space and is very easy to get scammed. I unfortunately was scammed and I'm actually glad that I was because I learned from that experience but I am super excited about some of these new platforms and some of the blockchain tech that is coming out that is environmentally friendly. There are so many ways that this could actually be achieved. I am just very excited to kind of see where it all goes. So I know that was kind of like a long-winded answer but I honestly do truly believe that there is something here is the current form that it's in. Now It? no, is it flawed? Yes. That goes with basically the entire beginning of social media. That's the fun part. And what I think is so cool about web3 is the community aspect of like we all kind of have the ability to help make these changes. And I'm just really excited to kind of see the next generation kind of take this to a whole nother level. It's like, you guys are the next generation. So it's like what are you guys going to create that isn't created now? Like when people say, Hey, I wanna be a YouTuber. Yeah. Cool, great. Why don't you strive to do something that is not even here yet? And I feel like that has been something that I've done pretty much my entire life I've found really cool small platforms like Twitter, like Instagram and all of these things before there were tons of people on it. And that's why it's so excited to see people kind of creating new platforms every single day. That could potentially be the future. Anyway, that was, I don't even know. Did I answer your question? It's hard to say Nico is saying you made this intro 13 years ago. Oh my God. Look at that. Oh, wow. Oh my gosh. Rob is showing his you can ask IJ t-shirt can you even believe this? Wow. Also wanna know if this was gonna include the original theme song? Yep. You better believe it. I don't think ask IJ shirts are still available, but I mean if you guys really want me to revamp that incredible design I can do that. Connor's asking if I will ever, no That's not what he's asking at all, actually. Do you think we'll see apple launch their multi reality headset this year? And if so, what would you like to see it do? Wow. I guess I would like it just to be comfortable. I mean, I think that's one of the things that's really difficult for a lot of these headsets is they are heavy. They're kind of bulky and I get motion sickness very, very easily. So if there's some way to kind of limit the motion sickness aspect, like I'm all for it. I think obviously having it be cordless is a huge plus long battery life and comfort. We need to have it be comfortable. And I feel like once apple does this, they're gonna do it. Right. My dream podcast guest for same brain. I mean, I guess it would be Tim cook but like I already talked to him, but if he, like if he wants to come back on and chat, like anytime like for an extended period of time, Tim you know where to find us, how's my Tesla model S plaid is it better than the Mercedes that I had? So they're like very two very separate cars. I absolutely love the model S plaid. I actually was thinking of selling my Mercedes but it is completely paid off. And I love that car so much. And I feel like the only way that I will get rid of that is if I am upgrading to, I don't know like a truck or something like that, because I feel like I do a lot of lugging of gear, a lot of stuff. And so having that larger vehicle, especially one that is paid off, I'm not worried about that car for me has already kind of had its little dents and niks. So like, I don't mind taking that off roading and going places and not worrying about like, oh my God my Tesla model S plaid. Like I can't take that off road, but Mercedes SUV. Yep. I can take that anywhere. Fastest Rubik's cube solving time, Dennis you're asking a lot of hit questions. It's under three minutes, maybe like two 40 something. Do I still play animal crossing? Yes I do. I haven't been playing as much but I still play like a couple of times a week for sure. Krishna is talking about a Q and A that I did from LAx. If you remember some 12 or 13 years ago, my flight was delayed. I actually do remember that we were discussing food choices in various terminals. That sounds about accurate Ravi. What was your vision for the channel at this particular point? And that is a picture of me and my Teenage Mutant Ninja Turtles costume running around my yard 15 years ago. That's cool. Love that. You love to see that you love to see it. Nicholas says you've accomplished so much since the start of your YouTube channel. Where do you see yourself? 12 years from now? Oh my God. I don't know. My God. I don't know. That's such a long time. That's such a long time. Favorite Apple product. I mean, it's gotta be my phone, like my iPhone. Like I can literally do everything from this, everything. Favorite games to play for the past year. Oh man. I haven't like really done any crazy play throughs except for halo. I played that so much over the Christmas break and basically me and my sister were in opposite rooms across from each other in the hall at our childhood home playing Halo. And it felt just like the good old days. Oh, so great. Yamialex224 says I'm 30. And I've been watching you since the peanut butter and jelly in the Blender and apple. Why you no, send me phone. That's a long, I remember ordering. They were like the iPhone 4 maybe and ups sent it in an empty box. There was no phone in said box. Do I think I'll write another book in the future? I think I will maybe a children's book. Will I ever go to another concert again? I would like to there's actually a Justin Bieber concert coming up at the end of the month that I was thinking that maybe that might be something that I would be into my favorite dog breed is it's my dog, whatever whatever he is. DJ mini, Matt, Matt, my baby boy. He's a Bichon, Poodle, Lhasa, Apso, Chihuahua little mixed mut and he is freaking perfect. And I think that was actually the last question that I have. Oh, it is. Wow. Well, thank you guys for watching this little ask IJ episode. I can't believe I've been doing this for probably half of some of your lives. It's kind of shocking. Let me know when the comments below if you have any other questions I would love to chat with you guys here. After this video is even posted, you know like in the comment section, just like the good old days. If you guys haven't subscribed, please hit subscribe. Be sure to hit the bell. So you will be notified when I post new videos or maybe even some YouTube shorts. If you guys are into that sort of thing I'll see you guys later. Bye. (upbeat music)",
    "transcript_keywords": [
        "kind",
        "guys",
        "people",
        "lot",
        "things",
        "years",
        "NFT",
        "time",
        "years ago",
        "God",
        "channel",
        "video",
        "long",
        "excited",
        "long time",
        "love",
        "question",
        "fun",
        "future",
        "back"
    ],
    "transcript_entity_values": [
        "Ethereum",
        "every single day",
        "Connor",
        "Mercedes",
        "Krishna",
        "mini",
        "one",
        "Halo",
        "May of 2006",
        "Nicholas",
        "Apple",
        "Justine",
        "Call of Duty",
        "12 years from now",
        "30",
        "Tim",
        "Instagram",
        "vlog university",
        "16",
        "NFT",
        "Solana",
        "Tesla",
        "10 years",
        "the past couple of years",
        "the day",
        "16 years",
        "2006",
        "a ton",
        "Ravi",
        "Justin Bieber",
        "Twitter",
        "YouTube",
        "Mike",
        "Greg",
        "about 12",
        "some 12 or 13 years ago",
        "Rob",
        "blockchain tech",
        "half",
        "Emily",
        "Fastest Rubik's",
        "many years later",
        "Gmail",
        "a flashback to 12 years ago",
        "13 years ago",
        "the end of the month",
        "Blender",
        "today",
        "this year",
        "the past year",
        "two",
        "Nico",
        "the nineties",
        "million dollar",
        "YouTube",
        "Dennis",
        "under three minutes",
        "IJ",
        "this day",
        "Bichon",
        "Poodle",
        "Ethereum",
        "Lhasa",
        "first",
        "Mike Krisza",
        "15 years ago",
        "Christmas",
        "Matt",
        "Apso",
        "Geoff Smith",
        "a million dollars",
        "Ethereum 2.0",
        "Zach"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "EVENT",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "MONEY",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG",
        "DATE",
        "GPE",
        "GPE",
        "GPE",
        "GPE",
        "ORDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "PERSON",
        "GPE",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON"
    ],
    "vector": [
        -0.038777533918619156,
        -0.09579820185899734,
        -0.04185188561677933,
        -0.14438682794570923,
        0.055059850215911865,
        0.027387820184230804,
        0.030913082882761955,
        0.01048478577286005,
        -0.007860939018428326,
        0.04537848383188248,
        0.008065939880907536,
        0.004602920264005661,
        -0.030536755919456482,
        0.0361492782831192,
        -0.03108714148402214,
        0.04969406872987747,
        -0.00660542119294405,
        -0.020088165998458862,
        -0.04339016228914261,
        0.00017261352331843227,
        -0.022245382890105247,
        -0.05262919142842293,
        0.05267857760190964,
        -0.011148964986205101,
        -0.03146156668663025,
        0.07450524717569351,
        -0.03033694066107273,
        0.05360046774148941,
        -0.055219028145074844,
        -0.10571568459272385,
        -0.029174325987696648,
        0.005435599945485592,
        0.10811706632375717,
        0.008806959725916386,
        0.006701952312141657,
        -0.0606025792658329,
        0.012174714356660843,
        0.0010881047928705812,
        -0.05086778476834297,
        -0.0011284499196335673,
        0.01981041580438614,
        -0.04238571971654892,
        0.022538457065820694,
        -0.04074927046895027,
        -0.06847336143255234,
        -0.0710265189409256,
        0.004527484066784382,
        -0.08835257589817047,
        0.08939487487077713,
        0.06350453943014145,
        -0.11014942079782486,
        -0.014192460104823112,
        0.012663617730140686,
        0.007020155433565378,
        -0.0930904746055603,
        0.009843789041042328,
        -0.05612875521183014,
        0.005336184985935688,
        0.062437769025564194,
        -0.059647366404533386,
        0.039314188063144684,
        -0.056418079882860184,
        -0.007761230226606131,
        0.062813401222229,
        -0.05567605793476105,
        -0.060617364943027496,
        0.05392586439847946,
        0.017805226147174835,
        -0.03169141337275505,
        0.020130014047026634,
        -0.13566231727600098,
        0.07833615690469742,
        -0.06789281219244003,
        0.042606666684150696,
        -0.020991599187254906,
        0.043335143476724625,
        0.02064015530049801,
        -0.04438714683055878,
        -0.02582405135035515,
        0.06499763578176498,
        0.039997443556785583,
        -0.0762406662106514,
        -0.04978859797120094,
        -0.01892588660120964,
        0.007254390977323055,
        0.045951131731271744,
        0.03815016895532608,
        -0.011497199535369873,
        -0.04069807752966881,
        -0.06493575870990753,
        -0.1248260959982872,
        0.017983578145503998,
        0.008882461115717888,
        0.00669971015304327,
        -0.023082854226231575,
        -0.03628518432378769,
        -0.011090531945228577,
        -0.0846555307507515,
        -0.03202676400542259,
        0.09679115563631058,
        0.033162638545036316,
        -0.08120501041412354,
        0.02375895529985428,
        -0.05901160463690758,
        -0.014713930897414684,
        -0.09383969753980637,
        -0.059533752501010895,
        0.06484981626272202,
        0.02457989938557148,
        0.02079085446894169,
        -0.01790078729391098,
        0.05341006815433502,
        -0.04961010068655014,
        -0.042329199612140656,
        0.03033222071826458,
        0.06740754097700119,
        -0.041878920048475266,
        0.07204219698905945,
        0.012979940511286259,
        0.02696753479540348,
        0.04241294041275978,
        -0.06753181666135788,
        0.009102572686970234,
        0.024981874972581863,
        0.009608455933630466,
        -0.012170623987913132,
        -0.05099101737141609,
        1.0734642329699962e-32,
        0.02203456312417984,
        0.03415289521217346,
        0.01291581429541111,
        0.08907956629991531,
        0.007365431170910597,
        -0.0067532798275351524,
        -0.02744545415043831,
        0.13093462586402893,
        -0.08131001144647598,
        0.00455419672653079,
        0.014963842928409576,
        0.002028851769864559,
        -0.047541022300720215,
        0.050485365092754364,
        0.04422155022621155,
        -0.007173175457865,
        0.0019246852025389671,
        -0.08064782619476318,
        -0.06958671659231186,
        -0.018480440601706505,
        0.013791373930871487,
        -0.0037581955548375845,
        0.03864426910877228,
        0.0738566517829895,
        0.06649389863014221,
        0.06806287169456482,
        0.05103863775730133,
        0.0069589875638484955,
        0.042174406349658966,
        0.006182480603456497,
        -0.05169794708490372,
        -0.04800421744585037,
        -0.030231177806854248,
        -0.07930223643779755,
        -0.01146161463111639,
        0.02051561139523983,
        -0.07135215401649475,
        -0.009417581371963024,
        -0.02468959614634514,
        -0.012568563222885132,
        -0.0020080681424587965,
        -0.014562593773007393,
        -0.10347913950681686,
        -0.04647742584347725,
        0.06391502171754837,
        0.049549609422683716,
        0.07884246855974197,
        0.06328113377094269,
        -0.011331521905958652,
        0.02940453588962555,
        -0.03798217326402664,
        0.0009545342763885856,
        -0.04506772756576538,
        -0.015511155128479004,
        -0.013978643342852592,
        -0.03985314443707466,
        -0.0254040639847517,
        0.04849591106176376,
        0.052421845495700836,
        0.03174076974391937,
        0.02225114218890667,
        0.03453919664025307,
        -0.005021573510020971,
        -0.010253476910293102,
        -0.07017730921506882,
        0.09098891168832779,
        0.09314770996570587,
        -0.021807163953781128,
        0.06746375560760498,
        0.03131013363599777,
        -0.010369640775024891,
        -0.001541508361697197,
        0.04190821200609207,
        0.01823105849325657,
        0.02959601767361164,
        0.02203984372317791,
        -0.08854800462722778,
        -0.08716116845607758,
        0.038711488246917725,
        -0.0038106688298285007,
        -0.07637887448072433,
        0.05758117511868477,
        -0.005208886228501797,
        0.0686219111084938,
        0.001125296694226563,
        -0.08768846094608307,
        0.03079387918114662,
        -0.03709859773516655,
        -0.009014441631734371,
        0.0026959883980453014,
        -0.024789750576019287,
        0.06087444722652435,
        -0.057672739028930664,
        -0.05344477668404579,
        -0.0007929673884063959,
        -1.1103555803342182e-32,
        0.0053488886915147305,
        0.05716901645064354,
        -0.007017122581601143,
        -0.010124539025127888,
        0.08790593594312668,
        -0.026805514469742775,
        0.029929431155323982,
        0.05830037593841553,
        0.08845947682857513,
        -0.05237211659550667,
        0.030084513127803802,
        -0.08858441561460495,
        -0.13553018867969513,
        -0.011390765197575092,
        -0.027229223400354385,
        -0.03025454469025135,
        -0.037610702216625214,
        -0.07763538509607315,
        0.007903987541794777,
        -0.05826006457209587,
        0.025072775781154633,
        0.1220342293381691,
        0.09502501040697098,
        0.03923618048429489,
        0.01949506439268589,
        -0.009980203583836555,
        0.046718619763851166,
        0.04791887849569321,
        0.0743674635887146,
        0.052954282611608505,
        -0.007883555255830288,
        -0.036577533930540085,
        -0.07319708913564682,
        0.006827726028859615,
        0.02990569919347763,
        0.03994179889559746,
        0.041597630828619,
        0.05783713608980179,
        0.005233454052358866,
        -0.06780673563480377,
        0.03227439150214195,
        0.022304140031337738,
        0.004456334747374058,
        -0.04790017008781433,
        -0.020329663529992104,
        -0.10221537202596664,
        -0.05795585364103317,
        0.014678319916129112,
        -0.023981735110282898,
        -0.0053997342474758625,
        -0.04392561316490173,
        -0.02895018272101879,
        -0.0038275630213320255,
        -0.03622305765748024,
        -0.003975608851760626,
        -0.030183274298906326,
        -0.07406705617904663,
        0.005461394786834717,
        0.0690712183713913,
        0.01122455857694149,
        0.045746877789497375,
        -0.07597139477729797,
        -0.09039871394634247,
        -0.061314474791288376,
        0.019216442480683327,
        -0.0642152652144432,
        0.09603536874055862,
        0.031618934124708176,
        -0.02368156425654888,
        0.01523550320416689,
        0.006646950729191303,
        0.028464626520872116,
        0.04035412147641182,
        0.018823090940713882,
        0.0730036199092865,
        -0.01708732172846794,
        -0.043383341282606125,
        0.007090723607689142,
        0.06330294162034988,
        -0.03567826747894287,
        -0.02599772997200489,
        0.0023292815312743187,
        0.008811616338789463,
        0.06309500336647034,
        0.08283931761980057,
        0.10342701524496078,
        0.10753621906042099,
        0.02343088947236538,
        0.0013091749278828502,
        0.06562808901071548,
        0.03836871683597565,
        0.07273182272911072,
        0.05113762617111206,
        0.12307184189558029,
        -0.04478613659739494,
        -5.7445141976586456e-08,
        0.041981421411037445,
        0.04187260568141937,
        -0.03273959830403328,
        0.03414551913738251,
        0.022221781313419342,
        -0.0636056587100029,
        -0.010198560543358326,
        -0.001182562904432416,
        0.059842586517333984,
        -0.1055774912238121,
        0.08163503557443619,
        0.01403695996850729,
        0.009116433560848236,
        0.13090327382087708,
        0.02660459838807583,
        0.00036738405469805,
        -0.10131093859672546,
        0.09887558221817017,
        -0.028898362070322037,
        -0.05016123130917549,
        -0.0690566897392273,
        0.058200690895318985,
        0.041800979524850845,
        -0.02995074726641178,
        0.018517155200242996,
        -0.024030981585383415,
        0.019495364278554916,
        -0.011206328868865967,
        0.007098584435880184,
        0.001748928101733327,
        -0.07456705719232559,
        0.009148644283413887,
        -0.02547217160463333,
        -0.042174044996500015,
        -0.06994606554508209,
        -0.06664533913135529,
        -0.04037029668688774,
        -0.02246675081551075,
        0.021031156182289124,
        -0.0043189977295696735,
        0.017165588214993477,
        -0.123256154358387,
        0.0025111918803304434,
        0.014132988639175892,
        -0.012967049144208431,
        -0.01877710595726967,
        0.0422973558306694,
        -0.054706428200006485,
        -0.0010495823808014393,
        -0.07245191186666489,
        -0.06845428049564362,
        0.03858528658747673,
        0.04810897260904312,
        -0.042050447314977646,
        0.08704306930303574,
        -0.005904562771320343,
        0.058950383216142654,
        0.06259847432374954,
        -0.0345599390566349,
        -0.034086935222148895,
        0.049410056322813034,
        0.024659663438796997,
        -0.03481736406683922,
        0.011440369300544262
    ]
}