{
    "id": "AOdp09SYhCc",
    "title": "This Is So Embarrassing! - Building a PC with My Sister",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-09-14T17:01:51Z",
    "video_url": "https://www.youtube.com/watch?v=AOdp09SYhCc",
    "category": "Science & Technology",
    "tags": [
        "Fractal Pop Air",
        "12400",
        "Linus Sister",
        "Linus Family",
        "Linus History",
        "Embarrassing Stories",
        "Build Vlog",
        "LTT",
        "LMG",
        "RTX 3060 Ti"
    ],
    "views": 5345085,
    "likes": 210466,
    "comments_count": 12142,
    "description": "Check out Corsair's new K70 Pro Mini Wireless Keyboard at   Save 10% and Free Worldwide Shipping at Ridge Wallet by using offer code LINUS at   Linus' sister is playing The Sims 4 on an old Macbook. He'd like to change that and see if she can be converted to the glorious ways of the mighty PC, but it comes at the cost of some embarrassing childhood stories.  Discuss on the forum:   Buy an RTX 3060 Ti:   Buy an MSI Pro Z690 A WiFi:   Buy a Core i5 12400:   Buy a Crucial P5+ 1TB:   Buy a G.Skill Ripjaws V 2x8GB 3600MHz CL18:   Buy a Noctua NH U12S:   Buy Fractal Pop Air:   Buy a RM750X Gold:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:02 The Deal 2:05 Stories 4:30 Motherboard 5:25 CPU 7:22 More Stories 10:05 Linus the Troublemaker 12:34 GPU 14:00 Boot 14:55 Conclusion 17:33 Outro",
    "description_links": [
        "https://lmg.gg/K70ProMiniLTT",
        "https://www.ridge.com/LINUS",
        "https://linustechtips.com/topic/1455257-this-is-so-embarrassing/",
        "https://geni.us/AnUl0L",
        "https://geni.us/Cqmdts",
        "https://geni.us/7Mn6",
        "https://geni.us/VuMHnuG",
        "https://geni.us/200UOC",
        "https://geni.us/tWdjLS",
        "https://geni.us/cH9T9",
        "https://geni.us/Y9HOh",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- I have built PCs for myself, my wife, my kids, my colleagues, even an NBA star, but the one person I've never built a computer for, my little sister. I brought in my favorite little sister to answer two questions for us. One is growing up next to a tech nerd enough to just, absorb by osmosis, the skills that you need to build a PC from scratch? And number two, can we get you off that Xbox and Mac for your gaming, and on to a PC? (Bella laughs) - Sorry. - For the love of all that is good, Bella! - Maybe. - We're gonna try. Oh, and it's brought to you by our sponsor. - Ridge. Ridge wallet has redefined the traditional wallet with its compact frame and RFID blocking plates. The balls in your pants shouldn't be from your wallet. Use offer code Linus to save 10% and get free worldwide shipping today. (clicking sounds) (upbeat music playing) - Here's the catch. This computer is yours, but the deal is that once you experience it, you have to decide, do you keep it and trade me your Mac? Or do you keep your Mac? - My Mac is old. - Well, then it looks like this is going to be a low bar for me to clear. The Sims. - You should have asked me that first. (laughing) - The Sims are gonna run like you've never seen them before. - Okay. - Now, do you have any idea where to start here? - Open the boxes? - Wow. She's a natural. Which box? - That one. - Wow. That's a valid choice, sort of. (Bella laughs) - That's not. - Really? You're just gonna, just gonna grab things? You thought that was a knife. - I thought it that was a razor - I mean, sure. Okay, fine. You know what? No, we're gonna do this the Bella way. - [Brandon] It's called the RipJaw. - This is your case. - Cool. - This is the Fractal Design Pop Air, and it's not that we're stereotyping, I just legitimately did think you might appreciate a case with pink accents. - I love it. - Now I didn't get a chance to screen these first, but they included some questions for you. Do you feel you have an advantage or a disadvantage when it comes to building computers because you have me for a brother? - I don't think that it does anything for me much, except for today. I might get a computer out of it. - That's a fair response. For those of you who are wondering, this is not the sibling that I have raged about on the podcast who damaged the finish on my CRTM. I'm fairly certain it was a different one. - Who was that? What's a CRTM? - You don't know about this? - No. - My monitor? Don't you remember when (censored) and like - - Yes. - Yeah. - I do remember that. - Still hasn't apologized for that or admitted it, but I'm 100% sure. - Well no one admitted to killing my mouse, so. - Killing your mouse? - That mystery still remains unsolved. - Oh, in the book? - Yes, you do know. - I thought that was a hamster. - Was it you? - No, I thought that was a hamster. So yeah, her mouse got closed in a book. I mean, at least you weren't forced to eat it. - It was a crime that went unsolved. - You remember how they made me eat my pet goat, right? - Yeah, I'd eat it too. - [Brandon] What? - It's a different time. - It was a different time. - Okay. You wouldn't understand? - Yeah. - That looks familiar. - Sure. I'll get you another one of our questions while you open up your graphics card. - All right. This is graphics card. - Yeah. You probably remember Linus before he was actually any good at this stuff. Can you think of a time when he made the problem worse rather than better? - Yes, I have a specific memory in mind. You were doing something similar to this and you're trying to run water through tubes, you remember that? - I mean, I've run water through a lot of tubes over the years. - Anyway, the water did not stay in the tubes. - I do remember that. I lost a 7950 GT. I must have blocked that from my memory. Yes, I had a very - - So, sorry. You asked. - I had a very bad leak on the back of my 7950 GT SLI setup. - Yeah, that. You used to ask mom to hide your video games and you would freak out and want them back. - (laughter) I'd forgotten about this too. Why didn't you ask me these things? - You'd go through withdrawal, and then she wouldn't give them to you. You said swear to me you're not gonna give them back to me. (laughing) Okay. (Linus laughing) So this is what you call a hard disc. - This is actually the last step. - Oh. - So we're gonna put this aside. - We'll save this for later. - Yeah, we'll save this for later. - And all these guys. This is really cool. Actually, I do remember these and it made me think of like aerial view of a city. Now it goes into the computer. - It could, or it could go right here. - Oh, okay. - Yeah. - Now it goes here. - Yeah. - Corsair. I know that company. - Do you? - Air mattresses? Hair dryers? Right? - Are you, but do you, do you? - It's probably a different corsair. (laughing) - Okay. - Whoa, cool. Does it go right there? - Yeah. - No, it doesn't. - What do you mean, no? - Does it? - Yeah. - Oh, wow cool. Thought you're messing with me. - You'll need some screws. I would never in a hundred years mess with you. - Okay. - Okay, I'm gonna show you how to use a screwdriver. - He used to drop water balloons on me from the roof. It would flatten me to the ground. - It would not flatten you to the ground, but it was really funny. We had a three and a half story house, it was really high. - And rig the front porch with squirt guns, and with trip wires. (Linus laughing) It was actually pretty funny, but later, much later. - So this is your CPU. This is kind of like the brain of the computer, does all the processing. You're really man handling that CPU. - Oh, sorry, should not be touched. Is it not to be touched, like with your fingers? Oil fingers. - It would be best not to, oh my God. Yeah, we're just gonna put it there. Sure. We've gone with a 12400. It's got 6 P-cores, no efficiency cores, but for gaming purposes, this is more than enough. - Okay, that looks really good. - That looks really perfect, actually. Awesome. You just installed your first CPU. - (sighs) Feels good. - Now, do you want to go for the easy, but not as quiet and not as cool cooler? - No. - Let's do this one. - That's easy. Hey! - Yeah, this is the LTT edition NH-U12S. It was a collab product that we did with Noctua way back in the day. - Oh, cool. - We still have a few of them kicking around. - Award-winning. - It's an award-winning cooler. It's not an award-winning, like our logo being on it. - This is interesting looking. - Yeah. - This reminds me of like big server rooms in movies. - Yeah, so this is a cooler. This goes right on. - Cool. (laughs) - We both had the same dad. - Does this go metal touching? - Yeah. - I had an idea. - Not yet though. - Oh, just kidding. - So, first, first we need a mounting bracket. - First is a mounting bracket, which is probably this. - That is a mounting bracket. - But not the one we need. - Not the one we need. Sorry, this princess is in another castle. - Goes right there, right? - Yep. Now we gotta decide which way we want to put our cooler on. - Oh, okay. - So we're probably gonna blow air toward the back where the exhaust is. - That makes sense. - Which means we're gonna put it on this way. Which means we're gonna put these guys on a little something like this. Just like that. And then you're gonna use those thumb nuts to screw them on, into place. - I have been called worse. (laughing) - Was Linus always on the family PC when you guys were kids? - Often, not always. We grew up on a farm, so there were many things to be done outdoors. Linus was often found on the PC or chopping firewood. - Shoveling manure. - Shoveling manure. You know the glamorous jobs. While, I could be found, you know, beheading chickens, or breaking the ice in the pond to collect water. What year is this? - Are you really so allergic to using my screwdriver? Is this product so bad? - No, I like it. - You are actually putting in screws by hand. - It looks like it is supposed to be put in by hand. - Also, we need thermal compound first. - Oh, of course. - You're going to apply. - Oh, glue. - An uncooked pea sized amount right in the smack dab middle of that. Okay, that's a lot more pea. I mean, we both had trouble controlling our pee, so it's to be expected. - You know I was waiting for that. You took longer than I thought you would. Bed wetters, big time. - Yeah, big time. Both of us like into our, well into our teens. - Yeah. Build's character though. Oh yeah. - All right. - This is really secure. - Yeah, it's not going anywhere. - Now, it's like my city has a massive tower. - Yeah. That's actually called a tower cooler. - Oh. - This is all done. - Oh okay. - Yep. We'll need that pretty shortly, but not yet. - That? - Well, that we put in already. - That's nothing. Oh. Oh this? - Nope. - Oh, these things? - Sure. - Razers. Terabyte. What does this mean? - 1000 Megabytes. - Gigabytes? - Oh crap, yes. - Ooh, that's embarrassing. This is RAM. Does it go any certain way? - Yeah. - Okay. - You'll figure it out. So you, for the slots you want these two. - Oh, these little guys. - Yep. - Oh, I don't know what. Oh, yay. - Perfect. Okay, now this is the moment where you are second most likely to bung up your computer. Okay, see these little standoffs in here? - Yep. - Let's show, let's show all the - You did a great job of applying those stickers, but they made it a little heavy. They're a little front heavy now. So they, fell. - Right? - You see all these little standoffs? - Yes. - These are made of metal. - Yep, I can see that. - Now, let's imagine for a moment. - Get scratched. - A piece of metal scraping across the back of a motherboard. - I have hands like a surgeon. (moaning) - Good god. You're not a doctor though, right? - I'm glad I go to medical school. - Oh wow. That's actually, wait, did you get it? You got it! Ah, no! Ah, we have another question by the way. Which of you got into more trouble as a child? - As if. You. - What? - You thought I was gonna say me? - Shut up, I was a good kid. You were constantly in trouble. - No. - You never ate. You were always - - I don't remember that. - Always made the family late. You got lost at public events. - That's true. - Constantly. - Still happens. How many times were you in the principal's office? Admit. - Fairly frequently. - I was never in the principal's office. Never, not one time. I did not get into more trouble. I never got into trouble ever. - That is such horse (bleep). You were always in trouble. - Speaking of horse (bleep). - Okay, I did get in a fair bit of trouble for like pyromania related offenses. - Uh huh. How about the firecracker in the toilet? Who did that? - That wasn't a firecracker, that was hairspray. I just happened to get the mixture exactly right and it went off like a firecracker. - How about the bomb in the toilet? Sorry. What about all the shredded paper in the kitchen? - Well that, shredded paper burns really fast. Can confirm. Okay, we got another drive for you. One terabyte is only enough to hold like a handful of modern games. And I don't want you to have to think about like, oh, I'll delete that one, and then reinstall that one, cause I don't know if your Internet's super fast or anything. - It is not. - So we picked you up. Ow. - Whoopsie. - An additional 2000 megabytes here. I'm testing to see if she actually knows or if she just read it off the other one. It's 2000 gigabytes. - Oh no, I had no idea. - Yeah. - I was just reading it off the last one. - That's good. So we're gonna install this bad boy back here. - Okay. - All right, I've got another question for you though. - Okay. - Oh, okay. - Is it a good one? - I never really thought of this one because I didn't really consider your opinion at the time. - Rude. - But what did you think when Linus decided to make a full-time gig of making YouTube videos. - Oh, so proud of you. - Oh, okay. - I always tell everyone I know, you're the hardest worker I've ever met. You gonna cry? - Aw, thank you. - You are. You are. - No, I'm not, (indiscernible) works much harder. - Didn't take a vacation, sleepless nights, long hours. - It was pretty rough getting started. - But you had a dream, it's very inspiring. - Oh, thank you. - When you wanna do something, you should, even if it's hard, you have to stick with it. - Yeah. Did you think that at the time? - Yeah, oh, hell yeah. - It seems pretty stupid at the time. - I thought you were crazy. - Oh, okay. Yeah, there it is. (laughs) - But like, you know, I knew you'd do it. I had no doubt that you'd succeed. - This is a 3060 TI. Six months ago this would've been worth like $1,200, now it's worth less than half of that. Don't worry about it. - Oh. - There's been a big GPU market crash from like, you know, like cryptocurrency, right? - Yes. - Yeah. So cryptocurrency has crashed fast. - I invest in crypto. - Oh really, how'd that go? - I don't know. I don't listen to or pay attention to it. It's sort of a set it and forget it mentality with investing. - Okay, yeah. Dang! - Pretty not bad. - Not bad for a first try. So we're asking her what kind of keyboard do you want? - It's like a chess set. - Do you want 10 key lists? Do you want the full size? And like, obviously this guy is trying to sell her on like the more deluxe, the most deluxe keyboards. - No, no. - And Brandon's like, Plouffe's probably gonna try and sell her like a $300 keyboard. I'm like, no, this guy's moved on from $300 keyboards. This from Wuque studio is a $600 keyboard. Are you ready? - I'm just gonna hold it, you unwrap it? Whoa. (Linus laughs) It's really heavy. It's probably like what, like 10 pounds? - [Plouffe] 8.2. - What's it made out of? - [Plouffe] Aluminum. - Whoa, is this a real diamond? - [Plouffe] No, it's moissanite. - All right, you gonna press the power button? - Where is it? - Up here? - Oh. - You'll find it. Okay, that's a good sign. - Whoa. - Yeah, cool right? - It's really quiet. Nice airflow. - Mm hmm. We have a small problem. - Oh great. - You know what I realized I never actually checked that you plugged everything in right. Okay, do we have video drivers at least? - [Plouffe] I did install NVIDIA drivers. I didn't do windows update because it was a different motherboard but we have steam cache now, Linus. - So it's fast? - [Plouffe] So it should be fast if there's anything else you wanna download, if we've already downloaded it. - I have steam cash cause I returned my last game cause I couldn't play it. (laughter) - I'm glad you're rolling on that. That's really not what that means. It's cache, C-A-C-H-E. - Oh, like a memory. - Like a cache, yeah. (Bella laughs) (ripping noise) Masterfully done. Not bad! - It's beautiful. - I'm liking it. - Wow. - Okay. This is it. Maiden voyage. Oh, we don't have audio. - It's okay, I know how it sounds in my head. I've heard it so many times. - Oh my God. - I hear the music. Sweet music in my head. New cheeky items available. Yes! Don't make fun of me, it's really fun. - I'll pull my digital content. Seems a - - Cool, thanks. - Oh my god. Okay, four popups later. So go into options. - Okay. - Okay, game options. - Okay. - All right, it's already set to ultra. Perfect. - Ultra. - Okay, here we go. - Here's one. - Okay. So how long would that normally take? - Like a minute. - Oh, really? What, really? - Yeah. - Like on your machine? - Yeah. - Oh, so this is faster then. - Much faster. - Okay. What is he doing over there? - He's knocked over the garbage can. - Well why did he do that? Why is he putting garbage all over the yard? - Because he hates her. - What an (bleep) - He's angry. It tells you why. He is angry because he had to socialize and he's a loner. Oh, she's mad too. (laughs) She should stomp - - She should stomp. - On the garbage. Isn't this so silly, I love it. - You know what the worst part is? Is that it's really not that unrealistic. Can I just point out how smoothly it runs when you pan the camera? - Oh, heck yeah. - Oh yeah. - It's like a Tamagotchi kinda, but more complicated, but not actually that complicated at all. - Okay. So does it run well enough for you? - Runs very well. She's gonna try to calm him down, and see if that works. - Why don't we try something a little more intense? - Okay. - Okay. - She runs kind of funny. She really - - Well she's pretty injured. - Whoa. Oh my gosh, it's chasing me. - I think we're headed into danger, not away from it. - Seriously? Okay, go uphill. Into the woods. - Yeah, I think it's bear rules. - Oh God, what does that mean? Oh, run downhill. - I'm just making things up at this point. - Why am I red? - Anyway, how's it look? - Looks really good. - Running smooth enough for you? - Yeah, I love it. It's really cool. - And is there any other questions I'm supposed to ask my sister for the people before we're done. - [Plouffe] I'm pretty sure we got them all. - Okay. - Nice. - So the one question I have for you then is, who's our sponsor? - Our sponsor is. - Corsair. Their new K70 Pro Mini keyboard is a 60% keyboard with easy to change MX compatible key switches. It has a durable aluminum frame with dynamic per key RGB back lighting and a 360 degree light edge strip. You can connect via USBC, Bluetooth, or the sub one millisecond latency Corsair slip stream dongle, and it has 32 hour battery life with RGB or up to 200 hours without. Plus, you can add to your IQ setup for a fully dynamic and immersive ecosystem. Learn more by following the link in the video description. (upbeat music playing) - If you guys enjoyed this video, you might also enjoy the series where I built PCs with my three year old children. Each of them at three years old, not that I have many, three year old children. - Hmm.",
    "transcript_keywords": [
        "Yeah",
        "NBA star",
        "Cool",
        "good",
        "time",
        "thought",
        "remember",
        "Linus",
        "back",
        "NBA",
        "put",
        "Mac",
        "made",
        "trouble",
        "pretty",
        "computer",
        "God",
        "bad",
        "sister",
        "run"
    ],
    "transcript_entity_values": [
        "up to 200 hours",
        "three years old",
        "NBA",
        "3060",
        "the years",
        "one",
        "Sims",
        "second",
        "four",
        "Ridge",
        "first",
        "Brandon",
        "300",
        "One",
        "GT",
        "a hundred years",
        "RGB",
        "the Fractal Design Pop Air",
        "three year old",
        "less than half",
        "12400",
        "Corsair",
        "10%",
        "7950",
        "three and a half",
        "What year",
        "RipJaw",
        "6",
        "GPU",
        "today",
        "NVIDIA",
        "Plouffe",
        "Mac",
        "Bluetooth",
        "Wuque",
        "10",
        "RAM",
        "Xbox",
        "100%",
        "Razers",
        "LTT",
        "Six months ago",
        "2000",
        "CPU",
        "One terabyte",
        "RFID",
        "SLI",
        "YouTube",
        "1,200",
        "number two",
        "60%",
        "600",
        "Linus",
        "the day",
        "MX",
        "32 hour",
        "two",
        "Bella",
        "K70 Pro Mini",
        "a 360 degree",
        "USBC",
        "10 pounds",
        "Noctua"
    ],
    "transcript_entity_types": [
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERCENT",
        "MONEY",
        "PERSON",
        "DATE",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG"
    ],
    "vector": [
        -0.023687854409217834,
        -0.0044415914453566074,
        0.011976173147559166,
        -0.07033640891313553,
        0.046306461095809937,
        0.04270297288894653,
        0.025343649089336395,
        0.03422106057405472,
        -0.08841227740049362,
        0.039351604878902435,
        0.02986636571586132,
        0.03956083580851555,
        0.006471436470746994,
        -0.06625768542289734,
        0.030864253640174866,
        0.031008122488856316,
        0.04495900496840477,
        -0.08011163771152496,
        -0.08756332099437714,
        0.022012075409293175,
        0.03515905141830444,
        -0.14264291524887085,
        -0.010774398222565651,
        -0.058544982224702835,
        0.043952543288469315,
        -0.021412719041109085,
        0.09778977185487747,
        -0.03508135303854942,
        0.012940010987222195,
        0.008123612962663174,
        -0.03495917469263077,
        0.058732397854328156,
        -0.0029265687335282564,
        -0.03240974619984627,
        0.04815144091844559,
        -0.06495663523674011,
        0.10498171299695969,
        -0.07409488409757614,
        -0.03235374018549919,
        -0.14382801949977875,
        -0.0434495210647583,
        0.005509674083441496,
        0.009132632054388523,
        0.08487406373023987,
        0.036751892417669296,
        -0.005858329590409994,
        0.05624694004654884,
        -0.029259592294692993,
        0.028714215382933617,
        -0.05097194388508797,
        -0.02530905231833458,
        -0.06176203861832619,
        -0.003408954944461584,
        -0.04478752240538597,
        -0.09272219985723495,
        0.02899307943880558,
        -0.05741170421242714,
        -0.07465528696775436,
        0.08447717875242233,
        -0.00529504707083106,
        0.01424951758235693,
        -0.10084091871976852,
        0.012494539842009544,
        0.08370304107666016,
        -0.04088037461042404,
        -0.026219595223665237,
        0.031240060925483704,
        -0.0027313558384776115,
        -0.017967917025089264,
        -0.002401787554845214,
        0.007773303426802158,
        -0.014938936568796635,
        0.028175143525004387,
        0.10671945661306381,
        -0.004736430011689663,
        0.04815232381224632,
        0.0300828218460083,
        -0.06000663340091705,
        0.06503317505121231,
        0.060824017971754074,
        -0.07023368775844574,
        0.04129382595419884,
        0.024038663133978844,
        -0.03301849216222763,
        0.03845452144742012,
        -0.011570870876312256,
        -0.016420861706137657,
        -0.015867743641138077,
        0.002100310055539012,
        -0.1457248032093048,
        0.008779688738286495,
        0.03095236048102379,
        0.10526148974895477,
        0.024191875010728836,
        -0.008808926679193974,
        -0.007360944990068674,
        0.023340415209531784,
        -0.09869003295898438,
        -0.06405660510063171,
        0.06848733127117157,
        -0.006225578486919403,
        0.06323711574077606,
        0.09506119042634964,
        -0.011800537817180157,
        -0.04641290754079819,
        -0.01728571392595768,
        -0.015298087149858475,
        0.09318176656961441,
        -0.055449292063713074,
        -0.023266958072781563,
        -0.09892259538173676,
        0.020439472049474716,
        -0.04567214101552963,
        0.041281890124082565,
        0.05751623213291168,
        0.0019869166426360607,
        -0.014618217945098877,
        0.03663560748100281,
        0.05533875524997711,
        -1.7334157575987774e-07,
        -0.014097503386437893,
        -0.06759412586688995,
        -0.07669608294963837,
        0.013892938382923603,
        0.016410065814852715,
        -0.0036498329136520624,
        -0.06397601217031479,
        7.205167644110256e-33,
        -0.015982577577233315,
        0.13657636940479279,
        -0.05523628368973732,
        -0.014046425931155682,
        0.04809526726603508,
        -0.017818156629800797,
        0.0826849639415741,
        -0.056054167449474335,
        -0.014062576927244663,
        0.06307585537433624,
        -0.047720007598400116,
        -0.046663831919431686,
        -0.0936584398150444,
        0.032904140651226044,
        0.06575087457895279,
        -0.06008460000157356,
        -0.04709535464644432,
        0.048206232488155365,
        0.018092967569828033,
        0.06090511754155159,
        0.07254570722579956,
        0.03281275928020477,
        0.040876418352127075,
        -0.07258183509111404,
        0.015581678599119186,
        0.047238703817129135,
        0.00808450672775507,
        -0.05396442860364914,
        0.11727595329284668,
        0.02283945120871067,
        -0.06024980917572975,
        -0.07248100638389587,
        -0.039507005363702774,
        -0.12040162831544876,
        -0.007243141997605562,
        0.01834273152053356,
        -0.00600873539224267,
        -0.08901866525411606,
        0.027699889615178108,
        0.02709178999066353,
        -0.06650602072477341,
        -0.0008990982896648347,
        -0.05842885747551918,
        -0.08371729403734207,
        0.002172689652070403,
        0.0029840772040188313,
        0.04952342063188553,
        0.04064347594976425,
        0.01881815865635872,
        -0.03334899991750717,
        -0.06432241201400757,
        0.014532936736941338,
        -0.00391441211104393,
        0.00891165528446436,
        0.010597845539450645,
        -0.05206333473324776,
        0.09003185480833054,
        -0.008031141012907028,
        0.11524832993745804,
        0.06405051797628403,
        0.05127210170030594,
        -0.08099328726530075,
        -0.003043414792045951,
        0.03291024640202522,
        -0.030474314466118813,
        -0.016903521493077278,
        0.07934679836034775,
        -0.07264945656061172,
        -0.09895584732294083,
        0.027467666193842888,
        -0.024233631789684296,
        -0.020083097741007805,
        -0.01945643685758114,
        -0.02565157413482666,
        0.024425188079476357,
        0.0020240580197423697,
        -0.09706531465053558,
        -0.011386058293282986,
        -0.04665176570415497,
        -0.02369261533021927,
        0.0028363047167658806,
        0.059225864708423615,
        -0.025738641619682312,
        0.09613042324781418,
        0.03377917781472206,
        0.011989627033472061,
        -0.0071249352768063545,
        0.0004476604226510972,
        -0.040570035576820374,
        0.03749386966228485,
        0.04244716838002205,
        0.011578158475458622,
        -0.026584967970848083,
        0.00869035255163908,
        -0.07713569700717926,
        -6.774251986249945e-33,
        -0.07575168460607529,
        -0.050833553075790405,
        -0.00528285838663578,
        0.06348719447851181,
        -0.03945141285657883,
        0.014932906255126,
        0.04509082809090614,
        -0.021913127973675728,
        0.043954044580459595,
        -0.05373413860797882,
        0.06817061454057693,
        -0.03400775045156479,
        0.019554566591978073,
        -0.03517524525523186,
        0.02129855379462242,
        -0.035574886947870255,
        0.01241880189627409,
        -0.013774951919913292,
        0.07945238798856735,
        -0.06772364675998688,
        0.03209252282977104,
        0.004420499317348003,
        -0.020101651549339294,
        -0.016453146934509277,
        0.036552999168634415,
        0.009437154978513718,
        0.017809169366955757,
        0.054756633937358856,
        0.045421626418828964,
        0.03117607906460762,
        -0.02851899340748787,
        -0.008323920890688896,
        0.01125351432710886,
        -0.00043030851520597935,
        0.10504743456840515,
        -0.034054022282361984,
        0.04916117712855339,
        0.028382251039147377,
        -0.025103900581598282,
        -0.028048481792211533,
        0.10889338701963425,
        0.013871164992451668,
        -0.006281892769038677,
        -0.004813277628272772,
        0.032763972878456116,
        -0.07128281146287918,
        0.022620446979999542,
        -0.1269189566373825,
        0.08420493453741074,
        0.01809128001332283,
        0.06699802726507187,
        -0.045405272394418716,
        0.05742710828781128,
        -0.02352052927017212,
        -0.02133362367749214,
        -0.0723389983177185,
        -0.002051308751106262,
        -0.010778283700346947,
        0.03347386419773102,
        -0.06406037509441376,
        0.009191101416945457,
        -0.02671084739267826,
        0.033744607120752335,
        -0.03175491839647293,
        0.04680000990629196,
        -0.007214494980871677,
        -0.004157130606472492,
        0.0345592238008976,
        -0.059087466448545456,
        0.038672808557748795,
        -0.07037800550460815,
        -0.0072328075766563416,
        0.01015810202807188,
        -0.10430575907230377,
        0.01587076112627983,
        0.05756038799881935,
        -0.025614207610487938,
        -0.026542097330093384,
        -0.008654667064547539,
        -0.05595805495977402,
        -0.06142285466194153,
        0.04295375198125839,
        0.06805028021335602,
        -0.015344365499913692,
        0.015084199607372284,
        0.01725531741976738,
        0.061020392924547195,
        0.045202694833278656,
        -0.00017555298109073192,
        -0.05928674340248108,
        -0.04699886217713356,
        -0.012244646437466145,
        -0.00847946759313345,
        0.05257295072078705,
        -0.07505641877651215,
        -6.291480758591206e-08,
        -0.03804554417729378,
        0.057162754237651825,
        -0.009656115435063839,
        0.032560769468545914,
        0.002526307012885809,
        -0.03423123434185982,
        -0.02036132849752903,
        -0.09202849119901657,
        0.05385875701904297,
        -0.030853720381855965,
        0.06002594158053398,
        -0.06380826234817505,
        0.0009460060973651707,
        0.018843987956643105,
        0.040278878062963486,
        0.07966125011444092,
        -0.07854613661766052,
        0.0351843424141407,
        0.01481087040156126,
        -0.07517370581626892,
        0.01913454756140709,
        0.04875805601477623,
        0.07691849023103714,
        -0.006208328530192375,
        0.004900231957435608,
        0.039593812078237534,
        0.006225774064660072,
        0.07717105001211166,
        0.12787045538425446,
        -0.038499895483255386,
        -0.1057160496711731,
        -0.004571354016661644,
        0.05781618505716324,
        -0.011446263641119003,
        0.00019845980568788946,
        -0.08733594417572021,
        0.0038150723557919264,
        0.13247036933898926,
        0.06698694825172424,
        0.029568014666438103,
        -0.032946038991212845,
        -0.06327628344297409,
        -0.05602829530835152,
        -0.018610632047057152,
        0.01917167380452156,
        -0.0019747333135455847,
        -0.06490883231163025,
        -0.06466808170080185,
        0.00870478991419077,
        0.0517989881336689,
        -0.014597032219171524,
        0.026027705520391464,
        -0.020159270614385605,
        -0.007152284029871225,
        0.035242825746536255,
        -0.009136365726590157,
        -0.013356908224523067,
        0.0422549806535244,
        -0.026681814342737198,
        0.05872173234820366,
        -0.018965864554047585,
        -0.0610019750893116,
        -0.07158558815717697,
        0.0739118903875351
    ]
}