{
    "id": "AOlXmv9EiPo",
    "title": "Apple's Silicon Magic Is Over!",
    "channel": "Snazzy Labs",
    "channel_id": "UCO2x-p9gg9TLKneXlibGR7w",
    "subscriber_count": 1170000,
    "upload_date": "2024-04-20T18:40:19Z",
    "video_url": "https://www.youtube.com/watch?v=AOlXmv9EiPo",
    "category": "Science & Technology",
    "tags": [
        "snazzy labs",
        "quinn nelson",
        "snazzyq",
        "M1",
        "M2",
        "M3",
        "M4",
        "MacBook",
        "Apple silicon",
        "throttling",
        "Apple fail",
        "MacBook Air",
        "MacBook Pro",
        "Snapdragon",
        "Qualcomm",
        "tech review",
        "chip comparison",
        "CPU battle",
        "Apple redesign",
        "tech specs",
        "performance test",
        "Apple leak",
        "iMac",
        "iPad Pro",
        "TSMC",
        "transistor density",
        "chip overheating",
        "Apple upgrade",
        "tech analysis",
        "Apple risk",
        "NPU",
        "5nm process",
        "3nm chips",
        "Apple benchmark",
        "PC makers",
        "future of Apple",
        "silicon war",
        "energy efficiency",
        "computing power"
    ],
    "views": 1090520,
    "likes": 32990,
    "comments_count": 3693,
    "description": "Apple silicon and the M1 took the computing world by storm. But others are catching upand Apple is hitting the limits of physics. It's time to focus on what Apple does best: hardware.  Follow me on Threads -  Follow me on Instagram -   Video Summary (this is just for SEO lol): Discover how Apple's M1 revolutionized MacBook performance, transforming from problematic designs to industry-leading innovations. Dive deep into the M3, comparing its capabilities and drawbacks against the celebrated M1 and slightly improved M2. Explore how Apple silicon, such as the M1 and M3, fares against upcoming threats like Qualcomm's Snapdragon X Elite. Get insights on the future of MacBook, Apple silicon, and the potential shifts with M4 in the fiercely competitive tech landscape.  0:00 Things used to be HOT (in a bad way) 0:39 The M1 changed everything 1:40 ...but changes need to happen again! 2:12 Why has M1/M2/M3 been such a success? 3:28 Let's talk transistor density. 5:27 M2 is hotter than M1but it's complicated 6:38 Sand, man. Sand is the problem! 8:35 Stop being a nerd. Silicon ain't the problem. 9:18 Competition is coming. Like, now. 11:03 What is this \"competition?\" 12:00 Apple will still dominate high-end Arm, for now 13:29 The M3 Max is HOT and throttles HARD 14:54 Apple Silicon CAN enable BETTER hardware 15:56 Can't Innovate Anymore My @ss 17:02 It's time to be bold again",
    "description_links": [
        "https://threads.net/snazzyq",
        "http://instagram.com/snazzyq"
    ],
    "transcript": "It's hard to believe that just over 5-years-ago, I was ripping into the internals of brand-new Macs looking to hodge-podge a fix together, such that they wouldnt overheat and cause benchmark scores to plummet. High TDP Intel chips paired with inadequate cooling made for a deadly comboone that created the worst Macs in decadesbut then this happened: [insert M1 unveiling] Apple silicon was a revelation to what had been deemed an ill-suited form factor. Not only did they *keep* things thin and light, but they launched with the literal identical MacBook Air chassis just to proveHEYnot only is this 3.5x faster, but we dont even need a fan. Oh, and by the way, we didn't touch the battery size at all but it lasts 50% longer than before. Price increase? Nah. Send me a G and we coo. The redesign of the MacBook Pro and M2 MacBook Air righted the wrongs caused by the butterfly keyboard-sporting laptops of yore bringing back MagSafe and other I/O, improving displays, speakers, keyboards, and more. Meanwhile, the M1 iMac and iPad Pro proved that no form factor was too small for this master-class in efficiency. Its not a stretch to say that Apples current computer lineup is not just Apples best ever, but perhaps one of the best lineups ever from *any* company. But be warned, because changes need to happenand fastif Apple wants that to continue being true into the future. Let's tackle why the M3 series doesn't measure up to the almost physics-defying standards the M1 set at launch; and, how for the first time ever, real competition is just months away from almost every PC maker imaginable. Ive talked a lot about why Apple silicon has absolutely dominated since launch, but there were really three main drivers behind M1s incredible performance: (1) Arm64 itself uses significantly more modern (ISAs) instruction set architectures that dont carry the legacy baggage of x86nerdy crap like weakly-ordered memory models, a larger number of general-purpose registers for parallelizable code, etc., (2) Apples dedicated on-chip hardware blocks like the video engines, Neural Engine, matrix coprocessor, and unified memory pool, handle specific tasks vastly more capably than a general-compute CPU or GPU, and, (3) deep vertical control from hardware to kernel to OS to application helped eliminate cruft and streamline efficiency. All of the work had to be paved for M1. Sure, M2 and M3 benefit from that work, but theyve been iterativeand Apple is now somewhat limited in the same way everybody else is: transistor density. M1 launched on TSMCs 5nm process and unlike the 90s and 2000s when transistor density and node naming actually correlated with one another, process names today like 5nm dont really mean anything. Theres more to chips than logic gates and hardly any of those features precisely measure at the marketed process size anyways. Regardless, the M1not to even mention the M1 Maxwas a an enormous die that was not just the biggest TSMC 5nm chip to date, but one of the largest Arm chips ever produced period. So what do you do to get a faster chip like M2? Theres really three options: (1) shrink the size and power consumption of the transistors so you can add more of them in the same envelope, (2) keep the transistor size the same but increase the number of them which makes for a larger die with greater heat and power drain, or, (3) keep the transistor size and count the same but increase the voltage to push up the chips clock-speed which creates even more heat and power drain. M2 did a combination of options 1 and 2. They were able to move to TSMCs refined N5P process which netted both a 7% performance improvement over N5 while drawing about 15% lower power; and then to speed things up even more, they increased the total number of transistors from 16 billion to 20 billion. But this increase didnt come free. Do some shotty, not really the full story napkin math, and the data would suggest the M2 is more power-hungry than M1running hotter and drawing more energy as a total package over its predecessor. And thats not theoretical: we proved back when the M2 MacBook Air launched that the chip was more difficult to keep cool and experienced more rapid and more severe performance throttling due to those thermals. So why wasnt this more widely reported? Well, because M2s performance per watt increased as wellnot just total package consumption. Imagine a high-performance sports car. The car runs hotter and consumes more fuel when it reaches its top speeds, much like the M2; however, because it's so fast and efficient, it can complete a 'race' much quicker than a regular car, reducing the total time it is running at its hottest most fuel-consumptive state. So, while yes, the M2 consumed more total energy at its peak, that extra compute was able to get tasks done more quicklyreducing time spent at peak and therefore maintaining lower energy consumption per task relative to M1. Sounds like a win-winso whats the problem? Sand, man. When M3 launched on TSMCs N3E 3nm process, it was the first chip to do soand performance expectations from pundits were high. I mean, doing napkin math anew would suggest a 2.8x increase in transistor densityHUGE performance gains! But then M3 came out and we got a slightly better jump than we did from M1 to M2and those on the same process! Huh? Well, I guess we learned our lesson using napkins for calculations can be as messy as using a lipstick for math. First of all, TSMCs 3nm node uses transistors that are much physically larger than 3nmtheyre closer to 3.5. Okayyy, but even that would suggest a 2x density increase. Ah, but only the logic density comes close at 1.7x. SRAM and IO density barely increases at all. And chipseven magical onescontain all of these components. Realistically, theres only about a 1.3x shrink. The era of massive improvements from one process shrink to the next are over. The shrinks themselves are now YEARS apart. And even worse, each new node is orders of magnitude more expensive than the prior, per unit area. Its estimated that Apples cost on these N3E chips is greaternot lesserthan just using a bigger area on an older node. Alas, that would not yield the same efficiency gains weve come to expect from Apple. More transistors on a bigger chip means more heat. So what do? Weve spent several minutes getting really nerdy and into the weeds on a lot of stuff that normal people dont care aboutand at the end of the day, normal people buy the vast majority of Apples products. Sure, the jump from M2 to M3 wasnt as massive as expected and the jump from M3 to M4 will likely be even smaller, but might I suggest something heretical for a minute? Thats OK! The silicon isnt the problem in Apples lineup any longer. Look, Qualcomm invited me out to San Diego a few weeks ago and I got to check out their reference design laptops (which basically means theyre not realtheyre prototypes) for the Snapdragon X Elite SoC. You may recall, a year-and-a-half-ago, we bought Microsofts Arm-based Windows Dev Kit. It utilized the same Microsoft SQ3 chip (which was just a rebranded Snapdragon 8cx gen3) found in a few quirky low-power, low-performance Windows laptops. No offense to the folks at Qualcomm or Microsoft, but this thing sucked. Its performance under ideal conditions was mediocre and ideal conditions were hard to come by because so much of the Windows experience was wildly unoptimized for Armeven after a decade following the original release of Windows RT. But that was thenwe live in the now. Not only has every single native app for Windows made the transition to Arm, but massive quantities of 3rd party apps have tooincluding big oneslike Google Chrome. Graphics APIs like DirectX, Vulkan, and OpenGL are said to work through mapping layers and both Microsoft and Qualcomm have made huge efforts to ensure a smooth transitionthey were quick to volunteer that Apple is better at this than anyone and they hope to be compared to them this summer when the X Elite laptops ship. So, what is the Snapdragon X Elite? Well, they gave me one in a cute little acrylic trading card. It is a bespoke laptop chipnot based on a mobile chipbuilt on TSMCs 4nm process coming with a 12 high-performance core CPU, Adreno GPU, and in-house Hexagon NPU. Additionally, the on-board sensing hub houses an additional ISP, on-board WiFi 7 by default, and the capability to be paired with up to 64GB of LPDDR5 memory, a Snapdragon X65 5G modem, and NVMe storage over PCIe. The specs suggest Qualcomm is not messing aroundand from the benchmarks I saw, it consistently placed itself in between the M2 and M3. Not shabby at all. Now, Apple is still certainly going to have the upper hand with their Pro, Max, and Ultra chips, but this doesnt aim to compete with those. While OEMs can push the X Elite to run up to 90W for an extra performance boost, its reference-design consumes just 24W peak. Very, very close to M3. Now do I think that Qualcomms going to come out blazing with the best laptop chips within the next 3-years? Not really, no. But theyre hungry, theyve got Microsoft behind them, and they alluded to the fact that using heavy-duty GPUs from NVIDIA or AMD wouldnt be off the table in the futuresomething Apple has zero aspirations for. And just like Apple, Intel, and everybody else, theyre really leaning into their NPU for tasks that can use software-defined hardware for maximum efficiency and speed. Itll be exciting to see what form factors the Snapdragon X Elite embodies given its massive power envelope available to OEMsfrom netbooks to power-hungry beasts. Layer in the fact that this is just their first foray into the X Elite line and that higher-performance chips are on the roadmap, and well, weve got competition, baby. So whats Apple to do? Rush TSMC to the next process shrink? Pivot to developing hotter more consumptive chips in the name of speed? No. And Apple knows thats not their core competency. Apple Silicon has always been about sufficient performance with extreme efficiency, but physics are a cruel mistress and many watching this channel dont realize theyre already pushing up against boundaries that didnt exist for the M1 series. I still see comments that Apple silicon laptops are dead silent and thats just dead wrong. We edit videos for this YouTube channel on a 14 M3 Max MacBook Pro and the fans run at full-tilt nearly all the timenot just when exporting. And even with fans ablaze, our NLE struggles to get exports out even close to the time the 16 MacBook Pro can. Its throttlinghard. Now, does it throttle to the point that its no faster than an M3 Pro 14 MacBook Pro? No, but its sometimes slower than an M1 Max Mac Studiosomething that benchmarks would very much suggest is impossible. My point here is that for years, Apple had the exact same Intel chip SKUs as other computer makers. The silicon was never their selling point. That is until M1, when that formula got flipped on its head and Mac owners werefor the first time everable to be braggadocios about their computers speed. But Apple is pushing against technological limits and others are catching upso lets sit the silicon aside for a minute and focus again on Apples hardware design. As I see it, the entire MacBook lineup is basically the same. Sure, the Air has a lower-quality display and worse speakers than the 14 MacBook Pro and the 15 Air is cheaper than the 16 Pro, but I mean come on these machines are closer in design, size, footprint, weight, and feature-set than ever before. Theres no laptop that truly takes advantage of the form-factor provided by Apple silicons insane performance per watt. Imagine a laptop even thinner, smaller, and lighter than the 2015 12 MacBooka computer that still feels impossible todaynearly a decade after its release. Only this time, it doesnt have to be hamstrung by a crappy low-TDP Intel chip and lousy I/O. Would it be slower than an M3 Air? Sure. But how many people ownhecka base M1 MacBook Air and have never even approached the limits of that chip? Id venture to say MOSTand if your silicon can enable those impressive form factors do it! On the other end of the spectrum, why not put an M3 ULTRA in a 16 laptop thats a bit on the hefty-sidethe style that gamers and creators buy all the time on team Windows/Linux? A chip that just absolutely screams when needed with the thermal headroom to do it, but while maintaining the excellent idle efficiency offered by Apples low-power cores. It could be the first gaming laptop with a battery that doesnt die in like 4 hours. What I'm getting at is this - when Apple decided to make their own silicon, it was a bold, risky move. It paid off massively. The M1 series will be remembered as some of the greatest computers ever. But it also feels like that was the last time Apple really took a risk, and I think its time they stop sitting on their laurels and get back to work before the rest of the industry catches up. What do you think? Let me know in the comments below, but most importantlyand as alwaysstay snazzy.",
    "transcript_keywords": [
        "Apple",
        "Apple silicon",
        "Apples",
        "MacBook Pro",
        "Apple silicon laptops",
        "TDP Intel chips",
        "Pro",
        "MacBook Air",
        "chip",
        "chips",
        "performance",
        "MacBook",
        "Air",
        "silicon",
        "process",
        "time",
        "Elite",
        "Windows",
        "Max MacBook Pro",
        "Snapdragon X Elite"
    ],
    "transcript_entity_values": [
        "3.5",
        "SRAM",
        "M2s",
        "a minute",
        "YEARS",
        "3rd",
        "3",
        "iPad Pro",
        "2.8x",
        "Windows",
        "this summer",
        "Rush TSMC",
        "M3",
        "2",
        "Qualcomms",
        "OEMsfrom",
        "GPU",
        "14",
        "1.3x",
        "16 billion to 20 billion",
        "ISP",
        "90W",
        "M2",
        "the MacBook Pro",
        "one",
        "Armeven",
        "Max",
        "MacBook Pro",
        "5",
        "50%",
        "the M1 iMac",
        "the M1 Maxwas",
        "MacBook Air",
        "NLE",
        "gen3",
        "Hexagon NPU",
        "N5",
        "years",
        "about 15%",
        "Apple",
        "1.7x",
        "just months",
        "Mac",
        "M3",
        "Apple Silicon",
        "Adreno GPU",
        "Neural Engine",
        "first",
        "4",
        "Microsoft",
        "Windows Dev Kit",
        "MacBooka",
        "16",
        "MacBook Air",
        "Snapdragon",
        "MacBook",
        "Qualcomm",
        "three",
        "4 hours",
        "Macs",
        "zero",
        "M4",
        "1",
        "Windows RT",
        "the end of the day",
        "5-years-ago",
        "TSMC",
        "the X Elite",
        "Google Chrome",
        "today",
        "YouTube",
        "the next 3-years",
        "CPU",
        "AMD",
        "M1 MacBook Air",
        "Windows",
        "San Diego",
        "a decade",
        "2015 12",
        "several minutes",
        "IO",
        "a few weeks ago",
        "M1s",
        "M1 Max Mac Studiosomething",
        "Apples",
        "14 M3 Max",
        "M1not",
        "the 90s and 2000s",
        "Windows/Linux",
        "2x",
        "Microsofts Arm",
        "M2and",
        "Air",
        "M2",
        "64GB",
        "NVIDIA",
        "12",
        "7%",
        "OpenGL",
        "M1",
        "15",
        "First",
        "Intel",
        "24W",
        "Apples",
        "Vulkan",
        "DirectX"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "GPE",
        "DATE",
        "DATE",
        "TIME",
        "GPE",
        "DATE",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.008948483504354954,
        -0.00469568744301796,
        0.08980032801628113,
        0.010324914939701557,
        -0.023414522409439087,
        -0.07255004346370697,
        -0.0416032038629055,
        0.036519940942525864,
        -0.060494933277368546,
        -0.01210836973041296,
        0.022860605269670486,
        -0.008080814965069294,
        0.04152004420757294,
        -0.03328227996826172,
        0.013010377995669842,
        0.04407331347465515,
        0.07521368563175201,
        -0.03826749324798584,
        -0.040696632117033005,
        -0.012981375679373741,
        -0.0016133688623085618,
        -0.05246714502573013,
        -0.016374193131923676,
        0.036000631749629974,
        0.010096601210534573,
        0.04228619858622551,
        0.05363968387246132,
        -0.032171156257390976,
        -0.09591051936149597,
        -0.058836936950683594,
        -0.05217261612415314,
        0.08083053678274155,
        0.03216751292347908,
        0.015571885742247105,
        0.02171570435166359,
        -0.06438105553388596,
        0.07094385474920273,
        -0.04693710431456566,
        0.012083299458026886,
        -0.11134772002696991,
        -0.0882224440574646,
        -0.08435821533203125,
        0.09381484985351562,
        0.041818100959062576,
        0.0658523440361023,
        -0.020516686141490936,
        0.08189243823289871,
        -0.0931096076965332,
        -0.03000222146511078,
        -0.012082946486771107,
        -0.03121144510805607,
        -0.11337321251630783,
        0.01953190565109253,
        0.05065881088376045,
        -0.018921304494142532,
        0.04674037918448448,
        0.023546254262328148,
        0.03819064050912857,
        0.07394076883792877,
        0.011301705613732338,
        0.03493618592619896,
        -0.09968502074480057,
        -0.03542030602693558,
        0.03822896257042885,
        0.044115420430898666,
        -0.04560619965195656,
        0.07226809114217758,
        0.02777431719005108,
        -0.009729795157909393,
        0.09302253276109695,
        0.09798094630241394,
        -0.0345342718064785,
        0.022785643115639687,
        0.012107495218515396,
        0.02543562650680542,
        0.012110523879528046,
        0.01884835958480835,
        -0.012676415033638477,
        0.03915857896208763,
        0.020944176241755486,
        0.011755980551242828,
        0.012940846383571625,
        -0.05297262594103813,
        -0.0250010397285223,
        0.016683226451277733,
        -0.05099533870816231,
        -0.03326357901096344,
        0.012206515297293663,
        -0.02323184534907341,
        -0.012495696544647217,
        -0.002158462768420577,
        0.07331963628530502,
        -0.018618086352944374,
        -0.019211918115615845,
        0.09068915247917175,
        -0.02749639004468918,
        -0.010020014829933643,
        -0.06379208713769913,
        0.015650300309062004,
        0.021740661934018135,
        0.056033357977867126,
        0.10217001289129257,
        -0.009133444167673588,
        0.0103806396946311,
        0.05628512054681778,
        -0.011392643675208092,
        0.047183651477098465,
        0.06077595800161362,
        -0.01157696545124054,
        0.06362724304199219,
        0.040953002870082855,
        0.012140783481299877,
        -0.028449121862649918,
        -0.0269682165235281,
        0.021326685324311256,
        -0.0798448771238327,
        0.020392516627907753,
        0.04932102560997009,
        0.04568112641572952,
        0.07670380920171738,
        -0.05182000622153282,
        0.025336088612675667,
        -0.06587987393140793,
        -0.054314132779836655,
        -0.04330955818295479,
        0.0670427680015564,
        -0.12625274062156677,
        7.037874961521075e-33,
        0.022005563601851463,
        0.034992560744285583,
        -0.03653179109096527,
        0.02173449844121933,
        -0.022796520963311195,
        -0.06391480565071106,
        0.043250735849142075,
        0.020836900919675827,
        0.030905602499842644,
        -0.025521008297801018,
        -0.03782752528786659,
        0.013944498263299465,
        -0.038599349558353424,
        0.032974716275930405,
        0.09218081086874008,
        -0.11614822596311569,
        -0.03252602741122246,
        -0.044628750532865524,
        -0.007328657899051905,
        0.007999394088983536,
        -0.03831072524189949,
        -0.0013072489527985454,
        -0.0144683001562953,
        -0.0618850439786911,
        0.02948671393096447,
        0.0572592094540596,
        0.0851910337805748,
        -0.017065199092030525,
        -0.007516609970480204,
        0.05317596346139908,
        -0.08415272831916809,
        0.022830141708254814,
        -0.06678733229637146,
        -0.12688402831554413,
        -0.004158839583396912,
        0.020906463265419006,
        -0.04015642777085304,
        -0.08814457803964615,
        0.04405286908149719,
        -0.038976989686489105,
        -0.13476510345935822,
        0.033949241042137146,
        -0.028010733425617218,
        -0.041565753519535065,
        0.02849288284778595,
        0.06109421327710152,
        -0.05332490801811218,
        0.0005169740761630237,
        -0.010716516524553299,
        -0.08605639636516571,
        -0.04666148126125336,
        0.0022966116666793823,
        0.03063238598406315,
        -0.00534898042678833,
        0.035916030406951904,
        -0.016997814178466797,
        0.059994377195835114,
        -0.024991437792778015,
        0.00872811209410429,
        0.13799795508384705,
        -0.027913175523281097,
        0.03415394574403763,
        0.005999164190143347,
        0.08873625099658966,
        -0.06926506012678146,
        0.12393330782651901,
        0.01846197061240673,
        0.027501562610268593,
        -0.09511549025774002,
        0.07631397247314453,
        -0.008627574890851974,
        -0.040329281240701675,
        -0.0029583736322820187,
        -0.10089833289384842,
        0.0192392747849226,
        -0.025993971154093742,
        -0.020515676587820053,
        -0.013541270047426224,
        -0.0319489985704422,
        -0.014035111293196678,
        0.010193289257586002,
        -0.011282403953373432,
        0.010617715306580067,
        -0.03328046575188637,
        -0.03078402392566204,
        0.029010433703660965,
        0.044851984828710556,
        -0.03723811358213425,
        0.013108369894325733,
        0.0583246611058712,
        -0.02151590771973133,
        -0.05048166587948799,
        0.05841360241174698,
        0.055975541472435,
        -0.06955760717391968,
        -6.306025403010565e-33,
        0.022406112402677536,
        -0.021031921729445457,
        0.03310513123869896,
        0.11598232388496399,
        -0.05952883139252663,
        -0.046635743230581284,
        0.001063534989953041,
        0.003121111309155822,
        -0.09111716598272324,
        -0.03131652623414993,
        0.009251389652490616,
        0.0336240716278553,
        -0.009765496477484703,
        -0.03824497014284134,
        -0.03634984418749809,
        -0.03254387900233269,
        0.012034722603857517,
        -0.11318106204271317,
        0.06669904291629791,
        -0.019935663789510727,
        0.09427201747894287,
        0.013934043236076832,
        -0.01610621064901352,
        -0.027564868330955505,
        -0.04510565102100372,
        -0.006368698552250862,
        -0.07043041288852692,
        0.035422876477241516,
        0.008371647447347641,
        -0.01335662230849266,
        0.008061343804001808,
        -0.03750157728791237,
        0.04396883770823479,
        0.05436071753501892,
        0.05504485219717026,
        0.019771883264183998,
        -0.003294161520898342,
        -0.008121900260448456,
        0.042303118854761124,
        -0.025097087025642395,
        0.05123145878314972,
        0.0038689542561769485,
        0.011810243129730225,
        -0.018307825550436974,
        0.026181809604167938,
        0.0741330087184906,
        0.009189639240503311,
        0.005380988121032715,
        0.08183061331510544,
        -0.06874436140060425,
        0.015166775323450565,
        -0.041206639260053635,
        -0.014632257632911205,
        0.019626082852482796,
        -0.01349769439548254,
        -0.06932847201824188,
        -0.03334549814462662,
        0.032028164714574814,
        -0.014005429111421108,
        0.032293450087308884,
        0.028901871293783188,
        -0.018933523446321487,
        0.08502821624279022,
        -0.04050663113594055,
        -0.03214459493756294,
        -0.006203650962561369,
        0.014222369529306889,
        0.010787528939545155,
        -0.04096529632806778,
        0.006844122428447008,
        0.02155568264424801,
        -0.010286891832947731,
        -0.006127363070845604,
        -0.054611701518297195,
        -0.0401122085750103,
        0.05360352620482445,
        0.019354144111275673,
        -0.08323925733566284,
        -0.08095643669366837,
        -0.016459772363305092,
        0.028085505589842796,
        0.088802769780159,
        -0.02026810497045517,
        0.01472764927893877,
        -0.010088002309203148,
        0.06516855210065842,
        0.06241627410054207,
        -0.025216564536094666,
        -0.045259296894073486,
        -0.012535885907709599,
        -0.08273705095052719,
        -0.023265739902853966,
        -0.06085575371980667,
        0.003913708962500095,
        -0.12137582898139954,
        -5.1076227691737586e-08,
        0.024595128372311592,
        -0.043832067400217056,
        0.0468805655837059,
        0.03379911929368973,
        0.015293264761567116,
        -0.018269091844558716,
        -0.03021416813135147,
        0.018600450828671455,
        0.12075347453355789,
        0.06687700748443604,
        0.037299178540706635,
        -0.08172042667865753,
        -0.04318995401263237,
        0.04916208237409592,
        0.06784436106681824,
        0.03978140652179718,
        -0.05145074799656868,
        -0.016089629381895065,
        0.004876144230365753,
        -0.07229363918304443,
        0.00317509681917727,
        0.037480466067790985,
        0.11195507645606995,
        -0.023507146164774895,
        0.022161351516842842,
        0.04058928042650223,
        -0.06070137023925781,
        0.057958148419857025,
        0.07779961824417114,
        0.029433347284793854,
        -0.09144805371761322,
        -0.04159398004412651,
        0.028429973870515823,
        0.03816404566168785,
        0.0016072728903964162,
        -0.05226586386561394,
        0.0013417437439784408,
        0.05785033851861954,
        0.10743356496095657,
        -0.00871382374316454,
        -0.012046823278069496,
        -0.09382043033838272,
        -0.03364889323711395,
        0.04120370000600815,
        -0.07118786871433258,
        -0.08822125196456909,
        -0.10407538712024689,
        0.0011260377941653132,
        -0.057883307337760925,
        0.10983133316040039,
        0.04892197251319885,
        -0.0054071019403636456,
        0.037396855652332306,
        0.04268558323383331,
        -0.010514427907764912,
        0.04299681633710861,
        -0.009174331091344357,
        -0.00926243420690298,
        -0.04307360202074051,
        0.06442762166261673,
        0.14073851704597473,
        -0.13819634914398193,
        -0.05333620309829712,
        0.0705418810248375
    ]
}