{
    "id": "APlR80rT6fU",
    "title": "Top 5 Networking Certs for 2022",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2022-01-05T15:00:13Z",
    "video_url": "https://www.youtube.com/watch?v=APlR80rT6fU",
    "category": "Science & Technology",
    "tags": [
        "networking 2022",
        "certs",
        "certifications",
        "certs 2022",
        "ccna",
        "jncia",
        "ccna 200-301",
        "ccnp",
        "cisco",
        "juniper",
        "aruba",
        "aruba networks",
        "devnet",
        "devnet associate",
        "ccie",
        "devnet cisco",
        "devnet certification",
        "python",
        "linux",
        "aws",
        "azure",
        "gcp",
        "cloud",
        "networking",
        "api",
        "apis",
        "vmware",
        "docker",
        "david bombal",
        "ccna training",
        "cisco ccna",
        "cisco devnet",
        "ccna certification",
        "ccnp training",
        "ccna exam",
        "cisco devnet associate",
        "certs worth it",
        "best it certifications",
        "top 10 certifications for 2022",
        "top 10 certificate for 2022"
    ],
    "views": 133046,
    "likes": 5043,
    "comments_count": 366,
    "description": "Top 5 Networking Certifications for 2022.  // MENU // 0:00  Introduction 1:30  Job search demonstration 3:12  First Cert 5:02  Second Cert 7:00  Third Cert 7:13  Fourth Cert 9:30  Fifth Cert 9:51  Gatekeepers 10:30  David you are just a fanboy  // Videos Mentioned// 2022 Cybersecurity roadmap: How to get started?  Top 5 Cloud certs:   // SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    // MY STUFF // Monitor:  More stuff:   // SPONSORS // Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  ccna ccnp ccie devnet cisco cisco devnet devnet associate networking aruba hpe vmware  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #ccna #jncia #devnet",
    "description_links": [
        "https://youtu.be/mS7qWC3CbOU",
        "https://youtu.be/6llnxOV_aRU",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://amzn.to/3yyF74Y",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "- The great thing is I like to say about certifications is certifications show you what you don't know. You don't know what you don't know, and certifications give you a guided way to learn technologies and show you what you don't know. In your organization, you may spend time on a certain technology. Certifications broaden that knowledge and force you to learn stuff that's out of, for instance, your comfort zone. Again, I like to say this, you have a long journey. Your career is hopefully not just gonna be two years in length. You have time to pick up new certifications. You have time to learn new technologies and to broaden your knowledge. I have held many, many, many certifications during my lifetime. And for instance, I've had a voice certification, so CCNP Voice, that's not even relevant today. It's collaboration today. I've had CCNP Security, I've had CCNP Writing and Switching. I've had a whole bunch of certifications over the years, and I've found that they're really good to help me broaden my knowledge and make me a more rounded person. (upbeat music) In this video I wanna share my thoughts about the top five networking certifications that you can get in 2022. I discussed cybersecurity certifications in this video with John Hammond. I've created additional videos with Bart, where I discuss cloud certifications. I'll link those videos below. In this video, I'm specifically talking about networking certifications and the best certifications that you can get in 2022. Now let's start with this demonstration. On LinkedIn, I'm gonna search for CCNA in the United States. And what you'll see is I get 192,000 results. If I do that same search for JNCIA. In other words, the Juniper certification, I get 430 results. So as an example, you can see global infrastructure operations network engineer at Apple, JNCIA. You can see that. From an education perspective, they want you to have either CCNA or Juniper JNCIA, or equivalent industry experience. So that tells me that the Cisco certification, CCNA, is in a lot more demand in the United States than the Juniper certification. What about Aruba? So Aruba's switching certification is ACSA. So the associate certification. That has 105 results, but that's not just Aruba, that actually includes other certifications as well. If I search for Aruba in the United States, I get 1,927 results, but that's not just the associate certification, that's all jobs with the Aruba keyword. Now, if I do a search for CCNP in the United States, I get 191,000 results. So CCNA, Cisco certified network associate certification, I get 192,000 results. CCNP I get 191,000 results. And if I search for CCIE in the United States, I get 3,731 results. That little test tells me that you should rather invest your time getting a CCNA certification rather than a Juniper certification, rather than an Aruba certification, assuming that everything else is equal. Now, there's nothing wrong with Juniper certifications. There's nothing wrong with Aruba certifications. They are great certifications, but Cisco is the biggest networking vendor out there. So if I look at some statistics of the worldwide top five ethernet switch companies, you'll see that Cisco has the biggest market share. Cisco are the biggest networking vendor out there. If I was starting today and I was looking at my first networking certification, the certification that I would get is the Cisco CCNA certification. That is my first certification in 2022. Now, again, there's nothing wrong with the other certifications, but if everything is equal, if you have to pay for yourself, I think that the return on investment on a CCNA certification is gonna be a lot greater than other certifications. But let's say your employer is paying for the certifications and they want you to get a Juniper certification or an Aruba certification. Then by all means, get those certifications. Some people will accuse me of being biased towards Cisco. I'm a Cisco CCIE. I've done Cisco training for years and years and years, but I've also trained Aruba courses. I trained Aruba for quite a long time, actually. So I've worked with the Aruba equipment. I've worked with other vendor equipment. But if you have a limited time, and we all have limited time, if you have limited resources, and we all have limited resources, I think that the certification that you should concentrate on in 2022 is a CCNA certification. That is a baseline certification for all networking certifications. Once you've got a CCNA, then you can decide to go and do other things. So, as an example, my second certification is the Cisco DevNet Associate certification. Now years ago, we only had routing and switching as an option. Then we got additional certifications in data center. We got service provider, we got other certifications from Cisco. So you could get CCNA and then you could get CCNP and other certifications in different areas. The Cisco DevNet certification is a newer certification, but today, in today's world, you cannot just do networking. You need to have an understanding or an appreciation of programming languages, such as Python. You need to understand APIs. You need to understand JSON. That's even part of the CCNA today. But I see this as two main roads that you can take. You can be a traditional networking engineer with a bit of programming, or you can decide to focus more on DevNet and have a strong emphasis on network development. In other words, network automation or development in a networking context, and have an understanding of networking. You need to decide what you enjoy. Do you enjoy programming with a bit of networking, or do you enjoy networking with a bit of programming? Now, if you don't like to code, if you really don't like to code, then focus on the traditional networking path, but be aware that you cannot get away from some type of programming or a bit of programming. You're gonna come across APIs. You're gonna come across Python, network automation is here to stay. You need to be able to speak that language. So even if you focus very heavily on networking, you still need to understand network automation in today's world. So, first certification that I would suggest that you concentrate on is CCNA. Second one is the Cisco DevNet Associate certification. That's the path that I would take today if I was starting again. And as always, this is my personal opinion, this is what I would suggest you do if you were starting today. CCNA, then DevNet associate, and then you can decide what you wanna do. If you wanna focus on development, you can go and get to the DevNet professional certification. But if you wanna focus on traditional networking, if you like, you can get your CCNP Enterprise certification. Now, from a CCNP point of view, I think you've got two very good options. You've got CCNP enterprise or CCNP security. Security is a very hot topic at the moment. So you may wanna focus on security rather than enterprise, but you may not like working with security stuff. You may prefer working with routers and switches, BGP, OSPS, stuff like that. So have a look at enterprise. Notice here there are a whole range of CCNP certifications, but let's start with CCNP enterprise. Within CCNP enterprise we have the Encore exam. That's the core technologies exam. So that's the first one you're gonna get. And then you need to decide what you wanna do. So, as an example, I recommended last year that you look at SD-WAN. I strongly recommend that you look at SD-WAN in 2022. Software defined WAN is becoming really, really important. But you may also decide to get to the automation concentration exam. The great thing about the way that Cisco have done the CCNP today is that you get your core and then you get these concentration exams, and you can take a number of them to give you different skills. So, I would suggest CCNA, DevNet associate, and then you decide, are you gonna become a DevNet professional, or are you gonna become a enterprise engineer? So CCNP enterprise. Now, this as always, may not be the correct path for you. You may prefer to do security. So you may decide to throw the focus on security. So, security is a very hot topic at the moment. So if you wanna spend more time on security stuff, then perhaps don't do the CCNP enterprise, look at CCNP security. So in that case, you would start with the Cisco security core technologies exam, and then you need to decide, I would have a look at the firepower concentration. Companies need firewalls, but notice there are different options here. The great thing here is that you can decide to do the core exam, and then add some concentration exams to that. So going back to enterprise as an example, you may prefer doing advanced routing and switching because you wanna go and get your CCIE certification. And that would be my next certification. CCIE has been for many years, and I still think is very relevant in today's world. That is a very difficult exam. Don't think that if you're starting in networking today, so you're starting in 2022, that you're gonna get your CCIE. That's too much of a leap. There's too much knowledge to gain to get a CCIE. Certifications are a great way to expand your knowledge, and a great way to get past the gatekeepers. I strongly recommend that you get two certifications because they get you past to the gatekeepers. When you do a job search, notice that certifications are shown in the job searches. Recruitment agents are gonna filter your CV or your resume based on keywords such as CCNA, CCNP, CCIE. Make sure that you get the certifications so that you can get to the interview, get past the gatekeepers. And in the interview, you can show them a whole bunch of other stuff like the work that you've done, the projects that you've done, and your personality. Use certifications to get past the gatekeepers. Okay, now, a lot of people are gonna say, David, your list is very Cisco-centric. What about other certifications? You're a Cisco fanboy. And I will say that last year I had a very similar list to this year, but I think Cisco certifications because of the examples that I've done, and I suggest you do your own research. It may be different in the country that you're in. Look at the demand for Cisco CCNA versus JNCIA. So Juniper versus Aruba versus other vendors that are used where you are. In some parts of the world, there may be other vendors that are more popular than Cisco, but just in this simple search of the US, and the same is true in the UK, Cisco tends to be the most popular. Cisco certifications are the benchmark, I think, for a lot of networking certs. So a lot of certs are based on the Cisco certs associate professional expert. I think that the best certs to get in 2022 are these networking certs. Again, don't think you're gonna get a CCIE if you're just starting. Get your CCNA first, then your DevNet associate, and then perhaps part of your CCNP. Set that as your goal for 2022. But let me know in the comments, what do you think? Do you agree with this list? Did I miss anything? Do you disagree? Feel free to give me your comments, but based on what I see in the industry, I would suggest looking at the certifications. Okay, I'm David Bombal, wanna wish you all the very best. (upbeat music)",
    "transcript_keywords": [
        "certifications",
        "Cisco",
        "CCNP",
        "CCNA",
        "Cisco CCNA certification",
        "CCNA certification",
        "Aruba",
        "CCNP Enterprise",
        "Cisco CCNA",
        "Juniper certification",
        "United States",
        "networking",
        "Cisco certifications",
        "associate certification",
        "Aruba certification",
        "CCIE",
        "CCNP Security",
        "Juniper",
        "Cisco DevNet",
        "today"
    ],
    "transcript_entity_values": [
        "first",
        "UK",
        "1,927",
        "CCIE",
        "430",
        "CCNP",
        "JNCIA",
        "many years",
        "Apple",
        "the United States",
        "OSPS",
        "the years",
        "CV",
        "Cisco",
        "five",
        "192,000",
        "two",
        "DevNet",
        "John Hammond",
        "Second",
        "second",
        "BGP",
        "this year",
        "Bart",
        "2022",
        "today",
        "years and years and years",
        "David",
        "Juniper",
        "CCIE",
        "last year",
        "Python",
        "105",
        "Aruba",
        "191,000",
        "CCNP Writing and Switching",
        "years ago",
        "CCNP Enterprise",
        "Encore",
        "WAN",
        "SD-WAN",
        "CCNP Security",
        "Cisco",
        "CCNA",
        "3,731",
        "CCNP Voice",
        "David Bombal",
        "US",
        "CCNA",
        "Cisco DevNet",
        "two years"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "FAC",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "FAC",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "WORK_OF_ART",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.05186590924859047,
        -0.016244815662503242,
        0.002092421054840088,
        -0.022568026557564735,
        0.08024905622005463,
        0.04431959241628647,
        0.0713847428560257,
        0.028432171791791916,
        -0.0725540965795517,
        -0.008687347173690796,
        0.005423084367066622,
        -0.06055300682783127,
        0.013065298087894917,
        0.013237723149359226,
        -0.023416077718138695,
        0.03369733318686485,
        0.026373764500021935,
        -0.04458616301417351,
        -0.07131128013134003,
        -0.11325812339782715,
        -0.022201694548130035,
        -0.04411082714796066,
        0.026259545236825943,
        -0.06511253863573074,
        -0.04558589681982994,
        -0.04175224155187607,
        -0.011552258394658566,
        0.04798554629087448,
        -0.05218469351530075,
        -0.10701395571231842,
        0.005477752070873976,
        -0.0021035983227193356,
        0.009507687762379646,
        -0.009041804820299149,
        -0.04316984862089157,
        -0.051423560827970505,
        0.0057283444330096245,
        -0.0414620079100132,
        0.022492380812764168,
        0.010343705303966999,
        0.046776577830314636,
        -0.10027347505092621,
        -0.09678912162780762,
        0.007143958937376738,
        -0.023779548704624176,
        -0.004891188815236092,
        -0.025686006993055344,
        -0.023463750258088112,
        0.04339301586151123,
        0.057776063680648804,
        -0.000725707272067666,
        -0.06449025869369507,
        -0.0010968141723424196,
        0.023873578757047653,
        -0.038995467126369476,
        -0.03389458730816841,
        -0.05353480577468872,
        -0.04733240604400635,
        0.038525648415088654,
        -0.07980001717805862,
        0.09911519289016724,
        -0.05637744441628456,
        -0.0745960995554924,
        0.021478254348039627,
        -0.03190867230296135,
        -0.00626031868159771,
        -0.017056355252861977,
        0.09156051278114319,
        -0.03967226296663284,
        0.032201964408159256,
        -0.015593266114592552,
        -0.032976336777210236,
        0.011597995646297932,
        0.05983499810099602,
        0.033326420933008194,
        0.04004263877868652,
        0.047105323523283005,
        -0.06324644386768341,
        0.022945720702409744,
        -0.06618556380271912,
        0.03055240400135517,
        0.027247680351138115,
        -0.039486635476350784,
        -0.017400337383151054,
        -0.021622180938720703,
        0.02907519042491913,
        0.029583239927887917,
        0.025681521743535995,
        0.002129142638295889,
        0.01199923362582922,
        0.06408576667308807,
        0.07813571393489838,
        0.02883027121424675,
        -0.044700104743242264,
        0.07220350950956345,
        0.0512380488216877,
        -0.05139749497175217,
        -0.13582487404346466,
        -0.03122885338962078,
        0.0322575680911541,
        0.036561205983161926,
        -0.0053153811022639275,
        -0.020233435556292534,
        -0.04753871634602547,
        0.0009345372091047466,
        0.04204222932457924,
        0.02793893963098526,
        0.10770722478628159,
        0.06546337157487869,
        0.08325044810771942,
        -0.08029042929410934,
        0.062319450080394745,
        -0.11009470373392105,
        -0.044506415724754333,
        -0.04097090661525726,
        0.0842970460653305,
        -0.01470692828297615,
        0.07585121691226959,
        0.1093856617808342,
        -0.08985421806573868,
        0.0036429790779948235,
        0.07619622349739075,
        0.04982653260231018,
        -0.046914637088775635,
        -0.040420569479465485,
        -0.04346992075443268,
        -0.04342596232891083,
        1.1218934247295236e-32,
        -0.007223073858767748,
        0.10650420188903809,
        -0.07174291461706161,
        -0.026871463283896446,
        0.05705997347831726,
        -0.00930621288716793,
        0.08873656392097473,
        0.035504572093486786,
        -0.12443085014820099,
        0.0029142184648662806,
        -0.06230836734175682,
        0.04655216634273529,
        -0.03299891576170921,
        -0.010427418164908886,
        0.006430342793464661,
        -0.050238531082868576,
        0.00751265836879611,
        -0.016472265124320984,
        0.0006074902485124767,
        -0.03349630534648895,
        0.018494240939617157,
        -0.07312550395727158,
        0.018359851092100143,
        0.03923213854432106,
        0.08693396300077438,
        -0.05223235487937927,
        0.00454264972358942,
        0.03264496475458145,
        0.056497134268283844,
        0.004813327919691801,
        0.00859161838889122,
        -0.013537387363612652,
        0.028672663494944572,
        -0.04584212973713875,
        0.05766680836677551,
        0.04822054132819176,
        0.005579541437327862,
        -0.07816458493471146,
        0.01309080608189106,
        -0.025599202141165733,
        -0.04941170662641525,
        0.048968907445669174,
        -0.016142796725034714,
        -0.04270000755786896,
        -0.08087319135665894,
        0.009415162727236748,
        0.011014530435204506,
        -0.03690597787499428,
        0.08876417577266693,
        0.04051344096660614,
        -0.07371759414672852,
        -0.01516176201403141,
        -0.007954484783113003,
        -0.11158134788274765,
        -0.017709659412503242,
        -0.11659334599971771,
        -0.029448941349983215,
        0.07139511406421661,
        -0.03495381772518158,
        -0.03532250598073006,
        -0.04087904095649719,
        -0.0737060084939003,
        -0.01647905819118023,
        -0.027298113331198692,
        -0.09758076071739197,
        0.018914494663476944,
        -0.023711469024419785,
        0.02202554978430271,
        -0.009507391601800919,
        -0.009885486215353012,
        -0.07838684320449829,
        0.07891646772623062,
        0.09795507043600082,
        -0.017371080815792084,
        0.030075248330831528,
        0.064634308218956,
        -0.024694690480828285,
        0.006084571126848459,
        0.004717402625828981,
        -0.005221635568886995,
        -0.020275404676795006,
        0.024788424372673035,
        0.019272441044449806,
        0.05058087408542633,
        0.010886000469326973,
        0.022352024912834167,
        0.06808418780565262,
        0.003455620724707842,
        0.016067685559391975,
        0.06572096794843674,
        0.013804679736495018,
        0.0025917689781636,
        0.060690753161907196,
        0.06919310986995697,
        -0.07516373693943024,
        -1.0545803570344177e-32,
        -0.027764905244112015,
        0.10386266559362411,
        0.09593770653009415,
        0.022024013102054596,
        0.04797296226024628,
        -0.0017110651824623346,
        0.023418806493282318,
        -0.004250683821737766,
        0.05802704766392708,
        0.020345307886600494,
        0.05381087586283684,
        0.036531656980514526,
        0.03114386275410652,
        -0.12690265476703644,
        -0.056465085595846176,
        -0.06956788152456284,
        -0.07512225955724716,
        -0.013004463165998459,
        0.02004414051771164,
        -0.07214750349521637,
        0.07072605192661285,
        0.08557698875665665,
        -0.07668495923280716,
        -0.0053214034996926785,
        0.05264582857489586,
        0.06079842150211334,
        0.011218409053981304,
        0.03219157084822655,
        0.04189720377326012,
        0.0011225366033613682,
        0.042468663305044174,
        -0.004363644402474165,
        -0.013405871577560902,
        0.03888991102576256,
        -0.00915831234306097,
        0.0028428894001990557,
        0.07157427072525024,
        0.0867733582854271,
        -0.01213900838047266,
        0.04872439056634903,
        0.08467333763837814,
        0.0022878318559378386,
        -0.07520423829555511,
        -0.026488833129405975,
        -0.028833314776420593,
        -0.03824657201766968,
        0.05747533589601517,
        -0.03451528400182724,
        -0.04268110170960426,
        0.003435396356508136,
        -0.0077091725543141365,
        0.0020045272540301085,
        -0.00812081154435873,
        0.03645417094230652,
        -0.018387245014309883,
        0.1082833856344223,
        0.03532273322343826,
        0.09985348582267761,
        0.0629434734582901,
        -0.023617297410964966,
        -0.017858488485217094,
        0.021436793729662895,
        0.02899416722357273,
        0.046200647950172424,
        0.056777697056531906,
        -0.05624808743596077,
        0.016269400715827942,
        0.0688987597823143,
        -0.0955602303147316,
        -0.0316239632666111,
        -0.0813923254609108,
        0.03422023728489876,
        0.005369660910218954,
        -0.12984736263751984,
        -0.019618764519691467,
        -0.06631894409656525,
        0.05291656777262688,
        -0.06886985152959824,
        -0.019769417122006416,
        0.0431024543941021,
        -0.006365518551319838,
        0.034793637692928314,
        -0.03256038576364517,
        -0.010018416680395603,
        0.06930232048034668,
        0.02507181651890278,
        0.06063541769981384,
        -0.0017488388111814857,
        0.055740781128406525,
        0.037969332188367844,
        -0.06468764692544937,
        -0.013386023230850697,
        0.05382339656352997,
        0.04547570273280144,
        0.03864843025803566,
        -6.174137467951368e-08,
        0.015431957319378853,
        0.033820509910583496,
        -0.0718684047460556,
        0.05932427570223808,
        0.03005988337099552,
        0.04835495725274086,
        -0.028232494369149208,
        -0.02083234302699566,
        -0.006511866580694914,
        -0.010881921276450157,
        0.036063265055418015,
        -0.03180255740880966,
        -0.08152523636817932,
        -0.04026618227362633,
        0.024960210546851158,
        -0.04777659848332405,
        -0.10657034814357758,
        -0.014324955642223358,
        -0.0023274277336895466,
        -0.034511104226112366,
        -0.02294030599296093,
        0.010043829679489136,
        0.009229342453181744,
        0.042394980788230896,
        -0.01960589550435543,
        0.05433104187250137,
        0.0677095577120781,
        0.0774744376540184,
        -0.04145151376724243,
        0.0210513174533844,
        -0.08089310675859451,
        -0.032190952450037,
        -0.012101120315492153,
        -0.06614652276039124,
        0.03204936906695366,
        0.04775519669055939,
        -0.11025027930736542,
        -0.06771384924650192,
        0.029842274263501167,
        0.1017291322350502,
        0.010001907125115395,
        -0.05005620792508125,
        0.009732140228152275,
        0.05017293617129326,
        0.010093838907778263,
        -0.029577711597085,
        -0.09944301843643188,
        -0.04805724322795868,
        0.006118228193372488,
        -0.05538560077548027,
        0.010298158042132854,
        -0.14965610206127167,
        0.04263395071029663,
        -0.007689553312957287,
        -0.016417749226093292,
        0.0382765494287014,
        0.0304898489266634,
        0.008412003517150879,
        0.03704504296183586,
        0.034060634672641754,
        0.06544722616672516,
        -0.09609319269657135,
        -0.02614702098071575,
        -0.01500256173312664
    ]
}