{
    "id": "ArcI4A5nvBo",
    "title": "iOS 18 Hands-On: Top 5 Features!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2024-07-15T21:31:41Z",
    "video_url": "https://www.youtube.com/watch?v=ArcI4A5nvBo",
    "category": "Science & Technology",
    "tags": [
        "iOS",
        "iOS 18",
        "iOS 18 update",
        "iOS 18 download",
        "iOS 18 review",
        "MKBHD",
        "features",
        "iOS 18 features",
        "iPhone 18 features"
    ],
    "views": 7303340,
    "likes": 207214,
    "comments_count": 7955,
    "description": "iOS 18. Coming soon to an iPhone near you.  MKBHD Merch:   Tech I'm using right now:   Playlist of MKBHD Intro music:   ~     0:00 Control Center and shortcuts 3:29 The Passwords app 4:58 Homescreen customization 8:20 The little things (and RCS) 10:10 That calculator doe",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(shapes springing) (groovy hip-hop music) - All right, it's mid-2024, so you know what that means, another new version of iOS coming to an iPhone near you. So, I've been testing the newest version of iOS 18 on my iPhone for the past couple weeks now. It's been in beta, and now that the public beta's out, you too can test it on an iPhone before it comes out for everyone in September. But there is some interesting stuff in this version. Now, last year, I remember talking about how almost every single one of those new features was super ecosystem-based. Like, they would depend on having a friend with an iPhone or having some other Apple device in your life, but it's kinda the opposite with these. They're all just basically new features to the iPhone, anyway. So I love to see that. Now, for this video, the one thing I'm leaving out is Apple Intelligence stuff. That's like an entire separate bucket of stuff that, to be honest, hasn't really been available for me to test in the pre-release betas. So I'm gonna make a separate video just about that stuff as soon as it's actually testable. So be sure to get subscribed to see that when I actually drop that video. But this video is the top five of everything else. All right, number five, the new Control Center. So I have this at number five because while there is a good amount of new stuff here, I don't know if I like all of the new changes, but let me know what you think. So when you pull down from the corner, the new Control Center is, first of all, a little bit more colorful, and it's paginated, it's three pages now. I'll honestly probably never really use the second two pages, but they are a full-page visualizer for whatever media is playing. And then a list of all these one-touch toggles for your basic connectivity. But actually turns out this full-page list is really just an expanded version of what you already had on the first page, so you can get there with a couple more taps. But okay, so on that first page, if you hit the plus button in the corner, it shows a grid, and then you can play with the size and placement of anything that has a tab in that bottom corner. So they all kind of have these predefined sizes that they morph between. So you can mess around here with, you know, basically designing your perfect layout for your control screen. You can add new controls, and there's a whole massive list of them to search through here and surface things that you do often. And right now, these are basically all Apple app controls. What I'm more interested in, though, is... I mean, these are all controls, like I said, not widgets. So, they're for controlling things very directly, like turning on wifi or turning up the brightness. And so Apple has said that third-party apps are gonna be able to build in controls, as well. So there's none here now, but I very much look forward to like a one-touch turning on the AC in the car or one-touch opening up the barcode scanner in my calorie tracker app or something like that. So just having more controls surface in here, that's gonna be pretty sweet. We've also noticed this new flashlight control, which, when you click it allows you to control both the intensity and the beam width of the torch for some reason. The intensity part definitely works. The beam width, I don't know if I'm as convinced on that one, but I guess it's still a really cool UI. Oh, also, there's a new button up here to turn off your phone, kinda like Android added a while ago in the settings. But also, you can now finally change the controls on your lock screen now. From the default, which have been the flashlight and the camera for forever, you can hold down, customize, lock screen, and get in there and go to town. Again, I hope there's third-party ones that end up here, but there's already a ton of options. I am excited to set mine to my to-do list app someday. But that brings us to number four, the number four best new iOS 18 feature and that's the Passwords app. You know, every once in a while, there's just a new update that installs a new app on everyone's phones and just drops it on your home screen. So this is one of them. But essentially, what this is is just breaking out all of the password tools that were previously buried in the settings on the phone and making it an app. So your iPhone's been saving your passwords for a while now, saving wifi passcodes, remembering all this stuff. This app is just a super simple way of finding it all in one place, searching through that stuff, and making sense of it. Plus, it also supports some new features. So there's two-factor authentication and pass keys. And then there's a couple extra things on top that may be good enough to get you to switch from whatever password manager app you're using on your iPhone to Apple's Passwords app. So, at the bottom left, you can create shared passwords and pass keys within a group of trusted contacts. Works with other people with iPhones, anyway. And then, when you're signing up for some new account somewhere, it'll do the same thing it always does. It offers a super secure password and then offers to remember it for you. But what I found interesting is it doesn't really have, like, a master password, it just seems on the iPhone to default to Face ID. So if you've got face ID on your iPhone, it'll ask for that to log in, no master password. Really, the main reason I'm not gonna be using this app is because I stole daily an Android phone, and, of course, they did not make an Android version of this Passwords app. They did make a Mac app, and they also did make a Chrome extension, which is interesting. But yeah, no Android app, and I still log into a bunch of stuff on Android, so it's not for me. But number three is gonna have to be the new home screen customization. Some of you might've expected this to be higher, like number one or number two, but I have my reasons, and maybe let me know if you agree with them. So, the day has finally come. There is new customization stuff available to iPhone home screens, kinda. I mean, there's some good stuff and also some weird stuff. I'll start with the stuff I like. Here's the easy part: iPhone users can now put their icons anywhere on their home screens that they want. Welcome to 2024, iPhone users. Who's got it better than you? Now, everything still snaps to the grid, of course, but now you can actually put icons on the right side or the bottom of your home screen where they'll actually be reachable, and they won't have to snap back up to the top. How cool is that? First, they give you widgets, now they give you this. It's unbelievable stuff. But now, okay, if you wanna customize even further, you hold down on anywhere on the home screen, and there's a little edit button at the top. You hit that, and then you hit customize, and then this is it. This is the entire home screen customization menu now for the iPhone. So you can go dark mode, which tints your wallpaper a little darker, and then sets your icons that have a dark mode version to dark mode. Or you could set light mode, which is the opposite. It sets your icons to light, and it tints your wallpaper light, and they're automatic. But there's also this large button here, which just makes all of your icons larger, but then also removes the text. Honestly, kind of clean, not gonna lie. But then there's this tinted button, which feels kind of cursed. So this is already kind of a weird-looking icon. When you click it, it lets you tint the color of all the icons on your home screen to a single matching color. Which sounds kind of cool in theory to match your wallpaper. And actually, there's even a color picker to drop exactly the same color that you're using from your wallpaper as your tint color. But there's just something about this tint that I can't quite get right. Like, I haven't gotten any combination to really look that good at all. Now, there's been some updates on this since the first beta. Still doesn't look great. Like, it looks better than before. But here's what I think is going on here. There are certain apps that are, like, pretty simple and high-contrast icons that look fine. Like, some of them are Apple apps, some of them are third-party apps, and then especially Apple widgets. Like, look at this weather widget. That looks great. That looks really solid with this nice accent color because it keeps everything really readable. But then there are also some third-party app icons and widgets that just look completely illegible. Like, they may need to be updated to support this tinting thing in a more contrasty way. So it's the mixing of these two that look weird. Like even on my home screen, look at CARROT, like the weather app, or Superlist, they look worse than the rest of the icons on my home screen. I think the standard that they're aiming for is, like, a dark gray background with a tinted glyph in the middle, instead of the whole thing being tinted. So it is what it is. I will also say Google has also tried this with Material You in Android, and it also kind of went weird in its own different, unique way. Basically, it would set all the icons to a monochrome version, but if an app didn't support it, it just didn't change. So a lot of people had a mix of monochrome icons and colorful icons, which also doesn't look good at all. So, I guess the tinting method could be considered a workaround. I'm sure people will play with this more. Icons will continue to get updates. I'm sure someday maybe it'll look great for some people, but I haven't seen that yet. But all right, number two, for me, is the little things. Again, there are a bunch of tiny little things and small features that individually are not huge, but they'll kind of feel like they add up to a bunch of useful things in the end. A lot of them didn't even make the keynote. But, like, game mode, for example, they talked about this. We know that when you have a game open, it gives it CPU priority and minimizes Bluetooth latency for any wireless headphones or controllers. That's a really simple thing, but it's nice. The Photos app also got a redesign, but I also am more impressed with the smart search inside of Photos. It works much better. So if I search for, like \"license plate,\" for example, not only does it recognize and find all the photos in your gallery with license plates, but it also gives you these suggestions to narrow it down to find the exact one that you're looking for, and it actually works. I've also noticed they added a bunch of shortcuts to Shazam everywhere, including an Action button preset as one of the new defaults in the Settings app. This wasn't here before. I thought that was interesting. And then I Googled it, and apparently, Apple bought Shazam not that long ago, which I totally forgot about. So there you have more of that. And RCS support does appear to finally be live on the iPhone in 2024. (clapping) It's going great. Now, as I predicted, it is still a green bubble, but you can now finally text between any modern Android phone and an iPhone and actually get high-quality media. I sent myself a three-megabyte image file from the iPhone, and I got a full-quality three-megabyte image on Android. And there's also now typing indicators and read receipts now. Reactions seem to be working well. So it's not fully integrated into a blue bubble iMessage, like maybe some people were hoping. But Apple can now say that they finally did it, and now that person from that one interview doesn't have to buy his mom an iPhone. But then number one. The number one best new feature in iOS 18, bro, it's a calculator. (chuckling) It's actually the calculator. Now, you might have thought this was just an iPad thing 'cause we all saw this get demoed at the keynote in iPadOS 18, but it actually is on the iPhone, as well. So, as a default, you open up the Calculator app, it just looks like a basic calculator. This looks very familiar. But at the bottom left, there's this little toggle where you can switch to a scientific calculator. Okay, pretty classic. Or you can switch to this new thing called Math Notes. And now it basically looks like a notes app. So you can create a new note and literally just start handwriting math notes, literally. You can write an equation, and if you happen to write that equal sign, it can automatically solve that equation for you and keep it updated as you continue writing or typing. It's pretty sick. There are also all kinds of other things it can do, from variables to graphs. It's basically doing everything I was asking Wolfram|Alpha to do lately. But a kind of underrated part of this is how it feels very well considered, and it's also syncing across devices just, like, as a bunch of notes. So your calculator just kind of gained a notes section. So, if you add a bunch of stuff to Notes on your iPhone, the iPad with the calculator has all of the same notes, and you can edit them on the other device. And if you happen to redefine a variable lower down in the same note, then it actually knows then from that point on to treat that variable as the new value you gave it but keeps the old value for everything above it. It's very well impressively thought out. Now, obviously, this stuff is gonna be easier with a bigger screen and with an Apple Pencil. But, man, I was doing all this stuff in school with a paper notebook and a TI-84. So, at the risk of sounding kind of old, I totally wish I had something like this when I was in school. It's very impressive. It's doing so many things. It's recognizing my handwriting. It's obviously answering the equations I'm asking of it, but it's also writing the answers in my own handwriting and then it's straightening everything up. And it's making everything searchable and indexable through not just that Math Notes app in all the devices but across my whole phone. So it's pretty sick. I'm impressed by this more than anything else I've seen in iOS 18. So that's why it's my number one feature in iOS 18. But there's your whole top five. But like I said, get subscribed to see a deep dive into Apple Intelligence 'cause this is the thing that kind of permeates the entire iPhone and Apple's whole ecosystem. So that video's coming up soon, and that's been it for this. Thanks for watching. Catch you the next one. Peace.",
    "transcript_keywords": [
        "app",
        "iPhone",
        "Apple",
        "stuff",
        "home screen",
        "kind",
        "icons",
        "screen",
        "Android",
        "Apple app controls",
        "Apple Passwords app",
        "number",
        "home",
        "Passwords app",
        "Notes",
        "thing",
        "things",
        "controls",
        "Apple Intelligence",
        "Apple Intelligence stuff"
    ],
    "transcript_entity_values": [
        "Notes",
        "Shazam",
        "Apple",
        "three",
        "Material You in Android",
        "one",
        "iPad",
        "four",
        "2024",
        "iMessage",
        "Mac",
        "three-megabyte",
        "number five",
        "the day",
        "third",
        "Control Center",
        "Math Notes",
        "UI",
        "Android",
        "Superlist",
        "five",
        "the past couple weeks",
        "18",
        "iOS 18",
        "first",
        "First",
        "iPhone",
        "Google",
        "Action",
        "second",
        "Apple Intelligence",
        "Chrome",
        "Calculator",
        "iOS 18",
        "number two",
        "CPU",
        "RCS",
        "Apple Pencil",
        "AC",
        "two",
        "September",
        "a ton",
        "TI-84",
        "last year",
        "mid-2024",
        "iPhones"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "EVENT",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "LAW",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "DATE",
        "NORP"
    ],
    "vector": [
        -0.018167955800890923,
        -0.059826549142599106,
        0.06419085711240768,
        -0.06589604914188385,
        0.091608427464962,
        0.021834278479218483,
        -0.03076992742717266,
        -0.0016071542631834745,
        -0.04108986631035805,
        -0.0006386882741935551,
        0.062032993882894516,
        0.004765749908983707,
        -0.030398646369576454,
        0.014881784096360207,
        0.0560375452041626,
        -0.00363229145295918,
        0.0813048779964447,
        -0.055661432445049286,
        -0.10268090665340424,
        -0.017117485404014587,
        -0.02479381300508976,
        -0.025809606537222862,
        0.0018666947726160288,
        0.012973984703421593,
        -0.008522635325789452,
        -0.006162978243082762,
        -0.07465381920337677,
        -0.052637580782175064,
        -0.04745752736926079,
        0.012366268783807755,
        0.10480369627475739,
        0.12027531117200851,
        0.06182296946644783,
        0.015838833525776863,
        -0.020123619586229324,
        -0.08998534828424454,
        0.015700247138738632,
        -0.01647241599857807,
        -0.0021726705599576235,
        -0.08501553535461426,
        -0.03385308384895325,
        -0.06011192128062248,
        -0.00935086328536272,
        0.06294869631528854,
        -0.0006278053624555469,
        -0.03146292269229889,
        -0.02852507494390011,
        0.007383214775472879,
        -0.017225613817572594,
        -0.029085006564855576,
        -0.022361906245350838,
        -0.08986786007881165,
        -0.010508712381124496,
        0.03312152251601219,
        0.03637806326150894,
        0.027242295444011688,
        -0.026990462094545364,
        0.0352138988673687,
        0.11310570687055588,
        0.001871177344582975,
        0.11274376511573792,
        -0.05037856101989746,
        -0.0006444389000535011,
        0.051318615674972534,
        0.12138804793357849,
        0.006816104520112276,
        -0.03487522527575493,
        0.03766714781522751,
        0.057882580906152725,
        -0.054419610649347305,
        -0.03718461096286774,
        -0.017401043325662613,
        0.007877268828451633,
        -0.02099454030394554,
        0.05658011883497238,
        0.05967145413160324,
        -0.04323044791817665,
        -0.015026861801743507,
        -0.04055757820606232,
        -0.08394642174243927,
        0.0272001251578331,
        0.027533099055290222,
        0.004726252984255552,
        0.00043510127579793334,
        -0.0385715588927269,
        -0.0021324502304196358,
        -0.04464254155755043,
        -0.02648570016026497,
        -0.018024995923042297,
        0.036227427423000336,
        -0.010639844462275505,
        0.0226521547883749,
        0.02474147267639637,
        -0.05579905956983566,
        0.0039040392730385065,
        0.02653190866112709,
        -0.04238075390458107,
        -0.11679786443710327,
        -0.006799519527703524,
        0.0025704794097691774,
        0.002698620781302452,
        -0.024980448186397552,
        0.04726486653089523,
        0.010565049014985561,
        0.08750234544277191,
        -0.04826352745294571,
        0.031070560216903687,
        -0.003374365856871009,
        0.059263233095407486,
        0.1448928564786911,
        -0.0051183877512812614,
        0.013625673949718475,
        -0.022868813946843147,
        -0.005851416382938623,
        0.06091715022921562,
        0.009807294234633446,
        -0.01664765179157257,
        0.11518918722867966,
        0.09181981533765793,
        0.06268652528524399,
        -0.012371552176773548,
        0.06027800217270851,
        0.0050421967171132565,
        -0.07901198416948318,
        -0.025503668934106827,
        0.10998477041721344,
        -0.09264102578163147,
        6.583583129126724e-33,
        0.012154283002018929,
        0.02540268376469612,
        -0.03901495784521103,
        0.04151071980595589,
        0.06454582512378693,
        -0.09554432332515717,
        -0.008525494486093521,
        0.04208039492368698,
        -0.04478425160050392,
        0.07333137840032578,
        0.005192621145397425,
        0.05756736174225807,
        -0.07237742841243744,
        -0.00018801969417836517,
        0.14825257658958435,
        -0.01204622257500887,
        -0.18213129043579102,
        -0.026036327704787254,
        0.05054273456335068,
        0.00462602823972702,
        -0.0272125955671072,
        -0.03135211393237114,
        -0.02396106719970703,
        -0.056605760008096695,
        0.038294944912195206,
        -0.06189671903848648,
        0.017451168969273567,
        -0.04368304833769798,
        0.03343813493847847,
        0.0021096800919622183,
        -0.07990845292806625,
        0.01863495260477066,
        -0.022282380610704422,
        -0.03732772171497345,
        -0.03701307252049446,
        0.007947620004415512,
        0.010561194270849228,
        -0.09611710160970688,
        0.0034008347429335117,
        -0.03908039256930351,
        -0.04815604165196419,
        0.03270106390118599,
        -0.07098700106143951,
        0.03407742455601692,
        0.023770852014422417,
        0.034872982650995255,
        0.05066786706447601,
        -0.006953458301723003,
        -0.00860818475484848,
        -0.020792558789253235,
        -0.06319256871938705,
        -0.035129956901073456,
        -0.03535536304116249,
        -0.06232879310846329,
        -0.058306846767663956,
        0.026352891698479652,
        0.019812559708952904,
        -0.06687217950820923,
        0.017696615308523178,
        0.01954360492527485,
        0.012285984121263027,
        -0.00047650455962866545,
        -0.01990598626434803,
        -0.028505340218544006,
        -0.03740936890244484,
        0.04891600087285042,
        0.06629311293363571,
        -0.019599074497818947,
        0.02334776520729065,
        0.07154180854558945,
        -0.10460361838340759,
        -0.028638098388910294,
        -0.0474628210067749,
        -0.03649388626217842,
        0.000196288077859208,
        -0.008506743237376213,
        0.03838132694363594,
        -0.09073012322187424,
        -0.03373595327138901,
        -0.041096702218055725,
        -0.0220309067517519,
        0.08447512239217758,
        0.019789034500718117,
        0.06864926964044571,
        0.026497595012187958,
        -0.025652090087532997,
        -0.02128889411687851,
        -0.06926649063825607,
        0.01670832373201847,
        0.06544756144285202,
        -0.019457725808024406,
        -0.04418142884969711,
        0.028552869334816933,
        0.024469392374157906,
        -0.012654341757297516,
        -7.402003438471479e-33,
        -0.06291382014751434,
        -0.08281905204057693,
        0.01533639244735241,
        -0.007082304451614618,
        0.05296963080763817,
        -0.052692703902721405,
        -0.000613960437476635,
        0.02185209095478058,
        -0.033299073576927185,
        -0.055973976850509644,
        0.015228349715471268,
        0.052509818226099014,
        0.06528203934431076,
        0.0013466626405715942,
        -0.03093983605504036,
        -0.02705443650484085,
        -0.04407115280628204,
        -0.07406038045883179,
        0.05102077126502991,
        0.06500285863876343,
        -0.01541262585669756,
        0.022628840059041977,
        -0.048736367374658585,
        0.015585373155772686,
        -0.023124590516090393,
        0.03434436395764351,
        -0.02849360555410385,
        0.016994072124361992,
        0.0641879290342331,
        -0.054879408329725266,
        0.05770081654191017,
        -0.04484570771455765,
        -0.026795467361807823,
        -0.043029580265283585,
        0.038915589451789856,
        0.0064384001307189465,
        -0.004560439381748438,
        -0.014015690423548222,
        -0.08515708148479462,
        -0.05782429128885269,
        -0.013001330196857452,
        0.014185921289026737,
        -0.033978432416915894,
        0.028338901698589325,
        0.015753570944070816,
        0.07930563390254974,
        -0.03906337171792984,
        0.07115332037210464,
        -0.05802066624164581,
        0.013615859672427177,
        0.08083337545394897,
        -0.009569895453751087,
        -0.06371425837278366,
        -0.02227027900516987,
        -0.08031062036752701,
        0.01780928298830986,
        0.06677704304456711,
        0.0421517938375473,
        0.002183853415772319,
        0.03464357927441597,
        0.04772995784878731,
        0.005202783737331629,
        -0.039657920598983765,
        -0.021755920723080635,
        -0.062171418219804764,
        -0.0323883481323719,
        0.022466806694865227,
        0.04469256103038788,
        -0.05448426306247711,
        0.05900042876601219,
        -0.05753975734114647,
        -0.07348667085170746,
        -0.05332840606570244,
        -0.08322063088417053,
        -0.007050287444144487,
        0.04765599966049194,
        0.054104577749967575,
        -0.08506438881158829,
        -0.004109187517315149,
        -0.021909406408667564,
        -0.02727552130818367,
        0.20344386994838715,
        0.040170956403017044,
        0.002245567040517926,
        0.13047097623348236,
        0.050374455749988556,
        -0.014061297290027142,
        0.019733702763915062,
        0.00817149318754673,
        0.08061543852090836,
        -0.02482503466308117,
        0.011810429394245148,
        -0.14892253279685974,
        0.0633377879858017,
        -0.034061700105667114,
        -6.013563336182415e-08,
        0.053593751043081284,
        -0.004273366183042526,
        0.01802320033311844,
        0.011933248490095139,
        -5.705275179934688e-05,
        -0.01582658849656582,
        0.01302738580852747,
        -0.009530561044812202,
        0.10120885074138641,
        0.04961302876472473,
        -0.03988691046833992,
        -0.006860820576548576,
        -0.09930552542209625,
        0.12180528044700623,
        0.07574153691530228,
        0.006779614370316267,
        -0.043280016630887985,
        0.0068089780397713184,
        -0.06628142297267914,
        -0.017034029588103294,
        -0.008877687156200409,
        0.07090870290994644,
        0.016223296523094177,
        -0.07241547852754593,
        0.0037716303486377,
        -0.015899820253252983,
        0.0175187811255455,
        -0.023713789880275726,
        0.020890982821583748,
        0.04850676655769348,
        0.05469261109828949,
        0.00838502123951912,
        -0.004582804162055254,
        -0.0075677987188100815,
        0.020411981269717216,
        0.033912863582372665,
        -0.028236161917448044,
        -0.048262279480695724,
        0.04516105726361275,
        0.0025135090108960867,
        -0.019440460950136185,
        -0.10618134588003159,
        0.00781287718564272,
        0.011475694365799427,
        -0.014893550425767899,
        -0.061780985444784164,
        0.029087794944643974,
        -0.04380275309085846,
        0.00433498015627265,
        0.05157088115811348,
        -0.06556941568851471,
        -0.08759266883134842,
        -0.021068820729851723,
        -0.03398359939455986,
        0.1314866691827774,
        0.031460851430892944,
        -0.006944204680621624,
        -0.0478675551712513,
        0.04065696895122528,
        -0.0015928487991914153,
        0.11828941851854324,
        -0.06371128559112549,
        -0.0043759653344750404,
        0.030074700713157654
    ]
}