{
    "id": "artduBCYC7o",
    "title": "Gaming On A Chromecast: Brilliantly Terrible",
    "channel": "Dawid Does Tech Stuff",
    "channel_id": "UCvcRA2Hva1lULVf4GCouH8w",
    "subscriber_count": 688000,
    "upload_date": "2022-04-30T13:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=artduBCYC7o",
    "category": "Science & Technology",
    "tags": [
        "dawid",
        "dawid does tech stuff",
        "PC",
        "gaming",
        "intel",
        "AMD",
        "Corsair",
        "Gaming",
        "Game",
        "Computer",
        "Gaming PC",
        "David Does Tech Stuff",
        "DDTS",
        "Tech",
        "Stuff",
        "google",
        "chromecast",
        "gaming on a google chromecast"
    ],
    "views": 212892,
    "likes": 9307,
    "comments_count": 456,
    "description": "*Today's video sponsor* Go sign up to Linode here:   I do some gaming on the Google Chromecast, which left me both amazed and disgusted.  Get some AWESOME Dawid merch here:   -Here is a link to my Patreon page, it would be awesome if you check it out:   -Follow me on whichever Social media you don't hate-  Discord:  Twitch:  Twitch shorts channel:  YouTube:",
    "description_links": [
        "http://linode.com/dawid",
        "https://dawiddoesmerch.com",
        "https://www.patreon.com/DawidDoesTechStuff",
        "https://discord.gg/b34uVGaYVB",
        "https://www.twitch.tv/dawiddoestechstuff",
        "https://www.youtube.com/channel/UCAiMJaOrvTik7XyJethz-ig",
        "http://www.youtube.com/c/dawiddoestechstuff"
    ],
    "transcript": "Today we're going to be gaming on this dangly little google chromecast. All the way from phone games, right up to cyberpunk. But before that, it's time for a word from today's video sponsor! Today's video is sponsored by my favorite linux based cloud computing and web hosting service: LINODE! If you need a service that has products that can handle cloud storage, databases, websites, game servers, Kubernetes or even your vast computational load, then you need some Linode in your life and Linode will do all that, with customer service that'll put a smile on your keister! If that sounds like something you're into sign up to Linode using the link in my description below for a 60-day $100 credit! Thank you very much Linode for sponsoring today's video! Now physically the Chrome cast with google TV is just an off-white little pebble with a dangly little HDMI cord at the end. It looks a little bit like a high-tech sperm to me to be honest. And that actually doesn't fill me with a whole lot of confidence in terms of gaming performance, because there's no ventilation on here. Which means there's some pretty low power draw hardware in here. But we'll figure it out. We'll see what happens. Now in terms of I.O. it is also concernedly limited. It's almost apple product limited but at least it's a USB-c port which means we can still go to dongle town. Oh it comes with a cute little off-white remote which actually come to think of it, is probably the worst color you can make a remote. It's just gonna be gross and hand cheese covered after like two days of light use. Also, this is definitely not a gaming peripheral so hopefully it's not gonna be too hard to connect something more gaming oriented to the little chromecast. Ah yes, it also comes with some off-white batteries included for the remote which is nice. And what looks like an off-white iPhone charger and cable but other than that there is not a whole lot to say about this thing physically. So let's plug it into a display and start setting it up. Setting up the little chromecast wasn't really a big deal. All I had to do was give google all of my personal information and then sacrificed my firstborn child to them. After that it just took about 20 minutes to install all of the software on it and then we were up and running and just like that we've set up our little google spermcast. I really should not start calling it that... the google chromecast... and as standard it seems to just have a bunch of TV stuff on it. So let's go have a look at apps and see what we can find. Ooh PAC-man! That would have been really exciting like 30 years ago. Oh! But here we go. We've got some phone games that we can actually run on the chromecast.Oh! Let's give farming simulator a try. That sounds amazing. Oh okay, it looks like it wants us to connect a gamepad before installing any games which makes sense. Let's quickly go do that. And just like that, the xbox controller is connected to our chromecast. That was surprisingly easy. Wow, that is an extensive list of settings this game has. And with that admittedly very brief attempt, there doesn't seem to be much I can do to fill the whole display with farming. But I don't really care. I'm just excited to see how farming simulator runs on a chromecast! There we go! We're farming. Oh yeah, that is some good farming action right there. There is the occasional frame drop and it doesn't look great but it's a chromecast and it has native gaming support which I think is pretty cool. So with that let's try a different android game. Damn this is like bloom the video game. Look at that now this is by no means an ideal gaming experience, as you saw there is the occasional - pretty substantial - stutter but the little chromecast is still running a game - which I think is pretty cool. Although it is a pretty losery phone game so let's see if there's a way to run some better games on the chromecast. Oh cool, retroarch is just on the google play store! That's convenient. Now getting retroarch set up on the little Optimus Prime's excretion is actually really easy. All you do is you install it off the google play store and then you install a file manager so that you can copy game files from a PC onto the chromecast and once retroarch finishes setting up, it'll be familiar to anybody that's used the software before. So with that let's see what kind of games the chromecast can handle. Okay, well we've done some magic and now we've got street fighter 2 Turbo Hyper Fighting running on the little chromecast. I don't know what the controls are... That's going very well... Oh! Go away Sangeeth... Oh yeah! You can't defeat my ... oh never mind he did. He did defeat my swipe attack... Yes! Finally beat the AI. Anyway the little chromecast handles the snes game very well but granted there's not any real upscaling going on so it's a very easy load which makes me think we should try out a newer generation of console games. No way! Look at that. It runs PS1 games. Now I know, I know by today's standards the hardware in the PS1 is barely more advanced than what you find in an etcher-sketch but still. Although there is some input lag it's not the worst but it's definitely noticeable. I think the part about the emulation experience on the little chromecast that impressed me the most was just how easy itwas. Granted, with more challenging games the input lag may flare up your whooping cough abit. But at least you don't have to do any weird hackerman blackmagic tech fangling to get it running. Although, now it's time to see how the little chromecast handles modern gaming! Now, it seems like one of the better ways to play more modern games on the little chromecast is by using Geforce Now. This is just an app on the play store which should be very interesting considering how the more powerful NVIDIA shield struggled with it so let's give it a try. Okay there is definite input lag. Like I would not want to play a competitive fps like this... a few moments later ... oh Wait... What? What just happened? What is happening? The moment anything actually happened in the game everything just fell apart. The thin veil of a functional gaming experience just... just collapsed... Oh look at that pixelation! Oh there's also some heavy artifacting starting up. This is definitely not going well. Although, I may actually have a dongle that'll help... A while ago I went out and bought this bad boy which should give us wired internet on the chromecast. Giving it its best chance possible to run Geforce Now with any kind of dignity. Now the thing that makes this Ethernet dongle usable with the chromecast is that it has a USB-c pass-through, which will give us power for the little chromecast. So let's see if it works! Hey! Would you look at that! It's actually powered up Ethernet connected! Hell yeah. Now I'm not sure if the input lag feels any better. It could be marginally better but that may also just be me imagining things. However, the real test comes with the wolf battling. Oh that's much better. Nothing's exploded yet. When we did the wolf battling before there was that insane desync and pixelation which is all gone now, making this just feel like a pretty standard Geforce Now gaming experience but now that we've fixed the minor exploding problem, let's try a slightly more competitive game. Okay, now there's definite input lag but it actually runs surprisingly well. Like what the hell! We're playing Fortnite on a Chromecast! Well I guess we're not technically playing it on the chromecast, but still! I just really hope I'm playing against other people playing on a chromecast because if so, if the other players are using a keyboard and mouse, I'm pretty screwed... Oh this is hot! This is really hard... This... this is the hardest thing I've... that.. is that is impossible.. what the hell! So the combination of the input lag and the fact that you're playing an fps with a controller means that Fortnite's only really playable in theory, but what happens if we connect a mouse and keyboard to the Chromecast? Now, with its Bluetooth functionality I'm hoping that this MX keys mini will connect to the Chromecast easily so that we don't have to be humiliated by 12 year olds in Fortnite anymore. Whoa, it's actually not covered in plastic! Which - that gets me all hot and bothered! Oh, it's like a Logitech apple keyboard. Okay, now we just need to see if it pairs. Hey! There. It is paired. Nice, cool, now I have a keyboard and then when it comes to the mouse I'm using this Corsair Harpoon that they sent over ages ago for a video and it also paired super easily. and just like that we're ready to dominate in Fortnite! Wow, that input lag is horrendous... The mouse movement is so imprecise. I actually think that the gamepad is less terrible than this. Look at how stuttery and confused the mouse tracking is. I cannot imagine what pvp is gonna be like with this. There's no way I'm actually gonna kill this guy. What? The only explanation for that person losing that engagement to me is that they're also gaming on a chromecast. So I guess if you want to know what it feels like to game while on meth - without you know... ruining your life? You just have to use wireless peripherals with a chromecast! So now that we've experienced the Fortnite gaming equivalent of bath salts, there's just one more thing left to try. Would you look at that! Even Cyberpunk runs - semi-acceptably - on a chromecast, which is what!! Now, due to input lag, driving does feel even more like you're trying to pilot a drunk hippo on a unicycle than normal in cyberpunk, which is kind of shocking... but it does seem like the little chromecast is handling cyberpunk better than a PS4 did which is a great point to end a video on. Thank you for watching if you enjoyed the video consider watching another one. A suggestion will pop up in a second and until the next video - bye!",
    "transcript_keywords": [
        "chromecast",
        "game",
        "input lag",
        "games",
        "gaming",
        "LINODE",
        "input",
        "lag",
        "google chromecast",
        "video",
        "google",
        "pretty",
        "Today",
        "today video",
        "Fortnite",
        "chromecast handles",
        "farming",
        "play",
        "give",
        "playing"
    ],
    "transcript_entity_values": [
        "this Corsair Harpoon",
        "a few moments later",
        "USB",
        "hackerman blackmagic tech",
        "xbox",
        "Chrome",
        "Linode",
        "Kubernetes",
        "Ethernet",
        "Fortnite",
        "ages ago",
        "Turbo Hyper Fighting",
        "60-day",
        "about 20 minutes",
        "Geforce Now",
        "2",
        "Today",
        "second",
        "100",
        "google TV",
        "I.O.",
        "today",
        "30 years ago",
        "Geforce",
        "Sangeeth",
        "two days",
        "Optimus Prime's",
        "one",
        "LINODE",
        "Linode",
        "MX",
        "Fortnite",
        "Chromecast",
        "Logitech",
        "12 year olds",
        "PS4",
        "cloud computing",
        "The mouse movement",
        "NVIDIA"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "LOC",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.09880799055099487,
        -0.10001354664564133,
        0.06384557485580444,
        -0.12219029664993286,
        0.10576339811086655,
        -0.004725992679595947,
        0.04924212768673897,
        -0.021248186007142067,
        -0.025419754907488823,
        0.004669652320444584,
        -0.05330623686313629,
        0.008829609490931034,
        -0.03432239219546318,
        -0.0260593444108963,
        0.006708127912133932,
        -0.04806307330727577,
        0.11460572481155396,
        -0.060989733785390854,
        -0.06011282280087471,
        -0.02429782785475254,
        -0.019368594512343407,
        -0.049785032868385315,
        -0.026380565017461777,
        -0.026244524866342545,
        0.04997149482369423,
        0.020791370421648026,
        -0.020063508301973343,
        -0.015080498531460762,
        -0.014165492728352547,
        -0.11446258425712585,
        0.029750637710094452,
        -0.04003385454416275,
        -0.057469192892313004,
        0.03746732324361801,
        -0.01770411990582943,
        -0.03540512174367905,
        0.012202621437609196,
        -0.013147953897714615,
        -0.1922519952058792,
        0.02746705710887909,
        0.0423230342566967,
        -0.02454143762588501,
        -0.02587956190109253,
        -0.02768421359360218,
        -0.010165407322347164,
        -0.022829962894320488,
        -0.019405584782361984,
        -0.022532595321536064,
        0.030725764110684395,
        0.012766425497829914,
        -0.030107589438557625,
        -0.041126567870378494,
        0.10029678791761398,
        0.03364650532603264,
        -0.03924594074487686,
        0.010639036074280739,
        -0.03009127825498581,
        -0.01491152960807085,
        0.021137118339538574,
        0.02024226076900959,
        0.06677237898111343,
        -0.05240890756249428,
        0.0023927881848067045,
        0.03944415971636772,
        -0.00617613410577178,
        0.0023311234544962645,
        0.06600520759820938,
        0.05097547173500061,
        -0.01711784116923809,
        -0.00484509626403451,
        -0.04517436772584915,
        0.044089362025260925,
        0.01960843987762928,
        0.10790133476257324,
        0.010234865359961987,
        -0.02474740706384182,
        0.0033702917862683535,
        -0.0037553198635578156,
        0.07881301641464233,
        0.02419409714639187,
        0.0698825940489769,
        0.01490035094320774,
        0.0036758228670805693,
        0.017333634197711945,
        -0.015986012294888496,
        -0.016262665390968323,
        0.010544933378696442,
        0.008119245991110802,
        -0.003693218110129237,
        -0.03678615391254425,
        -0.11988402903079987,
        0.13687743246555328,
        0.08767914772033691,
        0.020183037966489792,
        -0.03032478503882885,
        -0.01277086976915598,
        0.08986803889274597,
        -0.05639499053359032,
        -0.02948569878935814,
        0.09184690564870834,
        -0.010193481110036373,
        0.05715670436620712,
        0.02319384180009365,
        -0.055453743785619736,
        -0.04668667912483215,
        -0.08153818547725677,
        -0.033197008073329926,
        0.10805713385343552,
        0.06100677698850632,
        0.02058260142803192,
        -0.07303453981876373,
        0.01562363002449274,
        -0.03157481178641319,
        -0.01736667938530445,
        0.01662660390138626,
        0.01671823300421238,
        -0.04118359088897705,
        -0.016674330458045006,
        0.04100209102034569,
        0.010058857500553131,
        0.013076884672045708,
        0.016523271799087524,
        -0.02251747064292431,
        0.08895790576934814,
        0.0799155905842781,
        0.02138875611126423,
        -0.02664768695831299,
        2.6165168961189983e-33,
        0.052901722490787506,
        0.018018804490566254,
        -0.08858209103345871,
        -0.009982768446207047,
        0.04314778372645378,
        -0.0005928264581598341,
        0.01049181167036295,
        0.04376847296953201,
        -0.08785044401884079,
        -0.033851124346256256,
        0.0349251925945282,
        0.015823449939489365,
        -0.0927695631980896,
        0.049866028130054474,
        0.08726252615451813,
        -0.04149540513753891,
        -0.019162200391292572,
        -0.0336734801530838,
        0.04267214611172676,
        -0.05425390228629112,
        0.02700239233672619,
        0.015962455421686172,
        -0.0007467780378647149,
        0.06485302001237869,
        0.0645940899848938,
        -0.08417388051748276,
        -0.06986077129840851,
        -0.038780294358730316,
        0.12045595794916153,
        0.03634217381477356,
        -0.004789353813976049,
        -0.11142902821302414,
        0.0012601875932887197,
        -0.002299827290698886,
        -0.027652015909552574,
        0.0006103370687924325,
        -0.18552672863006592,
        -0.11738457530736923,
        -0.04929934814572334,
        0.04120929166674614,
        0.00042040328844450414,
        0.01117413304746151,
        -0.10966288298368454,
        -0.04347367584705353,
        -0.08611161261796951,
        -0.008277193643152714,
        0.07702010869979858,
        -0.01599641516804695,
        -0.031512971967458725,
        -0.017893215641379356,
        -0.024166474118828773,
        0.025725500658154488,
        0.014959505759179592,
        0.02658245898783207,
        -0.034877508878707886,
        0.03381013125181198,
        0.017082547768950462,
        -0.0841170996427536,
        -0.007417302578687668,
        -0.020608285441994667,
        -0.01910790428519249,
        -0.011640217155218124,
        -0.002613756339997053,
        -0.0029710503295063972,
        -0.07931631803512573,
        -0.10049018263816833,
        0.1004355251789093,
        0.03645665571093559,
        -0.01233312301337719,
        0.01444666925817728,
        -0.013847462832927704,
        0.00037799871643073857,
        0.018068712204694748,
        0.012195082381367683,
        -0.015808673575520515,
        -0.0015443286392837763,
        -0.06748540699481964,
        -0.07524821162223816,
        -0.02669961377978325,
        0.007001310586929321,
        0.06340489536523819,
        -0.015412446111440659,
        -0.034794602543115616,
        0.012016826309263706,
        -0.013393508270382881,
        0.0038732988759875298,
        0.06308209896087646,
        -0.032572828233242035,
        -0.06156676262617111,
        0.0387849435210228,
        -0.11648351699113846,
        0.011100957170128822,
        0.05896136909723282,
        -0.004811176564544439,
        0.013297068886458874,
        -3.4585203772061334e-33,
        -0.08548415452241898,
        -0.029391372576355934,
        -0.018946044147014618,
        0.09379629790782928,
        0.05716390907764435,
        0.012063632719218731,
        0.016996711492538452,
        0.04089635610580444,
        0.05722862482070923,
        -0.02981571853160858,
        -0.016826825216412544,
        -0.016495630145072937,
        -0.06954118609428406,
        0.02805720828473568,
        -0.02683490701019764,
        -0.0548265241086483,
        0.0024967575445771217,
        -0.08794080466032028,
        0.02352183498442173,
        -0.05746127665042877,
        0.005658592097461224,
        0.009887760505080223,
        -0.0023953155614435673,
        -0.017126787453889847,
        0.054318394511938095,
        0.049970559775829315,
        0.013189515098929405,
        0.04577178508043289,
        -0.01154262013733387,
        0.046105124056339264,
        0.061062850058078766,
        0.04213515296578407,
        -0.019648263230919838,
        -0.06881207972764969,
        0.07585280388593674,
        0.06641386449337006,
        0.12979832291603088,
        0.07699599117040634,
        -0.08124784380197525,
        -0.09135060012340546,
        -0.00014414546603802592,
        -0.02637610025703907,
        -0.0011930473847314715,
        -0.018167151138186455,
        0.062425244599580765,
        0.04515991359949112,
        -0.07435470074415207,
        -0.010094061493873596,
        -0.004511427134275436,
        0.006593362893909216,
        0.02645716816186905,
        -0.013655245304107666,
        0.06485885381698608,
        -0.008475173264741898,
        -0.01672954298555851,
        -0.04047630354762077,
        -0.010153225623071194,
        0.04132518917322159,
        -0.029399406164884567,
        -0.007614817004650831,
        0.016704900190234184,
        -0.05085001513361931,
        -0.06990531831979752,
        0.03369654715061188,
        0.021680602803826332,
        -0.03216208517551422,
        0.038336411118507385,
        0.04317498207092285,
        -0.04632170498371124,
        -0.010901378467679024,
        -0.06982898712158203,
        0.032718509435653687,
        0.011784415692090988,
        -0.015705358237028122,
        -0.07168125361204147,
        -0.007394303567707539,
        0.09653015434741974,
        0.05201319232583046,
        0.021400289610028267,
        -0.0160989873111248,
        -0.026448966935276985,
        0.056463878601789474,
        0.05078595504164696,
        -0.050591371953487396,
        0.055228978395462036,
        0.04409769922494888,
        0.1323619782924652,
        0.028796646744012833,
        -0.03708452358841896,
        -0.007128253113478422,
        -0.025258447974920273,
        0.046644262969493866,
        -0.11418028175830841,
        0.04029645770788193,
        0.047294363379478455,
        -4.884580917519088e-08,
        0.06527279317378998,
        0.023609377443790436,
        -0.04660896211862564,
        0.006525089032948017,
        -0.0006688329158350825,
        -0.0857028141617775,
        0.01778188720345497,
        -0.03514055907726288,
        0.054830510169267654,
        -0.0720018669962883,
        0.022297946736216545,
        -0.007695978507399559,
        -0.004935844335705042,
        0.007040936034172773,
        0.11224766075611115,
        0.0037804690655320883,
        -0.03882231190800667,
        0.03519812971353531,
        -0.042724184691905975,
        0.020718753337860107,
        -0.012133226729929447,
        0.06596480309963226,
        -0.0076016890816390514,
        -0.0035543153062462807,
        -0.00047749251825734973,
        0.02751363441348076,
        0.12056683003902435,
        0.006844305898994207,
        0.054399557411670685,
        0.021311582997441292,
        -0.07580184191465378,
        0.03811946138739586,
        -0.03169670328497887,
        -0.07239527255296707,
        0.05121747776865959,
        -0.03623948618769646,
        -0.08471666276454926,
        -0.037200070917606354,
        0.025557439774274826,
        0.06656758487224579,
        0.007525336463004351,
        0.040681421756744385,
        0.04061158373951912,
        0.011495494283735752,
        0.03523554652929306,
        -0.01287157367914915,
        -0.04899093881249428,
        -0.04343515634536743,
        0.03613892197608948,
        -0.017068639397621155,
        -0.06113579124212265,
        -0.002537837950512767,
        0.040596142411231995,
        0.0345301553606987,
        0.08977633714675903,
        -0.05548341944813728,
        0.06863413751125336,
        -0.05122528597712517,
        -0.024933060631155968,
        0.08033149689435959,
        0.027328522875905037,
        -0.007151611149311066,
        -0.027782294899225235,
        0.09898405522108078
    ]
}