{
    "id": "ax2qnnS-LmQ",
    "title": "Huawei P20 Pro Durability Test! - Scratch, Burn, BEND TESTED",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-04-30T14:02:42Z",
    "video_url": "https://www.youtube.com/watch?v=ax2qnnS-LmQ",
    "category": "Howto & Style",
    "tags": [
        "p20 pro",
        "Huawei P20",
        "P20 durability",
        "how durable is P20",
        "P20 Pro review",
        "P20 Pro unboxing",
        "tripple camera smartphone",
        "3 camear phone",
        "triple camera",
        "durability test",
        "huawei p20 pro review",
        "smartphone",
        "technology",
        "tech",
        "mobile phone",
        "android"
    ],
    "views": 3269243,
    "likes": 40501,
    "comments_count": 4754,
    "description": "Huawei has released the P20 Pro. The first tripple camera smartphone. One monochrome camera, a telephoto, and a 'normal' lens. I think it looks awesome. But is the Huawei P20 pro durable? There is only one way to find out. (Current P20 Pro Pricing:  JerryRigEverything's standard durability test that every smartphone must participate in. Will the P20 pro survive being scratched, burned and also bent? Huawei does not advertise Gorilla Glass on this smartphone.... and that might be its biggest weakness. This is the Midnight blue color varient. The color shifting one is called Twilight.   Huawei P20 Pro teardown Video:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://amzn.to/2JGEI5Z)",
        "https://youtu.be/OhfzXeLu55k",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Huawei P20 Pro. Huawei has come out with some pretty solidly constructed phones since the Nexus 6P failure back in the day. The Mate 10 Pro I tested earlier this year passed with flying colors. It's time to see if this newest from from Huawei it's a triple camera P20 Pro flagship is a survivor. Let's get started. [Intro] Inside the box we get the charging cable, headphones with a USB-C connector, and the international wall charger since this particular phone isn't coming to the USA. I'll update the video description if that changes in the future. Initial impressions are that the phone is thick and solid feeling right out of the box just how it should be. We'll start with the scratch test. Laying out my Mohs Hardness Scale. If you remember, this tells us what hardness level the screen is. Plastic would be a level 3, tempered glass is a level 6, and sapphire would be a level 8. Diamonds, of course, would be a 10. Huawei did include a plastic screen protector on this P20 Pro, which is nice of them, but the screen surface itself we find scratches at a level 6 and a deeper groove at a level 7. The P20 Pro is tempered glass. Huawei doesn't advertise having gorilla glass on their phone like they did last year on the P10. Remember that...it will be important later on in the video. First thing I noticed about this phone besides the notch, is the earpiece. It's a little circular thing just oogling at you like some kind of second eyeball right next to the 24 megapixel front facing camera. Most earpieces are little slits for optimal sound transfer from the rectangular speaker underneath, but this guy is a circle. It will be interesting to see if the speaker is circular as well during the teardown. The speaker grill won't fall out though which is good not even with a razor blade. It's still sitting completely flush with the surface of the glass. The fingerprint scanner is down here at the bottom of the phone and is unscratchable. A big step up from the Mate 10 which we did end up scratching. You never know when you might end up in a freak razor blade fight accident. It's good to know your button will survive any damage. Speaking of buttons, Huawei added a little slit into the metal power button and dabbed some red paint in there. A kind of interesting and unique design choice. The volume rocker is also made from metal, and we can tell from the sound it's making that the sides are also metal. Up at the top of the phone we are headphone jack-less. But Huawei did include an IR blaster so you can change the channel on your TV and stuff. Personally, I've never had a need for one of those, but I'm all about the features, the more the merrier so bring it on. We have a metal dual SIM card tray, but no expandable memory. No headphone jack on the bottom of the phone either, just a loud speaker and USB-C charging port. For the back of the phone, this one is a Midnight Blue version, we get our first look at the triple camera set up. Super impressive by the way. I like what's happening here. And I'll say it again: the more features a phone has, the better. And the extra camera options on this guy is a good thing. The logos and Leica branding are all under the glass and won't be coming off from the outside, along with the dual toned, dual LED flash tucked safely under that back glass panel. If we zoom in real tight on the camera lenses, down here at the bottom we have a 20 megapixel monochrome sensor covered with glass, and a circular metal lip around the sides. Then we have a beastly 40 megapixel camera here in the center of the 3 lenses. And finally a 3 time zoom telephoto lens up top. It's a pretty solid trio, but I think the ideal arrangement would be to toss out the monochrome sensor and add in a wide angle lens like a Go Pro fish eye back to capture a lot of things all at once. Those are the 3 types of lenses I carry for my professional camera. Monochrome has just never appealed to me. Quick side by side comparison with the dual camera set up on the iPhone 10. I am going to try to replace the cracked glass on the iPhone 10 with dry ice here in a few days. If you don't know what I'm talking about, go check out my iPhone back glass liquid nitrogen video I posted a couple days ago. And now for the burn test. No offense France, I didn't realize I was burning down the Eiffel Tower until it was too late. I apologize. This is a 1080p 6.1 inch AMOLED display, meaning it lasted for about 20 seconds under my flame, but then never recovered. The flame left a white spot on the screen, even when the screen was off. Once again, sorry France...and thanks again for the Statue of Liberty. That was real nice of you. And now the bend test. This is where things go down hill. First of all, with the initial flex, it bends way more than I anticipated. Normally phones are much more solid than this. With that massive flex, the glass display is now shattered with multiple fractures. The damage is all contained in the glass...nothing transferred down to the AMOLED display underneath, but it is still rather unfortunate. I'll do a quick bend from the back of the phone before we go into the structural analysis. But with that second bend, no extra damage is done to the front or rear of the phone. It appears as if the cracks emanated from the level 7 pick marks left on the surface, meaning that without the damage I intentionally introduced to the surface of the glass, it might have survived the first bend. But an important thing to remember is that these impurities or scratches introduced to the surface of the glass can also occur in real life in your pocket or with minor drops, dents, and dings. And even more interesting to note, is that I've tested over 100 different phones now over the past few years, and most of them don't shatter during the bend test, even with the level 6 and 7 scratches in the glass. So it's kind of safe to say that this Huawei P20 Pro is just weaker in general. My theory is that Huawei didn't advertise corning gorilla glass on this particular phone, and with the vast majority of other phones that I test, some form of gorilla glass is installed. Based off the sample size of tested phones on my channel, corning holds up better than generic cell phone glass, even after damage has been introduced. The Huawei P20 Pro still functions though, so it's not a catastrophic failure. I don't think that it deserves a spot on my Shelf of Shame, but it still didn't exactly pass. I need a new category for phones that survive...but barely. What should we call it? Remember, a case and a screen protector go a long way to making your device last longer. Hit that subscribe button if you haven't already, and come hang out with me on Instagram. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "glass",
        "phone",
        "Huawei",
        "Pro",
        "level",
        "phones",
        "camera",
        "gorilla glass",
        "screen",
        "back",
        "back glass",
        "phone glass",
        "bend",
        "test",
        "surface",
        "metal",
        "damage",
        "cell phone glass",
        "tempered glass",
        "thing"
    ],
    "transcript_entity_values": [
        "earlier this year",
        "3",
        "the past few years",
        "iPhone",
        "Nexus",
        "The P20 Pro",
        "6",
        "8",
        "Midnight",
        "Instagram",
        "IR",
        "a few days",
        "100",
        "jack",
        "6",
        "this P20 Pro",
        "Leica",
        "one",
        "about 20 seconds",
        "Huawei",
        "7",
        "10",
        "the Eiffel Tower",
        "USA",
        "24 megapixel",
        "USB-C",
        "1080p 6.1 inch",
        "France",
        "last year",
        "second",
        "first",
        "P10",
        "First",
        "3",
        "The Huawei P20 Pro",
        "20 megapixel",
        "AMOLED",
        "Mohs Hardness Scale",
        "a couple days ago",
        "the day"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "LAW",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "EVENT",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "GPE",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "GPE",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE"
    ],
    "vector": [
        -0.0988742858171463,
        0.034618183970451355,
        0.09283078461885452,
        -0.04502340033650398,
        0.036945268511772156,
        -0.05736427754163742,
        0.07241864502429962,
        0.04910269007086754,
        -0.06050064042210579,
        0.035363294184207916,
        0.059121645987033844,
        0.05038919299840927,
        0.059974852949380875,
        0.07349812239408493,
        0.06235700845718384,
        0.04622824490070343,
        0.0014299009926617146,
        -0.09247785806655884,
        -0.01474844291806221,
        0.028844276443123817,
        0.03968525677919388,
        -0.040683865547180176,
        -0.01941988617181778,
        -0.0061415089294314384,
        -0.0333920456469059,
        -0.0004793856933247298,
        -0.02236419916152954,
        0.03958907723426819,
        -0.01280749961733818,
        -0.032926738262176514,
        -0.011534721590578556,
        0.0877818912267685,
        -0.03904222697019577,
        0.04944267496466637,
        0.06627488136291504,
        -0.06131349131464958,
        -0.01822715438902378,
        0.0013395954156294465,
        -0.08378598093986511,
        0.006269581615924835,
        -0.023858416825532913,
        -0.05760950222611427,
        -0.006318110041320324,
        -0.028554119169712067,
        0.04567001014947891,
        -0.032392218708992004,
        0.09922010451555252,
        -0.03695875033736229,
        -0.031491898000240326,
        -0.010110177099704742,
        0.007795804645866156,
        0.0115817217156291,
        0.05675628036260605,
        -0.009172387421131134,
        -0.010922367684543133,
        0.09866708517074585,
        -0.0010195127688348293,
        -0.022779718041419983,
        0.03509413078427315,
        -0.05351569131016731,
        0.016336902976036072,
        0.032805878669023514,
        -0.0522678941488266,
        0.08374455571174622,
        0.01938258670270443,
        0.04478628188371658,
        0.0580914206802845,
        -0.10449513792991638,
        0.04949105158448219,
        0.019408682361245155,
        -0.008063718676567078,
        0.011227562092244625,
        0.009206869639456272,
        -0.00820769090205431,
        -0.027734579518437386,
        0.04261903837323189,
        0.05928653106093407,
        -0.020728427916765213,
        -0.10480218380689621,
        -0.03210751339793205,
        0.05362427607178688,
        -0.04810112714767456,
        -0.021635279059410095,
        0.009680310264229774,
        0.057357385754585266,
        0.014824657700955868,
        -0.016905715689063072,
        0.10511013865470886,
        -0.08089267462491989,
        -0.06282440572977066,
        -0.0029716631397604942,
        0.10576726496219635,
        -0.129054456949234,
        0.02388511225581169,
        -0.005989624187350273,
        -0.016187766566872597,
        -0.057457320392131805,
        -0.0719536542892456,
        -0.0330238938331604,
        -0.01776611991226673,
        -0.015378654934465885,
        -0.05457967519760132,
        -0.03296027332544327,
        -0.05781164765357971,
        0.030629267916083336,
        -0.06167367845773697,
        -0.025066979229450226,
        -0.022904209792613983,
        0.02680392377078533,
        0.03535819426178932,
        -0.006678508594632149,
        0.0159875750541687,
        -0.007326188031584024,
        0.04104140028357506,
        0.006463645026087761,
        0.00022577479830943048,
        -0.07371094077825546,
        0.054977897554636,
        0.03147093206644058,
        -0.006159539334475994,
        0.0013529524439945817,
        -0.02537456527352333,
        -0.054487764835357666,
        -0.021591821685433388,
        -0.008874258026480675,
        0.011733368039131165,
        -0.003425267757847905,
        2.796505101368053e-33,
        0.08890759944915771,
        0.10564804822206497,
        -0.027511047199368477,
        -0.05110713839530945,
        0.001536269672214985,
        -0.0005292263231240213,
        0.060264699161052704,
        0.07558059692382812,
        -0.0964641273021698,
        -0.058068059384822845,
        -0.02762090601027012,
        -0.00863316934555769,
        -0.05301019176840782,
        0.014684897847473621,
        0.09787695854902267,
        0.022795844823122025,
        -0.030609391629695892,
        -0.033083248883485794,
        -0.0982295572757721,
        0.025361252948641777,
        -0.0263750609010458,
        -0.015841970220208168,
        0.00026688247453421354,
        0.03014354221522808,
        0.04231977090239525,
        0.08088070154190063,
        0.08079145848751068,
        0.021173572167754173,
        0.010090358555316925,
        0.0434923954308033,
        -0.10190438479185104,
        0.005973831284791231,
        -0.030163204297423363,
        0.015998758375644684,
        -0.058603156358003616,
        0.05793635919690132,
        -0.09530048072338104,
        0.018224816769361496,
        -0.06702283024787903,
        -0.018957657739520073,
        -0.05185911804437637,
        0.07108954340219498,
        0.01047230139374733,
        -0.004327469039708376,
        0.03258499130606651,
        -0.044785790145397186,
        -0.056283991783857346,
        0.052082326263189316,
        -0.0869244635105133,
        0.004941186401993036,
        -0.011894580908119678,
        -0.009043035097420216,
        -0.017358269542455673,
        -0.025148704648017883,
        -0.06787101924419403,
        0.04076559841632843,
        0.06516959518194199,
        -0.057896483689546585,
        0.02901703305542469,
        0.04646732658147812,
        0.08537324517965317,
        -0.03384460136294365,
        -0.07918846607208252,
        0.04279094934463501,
        0.015105714090168476,
        0.11284486949443817,
        0.05282427743077278,
        0.0022119085770100355,
        -0.029071567580103874,
        -0.028440523892641068,
        -0.011150515638291836,
        -0.00722283311188221,
        -0.025518011301755905,
        -0.0337260365486145,
        0.02793036960065365,
        -0.0042702327482402325,
        -0.02044668421149254,
        -0.05476661026477814,
        0.03071875311434269,
        0.06808768212795258,
        -0.09728129208087921,
        0.06396149098873138,
        0.08088848739862442,
        -0.030390053987503052,
        -0.06913448870182037,
        -0.028263641521334648,
        0.07769995927810669,
        -0.04926272854208946,
        -0.016787957400083542,
        0.017138902097940445,
        -0.004957773257046938,
        -0.11231493949890137,
        0.011780617758631706,
        -0.015162652358412743,
        -0.05856173858046532,
        -4.113202405005006e-33,
        -0.03163045644760132,
        -0.03166268765926361,
        0.03595471382141113,
        0.013040816411376,
        0.004610596690326929,
        -0.1306532323360443,
        0.05291084572672844,
        0.12437066435813904,
        0.006312219426035881,
        -0.05078718438744545,
        0.06449457257986069,
        0.043340303003787994,
        -0.0670352429151535,
        0.03695138171315193,
        -0.0257855411618948,
        -0.043826840817928314,
        -0.039761729538440704,
        -0.04239630326628685,
        0.008688070811331272,
        -0.004669015295803547,
        0.06446944177150726,
        0.04777098447084427,
        0.07168552279472351,
        0.06357309222221375,
        -0.05200712010264397,
        0.04165717214345932,
        0.04937729239463806,
        -0.09154488146305084,
        0.00285292393527925,
        -0.0218819472938776,
        0.018037592992186546,
        -0.010092544369399548,
        -0.010381883010268211,
        0.012128268368542194,
        0.07111292332410812,
        0.0554354265332222,
        -0.005454319063574076,
        -0.05702834948897362,
        0.012954000383615494,
        0.007946349680423737,
        0.06785725057125092,
        0.0770406723022461,
        -0.0036862308625131845,
        -0.08284109830856323,
        -0.013316367752850056,
        -0.06619443744421005,
        -0.002350525464862585,
        -0.025561388581991196,
        -0.011909783817827702,
        0.016774429008364677,
        0.06167549267411232,
        0.06862121820449829,
        -0.04737205430865288,
        0.06955952197313309,
        -0.01541939377784729,
        -0.04495978727936745,
        -0.038167886435985565,
        -0.017132455483078957,
        -0.03691534698009491,
        -0.016856340691447258,
        0.03370270878076553,
        0.036448609083890915,
        -0.07400635629892349,
        0.048079151660203934,
        -0.03145956993103027,
        -0.0068449885584414005,
        0.08102443069219589,
        0.048114579170942307,
        0.007722096983343363,
        0.03180921822786331,
        0.06690351665019989,
        -0.008903011679649353,
        -0.04528742656111717,
        -0.022504758089780807,
        0.03100331500172615,
        -0.015680694952607155,
        -0.09804265201091766,
        0.05399801954627037,
        -0.03011680394411087,
        0.02777993492782116,
        0.03210345655679703,
        -0.05900602787733078,
        0.01888548582792282,
        0.06235743314027786,
        0.024729151278734207,
        -0.08527126908302307,
        -0.017634307965636253,
        0.022348973900079727,
        0.0005178792052902281,
        0.02018672414124012,
        -0.06394228339195251,
        -0.012844777666032314,
        -0.09739275276660919,
        0.06799381971359253,
        -0.0017412361921742558,
        -4.7148429160870364e-08,
        0.005730734672397375,
        0.056799329817295074,
        0.010434714145958424,
        0.051476284861564636,
        -0.022825798019766808,
        -0.07699457556009293,
        0.016840346157550812,
        -0.05141006037592888,
        0.09831709414720535,
        -0.04936833307147026,
        -0.046264853328466415,
        -0.07077203691005707,
        -0.034531865268945694,
        0.036377351731061935,
        -0.11681720614433289,
        0.10778432339429855,
        -0.01893875002861023,
        0.03430109843611717,
        0.010264619253575802,
        0.007368492893874645,
        -0.05571845918893814,
        0.008083470165729523,
        0.02950625866651535,
        -0.007315930910408497,
        -0.04257044196128845,
        0.06238527595996857,
        -0.11390034854412079,
        -0.04383835569024086,
        0.03670276328921318,
        0.03130561485886574,
        -0.03167682886123657,
        -0.01084432564675808,
        -0.028198303654789925,
        -0.006226944271475077,
        0.010162388905882835,
        -0.012213044799864292,
        -0.024209648370742798,
        0.006880712695419788,
        0.06871803104877472,
        0.0726948231458664,
        -0.007755907718092203,
        -0.08422708511352539,
        0.023603640496730804,
        0.041413646191358566,
        0.06318870931863785,
        -0.1121675968170166,
        0.05484369024634361,
        -0.1565881073474884,
        -0.08782222121953964,
        0.013536589220166206,
        -0.012745365500450134,
        -0.005105192773044109,
        -0.04226844385266304,
        -0.04909877851605415,
        -0.03545497730374336,
        -0.001957087079063058,
        0.10166700929403305,
        -0.013448698446154594,
        -0.013784077018499374,
        0.01387072168290615,
        0.07264764606952667,
        -0.115804024040699,
        0.08144553005695343,
        0.09454702585935593
    ]
}