{
    "id": "aXjlOswxcfo",
    "title": "Cardieo Smartwatch is a SCAM! (Here's Why) - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2020-12-03T19:00:09Z",
    "video_url": "https://www.youtube.com/watch?v=aXjlOswxcfo",
    "category": "Science & Technology",
    "tags": [
        "Cardieo Smartwatch is a SCAM! (Here's Why) - Krazy Ken's Tech Talk",
        "Cardieo",
        "Cardieo Watch",
        "MaxWatch",
        "Apple Watch",
        "Apple Watch Knock-Off",
        "Cardieo Scam",
        "Apple",
        "watchOS",
        "False Advertising",
        "Scam",
        "Tech",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer Clan",
        "Apple Watch Scam",
        "Cardieo smart watch",
        "Cardieo watch reviews",
        "cardio smart watch reviews"
    ],
    "views": 618418,
    "likes": 20175,
    "comments_count": 1698,
    "description": "The $50 Cardieo smartwatch is said to be almost as \"good\" as a $300 Apple Watch. But do not be deceived. Cardieo's ads and website are full of false advertising. This product is a scam! Here's why  Watch more $CAM-BUSTING episodes   Download our epic wallpapers   Support our channel and get cool stuff   Subscribe for more tech videos!    Follow us on Twitter   Like us on Facebook    Krazy Ken's Tech Talk - Cardieo Smartwatch is a SCAM! (Here's Why)   Patrons got to see this episode early (and in much higher playback quality). They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program. #KrazyKen #ComputerClan",
    "description_links": [
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1riKzQK3dHt6c9_6D2lVwr78",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "http://subscribe.thecomputerclan.com",
        "http://twitter.com/thecomputerclan",
        "http://facebook.com/computerclan",
        "http://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "(clicking sound) - [Ken] Are you guys like doing this on purpose? Like, it just seems like you're putting up a bunch of like fake stuff on your website like... (upbeat music) Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken, and one thing I'd love to do on this tech channel is debunk knockoff tech and tech scams. And today is no different. I have received many many requests to look into the Cardieo smartwatch, and this is gonna be a good one. Pro-tip guys in case the marketing department is watching. If you're gonna market this as a health gadget, I highly recommend not putting the word die in your name. So how good is this thing? Well, I'll take a look at that soon, but I usually like to dive into the company a bit more before we dive into the product itself, because I've seen some fishy stuff going on. So, if you're ready and I know you are, let's dive in. I was sent the screenshot of a Cardieo ad, and wow, would you look at that? The watches they're using as their own product look exactly like Apple Watches and that's because they are Apple Watches. The biggest giveaway is the edge to edge display. If you look carefully, you'll see the display is rounded on the corners. Cheap products do not do that. They're just traditional square displays. They're not rounded in the corners. So that's the biggest giveaway you can see there. I also love how they say we invest in high quality components, not fancy ads. Well, really well, guess what? You probably save a lot of money on your advertising because you're just using Apple stuff. You're using their actual product and you're just stealing a bunch of other screenshots from them. Why? So sometimes when you look at these screenshots of Apple software, they'll manipulate them a little bit, so the colors look different. Even on the box they just shamelessly stole the Apple Watch home screen, and printed it right on the box. Oh, don't worry, we're just getting started. This is a Cardieo floating around YouTube. And if you needed a heaping pile of (beep) today this is the best place to go. - How can something that costs less than $50 match the quality of something that's $300? - [Krazy Ken] It can't. - [Advertiser] So this was the watch she introduced me to, it's called Cardieo. - [Krazy Ken] This is grade-A false advertising here. This is an Apple Watch, do not fall for their claims. I bought the Cardieo, so you don't have to. And look, the real product looks nothing like what they show in the video. But if we compare the ad to my Apple Watch, they look the same. - The reviews online were pretty good, but we all know they can be fake, so... - [Krazy Ken] Oh my gosh, the hypocrisy here just speaks for itself. I'm just. I'm just gonna go punch a door. (slamming sound) - I decided to do a side-by-side comparison to see how much of it is just hype. - Even when he claims it's a side-by-side comparison, it's still just two Apple Watches. Checkmate Cardieo, you're full of crap. Sadly, this is just the beginning. Now let's dive into their website. Their website has a terrible user experience. It's riddled with more false advertising and fake scarcity pop-ups and banners. I also received one of those spin to win gizmos when I went to the website. That stuff is just total crap. Sure you might get a discount sometimes, but it's really just there to try to squeeze your contact info out of you. But everything else aside, the big claim on their website that really set me off, was that they get better battery life with their watch compared to a $400 smartwatch. Now, I kinda wanna make some claims back at you. And what I mean by that is I'm gonna dissect all of your crap and show consumers all of the lies you are spewing their direction. But also I do wanna thank you, Cardieo, you actually saved me some time on one of these arguments. Because on your website you do say you get 10 hours of battery life, that's not that impressive. That's not better than the Apple Watch at all, so you debunked your own thing. Congratulations. Oh, but wait, it gets even more confusing because your product video says 10 days. Day, hours, which is it? So despite how good the battery life actually is that doesn't hide the fact that it's still a knockoff product, it can be very deceitful to people. People who don't know tech very well may get one thinking it's an Apple Watch, 'cause it looks like an Apple Watch. Let's dive into some more of the outrageous claims on this website. But before we get to that, I just wanna say, the charging method they show here, this is inductive charging all of Apple. This method looks a lot like how Apple's charger works. But that's not the type of charge that you get with this product at all. The product you get is this cradle, completely different. So to start Cardieo claims to be the number one selling watch of 2020. Yeah, sure. And they also claim to have been featured on websites like GIZMODO. Well, I ran a simple search and found nothing linking GIZMODO to Cardieo with the Google machine. But when doing the search, I did find Quora post, asking if Cardieo is a scam. And I also love how they made fun of other look-alike watches. Oh, the irony is delicious. Every other look-alike smartwatches is cheap, Chinese-made garbage. Made in China. Oops! Their website also claims this piece of junk has an OLED display. A lot of times terms like OLED or, you know HDR are kind of misused or just straight up abused and it can trick consumers. Here's what OLED is. OLED stands for organic light-emitting diode. Each pixel on an OLED display is individually lit. Meaning if a pixel needs to display black the light in that pixel turns off completely, meaning the black is really black. On an LCD, liquid crystal display, which is what you traditionally see, there's usually one back light or multiple smaller back lights that shine through the pixels. Which means black doesn't really show up as black, it shows up as really dark gray. So if you'd take this cheap watch and look at it I can see the black doesn't look black. It looks like dark gray, especially if you go in a dark room or something. Go in your bathroom and turn off all the lights, look at the screen. If nothing shows up black, just really dark gray that means it's not an OLED display, and you've been lied to. So, don't worry, I'm gonna give these guys a call. I'm gonna ask them why they have so many outrageous claims on their website. I can't wait to hear what their excuses are gonna be. As I keep going through the website, I just keep seeing more stolen screenshots from Apple. More stolen screenshots, more, more. More. We haven't even hit my favorite part yet. My favorite part of the website is this product video. - [Reporter] Introducing Cardieo. It tells time. - Yeah, thanks for that. Oh, it's IP68 rated. So I could swim with this, right. Well, we'll try that out later. GPS Integration. Yeah, I don't think so. I navigated through the home screen like a thousand times just to make sure I did not miss anything. There is not a single navigation app built into this thing. Maybe there's a third party one, but what kind of $50 cheap product from a brand you've never heard of is actually gonna have features like GPS. So, I don't think that's in there. There's no software to show that and to make things even worse, they're just showing a screen recording of Apple's map software, running on the watch. And at the end they show a 3D rendering of the product but it's not the smartwatch at all. It looks like an Apple Watch. The backside of it looks just like how an Apple Watch looks. It doesn't look anything like what you actually get when you buy it. So, more deceiving images. No matter what they advertise, I went ahead and bought one anyway. Hey I know what I'm getting myself into. I hope. Like the other scan products I've covered on the show, the checkout process is riddled with fake scarcity timers, low stock warnings, and other cluttery click baity crap. Oh, and of course we can't forget the upsells where they try to make you buy even more stuff during the checkout process. And, I'll admit, I must not have been paying attention because I accidentally clicked the big green button when I was checking out and accidentally got upsold (laughs happily) and bought Pulsar Buds (laughs happily). These are fricking' AirPods knockoffs. Just be careful with that stuff. So finally, after all that stuff the order was complete and a Cardieo credit. It actually arrived really quick. I think it was under two weeks. So now we come to the product itself. What's it like? Well, I will say it is way better than the MaxWatch. That was another knockoff I covered, check out that episode if you haven't seen it yet, it was fun. And that watch was 50 bucks as well. This I would say is like two to three times better than that for the same price. So, let's have a look. To start the charging method for the Cardieo watch is much more convenient than MaxWatch. You don't need to strip the band off to charge it. It just uses this little cradle. Also, it actually has a touch screen which can handle basic swipes and taps. The MaxWatch didn't even have a touch screen at all. Everything was controlled through a touch sensitive button, super tedious. Also it does have a side button for sleep and wake, and a crown, which acts as a home button. Again, things the MaxWatch didn't have. The crown also spins, but it doesn't do anything. The graphics look about the same as on the MaxWatch and they perform poorly with lots of tearing and very low frame rates. But at least the displays a little bit cleaner looking, it's not as speckly as the MaxWatch display. I was also amused by the watch faces. It looks like they really tried replicating some Apple Watch faces closely. The default face was actually set to the solar dial which kinda threw me for a loop because that was the watch face I had set on my legit Apple Watch, spooky. And the watch band feels much more comfortable and less rigid than the crummy Max Watch band. However, I could not find any way to snap the band in place. It just kinda feels like it holds itself in with friction, but it's cheap, so whatever. So in short, it's better than the MaxWatch for the same price, but it's definitely no Apple Watch. Don't be deceived by it though, 'cause it can look like one depending on what ad you see. So overall, I still stick to my recommendation from earlier. If you wanna get into smart watches, just go on eBay spend a little more money and get an older used Apple Watch. Even though it's older, you're still gonna get superior build quality and way more features than with a newer knockoff product. And I know because I have a 1st gen Apple Watch, and it works great and has way more functionality than this newer $50 piece of junk. Now let's get Cardieo on the phone and see what they have to say about these ridiculous false advertising claims. - [Jack] Hi, thank you for calling customer service, this is Jaaack? May I have your ZIP code please- ...how can I help you today Ken? - [Krazy Ken] So it doesn't look anything like what's on the website. Do you have any idea why that's the case? - [Jack] Okay I understand that, I'm really sorry for the inconvenience cost you. Now basically as for the information provided to us the watch. We are aware of the issue and I've looked at the watch as well. It does seem to be a bit different from what is advertised because of visual representation and the use of graphical effects and things like that on the advertising video. However, the watch does have all the features that are mentioned on the website. So from that side, you should be good to go. - [Krazy Ken] Okay well the website says like, for example like the website says it has an OLED display but I have it in my hand and like, this is not an OLED display. - [Jack] Just give me a moment, please, lemme just double check that. Because as for the information provided to us this is supposed to be an LCD touch screen not an OLED displayed. Lemme just double check this with the website so it can have this forwarded to the relevant team. - [Krazy Ken] The other thing I saw, like there was this product video on the website. And the other thing I saw it mentioned was it had GPS integration, but there's no GPS functionality on this watch at all. There's not even a maps application. So why would the website say there's GPS integration if there's no actual GPS integration in the watch itself. - [Jack] Again I'm just going to the website again on this. Basically initially we did have a product with a full GPS integration and a better screen on that as well. But because of some other technical issues we did have to discontinue that and the product itself was changed. - [Krazy Ken] Are you guys like doing this on purpose? Like, it just seems like you're putting up a bunch of like fake stuff on your website, like... - [Jake] As for that (inaudible) basically, as I said this is just something that needs to be updated on the website because yes by, by advertising these features you can get a lot of orders but the website also offers a 60-day money-back guarantee. - [Krazy Ken] I had one more question. It does say it's IP68 rated so I could swim with it but I haven't tested that yet. So let's just say, theoretically, I swim with it and it you know, it breaks, could I still return it if it's water damaged? - [Jack] As for that you can return it. However, on the manual of the watch, it is mentioned, we do recommend the customers to avoid unnecessary water contact with it actually. - I have a longer recording on my Patreon. The call went on for about 15 minutes. So if you want the full length recording go ahead and check that out. So it seems like there's a lot of contradictions going on here. I'm interested to see if their website actually gets updated or not, with all the feedback of their forwarding to the marketing people. At least they were upfront about the money back guarantee. So it's not like they were trying to keep my money. Okay, so now the IP68 waterproof test. It is weird that they claim you can swim with it, but according to the guy on the phone the manual says you shouldn't, that's so dumb. Anyway, I dropped the Cardieo into my bathtub and let it sit for about 10 minutes. I checked it a few minutes in just to make sure it was working, and it looked like it was. I let it sit in the water for a few more minutes and then I tested it again and it actually still functioned. But later I did notice half of the screen looked dimmer after it was in the water. And after sitting overnight, I noticed the battery was suddenly dead and a bubble formed under the display. So not waterproof at all. - [Advertiser] Surprisingly it's IP68 waterproof. So swimming or showering with it on, did not fry the circuit. (duck quack) - So another knockoff product bites the dust. But ultimately throughout these episodes, what I try to do is well, one I just hope you find them fun to watch. But two, I try to nurture your (beep) detectors. Hopefully you can see these scams now and try to detect them a little bit more and protect yourself and protect your friends from all of this knockoff stuff. 'Cause marketing can be very deceitful. Marketing is the most powerful thing. It doesn't matter how good or bad the product is, it's the marketing that's gonna sell it. And I'm not saying every product is bad. There's some good stuff out there from brands you've never heard of. But I'm just saying, if you see something that makes you go \"Wow, I must have this.\" Or, \"Wow, I got to share this with a friend.\" and it's from a company you've never heard of before. Just do some double checking before you hit that buy button. So thanks to all the awesome viewers who recommended this product, I loved looking into it. And coming up next I have an iPhone 12 Pro Max clone that I'm gonna take a look at, and a WiFi booster that was created by a quantum physicist. This is gonna be fun. So make sure you're subscribed and stay tuned for that. And there's other cool tech stuff coming soon too. So, plenty of things for everybody. And if you have any other knockoff or scam tech suggestions for me, feel free to just tweet me @thecomputerclan or you can send me a DM, that's cool too. And if you wanna help fund the future of the Computer Clan, plus get some awesome perks along the way, feel free to pledge to my Patreon. Thanks in advance for your support. And hey, if you liked this episode, you know what to do. Thanks for sticking with me. Catch the crazy and pass it on. (upbeat music)",
    "transcript_keywords": [
        "Apple Watch",
        "Watch",
        "Apple",
        "website",
        "Cardieo",
        "product",
        "Apple Watches",
        "OLED display",
        "Apple Watch faces",
        "Apple Watch home",
        "OLED",
        "legit Apple Watch",
        "gen Apple Watch",
        "display",
        "Cardieo watch",
        "stuff",
        "GPS Integration",
        "GPS",
        "claims",
        "screen"
    ],
    "transcript_entity_values": [
        "10 hours",
        "Ken",
        "Cardieo",
        "2020",
        "300",
        "a few minutes",
        "a few more minutes",
        "third",
        "half",
        "YouTube",
        "Apple Watches",
        "gen Apple Watch",
        "an Apple Watch",
        "two",
        "Apple",
        "GPS Integration",
        "Chinese",
        "China",
        "eBay",
        "50 bucks",
        "1st",
        "Quora",
        "about 10 minutes",
        "Apple Watches",
        "60-day",
        "Patreon",
        "less than $50",
        "today",
        "LCD",
        "Krazy Ken",
        "about 15 minutes",
        "Jaaack",
        "MaxWatch",
        "12",
        "Google",
        "Pulsar Buds",
        "one",
        "Max",
        "thousand",
        "under two weeks",
        "Max Watch",
        "the Apple Watch",
        "GIZMODO",
        "two to three",
        "Apple Watch",
        "hours",
        "no Apple Watch",
        "400",
        "10 days",
        "the Computer Clan",
        "Cardieo",
        "50"
    ],
    "transcript_entity_types": [
        "TIME",
        "PERSON",
        "PRODUCT",
        "DATE",
        "MONEY",
        "TIME",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "GPE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "GPE",
        "ORG",
        "MONEY",
        "ORDINAL",
        "PERSON",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "TIME",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "MONEY"
    ],
    "vector": [
        -0.09785177558660507,
        -0.033337559551000595,
        0.020433569326996803,
        -0.08315712213516235,
        0.06809420138597488,
        0.039476681500673294,
        0.08836743980646133,
        -0.021589666604995728,
        -0.007630762178450823,
        -0.03261944651603699,
        -0.012934703379869461,
        0.02094174176454544,
        -0.03727337345480919,
        -0.03574921563267708,
        0.010756395757198334,
        -0.05357261747121811,
        0.12259981036186218,
        -0.0515606552362442,
        -0.02857435867190361,
        0.03859933093190193,
        0.007069994229823351,
        -0.12421458214521408,
        0.0697537213563919,
        0.041576508432626724,
        0.02233666367828846,
        -0.03834770619869232,
        -0.027267277240753174,
        -0.00042472794302739203,
        -0.04719671979546547,
        0.011385342106223106,
        0.008001133799552917,
        0.043609701097011566,
        0.06295628845691681,
        0.002454252215102315,
        0.006120279431343079,
        -0.08869850635528564,
        0.011323835700750351,
        -0.013474076986312866,
        -0.12595076858997345,
        -0.005503687541931868,
        0.011677456088364124,
        0.012170787900686264,
        -0.06648876518011093,
        0.035076625645160675,
        0.029276521876454353,
        0.007504535838961601,
        0.05374931916594505,
        -0.015360995195806026,
        0.06028986722230911,
        0.03552485629916191,
        -0.07542715966701508,
        -0.07579220831394196,
        0.06066858395934105,
        -0.06975401937961578,
        -0.049619149416685104,
        -0.027232905849814415,
        0.012167883105576038,
        -0.07933742552995682,
        0.1237306147813797,
        -0.015472155064344406,
        0.0635158121585846,
        -0.07089581340551376,
        -0.013328717090189457,
        0.06464842706918716,
        -0.014744234271347523,
        -0.046656519174575806,
        0.00910498108714819,
        0.10188717395067215,
        0.02746371552348137,
        -0.07233716547489166,
        0.025403035804629326,
        0.005024923011660576,
        0.10645546764135361,
        0.0673307329416275,
        0.01754903234541416,
        0.06084560230374336,
        0.04735781252384186,
        -0.10637868940830231,
        0.045154787600040436,
        -0.06536799669265747,
        -0.04050825163722038,
        -0.07452884316444397,
        -0.003978173714131117,
        -0.024185549467802048,
        0.05516098439693451,
        -0.00037704638089053333,
        0.006117192562669516,
        -0.05555706471204758,
        -0.00628785090520978,
        -0.050256237387657166,
        -0.0034498784225434065,
        0.056135356426239014,
        0.04312628135085106,
        -0.05595836788415909,
        0.003186786314472556,
        -0.017909478396177292,
        0.0004340449522715062,
        -0.06076207384467125,
        -0.05484018847346306,
        0.04611913487315178,
        -0.02245624177157879,
        0.034867770969867706,
        0.02621806412935257,
        -0.0694451555609703,
        0.05561933293938637,
        -0.052480511367321014,
        0.025616178289055824,
        0.08303827047348022,
        0.10676943510770798,
        0.11008942872285843,
        0.00011204753536731005,
        0.012892572209239006,
        -0.026643184944987297,
        -0.025022370740771294,
        0.07020372897386551,
        0.12894965708255768,
        -0.08492708951234818,
        0.07009049504995346,
        0.1038837656378746,
        0.012889404781162739,
        0.11218206584453583,
        -0.004193785134702921,
        -0.013759206980466843,
        0.0007989274454303086,
        0.037942323833703995,
        -0.020896827802062035,
        -0.014391214586794376,
        3.9212272797844334e-33,
        -0.02711469680070877,
        0.07747406512498856,
        -0.006786874495446682,
        -0.036603640764951706,
        0.01847769133746624,
        -0.06293725222349167,
        -0.04923856258392334,
        0.02217850089073181,
        -0.035130251199007034,
        0.05955158919095993,
        -0.03068414330482483,
        0.008970992639660835,
        -0.03801024705171585,
        0.058358289301395416,
        -0.024404551833868027,
        -0.04343146085739136,
        -0.12192991375923157,
        -0.030012911185622215,
        0.029982876032590866,
        0.0584108866751194,
        0.04244387149810791,
        -0.060900863260030746,
        0.002279283246025443,
        -0.011508017778396606,
        -0.051008373498916626,
        0.04494750127196312,
        -0.03788349777460098,
        -0.04623499512672424,
        0.13558806478977203,
        0.044476959854364395,
        -0.07784218341112137,
        -0.027447113767266273,
        0.07354436814785004,
        -0.04916185140609741,
        -0.04482598230242729,
        -0.047781746834516525,
        -0.03154716640710831,
        -0.08046791702508926,
        0.010963257402181625,
        0.03079628013074398,
        -0.06638779491186142,
        -0.031782615929841995,
        -0.08148990571498871,
        -0.09042979776859283,
        -0.009549952112138271,
        -0.010481485165655613,
        0.07479194551706314,
        -0.010030204430222511,
        0.025391489267349243,
        0.03840094804763794,
        -0.06372758746147156,
        -0.018102768808603287,
        -0.012899287045001984,
        -0.037947773933410645,
        -0.0581122450530529,
        -0.015013176947832108,
        0.018331781029701233,
        -0.0330202616751194,
        0.10675160586833954,
        -0.062055960297584534,
        0.03724495694041252,
        0.018283996731042862,
        0.060675643384456635,
        0.004841427784413099,
        -0.13066835701465607,
        0.025870561599731445,
        0.05183915048837662,
        0.023117251694202423,
        -0.12867121398448944,
        0.05190208554267883,
        -0.011392357759177685,
        0.014497606083750725,
        0.016936665400862694,
        -0.06058470904827118,
        -0.037186138331890106,
        0.006003485061228275,
        -0.02635955438017845,
        0.02734183333814144,
        -0.07222240418195724,
        0.022759346291422844,
        -0.010355213657021523,
        0.011481751687824726,
        0.04660225287079811,
        0.05579128861427307,
        0.030106941238045692,
        0.040611039847135544,
        0.016893582418560982,
        -0.031042465940117836,
        -0.048295579850673676,
        -0.007960183545947075,
        0.019607238471508026,
        0.022315651178359985,
        0.006127702072262764,
        0.03022010438144207,
        -0.031065870076417923,
        -4.659536547094696e-33,
        -0.0280583668500185,
        -0.017041362822055817,
        0.037996094673871994,
        -0.08922450989484787,
        0.04988032206892967,
        -0.05986505001783371,
        -0.028520556166768074,
        0.08679326623678207,
        0.057882700115442276,
        0.01633993536233902,
        0.004093301482498646,
        -0.0211995430290699,
        -0.11170805990695953,
        -0.02315664291381836,
        0.013273346237838268,
        -0.011951870284974575,
        0.037023209035396576,
        0.014281955547630787,
        -0.010872328653931618,
        -0.08630957454442978,
        0.0884065330028534,
        0.0040517570450901985,
        -0.0031378460116684437,
        0.04587622359395027,
        0.042448997497558594,
        -0.008285736665129662,
        0.021162046119570732,
        0.07918012887239456,
        0.07258832454681396,
        -0.008448461070656776,
        0.0325801707804203,
        -0.021236104890704155,
        -0.06489592790603638,
        0.04096680134534836,
        0.023076215758919716,
        0.06251073628664017,
        0.038387615233659744,
        0.012555352412164211,
        -0.05088616907596588,
        -0.004709743894636631,
        0.08074934780597687,
        0.028799908235669136,
        -0.01352663617581129,
        -0.0038927653804421425,
        -0.020611364394426346,
        -0.015758955851197243,
        -0.014036943204700947,
        0.026091590523719788,
        -0.004279055166989565,
        -0.01480574905872345,
        -0.0008514178916811943,
        -0.03306976705789566,
        0.02943771332502365,
        -0.05941370502114296,
        -0.11949306726455688,
        0.08293672651052475,
        0.037972342222929,
        0.12471596151590347,
        -0.03144008666276932,
        -0.039091452956199646,
        -0.02112302929162979,
        -0.04039981961250305,
        -0.03740066662430763,
        -0.04619341716170311,
        0.022091783583164215,
        0.08303619921207428,
        0.09203501045703888,
        0.05516054108738899,
        -0.03201264888048172,
        -0.006137133575975895,
        0.032341234385967255,
        0.06712839007377625,
        -0.08822169899940491,
        -0.039356790482997894,
        -0.028063319623470306,
        0.09356581419706345,
        0.03266499191522598,
        -0.010974213480949402,
        -0.030351582914590836,
        -0.058382343500852585,
        0.04621613398194313,
        0.008035584352910519,
        0.10178466141223907,
        0.0016059863846749067,
        0.05078992247581482,
        0.06358958035707474,
        -0.0007634976645931602,
        -0.0022099146153777838,
        -0.061332639306783676,
        0.027662115171551704,
        -0.018205074593424797,
        -0.027002276852726936,
        0.03886350244283676,
        0.06776099652051926,
        -0.0016595548950135708,
        -5.064672592425268e-08,
        0.00898410938680172,
        0.029966790229082108,
        0.025105450302362442,
        -0.040237750858068466,
        -0.005834468174725771,
        -0.08952938765287399,
        -0.031409576535224915,
        -0.011246169917285442,
        0.004919392056763172,
        -0.04675779491662979,
        0.06908678263425827,
        -0.030952557921409607,
        -0.0801718607544899,
        0.004563883878290653,
        0.039585184305906296,
        -0.050230689346790314,
        -0.08939337730407715,
        0.06632304191589355,
        -0.04241672903299332,
        -0.01355528924614191,
        0.03720739111304283,
        -0.005843660794198513,
        0.0664772093296051,
        -0.0619875006377697,
        -0.022231334820389748,
        0.034611355513334274,
        0.016265125945210457,
        0.0315980389714241,
        0.04237707704305649,
        -0.04565774276852608,
        -0.04863118752837181,
        0.003550480352714658,
        -0.03263038024306297,
        0.014590928331017494,
        0.032253824174404144,
        -0.08936795592308044,
        -0.09895751625299454,
        -0.002226636977866292,
        0.006731451954692602,
        0.07330549508333206,
        -0.004042438231408596,
        -0.12107864767313004,
        0.03962904214859009,
        -0.002846230287104845,
        -0.025364115834236145,
        0.002035834826529026,
        -0.029270483180880547,
        -0.08857813477516174,
        0.09966880083084106,
        -0.02178271673619747,
        -0.03222767636179924,
        -0.029611961916089058,
        0.00051256048027426,
        0.019338510930538177,
        0.010404775850474834,
        -0.01755152828991413,
        0.026244571432471275,
        -0.013950526714324951,
        0.012341918423771858,
        0.06563680619001389,
        0.05588553473353386,
        -0.032211314886808395,
        -0.02576257660984993,
        0.03928695246577263
    ]
}