{
    "id": "AxV0_1Y4zl0",
    "title": "Asus Zenfone 9: The New Compact King!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-08-01T22:23:11Z",
    "video_url": "https://www.youtube.com/watch?v=AxV0_1Y4zl0",
    "category": "Science & Technology",
    "tags": [
        "Asus Zenfone",
        "Zenfone 9",
        "compact phone",
        "small phone",
        "best small phone",
        "MKBHD",
        "Zenfone 9 review"
    ],
    "views": 3868229,
    "likes": 141546,
    "comments_count": 7467,
    "description": "Most underrated phone of the year so far. Love this thing.  MKBHD Merch:   Tech I'm using right now:   Intro Track: Jordyn Edmonds:  Playlist of MKBHD Intro music:   Phone provided by Asus for review.  ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://lnk.to/jordynedmonds",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - Hey, what's up? MKBHD here. So if you're one of those people who has ever thought, \"Wow, it seems like all the phones coming out these days \"look and feel the same,\" well, this one's for you. Because this is one of the most contrarian, against-the-grain set of features I've seen in a new phone in a long time. So this is the Asus Zenfone 9. And the more you look around this phone, the more you see it's just not like very many other phones. First of all, flagship phones these days are getting bigger and bigger than ever, we know this. This phone is actually refreshingly compact. It has slightly bigger bezels, but those are around a 5.9-inch display. So maybe not mini, but pretty close, and that translates to so many little things. Just feeling smaller in the pocket. Smaller in the hand, obviously. Reachability of the whole display is easier. It's great. And then you already know most flagships these days are working with glass. They're usually pretty shiny and glossy backs. This one is plastic, but it is a sort of a nice, textured, softer touch plastic back. It's not quite the rough sandstone of the classic OnePlus phones, but it is somewhere in between. It's got a little more grip, which, combined with the flat aluminum sides of this phone are quite nice to hold. Plus, it has all these little design cues. The little notch cut-out around the metal of the power button, the little bits of text on the back of the phone. Not full-on ROG Phone levels of text, but it is something. And the notch cut out around... What is that? Oh, yes. A headphone jack. Yet another piece of this phone that you just don't see very often in many new phones out there. Plus, just when's the last time you saw red phone? The only thing I don't like about this design might just be that the size of the camera bumps makes the whole thing rock when it's flat on a table, but we'll get to those cameras in a second. A lot of phones have been moving their fingerprint readers to underneath the display, which, fair, they've gotten pretty good lately, maybe haven't improved that much in the last year or two. Asus said, \"You know what? \"We're gonna take this power button \"and we're gonna double it as our fingerprint reader. \"But not only that, we're gonna have it triple \"as a smart key so you can customize both a double press \"and a long press to start a quick action. You can start Google Assistant with it or open literally whatever app you want. \"And then not only that, we're also gonna have it \"quadruple has a reachability hack, \"where you can swipe the button down \"to pull the notification shade down at any time, anywhere, \"from any screen,\" just like Samsung did back in the day with the Galaxy S10e, I think it was. And Asus has really gone the extra mile just to make sure you can reach everything on the phone with one hand. They've also got a little edge tool to let you quickly launch apps with your thumb from the side. What else do most normal flagship phones have these days? I think you could argue a pretty heavily customized software experience is pretty common. I'm happy to report though that Asus is taking the opposite approach with a fairly lightweight, just couple of additions on top of nearly stock Android. So ZenUI, which is what it's called, just adds a couple things here and there, and it's doing wonders for this phone. First of all, for performance, I mean, there's no real bloatware here. Things are pretty light. This phone also has 120Hz display and combined with the top-of-the-line Snapdragon 8+ Gen 1, and eight to 16 gigs of RAM, things have been very smooth pretty much all the time, which is awesome. And for usability, they just find a couple places to tuck some extra features into the settings, around the Material You elements that are smart, like little thoughtful additions here and there. I like that they lifted the display animation speeds that are usually buried in developer settings, and just put it right into the display settings. The always-on display you can customize a little bit to look differently. And they put a bunch of stuff in the advanced section, including mapping a double back tap to a custom action or a custom one-handed mode for even better reachability. And actually, one of my favorites, you can super easily customize which camera modes show up at the bottom, so you aren't always scrolling around looking for the option you want, no matter which one it is. So then, battery life. Yo, let me talk to you about the battery life on this phone. So typically, on a smaller phone, especially a small flagship phone, that's one of the weakest parts of the phone. Which makes perfect sense. There's a lot going on in a small space so there's not a lot of room for much battery. This Zenfone 9 has a 4,300mAh battery, which is pretty big for the small size of this phone. And when I put my SIM card in it, honestly, I was expecting about the status quo. You know, I set the 120Hz refresh rate 'cause that's what I'm into, and I got way, way more than I was expecting. This phone actually has seriously incredible battery life. It sips power. Turns out this is actually a really good phone to put the Snapdragon 8+ Gen 1 in because not only is it more powerful at the highest end but it's also more efficient than the previous chip. So great standby time. And a lot of quick bursty stuff is handled no problem. But I was having heavy days of using a lot of high-brightness screen-on time, navigation, playing some games, just doing a bunch of stuff that typically drains phones, and it just lasted for a long time. I was having seven-plus hour screen-on time days and ending with 10, 20% left. Really great battery on this phone. And hey, while we're at things that punch above their weight class, the cameras back here. The cameras are probably better than what you're expecting. Now, the main sensor here is actually the same one that was in the Nothing Phone and the ROG Phone 6, both of which took B to B-plus quality photos at best and were a noticeable step behind the flagships in pretty much every way. So same chip in here, but two things are different. One, they put this entire sensor in this huge six-axis hybrid gimbal stabilization setup. And two, we know a lot of what makes a good smartphone camera these days, is software. So the Zenfone 9 takes photos that look very different from, say, the ROG Phone, which, actually, Asus also makes, or the Nothing Phone. Basically, if you've watched my blind smartphone camera tests in the past, this statement won't shock you, but the Zenfone 9 has the closest look of a Pixel phone of any non-Pixel camera. So a typical Zenfone 9 photo is very bold and contrasty, and saturated. So straight off the rip, it's pretty nice. If anything, it can have the tendency to go over the top and really over-process and over-HDR things, that looks kind of harsh and you can really see that in higher dynamic range situations. But the extra stabilization does help, not just for video but also for taking less noisy photos in the dark, at least on the main camera. It's still not freezing moving subjects very well 'cause you need a fast shutter speed and a bigger sensor to do that reliably. But out of all the phones with this sensor, I think this one looks the best. The ultra-wide is also pretty consistent with color to match the main camera. So shout out to ASUS for their software processing in the Zenfone cameras over the years. Maybe pass some of that along to the ROG Phone team, you know? Maybe have a meeting or two. So I've said a lot of positive things about this phone. So I'm just gonna say one more, which is I think the price is really good. It starts at 699, which, actually, when I first started... I put my SIM card in this phone two weeks ago, didn't really know much about it, and I hadn't been told the price yet, and I would've guessed higher than that. It kind of reminds me of when Pixel 5 came out, and it was the best Pixel at the time, but it was a Snapdragon 7 series, and it was 90Hz, and we were hoping for like a full flagship Pixel. This feels like a Pixel 5 Pro, two years later. It's got the highest-end chip. It's got a nice screen. An incredible battery life. Not a whole lot of downside. I'm gonna say, actually, this phone, at this price, is my favorite release this year. I am very impressed with it. Now, it's not perfect. And we already know no phone is perfect. It's got a few key trade-offs. And so I'm gonna nitpick 'cause that's what I have to do, but here's what's wrong with this phone. So battery life is incredible like I said, but the max charging speed, 30 watts, that's decent, but there is no wireless charging. That's missing. Lots of people love reminding me that they don't really care about wireless charging. But, hey, almost every other phone at this price is gonna at least have the option. So that's something to note. And then this display that I was telling you about, it is definitely super responsive at 120Hz, with a 240Hz touch sample rate. But it is a slight step below the flagships visually. And it maxes out at 800 knits when not showing HDR content, which can get washed out in direct sunlight. Also, the corner cutout for the selfie camera has this little ring around it that might be a little more distracting than some people might like. Also, the speakers in small phones have never been great because physics, and these aren't really an exception. They're fine, but they're semi-easily blocked. And then probably the biggest thing I've noticed is this soft-touch red color is very cool and I really like it, but I am concerned about how this will wear. You can see the edges in the corners of mine are already starting to fade and turn darker, and that the Sunset Red color is slightly less vibrant than it was when I first got the phone. And this is only two weeks. I haven't really had the phone for that long. So while I haven't seen a phone with quite this finish of plastic before, I can't vouch for it aging well. Now, just to get ahead of the comments that I can already see you typing, yes, most people just put a case on their phone already by default. So it does actually come with this decidedly more plastic-feeling case in the box. But, yeah, I don't know. I feel like a phone that has a soft-touch plastic back shouldn't have to always have a case on it the way maybe a fragile glass one might. So, yeah, that's something to note. And then all of the power button features I was just telling you about, super... First of all, this is one of the fastest fingerprint readers in any phone. You just graze it for a second, and it unlocks. Super sensitive. But then the pull-down notification feature I was accidentally triggering all the time. It kind of got annoying. So I ended up turning it off because it was getting in the way. Kind of like on the S10e, I think I also had disabled it. So cool for a few days, then I turned it off. But, yeah, this power button, this is something. Sustainability note. This phone isn't particularly repairable, but it does come in 100% fully recyclable packaging. And it does come with the 30-watt charging brick. But yeah, as far as downsides, that's pretty much it. I think I can confidently say this is the most well-rounded compact phone in the world, if you can consider it compact. I think there's a lot of really great things about this phone and I'm very happy to keep using it. This is probably gonna end up extremely underrated in the US because you don't really see Zenfones in carrier stores, so most people don't end up buying these. But if you're looking around, shopping for a great compact Android phone around 700 bucks, don't even think twice. This is a great one to get. Yeah. Easy as that. Okay. That's pretty much it. Thanks for watching. Catch you guys in the next one. Peace. (upbeat music)",
    "transcript_keywords": [
        "phone",
        "phones",
        "ROG Phone",
        "pretty",
        "time",
        "things",
        "lot",
        "Zenfone",
        "camera",
        "days",
        "Asus",
        "flagship phones",
        "battery",
        "display",
        "Pixel",
        "put",
        "Pixel phone",
        "great",
        "battery life",
        "back"
    ],
    "transcript_entity_values": [
        "800",
        "the last year",
        "9",
        "the Nothing Phone",
        "one",
        "Zenfone",
        "Asus",
        "10, 20%",
        "30-watt",
        "the Nothing Phone",
        "240Hz",
        "One",
        "two years later",
        "the day",
        "S10e",
        "4,300mAh",
        "eight",
        "this year",
        "the years",
        "Android",
        "Pixel 5",
        "699",
        "the Asus Zenfone 9",
        "seven-plus hour",
        "first",
        "the Galaxy S10e",
        "Yo",
        "90Hz",
        "First",
        "the ROG Phone",
        "only two weeks",
        "OnePlus",
        "Google",
        "the Zenfone 9",
        "Pixel",
        "5.9-inch",
        "a few days",
        "Asus",
        "Zenfone 9",
        "ROG Phone",
        "120Hz",
        "second",
        "30 watts",
        "max",
        "US",
        "RAM",
        "six",
        "two weeks ago",
        "jack",
        "ASUS",
        "two",
        "100%",
        "Samsung",
        "these days"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "PERSON",
        "GPE",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.06824403256177902,
        0.035164475440979004,
        0.025100570172071457,
        0.01599903777241707,
        0.018293682485818863,
        0.041560035198926926,
        0.001840410172007978,
        0.13248133659362793,
        -0.006734314374625683,
        -0.036600060760974884,
        -0.014797156676650047,
        0.06994765251874924,
        -0.024000268429517746,
        -0.020181624218821526,
        -0.026209816336631775,
        -0.05185998976230621,
        0.13080242276191711,
        -0.10571109503507614,
        -0.025118829682469368,
        0.013495832681655884,
        -0.03153590112924576,
        -0.0206353347748518,
        0.01875952072441578,
        0.03217211365699768,
        0.017304424196481705,
        -0.011929054744541645,
        -0.0368572361767292,
        -0.029430411756038666,
        -0.026334425434470177,
        -0.08683642745018005,
        0.004103361628949642,
        0.15503008663654327,
        0.06585053354501724,
        0.04119051992893219,
        -0.038552504032850266,
        -0.0687781348824501,
        0.041641317307949066,
        0.021966049447655678,
        -0.042272862046957016,
        -0.04840691387653351,
        -0.04102589562535286,
        -0.002323681255802512,
        -0.036173854023218155,
        0.025943074375391006,
        -0.0399760976433754,
        -0.08683448284864426,
        0.030308641493320465,
        -0.08990456163883209,
        -0.060826729983091354,
        -0.06649835407733917,
        0.024584738537669182,
        -0.01992419920861721,
        -0.04542776569724083,
        -0.011235080659389496,
        -0.11874933540821075,
        0.04939098283648491,
        -0.04732665792107582,
        -0.03310105949640274,
        0.0708548054099083,
        0.016428163275122643,
        0.060606978833675385,
        -0.030604297295212746,
        0.00675989780575037,
        0.069768987596035,
        0.010590458288788795,
        -0.029203923419117928,
        -0.019723769277334213,
        -0.0954924076795578,
        -0.031020687893033028,
        0.031309641897678375,
        0.05764001980423927,
        0.06384656578302383,
        -0.002385301049798727,
        0.08120081573724747,
        0.007923035882413387,
        0.05676736682653427,
        0.030375028029084206,
        0.0005246431683190167,
        -0.03164547681808472,
        0.006856272928416729,
        0.026104306802153587,
        -0.008674051612615585,
        -0.007592560723423958,
        -0.050413828343153,
        0.04239194095134735,
        -0.029578350484371185,
        0.022120295092463493,
        0.032962799072265625,
        -0.06358284503221512,
        -0.08542151004076004,
        -0.0441352017223835,
        0.16075414419174194,
        -0.011428967118263245,
        -0.006587684620171785,
        -0.021702691912651062,
        -0.032708898186683655,
        0.012289908714592457,
        -0.04266985133290291,
        -0.05722469091415405,
        0.04499511793255806,
        0.06612866371870041,
        0.09063810855150223,
        0.0929785966873169,
        0.035371966660022736,
        0.03641624003648758,
        -0.0856250673532486,
        0.0015179142355918884,
        -0.04282794147729874,
        -0.04052354767918587,
        -0.029947344213724136,
        -0.04435199126601219,
        -0.03779324144124985,
        -0.06771313399076462,
        -0.06286917626857758,
        -0.006168188061565161,
        -0.033642858266830444,
        0.02971559762954712,
        0.042456913739442825,
        0.056024279445409775,
        0.053129833191633224,
        0.005537740420550108,
        -0.016273247078061104,
        -0.1118706539273262,
        -0.0539596863090992,
        0.01432144083082676,
        0.08843613415956497,
        -0.10507037490606308,
        4.4794030580907194e-33,
        0.015845416113734245,
        0.0849098190665245,
        -0.011753469705581665,
        0.00511590763926506,
        -0.008671307936310768,
        -0.043896179646253586,
        -0.014415849931538105,
        -0.008456548675894737,
        -0.013391976244747639,
        0.01109332125633955,
        -0.020561575889587402,
        -0.0036772240418940783,
        -0.010735752061009407,
        0.041865166276693344,
        0.09548787772655487,
        -0.0783812627196312,
        -0.07737700641155243,
        -0.001977924257516861,
        -0.025533970445394516,
        -0.03715641796588898,
        0.001229946850799024,
        0.03993469104170799,
        -0.0012641510693356395,
        -0.054356835782527924,
        0.07694169878959656,
        -0.023562807589769363,
        0.0777478963136673,
        -0.004382593557238579,
        -0.0060019479133188725,
        -0.004402496851980686,
        -0.07310852408409119,
        -0.06823237985372543,
        -0.01717427745461464,
        -0.03692261129617691,
        -0.02267005853354931,
        0.03849251940846443,
        -0.0291339959949255,
        -0.07488596439361572,
        0.02007412537932396,
        -0.11188700050115585,
        -0.08265376836061478,
        0.013817084021866322,
        -0.1316414326429367,
        0.005373598542064428,
        -0.003703970229253173,
        0.03993034362792969,
        0.040640104562044144,
        0.0033976268023252487,
        0.028527071699500084,
        -0.07150200754404068,
        -0.06519582122564316,
        -0.03371201828122139,
        -0.0059266467578709126,
        0.038522880524396896,
        0.026048453524708748,
        -0.017485475167632103,
        0.07169658690690994,
        -0.008141807280480862,
        0.05629860609769821,
        0.05960172414779663,
        0.07097427546977997,
        -0.07254555821418762,
        -0.06798858195543289,
        0.047037504613399506,
        0.009525985457003117,
        0.08304481953382492,
        -0.015480812638998032,
        0.011466175317764282,
        -0.04340830072760582,
        0.021216074004769325,
        0.003049049060791731,
        -0.013888276182115078,
        0.07560297846794128,
        -0.030972547829151154,
        0.10187714546918869,
        0.020684748888015747,
        0.06722141057252884,
        -0.03470877557992935,
        0.014462444931268692,
        -0.06251086294651031,
        0.022893637418746948,
        0.018676837906241417,
        0.012366409413516521,
        0.07408780604600906,
        -0.02137809991836548,
        0.007498046848922968,
        0.04608367756009102,
        -0.0438578762114048,
        -0.04066896438598633,
        0.08688445389270782,
        -0.011091737076640129,
        -0.0460878387093544,
        0.01086315419524908,
        0.01746470108628273,
        -0.017139166593551636,
        -4.944942902054501e-33,
        0.0004496209730859846,
        -0.053755100816488266,
        -0.036493487656116486,
        -0.03837532177567482,
        -0.022089581936597824,
        0.02169884741306305,
        0.07530466467142105,
        0.11700379103422165,
        -0.07010806351900101,
        -0.0909288078546524,
        0.03151162341237068,
        0.00954266544431448,
        0.016962120309472084,
        -0.033958740532398224,
        -0.002030549105256796,
        0.021922070533037186,
        0.07707878947257996,
        -0.1072615310549736,
        0.1586548388004303,
        0.04513993114233017,
        0.048352692276239395,
        0.04968352988362312,
        -0.060019560158252716,
        0.04806504398584366,
        -0.05590371787548065,
        -0.045416850596666336,
        -0.03073827549815178,
        0.01561047974973917,
        -0.04009973630309105,
        -0.008124156855046749,
        0.05330096185207367,
        -0.06318332254886627,
        -0.018569208681583405,
        0.025689758360385895,
        0.03639732673764229,
        0.025783002376556396,
        0.010105213150382042,
        -0.01642279140651226,
        -0.03188879415392876,
        -0.00036032916978001595,
        -0.014444280415773392,
        0.038953572511672974,
        0.051626645028591156,
        -0.040880560874938965,
        0.09203673154115677,
        -0.07221738994121552,
        -0.012683260254561901,
        0.014700986444950104,
        -0.06469663977622986,
        0.021230248734354973,
        0.020811649039387703,
        -0.06019157916307449,
        -0.060438740998506546,
        -0.008142194710671902,
        -0.06170511990785599,
        -0.01440590899437666,
        -0.03177228942513466,
        -0.07215719670057297,
        0.0189167782664299,
        0.012768397107720375,
        0.08800849318504333,
        0.01766042225062847,
        -0.04540164768695831,
        -0.09046199172735214,
        -0.06298595666885376,
        -0.0065003144554793835,
        0.031082075089216232,
        0.06083211302757263,
        -0.04165364056825638,
        -0.0075204744935035706,
        -0.06019896641373634,
        -0.08542173355817795,
        -0.026310566812753677,
        -0.030915923416614532,
        -0.0068788351491093636,
        -0.004583541303873062,
        -0.0066358186304569244,
        0.009710917249321938,
        -0.013202161528170109,
        0.028975356370210648,
        0.01911078207194805,
        0.041462887078523636,
        0.04784705862402916,
        -0.011410325765609741,
        0.08740434795618057,
        0.054291125386953354,
        0.0027829997707158327,
        0.0077741751447319984,
        0.02992362342774868,
        0.027517203241586685,
        0.019803453236818314,
        0.025097448378801346,
        -0.023507487028837204,
        0.055834006518125534,
        0.0015433802036568522,
        -5.301659911083334e-08,
        0.05618641525506973,
        -0.015382247976958752,
        0.06396347284317017,
        -0.020468326285481453,
        0.03510322794318199,
        -0.1371157020330429,
        0.05574308708310127,
        -0.06592807918787003,
        0.033642854541540146,
        0.05002737045288086,
        0.004806792829185724,
        -0.1233435794711113,
        -0.01813826523721218,
        0.08031496405601501,
        -0.007815576158463955,
        0.1019703820347786,
        -0.016621587797999382,
        0.04888800531625748,
        0.03169075399637222,
        0.028626639395952225,
        -0.025105200707912445,
        0.0579858236014843,
        0.083871029317379,
        -0.07702888548374176,
        0.0980258658528328,
        -0.0023311127442866564,
        -0.05384739115834236,
        -0.025275416672229767,
        0.08806551247835159,
        -0.03982468321919441,
        -0.029473211616277695,
        0.04695478826761246,
        0.003776140511035919,
        -0.023274511098861694,
        0.021755633875727654,
        -0.036310356110334396,
        0.05046405643224716,
        0.03711560368537903,
        0.07286853343248367,
        -0.011542600579559803,
        0.06052953377366066,
        -0.05773557722568512,
        -0.0061315312050282955,
        0.045732080936431885,
        0.008327499963343143,
        -0.047606587409973145,
        0.0019616938661783934,
        -0.0641024187207222,
        0.014575868844985962,
        0.05067385733127594,
        0.0017769956029951572,
        -0.009804883040487766,
        0.002689167857170105,
        -0.02155451849102974,
        0.10773726552724838,
        -0.049023088067770004,
        -0.009070806205272675,
        0.08863645792007446,
        -0.06224681809544563,
        0.028568826615810394,
        0.013509056530892849,
        -0.023924414068460464,
        0.011757014319300652,
        0.11032341420650482
    ]
}