{
    "id": "ayc6uZjy0vA",
    "title": "Wait. What ACTUALLY Happened to Animusic 3? - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2022-01-27T17:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=ayc6uZjy0vA",
    "category": "Science & Technology",
    "tags": [
        "Wait. What ACTUALLY Happened to Animusic 3? - Krazy Ken's Tech Talk",
        "Animusic",
        "Animusic 3",
        "MIDI",
        "3D Animation",
        "Animusic Studio",
        "Blender",
        "GarageBand",
        "DAW",
        "Digital Audio Workstation",
        "Mac",
        "PC",
        "Computer",
        "Windows",
        "Apple",
        "Microsoft",
        "Kickstarter",
        "Kickstarter Fail",
        "Wayne Lytle",
        "The Science Elf",
        "Music",
        "DVD",
        "VHS",
        "Synthesizer",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Tech",
        "Computer Clan"
    ],
    "views": 165013,
    "likes": 7460,
    "comments_count": 625,
    "description": "You can support this channel on Patreon! Link below Animusic was a groundbreaking blend of tech and art, with catchy music and stunning visuals that are still enjoyed today. But when the team promised a 3rd installment of their seriesand raised over $220,000 on Kickstarternothing happened. Why?  Check out our rare tech playlist   Watch our tech scam-busting episodes   Download our epic wallpapers   Support our channel and get cool stuff    Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord     Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Special thanks to Virtual and James for helping with this episode!    Watch the amazing Ambient Glow animation   Special thanks to the Animusic Directory    Some additional music tracks in this episode are from the Animusic video album. The music played during the \"community\" section is Ambient Glow by Lasers, Lights, and Music.  Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://bit.ly/clan3zlKXX9",
        "https://bit.ly/clan3o1EdZ2",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://www.youtube.com/VirtualTurtle",
        "https://www.youtube.com/iMacJames",
        "https://youtu.be/2wPGvGtJwHQ",
        "https://www.animdirectory.com",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Animusic has amused millions with its innovative blend of technology and art. But whether or not you've seen it before, one thing none of us have seen is the Animusic 3 album. Over nine years and $220,000 later, we still don't have a final product. So let's take a look at these guys. (upbeat electronic music) Hey, guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken. And Animusic has been on my mind lately, and apparently it was on The Science Elf's mind too, because he just released his own video on this subject. Well, great minds think alike. This amazing blend of technology, music, and animation entertained millions of people. And with Animusic 3 on the horizon, hype was surging to new levels. But then nothing happened. Why? To understand the answers better, we need to look at Animusic's history and see how it all works. So get ready 'cause I'm about to compress 20 years into four minutes. Let's go. With 3D computer animation sprouting in the early nineties, musician and programmer, Wayne Lytle wanted to bring his visions to life. Wayne founded Visual Music in 1990 and the company specialized in algorithmically synchronizing animation to music, as opposed to hand animating key frames manually. And we'll talk more about how this works in a sec. In 1990, Wayne, first demoed an animation entitled \"More Bells and Whistles\" at the Electronic Theater at SIGGRAPH. And in 1995, Wayne brought computer artist, Dave Crognale on board to work on a stereoscopic animation project for VRex, \"Concerto in 3D\". And this dude is talented. Just look at his portfolio. It has some pretty cool stuff in it. Also in 1995, Wayne changed the company's name to Animusic, a portmanteau of animated and music, and they released \"Concerto in 3D\" under the new name, \"Beyond the Walls\" as part of the \"Computer Animation Showcase\" video album. So Animusic was on its way, making great demos and even getting some commercial business. Awesome. But they wanted to make their own product from beginning to end. And that brings us to Animusic 1. Animusic 1 was originally released on VHS and DVD in 2001, featuring seven unique animations and music pieces, including the fan favorite \"Pipe Dream\", which borrowed the fountain design from \"More Bells and Whistles\". And although there were other people who helped out with this project, Wayne and Dave carried most of the work. All of the beautiful animations and music are created primarily by this two-person team. The DVD also has a director's commentary, which talks about how the whole Animusic thing works, so while we're on that technical subject, let's take a look. Animusic is a combination of computer generated graphics and digital synthesizers, which simulate real-world instruments. And the music drives the animation using MIDI, which stands for musical instrument digital interface. MIDI is an industry-standard protocol that enables digital music instruments to communicate with computers, among other capabilities. In Animusic's case, Wayne primarily worked on the software and music side. He did concept art as well. And Dave did a lot of the more visual stuff. And MIDI marries the two worlds together. But to achieve the level of automation and creativity needed, Wayne wrote proprietary software called ANIMUSIC|studio, which analyzes the MIDI data note for note and routes it to rigged 3D models, which automatically respond to the data. Sometimes 3D models are created before the music, for example, in drum machine. And sometimes the music is written long before the visuals are ever made, like with my favorite piece, \"Harmonic Voltage\". Side note, I first discovered Animusic in 2005 on PBS, and \"Harmonic Voltage\" was the one playing on the TV. And that's still my favorite piece to today. So Animusic 1 gained traction, and was well received by viewers. And Kansas, yes, the band worked with Wayne to create box art and an animated opening for their \"Device - Voice - Drum\" DVD. So their name was getting around. This success led to a special edition release of the Animusic 1 DVD, with fully animated menus, bonus features, and a sneak peek, spelled incorrectly on the DVD case of Animusic 2. Animusic 2 debuted in 2005, introducing eight new animations, including a \"Pipe Dream\" sequel, and for the first time, widescreen versions. And in 2010, Animusic HD was released on Blu-ray, which featured 1080p HD renders of all Animusic 2 tracks and the original \"Pipe Dream\" from Animusic 1. So what's next? Well obviously, we had Animusic 1 and Animusic 2, so next is Animusic 2, episode one. (brooding music) Sorry, that was a dumb Half-Life joke. Three, right? Animusic 3, that would be the next step after 1 and 2. But truth be told, I kind of skipped ahead a little bit so we need to rewind. In summer 2006, the Animusic website announced there will be an Animusic 3 DVD. Then in September, 2008, Wayne sent out a newsletter updating the public about Animusic 3. And this is where we see an important recurring theme, the production pipeline. At this point, it's been three years since Animusic 2 came out, and to the best of my knowledge, the public hasn't seen a single preview of Animusic 3, other than maybe this screenshot. So something has been consuming a lot of time. Now, remember, Wayne writes custom software to make this stuff possible. And to speed up the release cycle of things, he wanted to change it. But that would require, for the most part, redoing the entire pipeline from the beginning. And in the September, 2009 newsletter, Wayne mentioned building ANIMUSIC|studio has consumed a lot of time, but he thinks it will be worth it. And also in that newsletter, the public got their first official look at some render previews of Animusic 3. Okay, so it looks like things are going all right. We got a preview. They're redoing the pipeline. Awesome. But then, radio silence. Animusic wasn't completely dead. They were doing some social media things and some PR things, so they were alive. We could tell. But not much was coming out of them. In fact, after the November, 2010 newsletter about the Blu-ray release, I didn't receive any email updates from them for two years. But then, it happened. on August 6th, 2012, the Animusic 3 Kickstarter launched, and the team hit us with a lot of 3D previews and concept art. Holy crap, they were actually working on something this whole fricking time. Well, I'm glad we kept the faith. In the pitch video, Animusic's John Carter mentioned that three years per DVD was too long. Yeah, I feel that. And that one year was a more reasonable timeframe, but to achieve that, they would need to rebuild their production system. Ah, there's that production pipeline talk again. Well, that would explain why there's been minimal activity from 2005 to 2012. But they were still working on more things. Dave modeled over 300 instrument components, which with this new system could snap together like Legos. But even still, there was more being worked on. Wayne is a musician at his core. And during this time, he was working on 12 new songs, which initially I assumed were the soundtrack for the next Animusic album. But it turns out they were for a separate CD release. That seemed like kind of a tangent. Not entirely sure why they were doing that, but we'll revisit that. And success. They raised $223,136 from the 3,284 backers, me being one of them. All right, the stage is set. We have these two creative geniuses, Wayne and Dave, Animusic is doing well with the public. It's doing well with the press. They have a new pipeline. They have new 3D models. They have new music. They raised enough money on Kickstarter. Oh yeah, they were ready to rock. Bring on Animusic 3. But then, nothing. Here we are, nine and a half years later and still no Animusic 3. So what happened? On March 8th, 2013, Wayne posted an update saying he felt bad that he did not get the Kickstarter rewards out sooner. The main item being \"The Sound of 12\" CD, which acted as the quote \"musical soul\" for Animusic 3. Soul felt a little vague. I didn't really know what he meant by that. But when you listen to it, it really doesn't sound like a typical Animusic album. Animusic albums have a certain pacing to them. They have a certain way that the songs are built up and layered with instruments. They have a mix of genres and \"The Sound of 12\" barely matched any of that. But it seems that was done on purpose. In the update, Wayne mentioned that he wanted to immerse himself in a music project, something that was for listening, not for driving animation. Because he was working on the software for so long, he wanted to shift gears to music again. So one might think, well, if it's not made to drive the animation, then what's the point? I'm paying for Animusic 3, why am I getting this tangent of an album all of a sudden? Was it just a waste of time? Maybe. But let's keep digging through the updates. The next update didn't come out for seven months, and they addressed the CD coming out a year behind schedule. But then the update mentioned, Wayne has been dealing with RSI, repetitive strain injury, nerve damage, and fatigue, which were likely caused by years of overworking. Most of Animusic is just a two-person team, and Wayne been driving this thing since 1990. He's wearing many hats. He's a concept artist, a musician, and a programmer. He's doing a lot of stuff. And on top of that, now he has the fiduciary responsibility to fulfill all of those pledges from the Kickstarter backers, so there's a lot weighing on him right now. 11 months later, the next update was posted. It was mostly just an apology, but they said they'd post on a weekly schedule, which lasted for only three weeks, but it was an effort. Then, on the same day, Wayne Lytle's wife posted an update to Kickstarter. She said, and I quote, \"It has been heartbreaking to watch what these two men have gone through.\" referring to Wayne and Dave, \"This has taken a toll on both men, our marriages and our children.\" But she closes saying \"Wayne has what it takes to get this done.\" And she also gives props to Dave. So it looks like there's some hope. And it appeared many comments were also supportive of this post. The next update came out one week later, and \"The Sound of 12\" CD was pre-released to backers, so things were looking up. You could actually get the CD at the $15 level, which I did, and mine is still in the shrink wrap. So to give them credit, they did fulfill this promise. In the next update, one week later, they talked more about the CD. It didn't seem like much Animusic 3 progress was being made, but it's a start. Then, the following week, Dave posted some concept art and he ended the message with \"See you next week.\" Next week came and nothing. Next month came and nothing. And it seems like old habits die hard. We were back in radio silence. Then, about 10 months later on August 20th, 2015, Wayne posted a 2,805 word update, and tragically at this point, it really seemed like the project was dead. Wayne talked more openly about his health issues, chronic fatigue, severe depression, RSI, and Bell's palsy, and ADHD. Looking backward, one could argue that signs of ADHD were present throughout his journey. Wayne was wearing many hats, and in my opinion, it seemed like he was going on tangents and focusing on wrong things for too long. For example, working on the production pipeline restructuring for years and spending lots of extra time making this tangent of a CD album, and this likely led to project mismanagement and work imbalance. Even \"The Sound of 12\" Bandcamp reiterates on the work imbalance between music, animation, and software. And this is officially written on an Animusic-owned page so they're clearly comfortable with admitting that. That lack of project management and his strive for perfectionism would absolutely cause delays. In fact, if you go through all of his updates, listen to him on the Movable Do podcast, and watch those behind the scenes videos on their YouTube channel, you can really see how much of a perfectionist Wayne is. - Dave and I both have a hard time sometimes letting go so we just want to do one more tweak because we just want to get it really perfect. - [Ken] I give him credit for wanting to be perfect, but in many cases, perfection can be the bane of progress. But unfortunately, there was more bad news, and I was not expecting this to happen. The ever so talented Dave left the company. Wayne mentioned the work balance was not optimal and it caused a strain that was ultimately unmaintainable. So after working together for most of the time since 1995, they parted ways. So now, on top of everything Wayne is already dealing with, he now has to do the art, animation, music, and software alone. But he seems persistent, and he goes on to say that as long as he's \"living and breathing, yes, it will be finished.\" And that was it. That was the last update and that was over six years ago. So from my perspective, the project is dead. I'm not aware of any other public communication from Animusic until 2019, where Wayne redesigned the website with Squarespace. We did get some new images and some other production pipeline talk, but there weren't any significant new progress updates on Animusic 3. And oddly enough, I found some copy on one of the archives sites that said \"our aim is to provide software tools enabling teams or individual artists to create their own content.\" So now it seemed like they were pivoting. Were they wanting to be more of a software company? I don't know. It seemed like the focus was getting kind of pulled in two different directions again. But that copy was removed shortly after so I'm not sure how legit that was. It could have just been a test, no idea. For the most part, aside from any minor things I might've missed, the website hasn't changed since early 2020. So what ultimately killed Animusic 3? In my opinion, it was a lack of proper focus, a lack of proper project management, combined with a constant strive for perfectionism, and on top of that, going down these other tangents, like the CD and all of those years redoing the production pipeline, all of that combined together just led to poor time management and that led to stress, and then ultimately that leads to burnout. There's a lesson to be learned from all of this, and it's focus. Ask any entrepreneur and they will tell you how important laser focus is. Steve Jobs has been known for saying, \"Focus is about saying no.\" And that is absolutely true. And I can attest to that because that has helped me a lot in my indie content creation world. But here's the good news, thanks to the internet, we're already kind of getting our own version of Animusic 3. The Animusic videos have been re-uploaded to YouTube for new audiences to enjoy them. And they're racking up millions of views. On top of that, creators are making their own Animusic-inspired animations, like Derek Hugger's \"Harmonic Balance\", and Laser, Lights, and Music's \"Ambient Glow\", which I think is the closest representation of what Animusic 3 could have been. Creators are also rebuilding previous Animusic animations. Heck, even Intel made a real world pipe dream machine. So the love is still there, and with all of this stuff coming out of the creative community, I think we have a comparable replacement for Animusic 3. I try not to editorialize on this show, but because I've been a fan of Animusic for 17 years, I feel like it's necessary to share these final thoughts. Some people may strongly disagree with me, especially the person who pledged $7,000 to the Kickstarter, but I don't miss Animusic 3. I don't think we need it anymore. I'd love to see it come out, of course. That would be an awesome surprise, but I won't be disappointed if it doesn't. Wayne and the team have given us so much timeless entertainment. And thanks to the community, Animusic has been propelled even further than I bet anyone at the company could have ever imagined. And despite all the broken promises with the Kickstarter campaign, I still have the utmost respect for Wayne. I went through a similar struggle back in my filmmaking days when I did my \"ReVision\" sci-fi film project. It was terribly mismanaged to the point where I had to refund everybody's money on Indiegogo. So even though that was a smaller scale thing, I understand the stress and the hard work that goes into that sort of stuff. So Wayne, whatever you're doing now, I just hope you're happy. And if you ever release something new in the future, I'm sure we'll gladly watch it and be grateful. Thanks for everything you've done for us, and thanks for everything you've made. And to everyone else watching this transmission, thanks for tuning in and I'll see you next time. Catch the crazy and pass it on. (energetic electronic music)",
    "transcript_keywords": [
        "Animusic",
        "Wayne",
        "music",
        "Dave",
        "animation",
        "Animusic thing works",
        "Animusic album",
        "years",
        "DVD",
        "Wayne mentioned",
        "update",
        "time",
        "Animusic animations",
        "Kickstarter",
        "Wayne Lytle",
        "Pipe Dream",
        "things",
        "project",
        "previous Animusic animations",
        "Animusic thing"
    ],
    "transcript_entity_values": [
        "nine and a half years later",
        "1995",
        "1990",
        "17 years",
        "Animusic",
        "7,000",
        "two",
        "Wayne",
        "the \"Computer Animation Showcase",
        "Animusic 1",
        "Bandcamp",
        "3",
        "2",
        "MIDI",
        "Wayne Lytle",
        "ReVision",
        "John Carter",
        "one",
        "two years",
        "Wayne Lytle's",
        "millions",
        "Blu-ray",
        "three years",
        "Animusic HD",
        "PBS",
        "November, 2010",
        "one week later",
        "Animusic 2",
        "only three weeks",
        "Dave",
        "220,000",
        "More Bells and Whistles",
        "Animusic 3",
        "Three",
        "Concerto",
        "one year",
        "Movable",
        "years",
        "VRex",
        "September, 2008",
        "six years ago",
        "Legos",
        "March 8th, 2013",
        "Beyond the Walls",
        "about 10 months later",
        "The Science Elf's",
        "Next week",
        "VHS",
        "first",
        "Visual Music",
        "Kansas",
        "223,136",
        "1080p",
        "20 years",
        "Next month",
        "Kickstarter",
        "2,805",
        "Squarespace",
        "Bell",
        "Animusic 1",
        "sec",
        "early 2020",
        "Animusic",
        "Ken",
        "the following week",
        "Dave Crognale",
        "eight",
        "nine years",
        "the early nineties",
        "1",
        "Derek Hugger's",
        "RSI",
        "Animusic",
        "15",
        "August 20th, 2015",
        "Music",
        "Kickstarter",
        "Half-Life",
        "the Electronic Theater at SIGGRAPH",
        "today",
        "300",
        "Krazy Ken",
        "The Sound of 12",
        "YouTube",
        "seven",
        "those years",
        "four minutes",
        "Animusic 2",
        "Steve Jobs",
        "summer 2006",
        "Animusic 3",
        "seven months",
        "September, 2009",
        "2010",
        "2019",
        "the same day",
        "next week",
        "2005",
        "The Sound of 12\"",
        "3,284",
        "11 months later",
        "weekly",
        "August 6th, 2012",
        "12",
        "ANIMUSIC|studio",
        "2001",
        "Laser",
        "Intel",
        "2012",
        "Indiegogo"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "DATE",
        "PERSON",
        "MONEY",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "PRODUCT",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "GPE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "LAW",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "DATE",
        "TIME",
        "LAW",
        "PERSON",
        "DATE",
        "LAW",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.16868267953395844,
        -0.07732897251844406,
        -0.010710367932915688,
        -0.06325294077396393,
        -0.010271660052239895,
        0.004623308312147856,
        0.06652633845806122,
        -0.031568340957164764,
        0.00980330165475607,
        -0.03762386366724968,
        0.05208729952573776,
        0.017664574086666107,
        0.02717437967658043,
        -0.06591054797172546,
        0.04494890198111534,
        0.019847644492983818,
        0.13744212687015533,
        -0.05612977594137192,
        -0.06406769901514053,
        -0.06300398707389832,
        0.017585275694727898,
        -0.0715482160449028,
        0.028022661805152893,
        0.03999726474285126,
        0.0647711455821991,
        0.06123632565140724,
        -0.014868075959384441,
        -0.033974360674619675,
        -0.052786558866500854,
        -0.049135565757751465,
        0.008012567646801472,
        0.03758784383535385,
        0.0518522709608078,
        -0.0148222167044878,
        0.045487307012081146,
        -0.08549395203590393,
        -0.06250163912773132,
        0.019005723297595978,
        -0.051932577043771744,
        0.03893249109387398,
        0.027014099061489105,
        0.004046089481562376,
        0.0005355642642825842,
        -0.025875240564346313,
        -0.05567457154393196,
        -0.01777968555688858,
        -0.0003733171906787902,
        -0.13105884194374084,
        0.02155078388750553,
        0.029931355267763138,
        0.00571559090167284,
        -0.013480724766850471,
        0.061693742871284485,
        0.007626914419233799,
        -0.11367462575435638,
        -0.040623366832733154,
        0.02292616106569767,
        0.030209457501769066,
        0.047462113201618195,
        -0.0049878330901265144,
        0.01871524378657341,
        -0.025743287056684494,
        -0.016295284032821655,
        -0.012049820274114609,
        0.05393556132912636,
        -0.11777753382921219,
        0.04029180482029915,
        -0.017038337886333466,
        0.02333902008831501,
        -0.04265264794230461,
        0.005446386989206076,
        -0.02354220673441887,
        0.03227103874087334,
        -0.06305775791406631,
        0.0496789887547493,
        0.0540907084941864,
        0.12330479174852371,
        -0.04582604765892029,
        -0.04163908213376999,
        -0.07035909593105316,
        0.08549758046865463,
        -0.04563234746456146,
        -0.013915474526584148,
        -0.0384422205388546,
        -0.05140330642461777,
        -0.022403467446565628,
        -0.025913162156939507,
        -0.002683245576918125,
        -0.07243575155735016,
        -0.027997436001896858,
        -0.08667263388633728,
        0.0839400440454483,
        0.045347437262535095,
        0.020629845559597015,
        -0.038335978984832764,
        0.006649584975093603,
        -0.017891447991132736,
        -0.07685889303684235,
        0.04366139695048332,
        0.056772466748952866,
        0.0031581856310367584,
        0.010497435927391052,
        0.045550353825092316,
        0.006514575332403183,
        0.012545081786811352,
        -0.05676034465432167,
        0.022772738710045815,
        0.1174994558095932,
        0.0785621926188469,
        0.02130638062953949,
        -0.02029384858906269,
        -0.05048030614852905,
        -0.00723168533295393,
        -0.004895943216979504,
        0.04341708496212959,
        0.09325641393661499,
        -0.025826161727309227,
        0.08572927862405777,
        0.09895490109920502,
        0.009620843455195427,
        0.11637342721223831,
        -0.053843945264816284,
        0.004593190271407366,
        0.0011702545452862978,
        0.030213838443160057,
        0.006375722121447325,
        -0.04816640168428421,
        4.2078991278812956e-33,
        0.03979135677218437,
        0.058010831475257874,
        -0.013362977653741837,
        0.02388501726090908,
        0.027209995314478874,
        -0.04604306444525719,
        -0.009932240471243858,
        0.027542000636458397,
        -0.08277204632759094,
        0.023342682048678398,
        -0.02668970823287964,
        0.051669731736183167,
        -0.010286140255630016,
        -0.023001786321401596,
        -0.058194343000650406,
        -0.1317378282546997,
        -0.05323338881134987,
        -0.03445592150092125,
        -0.010146033018827438,
        0.04533993825316429,
        -0.0017602421576157212,
        0.03953349217772484,
        0.03832912817597389,
        0.023120610043406487,
        0.022026486694812775,
        0.07553701102733612,
        -0.0038230582140386105,
        -0.01049105729907751,
        0.0620468407869339,
        0.010514821857213974,
        -0.04361947998404503,
        0.026757780462503433,
        0.047046273946762085,
        -0.009458612650632858,
        -0.026921680197119713,
        0.038245998322963715,
        -0.021937064826488495,
        -0.09053854644298553,
        -0.0023820328060537577,
        -0.02748008444905281,
        -0.05661070719361305,
        0.011123092845082283,
        -0.051057711243629456,
        -0.05444300174713135,
        -0.07317033410072327,
        0.02685004286468029,
        -0.0004698755801655352,
        0.0028278911486268044,
        0.09998494386672974,
        -0.01282466109842062,
        -0.006364898290485144,
        0.034019164741039276,
        0.020624779164791107,
        0.04607915133237839,
        -0.002395157003775239,
        -0.012843054719269276,
        -0.00612447876483202,
        0.04903930425643921,
        0.14750376343727112,
        -0.0371466688811779,
        0.055467911064624786,
        0.03626028448343277,
        0.06411825865507126,
        -0.024318983778357506,
        -0.07427256554365158,
        0.038965482264757156,
        0.03310919553041458,
        0.06128675863146782,
        0.0070655737072229385,
        0.020861513912677765,
        -0.07132387906312943,
        -0.003937483299523592,
        0.03621509671211243,
        -0.03785713389515877,
        0.051540177315473557,
        0.013984424993395805,
        -0.0635865330696106,
        0.00443562027066946,
        -0.020943501964211464,
        -0.025292083621025085,
        -0.046055033802986145,
        -0.08387213200330734,
        0.013671054504811764,
        0.038685768842697144,
        0.021881498396396637,
        -0.010216756723821163,
        -0.007548750843852758,
        0.017585324123501778,
        -0.020528621971607208,
        -0.11765412986278534,
        -0.059758562594652176,
        -0.033408310264348984,
        0.027304621413350105,
        0.08120854943990707,
        0.029144661501049995,
        -5.637702865296354e-33,
        0.06841730326414108,
        0.019229058176279068,
        -0.06043770909309387,
        -0.034415848553180695,
        0.1063218042254448,
        0.0014128637267276645,
        -0.007617362309247255,
        0.10247226804494858,
        -0.02479688823223114,
        0.07481159269809723,
        0.0388239249587059,
        0.031386446207761765,
        -0.0786779448390007,
        -0.06283488869667053,
        -0.013286938890814781,
        -0.031184304505586624,
        0.023877190425992012,
        0.013297300785779953,
        0.0427798368036747,
        0.02219942770898342,
        0.01416650041937828,
        -0.006552593316882849,
        -0.08842494338750839,
        0.02424878627061844,
        -0.06147206202149391,
        0.02750062197446823,
        0.004415035247802734,
        0.02632109820842743,
        4.029399497085251e-05,
        0.04694472625851631,
        0.0012862903531640768,
        0.04625139385461807,
        -0.05667999014258385,
        -0.05536714568734169,
        0.038811229169368744,
        0.01921534352004528,
        0.01631910912692547,
        -0.05729765444993973,
        -0.13332253694534302,
        -0.05781235173344612,
        0.058410368859767914,
        0.08146999776363373,
        -0.007600009441375732,
        0.07746575772762299,
        0.05426427721977234,
        0.02206769399344921,
        -0.03520716354250908,
        0.022299645468592644,
        -0.03607991337776184,
        0.021366776898503304,
        0.058722641319036484,
        -0.10272558778524399,
        0.09166121482849121,
        -0.033352963626384735,
        -0.05970708280801773,
        0.017182335257530212,
        0.036822207272052765,
        0.057787105441093445,
        0.05321105569601059,
        -0.007100003771483898,
        -0.03334806486964226,
        -0.04362231492996216,
        -0.04336690902709961,
        -0.05206435173749924,
        -0.03903816267848015,
        0.059924740344285965,
        0.11648474633693695,
        0.03406742215156555,
        0.040402159094810486,
        -0.00646152812987566,
        0.013257397338747978,
        -0.017122812569141388,
        -0.05624346062541008,
        -0.04675985872745514,
        -0.022843560203909874,
        0.01588590256869793,
        -0.0537116564810276,
        -0.0555000975728035,
        -0.022188059985637665,
        -0.0393286794424057,
        0.010191631503403187,
        -0.022211847826838493,
        0.05841056630015373,
        0.007979878224432468,
        0.11626576632261276,
        0.022538674995303154,
        0.04326176270842552,
        0.08841198682785034,
        -0.04146946221590042,
        0.0020895127672702074,
        0.018891584128141403,
        0.011157252825796604,
        0.031115442514419556,
        0.04396748170256615,
        0.00962065253406763,
        -6.057224766209401e-08,
        0.06269646435976028,
        0.09380444884300232,
        -0.04313916712999344,
        -0.012113535776734352,
        0.08642890304327011,
        -0.01942538097500801,
        -0.009801028296351433,
        0.017031755298376083,
        0.022143766283988953,
        0.02545018307864666,
        0.0014431982999667525,
        -0.07105161994695663,
        0.020504087209701538,
        0.012972395867109299,
        0.025137003511190414,
        0.09547818452119827,
        -0.06134830042719841,
        0.01645505428314209,
        -0.02800002135336399,
        -0.03623247891664505,
        -0.052149489521980286,
        -0.024286409839987755,
        0.0819573700428009,
        -0.08199076354503632,
        0.009334838017821312,
        0.09273755550384521,
        -0.041564516723155975,
        0.0052450960502028465,
        0.04397708550095558,
        -0.029816631227731705,
        -0.05031341314315796,
        -0.03249489516019821,
        -0.008163443766534328,
        -0.07936037331819534,
        -0.00882477406412363,
        -0.03852270543575287,
        0.009485991671681404,
        -0.07245738059282303,
        0.050902437418699265,
        -0.023681510239839554,
        -0.027879271656274796,
        -0.05757591128349304,
        0.054817140102386475,
        -0.007985842414200306,
        -0.05469425767660141,
        -0.008900226093828678,
        -0.11132301390171051,
        -0.08284465223550797,
        -0.010744608007371426,
        -0.00838419608771801,
        -0.07856889814138412,
        -0.06013645976781845,
        -0.143080472946167,
        0.027674511075019836,
        0.04492324963212013,
        -0.06874192506074905,
        -0.034042783081531525,
        0.10709917545318604,
        0.017267296090722084,
        -0.0648583322763443,
        0.05650391802191734,
        -0.029469408094882965,
        -0.05460759252309799,
        -0.02143102139234543
    ]
}