{
    "id": "B-Nou-xhWGI",
    "title": "The best demo at WWDC 2021",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-06-08T12:05:20Z",
    "video_url": "https://www.youtube.com/watch?v=B-Nou-xhWGI",
    "category": "Science & Technology",
    "tags": [
        "wwdc",
        "wwdc 2021",
        "apple wwdc",
        "apple",
        "2021",
        "apple event",
        "ios 15",
        "ios",
        "ios 15 updates",
        "iPadOS",
        "macOS",
        "watchOS",
        "airpods pro",
        "apple watch",
        "homepod mini",
        "iPad widgets",
        "tvOS",
        "airplay",
        "iphone",
        "apple tv",
        "facetime",
        "facetime audio",
        "portrait mode",
        "facetime links",
        "shareplay",
        "apple news",
        "android",
        "facetime android",
        "apple id",
        "memoji",
        "siri",
        "icloud",
        "apple health updates",
        "AR",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "google",
        "verge",
        "the verge",
        "dieter bohn"
    ],
    "views": 286835,
    "likes": 9149,
    "comments_count": 516,
    "description": "The best demo at Apple's WWDC 2021 was Universal Control, a feature that lets you use your Mac's keyboard on an iPad and even a second Mac. It's a very clever little feature, but it is built on years of small iPad improvements.  Read more:   Watch the Apple WWDC 2021 keynote in 23 minutes:    Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://bit.ly/34W2urf",
        "https://bit.ly/2SsLA0D",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(upbeat music) - Okay, Apple's WWDC 2021 keynote is wrapped. Now this keynote happened in the midst of a huge focus on Apple's App Store policies. And there's been a lot of developer unrest, and Apple didn't really talk about any of that, and that's to be expected. And besides, Apple had too much other stuff to actually get through. MacOs Monterey, iPadOS 15, iOS 15, watchOS, health stuff, privacy stuff, HomeKit stuff, stuff, a lot of stuff, but some of it is really good stuff. But there is this one particular demo that was definitely the highlight of the whole keynote. It's called Universal Control. And what it lets you do is use one Mac's keyboard to control an iPad or a second Mac. It's actually easier to watch it than to have me explain it, so, here, just watch it. - Without any other setup, I'm gonna simply move my Mac cursor towards my iPad, and the iPad automatically recognizes it. And if I move a bit further, boom, my cursor is now on the iPad. How cool is that? I can even drag and drop files between my devices. I'm just gonna take this drawing I finished on my iPad and drop it on the Keynote on my Mac. Awesome. - So that's pretty cool, right? Now, I know that a lot of the stuff in iOS 15 might be more important than this demo, so I have a lot of things to say about these new Focus Mode, Profile things, and even more to say about the new multitasking model on the iPad 'cause I think Apple may have just kind of given up on it a little bit. But right now, I wanna talk about this Universal Control demo because it's very cool, and I think it's cool for a particular reason. So here's a question. How on earth does this thing even work? Now, what I wanna do here is go through this demo video step-by-step and analyze what's happening here. Now, you should know before we get started that all of these computers have to be on the same iCloud account, because, you know, Apple ecosystem. Here we go. So first, you set an iPad next to a Mac. And the two computers know that they're close to each other 'cause they both have Bluetooth on the same iCloud account. It's the same thing that enables Handoff. Then you take your mouse on the Mac and drag it over to the left or right edge of the screen. And then it seems to know the iPad's position somehow, maybe, that's what I thought. But actually, no. Apple tells me that the Mac just assumes that there's an iPad over on the left or the right of the Mac screen when you drag your mouse over to the left or the right edge of your Mac screen, and actually, just a little bit beyond it. And then this really clever thing happens. This bar appears on the iPad. And if you look closely, you'll see there's some little arrows on the bar. And what those arrows do is they align your two displays so you can drag it up and down, and make sure that when you drag your mouse over, it's in a natural spot. And then, bam, you basically got a KVM switch. Your trackpad and keyboard work with the iPad. But that's not really the magical part, the magical part is drag and drop works from iPadOS to the Mac and vice versa. It's kind of just like Airdrop, but it's better, 'cause you're literally dragging and dropping over the air. It uses wifi direct, or if you have a USB connection, it can do it over USB to be just a little bit faster. And then after that, they just added another Mac to the mix, because why not? You can have up to three devices using this Universal Control system. So this is all great, but if you can connect up to three devices, how does the Mac know which one to connect to the first time you drag your mouse over to the edge of the screen? Well, it just guesses. It figures you wanna use the last device that you interacted with. So if the last thing you touched was the iPad, it'll be the iPad. If the last thing you touched was the other Mac, it will be the other Mac. But you can set up a permanent Universal Control buddy if you want in the system preferences so it always goes to that one. So on the one hand, this honestly does seem like a pretty simple feature for Apple to make. I mean, Apple devices have communicated through Continuity forever, and this is just handing off a different piece of information, mouse position, and keyboard and stuff. But this demo, it's so seamless and easy, that's the magical part. And I could be wrong, but I think that this feature could not have happened if Apple hadn't been laying the groundwork for years on both the Mac and the iPad. So let's start with the iPad. (upbeat bright music) So the first set of features to talk about are Airdrop, Continuity, and Handoff. These are the core ways that the iPad can communicate wirelessly to a Mac. Then there's multitasking on the iPad. And that seems like a weird thing to include because split screen, whatever. But the important part here is drag and drop was part of multi window on the iPad. And so that works across multiple apps on the iPad and it also works here. Then of course, there is keyboard and mouse support on the iPad. It started as an accessibility feature, but then Apple made it a core, top of feature for everybody with the Magic Keyboard. Finally, there's Sidecar. This is a feature that lets you use your iPad as a second monitor for your Mac wirelessly. So you've been able to throw your mouse from a Mac to an iPad for a while now, but, this is different because in this new feature, the iPad is running iPadOS, but, I don't know, I kinda feel like maybe Apple learned some things about how to do low latency keyboard and mouse stuff from the Mac to the iPad over Sidecar. Without any of these features on the iPad. this demo doesn't happen. So that's one branch, that is the iPad. Now let's talk about the other branch, the Mac. (upbeat music) My hunch is that some of this magic was based on all of the iPad type things that have been happening on the Mac over the past few years. There are catalyst apps. They came first, they're sort of like half iPad apps and they're bad. Then there are native iPad apps on the M1 Mac, which I thought could be another building block, but, (Dieter sighs) nah, I asked Apple, and Apple told me that this is pretty much a straight line from Continuity and Handoff. And there's no extra magic from all those iPad guts that are increasingly part of the Mac, which, by the way, Shortcuts and new Focus Modes are also coming to the Mac, so it's not that bad of a hunch to think that there's more iPad stuff going on in the Mac, and that was part of the story, yeah? (Dieter sighs) Look, sometimes our hypothesis isn't exactly right. Science. (dramatic music) And so, I think that this was the best demo coming out of WWDC. And also, I think we can learn some things from it. First, I really do think that the Mac and the iPad really are coming closer and closer and closer and closer to each other. No, you can't run Mac apps on an iPad pro with the M1 chip, but you can drag a file from the Mac to the iPad. And like I said, I think the Mac is getting more and more iPad features like Focus Mode, and Shortcuts, and Control Panel, and so on and so on. Does that mean that I think these two platforms are going to merge? Nah, I think Apple fundamentally doesn't wanna do that. Just like it fundamentally refuses to offer multi-user on the iPad or put a touch screen on the Mac. Look, sometimes when I'm using an iPad, I get annoyed by some limitation on the OS, and then I set it down and then I redo the entire setup on my Mac to get started again. But now, well, there's just more opportunities to use an iPad and a Mac together. So if I'm doing something on an iPad and I'm annoyed by it, I just drag it over to the Mac and keep going, because switching between them has just gotten a lot easier. But to me, the most important part of this demo is that it is possible to make really great features just by thinking creatively about how to use the tools and features that you have already built. Technically speaking, Apple didn't really invent anything radically hard or even especially new with Universal Control. It just made very clever use of the technologies that it had already invented before. And that's cool. So here's the thought that I'm gonna leave you with. Look at all of the things that you've learned in your life and take a step back from them, and think about how you could use those skills in newer, clever ways. You might surprise yourself. Hey, everybody, thanks so much for watching. If you missed the keynote, we have a supercut that's got all of Apple's announcements in a compact 20 something minutes. And let me know down in the comments, was this your favorite feature or did you like something else? Maybe you did.",
    "transcript_keywords": [
        "Mac",
        "iPad",
        "Apple",
        "Universal Control",
        "Apple App Store",
        "stuff",
        "Control",
        "Mac screen",
        "drag",
        "mouse",
        "demo",
        "Universal",
        "part",
        "feature",
        "things",
        "thing",
        "keynote",
        "Mac keyboard",
        "Mac apps",
        "keyboard"
    ],
    "transcript_entity_values": [
        "iCloud",
        "M1",
        "MacOs",
        "one",
        "Mac",
        "Apple",
        "the M1 Mac",
        "KVM",
        "three",
        "WWDC 2021",
        "Focus Modes",
        "Control Panel",
        "USB",
        "up to three",
        "20 something minutes",
        "iOS 15",
        "Dieter",
        "years",
        "iPad",
        "the Magic Keyboard",
        "15",
        "Universal Control",
        "half",
        "Airdrop",
        "two",
        "Monterey",
        "Continuity",
        "the past few years",
        "Keynote",
        "Handoff",
        "second",
        "WWDC",
        "first",
        "Mac",
        "Focus Mode",
        "HomeKit",
        "First"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "EVENT",
        "PERSON",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "ORDINAL",
        "EVENT",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL"
    ],
    "vector": [
        -0.04345976933836937,
        -0.08941789716482162,
        0.050419531762599945,
        -0.029052767902612686,
        0.12326604127883911,
        -0.021484022960066795,
        -0.06421098113059998,
        0.0012224330566823483,
        0.045691702514886856,
        0.055271416902542114,
        0.04801599681377411,
        0.0633118748664856,
        -0.05544470250606537,
        -0.004237281158566475,
        0.07315536588430405,
        -0.010563159361481667,
        0.0682869404554367,
        -0.0762047991156578,
        -0.029682857915759087,
        -0.017248230054974556,
        -0.05874883756041527,
        0.028371267020702362,
        0.051679253578186035,
        0.03376556932926178,
        -0.03411196544766426,
        0.060496263206005096,
        -0.02526698261499405,
        -0.05811147764325142,
        -0.017154907807707787,
        0.007926302030682564,
        -0.002677429234609008,
        0.03622088581323624,
        0.04229732230305672,
        0.00867265835404396,
        -0.07116460055112839,
        -0.09522605687379837,
        0.04941562935709953,
        -0.04991888999938965,
        -0.06130995228886604,
        -0.11613038927316666,
        -0.08309932053089142,
        -0.03395409882068634,
        0.013387958519160748,
        0.1355995535850525,
        0.034231964498758316,
        -0.053614675998687744,
        -0.009987127035856247,
        -0.11995740979909897,
        0.028882775455713272,
        0.03171166032552719,
        -0.0016317545669153333,
        -0.11740250140428543,
        0.020348239690065384,
        -0.03135601803660393,
        -0.00017744490469340235,
        0.04862553998827934,
        0.04484222084283829,
        0.043439559638500214,
        0.12738731503486633,
        0.0488644577562809,
        0.02794714830815792,
        -0.11631092429161072,
        -0.012397220358252525,
        0.04460146278142929,
        0.022248242050409317,
        0.035513218492269516,
        0.011805158108472824,
        0.05241318419575691,
        0.026914676651358604,
        -0.049062784761190414,
        0.0064170206896960735,
        -0.04932460933923721,
        0.13285401463508606,
        -0.0239498820155859,
        0.04879147186875343,
        0.0022041103802621365,
        0.04335582256317139,
        -0.050663020461797714,
        -0.013044378720223904,
        -0.06130244955420494,
        0.04501473531126976,
        0.008353953249752522,
        -0.04309724643826485,
        -0.0023903297260403633,
        -0.022765886038541794,
        -0.010866619646549225,
        -0.030982816591858864,
        -0.01604645512998104,
        0.001807833556085825,
        0.03931041434407234,
        0.0018535418203100562,
        -0.010512071661651134,
        0.028439484536647797,
        -0.017406171187758446,
        0.03296758234500885,
        -0.05187121778726578,
        0.021353846415877342,
        -0.08963271230459213,
        -0.02933027409017086,
        0.021871091797947884,
        -0.008228523656725883,
        0.07423959672451019,
        0.06901359558105469,
        -0.058890338987112045,
        -0.02103198878467083,
        -0.061631400138139725,
        0.0430077463388443,
        -0.0319451242685318,
        0.012222541496157646,
        0.09017083048820496,
        0.00495928293094039,
        0.02069823630154133,
        -0.035584744065999985,
        -0.003842001548036933,
        0.058380383998155594,
        -0.010062199085950851,
        0.03666868805885315,
        0.05750256031751633,
        0.11242853105068207,
        0.03893798962235451,
        -0.006363021209836006,
        0.07287169992923737,
        -0.035453129559755325,
        -0.08208119869232178,
        -0.007480136584490538,
        0.051346320658922195,
        -0.07619833201169968,
        9.700487950252607e-34,
        -0.025636723265051842,
        0.012727347202599049,
        -0.07387039065361023,
        0.012243309989571571,
        0.10155441612005234,
        -0.10041166096925735,
        0.021021105349063873,
        0.039041221141815186,
        -0.03420526906847954,
        0.025876080617308617,
        0.034354981034994125,
        0.012329896911978722,
        -0.058214880526065826,
        0.0009259237558580935,
        0.040531057864427567,
        -0.09109356254339218,
        -0.07693584263324738,
        0.07655417174100876,
        -0.08277177065610886,
        0.012468094006180763,
        0.014953223057091236,
        -0.04674549773335457,
        0.008095807395875454,
        -0.08847114443778992,
        -0.0013148372527211905,
        0.04514705017209053,
        0.033705566078424454,
        0.0075378124602139,
        0.10004958510398865,
        0.016094684600830078,
        -0.10627730935811996,
        0.05929864943027496,
        0.004549649078398943,
        -0.054558511823415756,
        0.015821291133761406,
        0.00603544432669878,
        -0.004836770705878735,
        -0.09320974349975586,
        0.06620150059461594,
        -0.009568504057824612,
        -0.12191832065582275,
        -0.01019356306642294,
        -0.006775231100618839,
        -0.034616414457559586,
        0.058050282299518585,
        0.022971317172050476,
        0.023125018924474716,
        0.032855335623025894,
        0.03128843009471893,
        -0.029910858720541,
        -0.07726801931858063,
        0.01104110386222601,
        -0.023117123171687126,
        -0.04269523173570633,
        -0.02144298516213894,
        -0.08701315522193909,
        -0.015586229041218758,
        -0.10358647257089615,
        0.041964832693338394,
        0.058503180742263794,
        -0.0272959154099226,
        0.09120798110961914,
        -0.04192513972520828,
        -0.024070454761385918,
        -0.09585919976234436,
        0.07292121648788452,
        -0.0021366351284086704,
        -0.04203453287482262,
        -0.03911762312054634,
        0.05449876934289932,
        -0.07524524629116058,
        0.008948053233325481,
        -0.05526375770568848,
        -0.022301198914647102,
        -0.0490523986518383,
        -0.006274126935750246,
        0.0038373286370187998,
        -0.004803560674190521,
        -0.028750186786055565,
        -0.016953881829977036,
        0.013121679425239563,
        0.0008892330806702375,
        0.040337204933166504,
        0.03383861109614372,
        -0.0020718618761748075,
        0.03209748491644859,
        -0.02260550484061241,
        -0.010979111306369305,
        -0.0834122896194458,
        0.010553525760769844,
        -0.036150142550468445,
        0.02328440360724926,
        0.05461660027503967,
        0.040486786514520645,
        -0.023741021752357483,
        -2.5084533331059208e-33,
        -0.014177066273987293,
        -0.03853057697415352,
        -0.08927232027053833,
        0.01774880290031433,
        -0.022551536560058594,
        0.015622707083821297,
        0.005089570768177509,
        -0.017363397404551506,
        0.01938139833509922,
        -0.10296788066625595,
        0.033420465886592865,
        0.005991024896502495,
        0.02187209017574787,
        -0.016755713149905205,
        -0.03141460195183754,
        0.029486622661352158,
        -0.03586355224251747,
        -0.06048004701733589,
        0.011940659955143929,
        -0.00580380205065012,
        0.057162266224622726,
        0.036383286118507385,
        -0.03182350844144821,
        -0.01574212871491909,
        0.022021165117621422,
        -0.021591132506728172,
        0.013445337302982807,
        0.0648275837302208,
        0.017659693956375122,
        -0.041650425642728806,
        -0.029028482735157013,
        -0.03146339952945709,
        -0.0617927685379982,
        0.01815146580338478,
        0.07212800532579422,
        0.020124461501836777,
        -0.0076932646334171295,
        -0.018770726397633553,
        -0.0708753913640976,
        0.003529209177941084,
        0.054423946887254715,
        0.004729689098894596,
        -0.009005238302052021,
        0.03005078062415123,
        -0.03306508809328079,
        0.08715604990720749,
        -0.0818629041314125,
        0.049545545130968094,
        0.031078945845365524,
        -0.05472284182906151,
        0.03407144173979759,
        0.0059877424500882626,
        -0.028738005086779594,
        -0.061135608702898026,
        -0.039238978177309036,
        0.024281932041049004,
        -0.02106468379497528,
        -0.004200940486043692,
        -0.003071970073506236,
        0.020795416086912155,
        -0.01761644333600998,
        0.011214314959943295,
        0.03026922419667244,
        -0.08776717633008957,
        0.01657295972108841,
        -0.019696077331900597,
        0.024229543283581734,
        0.030430292710661888,
        -0.013448824174702168,
        0.04292817786335945,
        0.04535140097141266,
        -0.001517156488262117,
        -0.0371372364461422,
        -0.09258116781711578,
        -0.019298678264021873,
        0.07033318281173706,
        0.061108335852622986,
        -0.08928204327821732,
        -0.08931855857372284,
        -0.009951933287084103,
        0.07858368754386902,
        0.14474256336688995,
        0.04901120439171791,
        -0.009874639101326466,
        0.07961508631706238,
        0.09355974942445755,
        0.006458236835896969,
        0.01236480101943016,
        -0.03489001840353012,
        0.10051625967025757,
        -0.10078943520784378,
        0.004518348257988691,
        -0.03815078362822533,
        0.07975960522890091,
        -0.00039020428084768355,
        -5.3517752007792296e-08,
        -0.037763599306344986,
        0.04667185619473457,
        -0.009597803466022015,
        -0.05099910870194435,
        0.01706261746585369,
        -0.007873467169702053,
        0.05064660310745239,
        0.039010170847177505,
        0.037373270839452744,
        0.049029238522052765,
        -0.051822394132614136,
        -0.03585202246904373,
        -0.13859018683433533,
        0.12277118116617203,
        0.019959038123488426,
        0.07160633057355881,
        -0.08033403009176254,
        0.06896158307790756,
        -0.013219424523413181,
        -0.09972703456878662,
        -0.0004016250604763627,
        0.038063887506723404,
        0.005212987773120403,
        -0.031047070398926735,
        -0.028408046811819077,
        0.03846602886915207,
        0.03142150491476059,
        0.046976231038570404,
        0.020673640072345734,
        0.03483109548687935,
        -0.02107107825577259,
        -0.06297385692596436,
        -0.030361538752913475,
        -0.03371288999915123,
        -0.0009043875033967197,
        -0.018634166568517685,
        -0.013454614207148552,
        0.021042926236987114,
        0.0385584831237793,
        0.05093918368220329,
        -0.04800333455204964,
        -0.04418784752488136,
        -0.021963274106383324,
        0.05084899440407753,
        -0.03657640516757965,
        -0.042446866631507874,
        -0.062087588012218475,
        0.009999606758356094,
        0.013488308526575565,
        0.060690563172101974,
        0.0646565705537796,
        -0.06594490259885788,
        0.032848283648490906,
        0.03355249762535095,
        0.09226301312446594,
        0.07008210569620132,
        0.037977077066898346,
        -0.050208717584609985,
        -0.05949567258358002,
        0.0812605768442154,
        0.10607738792896271,
        -0.05003732815384865,
        -0.00286208838224411,
        0.0890328586101532
    ]
}