{
    "id": "b18nHUq7l1g",
    "title": "The iPhone 16 is here — but it's not finished | The Vergecast",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-09-10T13:00:40Z",
    "video_url": "https://www.youtube.com/watch?v=b18nHUq7l1g",
    "category": "Science & Technology",
    "tags": [
        "gadgets",
        "tech gadgets",
        "technology",
        "verge",
        "the verge",
        "tech",
        "tech news"
    ],
    "views": 42084,
    "likes": 756,
    "comments_count": 156,
    "description": "Apple launched the iPhone 16, Apple Watch Series 10, and AirPods 4 at its annual fall event in Cupertino. The devices come with some big upgrades  a new camera control on the iPhone, a new design on the Watch  but also a lot of promises about AI. Today on the show, we discuss everything that's new, everything that's missing, and all the reasons you might or might not want to upgrade your Apple gear this year. Presented by: @MintMobile   Further reading:   00:00 Intro 02:05 Apple Event Vibes and Media Presence 05:17 iPhone 16 and 16 Plus Features 11:33 Camera Control Button and AI Integration 35:52 Camera Upgrades and Features 37:55 iPhone 16 Pro and Pro Max 44:58 Battery Life and Processor 01:06:20 AirPods 4 01:08:41 Apple Watch Series 10 01:12:15 Sleep Apnea Detection 01:18:07 Lightning Round: Accessories  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Tuesday and Friday:   If you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit:",
    "description_links": [
        "https://www.theverge.com/2024/9/10/24240787/apple-iphone-16-intelligence-camera-control",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz",
        "https://www.theverge.com/ethics-state..."
    ],
    "transcript": "(upbeat music) - Welcome to the \"Vergecast\" the flagship podcast of the A18 and A18 Pro, which are different things. This is our Apple event special. I'm your friend David Pierce. Alex Cranz is here. - Are they different? - Honestly, I couldn't tell you, but we'll get to that. Nilay Patel is here. Hi Nilay. - 35 flops. (David and Alex laughing) That's all you get from me. You wanted 36, you got 35. That's the deal on the table. You can take it or leave it. - Okay, first of all, Nilay, it's very important to me that you describe your whole setup right now, both for people who can watch, who would like to know what's happening, and also for people who can't. Just paint us a word picture of your current setup right now. - I am in my hotel room in Sunnyvale, California. I just came from Apple Park. David's running the show because I have no idea what's going on. I was in Apple's ambient experience. Either you're gonna get a new phone, or you're gonna be raptured. That's my experience every time I go to Apple Park. I don't know what's gonna happen. But yeah, I was just at the Apple event with our whole crew, Vee, Allison, Chris Welch, Verin. We had a great time. We ran around and played a few phones and I'm in my hotel room, which I've attempted to turn into a podcast studio. It went six. (David and Alex laughing) - Okay. How's the lamp? Tell us about the lamp. The lamp is glued to the table. I'm very late. I'm on the West Coast. Everyone else is on the East coast 'cause they didn't come. They abandoned me to Apple. - Okay, that's correct. - So they've been very patient while I tried to figure out how to make this room work and the lamp being glued to the table really threw me. You know, how you like leave a room and you're like, I know what I'm gonna do when I get back to that room and you walk back into the room and the lamp is glued to the table. I don't know if that's a metaphor that's the thing that happens to other people. But anyway, back and it's our room. I just, we just played with the phones. I met a bunch of people. I talked to Phil Schiller for five minutes about camera buttons, which is a fascinating conversation. I'm ready to rock. - I am very excited because it does feel like a solid two thirds of this episode is gonna be about camera buttons. But let's go back to the beginning. You were saying, like, before the event even started that the vibe of this event at the Steve Jobs Theater was unusual and you've been to a million of these. And so just to hear you be like, this is not how this room normally feels is fascinating. So like, what was the room? - Yeah, I don't wanna do too much immediate criticism on our show. It's not even criticism, it's just media talking about itself. - Sure. - But the mix of people in that space was different than before. It was like tangibly different than before. There was a lot more foreign press. There were more TikTok creators, call 'em. It was just like a different younger, more visual video crowd. Everyone's just, like, thrilled. Like I think for a lot of people it was their first time at an Apple event. So you just had this, like, surge of enthusiasm and then all the old heads in the corner just like grumbling about how the kids dunno what they're doing with their selfie sticks. And I think it's like a healthy tension. - Yeah, I mean, if you rewind a decade, it was just, like, the old heads and Apple employees at those events, right? - Well, no, it was like the legendary print reviewers and me being like, here's what I'm gonna do. I'm gonna take a photo and upload it to the internet right away. And they were like, what are these bloggers doing? Get 'em outta my face. - He was like, I don't go to print for three days. - Yeah. Like I appreciate that I'm in this circle of life, but the point I kept making in the life log was that the room was super enthusiastic, which we just have not seen in like quite a while, right? Obviously there's COVID and then a bunch of people came back and I think Apple turned over its crowd. I asked a few people, it feels like the big change was the dramatic increase in international press that feels like the big change. I don't have the numbers, I don't have Apple's data that just seems like they widened the aperture of who was covering the event and they had a more lively atmosphere. - Interesting. I do miss, like, I mostly don't miss Apple event days when I'm not at Apple Event days, but there is something kind of lovely about the Steve Jobs Theater. Like it's a nice place. They did a very good job with the Steve Jobs Theater. - They did a good job and then they opened a new building for this event called The Observatory, which is just sort of like over the hill and around the corner. And that's their new, like, briefing space. - Oh! - The Steve Jobs theater was too small the day it opened. They've been saying this since literally the day it opened. Like this was too small because they designed it in a very different time. It took a long time to build and design and improve. So it's always been too small. And in particular the sort of spaces within it where you can, like, have conversations, always too small. So they built an entirely new thing called The Observatory where they were having additional meetings and stuff because they have so many more people there now. And the Observatory is like this like glass window that looks over Apple Park. Apple sent some photos to a magazine called Dezeen Today. We were not allowed to take photos, but you can look at it. It's very cool. And that's sort of their space for after the event 'cause they have so many more people to talk to. - That's cool. There is nothing more Apple-y than look we built this very cool building you are not allowed to photograph. Like that's it. That's Jony Ive, the spirit of the man lives on. (all laughing) All right, let's talk about the (speaking faintly) So I think let's do it in reverse order, kind of, of how Apple did it. Just because we gotta start with the phones, right? Like the phones is the thing. There were watches, there were AirPods and there were phones. Those are the big three. Both of you, I believe last week said that we weren't gonna get Max. Congratulations on all of your accomplishments. - We also did not get a TV. - We did not get television. I was devastated. Ted Lasso, no appearance, very upsetting. - Jason Sudeikis wasn't even there as far as I know. He's just, like, shooting lefty threes at WNBA games still. - Well, Tim Cook was like, this is some of our most breakthrough and meaningful innovations yet. I was like, oh, they're doing a TV. It was not TV. - Alas, but the phones got bigger, which we're on the way to a television, right? - Yeah, the problem is gigantic. Yeah. - Yeah. but let's start with the cheapest phones and then go up to the most expensive phones. Alex, do you just wanna like brief rundown of the iPhone 16 and 16 plus? - Yeah, the iPhone 16 and 16 plus are like good. They're exciting. Well, I think, I think the big difference is a lot of the stuff is new on these as well. Specifically the camera control, i.e. camera button, shutter button. Although I think Nilay probably has some feelings about that. So maybe we don't call it the shutter button. So it's got camera control. It's got the action button, which was on the Pro last year. It's one to 2,000 knits. It's got the ceramic shields. So you should theoretically be able to drop it with minimal scratches. The 818 and visual intelligence, which is kind of like Google Lens but... - But Apple did it. - Yeah, but Apple did it and it goes through like the camera control button. And most of the stuff, they really spent most of their time talking about the action button and the camera control, which like, as a button lover, I was elated, but other people, I don't know. And the colors are different this time too, right? Like we got a blue, we got this teal, like bluish teal. We got the pink, we got a purple. It's some lovely colors this time around. - So this is my first question, actually. Nilay, you've seen these phones. Apple describes the colors as I believe the quote was \"more vibrant\". Vibrant was a word that was used. - Are they? - Thoughts? You've seen these things, some of them, right? What's the verdict? - They look great. - Yeah? - They look great. The pink is very pink. The blue is very blue. Like, they are in fact very vibrant. They're very saturated colors. - That's exciting. - They didn't shy away from them. The phones are cool. Apple continues to sort of round off the corners of the phones. And then as Alex is saying, the big change to the hardware is the camera control button, which is also in the 16. So you don't get the sense the 16 is missing anything this year. - Right. - There's a whole bunch of camera features. It's not getting as a solar processor. - So it's got one less camera, right? They said it could do four, but it's got two actual cameras. They got the 48 megapixel fusion camera and then the 12 megapixel ultra wide. - Which is not four cameras. It feels very important to say, that's not four cameras. - That's two. - It's not four lenses, it's not four cameras. - The way Apple would argue this, and I spent, I mean you can't just like throw the words fusion camera at me and not expect me to ask everyone exactly what that means. So fusion camera... - Was it fusion what they call the sweater mode? - Tell us about the (speaking faintly). - That's deep fusion. - The PRISM is on the pro. So fusion camera specifically refers to the idea that you have a 48 megapixel sensor that generally produces 24 megapixel images, but you can run it at 48. And then when you zoom, it doesn't just crop the sensor to get you a 12 megapixel zoom lens. It runs an entirely new photo pipeline. So it, they are treating it like you swapped lens sensor, photo pipeline, everything. So you've got a 12 megapixel zoom lens sitting inside the 48 megapixel main camera. You have to believe all of this is true. That's how you get two lenses. That's the argument. That's why it's called the fusion lens is you have 48 and then when you run it as a telephoto, it doesn't just crop the sensor, it does all this other stuff to treat it like it's a different sensor. Do you believe it? - That's like me saying, there's me and then there's me with a British accent and that's a whole different guy. Like I just, I don't it. - That's the argument. And then the other two, just to be clear, the other two is you have the ultra wide and then when you hold it close to something, it switches to macro, so it's a different camera. So you get four. And that one is slightly more believable in a sense that one thing is far away and one thing is very close, sure. But I would, the way to think about it, it's not four cameras or four lenses. It's four modes. - Yeah. Okay. - Which is fine. I'm good with that. Four modes I can work with. Lots of cameras have many modes, that seems fine. And I will say all the camera stuff seems solid. Like the, I actually think the, like big improvement to an ultra wide camera is a big deal. And there's been a lot of excitement about it. I think I mostly don't shoot with the 0.5 camera on the iPhone because it makes everything kind of fish eyed and weird looking. But there are some like genuinely sincerely cool things you can do with that lens that you can't do otherwise. So if like, if they've made that actually work, I actually think that's pretty exciting. - So this is like real macro mode, right? This isn't just the stuff where I would hold the phone up really close and if it focused, then I'd get a nice shot and call it macro. - No, the 13 pros I think started doing true macro with their ultra wide. And the pros have had it for a while, but now the regular 16 has it. And really what you're seeing is the regular 16, unless you want all these additional photography features, is basically the good phone, which is a first. Like I would've never considered buying a regular iPhone before. I've always bought the pros. I'm still gonna buy a Pro because I'm a huge camera nerd. But there's not some piece of this puzzle where I'm like, oh, that's not good for most people. Like this is a great phone. Probably the best straight up iPhone Apple has made in quite some time because it is inheriting most of the features of the pro, including the camera control button. - Right, and the reason that's happening is a theme we're gonna come back to many times in the course of this episode, is AI, right? Like the thesis is that these are AI phones. You can shake your head all you want Nilay, I'm right. (Nilay and David chatting indistinctly) But like they, what was Tim Cook's line? Like these are the first devices built from the ground up for Apple Intelligence? - Yeah. - Like... - Yeah, that's you and a British accent. It's the same. (speaking indistinctly) - Yeah. - They started these phones a million years ago, right? Like obviously. I think they did the action button. They knew that the number one thing people would use the action button for is that the camera. They were right. That's the number one thing people used. And so they added this other button and I, it's funny, after the event I'm like scrambling to post photos and I had posted a thing on Threads that I still use the same ancient Nikon camera and lens. And I have been since like the beginning and I'm still using it and the photos are still great. And Phil Schiller saw me and he was like, that's your old camera, huh? 'cause he'd seen my post on Threads. We just got to talking for a little bit, nothing major, no earth shattering scoops. So I asked him this question like, is this button here, because this is a new input method for the phone, right? Is this a camera shutter button? Is this just for camera nerds? Like Phil's a camera nerd? We talk about cameras every time we see each other. Or is it you want people to have their iPhone engaged with the world visually, right? You want the AI to be able to see stuff. So you need to put this button right here so you can like open it right away and like look at stuff with your iPhone. I think it's basically like, yeah, it's both. Like people use their iPhones for cameras all the time. It's convenient. We already see that's happening. But at the same time we have, you know, we have cameras on iPads and people use 'em as document scanners and we are just aware, like Apple's just aware of the universe of things that camera is already doing for people, like scanning QR codes to get menus at restaurants. So I pushed him on it and he was like, no, it's both. Like, you have to see it as both. And we've seen it as both for a long time. So I think you're right David, that like, there's a view towards a long-term future where the iPhone is just looking at stuff and being smart about it. And then there's right now, which is people need to open the camera and take a photo and we're in a, this button represents a little bit of a transition, but none of the features are shipping. So it's just a camera button. - So, okay. This is actually, if I'm being completely honest with you, the single biggest question I have for you, as somebody who has held one of these phones. Is it a button? All Apple calls it is camera control. Like Apple studiously avoids calling it a button. And from the description in the keynote, it sounds a little bit like, it's kind of, I think I compared it to like the Mac, a teeny tiny MacBook track pad where it's like mostly doing the haptic thing and it doesn't really move, but it feels like it's moving and you can, you know, move your finger around and it's sensitive that way. But it's not like a clicky button, is it? What is this thing? - Does the button move? - It is a physical, honest to god clicky button. - Okay. But that makes me feel better, I was really worried. - It also does the other thing, which is very confusing. And every time I've used it, I've used it now a dozen times, my brain is still trying to figure it out. So, and I'm not saying it's like hard to figure out. It's just one of those things you have to use for a little bit and like figure it out. So when you, it's capacitive, the reason they're not calling it a shutter button is 'cause it has like multiple functions inside of it. And they're all enabled by the fact that it is both extremely pressure sensitive and capacitive. So you can just push it down and it clicks. And that'll take a photo, like every time that's gonna take a photo. And the new sensors are zero lag. So you can just bang away on even the regular iPhone 16. But also on the iPhone 16 pro, just taking pictures, zero shutter lag, you're off to the race. - That's pretty cool. - That's cool. - If you like, I don't even know how to, if you think about moving your finger, it'll register like a tap. (Alex and David laughing) Do you know what I mean? Like you're not, 'cause you don't wanna push it. You wanna like, just like give it a little, a little, you know? Yeah, just like I'm thinking about you. And that'll open up one menu. And if you do it twice, you get like the big menu and you can like switch between modes. So like, by default it's like the zoom. So you like hold it down a little bit and you get like the zoom thing and then you can like slide your finger back and forth to zoom. But you can also click down again and switch to the new photo styles or switch between the lenses or all this other stuff. Eventually you're able to lock exposure and focus. - I'm like dangerously worried that you're describing like 3D touch or forced touch. Both ideas that Apple has had that didn't go super well for Apple. The idea of like, what if we gave you infinite levels of pressure to push and different things happen depending on what you did. And everybody's like, actually this sucks and I can't figure out how to use it. - Well, so the the reason it's gonna work is because Apple's not depending on like third party app developers to do anything. - Fair. - They're just like, here it is, here's how it works. And you can, like I said, it is, I have not immediately sussed it out, but you can see how you will. And the thing that's actually the most confusing about it is if you are used to a MacBook track pad where the click is fake, the fact that it is actually a physical click to take a photo is the thing your brain can't get around. - Right. - Because you can press hard enough to make it do stuff, but then you can press even harder to make it take a photo. - Ooh, this is gonna be a mess for people. I'm so excited. - It's not me that, I promise you won't be that messy. It'll just be like a week of very confusing results. - Yeah. I mean that's gonna be a great week. - Well it sounds like the hard part is gonna be all this stuff in the middle. If you just button mash it'll take a picture, which is what most people want to do. - And then it falls right. But then the capacity stuff is wild too because it's an iPhone, right? It's iOS, so it has inertia. So when you're like looking at your range of zooms, you can just like slide your finger really fast and it'll just fly to the next detent. - Yeah. - Right. Or fly between lenses. Or if you have it open to the lens switcher and there where there's no detents, you just like go from the farthest zoom to the ultra wide by just like swiping really fast and it'll just like roll. So there, it just as a hardware software Apple-y thing, it is like absolutely not just a button. Like it is like another weird little touch surface with a lot of ideas packed into it. And the idea is for as much as I can tell that you should basically be able to control the entire camera from this button. - Hmm. - Hmm. - There's parts of it that you can't do, but you should basically be able to, you know, like a real camera is like lots of buttons and knobs and exposure compensation and styles and macro. And they've got a lot of those ideas inside the camera control button. - What if this becomes like a generational thing? You know how like your parents are always turning the light on on their phone because they kind of screw it up and we're just like, like our brains just can't process it. We'll hit it like an age point where we're like, we just can't use a camera control because it's so complex. 'Cause it does sound like there's like a lot of like, it's like really awesome and that there's a lot of opportunity with it. But also it does sound super complex. - I think people are trying to figure out what that middle part where you're lightly tapping is for, that might be confusing. But like David is saying, if you just push the button really hard, it'll take a picture. And that part seems very... I will say that there are, we have weird hue light switches in my house that you have to push really hard and people often don't push them hard enough. And so maybe they just like won't, maybe just won't push this button hard enough - Maybe. So what what I found myself wondering about this is I actually get all of the reasons Apple would make this thing, right? Like it actually makes a lot of sense. It seems like a really useful controller. It also, it makes sense both in landscape and vertical mode, which is very clever. Like to make a button that feels like it'll work whether I'm holding my phone like this and using my index finger or holding my phone like this and using my thumb strikes me as very clever. What I don't understand is why this isn't the action button. Like why didn't they ship this last year and call it the action button? That makes way more sense to me than calling it camera control. There's all kinds of interesting stuff you could let developers do with this. It feels like vastly deeper and cooler and more interesting than like, here long press this button and one of eight things will happen. It's possible the answer is just, it wasn't ready so they shipped it. But like, this seems to me to be what the action button always should have been. - I think I disagree with that. I think the action button is, I mean we talked about this so much last week. The action button is meant to be a configurable macro button. - Sure. - And it just happens that most people thought the camera was the most useful macro. But I think Apple's all in on the idea that you should just have a button on your phone that opens your transit app or launches a shortcut or it does one of any number of appliance, like things that your phone does. - Shout out to all the people who told us about the transit apps, by the way. We got a lot of feedback from people who use it for their transit apps. - Yeah. And I think Apple's like super into this. 'Cause what they were doing before was like weird triple clicks of the home button to accomplish these goals. Now they just have another surface to map things onto. And the fact that everyone is using it for the camera, I think was proof to them that they needed a camera button too. - So you think that, I mean, and I guess you're probably right, like I was thinking that there's a roadmap for this that ends in it being something that like every developer can do stuff with and it becomes like a system for controlling how you do lots of things. But what you're saying, and I guess what's probably right, given the fact that it's called camera control is like this thing is about the camera. Like, maybe it will be the camera in lots of apps, but like this is a camera thing. And that is, I agree with you in that sense that this is like, this thing has a real sort of statement of purpose that the action button like deliberately does not. - Do you guys think it means that eventually we don't get that port free totally smooth glass iPhone? - Yes. I think that that idea is officially put to bed. - Yeah. - I don't think they have any interest in that. In fact, since those rumors have started, we've had two physical buttons added to the iPhone. (Alex and David laughing) And I think Apple, one, realizes, charging wise, these phones are more power hungry than ever. Especially as they start adding AI features to them, people are gonna have to charge their phones more so that port's not going away. And then two, I think the things you want to do, like very quickly on a phone are going to start to take primacy over the idea of opening the home screen and picking an app. And again, the AI part of it where they call it visual intelligence where the phone can see the world that I think the primacy of that is very, very high. - Yeah. - And so over time this button might get optimized for some of that. But right now Apple knows, like for a lot of people the iPhone is a web browser, a really good messaging client and a really good camera. And so if they can just be like, now the camera's easier, there's actually a chance it can get you to do other stuff on the phone. - Yeah. - Well and I think that that push is the same one behind a lot of what's in like iOS 18, right? Which is more customization. They're pulling more stuff out of apps and onto the lock screen and onto the home screen and into widgets and into live activities. Like the idea that you should be able to do most things on your phone without doing very much feels totally central to like the entire design of the iPhone, both hardware and software. And as it happens, I think is exactly correct. And I'm very, very happy about that, like... - We'll see how every app developer feels about this, right? Like, you know, it was not for nothing that Apple very specifically called out. When you do visual intelligence features and you search for a restaurant, like you take a picture of a restaurant, it tells you what the restaurant is, it's rating and the menu and it's like, where's that coming from? And the answer is Yelp. - Right. - Can they swap in another provider for Yelp? Yeah, probably in other countries where Yelp isn't like the dominant provider of that info, like Apple will swap it. But then they were also very careful to say, if we don't know what's going on, we'll ask Google. And if we recognize that what you're looking at is like a blank homework page, we'll like ask Chat GPT to like help you. So they're trying to expand the like universe of third party services they can talk to. The question is whether any of that becomes modular, how any of those services make money. No one seems to know. - Yeah. I mean that's kind of the whole Apple intelligence question, right? Is like Apple, Apple seems to be building this very simple seeming beautiful thing that it doesn't make any sense how the rest of the ecosystem around it works. - Yeah. And to be clear, the weirdest part of these phones, they were announced as the first phones built for Apple intelligence, they're going to launch with none of it. And maybe that's only true for a couple weeks, right? They're launching September 20th, is the on sale date you can pre-order 'em, I think next week or the end of this week. 18.1, IOS 18.1 is supposed to arrive sometime in October with the first set of Apple Intelligence features. So it's only a few weeks gap, Maybe at most a month gap, right? But that's a long gap to launch a phone without its highlight features. - It's a long gap. It's also, it's launching on 18.1 in beta and it's only launching some of the features, like some of the stuff that chipping is gonna be very cool, right? Like transcriptions and summaries coming to voice memos like that, the stuff that's coming to mail where they can rewrite your email, which Apple brought up like 11 times during this event. Like please dear God stop giving us tools to write worse emails. Like, please I'm begging you. - That is write up there with Apple explaining what bigger screens are for. Like, where did you... - Extra line of text. - We're truly killing time in these events. At some point, like, or Apple thinks everyone is stupid. It might be both. - It might be both. - The screen's bigger, you can have fit more content on a bigger screen is like a regular explanation at Apple event. Right next to, hey, you wrote a bad email and now the robot will write a nice email. - So that our robot on the other end can read it and summarize it for you and then rewrite, it's just, it's just Apple mail nonsense all the way down from here on. - By the way, the actual flow. We're hitting the boundaries of text handling and interface metaphors in iOS 18 with some of this AI stuff. So if you wanna like, use these features in 18.1, you've got like a long thing in like notes, right? And you wanna summarize it and send an email. You have to select all of it, which is like grab the handle, like scroll all the way down or you know, if some apps have the select all, fine, and then you have to tap it again to get that select that little menu that like modal popup menu to come back up and then you hit like writing tools and then it brings up a sheet. And that to me is just bananas. - I just wanna say, based on my ongoing ability to like accurately cut and paste things over time, the odds of me getting all three of those taps correct in a row is like one in four. Like... - [Alex] So like a video game. - Yeah. It really is. - Prince of Persia on your phone. You're gonna have a great time. - Well, you know, the iPhone can now play AAA console games. - Oh yeah, Assassin's Creed. Sorry, sorry. - Someone even stopped us. Like they did it. They mentioned us. No, but it is just like if that's the thing you're selling and actually text handling on an iPhone is, I would say it's messy. It's just, it's not like they've revolutionized it. - No, it's pretty inelegant. And it has been. - It's basically the same way it has been since like they added it to the iPhone. You're now at a place where you're like, oh, we're straining the interface metaphors of this in a real way because what we're asking people to do to use these new features is move a lot of text around or like take action on a lot of text and it just doesn't, the iOS was not like built for that in a particular way. And now in the way that a desktop computer like obviously is, and now we might, I hope Apple like takes the opportunity to be like, we should rethink text handling here or like find cursor control. - Okay, but there was one AI feature that actually seemed good in this that they pointed out this time, which I don't think they mentioned at WWDC, which is that you can just ask Siri to like tell you how to do stuff on your phone. - No, they did ask that at WWC. - Did they? - hat's very much the like future of user manuals is generative AI. Like we have to boil the ocean in order to make a useful user manual for your iPhone. I mean this idea has been around forever. Bixby, Samsung's Bixby is this idea. - Yeah. - You will talk to your phone and like it'll do stuff. - But no one's done it well and I just, I keep thinking of all these people who go to how to's, who are using all these other ways to try to figure out how to use their phone and theoretically Apple's gonna make it better. But you have to know to ask. - I saw a demo of this today. I don't remember. - Did it work? - It's like a haze of demos. - Yeah, they were showing me like, you can ask it how to do x, y, Z feature. And it totally worked. They were obviously running 18.1 beta, not 18.0, which we'll ship with. But it worked. I mean, and if you really think about all this happening here is Apple has a model, it's running locally on the phone and then they have their own user manuals, which they could load into the model, right? So you're asking a question of a pretty known set of information from their own knowledge base and whatnot. And that's a pretty straightforward use case that I think they, I don't know how much people will use it, but from what I've seen, it works pretty well. - Yeah. No I think it's like, it could be really useful if they actually promoted it. 'Cause I think of all the old people in my life who don't know how to use their phones. - Right, but now you gotta get them to use Siri. - Yeah, now you're gonna be able to be like, no, you ask Siri, don't ask me, you ask Siri now. - And then assume that you can ask Siri in a way that is not prescribed and doesn't have to be a very specific kind of way. And like, again, so much of what Apple is asking us to assume is that after what, 13 years Apple has made Siri good, and I just am so not ready to assume that yet. But back to what you were saying Nilay about when all this stuff is rolling out, this stuff is rolling out in beta in pieces in October. And the biggest thing of it, which is this... - Wait, can I just be really clear about that? 'Cause even that is confusing. So it's in beta right now? - Yes. You can technically do it right now. - The iOS 18.1 public beta is available. You can push the button, you can download it, you can run it. If you have a 15 pro, you can run Apple Intelligence some stuff right now. It's gonna launch in the public release of iOS 18.1 sometime in October. - But they're still calling it a beta in the public release. Which is insane. - The features will be labeled beta in the release. And they've done this a handful of times. They did it with Portrait mode. - Free Form, the app launched like that I think. - Yeah, a couple other things like, FaceTime, audio transcriptions or something launched this way. There's a handful of this stuff. Deep Fusion technically was in beta, but nobody could see it. No one can still see it. So it's fine. So Apple has this history of doing this, right? Particularly with the camera, but now what they're gonna do is they're gonna say huge chunks of this operating system or in beta and they're just gonna have the label in the release. So it's not in beta. You have to go get it. It's in the public release. It'll be labeled with the beta, which is a little... - That's messy. - Which is kind of like just saying here it is, it might suck. Which is to be fair what all of the AI systems do right now. They all have the label at the bottom that's like, this thing might lie to you, we don't know. - Yeah. - Not our problem. - It's also kind of what they did at this event when they announced all of this. They were like, and now we're doing Apple Intelligence. Also this is just a recap of WWDC. - Yeah, and all of the features were couched that you will be able to without any hard dates. And so I, again, I don't care how many iPhones Apple sell to quote our friend and mentor Walt Mossberg, I don't give a fuck about your stock price. I just don't. But, you know, if one of the questions is, is this worth upgrading? The answer is not in the hardware, the answer is in the software, right? If you have a regular iPhone or any Pro phone save the 15 Pro to get Apple Intelligence features, you need a new phone. Okay, that's a good question. Like is the new, are the features worth an upgrade? And the answer right now is no, because they're vapor. And I will just refer you back to one of the version's, longstanding rules right up there with world of no sevens and review what's in the box is it's a vapor until it ships. - Yep. - And it hasn't shipped yet. Apple has a great track record of shipping. I'm not, I don't mean to say this in a pejorative way, but it's vapor until it ships. So you just like cannot evaluate this thing 'cause it's not real in any way, shape or form. - Right. And especially with AI, it's not just shipping. Like shipping is the very beginning of the battle of making something that's actually any good when it comes to AI. - And part of it is shipping. I know in the 18.1 beta and you can, you can summarize notifications like no one's business. Have you ever looked at a small piece of information and thought to yourself, I wish this piece of information was smaller. Apple's got you. Like you can do that right now. It's all of the rest of it that isn't out yet that has yet to ship. It's all of this private cloud compute stuff, which is up and running and supporting the beta, but actually hasn't scaled and has not actually yet been audited by third parties to prove that it's compliant with Apple's privacy's like Apple's, privacy promises, all of that we don't know yet. Like we just don't know yet. So it's just hard to evaluate this phone. Like from the dumbest perspective of like, should I upgrade a phone? I don't know. Like, is your phone broken? This phone will be much nicer than the phone you have. Will this phone bring you a bunch of cool new AI features? Like maybe, but I dunno yet. - But your camera will be sick. - Well. - Yeah, we'll see. - Yeah, we'll see. It's very hard to evaluate a camera at Apple Park. - Well, okay, this is actually a good segue back into the pros, which we should talk about because obviously there was a ton of focus on the cameras. I mean, right, if you're buying this thing on day one, the two things you're buying it for hardware wise are the camera upgrades and the camera control. Like, that's it. That's the thing, right? Unless you like deeply want a phone that is called Desert Titanium. And if you do, please email me and tell me why. I would love to hear from you. - 'Cause it's called desert. It sounds cool. It's way better than natural. - One of my favorite things that happened today was that as soon as they said Desert Titanium, every single person on our staff with Liveblog access made a different joke in the Liveblog. Desert Titanium. (Alex and Nilay laughing) - Can I tell you the joke that I make in the Liveblog? - Sure. - Yes. - Desert Titanium sounds like if one of the Macs in Pacific Rim was a stripper. (David and Alex laughing) And now coming to the stage. - Do you see what I'm saying? - Desert titanium. - (indistinct) Get with me. I have an entire idea here. (Alex and David laughing) - That's very good. - Like I know how we can stop Kaiju attacks and it's sexy. - But yeah, we're surprised... - That's it. That's my last Vergecast everybody. - That's it. Yeah. We're leaving Nilay in Sunnyvale. This is the end possibly of the Verge, who knows? We're so sorry. But it was always gonna end like this. This is what it was. - I'm just gonna point this out. As far as I know, Jaeger are not gendered and this is an equal opportunity, like full spectrum stripper robot situation. - Just pulling in their metal plates into the ocean. Bada-bum! - I'm just trying to be inclusive. - Yeah, I love it. - Just one metal around 2024. Anyway... - Desert Titanium. (Alex and David laughing) The Pro and the Pro Max, it's just the camera this year, right? Like better processor, different colors. Battery life, which I'm gonna get very angry about here in a minute. But like the thing, if you're thinking regular iPhone versus Pro iPhone, you're basically making this decision based on the camera. - And bigger display. - Okay, and bigger display. Fair, granted. Which, I will say anecdotally it seems like has turned more people off than on just from what I've heard. - Seven inch phone. I mean, that's not math. Hold on. Almost seven inches of phone. - Yeah. So, I mean, I held it and if you hold it without holding the 15 Pro Max in your hand, you're like, ah, it's manageable. And then you hold them next to each other and you're like, well this phone is big and this phone is a surfboard. - Oh wow. And you're a Max guy. So for you to say that is not small. Yeah - Yeah, it's not anywhere close to a small phone. It's enormous. I love it. I'm gonna, I'm super gonna buy it. You know, obviously some people buy the Pro just for a camera, but then people were also going up to the Pro Max size because it had the better Zoom lens. - Right. - And now it's the same Zoom lens on both. So you're not being forced into that biggest phone. You can sort of stop at gigantic and still get kind of the best camera system. And I think the 48 megapixel ultra wide here is a big deal. It's still the ultra wide. It doesn't capture as much light and it's impossible to like really evaluate iPhone cameras at Apple Park 'cause it's like a beautifully lit space no matter where you are. - The best lit place you will ever... - It's like angelic light from the heavens. Just like uses the environment. So it's impossible to evaluate. But I took a bunch of photos and obviously the main camera is way better. Obviously the main camera has more modes and all this other stuff and then they've, but the having a 48 megapixel ultra means you do get some more detail. You get, you know, it's just a better camera than the old ultra wide. And I actually use the Ultra a lot. So I'm pretty excited about it. - What do you use the ultra wide for? - I'm just often in a space where it's like, I wanna take a picture of Max and I wanna capture the environment that I'm in with Max. - Yep. - Like here's the whole playground. And like that's a useful, it's just a useful tool. - That's exactly my experience, which is why I asked it is constantly like I can either get like the shoulders up shot or I can use the ultra wide. So that for me is, it's exactly the same thing. - Yeah. - But I think for the Pro, like the reason I brought this up when we started talking about the camera thing is the, a big part of the keynote was about all of these new camera modes and all the different ways you can shoot. And the fact that natural is just like a mode now is deeply fascinating to me. That they're like, you can shoot a thousand ways. One of them is regular and and here's a bunch of other ones. And I just feel like obviously Nilay, you were in the room so you saw this stuff on the screen, which is always hit and miss, everything always looks great on the screen. Has been my experience. But also like, took some pictures and saw 'em on the screen. Like what do you make of Apple's sort of million new ideas about photo processing here? - Well one, lemme tell you two things about the screen. Something else Phil Schiller told me. So again, they built the Steve Jobs Theater. They designed it ages ago and he pointed out to me, they built it for projectors. Like the room is designed for big projectors and then they wanted to do a big LED screen 'cause that's what everyone does now. So they had to basically engineer their own screen for the theater and it goes past the wings of the stage. So to get the size and shape they wanted. - That's very apple. - And Apple designed and engineered their own LED screen, which is hella bright. Let me just tell you, hella bright. The other thing I saw the audio in that room, I keep talking about like the room and like it was very cheery in there. It was a little boomy today, unlike other times. Things were today at the Steve Jobs. Anyhow, so it's hard to know like all the modes. Yeah, every time I see Apple's camera team, they basically are like, here we go again. That's their attitude towards me. No they're into it. All these companies are like run by extremely type A individuals who wanna fight. They would just prefer to win. So it's like, I always have these great conversations. It's always super interesting. In their point of view now, which again, we have to review the phones, we have to see how true this is. It appears to be that they have realized that people are gonna filter the photos anyway, right? So they're like, look, people have a radically different interpretation of what their own skin tone is and we just have to get outta their way. Like that's not for us to decide anymore. So here's all these options and there's all these sliders and photo styles have existed on the iPhone for ages. In fact, they started as a response to the Pixel. 'Cause you will remember back when computational photography started and the Pixel team and Mark Levoy were talking about like, you know, like old painters they liked and shadows and details. The iPhone was like too bright and too even. And we'd be like, we like the Pixels contrast. So they added photo styles and one of them was basically like, shut up, about the Pixel, but it was destructive so you could shoot in that mode and that was it. And the reason they're making a big deal about it again is they've re-engineered the photo pipeline so you can change it at will after the shot. And so that means you can capture all the stuff and you can do all, you don't call in filters. You're very careful to say like this kind of photo prop processing dates back to the 1800s, all this stuff. But the idea is you'll be able to get a much more DSLR type photo with like heavy shadows and heavy detail or a much more modern smartphone ultra tone matched photo where all shadows have been banished from the face of the earth never to be spoken again. And now those are controls. Are anyone gonna use these controls? I don't know. The power of defaults really matter. And does natural on an iPhone still have to stand for something? It does. Can you evaluate it inside of the angelic light of the sea chop? You cannot. So you have to get it. But I think they're starting to see that other, that their users are constantly changing these photos anyway. And so their own point of view has to kind of be a good starting plate for all the changes to come. - Do you guys use those modes now? 'Cause I just realized I've had it set in rich contrast for probably as long as I've had this phone. - That's Pixel mode. - That's Pixel mode. Oh, that's interesting. - Yep. - I've been in pixel mode for years. - I think that's really telling, right? Like the power of defaults is a really real thing here. And I think what I wonder about the Pro is whether it is more prone to get people who are more likely to be interested in fussing with those things. Obviously at the very top end, like the kind of people who are shooting the 4K 120 stuff and holding it up in a gimbal and like the people Apple likes to show in keynotes and in their ads. Those are the people who are gonna use these filters. And I think we'll be psyched about it, right? Like to have more options to do this stuff, \"in camera\" is great, all for it. But I think the like interface question of how you surface this stuff for regular people is really fascinating and really hard. And I think it's kind of how I feel about the camera control thing, right? I think most people will figure out that if I smash this button, it will take a picture. And everything more nuanced than that, you start to lose some giant percentage of the number of people who are gonna use the phone. - That's why I keep thinking about this Apple Intelligence. Like, I mean obviously it's very easy to turn it into the personal assistant for your phone at settings, but that feels like a win at this point if it really works. That's like the thing you wanna advertise constantly. Tell everybody, look at all these cool settings. It's too hard to remember, Siri guys. - What would you say? Like, make this photo look like the 1980s and if everyone was doing drugs. - Yeah, that's exactly what you say. I say like, I want that creepy 2000 digital camera vibe. - Right, but do you want that, do you wanna say that before you take the photo or after you take the photo? - Well, you can do both now as I understand it with the Pro. It'll let you change the style after they said that was a big part of the the thing. - It will but there's, you know, there's just parts of taking a photo. Like how long is the exposure? Like, do you want to fire the flash? If you want that indie sleeves look, like you might wanna fire the flash. Like there's a lot of steps in between, make it look like this. and just tell the robot to make it look like this. - I want the robot to do all of it. - And Apple does does too. - Yeah. - Well, to be clear, once again, none of that is shipping yet. And what Alex is describing in particular is just like us dreaming. - Yeah. That's.... - That you'll be able to just like talk to the phone, it'll do stuff. - It's my hope. - It's also Apple dreaming. That is, like, we're not making that up, that's Apple's idea. - Right and Apple wants to plug third party apps in series. They can do this stuff. We're just nowhere close, like that is all pure vapor. That's not even, it's gonna ship in the next version of 18.1 that's maybe a year away. And what we have now, right now in the camera, particularly pro camera, is infinite customizability. So if you know what you want, the camera can now get way closer to delivering it. And that is different than are the photos by default more realistic or less over processed? We just don't know. But the idea that the camera is now infinitely more flexible in the pro model is, I think it's borne out by just the number of controls you have and the fact that most of the pipelines aren't destructive anymore. - Yeah. - Yeah. Which I think is very cool. Alright, we need to take a break. We've been talking about camera buttons for way too long. Any parting thoughts on the iPhones? Nilay, you've held all the things. Anything that jumped out to you before we stop talking about phones? - The Pro Max is really big and all of the phones are really nice in a way that I don't think has been a, I think... - Like iPhone five nice. Like peak iPhone nice? - No, but they're the most refined versions of this design I've seen in quite a while. And I honestly think the 16, once they get some of the features, they'll move, like people will buy 'em. - Okay. That's very exciting. All right, we gotta take a break. We'll be right back. (upbeat music) - [Narrator] Support for the Vergecast comes from Mint Mobile. If you're looking to reduce your monthly expenses, one of the first things you can save on is your phone. A lot of us pay way too much for wireless service, which is why Mint Mobile is doing things differently. When you switch to Mint Mobile, you get three months of premium wireless service for just 15 bucks a month. All of mint's phone plans come with high speed 5G data and unlimited talk and text. Plus, you don't need to worry about getting a new phone or phone number. Just take those with you over to your new Mint plan. To get this new customer offer and your new three month unlimited wireless plan for just 15 bucks a month, go to mintmobile.com/verge. That's mintmobile.com/verge. Cut your wireless bill of 15 bucks a month at mintmobile.com/verge. $45 upfront payment required equivalent to $15 a month. New customers on first three month plan only. Speed slower, above 40 gigabytes on unlimited plan. Additional taxes, fees and restrictions apply. See Mint Mobile for details. (light music) - All right, we're back. We've had the ad break to think. Any more phone thoughts? Everybody feel good? I didn't yell about the battery life, but I'm gonna not yell about the battery life. - You'll have time. - Yeah, I feel like we need to talk about the processor and the battery life. So they kept saying it was the best battery life ever without a number. - Yeah. - Just the best? - The one that really killed me was there was a moment during the keynote where there was a slide in which they showed the battery meter with the green and then just extended it, so that was more green. That doesn't mean anything. What am I supposed to do with that? Oh, good, you made the icon longer. Congratulations. That accomplished. I'm so angry at how many times they said battery life without giving any actual information about battery life. - So I think... - Just trust them. - The 16 Pro Max is supposed to the best battery life ever on iPhone. I also say my 15th Pro Max has garbage battery life. It is absolutely abhorrent. Like it is just bad. - My 15 has deteriorated faster than any iPhone I've ever used. - I haven't even looked at the deterioration. I'm just like, oh, it's the middle of the day, I should charge my phone. That's where I am with this phone. - That's tough. - But the stats as far as I can tell, what they're talking about is hours of video playback as a proxy for everything else. They just don't want to be like 33 hours of video playback on a slide. - We spent a bunch of time last week talking about how stupid a metric that is. So whatever, we can move on. (Alex and Nilay laughing) - We'll talk about it next week. - I frequently watched dozens of hours of consecutive offline video on my phone. Do you guys not, is that... - Yeah. - That's not what people do? - On it's hyper optimized video playback engine. Yeah. Amazing. - So you wanted to say something about the processor? - The processor, speaking of optimized video playback engines. A lot of our commenters have noticed that the processor upgrades on the phone made for AI don't amount to much, like you actually still get, it's like 35 flops, right? Is the thing. And that's what you get, like the end. - But on a phone. Ooh! - Well sure, but that's the same as like last year. So I think the made for AI claims are kind of like running right up against the reality of phone development times. And I think most of what they've done is just put a bunch of RAM in all these phones. - Yeah. Eight gigs! - Yeah. - They loaded them up. - Which is great. Like terrific. More RAM is a good thing. - They're not each $400 more because Apple put more RAM in them is really impressive. - Seriously. Yeah. But no, to some extent, the processor thing I think is whatever, right? Like, I think you're right, that if you were going to make like an AI phone that wanted to do all this vastly complicated stuff offline and locally and be awesome, fine. But like what you have in the A18 is going to do the job of writing business emails for you perfectly fine. Like the ceiling of interesting AI features right now is still so much lower on a device like this than the performance ceiling of the device that I'm just not bothered by this. - Just you wait David, it's gonna write the most beautiful email. - I hope I'm wrong. Like someday in 2036 when Apple Intelligence actually ships, maybe it'll be amazing. Everything changes really fast. Who knows? - It's gonna be an email that makes you weep. You're gonna be like, how could it, no human could write this. It's too pretty. - The thing is I'll never see it. My Apple mail will just summarize it for me. I'll never even see it. It's no problems. - And that summary will also be beautiful. But we should talk about, we should talk about these AirPods, right? - Yeah, let's talk AirPods. - 'Cause these are actually exciting. Yeah. - I think this was the coolest part of the whole thing. - I was about to say it was three AirPods. I think it was four AirPods. Will you run this down for us? - Well, so yeah, like, yeah it's four technically. - I think it's four. - It is four. Well, three. - It's like three and a half. - Yeah, we'll go three and a half. We'll go three and a half. So there's the AirPods 4. - It's two - Two flat... We'll get there. We're doing Apple maps. - If they can have four lenses. - It might be six or seven. We'll see. - We're just gonna keep adding. - It's two. Alright, go ahead. - Okay, so they're the AirPods 4 and there are, Nilay is correct, two versions of them. There's one that's like $129 and it's got, you know, it's the new shape and all of that stuff. And then there's one that's $179 and that's also got active noise canceling in it. And in both cases there'll be head shake to respond to Siri. I believe the personalized facial audio, is that in both? I'm pretty sure. The H2 chip is gonna be in both, USBC charging case. 30 hours of battery life. The battery case is gonna have a little speaker in it so it'll beep beep when you lose it. Which has been hugely helpful with my Pros. They rule, like these are just, these are really good iPods. And then just 'cause I have to prove that there's four updates. There's the AirPods Max, which are still just $549. That didn't change. But now we get some more colors and you can charge 'em with USB-C. You don't have to care about your lightning cable. So technically new AirPod Max. - And just right there, you talked about it longer than Apple did during the keynote. - I did. Thank you. - It was like somebody at Apple was being held hostage until they mentioned the AirPod Max. - They didn't even list the colors. - It was so bizarre. They were like new colors USB-C, moving up. Okay. - They also were like, it's still $549. The AirPods Max are absolutely not a new product. They changed the connector, they should have add a year and a half ago, if not more. And they made two colors. It's the same. We're gonna get 'em the Apple watch. Same with the Apple Watch Ultra 2. They're like, here's a video about how it's black now. - It sure is. - I almost wrote in the Liveblog when there's a long sweeping shot of the watch band. You know, there's nothing else to tell you. But anyway, so wait, Cranz, did you talk about the AirPods pros? - No, no. And then this our fourth set of AirPods. The fourth one is the AirPods Pro 2, which will not change in any reasonable way, but they are new because they're getting hearing aid features. - Yeah, that's cool. - New feature. That means a whole new audience. That's basically new. - That is the single most important of this entire event. But that is new AirPods. I just wanna be, they announced two new AirPods and some software features of monumental importance. - Can I just admit something right now on this show? I didn't realize until right now that it was just a software update. I thought there had to be something new in the hardware, if you're gonna tell me about how this is a hearing aid. You're telling me this is just a software update? - It's just a software update. - So if I have existing AirPods Pros, they're gonna get these two? - They have to be the 2. - Yeah, you need the AirPods 2, AirPod AirPods Pro 2. AirPods 2 Pro, 2 Pro two series. - Attorneys General. - You need the H2 chip. So you need the second generation AirPods Pro. And then you need a phone that can run iOS 18. So there's some cutoff on what phone you have. But if you have those two things, you can take the hearing test, which will, you know, Apple has to finish its FDA clearance. They say they're gonna do it, and then they can act as hearing aids for the same battery life as they get now about six hours. - I mean, you did that the, like, I'd be remiss if I didn't point out, FDA clearance is in fact a thing they have to still get. - They have to still get it. They haven't gotten it yet. They say they're gonna get it around the world as well. They're also very careful with the language. They're not hearing aids. They have a certified hearing aids functionality, - Which there's a lot of hearing aids now that were kind of like AirPods. So this feels like a huge deal. - Again, I think I've told this story in the Vergecast before, but I'll tell it again. The only thing that our government of old people accomplished in the Trump administration is they all got together and passed bipartisan legislation that Trump signed to make hearing aids legal over the counter. 'Cause they were all a million years old. Chuck Schumer and Nancy Pelosi and Mitch McConnell and Donald Trump were like, yeah, yeah, we should make hearing aids easier to get 'cause we're all a billion years old. - We can't hear shit. - It's a triumph of bipartisanship that would, they passed a lot making hearing aids available over the counter in this way. Sony has 'em, Bose has 'em. A bunch of other companies sprung up. Bose entered the space and they left the space. They came back in with a partner 'cause they're complicated. I sort of asked about this with Apple, Apple's attitude is like, it's not that complicated for us 'cause we're Apple. And then also fascinatingly, their belief is that because they're AirPods they'll be more socially acceptable than hearing aids. - I believe that a hundred percent. I think that is by far the most exciting thing about this is like we were debating this in the newsroom today, but like we have long since reached the point where just having one AirPod in all the time is completely socially normal and acceptable, right? Like, it's, you can feel about it however you want, but like that it's just a fact. That's where we are in the world. One of my favorite things is to see couples walking down the street, holding hands, talking to each other, each with like the opposite AirPod in. Like, it's just life now, people do it. And the fact that... - Is this something you see couples do or is this something you do in your relationship? - I was like, David, I've never seen this. - I would never, I see people doing this all the time. You need to go outside more often Cranz. I don't know what people do in New Jersey. - I was like, they don't do that in Jersey. - But no, but I think the idea, there are lots of interesting questions about, like... - I just wanna point out that David lives in Washington DC, home of an infinite variety of government lawyers and contractors and it sort of makes sense that they've all replaced Blackberry hand with AirPod ear. - A hundred percent. A hundred percent. DC was definitely like the last vestige of the huge Bluetooth headset. And they just like, they went straight into wearing AirPods on Hinge dates. Like that's just... - It's an election year and everyone's got one AirPod in is like what David is describing. Alright. - It's just Ezra Klein talking to every single person in Washington DC all at the same time. (all laughing) That's just what it is. - That's not wrong. Yeah, that makes sense. - It's you, me and Ezra on a date together at all times. That's great. But no, I think the fact that no one would look at you twice for wearing an AirPod in a coffee shop is like a huge part of the reason this is incredibly compelling. I think it's so cool. - But does this mean that now people are just, I mean people are just gonna talk to you when you have your AirPods in. Like before it was like a universal sign of don't talk to me. And now it's gonna be like, I'll talk to you. That might be a hearing aid. - If you zoom out, Apple pitched a pretty weird vision of reality today where you are always wearing AirPods. - This is what I'm saying. I don't that's a vision, I think that is reality. - No, but like you're wearing them at a concert, you're wearing them to prevent hearing loss. You're in adaptive mode all the time where like.... - On your job site site. - All you're hearing is being modulated through AirPods. Like they're just prosthetics. Fine. And then I, not to get too in the weeds of weirdness, Apple also makes the Vision Pro, which wants to mediate your site. And after a while you're just like, Tim Cook is building a helmet and you're gonna go in the helmet and Apple's gonna manage the world for you and like clean it up for you. And that is a weird vision of the future. But the amount of, let us put a computer in between you and reality is very high in Apple world right now. That said, and you know, you can feel about wearing AirPods... - Isn't that whole episode of Black Mirror too. - Tim Cook builds a helmet. It's a great episode of Black Mirror. (Alex laughing) All that is to say, maybe that stuff will hit regular people in different ways. The actual hearing aid functionality, if they can get more people to take real hearing tests and then wear hearing aids, they will do a great service to the world. Like this is very exciting. And all those competitor hearing aids I was talking about from Sony and Bose and all these other companies, a thousand dollars. - Yeah. No, this could change my Thanksgiving. - And they have like bad apps and weird features and all this other stuff. This is what, AirPod Pros are 250, right? 250 bucks and the hearing test is built into the OS and it is perfectly tuned. And you might have, might not have the weird social acceptability problems, that's a very meaningful. Again, I think it's probably the biggest announcement they made today in the scale of things. - Yeah. - I agree. And the fact that you take that hearing test and not only does it tune the hearing aid stuff, but it tunes everything else in the AirPods to you, I think is very cool. Like Apple has clearly kind of gone all the way down this road. Watching them talk about it, it made me think about the stuff that they did for the Vision Pro, which is like, you have to do an incredible amount of work because of the affordances of like the human body. So they had to like invent this new way to scan your face to do it and created this whole crazy pipeline just to get the thing to work on your face, for some reason. This feels like it's in service of like a much cooler, more real thing for people. Which I agree. I think it's... - But they've done this before too. Like, the bit where it's supposed to modulate the hearing and stuff, they've done that before. Like that's an accessibility feature now I think where you can put it in and it'll do a hearing test. - Yeah, they've had the voice captions, they've had transparency mode. They've had live listen, they've done a lot of stuff that walks right up to this line. - Yeah. - This is just over the line. Like the FDA is gonna tell people these are hearing aid features and mean it, and that I think at 250 bucks it's just vastly more accessible for so many people. - Well I'm just curious the quality of it because some of those changes they've done before, like I've messed with those accessibility features and they're not that great. Like the one where it's supposed to do kind of a little hearing test and be like, we're gonna make the sound even better for your ears. My guess my ears are garbage. - You don't love your personalized spatial audio. - Your ears are good. - There we go. - Right, so if you don't have some big, as you get older, right, you lose your high frequencies. It's like, have you ever watched these like TikTok videos? It's like we can guess how old you are. - Oh no, there's a whole thing right now about a remarkable, and this this wine that people hear. Apparently the new... - Oh, interesting. - 'Cause I've been spending a lot of time going... - They've got super high-pitched wine on the tablets. - Yeah and I'm like, oh my god, am I just so old I didn't hear this wine on the remarkable. - Right, so you're losing, you might be losing the very, very top end, but as you get older you lose even more or you have different cutouts or what all this stuff happens. So if you have reasonably good ears, let's tune it to make it work for you is gonna accomplish nothing. 'cause there's nothing to tune. - Okay. - If you have frequency dropouts or other kinds of hearing issues, the tuning will actually overcome it and it will sound clear and rich again. So, will any of this work? I have no idea, on AirPods. This is what audiologists do today to tune real hearing aids. - You just made my ears sound better, so this is great. - Yeah, you should be proud of, I mean, you can't hear the remarkable, you're getting old Alex, you should... - I know I'm getting old. I can't hear the remarkable, but the accessibility feature on AirPods sucks for me. So that means my hearing great. - Most of those things are just scams perpetrated by young people to make old people feel old. They're not playing sound when they're like, only young people can hear this. This is what I told about. - That's totally how you know, you're getting old. That's it, right there. - But I think the thing you just mentioned, Nilay, I think is actually like the question of all of the AirPods kind of all the way down the line, not including the Max, which are technically a new product, but you know, whatever. That can Apple back these really advanced features into the existing product, I think is the question, right? And even if you go down to the regular AirPods, it's a $50 upgrade to get noise cancellation. And if Apple has figured out how to do like genuinely good ANC inside of an open ear set of headphones, that's a big deal. $50 is a lot of money to spend for that particular upgrade. Especially if you're like, if you're not so price sensitive that you only want the cheapest one, but you're too price sensitive to buy the pros. Like there's a very odd sort of middle ground there that I think Apple is trying to strike. And the question of can we bring these advanced features down into a different form factor that is not optimized and designed for those features kind of is the question. And I have no idea. Have you tried these things at all yet? - [Nilay] I have not yet. - Okay. - I don't know if I believe it. Like we have to see it. Like noise canceling is pretty dumb technology. It's very clever and you need a lot of processing power to do it. But the idea is pretty dumb, right? You listen to some things that you identify as noise and then you just play back their inverse to cancel out... - The opposite of that noise. Yeah. - Right, it's a very dumb idea. And the hard parts are like identifying what is noise, making sure you don't, you know, accidentally clip a bunch of useful frequencies, all this other stuff. Doing it open ear, you're just not in control of the sound environment. Like sound is literally getting around the headphones. So are they just gonna run a bunch of like white noise cancellation, like super, like will other people be able to hear the cancellation is like kind of what I'm interested in. - Oh, that's interesting. - Well, I'm also curious... They have to fit, right? Like, the whole thing that they don't have a seal, they just sort of sit in your ear. I never liked them because they were that leaky, 'cause I could hear everything around me. And now I'm gonna be able to hear everything around me, but then sometimes it's gonna be blocking some stuff that feels like a good recipe for like your brain just getting messed up. Try and listen to your headphones. - Yeah. I mean, we'll see. - But it's Apple. I would expect they wouldn't break brains with product. - Yeah, I mean they're gonna, they're confident in it is what I'd say. - [Alex] Yeah. - Yeah, and I think it is the sort of thing that it's an odd skew of the product. Like if you go to Apple's website right now and you go to buy AirPods, the options are AirPods and AirPods with adaptive noise cancellation. And I think if you have a product that is technically titled AirPods with adaptive noise cancellation, you should maybe rethink your product SKUs. But like, if they've done that, I think suddenly like this becomes at $179, like maybe the pair of headphones that just about everybody should buy. - But I don't think that's gonna be the case because of the fit. Like, I like the fit on the AirPods is so specific and it works for a lot of people. And if it doesn't work for you, it sucks. - That's true of the Pros too though. - Can I say two things about this? One, Apple said without any sourcing that AirPods too are the most popular headphones in the world, which I can believe I would just... - Sure. - Sure. Yeah, it's like The Verge is the most popular website in the world. Like sure, you can believe it. We are by the way. - It's true. - And then second, they introduced the new AirPods 4 with this sort of like, you know, short description. Everyone's ears are different. They measured all the ears and they got to the right shape. - They said that the first time. - No, no, not even the first time. They said that when they announced the wired AirPods (Alex laughing) with not, I think not even the first iPhone, like with an iPod nano is when AirPods came out, right? - Yeah. Yeah, 'cause you would ask, like, I've asked them before, Hey, are we ever gonna get different sizes because these are too big for some ears? And they'd be like, no, we did a test and it works for 90.9% or whatever, you're fine. - But the thing is like that's true. Like it turns out that everyone started wearing AirPods and buying iPhones because they worked for most people. - Oh no, I can't use the original AirPods. I couldn't fit in them at all. - Well listen Alex, we've established... - I've got tiny ear canals, okay? This is a very specific problem for me. - Do Pros fit or you're good with Pros? - Yeah Pros fit, but I have to use this... - I'm the opposite, Pros feel awful on me. - Yeah. - So Apple announced the AirPods in 2012. It was a Jony Ive video, it was alongside the iPhone 5 and the iPod. It was like iPod. This is how old they were. And at the time they were like, we asked more than 600 people to test over a hundred iterations of the AirPods. We made 'em run on treadmills in extreme heat and cold. They did cardio, they shook their heads up and down, and AirPods are like the design that fit the most ears. And now we're like 12 years later and they're like, we did it again. We've once again measured all of the ears in the world and they look a little bit different. And maybe that's true. - Evolution baby. - Sure. - It's true. They stuck with this design for a long time and maybe ears have changed, but I think the reason AirPods Pro are the most more popular headphones even are more expensive. Maybe just the word Pro in the name. Maybe it's noise canceling. I actually just think they stay in people's ears better. - Yeah, I would agree. - I do agree with that. And I think especially early on, the regular AirPods developed a reputation for falling out of your head, right? Like there, for years there were all those stories of people like losing the AirPod on the street and it would fall down. And the, whether it was true for you or not, that fear was real. And even for somebody like me, they fit well in my ears, they don't fall out. I am perpetually terrified they're gonna fall out because they feel loose. Which is actually like the point, right? Like, that's why I like them because they don't feel like they're smooshed into my head, but it makes me feel like they're gonna fall out all the time. And the Pros for better and worse, smoosh into your head and don't feel that way. And I think that is real for people. Like, I agree with you. - You see people like covering their ears sometimes if they're walking over a drain or hopping on the train. And 'cause I think like the OG AirPods feel kind of like earrings, but then like clip on earrings. This is something neither one of you probably have a lot of familiarity with, but, you know, there's earrings like go in your ear and they hang right there. That's true. What's that little piercing there David? Looks great. But people, you know, they like, and when you have those clip-ons, you're constantly like holding your hands up because they're gonna fall off. And AirPods feel the same way. And nobody wants, nobody wants clip-ons. - I just like how much you two are looking at people in their AirPods, like as anthropologists. Like David's like, there's another couple wearing one AirPod each. And Alex is like, another person's here bluffing over a drain and... - It's nice because then I'm like, oh, I'm not alone. - I'm fascinated. - It's called journalism. - Yeah, that too. - This is also why I read everyone's screens when they're texting on the train. It's journalism. - I love it when you find somebody like typing spicy stuff. You're like... - Oh my god. I literal, one time, this is a true story, missed my train and rode it for one extra hour because there was a guy, I was standing and he was sitting in like the first seat next to me and he was in the middle of breaking up with his girlfriend over text messages. And rode the train one more hour than I needed to. Just, I got through the whole breakup. It was spectacular. It involved 7,000 words of text messages. - Wow! - It was incredible. - Were you like, just call her on the phone. - Seriously, it's like I'll FaceTime her right now. Like, we can do this together. It'll be fine. - You just sit down next to him. - I hear on the market, the guy next to me on the plane here, I swear to God was trying to rot August flight. He failed, six hour flight from New York to California. Failed. Failed. Just like failed. Then he picked up his phone, started typing in all lowercase in notes app for a while. Didn't read it. I did see him text the words, I need to write my own narrative to a friend, also in lower case. And then weirdest of all, on his phone, on on Delta wifi, which is garbage, started powering through Gmail on the web in Safari with the banner at the top of the screen. It said \"Gmail's better in the app\". And I kept wanting, he'd be like, bro, it is better in the app. - I love him. - I honestly believe in moments like that it is a, it should be allowed to just reach over and tap the open button that opens into the app. I really believe that. - I was like, how are you using Safari with the address bar in the bottom and you've got... All right. No, that's fine. - That hurts me to think up. - He needs that 6.7 inch iPhone or 6.9 inch iPhone. He needs a big one. - You can read more line of text. - Yeah. (laughing) - Speaking of one more line of text, let's talk about the watches. - Yeah, they're big. - They are big. - Another moment in this keynote where Apple took a minute to explain what you can do with a bigger screen to see more things. I would like, if anyone's out there, if you can make me a super cut of Apple executives patiently explaining that you can see more content on a bigger screen over the past five years, I think it would be amazing. - It would also be hours long. So, okay, the basic rundown on the watches as I understand it, is Apple Watch series 10. New design that looks an awful lot like the old design. It's thinner, it has a bigger screen. It comes in black. I would say those are the salient points. It also comes in other colors. Nobody seems to care about those colors. It comes in black. Everybody's pretty excited about that fact. - Shiny black. - Okay, how shiny are we talking? Well, okay, hold on, we'll get to, I wanna hear what you think Nilay. But then there's also the watch two, which is nothing at all has changed except now it also comes in black. Which again... - The Ultra. - What did I say? - You said watch two. Son of a apple. - The watch two, it's dramatic changes since the Apple Watch series. - It's changed a lot since the watch two. - If you have a watch two, you're in for a treat. - But the Apple Watch Ultra two is unchanged. They basically reintroduced the product. They're like the Ultra 2 is great for swimming and rowing and diving and also just looking chunky and like you have money, also it's black now. Then that was the end of that. - Yep. - But the series 10 is a new design. It looks for all the world like the old design, it's just thinner, it's more rounded on the top. And yeah, it comes in polished, aluminum black. - It charges faster, which I think is very exciting. But the design is the one I'm curious about. 'Cause I, my immediate reaction when they said thinner was, I don't care, right? Like, I looked at the watch that was on my wrist and I was like, I don't know that I've ever wished for this thing to be thinner. It's how I feel about my iPhone, right? Like every time they make it thinner, I'm like, it's nothing for me. But then there were a bunch of people I saw on Threads and elsewhere who were like, oh, you know, just based on like the, the clothes I wear or like how I use my wrist, having something that's thinner is actually really meaningful. So what I'm curious about Nilay, especially as somebody who wears the chunky one every day, did it feel different? Like if you had just picked it up, would you have been able to tell, 'cause it's been years really since you've been able to tell kind of which one you were picking up. - If you were paying attention. Yeah. For a normal person you'd be like, the screen's bigger and that would be the thing. - Okay. - Right. You know how you could tell between a two and a four 'cause the screen got bigger? Was the four or five with the screen got bigger? I think it was the four, right? - I think that's right. - So you know, the screen got bigger so you could tell. And then the four to everything else, you couldn't tell, it's that again. So it's like a very minor adjustment, but it's bigger, thinner I think is hard. But it, you know, for all intents and purposes, it's the same design. Like we can lie to ourselves and say it's not the same design. But it's the same design. - Is the 10 screen now bigger than the ultra screen? - Yes, that's the thing they said. - Wild, wild. - Just the both screens or the 40 is, 'cause it's a 49. - No, the the case is the same size, but I guess because they made the screen bigger in the case. - Okay, so the so there's a 42 and 46 or the case sizes. And the screen on both of them is bigger than the ultra? - No, it has to just be the 46. - It has to be, yeah. - Yeah. Okay. - Yeah, I mean it looks very nice. It looks very cool. You know, the highlight features actually sleep apnea detection, not the size. We get to see how well sleep apnea detection works. Another FDA clearance situation for Apple. - Did either of you have a moment during the keynote where you were like, oh God, am I about to find out I have sleep apnea. Like I don't know if this is a thing I wanna know about myself. - I'm ready. I'm ready to learn. I'm open to new experiences. - I don't like wearing a watch when I sleep. You don't sleep with your watch? - No, - I just, no thank you. - I would say truly sincerely, my single favorite thing about the Apple Watch is how good an alarm clock it is for my body. Like it wakes me up better and easier and more pleasantly than any alarm clock I've ever tried. And that is like two thirds of the reason I wear it. - But when do you charge it? - So I actually, this is the reason faster charging is very exciting to me. I charge it, typically I will take it off when I go to shower in the morning and I will just leave it on their charger till it's full. And sometimes that means I leave it there for five days because I just forget about it. But so the idea of actually being able to like put it down, go shower, come back and it has charged, well I think it was 80% in 30 minutes it was supposed to be. If it gets to that, suddenly in my own experience Apple watch battery life sort of ceases to be a thing. And I find that very exciting. - Yeah. - And the battery life's gotten really good over the last few years anyway. - The ultra is pretty good. I think the ultra ultra is still rated like double what the series 10 is. I worry a little about the series 10, bigger screen, brighter screen. - Thinner. - Thinner. Does not typically bode well for good battery. - Yeah. Oh one, can I just say one thing? Random comment on screens. The screens on the iPhone 16, 16 Pro can now go down to one knit of brightness. It's actually wild to look at. You turn the brightness all the way down, it's like the, it's just like a ghost of an image. It's pretty cool. - That's actually awesome. Like as somebody who uses my phone in bed more than I'm proud of, being able to get it like properly dim. - Have you get a one knit in bed? - Yeah, that's the dream. Like we were talking last week about like E ink devices and like what if you could make your screen not look so blue and bright, like one minute of brightness will do it. That'll get you there. (all laughing) - Yeah. No, it was very impressive. And then 2000, its in sunlight, which is ridiculous, but... - Yeah, - I really like... - You accidentally flash it on in bed. - Who was it? Was it Craig or somebody else who was like, sometimes people look at their watches at an angle. And I was like, yeah, thanks dude. People look at their watches at an angle, crazy. - The viewing angle of the watch, the series 10 OLED is picked. I mean like again, if you watch this keynote, the number of times where they explain things like basic facts about screens is so no one has seen a screen before is hilarious. - Yeah - Wide angle OLED. - Yeah. Yeah. - That's like a whole phrase. - Also, and I say this in all compliments is though Apple doesn't already make the best screens consistently in the industry. They're like this piece of garbage series on in display. You couldn't even look at it from an angle. It's, you're fine. Actually, no one was worried about that before. - No, not a real thing. Wait, I wanna know about the blacks. Talk about the blacks. You looked at both watches. Sincerely, it seems like if Apple had just gotten on stage and said we've changed nothing except both watches now come in black, everybody would've been psyched and gone home happy. You've seen them both. How do they look in black? - To be clear, they said we've changed nothing on one watch, which now comes in black. - Okay, fair. - And I was like, I'm gonna buy that watch. - There's a new watch face that does sort of a swirly thing where you can't really tell what time it is. That's fun. - Yeah, it's pretty. - I was talking to an Apple person wearing the black Ultra 2. And I don't even know what that person was saying. I was just like... - Just staring at the watch. - I was like, what if I just (speaking indistinctly) Like what if that was on my wrist and not yours? So that's great. I'm gonna buy that one. The shiny aluminum. It is shiny aluminum black. Like it's fine. Like I dunno what to say about it. It's a black metallic. - The shiny worries me because of scratches. Should I be worried about scratches? - You know, that thing was so covered in fingerprints when I looked at it. I couldn't tell you if it was scratched or not. You know... - Also not great. - It's just not what you want. - Did you notice my pictures of the phone? Also fingerprint city. But everybody puts the phone in cases, so who knows. - That's also, yeah, it's been true for years. - Every Apple product is. - But you don't have to put it in cases. Ceramic case. - The watch, you don't put a case. By the way, the back of the Apple watch Ultra 2 has special black sapphire glass. I'm gonna buy this product so fast for no reason. (David and Alex laughing) It's so stupid. - I've been trying to decide. So I have a series eight. That is fine. It is like, it is a perfectly serviceable Apple watch. And I found myself looking at the 10 being like, well, it's great looking and I like the black a lot, but is there anything here that I'm like, I need this upgrade for some reason. I landed on bigger screen seems good and the faster charging would be really helpful. That's the only two things I landed on. - Yeah, from an eight that's not a big jump. I mean, the sleep apnea will be nice. - Again, do I wanna find out if I have sleep apnea? - You're gonna find out if you're choking. - Am I ready for this information about myself. - Dying at night, every night. - Alex, you just said the sleep apnea will be nice. - Yeah, it'll be. The sleep apnea, you get it actually. You get the watch and then you get sleep apnea. - David is married and being married means you have a built-in sleep apnea detector. - She doesn't like how I breathe when I'm awake. So I think sleep would not be a problem. (Alex and Nilay laughing) - It's real. If you are married and you can't reliably tell you have sleep apnea, like you just need to show them the list of sleep apnea symptoms and you'll be fine. (Alex laughing) - Yeah, that seems right. All right, we need to take one more break and then we're gonna do a lightning round of other Apple stuff and then we're gonna get outta here. We'll be right back. (upbeat music) - [Narrator] Support for the Vergecast comes from Mint Mobile. Look, there are a lot of ways to spend 15 bucks. You can get a single movie ticket, a mini Zen garden, a sensible pair of socks, maybe a burrito and a half. Or you can get a new phone plan. When you switch to MIT Mobile, you can get three months of premium wireless service for just 15 bucks a month. All of MIT's phone plans come with high speed 5G data and unlimited talk and text. Plus you don't need to worry about getting a new phone or a phone number. Just take those with you over to your new Mint plan. To get this new customer offer and your new three month unlimited wireless plan for just 15 bucks a month, go to mintmobile.com/verge. That's mint mobile.com/verge. Cut your wireless bill of 15 bucks a month at mintmobile.com/verge. $45 upfront payment required equivalent to $15 a month. New customers on the first three month plan only. Speed slower above 40 gigabytes on unlimited plan. Additional taxes, fees and restrictions apply. See Mint Mobile for details. (light music) - All right, we're back. So that was all the big stuff. There's lots of software stuff to talk about, but I feel like that's actually probably better for next week. - Or when it ships. - Well it's all shipping next week. All the, well, all the new OSs are shipping next week. All the Apple Intelligence stuff is shipping someday in the unknown future. - If you are a new Apple OS and you don't have Apple Intelligence, are you a new Apple OS yet? - Yeah, dude, have you seen how you can move the icons around on the grid now? Game changer. - I actually, I'm soliciting notes. We're gonna have to review these phones. I don't know how, without Apple Intelligence. I'm legitimately like, how are we gonna write reviews of phones? So we'll only exist in this form for some number of weeks before the big update comes. - It's so funny. I'm less optimistic than that. I think there is a super solid chance that the actual experience of Apple Intelligence is not going to show up in a real way until the iPhone 17. - I would agree. - Sure. - Like I think these phones are the iPhone 15 plus the camera control. And I think everyone who has to review this phone is going to have to spend a deeply hilarious amount of time litigating a button in a way that I think is so fun and so virgin. And I'm very jealous to not get to do it. But like the AI stuff is gonna come in these like tiny bits and pieces. And if we weren't in a crazy AI moment where everybody had to pretend to have an AI strategy or Wall Street would run away from you, we would just call these things software. They're just features of apps and supposedly we're gonna get game changing Siri that makes everything better and solves phone interfaces forever, someday in the future. I am in no single way holding my breath for any of that to happen on this cycle of this iPhone. - Yeah, I agree with you. I'm just saying, I don't think iOS 18 plus camera button is like, there's not a lot there. You know what I mean? As much as I love the camera button and I, most of iPhone reviews I've ever written have been long meditations on the camera. Happy to do it again. - Now with a button. - Thrilled to do it again. I just, it feels like the reason people will upgrade to this phone is 'cause the AI capabilities will let them do stuff that they couldn't do on their old phone. The old phones are very capable of taking a photo. - Yeah. I mean, to be fair, Apple has been making this particular case since the iPad earlier this spring. Like we're deep into this now and Apple has been trying to sell you AI ready devices without real AI to do it with for months now. - Yeah, well I thought the AI stuff was largely for investors and less for actual people. That was always kind of my read on Apple AI. - I mean, my number one question is why are they shipping these on September 20th when the AI features are supposed to hit weeks later in October? - Again, some features in beta. (all laughing) Like, I don't, this is... - But like why wait that long? - Fair - Or to even have this Siri, the thing where you push the button and Siri is now the border around the screen and set of a little circle, just gimme that. - I honestly, it's so funny you say that. I was thinking about that this afternoon. If they had just changed nothing else about Siri but made it glow around the edges, everybody immediately would've been like, oh, Siri's better. Like it just, it would've given everybody like a 10% boost in Siri confidence. - Anyway, I'm open to feedback from y'all on how to review these devices or when, 'cause I'm honestly curious what would be the best service to everyone? Like a review of a phone that if you buy in November has nothing to do with the phone that you bought is kind of weird in my opinion. - Yeah, what you're actually getting at, what I would say was the kind of biggest vibe question that I had for you as somebody who's in the room because Alex and I were not in the room and I would say the overwhelming sense that I got from people both at the Verge and elsewhere, I was getting text messages from people who were like, this is the most boring iPhone launch I can remember. - Same. - That like as a big flagship to September event. We talk about this every year. Like this is Apple's moment to speak to everyone. Like it is the one that everybody pays attention to. And I would say the overwhelming perception was that it was kind of a bust. How did it feel in the room as it was happening? - I think this is why I kept noting the room was full of people who were just excited to be there. - Right. - Yeah. - So they curated the excitement that they needed and it was packed and people were freaking out and they're doing the thing. And that's not to say I wasn't running around trying to take photos and upload them as fast as I can. Like I like doing it. It's like the funnest part of the job. But they had made the space feel very excited. And then you like take a step out of it and you're like, okay, these are very iterative phones, like super iterative phones. The headphones upgrades apart from the 1.5 new models are iterative to the point where like one of them didn't even change at all. The watch upgrades are also pretty iterative and there's not any, I gotta have it upgrades, unless you really give a about the camera button, right? All of those upgrades are in the software. That's Apple's magic, right? Hardware plus software services and we're just waiting on the big stuff. Like if Apple had said Siri can now do this like app coordination assistant thing that everyone wants to get to, I think everybody would've upgraded the tomorrow. - [David] Yep. - Right? - There were a bunch of moments in the keynote like that actually. Like there was a moment where in the visual intelligence demo, the guy holds up a phone to a, it was like a concert poster or something. I think some kind of event. And it was like it'll input the information directly into your calendar when you take that picture. And I was like, if that's, I will buy any phone that will do that for me tomorrow. - Yeah, and it's not ready. - That's awesome. And it just doesn't exist. - There's also another extremely weird demo where somebody walked up to a dog and like asked the phone what kind of dog it was. And our own Kylie Robinson was like, why would you do that? Why would you walk up to a stranger's dog to a picture? - Just holding your phone out like this. - [Nilay] Why wouldn't you just ask them what kind of dog it is? - That gave me the same vibes as the the Gemini demo where they were like, use this to write a, for your kid to write a letter to an Olympian. It's like, oh, maybe you don't understand how people live and exist in the world. Like this is actually like bleak as hell and not cool and exciting technology. - The dog one, I did think, 'cause that's the same demo you do with the Meta Ray-Bans is you put 'em on and you're like, what car is that? What dog is that? - But the thing was he walked up to the person holding the dog and the intimation is that what he said is not, oh, that dog is so cute. What dog is that? He said, can I take a picture of your dog with my phone? - 'Cause I wanna know what kind of dog it is, and I don't wanna talk to you. - And I would point out you often encounter cars without their owners. If you encounter a dog without its owner, like that's like a little bit of an emergency. - Yeah. (all laughing) - You're not like, what breed is this? I better find out. - Hold on, stop here dog. - You pause. I need to pose. - Like, I just think, I think that is overwhelmingly the reason why at a distance, this one a little content free, like even the feature boxes, right? The bento boxes they put up at the end of every segment. Go look at the iPhone 16 feature box, it says USB-C on it. (David and Alex laughing) It's like, oh, we didn't even have enough to fill up the squares. And so like, these are super iterative phones, whose key feature is the RAM and the memory bandwidth to enable all of the AI stuff which isn't shipping. So like why would you be excited about it? And I think that's really the gap. I think they should have said we're shipping these phones with the first wave of beta features and just held them three weeks into October. But Apple sells so many phones, so I don't think they can do that. - Yeah, they couldn't afford it to hold it that long. They needed to get it out and if the software is not ready, so be it. - And this goes back, Alex, to what you were saying is like the reason you do that is Wall Street, right? Like this is not a thing you do in the service of good user experience. This is a thing you do because we are in a moment where if you appear to be behind on AI, you will be punished. And that is, right or wrong, that is the world in which we live. And so everyone is out here announcing features that aren't going to ship anytime soon or ever because you have to. And it's so un-Apple like to do that. - Yeah. - It's so, so, so odd to see Apple tell you its plans. Like this is not what Apple does. This is not what Apple has ever done. And it has to because it can't build the things yet. - Did you guys also notice that it was doing a weird thing where they didn't call it AI, they called it like our Apple intelligence, but they wouldn't call it AI. They would always default to machine learning. - I clocked once that he said the word AI, but every other one was some like dance around it. - Yeah, yeah. Like they were really going outta their way to not sound like Google, to not sound like their competitors in this space. Which is kind of interesting. - I mean, they have branded Apple Intelligence, like they're fine with it. - They do have their own AI. - Yeah, they have multiple AI models. At one point, I believe with the watch, if you go back and watch it, they point out that they're running many models to enable the features you enjoy today. And it's like, great. So it's the same, the same as the one I have today. - Yeah that was just like, why are you talking to investors during this infomercial? You're trying to sell me these phones. To the point where you even have buy now like verbiage in your thing. Stop it. It was weird. But let's talk about Fine Woven because it feels like Fine Woven might be gone. - Yeah. This is good. Before we leave, let's just little bit of accessory news and then we're gonna get outta here. - Is this an accessory lightning round? - This is an accessory lightning round. But the way we're gonna do this is I'm going to tell you what's happening and if you're not interested, just don't say anything and we'll keep going. It's gonna be great. - I love this. This is great. - Thing number one, Apple has a faster MagSafe charger to go with the iPhone 16s. Qi2, which I believe this might be the first time a phone company has actually said Qi2 out loud on stage about a phone that people in America can buy. That's very exciting. - Yep. - I'm excited. We're gonna charge faster, yay. - Great. We love a fast charge. I said this in the lightning bug, but there was a time that Nilay made fun of me for having a MagSafe charger. I was, we were in a restaurant somewhere and I slapped the puck onto the back of my phone and Nilay made phone of me for like 10 straight minutes. - I'm sorry, if you have a wire connected to a battery, why would you pick the least efficient way of charging your phone with that wire? - 'Cause it flocks. I love the flock. (Nilay laughing) Yeah. - That's good noise. - I will say I'm a full convert into MagSafe batteries. Actually I should have one over here. That's what I do now is like the MagSafe battery packs 'cause you don't have to deal with the wires. They get hot and it's inefficient. And if you have a wire connected to a battery pack, David, you should just plug it into the bottom of the phone. - Flock! Anyway, next up, like you were mentioning Cranz, so I would actually like you to explain this to me because we thought Fine Woven was probably dead. Apple didn't say Fine Woven is dead, but it kind of seems like Fine Woven is dead. - Kinda seems like, yeah. - Fine Woven being Apple's terrible bad take on leather accessories. - This was their cloth accessory that was really just plastic that was meant to like replace all the leather and be a lot more eco-friendly. And that's probably true, but it also sucked and it got dirty and gross and nobody liked it. - Like, what if it was leather, but like much worse. - [Alex] Yeah. - Much, much worse. - And now you can't buy a phone case made of Fine Woven. There's a wallet and that's about it. We've reached out, we haven't heard anything back yet. - The wallet strikes me as one where they're like, look, we have a bunch of these, we might as well keep it for sale. It's like Google with the Chromecast now where they were like, they have the TV streamer, they're clearly out on the Chromecast, but they're like, look, there's a room full of these. Like if you wanna buy it, please buy it. Fine Woven has been dead, I would say since about like a day after it launched. - The wallet doesn't require the size and shape of the phone, right? So like you can't just sell off the excess, - You have much iPhone 15 Pro Max accesses and you don't make iPhone 15 Pro Maxes anymore. You're just like, I don't, can you recycle it? We recycle everything around here. Just turn it into something else, Johnny, we'll see what happens. - Fine Woven is not fine. - Yeah. - Yeah. All right, next up, I would say one of the stranger stories of the day, beats famous music company, you may have heard of them before. They make headphones, LeBron James wears them. Made a bunch of iPhone 16 cases. Sure. - Beats? - Beats made iPhone 16 cases. - It feels like a real, it feels like they've been trying to figure out where Beats sits in their lineup, especially as AirPods get better. And their idea is what if Beats is budget? You do cases now. - Oh, interesting. Do you think that's where this is going? Interesting. - Yeah, 'cause they are putting the Good Tech in their headphones, but the headphones just also aren't, don't have that kind of cash, that quality feeling, right? - I just feel like my read on it was that Apple was just like, let Beats be Beats. I just wanna say to everybody listening to this, by the way, Nilay is furiously Googling because he doesn't believe me that I got this right. Which is how wild it is that Beats is making iPhone 16 cases. - I'm just like reading this news. - Nilay had to fact check me on the Vergecast because he didn't believe me that Beats was making iPhone 16 cases. This is all you need to know about this story. They're $49. They exist. - That's it. - They are cases. - They're cases. - They look like the Apple cases, but they're by Beats for some reason. I don't get it. - That's so weird. - It's so weird. (David laughing) - Yeah. It's very, it's very strange. - I was instructed if I had nothing to say, to say nothing. - No, this is great. I'm into it. Perfect. Moving on. Bunch of new watch bands, bunch of new band colors. Can I interest you in that? - Get one on Etsy, it'll be a quarter of the price. - Or buy the Verge's own Nomad Blurple band, which is a big hit at Apple Park today. - Oh yeah? - Yeah. - Love that. - Many compliments. - It looks great. - I bought that one, which is very good. And I also bought six Apple Watch bands on Amazon for like eight bucks. Loving it to bits. Can't recommend it highly. - Those ones are slowly poisoning David and you should buy the Verges Blurple sport band. - I do occasionally look at my wrist just to make sure it's not like turning a color I'm not psyched about. - Yeah. - So far so good. But we're, okay. The biggest question I have about accessories Nilay is how the camera control is gonna work with cases. This is a question a lot of people are asking. It's this, it's this capacitive it kind of flush control, which seems like if you have any kind of raised case at all is gonna be hard to find a way to get your finger inside of. Do you have a sense of how this might work? - Yeah. Although I think my worry is different than anyone else's worry. Can you make a capacitive button on a case connect to a capacitive button on the phone. It's like pretty well and solved, right? They just have to be conductive to each other. And so Apple's own cases have a button that touches the other button and you're good. If there's any play at all, if there's any space between the two buttons, then that like push a little bit is gonna get weird. And that I haven't seen this thing in a case yet, but already it's like to push it, to do the light tap, to bring up the various menus or controls is already like, you have to think about how hard you're pushing so you don't accidentally push the button. And so if you have a little play and then you have to push, like if you have a cheap case or a bad case that might get weird. Remains to be seen. - That's why Beats is leading the way. - Don't worry Beats hasn't covered. - They got you. - Jimmy Iovine has it covered. Don't worry. (Alex laughing) Do you ever think Jimmy Iovine's like ever just like looks in the direction at Apple Park? He's like, man, I really pulled one over. (all laughing) - Yeah, all these money and we still make headphones. - There's is a brief, a real period, a real thing that happened is that Jimmy Iovine and Dr. Dre and Trent Reznor were Apple employees and they had no titles except for Jimmy and Dre. - Is that true though? That was their title. - That was their title. Jimmy and Dre. - Well that's my... Was Dre Jimmy and Jimmy was Dre? That's what I want. (Nilay and Alex laughing) It'd be great if Apple is like another person gets the title of Dre when Dre left. (David and Alex laughing) - You gotta back fill the Dre. (Nilay and David laughing) - There's some like brand new engineers, like you're Dre now. Like have fun. (all laughing) - Just putting all those weights into a product to make it feel better. - Yeah. All right, we have gone way over. We all need to go to sleep and Nilay needs to go figure out how to move this lamp. Nilay any parting thoughts for us? Anything we missed? Any big feelings about the Apple stuff today before we get outta here? - I'm very curious to see how people want us to evaluate these products, right? Like, I don't disagree with the sense that this was kind of a small event in its way. I wonder if the products will feel bigger with the Apple Intelligence feature. So me know how you want us to talk about these. 'Cause I suspect the answer is not just as regular new phones. - Yeah. I think that's right and I think especially if you have like a thing about the camera or the camera control or like a specific thing you're looking at that's like more than just my phone is dying, I need a new one. I'll buy the new one. But is like, is this worth the upgrade? - Yeah. - I wanna know all your questions about is this worth the upgrade? So you can email Vergecast at verge.com call the hotline 866-Verge-11. We have, I would say a bunch more Apple stuff to do over the next couple of weeks. So we'll have lots of time to talk about this. Send us all of your questions. For now, that is it. That's the Vergecast. - Rock and roll. (upbeat music) - [Narrator] And that's it for the Vergecast this week. Hey, we'd love to hear from you. Give us a call at 866-Verge-11. The Vergecast is the production of the Verge and Vox Media podcast network. Our show is produced by Andrew Marino and Liam James. That's it. We'll see you next week. (light music)",
    "transcript_keywords": [
        "Apple",
        "Apple Intelligence",
        "yeah",
        "Apple watch",
        "phone",
        "thing",
        "people",
        "Apple Watch Ultra",
        "camera",
        "Apple Park",
        "Apple Intelligence features",
        "Pro",
        "Apple event",
        "stuff",
        "button",
        "Pro Max",
        "phones",
        "AirPods",
        "things",
        "Apple Intelligence stuff"
    ],
    "transcript_entity_values": [
        "the Good Tech",
        "three",
        "British",
        "Nikon",
        "iPhones",
        "Yelp",
        "six hour",
        "a great week",
        "AirPods and AirPods",
        "Liveblog",
        "iPhones Apple",
        "Apple AI",
        "Nilay",
        "Ezra",
        "this week",
        "third",
        "the end of this week",
        "2000",
        "Google",
        "Bose",
        "Liveblog",
        "46",
        "Dre Jimmy",
        "49",
        "AirPod Max",
        "all a million years old",
        "weeks",
        "Siri",
        "the Steve Jobs",
        "Nancy Pelosi",
        "Liam James",
        "179",
        "Washington DC",
        "above 40 gigabytes",
        "42",
        "2012",
        "11",
        "Gmail",
        "AI",
        "a decade",
        "the next couple of weeks",
        "549",
        "Vergecast",
        "50",
        "4",
        "last week",
        "DC",
        "818",
        "Mint Mobile",
        "13 years",
        "tomorrow",
        "Jimmy Iovine",
        "Jason Sudeikis",
        "one",
        "Bixby",
        "iPhones",
        "USB-C.",
        "15 bucks",
        "the Steve Jobs Theater",
        "iOS 18",
        "three weeks",
        "eight",
        "six",
        "Apple Intelligence",
        "monthly",
        "earlier this spring",
        "Bose",
        "an election year",
        "Pacific Rim",
        "the Vision Pro",
        "Amazon",
        "Persia",
        "iPod",
        "a year and a half ago",
        "Deep Fusion",
        "Sony",
        "AirPod AirPods Pro 2",
        "48 megapixel",
        "16",
        "zero",
        "Allison",
        "WWDC",
        "Andrew Marino",
        "the Vision Pro",
        "Eight",
        "Steve Jobs",
        "iPhone Apple",
        "Donald Trump",
        "a dozen",
        "a million years ago",
        "Vergecast",
        "Pixels",
        "September",
        "18",
        "iPhone 16",
        "Dre",
        "A18",
        "Phil",
        "The Observatory",
        "three months",
        "AirPods 2 Pro",
        "AAA",
        "AirPods Pros",
        "Seven inch",
        "generation AirPods Pro",
        "iOS 18",
        "MacBook",
        "Four",
        "first",
        "IOS",
        "dozens of hours",
        "48",
        "Jimmy",
        "See Mint Mobile",
        "DSLR",
        "15th",
        "the East coast",
        "un-Apple",
        "the Apple Watch Ultra 2",
        "36",
        "AirPod",
        "A18",
        "400",
        "the Apple Watch",
        "FDA",
        "Craig",
        "2,000",
        "this Apple Intelligence",
        "Blackberry",
        "August",
        "a minute",
        "ANC",
        "24 megapixel",
        "Desert Titanium",
        "Apple",
        "just 15 bucks",
        "AirPods 2",
        "48",
        "Tim Cook's",
        "the AirPods Max",
        "Desert Titanium",
        "Cranz",
        "eight bucks",
        "years",
        "Trump",
        "Tim Cook",
        "866",
        "15",
        "five minutes",
        "250",
        "David",
        "next week",
        "iOS 18.1",
        "6.7 inch",
        "Mint",
        "The AirPods Max",
        "Max",
        "iPhone",
        "Ultra",
        "New York",
        "hours",
        "Nilay",
        "Google Lens",
        "MIT Mobile",
        "the last few years",
        "FaceTime",
        "2",
        "5",
        "the West Coast",
        "One",
        "Chris Welch",
        "Alex",
        "a million",
        "18.1",
        "Pro Maxes",
        "Thanksgiving",
        "Mitch McConnell",
        "David Pierce",
        "Apple Event days",
        "Almost seven inches",
        "October",
        "one extra hour",
        "Jony",
        "Gmail",
        "iPad",
        "Nilay",
        "the Steve Jobs Theater",
        "Samsung",
        "this year",
        "Pros",
        "0.5",
        "Dezeen Today",
        "40",
        "Fine Woven",
        "10",
        "Fair",
        "last year",
        "about like a day",
        "just $549",
        "10 straight minutes",
        "three month",
        "first three month",
        "The Verge",
        "two thirds",
        "the first three month",
        "Nilay",
        "USB-C",
        "second",
        "one more hour",
        "A hundred percent",
        "Threads",
        "90.9%",
        "Etsy",
        "fourth",
        "WWC",
        "four",
        "a hundred percent",
        "10%",
        "18.0",
        "Johnny",
        "one minute",
        "46",
        "three days",
        "months",
        "Verges Blurple",
        "New Jersey",
        "day one",
        "the AirPods 4",
        "Ted Lasso",
        "49",
        "Olympian",
        "five days",
        "H2",
        "seven",
        "WNBA",
        "a thousand dollars",
        "USBC",
        "Assassin",
        "Trent Reznor",
        "a thousand",
        "35",
        "the day",
        "Alex Cranz",
        "Safari",
        "a quarter",
        "30 minutes",
        "iOS 18",
        "September 20th",
        "AirPods",
        "12 megapixel",
        "two - Two",
        "Gemini",
        "TikTok",
        "WWDC",
        "ages ago",
        "Kylie Robinson",
        "80%",
        "Vox Media",
        "RAM",
        "AirPods 4",
        "LeBron James",
        "a hundred",
        "November",
        "the Apple Intelligence",
        "Jersey",
        "Sunnyvale",
        "Nilay",
        "three and a half",
        "15",
        "35",
        "1.5",
        "Desert Titanium",
        "Verge",
        "250 bucks",
        "129",
        "this afternoon",
        "Black Mirror",
        "more than 600",
        "40 gigabytes",
        "Vee",
        "AirPods Pro",
        "the past five years",
        "30 hours",
        "Delta",
        "Jaeger",
        "2036",
        "a ton",
        "weeks later",
        "45",
        "33 hours",
        "Chromecast",
        "this last year",
        "Walt Mossberg",
        "6.9 inch",
        "Pro Max",
        "California",
        "Mark Levoy",
        "Phil Schiller",
        "13",
        "12 years later",
        "iPads",
        "Macs",
        "a couple weeks",
        "the 1980s",
        "Chuck Schumer",
        "Pro iPhone",
        "Dre",
        "Mac",
        "Nilay Patel",
        "7,000",
        "Liveblog",
        "today",
        "Ezra Klein",
        "16 plus",
        "an eight",
        "Portrait",
        "America",
        "million",
        "Verin",
        "two",
        "Siri",
        "Apple Park",
        "MagSafe",
        "Apple Watch",
        "the AirPods Pro 2",
        "MIT",
        "about six hours",
        "Nomad Blurple"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "LANGUAGE",
        "PERSON",
        "DATE",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "FAC",
        "PERSON",
        "PERSON",
        "MONEY",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "MONEY",
        "WORK_OF_ART",
        "MONEY",
        "CARDINAL",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "GPE",
        "NORP",
        "ORG",
        "MONEY",
        "ORG",
        "EVENT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "LOC",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "NORP",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "LAW",
        "FAC",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "TIME",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "LOC",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "LOC",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "NORP",
        "GPE",
        "TIME",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "QUANTITY",
        "DATE",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "FAC",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "MONEY",
        "TIME",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORDINAL",
        "TIME",
        "PERCENT",
        "PERSON",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "TIME",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "GPE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "EVENT",
        "DATE",
        "PERSON",
        "PERCENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "GPE",
        "GPE",
        "NORP",
        "DATE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "ORG",
        "MONEY",
        "MONEY",
        "TIME",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "DATE",
        "TIME",
        "LOC",
        "PERSON",
        "DATE",
        "QUANTITY",
        "DATE",
        "MONEY",
        "TIME",
        "ORG",
        "DATE",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "GPE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "FAC",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "GPE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "FAC",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "TIME",
        "PERSON"
    ],
    "vector": [
        -0.05313858017325401,
        -0.023427963256835938,
        0.037790000438690186,
        -0.07326078414916992,
        0.1410628706216812,
        0.009878144599497318,
        0.017759691923856735,
        -0.0035872869193553925,
        0.020516851916909218,
        0.043387871235609055,
        0.05219314619898796,
        -0.014628598466515541,
        -0.0561961829662323,
        0.07373200356960297,
        0.028399160131812096,
        -0.012738727033138275,
        0.1606534719467163,
        -0.11298554390668869,
        -0.03611094877123833,
        -0.022546179592609406,
        -0.050305332988500595,
        -0.026893502101302147,
        0.06580772995948792,
        0.010126033797860146,
        0.0038784369826316833,
        0.018077772110700607,
        -0.07431871443986893,
        -0.11734728515148163,
        -0.04388406500220299,
        -0.03558104485273361,
        0.017778100445866585,
        0.0638662651181221,
        0.08247287571430206,
        0.028814371675252914,
        -0.034506119787693024,
        -0.11469987779855728,
        0.07678177207708359,
        -0.026075197383761406,
        -0.0052292016334831715,
        -0.023038875311613083,
        -0.02468270994722843,
        -0.01931009255349636,
        -0.019749175757169724,
        0.049821637570858,
        0.030883507803082466,
        0.03348909690976143,
        0.03258137404918671,
        -0.03955218195915222,
        0.02639843337237835,
        0.006601220462471247,
        -0.017398003488779068,
        -0.01155393198132515,
        0.06033178046345711,
        0.028658663854002953,
        0.009418030269443989,
        0.012121210806071758,
        -0.04376806318759918,
        0.017230408266186714,
        0.07544710487127304,
        -0.0020758402533829212,
        0.03031732328236103,
        -0.07973383367061615,
        -0.009046593680977821,
        0.0657094195485115,
        -0.06576386094093323,
        0.004915369674563408,
        0.011553607881069183,
        0.024545110762119293,
        0.03581984341144562,
        -0.032298896461725235,
        -0.012811913155019283,
        0.027412885800004005,
        0.035569705069065094,
        -0.04551878571510315,
        0.05178775638341904,
        0.04107765853404999,
        0.07681521773338318,
        -0.06016315892338753,
        0.005090498365461826,
        -0.06053216755390167,
        0.0045286561362445354,
        -0.052144311368465424,
        0.01970221847295761,
        -0.012422284111380577,
        0.033995434641838074,
        -0.0022066859528422356,
        0.012394861318171024,
        -0.04745584726333618,
        -0.05406404659152031,
        -0.011930502951145172,
        -0.0814080536365509,
        0.013539749197661877,
        -0.04518971964716911,
        -0.05535278469324112,
        0.07908723503351212,
        0.014191098511219025,
        -0.034506648778915405,
        -0.09010913223028183,
        -0.02292020060122013,
        -0.0019046099623665214,
        0.03786196559667587,
        0.009236721321940422,
        0.00967463105916977,
        -0.02092690020799637,
        0.03457034379243851,
        -0.08612692356109619,
        -0.005720178131014109,
        -0.037086158990859985,
        0.0637083575129509,
        0.1214817687869072,
        0.051119640469551086,
        0.011700254864990711,
        0.0005868150037713349,
        -0.057907238602638245,
        0.09115774184465408,
        0.048139460384845734,
        -0.022289883345365524,
        0.08734500408172607,
        0.09166199713945389,
        0.05582023411989212,
        0.057255469262599945,
        0.008977976627647877,
        -0.0018396584782749414,
        -0.030066756531596184,
        -0.0019881073385477066,
        0.021558362990617752,
        -0.04459068924188614,
        4.3150101731282225e-33,
        0.007338416296988726,
        0.05444527789950371,
        -0.04963671788573265,
        -0.0277054775506258,
        0.03558393195271492,
        -0.020499100908637047,
        0.023708879947662354,
        0.06200576201081276,
        -0.03249579295516014,
        0.005379376467317343,
        -0.09758128970861435,
        -0.04710560664534569,
        -0.08794976025819778,
        0.00806446559727192,
        0.07902570813894272,
        -0.08901894092559814,
        -0.06079534813761711,
        -0.0066254884004592896,
        -0.04113444685935974,
        -0.010813197121024132,
        -0.011553674936294556,
        -0.02156841941177845,
        -0.0529005266726017,
        0.05408347025513649,
        0.04212480038404465,
        0.07433214038610458,
        0.11305505782365799,
        0.0037997933104634285,
        0.054636262357234955,
        -0.0011753287399187684,
        -0.09906506538391113,
        0.07010599225759506,
        -0.010494988411664963,
        -0.033755965530872345,
        -0.03256044164299965,
        -0.014412308111786842,
        0.0012991981348022819,
        -0.10540111362934113,
        0.03631791099905968,
        -0.048035793006420135,
        -0.04820232838392258,
        0.012805940583348274,
        -0.12417379021644592,
        -0.0988386794924736,
        0.012032099068164825,
        0.03354845941066742,
        0.010242373682558537,
        0.01680588163435459,
        0.02962329611182213,
        -0.0035739485174417496,
        -0.04767855629324913,
        -0.003822447033599019,
        -0.02777978591620922,
        -0.09921775013208389,
        -0.028817523270845413,
        -0.050399456173181534,
        -0.028622224926948547,
        -0.014979583211243153,
        0.0368870347738266,
        -0.025224490091204643,
        -0.0022260844707489014,
        -0.0030496728140860796,
        -0.03415884077548981,
        0.01116148754954338,
        -0.09496594220399857,
        0.06215639039874077,
        0.03197886422276497,
        -0.027147646993398666,
        -0.03758493438363075,
        0.11018300801515579,
        -0.06851571053266525,
        0.03978869691491127,
        -0.02527753636240959,
        -0.020315255969762802,
        0.0341341458261013,
        0.04209641367197037,
        -0.026378417387604713,
        -0.0809677243232727,
        -0.011815140023827553,
        0.05283069983124733,
        -0.031155981123447418,
        0.04850458726286888,
        0.05087713897228241,
        0.05279276892542839,
        0.039312221109867096,
        -0.11557430028915405,
        -0.010521287098526955,
        -0.025795675814151764,
        -0.014027491211891174,
        0.057919248938560486,
        -0.030337555333971977,
        -0.018734505400061607,
        0.016413725912570953,
        0.03923835977911949,
        -0.09473299980163574,
        -5.916172334218369e-33,
        -0.0063070375472307205,
        -0.03194430097937584,
        -0.06667708605527878,
        -0.034925058484077454,
        0.008266433142125607,
        -0.0865936428308487,
        0.019821850582957268,
        0.05195832997560501,
        0.06380540132522583,
        -0.014666875824332237,
        0.018721453845500946,
        -0.06964825838804245,
        -0.04556585103273392,
        0.07303480058908463,
        -0.03879748657345772,
        0.00600863853469491,
        -0.05556800961494446,
        -0.053746968507766724,
        -0.01596793346107006,
        -0.004945746622979641,
        0.052687935531139374,
        0.037206389009952545,
        0.01544820424169302,
        -0.0019179985392838717,
        -0.006340485997498035,
        0.009408893994987011,
        0.04653479903936386,
        0.06773993372917175,
        0.014382321387529373,
        -0.08996063470840454,
        0.018502289429306984,
        -0.10525965690612793,
        -0.03337489441037178,
        0.10663799941539764,
        0.029960637912154198,
        0.05586056038737297,
        0.037065040320158005,
        -0.022718995809555054,
        -0.03172928839921951,
        -0.04720522090792656,
        0.05958116799592972,
        0.006379168014973402,
        0.056997623294591904,
        0.02904089353978634,
        -0.005942139774560928,
        -0.005871661473065615,
        -0.020255394279956818,
        0.09688246995210648,
        -0.09134044498205185,
        -0.053592223674058914,
        -0.025042910128831863,
        0.010606450960040092,
        -0.026029422879219055,
        0.0393097884953022,
        -0.11243508011102676,
        0.030759699642658234,
        0.0034759824629873037,
        0.037492018193006516,
        0.020928451791405678,
        -0.010719336569309235,
        0.0766678899526596,
        -0.058782026171684265,
        -0.014024018310010433,
        -0.07638616114854813,
        -0.01151653565466404,
        0.022243736311793327,
        0.036671172827482224,
        -0.007348873186856508,
        -0.04907906427979469,
        0.062184400856494904,
        0.020519984886050224,
        -0.01232255157083273,
        -0.02847183682024479,
        -0.048489004373550415,
        0.034303948283195496,
        0.028315121307969093,
        -0.008693041279911995,
        -0.03443460911512375,
        -0.03029015101492405,
        -0.07362696528434753,
        -0.03269338607788086,
        0.03879489004611969,
        0.06985372304916382,
        0.006917850114405155,
        0.08982052654027939,
        0.08810512721538544,
        0.02341163158416748,
        0.028175687417387962,
        0.021782318130135536,
        0.11317931115627289,
        -0.08374176919460297,
        0.038572609424591064,
        -0.07872433960437775,
        0.08504687994718552,
        -0.04275606945157051,
        -5.583680007248404e-08,
        0.0056426334194839,
        0.043598346412181854,
        0.018611423671245575,
        -0.07624312490224838,
        0.009686713106930256,
        -0.07193559408187866,
        0.011231244541704655,
        -0.007647528778761625,
        0.05566328763961792,
        -0.03238792344927788,
        0.06505521386861801,
        -0.06230860948562622,
        -0.08939408510923386,
        0.021725449711084366,
        0.13683666288852692,
        0.0013495601015165448,
        -0.08573491126298904,
        0.032269690185785294,
        0.005522268824279308,
        -0.05798002704977989,
        0.033164773136377335,
        0.017668332904577255,
        -0.019846055656671524,
        -0.02637706883251667,
        -0.0020862456876784563,
        0.00264364224858582,
        -0.04853466525673866,
        0.01589871756732464,
        0.02774835377931595,
        -0.004930699709802866,
        0.01948658376932144,
        0.024646447971463203,
        0.04229368641972542,
        -0.05325467512011528,
        -0.057900626212358475,
        -0.04153233766555786,
        -0.03584491088986397,
        -0.007001759484410286,
        0.10539868474006653,
        0.04413062334060669,
        0.0020593185909092426,
        -0.10670862346887589,
        -0.03734245523810387,
        0.04334109276533127,
        -0.009777156636118889,
        -0.07445519417524338,
        0.01777333766222,
        -0.13338834047317505,
        0.0018578666495159268,
        0.006948269437998533,
        -0.02683698758482933,
        -0.03995702788233757,
        0.07773485779762268,
        0.0443057045340538,
        0.09302785247564316,
        0.021397951990365982,
        0.04939927160739899,
        -0.08420106768608093,
        -0.023295456543564796,
        0.0024650050327181816,
        0.09440195560455322,
        -0.06125875562429428,
        -0.010923994705080986,
        0.06436796486377716
    ]
}