{
    "id": "b_bD3p0K_QY",
    "title": "My Favorite Final Cut Pro Shortcuts for faster editing!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-09-13T19:46:03Z",
    "video_url": "https://www.youtube.com/watch?v=b_bD3p0K_QY",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "artlist",
        "artlistio",
        "royalty free music for video",
        "sound effects",
        "copyright free music",
        "music for videos"
    ],
    "views": 71924,
    "likes": 2945,
    "comments_count": 173,
    "description": "Thanks to Artlist.io for sponsoring a portion of this video. Sign up for Artlist now with my custom link and get two months free when you purchase an annual subscription!    PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "https://artlist.io/artlist-70446/?artlist_aid=iJustine_2115",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and I'm so excited for today's video. As a lot of you guys know, I am an editor and I absolutely love to edit, and I'm gonna toot-toot my own editing horn because I'm really, really fast, and over the past few years there's some shortcut keys that I use to make my editing even faster and more efficient, but first, a huge thank you to artlist.io for sponsoring this portion of this video. My editing style is, I'm kind of already editing while we're shooting a video, and I have the thought in my mind of what I kind of want the finished product to look like. I'm always thinking about the music, and that is one of the most important parts, I feel like, to any video. Yes, obviously you need to have good lighting, you need to have good audio but when you're actually putting this together, music can make such a huge difference. So I've been using artlist.io for the past couple of years, actually, and they have so many incredible tracks, they have a lot of sound effects. I'll put a link in the description if you guys do choose to sign up for annual subscription you'll get the first two months free. Artlist offers access to unlimited downloads of over 22,000 songs and 27,000 sound effects, these are also updated daily so there's always new stuff being added. You can choose the subscription tier that fits your needs, there's the personal plan that is yearly for 9.99 a month, or monthly that is 14.99 a month, there's also the unlimited plan that covers everything from personal to commercial projects. I really like the unlimited plan because even after your subscription expires, you'll still be able to have access to all of those songs that you've used in your projects. I really like the For You page because I feel like artlist.io knows me better than most of my close friends, because I have spent so much time on this website finding songs, downloading, curating, making playlists, and finding the perfect track for my projects. You can search by mood, video theme, genre, instrument, and they also have a really cool spotlight feature that will show you some of the artlist.io originals. So if you're a content creator and you think that you can just get by by using royalty free music. Yeah, you can, but being able to have access to a high-quality music library really steps up the game. This will also help you avoid getting copyright strikes because this is directly linked to your YouTube channel, so you won't have to worry about losing any type of revenue or having your video taken down because of copyright strikes. You guys can sign up now for artlist.io using the link below in the description for two months free when you sign up for Annual Plan. Thank you again to artlist.io for sponsoring that portion of this video. So I've got Final Cut open, and now we're gonna go through some of my favorite shortcut keys. Some of these you may already know but some of them you might be like, \"Wow I didn't know that I could do that.\" So first things first, I'm gonna get my project started, create a new library, so the library's created, then I drag and drop in my content, there may be other better ways to do this but I basically make all of my folder structure already, and then I drag and drop everything in, that adds keywords, and it separates all of the content into mini little folders so everything is already organized for me. You guys might not shoot on multiple cameras but we've started shooting with three cameras now for most of our unboxing stuff, so using the Multicam feature in Final Cut has been, by far, just a lifesaver. All I have to do is select those three cameras, click New Multicam Clip, we'll name it \"Unboxing Part 1.\" It will automatically sync all of our Multicam clips. You guys can see here all of the tracks, everything is all matched up, and if you want to reorder them. So I like having my main camera one, top two, and the other third camera as our three. So let's start a new project, this is our project, now using CMD and the bracket keys, this is a really quick way to cycle through things that are already open. So we're here in the Multicam and then I'm gonna go back to my unboxing the phone, yo, and here is that Multicam clip. To bring footage into the timeline, I like to use the W key that automatically will bring all of that content down. Something else that I like to do is if I'm at the end of a clip, I hit the arrow up button, that will take me to the start of the clip, I use this all the time. Now in Multicam, I'm gonna be using CMD + Shift + 7, and that'll show or hide our Multicam clip, and as we scroll the timeline you're gonna be able to see those two clips, but since we have three cameras, I'm gonna switch to our four-angle display and you'll be able to see all of those right there. And why I like Multicam is we're able to just make all of these changes inside of there and it won't affect anything else that's happening in your main timeline. So, since this clip right here is upside down, I'm going to click on that center clip, make sure it's highlighted by clicking that little computer screen right there. Now, to get to the Transform tool, if I don't have to use the mouse, I'm not going to, you could either click right here to activate it, or you can click Shift + T and that will bring up the bounding box. Now I just do a quick little rotate. You can also go over here and use the Transform and Rotate there, but I just quickly do it just like that, and then to go back CMD + [. All right, so we're here in our main timeline, I wanna get quickly back to the beginning, Spacebar is our friend. This is a simple way to start and stop playing. Now, if I wanna get to the beginning I'm gonna hit the arrow up, take us back to the beginning, also CMD + and - let's us zoom in and out. I also love editing with the magic mouse because this will let me scroll the timeline very quickly, and I use that way more than I'd like to admit. Some of the shortcut keys that may be very helpful for some of you, this little area right here is the Select, Trim, Position, Range, Selection, Blade, Zoom, and Hand, out of these I mostly use the Blade and Select. So I use the B and then hit A for Select, Delete, Delete, +, -, show our timeline. So when we're talking about editing clips, I will sometimes also use the playhead to edit, so if I see that, okay, I started my project here, I'm gonna hit CMD + B, and that will automatically slice right where I have the playhead, and then I can just delete that first part. Now, if I wanna save myself a step and not have to delete, I will just go to where I want the first cut to be, and then I will hit Option + [, that will automatically make your cut, and it'll also delete whatever is before the cuts. You can also delete whatever is after it by doing the same thing but hitting Option and ]. So as you see, that cut was perfectly made, everything else was deleted. And of course, CMD + Z, we should all know that one, that's undo. I edit a lot with wave forms, so when I'm talking in an everyday conversation there's a lot of times where I'll start pausing because I'm so used to talking like that when I'm editing, where I know I wanna make cuts. So if you see here, I'm talking, so I'm gonna hit CMD + B to blade it, and then I'll just do this and do this, cut out some spaces. So I kind of automatically already know where I want this edit to be, and another thing is because this is a Multicam timeline, I have the ability to watch this play through and I can click 2 to switch cameras, I can click 3 to switch to the third camera, click back to 1, and I'm basically editing this video live, it's like live switching, and it is, by far, the coolest thing ever. Now, this is something that Final Cut added in a few updates ago, and it has absolutely changed my life because I am super obsessive when it comes to audio. I hate when there's audio pops more than anything, so if you wanna click here into your audio this will expand the audio, so this is what I used to do. I used to go in here, I would drag each corner like that because that will give you a nice audio fade, drag it in, I would go over here, do the same thing to this, and I would also do that to the one above it, and it was so freaking tedious, drove me crazy, but now we have the best shortcut key in the entirety of Final Cut. So to use this auto fader, super simple, you just select a few of the clips that you want the audio to automatically fade, and you click Option + T, it is the best. So you'll see here, if we zoom in, you can see that slight little audio fade on all of those pieces, I love it so much. Thank you, Final Cut, for changing my life and saving me hours and hours of time over the course of years of editing. Another shortcut that I find myself using quite a bit is CMD + 6, this brings up our color board. Now, again, in the Multicam clip this is great because I can adjust the color and this will affect everything in my main timeline. So we're going to CMD + 6, this is already there so we're gonna bring down a little of that a little of this, and we're gonna hit CMD + 7 to bring up our color scopes here. I love adding a little extra saturation, it's just my style, and then I sometimes like to make my videos a little bit cooler, so I will change couple little variables here. I also like to just copy and paste the attributes to other pieces of my timeline. So if I wanna match this color to another shot, I'm gonna hit CMD + C, make sure this is selected, and then we're gonna go down here to this third camera, and I'm gonna hit Shift + CMD + V, and this will bring up this Paste Attributes. Now, I like doing the Paste Attributes because I wanna make sure that I'm only pasting the color board, because sometimes they'll be some audio attributes that are on, sometimes there'll be a Transform or a Crop, and for this, I just want the color. And this is most important for something like this because I've already changed this Transform to be rotated, so if I did an Option + CMD + V, this will paste the attributes and nothing will pop up to give me an alert that happens, so watch what happens. So that flips around because it's pasting the attributes from the previous clip, which was not rotated. So now I have to go and rerotate that, so to alleviate things like that happening, that's why I like using the Shift + CMD + V, this pops up, let's me just make sure everything is right, and we're good to go. So to clear that we're gonna hit CMD + 7, now Shift + CMD + 7, I know, similar but different, brings back up our Multicam clips. So I like having the index open because I like my starting point timeline to not start all the way over to the end because I feel like that's so far over, and I like having it right here with a little bit more of a buffer. So this is sort of how I edit, is I'll zoom in, kind of do one of those, add a blade there, maybe do this, this, this, and then I'll CMD + click, click, to select both of those, and then I delete them, and then I kinda do a little CMD + T. Great, that sounds good, love that. Most of the time I will do a super rough edit by playing it in double, triple speed, so I will hit Play- - 1080, 30, 60. - Oh, actually something that, since I'm now listening to the audio, we have an audio problem, so opening back up Shift + CMD + 7 This is very, very important because this drove me crazy the first time that I ever started using Multicam clips. So I'll start by clicking here, this enables video and audio switching, and I'll select the camera that has the audio that I wanna use throughout the video, so that is main. This over here was using a different audio channel. - Dual 50 mega- - And that's now using my log. Okay, so now what I do is, since this one is selected, I'll start at the beginning of that clip, and I make sure I select this one, which will enable just video switching, so when I'm playing through. - Has dual 50 megapixel camera- - And I'm switching my cameras. - Cameras that will shoot at 4K, 30, and 10. - All of that audio will stay the same. So a lot of times, when I'm adding B-roll over top of my footage, this is a super easy shortcut key that I like to use 'cause I don't want it to attach itself to this timeline, I don't want it to cut into any of my footage. I will find my clip, I'll play it, I'll hit I, and then I will hit O for output, and then I will hit Q, which will then send it down to my timeline. I then will kind of adjust it just to see how it looks, great, love that. This is another little shortcut that I use way too often, but it's super helpful. Instead of trying to line this up perfectly to something, if I wanna line it up right to that mark. Yeah, you can drag it, you can do all sorts of things, but I like to use just the little nudge tool here, it is the comma and period. So you wanna make sure that you have your outpoint selected and then you'll just hit the period to go forward, and the comma to go backwards. You can also do this if you have the whole clip selected, you can nudge it to the entire clip. So you'll see that whole clip is moving as opposed to just the endpoint. You can also do it on the endpoint here as well. I think this is shot in 60 frames a second so this will be a pretty great little demo to show you how much I love using this feature. This lets you do a speed ramp, so you're gonna go to where you want the speed ramp or the speed slow down, deramp, deescalate, down the hill, and you're gonna click Shift + B and you're gonna see that this makes a little mark right there, and this gives you some speed options up here on the top. So this says Normal, so when you click on this, this will give you a dropdown, you'll see, 50, 25, 10%, so you can choose that if you wanna slow it down by 50%, great, but you could also drag this if you need that to fit a specific kind of timeframe, so I do use that a lot. So if we want to kinda stretch this out just to get to the rest of that clip, you can do that. You can also make the speed ramp transition slower, faster, by adjusting that right there, and then if you wanna kind of speed it back up, you just do the same thing, Shift + B, and then it'll give you another marker. So that middle part will stay slow, and then it speeds up again. This also gives you options here to kinda just change it back to your normal speed, so that'll just kind of reset everything. So if I have done too many speed ramps and I've messed up everything, and I just wanna start over, I'll hit the speed back to normal and we're good to go. This is also a very fun little trick, the Hold feature. I use this a lot of times when I need to get a still shot, so we'll go to where I want to hold the frame. We use this a lot for specs, hit Shift + H, and this gives you a static shot right there, and you could extend this to as long as you need. So depending upon how you like to edit, I like editing with kinda small waveforms because a lot of times in some of my projects, I have tons of layers, so I need to be able to see everything, but if you don't have that many things open, you can decide how you want your layout to be, so you can kind of make this a little bit larger, you can choose from some of their presets here. My favorite is editing, probably just like this. So sometimes for B-roll, I like to use the T, So if we hit T, this will let you trim, but it's more of kind of like a slip tool. So it kind of lets you move this footage around in that timeframe, which I like, because if you already have this designated set piece of time, if you're putting a piece of B-roll over it, you might want it to start a little bit further, this will give you that ability to just move it around, and there you go. So like I was saying in the beginning of this video, that I am obsessed with making sure that I have a lot of music. Now, normally when I edit, I do like to start out choosing the music. So now I'm gonna drop in a few songs. So we're gonna drop those in there, and then I do kind of, like, making a little keyword collection by hitting CMD + K, and I like doing MUSIC, and that brings up our little MUSIC section, so those will automatically be sorted into music. As you can see, everything is there, so I've got our music in there, I'm gonna drag and drop this in. It depends on the type of video, I will sometimes edit with the music to kinda get the feel, but a lot of times I will just do one super quick rough edit of an unboxing and then add the music in later to make sure I have the timing, but a lot of times, my favorite way to edit is editing start to finish, like, if I get to the finish line, the end of that video, it is completely done. You can also make micro adjustments to audio, which I love using this, I got used to use the touch bar on the MacBook to adjust on my audio, and since there hasn't been one, I had to figure out another shortcut key. So I like to use Ctrl - to give your audio a little nudge, and then you can just obviously, like, adjust it like this too, there's so many different ways to adjust audio. - So nothing bone has- - Nice, nice, nice. Let's fade it in. Oh, even adjust the audio as it's playing. - 900 LED lights that have different patterns in- - That sounds good. And then to adjust the audio, if you wanna turn it up, you hit Option and click in the middle of the line, and then I adjust, do a little one of those, and then you can raise this up in between- - Like, resources. (soothing music) Nice. Sometimes also, when I'm editing with music, I will actually go in and I will add a marker on the audio where kind of like the beat drops, so I know if I'm editing, I've got something to, like, work up to. So where's that beat? Where's that beat? When's it gonna drop? (soothing music) - That's going too- - Also V will hide. Real quick here, what this sounds like. (dramatic music) Mark, there it is. (dramatic music) And we've got all of our markers in, and I know to edit just like that. So now that our video is, well, for the sake of this video, it's done, wow, it's beautiful, I love it. So to export I always use Compressor, I absolutely love it. So I go to Send to Compressor, New Batch, and it brings up Compressor, which is a separate program from Final Cut, and I will just export a 4K version. Start Batch, there we go, it's exporting. Then I upload it, make a thumbnail, and that's it, my job here's done. Well, thank you, guys, so much for watching, I feel like this was a lot really, really quick. If you guys have any questions, please leave them in the comments below. I also would love to hear from you, if you're a Final Cut editor, what is your favorite shortcut, or tip, or trick, that I might not know. If you guys haven't already, please subscribe to my YouTube channel, I look forward to seeing you in my next video, bye.",
    "transcript_keywords": [
        "CMD",
        "Final Cut",
        "audio",
        "Multicam",
        "Multicam Clip",
        "hit CMD",
        "kind",
        "make",
        "video",
        "Clip",
        "hit",
        "Cut",
        "Shift",
        "click",
        "music",
        "lot",
        "editing",
        "Final",
        "start",
        "edit"
    ],
    "transcript_entity_values": [
        "MacBook",
        "annual",
        "27,000",
        "Transform",
        "Zoom",
        "second",
        "Multicam",
        "one",
        "14.99",
        "2",
        "Compressor",
        "Justine",
        "50",
        "30",
        "50",
        "25",
        "New Batch",
        "Multicam",
        "4",
        "years",
        "three",
        "the past couple of years",
        "Multicam",
        "Spacebar",
        "YouTube",
        "Annual Plan",
        "Final Cut",
        "Normal",
        "four",
        "monthly",
        "Unboxing Part 1",
        "10%",
        "New Multicam Clip",
        "two months",
        "daily",
        "3",
        "Final Cut",
        "today",
        "the past few years",
        "third",
        "two",
        "Ctrl",
        "60",
        "the first two months",
        "Multicam",
        "9.99 a month",
        "a few updates ago",
        "over 22,000",
        "10",
        "50%",
        "hours and hours",
        "Final Cut",
        "first",
        "Mark",
        "Rotate",
        "1",
        "Artlist",
        "Multicam"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "PERCENT",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "TIME",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.050140172243118286,
        -0.08284410834312439,
        -0.015506167896091938,
        -0.10581159591674805,
        0.053714554756879807,
        0.0501200333237648,
        0.015111394226551056,
        0.045255500823259354,
        -0.020411469042301178,
        0.09334152191877365,
        0.02497900277376175,
        0.009984000585973263,
        -0.05599406734108925,
        0.013899903744459152,
        0.00823733676224947,
        0.051755037158727646,
        0.0013230775948613882,
        0.03018285147845745,
        -0.02049616537988186,
        -0.022898240014910698,
        -0.014125657267868519,
        -0.056920893490314484,
        0.036412328481674194,
        0.021501844748854637,
        -0.006052723154425621,
        0.02701871655881405,
        -0.0035224498715251684,
        0.023760031908750534,
        -0.059624556452035904,
        -0.08475980907678604,
        -0.015448978170752525,
        -0.02034272998571396,
        0.13329465687274933,
        -0.0027581516187638044,
        -0.03324636071920395,
        -0.03494449332356453,
        0.060544032603502274,
        0.034582361578941345,
        -0.019286200404167175,
        -0.03293295577168465,
        0.0028685282450169325,
        -0.025852125138044357,
        -0.0035490733571350574,
        -0.04184441268444061,
        -0.05726484954357147,
        -0.07543034851551056,
        -0.004923511296510696,
        -0.07841989398002625,
        0.03501831367611885,
        0.09477520734071732,
        -0.11869414895772934,
        -0.041074544191360474,
        -0.0549326129257679,
        0.03719942644238472,
        -0.06860088557004929,
        0.011897154152393341,
        -0.058586571365594864,
        -0.006770160980522633,
        0.047044023871421814,
        -0.05466415360569954,
        0.028518671169877052,
        -0.07918228209018707,
        -0.02932492084801197,
        0.01750927045941353,
        -0.08208707720041275,
        -0.04431521147489548,
        0.04154928773641586,
        0.019794130697846413,
        0.003694056300446391,
        0.016614526510238647,
        -0.11549843102693558,
        0.03931692615151405,
        -0.04753971844911575,
        0.018162239342927933,
        -0.06870320439338684,
        0.006131191272288561,
        0.03544046729803085,
        -0.03748054802417755,
        -0.07110430300235748,
        0.014227136969566345,
        0.039023689925670624,
        -0.05364672467112541,
        -0.09337438642978668,
        -0.004136189352720976,
        0.008474928326904774,
        0.05621357262134552,
        -0.0017372318543493748,
        -0.01375251542776823,
        0.013481966219842434,
        -0.04580226168036461,
        -0.06438927352428436,
        -0.0019756504334509373,
        0.009892879985272884,
        -0.04615475982427597,
        -0.027904678136110306,
        -0.04437817260622978,
        -0.01853415183722973,
        -0.054953381419181824,
        -0.04147686809301376,
        0.0719938725233078,
        0.031167827546596527,
        -0.07727733254432678,
        -0.06588771939277649,
        -0.06355277448892593,
        0.0035289223305881023,
        -0.053696561604738235,
        -0.009786623530089855,
        0.023322254419326782,
        -0.00866460520774126,
        0.020358886569738388,
        -0.015315227210521698,
        0.04225723445415497,
        -0.0443415641784668,
        -0.05282565578818321,
        0.030173838138580322,
        0.11561218649148941,
        -0.02167358808219433,
        0.04760253429412842,
        0.06509435176849365,
        0.03878812491893768,
        -0.0070815919898450375,
        -0.0601520910859108,
        -0.04055651277303696,
        0.06352256238460541,
        0.012956077232956886,
        0.003539453726261854,
        -0.0245205145329237,
        1.1402958622600434e-32,
        0.039805106818675995,
        0.08442484587430954,
        0.014824694953858852,
        0.001247695297934115,
        0.05012543871998787,
        -0.0150546133518219,
        -0.02476438321173191,
        0.09864137321710587,
        -0.06453367322683334,
        -0.0011285131331533194,
        -0.004299033898860216,
        -0.01578553393483162,
        -0.03113321028649807,
        0.09328608214855194,
        0.028635110706090927,
        -0.07231254130601883,
        0.009620245546102524,
        -0.029073478654026985,
        -0.09374362975358963,
        0.012982132844626904,
        0.01939796842634678,
        -0.016017891466617584,
        -0.01456686295568943,
        0.10329138487577438,
        0.10706469416618347,
        0.08630618453025818,
        0.08107656240463257,
        -0.016669491305947304,
        0.06669043004512787,
        0.004697167780250311,
        -0.09691692143678665,
        -0.04412839561700821,
        -0.0002699285396374762,
        -0.0361800380051136,
        -0.023724528029561043,
        0.006760522723197937,
        -0.04919286444783211,
        -0.030728869140148163,
        0.0024919025599956512,
        -0.024068357422947884,
        0.011025667190551758,
        0.024530552327632904,
        -0.07808543741703033,
        -0.07022445648908615,
        0.027430597692728043,
        -0.010255626402795315,
        0.025004057213664055,
        0.14703558385372162,
        -0.006081853061914444,
        0.052633702754974365,
        0.034050047397613525,
        0.019563447684049606,
        -0.026296600699424744,
        0.0008459038217552006,
        -0.05384131893515587,
        -0.08911265432834625,
        -0.04343903064727783,
        0.04230358451604843,
        0.0825001671910286,
        0.06099602207541466,
        0.01946300081908703,
        0.042014509439468384,
        -0.025563837960362434,
        0.029317891225218773,
        -0.07460245490074158,
        0.11332923173904419,
        0.05582662671804428,
        -0.005044353660196066,
        0.08433619886636734,
        -0.0027741622179746628,
        -0.07211912423372269,
        -0.01476272102445364,
        0.060843247920274734,
        0.007279698271304369,
        0.049774542450904846,
        0.03227636218070984,
        -0.12066598236560822,
        -0.09607503563165665,
        0.04738631844520569,
        -0.03623277321457863,
        -0.12879084050655365,
        0.092326320707798,
        -0.0026282176841050386,
        0.06272280961275101,
        0.020692290738224983,
        -0.06181801110506058,
        0.018608130514621735,
        -0.053572624921798706,
        -0.0368557907640934,
        -0.028876282274723053,
        -0.0414673388004303,
        0.05529235303401947,
        -0.036525219678878784,
        0.018076414242386818,
        -0.0071205561980605125,
        -1.0658120586197308e-32,
        0.0716632530093193,
        0.011395358480513096,
        0.014843846671283245,
        0.02220047637820244,
        0.051457300782203674,
        -0.00976620614528656,
        -0.005461923312395811,
        0.07569973915815353,
        0.06552986800670624,
        -0.07549754530191422,
        0.048330750316381454,
        -0.04562453180551529,
        -0.10195998847484589,
        -0.01206232514232397,
        -0.033352330327034,
        -0.08053005486726761,
        -0.008477487601339817,
        -0.07099206745624542,
        0.036562513560056686,
        -0.05943289399147034,
        0.0863625779747963,
        0.07661622762680054,
        0.09136290103197098,
        0.043719805777072906,
        -0.02377026341855526,
        0.02630629949271679,
        0.04456291347742081,
        0.060973960906267166,
        0.04059767350554466,
        0.0417192205786705,
        -0.05291274935007095,
        -0.006233353167772293,
        -0.06440230458974838,
        -0.05465976893901825,
        0.030910421162843704,
        0.07588221877813339,
        0.0038388073444366455,
        0.06334934383630753,
        0.009388702921569347,
        -0.03702891618013382,
        0.0438508577644825,
        -0.006369526963680983,
        0.050446368753910065,
        0.018340041860938072,
        -0.01524110697209835,
        -0.05881190299987793,
        -0.05080823600292206,
        0.056533247232437134,
        -0.036516882479190826,
        0.023621875792741776,
        -0.07478708028793335,
        -0.015766650438308716,
        -0.059055451303720474,
        -0.0032840208150446415,
        0.02040940336883068,
        -0.03558929264545441,
        -0.07697249203920364,
        -0.0464656800031662,
        0.017550814896821976,
        -0.00414038822054863,
        -0.013053245842456818,
        -0.03584497421979904,
        -0.050811249762773514,
        -0.03612935543060303,
        0.05167960003018379,
        -0.06061326712369919,
        0.09154852479696274,
        0.02651256136596203,
        -0.025941278785467148,
        0.024058658629655838,
        0.03619379177689552,
        0.041670069098472595,
        0.0372188463807106,
        0.0032124118879437447,
        0.04136887565255165,
        -0.03264575079083443,
        -0.025456784293055534,
        0.025733720511198044,
        0.0619913786649704,
        0.0233775544911623,
        -0.008643962442874908,
        -0.03663482517004013,
        0.01841079257428646,
        0.031038986518979073,
        0.048487450927495956,
        0.15285159647464752,
        0.03325759619474411,
        0.03865890949964523,
        0.005602317862212658,
        0.0540534183382988,
        -0.007308905478566885,
        0.05958127602934837,
        0.10992562770843506,
        0.08579874783754349,
        -0.10239126533269882,
        -5.8223864840556416e-08,
        0.058616019785404205,
        0.06363087892532349,
        -0.036664269864559174,
        0.008076582103967667,
        0.01632033847272396,
        -0.06424031406641006,
        -0.0565481074154377,
        0.0502905547618866,
        0.06057032570242882,
        -0.059200868010520935,
        0.11638373881578445,
        -0.0007598274387419224,
        -0.010079490020871162,
        0.11913186311721802,
        -0.027694957330822945,
        -0.005199604667723179,
        -0.02730165794491768,
        0.13008280098438263,
        -0.020733626559376717,
        -0.043212320655584335,
        -0.03823945298790932,
        0.029446540400385857,
        0.034885700792074203,
        -0.04277656599879265,
        0.030458198860287666,
        -0.04936455935239792,
        -0.013250445947051048,
        0.012564717791974545,
        0.04692448675632477,
        0.024631261825561523,
        -0.06178922578692436,
        0.008777648210525513,
        0.037398893386125565,
        0.03646176680922508,
        -0.035556014627218246,
        -0.06346125900745392,
        -0.04053055867552757,
        0.030862625688314438,
        -0.0005689245881512761,
        -0.0031274373177438974,
        0.023669518530368805,
        -0.1157459244132042,
        -0.01631617359817028,
        -0.027764836326241493,
        -0.025169478729367256,
        -0.04246237501502037,
        0.06953486055135727,
        -0.07842136919498444,
        -0.04618027061223984,
        -0.038425568491220474,
        -0.055475834757089615,
        0.03641180321574211,
        0.03327365592122078,
        -0.034606676548719406,
        0.06702161580324173,
        0.04456748813390732,
        0.03374531492590904,
        0.0030086899641901255,
        -0.015194188803434372,
        -0.023745274171233177,
        0.04675766080617905,
        -0.022360101342201233,
        -0.0697435662150383,
        0.02123964950442314
    ]
}