{
    "id": "bAY7T3o2QGk",
    "title": "What I Eat In A Day - Brava Oven Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-03-31T16:48:08Z",
    "video_url": "https://www.youtube.com/watch?v=bAY7T3o2QGk",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "cooking",
        "what I eat in a day",
        "food",
        "brava oven review",
        "brava oven unboxing"
    ],
    "views": 373420,
    "likes": 10979,
    "comments_count": 945,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, guys, it's Justine, and today I'm gonna show you one of my most favorite pieces of tech that I've been using over the past couple of months, and this thing has completely, honestly, actually changed my life. A huge thank you to Brava for sponsoring this video. They have been so incredibly supportive of me, my channel, and even Vlog University. They gave us a few Bravas to give out to some of the attendees, so not only is the oven incredible, but their entire company has been so generous and so thoughtful, and just very supportive of me and my community. So over the past few years I've been focusing a lot on my health, my fitness, and sort of just general, all around wellbeing. The one thing I noticed was that I wasn't really seeing the results that I wanted and unfortunately, I had to tell myself Justine, it is the foods that you're eating. My day to day was either eating out or frozen food, or ordering delivery, so last year Brava reached out and wanted me to check out this oven, and I was extremely excited because it was one of the most technologically advanced things that I had seen, and obviously being a technology lover and someone who can't cook, this was something that I felt was right up my alley, and I couldn't wait to try it out. It cooks with a combination of visible and infrared light, so this allows the food to cook faster and more efficiently than most ovens or microwaves. There's six high-powered lamps that turn off and on in between cooking, and can focus on specific zones in the oven without heating the area around it. So this allows you to cook multiple items at the same time, on the same plate, and those would normally have to be cooked separately. It has eight temperature sensors, two particle detectors, and one of my favorite things, a camera. You can watch your food cook without ever even having to open the oven, and it connects to an app. You could be watching your food live on your phone while it cooks. If you want to pause a cook, you can control it on your phone. It connects to WiFi, so it will do updates over the air. You can get recipe updates, software updates, and it's always so exciting when I come downstairs and I realize that there are some new recipes added. They work specifically with Brava chefs to design these recipes so that you can do multiple cooks on the same pan. The app has a bunch of different recipes built in, so it'll show you exactly what you need to make that recipe, so sometimes I will go through the app, find a really cool recipe, get all of the ingredients, and I'll feel like an actual chef, 'cause I will pull off this incredible meal and really I didn't do anything. I just put some stuff on some pans where it told me to put them, and the oven does the rest. But now I want to take you into my food vlog. Here we go. Good morning, it's time for breakfast. Normally I actually eat two breakfasts. Mostly if I go to an early gym class or jujitsu or something like that, I try to eat something very small before I go to class, maybe some fruit or some oatmeal, and then I come back and I have a second breakfast, which is usually a breakfast sandwich or a breakfast frittata, usually something containing eggs for protein, so today we're gonna make one of my favorite little breakfast sandwiches. It's actually an open-faced breakfast sandwich, but in the Brava menu selection, I just choose breakfast sandwich and we take it from there. When I first started using this oven, I followed the recipes exactly, and as you kind of learn the temperament of this oven, you'll figure out different ways to change things up and make it your own. One of my favorite things about this oven is there's so many different pans for it. So we have a square pan. This is the muffin tin, loaf pan, and glass tray. For my breakfast sandwich, I'm gonna need two of these pans. This is the egg tray, and this is the metal tray. This one is my favorite because I eat eggs almost every single day, but you can use this to make all sorts of different things. I even saw they had a brownie recipe, which looked incredible. I didn't try it, but I'm tempted. It even has a temperature sensor. This plugs right into the oven, so this helps you get an accurate read of whatever it is that you're cooking, if it's a fish, or a meat, so that it'll be a perfect temperature when it comes out for you to eat. (light upbeat music) So we got our eggs and and English muffin, and I like to put a half slice of jack cheese on each piece, so it's actually a half slice, but a half of a half. The cheese will melt in the oven, and the muffin will be toasted at the same time, and it's perfect. (light upbeat music) So this is something that I cook often. I usually just go into recents, click egg and cheese breakfast sandwich, determine how many I'm going to be making. Even though I'm making one, I'm using two eggs. It tells you exactly where to place the bread, exactly where to place the eggs. If you want to adjust your time, I like a little bit runnier of an egg, so I decreased it by 6%. One last check before you're ready to go, and that's it, time to cook. My favorite part about this is the fact that this oven has a camera inside of it, so what I do a lot of times is I will make my sandwich, I will go up and take a shower really quick, and I will keep the live camera open to see how much time I have left so I can keep showering, and get down here in just enough time for my sandwich to be done. It's done. It also gives you an option if I want to touch up the cook. But this looks pretty good to me. Oh, I mean, these are perfection. I like to add a little salt and pepper, and then these are good to go. It's gonna be an open-faced sandwich. (light upbeat music) It's so perfect. Breakfast is my favorite part of the day. That's why I usually eat breakfast twice. And now I'm gonna make some blueberry muffins to have as a snack throughout the week. I'm gonna change this recipe up a little bit from what is on the Brava app. I have made this recipe on the Brava One and it was so incredible. But I want to add some oatmeal so hopefully it still turns out okay. That's one of the fun things that I love about the Brava oven is I will kinda follow these recipes, and then you can change it up a little bit to make it your own, so fingers crossed that this one works. (light music) Batter is made, and the only cupcake liners that I could find were some from Halloween, since I don't really do baking videos anymore. (light music) Remember when I said I was making blueberry muffins? And I forgot to put the blueberries in. (light music) So we're now rapidly preheating the oven, and one of the things that I love about this as opposed to regular baking, it preheats really quickly and it doesn't emit a lot of heat from the actual oven itself. These look so good. Can't wait to try them. (light music) Muffins are done. How are they looking? Let's see. I'm so excited, it's always so nerve-wracking when you change up a recipe, 'cause you don't know what's gonna happen. But I'm already super happy with this. These are pretty healthy. They're basically just like oatmeal, honey, flour. This is still warm too. Look at that, oh yeah. I need to get a fork. So for this recipe, I didn't use any sugar to sweeten it, I used honey. So it's definitely less sweet than a normal blueberry muffin, but it still is really good. It tastes like health. (light music) I need a testimonial from you. - Yeah? - How were the blueberry muffins that I made? - Very lovely. They were incredible. They are gone. They were very good, and right now I'm actually making a breakfast sandwich in the Brava. - No way, show me. This wasn't even planned. - [Jenna] It's the homemade bread that Jill made and sent over and eggs. - My gosh, that looks so good. Well, enjoy your breakfast. I'm gonna just keep editing my video here. - Okay, bye. - Bye. It's time for lunch and Jenna brought over one of her favorite things to make in the Brava oven. - Frozen sweet potato fries, absolute favorite. - So I'm making myself some salmon and vegetables and salad, and Jenna doesn't eat meat, so she's basically gonna show us her favorite lunch, and then I'll show you my favorite lunch, so Jen, prep your sweet potatoes. - Well, I eat other things. This is just like my favorite little snack. - These look so good. Okay, what type of pan are we gonna need? - [Jenna] I have just washed this. - [Justine] So is there just a setting in here? - [Jenna] Yep, I think it's uh, sweet potato fries. - [Justine] Okay, frozen sweet potato fries. - [Jenna] Yep that's it. - [Justine] Crinkle or straight, what do we have? - [Jenna] These are straight. - While Jenna's getting her fries ready and prepped, I'm gonna get my salmon ready. (light upbeat music) - [Justine] Would you like to do the honors? - [Jenna] Oh, yeah. Yours is blue? You can change the color. No way. - Yep. Yep, in the settings. - Get outta here, it turned blue. I'm very excited. (light music) - Jenna, they're done. - No way. - Yes. Look at those. Oh man, I'm taste testing before you. Oh, that's so hot. These are fantastic. Mm. Jenna, thanks for bringing over your favorite snack. - [Jenna] Oh, yes, always. - [Justine] Okay, here you go, Jen, all for you. Let me just take one more. - Thank you. - Mm. - You can take some. - I'm making salmon. (light music) Okay, we've sent the salmon to my oven, so you guys can see right here, click it, and now we're gonna go through-- We've got two filets, and now this is telling me to enter the thickness. This is actually a measurer, so now I'll just measure our salmon. And then on here, with the little graphic, it coincides with the height. Plugging it into our meat first, salmon goes into the bottom shelf, and then we plug in the temperature sensor right here in the side. - Skin on. - Skin on. (light music) Look at you guys. The fact we have this temperature sensor, we'll know exactly the proper cook. And there we go. Oh yeah. Salmon is my favorite. I'll have the salmon. I can't wait for dinner. Time for dinner. I love dinner, it's one of my favorites, other than breakfast and lunch, of course. Those are also my favorites. I just like food, so for dinner I'm gonna make chicken and cauliflower. This recipe actually has broccoli, but it works exactly the same, so this is usually what I use when I'm making chicken and cauliflower. I'm just gonna go through and follow this recipe. This takes about 16 minutes total time. (light music) So my favorite feature is being able to just send this recipe right to my oven, so I click that little paper airplane, it sends to the Brava, and it shows up, and this shows you exactly where everything should be aligned, and it tells me which shelf to put it in. And there I got my notification that my chicken thighs, boneless and skinless, and broccoli has started, and if I click it, it will launch up the live stream. This'll give me just enough time to prep a salad. (light music) oh yeah, look at that. And here it is, dinner is served. Check that chicken out. Matty, you can't have any chicken because you're allergic. Oh, these are cooked perfectly. Oh my gosh, so good, mm, incredible. They also have a really awesome community, so on their Facebook page, people share custom cooks that they created. You can choose ones that you like and then you can just download them right to your oven. So that vlog was kind of an example of what I eat throughout the day when I'm at home working. I also do snack a lot throughout the day, but it's usually on healthy snacks. I'm always looking for some added protein, so I'll have a protein bar. There's also these really good peanut butter protein bars that I eat lot of. Sometimes I'll just go for a couple scoops of peanut butter, almonds, cashews, oatmeal bars, whatever fruit I might have in the fridge. I love bananas, blueberries, strawberries. Thank you again for watching. I'll put a link in the description if you want to check out more information about the Brava oven, and I will see you guys in my next video. Bye. (light upbeat music)",
    "transcript_keywords": [
        "oven",
        "Brava",
        "favorite",
        "Brava oven",
        "breakfast",
        "breakfast sandwich",
        "recipe",
        "time",
        "cook",
        "things",
        "Good",
        "sandwich",
        "make",
        "eat",
        "favorite things",
        "salmon",
        "food",
        "making",
        "eggs",
        "recipes"
    ],
    "transcript_entity_values": [
        "English",
        "Matty",
        "second",
        "one",
        "Justine] Crinkle",
        "Brava",
        "Bravas",
        "the past couple of months",
        "Justine",
        "Vlog University",
        "Brava",
        "the day",
        "the week",
        "last year",
        "mm",
        "a half of a half",
        "about 16 minutes",
        "6%",
        "half",
        "Mm",
        "Jen",
        "Halloween",
        "Brava",
        "six",
        "today",
        "the past few years",
        "eight",
        "two",
        "Jill",
        "Facebook",
        "first",
        "Jenna",
        "My day to day",
        "One"
    ],
    "transcript_entity_types": [
        "LANGUAGE",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "GPE",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "TIME",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "NORP",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORDINAL",
        "PERSON",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.01004281546920538,
        -0.04824555292725563,
        -0.051237694919109344,
        -0.09538393467664719,
        -0.04686051607131958,
        0.010460805147886276,
        0.09933605045080185,
        -0.00375027721747756,
        -0.011134106665849686,
        0.0352659709751606,
        0.012001224793493748,
        -0.0791870579123497,
        0.00960659421980381,
        -0.02195879817008972,
        0.008836597204208374,
        -0.0715487077832222,
        0.11947133392095566,
        -0.06218960881233215,
        -0.02782156504690647,
        0.02769290842115879,
        -0.02636631764471531,
        -0.019275441765785217,
        0.03558605909347534,
        0.020880410447716713,
        -0.018140457570552826,
        0.08670128136873245,
        0.014977940358221531,
        0.041768141090869904,
        -0.1272919774055481,
        -0.10186717659235,
        -0.005955361295491457,
        0.00851686391979456,
        0.09991644322872162,
        -0.05619192495942116,
        0.002731098560616374,
        -0.012770199216902256,
        0.00454049464315176,
        -0.04884980618953705,
        -0.020222341641783714,
        0.021587718278169632,
        0.04582340270280838,
        -0.07931516319513321,
        0.006513230036944151,
        -0.04475871101021767,
        -0.028860285878181458,
        -0.0665377750992775,
        -0.021349167451262474,
        -0.04514176398515701,
        0.07788243889808655,
        0.023597009479999542,
        -0.09821034222841263,
        -0.010777116753160954,
        0.03250884637236595,
        0.007879194803535938,
        -0.06560356169939041,
        -0.05625452846288681,
        -0.12024006247520447,
        0.03582926467061043,
        0.01374934334307909,
        0.0026854760944843292,
        0.04565821960568428,
        -0.03430837020277977,
        -0.020034871995449066,
        0.06894749402999878,
        -0.028165491297841072,
        -0.08432342857122421,
        -0.03765826299786568,
        0.06826423853635788,
        -0.03596910461783409,
        0.009712989442050457,
        -0.11666429042816162,
        0.035697199404239655,
        0.012058673426508904,
        0.028296511620283127,
        0.010561881586909294,
        0.027185283601284027,
        0.10075867921113968,
        -0.14172843098640442,
        0.0060062347911298275,
        0.037829361855983734,
        0.004697184544056654,
        -0.05332008749246597,
        -0.07334510236978531,
        0.015032731927931309,
        -0.014369543641805649,
        0.05325286462903023,
        0.06253544986248016,
        0.024461660534143448,
        -0.018543748185038567,
        -0.06782080978155136,
        -0.04487457498908043,
        0.004018350970000029,
        -0.0252624973654747,
        -0.001103286282159388,
        -0.008220258168876171,
        -0.036380425095558167,
        -0.05111001804471016,
        -0.06777539104223251,
        0.0030881392303854227,
        0.04385310411453247,
        0.012653211131691933,
        -0.03205374628305435,
        0.024120522662997246,
        -0.01994222030043602,
        -0.03319214656949043,
        -0.11402209848165512,
        -0.04014742374420166,
        0.05657954514026642,
        0.07207832485437393,
        0.0053067938424646854,
        -0.08481051027774811,
        0.09791938960552216,
        -0.03787284716963768,
        -0.06355886161327362,
        -0.012068700045347214,
        0.0867941826581955,
        0.009742466732859612,
        -0.010536745190620422,
        0.043698061257600784,
        -0.02061905898153782,
        -0.016623126342892647,
        -0.05777450278401375,
        0.029672011733055115,
        0.05704818293452263,
        0.007206123322248459,
        0.04373844340443611,
        -0.005333396606147289,
        1.3853716672587082e-32,
        -0.06041882932186127,
        0.056081026792526245,
        0.07394058257341385,
        0.0507127083837986,
        0.06992823630571365,
        -0.02432398311793804,
        -0.05128617584705353,
        0.0737110823392868,
        0.010476730763912201,
        0.02139749936759472,
        0.02039860375225544,
        0.03827819973230362,
        -0.0726388618350029,
        0.09509360790252686,
        0.041890278458595276,
        -0.041128698736429214,
        -0.006717093288898468,
        -0.03190005570650101,
        -0.033356498926877975,
        -0.02140810713171959,
        -0.06727225333452225,
        -0.04263218864798546,
        0.039451900869607925,
        0.10462071746587753,
        0.09880577772855759,
        0.05282937362790108,
        0.07571230083703995,
        -0.008543699979782104,
        0.014939827844500542,
        0.00012810602493118495,
        0.0414888933300972,
        -0.0361587256193161,
        -0.05085211247205734,
        -0.1069464385509491,
        -0.05712896212935448,
        0.012378253042697906,
        -0.05616333708167076,
        0.03723624721169472,
        -0.06458482891321182,
        -0.05935085192322731,
        -0.019163815304636955,
        0.044299766421318054,
        -0.0006636901525780559,
        0.005328380968421698,
        0.025704720988869667,
        0.027947064489126205,
        0.03473575785756111,
        0.09312165528535843,
        0.002185953315347433,
        -0.005186206195503473,
        0.0038680455181747675,
        -0.011875730939209461,
        0.016871247440576553,
        0.012818041257560253,
        -0.022999543696641922,
        -0.008802521042525768,
        0.030245741829276085,
        0.009039778262376785,
        0.05546516180038452,
        0.015141550451517105,
        -0.008082512766122818,
        0.0459475964307785,
        -0.016113361343741417,
        -0.03280170261859894,
        -0.06862357258796692,
        0.10222738236188889,
        0.03835592418909073,
        -0.021544568240642548,
        0.058170631527900696,
        0.022388244047760963,
        0.025404365733265877,
        -0.033305440098047256,
        0.08653420954942703,
        -0.014200424775481224,
        0.06507246941328049,
        0.08426310867071152,
        -0.07816650718450546,
        -0.09293106943368912,
        0.01920064352452755,
        -0.0539100281894207,
        0.015789136290550232,
        0.029431335628032684,
        0.014359688386321068,
        0.05906955525279045,
        -0.07230628281831741,
        -0.022778525948524475,
        -0.022312290966510773,
        -0.06594076752662659,
        0.05101063847541809,
        0.07227830588817596,
        -0.038526806980371475,
        0.049673471599817276,
        -0.036023955792188644,
        -0.04638681560754776,
        -0.08826706558465958,
        -1.2763998144544296e-32,
        0.02473115362226963,
        0.007800245191901922,
        0.015948062762618065,
        0.048206690698862076,
        0.07991332560777664,
        -0.07412523031234741,
        0.02463485673069954,
        0.06769808381795883,
        0.04233097657561302,
        -0.09338501840829849,
        0.04032169654965401,
        -0.041110653430223465,
        -0.08242527395486832,
        -0.03763275220990181,
        -0.05075060948729515,
        0.024466359987854958,
        -0.009890678338706493,
        -0.029545964673161507,
        0.042785461992025375,
        -0.03666058927774429,
        0.007589174900203943,
        0.11022152006626129,
        0.05625438317656517,
        0.024213753640651703,
        -0.0131716039031744,
        0.07520522177219391,
        0.03158126398921013,
        0.11215852200984955,
        0.04067949578166008,
        -0.018998032435774803,
        -0.03600210323929787,
        -0.09335982799530029,
        0.01198483444750309,
        -0.012055415660142899,
        0.03092147223651409,
        0.03876112028956413,
        0.03664836287498474,
        0.05217992141842842,
        -0.028809987008571625,
        -0.08888337016105652,
        0.01389455795288086,
        0.0053400821052491665,
        -0.0443146675825119,
        0.02786494418978691,
        -0.0017439492512494326,
        -0.06225692480802536,
        -0.040014516562223434,
        -0.011664733290672302,
        0.012162398546934128,
        0.060488902032375336,
        0.006634033750742674,
        -0.07907573878765106,
        -0.03151065483689308,
        -0.03048946149647236,
        0.0036881088744848967,
        0.02166898362338543,
        -0.032779399305582047,
        -0.01674824208021164,
        0.053298965096473694,
        -0.024315284565091133,
        -0.008281820453703403,
        -0.029730701819062233,
        -0.020162250846624374,
        -0.02293713577091694,
        0.0190188717097044,
        -0.046455126255750656,
        0.06229918450117111,
        0.016356859356164932,
        -0.004357605241239071,
        -0.016357341781258583,
        0.0032555314246565104,
        0.024697698652744293,
        0.029537467285990715,
        -0.03168971464037895,
        -0.01731060817837715,
        0.012986133806407452,
        -0.03654545918107033,
        -0.03890051692724228,
        0.013429529033601284,
        -0.00861038826406002,
        -0.08134932070970535,
        -0.03410721942782402,
        -0.017093446105718613,
        0.05828285217285156,
        0.08084554225206375,
        0.08436877280473709,
        0.042032595723867416,
        -0.055976904928684235,
        -0.058558184653520584,
        0.13126049935817719,
        0.01786651834845543,
        0.07827048748731613,
        0.07844581454992294,
        0.08436496555805206,
        -0.005046515725553036,
        -6.628467019709205e-08,
        0.05428735166788101,
        -0.03203402832150459,
        -0.03615903481841087,
        0.04238905757665634,
        0.056086260825395584,
        -0.0923747718334198,
        -0.003952855244278908,
        -0.06840439140796661,
        0.08787114918231964,
        -0.048258133232593536,
        0.08217921853065491,
        0.043659817427396774,
        0.01780850440263748,
        0.10015156120061874,
        0.024398013949394226,
        -0.019288327544927597,
        -0.039724722504615784,
        0.04550787806510925,
        -0.06477734446525574,
        -0.045444607734680176,
        -0.02576548419892788,
        0.053104218095541,
        0.0165204219520092,
        -0.05897088348865509,
        0.05357152968645096,
        -0.009919706732034683,
        -0.005167369730770588,
        0.01507696881890297,
        0.09234250336885452,
        0.04471886157989502,
        -0.07858296483755112,
        0.005548958200961351,
        0.008585297502577305,
        0.008843224495649338,
        -0.06881696730852127,
        -0.06997230648994446,
        -0.10306811332702637,
        -0.04849518463015556,
        -0.026438286527991295,
        0.01443853136152029,
        -0.009965657256543636,
        -0.14885124564170837,
        -0.03921586275100708,
        0.022190911695361137,
        -0.04477643221616745,
        -0.06339230388402939,
        -0.024746675044298172,
        -0.053177524358034134,
        0.004464802797883749,
        0.05929240584373474,
        -0.02041735127568245,
        0.03917060047388077,
        0.08364884555339813,
        -0.035959262400865555,
        0.002155507681891322,
        0.011060236021876335,
        0.023361317813396454,
        0.021120313555002213,
        0.08205226063728333,
        0.01151653565466404,
        0.0577075369656086,
        -0.053048279136419296,
        -0.0908767580986023,
        0.017925210297107697
    ]
}