{
    "id": "bc8Okr4cgL4",
    "title": "Upgrading our WORST Gaming Setup!",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-04-04T17:56:30Z",
    "video_url": "https://www.youtube.com/watch?v=bc8Okr4cgL4",
    "category": "Science & Technology",
    "tags": [
        "NVIDIA",
        "Podcasting",
        "Acoustic Foam",
        "Closet Setup",
        "Gamer",
        "RTX HDR",
        "DLSS",
        "4080 Super",
        "4070 Super"
    ],
    "views": 1636944,
    "likes": 79343,
    "comments_count": 4678,
    "description": "Nvidia wants to help upgrade YOUR setup as well. Head over to  for a chance to win YOUR OWN 4080 Super.  Whether theyre an old employee or new, not EVERYONE at Linus Media Group has an incredible work or gaming setup at home. We cant fix 'em all, but we can try to fix the worst one.  Discuss on the forum:   Buy an Alienware AW2725DF 360Hz 27\" Gaming Monitor:  Buy a Fractal Design Meshify 2 Compact ATX Mid Tower Case:  Buy an Intel Core i5-13600K CPU:  Buy an ASUS Prime B760-Plus Motherboard:  Buy an ASUS TUF Gaming 850W 80+ Gold PSU:  Buy an NVIDIA RTX 4080 Super FE Graphics Card:  Buy an Epomaker RT100 Wireless Mechanical Keyboard:  Buy a Logitech G305 Wireless Mouse:  Buy an LG DualUp 28\" Monitor:  Buy an 8K@60Hz DP Cable:  Buy a Focusrite Scarlett 2i@ USD Audio Interface:  Buy Beyerdynamic DT 770 Pro Closed Back Headphones:  Buy Beyerdynamic DT 770 Pro Open Back Headphones:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:30 Our First Contestant 2:20 Our Second Contestant 3:25 Our Third Contestant 6:10 Picking our Winner 8:35 The Makeover 9:15 Airflow 12:05 The Setup 13:30 RTX HDR Conversion 15:00 The Podcast 16:15 Audio 17:40: And Something for YOU!",
    "description_links": [
        "https://gleam.io/E6Yvw/nvidia-rtx-4080-super-giveaway",
        "https://linustechtips.com/topic/1565470-upgrading-our-worst-setup/",
        "https://lmg.gg/1g73J",
        "https://geni.us/0jRuDWb",
        "https://geni.us/W4Ptq",
        "https://geni.us/uk7N",
        "https://geni.us/qI1YLX",
        "https://lmg.gg/b9Isk",
        "https://lmg.gg/FGKiu",
        "https://lmg.gg/e8s80",
        "https://geni.us/WgNsQb",
        "https://lmg.gg/myA8U",
        "https://lmg.gg/vQf9y",
        "https://lmg.gg/7BLsR",
        "https://geni.us/wQssoR",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "Six years ago, I invaded my employees' homes and roasted the worst gaming PCs that I could find. Well, guess what? We're doing it again. But this time, Nvidia sponsored the video so we could not only upgrade the winner's rig, but their entire flipping setup. But there can only be one. So I'm going in, I'm taking notes. I'll be deciding what I think they need. And the best part, they'll never even know. That I was here. First up, we've got Mr. Robert Oakes, editor extraordinaire and big liar. Because this laptop looks perfectly good for both gaming and video editing. Yeah, I use it mostly for gaming. I haven't gotten too much editing in on it yet. I've put a little Photoshop. That was not the point. Ah, here's your problem right here. A pre-built? Yep. I thought you work at Linus Tech Tips. I bought it back in 2017. It's almost seven years old now. So this is back in high school for me. Oh my God. I feel so old. The real problem, honestly speaking though, is not the tower. The desk seems solid enough, but really? Regardless of whether the upgrade goes to someone more competitive or if it goes to a sightseer like Robert. The first thing they're going to want to do is turn on G-Sync. Your display does support it. And actually, you have an NVIDIA GPU. You can turn it on to eliminate tearing. It's just that you don't really have enough FPS. This is a little confusing, though. You have a much better monitor that, by the way, I recognize from our warehouse, that's not set up. Did you stage this to try to win? A move was impending, so I just never set it up. And now it's here. So you would be powering this off of a GTX 1050. The mismatch between this monitor and your system actually highlights one of the reasons Nvidia insisted that these upgrades should be the full setup. Because even if you have a technological advantage like near instant pixel response times or high refresh rate, like on this gigantic OLED monitor, if you can't also take advantage of other technologies like a fast GPU with Nvidia reflex to reduce system latency, well, the next time you go down and rank, you might not know. Was it my GPU or was it me? It's probably me. Oh, well. Next up, we've got Onie Tam, senior content writer for Labs. A delightful couch and wow, look at this! Couch gaming setup and... Are you kidding me? It's a bit far. I don't even know where to begin with this. Okay, first thing. Yep. Awesome setup. I love the case that you have on this. You've got the dock and everything. External SSD and... that straight up USB to SATA, just old school style adapter. I am loving this. Oh, wow. It was the cheapest one at Costco. Yes, it was. Onie just moved here for this job, so that would explain a fair bit of... Emptiness. One of NVIDIA's big emphasis points for this setup upgrade is RTX Video HDR, and I got to say, NVIDIA, if we choose this one, it's going to cost you because while it's a really cool technology that takes your SDR content and converts it to HDR on the fly, you're going to need an HDR display. This HDR? I'm kidding. Our next location is a vibe. I guess this explains who it is. I see this is your setup. This is not my setup. This is my boyfriend's setup. I see. You can tell by the yarmulke. There's probably another yarmulke. And a bedtime routine. And a bedtime routine. And another bedtime routine. This is the same bedtime routine. It is the same bedtime routine. His diary. This also has a bedtime routine in it. That is one of my setups. I actually have two. You'll notice that there is nothing there. This is where I sit when my boyfriend's lonely. You'll note that we have three different office chairs in here, but I use this because the cats like the office chairs. I can see that. This is my setup. Your battery is running low. Is it? Well, that's because I forgot to plug it in. I used to have a worse setup because I used to have a much smaller closet. But it was the only place in the house where I could pad everything for podcasting. I like that you've got the whole heat and noise isolation from the room that you're working in vibe. Yeah. Yeah. Professional. Professional grade setup. Oh, and if I want some privacy, I use that little curtain rod and I put this blanket on it. You have a wonderful selection of headphones, most of which are in one piece. That one's the highest spec one. It's very dead. Um, here we have my boyfriend's morning routine. Yeah. That's good. Make bed. Um, apparently that one's optional. This is something. It is. Yeah. Technically it's foam. Yeah. It's not the right kind of foam for acoustic treatment though. - I know. Okay. This mouse is also experiencing a distended cable. I think they call that a hernia in humans. And this may be the dimmest monitor that I have seen in 15 years. Is that on purpose? Like, is it turned way down? It might be. I am very light sensitive. Nope, it's all the way up. Okay. You do yoga? Uh, I don't. Uh, this is, uh, this is a board I got from the, uh, hardware store. But this is a yoga mat. That is a yoga mat. Okay. Um, but underneath it is a board. Yeah, it wasn't what I was asking. The yoga mat was acquired from Value Village. The board was not-Baloo Village. Very fancy. Jessica, the board was not why I asked if you do yoga. People don't do yoga on a board. I, I wouldn't know. I don't do yoga. I think I need to go now. Wow, that was an experience. Current effort level is a zero. How bad is their stuff? I don't even know, I didn't wanna touch it. It was very difficult for us to determine a winner, you guys. Robert, you showed us some things that your grandmother left you. I mean, these speakers may have belonged to your great-grandmother. The point is, very tasteful desk. He uses it to hold his computer and store his grandmother's ashes. Onie, you had the most minimalist of minimalistic setups, including the most minimal screen size I think I've ever seen. Your upgrade would probably involve binoculars at the webcam so that people might be able to see you from way back here. As for you, Jessica, we dubbed your setup, the hovel. You got zero points for your current level of effort. You even made calling Papa John's easy by having their flyers all over the place. Those aren't mine. In some ways, even more minimalistic than Onie's setup. There is a desk. Yep. I don't just game like on a patch of floor. Nope, you've got a chair, which is good. While the effort level was the lowest that we saw, I think your need could best be described as dire. And you maxed out your X factor score. This is where Jessica podcasts. I think we can all agree that Jessica's need is the most. So as part of yours and Onie's consolation prizes, you don't live at Jessica's house and you will each be taking home a 4070 super. Whoa. Wow. Holy smokes. Thank you for participating and letting us judge you. You think I want to live at my house? Is that the prize? Do I get to live somewhere else now? No. But the prize is that we are going to give you an overhaul. However... there's a catch. It's dealer's choice. You can give us a rough idea of what you're trying to do, which you already have, and after that, it's completely up to my team of experts. We've got The Walking Hazard, The Silent Enigma, and Justin, who's just in the team. Okay, you guys ready? We have one hour before Linus gets here. Okay. That's it. Go! Can we put the new panels over top of those? Yes or no? Yes. Yeah, do it. Put them over top. All right, bring it over. Fits it perfectly, like a glove. Yeah, so this is their 27-inch 360-hertz monitor. It's QD OLED as well. These things are fricking awesome. Dell Alienware has been killing it in the monitor game. And wait, which way is? Oh, this way. There we go. Nice. All right, are you ready to boot up? Ooh! Oh, tasteful. Here we go, here we go! Look, we upgraded your shoes! Ooh, airflow! As you know, you need two setups. One of which you had already in the podcasting closet, and one of which you had a desk for, and that's about as far as you got. Well, Jessica, here it is, your desk, but now with a gaming rig. An actual computer tower. An actual computer tower. And, and, I personally removed what appeared to be milk from the desk. Oh, no. There's no milk on the desk anymore. Oh, I thought you meant in. No, no, no. Oh, my gosh. Okay, so. Okay. Why don't we, for starters. Okay, so where is my second one of these so I can stack them? top of each other. You know what? I will be right back. I have a solution to that. It's off the floor now. It'll suck in so much less cat hair. That actually is a consideration that we should have considered. What I would like you to do is just move the mouse. Okay. Do you notice anything? Well there is a there is a pad underneath it rather than unforgiving hardwood. Yes. Do you notice anything else? It is wireless. Yes. Do you notice anything else you know about maybe just the experience? It is bright enough to see everything without squinting or being in a completely dark room. It has extremely low sensitivity. Okay, leave the mouse alone for a second. Do you notice anything about the experience? It's better? I have autism. Jessica, and this is something we've observed many times, and we've always thought is a little weird. I've never actually asked you about it though. Jessica usually games on her work computer using remote access. So after WAN Show, Luke and I would frequently come across, oh, I don't know, Dave the Diver or other various games. It's not that we were trying to snoop on you. It's just that we go up there to play Super Chex and your computer would often be on playing games. And we're sitting here going, \"It's Dave the f*cking Diver. She doesn't have a computer at home that can run this.\" So my point is, anyway, Jessica. Please grab that window, for the love of God. Grab that window and move it around and tell me you can't tell that you're at 360 Hertz. I've never looked at a screen with 360 Hertz on it for very long. Okay, let's open a game. Let's just open a game. Okay, we'll open a game then. All right, let's go with Alan Wake 2. Why don't we talk about the setup? Okay, she's got an AW2725DF QD OLED gaming monitor. This thing freaking rocks. I can't not click on heads with it. I absolutely love it. It's 1440p. 360 Hz, lightning fast pixel response times.It's literally one of, if not the best gaming monitors on the market. And to go with it, we've got a whole new machine. 13600k, ASUS B760+ motherboard, 850 watt titanium power supply. And to drive all those pixels, add up to 360 frames per second. NVIDIA sent over an RTX 4080 Super. So this thing is going to absolutely crush any game you throw at it. Oh, that's a slow run. I don't think that's the monitor's fault. That is a slow run. I can run faster than that and I have asma. It's HDR. Yeah. Looks very nice. I'm very happy, I don't know if that's obvious. Thank you for telling us explicitly. We actually do appreciate that. I am experiencing very positive emotions. This, hey! That is what you get jaywalking in New York. Just getting punched by shadow demons. The best part guys, is that we don't have to be limited to just games that support HDR to get these dazzling lights and this level of realism immersion. The water effects are really cool. Uh-huh, see, that's good, you're doing good. Now you'll be hosting Tech Tips in no time. Yeah. Let's play an older game and show you guys how RTX HDR conversion works. Did you ever play the Batman games? I did, originally on console, I did. Okay, well let's fix that. Woo! So the big thing we're seeing here is that this is a game that was never remastered in HDR and yet, man, look at the lights of Gotham City. That lightning flash though, that timing couldn't have been any better. Look thugs, go get them. Those could be just nice young men. They're destroying a car. This guy's not. Did he just take off in the air? I don't know. How are you liking the setup? It's really cool. We got you a new keyboard. Yes. New mouse, basically everything. Just this desk seemed extremely sturdy. Yes. And we felt that it was fine. All right, there's more. Check this out. Cable management. Wires. I know. Well, no, not just that, the wires are new. They are. Yes, the management of them is also new, but the wires themselves are new. Check this out. Where do they go? Let's play Follow the Cables. By the way, you might've noticed we're using our new magnetic cable management arches at LTTstore.com. Here it is, your laptop stack. Well, oh, wow, you seem surprisingly unconcerned by that. Okay, well, anyway, you're not gonna be using them anymore. That was my point. And you won't be using these anymore either. You'll be using none of that. Goodbye. Ta-da! Have a seat. A closet. The closet is not what's new. What's new is the proper acoustic panels, which, go ahead, lean in and talk. Also, we had pretty limited space to work with in here, which got us thinking, what if there was a creative monitor that could give you way more screen real estate, but was an unconventional shape? Yeah. So we chose the LG Dual Up. It's a taller than normal monitor that gives you not only way more space, but as you noticed before, way more brightness as well. And what's really cool about this is that we're using a fiber optic display port cable to run the monitor, and then we're using an active USB cable to get your peripherals over here. So this is the same computer. Yes. Which means that if you wanted, you could podcast on your- You don't have to drag the whole tower over here? Yeah. You just drag yourself over here. And you're good to go. We've got your audio interface. We've got a USB 3.0 hub, so you can run other devices if you need to. And you could even game in here if. If I really wanted to feel like Batman. You probably also couldn't help noticing that we managed to put a mouse pad in here. Justin custom cut this to be exactly the size of your board. How did the headphones feel? Well, they don't make my head hurt. Okay. Okay. Good, they're very light. Yes. And they're very soft. These are the DT770 Pros from Beyerdynamic. They are amazing. They're one of my personal favorites and it's all about the comfort. And here, if you pop them off for a second, the noise isolation. So they've got this nice, I don't know what the hell to call this fabric. Chinchilla. Chinchilla fur, yes. Chinchilla fur ear cup. And then they are a closed back headphone, but they still sound really good, even though closed back is not generally my preference. I cannot get over what a difference in image quality this new monitor is, and again, shout out Infinite Cables, that active DisplayPort cable. I use those same ones at my house, and they are flipping amazing. And the best part is that, you know how laptop fans tend to be kind of whiny, right? If you're ever recording a podcast or anything in here... Computer's in a completely separate room now. Well, this was an absolute blast. Thank you, Jessica, for hosting us. And I hope you enjoy your upgrade. It is significant. Yes. And thanks again to NVIDIA for sponsoring this video. They are also doing another giveaway. Not to Jessica this time. I'm very sorry. And Green Screen Linus is going to tell you guys how to enter. Want an RTX 4080 Super? Do you want it for free? Well, all you have to do is click the link in the description or head on over to our Twitter page for a chance to win a 4080 Super Founders Edition, courtesy of Nvidia. With technologies like DLSS 3 and frame generation, just like our three winners today, you can reach those high frame rates in demanding games like Alan Wake. But remember, there can be only one winner. If you guys enjoyed this video, we always love handing out upgrades and it's even better when I don't have to do any of the work. Hey, you guys did great. Thanks gamer.",
    "transcript_keywords": [
        "setup",
        "Yeah",
        "Jessica",
        "monitor",
        "Nvidia",
        "HDR",
        "worst gaming PCs",
        "game",
        "bedtime routine",
        "desk",
        "computer",
        "good",
        "games",
        "gaming",
        "routine",
        "yoga",
        "guys",
        "invaded my employees'",
        "roasted the worst",
        "cable"
    ],
    "transcript_entity_values": [
        "Twitter",
        "ASUS",
        "one",
        "Dell Alienware",
        "DisplayPort",
        "second",
        "Hertz",
        "G-Sync",
        "New York",
        "first",
        "4080",
        "13600k",
        "Jessica",
        "Gotham City",
        "Hertz",
        "One",
        "4070",
        "First",
        "zero",
        "Super Chex",
        "360",
        "Batman",
        "one hour",
        "Value Village",
        "850 watt",
        "Infinite Cables",
        "the LG Dual Up",
        "GPU",
        "Batman",
        "Robert Oakes",
        "SDR",
        "Dave",
        "NVIDIA",
        "up to 360",
        "the DT770 Pros",
        "Beyerdynamic",
        "today",
        "Computer",
        "Labs",
        "SATA",
        "Onie Tam",
        "Justin",
        "Alan Wake 2",
        "Tech Tips",
        "Onie",
        "Chinchilla",
        "15 years",
        "Robert",
        "Linus Tech Tips",
        "three",
        "GTX",
        "Green Screen Linus",
        "Alan Wake",
        "Nvidia",
        "Luke",
        "Dave the Diver",
        "27-inch",
        "USB",
        "Papa John's",
        "Ta-da",
        "Linus",
        "The Walking Hazard",
        "almost seven years old",
        "Costco",
        "only one",
        "Six years ago",
        "two",
        "WAN Show",
        "2017",
        "Jessica"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "GPE",
        "PRODUCT",
        "GPE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "TIME",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON"
    ],
    "vector": [
        -0.02897428721189499,
        -0.02477387525141239,
        0.05611151084303856,
        -0.02421657368540764,
        0.03070739097893238,
        0.016211092472076416,
        -0.01460493914783001,
        0.018630504608154297,
        -0.12491331249475479,
        0.0735064148902893,
        -0.036498021334409714,
        0.022279052063822746,
        0.024460308253765106,
        -0.038833413273096085,
        0.05972180888056755,
        0.04421522840857506,
        0.09040776640176773,
        -0.12629485130310059,
        -0.046769894659519196,
        -0.004074835684150457,
        -0.002065142849460244,
        -0.08354439586400986,
        -0.015122568234801292,
        -0.013894252479076385,
        0.015479205176234245,
        0.0687604546546936,
        0.02507972903549671,
        -0.026393866166472435,
        -0.044591743499040604,
        -0.0771806612610817,
        -0.005770666990429163,
        -0.016347220167517662,
        0.003548721317201853,
        0.034550633281469345,
        -0.0504104308784008,
        -0.09856526553630829,
        0.07234825938940048,
        -0.06586088240146637,
        -0.020122170448303223,
        -0.07963287830352783,
        -0.0539943166077137,
        -0.006641800981014967,
        -0.033257078379392624,
        0.033139314502477646,
        -0.02942657098174095,
        -0.06366319209337234,
        0.014878315851092339,
        -0.03103242814540863,
        0.020318636670708656,
        0.007142493035644293,
        0.0033439777325838804,
        -0.08102261275053024,
        0.03634694963693619,
        -0.07136067748069763,
        -0.0839170590043068,
        0.118834488093853,
        -0.03595554083585739,
        -0.08069203048944473,
        0.059349823743104935,
        -0.026607787236571312,
        0.058477696031332016,
        -0.08603117614984512,
        0.01575230248272419,
        0.06111584231257439,
        0.02771540731191635,
        -0.0306061003357172,
        0.04422619938850403,
        -0.024707471951842308,
        -0.0008149805944412947,
        0.05321395769715309,
        -0.014669925905764103,
        0.031041592359542847,
        -0.01885867491364479,
        0.02013118751347065,
        0.05221019685268402,
        0.016674190759658813,
        0.005388104822486639,
        -0.09999444335699081,
        0.05039478465914726,
        0.0682784914970398,
        0.0077217998914420605,
        0.006170682609081268,
        0.022569255903363228,
        0.027899455279111862,
        0.029533226042985916,
        -0.013089615851640701,
        0.0358392633497715,
        -0.016181327402591705,
        0.013782034628093243,
        -0.11915015429258347,
        0.0019452753476798534,
        0.0016085982788354158,
        0.11274365335702896,
        0.05475132539868355,
        0.06855091452598572,
        0.05006388947367668,
        0.037316709756851196,
        -0.07652578502893448,
        -0.045895420014858246,
        0.04825712367892265,
        -0.015937188640236855,
        -0.008251885883510113,
        0.1580713391304016,
        0.027242988348007202,
        -0.013006312772631645,
        0.0010593519546091557,
        -0.033597301691770554,
        0.0555143840610981,
        -0.10306603461503983,
        -0.05020717531442642,
        -0.044773250818252563,
        0.047902993857860565,
        -0.03626484423875809,
        0.05812586471438408,
        0.035859569907188416,
        -0.006296961568295956,
        -0.017285048961639404,
        -0.0012135744327679276,
        0.022724224254488945,
        0.023351265117526054,
        0.0322786308825016,
        -0.0008743306389078498,
        -0.04425133392214775,
        0.04598753899335861,
        0.013847016729414463,
        0.08970357477664948,
        -0.08299801498651505,
        1.1015102057494713e-32,
        -0.014030719175934792,
        0.12728382647037506,
        -0.021095579490065575,
        -0.053350623697042465,
        0.03824177384376526,
        0.06020092964172363,
        0.05529113486409187,
        0.02426360547542572,
        0.05360003933310509,
        0.0699227973818779,
        -0.06950594484806061,
        0.023081094026565552,
        -0.0317041277885437,
        0.005530718248337507,
        0.07734157890081406,
        -0.08157618343830109,
        -0.016935192048549652,
        0.05154183879494667,
        -0.041458453983068466,
        0.0322263278067112,
        0.05858936160802841,
        -0.009650683030486107,
        -0.014986793510615826,
        -0.08213144540786743,
        0.003027942031621933,
        -0.010604970157146454,
        -0.014800003729760647,
        -0.008502424694597721,
        0.04245282709598541,
        -0.01922411471605301,
        -0.04723270237445831,
        -0.08696136623620987,
        -0.030401816591620445,
        0.011735213920474052,
        -0.0016721590654924512,
        -0.0536937341094017,
        0.014343589544296265,
        -0.033560801297426224,
        -0.022835751995444298,
        -0.0026686866767704487,
        -0.0481477715075016,
        0.11202685534954071,
        -0.07758375257253647,
        -0.0388161726295948,
        0.022531777620315552,
        0.04914475604891777,
        0.0394907221198082,
        0.009476953186094761,
        -0.01491544395685196,
        0.007376872003078461,
        -0.0711599811911583,
        0.039097003638744354,
        -0.04110521823167801,
        0.026999272406101227,
        -0.0386652909219265,
        -0.029048562049865723,
        0.08785031735897064,
        -0.056500647217035294,
        0.06789898872375488,
        0.07499747723340988,
        0.05106273293495178,
        -0.08999422937631607,
        0.017500992864370346,
        -0.03826955333352089,
        -0.0010448520770296454,
        0.014848263002932072,
        0.06637131422758102,
        0.040915124118328094,
        -0.08589276671409607,
        0.012380748987197876,
        -0.015176152810454369,
        0.009449036791920662,
        0.03691130876541138,
        -0.009885992854833603,
        0.058955710381269455,
        0.02999529428780079,
        -0.08926703780889511,
        -0.016599128022789955,
        -0.061650194227695465,
        -0.08102934062480927,
        0.008190096355974674,
        0.021389920264482498,
        0.032413020730018616,
        0.05587923899292946,
        0.02227267436683178,
        -0.012185695581138134,
        -0.024427125230431557,
        0.04561439901590347,
        -0.03791973367333412,
        0.021536219865083694,
        -0.0680636316537857,
        -0.02941065840423107,
        0.016486428678035736,
        -7.891472341725603e-05,
        -0.022363713011145592,
        -9.226227407573663e-33,
        -0.041153982281684875,
        -0.08632726222276688,
        0.019316285848617554,
        0.08088383078575134,
        0.0630875676870346,
        0.001736144069582224,
        0.05531861633062363,
        -0.01419129129499197,
        0.06097728759050369,
        -0.028779085725545883,
        0.061911292374134064,
        0.08782176673412323,
        0.03836934268474579,
        0.004457692615687847,
        -0.025128625333309174,
        -0.05869559943675995,
        0.004290182609111071,
        -0.045491259545087814,
        0.08255893737077713,
        -0.06764175742864609,
        0.052518535405397415,
        0.052539221942424774,
        -0.02684979885816574,
        -0.02137894183397293,
        0.01257358118891716,
        0.014655771665275097,
        -0.03427137807011604,
        0.00856096763163805,
        0.005734204780310392,
        0.07908294349908829,
        0.05230415239930153,
        0.022677090018987656,
        0.05851193144917488,
        0.05244367942214012,
        0.0974745899438858,
        -0.018960297107696533,
        0.0784090980887413,
        -0.0073190368711948395,
        -0.027567051351070404,
        -0.04831654205918312,
        0.033643800765275955,
        0.03426064923405647,
        0.020834393799304962,
        0.01378041971474886,
        0.10658329725265503,
        0.03870934620499611,
        -0.04623527079820633,
        -0.13661815226078033,
        -0.02620615065097809,
        -0.012082311324775219,
        -0.04290729761123657,
        -0.06323835253715515,
        0.01671869121491909,
        -0.022437049075961113,
        -0.08759012073278427,
        -0.049607858061790466,
        -0.02721724845468998,
        0.003965707495808601,
        0.06706320494413376,
        -0.03474865481257439,
        0.05297897756099701,
        0.0721588134765625,
        -0.06949936598539352,
        -0.025462808087468147,
        0.06050615757703781,
        -0.061641208827495575,
        -0.01516212709248066,
        0.06290407478809357,
        0.021394938230514526,
        -0.007573253940790892,
        -0.1404534876346588,
        -0.0338851623237133,
        -0.053326159715652466,
        -0.043864257633686066,
        -0.023024803027510643,
        0.06343141943216324,
        0.05619579181075096,
        -0.01551182009279728,
        0.07533759623765945,
        -0.03182222694158554,
        -0.06317618489265442,
        -0.04089239239692688,
        0.0296486709266901,
        -0.028883906081318855,
        0.04936268553137779,
        -0.014436746947467327,
        0.06642372161149979,
        -0.022641833871603012,
        0.01556072011590004,
        -0.0695173591375351,
        -0.05863311141729355,
        -0.009447974152863026,
        -0.008749233558773994,
        0.050438497215509415,
        0.037280142307281494,
        -5.33378319289568e-08,
        0.008078831247985363,
        0.01123795472085476,
        -0.014049919322133064,
        0.09339585155248642,
        0.05431902036070824,
        -0.08881460130214691,
        -0.0675651952624321,
        -0.025913706049323082,
        0.07353623956441879,
        -0.07209736853837967,
        -0.004764796234667301,
        -0.06727217137813568,
        0.019231831654906273,
        0.05010004714131355,
        0.02094658464193344,
        -0.006010034587234259,
        -0.052429746836423874,
        0.12236425280570984,
        -0.024363938719034195,
        -0.046821773052215576,
        -0.025292521342635155,
        0.060001637786626816,
        0.09726253896951675,
        -0.028591884300112724,
        0.006634844932705164,
        -0.0014813975431025028,
        0.0513048879802227,
        0.00016381859313696623,
        0.09194736927747726,
        -0.010080227628350258,
        -0.09809380769729614,
        -0.015290828421711922,
        0.019663698971271515,
        -0.037400342524051666,
        0.026531171053647995,
        -0.04509224742650986,
        -0.005196800455451012,
        0.0969468355178833,
        0.09963361918926239,
        0.024125412106513977,
        -0.012244566343724728,
        -0.0642540380358696,
        -0.0864701196551323,
        -0.018910303711891174,
        0.046603716909885406,
        -0.04913217946887016,
        -0.00929724145680666,
        -0.07972635328769684,
        0.026551110669970512,
        -0.00527556287124753,
        -0.025887588039040565,
        0.06559827923774719,
        -0.042813416570425034,
        -0.016570132225751877,
        0.06712856143712997,
        -0.0318899005651474,
        -0.01820719614624977,
        0.06798993796110153,
        -0.020718889310956,
        0.029207883402705193,
        0.011242879554629326,
        -0.07669112086296082,
        -0.08067037165164948,
        0.046792853623628616
    ]
}