{
    "id": "bClieqLRTJA",
    "title": "Dual Screen Smartphone Teardown! - How does it work?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-12-18T19:46:52Z",
    "video_url": "https://www.youtube.com/watch?v=bClieqLRTJA",
    "category": "Howto & Style",
    "tags": [
        "Nubia X",
        "Nubia X Teardown",
        "Dual screen smartphone",
        "android",
        "ZTE Nubia x",
        "no notch",
        "notchless smartphone",
        "cool smartphone",
        "unique phones",
        "flagship",
        "best smartphone",
        "iphone",
        "iphone killer",
        "mobile phone",
        "tech",
        "nubia X review",
        "Nubia X Hands on",
        "repair",
        "how to",
        "dissassemble",
        "teardown"
    ],
    "views": 763446,
    "likes": 28787,
    "comments_count": 2639,
    "description": "How does a Dual Screen Smartphone work? With back to back screens its time to teardown the Nubia X and see what makes it tick. Does the front screen add much thickness? How hard is it to repair a dual screen smartphone? Are dual screen phones the way of the future? In this video we teardown and disassemble the new Nubia X to review it from the inside. The Nubia X has an LCD screen on the front, and an LED screen on the back.   Taking apart the Nubia X is pretty simple. Its the same basic, simple, efficient design as other glass backed smartphones.   Nubia X Durability test:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   Customize your Tesla Here:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/IRwx4DMUx8s",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://ts.la/zack10701",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The incredibly unique, dual screen Nubia X is ready for my teardown. With a fully functional display on both sides of the phone, it will be interesting to see how this is put together from the inside, and how it differs from, you know, a normal single screen phone. Let's get started. [Intro] I'm usually one of the first people opening up brand new phones to explore the insides, and a phone with back to back screens is definitely in uncharted territory. I'm going in blind. I'm going to assume that the back is what comes off first. One wrong move though, and the whole phone might get destroyed. Heat and large suction cups are my best friends when opening up glued shut glass sandwiches. The heat softens the adhesive and allows my razor blade to slip in and slice through the black sticky stuff holding the phone halves together. If my metal pry tool or razor blade gets too deep though, I might end up damaging some of the sensitive ribbons, the battery, or the rear screen this time around. And since I have no idea what I'm in for, I'm going pretty slow and being super careful. After a little gap is created, I can tell that the screen ribbon cable is up along the top, and I can fold the back glass away from the phone without putting any stress on the fragile ribbons they can tear like paper. Now normally it's a bad idea to wake the patient up halfway through an operation, but it might be pretty cool, so let's try it. [Buzz] Still don't believe that man's ever been to medical school. [Zack] Even with the rear glass panel and back screen completely removed from the phone, everything is still working. Thumbs up for that. The AMOLED display has it's one wire connection reaching back towards the motherboard. With everything being so incredibly thin, the screen doesn't really add any bulk to the phone itself. We'll put the patient back to sleep again and see what else is inside the phone. Normally, I try to disconnect the battery first so there's no power running through the device, but everything is still hidden under this large black sticker, and also screwed in and held down under the top metal plate, so I'll risk it. Unscrewing the little silver latch over the rear AMOLED connector, and pop it off with my plastic pry tool just like a little Lego. A clear phone definitely won't be possible this time around. Trying to remove a display panel that's glued to glass is like brain surgery on a potato chip something is going to crack. So I'll be leaving it alone this time around. The top metal plate has eight screws holding it in place. I'll remove those, setting them off to the side in an organized fashion. There's one little ribbon cable for the rear sensors attached to the motherboard. I'll unplug the battery though first with my plastic pry tool, and then proceed to the small sensor ribbon. I'll remove the dual SIM card tray, and then make my way to the row of ribbons down at the bottom. The right fingerprint scanner ribbon, the charging port ribbon, the front LCD screen ribbon, and the left fingerprint scanner ribbon. Down here at the bottom of the phone it has it's own 7 screws. The plastic loudspeaker can't quite pull away on it's own yet though. It has one of those black wire cables built in going all the way up to the top of the motherboard. The large, silver internal battery has no magic pull tabs. It's one of those permanent pry it out and hope it doesn't explode style batteries. But the adhesive isn't too bad this time around. It's a pretty big 3800 milliamp hour battery. The charging port has one gold ribbon connector, a single black wire cable, and one tiny silver screw holding it in place. After that the whole thing can lift up and pull away from the phone along with this large coin style vibration motor that's soldered onto the board. It's got a little circular white water damage indicator. This phone is not water resistant. And of course, we have the USB-C port down here as well. Making our way back up to the top, we can see the ribbon path from both fingerprint scanners that plug into each side of the motherboard. The motherboard itself has one screw holding it in place by the little square earpiece speaker. And then the whole thing can pull away from the phone body, revealing it's bubblegum-like thermal paste that uses the aluminum frame of the phone as a giant heat sink. The rear camera connectors are hidden under this metallic tape. The Nubia X has 16 megapixel and 24 megapixel cameras. No wide angle or telephoto lenses just that portrait mode stuff. Neither of the lenses have optical image stabilization. These dual cameras also double as the front facing selfie cameras when the rear screen is activated. Pretty unique. The front LCD screen is glued into the metal housing. You can see the ribbon cable coming up through a hole in the frame. Any attempt to remove the front glass screen from the metal frame will probably result in it shattering, so I would only attempt a screen replacement when it's already too broken to be useful anymore. The rear screen replacement's a piece of cake compared to the front screen, as long as you can replace the whole back glass panel at the same time. The motherboard is back in place with it's one screw, along with the charging port board, and it's coin-style vibrator. It's pretty ingenious to have screens on both sides of the phone. Definitely solves the notch issue and allows for better looking, larger, edge to edge front displays. It's always refreshing to see something unique and innovative in the smartphone world when most of the big smartphone companies are playing it pretty safe. The battery is back in place and all the ribbon cables are plugged in, including the battery ribbon which clips on last. The top metal plate with it's little ribbon is back in place, and the 15 screws for both the top and the bottom boards are all screwed back in as well. Here's the moment of truth as we take the rear back glass panel with it's AMOLED display and plug it back into the motherboard. It's got a silver metal bracket to keep the connector from coming loose. Definitely an impressive design. The simplicity of adding a rear display to the phone changes basically nothing from a normal glass backed phone like a Samsung or OnePlus. Just one rear ribbon to watch out for like we would have anyway with a rear mounted fingerprint scanner. I'm impressed with how simple it is and surprised we haven't seen it before now. I'm even more surprised though when I fold the glass screen back over, hit the power button, and the whole thing still turns on. It's alive and functioning just fine. Do you think dual sided smartphones are the way of the future, or is this more of a gimmick that will fade away with time? Let me know down in the comments. Come hang out with me on Instagram and Twitter. Subscribe to PewDiePie. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "phone",
        "back",
        "screen",
        "ribbon",
        "rear",
        "rear screen",
        "glass",
        "screen ribbon",
        "front LCD screen",
        "back glass",
        "LCD screen ribbon",
        "glass screen back",
        "ribbon cable",
        "top",
        "battery",
        "screen ribbon cable",
        "motherboard",
        "metal",
        "back glass panel",
        "glass screen"
    ],
    "transcript_entity_values": [
        "OnePlus",
        "15",
        "Lego",
        "Instagram",
        "PewDiePie",
        "3800 milliamp hour",
        "Nubia X",
        "24 megapixel",
        "first",
        "LCD",
        "Samsung",
        "The Nubia X",
        "One",
        "16 megapixel",
        "eight",
        "AMOLED",
        "one",
        "7",
        "Twitter"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "FAC",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "ORG",
        "FAC",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.12696334719657898,
        0.05062952637672424,
        0.08543751388788223,
        -0.08147600293159485,
        0.005032986402511597,
        -0.09235389530658722,
        0.010981853120028973,
        0.08165139704942703,
        -0.04088298976421356,
        0.017513612285256386,
        0.0015815980732440948,
        -0.0020756367594003677,
        0.026580441743135452,
        0.005705133080482483,
        -0.012989873066544533,
        -0.021022899076342583,
        0.03770243376493454,
        -0.0525311715900898,
        -0.05013230815529823,
        0.05057613179087639,
        0.018682563677430153,
        -0.03773874416947365,
        -0.009297522716224194,
        -0.07693801820278168,
        0.021313872188329697,
        0.004396427888423204,
        -0.0022343010641634464,
        -0.007594456430524588,
        -0.03329470753669739,
        -0.11236841976642609,
        0.023427775129675865,
        0.059437431395053864,
        -0.04744405671954155,
        0.04590056091547012,
        -0.030773330479860306,
        -0.06115029379725456,
        0.015280869789421558,
        0.0021304271649569273,
        -0.11409873515367508,
        -0.06477000564336777,
        -0.03772638365626335,
        -0.035920605063438416,
        -0.009973745793104172,
        0.03637990728020668,
        0.02424669824540615,
        0.0018398803658783436,
        0.08961199223995209,
        0.0016674521612003446,
        0.0416204072535038,
        -0.057035092264413834,
        -0.029535042122006416,
        -0.016744915395975113,
        0.002602942753583193,
        0.04121050983667374,
        -0.043087586760520935,
        0.0625912994146347,
        -0.013721448369324207,
        -0.03367823362350464,
        0.01938895508646965,
        0.03733314573764801,
        0.13234911859035492,
        0.062154196202754974,
        -0.020766232162714005,
        0.09728926420211792,
        0.05802595987915993,
        -0.03963431715965271,
        0.02601887285709381,
        -0.1333881914615631,
        -0.006463192403316498,
        -0.03021613508462906,
        -0.006384642794728279,
        -0.0545329712331295,
        0.006998071447014809,
        -0.1084805428981781,
        -0.028976764529943466,
        -0.005571981891989708,
        0.06013095751404762,
        -0.02619318664073944,
        -0.07825960963964462,
        0.03134991601109505,
        0.027704313397407532,
        0.056070346385240555,
        -0.004914276767522097,
        0.03407836705446243,
        0.04533485695719719,
        -0.03261445835232735,
        -0.024994269013404846,
        0.07318273931741714,
        -0.05630780756473541,
        -0.012990237213671207,
        0.021576864644885063,
        0.06355369091033936,
        -0.06355226784944534,
        -0.0007948883576318622,
        0.013825305737555027,
        -0.06535234302282333,
        -0.08901070058345795,
        -0.03938134387135506,
        -0.01463237777352333,
        0.053612127900123596,
        0.032234031707048416,
        -0.01489004772156477,
        0.08414578437805176,
        0.005605757236480713,
        -0.01692935824394226,
        -0.07001667469739914,
        -0.010411285795271397,
        -0.012419253587722778,
        -0.03956320136785507,
        0.08355922251939774,
        -0.024841954931616783,
        0.03092537261545658,
        -0.02542535774409771,
        0.0377981923520565,
        0.004190634470432997,
        0.010582190938293934,
        0.018915144726634026,
        0.042198821902275085,
        0.08896517008543015,
        -0.01248879823833704,
        -0.010535722598433495,
        -0.022557729855179787,
        -0.04219299554824829,
        -0.03348691388964653,
        0.10742434859275818,
        0.012847120873630047,
        -0.0699092447757721,
        2.622629283072282e-33,
        0.057255011051893234,
        0.10851989686489105,
        -0.05578439310193062,
        0.013375842012465,
        -0.07183708250522614,
        0.06733829528093338,
        0.01930931583046913,
        0.03948555141687393,
        -0.009280807338654995,
        0.051556169986724854,
        0.0646897703409195,
        0.037298884242773056,
        -0.013166144490242004,
        0.01978157088160515,
        0.057486847043037415,
        -0.04098421335220337,
        -0.023647397756576538,
        0.025291843339800835,
        -0.07563301920890808,
        0.017113206908106804,
        -0.06211865693330765,
        -0.0176965594291687,
        -0.007085363380610943,
        0.05727042630314827,
        0.06716597825288773,
        0.08675642311573029,
        0.05274125933647156,
        0.012322175316512585,
        -0.03337074816226959,
        0.03485431894659996,
        -0.07548660784959793,
        -0.03315969556570053,
        0.03227803483605385,
        0.011049404740333557,
        -0.062013108283281326,
        0.0020680525340139866,
        -0.058601994067430496,
        -0.05921347439289093,
        0.03249958157539368,
        0.023392029106616974,
        -0.1593897044658661,
        0.11149899661540985,
        0.055000897496938705,
        -0.029104795306921005,
        -0.002894140314310789,
        -0.0289546400308609,
        -0.03806614130735397,
        0.042461805045604706,
        4.291399091016501e-05,
        -0.08057839423418045,
        0.02100410871207714,
        -0.12852826714515686,
        -0.002918792888522148,
        -0.08727119863033295,
        -0.0632927268743515,
        0.029892774298787117,
        0.007585391867905855,
        -0.029870813712477684,
        0.018301403149962425,
        0.023381788283586502,
        0.06297977268695831,
        -0.040853459388017654,
        -0.09426485002040863,
        0.0819791704416275,
        -0.043460410088300705,
        0.0531027615070343,
        0.03941986709833145,
        0.046886932104825974,
        -0.04351825267076492,
        0.04826781526207924,
        -0.06343134492635727,
        0.0008071327465586364,
        0.03663155063986778,
        -0.036359142512083054,
        0.05423232913017273,
        -0.001068483223207295,
        0.044859204441308975,
        -0.0223745908588171,
        0.07088939100503922,
        0.0035312322434037924,
        -0.0417075976729393,
        0.04885406792163849,
        0.09521763771772385,
        -0.05679229274392128,
        -0.025909656658768654,
        -0.03216364234685898,
        -0.020781323313713074,
        -0.09843836724758148,
        0.014098003506660461,
        0.008792269043624401,
        -0.010305427946150303,
        -0.06170528754591942,
        -0.05706585943698883,
        -0.0864572525024414,
        -0.03840053454041481,
        -3.257010156090469e-33,
        -0.048424284905195236,
        -0.03454592451453209,
        -0.044473860412836075,
        0.00013625774590764195,
        0.05953710526227951,
        -0.07826719433069229,
        0.03497987240552902,
        0.07662470638751984,
        0.0012704767286777496,
        -0.05009965971112251,
        0.026847554370760918,
        0.05455292388796806,
        -0.0351274274289608,
        -0.015757611021399498,
        -0.027731359004974365,
        -0.0435078926384449,
        0.065073162317276,
        -0.09149855375289917,
        -0.09073487669229507,
        -0.027209291234612465,
        0.06734317541122437,
        0.054070815443992615,
        0.05682985484600067,
        -0.004780460149049759,
        0.025633305311203003,
        -0.03045283444225788,
        -0.005401455797255039,
        -0.020133979618549347,
        0.08644445985555649,
        0.006851882673799992,
        -0.02877204306423664,
        -0.07764115184545517,
        0.004364718217402697,
        0.07333256304264069,
        0.053074758499860764,
        0.06088939681649208,
        -0.0015488084172829986,
        -0.01391802541911602,
        0.024505408480763435,
        -0.09732025861740112,
        0.017368104308843613,
        0.11018843948841095,
        0.0005951249040663242,
        -0.058882199227809906,
        -6.591802230104804e-05,
        -0.007265813183039427,
        -0.007923548109829426,
        0.009154241532087326,
        -0.014350214041769505,
        -0.018261488527059555,
        0.04687654227018356,
        0.029858184978365898,
        0.010078121908009052,
        0.05501681566238403,
        -0.024644827470183372,
        -0.02092950977385044,
        0.026971112936735153,
        -0.027270518243312836,
        -0.03283486142754555,
        -0.017581474035978317,
        0.08428025245666504,
        0.019026940688490868,
        -0.03790126368403435,
        -0.08259383589029312,
        -0.04266449436545372,
        -0.04338327422738075,
        0.025716423988342285,
        0.004611962474882603,
        -0.054177626967430115,
        0.05331576615571976,
        -0.002224493306130171,
        -0.020503034815192223,
        0.022690726444125175,
        -0.09146963804960251,
        -0.0044527556747198105,
        0.07135683298110962,
        -0.06158639118075371,
        -0.04706500470638275,
        -0.003569799941033125,
        -0.001587333157658577,
        0.034925106912851334,
        -0.05755310505628586,
        0.06115037947893143,
        0.03801368176937103,
        0.12295489013195038,
        0.003779798513278365,
        0.04646758735179901,
        0.0969608798623085,
        -0.014718279242515564,
        0.014112312346696854,
        -0.08830749988555908,
        0.01821228489279747,
        -0.021240364760160446,
        0.035603996366262436,
        -0.02738441713154316,
        -4.977173162501458e-08,
        0.0616116002202034,
        -0.014930550940334797,
        -0.02540108561515808,
        -0.01892162673175335,
        -0.07320884615182877,
        -0.04808315262198448,
        0.02415809966623783,
        -0.0411614328622818,
        0.07113493978977203,
        -0.07084499299526215,
        -0.0435558557510376,
        -0.021054107695817947,
        0.0006965938955545425,
        0.03567754104733467,
        -0.005954289808869362,
        0.1067730113863945,
        0.02236332558095455,
        0.04709409549832344,
        0.0037802699953317642,
        -0.0036404835991561413,
        -0.04197690635919571,
        0.0021650150883942842,
        0.046046167612075806,
        -0.0016559479990974069,
        -0.011664400808513165,
        0.10496753454208374,
        -0.1049569696187973,
        -0.027152031660079956,
        0.056517668068408966,
        -0.029273001477122307,
        -0.0009380317060276866,
        -0.02631509117782116,
        0.05416172742843628,
        0.04182054474949837,
        -0.033799365162849426,
        -0.031107446178793907,
        -0.01558227464556694,
        0.007183501496911049,
        0.10978733748197556,
        0.043897878378629684,
        0.018218092620372772,
        -0.05138477683067322,
        0.016942042857408524,
        0.08424350619316101,
        0.01809265837073326,
        -0.05694824084639549,
        0.06259322166442871,
        -0.12220919132232666,
        -0.1246645525097847,
        -0.013966625556349754,
        0.011212393641471863,
        -0.008266419172286987,
        -0.042976077646017075,
        -0.03823607414960861,
        0.06692133843898773,
        -0.00782825704663992,
        0.1136082112789154,
        -0.020424500107765198,
        0.031170492991805077,
        0.03409754857420921,
        0.02510170266032219,
        -0.017570726573467255,
        0.01873919554054737,
        0.08157394826412201
    ]
}