{
    "id": "BCyrTQP5wr0",
    "title": "We are not friends. - ROG Ally Z1",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-11-17T21:35:36Z",
    "video_url": "https://www.youtube.com/watch?v=BCyrTQP5wr0",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "ASUS",
        "Z1",
        "ROG",
        "ALLY",
        "ROG Ally Z1",
        "Z1 Extreme",
        "Steam deck",
        "alternative",
        "handheld PC",
        "windows",
        "gaming",
        "video games"
    ],
    "views": 791072,
    "likes": 18693,
    "comments_count": 1297,
    "description": "Check out Antlions Kimura IEMs at  and change the way you play.  The ROG Ally Z1 Extreme has a ton of hype around it and is the handheld PC that Linus has been daily driving, but ASUS recently released a cheaper non-extreme model that's... a much harder sell. Will the performance drop be worth $100 or is this an easy pass?  Buy an ASUS ROG Ally Z1:  Buy an ASUS ROG Ally Z1 Extreme:  Buy an ASUS ROG XH Mobile eGPU RTX 4090 Dock:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Reviews have been harsh 0:20 Unboxing and buttons/ports 1:29 Difference between the Z1 and Z1 Extreme 3:05 Sponsor - Antlion Audio 3:34 LABS gaming and battery tests 5:14 LABS display and thermal test results  6:21 Command center and external GPU 6:53 Pricing woes and overall thoughts 7:43 Outro",
    "description_links": [
        "https://lmg.gg/KMRA",
        "https://lmg.gg/ZxuU3",
        "https://lmg.gg/YbDJc",
        "https://lmg.gg/542Tw",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "The ROG Ally Z1 has been criticized for being underpowered, overpriced, and do you really need a third thing? I mean, that's kind of enough reason to not like it. But I disagree. Well, I don't disagree that it's overpriced. And I don't disagree that it's underpowered. But I think there could be a justification for its existence. Let's start by taking a look at what comes included though. Power adapter, fixed cable, because why would you ever wanna replace it with a longer or shorter one? If this cable's good enough for ASUS, it's good enough for you. We're developing a bit of a tone in this video, okay? Warranty information form, that'll come in handy. Who would fill this out? Moving on to the device then, there's a lot to like here. We've got a power button with a fingerprint sensor, volume rocker, XG mobile interface, allowing you to hook up an external graphics card to the Ally, micro SD slot, talk about that later. Headset jack, vents for the shockingly quiet cooling system. Then flipping around to the face, we have, again, surprisingly good stereo speakers, an Xbox-like layout with full-sized joysticks, a serviceable D-pad and ABXY buttons. Then the, whatever this button, ROG button, I don't know, whatever. It brings up their command center, allowing you to adjust quick settings like the power profile the device is running in, the operating mode of the joysticks, Radeon Super Resolution toggle. Ooh, even toggles for the display resolution and refresh rate. You see, natively, it runs at 1920 by 1080 at up to 120 Hertz, but these toggles can be useful so that games don't get confused and try to run at anything higher than 720, 60 Hertz. And the reason I say that games would have to be confused to do that is because this, for those of you who have not been paying close attention, is the ROG Ally Z1, not the ROG Ally Z1 Extreme, which means it has everything that's good about the Ally that I reviewed about six months ago and have been using very actively ever since, except the high-powered processor. We get cut from eight CPU cores down to six, and the onboard graphics processor goes from 12 CUs down to just four. By the way, I realized I didn't finish going through the buttons. More Xbox buttons, and then this will return to the desktop. I believe this one's programmable, though, so your mileage may vary on that one. Now, I thought that maybe other reviewers overlooked a potential outstanding use case for this version of the Ally, because one of the things that I don't like about my Z1 Extreme Ally is the extremely short battery life. Most of the gaming that I've done on that device has been playing Sea of Stars and playing Chained Echoes, both of which are pretty light games, and not being able to get more than a few hours away from the wall has been kind of a downer. So I thought, okay, why don't we give this thing to the labs and see if there's a way for us to push way better battery life out of this thanks to its same size battery unit, but much less powerful hardware. And unfortunately, I ended up sorely disappointed. I'll explain what I mean after this message from our sponsor, Antlion Audio. You probably know them from their versatile ModMic, which is a great mic to add to any headphones or VR headsets. Well, now, with their Camira line, you can bring that same level of adaptability to in-ear monitors. They work with almost any standard 2-pin or MMCX IEM, or you can grab their Duo package, which comes with a pair of resin monitors. The simple design means no big mic in your face or headband messing up your beautiful hair. So don't wait, check out Antlion Audio at their website or at the link down below. Let's look at these performance numbers. As expected, at 15 or 30 watts, it lags behind significantly, though I was surprised to find that at 10 watts, hey, the Z1, actually not that far behind, which seems to suggest that the Z1 Extreme, for all its extra CUs, has to throttle the clock speed down even further in order to achieve the same kind of power envelope. Looking good so far. Where things fall apart is when we do our battery life endurance test playing back YouTube videos. And you can see that even with all that extra horsepower on board with the Z1 Extreme, it ends up lasting for the same amount of time. Now that's not the case in our CPU or GPU stress tests, where we managed over 20 additional minutes of battery life on the Z1 versus the Z1 Extreme, which seems to suggest that my idea of this being a way more power efficient handheld for people who just wanna play light games on the go is not entirely wrong, but where it falls apart is in the raw numbers, guys. 20 to 25 more minutes away from the wall when fully loaded, that being an absolute best case scenario, this thing would need to offer me double the battery life to justify the fact that it performs so much worse when it's running in high power mode and only costs $100 less than the full fat Z1 Extreme. And that ignores the fact that by the time ASUS actually managed to get this thing out into the wild, it turned out that Valve had a refreshed Steam Deck that was going to make it look absolutely pointless. I mean, at least the screen is good. It manages to hit the claimed 500 nits peak brightness. It's quite accurate, especially compared to the original Steam Deck, and especially being able to run at high refresh rate means that in games that support it, you can get a much smoother gaming experience. It's just that the new Steam Deck, the OLED one, makes all of those numbers look kind of like child's play, except the refresh rate. It's only 90 versus 120, but 90 Hertz on an OLED, yeah, I would take that over 120. We'll have a full video on the new Steam Deck OLED over on the LTT channel. Valve also isn't dealing with a micro SD card controversy. Cards have been dying in the original ROG Ally, and again, we were hoping that the Z1 version would run much cooler and therefore not have the same issues, but as it turns out, nope. The Z1 really is just a crappier binned chip, and it does suck back power, and it does get hot. So any issues that they would have on the Z1 Extreme version are probably going to be replicated here. Now, Asus says that they do have a BIOS fix coming for this, but I don't think that has materialized yet. Credit where it's due to Asus. Their Command Center thing has been shockingly not buggy. Like, Ioneo's one used to be really good back in the day, and now, last time I used it, it was a piece of garbage. This is what that's supposed to be. Oh, let's turn it up to 120 Hertz. Like, look at that, seamless, not bad. Those six cores turbo pretty good. If you only play very light games on the go, and you want to hook up your eGPU whenever you're docked, except if you can afford one of Asus' XG Mobile eGPUs, then you can afford the extra 100 bucks. I mean, it needed to be like $250 less expensive, but I also understand why it isn't. I get it, everyone complaining, yeah, it needs to be $250. But you gotta understand, guys, this is exactly the same tooling. This is exactly the same hardware, other than just that chip change. So unless AMD is charging $200 plus less for that chip, it's not happening. You know what? This is not nearly as bad as I thought it was gonna be. You know, if it wasn't for Steam Deck OLED being so good for the price, maybe I've talked myself back into it. I could see people buying this one. Yeah, you're only saving $100 or whatever, but you're saving $100. Yeah, it was kind of silly of them to use the exact same hardware other than the processor, because that makes the cost so high. But the flip side of that is they're using the exact same hardware. It's really good hardware. It feels great. It's a great gaming experience, other than it's a little slower, a lot slower. Overall, there's a lot to like, but the truth is I'm only making a video about this right now because it's still in my queue and I need to get it done before I move on to more interesting ones like the Lenovo Legion Go. Subscribe to ShortCircuit.",
    "transcript_keywords": [
        "ROG Ally",
        "Steam Deck OLED",
        "Steam Deck",
        "Ally",
        "good",
        "Extreme",
        "original ROG Ally",
        "ROG",
        "battery life",
        "Deck OLED",
        "Extreme Ally",
        "Steam",
        "Deck",
        "Power",
        "games",
        "battery",
        "Hertz",
        "OLED",
        "thing",
        "original Steam Deck"
    ],
    "transcript_entity_values": [
        "Radeon Super Resolution",
        "the day",
        "Chained Echoes",
        "15",
        "Asus",
        "1920",
        "Hertz",
        "only 90",
        "Ioneo",
        "250",
        "the Lenovo Legion Go",
        "Valve",
        "60",
        "10 watts",
        "90",
        "micro SD",
        "just four",
        "720",
        "Antlion Audio",
        "ModMic",
        "YouTube",
        "LTT",
        "Ally",
        "ROG",
        "the Z1 Extreme",
        "third",
        "100",
        "100 bucks",
        "AMD",
        "ASUS",
        "20 to 25",
        "Asus",
        "120",
        "1080",
        "200",
        "GPU",
        "500",
        "a few hours",
        "Z1",
        "Camira",
        "XG",
        "Steam Deck",
        "12",
        "ROG Ally",
        "ShortCircuit",
        "Xbox",
        "about six months ago",
        "CPU",
        "six",
        "2",
        "SD",
        "ASUS",
        "eight",
        "20 additional minutes"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME"
    ],
    "vector": [
        -0.05549287796020508,
        -0.009732704609632492,
        -0.012654561549425125,
        0.021809721365571022,
        0.07485265284776688,
        0.0063545722514390945,
        -0.01703248918056488,
        0.11674993485212326,
        -0.07779242098331451,
        -0.018674015998840332,
        0.007637291681021452,
        0.0702039822936058,
        0.02675352804362774,
        -0.04272130876779556,
        0.04237747564911842,
        -0.017537526786327362,
        0.11960703879594803,
        -0.10000219941139221,
        -0.07132615894079208,
        0.0016534990863874555,
        -0.0140995467081666,
        -0.10303150117397308,
        -0.006827534642070532,
        -0.020621350035071373,
        0.03357267379760742,
        -0.07259812951087952,
        0.013587060384452343,
        -0.01927669160068035,
        0.06685831397771835,
        -0.09312417358160019,
        0.002243482042104006,
        0.06205901876091957,
        0.04026646167039871,
        -0.008751779794692993,
        -0.029271762818098068,
        -0.05367371812462807,
        0.04634244740009308,
        -0.06844080984592438,
        -0.08961223810911179,
        -0.06646498292684555,
        0.018818670883774757,
        -0.04747386649250984,
        -0.039642415940761566,
        0.02366894669830799,
        -0.04026242345571518,
        -0.04831485077738762,
        0.0055483486503362656,
        -0.017419755458831787,
        0.007771674077957869,
        0.03535505011677742,
        0.017796918749809265,
        -0.050713203847408295,
        -0.024269837886095047,
        -0.03982056304812431,
        -0.13292929530143738,
        0.0616249144077301,
        -0.09030575305223465,
        -0.050501249730587006,
        0.028177710250020027,
        -0.03382362052798271,
        0.05790754035115242,
        -0.07689283788204193,
        -0.04342259094119072,
        0.06863857805728912,
        0.007576887961477041,
        -0.04342389851808548,
        -0.010980227962136269,
        0.02516079880297184,
        -0.053077053278684616,
        0.025809170678257942,
        0.022395413368940353,
        -0.02571948617696762,
        0.010511434637010098,
        0.05835849419236183,
        -0.004740957636386156,
        0.05337599664926529,
        0.11238948255777359,
        -0.07631340622901917,
        -0.013225818984210491,
        0.0319354347884655,
        0.04450896382331848,
        -0.05066773667931557,
        -0.03557349368929863,
        -0.0589572936296463,
        0.041491348296403885,
        -0.03908906504511833,
        0.02723647467792034,
        -0.005933941341936588,
        0.02532752975821495,
        -0.075433149933815,
        0.04446488246321678,
        0.08083043247461319,
        0.09828755259513855,
        0.008533722721040249,
        0.0030324722174555063,
        0.0320691242814064,
        0.0006004968308843672,
        -0.049548856914043427,
        -0.0908086746931076,
        0.0787256732583046,
        0.0013491979334503412,
        0.1243864893913269,
        0.08635803312063217,
        -0.03983590379357338,
        -0.05941468104720116,
        -0.060064297169446945,
        -0.000731138396076858,
        0.03578775376081467,
        0.0035023840609937906,
        0.024285294115543365,
        -0.1131497398018837,
        0.03721598908305168,
        -0.04409351572394371,
        -0.05502983555197716,
        -0.02348961867392063,
        -0.007727095391601324,
        -0.07548690587282181,
        0.0004062620864715427,
        0.044304896146059036,
        -0.044751208275556564,
        -0.019539278000593185,
        -0.025059903040528297,
        -0.013199553824961185,
        0.03866865485906601,
        0.04627058282494545,
        0.041851580142974854,
        -0.070834681391716,
        5.766584433262494e-33,
        -0.08736816048622131,
        0.09766945987939835,
        -0.09168967604637146,
        -0.11465125530958176,
        -0.0050768195651471615,
        0.024219714105129242,
        0.02228914573788643,
        0.016668858006596565,
        -0.04670107364654541,
        0.03246159851551056,
        -0.08413788676261902,
        0.06793838739395142,
        -0.018599558621644974,
        0.041540443897247314,
        0.07651956379413605,
        -0.09721437841653824,
        -0.004153482150286436,
        0.04707292094826698,
        -0.016736960038542747,
        -0.006291596218943596,
        -0.0065276045352220535,
        -0.0016328850761055946,
        0.0126884113997221,
        -0.06748761236667633,
        0.0677933543920517,
        -0.0549497976899147,
        0.008168467320501804,
        -0.006642607040703297,
        0.05933798849582672,
        0.007476900238543749,
        -0.016029631718993187,
        -0.05329681187868118,
        -0.06719272583723068,
        -0.01851189136505127,
        -0.06309923529624939,
        0.0420672744512558,
        -0.11426568776369095,
        -0.11569809913635254,
        0.041906945407390594,
        -0.03204907104372978,
        -0.05177568271756172,
        0.05861593782901764,
        -0.08254275470972061,
        -0.059586051851511,
        -0.039606787264347076,
        0.010991561226546764,
        0.056502897292375565,
        -0.018895110115408897,
        0.0026495279744267464,
        -0.052351001650094986,
        -0.04349237307906151,
        0.022325728088617325,
        -0.1477324217557907,
        0.035308837890625,
        -0.00030956658883951604,
        -0.03451395034790039,
        0.025804121047258377,
        -0.004194407723844051,
        0.08993139863014221,
        0.017985690385103226,
        0.02684016339480877,
        -0.016525866463780403,
        0.015515356324613094,
        0.008811874315142632,
        -0.04592671990394592,
        0.08226754516363144,
        0.04652056470513344,
        -0.033647630363702774,
        -0.057289596647024155,
        -0.02814338728785515,
        -0.024077100679278374,
        -0.030750611796975136,
        0.03142606094479561,
        -0.03607539087533951,
        0.05845512077212334,
        0.022593794390559196,
        -0.029741846024990082,
        -0.04521879181265831,
        0.060207683593034744,
        -0.012972064316272736,
        -0.09958840906620026,
        0.04619128629565239,
        0.01922461949288845,
        0.08936293423175812,
        0.07722317427396774,
        -0.015249998308718204,
        0.030360423028469086,
        -0.013241705484688282,
        -0.044917892664670944,
        0.0601736344397068,
        -0.008169532753527164,
        -0.02299908548593521,
        -0.07474806159734726,
        0.03716801851987839,
        0.001827540691010654,
        -5.4491521020565204e-33,
        -0.08813869208097458,
        0.005667918361723423,
        0.016189822927117348,
        0.07570964843034744,
        0.05263383314013481,
        0.007935525849461555,
        0.06977938860654831,
        -0.0009133208077400923,
        -0.006206605117768049,
        -0.0116293765604496,
        0.03733137622475624,
        0.07393095642328262,
        -0.006695960182696581,
        -0.02123383805155754,
        0.04171283543109894,
        -0.09209618717432022,
        0.07503191381692886,
        -0.069593146443367,
        0.11046818643808365,
        -0.03040914423763752,
        0.08101916313171387,
        0.06776402145624161,
        0.013721401803195477,
        0.05982467532157898,
        0.005510680377483368,
        0.01723586954176426,
        0.0714607983827591,
        -0.02262878604233265,
        -0.04783342406153679,
        0.025683699175715446,
        0.0004034716112073511,
        0.03842511400580406,
        -0.025985121726989746,
        -0.018315831199288368,
        0.040454741567373276,
        0.05088789761066437,
        0.0006851993384771049,
        0.06996113061904907,
        -0.050663869827985764,
        -0.026786182075738907,
        0.0502534918487072,
        0.01809644140303135,
        0.016083640977740288,
        0.007204221095889807,
        0.06422460079193115,
        -0.045410022139549255,
        -0.004681389778852463,
        -0.07771569490432739,
        0.04267982393503189,
        0.008075754158198833,
        0.010732247494161129,
        -0.015415501780807972,
        0.067088782787323,
        -0.003185478039085865,
        -0.012422546744346619,
        -0.04175817593932152,
        -0.0057696751318871975,
        -0.024516679346561432,
        -0.023277977481484413,
        -0.02515863999724388,
        0.08095446228981018,
        0.03424043208360672,
        -0.03287018463015556,
        -0.04057985171675682,
        0.02013426646590233,
        -0.04049146547913551,
        0.07212656736373901,
        0.016915732994675636,
        -0.040663912892341614,
        0.027771010994911194,
        -0.007797098718583584,
        0.029927311465144157,
        -0.033214107155799866,
        -0.058850258588790894,
        -0.05173015967011452,
        0.07231007516384125,
        0.021812960505485535,
        0.0035189595073461533,
        0.04410494863986969,
        -0.06791723519563675,
        -0.05274577438831329,
        0.019728461280465126,
        0.06328891217708588,
        0.014458179473876953,
        0.03212101757526398,
        -0.0139586441218853,
        -0.026622509583830833,
        -0.023541485890746117,
        0.03715306147933006,
        0.01795659214258194,
        -0.05422597751021385,
        0.02081969380378723,
        0.014527481980621815,
        0.042795199900865555,
        -0.0010930291609838605,
        -5.829828708669993e-08,
        -0.01144254207611084,
        -0.0004948614514432847,
        0.08461073786020279,
        0.03952522948384285,
        -0.007536931894719601,
        -0.037825725972652435,
        -0.039637837558984756,
        -0.054779235273599625,
        -0.006950803101062775,
        0.009100758470594883,
        0.04260214790701866,
        -0.0878106951713562,
        -0.01680375449359417,
        0.03723279386758804,
        -0.009322348982095718,
        0.050279486924409866,
        -0.037620797753334045,
        0.06575372815132141,
        -0.011846590787172318,
        -0.01690291240811348,
        0.025635607540607452,
        0.06892553716897964,
        0.055270709097385406,
        -0.00864132959395647,
        0.06379792839288712,
        0.03613923117518425,
        0.028385929763317108,
        0.06277067214250565,
        0.1066456064581871,
        -0.062090225517749786,
        -0.02573884278535843,
        -0.012103688903152943,
        0.05376572906970978,
        0.059023790061473846,
        0.06494870781898499,
        -0.10797582566738129,
        -0.06154350936412811,
        0.07984543591737747,
        0.0208584014326334,
        0.09745892882347107,
        0.012515917420387268,
        -0.02926373854279518,
        0.01921258680522442,
        0.02359512448310852,
        0.005490874871611595,
        0.040337931364774704,
        -0.01944011077284813,
        -0.12807537615299225,
        -0.007826339453458786,
        -0.009440476074814796,
        -0.0012280145892873406,
        -0.0745636448264122,
        -0.044258877635002136,
        0.021705180406570435,
        0.05537731572985649,
        -0.006860003340989351,
        -0.04246005043387413,
        0.04564991593360901,
        -0.012649488635361195,
        0.06282535195350647,
        -0.05888848006725311,
        -0.12047526985406876,
        -0.08627105504274368,
        0.1120578870177269
    ]
}