{
    "id": "be8PzlIlNfQ",
    "title": "Is the NEW Surface Pro STRONGER than the iPad Pro?! - (Its only fair...)",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2024-06-26T13:47:00Z",
    "video_url": "https://www.youtube.com/watch?v=be8PzlIlNfQ",
    "category": "Howto & Style",
    "tags": [
        "Surface Pro 11",
        "M4 iPad pro",
        "Snapdragon X Elite",
        "Microsoft",
        "Apple",
        "Tablet",
        "Best tablet",
        "Technology",
        "ereader",
        "ipad",
        "best ipad",
        "hackentosh",
        "surface pro"
    ],
    "views": 1016425,
    "likes": 46018,
    "comments_count": 2004,
    "description": "The iPad Apple wishes it could make. Get a $10 reward for opening a Chime checking account when you activate your Chime Visa Debit Card. Just go to  and enter promo code JERRYRIG.  Youve probably heard of Apples new M4 iPad Pro - the thinnest tablet Apple has ever made - but have you heard of the Microsoft Surface Pro 11? Its a full fledge PC in tablet form. And its ready to go head to head against Apple in a JerryRigEverything Durability test!   Banking services and debit card provided by The Bancorp Bank, N.A. or Stride Bank, N.A.; Members FDIC. Activate your physical Chime Visa Debit Card within 30 days of opening a Chime Checking Account with valid promo code and receive $10 within 10 business days of activation. SpotMe eligibility requirements and overdraft limits apply. Boosts are available to eligible Chime members enrolled in SpotMe and are subject to monthly limits. Terms and Conditions apply. Go to chime.com/disclosures for details",
    "description_links": [
        "https://www.chime.com/JERRYRIG"
    ],
    "transcript": "My wallet is a tad mad at the moment, but it's not my fault that so many new tablets are popping out of the woodwork. Luckily this video is again sponsored by Chime, and you can get a $10 reward by opening a new Chime checking account, but more on that later. Microsoft has heard the bugle of Apple's M4 iPad and responded with a brand new Surface Pro computer in tablet form, which is powered by a 12 core Snapdragon X Elite. Everything sounds more futuristic with the letter X in it, except Twitter. At 13 inches, it's pretty comparable in size to the M4 iPad Pro, which if you remember did not bend horizontally, but did kick the bucket when pressure was applied vertically. It's also a tad strange that Microsoft is just calling this the new Surface Pro without a number attached, even though this would technically be the Surface 11th edition. There's still a little sweet built in kickstand, putting the whole tablet9.3 millimeters thick. It feels very solid. For reference, the M4 iPad Pro was 5.1 millimeters thick, which is a pretty substantial difference. As we work our way through the Mohs scale of hardness, there's also a substantial difference in the capabilities. The M4 iPad is running iPad OS, which is closer to a jumbo sized iPhone than a computer, while the Surface Pro is running full blown Windows. It's kind of like comparing an Etch A Sketch to a gaming Both tablets, however, do start scratching at a level 6 with deeper grooves at a level 7. The Surface Pro 11th edition is using Gorilla Glass 5, and that same glass is covering the front facing video conferencing camera. The screen glass is notched for some rather large stereo speaker grills. There are only two though, one at the top and one at the bottom. For comparison, the M4 iPad Pro has four speakers. Surprisingly, the power button is from plastic, along with the volume rocker. But don't you worry, the frame of the Surface Pro is aluminum, which we have all come to love and enjoy. Moving over to the bottom edge, we see a 65 watt knockoff wannabe MagSafe charging port. It's doing everything possible in its power to not magnetically connect, which kind of defeats the whole purpose of it being magnetic in the first place. The other long side has a connection port for the keyboard and an empty slot to help guide it in and be secured, which technically isn't even needed since the Surface keyboard can work from a distance and doesn't need to be attached. The last short side of the Surface Pro has two USB-C ports for connecting external monitors and anything else that uses USB-C. The kickstand on this thing is a beast, made from a solid slab of metal with raised stamped edges that allow it to clamp very securely shut. It's a mighty fine piece of engineering. There's a series of vents all around that rear slab for what I assume is an internal cooling fan setup. Hopefully we get a close look at that in a second. The tiny rear camera is 10 megapixels and covered with glass. Now while the rear vents around the back help keep the Surface Pro cool, something even more cool is having a bank that's 100% mobile, online, and has no hidden fees or monthly minimums, like today's sponsor Chime.com. The first step to taking control of your own finances is being able to see all of your accounts at a moment's notice right at your fingertips, online, with the peace of mind knowing that you'll never be blindsided by hidden fees. You can build your own credit and get instant transaction alerts with 24-7 live customer support with Chime. Their whole mission is to make that financial peace of mind a reality for everyone. And they do mean everyone. Millions of people already have access to 60,000 fee-free ATMs, and you could too, along with fee-free overdraft protection of up to 200 bucks with SpotMe. Brad the bobbing brontosaurus wants you to know that there's a $10 reward waiting for you at Chime.com/JerryRig. All you gotta do is open a Chime checking account and activate a Chime Visa debit card. Chime.com/JerryRig. Link is down in the description. Now the Windows logo on the back does appear to be inlaid glossy plastic, but will definitely not be falling out on its own. It is incredibly well secured at the back of the computer. And speaking of computer, I do want Apple to take a good hard long look at this nifty feature. A magnetically attached back door covering an easily swappable solid state Gen 4 SSD. Beautiful. You can upgrade the long term storage in about two minutes, or have multiple boot drives, and physically swap the operating systems at a moment's notice. I'm sure if someone's ambitious enough they could technically turn the Surface 11 into a Hackintosh running the Mac OS and create the world's most powerful iPad built by Microsoft. The only thing missing would be the tandem OLED. The Surface Pro in front of us does have a 120 hertz OLED made by Samsung, but it's not a double stacked panel with pixels two layers deep. It does however last for about 30 seconds under the flame test, which tells us that fire is indeed still hot. Now the thinnest Apple product ever was actually surprisingly durable. It flexed a bit when played with horizontally, but thanks to Apple's structural core, it stayed intact until bent in the upright vertical position and then snapped in half. Both the 11 and 13 inch behaved in a similar manner. It is however still fairly impressive that with only four more millimeters of thickness, the Microsoft Surface Pro 11th generation is nearly immovable. I credit the super thick kickstand and the Brontosaurus, but mostly the kickstand.Nothing moves when bent horizontally. And again, no flexing when bent in the vertical position either. At 900 grams, it does weigh nearly a quarter pound more than the iPad Pro. Americans understand weights better when converted to burger sizes, and I would assume that most of that weight is coming from the sheer girth of the internal structural components. Speaking of which, since we're already here, let's see what that Snapdragon XLE processor looks like on the inside. This won't hurt a bit. Now I'm sure someone in the comments has already scribbled out that, hey, the iPad is a computer too, but it's most definitely not. While the Surface Pro is running full blown windows, the iPad is running iPadOS, which yes, can run DaVinci and Photoshop and Lightroom. But most apps found on iPadOS are limited versions of what we find in Mac OS, which of course is an intentional move by Apple since they wouldn't want to cannibalize the sales of their own computers by making a computer replacement. For example, final cut for the iPad costs 50 bucks and final cut for the Mac computer is 300. Buying one does not get you the other. They are two different feature sets and capabilities. One is heavily watered down and I'll let you guess which one that is. Honestly, I'm very surprised this guy's still alive. The Surface Pro is a whole computer smashed into a tablet form factor. You can tell by the full fledged laptop grade cooling system inside, complete with fans and copper vapor chambers. And it's a good thing I'm sitting down right now or I'd fall over from shock. There are QR codes inside that link directly to downloadable repair guides. I wish I had but more than one thumbs up to give. Never have I ever seen a piece of tech that is this repair friendly. And the frosting on top is that iFixit sells genuine Microsoft replacement parts for the Surface Pro, so parts are very easy to get. I'll turn off the Surface Pro just to be safe. And we can unplug the largest Lego style ribbon connector we've ever seen, which allows the screen to come free from the computer. The torque screws around the edge are clearly marked and after about 18 of them are removed, along with the charging port ribbon and fan ribbon, the whole cooling system can lift up and away from the computer. The copper absorbs the heat from the processor and spits it out the size of the tablet with the circular turbo fan. The Snapdragon XLe looks pretty cool, all shiny and reflective and stuff. It's a shame that no one else gets to see it but you guys. It is weird though that the battery can only be unplugged after the cooling system is removed. Kind of a strange order of operations. But also I didn't actually read the repair guide, so it is what it is. With nine more screws gone, the battery comes free from the tablet. No glue, no prying, no alcohol, no mess, no fire, and no explosions. Just some small white text that recommends a replacement by experienced individuals. And I am most definitely experienced, so that includes me. It looks like there are four cells making 51.5 watt hours. And again, more QR codes that take you to downloadable repair guides. Very impressive. The only thing more impressive than being repairable is if it actually works when I put it back together again. I don't have any new thermal paste thing around, so I'll just scrape the used thermal paste off a different CPU cooler since I'm all about that recycling lifestyle. And every component can get slapped back into place. With the battery, heat pipes and turbo fan all locked in and secured, we can plug in the budget MagSafe and hit that power button. Success. I don't know how Microsoft put a whole computer into a space the size of an iPad while keeping it entirely repairable, but I'm a huge fan of this trend and I hope it continues. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Surface Pro",
        "Microsoft Surface Pro",
        "Surface Pro computer",
        "Pro",
        "Surface",
        "iPad Pro",
        "Surface Pro cool",
        "iPad",
        "computer",
        "Microsoft Surface",
        "Pro computer",
        "Microsoft",
        "Chime",
        "Apple",
        "back",
        "Pro cool",
        "Pro is running",
        "fan",
        "Surface keyboard",
        "running"
    ],
    "transcript_entity_values": [
        "Chime Visa",
        "about 30 seconds",
        "about two minutes",
        "Microsoft",
        "The M4 iPad",
        "50 bucks",
        "M4",
        "iPhone",
        "Windows",
        "Lightroom",
        "13 inches",
        "6",
        "60,000",
        "Windows",
        "51.5 watt hours",
        "CPU",
        "Lego",
        "MagSafe",
        "millimeters",
        "four",
        "the Microsoft Surface Pro 11th",
        "100%",
        "two",
        "Surface Pro",
        "120",
        "nearly a quarter pound",
        "DaVinci",
        "QR",
        "the iPad Pro",
        "Twitter",
        "Chime",
        "Photoshop",
        "only four more millimeters",
        "half",
        "900 grams",
        "nine",
        "monthly",
        "about 18",
        "up to 200 bucks",
        "Gen 4 SSD",
        "iFixit",
        "Americans",
        "Success",
        "11",
        "the Surface Pro",
        "iPad",
        "Millions",
        "USB-C.",
        "more than one",
        "Apple",
        "USB-C",
        "Surface",
        "10",
        "Snapdragon X Elite",
        "Hackintosh",
        "first",
        "second",
        "10 megapixels",
        "Mac",
        "Etch A Sketch",
        "Snapdragon",
        "13 inch",
        "65 watt",
        "Samsung",
        "today",
        "the M4 iPad Pro",
        "12",
        "The Surface Pro",
        "only two",
        "24",
        "One",
        "Chime.com",
        "5.1 millimeters",
        "300"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "TIME",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "FAC",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL"
    ],
    "vector": [
        -0.04558459296822548,
        -0.11276223510503769,
        -0.018943754956126213,
        -0.08799298107624054,
        0.007219814695417881,
        -0.02939860336482525,
        0.05920669436454773,
        0.0614304393529892,
        -0.028891509398818016,
        0.04386386275291443,
        0.08490215241909027,
        0.025235868990421295,
        0.00042895108344964683,
        -0.012081694789230824,
        0.0999973714351654,
        0.023508647456765175,
        0.07004532217979431,
        -0.10313356667757034,
        -0.031056633219122887,
        0.05114510655403137,
        -0.008873256854712963,
        -0.10558027774095535,
        0.01977716200053692,
        -0.06808329373598099,
        0.008099628612399101,
        0.01835559867322445,
        -0.0035288759972900152,
        0.050639525055885315,
        0.014177062548696995,
        0.0015821014530956745,
        0.026956556364893913,
        0.036384087055921555,
        0.004449206870049238,
        0.02469387650489807,
        -0.0043203337118029594,
        -0.07439418882131577,
        0.01808667555451393,
        0.04508321359753609,
        -0.03292572870850563,
        -0.0439368300139904,
        -0.04522791877388954,
        -0.03555292263627052,
        -0.09469961374998093,
        0.02805624157190323,
        0.06025991588830948,
        0.003975312691181898,
        -0.021496597677469254,
        0.10248567163944244,
        -0.011061393655836582,
        0.04253719374537468,
        0.0323035828769207,
        -0.002606186782941222,
        0.04196901619434357,
        -0.040340110659599304,
        -0.12185323983430862,
        0.0444144569337368,
        0.06884949654340744,
        -0.01346740685403347,
        0.028302405029535294,
        0.0675412192940712,
        0.016159912571310997,
        -0.07992172241210938,
        0.028395477682352066,
        -0.012553231790661812,
        -0.011019372381269932,
        -0.003717520274221897,
        -0.05763503909111023,
        -0.05381267890334129,
        0.04782659560441971,
        -0.03257853537797928,
        -0.04503706470131874,
        -0.050507619976997375,
        -0.06744218617677689,
        0.02201312780380249,
        0.0214456208050251,
        0.05815500766038895,
        0.00209414167329669,
        -0.035626791417598724,
        -0.02079733833670616,
        -0.022135620936751366,
        -0.051129523664712906,
        -0.0006961125181987882,
        0.038785818964242935,
        -0.0025542150251567364,
        0.07343751192092896,
        -0.019215799868106842,
        -0.03411741927266121,
        0.06710983067750931,
        -0.0182880200445652,
        -0.04118730500340462,
        0.03419775888323784,
        0.07536651194095612,
        -0.01534726656973362,
        -0.008967304602265358,
        0.017700955271720886,
        -0.014682327397167683,
        -0.019192710518836975,
        -0.09970217198133469,
        -0.04297029227018356,
        0.0523984394967556,
        0.025790344923734665,
        0.020709866657853127,
        0.008106342516839504,
        0.030476797372102737,
        0.06316503882408142,
        -0.045800525695085526,
        0.06894823908805847,
        0.007210668176412582,
        0.03576710820198059,
        0.03770650178194046,
        0.06640166789293289,
        0.0009561823098920286,
        0.04921334236860275,
        0.010438698343932629,
        -0.05137253552675247,
        0.10652979463338852,
        -0.11311893165111542,
        0.06724228709936142,
        0.12587624788284302,
        0.023926470428705215,
        0.028389252722263336,
        0.0996854305267334,
        -0.07869130373001099,
        -0.04448014497756958,
        -0.09872475266456604,
        0.02695036679506302,
        -0.018111448734998703,
        3.8927997856197196e-33,
        -0.05817580595612526,
        0.1402522623538971,
        -0.020403683185577393,
        -0.07327143102884293,
        -0.046514030545949936,
        -0.06461956351995468,
        0.012111157178878784,
        0.048244278877973557,
        0.0681014284491539,
        0.039304133504629135,
        -0.08583597838878632,
        0.0014025319833308458,
        -0.04137793183326721,
        0.06427252292633057,
        -0.006484929006546736,
        -0.01724078878760338,
        -0.011190470308065414,
        -0.009568740613758564,
        0.02732684090733528,
        0.054267991334199905,
        0.019199324771761894,
        -0.10913574695587158,
        -0.006734438706189394,
        -0.03739823028445244,
        0.039760299026966095,
        0.05927654355764389,
        -0.04292736575007439,
        0.033120296895504,
        0.12331680208444595,
        0.01617022231221199,
        -0.06254642456769943,
        -0.07751842588186264,
        0.02087116613984108,
        -0.09168938547372818,
        -0.020750397816300392,
        0.005387327633798122,
        0.035867445170879364,
        -0.08850997686386108,
        0.06291712820529938,
        -0.019071869552135468,
        -0.04340841621160507,
        0.009749731980264187,
        0.0230531208217144,
        -0.0591338574886322,
        0.014194299466907978,
        0.04423538222908974,
        0.04375772178173065,
        -0.0014632632955908775,
        -0.049959611147642136,
        0.027122804895043373,
        -0.08518710732460022,
        -0.010241084732115269,
        -0.06195594742894173,
        -0.023334577679634094,
        -0.08230484277009964,
        -0.05333289876580238,
        0.0058555398136377335,
        -0.023567302152514458,
        0.09309802204370499,
        0.04027879610657692,
        -0.019057651981711388,
        -0.05243758112192154,
        -0.05013859644532204,
        -0.02055336907505989,
        -0.1047731265425682,
        0.020378313958644867,
        0.02991200052201748,
        -0.03048882633447647,
        -0.07242617756128311,
        0.004183527082204819,
        0.0055579012259840965,
        0.11980879306793213,
        0.02709045261144638,
        -0.08846109360456467,
        -0.015191447921097279,
        -0.0006376245873980224,
        0.06231909245252609,
        0.030870947986841202,
        -0.02761785313487053,
        0.005871388595551252,
        0.01292872428894043,
        0.06275591254234314,
        -0.05537410080432892,
        -0.01723225601017475,
        -0.056423116475343704,
        0.053729888051748276,
        0.05018629878759384,
        -0.08658494055271149,
        -0.031037095934152603,
        -0.00977938249707222,
        -0.029717998579144478,
        0.024447306990623474,
        0.02339302748441696,
        -0.0006699300720356405,
        0.008094812743365765,
        -3.341912806972501e-33,
        -0.04952911287546158,
        -0.04222971946001053,
        0.037663884460926056,
        0.04156307131052017,
        0.012672366574406624,
        0.011731167323887348,
        0.07644365727901459,
        0.07579731941223145,
        -0.0583500862121582,
        -0.05968502536416054,
        -0.07217459380626678,
        0.06290615350008011,
        0.07003797590732574,
        -0.05183761194348335,
        0.0009527317597530782,
        0.05185350775718689,
        -0.05677497759461403,
        0.05303565040230751,
        0.05974313244223595,
        0.004519399255514145,
        0.040200188755989075,
        0.12288801372051239,
        0.04514298215508461,
        0.03731026500463486,
        -0.02948322705924511,
        0.007683627773076296,
        -0.018465401604771614,
        -0.0461404025554657,
        0.025405989959836006,
        0.07024721056222916,
        0.03604681044816971,
        -0.03560634329915047,
        -0.049807704985141754,
        0.01618288643658161,
        -0.028718307614326477,
        -0.01502425130456686,
        0.03977299481630325,
        -0.008871362544596195,
        -0.00971833523362875,
        0.02256566472351551,
        0.034190572798252106,
        -0.009252700954675674,
        -0.014670056290924549,
        -0.027431480586528778,
        -0.023971321061253548,
        0.048571765422821045,
        0.07107218354940414,
        -0.05406957119703293,
        -0.01704440638422966,
        -0.010631119832396507,
        -0.0242410097271204,
        -0.012248116545379162,
        -0.017002491280436516,
        0.027631813660264015,
        -0.06651106476783752,
        0.062079429626464844,
        0.07746579498052597,
        -0.005954272113740444,
        -0.13221235573291779,
        -0.044789042323827744,
        -0.039970237761735916,
        0.05817178636789322,
        0.022478602826595306,
        -0.0005680565373040736,
        0.008815478533506393,
        0.058050837367773056,
        0.009782122448086739,
        0.060538701713085175,
        0.018313953652977943,
        0.02001103200018406,
        -0.062121517956256866,
        0.03939925506711006,
        -0.024717723950743675,
        -0.051202595233917236,
        0.0087741669267416,
        0.13696147501468658,
        0.02782588079571724,
        -0.011261977255344391,
        -0.1185447946190834,
        -0.07818242162466049,
        -0.053545255213975906,
        0.00622243108227849,
        -0.04050850495696068,
        -0.01442988496273756,
        0.07470665127038956,
        -0.018516283482313156,
        -0.05723307654261589,
        -0.04123150184750557,
        -0.05377517268061638,
        0.08002584427595139,
        -0.054232724010944366,
        -0.0028092297725379467,
        -0.0016993468161672354,
        0.10431583225727081,
        0.0009481461602263153,
        -4.08571061427665e-08,
        0.006177847273647785,
        0.041065990924835205,
        0.061039865016937256,
        -0.016527028754353523,
        0.023570949211716652,
        -0.010679212398827076,
        0.03766239434480667,
        -0.007066804450005293,
        0.041118331253528595,
        -0.03883606567978859,
        -0.004147166386246681,
        -0.01925807073712349,
        -0.11032751947641373,
        0.015031781047582626,
        -0.018459634855389595,
        0.08983944356441498,
        0.0033891634084284306,
        -0.040588147938251495,
        0.004841712769120932,
        -0.054279912263154984,
        -0.006409029010683298,
        0.08078984916210175,
        0.014572431333363056,
        -0.058195147663354874,
        -0.0754784569144249,
        -0.011499946936964989,
        0.048499930649995804,
        0.08151320368051529,
        -0.006347355432808399,
        -0.040572330355644226,
        -0.03346166014671326,
        0.04690267890691757,
        0.02306973561644554,
        -0.04888897016644478,
        0.06372351199388504,
        -0.10432139784097672,
        0.00019060901831835508,
        0.04043387994170189,
        0.019011393189430237,
        0.10160201042890549,
        0.011747037060558796,
        0.00917721539735794,
        -0.07655555009841919,
        -0.04997066780924797,
        0.003199344966560602,
        -0.017787059769034386,
        -0.11244634538888931,
        -0.07906124740839005,
        0.06444919854402542,
        0.06557834148406982,
        0.01701686717569828,
        0.033160045742988586,
        0.017555486410856247,
        0.06580360233783722,
        -0.01884385198354721,
        0.05311521515250206,
        -0.03939400613307953,
        -0.03840511292219162,
        0.03341912478208542,
        0.06376870721578598,
        0.034425608813762665,
        -0.08873913437128067,
        0.03522934764623642,
        -0.01724093407392502
    ]
}