{
    "id": "beJ97So74UY",
    "title": "Temu Needs to CHILL",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2023-04-21T16:09:02Z",
    "video_url": "https://www.youtube.com/watch?v=beJ97So74UY",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 181340,
    "likes": 5405,
    "comments_count": 144,
    "description": "Temu makes Amazon and Wish look tame       Subscribe!  Twitter:  Matt:  Instagram:   Produced by Kinsey Lynaugh  Edited by Aron Goodall:   Chapter Titles ------------------------------- 0:00 Hello and Welcome 0:24 The Bugman 1:25 Anyway, heres Michael Jackson 2:42 Get you banana 3:51 Heavy boy with nipples 4:57 Where are the earbuds? 5:38 How do you pronounce Temu? 6:38 Its a water pipe 7:02 Drawing Crocodiles 7:58 Okay I pull up 9:38 Starts burning immediately 10:40 Scrunkliness 12:03 Soup (Good)",
    "description_links": [
        "https://youtu.be/wP2n9_O-F74",
        "https://youtu.be/_-WGvpgOEcI",
        "https://youtu.be/1gOgsgd3xP8",
        "https://youtu.be/KMdQkz5ID_E",
        "https://youtu.be/x3pmg6Hj6cc",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel",
        "https://twitter.com/arongoodall"
    ],
    "transcript": "- Hello and welcome to This Is. Temu needs to chill out. - No, I actually would disagree. I think they need to continue to be a wonderful vendor of amazing products so I can make 75 more Temu videos. - We're gonna keep doing that. But what we're gonna play today is a game where we're gonna see a bunch of comments out of context from Temu items, and we are gonna try and guess what that customer review is, for what product. Let's see, the first one. - [Austin] Great job, I love shop from your store from- - [Man] This is - [Matt And Austin In Unison] From bugmanatz. - Is he an ice cream cone in July? (Austin laughing) Because he is dripping. I went to a wedding a couple weeks ago. The DJ looked exactly like this guy. - Is this the DJ? - My guess for this item is that this is for DJ equipment. This is a modern Renaissance man. (Austin stifling laugh) - Where are you going with this? - I'm gonna' say that this is live streaming equipment. - I'm gonna go with the truck. This dude's got some serious style. Importantly, he's standing in front of his truck in what looks to be some kind of garage. - [Matt] It's a red herring, in this case a blue herring. - All right, fine. - Let's hear it. Let's see it. - Oh! - Oh! - I hate that you got that. I'm maulding right now. I'm maulding. Kenzie, did you tell him? Does he know this answer? - You know, he would never, ever get an answer. - [Austin] Oh! (Matt laughing) - What? This is ridic- - Point for Matt. (bell chiming) - Are the rest of these items fair? Or is Matt shamelessly cheating? - Kenzie, I have a wallet full of dollars. - That's suspicious. - [Kenzie] Do you? - I just, I dropped, I don't. - Well, you don't have it anymore. Moving on. - It's gone. (laughing) Girl, these so comfortable. The thing is, if you have glossy floors. - [Matt And Austin In Unison] My house. - [Matt] Then they're gonna be some noises SpongeBob makes when he walks. Other than that, they feel like you're walking on clouds. - [Austin] When you first get it, it looks a little long, but I promise you it's your size. Anyway, here's Michael Jackson in red. 194 people find this review to be helpful. If you have glossy floors then they're gonna make the noises Spongebob makes when he walks, remember that? (mattress squeaking sound effect) - [Matt] Yeah. - I think it's gonna be moonwalking shoes. - Moonwalking, what are moonwalking shoes? - Shoes that are... - Meant for moonwalking? - Yeah. - I'm with you on shoes. - Yeah. - I'm gonna say that these are like knockoff Crocs. - Oh, and then that's why it makes the noise? - Yeah, like the rubber is kind of squeaky. All right, I'm going with like knockoff Cr- I'm gonna say alligators. Woo-hoo-hoo-hoo. Women's ultra cushioned bubble shoes, bubble slippers. - [Austin] Kenzie, why do you keep finding the most cursed things to find your feet? (Matt laughing) What is going on here? - Where I am gonna' give you half a point. - Yeah. - 'Cause I'm a generous god, is because- - You got $1 bill. - You said moonwalking shoes. - I mean. clouds are in the- - No, no, no, no, no. - Celestial bodies. (bell chiming) - Point to Matt. - All right. - Point to Matt. This video is not going well. - And I promise I only paid off Kenzie for the first one, so I legitimately got these points. So moving on to the next one. - [Austin] We're having one of those days, her and my friends. - [Matt] We're like, where did you get you banana? - [Austin] Ha! - [Matt] I went sheww and walk on. So funny. Love the bright yellow. - Are you okay? Do we need to call someone? Are you all right? Oh, banana, banana. Wait, wait, wait. Get you banana. (hand slapping table) Get you banana. Get you banana. Only thing we have to go on is yellow. It's very clear that something is yellow here. - Bright yellow. - A banana. Yeah. I'm gonna say at the risk of repeating the last answer. I'm gonna say some kind of yellow shoes. - I'm gonna go with like a handbag. I might actually say a banana. Like a fruit handbag. - Okay, so handbag and shoes. - Yeah. - All right. Let's see it. Banana umbrella! - [Matt] Umbrella. - [Austin] Wait, banana. - So it's actually a banana. - It's a classic automatic banana umbrella. - [Matt] Classic. - No one gets points on this one right? - I'm not sure I actually said banana. - Mm. - We need to go to the judge on this one. - That's what we're doing. - Yeah. - You think there's another judge over here? - Yeah, there's- (laughing) - Wait, here it is, the judge cam. (accordion sound effect) I'm gonna say that Matt gets a point. (gavel banging sound effect) - I would say if anything, Matt gets like a .1 of a point. - .1! - 0.1. Ah. - [Kenzie] 0.1. - [Austin] Unfortunately, I do not love him. - [Matt] Oh God. - [Austin] There is a hole in his head. A lobotomy? Sand fall out, gonna' super glue. He's a heavy boy with nipples. - Same. Not as single buyer found this helpful. (crew laughing) I do have a thing that I fully believe in. I'm not just saying it for the sake of the guests. - [Austin} Yeah. I'm gonna' let you go first. - I'm gonna' say it's- - 'Cause I don't want you to steal my answer. - No, no. I will say it is an urn. That's my best guess. - That's so sad. That's so dark. Grandpa Joe is falling out the- - Well... - lobotomy nipples. (Austin laughing) (broadcast beeping) - A Buddha planter. - Oh, that's really good. - So like to like plant like a bamboo stalk in a Buddha. - Yeah. That's pretty good. - What is this? - Also, what the fuck is this? Wait. Whoa, whoa. Hold on. - First of all, how can you not love him? - He does have nipples. Why does he have nipples? Do we get points for this? I definitely don't get a point for this. I think you got vaguely close, but I don't think you get any- - I didn't get, no, I definitely didn't- - I think, no points. (wrong answer buzzing) - I hate the fact that he got nipples. It just is not necessary. - Apparently, it was cold the day they took this photo. - Okay. All right, moving on. - Love these great sounding, nice looking, red earbuds. I would refer these to my friends and red is my favorite color. - If she's talking about great sounding earbuds why are there no earbuds in any of these photos? - It's true. - What is going on, Dana? Are you just posting a bunch of photos of yourself and Temu comments? I'm gonna say red earbuds. I'm just gonna just assume that Kenzie's not trying to lead us astray. - I'm gonna say it is some form of earbuds but like a headband for her cat. - [Austin] Cool gadget. Mechanical game headphones. - [Matt] Okay, I think I get the point on this though. (wrong answer buzzing) 'Cause it is earbuds. - You went in a completely different direction. - All right, I'll take the (indistinct) on this one. You get the point. You get the point. Moving on. My favorite purchase from Temu so far. (people applauding sound effect) Is it Temu or is it Temu - I'm just gonna' say Temu 'cause I do what I like. - We get messages constantly from people from Temu. So if you're one of the Temu people who hits us up, can you let us know how to pronounce this, so we can- - It's T- I'm just gonna say Temu. - I'm gonna' say Temu, regardless. I love this. His name is Sir. Even my husband appreciates him. That's always a huge plus. Does exactly what we intended it to do. - I don't like that. I don't like that. My thought is like something like, I don't know, maybe like some kind of helpful item in the house. I'm gonna say like it's a little like dude, who like, I don't know, it gives you like a condiment or something like that. Little like jar, but it's shaped like a dude. - You reached for dude- - And it gives you some kind of food. - who gave you a condiment when cookie jar was right there. - No, but cookie jar. But it's a little dude. His name is Sir so he's gotta' be a little dude. - I think it's gonna be one of those reversible... - Oh, angry, happy? - Yeah. If you don't know this, A lot of times they're like little octopuses. If you don't want to verbally communicate that you're happy or sad, you just boop, boop. And then just, whoop. So I'm gonna go with that. - Okay. - I'm gonna go with Sir, the Octopi. - Whoa. Whoa. Whoa. (Matt cackling) What? Water pipe for smoking cigarettes. It's a water pipe for your little guy. He's just in there being happy. He's probably made out of glass, right? I get like one quarter of a point. (bell chiming) - You did say glass little guy. - 1498 though, what a bargain. - That is actually... - That's actually pretty good. - All right, I think you pulled ahead on this. - [Austin] I really love this therapy gloss Vaseline stuff. It is amazing. It's healed my hips so quick 'cause I always get drawing crocodiles and it's so amazing. I'm definitely going to have to get more. Can you call like like a Charlie Horse, a drawing crocodile or something? - Yeah, yeah. No, that's exactly it. (crocodile roaring sound effect) - Oh, ah. - My drawing crocodile. Ah, my drawing crocodile. Ooh. (crocodile growling sound effect) I'm gonna say it is some kind of cream or ointment of some variety that probably has a nebulous medical purpose. - The problem is, I also think that, and I think these hips don't lie. I think this is some sort of lotion. Oh. - [Matt And Austin In Unison] Lip bomb- - [Matt] Set. - [Austin] Oh, okay, so basically it's just knock off Vaseline? Yeah. - [Matt] Okay. It's wrimple. I think I get a little bit of an extra tiny bonus point, - Look- - because I said - If there's bum bum cream, why would there not be hip cream? - Oh, I'm not gonna put this in my lips. (microphone blowing) I don't know where this came from and what kind of mutant powers it's gonna' give me, but sign me up. These hips don't lie. Okay, hold on, hold on, hold on. Time out here. - [Matt] Oh. - Size, (gun shooting) 7.09 inches. Color, - No, actually- - Brown. - You know who's the perfect person to read this one? Can we get the hat? - Oh yeah, yeah, yeah. (Austin laughing) - Kyle's back, baby. (punching sound effect) Okay, I pull up, I hop out after the party. You and all your friends. Yeah, they love to get naughty. Sipping on that Henny, I know you love that Bacardi. (crew member laughing) 1942, I take you back to that 'rari. Mm. Okay, I pull up, I hop out after that party. - You know what, for the first time ever on a comic guessing game, I abstain. Wait, can we actually listen to the song? Yeah, let's listen to the song. Sorry, Aaron, it's gonna' be copyrighted. (instrumental music) Yeah, it didn't help me at at all. I don't understand this one bit. I again, abstain, abstain abstain. - Yeah this is cigar. - Oh, that's a good guess. That's totally what I was thinking. You know what? I abstained because my head was thinking cigars. I just didn't want say it out loud. That was where my head was at. - No, no, no, no. (Matt laughing) - [Austin] What?! - Is that a capybara? - [Matt] Like I said- - I'm glad that I abstain from this one because boy, if I would've said what I was thinking originally, I would've regretted it. - He was talking about a penis. (instrumental thudding) I was so off on that. I definitely was thought, this was like- - Wait, wait, wait, Matt, what are you doing here? Where's Kyle? - Oh, he died. (bell thudding) Yeah. - Wait, you killed Kyle off mid-episode? - She chugged nine Monsters. What did you expect? (comment whooshing) - [Austin] Very durable and strong plastic. Starts burning immediately. - [Matt] This sounds like the first suit I ever had as a kid. (Austin laughing) Are you okay? - No I think it's very durable and strong plastic. It's like maybe a plastic container and there's like maybe like a candle or something in the middle, so that's the part of that burns. Perhaps this is a sixth piece of a lighter and it's, you know, plastic lighter, but you flick it and it's gonna do it. I'm gonna' say this is a lighter. - I'm gonna' take it slightly one step further. - [Austin] Okay. - And that these are like ornate lighters. So like- - You can't just take my guess and just add an extra qualifier to it, Matt. - Sure, I can. I'm gonna say wart cream. (crew laughing) No, no. - Starts burning immediately. That's actually a really good answer. - Just burn off the warts. - [Austin] Unisex jawline exerciser. - Feeling the burn. So this is one of those just like (chewing sounds) - So you just chew on it? - I always go into this trying to be logical (Austin laughing) because you know, wart juice is the, like. - Okay, let's not use the phrase wart juice ever again. (crew laughing) Please. - Well, how else would you advertise it? - Man, Temu. What wild place. (comment swooshing) Love him. He smells like cigarettes for some reason, but that just adds to his skrunkliness. - This one I've included multiple reviews. - Multiple, okay. - [Austin] Okay. I love this dude so much. I'm waiting for him to strangle me in my sleep. He's a little paler in real life than he is in the listing, but I'm not complaining. - He's always watching me. When I first met him, he was warm and welcoming. Yet his time passed. He became different. Now I hear whispers coming from him while I sleep. (eerie music) I often catch him watching over me as I sleep. And now I fear, not only for my life, but soul. He may take it. - Boy, don't like this at all. So as a spooky little guy, I'm just, yeah, I'm just say a stuffed animal or, but it's like probably like some monster-y little dude. - I'm saying the same for Fuecoco plush that we got from Hot Topic. - Ah! No, no, no! Oh, that's not as bad. Those photos were scary. Garfield, don't like that. I think I win though. - I don't know. I said cute. And- - That's not cute. Yeah. - It's ugly. That doesn't necessarily mean it's scary. Am I scary to you? - Yep. - Turn the lights off real quick. See? See. (crew member laughing) Look how terrifying he is. - Rawr. - [Matt] Look at this. (broadcast beeping) The listing says cute. You said scary. I don't see scary in that listing. I think I get the point. - I said a little monster-y dude. This guy's pretty monster-y. - He's huge. - Way better than Fuecoco. - He's huge. - Four stars. Good soup. But the description is cool and handsome. (soup sound effect) Please go first because I've gone first every time. - No, no, no, you go. You got it. Because you think you got these answers so much better. because my answers are just gonna make you just angry. - Okay, okay. God, there's like nothing to go on here. - There's everything to go on here. - I'm gonna' say, this is a can of soup. (Austin laughs softly) - I'm going with like pomade, like hair gel. Just- - Okay, all right. - Just you know, scoop for my hair, (gel squishing sound effect) scoop for my mouth. - I think he's saying good soup. This dude's saying good soup, as like a good soup, bruh. Like not an actual like serious, like it's soup. He's just like saying that he likes it. - No, no. - [Austin] A men's gothic biker helmet. (Matt laughing) Oh! - [Matt] Wait, wait. - Good soup. - Good soup. - Good soup. You know what? - I was about to try and argue that I get that because you know, you get helmet hair. - You know what else is good soup? - What? - Subscribing and ring-a-ling-ing the ding-a-ling. button here on This Is. You get some high quality entertainment delivered directly to your subscription feed, roughly twice a week. Wow. What a great deal. Almost like a better deal than giving Temu money and leaving weird comments on it. - Like, follow, subscribe. Let us know what we should have looked at on Temu and we'll catch you in the next one. - [Matt And Austin In Unison] Good soup.",
    "transcript_keywords": [
        "Yeah",
        "Temu",
        "Good soup",
        "banana",
        "Point",
        "Wait",
        "good",
        "Matt",
        "soup",
        "dude",
        "love",
        "shoes",
        "kind",
        "moonwalking",
        "moonwalking shoes",
        "yellow",
        "guy",
        "cream",
        "abstain",
        "scary"
    ],
    "transcript_entity_values": [
        "Austin] Kenzie",
        "Grandpa Joe",
        "Dana",
        "one",
        "75",
        "SpongeBob",
        "Aaron",
        "Hot Topic",
        "7.09 inches",
        "mid-episode",
        "Love",
        "Crocs",
        "the day",
        "today",
        "nine",
        "Bacardi",
        "Fuecoco",
        "Garfield",
        "a couple weeks ago",
        "Matt",
        "Austin",
        "1942",
        "Austin",
        "half",
        "Charlie Horse",
        "sixth",
        "Temu",
        "Kenzie",
        "Kyle",
        "Henny",
        "1",
        "July",
        "Vaseline",
        "Renaissance",
        "first",
        "Spongebob",
        "Temu",
        "194",
        "Michael Jackson"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "QUANTITY",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "GPE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "MONEY",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON"
    ],
    "vector": [
        -0.05396141856908798,
        -0.029258767142891884,
        0.00426415866240859,
        -0.0866067185997963,
        0.0018162651685997844,
        0.006454180460423231,
        0.09291686117649078,
        -0.02849399298429489,
        0.0026724454946815968,
        0.0243240874260664,
        0.016859004274010658,
        -0.1145549938082695,
        0.01983211189508438,
        -0.05473567545413971,
        -0.009792814962565899,
        -0.035411909222602844,
        0.07715396583080292,
        -0.008423889055848122,
        -0.08267772942781448,
        -0.08430101722478867,
        -0.03376105800271034,
        0.08743347972631454,
        0.005517647601664066,
        0.040003884583711624,
        -0.12493463605642319,
        0.0947173684835434,
        -0.07335016876459122,
        0.04125744849443436,
        -0.02003963105380535,
        -0.0023350457195192575,
        -0.08077985793352127,
        0.024619854986667633,
        -0.042272791266441345,
        -0.07009534537792206,
        0.012614372186362743,
        0.0452011413872242,
        -0.02796032652258873,
        -0.05859733372926712,
        0.0039742146618664265,
        -0.039236608892679214,
        0.04045199602842331,
        -0.025976745411753654,
        -0.06104181334376335,
        -0.052277032285928726,
        -0.004076411481946707,
        -0.02221863344311714,
        -0.017545031383633614,
        -0.07330410927534103,
        0.03971205651760101,
        -0.008247233927249908,
        -0.06440229713916779,
        -0.008625531569123268,
        0.0017142839496955276,
        -0.0009248951100744307,
        -0.07806123793125153,
        0.06055877357721329,
        0.089798703789711,
        -0.04117107018828392,
        0.024139415472745895,
        0.051535360515117645,
        -0.0331449881196022,
        -0.007376872003078461,
        -0.003208247711881995,
        0.04944908246397972,
        0.04159092530608177,
        -0.06496455520391464,
        -0.05327923968434334,
        0.10459993779659271,
        -0.026993371546268463,
        0.09479743242263794,
        -0.03292623907327652,
        0.03380537033081055,
        0.05973854660987854,
        0.06713978946208954,
        -0.06177162751555443,
        0.055288344621658325,
        0.055096548050642014,
        -0.10059861838817596,
        -0.020238282158970833,
        0.0574772022664547,
        0.05049090087413788,
        -0.05986729636788368,
        0.004492626059800386,
        -0.13718032836914062,
        -0.05096931383013725,
        0.0028780358843505383,
        0.019186805933713913,
        -0.011896698735654354,
        0.05716995894908905,
        0.036751311272382736,
        -0.035521283745765686,
        -0.009151964448392391,
        0.08603241294622421,
        0.04192559793591499,
        0.08412415534257889,
        -0.005444805137813091,
        -0.08815501630306244,
        -0.029021453112363815,
        -0.040522973984479904,
        0.035995837301015854,
        -0.03897763043642044,
        0.08272461593151093,
        0.04025539755821228,
        -0.04835348203778267,
        0.051992952823638916,
        -0.016327982768416405,
        -0.08400090783834457,
        0.0841798484325409,
        0.06501643359661102,
        -0.02341313660144806,
        -0.04963003844022751,
        -0.014173884876072407,
        -0.013133835978806019,
        -0.004163159057497978,
        0.0004939055070281029,
        0.05344269424676895,
        -0.05136644095182419,
        -0.018764056265354156,
        0.01373043842613697,
        0.07659391313791275,
        0.1395351141691208,
        -0.012971571646630764,
        -0.05576673522591591,
        0.03397739306092262,
        0.10017352551221848,
        -0.01527626346796751,
        -0.037733182311058044,
        1.1855715516512e-33,
        0.08893172442913055,
        0.050622571259737015,
        0.04376181960105896,
        0.04628848657011986,
        0.11050277203321457,
        0.003589906496927142,
        -0.02996228262782097,
        0.015652567148208618,
        -0.03111235611140728,
        0.02609534002840519,
        -0.04282946139574051,
        -0.026153307408094406,
        -0.06811332702636719,
        0.012588715180754662,
        0.03541961684823036,
        -0.06068262830376625,
        -0.028132453560829163,
        -0.015067183412611485,
        -0.02348201349377632,
        0.005438023712486029,
        -0.017217345535755157,
        0.07260530441999435,
        0.02768559567630291,
        -0.02090551145374775,
        0.016173843294382095,
        0.07777602970600128,
        -0.0184823889285326,
        -0.002953246934339404,
        0.018941685557365417,
        0.058280039578676224,
        -0.049092598259449005,
        -0.029894599691033363,
        -0.09682120382785797,
        -0.0009224653476849198,
        0.08814781159162521,
        -0.08484663814306259,
        -0.010803446173667908,
        0.016047092154622078,
        0.017944669350981712,
        -0.011501406319439411,
        1.6503556707903044e-06,
        0.0417044572532177,
        -0.05470781400799751,
        0.08397316932678223,
        -0.0035868040286004543,
        0.011714561842381954,
        0.02597825974225998,
        0.008299288339912891,
        0.004003101959824562,
        -0.011119007132947445,
        0.0583326630294323,
        0.07130265235900879,
        0.031774066388607025,
        -0.008106807246804237,
        -0.039233800023794174,
        -0.120076484978199,
        0.01512878853827715,
        -0.02765657752752304,
        -0.007204852532595396,
        -0.03795295208692551,
        -0.02132110856473446,
        0.02510928176343441,
        0.023363761603832245,
        0.016787607222795486,
        -0.02469552680850029,
        0.049293532967567444,
        0.016060246154665947,
        0.028067519888281822,
        -0.011145459488034248,
        -0.05096108838915825,
        -0.05323389172554016,
        0.03420829772949219,
        0.048595886677503586,
        -0.0628381222486496,
        0.016602573916316032,
        0.006285481154918671,
        0.03597807139158249,
        -0.016220245510339737,
        0.0035803162027150393,
        -0.04296672344207764,
        0.08208608627319336,
        -0.031159868463873863,
        -0.030224326997995377,
        -0.03154846653342247,
        0.005162471905350685,
        -0.05829708278179169,
        -0.005579505581408739,
        -0.010748200118541718,
        0.08843307942152023,
        0.026852237060666084,
        -0.06051306426525116,
        0.06832610815763474,
        -0.016571294516324997,
        0.012464129365980625,
        -0.08456684648990631,
        -2.721351706758153e-33,
        0.017172707244753838,
        -0.01901247724890709,
        -0.057339392602443695,
        0.045815348625183105,
        -0.04181648790836334,
        -0.028880396857857704,
        -0.0283548254519701,
        0.044508498162031174,
        0.06753058731555939,
        -0.05119828134775162,
        -0.04345092177391052,
        -0.030248790979385376,
        -0.03137172386050224,
        -0.03297767415642738,
        -0.019998624920845032,
        -0.0890762135386467,
        0.03696192800998688,
        0.030791480094194412,
        -0.02264399826526642,
        -0.012884329073131084,
        -0.004406840540468693,
        -0.030994314700365067,
        -0.058198053389787674,
        -0.012945825234055519,
        -0.031592607498168945,
        0.08509580790996552,
        -0.005468376446515322,
        -0.04506264999508858,
        0.063606858253479,
        0.03974754735827446,
        0.0007479413179680705,
        -0.08231385052204132,
        -0.054940611124038696,
        0.02915857918560505,
        -0.006638250779360533,
        0.03772253170609474,
        0.010113253258168697,
        -0.04192524403333664,
        0.0032327042426913977,
        0.005267642438411713,
        0.1300617754459381,
        0.0025602311361581087,
        -0.0285627618432045,
        0.028520090505480766,
        -0.06240393593907356,
        -0.003581866854801774,
        -0.0035467217676341534,
        -0.03945518657565117,
        -0.0993368923664093,
        0.08142869174480438,
        0.12123019993305206,
        -0.0029799186158925295,
        -0.07525372505187988,
        -0.042874932289123535,
        -0.020329486578702927,
        -0.03418433666229248,
        -0.03845890238881111,
        -0.07942915707826614,
        -0.09910569339990616,
        0.012878059409558773,
        0.0599878653883934,
        -0.015804141759872437,
        -0.053416021168231964,
        -0.11184902489185333,
        0.0204189233481884,
        0.028507500886917114,
        0.047052618116140366,
        0.05302119255065918,
        0.025994790717959404,
        -0.036752570420503616,
        0.048069894313812256,
        0.0005305215017870069,
        -0.0707731544971466,
        -0.09863673150539398,
        0.03161139041185379,
        0.06852506101131439,
        -0.07325601577758789,
        -0.1174267828464508,
        0.014915358275175095,
        0.006844084709882736,
        -0.06412477791309357,
        -0.005047275219112635,
        0.0019357868004590273,
        0.07362494617700577,
        0.06617838144302368,
        0.06959674507379532,
        -0.016310708597302437,
        0.06679849326610565,
        0.03695819899439812,
        0.01439750473946333,
        0.08534719794988632,
        0.015531974844634533,
        0.04975588247179985,
        0.11153563112020493,
        0.0401800274848938,
        -6.59170140693277e-08,
        0.010053262114524841,
        -0.030772708356380463,
        -0.03973272815346718,
        0.06618454307317734,
        0.08280070126056671,
        -0.0013966283295303583,
        0.031140988692641258,
        0.0007772682583890855,
        0.02946135774254799,
        0.07215515524148941,
        0.10138552635908127,
        0.04979253560304642,
        -0.010370965115725994,
        0.03180352598428726,
        0.023680154234170914,
        0.09151895344257355,
        -0.06775742024183273,
        -0.054400041699409485,
        -0.031993892043828964,
        -0.059771277010440826,
        -0.012528672814369202,
        0.049637798219919205,
        0.038774192333221436,
        -0.03803630545735359,
        -0.07832890003919601,
        0.002301550703123212,
        -0.04238449037075043,
        0.08923815190792084,
        -0.01940297894179821,
        -0.003989092539995909,
        0.006415048148483038,
        -0.04412292689085007,
        -0.13932771980762482,
        0.013554662466049194,
        -0.03785030171275139,
        -0.1112796738743782,
        0.021879928186535835,
        0.0037151018623262644,
        0.003798778634518385,
        -0.003005586564540863,
        -0.062032103538513184,
        0.023578358814120293,
        0.00238785264082253,
        0.09020274877548218,
        -0.08044698089361191,
        -0.03560331463813782,
        -0.0006331734475679696,
        0.03396405652165413,
        -0.038672998547554016,
        0.023279497399926186,
        -0.0717640072107315,
        -0.0021565600764006376,
        -0.0024410474579781294,
        0.05175718665122986,
        0.027043981477618217,
        -0.0014482386177405715,
        0.0003471406234893948,
        0.03704466670751572,
        -0.07073493301868439,
        0.030626986175775528,
        0.024827633053064346,
        -0.00987514853477478,
        -0.06339477747678757,
        0.030055562034249306
    ]
}