{
    "id": "bExHfIQGisM",
    "title": "Are Linux laptops the FUTURE??? - System76 Darter Pro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-02-09T22:02:07Z",
    "video_url": "https://www.youtube.com/watch?v=bExHfIQGisM",
    "category": "Science & Technology",
    "tags": [
        "Laptop",
        "Linux",
        "Custom",
        "DIY",
        "Maker",
        "Gaming",
        "CSGO",
        "Intel",
        "Performance",
        "PC",
        "IPS",
        "Display",
        "Iris",
        "Anthony",
        "Linus",
        "Unboxing"
    ],
    "views": 1395824,
    "likes": 62039,
    "comments_count": 4007,
    "description": "Head to  and activate Honey for free to start saving today! Thanks to Honey for sponsoring this video.  Would you be willing to switch from a Mac or Windows laptop to a Linux one? System76 is one of the top brands that make Linux based laptops and Anthony is checking out the Darter Pro!  Check out the System76 Darter Pro laptops at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "http://joinhoney.com/shortcircuit",
        "https://lmg.gg/VrsZ9",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- It was a pleasant surprise for me that the System76 Oryx Pro actually did pretty well for this channel. You guys seem to really enjoy it. So here we are again with System76, once again, again. This one is the Darter Pro. So far the box looks pretty much the same. (box scuffing) Yep, this is just a shipping box. Unleash your potential. Open box, alright, (box scuffing) lift platform, (parts clacking) and flatten. Oh! (parts clacking) (sighs) Wait! Don't cut it! Packaging is reusable. A couple of people actually said, oh, that doesn't make any sense. It's, why are you gonna reuse the box? I mean, there's a good reason like if you had to RMA it or something. So let's see. We've also got the power adapter in here and a little card. Only complaint I have about this box is it's huge. But I mean, it's a shipping box, so what do you expect? Nothing too interesting about the power brick, I don't think. (paper rustling) They do give you a little cleaning cloth and a SSD, a thermal pad, which is nice. And now we have this card from System76. Oh, a Desktop Sentinel. Okay, (chuckles) Thank you for purchasing a System76 computer, if you, yeah, yeah, yeah. Okay, I was hoping there would be more to that but it's just a, hey, it's a warranty thing. This is like a punch out little thing, a little guy that you can stand up. There we go. Yeah, Melvin. Oh, there's more in here. Yeah, all kinds of stickers here. Enough with all that. What is going on here? Oh, okay. (paper rustling) Oh, that is quite a fetching unit. No, actually it looks, it looks really nice. I mean, I know this is a Clevo design. Actually, I don't have exactly what one it is here, but it's actually an NS-50-MU. They say it's under four pounds and I believe them. Let's see if they're lying to us. 3.956, 1.795 kg. There will be some variation in the weight depending on how you spec it out, because this has two DIMM slots, as well as two M.2 slots on the inside for NVME, one of which is PCI Express 4.0, which is very nice. On the left side, we have the barrel jack for power, HDMI, a USB 3.2 Type-A, a USB 3.2 Type-C, and a Thunderbolt 4 port. On the back, we got nothing and we've got a vent, actually two. On the right side, we've got a headphone-mic combo jack, an SD card, micro SD card reader, a USB 2.0 port, the power button, and this lovely little collapsible ethernet jack. I love those. Oh, also a Kensington Lock port. That's not all there is to the exterior though. If we take a look inside here, under the lid, we can see that we've got a really weird little camera bump. What's that for? Well, it's a 720p webcam, so there's nothing special about that. But it also has Windows Hello sensors, and you can use that with a program called Howdy to actually use Windows Hello in Linux. So you're not missing out on that. There is a, I think it's a 73 watt-hour battery, and that is the same battery that's in the Oryx Pro that we looked at before. Ours is kitted out with a Core i7 1165 G7 with Intel Xe Graphics. 16 gigabytes of RAM and 2x8 configuration, and a one terabyte PCI Express, Gen 3 SSD. Now, why Gen 3? Well, it's gonna be a little bit less power hungry for one, and two, most people aren't gonna need Gen 4. But if you do, the slot is there. Train Deck flex is pretty much minimal for this kind of design, like the lid doesn't really flex all that much. It's pretty much what you'd expect from a metal chassis. What else is there to say here? The keyboard layout looks pretty standard for a laptop, not bad, a full-size arrow key cluster here the inverted T. Keys feel well stabilized actually screen is a nice matte finish. But we'll see more about that when we boot it up. First, I need to talk to you about honey. Honey is the free shopping tool that finds the best promo codes whenever you shop online at specific sites. It works on over 30,000 stores, including Amazon, eBay, Newegg, Razer, Best Buy, Walmart, and many more. Honey gets a small commission from sites, whenever they save you money, get honey for free right now at jointhoney.com/shortcircuit. Anyway, let's plug it in. Having the power button on the side is actually really good because since this is using open source firmware you can make it so that you can turn the laptop on while it's like the lid closed but yet the power is plugged in. Alright, we're in Canada, we're not French. Why do they keep saying that Canadians are French? It's always defaults to French when we select Canada. All the Quebecers are like, \"Oh, excuse me.\" If you are a touch-typer, you can set the keyboard to whatever layout you want via the firmware. Because it's open source. So you can make it Dvorak, you can make it Colemac, you could make it QWERTZ or AZERTY. Anyway, it's really cool. (chuckles) So, here we go. Let's encrypt, 'cause why not? Screw it, one two, three, four, one, two, three, four, Please don't steal my files. By default, they suggest that you do full disk encryption. - [Man] Oh, I see. - Just for privacy security reasons. Restart device, let's do it. Booting. This'll be familiar to anyone who's seen the Oryx Pro video, or if anyone who's used Pop OS. But here's the Pop OS desktop. It's super clean. And it's got this little tiling thing here. What's that? That, I don't think was in the Oryx Pro video. You can basically just do everything via the keyboard now, so I can do, I can hold down the Windows key and press the arrows, to move around between the different windows. Let's see what all the shortcuts are. Yeah, so I can increase the size like that. It's cool, if not super useful for everybody. And because it's based on Ubuntu, I can install Steam, if I go into the Pop Shop. I wanna know, just how well Intel's Xe Graphics works under Linux. Because unlike Nvidia, it's not a proprietary driver. It is open source. Basically everything on this machine is open source, with the exception of CPU microcode and the Intel Management Engine, which System76 actually disables by default, or at least as much as they can, because it's a security risk. So you have pretty much total control over the hardware. Processing shaders. Oh, God! The progress bar went backwards and it straight up says, \"known Intel driver issues. Not supported.\" Alright, let's put it down to the test 'cause we just spent the past 15 minutes installing it. Play. Doom Eternal, I donno know why they don't make this skippable. Oh, man. Alt + Enter. So it looks like it just doesn't like Intel. Okay. Let's, see us go. Just need to wait for this cutscene to end 'cause they added this for some reason and you can't skip it. Alright, cool. We're in business. Oh, oh, here we go. (video pops) Oh, can I not? Oh. (chuckles) This is horrible. Palm rejection, is a thing, so I can move and I can turn, but if I press a key on the keyboard and try to turn, I cannot do that. So I need to stop, to turn. And I got killed by a bot. (man laughing) - [Jono] How is it looking though? Like frame rate? - [Anthony] Frame rate is like 70 or 80. There's actually a lot of weird graphical glitches going on here. I don't think the driver is perfectly adequate yet, which would explain why it didn't really work very well in Doom Eternal. Alright, so gaming isn't this thing's forte, at least not right now until the driver is, you know, improved. But that's not too bad because this machine isn't really meant for gaming anyway, it's more of a portable workstation. - [Jono] How much is this spec going for right now? - The current spec, I think is $1550 roughly, I'll have the full price on screen here, but it's $1,099 for the base unit. So that's I think with the Core i5 and eight gigs of RAM and 250 gig SSD. So, with that in mind, let's test that out the speakers. (upbeat music) I think the speakers are coming up, yeah, the speakers are on the bottom. (upbeat music) - [Jono] Can we use this video also as a screen quality check? - [Anthony] I mean, the screen looks fine, nothing fancy as far as like HDR or high refresh rate goes, but it looks pretty spot on to me. Lemme load up Linus Tech Tip feed video and see what that looks like. You know, it looks like a perfectly fine display. It is IPS. So it's not going to let you down in that regard. You're not gonna have difficulty seeing it off-axis. Brightness of the screen though, this is as high as it goes. Let's do like half brightness iPhone right next to it, yeah, yeah. I mean, the thing about this is that it's actually straight-up a Clevo design. So, if you've seen one of these, you've seen them all, physically. So, there's not really a whole lot else to say about it. The secret sauce as it were, is all in the operating system and in the firmware. For the money, it's not a bad machine. It's just not amazing, it's not gonna outdo a MacBook Air M1, which is on around this price point. So it really depends on what you value as a consumer. Like would you prefer a Windows laptop? I mean, maybe, would you prefer Mac OS? Also maybe. But if you prefer Linux, if you want to get into something that you can tinker with because you can change so many things like the battery charge rate, the battery, I think the maximum charge you can probably tweak as well. You can change the TDP of your CPU, to turn it down or turn it up, the keyboard, basically, anything you can think of, which is really cool. So, there is a little bit of overhead for that, and I think that should be kinda considered, when you look at the price for this kinda thing. Like the thing is, this is here today. It works, it is very well integrated. As far as integration goes, System76 is probably more deeply integrated with the hardware and the software than any Windows PC manufacturer, just as a result of the coreboot, the custom firmware for the memory controller. But they don't take that away from you, they give it to you, and that counts for a lot. Yeah, I mean, if you're looking for a nice portable workstation that you can upgrade, that you can service and that isn't actually like, it doesn't really have any major downfalls aside from the fact that the speakers suck, it's, it's good. They do have their own in-house laptops coming though. There'll probably be a couple more generations of these before they actually manage to get a laptop out. But when they do, I'm looking very much forward to seeing what they can come up with. Thanks for watching, get subscribed, so you don't miss the next time we take a look at a obscure piece of hardware from a semi obscure company.",
    "transcript_keywords": [
        "Oryx Pro",
        "yeah",
        "Oryx Pro video",
        "pleasant surprise",
        "thing",
        "Windows",
        "power",
        "Pro",
        "pretty",
        "box",
        "Intel",
        "make",
        "turn",
        "Oryx",
        "open source",
        "alright",
        "nice",
        "Open",
        "Pro video",
        "Darter Pro"
    ],
    "transcript_entity_values": [
        "the Darter Pro",
        "AZERTY",
        "half",
        "the Oryx Pro",
        "Gen 4",
        "Doom Eternal",
        "French",
        "Core",
        "PCI Express 4.0",
        "eight",
        "RMA",
        "Clevo",
        "the Intel Management Engine",
        "Thunderbolt 4",
        "Intel",
        "three",
        "2x8",
        "RAM",
        "1165",
        "Canadians",
        "one",
        "USB",
        "Newegg",
        "Gen 3 SSD",
        "Xe Graphics",
        "iPhone",
        "70",
        "micro SD",
        "MacBook Air M1",
        "16 gigabytes",
        "Doom Eternal",
        "Linus Tech",
        "Mac",
        "3.956",
        "Amazon",
        "System76",
        "Windows",
        "Dvorak",
        "one two",
        "1550",
        "Walmart",
        "80",
        "Windows",
        "Linux",
        "DIMM",
        "Quebecers",
        "four pounds",
        "Linux",
        "NVME",
        "M.2",
        "the Pop Shop",
        "PCI Express",
        "HDMI",
        "Nvidia",
        "1,099",
        "two",
        "Intel Xe Graphics",
        "Colemac",
        "over 30,000",
        "G7",
        "Razer",
        "Canada",
        "four",
        "eBay",
        "1.795 kg",
        "Kensington Lock",
        "250",
        "SD",
        "CPU",
        "First",
        "the past 15 minutes",
        "Melvin",
        "Best Buy",
        "today",
        "SSD",
        "73 watt-hour"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "EVENT",
        "PERSON",
        "NORP",
        "ORG",
        "ORG",
        "CARDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "NORP",
        "GPE",
        "ORG",
        "NORP",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "TIME",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY"
    ],
    "vector": [
        -0.0874256119132042,
        -0.08546319603919983,
        -0.017293822020292282,
        -0.0842340737581253,
        0.10506276786327362,
        0.041892681270837784,
        -0.04673443362116814,
        0.035527970641851425,
        -0.020372683182358742,
        0.03389911353588104,
        0.021404800936579704,
        0.03831568732857704,
        -0.017580630257725716,
        -0.02040160819888115,
        0.12155915051698685,
        -0.01895914040505886,
        0.02884151041507721,
        -0.12996402382850647,
        0.010749148204922676,
        0.0030411146581172943,
        -0.061671726405620575,
        -0.04204632341861725,
        -0.0029986146837472916,
        -0.05897732079029083,
        0.02871076948940754,
        -0.045854032039642334,
        0.07270275056362152,
        -0.03848756104707718,
        -0.08417971432209015,
        -0.027125298976898193,
        -0.05932643264532089,
        0.039162926375865936,
        -0.0656319111585617,
        0.008361994288861752,
        -0.04995483160018921,
        -0.06797906011343002,
        0.03022327646613121,
        -0.0781819075345993,
        -0.072417713701725,
        -0.08685801923274994,
        -0.0801091194152832,
        -0.08395911008119583,
        -0.0357058085501194,
        0.009348787367343903,
        0.04152936488389969,
        -0.016129853203892708,
        0.023821480572223663,
        -0.01860278844833374,
        0.10662270337343216,
        0.022194623947143555,
        0.009216830134391785,
        -0.06699816137552261,
        0.062331970781087875,
        0.008349134586751461,
        -0.004108585882931948,
        -0.05648857727646828,
        -0.041041940450668335,
        -0.10644460469484329,
        0.03847743198275566,
        -0.0429597906768322,
        0.045710913836956024,
        -0.09918619692325592,
        -0.05083846673369408,
        0.0915641039609909,
        -0.022568268701434135,
        -0.02699059620499611,
        0.03223143517971039,
        0.028725193813443184,
        -0.005526615306735039,
        -0.06298141181468964,
        -0.04830131307244301,
        -0.01697416789829731,
        0.10811091214418411,
        0.08005987852811813,
        -0.05226631090044975,
        -0.012459945864975452,
        0.0464860200881958,
        -0.026960548013448715,
        0.06489486247301102,
        0.03600336238741875,
        -0.0032734412234276533,
        0.051830045878887177,
        -0.01830444671213627,
        0.01419919915497303,
        -0.010449991561472416,
        -0.013847526162862778,
        -0.02630358375608921,
        0.021923087537288666,
        -0.05230230838060379,
        -0.06986669450998306,
        0.039527103304862976,
        0.05215321108698845,
        0.062098242342472076,
        0.029804546386003494,
        -0.04353873059153557,
        -0.016995660960674286,
        0.0937320813536644,
        -0.04185616225004196,
        -0.018995435908436775,
        0.09242043644189835,
        -0.05938694626092911,
        0.051897600293159485,
        0.032487377524375916,
        -0.05159352719783783,
        -0.019422825425863266,
        -0.05603176727890968,
        0.010765107348561287,
        0.09034622460603714,
        0.01728150248527527,
        -0.03885508328676224,
        -0.058174680918455124,
        -0.0321243517100811,
        -0.028198828920722008,
        0.015737880021333694,
        -0.02047799341380596,
        -0.016612662002444267,
        -0.10792602598667145,
        -0.01413074042648077,
        0.10386551171541214,
        0.02862296625971794,
        0.06058384105563164,
        0.02497016452252865,
        -0.020938465371727943,
        0.005767111666500568,
        0.06118489429354668,
        0.06588514894247055,
        -0.059548426419496536,
        3.767082868851184e-33,
        -0.020886771380901337,
        0.017467599362134933,
        0.0082688108086586,
        -0.053594980388879776,
        0.02793547883629799,
        0.00801938958466053,
        0.0012749460292980075,
        -0.032298389822244644,
        -0.029806964099407196,
        -0.01987266354262829,
        -0.0998491644859314,
        -0.0013815697748214006,
        -0.08292565494775772,
        -0.010371163487434387,
        0.09314000606536865,
        -0.06787943094968796,
        -0.006050194147974253,
        -0.005399367772042751,
        0.010746452026069164,
        0.04067568853497505,
        -0.0038455461617559195,
        0.0057438574731349945,
        0.019066061824560165,
        -0.07041764259338379,
        0.020846908912062645,
        0.04397524893283844,
        -0.01671147719025612,
        -0.02762749046087265,
        0.0644664615392685,
        0.02413623034954071,
        -0.0963853970170021,
        -0.012772266753017902,
        -0.04683413729071617,
        -0.07582513988018036,
        -0.07207825034856796,
        -0.033223383128643036,
        -0.15310367941856384,
        -0.09976299852132797,
        -0.0009551958064548671,
        -0.020211150869727135,
        -0.05457216501235962,
        0.07394129782915115,
        -0.0586235374212265,
        -0.031177515164017677,
        0.01255502738058567,
        -0.02577420324087143,
        0.031195128336548805,
        0.0372043251991272,
        -0.007704692892730236,
        0.012214324437081814,
        -0.09295585006475449,
        0.03788655623793602,
        0.004226711578667164,
        -0.041116755455732346,
        0.0192684568464756,
        -0.03505641967058182,
        0.050764936953783035,
        -0.015154361724853516,
        0.041292160749435425,
        0.04180818796157837,
        -0.012862700037658215,
        -0.004324083682149649,
        0.0315694659948349,
        -0.05955027416348457,
        -0.029287206009030342,
        0.026217207312583923,
        0.05387067422270775,
        0.018103286623954773,
        -0.12708038091659546,
        0.028677459806203842,
        0.0018302415264770389,
        -0.028381451964378357,
        0.05873974412679672,
        -0.0027746742125600576,
        -0.008169096894562244,
        0.04946945980191231,
        -0.013450438156723976,
        -0.029257116839289665,
        -0.023615432903170586,
        -0.02484779804944992,
        -0.03826591372489929,
        0.04980276897549629,
        0.008266414515674114,
        0.04511301591992378,
        0.015511536970734596,
        0.06068454310297966,
        -0.025040550157427788,
        -0.06017894297838211,
        -0.03574607893824577,
        0.0003306663129478693,
        0.01423246506601572,
        0.045097433030605316,
        -0.026039717718958855,
        0.05447166785597801,
        -0.03642483800649643,
        -5.336994879966704e-33,
        -0.05658843740820885,
        -0.02868984267115593,
        -0.039740245789289474,
        0.04111742228269577,
        0.041084107011556625,
        0.05106206610798836,
        0.02082362025976181,
        0.016597256064414978,
        -0.01737082563340664,
        -0.08539701998233795,
        -0.0289424080401659,
        0.10673296451568604,
        0.011899078264832497,
        -0.018302710726857185,
        0.037539396435022354,
        -0.028193945065140724,
        0.031258899718523026,
        -0.03075264021754265,
        0.03914434090256691,
        -0.0905408263206482,
        -0.02645110711455345,
        0.0195756945759058,
        -0.005020899698138237,
        -0.010473476722836494,
        0.029657438397407532,
        -0.0037260763347148895,
        0.01292367558926344,
        0.06332121044397354,
        0.00033284982782788575,
        0.04469582065939903,
        0.06552707403898239,
        -0.04831075668334961,
        0.0029591131024062634,
        0.035188302397727966,
        0.14865463972091675,
        -0.051717061549425125,
        0.08009076863527298,
        0.04167547449469566,
        -0.03004385344684124,
        0.02327086217701435,
        0.09850410372018814,
        0.009214318357408047,
        -0.04646820202469826,
        -0.0006950353272259235,
        0.10025931149721146,
        -0.01597573421895504,
        -0.0582544207572937,
        -0.03261416777968407,
        0.04781747981905937,
        -0.027983251959085464,
        0.004641745705157518,
        -0.049557723104953766,
        0.03250065818428993,
        -0.05840534344315529,
        -0.014784668572247028,
        -0.029168684035539627,
        -0.040926244109869,
        0.0868866890668869,
        0.06314535439014435,
        -0.021299902349710464,
        0.008848762139678001,
        0.012767009437084198,
        -0.010357114486396313,
        0.02564942091703415,
        -0.010471773333847523,
        -0.0036353482864797115,
        0.02362547442317009,
        0.07943475246429443,
        0.02249329164624214,
        -0.0373840294778347,
        0.012136816047132015,
        -0.029011690989136696,
        -0.050321999937295914,
        -0.01732812263071537,
        0.0021956362761557102,
        0.004608841147273779,
        0.09816008806228638,
        -0.013818128034472466,
        -0.0464068166911602,
        0.008177478797733784,
        -0.046138230711221695,
        0.068919837474823,
        0.03224771097302437,
        -0.011452308855950832,
        0.0176315326243639,
        0.030493639409542084,
        0.10316021740436554,
        -0.03059898316860199,
        -0.03216947615146637,
        -0.029356421902775764,
        -0.0017425152473151684,
        0.017967423424124718,
        -0.041113708168268204,
        0.053937431424856186,
        0.010557732544839382,
        -5.479686748799395e-08,
        0.02103210613131523,
        -0.030202390626072884,
        0.05408380925655365,
        0.02329571172595024,
        -0.02481505647301674,
        -0.06463545560836792,
        0.08920852094888687,
        -0.06385626643896103,
        0.04421840235590935,
        0.0398690328001976,
        0.09926179051399231,
        -0.09515994787216187,
        0.020207546651363373,
        -0.04847298935055733,
        0.030681999400258064,
        0.10429605096578598,
        0.03775147721171379,
        0.09878093004226685,
        -0.08474446088075638,
        -0.016810337081551552,
        0.04468951374292374,
        0.01405297126621008,
        0.06225081905722618,
        -0.006630708463490009,
        0.003541603684425354,
        -0.03915546089410782,
        0.019394446164369583,
        0.06361518055200577,
        0.05909031629562378,
        -0.06419085711240768,
        -0.1301870048046112,
        0.0010443953797221184,
        0.021970538422465324,
        -0.02801152877509594,
        0.038237497210502625,
        -0.09296593070030212,
        -0.02520562894642353,
        0.05825383961200714,
        0.1197991743683815,
        0.06365621834993362,
        -0.07925567030906677,
        -0.05801614746451378,
        -0.03836579620838165,
        -0.014269813895225525,
        -0.00987617950886488,
        -0.017788948491215706,
        -0.034139201045036316,
        -0.009125673212110996,
        0.03164497762918472,
        0.07587301731109619,
        0.04408397525548935,
        0.020332733169198036,
        0.05760052800178528,
        -0.0023210826329886913,
        0.05349798500537872,
        0.0019348066998645663,
        -0.02967507392168045,
        0.03332614526152611,
        0.01132935844361782,
        0.04140659421682358,
        0.11135812848806381,
        -0.14932161569595337,
        0.0030961621087044477,
        0.09186676889657974
    ]
}