{
    "id": "BfN8SmbRzPg",
    "title": "My Dirtiest Macintosh - Macintosh IIvx (But Does it Work?) - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2019-11-21T20:59:10Z",
    "video_url": "https://www.youtube.com/watch?v=BfN8SmbRzPg",
    "category": "Science & Technology",
    "tags": [
        "My Dirtiest Macintosh - Macintosh IIvx (But Does it Work?) - Krazy Ken's Tech Misadventures",
        "Macintosh IIvx",
        "Macintosh II",
        "Apple",
        "Vintage Mac",
        "Old Apple Computer",
        "Mac OS",
        "Mac OS 7.6",
        "System 7",
        "Macintosh TV",
        "Mystic Board",
        "Vintage Macintosh",
        "Vintage Computer",
        "iFixit",
        "Hard Drive Swap",
        "SCSI",
        "PRAM Battery",
        "Mac",
        "Macintosh",
        "Old Computer",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Computer",
        "Comedy",
        "Tech",
        "Funny",
        "Computer Clan"
    ],
    "views": 94544,
    "likes": 2277,
    "comments_count": 396,
    "description": "The Macintosh IIvx was Apple's last Macintosh II model, and it was the first Mac with a built-in CD-ROM drive. Krazy Ken recently acquired one, but when he opens it up, things go from bad to worse  Special thanks to Linode for sponsoring this video! Fulfill your cloud computing needs, and sign up now (plus save $20 with my code: COMPCLAN20)    Support the show and get in the credits   Subscribe for more tech videos!   See the Macintosh TV in action   Look at the first Adobe Premiere (1.0)!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures - My Dirtiest Macintosh - Macintosh IIvx (But Does it Work?)  Pledge on Patreon now to get your name in the show credits and gain access to Krazy Ken's VIP Discord channel!*   Thanks Greg for donating the iFixit kit! Check out Hrutkay Mods here:   Thanks, Steve, for selling me the Multiple Scan display, and for donating so much more! Check out his eBay store here:   Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?    Amazon links are powered by the Amazon Associates Program.  *not all Patreon tiers qualify for all rewards  #KrazyKen #ComputerClan",
    "description_links": [
        "http://linode.com/computerclan",
        "http://Patreon.com/KrazyKen",
        "http://subscribe.thecomputerclan.com",
        "http://bit.ly/clan2Cpm0yG",
        "http://bit.ly/clan2K7Hpyx",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://Patreon.com/KrazyKen",
        "http://bit.ly/clan2WxsUNc",
        "http://bit.ly/clan2k4UEHY",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- [Krazy Ken Voiceover] This episode of Krazy Ken's Tech Misadventures is sponsored by Linode. Hey guys, how you all doing? Really, that's just great. You know, I'm doing pretty great today too because we have a Macintosh IIvx in the layer today. The first Macintosh with a built-in CD-ROM drive. We're gonna take a look at the physical condition, the hardware on the inside and we're gonna see if we can get an operating system installed on it. Let's go. (dramatic music) We'll probably be fine. (slow sonar beeping) (keyboard clacking loudly) (upbeat music) So the Macintosh II line lasted for several years. You had the Macintosh IIvx, the IIfx, the IIci and all these great things. The vx was the last Macintosh II and again, the first Macintosh with a built-in CD-ROM drive. So in terms of an operating system, I'm guessing we'll need to install one, this thing can run up to 7.6.1. We have a nice copy of 7.6 right here, so we'll try that out. And we have a caddy so we can do that. So condition wise it looks okay. There is some rust on here, we'll take a closer look at that real soon, but yeah, everything else looks good to go. So let's dive in. Okay, that's just freaking gross. I don't wanna even think about the other alien fetuses living inside of this thing. There is also a lot of rust here. Yeah, that just fell out. It looks like at one time this was in a very wet environment because there's rust everywhere. Do I dare check the bottom? Oh (beep). Oh, yeah. Oh, yeah. There's a lot of crap under there. Well, at least the back looks okay. We have the DB15 for the monitor, we have SCSI, we have printer and modem serial ports, Apple desktop bus, ADB and audio in and out. And it looks like we have more slots. Let's take a look at the front. We have a floppy disk drive and there's the CD-ROM drive with the QuickTime logo, I guess just indicating, \"Hey, you can play QuickTime multimedia on here,\" and it is Photo CD compatible, and it looks like it is two times speed. And on the other side, built-in speaker along with the reset and interrupt buttons. Okay, so now let's pop this thing open. I'm guessing our target is this little screw in here. All right, going around back, here we go. Oh, yeah, that's it. I probably just destroyed it all. Oh, oh. This is just, yeah, it's been wet. The guy said it still turns on. I sure freaking hope so! That rust is a little far gone. I don't think CLR is gonna be able to just touch that up. An interesting thing over here is the Apple logo like etched, or whatever process that is, into the metal. All right, let's look at the board. All the RAM slots are full. PRAM battery, should probably replace that soon. Yeah, there's definitely some gunk going around here, probably some corrosion on the capacitors there. Some of them look a little more bulgy than others. Yeah, definitely not the cleanest board I saw but it's worth a shot. At least there's a hard drive in here so we can actually throw an OS on here. Let's hook this monitor up. Power for the IIvx. I'm just gonna hide down here for a sec to reach the outlet. Should be plugged in. Yeah, it don't wanna turn on. Try it again. No dice. When I looked on the inside of this thing, and especially at the rust, I was like, \"Hmm, I'm not sure if this is gonna work.\" Well that really does suck. I was excited to boot one of these up. That button's not turning it on though. I wonder if I need a keyboard. That button should work though. The key word is should. And... no, that sucks. Yeah, this one might be dead. I swear the owner said it was working but maybe I'll have to get in touch with them again. I don't know, maybe it needs a new PRAM battery. Okay, so I just remembered I've had similar issues like this before with my IIci and sometimes you just gotta just leave them plugged in for a while. The same thing happened with my Color Classic. So I'm gonna plug it in and try again in five to 10 minutes. If that doesn't work then we need to dive deeper, let's look at the power supply, maybe something's wrong in there. Cool? So I set the power button on the back into the vertical position and now the button stays in. I don't know what exactly that does, I need to look it up, but I've seen it before. You know what? I know the Mad Cat guys know this stuff better than I do. I'm gonna check with them right now, live in the tech video log. Hang on. These guys are smarter than me. Okay, I just sent Steve a message because he'll probably be able to answer me quicker than I can figure it out on Google. Okay, so he said the on off button can be locked in the on position so the computer will automatically turn back on after a power outage. That makes sense. So in other words, doesn't do a load of shIItake mushrooms for this situation. The computer is screwed, it really is. So let's maybe take a closer look on the inside and see what we can find, but first we're gonna try one more time. No. Okay, yeah, I'm looking at the gunk and filth inside this power supply, I have doubts this thing ever powered on when the seller tested it. I don't wanna accuse them of anything, absolutely not, he was a really nice guy. Look at all the gunk on that capacitor, holy... Let's get another light in here and see what we can find. Holy... I feel like I'm underwater examining a ship wreck or something. You've gotta be (beep) me? There's no way that can turn on. That is probably one of the most filthy power supplies I've ever seen. I'm sure some of you have seen worse, and I'm open to hearing your horror stories, but holy crap. Kinda cool though. You know, this is not a shipwreck. This is like Pompeii. It's kinda like I'm looking at power supply Pompeii right here. Corrosion and dust and rust. This is gnarly. I'm usually a little more selective so in my collection I usually don't get stuff like this but I found this for a cheap price and now I think I know why it was so cheap. The contacts for the battery, those aren't looking any better. These capacitors probably effed some stuffed up at one time too. I don't even know what's going on there with that green stuff, oh boy. Oh. Oh my gosh. Right when I started to record this soundbite the seller replied to me. We're in a chat right now and he said there was no flood or anything it was just on a damp floor for years, I guess. But man, that's a lot of rust still. He's doing some digging. I'll do some more digging, too. He suggested leave it plugged in and see if it charges up because sometimes that happens with capacitors and I can try that again. I did it for a little while, maybe not long enough. We'll see if it happens. But he did say he tested it right before he sold it to me, or like right before he made the listing, so it worked recently even with all that crap in there apparently it still worked recently. Which I'm surprised about, but I trust him. I'm learning as I go here. This is a weird one. (clock ticking rapidly) Okay, so no joke, I'm in my sleeping quarters, I go to the loo and I hear something running. It's this fricking Mac! I just left it plugged in overnight and now it's on. I don't know how long it's been on for but it's on. Hopefully I can turn it off and actually turn it back on later. Let's try it. Actually I don't know if I can turn it off from here. Yeah, I don't know how to actually shut it down aside from pulling the power and I kinda don't wanna do that, but at least it's turning on now. That's half the battle. All right, let's see if the reset button works. (computer dings quietly) All right. And we can confirm the speaker works now, too. (computer chimes softly) And we know the death chimes work. Perfecto! Okay, well let's see if we can get this thing working with an operating system. Sweet! Now that the system is up and running again let's try to get Mac OS 7.6 installed. I did do a little bit of testing with it and it just turns on by itself, I don't even have to press the power button, if it's unplugged for too long I have to leave it plugged in for about an hour before it starts doing something again. Well that's a start. I was expecting a blinking question mark but at least we have some kind of signal. Let's restart it. (computer dings quietly) We have a mouse cursor and there's the blinking question mark, perfect. So, oh boy. Let's throw this in there. Moment of truth. Let's see what happens. Hey, Happy Mac face! That's a start! (computer chimes softly) And it's spit it right back out and rebooted. Okay. Let's try that again. (computer chimes softly) Hey, hey! Welcome to Mac OS. I am one happy son of a bee sting right now. Finally, we're getting somewhere. Krazy Ken curse, I know you were rough on me today but I hope I just didn't jinx it by saying, \"Hey, we're getting somewhere!\" Hopefully it actually does something. Awesome. Check out that CD pattern. Okay. I can rest easy now. Thank you IIvx. You're rusty and dirty, probably the rustiest and dustiest Mac I've ever purchased, but I'm surprised you're still working. Okay, so I hear the CD working, it's doing something, but the progress bar isn't moving. So hopefully it's still working. Since it needs some time, I'm just gonna take this break to talk about some other cool computer stuff. Linode. (triumphant electronic fanfare) Hey, Linode provides virtual servers that make it easy and affordable to host your own app, sites, servers, or whatever the heck you want, in the cloud. Whether you're a Linux junkie, not like me, or just want to tinker with code you can use Linode for either of those. It's a do it yourself solution if you like to get into the nitty gritty of hosting your own professional servers. But if you want easy, which pretty much I would do, there's plenty of one-click apps to deploy WordPress, a personal VPN, heck, even Minecraft! We used to play Minecraft on this channel way back when. It's fast, all in one and easy to configure cloud computing. So whether you're hosting you're own website, an app, a coding project, or you just need a place to keep something cool live on the internet, Linode is here for you. Oh, and because you're here and because we're all best friends, I'm gonna give you $20 free on your new account. Just use my code COMPCLAN20. Or if you don't like typing in codes, click the link in the description. You'll be glad you did. All right, let's check in on Mac OS 7.6. Unfortunately, it doesn't seem like it's doing anything now. It shouldn't take this long. Try a reboot? Third time's the charm? (computer chimes softly) Now it's frozen at the happy Mac stage. Well, maybe we should crash it just for fun. Oh. Whoa. That was, I didn't do that. Okay, well you clearly don't like this disk. (computer chimes softly) I mean, if we're gonna fail we might as well fail with style, right? Have some fun with the death chime. (computer chimes repeatedly) I have another CD I can try. It's made for the Performa though, so I don't know if it's gonna work on a IIvx but we can try. Okay, well we're getting a little bit further this time. I also do have an Apple CD 300 which is an external CD-ROM drive that works with SCSI. If the CD-ROM drive is having problems in here hopefully an external drive will help, but who's to say that's even the issue? This thing just may not like the software disk even though it is well within the range of compatibility for the system. Let's see if we can reboot it (computer chimes softly) and eject. Usually clicking the mouse and holding down ejects. It aint doing jack. That's how I feel inside right now. According to this, the mouse button is just for the floppy disk. Unfortunately we're working with a CD, so let's see. Well, we can always use our trusty old friend; the paperclip. Actually, I wonder if I have something in my iFixit kit that'll suffice. And of course now it's starting to boot up. It's like it wants to work, just really slowly. Gonna grab a paperclip. You know, I have used paperclips to do computer-y things way more than I've ever used them for what their actual purpose is. But hey, we don't care about what something is designed to do. We care about what something can do. Okay, that did nothing. I thought it would just come right out, but nope. Oh (beep). There we go. I don't know if that was because I was pressing the button or if it was just because it finally gave up. Let's just amuse ourselves and do a little bit of a process of elimination and try the Performa CD. Even though frankly I think it's gonna do nothing at this stage. All right, work your magic. Okay. Welcome to Macintosh. And the system file on the startup device does not contain the resources necessary to boot this Macintosh. What a shocker. My other plan is to try this with an external CD-ROM drive. Maybe the CD-ROM drive is just not having it today. Again, it may not do something but this is an experimental and tinkering show. We gotta do some process of elimination. Okay, here's the weird thing. I cannot hot plug the SCSI CD-ROM drive but it's also hard to turn the computer off because it may not turn back on for an hour. So, what we're gonna do is we're gonna unplug the computer and very, very, very quickly plug in the SCSI drive so we're not sitting here for another hour. Gonna yank the power. Plug in the SCSI. Plug in the power. Turn it back on. And now initiate the CD-ROM drive. Fingers crossed. Cross everything. Every part of the body. Do it. Okay, happy Mac. Looks like it's going a little bit faster. This is around where we get stuck in the progress bar. Hey, it's moving! Guys, I think we figured it out. Maybe the CD-ROM drive was just having some mechanical issues. It's a good thing I have an external one. This thing has saved my butt countless times. Oh man. System 7. The first operating system I ever used. I have a lot of childhood nostalgia rooted in here. That is where my computing experience began. There's a hard drive in here, we saw it, we heard it, but let's take a look at, I don't remember if it's drive setup or HD SC setup. It's been a while since I've tinkered with this stuff. But let's see what we can figure out. Well that answers that question. Drive setup cannot be launched on this computer. I'm guessing we don't need it then. All right, so let's run the installer. I don't see a formatted hard drive though. And none of those drive utilities would launch on here so I'm not quite sure how we format the hard drive. It's interesting reading some of this stuff if you don't have an Apple computer because this was during the Macintosh clone era, right? I actually do have a Macintosh clone. It would be fun to do another episode on that later. This is what I'm worried about though. Destination disk. No valid disks are available. Crap, well that sucks. Maybe the hard drive is dead too. I might have a spare one lying around because I have a Power Macintosh 6100 that I think needs a new PRAM battery 'cause it's having startup issues. And I think a hard drive is still in there and maybe we can salvage it. Thanks to Jason's Macintosh Museum I was able to look up some basic instructions on how to disassemble the system. I believe there is just one screw and we should be able to get the hard drive out. Just gotta get out the power first. Then the SCSI. Okay. And there's our screw friend right there. Just a Phillips bit. Okay, that screw just went flying. Whoa, where'd you go, buddy? Come out here. There's our little guy. That was a shorter screw than I thought it was gonna be. So this should just now, look at that, lift right outta there. Piece of cake. All right, I'm gonna go look around for parts. This could take a while. I might get lost. Oh crap, I think I found one! I just have one lying here. I don't even remember what this is from! Okay, let's take it out of the sled. Hopefully this hard drive isn't dead. Wouldn't that be a surprise? I don't even know what's on here. Yeah, these iFixit toolkits, they rock, man. They're so easy to use. Thanks again Greg, for the 64 bit kit. It's got other awesome things too. Like an ESD bracelet which I probably should be wearing right now. If this was a real professional instructional video I would say use an ESD bracelet. You know what, I'm saying it right now. Just use an ESD bracelet, even though I'm not. Do as I say, don't say as I do, or some (beep). Okay. So this is the potentially dead hard drive. It is a Quantum Lightning ProDrive. At a quick glance, I didn't see the capacity on there. Doesn't really matter what the capacity is if it's dead. So now we have the potentially good hard drive. Should just line up like that. The bit got stuck. You know, I actually feel kinda like a dick because this iFixit kit was donated to me and I would be kinda stupid just to not use it to it's fullest. There we go. All set up. Thank you Greg and thank you iFixit. Okay! Even though we're already like very far along in the process, don't know if it really matters right now but we're doing it anyway just to at least look professional. I spoke too soon. Let's get that screw back in there. That's done, let's get the power back in. So let's get the case back on, boot this baby up, it might boot into an operating system but I think we should do a fresh install anyway. (loud metallic clanging) And refasten the back. (speaking in foreign language) All right, let's boot her up. Okay, I anticipate there might be some startup delay. (buttons clicking loudly) Yep, because it probably needs to juice up again. All right, so now we wait for it to juice back up. (computer chimes softly) Okay, it is juiced back up. I don't have the CD drive turned on yet, I just wanna see what the hard drive does. Sweet. Hey, check it out, the hard drive's working! This, I believe, was the installation that was on the Power Mac. Again, it's been a long time so I don't remember, but let's see if it works. Oh, hang on. I remember what this hard drive is from. This was the extra hard drive that Brian gave me when he sold me the Mac TV, because he also gave me a Mystic board and a hard drive to go with that Mystic board. That's what this hard drive is from. All right! Well, the Macintosh TV episode was a great two-parter, as well. Check it out. This is running 761. Oh wow, that's pretty lucky. That is the latest version the IIvx is compatible with. So I guess we don't need the install CD anymore. About the grouch. Yeah, I think we have that. Oh, I love trash! (chuckles) - [Ken] All right, there we go. You know what, I'm curious. Let's see if the CD-Rom drive truly was failing. Let's put a music CD in there. Well, this is the small price you pay when you don't label stuff. I'm not sure if this actually has music on it but it was in my demo stack. I think this is it. Hey. There we go. That's an old track I wrote, that was probably back in high school. (rocky electronic music) Okay, so the CD-ROM drive works enough to do music but I guess it just didn't work enough to do the operating system like we tried earlier. Let's test a little bit more of the performance of this system assuming QuickTime is on this hard drive. I think it is. And yes, I do wanna test the performance of this thing but it's also good to know exactly what specs we're dealing with. System profiler. (computer beeps loudly) I've never seen that before. \"Sorry, this version of Apple System Profiler \"does not support this model of computer,\" with our old friend the black and white beach ball. I don't know if it had a formal name. All right, well forget that idea. Let's do a real world task. Let's do some video editing. On the first version of Adobe Premiere, which I have also done a specific tech video log on and I highly recommend checking it out. I'll tell you what though, it looks pretty fricking good on a CRT. Timeline, video, audio information. This is the preview window and this is your project where you'd put your bins and footage and stuff and then you can have like transitions and stuff in here, which I don't have, I guess, in the right folder so they're not showing up right now. Let's see if we can just open a video file. That's what I meant to do, I didn't mean to open, I meant to import. I don't wanna touch those JPEG's, they're probably evil. We can only do one at a time, okay. Well then, we'll just do that one. And can we just drag it in here? It's been a while since I've used this old Premiere. Hey, there it is! And you can set your in and out points up here. Here's the preview window. Make it a little bigger, and go ahead and play back. And there we go, there's our movie playing in Adobe Premiere 1 on a Macintosh IIvx. Oh, yes. Maybe one other game quick. - [Mario] Welcome to Mario Teaches Typing. - I'm not used to this keyboard. Okay, A. Oh, this is lagging bad. (quiet cheerful music) I'm dropping frames, man. And I'm not used to the hub keys being on D and K. Not as used to this keyboard. The sun is just basking in his glow up there. Graphics, who needs 'em? You just need to watch the letters! Well guys, we did it. This was a perfect tech video log. Stuff broke, we tinkered with it, we solved the mystery, and ultimately, happy ending. We made it work. And that is just the perfect formula for a Krazy Ken experience. That is just the spirit of the show. And along the way we troubleshooted, we had fun and we learned stuff. That right there is the Krazy Ken spirit. There's many more tech video logs for you to watch. It's a very binge-able show. Check 'em out. At this point there's over 120 of 'em. Until then, thanks for sticking with me. Catch the crazy and pass it on. (upbeat electronic music)",
    "transcript_keywords": [
        "CDROM drive",
        "hard drive",
        "drive",
        "Macintosh",
        "hard",
        "CDROM",
        "back",
        "Misadventures is sponsored",
        "Power",
        "Ken Tech Misadventures",
        "yeah",
        "builtin CDROM drive",
        "SCSI CDROM drive",
        "Mac",
        "system",
        "thing",
        "external CDROM drive",
        "CDROM drive works",
        "Hey",
        "Tech Misadventures"
    ],
    "transcript_entity_values": [
        "JPEG",
        "WordPress",
        "IIci",
        "VPN",
        "half",
        "another hour",
        "Third",
        "Mystic",
        "overnight",
        "years",
        "Macintosh II",
        "761",
        "7",
        "Apple System Profiler",
        "two",
        "Apple",
        "Jason",
        "Adobe Premiere",
        "Mario Teaches",
        "Mac",
        "about an hour",
        "Macintosh",
        "Phillips",
        "CLR",
        "Tech Misadventures",
        "PRAM",
        "today",
        "Mac",
        "Krazy Ken",
        "Krazy Ken's",
        "7.6.1",
        "300",
        "IIvx",
        "Minecraft",
        "K.",
        "five to 10 minutes",
        "Google",
        "jack",
        "white beach",
        "Brian",
        "Adobe Premiere 1",
        "first",
        "one",
        "SCSI",
        "RAM",
        "iFixit",
        "Pompeii",
        "7.6",
        "dustiest Mac",
        "Performa",
        "Performa",
        "Macintosh Museum",
        "Greg",
        "ESD",
        "the Power Mac",
        "Mac TV",
        "Timeline",
        "64",
        "Perfecto",
        "an hour",
        "Minecraft",
        "over 120",
        "Linux",
        "Linode",
        "Linode",
        "20",
        "sec",
        "several years",
        "Steve"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "PERSON",
        "TIME",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "WORK_OF_ART",
        "PERSON",
        "TIME",
        "ORG",
        "PERSON",
        "GPE",
        "PERSON",
        "FAC",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "TIME",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "DATE",
        "PERSON"
    ],
    "vector": [
        -0.10191541165113449,
        -0.09742764383554459,
        0.10243215411901474,
        -0.10161738097667694,
        0.04267684370279312,
        -0.015276805497705936,
        -0.011618605814874172,
        -0.007841586135327816,
        -0.02267017774283886,
        0.017160825431346893,
        0.05358241870999336,
        0.01257369015365839,
        -0.03107060119509697,
        -0.0013673518551513553,
        -0.00518993753939867,
        -0.03408164903521538,
        0.09073831140995026,
        -0.052760157734155655,
        -0.014293879270553589,
        0.04038330912590027,
        0.02650785818696022,
        -0.04968150332570076,
        0.003704286413267255,
        -0.04817790165543556,
        0.004790530074387789,
        0.0032733012922108173,
        0.019242430105805397,
        0.05587172135710716,
        -0.02279377356171608,
        -0.05404839664697647,
        -0.03428701311349869,
        -0.005598072893917561,
        0.04181668162345886,
        -0.010387260466814041,
        0.09051096439361572,
        -0.11504023522138596,
        0.06759263575077057,
        -0.04794829711318016,
        -0.14597205817699432,
        -0.03814534470438957,
        -0.05322685465216637,
        0.010205074213445187,
        0.01746739260852337,
        0.09966084361076355,
        0.00826284196227789,
        -0.06871838122606277,
        0.06507428735494614,
        -0.08033812046051025,
        0.049450941383838654,
        0.019191531464457512,
        -0.058503616601228714,
        -0.02709607221186161,
        0.0870814323425293,
        0.02708829939365387,
        0.02039560303092003,
        0.034107085317373276,
        -0.0047681815922260284,
        0.016771534457802773,
        0.04215482249855995,
        0.015365734696388245,
        0.05129024013876915,
        -0.09377241879701614,
        -0.013534839265048504,
        0.035754479467868805,
        0.00912219937890768,
        -0.02148350328207016,
        0.013525658287107944,
        -0.008940252475440502,
        -0.03216736763715744,
        -0.10563450306653976,
        -0.017690520733594894,
        -0.0036883961874991655,
        -0.014687014743685722,
        0.12133818864822388,
        0.00732264993712306,
        -0.053106505423784256,
        0.04232503101229668,
        -0.08142876625061035,
        0.013742436654865742,
        -0.04502929747104645,
        -0.018099043518304825,
        -0.0024530221708118916,
        -0.050158169120550156,
        -0.016287656500935555,
        -0.018188804388046265,
        0.01186089776456356,
        -0.02402660809457302,
        -0.044621653854846954,
        0.03250554949045181,
        0.05395088344812393,
        0.005245963577181101,
        0.046542562544345856,
        0.1096329540014267,
        -0.04181578382849693,
        0.03184913843870163,
        -0.03836313262581825,
        0.0653124749660492,
        -0.018382616341114044,
        -0.018535740673542023,
        0.08058031648397446,
        -0.03927238658070564,
        -0.009033755399286747,
        -0.00471873814240098,
        -0.08437267690896988,
        0.04627729579806328,
        -0.04935489594936371,
        0.04532064124941826,
        0.017564527690410614,
        0.046198297291994095,
        0.036313753575086594,
        0.04818671941757202,
        0.004849292803555727,
        -0.04244624078273773,
        0.03784394636750221,
        0.04580710455775261,
        0.04896831139922142,
        0.012336473912000656,
        0.08675737679004669,
        0.042758386582136154,
        -0.07614568620920181,
        0.05096011981368065,
        -0.057836681604385376,
        -0.025840383023023605,
        -0.0010642935521900654,
        0.04129272326827049,
        -0.03646600991487503,
        0.026943013072013855,
        4.6738320277686335e-33,
        -0.09516695141792297,
        0.013714149594306946,
        -0.06275200843811035,
        0.021418001502752304,
        -0.002386894077062607,
        -0.07932741194963455,
        0.036187849938869476,
        0.060618333518505096,
        -0.13723011314868927,
        0.0483451746404171,
        -0.017798492684960365,
        -0.026806751266121864,
        -0.07613259553909302,
        0.042639411985874176,
        -0.03192709758877754,
        -0.05259694531559944,
        -0.08506602793931961,
        -0.027714280411601067,
        -0.004040488041937351,
        0.05416150391101837,
        0.14551964402198792,
        0.00025866072974167764,
        0.03549397736787796,
        -0.10373610258102417,
        -0.03079657442867756,
        -0.03660464286804199,
        -0.02274298295378685,
        -0.04373955354094505,
        0.16466403007507324,
        0.012524351477622986,
        -0.0869625136256218,
        -0.008549638092517853,
        0.03351273760199547,
        -0.06541057676076889,
        0.0013907966203987598,
        -0.015055704861879349,
        -0.05475889518857002,
        -0.1039671003818512,
        0.033137354999780655,
        0.05319757014513016,
        -0.04116884246468544,
        -0.011763321235775948,
        -0.06331175565719604,
        -0.04507376253604889,
        -0.01289959717541933,
        -0.07070110738277435,
        0.09206128865480423,
        -0.005642273463308811,
        0.032022591680288315,
        0.057686805725097656,
        -0.049973923712968826,
        0.027065647765994072,
        0.05872552841901779,
        0.01730463095009327,
        -0.04699203372001648,
        0.07480672746896744,
        0.061036910861730576,
        -0.029364997521042824,
        0.037347741425037384,
        0.049792297184467316,
        0.027872370555996895,
        0.009162310510873795,
        0.028431784361600876,
        -0.036575715988874435,
        -0.07162799686193466,
        -0.0007527134148404002,
        0.06738556176424026,
        0.019745437428355217,
        -0.003043405944481492,
        0.09741079807281494,
        -0.042586199939250946,
        0.022111359983682632,
        -0.005410103593021631,
        -0.1163603886961937,
        0.05770120024681091,
        -0.03507112339138985,
        -0.13612398505210876,
        0.03541312739253044,
        -0.059468530118465424,
        0.03235698491334915,
        0.005423616152256727,
        -0.02273845300078392,
        -0.04149157926440239,
        0.11923719197511673,
        0.03629591688513756,
        0.12509240210056305,
        0.024982726201415062,
        0.061031315475702286,
        0.0051293764263391495,
        0.005275490693747997,
        0.06501741707324982,
        -0.016774417832493782,
        0.014631937257945538,
        0.005918292328715324,
        0.0014245194615796208,
        -4.549164607050191e-33,
        0.03406259045004845,
        -0.03284390643239021,
        -0.04373534023761749,
        -0.0039035684894770384,
        -0.054174039512872696,
        0.006504716817289591,
        -0.009955354034900665,
        0.01826390251517296,
        -0.07458237558603287,
        -0.05180356651544571,
        0.08345059305429459,
        0.049355365335941315,
        -0.07018373906612396,
        -0.04422322288155556,
        0.015309038572013378,
        0.005747649818658829,
        -0.00015849417832214385,
        0.021535532549023628,
        -0.010018090717494488,
        -0.09271630644798279,
        0.03457169979810715,
        0.008183121681213379,
        -0.02982553467154503,
        -0.015138068236410618,
        0.033244527876377106,
        -0.05077362060546875,
        0.09288976341485977,
        0.12114197760820389,
        0.049144528806209564,
        0.009153173305094242,
        0.030061904340982437,
        0.055409859865903854,
        -0.04355759546160698,
        -0.05473068356513977,
        0.07637717574834824,
        0.050807319581508636,
        0.010225804522633553,
        -0.01931612752377987,
        -0.09969202429056168,
        -0.021038416773080826,
        0.024687327444553375,
        -0.017209719866514206,
        -0.08961354196071625,
        -0.009306799620389938,
        -0.052511993795633316,
        0.03614071011543274,
        -0.03501483425498009,
        0.0356217622756958,
        0.01983434334397316,
        -0.011170816607773304,
        0.03931976854801178,
        -0.022280825302004814,
        0.0065064397640526295,
        0.018847303465008736,
        0.01050424575805664,
        -0.016401709988713264,
        -0.02076050639152527,
        0.08838620036840439,
        0.0037045239005237818,
        0.02593146823346615,
        -0.04084422066807747,
        -0.005842955317348242,
        -0.002299981191754341,
        -0.06386763602495193,
        0.0632101446390152,
        -0.027129461988806725,
        0.006766193546354771,
        0.05969126895070076,
        -0.01545258704572916,
        0.04564695805311203,
        -0.024498773738741875,
        0.02404831163585186,
        0.07843198627233505,
        -0.13393355906009674,
        0.009859191253781319,
        0.01859935186803341,
        0.03766462206840515,
        0.0036604886408895254,
        -0.018179265782237053,
        0.021093420684337616,
        -0.010980500839650631,
        0.03144565597176552,
        0.039109550416469574,
        0.05630842223763466,
        0.05961620807647705,
        0.04371291771531105,
        0.03983452543616295,
        0.028590764850378036,
        -0.030563319101929665,
        0.024776458740234375,
        -0.06215896084904671,
        -0.00222415616735816,
        0.0067751724272966385,
        0.024300463497638702,
        -0.039273716509342194,
        -4.871229819514156e-08,
        -0.06505095958709717,
        0.018814215436577797,
        -0.019174283370375633,
        0.02301631309092045,
        0.028705788776278496,
        -0.023038441315293312,
        -0.012948790565133095,
        -0.005481947213411331,
        -0.008093951269984245,
        0.013511785306036472,
        0.012716513127088547,
        -0.05801929160952568,
        -0.02144555374979973,
        0.009642111137509346,
        0.02616892196238041,
        0.04156862944364548,
        -0.022604843601584435,
        0.11192025244235992,
        -0.03144845739006996,
        -0.08305209130048752,
        -0.055659446865320206,
        -0.013812589459121227,
        -0.01060146652162075,
        -0.011598649434745312,
        -0.03551929444074631,
        0.07111583650112152,
        -0.018258053809404373,
        0.03137101233005524,
        0.04711794853210449,
        -0.06277573853731155,
        -0.09712252765893936,
        0.00234210561029613,
        -0.07653957605361938,
        -0.02171887829899788,
        0.02872995100915432,
        -0.03996903449296951,
        -0.0586305633187294,
        0.10580635815858841,
        0.05269075930118561,
        -0.0316399484872818,
        0.0020094425417482853,
        -0.06645051389932632,
        -0.0026991486083716154,
        -0.01582222618162632,
        -0.0270374808460474,
        0.08117411285638809,
        -0.07008786499500275,
        -0.02189183235168457,
        0.036797963082790375,
        -0.034595418721437454,
        0.0741351842880249,
        -0.017831217497587204,
        -0.026931675150990486,
        0.0810500904917717,
        0.039451487362384796,
        0.015093374066054821,
        0.02963399700820446,
        -0.02614988200366497,
        -0.008900509215891361,
        0.12867848575115204,
        0.1074032187461853,
        -0.03096454031765461,
        -0.006181786768138409,
        0.01290941797196865
    ]
}