{
    "id": "bGpKCFIVYZg",
    "title": "Can you configure networks with a phone? Includes FREE courses // Aruba switch initial setup",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2021-09-08T14:54:58Z",
    "video_url": "https://www.youtube.com/watch?v=bGpKCFIVYZg",
    "category": "Science & Technology",
    "tags": [
        "aruba",
        "aruba networks router setup",
        "aruba networks training",
        "aruba networks youtube",
        "aruba networks router how to connect",
        "aruba 6300M",
        "aruba 6300m",
        "aruba 6300m stacking",
        "aruba 8300",
        "hp",
        "hpe",
        "100gbe",
        "100g ethernet",
        "ethernet",
        "network switch",
        "networking",
        "aruba networks",
        "aruba 8360",
        "aruba networking",
        "ethernet switch",
        "arubaos-cx",
        "switch",
        "abc networking",
        "aruba switches",
        "hpe switches",
        "hp switches",
        "aruba switches configuration",
        "aruba switches review",
        "aruba switches firmware"
    ],
    "views": 36075,
    "likes": 1581,
    "comments_count": 163,
    "description": "Can you configure a switch using just your phone? It's now possible and actually easy. Free training - use links below!  Big thanks to Aruba Networks for sponsoring this video!  Menu: 0:00  Welcome 0:15  Unboxing 0:35  Aruba 6300M hardware 1:10  Non Aruba SFPs 1:28  50G Links 1:50  Console port 2:12  Bluetooth configuration 2:37  Out of band management port 2:52  iPhone app 3:30  Switch initial configuration 4:10  Standalone configuration 6:15  Deploy configuration 6:35  Configure device using a browser 7:16  View interface information 8:15  Modify config via app 9:13  SSH to switch 9:55  Access console from phone 10:50  Use Putty to configure switch 11:16  Download and use Putty 12:26  Lots of options to use to configure switch  Previous videos:   ========================= Free Aruba courses on Udemy: ========================= Security:  WiFi:  Networking:   ================================== Free Aruba courses on davidbombal.com ================================== Security:  WiFi:  Networking:   ====================== Aruba discounted courses: ====================== View Aruba CX Switching training options here:   To register with the 50% off discount enter DaBomb50 in the discount field at checkout.   The following terms & conditions apply: 50% off promo ends 10/31/21 Enter discount code at checkout, credit card payments only (PayPal) Cannot be combined with any other discount. Discount is for training with Aruba Education Services only and is not applicable with training partners.  ================ Connect with me: ================ Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:     aruba aruba-cx aruba cx aruba app aruba-cx app aruba iphone aruba android aruba 8360 aruba 6300 aruba networks aruba networking abc networking aruba 6300m aruba instant one hpe hp hpe networking aruba mobility aruba security training free aruba training clearpass clearpass training hpe training free aruba clearpass training aruba networking  aruba networks abc networking  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #arubanetworks #aruba #arubacx",
    "description_links": [
        "https://davidbombal.wiki/arubanetworks",
        "https://davidbombal.wiki/arubasecurity",
        "https://davidbombal.wiki/arubamobility",
        "https://davidbombal.wiki/freearubacourse",
        "https://davidbombal.wiki/dbarubasecurity",
        "https://davidbombal.wiki/dbarubamobility",
        "https://davidbombal.wiki/dbarubanetworking",
        "https://davidbombal.wiki/arubatraining",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal"
    ],
    "transcript": "- The video's part of my series showing you how to configure Aruba switches. I really want to thank Aruba for sponsoring this video and sending me some really interesting switches to demo. (upbeat electronic music) In a previous video, which I've linked here and below, I showed you 100 gig ethernet. I showed you that my PCs couldn't keep up with the network. 100 gig network was too fast for my PCs. Aruba sent me brand new switches so that I could show you the unboxing of the switches and initial configuration of the switches. Here, I've got two 6300M switches. Here you can see the two fan trays. They're hot swappable on the 6300M switches. And here I've got a single power supply in the switch. You can install redundant power supplies on these switches. These two switches are 48 port switches. They have 48 ports that support one gigabit, 2.5 gigabit and five gigabit ethernet. They also support Power Over Ethernet or POE. We've also got four SFP uplink ports. These support one gigabit, 10 gigabit, 25 gigabit and 50 gigabit ethernet. The Aruba switches support non-Aruba SFPs up to 10 gigabits per second. So as an example, this is a 10 gigabit copper SFP. I could plug that into the switch. Here's a fiber SFP. The Aruba switches will support these once again up to 10 gigabits per second. But you may want to use Aruba SFPs. And in that case, you can support 50 gigabits per second on one of these ports. So there's a fiber SFP, and here's an example with a DEC cable. So as an example, I could connect these two switches using the stack cable and form a stack and I'll show you how to do that in a separate video. Now, one of the things you're going to want to do is configure the switch and there're multiple ways to do that. You could use the console port. So USBC port on the switch and connect that to a PC like you would do traditionally. So you could configure the switch that way and then use PuTTY to configure the device. So that's one option. Another option that's really nice on Aruba switches is they send you a Bluetooth adapter. So you can connect that to the switch and then configure the switch using Bluetooth. And that's the method that I'd like to demonstrate in this video because a lot of network engineers are used to configuring a switch using a console port and PuTTY as an example, on Windows, but you can configure these devices using a Bluetooth app. These switches also have an outer band management port, so you could connect an ethernet cable to the switch and configure it using the outer band management port. Okay, so without further ado, I'm going to boot up the switch and I'll show you how to configure it using the Aruba CX app. Okay, so let's see if I can configure the device using my iPhone. I've already downloaded the app from the Apple App Store. I've got Bluetooth enabled on the phone. So here's the app. I need to plug in the USB adapter. Now, if you've got multiple switches, they come with these identifiers, so you can identify the switch. So this one ends in 11R, as an example. So plug that in. You can see that the Bluetooth LED has come on. Okay. So I can see my switch. I'll select the switch. I can see it's now connected. LED is flashing on the switch. So I can select the Aruba app. I'm told that I need to configure a password for the switch. So I'll set a password. Press done. Password is now configured. And the application is now connecting to the switch. You can see it's now connected. We can display an LED. So flashing, can see the LED is flashing here, or I can go for on. LED is on, or I could turn it off. That just allows me to identify the switch. Okay. So let's do an initial configuration of the device. I can configure a standalone device or a stack. I'll show you how to set up a stack of two switches in a separate video. Here, I just want to set up a single switch. You could use NetEdit to configure multiple devices, that's sort of a management application that you can use from Aruba. I'm not going to do that. So I'm going to click skip. Now you can configure the device using multiple templates. So as an example, out of band management, click on the, I can see the configuration of the device, like the host name, it'll configure various options such as the management interface. So the management interface on the switch. It'll configure the device so that you can use HTTPS to configure the device. So, as an example, I'll plug in an ethernet cable here. That ethernet cable connects to my physical network. So I'll configure the name of the switch. I'll set this to use DHCP, so that it can get an IP address from my DHCP server on my network. Click next. Now you may want to configure the device with the static IP address, but for this example, that's good enough to get us started. So we can see the device configuration. We can see the version of Aruba software. We can see the host name. We can see the admin account is configured and scrolling down, we can see that SSH has been enabled on the device in the default VRF or Virtual Routing and Forwarding instance, as well as the management VRF. So the management VRF is used for this management port, default VRF would be used for all the other ports on the switch. We can see that spanning tree is enabled, the various ports on the switch, like 1/1/1 over here is configured with the no shutdown command so it's enabled. Routing is not enabled on the port. In other words, it's going to be a layer two port, it's configured in VLAN 1. And we can see that kind of configuration for all the other ports. So all the interfaces have been configured. VLAN 1 is configured on the switch, but it hasn't got an IP address. And we can see that the HTTPS server is configured. So I could deploy my configuration now to the switch and we can see that the device is being configured. Okay. So we're told that the device IP address is 1-9-2-1-6-8-1-53. So let's test that. So on my Mac, 1-9-2-1-6-8-1-53. I'm told that the connection is not private. click advanced, and I can proceed to the device and notice there is a pre log-in banner. I'm told that I should ensure that the certificate for the device is stored and trusted. Not going to worry about that right now. I'll put in my username of \"admin\", password of \"Aruba\" and click log in and notice I can log into the switch. So it was as simple as that to configure the switch using the Aruba app. And now I can access the device using a web interface. I could click analytics to see the analytics of the switch. I can see the various interfaces. I'll just make this a bit bigger. So notice, there's my switch. I can see, as an example, that interface 1/1/1 is admin state up, but the interface is down because nothing is plugged into that port. I need to plug in a device to bring that port up. So as an example, here's a laptop. I'll connect this adapter and I'll plug in ethernet, so. I'll plug that into port one on the switch. And what you'll see now is the port is up. Speed is one gigabits per second. I can see the VLAN that the device belongs to. I can see interface information about the ports. I can configure the switch through this interface so I could configure VLANs. I could configure link aggregation, but let's go back to the app. So I'll press done. Click Modify Config, and notice here's the host name of the switch. I could simply change that through the app. I could go to the interfaces. Let's look at 1/1/1. You can see it's a non-routed interface. You can see it's an access port in VLAN 1. I could check the SSH. SSH is configured on the management VRF, as well as the default VRF. I could actually open up a console on the switch, so here I could type a command such as \"sh run\" and press send. And notice, there is the configuration of the switch. I'm configuring the switch through Bluetooth, but I could configure it through the web interface or I could SSH to the switch. So Bluetooth works well when you're near the switch, but you may want to just SSH the switch. So as an example, on my Mac, I might want to SSH to the management IP address, 1-9-2-1-6-8-1-53. Say yes to accept the public key and now I can put in my password of, let's say, Aruba and notice, \"sh run\". I can see the configuration of the switch. Now, what you may want to do is configure an IP address on VLAN 1. So here I could configure an IP address of 10-1-1-102/24, no shut that, show IP interface brief. Notice that IP address is now configured on the switch. Type the same command on the phone. And there you can see the same output. I could change this from dark mode to light mode. So as an example, what I might want to do is save the configuration. So copy run start, send the command to the switch. And as you can see, the configuration was saved. Okay, so that was a basic introduction to the app. Now, there are a whole bunch of other options that you can use on this app. So you can save configurations to devices. You can use templates, you can see various devices. There is help information here. So I think for a lot of people, the initial configuration of a device like this can be difficult. So there're quite a few options that you could use. You could just use an app like this, or if you like, you may want to use the traditional method of configuring the device using a console port. So unplug this ethernet cable, and what I'll use here is just a.. USB to USBC port and on my Windows device. And I'll just control this remotely to make it easier. What you could do is download PuTTY from the internet. So I'll simply search for PuTTY in Google, click on the first link, which is greenend.org.uk. Click download to download PuTTY and all I'm going to download is the executable. Save that to my downloads directory. Okay, file is downloaded. So I'll open it up. Click run to run the application. And now I can connect to a serial port. Right click on Windows Start, go to Device Manager, have a look at your comports. You can see here, we've got COM4. So in PuTTY, I can select COM4, speed, I'll set to 115200, serial port, click open, and that'll give me access to the switch. So I'll just make this a bit bigger. Put in my password and notice, show IP interface brief shows me that the IP address of the switch. So you could configure the device using an app. You could configure the device using a traditional mechanism like the console port. You can configure the device using a web browser, really up to you to decide which one you want to use. I think the Bluetooth app is fantastic for initial configuration, makes it a lot easier. As an example, trying to configure the VRF stuff can be confusing if you're not used to the device configuration. So if you're brand new to Aruba, the VRF stuff may be confusing, like setting up an SSH server for VRF, like the default VRF and the management VRF. That just allows you to SSH to the device using the management port, or you could SSH to the device directly through one of these ports. You also have to set up the VRF stuff for the HTTPS server. That can be confusing if you're not used to this kind of configuration. This app makes it very, very easy. Now, hopefully that'll help you if you ever need to configure an Aruba switch. Great switches, these. Really want to thank HPE once again for sponsoring this video. I'm David Bombal. I want to wish you all the very best. (upbeat electronic music)",
    "transcript_keywords": [
        "switch",
        "configure",
        "device",
        "Aruba",
        "port",
        "switches",
        "Aruba switches",
        "VRF",
        "configure the device",
        "app",
        "SSH",
        "configure Aruba switches",
        "configuration",
        "Bluetooth",
        "management",
        "management VRF",
        "configure the switch",
        "click",
        "ports",
        "interface"
    ],
    "transcript_entity_values": [
        "1-9-2-1-6-8-1-53",
        "first",
        "Bluetooth",
        "USB",
        "SSH",
        "Google",
        "the Apple App Store",
        "up to 10 gigabits",
        "50 gigabits",
        "five",
        "two",
        "2.5 gigabit",
        "four",
        "10 gigabits",
        "10-1-1-102/24",
        "VRF",
        "non-Aruba",
        "iPhone",
        "Power Over Ethernet",
        "USBC",
        "IP",
        "VLAN",
        "10 gigabit",
        "Mac",
        "1/1/1",
        "HPE",
        "POE",
        "Aruba",
        "one",
        "VLAN 1",
        "48",
        "HTTPS",
        "115200",
        "11R",
        "100",
        "NetEdit",
        "Windows",
        "DEC",
        "DHCP",
        "1",
        "25 gigabit",
        "one gigabits",
        "David Bombal",
        "Windows Start",
        "10",
        "50"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "LAW",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.015561115927994251,
        -0.07512952387332916,
        -0.012858809903264046,
        -0.10682269185781479,
        -0.0751240998506546,
        0.05858601629734039,
        -0.015217303298413754,
        0.002601422369480133,
        -0.11664211750030518,
        0.037141360342502594,
        0.0627441555261612,
        0.00764532620087266,
        -0.02314760535955429,
        -0.016331052407622337,
        0.03385951370000839,
        0.015946488827466965,
        0.01363553386181593,
        -0.07845577597618103,
        0.008043579757213593,
        -0.0327606275677681,
        0.09420812875032425,
        -0.003037206595763564,
        -0.02263033017516136,
        -0.056122422218322754,
        0.0357879139482975,
        -0.024899940937757492,
        0.0010608183220028877,
        0.036738213151693344,
        -0.0389908142387867,
        -0.06742154061794281,
        -0.015411758795380592,
        0.060906536877155304,
        0.0005597443087026477,
        0.0028292543720453978,
        -0.0820673257112503,
        -0.11207377910614014,
        -0.0342656672000885,
        0.02955767884850502,
        -0.0508602112531662,
        -0.009659914299845695,
        -0.0459262877702713,
        -0.01671070232987404,
        -0.0174763984978199,
        0.027871424332261086,
        0.0062372419051826,
        -0.003749133087694645,
        -0.05947994068264961,
        0.0014481317484751344,
        0.02221355214715004,
        -0.08258423954248428,
        0.006186201702803373,
        0.010097558610141277,
        0.0047416286543011665,
        -0.04071250185370445,
        -0.019724950194358826,
        0.015142019838094711,
        -0.04195914417505264,
        0.0788407251238823,
        0.08704835921525955,
        -0.0016448688693344593,
        0.019245272502303123,
        0.05652257800102234,
        -0.07203103601932526,
        0.026776021346449852,
        -0.02701912447810173,
        0.020786691457033157,
        -0.03214428573846817,
        0.05820418521761894,
        0.05124562606215477,
        -0.001399366999976337,
        -0.04596920683979988,
        -0.01598118059337139,
        0.07624729722738266,
        -0.018547341227531433,
        -0.05376403406262398,
        0.01920364797115326,
        0.07882346957921982,
        0.01986684650182724,
        -0.05306345224380493,
        -0.0032569740433245897,
        0.0419304333627224,
        -0.007218916434794664,
        0.0011298040626570582,
        0.029081834480166435,
        0.024186845868825912,
        -0.008149776607751846,
        -0.03694158419966698,
        0.05555163323879242,
        -0.019429482519626617,
        -0.1076580286026001,
        -0.06348861753940582,
        0.04205626994371414,
        -0.022346440702676773,
        -0.030728226527571678,
        0.0325317420065403,
        -0.01238388754427433,
        -0.03225294500589371,
        -0.11064740270376205,
        -0.07751983404159546,
        0.01401260681450367,
        -0.011414241977036,
        -0.014284213073551655,
        0.025011524558067322,
        -0.01365827489644289,
        0.0035954348277300596,
        -0.05728083476424217,
        0.04059276357293129,
        0.028677038848400116,
        0.08257822692394257,
        0.07048641890287399,
        -0.06650957465171814,
        0.02082652971148491,
        -0.01448140386492014,
        -0.07127813249826431,
        -0.02865823172032833,
        0.039683133363723755,
        0.017518222332000732,
        0.056550461798906326,
        0.0947914570569992,
        0.022167902439832687,
        -0.025539224967360497,
        -0.010889180935919285,
        -0.044815607368946075,
        -0.044835228472948074,
        0.0355682410299778,
        0.02255895547568798,
        0.007603528909385204,
        1.1814148750569978e-32,
        0.1198238879442215,
        0.022311851382255554,
        -0.06313955038785934,
        -0.0006455982802435756,
        0.07606822997331619,
        0.015414359048008919,
        0.0588725320994854,
        0.027508843690156937,
        -0.037085115909576416,
        -0.013141687959432602,
        0.029965346679091454,
        -0.011821468360722065,
        -0.03252045437693596,
        -0.020529892295598984,
        0.03443850576877594,
        -0.08260724693536758,
        0.02874634973704815,
        -0.037759143859148026,
        0.10751078277826309,
        -0.033497948199510574,
        -0.07645245641469955,
        -0.04623670130968094,
        0.004781430587172508,
        -0.06581297516822815,
        0.07024915516376495,
        0.048270128667354584,
        0.014529218897223473,
        -0.0464656762778759,
        0.05511724576354027,
        9.42706833484408e-07,
        0.0004965074476785958,
        0.019459569826722145,
        -0.08368433266878128,
        -0.016402117908000946,
        0.015900777652859688,
        -0.041496455669403076,
        -0.01852564886212349,
        -0.017952848225831985,
        0.015601563267409801,
        -0.011661495082080364,
        -0.052824731916189194,
        -0.06055516377091408,
        -0.038189031183719635,
        0.03355536609888077,
        -0.0075465659610927105,
        -0.03017091378569603,
        0.02184489369392395,
        -0.040198951959609985,
        -0.006095567252486944,
        0.052357908338308334,
        -0.06461751461029053,
        -0.038474295288324356,
        -0.054147809743881226,
        -0.10359523445367813,
        0.05391465872526169,
        -0.022168662399053574,
        -0.03155514970421791,
        0.0984218418598175,
        0.02300184592604637,
        0.004603958688676357,
        0.02260955423116684,
        0.04993854835629463,
        -0.022549046203494072,
        0.05078520625829697,
        -0.04032103717327118,
        -0.07253774255514145,
        -0.046026136726140976,
        -0.0583118237555027,
        0.031795475631952286,
        0.0010010087862610817,
        -0.06087091937661171,
        -0.023873895406723022,
        0.04695047810673714,
        -0.019973600283265114,
        0.02343231998383999,
        0.11114522814750671,
        -0.02590586245059967,
        -0.0012064034817740321,
        -0.04701811447739601,
        -0.03000214323401451,
        0.02289576083421707,
        0.0464683435857296,
        0.05538924038410187,
        0.049168843775987625,
        0.09620130062103271,
        -0.05459227412939072,
        0.05176423490047455,
        -0.06821046769618988,
        -0.0352962389588356,
        0.10193385183811188,
        -0.06538601964712143,
        0.01706058718264103,
        0.012432875111699104,
        0.02491742931306362,
        -0.006278014741837978,
        -1.2373493043729378e-32,
        -0.04192912578582764,
        -0.02102198451757431,
        -0.02890455164015293,
        -0.001145790214650333,
        0.07552491873502731,
        -0.02959454618394375,
        0.10084321349859238,
        0.05951046943664551,
        -0.038024965673685074,
        -0.019367650151252747,
        0.017934871837496758,
        -0.023218145594000816,
        0.013222784735262394,
        -0.07470300793647766,
        -0.07388247549533844,
        -0.031218191608786583,
        -0.05516443029046059,
        -0.03435928374528885,
        0.01332785002887249,
        0.036607760936021805,
        -0.06054677814245224,
        0.019003793597221375,
        -0.02564287558197975,
        0.02661706693470478,
        -0.04581962153315544,
        -0.017761722207069397,
        0.044040318578481674,
        0.056697990745306015,
        0.0039684646762907505,
        -0.02186126448214054,
        0.02255430445075035,
        -0.06526854634284973,
        -0.041302427649497986,
        0.027744732797145844,
        0.013940995559096336,
        0.09672878682613373,
        0.08026591688394547,
        0.1539624184370041,
        -0.06590751558542252,
        -0.005092698615044355,
        0.07522138953208923,
        -0.06602219492197037,
        -0.062160395085811615,
        -0.04058586806058884,
        0.03474586457014084,
        -0.012858488596975803,
        -0.0027261923532932997,
        0.01587800309062004,
        -0.16050808131694794,
        -0.04026278108358383,
        0.05101298168301582,
        -0.027727127075195312,
        -0.015077890828251839,
        -0.04163350537419319,
        -0.0035273528192192316,
        -0.0016510316636413336,
        0.04655615985393524,
        -0.05769041180610657,
        0.026378944516181946,
        0.05712369084358215,
        0.12226054072380066,
        -0.1308760643005371,
        -0.05165955424308777,
        0.01678663119673729,
        0.04329538717865944,
        -0.04861188679933548,
        -0.007855105213820934,
        0.02568032406270504,
        0.0011003686813637614,
        0.018705176189541817,
        -0.09719468653202057,
        -0.11727581173181534,
        0.053840272128582,
        0.0005344462697394192,
        0.04511560872197151,
        -0.07322721183300018,
        -0.012083244509994984,
        -0.022407034412026405,
        -0.007420648820698261,
        -0.0010774536058306694,
        0.012346873059868813,
        0.047802139073610306,
        -0.0018067966448143125,
        -0.010053987614810467,
        0.029346926137804985,
        0.11872320622205734,
        0.05139603465795517,
        0.0682082250714302,
        0.04016361013054848,
        -0.005505803041160107,
        -0.10871829837560654,
        0.028487179428339005,
        0.03739241883158684,
        0.04392092302441597,
        -0.04810252785682678,
        -5.416200110630598e-08,
        0.11329291760921478,
        -0.004691028967499733,
        0.05351274460554123,
        -0.004379517864435911,
        -0.0944441556930542,
        -0.006370958406478167,
        0.0675809383392334,
        -0.07842744886875153,
        0.10985298454761505,
        0.013449509628117085,
        -0.054987769573926926,
        0.07072750478982925,
        -0.028569601476192474,
        0.14682161808013916,
        -0.026787297800183296,
        0.062465567141771317,
        0.067532479763031,
        0.0055428240448236465,
        0.016324825584888458,
        0.06792002171278,
        -0.0062359049916267395,
        -0.008063085377216339,
        -0.023234643042087555,
        0.05549474433064461,
        0.030201304703950882,
        0.012816843576729298,
        -0.0131843201816082,
        0.02403842844069004,
        0.00861333031207323,
        0.06783819943666458,
        0.014288024045526981,
        -0.0228525809943676,
        0.023823773488402367,
        -0.038483623415231705,
        -0.0612894706428051,
        -0.022159216925501823,
        -0.059047166258096695,
        -0.07711614668369293,
        0.012555891647934914,
        -0.07011458277702332,
        0.0011187820928171277,
        -0.07551319152116776,
        -0.038869719952344894,
        0.007703353185206652,
        -0.0017125706654042006,
        -0.07983928173780441,
        -0.014796379022300243,
        -0.07940219342708588,
        0.07917964458465576,
        -0.0076414551585912704,
        -0.04095970094203949,
        0.0025484205689281225,
        0.033582594245672226,
        -0.10082481801509857,
        0.14841042459011078,
        0.007512545678764582,
        0.08277972042560577,
        -0.07997561246156693,
        0.02161569707095623,
        0.06742681562900543,
        0.014713922515511513,
        -0.012736423872411251,
        -0.07121112197637558,
        -0.0019368833163753152
    ]
}