{
    "id": "bis_4MT5SSo",
    "title": "Back-up beepers: Obnoxious, but getting better - and spreading!",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2023-11-05T14:01:58Z",
    "video_url": "https://www.youtube.com/watch?v=bis_4MT5SSo",
    "category": "Science & Technology",
    "tags": [],
    "views": 896973,
    "likes": 48942,
    "comments_count": 5907,
    "description": "BEEP BEEP BEEP BEEP BEEP  Technology Connextras (the second channel where I put stuff sometimes)   Technology Connections on Mastodon:   This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!",
    "description_links": [
        "https://www.youtube.com/@TechnologyConnextras",
        "https://mas.to/@TechConnectify",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Hello and welcome to No Effort November, aseries of videos for the month of November in which no effort is made. Ignore all this, doesnt matter. Have you ever wondered what makes big trucks and vans go *beep beep beep* when theyre backing up? Well, its one of these! This is a reverse alarm, also known as a back-up alarm (but not backup as in reserve ... but reverse). And the way it works is really clever: Inside this enclosure is a small studio apartment in which lives a tiny little man named Glorbus. His next-door neighbor curses like a sailorwhenever a vehicles backing up, and Glorbus is tasked with hitting a bleep button so innocent ears around arent offended. Its a pretty simple concept! Much like a sliding door, that intro was unhinged. This is, though, a pretty simple device - its just a weather-resistant loudspeaker hooked up to some sort of circuit that will make it go beep beep when you run DC power through it. Why dont I run some DC power through thisso we can observe what it does? For this next trick, I shall need to don hearing protection. Oh well. Are you ready? Here we go. BEEP BEEP BEEP [beeping stops] I mean the point is to get your attention, but I think we can all agree these things are kind of obnoxious. But they are undeniably a pretty solid idea with good intentions, and wouldnt ya know it, these are changing - theyre getting better, much less obnoxious, and are starting to end up in all sorts of places you might not expect. But before we get to the newfangled future, lets talk a little bit more about the oldfangled kind. These arent exclusively used in automotive applications - plenty of heavy equipment is fitted with one of these bleepers to warn those around it that its in motion. In that case it might be called a vehicle motion alarm, but for the purposes of this video, Im gonna stick to trucks and vans and other such road vehicles because unless you hang around construction sites like some sort of practical engineer thats where youre more likely to hear them. I think anyway. In those cases, these come on when the vehicle theyre attached to is in reverse - the driver of a large vehicle doesnt have great visibility when backing up, so these things became mandated by hold on a minute. Its an OSHA thing And here I thought it was a NHTSA thing. Learn something new every day. Apparently its the Occupational Safety and Health Administration that mandates these things on any motor vehicle equipment in use by an employer with an obstructed view to the rear. That suggests (here in the US anyway) the only reason these exist is to protect workers on a jobsite and the general public is just kinda-sorta getting some free help from them because company vehicles technically encounter job sites back at the warehouse or whatever. Huh. By the way, I cant believe we let NHTSA get away with making that a spoken acronym. It sounds like a sneeze. Anyway, installing one of these on a road vehicle is pretty easy because a road vehicle has reverse lights. Just tap into the power for one of those, give the alarm a good ground, and youre done! The alarm will automatically start beeping when you shift that vehicle into reverse. Wondering what I mean by a good ground? Well, in case you didnt know, wiring things in vehicles is very weird! You usually only need one wire because the entire metal body of the car is connected to one side of the battery (almost always the negative terminal but not always always because we didnt used to know any better). Anyway, why dont I show you? This here is an automotive test light. Its a light bulb inside of a stick with one of its power leads running to this clippy thing and the other attached to the poky bit at the end. If I hook each end of this thing up to an appropriate power supply, youll see that the lamp lights. In a car, if I clip this thing to the positive terminal of the battery, it will light up whenever I poke any metal part of the car with the pokey bit. That happens because the whole vehicle is a wire back to the other side of the battery. In the case of the backup alarm, this metal piece on its attachment bracket is bonded to its negative power terminal. That way, so long as youre bolting it to a metal part of the car, that bolt will provide a ground connection and a single wire from the reverse light to its positive terminal will make it work. But how exactly does it work? Its gotta have some sort of circuitry in there to make the loudspeaker vibrate and make sound. It could be just like a 555 timer chip acting as an oscillator and with some capacitors and maybe a transistor and junk you could probably just chop the 12V DC up and drive the loudspeaker quasi-directly. do that through a thermal switch like a turn signal flasher to make it beep intermittently and there you go! Or maybe add another 555 timer chip if youre being fancy. But these days, I mean there could be a whole microcontroller in there. Those things are just too cheap. Unfortunately these devices have their circuitry potted in a deep sea of resin because the intent is for this thing to just get bolted to the back of a truck and its gonna see all manner of weather (and who knows might literally end up underwater at some point). But! Through the magic of buying two of them, and some patience with a Dremel tool, I was able to de-pot this one behind the scenes. And then I cut it open. Surprisingly, this thing was filled with sand! And least I sure hope thats sand. And unfortunately, its circuit board is trapped in that epoxy resin so theres no way were gonna get a good look at it. But thats ok, I have a backup alarm! Just because its November doesnt mean Im not prepared. And thiss ones circuit board was just chilling in the sand so we can look at it. And, yeah. Its a mysterious six pin chip that drives this little MOSFET and that MOSFET simply shunts the loudspeaker across the DC pins. Do that fast enough and youll make an audible tone. Then do that intermittently and youll get a series of beeps. So, indeed, its not very complicated. Now, heres an idea, one very silly thing you can do is put one of these on a car that absolutely does not need it. [reverse alarm sounding] Weird small cars like a Nissan Figaro can be made even weirder with the simple addition of one of these. A Smart car or mini cooper are also excellent choices. Your neighbors will love it! Oh! That reminds me. Did you know this silly little car came with a back-up beeper from the factory? Its a Japanese domestic market car, so it beeps when you put it in reverse! But, the beeps are coming from inside the car! This has baffled many automotive reviewer journalist personality-tuber guys who have found this behavior in cars to be completely silly. It has leaked through some US-market cars, notably the Prius, and some people just cant contain their befuddlement at the idea when they first encounter it, but I see I have a different take. Ive been so fortunate to be stuck behind someone in a drive thru or at a red light several times in my life now who previously made an adjustment maneuver for some unknown reason which involved shifting the car into reverse. And when they had finished with their adjustment maneuver they left their car in reverse! So, theyre just sitting there in front of me with their foot on the brake and in reverse. So I, for one, would actually appreciate every car (with an automatic transmission at least) having a beeper for its driver to make it bloody obvious the car is gonna go backwards when you let off the brake. Thats an abnormal condition for any car to be in and its important to know! So I think having a beeper for the driver is actually a pretty good idea, and while you might find it kind of over the top, let me remind you that a full half of all drivers out on the road are worse than the average driver. And thats a fact! But lets get back to the reverse alarm. But first, lets get back to reverse lights. Because a funny thing happened with reverse lights. We stopped using them for the thing theyre there for. Or, I guess, we mostly forgot why theyre there and now a side-effect of their existence is the more obvious reason in our collective consciousness to the point that now they suck at their actual job. Allow me to explain: Yknow how your car has those bright white lights on the front of it so you can see where youre going at night? Wouldn't it be handy if you had some on the back of your car so you could see where youre going at night in reverse? Because thats what reverse lights are actually for - theyre an extra set of headlights on the back of your car so you can see behind you at night! The fact that they let other people know youre in reverse is largely incidental. Now, obviously, it is useful to know that a car around you is in reverse. I literally just gave you an example where I knew the car in front of me was in reverse, and it was a good thing I knew because I could try to avoid an incident by honking at that person in front to try and let them know they were in reverse, but see that never works. Theyre just confused why Im honking, and Im not gonna, like, get out of my car and scare them by walking up to their window, so without a PA system to yell at them and say hey man, youre in reverse! best I can do is hope they realize it quickly when the light turns green and, just in case they don't, pucker up and prepare to get front-ended. If only there were a solution to reduce the potential for this confusion. [car beeping since its in reverse] Anyway, since theyre effectively useless if youre stuck behind someone who doesnt know theyre in reverse, parking lots are perhaps where reverse lights as an indicator to others are most useful, both to other drivers and those just walking around. If youre walking you know to stay away from that car, and if youre looking for a spot youll know that persons leaving. But not if its a GM car, because General Motors cars like to turn on their reverse lights and leave em on for a while as you leave the car and theyll even come back on when you unlock the car! This behavior annoys lots of folks, including me, I must say, but perhaps weve got this all wrong. Consider this: maybe the driver of that car lives out in the country somewhere and theres no lighting at all where they park their car. Having the reverse lights stay on for a bit when they get out might be really handy for that driver because those reverse lights will illuminate the area around the backside of the car and let that person see in the dark a little better which is literally the reason they were invented! And how do I know that? I asked a search engine! The concept of reversing lights was invented in 1920 by an ex-Ford engineer named Childe Wills. Story goes he had a bad habit of backing into fire hydrants at night. He realized this was because he couldnt see them at night, but if there was a source of illumination on the back of the car he could! And he made that light come on automatically when the vehicle was shifted into reverse. This proved to be really forward thinking reverse lights wouldnt become common until the 1960s, and they werent mandated until 1968. But even then, their purpose was to let the driver see better behind them, not to tell others around the car that it might back up. But I also recognize their potential as an indicator to others. So why am I saying thats not what theyre supposed to be used for? Just because it was envisioned as illumination first and not as a warning doesnt mean it isnt useful as a warning. To which I say, fair point! Thats even codified in law, at least in the UN. But, see, if they truly are supposed to be a warning to others that the car is in reverse, theyre a pretty crappy warning! They dont flash to get your attention, so if you dont notice them coming on you could very well miss them. Lots of cars put them in really weird places that youre not likely to see. And when I say them, I might mean it. Just look at the back of the ol Scion xB. It turns out that cars are only required to have a single reverse lamp, and the designers thought theyd stick it off to the side to cash in on that asymmetry trend the Nissan Cube started or something like that. If youre approaching this car model from the wrong side, you cannot see its reverse light and therefore youll have no warning that its in reverse. The Scion xB is by no means alone here - many European car models, where a rear fog light is mandatory, place a single fog light on one side and a single reverse light on the other. So if the reverse light is principally there to warn others as people seem to think it is, that implementation probably shouldnt be legal. Yet it is. So that reinforces the idea that its main purpose is illumination. But none of us remember that, so its not deemed important anymore, and the great tragedy of this collective confusion of what reverse lights are actually for has led to many new cars (including mine and my old Chevy Volt!) having absolutely pathetic reverse lights that hardly help to see at all, but they satisfy the regulatory requirements of 1) being there and so everyone thinks its just fine. But I dont. Remember remember that it is November. Im not normally like this, folks. [off-screen: yeah, hes usually worse] I heard that! Where is my limo? That reference was a stretch. Eh, more like a super stretch. Anyway, getting back to reverse alarms at last, reverse lights present a convenient circuit to tap into to make a reverse alarm like this alarm when youre in reverse. So, attaching one to a car or truck or van is as easy as bolting it to a bumper, splicing a wire into the positive lead of the reverse lights, and running it to this point. Then youre done. You got an automatic back-up beeper. But there are two major problems with thiskind of reverse alarm. First, theyre obnoxious and loud enough to cause hearing damage. And, fun and definitely not ironic fact, we can thank OSHA for that one! The way the regulation is written, reverse alarms must be 5 decibels louder than ambient noise levels. Makes sense, you need to be able to hear them. But since construction sites tend to be quite loud what with all that heavy equipment rolling around, the easiest way to make sure you can attain that standard at all times in all situations is to make the alarm stupidly loud! This one produces 97 decibels of sound pressure at an unknown distance. Tried to find out where its measured from but this datasheet didnt say so I gave up. But way back in the start I was saying these are getting better. With those stupidly cheap microcontrollers, someone could conceivably design one of these which takes an ambient noise reading from an onboard microphone and uses that to determine how loud it needs to beep in order to meet the OSHA standard of 5 dB above ambient. And wouldnt ya know it, the folks at Ecco (the manufacturer of this more legit one that I only bought one of and am not willing to tear into) have done just that. Great work folks, youre making the world a slightly better place. But speaking of echoes, thats the other big problem. The flat tone that these things produce, while definitely loud enough to hear, is difficult for our brains to locate in three-dimensional space. If youre near a backing up vehicle with one of these beepers youll definitely know something is backing up by the impossible to ignore beeping, but the way that sound reflects off the surfaces around you, combined with its literally monotonous nature, confounds our sound localization abilities. But those clever scientists realized that white noise (or any sound similar to it) is a lot easier for our brains to locate in physical space due to all those harmonics and wavelengths and junk, so what if we made beepers that did this? [pulses of imitating crowd noise] Oh look, the magic of buying two of them struck again! Lets see what this one sounds like. [a pulsing white noise quite similar to what Alec just did] Anyway, these new versions are starting to spread. Theyre by no means brand spanking new, theres a nearly 10 year old Tom Scott video about this very thing. That videos also much shorter than this one. Do I have a problem being ? Lets put a pin in that. White noise reverse alarms may have been mandatory in the UK for a decade but they havent made it over here (at least my neck of the woods) until quite recently. And so far I think Ive only ever heard only two - both on Amazon delivery vans and both within the last year. Not one of those cool new electric delivery vans, though, just like a Ram Promaster or something. But speaking of cool new electric things, watch what my car does! [slow beeping with a melodic white noise] Its got a reverse alarm! But its a lot more subtle. NHTSA may not be the reason these loud honkers end up on commercial vehicles, and they may also be really incredibly terribly behind on lighting regulations, but they did manage to come together and create a rule that says hybrid and electric cars need to make some kind of noise to let people know they might move. Hyundai has gone with what I call digital angels for the forward motion, and when in reverse it makes the same sound but they also layered in a good old fashioned back up beeper - tweaked to be a little more calming, though. [a calming, slow and repetitive tone] And ya know what? I love this idea. The regulation was conceived because these newfangled cars can move without making any engine noise, and that is a potential problem. [engine starts] Previously, some sort of mechanical clacking and combustion poofing would provide an audible cue that a vehicle may be in motion near you, and particularly for the blind this was a way to stay safe out in the very dangerous landscapes where cars and people mix. Hybrid and electric cars removed this audible cue, so that means of detection was lost. Adding it back in some way is very helpful and potentially life-saving. And not just for the blind! Pretty much all accessibility features end up benefiting everyone. Just the other day I was in a parking lot and heard this very sound. [the Hyundai reverse beeper] At first I got excited thinking Id spot a car buddy but it was just like a Santa Fe hybrid. But, I immediately located the source of that sound (thanks to the background digital angels no doubt) and became aware that a car near me was about to reverse. That awareness was near-instant and helpful, and I think Hyundai did a really good job by emulating a reverse alarm to give a recognizable and specific warning of backing up. But Hyundai is Hyundai and others are others. Automakers are having a field day with this new regulation, and they like to design their own soundscape as another tool to bolster their brand identities. Unfortunately, that means theres no consistency here at all. To be honest, Im mostly OK with that. I like variety as much as the next guy. For another example of an automakers soundscape, heres what a Toyota Sienna hybrid sounds like in drive. [a sort of whooshing, hissing sound] [engine starts] Not a bad sound. Lets try reverse. Its a similar sound, but coming from a sounding module in the rear of the car. To be clear, thats pretty good! If youre standing near the rear of this car, that noise will definitely get your attention. But whether it communicates that the car might be coming toward you since its in reverse ehh thats definitely less clear. This particular new feature in the automotive landscape is something that needs careful consideration. To many, its divisive - cars are loud things. Cities would be a lot quieter without them (or at least fewer of them) and adding a noisemaker to the car might make that worse. But, the standards for this new requirement do specify a loudness and its pretty quiet. Above about 15 miles an hour, tire noise is considerably louder than these alerting devices. And in my honest opinion, I dont think any of the pedestrian sounds Ive heard from any new car are loud enough to be bothersome, even if someones coming home late at night when others are sleeping. Some are definitely a little more intrusive than others. Take a wild guess at which one I find the most obnoxious. Youre right, its that one. But so long as were careful and considerate about the ways we implement this idea, I think its all good. If Im alright with the variety in this new soundscape for a cars forward motion, I suppose I neednt care that much about the sound it makes in reverse. But I do think there might be value in standardizing that. Weirdly, if I were put in charge of that task, I would pretty much pick exactly what Hyundai did. Some white noise for making the sound easy to locate, and a beeping sound which were all primed at this point to interpret as attention please, this car is backing up. But, lest you think Im being overly flattering to Hyundai with that assessment, the reverse lights on this car are just pathetic! They dont illuminate the rear at all, the brake lights are orders of magnitude brighter. Heck, the tail lights are about as bright. Its ridiculous. You may have fixed the brake light logic Hyundai, and good job there! But next time you design a car, remember the other thing reverse lights are supposed to do, please. Itll make the back-up camera work a lot better at night, if nothing else. OK, is that the end? I think thats the end! Thanks for watching this astonishing mess of a video. I hope it was as enjoyable as it was chaotic. Remember folks, drive safely. That means paying attention. And using your turn signals. That ones important! I will judge you very harshly if you cant be bothered to flick the thingy. As should we all. The left lane is for passing, don't be hanging out there now. And get off your phone! For the love of god youre operating a two-ton death machine, act like its the responsibility it is! And another thing - obnoxiously smooth jazz For another example of an automakers soundscape, heres what a tayot pfff ugh! This here- This thing- This here- This thing is an- This is an automotive test light. If I hook each end up to a power supply, this hmm. power supply, youll see that the lamp lights up. [deflates] Best thing I can hope is realize AHHHHH Mmmm more like a super stretch, anyway getting back to reverse li - I did it again! Because the intent is for this thing to just get bolted onto the back of a truck, and its gonna see all the sor *sigh* Put effort into the end-screen captions? Pfft, not this time, bucko. It's November.",
    "transcript_keywords": [
        "reverse",
        "reverse lights",
        "car",
        "lights",
        "reverse alarm",
        "thing",
        "cars",
        "light",
        "back",
        "thing reverse lights",
        "beep beep",
        "beep beep beep",
        "alarm",
        "make",
        "vehicle",
        "beep",
        "sound",
        "things",
        "good",
        "pretty"
    ],
    "transcript_entity_values": [
        "Above about 15 miles an hour",
        "MOSFET",
        "MOSFET",
        "Santa Fe",
        "UK",
        "Hyundai",
        "half",
        "1",
        "10 year old",
        "a minute",
        "two",
        "Ecco",
        "the last year",
        "5 decibels",
        "Pfft",
        "the month of November",
        "Glorbus",
        "November",
        "Nissan Cube",
        "Childe Wills",
        "Smart",
        "UN",
        "European",
        "Glorbus",
        "six",
        "two-ton",
        "late at night",
        "General Motors",
        "Toyota",
        "Japanese",
        "97 decibels",
        "the 1960s",
        "GM",
        "Dremel",
        "US",
        "Prius",
        "Alec",
        "first",
        "one",
        "Ram Promaster",
        "Sienna",
        "these days",
        "Amazon",
        "a decade",
        "5",
        "1920",
        "1968",
        "Tom Scott",
        "DC",
        "OSHA",
        "First",
        "ex-Ford",
        "NHTSA",
        "night",
        "Nissan",
        "bucko",
        "the Occupational Safety and Health Administration",
        "three",
        "555"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "ORG",
        "ORG",
        "NORP",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "GPE",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.05616643279790878,
        -0.05759289115667343,
        0.07310886681079865,
        -0.02436833456158638,
        -0.007018798030912876,
        -0.04381536692380905,
        0.05933245271444321,
        -0.010349552147090435,
        -0.04972223564982414,
        -0.028357287868857384,
        0.05799422785639763,
        0.0716698095202446,
        -0.00378848472610116,
        0.02986002154648304,
        -0.06520971655845642,
        -3.538655073498376e-05,
        0.08313952386379242,
        -0.05635714530944824,
        -0.055704426020383835,
        -0.0342174768447876,
        0.002847404219210148,
        -0.012769787572324276,
        0.09160497039556503,
        0.04214905947446823,
        -0.03830400109291077,
        -0.002773669548332691,
        0.003585736034438014,
        -0.01956002786755562,
        -0.05824805051088333,
        -0.005425683688372374,
        -0.043428823351860046,
        0.07101630419492722,
        0.018490469083189964,
        -0.10895145684480667,
        -0.08232150226831436,
        0.01587691344320774,
        0.10055817663669586,
        0.0338003933429718,
        0.04662803187966347,
        -0.023453781381249428,
        -0.031180383637547493,
        -0.1200157031416893,
        0.04976827651262283,
        -0.03887924924492836,
        -0.06340234726667404,
        0.01777341030538082,
        0.017371470108628273,
        -0.012463130056858063,
        0.0279375147074461,
        -0.10903895646333694,
        0.08507513254880905,
        -0.051008190959692,
        0.1090368777513504,
        0.042988818138837814,
        -0.06622302532196045,
        0.03202668949961662,
        0.027934405952692032,
        0.0339471735060215,
        0.05796680971980095,
        0.02598259598016739,
        0.07959894090890884,
        -0.006724662147462368,
        -0.01265871524810791,
        -0.0025852806866168976,
        0.043782249093055725,
        -0.048721179366111755,
        -0.02492459863424301,
        0.03847621753811836,
        0.04057267680764198,
        0.031495314091444016,
        0.03580745682120323,
        -0.009898416697978973,
        -0.000477383378893137,
        0.07088147848844528,
        0.05863751098513603,
        0.06670834869146347,
        0.039793942123651505,
        -0.02725268341600895,
        0.010699600912630558,
        -0.0174722783267498,
        -0.018215302377939224,
        -0.03991057723760605,
        -0.010324355214834213,
        -0.011569402180612087,
        0.025342442095279694,
        -0.036078013479709625,
        -0.0058731939643621445,
        0.037676673382520676,
        -0.04501497745513916,
        0.03539641946554184,
        -0.07408052682876587,
        -0.05288340896368027,
        0.028989119455218315,
        0.026741985231637955,
        -0.019863976165652275,
        -0.018497662618756294,
        -0.13242359459400177,
        -0.010369854979217052,
        -0.03170940652489662,
        0.033869460225105286,
        -0.018214844167232513,
        0.00939160119742155,
        0.050146397203207016,
        -0.003812164533883333,
        0.008508715778589249,
        -0.060582395642995834,
        -0.07931208610534668,
        0.021903688088059425,
        0.08452273160219193,
        -0.015621367841959,
        -0.019760876893997192,
        0.07061329483985901,
        0.05393245071172714,
        0.04600696638226509,
        -0.05428266152739525,
        0.015479843132197857,
        -0.10753075033426285,
        0.042855169624090195,
        0.040743183344602585,
        0.01325539592653513,
        0.06586778163909912,
        -0.020752426236867905,
        -0.032854899764060974,
        -0.04438090696930885,
        0.15750353038311005,
        0.0033380223903805017,
        0.013647141866385937,
        5.496474198542764e-33,
        -0.014231059700250626,
        0.09663508832454681,
        -0.01521958876401186,
        0.0042645917274057865,
        0.04853290319442749,
        -0.0022647171281278133,
        -0.15433908998966217,
        0.03458280861377716,
        -0.03442120552062988,
        0.037080857902765274,
        -0.006795709487050772,
        0.08317672461271286,
        0.011032609269022942,
        -0.0002524763694964349,
        -0.004022116307169199,
        -0.0254216268658638,
        -0.040455833077430725,
        0.01860969513654709,
        -0.035070765763521194,
        -0.0874146893620491,
        0.023227298632264137,
        0.0647936686873436,
        0.018637094646692276,
        0.0017543832072988153,
        0.09722473472356796,
        0.019855637103319168,
        0.04099646210670471,
        -0.03588467091321945,
        0.061888836324214935,
        0.032396599650382996,
        -0.02400001510977745,
        -0.005674890708178282,
        0.03170226886868477,
        -0.03168714419007301,
        0.03334925323724747,
        -0.009180070832371712,
        -0.030209261924028397,
        -0.11590787023305893,
        -0.09314087778329849,
        -0.04487613961100578,
        0.02734033390879631,
        -0.009727468714118004,
        -0.12376908957958221,
        0.01863025687634945,
        0.010851260274648666,
        -0.0530516691505909,
        0.050612594932317734,
        -0.04011332616209984,
        -0.025644930079579353,
        0.01745476759970188,
        0.024336352944374084,
        0.004217182286083698,
        -0.03746936097741127,
        -0.02110450156033039,
        -0.02455451898276806,
        0.022995544597506523,
        0.06634315103292465,
        -0.05519137158989906,
        0.02253841422498226,
        -0.022124623879790306,
        0.03871206194162369,
        0.029789702966809273,
        0.02939298003911972,
        -0.015252635814249516,
        0.002995583927258849,
        -0.01615983620285988,
        -0.0021261214278638363,
        0.0052885268814861774,
        -6.641713116550818e-05,
        -0.0014895371859893203,
        0.012357400730252266,
        -0.025829395279288292,
        -0.03747038170695305,
        -0.03514103218913078,
        -0.023726560175418854,
        0.032927341759204865,
        -0.037065599113702774,
        0.06131445989012718,
        -0.06391187012195587,
        -0.03509749472141266,
        -0.007289659231901169,
        -0.06368634104728699,
        -0.008776196278631687,
        0.0017728909151628613,
        0.07168544083833694,
        0.05339282751083374,
        -0.03508586809039116,
        -0.15026883780956268,
        -0.0024176461156457663,
        0.07542417198419571,
        -0.06703346222639084,
        0.01948639005422592,
        0.024266619235277176,
        0.06011009216308594,
        -0.028855152428150177,
        -5.80654793511259e-33,
        -0.03478258475661278,
        0.00805368646979332,
        -0.011777220293879509,
        0.008326629176735878,
        -0.02239295467734337,
        -0.029733816161751747,
        0.024531031027436256,
        0.045775700360536575,
        -0.042084213346242905,
        -0.005026176571846008,
        -0.03074667975306511,
        -0.002265525283291936,
        0.08956525474786758,
        0.02924109436571598,
        -0.023910321295261383,
        -0.020960183814167976,
        0.11719974130392075,
        0.027193991467356682,
        -0.039050087332725525,
        0.009624390862882137,
        0.06103014200925827,
        0.08366130292415619,
        -0.04480188712477684,
        -0.01013711653649807,
        -0.06549577414989471,
        0.06400195509195328,
        -0.058681730180978775,
        0.06798717379570007,
        0.04719634726643562,
        -0.05810440331697464,
        -0.08710145205259323,
        -0.006959851365536451,
        0.011527253314852715,
        0.011778546497225761,
        -0.0004892524448223412,
        0.032477229833602905,
        -0.029461149126291275,
        0.029174871742725372,
        -0.05183243378996849,
        -0.05538718402385712,
        0.03170596808195114,
        0.1116679459810257,
        -0.023180600255727768,
        -0.0716741681098938,
        -0.07924190163612366,
        -0.005895146168768406,
        -0.07974494993686676,
        0.023782648146152496,
        -0.10238565504550934,
        0.03257370367646217,
        0.06831298023462296,
        0.017128778621554375,
        0.040168240666389465,
        -0.012416874058544636,
        -0.008833122439682484,
        0.021241670474410057,
        0.0928378626704216,
        0.05154069885611534,
        -0.006905707530677319,
        0.07801136374473572,
        0.012962426990270615,
        -0.04979332536458969,
        0.053353212773799896,
        -0.00944666750729084,
        -0.02187030389904976,
        0.06655189394950867,
        0.04563325643539429,
        0.0010430432157590985,
        0.05946185067296028,
        -0.052081312984228134,
        0.08949627727270126,
        0.06562978029251099,
        -0.023931583389639854,
        -0.05657392367720604,
        -0.019413959234952927,
        0.08637388050556183,
        -0.09404120594263077,
        -0.16820789873600006,
        -0.12663964927196503,
        -0.0443463996052742,
        -0.09246959537267685,
        -0.06207798421382904,
        0.013566495850682259,
        0.10552524775266647,
        0.008129769936203957,
        -0.04327548295259476,
        -0.018811644986271858,
        0.10642048716545105,
        -0.01991201750934124,
        0.026230821385979652,
        0.0036809006705880165,
        0.10844611376523972,
        -0.003202468156814575,
        0.03135838732123375,
        0.05254418030381203,
        -5.6787410329661725e-08,
        -0.0175737664103508,
        0.04261526092886925,
        -0.015917347744107246,
        -0.04834071919322014,
        0.08143667131662369,
        -0.09570620208978653,
        0.024190448224544525,
        -0.04331986978650093,
        -0.0790138766169548,
        -0.03324708342552185,
        -0.02603430487215519,
        -0.04237034544348717,
        0.008598734624683857,
        0.07153584063053131,
        0.03534663841128349,
        0.019290748983621597,
        -0.024180861189961433,
        -0.04237493500113487,
        -0.08426760882139206,
        -0.06264465302228928,
        -0.010520613752305508,
        0.01402443740516901,
        0.039158932864665985,
        0.06919480115175247,
        -0.011938944458961487,
        -0.01649402640759945,
        0.018116293475031853,
        0.06924087554216385,
        0.004390120040625334,
        -0.020877931267023087,
        -0.04354821890592575,
        0.05789071321487427,
        -0.04793543741106987,
        -0.025872142985463142,
        -0.06430811434984207,
        0.045763518661260605,
        0.027758758515119553,
        0.01313303504139185,
        0.07576543837785721,
        0.043925005942583084,
        -0.003746152389794588,
        -0.10070318728685379,
        -0.05003102496266365,
        0.054067984223365784,
        -0.02732468582689762,
        -0.028992142528295517,
        0.020412907004356384,
        -0.04557736590504646,
        -0.024509474635124207,
        0.04144422709941864,
        0.03790886327624321,
        -0.004385678097605705,
        0.04232815280556679,
        -0.0018754092743620276,
        0.11045202612876892,
        0.0026588519103825092,
        -0.05130448192358017,
        -0.021614618599414825,
        -0.0539713092148304,
        0.09182016551494598,
        0.012965070083737373,
        -0.035442717373371124,
        -0.03992515802383423,
        -0.040528204292058945
    ]
}