{
    "id": "bJnt87JgKMU",
    "title": "The internet really is a series of tubes | The Vergecast",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-04-16T14:00:23Z",
    "video_url": "https://www.youtube.com/watch?v=bJnt87JgKMU",
    "category": "Science & Technology",
    "tags": [
        "The Vergecast",
        "Vergecast",
        "The Verge",
        "Tech",
        "Technology",
        "podcast",
        "gadgets",
        "undersea",
        "deep sea",
        "ocean",
        "internet cable",
        "AI",
        "PC",
        "microsoft",
        "windows",
        "specs",
        "laptops",
        "form factor",
        "mac m3",
        "processors",
        "intel",
        "AMD",
        "qualcomm",
        "nvidia",
        "chips",
        "kobo",
        "kindle",
        "e-readers",
        "e-ink",
        "boox palma",
        "ebooks"
    ],
    "views": 14119,
    "likes": 257,
    "comments_count": 20,
    "description": "Today on the flagship podcast of undersea cable management:   The Verges David Pierce and Josh Dzieza discuss the industry of laying and maintaining undersea cables that connect us to the internet.   Tom Warren and Joanna Nelius join the show to discuss the future of Arm chips on PCs and whether or not were about to get a huge jump in performance on most laptops.   Alex Cranz answers questions from the Vergecast Hotline about e-readers and the latest Kobo devices.  Further reading:   The invisible seafaring industry that keeps the internet afloat:   Chip race: Microsoft, Meta, Google, and Nvidia battle it out for AI chip supremacy:    Microsoft is confident Windows on Arm could finally beat Apple:   Kobo announces its first color e-readers:    The best ebook reader to buy right now:     00:00 - Intro 02:44 - Undersea cables w/Josh Dzieza  40:41 -  Windows on Arm could finally beat Apple 1:06:45  - Is the Boox Palma worth it? (Vergecast Hotline)   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   If you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit:",
    "description_links": [
        "https://www.theverge.com/c/24070570/internet-cables-undersea-deep-repair-ships",
        "https://www.theverge.com/2024/2/1/24058186/ai-chips-meta-microsoft-google-nvidia",
        "https://www.theverge.com/2024/4/8/24116587/microsoft-macbook-air-surface-arm-qualcomm-snapdragon-x-elite",
        "https://www.theverge.com/2024/4/10/24124411/kobo-libra-colour-clara-colour-e-reader-kindle-e-ink",
        "https://www.theverge.com/23769068/best-ebook-readers",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://link.chtbl.com/vergecast",
        "https://link.chtbl.com/decoder",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3P4bJgz"
    ],
    "transcript": "- Welcome to \"The Vergecast,\" the flagship podcast of Undersea Cable Management. I'm your friend David Pierce, and I am sitting here after a bunch of travel doing what it turns out I do like a few times a year, which is basically get bored with all of my gadgets. And instead of buying new gadgets, I try to just like change everything about the ones that I have to make them more interesting. So like I just took the monitor on my computer off of a stand, which I've had it on for a while, and put it onto a monitor arm. Does that make any difference? No, but it feels new now and that's very exciting. Like, I changed the lock screen on my phone and I switched it from dark mode to light mode. Suddenly feels like a new phone. The real best version of that, by the way, is buy a new case or take the case off. All of a sudden, it's like you have a completely new device, and it only cost you a few dollars or absolutely nothing at all. I also changed the watch face on my Apple Watch. I tend to like go from one pair of headphones to another pair of headphones for a while. I'll change the wallpapers on all of my devices. It just kind of makes everything feel new and exciting without actually making any meaningful changes, because otherwise if I let this feeling go on long enough, I end up buying something I absolutely do not need, or like upgrading my perfectly good computer just out of sheer, like, need to have something new. So I figure a wallpaper is probably easier and definitely cheaper. Anyway, we have an awesome show coming up for you today. We're gonna do two things. First, we're gonna talk to Josh Dzieza, who has spent a long time reporting a big story for The Verge about undersea cables and what that means basically about the infrastructure of the internet, that the way that we connect to the world is just a bunch of cables in the ocean. That is both more interesting, more important, and more unstable than you might realize. So we're gonna talk about how all of that works and what it takes to keep it working. We're also gonna talk to Tom Warren and Joanna Nelius about the chip race that seems like it's coming for us pretty soon. Microsoft has been making noise about how it thinks this next generation of Qualcomm chips could bring Windows computers on par performance-wise with the latest Macs from Apple, which would be a big deal. And if Qualcomm chips are finally as good as they've been promised for a really long time, it could change the PC landscape in huge ways. We also have a hotline question about E Ink and e-readers because this is \"The Vergecast,\" of course we do, and lots of other stuff to get to also. It's gonna be super fun, really fun episode. All of that is coming up in just a second, but I've now been using light mode for like three minutes, and I hate it. I'm going back to dark mode. Gotta make that switch. This is \"The Vergecast.\" We'll be right back. (graphic thudding) Welcome back. Over the last few years, one of those ongoing news stories that always makes me stop and think is whenever a company, usually Google or Meta recently, announces that they're starting a project to build a cable between countries, or continents, or across the ocean. Like in 2022, both those companies announced these big plans to build cables pretty much all the way around the African continent. The diagrams of them alone are mind-blowing. Just imagine you were sort of loosely tracing your way around Africa three or four times, all the way around, that's what it looks like. Thousands of miles of cable underneath the ocean hitting land at these various points all around Africa. And increasingly, this is what the whole world looks like. The whole internet is just right there underneath the ocean all over the world. The Verge's Josh Dzieza has been reporting on these cables for months, and he's found himself inside a whole huge industry that really nobody ever knows or talks about, which is the folks tasked with laying, and just as important, maintaining and fixing these undersea cables. If you're hearing this on Tuesday as this podcast goes live, his story just also went up. We might have actually beaten him by a couple of hours, so keep an eye on theverge.com. So we figured we'd have him on the show to talk about it and explain this whole under-the-sea world to us. Josh Dzieza, welcome back to \"The Vergecast.\" - [Josh] Thank you. - [David] You have spent however many months at sea (Josh laughing) learning about the weird machinations of the internet. - [Josh] Yes, unfortunately, in port, but I guess it's still technically the sea. - [David] Yeah, it's good enough. So I want to like talk through this big story that you've been working on and just published for us, but I also want to kind of explain the infrastructure of the internet in a way that I think you're now sort of uniquely set up to do. And my sense is what you've discovered, if we're just gonna start from the very beginning, is that like yes, in fact, the internet is just a series of tubes. - [Josh] Absolutely, it is a series of tubes. I was surprised at actually how tube-like they are. Like, you imagine, at least I imagine, I feel like a lot of people imagine kind of big pipes at the bottom of the ocean, but it's actually just little garden hose with tubes running between continents. They have some fiber optic cables in the middle, basically just strands of glass. That's lasers pulsing through in code data, and that is how data travels around the world. - [David] So give me kind of the big-picture way to think about this infrastructure. Like, I know it's lots of very long cables, but like how sort of big and sprawling is the undersea cable universe? - [Josh] It's huge. There are 500 or so cables around the world, around 800,000 miles of cabling, often going through between sort of big population centers. So you have a lot going from UK, Western Europe to New York, New Jersey. On the other side, you have various parts of California going to Japan or other locations in Asia. And that is how... You think about these big global networks. You are, even if you're not always... Like, if two people in America in the US are emailing, they're probably just on terrestrial cables, but the second you're accessing data that's overseas in some capacity, if you are watching YouTube videos that were posted from somewhere overseas, it's cached locally at a data center, but it got there using an undersea cable from some other data center somewhere. And if you, of course, Zoom, or email, or whatever with someone overseas, it's going through one of these cables. - [David] Right, yeah. How would you think about in the sort of day-to-day life of a normal person, how important are these cables, do you think? - [Josh] I would say they're very important, but they might not be directly accessing them every day. If you're on a big continent like North America, you're largely traveling over a terrestrial network, but services you interact with are dependent on these cables. So you have like big global platforms, like YouTube and TikTok. That content is reaching you. Like, the last mile is gonna be terrestrial, but it got to North America using a subsea cable. A lot of financial data, any kind of international transfer, is happening on a subsea cable. Anytime you call customer service and you're talking to someone overseas, that's on a subsea cable, and then you have kind of the bits of the internet, you have you my own website, it might seem like it's local, but you have software libraries and various things that could be stored somewhere else that it's calling on, and you don't necessarily know where it's coming from. So I would say every day you're doing something that maybe on the secondary, tertiary level, relies on these cables. - [David] Got it, okay. And undersea cables, if I understand correctly, are not like a new internety idea, right? The idea of having a cable that connects the United States to Europe, and Europe to Africa, and Africa to Asia, or whatever, we know how to do this at this point, right? - [Josh] Yeah, one of the surprising things to me in doing this story is how little this has changed over the years. And I'm not just talking like the decades of the internet, but like a lot of these companies trace their lineages back to the telegraph era. And a lot of the practices are date from the telegraph era. Like you lay cables, you repair cables pretty much how you did in the 19th century. - [David] Yeah, we're talking like mid 1800s, right when the telegraph was starting to kind of move around the world. - [Josh] Yeah, you read these accounts of the early telegraph people, and it's quite... A lot of it is trial by error. It's quite exciting. It's people, they don't really know how electricity works, they don't really know what the bottom of the ocean looks like, and they're just sort of setting out, being like, \"Well, we strung a cable over through the English channel, like why not do the ocean?\" And it's just- - [David] More water. - [Josh] It goes terribly for several decades before they eventually figure out how to do it. - [David] Okay, so today, what does it take to keep all these important garden hoses safe and working? - [Josh] So they're breaking all the time. They break 200 times a year. It's like every other day, a cable breaks. - [David] So we have 500 cables, and 200 of them break every year. - [Josh] Right, yeah. - [David] Wow. - [Josh] When they get 200 breaks, sometimes they're on the same cable. It's complicated, but yeah, basically, a good chunk of them are breaking. There's enough redundancy in the system that data can be routed around on alternate paths. So you don't really notice, but if 200 cables were to stay broken, you would notice very bad things would happen. So yeah, these brakes happen all the time, 200 times a year. And when one breaks, traffic is rerouted along alternate paths, and while that's happening, one of this small band of ships will sail out with some spare cable and fix the break. As the internet has become more important, there was a report that was interesting a couple years ago that talks about how cables have not become more vulnerable in recent years. It's just that our dependence on them has grown exponentially. So say in the '90s, there's a massive break. Some things break, it's not bad. You might not notice in your day-to-day life. Now, everything breaks, banks stop working, companies can't function, supply chains break, websites don't load. We rely on it for everything. But the industry that repairs it, keeps things running, is basically the same. It's just sort of handled by private companies that have a bunch of contracts with cable owners, and they have this arrangement that is sort of days back, half a century maybe, where everyone kind of pays into a organizing body that has a couple ships that stand by and repair any cables that break in a big zone. And like the zone is the Atlantic Ocean. - [David] It's a big, big zone, yeah. So how do these cables break? - [Josh] Overwhelmingly, it's people break them, specifically fishing vessels break a lot of cables. You have these dredging nets, trawl fishing, they scrape these big hooks across the bottom of the sea with a net, and they snap cables all the time. - [David] So it's not like a targeted attack on the cable, it's just sort of this gets caught up in the fishing net and snaps kind of thing. - [Josh] Yeah, one of the interest... There's been hardly any proven hostile attacks on a cable. It's almost all just sort of accidental damage. You have a fishing vessel, you have like a ship drags its anchor in the wrong place, things like that. And then you have natural disasters, you have like landslides under the ocean, basically, earthquakes, volcanoes, weird currents, things like that. And then there have been cable breaks that people suspect could maybe be from a malicious actor, but it's never really been proven. The one case I've seen cited was like during World War I when the UK and Germany sort of sent people a sort of cut telegraph cables with access. Other than that, there hasn't really been any documented cases of attack on a cable - [David] World War I, a lot of fights over TikTok in World War I, from what I remember. So you mentioned the maintenance industry here. What does this industry look like? This feels like this incredibly important gigantic job. Like, is this a huge teaming industry of huge teaming multinational corporations fixing the internet? - [Josh] It's really not. It's actually quite a small industry, like ballpark, maybe 1,000 or so people, in the direct sort of maritime side of maintenance. Do you have- - [David] For all 800,000 miles of undersea cables? - [Josh] That's right. - [David] Wow. - [Josh] So you have, there's about 70 cable ships in the world, but most of them mostly do installations, which pays better. You have like 22 or so dedicated maintenance vessels, and they are stationed around the world, a handful per ocean, basically. And their job is to... Like firefighters stand ready 24 hours a day to sail out within 24 hours of being notified of a cable fault. So they belong to these consortiums. Maybe a couple different maintenance providers have a ship in a given ocean, and they cover the whole area. And if you're a cable owner, you call the maintenance provider and say, \"Hey, I have a cable broken. Send a ship out.\" And they send a ship app to fix the cable is basically how it works. - [David] Wow, it's like an adventure story. Every time, they're like, \"We have to go explore the depths of the ocean to find a broken garden hose and figure out what to do with it.\" - [Josh] It really is like drop everything. We go to a random place in the middle of the ocean often. - [David] Wow, 22 ships strikes me as not a lot of ships to cover, A, all of the problems you've deScribed, and B, just the sheer size and scope of all of this. Can they do it with 22 ships? - [Josh] So they have done it with 22 ships. - [David] Okay, fair, I guess, yeah, the internet still works. We're still here, okay. - [Josh] I think the concern is that a lot of these ships are getting pretty old. They're like several decades old. There's not a lot of money coming into the industry. And if there were to be a big event, like a big earthquake, or a deliberate attack on a cable choke point, or something like that, then you could have a real disruption. So the ships are really this critical component of the internet that, so far, have been able to keep things running, but it's pretty lean if there were a major event that it would be challenging, I think, in some cases for them to do the job. - [David] Okay, and who are these people? Is this a sort of manual labor kind of job on a ship? Is this like a incredibly technically complicated job on a ship? Like, who are these folks doing this work on these ships? - [Josh] It's both manual labor and very technically complicated. You have a mix of... You have crew who are sort of seafarers and run the ship, and then you have cable engineers who kind of come from all the kinds of different backgrounds. But the job requires, you have to be quite good at geometry, and angles, and forces, and sort of ocean engineering stuff to know how to pull up a cable from several miles to the bottom of the ocean without things snapping. You're dealing with these big metal hooks that are used to catch the cables, high tensions. It's like quite physically demanding work. And then at its heart it's these various technical tasks that involved with figuring out where the fault is, splicing the fibers, which is just ultra precise work that's done. You're fusing two strands of glass end to end as perfect as you can get a connection. And that stuff is, it's like neurosurgery. It's extremely delicate. - [David] And you have to do it on a ship in the middle of the ocean. - [Josh] Right, yeah, on a rocking ship that is in the middle of the ocean. - [David] This is like everything possible on incredibly hard mode at all times. - [Josh] Yeah, yeah, it's pretty... As you see the workshops and it's just like in the belly of a ship sort of surrounded by tarps, it's not this precision factory that you would wanna be doing this work in. - [David] So now I can't help imagining the like montage action scene of everybody snapping into action, one of these things happening. So, like, walk me through the process a little bit. I'm in port in some centrally located city somewhere, waiting for a call. I get a call from, I'm assuming it's like Google and Meta, who seem to be the companies that own more and more of these cables over time. - [Josh] They own a lot of the cables. A lot of the newly built cables are coming from the big tech companies, Google and Meta primarily. And then you have cables that are owned by dozen, sometimes ISPs and telecom companies and things. - [David] Got it, okay. - [Josh] And so, each cable will have someone who's in charge of maintenance, and they'll get a message from their network operation center saying, \"Hey, we've got a cable down, here's what we know about it.\" That person will then call someone at the repair organization. They could be public or private, but it's one of these consortiums usually. - [David] I was really hoping there would be like a big red button on somebody's desk that's like cable down and the alarms start going off in the ship somewhere. - [Josh] Yeah, there are alarms and big red warnings, but then it's a lot of people calling people around the world at weird hours. So they call someone on the maintenance side, that person then calls the ship and says, \"Get ready, we're gonna need X miles of spare cable for this cable system. We think it's here, we think this, cut it, whatever information they have.\" And then they kind of plan out what the repairs gonna look like. - [David] Okay, and what does a repair normally look like? Like, walk me through a little bit of what it would look like actually on the boat trying to do the repair. - [Josh] Yeah, so the first thing you do is you need to locate where the fault is approximately. And that's done on either end of the cable. Basically, you have people in the landing station on either end of the cable, so on opposite sides of the ocean, shoot a laser down there and it hits the brake, reflects back, and the time it takes to come back will tell you pretty much where along the cable the brake is. - [David] So like wherever the signal dies, that's the point you send them to? - [Josh] Exactly. - [David] Okay. - [Josh] And so you sail out to there with a certain amount of spare cable in your ship and a bunch of these big hooks that are called grapnels. - [David] Which I Googled, by the way, and they just straight up look like Batman's grappling hooks. Like, that's just what they are. - [Josh] That's exactly what they are, and there's a bunch of different kinds. You have like multi-grapnel things. You have ones with giant arms and blades, depending on what the ocean bottom looks like, whether it's muddy, or rocky, or what. Cables are laid with such little slack on the seabed that you can't just hook it and pull it to the surface. It's too hot. So the first thing you need to do is you need to cut the cable somewhere near where it's broken using one of these grapnels, but one with a big blade in the middle. So you drag this blade across where you think the cable path is, and then you turn around with one of these grapnels and catch one end of the cable, pull it to the Surface, attach it to a buoy, go back to the other side, catch the other side of the cable, bring it to the surface, and then you do the splicing. So you splice like a piece of spare cable to that end, go back to the other side that's attached to the buoy, splice it to that end, and then test it. And you should have a working cable that then you have to lower back down to the ocean floor. - [David] So it's basically like you're fishing for cables on the ocean floor, right? Like, how do they know if they've caught one? - [Josh] That's exactly right. Like fishing, based on just the tug on the line. In this case, you have this enormous metal hook that you're dragging along the ocean floor. And as that's happening, someone is in the bridge watching this one dial, called the tension meter, and watching it waver back and forth. And one of the interesting things about it is it's an analog dial. It's not an ultra precise digital readout because you want that kind of fuzziness to be able to judge intuitively what's happening is tension rising or falling, is arising and falling fast or slow, that you can't get from a bunch of numbers jumping around. And so you're watching this dial, and if it's moving up slowly kind of wavering, maybe you're going through some mud, if it jerks up quickly, maybe you hit a rock, and what you want is this slow increase, slow steady increase in tension that shows you've hooked this cable and you're dragging it along the ocean floor. And that's when you know it's time to reel it in. - [David] Interesting. Man, that's such a inexact science, but that's like you just deScribed like an art form, more than a piece of sort of data analysis. - [Josh] It really is. One of the engineers I was talking to in Japan, it really is this act of kind of reading what's happening on the ocean floor, imagining based on this dial, \"Oh, I'm going... I'm going over a trench, I've hit a rock.\" - [David] That's wild. And how long does that process take? - [Josh] Like days, to weeks, to months, even if it's hard to find the cable. Everything here is at just a massive scale. So like if you're in deep water, the garden hose is several miles down and just the act of like lowering it down to the ocean floor and hauling it up can take nearly a day because it's so deep. And then so each step of this process takes several days. Splicing the cable takes about a day. It's just incredibly time-consuming. And then so it's like if you don't catch the cable on first try, then several more days to try again, and it adds up. Pretty soon, you're out the sea for weeks. - [David] It just keeps reminding me of one of those movies where there's like, there's the one shark that they're trying to catch and they're like, \"We think we found it, it's over here.\" And then they go and they don't get it, and it's like, \"Oh, okay, well, we think we know where it'll be next.\" And it is this like sort of perpetual cat-and-mouse game that you're playing with this thing, trying to get it into your arms and then you can do something with it. - [Josh] Yeah, it's remarkable how little visibility they have onto the ocean floor and what's happening down there. There are times when people are doing a dozen passes back and forth- - [David] Wow. - [Josh] And being like, \"Well, that wasn't there. Maybe it's a mile that way, and let's try over here.\" - [David] Why don't we know better? This is one of the things I found myself wondering reading your story is I feel like I could make a solid argument that the location of these cables should be like closely-held state secrets that no one knows that because they're so important to the way that the world works that they should be... It should be like the bunkers where the president goes. Like, it just should be all classified information. On the other side, I can imagine a world in which we should do much more work to have much better knowledge of how these things work, and where they are, and what's going on with them because they're so important and because laying them and fixing them needs to happen so quickly. But it seems like we're in sort of a weird middle between those two things. We're like we kind of know, but not really. - [Josh] Yeah, it's a trade-off. So you can go and you can see, tell geography tracks, cables. You can see kind of broadly where they are in the ocean. If you're like a sea captain, you get charts that have cable areas marks with some degree of precision. And that makes a lot of sense because the biggest actual threat to cables is someone accidentally dropping an anchor on them. And so if you are worried about an attack and you make the most secret, you're probably gonna increase the number of accidental cable bricks. On the other hand, they are vulnerable. It would be fairly... You don't need a low-tech attack, you can just drag an anchor across the ocean floor. In practice, the network is redundant enough, you're still talking about like a really small thing in a big ocean, so it's not quite that easy to attack. It would take a pretty sophisticated antagonist to actually cause like catastrophic cable outage. So, so far, it's been fine, but it is a topic of active debate, I think, in governments. What should we do? How should we protect these cables that are so important? - [David] And for the people whose job it is to actually maintain them over time, what is life like? You talk to a bunch of people who are sort of in this industry, and in some cases have been for a very long time, right? What's it like to be a sort of superhero keeping the internet running? - [Josh] It's a very strange job. People, when they join, they tend to kind of stumble into it. It's not a very well-known industry. And so you have people who are working as cable engineers in some other area, or in Merchant Marines or something like that. Geologists in optics. And they sort of stumble into it. And if they stay for a bit, they tend to stay for a long time, like decades. A lot of the work is learned on the job, and so people tend to sort of move around between different roles. But it's not an easy job, it's a weird lifestyle. You rotate in and off ships, you're often far from home out of contact. This is changing now a bit with Starlink, but like when you're onboard one of these ships, historically you're pretty much cut off. You don't have great internet connections, you can't stream things, or FaceTime, or anything like that. - [David] You have the fast internet literally in your hands. You just can't do anything with it. - [Josh] Right, exactly, it's a difficult job. Just the lifestyle is hard, but people come to love it because it takes you to very unusual places. It's exciting, and a lot of them have like a real sense of purpose. They're maintaining this infrastructure that the modern world runs on, even if no one actually knows about it or what they do. - [David] Knowing you as I do, I'm confident that at some point in reporting this story, you tried to live the cable maintenance life yourself and you were like, \"Yes, I will live the ship life.\" How close did you get? - [Josh] Not that close. (David and Josh laughing) I did try... When I first heard about this industry, I was like, \"Well, I should go on board for repair,\" and was basically laughed out of the room several times for various reasons. The big one was security. It's a secretive industry. They just can't have a journalist hanging out on a cable ship in most cases. And then the other very compelling reason was that they don't know how long they'll be gone. So like, \"Yeah, you can come along, but maybe we'll be gone for a week or two, and maybe we'll get called off to another repair and you'll be at sea for months.\" Which is just hard to really plan around. - [David] That's fair. So were you able to get any kind of firsthand glimpse into this life? - [Josh] Yeah, so I ended up going to Japan to talk to people who work at KCS, and going aboard the Ocean Link, which was the ship that repaired a lot of the cables in Japan after the 2011 earthquake and tsunami. And so it was in port for a period of time and I was able to go there and visit the crew and get a tour of the ship. - [David] What was the ship like? - [Josh] It was fairly big, like 400 foot long, sort of tall working ship. It's from the '90s, it's kind of old at this point, but well-maintained. - [David] I'm imagining sort of a big fishing vessel, but instead of like nets and containers, it just has a massive spool of cable. - [Josh] That's basically right. It essentially is a massive spool of cable. Like the middle of it are these, I think three big empty tanks that are just kind of spindles of wound spare cable. The interior is really empty. It's kind of like a... It's built kind of like an aircraft carrier or something, where there's no sort of beams, or struts, or anything because it's all just... You have to string cable out of these tanks to the workstation and then out to the front where there's kind of a rolling pulley kind of thing where it goes over and into the ocean. - [David] Got it, so it pulls it up and then you sort of spool from the middle. Boy, what a complicated system. - [Josh] It's counterintuitive how the ship is put together and how it all works, but then makes sense when it's... You're working with a material that is thousands of miles long and it just creates all these weird logistical problems. - [David] Yeah, so you mentioned the Fukushima incident in 2011 in Japan, which is a big part of the story that you wrote, kind of how they repaired and the reaction to all of this. What was it about those repairs that was sort of different? I feel like you found one of the hardest cases you could have to tell this story about what happened in that case. - [Josh] Yeah, so there are a few... There have been a few major, major cable events. This was one of them. They tend to be earthquakes that caused the most damage. So in this case, there was this very, very large earthquake off the coast of Japan. It sent a large tsunami that caused immense devastation. And part of that, the tsunami knocked out the Fukushima nuclear reactor causing a nuclear meltdown. So you have this disaster on top of a disaster. And then you have the other disaster, which is not really well-known but happened at the same time, which is that the earthquake caused all of these submarine avalanches that wrecked the majority of the cables Japan uses to connect to North America. - [David] Oh, wow. - [Josh] And the rest of the world. And so while the earthquake-tsunami recovery was happening, while Fukushima was... People were trying to bring Fukushima under control, the ship had to set out and try to fix these cables as fast as possible while contending with the fact that there may or may not be a cloud of radiation over them. - [David] So yeah, I mean, again, it just feels like so much of this process is just unknowns, on top of unknowns, on top of unknowns. It's just going out and trying to figure out, \"Okay, something happened to these cables.\" We don't know what, or where, or what it's gonna take, or how we're gonna fix it. And just bit by bit, they just solve it. - [Josh] Yeah, it's really just, it's very methodical. Like you've just gotta kind of follow the steps, and so they looked at the cable map, they figured out, \"Okay, based on the timing of these faults, interestingly a lot of them happened hours after the tsunami.\" Like that night, basically, you have these big debris flows that sort of barrel down these canyons and end up wrecking the cables. And from the timing of the brakes, they figure out that's probably what happens. The seabed is probably very transformed. They're gonna need a lot of spare cable, and typically you figure out... It's not usually up to the maintenance provider which cables they fix first. It's usually kind of first come first served from the cable owners, whoever calls in their fault first. But in this case, the cable owners are like, \"You guys figure it out. Like whatever cable you can fix, fix it.\" And so they settled on the one farthest from Fukushima 'cause the other thing is that normally, in a big event like this, other ships arrived to help, but there was so little known about what was happening with Fukushima. No one felt comfortable sending their crews into that. And so they were sort of the only ones doing it for the first period of time. - [David] So, and then there was a moment in the Fukushima response where they had pulled the cable up and then couldn't figure out what to do with it, right? What happens here? You get the cable up above the ocean and then you have to figure out what to do. What did they do? - [Josh] Yeah, so this was the first repair. They hook this cable, and they start reeling it in, and it's under an unusual amount of tension. And basically, what happens, they start reeling in very, very slowly because every cable has a certain amount of tension. You don't wanna exceed it 'cause the cable could snap. And so they're just moving very, very slowly and it takes them nearly a day to get it to the Surface. - [David] Wow. - [Josh] And what they learn when it gets there is that it's just been completely mangled. And what they think happened is some enormous landslide happened. It dragged the cable, it buried it under a bunch of debris. And now, they've been slowly pulling it tighter, and tighter, and tighter until it reaches the Surface. Now, they can see it, it's on the front of the ship, it's on the fourth deck, and it is hooked around one bar with the grapnel and totally stripped and mangled and under a huge amount of tension, and- - [David] So you basically, at this point, have like thousands of miles long bungee cord like sitting on your boat. - [Josh] Exactly. Exactly. Attached to a heavy metal hook that if the bungee cord snaps, which it's being strained sort of each wave and swell, it will fly across the ship, kill anyone it hits, smash into the cable control room, just do immense damage. But the priority becomes you can't repair a cable under this kind of tension that's this damaged. They need to get it off the ship. And so they do this sort of complicated precarious procedure where they hook chains around each side of the cable, swap the grapnel out for a bladed grapnel, lower it back over the bow of the ship while they've evacuated the area. And then once it's under the water, they release the chains, the cable is cut and goes back to the bottom, and they start over. - [David] That feels like a really interesting test case 'cause like you said, these cables go back a century. But 2011 is very much like the internet. And as we've learned, catastrophes happen, things like this happen all the time in lots of places. That was a particularly bad one, but like earthquakes happen. We just had one in New York. Like, these are things that happen. Were there any sort of lessons learned from that? Like, do you feel like whatever, 13 years after that, we're in a different era of how think about undersea cables? - [Josh] Yes and no. I mean, it's interesting to look back on the coverage of 2011. Like a lot of the, when the internet was mentioned, it was usually that this is remarkable, the internet fared remarkably well. It stayed up. - [David] Oh, really? So for all the issues, the internet stayed up in Japan. - [Josh] Yeah, and so you have these reports and people were basically just... You would only use the internet to communicate in the immediate aftermath. People were sending emails, they were tweeting, people were posting videos, other telecommunications were cut out. Like, the terrestrial cables were cut, the cell towers were wrecked, and so they were really reliant on the internet. But you talk to the people who were at the operation centers and on the ships, and it was so much more precarious than people knew. Basically, they had succeeded in rerouting all the traffic over the remaining cables. But if one of those cables had gone down, you would've started to see a real degradation in service. Things would've started to drop, it would've been difficult to communicate. And so it was sort of right on the cusp of being a communications disaster. And the lesson that the industry learned from that is largely around redundancy. There's not like a real geographic reason, unlike the Red Sea, or the Luzon Strait, or something. There's not a geographic reason why all the cables were in one place there. It was just sort of habit. Like, we'd always put cables there. - [David] Sure. - [Josh] And they always kind of landed at the spot. And so that makes sense. And so you had these sort of choke points that when a landslide comes through, it wrecks a bunch of them, and there's more of an awareness that you need multiple landing points. But in practice, that doesn't always happen because it's cheaper to follow new routes or whatever. - [David] Yeah, so where does it feel like this industry is right now? Obviously, it's as critical as ever, if not more so. Like, the world relies on this stuff more than we ever have. And I feel like purely anecdotally, I've heard more about undersea cable projects just in the last couple of years, I feel like, than I ever have. And that might just be because I pay attention to companies like Google and Meta, and they're doing a lot of this stuff. But is there energy in this space to increase from 500 cables and 800,000 miles to are we gonna have more than that or multiples of that over time, do you think? - [Josh] We are in a cable boom right now. There's a lot of new cables going in. Whether that means the net number of cables goes up is a debated topic because the cables are also higher and higher capacity. So some think maybe there'll be fewer of cables, they'll just be really, really, really high bandwidth. But there are a lot of new cables going in that's driven by the tech companies primarily, which starting a couple years ago, decided rather than purchase bandwidth on these cables, let's have our own cables. And so they started laying their own systems largely between their data centers. And the reason for that is that they need a ton of capacity to kind of sync all of their data centers around the world to keep these like huge content libraries up to keep cloud services running. And so they wanted kind of that all under their own umbrella. But that hasn't really spilled over into the maintenance side yet as mostly kind of the installation side. - [David] I was gonna say, we're still at 22 ships. - [Josh] Yeah, still not a lot of new ships there. And while the new cables do provide a lot of redundancy, you also don't want your handful of super high-capacity cables to go down 'cause it's difficult to sort of move that traffic over onto other routes. - [David] Yeah, as you were talking to people, did you get a sense that there are new kinds of threats to these cables too? Whether it's some of the ones that have been there a long time getting old and not getting replaced quickly enough, or climate change, or like the geopolitics of the internet, which are becoming a bigger and bigger deal all the time. Is there a sense that this could get worse, rather than better, as we fight about undersea cables? - [Josh] Geopolitics are the big thing. Climate change will make certain things harder. All these cables all land on the coastline, which is eroding and sinking, and that will be a problem. But part of the reason you're also hearing more about cables is the geopolitics around them have become really sensitive. Largely that has been China-US conflicts. You have the US saying, \"We don't want Chinese-owned cables landing in the US,\" and China also denying repair permits for the South China Sea, or sort of slowing them down. And concerns about routing cables through China's waters or into Hong Kong has caused this kind of reconfiguration of the network. You have alternate routes going through the Philippines or a lot of cables landing in Singapore or China trying to build up its own cable maritime industry so that it doesn't have to rely on the West. And these changes are making it... It's not necessarily harder, but they're very different. It's just a period of change in the industry and kind of one that is increasing, getting increasing attention from various governments, that more governments are saying, \"We need to control this infrastructure in some way.\" - [David] And as you talk to people in this small kind of under-talked-about and under-resourced industry, is the sense that given all of that, it is just change and this is stable and this is how we're gonna keep doing things? Or do you run into people who are like, \"Screw all of this, the answer is satellites, and we have to get there as quickly as we possibly can,\" or like is this just what it is and we have to figure out how to do it better? - [Josh] There's a fair amount of concern, I think, about the long-term sustainability of the industry. It can't all be satellites. That was the other thing that everyone reminded me of. Satellites can carry like half a percent of the global traffic. It's gonna be cables, they're just way more efficient and cheaper to transmit data. There's a sense that they will have to navigate this. I think the industry has been pretty stable for decades and there's some anxiety about these changes. The big tech companies coming in, governments taking a greater interest, the sort of geopolitical jockeying around cable routes that are just gonna be tricky, I think. A lot of the anxiety comes from kind of the market forces involved. Like the big tech companies, they have so much buying power, they're can drive down prices, and so they can negotiate lower rates. And so, well, that means maintenance companies can operate year to year and maybe it means they don't have enough to invest in a new vessel. And so you have this kind of slow degradation, which also means that they have trouble recruiting 'cause no one wants to join this sort of Asian fleet. - [David] Sure, yeah, having done this whole process of reporting and sort of understanding how this world works, has it changed the way you think about the internet? Like, I feel like the more I learn about the actual infrastructure of the internet, the more remarkable it seems that any of this ever actually works. And I feel like I got some of that sense from your story that, on the one hand, this is this incredibly robust, incredibly impressive group of people working on this thing that we understand and have worked on for a long time. On the other hand, the internet is forever, like one wayward anchor away from falling apart. - [Josh] Yeah, it's really... It's one of these cases I feel like you hear about everybody so often. Like, the ways in which the internet is just sort of this cobbled-together apparatus is way less stable than it seems. This is just sort of an ordinary user. It does depend on just sort of these random people. Whether it's like a software engineer who's keeping things running or these people who are really good at catching internet cables with hooks in the ocean that, if it weren't for their sort of largely invisible work, the system would fall apart. - [David] All right, Josh, we gotta take a break, but thank you as always. Appreciate you coming on. - [Josh] Thanks for having me. (upbeat music) - [David] All right, we gotta take a break, and then we're gonna come back and talk about computer chips. Really, really fast computer chips. We'll be right back. (upbeat music) (jaunty music) Welcome back. A couple of weeks ago on this show, we talked with The Verge's Tom Warren about Microsoft's whole AI vision, and specifically this idea of AI PCs. Still not really sure what that means, but Tom mentioned that Microsoft believes that a new generation of chips coming out from Qualcomm might bring Windows PCs up to par with Apple's latest Macs, at least performance-wise. And that that might be a really big deal. Since then, Tom has been doing more reporting on all of Microsoft's plans, and I haven't been able to stop thinking about what might happen if we really did get that kind of huge jump in PC performance. So I asked him to come back on, along with The Verge's laptop reviewer, Joanna Nelius, to talk about what's coming and what it might mean. Tom, hello. - [Tom] Hello again. - [David] Joanna, welcome. - [Joanna] Hello! Excited to be here. - [David] This is gonna be great, okay. So let's talk about laptop chips, the coolest, sexiest thing in technology. Basically, Tom, you and I a couple weeks ago, Talked about what Microsoft is up to with AI PCs and this idea that like we're about to get this kind of massive uptick in the performance of laptops, and everything is gonna be wonderful and solve all of our problems forever. I want to talk about what that actually means. So Joanna, you're a laptop reviewer. Tom, you cover all of our Microsoft stuff, and between us we're gonna figure out the future of Windows laptops. Does that sound good? Does this make sense? - [Tom] Somehow, we will. Maybe, yeah. - [Joanna] I gotta get my crystal ball. Hold on. - [David] Yeah, we are, once and for all, going to decide what an AI PC is and we're gonna do the world a great service. But Joanna, I wanna start with you because I feel like we have been talking about this idea of a Qualcomm-powered PC being sort of a new, and different, and better thing for a long time, and that has not really come to pass. Is that fair? Like, am I the only one who has been dreaming about this for a very long time? - [Joanna] I mean, no, I think that's really fair to say. Now, it kind of looks like it may actually come to pass. The jury is still out on whether or not it's going to overtake, let's say, Apple M chips or anything else. But kind of based on like what I've been reading and what I've seen, I think it will compete very heavily with everything else that is in the space. I don't think it's gonna be like, \"Yes, this is now the best thing ever.\" I think it's nice that we're going to get another viable option and further just kind of differentiate what actual chips are in the systems that we use and perhaps our future purchasing decisions will be based on what we actually need the laptop for and what chip is in it, rather than just getting like an x86 chip in everything. So, yeah. - [David] So that's actually a good way to think about this, right? And I think even just backing up a few years, like explain sort of the difference in even like the promise between the two 'cause I feel like there's the kind of Intel x86 world and then Qualcomm has been trying to carve out a different kind of computer for a while now. Like, how would you frame the differences between the two? - [Joanna] Oh, goodness. I think for that, like I think we gotta look at Intel AMD, Apple, and now Qualcomm because they're all doing different things with x86 and ARM architecture. So Intel x86, but it has the big.LITTLE core difference, the performance cores and efficiency cores. Apple does the same thing, but on ARM. AMD, it's just traditional x86, it's fine. Qualcomm is on ARM, but it doesn't have the big.LITTLE architecture, right? And I think what's really kind of exciting and cool about all those differences is that because we have been able to shriek the transistor sizes on the actual ships so small, the historical sort of issues that came with either clock-based instruction sets or what is it, RISC versus CISC, x86 has always been more hardware-based. So with the drive into AI and Moore's Law kind of hanging in the balance, I think like there comes this question of, \"Well, if we want our chips to handle these AI workloads, right, we gotta move into an architecture that's more software-based rather than hardware.\" And also, I think it could potentially maybe lower prices a little bit. Like, you can get... Like, I hate to use the term, but word bang for your buck from like an ARM architecture. But like all these AI models like still needs something that's really, really fast in order to be able to run them. So I think Qualcomm's approach is very interesting in that aspect 'cause it has a long history in the mobile space of kind of doing the same thing. So maybe it's gonna be great right out the gate, but if you're still sticking on the x86 platform, I don't know how much longevity that is gonna have with Moore's Law and everything else since it's a hardware-based system. So that's my very nerdy answer, so- - [David] No, it's a good one. And Tom, I feel like Microsoft specifically has tried harder to make this work than just about anybody. And it's possible, that might be my own bias 'cause like I find the Surface line fascinating. So maybe this is a bigger Windows push than I'm realizing, but I feel like for way too many years now, Microsoft has been like, \"Qualcomm chips in Surfaces. It's gonna be sick, you're gonna love it, everything's gonna be great.\" - [Tom] I had that turn out. - [David] And it's just a lie. Like, why is Microsoft so invested in this? - [Tom] Well, because it's the way that the industry's heading, right? Apple has pioneered with their own Silicon, like a transition like we haven't really seen before, and they did it without emulation, right? So they did it by translating those instruction sets. So essentially translating the way that app works. So you tell to do one thing and use one piece of hardware, and Rosetta, which is Apple's thing, translates that and makes it run natively on that particular CPU. So Microsoft tried this emulation stuff about a decade ago with Windows RT and Surface RT. There's that first... The first iteration of Surface was- - [Joanna] Oh, wow. - [David] I remember that one. - [Tom] It was an ARM push, right? That didn't really work out, it was very slow, there wasn't enough apps, there was this confusing desktop interface. It was just all... Yeah, it was just a bit of a messy transition, really, because they tried to go this like... Steven Sinofsky was in charge of Windows, and he really saw the vision of the iPad, the full screen apps, and really wanted to impress that on Windows. That didn't really work out. So then they kind of went to Qualcomm, with their tail between their legs essentially, and teamed up with them as an exclusive partner to then do Windows 11 and Windows 10 sort of on ARM stuff. It's better than those, the dark days of Windows RT and that confusing mess. (everyone laughing) But it's still not quite there because the Qualcomm chips just haven't really delivered the sort of performance. And like obviously, I wrote about internally at Microsoft, they're thinking these latest chips, these Snapdragon X Elite will sort of bridge that gap of performance. But the key thing, I think, will be the thing that Apple's really nailed is the performance per watt and the efficiencies there. And that's really important because you get really good performance, but it's not hitting your battery life. So you don't have like a five-hour battery life. You'll get all day battery life, is what they're saying, but what that translates into. But if they can get close to like the M3 battery life and performance, then it's gonna be pretty interesting time for Windows on ARM. Especially as there's like rumors of cheaper variants of the X Elite. Saw a story last week, like X Plus or something like that. So that could also open it up to more and more laptops 'cause these have been pretty high-priced items so far. - [David] It is very important that if you're going to copy Apple's Silicon strategy, you have to have a series of very confusing names that don't actually make any sense to anyone in terms of buying their chips. So I'm glad to hear that Qualcomm is just gonna name everything a bunch of words that don't make any sense. But it seems to me like... Personally, the reason I have always kind of rooted for the Windows on ARM thing to work is that it feels like there was this dream we were promised, maybe not all the way back to the Surface RT, but almost that far back of like a very thin, always connected with the cellular connection that you get with Qualcomm stuff laptop/tablet that is more portable and lasts forever. Like I feel like it was years ago that they were promising like 24 hours of battery life out of some of these things. And it's like, \"Well, sure, it lasts forever. It will do one thing in the 24 hours that it lasts because the performance sucks. But Joanna, like that sort of triumvirate of like power, battery life, and connectivity feels like it kind of doesn't exist in the Windows world right now, right? Like, am I not giving it enough credit? - [Joanna] Like, it's gotten a lot better. Like, for sure. The last maybe like five years or so, maybe four, like there's been a greater focus on power efficiency. One, I think to Tom's point, like it's very much being driven by Apple when they brought their M chip to market, then it was like, \"Oh, now it's game on. Like, we really gotta do this.\" And then there's sort of like the broader scope of like being eco-conscious, and conserving energy, and everything else that's kind of also falling into it, especially with a lot of news reports that come out, and they talk about like how much power, like data centers just suck up. And how much power is needed to run like AI processes in the cloud, right? So what we're already kind of seeing is that companies are starting to rethink like, \"Okay, well, we need to like give people the ability to like run AI models like on their local device, right?\" Because that's what's going to give more longevity to what it is that they're trying to do. - [David] I confess as we've been talking about this, Tom, and in your piece you wrote basically that Microsoft feels very confident that its new lineup of devices with the Snapdragon stuff is going to match the M3 on performance. Match or exceed, right, that they feel good that it's going to be a real competitor. My immediate reaction is like, \"Cool, that's actually not the thing I care the most about in my laptop.\" Like, if you could give me something that ran Windows and got 85% of the M3's performance and 105% of its battery life, like I'd rather have that personally. - [Tom] Yeah, I think we all would. - [David] But I also like... Joanna, your point is really interesting that like maybe what we're actually heading towards is a gigantic leap in the performance we ask of our laptops if we're gonna start running these local AI models. If this idea of an AI PC is going to be become true, then like I sincerely believe that it's been a decade since most people were running up against the performance limits of their computer. But maybe we're headed back towards that. And Tom, maybe that's why Microsoft cares so much about this at this particular moment. - [Tom] Yeah, like it's interesting the way that they're thinking about it internally because it's a battle between Qualcomm and Intel for all this sort of AI processing. And Microsoft shipped a laptop last year, the Surface Laptop Studio 2. That one had like some really custom NPU from Intel 'cause they hadn't obviously put it on the main Core Ultra chips that they've started shipping. But even that one is not very powerful. Like, it can do the sort of basic background noise removal stuff that's integrated into Windows. What I found fascinating about that push was that they didn't really explain what the NPU is really there for beyond that. And I mean, that's the key thing that I wanna see in May at this Microsoft event is like: What is the NPU actually gonna be used for for these local tasks? Like, they're obviously gonna have their own Windows features, but I'm more curious how devs will be able to like leverage this and software and stuff. And speaking to Intel, they did some recent stuff with some software developers where it can scam malware locally on your machine so it doesn't take up your CPU, which is... Yeah, I mean, that sort of stuff's kind of interesting if you can offload that. But then what else do you offload? Like how much is too much? And yeah, like it's gonna be interesting to see how that works exactly. But I think more interestingly, the way they count this is by T-OPS, or TOPS, or however you wanna say it. - [Joanna] TOPS, yeah. - [Tom] Yeah, and I think the Intel one, the Intel Core ones that they call themselves as AI PCs are like 10 of that unit. And the ones in the Snapdragon X Elite and stuff are like 40. So a 4X. - [Joanna] Oh, wow. - [Tom] Like a four times bump on that. And then the next gen ones after that are obviously gonna be even more. So they're actually... Microsoft actually calling the Qualcomm Snapdragon X Elite laptops that are coming next-gen Copilot PCs. So that's where their thinking is, right? Because they're obviously... They don't wanna come out and say Intel's Core Ultra ones just aren't gonna cut it. But they obviously don't have quite the same performance for the AI tasks as the upcoming Qualcomm stuff, which makes sense 'cause it's not ARM-native, so... And Qualcomm's been doing the NPU stuff for... Well, for years, so for quite some time. But I think that's gonna be an interesting battle about where do they offload this local AI stuff, rather than push the Copilot cloud stuff. The previous aspects, like we spoke about, the AI Explorer stuff, where it's essentially gonna be a timeline feature on your PC where you can just say to it, \"What was I doing last week when I was searching for hotels? Like, what tabs did I have opened?\" And it'll be like, \"Here's all your tabs, so...\" And it speaks to sort of like some of the way that we're seeing AI more broadly, and devices like you viewed the humane, the AI PIN, right? Those sort of devices that leverage local compute or go off to the cloud for queries, that hybrid mix or however these companies approach that. And when they get more powerful, it's gonna be super interesting to see how like Windows changes in a world where there's devices that are suddenly doing a bunch of stuff that you normally would've picked up a mouse and keyboard to do, but you could just use your voice with. And it's always been that promise, right? Like, and it's never really got there, but it does feel like we're on the edge of that potentially happening. - [David] Well, but at the same time, we're in this like impossible moment for kind of all computing. But I think Windows hits this maybe harder than anybody is. The Windows challenge has always been that there are a lot of people who wanna do new stuff on Windows, and you can give people new stuff on Windows, but there are a lot of people who do stuff that hasn't been updated since 2001. And they need it to work on their computer. And I think this is where you're talking about the Qualcomm stuff and the Windows on ARM stuff that has been challenging over the years is you can make the computer run. And even if you make the computer run, making the old apps that people need to do their jobs is a whole separate problem. And I feel like now, you're gonna tack on all this AI stuff, and it's like, \"Okay, if we were to just tear it all down, start over and build PCs made for the AI stuff that you're talking about, that's one problem to do that that also runs the weird accounting software that no one has thought about in 20 years, but is crucial to how I do my business.\" Strikes me as a whole 'nother can of worms. And like Joanna, you've been covering this stuff for a long time. Like, is that a bridgeable gap? Like I'm sort of... I think the thing we've been burned about with all of this stuff on Windows for years is that it is possible to do all of those things at the same time, and I still am skeptical. - [Joanna] The issue we're running into is not like necessarily like speed or anything like that, it's use cases, right? So if we like go back way in history when Apple was trying to design, it's like first, what was it, the Power PC? But they were trying to do an ARM PC like decades ago, right? But the reason why it never caught on then was because developers didn't wanna port their stuff over, right? And it was so much harder to do that back then because of the speed limitations of both architectures, right? Not to mention ARM, with its different instructions that relied on more lines of code. And it also relied on a lot more RAM to be able to do all of that stuff. Now, the industry is like caught up with itself, and hence why Apple came out with its M chips. Now, I feel like we're kind of seeing more of the same. We got these AI chips with their neuroprocessing units in it that can do a variety of things at varying speeds, right? But it's like the use cases that I'm seeing, for instance, like generating music from a text prompt. Like, okay, that's cool. Like an actual like musician isn't gonna go and do that, most likely. So who's it for? And I think all these like generative AI stuff, we're still trying to figure that out. So there seems to be a mismatch between what the tech industry wants to do and what laptop users basically want their laptops to do, so... - [David] Yeah, I do think we are due for a bunch of years of there being all of this really interesting new horsepower on these computers, and a lot of people being like, \"What are we gonna do with this?\" But then, like Tom, to your point about background noise removal, like that is the sort of thing that you can just sort of offload off of your computer onto this other chip that you never really have to think about it. That just like instantly makes your computing life better. And if we can find a bunch of those, like I suddenly get very excited about the future of laptops. And I get the sense Microsoft is heading down that road with Windows kind of as fast as it possibly can. - [Tom] Yeah, it seems like it. And it's also interesting the way that they're potentially positioning their ARM Surface devices for consumers and the Intel ones for businesses. That kind of suggests for the first time that they are thinking about, like you were talking about previously, the legacy of these supporting these applications and stuff. They're starting to think of that as a consumer versus business thing 'cause obviously, predominantly, businesses need that legacy support, and it's great, right? You can still run like a MS-DOS application or a game from like the '90s like on your PC. It just opens, it works. Great, like... Of any company that builds software, Microsoft has always done a very good job of supporting that and that's probably one of their greatest traits of even on the export side as well. But yeah, like it does seem like they are starting to think: How do we split that up? And the last time they did that was obviously Windows 8, so. - [David] Which went super well. - [Joanna] No! No Windows 8. - [Tom] I actually didn't think too drastic. But are they gonna redesign Windows for an era of AI? Like, at the moment, they've just shoved a Copilot chatbot into Windows 11, which doesn't... Not much ambition there, right? Like that's not as ambitious as I'd expect them to be. Maybe AI Explorer is kind of a more the hint to, okay, how AI could really change how you actually use your PC 'cause you've literally been able to type into a prompt and bringing up your search history or whatever you've used on your PC is kind of wild. If that works in reality, and that could, yeah. Like, where they change the design of Windows and apps in the future would shift pretty big if they can leverage it well. - [Joanna] At least for me, in an ideal world, I just wanna talk to my AI chat bot. Like, I don't wanna type to it, right? And it's an accessibility thing for me because like talking requires so much less brain power than like writing does. So if I wanna go look up my search history, I don't wanna type that in. I know where to go find it, and I just wanna... Like, \"Oh, here's the little thing in my browser for history that I can see,\" I can just click on it and then I can like go through it all. Now, if you have like a long search history and you have like no idea when you found that thing or what even what that thing was, yeah, I can definitely see that being useful if you remember what you're trying to find. So yeah, it seems very similar to going into a search engine and furiously typing, like trying to find the article that you found. Now, for me, I don't save any of my search history. Like, if I need to go find something, I bookmark it and I have a little folder for it. So I know like, \"I'm gonna go back and find that.\" So philosophically, it feels like there's this organizational method that I use, and then there's tools for people who maybe don't organize the same way like I do. And that's kind of like where AI is heading. - [David] As someone whose entire organizational strategy is just to open several thousand tabs and then close them when my computer collapses, your way sounds better. All right, before I let you go here, let's just wildly prognosticate for a couple of minutes. So let's assume these Qualcomm chips come out, and they are everything they are promised to be: the efficiency is unbelievable, the performance is out of control. They are like, they finally did the thing. Are we gonna get like a whole new generation of new kinds of PCs as a result? Like, if this is what we think, does it stand to sort of change what our computers are, or is this just like bringing Windows kind of up to par with some of the best of what you can get from Apple right now? - [Tom] No, like, I don't think so. Like the hardware will still be pretty much the same. We've already seen the limits of what they can do with the chassis anyway. Like the Surface Pro X is pretty much as thin as you're gonna get this sort of hardware at this sort of stage until it really gets shrunk down even further. So I don't think it's going to change much on the hardware side. Yeah, you might get some thinner, and lighter designs, and all that sort of stuff. It will change the battery life. Like, that sort of situation, I think, would be greatly improved. But I think it's really gonna be on the software side of things, how Windows leverages the NPU, like we've been talking about. That software side is really gonna be what differentiates these devices versus the laptops that you've got of today. - [Joanna] Yeah. - [David] My great hope is that you're totally wrong, and that actually we're gonna go back to that phase we were in 10 years ago where everybody was just like, \"What if a laptop was different? - [Tom] Yeah, maybe. - [David] But I kind of think that went so badly for everybody that there's going to be real reluctance to do that again. Because, like, I think, who was it? Acer, that was just like, \"What if we put the trackpad above the keyboard?\" And everybody was like, \"That's the stupidest thing I've ever heard in my whole life.\" And I think the road to like wildly try to change what a PC looks and feels like is probably much longer than it once was even if we can do it. - [Tom] Yeah, that was like the Windows A era where there was a lot of experimentation in hardware, should we say. - [David] Yeah, which I think no one is eager to repeat. - [Tom] No, yeah. No, I think it's gonna be pretty timid, but I do hope we see thinner and lighter, like the Surface Pro X, that sort of device is really nice. If you can get more of that, that'd be nice. - [David] Joanna, what about you? Are you expecting wild experimentation? - [Joanna] Absolutely not. But if we can make chips just as powerful, but that also run cooler, we can make even thinner and lighter laptops. The issue that we're running into now is like thermals, right? And what happens when the processor gets too hot or the other components get too hot? Like, that just means it's drawing in a lot of power. And what is it doing? It's using more energy, it's depleting the battery life, right? So there are companies who have figured out like a nice balance with that. Like, I find Lenovo does a really good job at balancing power and their battery life. So until we can like make chips that run cooler, I think that we won't like, one, see as many use cases on the software side of things. And then we also like will be limited to what sort of like new laptop form factors can come out. Like, I would love to see one of these Qualcomm chips in a dual OLED display laptop. Like the Zenbook or the Lenovo Yoga Book. I think that if it goes like the best way possible, the Qualcomm chips will open the door for new, for other laptop form factors that companies are already starting to ideate and experiment with. And I find that side of the industry far more exciting because at least for me, having a dual-screen laptop, it opened up a lot more possibilities to like my workflow and everything else. Whereas awesome, there's an AI chip in this thing, but there's no... I don't really use it for what they're saying it's designed for. So for me, it's not that, to use lack of a better word, like that impressive because I'm like, \"Well, it's fast. That's great. It's not for me, though, so...\" - [David] Yeah, that's fair. I'm just saying, if the flippy laptop comes back, I will be happy with Qualcomm forever. That's all I need. Just give me a laptop that flips all the way around for no particular reason and I'm a happy guy. All right, Tom, Joanna, thank you both. - [Joanna] Thank you. - [Tom] Thank you. - [David] We gotta take one more break, and then we'll be back to do a question from \"The Vergecast\" hotline. (upbeat music) (jaunty music) (phone ringing) All right, we're back. Let's get to the hotline. As always, the number is 866-VERGE11. The email is vergecast@theverge.com. We love hearing all of your questions and we try to answer at least one on the show every week. This week we have a question from Tony. (phone beeping) - [Tony] Hi, Vergecasters, this is Tony. I'm in the market for a new e-reader. I have books on Kindle, EPUB format, and PDFs. I've been thinking about getting a BOOX Palma but the price and it being kind of stuck on Android 11, maybe be obsolete too quickly is holding me back. Should I just go the normy route and buy a Kindle? Also, how's the new Kobo Colour, and why do I feel more complete when I buy a new gizmo and gadget? Any help you could give me would be great. See you. - [David] All of the existential questions of \"The Vergecast\" rolled into one. There is only one person on earth who is the most qualified to answer this. Alex Cranz. Hello. - [Alex] Hey. Yeah, I know why I feel better after I buy a gizmo. It's just like retail therapy. It's just... It's magic. - [David] There's just something where you're like, \"I have now acquired this, and I'm gonna use it well, and it's gonna make me better.\" Especially with reading gadgets. There is something to like, \"Ah, I've really fallen off on deep classic fiction, and this is the thing that's gonna get me back into it,\" and it never is. So I wanna answer this question kind of in reverse. - [Alex] Okay. - [David] Tell me about the Kobo, you've now had it for a few days. Early thoughts. - [Alex] I like it. So I've got both the Libra and the Clara, and I've been using the Libra more. In fact, right after I finished recording this, running over to the library to update my library card. - [David] Nice. - [Alex] So that I can get some books on it because it's got overdrive built in, which is really exciting. But it's also a Kobo e-reader, so it's like built for Kobo's bookstore and stuff. So it's a little more difficult to use. Like, it's a little more difficult to get all your books on it if you're not already in the Kobo ecosystem. But it's still really good, and it's super light, and it's just like it moves fast. It just like, I'm like, \"Ooh!\" I make that noise every time I like turn it on. Just like, \"Oh, it's just, it's just going!\" - [David] I really, just the one screenshot I keep seeing of the home screen of the Colour where you can actually see the color on all the book covers, I'm just like, \"Ugh, I want that.\" - [Alex] It's wonderful, but also it is, in no way, perfect. - [David] Yeah, I believe it. - [Alex] Kaleido 3, the technology they're using is really good. And it is so much better than previous iterations of Colour E Ink. But it's still... Like the colors aren't as vibrant as you're used to on other displays or even just like print magazines. - [David] Yeah, it's fair. And I think to some extent, that's fine. Right, like I think, I don't know. I've now used these devices long enough that I think anybody who is like mad about the pixel density of E Ink is kind of barking up the wrong tree. That's just not the point. I think it's good enough in most cases. But then it's weird because Colour does introduce a thing where like when it's just sort of black on gray, you don't notice it quite the same way, but I can imagine when you have theoretically lots of colors, you're gonna notice the things that don't look good more. - [Alex] Yeah, and you really notice that on like the Android E Ink tablets that do Colour. Like it is really, really noticeable. It's a lot easier on this one, and I think for most people, if you're ready to dip your toes into Colour E Ink, I need more time with it. But I suspect Kobo is the way I'm gonna push people for a little while 'cause it's just like, it's a nice-ass e-reader so far. I'm enjoying it. But yeah, it's not quite iPad-worthy. So if you're still like, \"I want it to be an iPad,\" I'm sorry. - [David] Yeah, I do think... Like the first question I ask people now who ask what e-reader to buy is: Are you sure the correct answer isn't an iPad Mini? Because I think for a lot of people, the correct answer is an iPad Mini. It's also like three times the price in a very different battery life story and all of that. So- - [Alex] Yep. - [David] Let's just leave that one aside for now. Like Tony, ask yourself the question: Is the right thing an iPad Mini? And if it's not, let's keep going. So- - [Alex] Keep going. - [David] The question of which e-reader to buy is... I feel like you and I talk about this every time we talk about this, it's like weirdly a lifestyle decision because you're like, \"Okay, if I buy a Kindle, I am in on Amazon,\" because Amazon stuff has gotten a little more open over time and you can upload PDFs, and you can upload EPUB stuff, and it's a little better, but only a little and it's kind of a pain in the ass. And if you want to just like buy or download a book, you are gonna do it through Amazon. And Kobo, which I think used be a little more open. And I was excited about things like the pocket integration has lost a little bit of that. So they're coming towards this middle of like, you're kind of just picking your poison either way, right? - [Alex] Yeah, it's kind of like... I think a lot about the Apple antitrust thing here because it's the same thing where you're like, \"Oh, no, I have to make this decision of like ecosystem pretty early on,\" because moving to a new ecosystem is hard. And it's certainly easier with an e-reader, but you still have to go download Ko Libra. You still have to go look up a bunch of tutorials, and load it all up, and pull all your books over and then transfer over. - [David] Right, you've just lost 99 1/2% of people, right? Like, just right there. - [Alex] Yeah, most people don't wanna do that. So you really do have to say, \"Okay, do I wanna go Kobo, do I wanna go Amazon?\" And I think Kobo is doing more interesting stuff in the space right now, right? If you're looking for just a straight e-reader, not thinking about it. But that's not what... Tony's thinking about like the BOOX Palma, which is just no color, black and white, I think it's like six-inch phone. - [David] Yeah, it's an E Ink phone, basically. It's a little tiny tablet that does E Ink stuff. And actually, I have one on its way to me right now, and I'm so excited about it because I don't know if you've noticed this, but it's like a little thing that just is percolating around the internet, it's like the internet's favorite gadget. Like Craig Mod, who is a newsletter, writer, and author who I love, is like obsessed with his. Bunch of people are getting it and being like, \"This is the exact thing that I need.\" I'm very enthusiastic about it as a little tiny pocketable reading device, but it does make me nervous. And part of the reason I wanted to do this with you is to sort of check in on where we're at with BOOX because we've been, I think, enthusiastic about their potential for a while now, but it doesn't feel like we've gotten kind of the breakthrough device yet. - [Alex] I think the Palma feels closest, right? And Tony's concern was that they, it's on Android 11, it might not get upgraded. BOOX has actually been really good in the last couple of years about upgrading. - [David] Oh, okay. - [Alex] Pretty consistently. Is it always gonna be to the newest, latest flavor of Android? No. - [David] But also for what you're using these devices for. It's like if what you need is the latest download of the Netflix app, like you're buying the wrong device. - [Alex] Don't buy this for that, right? Yeah, I think like if you're looking at the Palma and your only concern is that it's on Android 11, just go get the Palma, you're gonna have a great time. It's gonna get updated at some point, like you'll be fine. - [David] Yeah, I think that's right. And I mean, I'm just thinking about this as you're talking that like this is one case where Android being so fragmented actually helps you because like on iOS, I would be much more worried about sending you to device that's a few years old because you're gonna start to get outdated software that won't support old versions of the software. On Android, a lot of these developers don't have a choice but to support wide swaths of Android. So the odds of you being able to use even Android 11 with like the Kindle app and the Barnes & Noble app and your favorite reading app, probably pretty high for a while. - [Alex] Yeah, yeah. You're gonna be using it for a while, yeah. I bought a BOOX e-reader back in like 2019. It's still getting system updates, it's still getting software updates, like it's still cruising. I can still use all the main e-reading software on it. So if that's kind of what you're looking at, Tony, just go get it. - [David] And BOOX, we should say, is more like, it's basically an E Ink tablet that runs Android, right? Is that a reasonable explanation? - [Alex] Yeah, it's an E Ink tablet. It's an Android E Ink tablet. They do their own kind of custom launcher and stuff. And you could theoretically go do it, your own launcher, but stick with theirs because it's built for E Ink. And that's the really big friction you notice with those Android E Ink tablets is they're using apps that weren't built for E Ink, and you just run into little hiccups and quirks. - [David] But the flip side is you get all the apps, right? Like that's- - [Alex] Yeah. - [David] And I can't think of any other meaningful e-reader out there. If there is one, people, tell us, vergecast@theverge.com. Send us links to all of the cool cross-platform e-readers that exist. I don't think we're gonna get very many emails. But that's the pitch, right, with the BOOX, is they're just like, \"You can have all the apps.\" - [Alex] Yeah, exactly, that's the pitch. Because there's a couple other folks out there who are... Primarily there are Chinese-based companies who are doing this as well, and everybody's kind of settled on, \"Okay, I guess we'll go with Android,\" and do like a weird custom build of Android. But then they run into a problem of doing weird custom builds of Android is hard, and it's hard to maintain and everything, which is why BOOX is kind of ahead because they're a bigger company and they can just maintain it better. But yeah, and then all the other kind of small e-reader companies, you have to side load, and you're just stuck side loading everything, which is fine, that's what I did to skip, to start reading on the Kobo this weekend 'cause I need to buy more Kobo books. That's not everybody's bag. - [David] Yeah, and I mean, again, I think the good news is that with a little bit of work, if what you have is a library of PDFs and stuff, you can get those onto most e-readers now. Like, it's not easy, but it is doable. - [Alex] If you've got Ko Libra, you can use any e-reader you want with a little work. - [David] Right, right. And speaking of BOOX, has BOOX, I feel like they put out a new thing like every two weeks. Have they shipped anything cool and new recently? - [Alex] Nothing super cool, they've been a little quiet. We've seen a lot of... They've just been putting out like color versions of a lot of their products at the moment and a lot of just movement around the BOOX Palma. Like I'm seeing that thing everywhere, and I really wanna get it, but at the same time I know exactly what it is, and I was like, \"I have enough BOOX devices in my house.\" I was like, \"Do I need another one that's just a little smaller?\" I've used smaller E Ink e-readers like that and I just... It's not my cup of tea, personally. - [David] I was always the like pocket-sized six-inch Kindle person, and I recently got a Kindle Scribe, which is the one with the stylus for taking notes. I love that thing. It's still very light, so I can like hold it in one hand in bed without dropping it on my face. But having just a little more space, especially for things like PDFs, which don't often render super well on those smaller screens. Way better. Huge fan. - [Alex] It's nice, well, that's why I like the Libras because it's got that side that you can just hold. It's basically got a handle built in, and I am all about that. Like, I saw that with the original Oasis, and was like, \"Oh, I've now had my platonic ideal form factor for an e-reader, and I never wanna escape that.\" If it doesn't have like just a little handle on the side for me to hold a larger bezel on one side, then I don't want it. - [David] Yeah, give me buttons or give me death is what I always say. - [Alex] Yep. - [David] I could not agree more. So I think, I don't know, my instinct is to tell Tony, like probably just buy a Kindle. Like, I sort of hate that as the answer. - [Alex] No, it's get the BOOX Palma. - [David] It's get the BOOX Palma. No, you're right. It is get the BOOX Palma. Buy it on Amazon, they have a great return policy. If you don't like it, send it back. - [Alex] Yep. - [David] You're totally right, buy the Palma. - [Alex] You're gonna have fun. You'll enjoy it for a little while. And if it doesn't work out for you, you can return it or you can stick it in a drawer, and three weeks later you'll still be able to use it. - [David] Yeah, and people love this thing. Like they love it. And it's been a while since I've seen just sort of a little niche gadget. Like these sort of old heads of like bloggers all over the internet are obsessed with this thing. So I suspect you'll like it. - [Alex] I know, it makes me so happy. - [David] All right, well, Tony, hit us back. Let us know how you like the Palma. Alex, thank you as always. - [Alex] You're welcome. (upbeat music) - [David] All right, that's it for \"The Vergecast\" today. Thank you to everybody who was on the show, and thank you for listening. Again, one more plug. Read Josh's story on theverge.com. It's fantastic, and deep, and wonky, and it is excellent. Very much worth your time. There's lots more on everything we talked about at theverge.com. We'll put some links in the show notes. But as always, read theverge.com. The news is crazy and is only gonna keep being crazier for really the next several months. So check it all out. As always, if you have thoughts, questions, feelings, or want to talk about the location of undersea cables near you, you can always email us at vergecast@theverge.com. Call the hotline, 866-VERGE11. We love hearing from you. Send us all your thoughts, and questions, and ideas for what we should do on the show. This show is produced by Andrew Marino, Liam James, and Will Poor. \"The Vergecast\" is a Verge production and part of the Vox Media Podcast Network. Nilay, Alex, and I will be back on Friday to talk about more AI news, some new gadgets coming this week, and lots more. We'll see you then. Rock and roll. (jaunty music)",
    "transcript_keywords": [
        "Cable",
        "cables",
        "Yeah",
        "kind",
        "sort",
        "thing",
        "Windows",
        "people",
        "lot",
        "things",
        "Undersea Cable Management",
        "stuff",
        "big",
        "time",
        "back",
        "ocean",
        "Qualcomm",
        "Cable Management",
        "undersea cables",
        "ship"
    ],
    "transcript_entity_values": [
        "New York",
        "hours",
        "Android",
        "Windows",
        "several miles",
        "the Atlantic Ocean",
        "AMD",
        "Palma",
        "Vox Media Podcast Network",
        "African",
        "Rosetta",
        "85%",
        "a mile",
        "three",
        "Craig Mod",
        "Andrew Marino",
        "Colour E Ink",
        "a few years old",
        "the last few years",
        "FaceTime",
        "Silicon",
        "BOOX",
        "BOOX",
        "years ago",
        "a few years",
        "Alex Cranz",
        "CPU",
        "Kindle",
        "Asian",
        "Merchant Marines",
        "400 foot",
        "Meta",
        "North America",
        "weird hours",
        "every year",
        "Acer",
        "Kobo",
        "One",
        "Tom Warren",
        "the dark days",
        "Alex",
        "TikTok",
        "nearly a day",
        "several thousand",
        "This week",
        "Asia",
        "YouTube",
        "Microsoft",
        "a couple of minutes",
        "Kindle",
        "RAM",
        "every day",
        "David Pierce",
        "English",
        "200",
        "24 hours",
        "KCS",
        "the Barnes & Noble",
        "three weeks later",
        "May",
        "Windows 10",
        "E Ink",
        "this week",
        "Singapore",
        "Germany",
        "2001",
        "about a decade ago",
        "the Intel Core",
        "CISC",
        "Tom",
        "Verge",
        "Windows 11",
        "six-inch",
        "Google",
        "the next several months",
        "a couple weeks ago",
        "the AI Explorer",
        "this weekend",
        "Ko Libra",
        "iPad",
        "dozen",
        "Qualcomm",
        "Undersea Cable Management",
        "every week",
        "the Surface Pro X",
        "YouTube",
        "NPU",
        "Steven Sinofsky",
        "Thousands of miles",
        "mid 1800s",
        "South China Sea",
        "AI news",
        "20 years",
        "about a day",
        "2019",
        "'90s",
        "4X.",
        "China",
        "half a century",
        "weeks",
        "the '90s",
        "2011",
        "Netflix",
        "decades",
        "Liam James",
        "first",
        "recent years",
        "Friday",
        "Snapdragon X Elite",
        "Philippines",
        "40",
        "Windows",
        "a ton",
        "Chinese",
        "Snapdragon",
        "10 years ago",
        "10",
        "the Lenovo Yoga Book",
        "Surface",
        "last year",
        "11",
        "a few days",
        "five-hour",
        "only one",
        "Joanna Nelius",
        "Josh",
        "around 800,000 miles",
        "Windows 8",
        "Libra",
        "Windows",
        "AI",
        "Moore",
        "AMD",
        "Kindle",
        "a couple years ago",
        "a week",
        "Windows",
        "a decade",
        "David] Joanna",
        "the X Elite",
        "California",
        "US",
        "22",
        "all 800,000 miles",
        "Silicon",
        "a few dollars",
        "the 24 hours",
        "Android 11",
        "Android 11",
        "Zenbook",
        "Tuesday",
        "Western Europe",
        "the decades",
        "Tony",
        "Oasis",
        "Macs",
        "The Vergecast",
        "last week",
        "Josh Dzieza",
        "Fukushima",
        "Kobo Colour",
        "second",
        "Hong Kong",
        "Core Ultra",
        "Colour",
        "99 1/2%",
        "Batman",
        "Lenovo",
        "like thousands of miles",
        "a couple of hours",
        "Zoom",
        "1,000",
        "Intel",
        "866-VERGE11",
        "13 years",
        "iPad Mini",
        "First",
        "A couple of weeks ago",
        "Moore",
        "the Surface RT",
        "Kindle",
        "thousands of miles",
        "M3",
        "several decades old",
        "several days",
        "Starlink",
        "one",
        "like three minutes",
        "fourth",
        "Apple",
        "500",
        "the Luzon Strait",
        "four",
        "a bunch of years",
        "Kindle, EPUB",
        "days",
        "Apple M",
        "David] Interesting",
        "the Red Sea",
        "World War I",
        "today",
        "Palma",
        "Libras",
        "Surface RT",
        "the Ocean Link",
        "Europe",
        "year",
        "the 19th century",
        "UK",
        "800,000 miles",
        "several decades",
        "months",
        "the years",
        "years",
        "New Jersey",
        "at least one",
        "Clara",
        "America",
        "the United States",
        "several more days",
        "Africa",
        "the last couple of years",
        "two",
        "the Surface Laptop Studio 2",
        "Windows RT",
        "the AI PIN",
        "Amazon",
        "David",
        "Apple Watch",
        "Japan",
        "five years or so",
        "about 70",
        "Joanna",
        "105%",
        "David] Nice",
        "Kobo",
        "the last mile",
        "2022"
    ],
    "transcript_entity_types": [
        "GPE",
        "TIME",
        "ORG",
        "ORG",
        "QUANTITY",
        "LOC",
        "ORG",
        "GPE",
        "ORG",
        "NORP",
        "PRODUCT",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "NORP",
        "PERSON",
        "EVENT",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "FAC",
        "NORP",
        "NORP",
        "QUANTITY",
        "ORG",
        "LOC",
        "TIME",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "LOC",
        "ORG",
        "ORG",
        "TIME",
        "GPE",
        "ORG",
        "DATE",
        "PERSON",
        "NORP",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "GPE",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "EVENT",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "DATE",
        "LOC",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "CARDINAL",
        "NORP",
        "QUANTITY",
        "NORP",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "LAW",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "ORG",
        "GPE",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "MONEY",
        "TIME",
        "FAC",
        "WORK_OF_ART",
        "PRODUCT",
        "DATE",
        "LOC",
        "DATE",
        "PERSON",
        "LOC",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "GPE",
        "ORG",
        "ORDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "PERCENT",
        "PERSON",
        "ORG",
        "QUANTITY",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "LOC",
        "EVENT",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "LOC",
        "DATE",
        "DATE",
        "GPE",
        "QUANTITY",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "GPE",
        "CARDINAL",
        "GPE",
        "GPE",
        "GPE",
        "DATE",
        "LOC",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "PERSON",
        "ORG",
        "QUANTITY",
        "DATE"
    ],
    "vector": [
        -0.09472816437482834,
        -0.07645940035581589,
        0.03297939896583557,
        -0.08212462812662125,
        0.026548944413661957,
        -0.03292519971728325,
        -0.028685754165053368,
        0.04969271272420883,
        0.008969862014055252,
        0.0007947677513584495,
        -0.06277068704366684,
        0.056498270481824875,
        -0.01993524469435215,
        -0.034464992582798004,
        0.016071917489171028,
        -0.02598208747804165,
        0.1129450723528862,
        -0.14247825741767883,
        -0.014513259753584862,
        -0.009189922362565994,
        -0.05936013162136078,
        -0.053729236125946045,
        0.008304939605295658,
        -0.0703527182340622,
        -0.002801744034513831,
        -0.00511143496260047,
        -0.008933085948228836,
        -0.05319130793213844,
        -0.04473784565925598,
        -0.04136456921696663,
        -0.05130675062537193,
        0.02034800499677658,
        0.015046365559101105,
        0.0011135119711980224,
        -0.05119257792830467,
        -0.09848383814096451,
        0.06427635252475739,
        -0.030627310276031494,
        -0.1039644107222557,
        -0.06526652723550797,
        0.050888802856206894,
        -0.09139356762170792,
        -0.02042212337255478,
        0.04877284914255142,
        0.06266768276691437,
        -0.0479123592376709,
        0.02492689900100231,
        -0.029653236269950867,
        -0.007809990551322699,
        0.0381900891661644,
        -0.09271660447120667,
        -0.13687628507614136,
        0.0618743859231472,
        0.04880329221487045,
        -0.0619904063642025,
        0.01663893274962902,
        -0.036382030695676804,
        0.021573347970843315,
        0.05920175462961197,
        0.03668338805437088,
        0.08239798992872238,
        -0.11488379538059235,
        -0.017401769757270813,
        0.09896083176136017,
        0.022952355444431305,
        0.025526314973831177,
        0.05612929165363312,
        0.0525411032140255,
        0.01965457573533058,
        -0.03632041811943054,
        -0.022983236238360405,
        -0.025112474337220192,
        0.016135198995471,
        0.07534275949001312,
        0.046143751591444016,
        -0.007364028599113226,
        0.15128526091575623,
        -0.022799642756581306,
        0.03601767495274544,
        -0.0008581057190895081,
        0.008311892859637737,
        0.0031875898130238056,
        -0.01261203270405531,
        -0.012608450837433338,
        -0.0022732072975486517,
        -0.013116603717207909,
        -0.009793821722269058,
        -0.026504576206207275,
        -0.03177352622151375,
        -0.07297713309526443,
        -0.020791178569197655,
        0.06359533220529556,
        0.07514483481645584,
        0.02001272514462471,
        0.0669151321053505,
        -0.005610778462141752,
        -0.021775487810373306,
        -0.08630717545747757,
        -0.0588475801050663,
        0.050876304507255554,
        0.02733694389462471,
        0.04276540130376816,
        0.005845192354172468,
        -0.037722911685705185,
        -0.02507956698536873,
        -0.04592302069067955,
        -0.011131471022963524,
        0.07464339584112167,
        0.0093163987621665,
        0.023916613310575485,
        -0.04091066122055054,
        0.014716316014528275,
        -0.02354579232633114,
        -0.027254370972514153,
        0.0067183952778577805,
        -0.018578028306365013,
        -0.00022961903596296906,
        0.08005265891551971,
        0.16669324040412903,
        0.02582293003797531,
        -0.027801819145679474,
        0.027069713920354843,
        -0.031224627047777176,
        0.006969362031668425,
        0.07731793075799942,
        0.014379151165485382,
        -0.0497802272439003,
        6.05219943846957e-33,
        -0.016613060608506203,
        0.060140930116176605,
        -0.030510207638144493,
        -0.07221134006977081,
        0.02910286746919155,
        0.004441559314727783,
        0.006422676611691713,
        0.049009259790182114,
        -0.0653727650642395,
        -0.017977694049477577,
        -0.08564110845327377,
        0.06292303651571274,
        -0.07613623142242432,
        0.05519438907504082,
        0.0759277194738388,
        -0.0783708319067955,
        -0.030279986560344696,
        -0.016032198444008827,
        -0.08976376801729202,
        0.006811424624174833,
        0.02276531793177128,
        -0.04495078697800636,
        0.020433690398931503,
        -0.07530706375837326,
        0.041113756597042084,
        -0.01627090573310852,
        -0.02508232742547989,
        0.0016952112782746553,
        0.09375295788049698,
        0.042481113225221634,
        -0.06214296072721481,
        -0.05642465502023697,
        -0.029643729329109192,
        -0.03693196177482605,
        -0.02790314331650734,
        0.041180569678545,
        -0.06441552191972733,
        -0.08091003447771072,
        0.03433480113744736,
        0.08785781264305115,
        -0.07376650720834732,
        0.03880719840526581,
        -0.03472384065389633,
        -0.06835825741291046,
        -0.0038127810694277287,
        0.006660502403974533,
        0.02626461535692215,
        -0.02834521420300007,
        -0.046871285885572433,
        -0.004812606144696474,
        -0.029244566336274147,
        0.03655387461185455,
        -0.0076975529082119465,
        0.046634022146463394,
        0.024525852873921394,
        0.02495548687875271,
        0.027895605191588402,
        0.02544088289141655,
        0.06626597791910172,
        0.051244232803583145,
        -0.04535285383462906,
        0.0027754376642405987,
        0.011374481953680515,
        0.02228107489645481,
        -0.08781310170888901,
        0.07237432152032852,
        0.11854111403226852,
        0.022342020645737648,
        -0.13491444289684296,
        0.034519780427217484,
        -0.05920335650444031,
        0.0010889595141634345,
        -0.008616632781922817,
        -0.04415236413478851,
        -0.042834945023059845,
        0.019212983548641205,
        -0.09624552726745605,
        -0.03866233676671982,
        0.006077466532588005,
        0.034568965435028076,
        -0.008083297871053219,
        -0.00786301027983427,
        0.04125424474477768,
        -0.018253901973366737,
        0.01212542224675417,
        0.021392634138464928,
        0.027924247086048126,
        -0.042974743992090225,
        -0.047272469848394394,
        0.012709108181297779,
        -0.037069305777549744,
        0.04583554342389107,
        0.03447512909770012,
        0.04943351447582245,
        -0.019447553902864456,
        -5.837486946426233e-33,
        -0.06743238866329193,
        -0.04108251631259918,
        -0.0647488385438919,
        0.0633515864610672,
        -0.034587811678647995,
        -0.07000893354415894,
        0.05262063443660736,
        -0.04665086790919304,
        0.0028373990207910538,
        -0.03201732039451599,
        0.01194455474615097,
        0.028393374755978584,
        -0.007827996276319027,
        0.010710934177041054,
        0.003782394342124462,
        -0.041087556630373,
        0.03553001582622528,
        -0.09645337611436844,
        0.024795880541205406,
        -0.07116404920816422,
        0.05571902543306351,
        -0.0031838903669267893,
        -0.023956650868058205,
        -0.003999241162091494,
        0.02586541883647442,
        0.02896757982671261,
        0.0689755529165268,
        0.060108304023742676,
        -0.02903873100876808,
        0.015802696347236633,
        -0.009429256431758404,
        -0.015532110817730427,
        0.012141533195972443,
        0.00512827280908823,
        0.10169990360736847,
        0.12812891602516174,
        0.05494470149278641,
        -0.004952822811901569,
        0.018148574978113174,
        -0.031151434406638145,
        0.08997891843318939,
        0.013390441425144672,
        -0.02893689274787903,
        -0.05071047693490982,
        -0.00427675386890769,
        0.03191047161817551,
        -0.1227201521396637,
        0.015253076329827309,
        -0.07296174019575119,
        -0.013011430390179157,
        0.028125761076807976,
        0.06535933911800385,
        0.03899926319718361,
        0.02073538303375244,
        -0.05689725652337074,
        -0.02045535296201706,
        -0.044873230159282684,
        0.08952108770608902,
        -0.05183021351695061,
        0.027906719595193863,
        -0.0006486718193627894,
        -0.02178189717233181,
        -0.050647858530282974,
        -0.03641508147120476,
        0.06643359363079071,
        0.008327402174472809,
        0.08649686723947525,
        -0.008493735454976559,
        -0.03487272560596466,
        -0.032966431230306625,
        0.03871619701385498,
        -0.03092898800969124,
        -0.04052438214421272,
        -0.08178605139255524,
        -0.028074920177459717,
        0.07906481623649597,
        0.03534684702754021,
        0.01496999990195036,
        -0.06838315725326538,
        0.038433995097875595,
        -0.04393148794770241,
        0.07498198002576828,
        0.06337008625268936,
        0.05297120288014412,
        0.06942905485630035,
        0.047563400119543076,
        0.05930221825838089,
        0.0008813997847028077,
        -0.04030365124344826,
        0.0045248535461723804,
        -0.0382588654756546,
        -0.026987982913851738,
        -0.11450883746147156,
        0.07235676050186157,
        -0.0004870631091762334,
        -6.042934330707794e-08,
        0.03022407554090023,
        -0.007711026351898909,
        -0.018190989270806313,
        0.035169899463653564,
        0.006147667299956083,
        -0.012945769354701042,
        0.00937228836119175,
        -0.038674354553222656,
        -0.000949920155107975,
        0.017794808372855186,
        0.055611561983823776,
        -0.0734168067574501,
        -0.07843233644962311,
        0.07417291402816772,
        0.10825804620981216,
        0.07118384540081024,
        -0.05212573707103729,
        -0.058308955281972885,
        -0.033834997564554214,
        -0.055398620665073395,
        0.05297372490167618,
        0.024844562634825706,
        0.06681831181049347,
        0.017897656187415123,
        -0.002582729794085026,
        0.057097550481557846,
        -0.0020145417656749487,
        0.019875982776284218,
        0.04551305994391441,
        0.010154570452868938,
        -0.11457401514053345,
        -0.028993187472224236,
        0.03315998241305351,
        0.03423726558685303,
        0.011529497802257538,
        -0.01914660818874836,
        0.025347620248794556,
        0.07571371644735336,
        0.058895885944366455,
        0.11496642231941223,
        -0.0301476139575243,
        -0.08794422447681427,
        0.04462280124425888,
        0.0002634272677823901,
        -0.011045603081583977,
        -0.03474532440304756,
        -0.05172847956418991,
        0.005051444750279188,
        0.018535058945417404,
        -0.02640996128320694,
        0.010060487315058708,
        -0.0042680357582867146,
        0.051020197570323944,
        0.03970292583107948,
        0.02411583997309208,
        -0.052340101450681686,
        0.013814905658364296,
        -0.04196986183524132,
        -0.05353023484349251,
        0.12863367795944214,
        0.047083545476198196,
        -0.10012521594762802,
        -0.028801431879401207,
        0.060601942241191864
    ]
}