{
    "id": "BL01EUMqikw",
    "title": "Blindfold Mystery Tech Unboxing with Ro!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-08-07T20:55:58Z",
    "video_url": "https://www.youtube.com/watch?v=BL01EUMqikw",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 266290,
    "likes": 10080,
    "comments_count": 399,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and I'm here with Ro. - Hello! - So, we've been doing a lot of fun videos and you guys know that I have a tech channel and sometimes I stray away from tech to do some fun food things. But today, I thought I would bring Ro back into the fold of some tech. - Yes. And then I'm super jacked 'cause I had a lot of Wiz Fizz, Fizz Wiz. - We did a video on her channel trying Australian candy and snacks and I've never had Vegemite before in my entire life. I thought I had until I tried it and realized - It was a lot. - Spoiler! It was not good. You can go see that video on Ro's channel and I'll put a link in the description. Today, we've got a little blindfold and I brought some tech. - Yes. - So I kinda have like a tech closet where a lot of stuff that I don't get to right away, it kind of starts piling up after a while. So I went through my closet today and found a few items and I was trying to find them that would be kind of difficult for you to guess, but also not too difficult. - (gasps) Oh no. 'cause some of them, you might even look at it and not even know what it was anyway. - Oh, no. - [Justine] Yeah. - So Justine comes over and she's got a bag of stuff and she wouldn't even let me peek. She had me get my cute little blindfold, I got my bunny blindfold. - I just knew that if this was a reverse situation, even though she told me not to look, my eyes would be like, Uh! I need to look. So let's start with our first item if you'd like to get blindfolded and set - Okay. - [Justine] I think the first one I might start out very easy. - Easy for you may not be easy for me because I am not a tech expert. I don't think anyone would describe me as a tech expert. - I don't think they would. Now, you may have trouble unboxing some of these things so I can give you like a little hand. - Okay. - Okay, so here's the first one. Okay, there you go. - [Ro] All right. Oh, this is nice. But you know what? This is a... it's small. - It is, yes. - Okay, and it's bigger than a DVD. People don't do DVDs... - No, they do. (Man laughs) - Anymore. - There's still DVDs. - Do they? - Yeah, yeah, they love their Blu-rays and stuff. - [Ro] Oh, look, it's like a hang-y thing. - Yeah, careful you don't get your finger stuck. - Like a display thing. - Well there's something inside of it so you can open it to really help you out. - Oh, what is this? (playful music) Oh, there's a hole here. Whoa! Okay. It's a... What is this? This opens. - Well, I can't tell you. Well, yeah, you got to figure it out. So the hole, what do you think would go in the hole? - I don't even know what this is. - Well, yeah, but okay, So you would hold it this way. (playful music) - Okay. This feels like a phone size. This is a phone. Oh yeah. But what's this? - Well, but it's not a phone. But it is a phone... - A phone case. - Yey! Ding! Ding! Ding! Ding! Ding! Ding! Ding! - Yes! I did it. - So this is actually one of my favorite companies, Nomad. They make so many cool leather accessories - What? - And it's like a little wallet thing. And since I have the larger phone, you have the smaller one. So this wouldn't fit on my phone. So this will fit on yours. - (gasps) Justine, I love it. - [Justine] Yes. - Oh look, it even has a billfold. - Oh I actually didn't know that. Oh, put some money in there. - Ooh! I can put some money, money in there. - Wow. - Okay. I got one out of one. This is going better than expected, Justine. - So the next one is something. You wanna feel the box. I'll help you open it 'cause I'm gonna keep the box afterwards. So I just don't want you to rip it so I will help you open it. - It's square. - It is, yes. - It's a pop socket. No. No. I take that back. - It is not a pop socket. - I take that back, it's not official. - You can take it back, you can take it back. - Let me help you open, I'll help you open it. - Let me open it and then I'll... - So, let's just pull this right out here. - Headphones. - You're gonna have to see. - No, okay. - You're gonna have to see. Or not see and you're gonna feel. (playful music) - Headphones, right? - You are correct. (gasps) On one, but there's more. - Headphones, you guys. - Those are headphones. - Okay, I get half a point? - Yup. - Okay. - Yup. - What else is this? Okay, Justine. This is rope? - It is a rope. - Okay, a rope with a piece of plastic at the end? - That is Exactly what it is, but there's something else. (Ro laughs) Do you want a hint? Or do you wanna just give it a feel? - It's very light. - Pick it up. Here you go, here you go. - Okay, it's very light. I'm feeling a circle. - Yup. (playful music) - You can charge it. It's a... You know what this is... Oh oh it's an... Okay. Okay. Wait, wait, wait, wait, wait, wait. Okay. You didn't think I could do that? - Oh my God! This is so great. - Okay This is a... - Okay, do you want a hint? - Okay, so headphones is for listening for stuff. It has to be for listening, the listening to a movie. This is music. This is a music stick? - It is. (laughs) - This is a, excuse me. (laughs) - It's is a music stick. - This is the things, the old school with the music on it. - What was it called? - It was this big back in the day - Like a pod, maybe? - Oh my gosh, yes, an iPod. - Like an iPod? - Is this a new iPod? Oh my gosh. What is this? Oh, is this real? What? Shut up. This is an iPod these days? (laughs) These are so... They weigh nothing. - This actually came out in 2005. (laughs) - Are you you messing with me right now? - No. (both laugh) This is the iPod shuffle from 2004,2005. - Oh, no. (laughs) - Alright. - I'm ready, I'm ready. - Next item I'm on a roll. (gasps) Oh. - Oh. - This is a big box. - Big box. So here's the... - It's a wifi connector. - It is not. - It's a video game controller. - No. - I can tell by the weight of it. - No, you can't. - It has a good weight that this is an Nintendo switch. - It's not. It's not, but let me help you open it here. - [Ro] Okay. - Here you go. - Now don't give me hints 'cause I can do this. - Okay. - First it's this little box. Oh, another box. What is this? Is it a part of it, or is it just stuff. - This is here, that's a part of it. - Oh this is very thin. Okay. Here's the three boxes. This is a phone box. So I don't think it's an apple phone. I think it's a phone, but I don't know what kind of a phone it is. And I have no clue what this could be. - Okay. - Maybe it's headphones. (gasps) Yes? - Yeah. - Are you kidding me? - No. - Okay, I was about to say charger. - Two for two - I was about to say a new charger. - Yes - That was my second... - And then what do you think this is? - A case. - Yes. Ding! Ding! Ding! Ding! Ding! Ding! - Are you serious? - Yes. - It's gotta be Samsung. Right? - No. What else is there? - Googles? - Yes. Ding! Ding! Ding! Ding! Ding! - Yes. Yes. Yes. Yes. Yes. Yes. Yes. Okay. There we go. - Okay. But what's exciting about this, Is this. - This, clean foam boxes - Is their Mandalorian Star Wars AR experience collaboration? - (gasps) Shut up. - Yes. So I've had this on my shelf and I have been meaning to open this. And finally, today is the day is the day. - Didn't plan this, I'm matching. - Okay. Ro, are you ready for the next one? - I'm ready, I'm feeling good. I'm feeling more confident. It's square, It's light. This is... - [Justine] Oh, there you go. Yeah. It's opening. - This box opens very easily. Very nice. This is foam. - So, there's the item. - This is a glass, this is a glass. Oh gosh, what is this? - I mean, if you guess this, I will, I will... don't even know what I'll do. I'll probably go to the nearest... - What the heck is this? A GPS? A GPS. - That is not a GPS. - This is a... Justine, I mean, what the heck? This is a GPS. - It's not a GPS Do you want me to tell you how much that costs what you're holding in your hand right now? - This is a... Yes, please tell me how much this is. That will help me. - That cost about $2,000. (playful music) - This little piece of metal? - That little piece of metal. - It's a TV. (laughs) - No, that's not a TV. - I can feel the screen. It's a mirror that you hold up to your face, and it scans your face, And it tells you your fitness facts. I'd pay two grand for that. - I would too. For it to tell me my heart rate and stuff and be like. - No. - No? - So there's only a hundred pieces of this specific item worldwide. (gasps) - Are you serious? - It is machined case from Aerospace Grade Titanium. - This is a limited piece of metal, costing $2,000, fits in the palm of your hand, has a screen on it, but it's not a TV, it's a computer. - This is number five of a hundred made. - And it doesn't have a GPS? - No. - Wait, let me see if there's any hints in here, - I don't think so. I don't think there's gonna be any. - It's a projector. - No. - You put it here. It projects what you're seeing on... - No. Do you want me to give you another hint? - I can't... Yeah! - So it has something to do with cryptocurrency. (upbeat mischievous music) - It mines crypto diamonds. It organizes your finances. - Well - Yes? Oh my gosh. - Do you wanna take your blindfold off? - Yes, I would like to see 'cause I'm very confused. I really thought it was a holograph machine. - So did I, and I know what it is. 'Cause you had me sold. - I'm looking at this and the brand name and I still could not tell you to save my life, what this is. - So it's a Trezor, basically like a wallet that stores your crypto keys on. - What the heck? - So it's not something that's stored on your phone. Your wallet is actually stored in this device. This is a rose gold. And it's custom made, it's beautiful. - Wow. This is... - I didn't think you were gonna get it, we had to throw a challenge in there. - Oh, wow. I mean, this has really blowing my mind. - It's so pretty and this company also has iPhone cases that are also in this aerospace machine titanium. This is their rose gold one, which is my favorite color. - Wow, It's Beautiful. - It's really pretty. - I mean, this is gorgeous and it's so heavy, it's heavy. - We have one more item. - Oh, ooh! Okay, okay, I'm ready. (excitement laugh) - [Justine] All right. - [Ro] this is so fun. - [Justine] This is great. - Oh, yes. Here's the opening. I'm gonna be careful because it's tech stuff. I don't wanna break it. - It's okay. - Oh, it's a box within a box, - Ooh, Surprise. - [Ro] Which is usually the case with these things. - [Justine ] And, we don't have to worry about the box on this one. This one doesn't need to be saved. - Oh, this is like another box, another, oh, I got it. I got it. - Cool. - Okay. (upbeat mysterious music) - Okay. That's all that's in there. - Oh, no. (mysterious music) Oh geez. What's this? Is this food product? You know what, Justine, this feels like a drawing rack. Where's that box? - Oh here it is, right here. - What's in there? - Here. - What's in... Oh, this is your charger. - Yeah - Okay, so charge, so something... Okay. (exhales) Is this some type of... It's a display? - What even would I display and why would I wanna put something in it? - iPad. - Okay. Yes. All right. - You could put an iPad here. - Yes, and what else? - You could display something that would fit in here. - [Justine] I don't know. - You could put... Would that fit there. - What's this? Oh, It's a phone charger. - Ding! Ding! Ding! Ding! Ding! - It's a phone charging station. - Yes. - Its a phone charger station display unit. - You can charge all kinds of different devices. - Okay, I was right you guys. - Yeah. - Okay, I think I can half a point. - And look, you can also do wireless charging here too. - This is so cool. - Super cool. - Ro, thank you so much for doing this unboxing. This is actually really fun. (laughs) - Thank you for planning this, this was really exciting. - To be to fair, even if I wasn't unboxing it blindfolded, I don't even know if I would have been able to get them. So, you did a great job. - Some of these, I felt like I understood the ballpark, but there was a few like that... - The tech wallet. - The tech wallet. - That's fine. - There was no way. - I did not expect you to get that. It's okay. - This whole time, I'm like, it's a hologram. (laughs) It's a hologram device from the future. - It's a really good guess though. (laughs) - So I'm gonna put Ro's links down below where you can see a video that we did over on her channel. We have so many fun videos together. - Yes. - I Also have a full playlist of all of the videos that we've ever done and there's, I mean, there's something like 80 something. There's a lot. - Yeah, millions. - So you guys need to have fun wild marathon weekend. We've got a lot of content for you. - Woo woo woo. So many. It's basically a TV show on it's 16th season. - Maybe we should release it on Blu-ray. - Yes. - Why not? - I'll give it to my mom for the holidays. - She's gonna be like, I don't want this. - She's like over it? She watches all my videos. - She's like, I've already seen this. - She'll be like I've already seen this. - We can do a director's cut. (gasps) Like commentary over it. - Oh, yes. - Oh, cool. - Like, mystery science theater. - Yes. - I love that show. - Don't you have this theater in here? - I do. - Oh my Gosh. - We could sit in the front row and just talk smack about ourselves. - Love it. Well, we'll see you guys in our next video. Don't forget to like, comment, subscribe, hit the freaking bell. - Ding! - And, that's it. We'll see you guys later. - [Both] Bye. (upbeat music)",
    "transcript_keywords": [
        "Ding",
        "phone",
        "box",
        "Yeah",
        "tech",
        "Justine",
        "open",
        "GPS",
        "put",
        "Wait",
        "lot",
        "stuff",
        "guys",
        "back",
        "Headphones",
        "fun",
        "video",
        "gosh",
        "Wiz Fizz",
        "Fizz Wiz"
    ],
    "transcript_entity_values": [
        "2,000",
        "about $2,000",
        "80",
        "millions",
        "Blu",
        "Australian",
        "second",
        "one",
        "iPad",
        "Justine",
        "Nintendo",
        "Two",
        "Ro",
        "iPhone",
        "Today",
        "three",
        "the day",
        "number five",
        "these days",
        "Wiz Fizz",
        "Aerospace Grade Titanium",
        "16th",
        "Samsung",
        "Nomad",
        "Trezor",
        "half",
        "today",
        "two",
        "Ding",
        "Blu-ray",
        "first",
        "only a hundred",
        "2005",
        "iPod"
    ],
    "transcript_entity_types": [
        "MONEY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "NORP",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.0581129789352417,
        -0.10898905247449875,
        -0.07254349440336227,
        -0.048011425882577896,
        0.0732673779129982,
        0.04716191068291664,
        0.026945268735289574,
        0.01906011439859867,
        -0.018043499439954758,
        0.029907895252108574,
        0.05805124342441559,
        0.030424486845731735,
        -0.00457781832665205,
        -0.023740172386169434,
        -0.0357595793902874,
        0.023127084597945213,
        -0.032765038311481476,
        -0.017982227727770805,
        0.0070456890389323235,
        0.06453700363636017,
        -0.028759172186255455,
        -0.03203568980097771,
        0.009782462380826473,
        -0.018260212615132332,
        -0.017947504296898842,
        0.06219962611794472,
        0.011724051088094711,
        0.00022334531240630895,
        -0.07982630282640457,
        -0.08698155730962753,
        0.014992396347224712,
        0.032439567148685455,
        0.10595410317182541,
        -0.012892586179077625,
        0.03772525116801262,
        -0.03583374246954918,
        0.008187376894056797,
        0.0245517510920763,
        -0.05938812345266342,
        -0.03181878849864006,
        -0.042735274881124496,
        -0.02163691818714142,
        -0.015524175949394703,
        -0.03611176460981369,
        -0.06565728038549423,
        -0.1084313616156578,
        -0.014246365055441856,
        -0.06494969874620438,
        0.06266285479068756,
        0.033436425030231476,
        -0.051306627690792084,
        -0.029435880482196808,
        0.02082359604537487,
        0.04380694031715393,
        -0.0941125899553299,
        0.018057428300380707,
        -0.091494619846344,
        0.008124666288495064,
        -0.01654905453324318,
        -0.05707307159900665,
        0.05305945873260498,
        -0.039092931896448135,
        -0.005388133693486452,
        0.00758701516315341,
        -0.021304041147232056,
        0.009470967575907707,
        -0.00934256985783577,
        -0.023239722475409508,
        0.020927900448441505,
        0.009288639761507511,
        -0.09165816754102707,
        0.06367695331573486,
        -0.04873991012573242,
        0.04202769324183464,
        0.00647687166929245,
        0.04351872578263283,
        0.040915973484516144,
        -0.055155061185359955,
        0.004142956808209419,
        0.06593868136405945,
        0.012320559471845627,
        -0.03224121406674385,
        -0.07080025970935822,
        0.014898748137056828,
        0.03610135242342949,
        0.052776772528886795,
        -0.014759227633476257,
        0.029716411605477333,
        -0.05965143442153931,
        -0.06811361759901047,
        -0.09188319742679596,
        -0.03399893641471863,
        0.00711077731102705,
        0.002051248913630843,
        0.004953357856720686,
        -0.10155303031206131,
        0.005339100956916809,
        0.016937149688601494,
        -0.0473993644118309,
        0.04939829930663109,
        0.05437217652797699,
        -0.04010289907455444,
        -0.0053117722272872925,
        -0.052471842616796494,
        -0.015694821253418922,
        -0.10148781538009644,
        -0.021835362538695335,
        -0.005218078847974539,
        -0.03067784570157528,
        0.008998682722449303,
        -0.03220610320568085,
        0.02998856082558632,
        -0.044656671583652496,
        -0.035015664994716644,
        -0.01689956896007061,
        0.13036005198955536,
        -0.03155974671244621,
        0.03919309750199318,
        0.015743080526590347,
        0.0173508170992136,
        -0.011147625744342804,
        -0.06813021004199982,
        0.012182015925645828,
        0.015668023377656937,
        0.02819034829735756,
        0.0039366562850773335,
        -0.06280107796192169,
        1.2201478547269737e-32,
        -0.02374296262860298,
        0.05164945125579834,
        -0.025225695222616196,
        0.03550887852907181,
        0.02557259611785412,
        -0.018022233620285988,
        -0.006673692259937525,
        0.06058962270617485,
        -0.030807847157120705,
        0.05216497555375099,
        0.0158087145537138,
        0.04684159532189369,
        -0.02944718301296234,
        0.018291721120476723,
        -0.012368052266538143,
        -0.06962109357118607,
        0.01701589673757553,
        -0.008145906031131744,
        -0.10497501492500305,
        -0.02946065366268158,
        0.003033248009160161,
        0.032577089965343475,
        0.021388491615653038,
        0.10452882200479507,
        0.08942265808582306,
        0.08737014979124069,
        0.014389374293386936,
        -0.038937103003263474,
        0.11146929860115051,
        0.026044460013508797,
        -0.06403405219316483,
        -0.02281576581299305,
        -0.006664713844656944,
        -0.06146709620952606,
        0.013979123905301094,
        0.009367271326482296,
        -0.06969062983989716,
        -0.006945209112018347,
        -0.01121426373720169,
        0.013496234081685543,
        0.009380045346915722,
        -0.029419725760817528,
        -0.04323756694793701,
        -0.07007473707199097,
        0.06902365386486053,
        -0.00145425321534276,
        0.08289412409067154,
        0.10526429116725922,
        -0.04655250906944275,
        0.022356528788805008,
        -0.0315617136657238,
        -0.0015777425142005086,
        -0.037108808755874634,
        -0.00980735570192337,
        -0.016798362135887146,
        -0.12021764367818832,
        -0.05501497909426689,
        0.0666317269206047,
        0.05924983322620392,
        0.052379872649908066,
        0.06712920218706131,
        0.007559456396847963,
        -0.007642203476279974,
        -0.02142496593296528,
        -0.09566230326890945,
        0.06984058022499084,
        0.07629744708538055,
        -0.09248825162649155,
        0.007590216118842363,
        0.038212988525629044,
        0.0029190094210207462,
        0.016300702467560768,
        0.009527564980089664,
        0.027499258518218994,
        0.01826471835374832,
        0.07702332735061646,
        -0.05846967548131943,
        -0.03163386508822441,
        0.04750126600265503,
        -0.03312236815690994,
        -0.10387957096099854,
        0.08512435108423233,
        0.005621433723717928,
        0.06937503814697266,
        -0.05348079651594162,
        -0.07045590877532959,
        0.02240828610956669,
        -0.017041387036442757,
        -0.07440131902694702,
        -0.014576930552721024,
        0.022284608334302902,
        0.06378329545259476,
        -0.09646226465702057,
        -0.05898303911089897,
        0.013591242022812366,
        -1.1275671686189581e-32,
        0.029016274958848953,
        0.02111736871302128,
        0.007349638268351555,
        -0.04518313705921173,
        0.04104824736714363,
        -0.01605500467121601,
        0.04150377959012985,
        0.07235714048147202,
        0.07185934484004974,
        -0.08543240278959274,
        0.035793740302324295,
        -0.03752444311976433,
        -0.11932658404111862,
        0.020603368058800697,
        -0.004772001877427101,
        -0.03696278855204582,
        -0.02076105587184429,
        -0.023686861619353294,
        0.04532118886709213,
        0.01457239780575037,
        0.0772729143500328,
        0.14345824718475342,
        0.08158040046691895,
        0.018798183649778366,
        0.010946846567094326,
        0.02062501385807991,
        0.01960556022822857,
        0.037741582840681076,
        0.05218518152832985,
        0.0718461200594902,
        0.00519753759726882,
        -0.015544194728136063,
        -0.04086818918585777,
        0.005252315662801266,
        0.0061083291657269,
        0.06989043951034546,
        -0.026449406519532204,
        0.027698583900928497,
        -0.00501337181776762,
        -0.09450116008520126,
        0.014853349886834621,
        0.029402999207377434,
        -0.041349396109580994,
        -0.007339079864323139,
        0.007682108785957098,
        -0.1066727340221405,
        -0.07052019238471985,
        0.03111618384718895,
        0.03635646402835846,
        -0.017141398042440414,
        -0.07029885798692703,
        -0.058247875422239304,
        0.0009785547154024243,
        -0.03961494565010071,
        -0.015938689932227135,
        0.06805349886417389,
        -0.08632368594408035,
        -0.024129018187522888,
        0.046570099890232086,
        0.01955045387148857,
        0.06569201499223709,
        -0.004075623117387295,
        -0.08329936861991882,
        -0.08793750405311584,
        0.0035084427800029516,
        -0.02734280563890934,
        0.12825672328472137,
        0.03571475297212601,
        -0.007545230444520712,
        -0.009238782338798046,
        -0.009954498149454594,
        0.052780766040086746,
        0.05605912581086159,
        0.011943022720515728,
        0.0949549525976181,
        0.05721614137291908,
        -0.12307579815387726,
        0.029428264126181602,
        0.06630132347345352,
        -0.015854792669415474,
        -0.028096485882997513,
        -0.061490416526794434,
        0.015778183937072754,
        0.11014216393232346,
        0.08574989438056946,
        0.10018996894359589,
        0.08200245350599289,
        -0.028892314061522484,
        -0.023462580516934395,
        0.014074529521167278,
        -0.0020590582862496376,
        0.013635248877108097,
        0.0565357580780983,
        0.15585598349571228,
        -0.0680515393614769,
        -6.050524348211184e-08,
        0.051614753901958466,
        0.02644495666027069,
        -0.03323369473218918,
        -0.010034041479229927,
        0.006915837526321411,
        -0.12112633138895035,
        -0.03575390577316284,
        0.0025897433515638113,
        -0.0167396143078804,
        -0.03027571178972721,
        0.03630140423774719,
        -0.054654888808727264,
        -0.04074693098664284,
        0.08597172796726227,
        0.044549982994794846,
        0.022152600809931755,
        -0.08748935908079147,
        0.13722561299800873,
        -0.05055244639515877,
        -0.05668354034423828,
        0.011065104976296425,
        0.03398822247982025,
        0.0667046383023262,
        0.029936281964182854,
        0.07500629127025604,
        0.007235505618155003,
        -0.03547454625368118,
        -0.03254790976643562,
        0.051270972937345505,
        -0.013901378959417343,
        -0.019886355847120285,
        -0.005328115541487932,
        0.051033854484558105,
        0.022508932277560234,
        -0.0752582922577858,
        -0.030523208901286125,
        -0.03428670018911362,
        0.002463512821123004,
        -0.006992099341005087,
        0.011964451521635056,
        0.02746107056736946,
        -0.11522803455591202,
        -0.027341682463884354,
        -0.010431257076561451,
        -0.01468055322766304,
        -0.05948473885655403,
        0.06713864952325821,
        -0.08324398845434189,
        -0.05642528831958771,
        -0.057571932673454285,
        -0.0333654060959816,
        0.04437708854675293,
        0.02758212573826313,
        0.016999250277876854,
        0.06776344031095505,
        0.007627520244568586,
        0.05997231602668762,
        0.05725801736116409,
        -0.008856168016791344,
        0.003919931128621101,
        -0.030270744115114212,
        0.028389789164066315,
        -0.05554370954632759,
        0.03338678553700447
    ]
}