{
    "id": "bL_IUbxRCPA",
    "title": "I bought the biggest SCAMS at Walmart",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2022-04-09T18:05:04Z",
    "video_url": "https://www.youtube.com/watch?v=bL_IUbxRCPA",
    "category": "Science & Technology",
    "tags": [
        "walmart",
        "scam",
        "austin",
        "austin evans",
        "tech",
        "unboxing",
        "product",
        "review",
        "headphones",
        "wish",
        "amazon",
        "ebay",
        "denki",
        "ken",
        "ken bolido",
        "this is"
    ],
    "views": 1581232,
    "likes": 40342,
    "comments_count": 1078,
    "description": "Use code AUSTIN16 for up to 16 FREE MEALS + 3 Surprise Gifts across 6 HelloFresh boxes plus free shipping at  Subscribe to Ken's channel @Denki!   More shenanigans on @thisis:   My new F1 show@TheBackmarkers!  Subscribe for more!  TikTok:  Instagram:  Twitter:",
    "description_links": [
        "https://bit.ly/3th5Emr!",
        "https://www.youtube.com/denkitime",
        "https://www.youtube.com/thisis",
        "https://www.youtube.com/channel/UC6xg3-DQKl7-NL5TReUhs7g",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- After a very arduous journey, our package is right here. You might think when you're ready to purchase a 11.6 inch ultra thin Gateway. - [Ken] Oh! Wait, oh, okay, no. - Do you have any idea what we had to go through to get this? We went to our friendly local walmart.com and tried to order all of the items and the video was all fine. Immediately, we got a cancellation. - [Ken] Wait, really? - Jared and I spent legitimately what? Three hours? - [Jared] It was probably about three hours - [Austin] Ordering, canceling. We tried different credit cards. - [Jared] I think we triggered the spam filter, 'cause who the hell buys what the items we just put in our cart. Like that's never been done before. - Finally, Jared literally went through and ordered every single item individually and we found two that were not available. So we went to Walmart physical location to try to find the items. We found two of our items and sat around for 45 minutes and no one helped us, so we left, and we ordered them on Amazon. - [Ken] So what you're telling me is that Walmart didn't provide you with the optimal shopping experience. - I mean... - [Ken] Are you really surprised? Oh, it's purple. - Look at that shade of purple. - It actually works pretty well with my get-up right now. - [Austin] Is that the drip? - It's the drip - [Austin] Do you have the drip, Ken? Is that a mini HDMI? - [Ken] Yep, mini HDMI. Wait, and USB-C. The only thing that I've ever seen have those two ports is a camera. - Yes. Do you know how many great reviews this had? - [Ken] Judging by your affinity for self-infliction, probably like two stars. - [Jared] Three stars out of five from 220 reviews. - [Austin] I'm kinda torn on this. - [Ken] Ooh, here we go, Austin Evans video. - [Austin] Wow, that's a lot of lags. - [Ken] It's taken a long time to go to full screen. I mean, the video's playing. - [Austin] No, but it's frozen though, look. - [Ken] Oh. - [Jared] And just to make things worse, I had it sitting here for like 20 minutes thinking it was charging. I look a little closer and I see the charge connector is so small that it actually fits perfectly inside of the headphone jack. (Austin laughs) - [Ken] It feels more satisfying to plug into the headphones. - [Jared] It does. It's not good. I doubt it'll damage your device, but that just shouldn't be a problem. - All right, Jared should be so kind. - [Ken] Well, I don't really like that packaging. - They're iHip Flashing LED Wireless Headphones. - [Ken] Of course, they'd be headphones. What else would come in cheap packaging? These things look like they came out of a Stacker at Round One. (Austin laughs) - [Jared] And the most helpful review is just titled junk. (everyone laughs) - I do think if I twist this, it would just crack very easily. The thing is though, they're actually not super cheap. - [Ken] Don't say they're more than $10, Jared. - Oh, they're more than 10 bucks. I'm sorry to tell you that they are 19.47. - [Austin] Yeah, oh, ho, ho, baby, party time. You can wear these in your Tinder profile photo. - Yeah. - [Austin] To tell people that you're fun and you wanna have a good time. Wait, the music actually is being like visualized. - I can't hear you, so passive's good. Oh my God, why does it take so much force? Ow, (laughs) I could hear that in my skull. I would not pay $20 for these, but... (laughs) - Well, but you pay $20 for the style. (upbeat music) Ken, I see you. You're hard working on the beautiful Denki channel. - [Ken] Thank you. - [Austin] Of course, subscribe too. Ken works on it about 23 hours a day. - [Ken] It's actually not wrong. - So I wanna make sure that you're comfortable during your 20-hour edit sessions. - [Ken] Wait, wait, - So Jared and I got you - [Ken] oh, oh, oh, oh. - a high quality- - [Ken] Is it an air mattress? (Austin chuckles) - Jared, can you order an air mattress from walmart.com real quick? - Ah! - [Ken] Yes! - A heated blanket. - [Ken] Yes! Oh, I've been wanting one of these. - Well, keep wanting, 'cause this has truly horrible reviews. - [Ken] Oh no. - Apparently, you can get yourself burnt on this. - [Ken] Oh wow. - [Austin] So we're gonna put it into the test. - [Ken] I am tired of Austin literally getting things that will burn people, catch on fire. - Look, he's authority on the subject. Let's just be honest here. - Before we actually plug in the blanket, so that we can make sure that Ken is nice and comfortable. We're gonna do a little thermal test to see exactly how warm Ken is and how warm he can become. You can see that Ken is warm and that the blanket is cool, okay? So now, I'm gonna fire it up. Are you ready? All right. - Yes, yes. - [Austin] Two. - I feel nothing. - [Austin] Two, three- - Though I don't know if I wanna feel anything. - [Austin] Four, five. - [Jared] So far, I don't think it's gonna be like instant. - Six, seven. - [Jared] I don't know if we should just be cranking now. - No, stop, stop, stop, stop. - Eight, nine. So if you look on the thermal camera, you can see all the individual heating coils lighting up right now. Ooh, ooh, I feel it. Ooh, ooh! Do you feel warmer yet? - No. Maybe I'm just having a stroke. - I think you're having deeper issues. It's three to five degrees warmer than you were before. - [Ken] Look, I've watched your PS5 video. I know what you can do with thermal cameras. Stop touching me. (everyone laughs) Stop touching me, what are you doing? Show me on the PS5 where your boss touched you. I can tell you that I don't feel any harder, but I'm definitely bored. - [Austin] Did you say harder? - [Jared] Did you say harder? (everyone laughing) - I'm getting up now. Oh boy. Suddenly, it's showing that I don't wanna see right now. Ken, are you feeling this is a Tracfone? - [Ken] Yes. - [Austin] This is a smartphone. - [Ken] Wow! - [Austin] For a budget price. This is the TCL A3. Removal battery, that's a cutting edge feature, not the fact of this phone feels terrible when you don't realize when you pick it up from the back. - I can't really see. No, no, oops. It belongs there. - One thing I'll say, very happy, that it allows me to get into the phone without paying for service. I mean, performance seems to be- - [Ken] That looks like the nicest screen I've ever seen on a $40 phone that isn't a used iPhone. - Hardware-wise, this is gonna sound weird, 'cause it's obviously super generic, but it actually doesn't feel terrible. I mean, it's just plastic. It's a little thicker, but it's got like a nice sort of curve. It's not super heavy. Like it's a completely fine feeling device. This video is sponsored by HelloFresh. While you're sitting here watching this video, you might be thinking, \"What am I going to do for dinner tonight?\" That question could be answered for you with HelloFresh. Without leaving the comfort of your home, you can save time and money by having delicious meals delivered right to your door. With 50 weekly options to choose from, there will always be something that will have your mouth watering. HelloFresh offers pescatarian, vegetarian, and other meals to ensure that you are reaching the health goals that are best for you. My wife and I have been using HelloFresh for quite a while. We absolutely love how effortless dinner has become now that we don't have to worry about going to the grocery store, especially when we realize that we're missing one of the ingredients. You also don't have to worry about your carbon footprint or waste either as HelloFresh is the first carbon neutral meal-kit company. Their packaging is almost entirely recyclable. And with preportioned meals, food waste is reduced by at least 25% compared to shopping at grocery stores. So what are you waiting for? Go to HelloFresh.com and use code AUSTIN16 for up to 16 free meals and three surprise gifts. That's HelloFresh.com with code AUSTIN16 for up to 16 free meals and three surprise gifts. Thank you very much to HelloFresh for sponsoring this video. So Ken. - [Ken] Oh my God, is that an Xbox Series S? - No, it's a APOSEN Robot Vacuum Cleaner. - [Jared] This costs $90.43. - And it has one of the coolest features I've ever seen. It's a gift! They printed a gift. No. - [Austin] Not only do you have the vacuum, not only do you have the dock. Oh my God, guys. - [Ken] Oh, does it have a remote? Oh my God, it has a remote. Oh my God, wait, wait, wait, wait. - [Austin] Oh, are you controlling him? Oh, you are controlling him. - [Ken] So, right, right, right, straight. (Austin laughs) Straight. - [Austin] This is the greatest item we've ever looked at. - Wait, let's go. Let's go. Let's go, little buddy. Let's go, we're gonna go outside. Why am I here? This could be the new cameraman. - [Austin] Wait, I'll just put the camera on top of him. - [Ken] Yes, go, go, go, go! - [Austin] There you go. - [Ken] Oh my God, there you go. - So hello, welcome to our new camera robot, APOSEN, who's being controlled by Ken. Come on, come on, buddy. There you go. - [Ken] Oh my God. - There you go. I knew you could do it. I knew you could do it. - [Ken] All right, can it make it up the carpet though is the question? - Come on, you can do it. - [Ken] Up the carpet. - Come on, there you go. Yeah! - [Ken] Oh! Whoo! - That was legitimately cool. I mean, what more could you possibly ask for out of a $90 robot vacuum cleaner? Ken, what if I could tell you that Walmart sold emulation machines and I have them in my hands right now. - [Ken] Oh, I don't like this. - This is the one that caught my eye because- - [Ken] It looks like a Switch. - Now we've looked at some of these, but they've usually been from slightly less reputable resources, such as Wish. Boy, that's plastic, that is... - [Jared] So the Nintendo Switch looking one- - [Austin] Yep. - [Jared] Was $49. - [Ken] I wouldn't, but- - [Austin] Not yet. - [Jared] Its little brother next to it, $19.14. - [Ken] Okay, that's probably a better deal. - To be fair, I've seen these in stores before. I've never seen one of these in a store. - [Ken] This just looks like it's the Vita. - [Austin] Except the worst possible version of it. Do you think Nintendo's happy about their valued partner, Walmart, selling Super Mario? Look, look, look. When I push on the back. - [Ken] Oh! - [Woman] Hi Ken! - [Austin] Oh my God. Are you kidding me right now? - [Jared] No way! - [Austin] Jared, can I strike a video in real life? - [Jared] I think you're just gonna have to strike your employee. - It's my song, I'm Ken. Hi. - [Austin] So while you've been playing with the most PSPness thing I've ever seen in my life... - [Ken] Excuse me, young man. - [Austin] I have the retro tiny portable gamer thingy. The screen is super tiny and it doesn't feel great. This is actually terrible. - [Ken] You know what costs less than $20 and has about 220 games as well? (calm upbeat music) Game Pass. - Do you remember Sharper Image? I'm gonna stop. - [Ken] Oh God, yeah? What about Sharper Image? - They have an instant camera and it's available on walmart.com for some bizarre reason. - [Ken] Oh, I don't like that. It does two things in one. What more could you need? - [Ken] What are the two things other than just take my photo - Take pictures. - [Ken] and print it? - Those are the two things. - [Ken] Oh, oh, (beep) off. Really? That's the design? - This is huge. - [Jared] Oh, it's a lot bigger than I thought. (device whirring) - Wait, what? Wait, oh, nope, nope, nope. - [Ken] Nope, nope, nope. - We're not done yet. - [Ken] No, it takes four passes, Austin. Oh yeah, look, it's doing the yellow pass now. - [Jared] Oh, there we go. - [Ken] That's a very way of doing printing, but okay. (Austin laughs) This is not particularly instant either. If 911 was this instant, no one would be alive right now. - Hey! Look how happy Ken looks. (camera shutters) - [Jared] Some people say this has blurry photos. - [Austin] Yeah. - [Jared] If it works at all. - [Ken] You know, but that is a style though. That is definitely a vibe. - [Austin] No, but the thing is film looks cool. - [Ken] That's pretty artsy though. Oh my God! - Ken, do you know that the future is swag? - [Ken] Yeah, I've always wanted one of these. - [Austin] I once won a race on a hoverboard. - [Ken] That was the one with all the other tech YouTubers, right? - [Austin] Yep, I beat Marques to the wire and I'm very proud of that to this day. - [Ken] Yeah, that's the only thing you beat him in. - [Jared] This has 81 one-star reviews and it has 3.2 stars out of 242 total, but it looks like it's working. - [Austin] Whoo! - Okay, okay, whoa. (instrumental music) - [Jared] Whee! Whee! - I don't like it. - [Austin] Ready? - No, I'm never ready. - [Austin] It is really unstable once you get up to any kind of real speed. - Don't tell me that. - [Austin] But once you step on it, it's fine. - No, it's not. - Look, I'll- You can hold onto me. I'll guide you. - I touched you enough today. - [Austin] Pretend that you're a swagged out 11-year-old. - [Jared] Pretend to be an 11-year-old. - Fortnite, Fortnite. - [Austin] Fortnite. - [Jared] Fortnite, oh no. - He's gonna die of old age before he makes it anywhere. I can't believe it, but it's actually here. The Walmart tablet after all our shenanigans and all our canceled orders ended up actually showing up. A $60 tablet. Let's see what we got. Let's see what we got. Oh, wait, wait, wait. Okay, that's actually kind of cool. - [Jared] That's kinda cool. - I'm like, \"This is kinda cool.\" - [Jared] Yeah. - [Austin] There's this dedicated Walmart button. What? Oh my, your favorite apps. (Jared laughs) At least it has USB-C. I'll give them that, and a headphone jack. - [Jared] Which is legitimately pretty impressive. - Okay, I'm gonna click the button. Ready, set. (instrumental music) - [Jared] Oh my God. (both laughing) - 29% use, 11 gigs free. If you so much as type the word Genshin Impact into this tablet, this storage is full. Now it's fixed. - [Jared] Okay. Oh. (Austin and Jared laugh) - I feel like I'm just banging my head against the wall here.",
    "transcript_keywords": [
        "Wait",
        "God",
        "Ken",
        "Jared",
        "Yeah",
        "feel",
        "Walmart",
        "video",
        "arduous journey",
        "thing",
        "things",
        "stop",
        "nope",
        "cool",
        "kind",
        "HelloFresh",
        "ultra thin Gateway",
        "super",
        "Ooh",
        "items"
    ],
    "transcript_entity_values": [
        "Sharper Image",
        "Ken] Wait",
        "YouTubers",
        "iPhone",
        "about 220",
        "first",
        "Nintendo",
        "Ken] Look",
        "jack",
        "Two",
        "81",
        "two",
        "A3",
        "four",
        "Austin] Fortnite",
        "Austin] Jared",
        "90",
        "one",
        "Super Mario",
        "911",
        "about three hours",
        "Three hours",
        "$60 tablet",
        "AUSTIN16",
        "HelloFresh",
        "Austin Evans",
        "220",
        "Walmart",
        "Ken",
        "Austin",
        "PSPness",
        "Gateway",
        "20 minutes",
        "40",
        "242",
        "19.47",
        "ho",
        "HelloFresh.com",
        "Denki",
        "seven",
        "tonight",
        "45 minutes",
        "today",
        "PS5",
        "3.2",
        "Amazon",
        "this day",
        "about 23 hours",
        "Xbox Series S",
        "90.43",
        "five degrees",
        "20-hour",
        "11",
        "Fortnite",
        "more than 10 bucks",
        "11.6 inch",
        "at least 25%",
        "One",
        "29%",
        "Six",
        "Jared] Fortnite",
        "weekly",
        "nine",
        "USB-C.",
        "more than $10",
        "Jared",
        "three",
        "APOSEN",
        "Three",
        "Genshin Impact",
        "19.14",
        "11-year-old",
        "49",
        "Austin",
        "50",
        "five",
        "less than $20",
        "Ken] Ooh",
        "Four",
        "up to 16",
        "iHip Flashing LED Wireless Headphones",
        "20"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "TIME",
        "MONEY",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "NORP",
        "LOC",
        "TIME",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME",
        "EVENT",
        "MONEY",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "ORG",
        "MONEY",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "DATE",
        "MONEY",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY"
    ],
    "vector": [
        -0.0762229636311531,
        0.014899744652211666,
        0.0622958280146122,
        0.016511274501681328,
        0.03742850944399834,
        -0.06208530813455582,
        0.013306595385074615,
        -0.08331155776977539,
        -0.023298416286706924,
        -0.04162721335887909,
        0.08062801510095596,
        -0.0030093779787421227,
        0.05682779848575592,
        -0.09939339756965637,
        0.004804809577763081,
        -0.030729295685887337,
        0.03715162351727486,
        -0.07909237593412399,
        -0.08115357905626297,
        -0.01130492053925991,
        -0.011459858156740665,
        -0.04121154919266701,
        -0.04570582136511803,
        0.060330722481012344,
        0.0016982103697955608,
        0.03640846535563469,
        -0.03656076267361641,
        -0.01385802123695612,
        -0.06440626084804535,
        -0.043162912130355835,
        0.08511872589588165,
        0.04814052954316139,
        0.06367254257202148,
        0.00038948937435634434,
        0.05698937922716141,
        -0.01160246692597866,
        -0.053175702691078186,
        -0.06394367665052414,
        -0.03495430201292038,
        -0.04498874396085739,
        -0.010584648698568344,
        -0.017111657187342644,
        -0.019870074465870857,
        0.008901191875338554,
        -0.04120933264493942,
        0.0156621765345335,
        0.024644121527671814,
        -0.027828780934214592,
        0.05745602771639824,
        -0.017738401889801025,
        -0.015250091440975666,
        0.03362106904387474,
        0.028897466138005257,
        -0.036422863602638245,
        -0.04046731814742088,
        -0.006926302798092365,
        0.007090515922755003,
        -0.056834254413843155,
        0.022403346374630928,
        -0.009540273807942867,
        0.022153889760375023,
        -0.09997854381799698,
        0.013754167594015598,
        0.05923769995570183,
        -0.051060620695352554,
        0.03914951533079147,
        -0.098846934735775,
        0.011040575802326202,
        -0.016213957220315933,
        -0.03201839327812195,
        0.0826895534992218,
        -0.0016198911471292377,
        0.016969364136457443,
        0.09756660461425781,
        0.07946109771728516,
        0.034656405448913574,
        0.06155325099825859,
        -0.0653521865606308,
        0.03452186658978462,
        0.03947390988469124,
        -0.03991757333278656,
        -0.06555987894535065,
        -0.016382446512579918,
        -0.05000200495123863,
        -0.022765742614865303,
        0.0033300623763352633,
        0.08495239168405533,
        0.038702111691236496,
        0.03668290376663208,
        -0.007993308827280998,
        0.04837417230010033,
        -0.00030649168184027076,
        0.0378868505358696,
        0.012321173213422298,
        -0.009336135350167751,
        -0.038071539252996445,
        -0.030301230028271675,
        -0.07584324479103088,
        -0.02638927660882473,
        0.04761834442615509,
        0.0371110774576664,
        0.10364671051502228,
        0.013281919062137604,
        -0.050828687846660614,
        0.05814419314265251,
        -0.045067109167575836,
        -0.05173693969845772,
        0.07882506400346756,
        0.03753586858510971,
        0.03864132612943649,
        -0.03257855027914047,
        0.03476759046316147,
        0.05122808367013931,
        0.026712248101830482,
        -0.05456611514091492,
        0.1236712858080864,
        0.01648428477346897,
        -0.008643727749586105,
        0.0572325773537159,
        -0.02225952409207821,
        0.07447084784507751,
        0.07517888396978378,
        0.018473908305168152,
        -0.04607807844877243,
        -0.006332863122224808,
        0.04248412325978279,
        0.039586566388607025,
        4.554959059515776e-33,
        -0.05811223015189171,
        0.06922293454408646,
        -0.041715335100889206,
        -0.06571870297193527,
        0.05412883684039116,
        -0.04811258241534233,
        0.010064458474516869,
        0.05835772305727005,
        -0.05251259729266167,
        0.04699599742889404,
        -0.06367579847574234,
        0.061286669224500656,
        0.026365134865045547,
        0.08383990079164505,
        -0.06107533723115921,
        -0.012309761717915535,
        -0.013690768741071224,
        0.03230297937989235,
        0.05405306816101074,
        -0.023451320827007294,
        -0.024771295487880707,
        -0.05546727403998375,
        0.036512263119220734,
        0.01435878686606884,
        -0.02988961525261402,
        0.02305416762828827,
        -0.042967915534973145,
        0.06333674490451813,
        0.11548236757516861,
        0.011018006131052971,
        -0.06583909690380096,
        -0.0348043367266655,
        0.06995372474193573,
        0.05672932788729668,
        -0.012732179835438728,
        0.032435089349746704,
        -0.004734926391392946,
        -0.08381471782922745,
        -0.03533446788787842,
        -0.020651543512940407,
        -0.04579145461320877,
        0.05500983074307442,
        -0.04185774177312851,
        0.03244529664516449,
        -0.0523814931511879,
        0.0455881729722023,
        0.012862316332757473,
        -0.018534814938902855,
        0.00036799884401261806,
        0.12977631390094757,
        -0.06527052819728851,
        0.02926013432443142,
        0.05884940177202225,
        -0.01448094379156828,
        -0.06988425552845001,
        -0.09299886226654053,
        0.037064626812934875,
        -0.014329124242067337,
        0.07216691225767136,
        0.004029711242765188,
        0.07258668541908264,
        -0.006483040284365416,
        -0.012149774469435215,
        -0.007391669787466526,
        -0.03564675524830818,
        -0.07444488257169724,
        -0.006091120187193155,
        -0.008988140150904655,
        -0.06081581115722656,
        0.03173847869038582,
        0.024219287559390068,
        0.06867372244596481,
        0.02340657077729702,
        -0.006398905999958515,
        0.06282103806734085,
        -0.012815263122320175,
        -0.04120224714279175,
        0.044834770262241364,
        -0.0222333874553442,
        -0.032350093126297,
        0.045771628618240356,
        -0.015342135913670063,
        0.059551458805799484,
        0.026028845459222794,
        -0.10184742510318756,
        0.05487922579050064,
        0.005093479063361883,
        0.0433650016784668,
        0.010572284460067749,
        0.02300838939845562,
        -0.03295929729938507,
        0.013934322632849216,
        -0.0035772582050412893,
        -0.008768728002905846,
        0.10866480320692062,
        -5.233552111778312e-33,
        -0.04720510542392731,
        -0.009030346758663654,
        -0.04419400170445442,
        0.00496100215241313,
        0.05763602256774902,
        -0.0180465467274189,
        -0.018978670239448547,
        0.03922371193766594,
        0.08201385289430618,
        -0.03990834206342697,
        -0.023575587198138237,
        0.017751088365912437,
        0.025675874203443527,
        -0.09037388116121292,
        0.05815037339925766,
        -0.05230594426393509,
        0.09482942521572113,
        0.003966473508626223,
        -0.01487976498901844,
        -0.04463134706020355,
        0.028620200231671333,
        0.08766420185565948,
        -0.08556505292654037,
        -0.040279075503349304,
        -0.05261168256402016,
        0.04696846753358841,
        0.055744774639606476,
        0.02528543956577778,
        -0.04245274141430855,
        0.0035428532864898443,
        0.04170389845967293,
        -0.010217005386948586,
        -0.008891697973012924,
        0.1398300975561142,
        0.025226395577192307,
        0.004390291403979063,
        -0.005845417268574238,
        0.12733116745948792,
        0.07316508144140244,
        -0.0888393446803093,
        0.004524538293480873,
        0.054976653307676315,
        -0.03891245648264885,
        -0.0040445891208946705,
        -0.042936984449625015,
        -0.03513706848025322,
        -0.006051662378013134,
        -0.09994880855083466,
        0.040161699056625366,
        0.05801583081483841,
        -0.11416743695735931,
        -0.012332468293607235,
        0.0006069960654713213,
        -0.02590940333902836,
        -0.07315701991319656,
        0.03882243111729622,
        0.01672574318945408,
        0.0032047952990978956,
        0.06369924545288086,
        -0.032597292214632034,
        -0.04253373667597771,
        -0.024508997797966003,
        0.03545471653342247,
        -0.0373430959880352,
        -2.525338641135022e-05,
        0.0012996676377952099,
        0.11247044056653976,
        -0.04223496839404106,
        0.039763808250427246,
        -0.007855789735913277,
        -0.03526323661208153,
        0.07833624631166458,
        0.001670827972702682,
        -0.0360594242811203,
        0.004364201799035072,
        0.05915875360369682,
        -0.004232040140777826,
        0.020048318430781364,
        -0.08741370588541031,
        -0.057926882058382034,
        0.10451061278581619,
        -0.031163621693849564,
        0.058545082807540894,
        0.05666203424334526,
        0.04904964938759804,
        0.0061578587628901005,
        -0.04113205894827843,
        -0.04768243804574013,
        -0.00010982171806972474,
        0.03889504820108414,
        -0.01882728934288025,
        -0.022386668249964714,
        -0.03612703084945679,
        0.039234038442373276,
        0.054035164415836334,
        -5.653335222177702e-08,
        0.05057260021567345,
        -0.03849814459681511,
        -0.041315242648124695,
        0.07605790346860886,
        0.049329355359077454,
        0.040954459458589554,
        -0.02379295974969864,
        0.06629804521799088,
        -0.08316737413406372,
        -0.021038947626948357,
        0.04919738695025444,
        0.011390026658773422,
        -0.11282699555158615,
        -0.022804662585258484,
        -0.025185631588101387,
        -0.0893733873963356,
        -0.04668432101607323,
        0.01598842814564705,
        -0.0656592920422554,
        -0.007281269412487745,
        -0.07061048597097397,
        0.01199143473058939,
        0.010665272362530231,
        -0.07607568800449371,
        -0.022175222635269165,
        0.008855834603309631,
        0.06405287235975266,
        0.05916723608970642,
        0.04491151496767998,
        -0.0716460719704628,
        -0.03426429629325867,
        -0.05795721337199211,
        -0.09373509883880615,
        -0.01936992071568966,
        -0.01896490715444088,
        -0.09563388675451279,
        -0.10871937870979309,
        0.004741347394883633,
        -0.000851996592245996,
        0.05019863322377205,
        -0.00037637350033037364,
        -0.06585203856229782,
        -0.04472056403756142,
        -0.06471702456474304,
        0.005680288653820753,
        0.008978885598480701,
        -0.17520736157894135,
        -0.09127394109964371,
        0.09016748517751694,
        0.06947466731071472,
        -0.015041517093777657,
        -0.07475142180919647,
        -0.0013505741953849792,
        0.07891598343849182,
        0.03689199686050415,
        -0.09297466278076172,
        0.006292643956840038,
        -0.08271956443786621,
        0.03317837044596672,
        0.016445277258753777,
        0.03375715762376785,
        -0.07090407609939575,
        -0.028545934706926346,
        0.018719036132097244
    ]
}