{
    "id": "Bm7L-2J52GU",
    "title": "A simple water heater is more clever than it seems",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2023-02-10T21:34:18Z",
    "video_url": "https://www.youtube.com/watch?v=Bm7L-2J52GU",
    "category": "Science & Technology",
    "tags": [],
    "views": 2027743,
    "likes": 71110,
    "comments_count": 6833,
    "description": "Pretty clever, ain't it? Links n' stuff:  Technology Connextras (my second channel where stuff goes sometimes)   Technology Connections on Mastodon:   The TC Subreddit   This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!",
    "description_links": [
        "https://www.youtube.com/@TechnologyConnextras",
        "https://mas.to/@TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Take a look at this label on this 40 gallon electric water heater. It lists three wattages: Upper is 4500W. Lower is also 4500W. And ofcourse that totals 4500 wa - whatt? Who wrote this? Actually, thats not a mistake. Youll findsimilar labels on most conventional electric water heaters. Oh and, by the way, that secondlisted wattage is what it would run at if hooked up to a 208V electrical supply rather than240, which youll usually find in office and large apartment buildings. Using Ohms lawwe can determine that this things heating element has a resistance of 12.8 ohms, whichat 240V would draw 18.75 amps and thus 4500 watts but at 208v it would only draw 16.25amps which works out to 3380W. Math is fun! Anyway, how can those two numbers add upto themselves? This label would suggest 2+2 is 2. And Im pretty confident thats wrong. Well,you might have guessed by the labels upper and lower that there are two separate heatingelements in the water heater - indeed there are, and theyre both the same power rating. Thereason for this silly math has to do with the thermostats. Yeah, theres two of those, too. But theyre cleverly interlocked in a way that not only prevents them from running atthe same time which would overload the electrical supply but also makes the operation of the water heater smarter and more effective. A water heater like this is an extremely simpledevice. Its really just an exceptionally well-insulated cylindrical tank of water with a few holes in it. Up top there are holes to let water in and out. Down below isanother hole with a spigot to let you flush out the tank periodically, and then there aretwo holes in the sides of the tank under these covers. The heating elements stick into the tankand thus into the water through those holes and when power is run through them they get realhot. This is really just an overgrown kettle. Now, there are actually two more holes in the tank, one of which leads to the temperature/pressure safety valve up top. Heating water makes it expandslightly which increases the pressure inside the tank. Ordinarily this isnt a problem. The tank may seem like a sealed pressure vessel but its still connected to the restof your plumbing. As the water inside expands, some water will simply move out of the tank bypushing the water in the supply line backwards. However, if you have an entirely closedplumbing system with backflow prevention, then that wont be possible so you probably have an expansion tank installed with yourwater heater. At least I hope so. But anywayif for whatever reason pressure starts building up too high in the tank and/or the waterinside is getting too hot then this valve will pop open, releasing that pressure and spraying hot water onto the floor, and you will have a very bad day but at leastthe water heater didnt explode. Thats nice. And the final hole in the tank is one many people overlook. Because the tank is made of steel which, I dont know if youve heard but doesnt really like tobe in prolonged contact with water, a sacrificial anode rod often made ofaluminum or magnesium pokes down into the water to take the corrosion bulletfor the rest of the tank and keep it from rusting. The top of that rod lives buried underneath thefoam insulation that's underneath this plug, and it can actually be replaced! If you do that regularly, it can extendthe life of your water heater significantly. But almost nobody does that,including me. Yay laziness! But this isnt a home improvement channel Sowhat's so special about this water heater thats making me make a video about it? Well, earlier I said thethermostats make it smarter and more effective. Allow me to explain. Notice that even though thisis a 40 gallon water heater, its rated capacity is somehow 53 gallons. Where did it magic 13 extra gallons from? Well, I suppose we can let water out of the tank while also heating incoming water, cantwe? Yes, but theres more to it than just that. First, how exactly does the water flow into andout of this tank? Both pipes are at the top, but the incoming water supply pipe attaches toa dip tube that travels all the way down to the bottom of the tank - meaning cold water enters thetank from below and pushes hot water out the top. We can actually observe this with the thermalcamera. Right now the tank has a fairly uniform temperature, just a few degrees above ambient. But when I open a tap and start using its hot water, we see that its only getting colderat the bottom of the tank. And heres something pretty fascinating about water: so long as you reduce turbulence and keep things relatively still, the hot and coldwater inside the tank doesnt mix. Like, at all. You can see that as I continue usinghot water, the region thats cold is getting bigger, but the hot parts up top are stilljust as hot as they were when I started. This happens because hot water is less dense thancold water, so in effect it floats to the top of the tank, and as a result a surprisingly sharpboundary between hot and cold is maintained. Now you might think that over time thatboundary layer will disappear and thewater will mix together but for the most partit doesnt. Any water that cools down inside the tank (like for instance the water clingingto the slightly cooler tank walls) becomes more dense and simply sinks to the bottom, piling inwith the rest of the cold water. After a very long time without adding heat energy to the tank the remaining hot water does start to cool down, but it takes a lot longer than youd think. Like, the better part of a day. Its pretty wild. This thermal stratification combined withhow we fill the tank from the bottom-up turns out to be really useful. Remember thatwe have two heating elements sticking into the tank at two different heights. As you continue using hot water, eventually the cold/hot water boundary reachesthe bottom heating element and its thermostat, kicking that element on so it can start working to heat the water as it flows into the tank. [sound of water trickling in pipes] [hissing noise from the element starts] Now, 4500 watts may seem like a lot of power, but inthe context of water heating it really isnt. It takes gobs of energy to heat water. At mostthe water heater can put 4500 joules into the water per second, or 1075.5 gram calories persecond. On a cold winter day the water entering the tank might be 10 degrees Celsius if werelucky, and our target temperature is generally around 50 degrees Celsius. So we need to attaina 40 degree temperature rise. If we divide the gram calories we have every second by the 40 degrees we need to increase in temperature, we find that we can only heat 26.9 milliliters of water per second, or about 1.6 liters per minute. Thats not too bad, really, butthe lowest flow shower heads youllgenerally find here are 1.5 gallons perminute, and they may go as high as 2.5. Sticking with the smaller number, thatsnearly 5.7 liters per minute of flow. Of course most people temper hot water with abit of cold water so we might only have 4 liters leaving the hot water tank every minute but thatsstill more than double what we can heat with 4500 watts. So were going to run out of hot watereventually. Theres just no getting around that. Even if we try and heat the water as it enters thetank, the water is simply moving out too quickly and it wont reach the target temperature by thetime weve used up the hot water already in it. But, remember theres a second heating elementabove the one at the bottom. It isnt any more powerful but with a bit ofstrategy we can use it to chase the water as it leaves the tank. And thats exactly what the waterheater does. With our theoretical 4 liters per minute flow rate, the lower heating element will only achieve about a 16 degree temperature rise. That's nowhere enough, but also thats not nothing. So long as the lower element is turned on, in effect the bottom of the tank is filling up with 26 degreewater rather than 10 degree water. And once that tepid water reaches the topelement, well now its thermostat kicks in and switches the power output to itself. Wehave the same 4500 watts that we did before, but now its up here - working to heatthe water weve already started heating. [hissy water heater sounds] [CLACK, hissing stops] [a new and louder hissing begins] We can still only achieve a 16 degree temperature rise with 4 liters per minute of flow, but thatll get us up to 42 degrees. Not exactly where wewant to be, but still plenty hot. We will of course still run out of hot water - once the top element kicks on the bottom switches off, so the water entering the tank is now truly coldand once its up near the top... well, game over. At best were getting 26 degree water out of the tank, now. But thisstrategy bought us some extra time with a limited power source simply by changing where we appliedthat power, and heating the same water twice. This is where we magicked 13 extra gallons from. 4500 watts is 4500 joules per second, and that's 16.2 million joules per hour or 3.87 million gram calories. And lift 96.8 liters of water by 40 degrees celsius. So over an hour, this water heater canbring 25.5 gallons of cold water to ourtarget temperature, and that is wherethis 1st hour rating comes from. I reckon its only listed as 13 gallons over thetrue capacity since it was calculated using a 208Vsupply and assuming we start with freezingcold water. Quite conservative. In any case, this means that over an hour the energy it can add to cold water plus the energy it has stored in 40 gallons of already hot water is the sameas if you had 53 gallons in the first place. And on 240V like I have here itmay be closer to, like 65 gallons. The strategy employed here is frankly genius, especially considering how simple thisdevice is. All we have are two bog-standardthermostats. There are no electronics here, theres no control scheme, its just a thermostatfor each heating element. The only complication to the circuit design is that the top thermostatalways takes priority. If that heating element is switched on, the thermostat breaks the circuitto the lower element to prevent it from running. Now, you might think this would cause some sort ofoperational conflict. What if we want the bottom thermostat to run but the top one happens to have kicked on? Well, think about this for a sec: because hot water stays at the top of the tank naturally, and we fill it with cold water comes in at thebottom, for the most part that just doesn't happen. In fact, top element rarely gets used at all. It basically only comes onafter you have used up more than half of the water in the tank. If you dont use at leastthat much, the bottom element will take care of things. Same goes for keeping the tank warmbetween uses. And with a low-flow shower head, 15 minutes in the shower is unlikely touse much more than 20 gallons of water. So, yeah, the top one just doesn't need to run. But if you do happen to use up all the hot water,or even just come close to that, well now the strategy of giving the top element priority helps us again. While we can of courseuse the bottom element alone to heat the water, after all the hot water it generates down there will float up to the top, doing that means we have to heat the entire volume in one go. Whateverhot water it generates at the bottom has to travel through all the cold water on its wayup to the top which will of course cool it down. Oh, by the way, I should mention that whenever the elements are actively heating, there is some mixing and churning of thewater going on inside the tank thanks tothe convection currents that generates. Youcan see that happening here with this kettle. Thats how we can heat the entire tank of water using what amounts to two hot sticks. Anyway, if we want to heat 40 gallons of cold water by 40 degrees celsius, its gonna take over 6 millioncalories or about 7039 watt-hours. With 4500 watts to play with, thats gonnatake about an hour and a half. However, if we only send power to the top element, thenin effect we only have to heat half of the water. Well still get some convection currents aroundthe element, but we wont be mixing all of thewater together - the bottom of the tank will staycold. So well get the water in the top of the tank (which remember is what leaves first) up toour desired temperature in half the time. So even after completely running out of hot water, youllget truly hot water again after only 45 minutes or so. Only once thats warm and ready will we send power back down to the bottom element to heat up the rest. I know that Im weird, but I think this is amazing! I only recently learned that there are two thermostats on the water heater. In hindsight itprobably should have been a little more obvious since, yknow, theres two identical coverson the front but I just assumed that was for cost cutting or something and thought there was one thermostat controlling both elements. Well, OK I guess there still is, technically, but yknow what I mean. The simple physics of how hot water behaves ina tank allowed us to implement a very strategicmethod of heating it using nothing but adip tube and two interlocked thermostats. Just doing that covers pretty much all possible concerns: how bestto heat a cold tank for the fastest-possible hot water, how to chase it on its way outfor some extra reserve capacity, and how to do both those things with a more reasonable amount ofinput power. And thats what I call neat! You might have noticed that the water heater is hooked up to some sort of mystery box. [CLACK] What exactly is inside that box is not important for you to know butit allows me to disable the water heater at-will. Or I guess... selectively enable it. The water heateronly has power if the red light is on. See, Im in the middle of some experiments. Water heaters, as I said, are exceptionally well insulated. In fact you would have noidea theres 40 gallons of piping hot water in there by touching the tank as it feelsstone cold. The only heat you can really feel is what leaks out of the supply pipes - I really oughta get some sleeves for those. Anyway, because this thing is so well-insulated that means its effectively a battery. Remember that math I did earlier? It takes over7 kilowatt-hours to heat up 40 gallons of water by 40 degrees C. And thats a lot! Electricwater heaters are among the most power-hungry things in your life, and the cost to operate themis a big reason many people chose to use gas instead for water heating. I mean, just look at this! Yikes!And those are old numbers! Oh and by the way, the reason the cost range is so narrow is because energy is energy and water is water. Now, I have a time-of-use rate plan with my utility and power in the middle of the night is quite cheap. So for the past couple of months, I have only beenletting this thing operate between 1 and 5 AM. And believe it or not, I pretty much cant tell. Now, I can feel the comments already - arentyou supposed to keep your water heater hot at all times? Arent you the least bit worriedabout diseases like Legionaries? Well, sort of and as a precaution I did set thetemperature a fair bit higher before I embarked onthis journey... but on the other hand for years I have been shuttingoff the water heater whenever I leave for more than a day and Im not dead yet! Butin fairness, that could be a risk and more research is definitely needed there, so I am notendorsing this practice. Do not do this at home. I can however tell you that when that thing is chargedup it will stay hot for way way wayyy longer thanI thought was remotely possible. I've takena shower at 9:00 at night - meaning the water heater had not operated for sixteen hours!- and the water was still scaldingly hot. And remember the whole hot andcold water wont mix thing? Yeah, youd think that after a while itwould but no! It just doesnt! Ive taken a shower in the morning, probably using upa good half of the tanks volume, and in the evening - over ten hours later - the water from the kitchen tap was still too hot to touch. More quantitatively, I measured the temperatureafter running approximately 10 gallons of water through the kitchen tap at 132.4 Fahrenheit. Five hours later - five hours of the water heater being entirely off - the water measured124.3 degrees. Just swapped the digits around. Somehow, even with at least 10 gallons of cold water sitting in the bottom of the tank for five hours, we lost only 8 degrees of temperature. Its wildbut the cold and hot water really just dont mix. Now obviously this strategy won't work forfamilies. Good luck spreading 40 gallons a dayaround. But I think its worth pointing out that this thing hardly loses any energy when its not getting used. And that makes it a really effectiveenergy storage device - and a large one at that! This 40 gallon tank stores 70% of the energy that the original Chevy Volts battery pack could!'I hope you can see that theres a lot of potential for energy management applications, here. You shut this thing off for an I hope you can see that theres a lot of potential for energy managementapplications, here. If you need to shut this off for an hour or even two, you you wont even notice. And,what if you put a thermostatic mixing valve on its output? Then, you could charge up a more sophisticatedwater heater well beyond your target temperature when energy is cheap and abundant, notonly storing that energy for later, but also extending the tank's capacity. As a matter of fact that idea is already in use with some heat pump water heaters today. Ill be keeping track of energy costs here and will report on how this experiment continues togo. Ill probably do that on my secondchannel so you might want to subscribe if you havent already. But I can alreadysay with complete confidence that a conventional, tanked water heater can be an importantpart of an energy-management strategy. People keep asking for my thoughts on tanklesswater heaters and frankly this experiment is reinforcing my previously-held belief that theyrenot the be-all-end-all. They need tremendous amounts of power and cant store energy for later. Plus they have unique maintenance considerations. I really think they only make sense when you have severe space constraints, and personally... I gotta say that if you feelyou need the endless hot water they canprovide, it might be worth considering adjustingyour routines. But thats just, like, my opinion. Anyway, that whole section was basically a teaser for my next video which will be onhome electrification. Thats coming soon. Atleast I hope. For now, I hope what Ive said here will get some gears turning. Many ofthe obstacles we think are insurmountable are in fact a piece of cake with just a bit of strategyand a dash of management. Thanks for watching. scaldingly smooth jazz Youll find similar labels on most conventionalelectric water heaters. Oh and, by the way, that second listed wattage is what would blet deh buh dih be deh And by the way, that second listed wattage is what it would run at - what the heck was that noise? I heard a weird noise. Right now, the tank has a prettyformout prettyform? It's pretty uniform. Same goes for keeping the tankwarm between uses. And a low-flow shower head fit oh. I skipped a word! ...combined with how we fill the tank from the bottom up turns out to be really useful. Rememberthat we have two heating elemen [belches] I GOTTA BURP Explaining how your water heater works can be a tankless job. OK, that's not mine, plenty of plumbing companies the world over use that one. Besides, like I said I don't exactly have an affinity for tankless water heaters. Especially since electric ones need, like 10 kW just to provide one shower. Then you might as well get one of those electric shower thingies. Anyway, toodles.",
    "transcript_keywords": [
        "water",
        "hot water",
        "water heater",
        "tank",
        "hot",
        "cold water",
        "heater",
        "hot water tank",
        "top",
        "element",
        "water heater hot",
        "heating",
        "gallons",
        "cold",
        "heat",
        "bottom",
        "gallon water heater",
        "energy",
        "temperature",
        "heating element"
    ],
    "transcript_entity_values": [
        "3380W. Math",
        "9:00 at night",
        "10 degree",
        "2.5",
        "approximately 10 gallons",
        "two",
        "every minute",
        "40 gallons",
        "2",
        "about an hour and a half",
        "more than half",
        "4500",
        "one",
        "240V",
        "132.4",
        "Butin",
        "more than 20 gallons",
        "2+2",
        "sixteen",
        "26",
        "about 7039 watt-hours",
        "five hours",
        "4 liters",
        "gram",
        "1075.5 gram calories",
        "about 1.6 liters per minute",
        "26.9 milliliters",
        "1.5 gallons",
        "13 extra gallons",
        "13 gallons",
        "first",
        "70%",
        "more than a day",
        "winter day",
        "CLACK",
        "Five hours",
        "only 45 minutes",
        "4 liters per minute",
        "sec",
        "three",
        "toa dip tube",
        "themis",
        "Fahrenheit",
        "208Vsupply",
        "Upper",
        "3.87 million",
        "only 8 degrees",
        "5.7 liters per minute",
        "4500 watts",
        "16 degree",
        "upa good half",
        "kilowatt-hours",
        "the past couple of months",
        "12.8 ohms",
        "today",
        "18.75",
        "4500W.",
        "between 1 and 5 AM",
        "as high as",
        "53 gallons",
        "10 degrees Celsius",
        "96.8 liters",
        "later - five hours",
        "Chevy",
        "10 kW",
        "40 degrees",
        "Thereason",
        "208V",
        "Volts",
        "blet deh buh dih",
        "half",
        "that over an hour",
        "around 50 degrees Celsius",
        "25.5 gallons",
        "4 liters per",
        "16.2 million joules per hour",
        "40 gallon",
        "65 gallons",
        "Legionaries",
        "6",
        "1st hour",
        "4500 joules",
        "aretwo",
        "at least 10 gallons",
        "a day",
        "40 degrees celsius",
        "15 minutes",
        "40 degree",
        "42 degrees",
        "26 degree",
        "an hour",
        "First",
        "second"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "PERCENT",
        "DATE",
        "DATE",
        "ORG",
        "TIME",
        "TIME",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "NORP",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "TIME",
        "DATE",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "NORP",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "ORDINAL",
        "ORDINAL"
    ],
    "vector": [
        -0.054243311285972595,
        0.010945242829620838,
        0.027203785255551338,
        0.003052382729947567,
        -0.015141741372644901,
        -0.08825156092643738,
        -0.04800582677125931,
        0.08628634363412857,
        -0.055539801716804504,
        0.02198738604784012,
        -0.05555360019207001,
        -0.05179052799940109,
        0.0818166434764862,
        0.02807030826807022,
        0.002394787035882473,
        0.010436278767883778,
        -0.05381305515766144,
        -0.03809915482997894,
        -0.10572860389947891,
        -0.05173635110259056,
        0.08135946840047836,
        0.0009420316782779992,
        0.05363958328962326,
        -0.038722191005945206,
        0.02854909747838974,
        0.030286148190498352,
        -0.025768596678972244,
        0.06996535509824753,
        -0.05375661700963974,
        0.10121966898441315,
        -0.004748444072902203,
        -0.035939186811447144,
        0.003273556474596262,
        -0.0456741526722908,
        -0.041132885962724686,
        -0.02393837459385395,
        0.007482599932700396,
        -0.031459491699934006,
        -0.01922803558409214,
        0.04093877598643303,
        -0.004772063344717026,
        -0.07642366737127304,
        0.09535188227891922,
        0.050969723612070084,
        -0.07927729934453964,
        0.03354307636618614,
        -0.08472175896167755,
        -0.015875956043601036,
        -0.12873037159442902,
        0.01018674299120903,
        0.02784961834549904,
        -0.049914926290512085,
        0.012063257396221161,
        0.03526874631643295,
        -0.05020394176244736,
        -0.040344662964344025,
        0.02365010417997837,
        -0.015183968469500542,
        0.02187262289226055,
        0.04436836764216423,
        0.05228417366743088,
        -0.018892694264650345,
        -0.04108252376317978,
        0.0033209023531526327,
        -0.006990320514887571,
        -0.0462438128888607,
        -0.011810810305178165,
        0.04960665851831436,
        -0.05731777101755142,
        -0.06260525435209274,
        0.03789757564663887,
        -0.06512158364057541,
        0.08257448673248291,
        0.032150447368621826,
        -0.031642235815525055,
        -0.08359133452177048,
        0.10094869136810303,
        0.041136015206575394,
        0.03551238402724266,
        -0.033198047429323196,
        0.011624452657997608,
        -0.027111371979117393,
        -0.03355380520224571,
        -0.008024354465305805,
        0.07653283327817917,
        0.0438121072947979,
        0.08595027029514313,
        -0.058450840413570404,
        0.022902587428689003,
        -0.04618654027581215,
        -0.044693171977996826,
        -0.009455280378460884,
        -0.01979319378733635,
        -0.010500852018594742,
        0.09563664346933365,
        0.0919308289885521,
        -0.04446373134851456,
        0.04049374908208847,
        -0.0650995522737503,
        -0.06743744015693665,
        -0.026087215170264244,
        -0.026805546134710312,
        -0.03223136439919472,
        -0.029435181990265846,
        0.028515730053186417,
        -0.026597870513796806,
        0.009930552914738655,
        0.09359423071146011,
        0.10045900195837021,
        -0.056189097464084625,
        -0.060360800474882126,
        0.016930917277932167,
        -0.039115577936172485,
        0.03923909366130829,
        0.11355249583721161,
        -0.07776692509651184,
        -0.0069995177909731865,
        -0.0073856692761182785,
        0.05507563427090645,
        0.03248807415366173,
        0.011532478034496307,
        -0.011778498068451881,
        0.03366151452064514,
        -0.02522679977118969,
        0.0010329983197152615,
        0.042780838906764984,
        -0.0567890889942646,
        5.222239815361571e-33,
        -0.03170603886246681,
        -0.006195927504450083,
        0.02434997446835041,
        -0.04372388869524002,
        0.05394839867949486,
        -0.031254980713129044,
        -0.087568499147892,
        0.03784135356545448,
        -0.012587089091539383,
        0.021596895530819893,
        0.08299221098423004,
        0.10216491669416428,
        0.0019264885922893882,
        0.06908228248357773,
        0.03638015314936638,
        -0.011762239038944244,
        0.025657622143626213,
        -0.01584831066429615,
        -0.0583672858774662,
        0.0005419360822997987,
        -0.0007444196962751448,
        0.03379317373037338,
        0.09556432068347931,
        -0.012296594679355621,
        -0.011532752774655819,
        -0.08819883316755295,
        0.006148710381239653,
        -0.04097704589366913,
        0.007912629283964634,
        -0.009439514949917793,
        -0.013835770078003407,
        -0.07962246984243393,
        0.006623188499361277,
        -0.0314030684530735,
        -0.020643996074795723,
        -0.0420384556055069,
        0.04614478722214699,
        -0.056183286011219025,
        -0.011161155067384243,
        0.0353996679186821,
        -0.002987323561683297,
        -0.0023239541333168745,
        0.05746607109904289,
        0.1003839448094368,
        0.01285411324352026,
        0.05449126288294792,
        -0.0009382867719978094,
        0.0006317422376014292,
        0.02954256720840931,
        0.05293360725045204,
        0.009051300585269928,
        0.017388027161359787,
        -0.033780742436647415,
        0.07104258984327316,
        0.02243736945092678,
        0.00470272172242403,
        0.011791136115789413,
        0.05111107975244522,
        -0.01452516857534647,
        -0.017496716231107712,
        -0.10084820538759232,
        0.02029930055141449,
        -0.012678882107138634,
        -0.03042382374405861,
        -0.02457476407289505,
        0.038962509483098984,
        0.019124669954180717,
        -0.030975284054875374,
        0.031248081475496292,
        0.008355393074452877,
        -0.04411521926522255,
        -0.04104950278997421,
        -0.018241707235574722,
        0.045207954943180084,
        0.07527422904968262,
        0.028357015922665596,
        0.06683031469583511,
        0.00884301122277975,
        -0.07513760775327682,
        0.05982843041419983,
        -0.05676854029297829,
        -0.022586850449442863,
        0.06133010610938072,
        0.013244302943348885,
        -0.022927038371562958,
        -0.12890350818634033,
        0.06048326939344406,
        0.06921208649873734,
        0.0769464522600174,
        0.07910188287496567,
        0.06362977623939514,
        -0.03613812103867531,
        -0.01180668082088232,
        -0.028603123500943184,
        0.021263133734464645,
        -4.7284840662162234e-33,
        -0.01032289583235979,
        0.02775184065103531,
        0.01180126890540123,
        0.0345500186085701,
        0.025068599730730057,
        -0.052848465740680695,
        0.019068783149123192,
        -0.02795739471912384,
        0.03825994208455086,
        -0.11233721673488617,
        0.07457129657268524,
        -0.03146732598543167,
        -0.012167250737547874,
        -0.07689535617828369,
        0.0018142637563869357,
        0.019190551713109016,
        -0.024126261472702026,
        -0.04242094233632088,
        0.022771406918764114,
        -0.0049368226900696754,
        0.09738293290138245,
        0.06943731009960175,
        -0.029788004234433174,
        0.05620262399315834,
        -0.11958278715610504,
        -0.01396656222641468,
        -0.054040685296058655,
        -0.0740414634346962,
        0.015675444155931473,
        -0.03120628371834755,
        -0.03953723609447479,
        0.08256472647190094,
        0.048313677310943604,
        0.08359968662261963,
        -0.037877317517995834,
        0.01680176891386509,
        0.08945497870445251,
        0.05663403496146202,
        0.0198628231883049,
        -0.018514610826969147,
        0.037416473031044006,
        -0.0667305737733841,
        0.013896669261157513,
        -0.019990049302577972,
        -0.11121947318315506,
        0.06943414360284805,
        0.002594038611277938,
        -0.10184355080127716,
        -0.043772198259830475,
        0.07228855043649673,
        0.028825949877500534,
        -0.10886405408382416,
        -0.034624285995960236,
        -0.02027040347456932,
        -0.008519531227648258,
        -0.11966855078935623,
        0.0032218722626566887,
        -0.04818248003721237,
        -0.10352758318185806,
        -0.030707379803061485,
        0.1216856837272644,
        0.036953650414943695,
        0.04549049958586693,
        0.06671453267335892,
        -0.029076818376779556,
        0.0565643273293972,
        -0.04771403968334198,
        -0.0403934083878994,
        0.073588065803051,
        -0.0479978546500206,
        -0.07094224542379379,
        -0.05273585394024849,
        -0.027281373739242554,
        -0.05298665538430214,
        0.049913305789232254,
        0.026646599173545837,
        -0.04168301820755005,
        -0.08071651309728622,
        -0.08607465773820877,
        0.023413406684994698,
        0.02345862053334713,
        0.13011060655117035,
        -0.03809259831905365,
        -0.11048678308725357,
        0.06806837022304535,
        -0.036998823285102844,
        0.04212803766131401,
        0.019719798117876053,
        0.03847320005297661,
        0.04140859097242355,
        0.013626005500555038,
        -0.027425959706306458,
        -0.059853360056877136,
        0.05024490877985954,
        -0.028532952070236206,
        -5.960124838111369e-08,
        -0.08951711654663086,
        -0.0092457365244627,
        0.012349708005785942,
        -0.018671251833438873,
        0.014351899735629559,
        -0.029490187764167786,
        -0.029057864099740982,
        0.017321353778243065,
        0.01639801636338234,
        0.08354455232620239,
        -0.009400598704814911,
        -0.008364399895071983,
        0.04525911435484886,
        0.01808316819369793,
        -0.006412840448319912,
        -0.07076720893383026,
        0.1427496373653412,
        -0.001446576789021492,
        -0.01075034961104393,
        -0.020082293078303337,
        -0.05664735287427902,
        -0.01274055615067482,
        0.029649559408426285,
        0.03216128796339035,
        0.0068787275813519955,
        0.08166640996932983,
        -0.0014978250255808234,
        0.09327957779169083,
        0.020575033500790596,
        0.015901295468211174,
        -0.01814509555697441,
        -0.01180960051715374,
        -0.05952000617980957,
        0.02736632153391838,
        0.07228606194257736,
        0.014554319903254509,
        -0.03417613357305527,
        -0.018799643963575363,
        -0.042172256857156754,
        0.04087932035326958,
        0.05711251124739647,
        -0.06519041955471039,
        0.03270865976810455,
        0.05135215446352959,
        0.08354352414608002,
        -0.03973064199090004,
        -0.11789169162511826,
        -0.021612348034977913,
        0.0843558982014656,
        0.007192713208496571,
        0.05854234844446182,
        -0.004919725004583597,
        0.028375495225191116,
        -0.07449371367692947,
        -0.04840894415974617,
        0.014782130718231201,
        -0.04115191102027893,
        0.0180972907692194,
        -0.05004412680864334,
        0.0023226209450513124,
        0.07841615378856659,
        -0.004368891008198261,
        0.012701423838734627,
        0.031038446351885796
    ]
}