{
    "id": "BR_BLdK_FB8",
    "title": "This Mystery Tech is Way TOO Expensive",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2023-11-26T17:01:15Z",
    "video_url": "https://www.youtube.com/watch?v=BR_BLdK_FB8",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "tech",
        "mystery",
        "amazon",
        "drop",
        "epos",
        "pc38x",
        "gotta go flamingo",
        "cmf",
        "cmf by nothing",
        "nothing",
        "watch pro",
        "buds pro",
        "charger",
        "cmf watch",
        "cmf watch pro",
        "cmf buds",
        "cmf buds pro",
        "cmf headphones",
        "headphones",
        "watch",
        "hyperkin",
        "retron 5",
        "retron",
        "tesla",
        "cyberbeer",
        "cyberstein",
        "cyber beer",
        "cyber stein",
        "cybertruck",
        "cyber truck",
        "polaroid",
        "polaroid i-2",
        "polaroid i2",
        "i2",
        "hammer fist",
        "austin",
        "austin evans"
    ],
    "views": 468354,
    "likes": 14551,
    "comments_count": 411,
    "description": "Download Whatnot  and join me there live on Thursday, 11/30, at 3pm PT, for your chance to win a PS5 and more and get some awesome holiday gifting deals!  Hyperkin RetroN 5 on Amazon:  Hammer Fist:  CMF by Nothing 65W GaN Charger on Amazon:  CMF by Nothing Watch Pro on Amazon:  CMF by Nothing Buds Pro on Amazon:  Drop + EPOS PC38X Gaming Headset:  Polaroid I-2 Instant Camera on Amazon:  Gotta Go Flamingo on Amazon:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   Chapter Titles: 0:00 Retron 5 2:06 Hammer Fist 3:38 Whatnot 4:26 CMF by Nothing 9:44 EPOS Gaming Headset 11:58 Polaroid I-2 13:15 CyberBeer 16:28 Gotta Go Flamingo",
    "description_links": [
        "https://whatnot.com/invite/austinnotduncan",
        "https://austin.tech/retron5",
        "https://austin.tech/hammerfist",
        "https://austin.tech/cmfcharger",
        "https://austin.tech/cmfwatchpro",
        "https://austin.tech/cmfbudspro",
        "https://austin.tech/epospc38x",
        "https://austin.tech/polaroidi2",
        "https://austin.tech/gottago",
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- Just fly into my hand. - Just do it. - Directly into my hand. Ow! (all laughing) - [Joanna] Oh, God. - Okay, so this item is slightly larger than I had anticipated because it is a Retron 5. I don't why I thought it was gonna be a small item. - [Ken] I was like, are you sure? - This is multiple system compatibility retro game device that cost 179.99. Inside we have, wow, that's blue and pink. Why is this so huge? What the... Oh, well, there you go. That's your problem right there. (plastic clattering) That does not sound high quality. Okay, so we've got a GBA slot up front. We've got Famicom, NES, Super NES, Genesis. So it comes with one wireless controller, which is horrendously uncomfortable. What? (staff laughing) Whose hands are like this? And if so, I'm sorry. Well, if that's not good enough for you, it also comes with a wired SNES controller. - [Ken] Oh, that looks a little better. - This is basically just a Super Nintendo controller. Let's grab a display and let's try our Retron 5. All right, let's fire it up. Ahem, let's fire it up. (button clicking) So we are now up and running. I'll actually say it doesn't look bad, although it's doing a little bit of a weird upscale because it's actually full screen here. - There you go. - Hey, I made it. Wait, gimme my eggplant. Oh. (staff laughing) Yeah, okay. Let's try a Game Boy game. I'm not massively impressed. Okay, so we can play regular Game Boy games as well as Game Boy Color and Game Boy Advance. Boy, this is really hard to play that close. So what can I say about the Retron 5? I mean, it works. I guess my problem is that for this much money, I just feel like there's better options. Okay, that's a piece of wood. And those are nails. - I got you a little help. - Okay, thank you. This is the Hammer Fist. That's what they called me in high school - [Ken] At home? - [Matt] You didn't go to high school. (staff laughing) - [Ken] Is that what your mom called you? - [Matt] We gotta unpack this in therapy. Okay? - I called myself Hammer Fist 'cause it made me feel cool. Okay? More than just a hammer, it's a fist. So you could be a mallet, a grip, a hammer strike, 90% square, or pull nails. So I'm gonna put these two boards and I'll make them one. I want to be double thicc. - [Ken] Be careful, you might alert the guards. (laughs) - Let's do this for real on an actual hard surface, shall we? (metal pounding) Okay, so I have penetrated said wood. What, it's the technical term. - [Matt] My boss. (dolphin crying) - I'm not entirely sure why this is better than a hammer. 'cause with a hammer you can actually sort of swing, you kind of get it... With this, it feels like it's probably better for kind of starting things 'cause I've got a little bit more sort of control over it to kinda get something started, but then like, if I really wanna give this thing the beans, right? (metal thudding) Yeah, see? I'm just, I'm gonna like smash it 'cause I feel like I don't have like the the swing 'cause I'm kinda like almost jabbing. If you are watching this video and you think the hammer fist makes a lot of sense, please let me know in the comments why and how. Because I don't think it's bad. I think it works fine enough, but I would just rather use a hammer. Oh ho, what's this? But a brand new PS5 that I'm going to be giving away thanks to the sponsor of today's video, Whatnot. I've got a ton of stuff that I'll be auctioning starting at $1, including this Xbox Series S and a ton more, most of which has been featured in previous videos. If you're not familiar, Whatnot is the best destination to find yourself tech deals and it is a ton of fun. I did my first stream there a few weeks ago and it was an absolute blast. If that sounds cool, you should definitely stay tuned for my stream this Thursday, November 30th at 3:00 PM Pacific time, and I'll have all the time zone conversions right here where I'll of course not only be giving away this PS5 to a lucky winner, also some other giveaways and a ton of great deals. So what are you waiting for? Make sure to download Whatnot using the link in the description where you'll get not only $10 off your first purchase, but you can also come and join the live stream, which again is this Thursday at 3:00 PM Pacific Time. Big thank you to Whatnot for sponsoring this video. And I will see you with the giveaways and the Robo Raptors and the other stuff we're selling. - Yeah. - Okay. - Hup. - Oh, there's more. Okay. More stuff. All right, what do we got? What do we got? What do we got? What do we got? Oh snap. So this is the CMF by Nothing charger and earbuds? I'm sensing a trend here. I seen item number one and two. What's in item number three? It's the watch, okay. So CMF, it's more of a budget brand, by Nothing and they've got themselves the first wave of accessories. All of these are quite affordable, for my understanding. - [Matt] All of this was like 150-ish. - Let's start out with the charger itself. Boy, that's what you get, huh? So it's, oh you know what? Eh. Little bit big. I mean, to be fair it's still GaN, so it's not like huge. It's a little bit bigger than I thought it was gonna be. So for context, this is an Anker GaN prime power adapter compared to the Nothing. The Nothing was definitely just larger. I mean, it's fine but also it's hyper-generic. Like they just slap their label on this. There's nothing unique about this at all. Not a great start. It's fine, but just aggressively mid. Next up, let's do the Buds Pro. The case is very stylish, not meant to be small. I don't wanna like jump to conclusions, but I will say first impression style over function is kind of the vibe I'm getting here. - [Matt] You know where that's gonna fit perfectly? In the back pocket where the Skoal goes. - Oh. Yeah, yeah, yeah. - [Matt] You get the Skoal pocket, the dip pocket. - There you go right there. - Oh don't hit, oh. - Oh. - So very, very orange. Tap and hold noise control. Oh, they have ANC for 50 bucks. - [Ken] Oh, okay. - Let's see, so- - It's a hybrid ANC. - Oh, so not good. Got it, okay. So while I allow these buds to update their firmware, why don't we also pull out the Watch Pro, which I don't know what I should expect from a $69 smartwatch, but let's take a look. So for context, I've got a 44 mil Apple Watch and that is significantly bigger. Now I will say that it uses just magnets to attach the cable on the back. So there's no dock or anything. It just like snaps on here. But the magnets seem pretty strong. Also, this watchband feels quite nice and I will say that even though it's a little bit chunky and quite lightweight, this screen is actually not bad. So it's currently measuring my heart rate, which says it's 69 BPM, which is funny on a $69 watch. So I guess what I'm learning here is that this actually is a pretty decent watch, but I'll be honest, I can't just judge it based on these first impressions. Let me actually spend a little bit of time with the watch and I will report back. But before we finish with the watch segment, lemme come back to these earbuds. I'll say the Buds Pro, while they're lightweight are quite comfortable and actually, is the noise control on? It is, okay. So we've got transparency mode, which... (clapping) (snaps fingers) Wait, can everyone just talk for a minute? Just keep talking. - Hey, we're talking. - Have a conversation. - Hey. - Austin's stupid. - [Alex] Hey, I'm walkin' here. - What do they say? They call it hybrid ANC. - [Alex] Yes, they call it hybrid active noise canceling. - So I understand what they're talking about. Imagine the light version of noise canceling. So it actually does do, when you have it on high, it does actually kind of knock out that sort of like low end kind of rumble, like, the kind of the bass air conditioning units and that kinda stuff. It's fairly subtle, though. Like, if you're on a plane, this actually would probably do kind of okay, but it's not anywhere near to the same level of most like noise canceling headphones, but 50 bucks, a little bit of ANC, I'll take that. Initial thoughts, some nice features here. So the fact that you do have ANC, while it's not super strong, is appreciated. It also does have sensors so that when you take 'em over your ears, it pauses. The way I'll describe these is cheap, but tuned really well out of the box. The reason I can tell they're tuned well, you change any of the EQ settings, they sound like dog (squeak). But in the balanced EQ mode, they actually are pretty good, like, for 50 bucks. But the real test for this Nothing stuff 'cause the charger is just kind of okay is gonna be how I spend some time with the actual watch. I'm gonna do the dual-watch life and see how the 70, $69 Nothing watch compares to the Apple Watch that I've dailied for like 10 years now almost? So I spent a little bit of time with the Watch Pro and some initial thoughts. First and foremost, this thing is chunky. I actually caught it on my backpack this morning as it was going to work. It like literally like caught my backpack and I had to like wrestle it free. I also, it's a little bit of a smaller thing, I can't get it really super comfortable on my wrist. I think it's partially because it is so chunky. Either it's a little too loose or it's always a little too tight. That being said, I can forgive that kind of stuff for $69. So things like sleep tracking works well. The notifications once you manually enable them all work well. There's some minor annoyances, like the fact that as far as I can tell, there's no auto brightness. So look at night I have to manually turn the brightness down and during the daytime I have to turn it up, which feels a little bit strange. Would I buy this for 69 bucks? I think I would. It is big, though, it is big and it is chunky. But if you can get away with a larger watch and that doesn't bother you, honestly? It's pretty solid. You know, I... (box thudding) I was trying to talk to Robo Raptor. Literally, I'm like feet away. What? (box thudding) - [Matt] I get what he's doing. - Oh, it's from Drop. (laughs) Okay, I get it. I get it. Okay, so we've got an extra set of ear cups, which is very cool. I also like the look of these. So they're open back, but there's a little bit of a mesh on here. Now they are, I will say very plastic-y. We've got on the left side, we've got our mic, which also just you can hear the click when it mutes. So that's nice. And then you've got a little slider actually for the volume. Well, so let's give 'em a try. Oh, oh wow, that- Okay, those are very stiff. Holy. It's a tight fit. So they're definitely like kind of squeezing on my head a little bit, but because they're so lightweight, they're not too bad. I would be a little curious on how these would feel after a longer period of time. Alright, so first thing to do is just a little audio test. Woo hoo hoo hoo hoo hoo hoo. Wow, okay. So they actually have some punch. I had not heard the bass like fully kick in until I got that to that point. They actually have some real punch to them in a way that's very pleasant. Alright, so you're now listening to what it sounds like with the microphone on these headphones. I mean, the mic looks impressive. It's not the little fiddly wimpy boy. So let's see what they sound like. That's crisp. Alright, so you're now listening to what it sounds like- How much are the PC38Xs? - [Ken] 180 bucks. - Why would you buy any other gaming headset? Like, straight up. Like obviously, you wanna spend 30 bucks, spend 30 bucks. That is... I have nothing to complain about. - [Alex] So if you get it from the Drop website itself, it's 169 but it's on sale right now for 139. - This is top five deals I think I've ever seen on Mystery Tech. I would pay double. And that's not something like, this is not a sponsored segment or anything like that. Like, these are some of the most impressive gaming headphones I've ever tried. Full stop. And most of the time when I'm talking about that, I'm talking about headphones that cost double the price. Man, they're onto something here. I am gonna take these home. (sad trumpet music) (box thudding) Wow. Hmm. What could this be? Well, I don't really have a whole lot of clues besides something that has a battery of some variety inside. Alright, we have a very, very shiny box. Oh. Oh, is it? Wait, there's a pol- Wait, do they still make Polaroid instant cameras? I didn't think they still made them. - [Matt] Maybe if you open the box, you might answer some of the questions you have. - So this is the Polaroid I-2 analog instant camera. Someone's Polaroid already in here? There's also an app. What, why, why would there be an app for a film camera? - [Matt] Show you how to shake it like a Polaroid picture. - I'm not- You are not supposed to shake Polaroids. - [Matt] The song lied to me? - Will.i.am, noted liar. - Will.i.am? - Are you kidding me? - Will.i.am? - You just confused The Black Eyed Peas with Outkast. - And the camera itself comes in this lovely little, I was gonna say Crown Royal bag. (all laughing) - [Matt] Tell me you're an alcoholic without telling me you're an alcoholic. - I hope you're enjoying this episode of Mystery Tech. Subscribe and ring-a-ling that ding-a-ling button 'cause the fun ain't stopping here. All right. - [Ken] Did someone say alcohol? - What's this? What is that? Oh my god, there's more Tesla stuff? Wait, Cybertruck. There's CyberBeer? - [Ken] Don't you like Elon's brew? - (laughs) I don't want Elon's Brew anywhere near or in the vicinity of my mouth, please. Just keep that away. So how do I- - [Matt] Does it smell like Elon's musk? - Okay. (staff laughing) So we're going back and forth. Oh, that looks dope. Wait, wait, wait, what is all going on here? So we have a lens cap. All right, you know what? I'm excited about literally everything except Elon's brew in my mouth. So I'm gonna start by taking some photos and then we'll take a look at our Tesla CyberBeer and see how that works. Do we know how much any of this stuff is? - [Alex] So a pack of that is 17. - So $17 for eight photos, so don't mess it up. And then this camera's surely gonna be like, what, like 300 bucks or something? - [Matt] Ha. (Ken laughing) - [Alex] Okay, I want you to remember how much you like this camera. - Okay, remembering that this thing looks dope. Got it. - Yeah, it is $600. (dial tone beeping) - Okay, all right. You know what? Let's take a look at our $600 hipster film camera. I still do like it, though, so I think I like it. So I'm gonna try to hold it very still for one sixth of a second. And I've turned off the flash. So ready, set, and... (camera clicking) There we go. Okay, we're gonna let that continue to develop for a second. What is a deal with this CyberBeer? Does anyone know? - [Matt] It is beer that costs triple what it should for being- - Whoa, whoa, whoa, it comes in that whole thing? - Yes. - Wait, wait, wait. Hold on. - Well, we might might have cracked it open. - Yeah, we cracked it open a little bit 'cause we obviously have to chill it. - All right. Oh, okay. Oh, I get it. You also get the mugs. - What? - That's actually kind of cool, yeah, so you got your Cyber... - [Alex] They call it the CyberStein. The CyberStein. Boy, it smells like Elon's Musk. Wow. Let's crack it open. - [Matt] Just a Miller High Life in there. - [Ken] They just, they put a Modelo in the there. (camera clicking) - Hey. - Cheers, my friends. - Cheers. - Okay, that's actually... - It's nice. - That was actually pretty good. - I like that. - It's kind of nutty. - Don't say that. - Wait, how much was this? - [Alex] So you could buy just three of those bottles - Without the- - Yeah. - [Alex] For like for a hundred dollars basically. This set with two bottles and the two steins were 150. - Oh actually, okay. You got a deal. - But wait, here's the thing, we've already cracked it open. How much are these going for on resale now? - $300 beer. - [Alex] They're going online for $350. - Ooh, we could of made double money. - So we just drank $200 worth of beer. So these are not quite fully developed. So it's got a little bit more, but that is definitely a vibe. Look man, I'm not gonna say anyone should go out and spend 600 bucks on this much the same way that I'm not gonna say that anyone should go and give Elon any more money for Cybertrucks or whatever, but like, this is fun. Incredibly expensive. Absolutely for rich hipsters, but it is cool. It is a unique product. And the beer is pretty nice, too. Yo, I caught it. And talk about fair game. Gotta Go Flamingo. Can I ask why? - This is actually- - You have to ask your wife because this is the first and only Karen... - This is what she was talking about? Oh, see, now I can't be too mean to it because otherwise I'm gonna be in trouble and that's not worth it. Alright, so this is the Gotta Go Flamingo, which is going to make magic poop to quote unquote \"make you giggle.\" (Matt laughing) - [Ken] I mean, you are a kid. - So I have the Gotta Go Flamingo. - Those legs are funny. - He's just very, very wiggly. I also have the toilet here, but- He doesn't stand up, does he? - [Ken] Again, I don't know how you have children, but like... - They haven't escaped yet. First step, I gotta feed him. (staff laughing) - That was so vile. - Open wide. - We can see it. - Is that in the toilet? - [Matt] I think you're supposed to put, - Oh, no. - Put water in it. - This is not going well. - Oh. - Oh no, stop. I don't understand any of this. - [Matt] Can you gimme the instructions? Fill the toilet up to the line of water. - Okay. Now? - [Matt] So you feed him while he's off the toilet. - Okay. So I think he's got enough. - [Matt] Tips is to use your finger to gently push the food down Gotta Go Flamingo's throat. - [Ken] What? Is that the actual verbatim instruction? - [Matt] I swear to God, I'm not- - It's compacted down his throat. - [Matt] Literally. Yeah. When he sings the Gotta Go song is when he's about to poop. - So just turn him on and just let him sit there. (toy squawking) - Is this the noise he makes while he poops? Oh, he's pooing. - Oh. (all laughing) - I think he's done. Okay. Good job, buddy, you pooped. That's called too much coffee in the morning. - Ah, why is it jiggling? - Ah. - I feel like every time my wife gives me something for Mystery Tech, it's always poo related. It's always in just some way or another. That's just always, it's almost like she's trying to tell me something. But you know what? I learned how to use the toilet months ago and I'm proud to say that publicly. I've got a 90% success rate of using it. - Oh, that's good. - Yeah. That's most of the time. I'm very proud.",
    "transcript_keywords": [
        "kind",
        "bit",
        "watch",
        "Game Boy",
        "Wait",
        "Yeah",
        "Game Boy game",
        "time",
        "Boy",
        "game",
        "Hammer",
        "bucks",
        "Elon",
        "stuff",
        "Hammer Fist",
        "Watch Pro",
        "thing",
        "hoo hoo hoo",
        "Game Boy Advance",
        "ANC"
    ],
    "transcript_entity_values": [
        "Cybertrucks",
        "Polaroid I-2",
        "Modelo",
        "ANC",
        "only $10",
        "SNES",
        "one sixth",
        "first",
        "1",
        "a few weeks ago",
        "two",
        "Matt",
        "the Gotta Go Flamingo",
        "Drop",
        "one",
        "this Thursday, November 30th",
        "GaN",
        "150-ish",
        "a ton",
        "the Watch Pro",
        "69",
        "the Hammer Fist",
        "69",
        "GBA",
        "Apple Watch",
        "Hammer Fist",
        "3:00 PM Pacific",
        "600",
        "Skoal",
        "179.99",
        "30 bucks",
        "Game Boy Color and Game Boy Advance",
        "Matt] Show",
        "Ken",
        "300 bucks",
        "Retron 5",
        "Austin",
        "180 bucks",
        "number one",
        "Cyber",
        "just three",
        "ho",
        "Gotta Go Flamingo",
        "Joanna",
        "Elon",
        "Genesis",
        "this Xbox Series S",
        "Miller High Life",
        "the Gotta Go song",
        "CyberStein",
        "17",
        "Matt] Ha",
        "Yo",
        "Karen",
        "17",
        "Elon's Musk",
        "today",
        "PS5",
        "CyberBeer",
        "600 bucks",
        "EQ",
        "eight",
        "Anker GaN",
        "the Gotta Go Flamingo",
        "BPM",
        "a hundred dollars",
        "Cybertruck",
        "300",
        "this morning",
        "Tesla",
        "90%",
        "Super Nintendo",
        "Tesla CyberBeer",
        "200",
        "139",
        "Polaroid",
        "350",
        "70",
        "69 bucks",
        "Mystery Tech",
        "First",
        "CyberBeer",
        "CMF",
        "the Buds Pro",
        "Gotta Go Flamingo's",
        "169",
        "three",
        "50 bucks",
        "Robo Raptor",
        "Matt] Tips",
        "Super NES",
        "like 10 years",
        "the Apple Watch",
        "Elon",
        "The Black Eyed Peas with Outkast",
        "months ago",
        "150",
        "second",
        "five",
        "44 mil",
        "the Retron 5",
        "NES",
        "Thursday",
        "3:00 PM Pacific Time",
        "Famicom",
        "Crown Royal",
        "Game Boy"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "PERSON",
        "MONEY",
        "TIME",
        "ORG",
        "PERCENT",
        "ORG",
        "FAC",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "LAW",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART"
    ],
    "vector": [
        -0.11000300198793411,
        0.03187759965658188,
        0.009027348831295967,
        -0.027197372168302536,
        0.06673913449048996,
        -0.07823711633682251,
        0.08504404127597809,
        0.009509832598268986,
        0.0011357064358890057,
        0.006427431013435125,
        0.023672375828027725,
        -0.012129698880016804,
        0.004518529400229454,
        -0.04238937050104141,
        -0.02803141064941883,
        -0.031058479100465775,
        0.10282617807388306,
        -0.05564870312809944,
        -0.05494833365082741,
        0.06467943638563156,
        -0.02903173305094242,
        -0.02957962080836296,
        0.0582687109708786,
        0.021012116223573685,
        -0.03681065887212753,
        0.04409601166844368,
        -0.06363099068403244,
        0.007195753511041403,
        -0.06403206288814545,
        -0.0825384259223938,
        0.005118586588650942,
        0.13567985594272614,
        -0.07029588520526886,
        0.00607432471588254,
        -0.028503771871328354,
        -0.01977236568927765,
        0.02964419312775135,
        0.004598564002662897,
        -0.05705151706933975,
        -0.015181291848421097,
        -0.013551738113164902,
        -0.05087924748659134,
        0.0074007255025208,
        0.04903559759259224,
        -0.05821814760565758,
        0.023717166855931282,
        -0.0453021377325058,
        -0.04445446655154228,
        0.05497102066874504,
        -0.02852187491953373,
        -0.017246253788471222,
        -0.08275797963142395,
        0.08824355900287628,
        -0.0249176062643528,
        -0.011974315159022808,
        0.03110278584063053,
        -0.00018890750652644783,
        -0.044438932090997696,
        0.01589740626513958,
        0.011296086944639683,
        -0.024614550173282623,
        -0.05069354549050331,
        -0.017840666696429253,
        0.06190643459558487,
        -0.06857458502054214,
        -0.00833935383707285,
        0.005171213764697313,
        -4.1609608160797507e-05,
        -0.039894528687000275,
        -0.02505425363779068,
        0.02628225088119507,
        0.007861274294555187,
        -0.018656974658370018,
        0.03436896577477455,
        0.05197255685925484,
        0.08725028485059738,
        0.08841650933027267,
        -0.020759418606758118,
        0.01963580772280693,
        0.020206846296787262,
        0.025323858484625816,
        -0.11189616471529007,
        -0.03621041774749756,
        -0.023375175893306732,
        -0.0010385805508121848,
        0.05040145665407181,
        0.04470109939575195,
        -0.0032403352670371532,
        0.021303385496139526,
        -0.022915923967957497,
        -0.06353085488080978,
        0.01669563539326191,
        0.011001239530742168,
        -0.0017513707280158997,
        0.021826956421136856,
        -0.04656791314482689,
        -0.04449467733502388,
        -0.05483497306704521,
        -0.08471892029047012,
        0.09284096211194992,
        0.012149353511631489,
        0.02393672801554203,
        0.09195912629365921,
        -0.05385780707001686,
        0.029942160472273827,
        -0.07781216502189636,
        -0.046867113560438156,
        0.05874726176261902,
        0.07486739009618759,
        -0.027290677651762962,
        -0.016412004828453064,
        -0.05441202595829964,
        -0.06811635941267014,
        -0.02233339287340641,
        0.01153087429702282,
        0.02355830743908882,
        -0.10344912856817245,
        0.05580125004053116,
        0.05195186659693718,
        -0.05186500400304794,
        0.0449569970369339,
        0.07398124784231186,
        -0.08268848806619644,
        -0.0200946144759655,
        0.016263877972960472,
        -0.023563021793961525,
        -0.06687527149915695,
        1.180113162000256e-32,
        -0.024286389350891113,
        0.10830242186784744,
        -0.0029593680519610643,
        -0.09596201032400131,
        0.008777563460171223,
        0.005544040352106094,
        -0.029432673007249832,
        0.050429001450538635,
        -0.049252573400735855,
        0.059672169387340546,
        -0.08467544615268707,
        0.05927709490060806,
        -0.03199402242898941,
        0.07126623392105103,
        0.051189862191677094,
        -0.06181301176548004,
        -0.045444294810295105,
        0.0336892306804657,
        -0.021480167284607887,
        -0.03349470719695091,
        0.0005453497287817299,
        0.023838931694626808,
        0.006917054299265146,
        -0.07690055668354034,
        -0.0155207309871912,
        0.06673521548509598,
        -0.04049745947122574,
        -0.028834177181124687,
        0.13077227771282196,
        0.025851817801594734,
        -0.16565051674842834,
        -0.006489257328212261,
        0.04323986545205116,
        -0.042476676404476166,
        0.019607391208410263,
        0.02222723700106144,
        -0.005471725948154926,
        -0.1407003253698349,
        -0.03768603876233101,
        -0.014727933332324028,
        0.002955266973003745,
        0.010079431347548962,
        -0.12427341938018799,
        -0.04175015911459923,
        -0.04707563295960426,
        -0.02249726466834545,
        0.025671830400824547,
        -0.03124716319143772,
        0.02417576313018799,
        0.061289869248867035,
        -0.050413645803928375,
        0.020169071853160858,
        0.08455333113670349,
        -0.007152440492063761,
        0.006398369092494249,
        -0.10005111247301102,
        0.033395275473594666,
        -0.01662188582122326,
        0.11589018255472183,
        0.016401782631874084,
        0.011007738299667835,
        -0.009356015361845493,
        0.02540016919374466,
        0.03381959721446037,
        -0.05269783362746239,
        0.07386464625597,
        0.005727153271436691,
        -0.006322010420262814,
        -0.07486367970705032,
        0.07349113374948502,
        -0.008829317055642605,
        0.022260723635554314,
        0.06133237108588219,
        -0.062058836221694946,
        0.057387325912714005,
        0.02723848633468151,
        -0.06697003543376923,
        -0.06067049503326416,
        0.024894747883081436,
        0.025178177282214165,
        -0.07667301595211029,
        0.0057522002607584,
        0.038746319711208344,
        0.03594227880239487,
        -0.03326965123414993,
        -0.05719374120235443,
        0.021839095279574394,
        -0.034253835678100586,
        -0.026808857917785645,
        0.01575876772403717,
        -0.011690312065184116,
        -0.03158310428261757,
        -0.032731298357248306,
        0.006119600962847471,
        -0.02048264630138874,
        -1.244915961509181e-32,
        -0.01902909390628338,
        -0.05175938457250595,
        -0.02613135799765587,
        0.027932606637477875,
        0.05316351354122162,
        0.035784948617219925,
        0.010578462854027748,
        0.048483483493328094,
        0.008555056527256966,
        -0.07977321743965149,
        0.030060166493058205,
        0.053891461342573166,
        -0.03292388096451759,
        -0.08285398781299591,
        0.0761636272072792,
        -0.050041183829307556,
        -0.004400785081088543,
        0.004559035878628492,
        0.054190002381801605,
        0.02306189574301243,
        0.12462059408426285,
        0.027698218822479248,
        -0.008113974705338478,
        0.07655061036348343,
        -0.013039736077189445,
        0.04105553776025772,
        0.08353123813867569,
        0.006168010178953409,
        0.013523592613637447,
        0.005820601712912321,
        -0.029847731813788414,
        -0.025300519540905952,
        -0.026429258286952972,
        0.040696170181035995,
        0.06428370624780655,
        0.07789847254753113,
        0.07924721390008926,
        0.06376521289348602,
        0.003740268526598811,
        -0.10772975534200668,
        -0.04425955191254616,
        -0.0023294775746762753,
        -0.0006070168456062675,
        0.045356251299381256,
        0.024176690727472305,
        -0.05501879006624222,
        -0.08575020730495453,
        -0.0034636848140507936,
        0.025438357144594193,
        0.0902584120631218,
        -0.04372053220868111,
        -0.000689471373334527,
        -0.0059281038120388985,
        -0.022123796865344048,
        -0.1388021558523178,
        -0.02406620793044567,
        -0.035492196679115295,
        0.04370974376797676,
        0.021575873717665672,
        0.04127642512321472,
        0.02238064631819725,
        -0.030756749212741852,
        -0.05654873326420784,
        0.007663465104997158,
        -0.03438927233219147,
        0.04686637967824936,
        0.09531037509441376,
        0.014616298489272594,
        -0.03339347243309021,
        -0.0030021972488611937,
        -0.015597171150147915,
        0.006080195773392916,
        -0.06286154687404633,
        -0.041562266647815704,
        0.029601017013192177,
        0.06716807186603546,
        0.06910421699285507,
        -0.013124118559062481,
        0.035112082958221436,
        -0.036114685237407684,
        0.047533243894577026,
        0.03807908296585083,
        0.05963370203971863,
        0.040735047310590744,
        0.024012815207242966,
        0.04951675608754158,
        -0.03507687896490097,
        0.02021694928407669,
        -0.08120003342628479,
        0.009315230883657932,
        -0.010314950719475746,
        0.019826313480734825,
        -0.00266280397772789,
        0.10974681377410889,
        0.01230913307517767,
        -7.589151351794499e-08,
        0.044234152883291245,
        0.029404688626527786,
        0.025890877470374107,
        -0.0367555096745491,
        0.08144964277744293,
        -0.03868903964757919,
        0.01637701317667961,
        0.02326563559472561,
        -0.01784154586493969,
        0.02727546915411949,
        0.07089675962924957,
        -0.023990364745259285,
        0.007953275926411152,
        0.04939032346010208,
        0.03762997314333916,
        0.024661965668201447,
        -0.08229250460863113,
        -0.019848080351948738,
        -0.06296667456626892,
        -0.06706781685352325,
        -0.041872911155223846,
        0.006901807617396116,
        0.11508572101593018,
        -0.1509612500667572,
        -0.0022505796514451504,
        -0.001821237849071622,
        -0.07586026936769485,
        0.09390641003847122,
        0.036011483520269394,
        -0.03445841372013092,
        -0.012109223753213882,
        -0.0013404835481196642,
        -0.07766549289226532,
        0.004516433458775282,
        -0.006100984290242195,
        -0.06513874232769012,
        -0.05957535281777382,
        0.06020855903625488,
        0.0009727645083330572,
        -0.0025017510633915663,
        -0.07688216120004654,
        -0.11735858768224716,
        -0.008643921464681625,
        0.02227970026433468,
        -0.022347036749124527,
        -0.03693636134266853,
        -0.019214550033211708,
        -0.10819821059703827,
        0.019864264875650406,
        0.02919250912964344,
        0.0062286038883030415,
        -0.00012770462490152568,
        -0.031378522515296936,
        -0.0291425958275795,
        0.03291292116045952,
        0.019695952534675598,
        0.006030653603374958,
        -0.01310722902417183,
        -0.028934212401509285,
        0.04732178524136543,
        0.08235468715429306,
        -0.14716455340385437,
        -0.04170502349734306,
        0.09012669324874878
    ]
}