{
    "id": "bsT5X79nP8Q",
    "title": "Apple cares about Android! - Beats Studio Buds",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-06-14T15:03:24Z",
    "video_url": "https://www.youtube.com/watch?v=bsT5X79nP8Q",
    "category": "Science & Technology",
    "tags": [
        "Beats",
        "Apple",
        "Studio",
        "Buds",
        "Wireless",
        "Spartial Audio",
        "ANC",
        "Active Noise Cancellation",
        "Audio",
        "Persona",
        "Bluetooth",
        "Pairing",
        "Apple Music",
        "Dolby Atmos",
        "Quality",
        "Affordable"
    ],
    "views": 327243,
    "likes": 16008,
    "comments_count": 723,
    "description": "Save 10% and Free Worldwide Shipping at Ridge Wallets by using offer code CIRCUIT at   The Beats Studio Buds Wireless has excellent sound with ANC, but most importantly it seamlessly pairs with Android phones as easily as the iPhones! Apple does care about Android, they just do it through the BEATS!  Buy Beats Studio Buds Wireless On Amazon (PAID LINK):  On Best Buy (PAID LINK):  On B&H (PAID LINK):   Buy Apple iPad Pro M1 2021  On Amazon (PAID LINK):  On B&H (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - Intro 1:27 - Unboxing 3:11 - Checking out the Studio Buds 3:50 - Trying them on 4:15 - Trying out ANC 6:08 - Battery life 6:34 - Sponsor Ridge Wallet! 7:05 - Pairing them with Android 7:59 - Testing with Android 10:25 - Testing it out with iOS 11:14 - Conclusion",
    "description_links": [
        "https://www.ridge.com/CIRCUIT",
        "https://geni.us/dPtMuH",
        "https://geni.us/0cr4Iwm",
        "https://geni.us/Vv2lMf",
        "https://geni.us/kOp6",
        "https://geni.us/4UomAbI",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- My marbles. I lost my marbles. Well, boys and girls and everybody else is time to rock'n them beats. Beats, Beats. Sorry. I'm already doing it. I'm looking at this camera. I'm not supposed to be looking at this camera. I'm yeah, that happened last time. Beats studio buds. You saw them literally everywhere before you saw them here, including in Lebron James's ears. I've looked in there many times but I've never seen anything is interesting. Baby It's been a while since I took a look at some beats buds, but this one is cool. I mean, this one is affordable, apparently 149.99 Is that the idea? USD? So that place, is it not in the cheap? Not in the budget category, but solidly I think in the kind of mid, mid, maybe upper a little bit tier, because there are, you know fully wireless buds out there that you can get for like 70, 80 bucks. If you're looking for good ones if you're looking for like some just some cheap air pod replacements or whatever. Yeah. There was like 50 and under on Amazon, but 149 for an apple product with active noise canceling pretty good and spatial audio, which is very special. I was trying to work. I wanted to work in a spacial and special pun but it just, I, I, I screwed it up already. Let's just, you know, let's stop with this and I'll open them up and we'll take a look. All right, Gianna. I'm not even playing here. That wasn't a bit, how do you, oh, there's a there's a thing you peel. Okay. What do we got here in the box? Try it. Free music, complete your beats with apple when you complete your beats. Wow. And even rhymes they give you beat ideas right in the package. Initial pairing on Android. Okay. So this is interesting. It's also something that I heard about the this beats was that it's going to be not maybe not just as easy, but maybe similarly as easy to pair on Android, as it is on iPhone. With most of these AirPods beats, apple audio products you just kind of like bring it close to an iPhone or an iOS device. And it'll be like I know what that is paired already before you even try. But this one, I guess will be easier to pair with my pixel three. Did they say that specifically? My phone. - (Jono) Oh, really it says that? - No (Jono) Oh. - And we got not a wireless charging case USBC to see no lightening this time. So I don't know what the last beats product that I did not review came with but the power beats pro came with lightning. - (Jono) Seriously? Yeah. I don't know where apple gets off thinking that anyone wants a lightening cord in this day and age - Fast fuel - Five minutes of charging gets you up to an hour. Okay. And there are alternate ear tip sizes remains to be seen, whether I'll need those. Okay. That's enough of this. And then there's a sticker. And then this is the thing you use the blah, blah, blah. Very cool. Wait, did this call out? John was, stay on track. All right. I need you to keep focused. Ah, oh, it's a beats pill sort of wait is that what the pill looks like is a pill but this reminds me of the B's pill. Is it fair to say that this is like the magically similar? - (Jono) No. Alright. I don't know what I'm talking about. Okay. Open her up. Sunny, pretty lights. What do we got here? Interesting. They look like little. What are the, what's the guy from Mario? Berto. Ooh. That's the Berto sound enough of this. That's weird though. That's kind of freaking me out every time I pick it up. I'm going to be like looking, are you my father? No, let's put them in shall we. There were some, I'm hearing some weird noises. I wish you could hear this. It's like, wow. Yeah. Honestly. It's like, wow, is it? What is going on. Honestly. Oh, it's the active noise canceling. Okay. So there's a tap controls. One tap is play and pause and answer calls and hang up. Two taps is skip track. Three taps is reverse. Skip and hold is the active noise cancellation. Let's see. Okay. I just turned on, I guess. Yeah, clap. Okay. Well, I can definitely hear the clap but it's definitely not passing through the noise anymore. Am I talking loud? I reviewed the AirPods pro back in the day and Okay I'll turn this off again. Wait a second. Okay. I figured it out. There are three levels. There appears to be like past remote in which it lets audio through there's full, active noise cancellation mode where it's like a hundred percent strength. And then there's like a media mode where it lets a little bit through but not all of it. That's what I figured out. Just now I was on the pass through mode when I put them in. So let me, let me like set them to the same full mode and see how I feel once I actually put them in my ears. No! sorry. Apple slash Drake. Drake? - (Jono) No, Dre Okay. Sorry. Sorry. Beats by Drake. I'm going to put them in. Ready? 3, 2, 1. That's pretty good. I feel like I'm back in the void staring at the abyss of my own existence. Um, I also noticed that it's not just a touch control. It's like a physical button, like it clicks. So that's kind of cool. I like having that tactile thing. Although you do have to like push in a little bit which has never great for in years to have a control that that forces you to push it further into your canal. Eight hours of listening time without ANSI or transparency mode turned on with those turned on you'll get five hours of listening time and up to 15 hours combined with in the case with, with all that, that's still pretty good. Like we said, five minutes of fast fuel charge and gives up to an hour of playback. They're compatible with fine. My in iOS. Oh, it's compatible with find my device on Android. Wow. That means we should do Android first. I've been installing beats. Yeah. Yeah. But before we get to the thing that I was just going to get to a second ago I got to tell you, this video is sponsored by Ridge wallet. Ridge wallet is a compact wallet that keeps pant bulge down. It's got RFID blocking plates to keep thieves from stealing your info. There's over 30 colors and styles including carbon fiber and burnt titanium. And you can get 10% off and free worldwide shipping by using offer code circuit at ridge.com/circuit who play some fricking music. John, what are we doing here? Oh, I guess I should put them back in the thing. That's kind of annoying that they're magnetic. They're magnetically sticking to the top of the case. The magnets are all up in the place, but you know, magnets how do they work? You know? Oh, it just showed up. I didn't even do anything. I have the app open but I didn't like press start or anything. That's exactly like it. What it does on iOS. That honestly makes me so happy. Not even regular wireless earbuds do that. The only time that this has happened is between air paws and iOS devices. And now apple has made a pair of wireless earbuds that have an apple feature. It actually makes Android better. - (Jono) Sony does that. Sony does it too? where you just open it and then it pops up. Okay, my bad, good job. Sony crab rave on Spotify launching in 3, 2, 1 go, wait, what mode do I want to be on? I want to be on, okay. This is full. This is full auto active noise canceling. Okay, wait, I said it wrong. I said it wrong at the beginning. There is a mode in which it's just completely off. And then there's a mode in which you got active noise canceling happening. And then you have pass-through active noise canceling and pass through are powered. They require more power. Whereas you can just turn it completely off and have a bit more battery life. I don't know which is which wait it's got. This has gotta be a and C because I'm like hearing feedback when I talk, oh that's actually not great - (Jono) what about the app? - noise cancellation. Off. Yell - (Jono) Papa! Papa! Papa! - Oh, okay From that experiment it appears that with noise cancellation off I hear less direct ambient noise. But when you just yelled, I could hear you better than when I turned noise cancellation on. So cancellation is better going. It's going to be better at canceling out things that pop up on, you know, sudden noises. But if you do want complete silence and you're already in a pretty silent environment you might want to turn noise cancellation off. I don't know. See for yourself. I'm just going to go right to the drop. Woo! Okay, so true to the beat stereotype. There is a heck of a lot of bass in here. Do they have sound profiles? It looks like they don't have EEQ profiles. And honestly that should just be standard in these sort of wireless ear, but apps. So I'm a little disappointed to see it here to see its absence here but maybe next time maybe they can always add it. Apple music. Show me what you got. I can, I can really hear the difference. There's way more depth in the apple music version. Yeah. Yeah. Oh yeah. Is there any way to be honest about how I feel inside? - (Jono) You can tell me, Riley - I can feel it go up William emotion. Yeah. That's a very, very noticeable difference. Still very bass heavy. Maybe it was a bit more mid heavy but there was definitely like just more of it. Maybe that's the special spatial experience. So spatial audio. I'm not going to get the spatial audio experience on my Android anyways. Okay. We're connected first crab rave. Yep. It's still got the very full interesting so it will work better. I mean like, obviously there's a number of differences between my pixel three and the iPad pro in terms of like the audio hardware on board. But that's, that's of crazy to see that much of a difference. Let's see how much of a difference there is when I use the fancy spatial audio link. All right. Ready? Late at night by Roddy Rich. I don't think I like that one disclosure latch. Oh, hell yeah, dude. I love that song. All right, here we go. The latch don't use this. What am I supposed to take away from that? It sounded good. This was like a little bit more clear. It was a little less muddled than how an apple music sounds on the Android. So I don't know what conclusion to draw there. Other than if you are on Android you probably don't have it a subscription to apple music. It, you might. So if you have an Android device, these will be great. I'm impressed with these overall 149 for active noise cancellation IPX for water and sweat resistance. Lots of battery life. Lossless audio support on, on apple devices. Anyways. There's a little bit worse on an Android device, but still pretty good. I really liked that they have the automatic connection thing and they added that pretty impressive. What do these look like? I even see myself. Do they look cool? - (Jono) Yeah. I like them all that. - I like them a little bit I don't really love how they kind of like stick out from here like that. I mean, whatever. I mean, honestly, if you care about what these things look like in your ears, you got, you got bigger fish to fry, man. You got other stuff to worry about in life. Screw the haters, block them out with the active noise canceling. This is a beats pill. I'd gladly swallow. Well, I don't know about you but I would I say that's a short circuit right there. Do you want to see more unboxings and ramblings on about things that unscripted tell you what those subscribed detect leaks? We need some views. See you later.",
    "transcript_keywords": [
        "beats",
        "active noise",
        "noise",
        "active noise canceling",
        "Android",
        "yeah",
        "noise cancellation",
        "apple",
        "noise canceling",
        "active noise cancellation",
        "active",
        "bit",
        "time",
        "mode",
        "cancellation",
        "audio",
        "pretty",
        "canceling",
        "good",
        "thing"
    ],
    "transcript_entity_values": [
        "USBC",
        "3",
        "RFID",
        "AirPods",
        "iPad",
        "the day",
        "Three",
        "three",
        "One",
        "Riley",
        "one",
        "ANSI",
        "iPhone",
        "70",
        "this day",
        "slash Drake",
        "Roddy Rich",
        "Berto",
        "Amazon",
        "Apple",
        "149",
        "John",
        "Mario",
        "Five minutes",
        "Eight hours",
        "Jono",
        "50",
        "149.99",
        "Lebron James's",
        "up to an hour",
        "first",
        "1",
        "Sony",
        "10%",
        "Android",
        "Gianna",
        "William",
        "five hours",
        "mid, mid",
        "80 bucks",
        "Two",
        "Ridge",
        "Spotify",
        "hundred percent",
        "Drake",
        "2",
        "up to 15 hours",
        "years",
        "five minutes",
        "over 30"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "TIME",
        "TIME",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "PERSON",
        "PERSON",
        "TIME",
        "DATE",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "TIME",
        "DATE",
        "TIME",
        "CARDINAL"
    ],
    "vector": [
        -0.1000383049249649,
        -0.030248336493968964,
        0.05692670866847038,
        -0.09436090290546417,
        0.049838341772556305,
        0.04938969016075134,
        -0.003902375465258956,
        -0.03659352660179138,
        0.036598533391952515,
        0.06290248781442642,
        0.10007476061582565,
        -0.0012192358262836933,
        0.028061239048838615,
        -0.09419403970241547,
        0.10879472643136978,
        -0.028910525143146515,
        0.04679049551486969,
        -0.023570580407977104,
        -0.03257014602422714,
        -0.01815914921462536,
        -0.09027628600597382,
        0.002223969902843237,
        0.06443219631910324,
        0.022477781400084496,
        0.02934655174612999,
        -0.049880754202604294,
        -0.029161466285586357,
        -0.014792654663324356,
        0.0076596373692154884,
        -0.03232450410723686,
        0.023063262924551964,
        0.01804015226662159,
        0.0647854283452034,
        0.031273942440748215,
        -0.06434989720582962,
        -0.08259040117263794,
        0.030307231470942497,
        -0.02626122161746025,
        -0.0664316788315773,
        -0.02899431623518467,
        0.003666049800813198,
        -0.013097978197038174,
        -0.028246145695447922,
        0.07967837154865265,
        -0.005058079957962036,
        -0.017826726660132408,
        -0.040741514414548874,
        -0.016889838501811028,
        -0.007309454958885908,
        0.1005525141954422,
        0.06250070780515671,
        -0.042208440601825714,
        0.03728976845741272,
        0.008008244447410107,
        -0.08399511873722076,
        -0.008111395873129368,
        -0.018496444448828697,
        0.04095366969704628,
        0.0935395136475563,
        0.053940899670124054,
        0.04201877862215042,
        -0.06891994923353195,
        -0.04632524400949478,
        0.02836437150835991,
        -0.05411491543054581,
        0.012418672442436218,
        0.015625903382897377,
        0.11956380307674408,
        -0.02031888999044895,
        -0.060243092477321625,
        0.007183908950537443,
        -0.029929153621196747,
        0.10280230641365051,
        0.024799568578600883,
        0.011245258152484894,
        0.04568108543753624,
        0.03183375671505928,
        -0.01931411400437355,
        -0.06654564291238785,
        0.06141912192106247,
        -0.04906901717185974,
        -0.023164547979831696,
        -0.08030033856630325,
        -0.0448920801281929,
        0.027943061664700508,
        -0.01046778168529272,
        0.009632159024477005,
        0.03296072036027908,
        -0.038473036140203476,
        -0.021834613755345345,
        -0.034520626068115234,
        0.10702812671661377,
        0.02750338613986969,
        -0.02325357496738434,
        0.05965375900268555,
        0.036057788878679276,
        -0.009177767671644688,
        -0.011245917528867722,
        -0.04896611347794533,
        0.029625145718455315,
        0.02383938618004322,
        0.08003322035074234,
        -0.008377558551728725,
        -0.055810995399951935,
        -0.013268453069031239,
        -0.09469405561685562,
        -0.06549368053674698,
        0.04329899698495865,
        0.09708186239004135,
        0.07520676404237747,
        0.004161117598414421,
        -0.06262864172458649,
        -0.04113365709781647,
        -0.043184541165828705,
        0.04472821578383446,
        0.10351870208978653,
        -0.07196962088346481,
        0.07755076885223389,
        0.14070461690425873,
        -0.04993068054318428,
        -0.03852032870054245,
        0.020471427589654922,
        -0.049691516906023026,
        -0.0778958797454834,
        -0.044651374220848083,
        0.04664604365825653,
        -0.07976823300123215,
        1.3101863506303438e-33,
        -0.003570225089788437,
        0.06829261034727097,
        -0.021705573424696922,
        -0.05851808562874794,
        -0.026195745915174484,
        -0.039722952991724014,
        -0.03604213520884514,
        0.03206630051136017,
        -0.0023502358235418797,
        0.01379132829606533,
        -0.09301116317510605,
        -0.012815623544156551,
        -0.08480831980705261,
        -0.0030022282153367996,
        -0.03489713743329048,
        -0.07959689199924469,
        -0.05690372735261917,
        -0.028960958123207092,
        -0.00940447673201561,
        0.058581262826919556,
        -0.06924717873334885,
        -0.09614033997058868,
        0.007442772854119539,
        0.0024060956202447414,
        0.008551922626793385,
        0.018321802839636803,
        0.01962853968143463,
        0.0034463328775018454,
        0.12309132516384125,
        -0.008179455064237118,
        -0.09766319394111633,
        -0.043915148824453354,
        0.044678300619125366,
        -0.04970259219408035,
        -0.013586428016424179,
        -0.01275554671883583,
        -0.07745911180973053,
        -0.015592193230986595,
        0.028477966785430908,
        -0.04791056364774704,
        -0.10280056297779083,
        -0.0138573432341218,
        -0.08731526136398315,
        -0.05175311863422394,
        0.013358146883547306,
        -0.008326792158186436,
        0.008852142840623856,
        -0.0054224589839577675,
        0.0495755635201931,
        -0.03446495532989502,
        -0.03685128316283226,
        0.011875300668179989,
        -0.052902501076459885,
        -0.009968739934265614,
        0.009121689014136791,
        -0.07821463793516159,
        -0.0005786465480923653,
        0.026937779039144516,
        -0.03527490049600601,
        0.01726025529205799,
        0.06569664180278778,
        0.03300682082772255,
        0.02167530730366707,
        -0.025982581079006195,
        -0.05890623480081558,
        0.061108484864234924,
        0.01436549797654152,
        -0.047593869268894196,
        -0.05016617104411125,
        -0.004953784868121147,
        0.011417800560593605,
        0.04678052291274071,
        0.08230068534612656,
        0.020512232556939125,
        -0.0662638247013092,
        0.045725490897893906,
        -0.03407430648803711,
        0.016161127015948296,
        0.032036490738391876,
        -0.022218748927116394,
        -0.06581711769104004,
        0.020573537796735764,
        -0.00016136975318659097,
        0.08756373822689056,
        -0.014061209745705128,
        0.045781154185533524,
        -0.014367740601301193,
        -0.07258874922990799,
        -0.04657791554927826,
        -0.01730739325284958,
        -0.062306612730026245,
        0.04940120503306389,
        -0.028067171573638916,
        -0.026582021266222,
        -0.002409557579085231,
        -2.6284454087149598e-33,
        -0.03602093085646629,
        -0.001304946723394096,
        0.0004315690021030605,
        -0.02583739347755909,
        0.04491787403821945,
        -0.004776595160365105,
        0.07140704989433289,
        -0.001383113325573504,
        0.035676274448633194,
        -0.04136611521244049,
        -0.008852232247591019,
        0.038076676428318024,
        -0.006065365392714739,
        -0.019728872925043106,
        0.01727745682001114,
        -0.07367037981748581,
        -0.0024138162843883038,
        -0.0626538097858429,
        0.05313844606280327,
        -0.0347096249461174,
        0.044536612927913666,
        -0.012798504903912544,
        0.07710675895214081,
        0.055913832038640976,
        -0.023893428966403008,
        -0.020133955404162407,
        -0.013487194664776325,
        0.04518941417336464,
        0.03760906308889389,
        0.002377060940489173,
        0.09154211729764938,
        -0.01027133222669363,
        -0.06841126084327698,
        -0.03579035401344299,
        0.06905300170183182,
        0.012674987316131592,
        0.00547867501154542,
        0.08018562197685242,
        0.01315422635525465,
        -0.0895797535777092,
        0.030382759869098663,
        -0.005160885397344828,
        0.05253686383366585,
        0.01562459859997034,
        0.06995467096567154,
        -0.05869082361459732,
        -0.06904840469360352,
        0.024388207122683525,
        -0.013059497810900211,
        -0.052059829235076904,
        0.03365837037563324,
        0.06068873032927513,
        0.00026897640782408416,
        -0.04378093034029007,
        -0.09805141389369965,
        0.06290335953235626,
        -0.03517479449510574,
        -0.00708407536149025,
        -0.028743749484419823,
        -0.021472005173563957,
        0.017332574352622032,
        -0.03520863875746727,
        -0.0010314699029549956,
        0.016392404213547707,
        -0.08209941536188126,
        0.05177540332078934,
        0.06951902061700821,
        0.06401526182889938,
        -0.014947490766644478,
        0.09069317579269409,
        -0.03126385807991028,
        0.009773768484592438,
        -0.039865948259830475,
        -0.0263779666274786,
        -0.07553985714912415,
        0.056563857942819595,
        -0.03535276651382446,
        0.006447766441851854,
        -0.006663651671260595,
        -0.016081737354397774,
        0.024077244102954865,
        0.1674528867006302,
        0.06059541553258896,
        -0.012971997261047363,
        0.062433578073978424,
        0.04043765738606453,
        0.04400479793548584,
        -0.055838096886873245,
        -0.038383252918720245,
        0.035603899508714676,
        -0.03412143141031265,
        0.030696719884872437,
        -0.08286074548959732,
        0.06210310757160187,
        -0.06411121040582657,
        -5.178829098895221e-08,
        0.04105953872203827,
        0.04646953567862511,
        0.05821874737739563,
        -0.08664939552545547,
        -0.010449524037539959,
        -0.05756467953324318,
        0.007072295527905226,
        -0.04655224829912186,
        0.12542757391929626,
        0.01739056035876274,
        -0.02266370691359043,
        -0.07543221116065979,
        -0.10306644439697266,
        0.04937595874071121,
        0.019098928198218346,
        0.03402131795883179,
        -0.03497147560119629,
        0.10528963804244995,
        -0.025588303804397583,
        -0.06737053394317627,
        0.0019290114287286997,
        0.09012249857187271,
        -0.021195655688643456,
        -0.017560819163918495,
        0.01402283925563097,
        -0.012727318331599236,
        0.06795431673526764,
        0.0702257975935936,
        0.09196581691503525,
        -0.0208712350577116,
        -0.012893014587461948,
        -0.009291996248066425,
        0.02002820186316967,
        -0.08485320955514908,
        0.02437194623053074,
        -0.06149893254041672,
        0.009457338601350784,
        0.0009614431182853878,
        -0.007644175086170435,
        0.11389566212892532,
        -0.046507611870765686,
        -0.03815070539712906,
        0.02044658362865448,
        -0.011620922014117241,
        -0.009476904757320881,
        -0.09951083362102509,
        0.014827601611614227,
        -0.02278835140168667,
        -0.0015124514466151595,
        0.1488945484161377,
        0.005228858906775713,
        0.006289001554250717,
        -0.004847776144742966,
        -0.03605367988348007,
        0.05848512053489685,
        -0.013651053421199322,
        -0.04779068008065224,
        -0.02451438084244728,
        -0.018311262130737305,
        0.07648357003927231,
        0.0150923952460289,
        -0.08212064206600189,
        0.03281276673078537,
        0.10682737082242966
    ]
}