{
    "id": "BuaKzm7Kq9Q",
    "title": "Blue Bubbles vs Green Bubbles: Explained!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-01-24T22:32:41Z",
    "video_url": "https://www.youtube.com/watch?v=BuaKzm7Kq9Q",
    "category": "Science & Technology",
    "tags": [
        "blue bubbles",
        "green bubbles",
        "iMessage",
        "iMessage vs",
        "blue vs green bubbles",
        "MKBHD",
        "explained",
        "RCS",
        "RCS explained",
        "RCS iMessage",
        "iMessage vs RCS",
        "RCS vs iMessage"
    ],
    "views": 6074749,
    "likes": 243056,
    "comments_count": 23786,
    "description": "Why people can't stop using the iPhone. And what should be done about it.  Links/sources:  The Ecosystem: Explained   Horror stories with blue vs green bubbles:   Explaining Google's involvement with RCS:   Most popular messaging apps:   Apple's emails about iMessage lock-in:   Apple violating their own guidelines with green bubbles:   MKBHD Merch:   Tech I'm using right now:   Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "https://youtu.be/KB4_WIPE7vo",
        "https://www.wsj.com/articles/why-apples-imessage-is-winning-teens-dread-the-green-text-bubble-11641618009",
        "https://www.androidpolice.com/googles-rcs-drama-with-apple-explained/?utm_source=pocket_mylist",
        "https://www.statista.com/statistics/258749/most-popular-global-mobile-messenger-apps/",
        "https://www.theverge.com/2021/4/9/22375128/apple-imessage-android-ecosystem-lock-in-epic-games-filings-app-store-dispute",
        "https://medium.com/@_sdc/how-apple-taught-its-users-to-hate-android-through-subtle-design-cues-518cd7eda80",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat piano music) - All right, let's just talk about it. Blue bubbles versus green bubbles. Now, right off the top, most of this is gonna sound pretty ridiculous to the 70% of you that are watching this outside of the US. Mostly because it seems like every other country sort of just points and laughs at the blue bubble versus green bubble situation in the United States. Because pretty much everywhere else, the iPhone isn't nearly as dominant. But we will talk about what some other countries are doing in a second, we'll get to that. But for now, here it's a big deal and you'll see why. (upbeat music) So, let's go back in time. Originally, if you wanted to send someone a text message, how did you do it? Well, back in the day, as early as 1992, you just get their phone number and you send them an SMS. Pretty simple. SMS stands for short messaging service. It's attached to your phone number, it's 160 bytes max per message. Every phone has an SMS app. Easy, send your text. Now of course, that was super simple. And if you're old enough like me, you remember, if you had a long enough message, you had to spread it out over two texts 'cause you hit the character limit. Eventually we wanted to do a little bit more with our messages, maybe some emojis, some pictures, something like that once in a while. And so we added MMS. So MMS stands for multimedia messaging service. It's built on the same technology as SMS. You can send anything over 160 bytes and this came around in about 2002. So a single MMS message could be up to a couple of hundred kilobytes or so. And so these two combined basically blew up with the adoption of the smartphone. So now we've got phones everywhere. People sending text messages, emojis, pictures, everything back and forth. And they sort of ramped up in popularity from there. And every phone has a default messaging app, including the most notorious of them all, the iPhone, which has one with this icon. That's the Messages app. So now Messages works fine with iPhones and everybody's texting just like normal. But eventually we got up again to the limit of what we were able to do with SMS and MMS. Our communications get even more rich, we want to send larger image files back and forth. It's advanced, we're getting better at this whole texting thing, right? So Apple announces iMessage in 2011, which is an instant messaging service that's built right into the Messages app. Now iMessage works over the internet and has a ton of advantages over SMS and MMS. There's now typing indicators, you can send quick reactions to messages, files have this new massive 100 megabyte file size limit. So you can send crispy high resolution pictures or PDFs or videos even. There's read receipts, inline replies, location sharing. There's just a ton of features and most importantly, it's now end-to-end encrypted, which makes it much more secure than SMS ever was. And then since it works over the internet, it syncs up with all of your internet connected Apple devices, the phone, but also the Mac and the Apple Watch and your iPad, whatever else you got but in classic Apple fashion, it is not multi-platform. So there is no iMessage for Windows, there is no iMessage for Android. (upbeat music) Now the key here to the blue bubble versus green bubble war is that most people in the US just use the default messaging app that comes with their device. I know here on the MKBHD channel, we're all tech savvy and we know about the other messaging apps that we prefer that have more features and things like that. But most people just use the default app for everything on their device actually. The default browser, the default email app and the default messaging app. So when an iPhone user goes to message someone, first thing they do is open up the Messages app and if the person that they're messaging is also on an iPhone, immediately, boom, it gets converted into an iMessage. So you get the read receipts, the reactions, the encryption, all the features, blue bubbles. Now when an iPhone user goes to message someone that doesn't have iMessage, well it's still needs to get to them somehow and so the iPhone defaults back to sending it via SMS. The old super limited standard. So no read receipts, no typing indicators, no reactions, and definitely no encryption. And you for sure know when the person you're texting doesn't have iMessage because you get those nice green bubbles. And it's actually a little bit worse than just not having the features because now if the iPhone user tries to like the text, it still has to get that information to the Android user somehow and so it defaults by sending that via SMS too, it just sends a text to the Android phone saying, \"Marques liked your text,\" which is just kind of brutal. And worse yet, if you try to send a video, it still has to get that information to you somehow so it defaults to MMS, which is super compressed into oblivion because of that max file size. Have you ever seen a video that gets sent between an Android phone and an iPhone? Like a totally normal looking smooth 1080p video shows up as like a dumpster fire about a hundred pixels wide when texting between iPhone and Android, it's kind of unbelievable in this high-tech world we live in that this is still so bad and the list just keeps going and going. If you're in a group chat too, you can forget about it. I don't know if you've ever seen a group chat on an iPhone in the Messages app that mixes iPhones and SMS, it's bad. If three people react to one message, it creates three new text messages. You can't add people to that group. There's no inline replies in those group chats. It's genuinely bad. Basically the green bubble experience on an iPhone is trash and Apple, well, Apple is actually fine with this. (upbeat music) Because like I said, this is all driven by people using the default messaging app that comes on their phone. And the spice that just gets sprinkled on top of all of this is that the iPhone is incredibly popular in this country. I think we already knew that the iPhone is pretty popular, but I don't know if you realize how popular the iPhone is here. If you had to guess what percentage of 18 to 24 year-olds would you say use an iPhone in the US to make it dominant? Like 20%, 30% maybe, maybe over half, over 50? Yeah, try 70% of 18 to 24 year-olds in the US. Seven out of every 10 young adults and college students here are carrying an iPhone. So Apple's a $3 trillion company for a reason. They're really good at compelling people to use their products and once you start, they're good at building the walls up around you as high as possible so you never really want to leave. I made an entire video about the Apple ecosystem, what it is, why it works. I'll link that explain video below. But the bottom line is it's more than just neat hardware products that can act as walls in the walled garden around that ecosystem. So we already knew about the Apple watch only working with the iPhone. You already knew about AirPods being great with the iPhone and AirTags, but turns out software can be those walls too. And iMessage is a really big wall. So switching to an Android phone would mean not just losing the iMessage features and becoming a green bubble, but also Apple's created such a social network of iPhone users using iPhone only features to communicate with each other, that Android users actually feel genuinely ostracized and left out. Nobody wants that. So think about it. If 70% of young people around you own an iPhone and iMessage is the default and it's good for groups and social dynamics. Yeah, most new people are just gonna use that too. And if most people use it, it makes the people who don't have iPhones feel left out. Their default is definitely a worse texting experience and being left out of group chats. And so it just puts even more real pressure on those people to just get with it, just get it over with, get an iPhone. And then the cycle continues. It's a self-fulfilling prophecy. So no matter what you think of those pressures or how crazy you think that sounds, that is real and that is often what's being referred to when we say iMessage lock-in. iMessage is genuinely one of the biggest walls in Apple's walled garden that they've created. And it's a particularly hot topic, even right now as I'm recording this. But also I feel like every year there's some expose about how we're all learning about people getting bullied for not having iPhones or those stories about how people on Tinder get statistically less dates after exchanging phone numbers when it's revealed that they're a green bubble, it's crazy. But this is a conversation that's been going on since iMessage came out and it's been getting louder and louder as more and more people get iPhones. (upbeat music) So what's the solution to this. Well, if you're new here you might say, \"Oh, well just bring iMessage to Android. That way everybody has everything.\" And yeah, that's never gonna happen. I mean it's a good idea, I like the way you're thinking but never gonna happen. I'd give that the same odds as the New York Knicks winning the 2022 NBA championship. Technically possible, but I wouldn't get your hopes up. Now, fun fact, there was actually a movement within Apple back in 2013 where apparently it came up in a few meetings. Legal documents around the Apple versus Epic court case had Eddie Cue testify that Apple could have made a version of iMessage on Android, but apparently Craig Federighi and Phil Schiller jumped in noting that it would, \"Simply serve to remove an obstacle to iPhone families, giving their kids Android phones and moving iMessage to Android will hurt us more than help us.\" So basically it's crystal clear that Apple higher-ups recognize the value of iMessage lock-in. So that's not going anywhere. There's no plans to bring iMessage to Android. So the natural next thought is, \"Okay, what if there was a single multi-platform messaging app that everyone could use?\" So if it can't be iMessage, someone else can make one. And then everyone can use that. I mean, this is probably already what you're seeing down in the comments section from thousands of people who didn't make it this far in the video saying, \"Hey, well just use WhatsApp or Telegram.\" And so to all those comments, yeah, it would be great if everyone could just have one multi-platform app that everyone uses and we could all get along and have Windows and Apple devices and Android devices all having read receipts and reactions and typing and all that stuff. Yeah, that would be pretty cool, right? But there's two main problems in the way of that. One is that people are still, like I mentioned earlier, overwhelmingly predisposed to using the default messaging app that comes with their device. So having everyone decide to use WhatsApp for example, involves a bunch of extra steps for all the devices where that's not the default, including the iPhone. And then you have to go out and get your entire social circle to also make that switch, to use that new default app. You know how hard it is to convince everyone you talk to to switch defaults? And actually in some countries, WhatsApp basically is a default at this point. But imagine trying to get everyone in the US to also switch their default to something different. It's just, have you ever tried to get your parents to switch default apps on something? It's impossible? And then two, even if you did convince the whole world successfully to use this one golden, multi-platform messaging app, is it really a good idea to have the entire planet's messaging in the hands of one company? And should that one company be Meta of all companies? Is that really a good idea? WhatsApp right now is the most popular multi-platform messaging app on the planet. There are 2 billion monthly active users on WhatsApp. It's super popular in India, lots of businesses there use it too. Now I don't know if you remember, but when Facebook or Meta went down for a couple hours in October of last year, all of their services basically went dark and people, communities, businesses that depended on WhatsApp all had to shut down for hours because they couldn't communicate or do business or anything at all. Matter of fact, there was a headline that Telegram in those six hours gained 70 million users because of how many people needed to communicate but couldn't when WhatsApp was down. Now the next most popular app is Facebook Messenger, also by Meta, that's 1.3 billion people, but then underneath that, WeChat and then QQ both extremely popular in China. Another option is Telegram, but you see where we're going here? There is no universal one golden ticket, and they're all of course owned by some company. An optimist might think, well maybe Google is in the best position to make the perfect all-in-one multi-platform messaging app because they make Android. But a realist would have probably noticed that they've tried this many, many, many, many times by now. All of them unsuccessful. This could probably be a whole topic for a whole nother video. But yeah, bottom line is even if you are cool with one company handling everything, it's basically impossible to get everyone from every place using one single app. I mean, I would love my entire community of people around me, teammates, friends, family, to all use Discord, but that's probably not gonna happen. It's both an upside and downside that there's a fragmentation of messaging services. It's a downside, 'cause we're not all universal using the same thing, but it's a good thing because there is still competition. But hey, there's also one more option. Three letters, RCS. (upbeat music) Okay, so we already broke down how we saw messaging get started with texts and SMS and then MMS. It turns out there's a new messaging standard that was first implemented in 2018 called RCS. Rich Communication Service. So RCS was a pretty obvious next step for smartphone manufacturers to support over the next couple of years and it's another evolution of messaging features and it supports a ton of that stuff. Read receipts, typing indicators, reactions to messages, much larger file support. Google added RCS support into the default Google Messages app, which it's trying to make basically the default messaging app on every Android phone coming out. And at this point it's pretty hard to get a new phone out the box that doesn't ship with RCS support in 2022. They've all got it. Well, all of them except the iPhone. So in this war of blue bubble iMessage perfection versus green bubble SMS madness. It seems like the best possible solution that we've got, the one that makes the most sense is for Apple to build RCS support into iMessage. It just makes a lot of sense, right? But the way that standards work is kind of funny. So as we said earlier, they shouldn't really ever be controlled by one company. So RCS itself is a set of standards developed by GSMA. It can work in a decentralized manner, which means there are actually several different RCS implementations. So theoretically, any company with the right hardware and enough servers could spin up their own version if they want to. Some carriers have spun up their own implementations in the past, but really the most important one, the one to pay the most attention to is the universal profile, which has all the same, all the big core features, but also works with as many different versions as possible. So Google comes along and they build what's called Google Chat which is their own implementation of RCS using the universal profile. So it's got all the same core features and everything, bigger file sizes, reactions, read receipts and all that. But now it's running on Google's own Jibe servers and it's not actually built directly into the core of Android for some reason, but it is supported directly by Google's Messages app, which like we see, they're trying to make that the default messaging app on Google Android phones. So the version of RCS, the flavor of RCS that most people will experience, it turns out is actually Google's version. And so from Apple's perspective, basically, it's like, \"All right, we made iMessage, right? So iMessage is a service we made that runs on our servers on the app that we made on the phones that we made. And RCS is a service that Google worked on that runs on Google servers that works in a Google app on Android phones.\" So it's kind of their own... It's another Google messaging app, really, although the most successful one yet. So we're not really sure what Google, which is an advertising company is going to do with RCS as they continue to develop it. If they have plans to monetize it at all, we don't know that. So to Apple, it's like, \"Well hey, if it's just another Google messaging service, we already built the better mouse trap, iMessage.\" (upbeat music) So here's my take and it's a pretty simple one really, even though there's gonna be this pressure of blue bubbles versus green bubbles, that's not anything we can control, but Apple should add RCS support to iMessage. There's just no downside at all right now. Now currently, the way Apple moves so slow to adopt new things until they're absolutely, positively sure about it. There's almost no chance that they actually do this, but they totally should. And look, it's not a perfect solution at all 'cause there is none. RCS doesn't cover every single little feature of iMessage, it doesn't have Animoji, there's no support for the apps and games that they've built into iMessage and Apple Pay payments. And there's only end-to-end encryption right now on one-to-one chats, not for group messages. But it is a ton of the most basic, most important ones. The read receipts, the larger file sizes, the reactions, the quick, oh group messages would be dramatically better. You could actually leave a group chat or add new people to it if it just had RCS support, everyone could have all these things working. And most importantly of all, especially for Apple, it supports end-to-end encryption for direct messages and for a company that swears up and down that they care about your privacy and your security, you think it would be the easiest decision in the world to stop sending iPhone users messages over an old unsafe unencrypted SMS standard and just support the one that's new that is more secure. But given what we know about these companies, every day that Apple doesn't add RCS support to iMessage, they're sending a subtle hint, a subtle message that they value that lock-in just a little bit more. So look, the colors of the bubbles at this point have become a bit of a meme, it's a little overly played out. Yes, there are people that take it super seriously and there's no doubt in my mind that Apple does think about the aesthetics of the colors to dissuade people from green a little bit. Fun fact, the contrast ratio of the green with the white text actually breaks some of Apple's own rules about what you can do in apps. I'll leave a link below so you can read about that. But for those wondering the actual original story about why it's blue versus green, and it was hard to find a source on this, but I'll try my best is that a green was supposed to represent a paid message when blue was not. If it was an SMS, you're paying the carrier for it and necessarily giving money while a blue was just possibly over the internet or wifi, so free. Green paid, blue free. But that's almost like a backstory at this point. Apple's a very smart company with lots of very smart people who are in charge of making sure they stay in as much control and as much power as they possibly can and they know that the difference between the blue bubble experience and the green bubble experience is so strong that it's enough to send real pressure for people to switch to the iPhone who aren't on it and for people to stay on the iPhone who are. And that's good enough for them. Thanks for watching. Catch you guys in the next one. Peace (upbeat music)",
    "transcript_keywords": [
        "Apple",
        "default messaging app",
        "messaging app",
        "iPhone",
        "Android",
        "app",
        "Google Messages app",
        "iMessage",
        "People",
        "RCS",
        "Messages app",
        "SMS",
        "messaging",
        "messages",
        "Google",
        "default",
        "RCS support",
        "default messaging",
        "Android phone",
        "Google Android phones"
    ],
    "transcript_entity_values": [
        "Google Android",
        "Apple",
        "30%",
        "Craig Federighi",
        "WhatsApp",
        "Phil Schiller",
        "iMessage",
        "One",
        "the day",
        "iPhones",
        "1.3 billion",
        "Green",
        "Eddie Cue",
        "SMS",
        "Facebook Messenger",
        "over half",
        "first",
        "the next couple of years",
        "iPhone",
        "2013",
        "Animoji",
        "MKBHD",
        "US",
        "RCS",
        "2 billion",
        "iPhones",
        "20%",
        "70 million",
        "a couple of hundred kilobytes",
        "WeChat",
        "China",
        "one",
        "India",
        "Three",
        "2022",
        "10",
        "Knicks",
        "two",
        "the Apple Watch",
        "New York",
        "70%",
        "Meta",
        "three",
        "thousands",
        "iPad",
        "Telegram",
        "a couple hours",
        "monthly",
        "October of last year",
        "Mac",
        "MMS",
        "Facebook",
        "those six hours",
        "Android",
        "Discord",
        "iMessage on Android",
        "$3 trillion",
        "AirTags",
        "2018",
        "NBA",
        "Windows",
        "second",
        "the 70%",
        "about a hundred",
        "Rich Communication Service",
        "Google Chat",
        "GSMA",
        "160",
        "hours",
        "about 2002",
        "Google",
        "100 megabyte",
        "2011",
        "as early as 1992",
        "iMessage to Android",
        "max",
        "every day",
        "Seven",
        "the United States",
        "a ton",
        "18 to 24 year-olds"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "NORP",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "DATE"
    ],
    "vector": [
        0.012376907281577587,
        -0.06106629595160484,
        0.14238324761390686,
        -0.05046616122126579,
        0.10107827931642532,
        0.016994187608361244,
        0.08382810652256012,
        -0.04687501862645149,
        0.050383880734443665,
        -0.053603123873472214,
        -0.024307318031787872,
        0.006889320444315672,
        -0.02729504182934761,
        0.0019820884335786104,
        0.036521170288324356,
        0.082989402115345,
        0.0734473317861557,
        -0.16309134662151337,
        -0.13300098478794098,
        -0.026184728369116783,
        -0.0308037418872118,
        -0.044651713222265244,
        0.02400847151875496,
        0.04354666545987129,
        -0.03040257655084133,
        0.041256897151470184,
        0.001764104119502008,
        0.006804733071476221,
        -0.0455477237701416,
        -0.012113207019865513,
        -0.004808412399142981,
        0.010668376460671425,
        0.09318692982196808,
        -0.0023320941254496574,
        -0.0336967296898365,
        -0.12136293202638626,
        -0.01896096207201481,
        -0.0020799445919692516,
        -0.02805068902671337,
        -0.01677478663623333,
        -0.040790118277072906,
        -0.026657650247216225,
        0.017553847283124924,
        0.04111728072166443,
        0.007865210063755512,
        -0.007716011255979538,
        0.04182786867022514,
        0.007586024701595306,
        -0.03573086857795715,
        -0.01944848708808422,
        0.009085206314921379,
        -0.0027828116435557604,
        -0.04842574894428253,
        0.04539315775036812,
        0.022456282749772072,
        0.03031941130757332,
        -0.01858285441994667,
        0.05910075083374977,
        0.11472461372613907,
        0.0684492439031601,
        0.020011376589536667,
        -0.027445463463664055,
        0.014604904688894749,
        0.05494288355112076,
        0.03562381863594055,
        -0.02365437150001526,
        -0.012587334029376507,
        0.08165425807237625,
        0.005237233359366655,
        -0.005758226849138737,
        0.004365602973848581,
        0.026495877653360367,
        0.07607129216194153,
        0.07360557466745377,
        0.04563864693045616,
        0.03565945848822594,
        0.04078031703829765,
        0.028259780257940292,
        -0.10655324906110764,
        0.008717500604689121,
        0.11140468716621399,
        -0.06947015225887299,
        0.011787968687713146,
        -0.0837639644742012,
        -0.00020208352361805737,
        -0.04143226519227028,
        -0.0016770351212471724,
        0.00151068193372339,
        -0.05392971634864807,
        -0.029781628400087357,
        -0.05540598928928375,
        0.03379794582724571,
        0.0014635884435847402,
        0.07104398310184479,
        0.09038662165403366,
        0.023373842239379883,
        -0.005704914219677448,
        -0.03492182120680809,
        -0.021508101373910904,
        0.01626615785062313,
        0.05513763055205345,
        0.0034560873173177242,
        0.012128977105021477,
        -0.08709625899791718,
        0.03007718361914158,
        -0.08016861230134964,
        -0.03531081974506378,
        0.10317222774028778,
        0.050967391580343246,
        0.02240237034857273,
        -0.02037874050438404,
        -0.02857622317969799,
        -0.014409965835511684,
        0.016324445605278015,
        0.009975726716220379,
        -0.0006419418496079743,
        0.024106644093990326,
        0.06235508248209953,
        0.07432936877012253,
        -0.0007347532664425671,
        0.02581874467432499,
        -0.05360596254467964,
        -0.0643293559551239,
        -0.03855663165450096,
        0.010337765328586102,
        -0.00790091697126627,
        -0.13885551691055298,
        5.424398395080111e-33,
        0.023780057206749916,
        0.06109383702278137,
        0.028009794652462006,
        0.013044437393546104,
        0.03495026379823685,
        -0.027389366179704666,
        -0.07017836719751358,
        -0.004929692950099707,
        0.03099043294787407,
        0.04010120406746864,
        0.05217784270644188,
        0.014577284455299377,
        -0.03544372692704201,
        -0.016956064850091934,
        0.03589170053601265,
        -0.09611757099628448,
        -0.10778429359197617,
        -0.002387572778388858,
        -0.06722065806388855,
        0.022801030427217484,
        -0.0132865896448493,
        -0.030614593997597694,
        -0.030675701797008514,
        0.012093717232346535,
        -0.003662026720121503,
        0.00917749758809805,
        0.06730249524116516,
        -0.009221430867910385,
        0.09544098377227783,
        -0.006750486325472593,
        -0.03974480926990509,
        0.00595591077581048,
        -0.004853864200413227,
        -0.02408633753657341,
        -0.029127173125743866,
        -0.021397342905402184,
        -0.01339472085237503,
        -0.04752471670508385,
        -0.002340105827897787,
        0.008385645225644112,
        -0.15713943541049957,
        0.014214633964002132,
        -0.13669613003730774,
        0.03008820302784443,
        0.06952663511037827,
        0.027248723432421684,
        0.001954887295141816,
        -0.0005930265178903937,
        -0.019387807697057724,
        -0.024837130680680275,
        -0.04053720459342003,
        0.029212642461061478,
        0.014703107066452503,
        0.028057698160409927,
        0.027408864349126816,
        0.047353219240903854,
        0.06325528770685196,
        -0.10196640342473984,
        -0.017284363508224487,
        0.0013678459217771888,
        -0.004797458183020353,
        0.033866554498672485,
        -0.03136487677693367,
        -0.033489275723695755,
        -0.05132495239377022,
        0.0643792599439621,
        -0.035570479929447174,
        -0.008823215961456299,
        -0.06392091512680054,
        0.00011058716336265206,
        -0.007004069164395332,
        0.04518108814954758,
        -0.03919767960906029,
        -0.0325128547847271,
        -0.0416439026594162,
        -0.026574796065688133,
        0.03063565492630005,
        0.005327355116605759,
        0.03822506219148636,
        -0.05005953088402748,
        -0.044891487807035446,
        -0.06498312950134277,
        0.023737097159028053,
        -0.006135918665677309,
        -0.0610838308930397,
        0.007832840085029602,
        0.02263818122446537,
        -0.04265518859028816,
        -0.004368269350379705,
        0.06968046724796295,
        -0.11467067897319794,
        0.016652943566441536,
        0.033579953014850616,
        0.0279691182076931,
        -0.05572596937417984,
        -5.5755004796966386e-33,
        -0.056275561451911926,
        -0.03441933915019035,
        -0.07355104386806488,
        0.003894336288794875,
        0.06897135823965073,
        -0.014309837482869625,
        0.05589373782277107,
        0.05818786472082138,
        0.022577300667762756,
        -0.057456232607364655,
        -0.015044710598886013,
        0.0305671077221632,
        -0.02151341363787651,
        0.13456951081752777,
        -0.05237159505486488,
        -0.028900323435664177,
        0.05836930871009827,
        -0.03984527662396431,
        -0.039776962250471115,
        0.08775687217712402,
        -0.02963382378220558,
        0.002741501433774829,
        -0.005159891210496426,
        0.030714377760887146,
        -0.02626882493495941,
        0.07502571493387222,
        -0.039108023047447205,
        0.007206896785646677,
        0.07406576722860336,
        -0.020983627066016197,
        -0.03545862436294556,
        0.01988161914050579,
        0.02431132085621357,
        -0.03558316454291344,
        0.038241926580667496,
        0.0756334587931633,
        0.031152553856372833,
        -0.10566062480211258,
        -0.04365348070859909,
        -0.001603666227310896,
        0.014190549030900002,
        0.04628094285726547,
        -0.02679162658751011,
        -0.061744969338178635,
        -0.09386390447616577,
        0.07388576865196228,
        -0.03876353055238724,
        0.08508545905351639,
        -0.09586955606937408,
        0.011683330871164799,
        0.0758073702454567,
        -0.00788931269198656,
        -0.023911310359835625,
        0.010421177372336388,
        -0.04770310968160629,
        0.0030921222642064095,
        0.011263066902756691,
        -0.0037502427585422993,
        -0.009087893180549145,
        0.011606781743466854,
        0.013236208818852901,
        0.004465922247618437,
        -0.047383151948451996,
        -0.11618546396493912,
        -0.014012504369020462,
        -0.04930876940488815,
        0.05190903693437576,
        0.012212458066642284,
        0.06952779740095139,
        -0.008691118098795414,
        0.032138846814632416,
        -0.07258006185293198,
        -0.08795522153377533,
        -0.03363273665308952,
        0.038742586970329285,
        0.045789435505867004,
        0.011869354173541069,
        -0.04902232438325882,
        -0.10621767491102219,
        -0.004962907638400793,
        0.013530937023460865,
        0.1655113399028778,
        0.0633898675441742,
        -0.024644026532769203,
        0.005906990263611078,
        0.05527738854289055,
        0.02496967278420925,
        -0.05153227970004082,
        -0.05637276917695999,
        0.02691878192126751,
        -0.01640397310256958,
        0.018675481900572777,
        -0.0797022208571434,
        0.08304309099912643,
        -0.01784081943333149,
        -5.3331454807903356e-08,
        -0.003123257542029023,
        -0.08537481725215912,
        0.01959265023469925,
        0.021019194275140762,
        0.022384582087397575,
        -0.006024450995028019,
        0.04762827977538109,
        -0.007825599983334541,
        0.06531807780265808,
        -0.024164028465747833,
        -0.05340268835425377,
        -0.0402647890150547,
        -0.05837525054812431,
        0.04078452289104462,
        0.0013134118635207415,
        0.05582520365715027,
        -0.0805995911359787,
        -0.03605230152606964,
        -0.01632780395448208,
        0.04731560871005058,
        -0.03677578270435333,
        0.050304289907217026,
        -0.046061526983976364,
        0.015202317386865616,
        0.033631861209869385,
        0.06733948737382889,
        0.015484609641134739,
        0.013074248097836971,
        0.04206141456961632,
        0.019837189465761185,
        -0.04636289179325104,
        -0.02104993350803852,
        -0.027605660259723663,
        -0.010125086642801762,
        -0.05465002730488777,
        -0.054246582090854645,
        -0.008218629285693169,
        -0.027064260095357895,
        0.020504167303442955,
        0.02609286643564701,
        -0.005915991961956024,
        -0.035040125250816345,
        0.03311693295836449,
        0.019019262865185738,
        -0.030089683830738068,
        -0.1609698385000229,
        -0.03927262872457504,
        0.01554798148572445,
        -0.009099157527089119,
        0.12097414582967758,
        -0.10066979378461838,
        -0.09086118638515472,
        0.002595025347545743,
        0.025895744562149048,
        0.15108847618103027,
        -0.03057449497282505,
        -0.025210123509168625,
        0.07669748365879059,
        -0.026780683547258377,
        0.08368316292762756,
        0.06656362116336823,
        -0.004480394069105387,
        0.03309726342558861,
        0.07550930976867676
    ]
}