{
    "id": "bUGoF3nb3Wk",
    "title": "Mate 20 Pro Durability Test! - The Back is Different...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-11-23T12:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=bUGoF3nb3Wk",
    "category": "Howto & Style",
    "tags": [
        "Mate 20 Pro",
        "Huawei Mate 20 Pro",
        "mate 20",
        "huawei mate 20 pro",
        "mate 20 pro",
        "mate 20 pro unboxing",
        "best smartphone",
        "durability test",
        "Mate 20 Pro review",
        "Mate 20 Pro Specs",
        "How durable is mate 20 pro",
        "Android",
        "Smartphone",
        "Mobile phone",
        "VPN",
        "VPN Best",
        "vpn for android",
        "vpn for pc",
        "vpn for iphone"
    ],
    "views": 2629048,
    "likes": 57074,
    "comments_count": 7416,
    "description": "The Huawei Mate 20 Pro Is here to be tested! Go to  and use code JERRYRIG to to get 75% off a 3 year plan.  Protect yourself online today! The Huawei Mate 20 Pro is one of the most popular flagship smartphones on the market right now. With its 3 powerful cameras on the back its bound to turn some heads. But is it durable? How durable is the new Huawei Mate 20 Pro? The only way to find out is with the systematic durability tests of JerryRigEverything. We will start by scratching the surface of the Mate 20 Pro. Along with the sides to analyze their composition. Is the back glass different than a normal cell phone? Indeed it is. Textured, yet scratch resistant... and musical. Super interesting.   Does the Mate 20 Pro belong on the Shelf of Shame?  *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   Customize your Tesla Here:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://NordVPN.com/jerryrig",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://ts.la/zack10701",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Mate 20 Pro. This is that smartphone from Huawei with the iconic matrix triple camera setup in the back. This is the Emerald Green color...and oh boy, does this back panel have a surprise in store for us. It's time to see if Huawei's new psychedelic blue green colored, ultimate camera phone can survive a durability test. Huge thanks to NordVPN for sponsoring this video. Watch to the end to get a 75% discount, plus a free month. Let's get started. [Intro] I like phones with features, and one of the unique features of this phone is that it can wirelessly charge other phones. I just jump into the settings and enable reverse wireless charging. And it'll use it's massive 4200 milliamp hour internal battery as a power bank to charge other devices wirelessly. It even works through my Bulletproof Banana. And while that's cool and everything, the coolest part of this phone is the triple camera set up on the back. We'll check on that in a second. Let's start with the scratch test. Huawei has taken a page out of Samsung's book this time around, wrapping the glass slightly around the edges of the phone. From a durability standpoint, I think it's kind of dumb because it's just more glass surface area that the frame can't protect during a drop, but it looks cool, so here we are. Like most displays, this tempered glass covered Mate 20 Pro is scratching at a level 6, with deeper grooves at a level 7. There is a notch up top which contains a small speaker grille. This is very solidly tucked in place, along with the face ID sensors and a 24 megapixel HDR selfie camera all hidden under the same glass as the screen inside the notch, and are protected against normal scratches. The anodized metal sides of the Mate 20 Pro have a more bluish tint to them and are metal, along with the metal volume button, and red anodized metal power button. Down at the bottom we have one tiny loudspeaker hole, our USB-C port, and a dual sided SIM card tray. One side for the SIM card and the other for Huawei's new proprietary nano memory card, which is 45% smaller than your standard SD card slot. It's not super useful though to buy a memory card that can only be used in one place, so we'll see what happens with that. Up at the top of the Mate 20 Pro is an IR blaster one of the very few phones to include it this year. An IR blaster allows you to change the channels on your TV. With one of those you don't have to care where the remote actually is hidden. Now for the back. The triple set up is covered with glass. Huawei has gone above and beyond the normal dual camera setup this time, providing us with a 40 megapixel normal camera, a 20 megapixel wide-angle GoPro style camera, and a third 8 megapixel telephoto zoom camera. I'm a huge fan of all the options. Huawei's also done something new with the back glass panel this time around it's textured. This hyper optical pattern is supposedly non-slip and anti-fingerprint. And it's scratch proof. This is pretty cool. Definitely probably going to be a thing on more phones in the future. Alright, I'm done. Absolutely zero marks were left on the back glass panel. Huawei's textured glass holds up much better than the frosted Pixel 3. Now I'm done. The Mate 20 Pro has a very bright 6.4 inch, 1440p AMOLED display, meaning that as the screen heats up, the pixels physically burn and never recover. It's almost like taking a lighter to your phone is a bad idea. The screen did last for an impressive 25 seconds though, but then never recovered like an LCD would. The mark is still visible even with the display turned off. And now for the bend test. It's time to see if that textured back glass panel helps or hinders the overall structure. On the very first bend, we get a very loud popping noise, which is the front glass shattering across the entire display. This is rather unusual for my bend test because most phones survive. Keep in mind, the Mate 10 Pro from last year passed this test just fine. I believe the Mate 20 Pro glass cracked for a few reasons. One, because I bent it...but physically stressing hardware is kind of the point of my channel. The second reason it cracked is because of the level 7 scratches I left on the surface of the glass. Now you're probably like, 'But Jerry, you scratch every phone with the same picks and most of them don't obliterate.' And you're right. The Mate 10 Pro from last year had a flat screen. This time around, Huawei curved the glass of their screen around the corners right up against the metal and might not have their tolerance quite right yet. Meaning that the metal frame might be more snug on the glass than, say, a Samsung phone, which has the same style of curve, but still survives my tests. Either way, the Mate 20 Pro is still alive. The frame itself is incredibly solid, only the glass is shattered. Unfortunately for me though, the cracks are right over top of the in-screen fingerprint scanner. I'll check to see if that functions really quick. It looks like the phone can still read my fingerprint, even though it's complaining about the sensor being dirty. The sensor allowed my fingerprint to be set, but then never actually lets my finger unlock the phone. So it's safe to say that my fingerprint sensor does not work with a cracked screen. There are multiple levels of security that can be utilized if the fingerprint scanner stops working. I usually reserve my Shelf of Shame for the completely destroyed devices. My question is, should we start including phones that partially fail? What do you think? Does the Mate 20 Pro deserve the Shelf of Shame? Let me know down in the comments. Speaking of security, another layer of security for your phone or PC could be NordVPN. A VPN or a Virtual Private Network is something you can use to securely and privately browse the Internet. Just download the app and it connects to one of over 5,000 different servers, located in 62 different countries instantly. It makes your personal information untrackable when using pubic Wi-Fi. And one subscription of NordVPN can secure 6 devices simultaneously. Get a free month and 75% a 3-year plan with the link in the description, or go to NordVPN.com/jerryrig. That 75% 'jerryrig' discount code brings the price down to just $2.99 per month, which could be a great gift idea. Huge thanks to NordVPN for sponsoring this video. This durability testing thing is quite an expensive hobby, especially lately. The Mate 20 Pro is still a good phone. It just seems that this time around the curved glass does make it a bit weaker than it's predecessor. Either way, hit that subscribe button if you haven't already. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "Mate",
        "Pro",
        "glass",
        "phone",
        "Huawei",
        "back glass panel",
        "camera",
        "back glass",
        "phones",
        "Pro glass cracked",
        "back",
        "glass covered Mate",
        "time",
        "Pro glass",
        "glass panel",
        "screen",
        "metal",
        "Emerald Green color",
        "Huawei textured glass",
        "test"
    ],
    "transcript_entity_values": [
        "over 5,000",
        "8 megapixel",
        "6.4 inch",
        "Emerald Green",
        "6",
        "SD",
        "IR",
        "20",
        "Wi-Fi",
        "Virtual Private Network",
        "Jerry",
        "6",
        "75%",
        "VPN",
        "Huawei",
        "SIM",
        "Pixel 3",
        "10",
        "this year",
        "4200 milliamp hour",
        "Shelf of Shame",
        "first",
        "second",
        "last year",
        "just $2.99",
        "GoPro",
        "a free month",
        "Samsung",
        "Bulletproof Banana",
        "LCD",
        "third",
        "62",
        "24",
        "45%",
        "One",
        "40 megapixel",
        "zero marks",
        "20 megapixel",
        "3-year",
        "one",
        "an impressive 25 seconds"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "LOC",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "MONEY",
        "PRODUCT",
        "DATE",
        "ORG",
        "FAC",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "TIME"
    ],
    "vector": [
        -0.08860599994659424,
        0.04101452976465225,
        0.08261142671108246,
        -0.05410917475819588,
        0.029819205403327942,
        -0.004434504080563784,
        0.03157851845026016,
        0.05582139641046524,
        -0.08371131122112274,
        0.017708398401737213,
        0.004806866403669119,
        0.06178322061896324,
        0.10727983713150024,
        0.04586504399776459,
        0.030107786878943443,
        -0.03935820609331131,
        0.034687526524066925,
        -0.1102973148226738,
        -0.009216307662427425,
        0.07483502477407455,
        0.009390891529619694,
        -0.04445714130997658,
        -0.022291142493486404,
        -0.046067409217357635,
        0.038483425974845886,
        0.011109212413430214,
        -0.010166824795305729,
        0.02998868189752102,
        -0.01687798462808132,
        -0.05065174028277397,
        0.023521779105067253,
        0.10363595187664032,
        -0.02875545620918274,
        0.03130653500556946,
        -0.0078138941898942,
        -0.03661133348941803,
        0.021744200959801674,
        -0.030006464570760727,
        -0.07746419310569763,
        -0.0212607029825449,
        -0.07515876740217209,
        -0.06223756819963455,
        -0.003811670234426856,
        0.003023468889296055,
        0.05082966387271881,
        -0.023418933153152466,
        0.11170033365488052,
        -0.04989880323410034,
        -0.015256003476679325,
        -0.05228113755583763,
        0.017864657565951347,
        -0.010761028155684471,
        0.0878608375787735,
        -0.04295403137803078,
        -0.02092912048101425,
        0.054503198713064194,
        0.023219995200634003,
        0.011614753864705563,
        0.02866232767701149,
        -0.00535647151991725,
        0.049561936408281326,
        0.026491545140743256,
        -0.04592878371477127,
        0.049149204045534134,
        -0.006712627597153187,
        0.013391450978815556,
        0.024494366720318794,
        -0.031094830483198166,
        0.027007080614566803,
        0.07623957842588425,
        -0.01620854251086712,
        0.021915141493082047,
        -0.014752404764294624,
        0.006055278237909079,
        -0.034792184829711914,
        0.05967724323272705,
        0.0319378525018692,
        -0.05982585623860359,
        -0.07411981374025345,
        -0.07618607580661774,
        0.009022176265716553,
        -0.050131916999816895,
        0.009034240618348122,
        -0.004123206250369549,
        0.0048781041987240314,
        -0.003100409870967269,
        0.028933648020029068,
        0.05481965094804764,
        -0.093821682035923,
        -0.07832075655460358,
        -0.0024777059443295,
        0.14096930623054504,
        -0.11718575656414032,
        0.029798518866300583,
        -0.006685507018119097,
        0.040827155113220215,
        -0.09538522362709045,
        -0.07355828583240509,
        -0.014041599817574024,
        0.017589228227734566,
        -0.014587131328880787,
        0.02727455645799637,
        0.06371529400348663,
        -0.012510000728070736,
        0.0345916785299778,
        -0.05992751941084862,
        -0.032701730728149414,
        -0.018300188705325127,
        -0.038074906915426254,
        0.025822019204497337,
        -0.025209497660398483,
        0.023340852931141853,
        -0.029845157638192177,
        0.09415210783481598,
        -0.0033520390279591084,
        -0.03690741956233978,
        -0.0756731927394867,
        0.04832324758172035,
        0.06854031980037689,
        0.0013597204815596342,
        0.04811982065439224,
        -0.0332014262676239,
        -0.031608715653419495,
        -0.03911925107240677,
        0.016364429146051407,
        -0.027908943593502045,
        8.672013791510835e-05,
        3.3545725137888725e-33,
        0.024738911539316177,
        0.11234121024608612,
        -0.02917209267616272,
        -0.026462722569704056,
        -0.03241686150431633,
        -0.006206146441400051,
        0.0741146057844162,
        0.06119458004832268,
        -0.05413785204291344,
        0.04488854110240936,
        -0.025722099468111992,
        0.024478662759065628,
        -0.07127200812101364,
        0.039094697684049606,
        0.0633934885263443,
        0.027672238647937775,
        -0.09704984724521637,
        -0.06363208591938019,
        -0.09089259803295135,
        -0.018268469721078873,
        -0.028982335701584816,
        0.02280033566057682,
        0.001689854427240789,
        0.041964635252952576,
        0.05553048849105835,
        0.012191985733807087,
        0.07972931116819382,
        0.007007538340985775,
        0.006772459018975496,
        0.012439999729394913,
        -0.10174250602722168,
        0.04772862419486046,
        -0.03229479864239693,
        0.05151345208287239,
        -0.0417548343539238,
        0.07855184376239777,
        -0.03943127393722534,
        -0.017499500885605812,
        -0.021221356466412544,
        -0.019970498979091644,
        -0.009895531460642815,
        0.022724715992808342,
        0.00775745278224349,
        -0.005171461030840874,
        0.0181172676384449,
        -0.025219252333045006,
        -0.057239729911088943,
        0.011154578998684883,
        -0.0548115111887455,
        0.010076369158923626,
        0.002184160053730011,
        0.02505831979215145,
        -0.04568649083375931,
        -0.01931299827992916,
        -0.12491776794195175,
        -0.0037246861029416323,
        0.034078199416399,
        -0.04873250797390938,
        0.04667104780673981,
        0.07186786830425262,
        0.08809119462966919,
        -0.0006437538540922105,
        -0.034420598298311234,
        0.048092976212501526,
        -0.052862346172332764,
        0.09861605614423752,
        0.00445094658061862,
        -0.008367856964468956,
        -0.010225305333733559,
        0.019127922132611275,
        0.014638685621321201,
        -0.0016022911295294762,
        -0.03327691927552223,
        -0.08424273878335953,
        0.0673523098230362,
        -0.020943572744727135,
        -0.030066655948758125,
        -0.06639235466718674,
        0.04308127611875534,
        -0.021551290526986122,
        -0.08710816502571106,
        0.08486494421958923,
        0.02066187560558319,
        -0.07613004744052887,
        -0.06502167135477066,
        -0.011847123503684998,
        0.06482624262571335,
        -0.11625461280345917,
        0.015933575108647346,
        0.06505045294761658,
        -0.01718502677977085,
        -0.12511064112186432,
        0.03730006143450737,
        -0.03342698514461517,
        -0.008927312679588795,
        -5.499754929807512e-33,
        -0.03506091237068176,
        -0.05027361214160919,
        0.10398140549659729,
        0.040694646537303925,
        0.03172730281949043,
        -0.07398558408021927,
        0.047983963042497635,
        0.15860378742218018,
        -0.026298031210899353,
        -0.0406138151884079,
        0.05749733746051788,
        0.026172880083322525,
        0.02730194851756096,
        0.011075226590037346,
        -0.030748408287763596,
        0.003022885648533702,
        -0.04620305448770523,
        -0.08394553512334824,
        -0.0070834835059940815,
        -0.029497217386960983,
        0.07313664257526398,
        0.06776099652051926,
        0.044425662606954575,
        0.0831245481967926,
        -0.0699666365981102,
        0.007539629936218262,
        0.0020401054061949253,
        -0.10862141102552414,
        0.007813683710992336,
        -0.020888131111860275,
        0.03342337906360626,
        -0.09118428826332092,
        -0.00827848445624113,
        0.024056540802121162,
        0.05218183994293213,
        0.041266877204179764,
        0.029703136533498764,
        -0.012562699615955353,
        -0.003192489268258214,
        -0.06982291489839554,
        0.027688324451446533,
        0.05946460738778114,
        0.00031554861925542355,
        -0.023822270333766937,
        0.00927978940308094,
        -0.023145470768213272,
        -0.027811400592327118,
        -0.04803222417831421,
        0.018936747685074806,
        0.006633340381085873,
        0.10235951095819473,
        0.03908460959792137,
        -0.0519467294216156,
        -0.0357067734003067,
        -0.039000026881694794,
        -0.0420038104057312,
        0.03642702102661133,
        -0.021728243678808212,
        -0.09589559584856033,
        0.034259941428899765,
        0.051146477460861206,
        0.025424595922231674,
        -0.054118748754262924,
        0.026546083390712738,
        -0.03093554638326168,
        -0.038528185337781906,
        0.07020554691553116,
        0.04285441339015961,
        0.012629259377717972,
        0.05193693935871124,
        0.0014558283146470785,
        0.013979910872876644,
        -0.058520782738924026,
        -0.05278261750936508,
        0.030456418171525,
        -0.0080473143607378,
        -0.07632315158843994,
        0.004375407472252846,
        -0.03473193570971489,
        0.00965069979429245,
        0.04832512512803078,
        -0.015214490704238415,
        0.019855888560414314,
        0.051535915583372116,
        0.02463175170123577,
        -0.015299057587981224,
        -0.016317546367645264,
        0.031062711030244827,
        -0.015096805989742279,
        0.06417328864336014,
        -0.03716519474983215,
        -0.014048250392079353,
        -0.14973410964012146,
        0.01666763238608837,
        0.04250858351588249,
        -5.026515381700847e-08,
        -0.007378283888101578,
        0.025402577593922615,
        -0.008132701739668846,
        -0.03533801808953285,
        -0.0724090039730072,
        -0.06008920446038246,
        0.023310575634241104,
        -0.06459634006023407,
        0.11053682863712311,
        -0.06223544105887413,
        -0.02857501432299614,
        -0.08539271354675293,
        -0.07711934298276901,
        0.04450536146759987,
        -0.09272056072950363,
        0.07643409818410873,
        -0.025765227153897285,
        0.07721975445747375,
        -0.007844324223697186,
        0.012666471302509308,
        -0.014671644195914268,
        0.06479532271623611,
        0.048475947231054306,
        0.017713751643896103,
        -0.011942201294004917,
        0.07880295068025589,
        -0.10303819924592972,
        -0.051773831248283386,
        0.02209465391933918,
        0.035776033997535706,
        -0.0020572934299707413,
        -0.044957902282476425,
        -0.039261143654584885,
        0.043192118406295776,
        0.03204020485281944,
        -0.011947724036872387,
        0.014519259333610535,
        -0.0020994667429476976,
        0.04485924169421196,
        0.06640373170375824,
        0.037167638540267944,
        -0.1111525222659111,
        -0.03986842557787895,
        0.033469609916210175,
        0.04700080677866936,
        -0.1031051054596901,
        0.021580398082733154,
        -0.14797334372997284,
        -0.07489488273859024,
        0.031296826899051666,
        -0.002397837582975626,
        -0.011945870704948902,
        -0.03176499530673027,
        -0.05788983777165413,
        0.0016172140603885055,
        0.05138271674513817,
        -0.007271579001098871,
        0.012543165124952793,
        0.02472710981965065,
        0.045010581612586975,
        0.041172515600919724,
        -0.0676804780960083,
        0.09436572343111038,
        0.10194393247365952
    ]
}