{
    "id": "BUMXwCHnKvE",
    "title": "It's a start..! - NZXT Canvas Gaming Monitor",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-08-31T23:32:05Z",
    "video_url": "https://www.youtube.com/watch?v=BUMXwCHnKvE",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "nzxt",
        "gaming",
        "monitor",
        "first",
        "new",
        "impressions",
        "bad"
    ],
    "views": 433243,
    "likes": 13606,
    "comments_count": 692,
    "description": "Power through work more efficiently and confidently with the help of Grammarly. Its free, why not?! Go to  to sign up for a FREE account and get 20% off Grammarly Premium!  We all know NZXT as the case, motherboard, mouse, keyboard, PC build kit, cooling, PSU, microphone, and capture card maker, but now they're entering the gaming monitor market. Will Plouffe be impressed, or does NZXT need to send this back to the drawing board?  Check out the Canvas 27Q:  Check out the Canvas 32Q Curved:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Leonardo da Plouffe 0:06 Unboxing and specs 1:45 Stand options 2:17 Colour options and pricing 2:56 The stand colour doesn't match? 3:19 Design and stand impressions 5:11 Monitor IO 5:47 Sponsor - Grammarly 6:31 HDR impressions 9:42 Thoughts on the resolution 10:21 NZXT CAM Software impressions 12:21 Built-in cable management 13:32 Gaming - Counter-strike 13:55 Thoughts on the various prices 14:50 Trying the 27Q and overall thoughts 15:35 Outro",
    "description_links": [
        "https://grammarly.com/shortcircuit",
        "https://lmg.gg/gJsiY",
        "https://lmg.gg/BVSaV",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- [David] I can't see any detail when you move. - Nothing! It's all- This turns into a giant (beep) pastel painting. That's right, everyone. NZXT. They're making gaming monitors now but I don't want this 27 inch model. No, no. I want, oh, the big boy, 32 curved. Ba da dee da bap pa dap bap bap. (box opening) It is a- I should probably talk about specs a little bit. It's the Canvas 32Q. It's a 1440P 165 Hertz, I believe, gaming display. Yep. With one millisecond response time. This is the curved screen. 32 inches. My only concern is that 32 inches for a 1440P resolution. You're kind of on the very edge of pixel density that you want for basically anything. I mean, it'll work still, but I don't know. I'm a little concerned. Let's see if that concern rings true or not. It's got HDR 10 but it doesn't say whether that's VESA certified HDR 400, VESA certified HDR 600, a thousand, whatever. I have no idea how bright this thing gets. The SDR should get to almost 400 nits though, which isn't terrible. I think it's like 350 CDM squared. Let's get this guy outta here. Power cable. HDMI cable, don't know if it's 2.1. Don't know if this has 2.1, probably doesn't cuz it's just 1440P. USB-B, USB-C, display port, power brick. - [David] That's a lot of cables. - It is a lot of cables, especially with the big recent trend that Sony and someone else did... Eve! Where they don't, sorry, d'oh! Where they don't want to include the cables. I like that these guys have given us a ton of stuff here. I can't remember what the price is, but I'll let you know. And I'll tell you if that's a good deal or not. Here it I. How sweet it is. Oh, we got the white panel for this one. Cool! One thing that's pretty neat is NZXT is actually giving you the option of getting this thing without a stand because it is just your regular 100 by 100 VESA mount. So you can buy the display itself, if you've already got an arm or if you already have a wall mount that you want to put it on. And then if you want buy the stand cuz you don't wanna put it on a mount of some kind, you can buy that too, and then get them at the same time. I'm kind of for that trend because a lot of the time stands just sit in their box and they're never used anyway but this means that I can't take this thing out of the box without the stand. So luckily. (grunting) We've got the white stand to match our white panel. Well, white housing for the panel. And you can get these in both white or black. The only difference is I think the white one costs like $20 more, which is kind of weird, but whatever, take that as you will, I'm not getting involve. Just to clarify, the stand itself costs about the same. It's just the panel and the housing for it, that it'll cost you an extra 20 bucks, if you want the white version. You get a little, you don't need, what? There's instructions for the stand. Oh, it's for mounting the monitor. (cheery music) (clicking) I have one minor annoyance. This is incredibly minor. The shade of white, compared to here, is ever so slightly different. - [David] It's different. - It is, right? Just a little bit. - [David] It shows on camera pretty good too though. - Okay, cool. Perfect. - [David] The stand is kind of beige-y. And the other one's more pure white. - Yeah. - [Person Off-Camera] Beige. (grunting) - There we go. Look at this. (off-camera whistling) That looks pretty good. It's a 1500R curvature, which isn't too aggressive but it's also not too minor either. Yeah, I think I could get used to this. It's a borderless design, is what they're calling it and the stand can do a bunch of stuff. Okay. This is a lot better. We actually installed the, the 27 inch on the stand. They come in small, medium and large at different price points. You definitely want to get the right stand for the right size monitor. When we put the 27 inch on the medium stand, it wouldn't sink down. It would, as soon as I'd push it down it would just spring right back up. So keep that in mind. You might be able to adjust the spring in this but that's not so common in stands. It's more of a monitor arm kind of thing. One other key thing that I'm already in love with is one there's a hint of NZXT purple on the inside of the navigation nipple but something that these guys have done that I haven't noticed on anyone else's displays is it's rubber. So it's actually really easy to use. And your hand doesn't slip at all when using this thing. So kudos, NZXT, I actually really like that already. Otherwise another big, nice thing for a lot of people is the branding is super minimal. You can barely see the NZXT logo on the back and then you could barely see it on the front here as well. Cuz they've just kinda gone with a like stamped kind of look instead of a big painted logo or whatever. We can swivel, which is great. And we can tilt, which is great. And there's height adjustment, which is great. There's a couple minor things as well. The swivel action is all on the base of the stand which is pretty sweet. And apparently the smaller version, the mount for the 27 inch guy that can actually pivot. So buy the one you want for the purpose that you wanna use it for. If you want portrait, don't get the big guy. Another great thing is that it's all labeled correctly. So I don't have to go and look at the box and tell you guys what's on here. It's got display port, HDMI, two HDMI ports. I think they're 2.0 instead of 2.1, but it's not 4k, so that's fine. It's got a type C port, a headphone jack, USB upstream with the USB-B and then USB 3.0, 2 ports, it looks like and the DC power adapter. A great part about that USB-C port as well (clicking in) is that it's also (grunting) a display port. So if you wanna come in and hook up a laptop or something to the screen and all it's got is USB-C display port stuff you can do that with this guy. It's looking pretty good but not as good as our sponsor Grammarly. Thanks to Grammarly for sponsoring this video. Communicating online through emails, slack or discord can be easily misinterpreted and can become a huge time block. This is why all working professionals need a tool like Grammarly. Grammarly provides comprehensive spelling and grammar suggestions and ensures your writing is mistake free. Simply install the free desktop app, log in, and start typing. There's also Grammarly premium which provides more in-depth feedback on your writing such as tone transformations to adjust your tone and sound confident. You'll save time with their clarity full sentence rewrite feature that helps you rephrase hard to read sentences, so you come across more clear and concise. Work smarter not harder and get 20% off Grammarly premium to help you save time and work more efficiently. One of the biggest problems with modern monitors is you tend to have to pay a hefty price for good HDR. 60 Hz, 165. All right! Hey, keep changing, says HDR. HDR is going. It does 10 bit. That's pretty good. You're gonna see this a lot, when you're trying to hook up HDR. It's not gonna do proper 10-bit at higher refresh rates like 165. Even the Alienware QD-OLED I have if you'd wanna do the 175 Hertz, you can't get 10 bit color. So you gotta go down to 144. Either way, 165, 8-bit color. It's still gonna look pretty decent. Let's see how the HDR looks though. - [David] This is not HDR. - So I'm told. Hold on this one, I like the deer. I like the deer. - [David] It's the flattest image I've seen in a long time. - Hold on. - [David] Eww. Look at the background. - [Nicholas] I know they look terrible. - [David] The bandings off. Turn off 8-bit. You have to turn off 8-bit. (frustrated grunting) - [David] I can see the banding, the colors- - Ugh, me too. I know! We're seeing some really bad banding when we're trying to run HDR at a higher refresh rate. So I'm gonna lower it down to like 60 to see if the HDR experience is any better. Cuz there's nothing wrong with switching to 60 frames per second for when you're watching content and then bumping it up for when you want to game. - [David] It's not as bad. - It's not as bad, but it's still there. - [David] Oh no! - Why is it even doing that? We've watched this content on more expensive screens and it doesn't really do this. We did get it to go to 10-bit color when we go down to 120 Hertz. So you could just lower it to 120 instead of 60 but it's not the nicest HDR experience. No, let me rephrase that. (tape rewinding) It's a bad HDR experience. If you're looking for an HDR display I'm not saying this is a bad monitor in general but it's not the best for HDR. The 32 inch curved is a VA panel. You might get a better experience on the 27 inch IPS panel. But yeah, I don't know. I'm just gonna turn HDR off. We'll play an SDR. It should still get to about 300 nits peak brightness in SDR, which is not bad. It's playable. For those of you who unfamiliar with HDR. It's basically the idea of taking individual spots in the scene and brightening those up so that you have a high dynamic range. You've got really bright brights and you've got really dark darks. The problem here is that it's trying to tone map it weirdly where it's like, oh, we need these highlights here. But then you lose all this weird detail in the trees as it tries to brighten up that part of the image. A lot of panels are edge lit and this one's probably edge lit as well. And if it's just a single zone then it basically just makes the whole panel brighter that doesn't usually look very good. But then when you get six dimming zones usually they're columns, when you only have about six of them, you get these weird bright columns and it doesn't look good either. So unless you have, at least, 16 zones to go here, like that. And even that's not enough, you need a hundred- you need 96 zones on the inzone for it to look remotely good. So unfortunately don't buy this for HDR. I'm sorry. I'm not saying it's a bad monitor but it's really not good for HDR. So we're just gonna turn it off. We're using a quick PPI calculator here. And as you can see with a 31.5 inch screen at 1440P, this is kind of the max that you want to go in terms of screen size to resolution because we're down to just barely 93 pixels per inch. It's not terrible. If I- It takes me a while before I get a screen door effect but you can see it. If this was 4k, I think that ends up being closer to 135 PPI or something like that. You really want- If we did a 27 inch screen, we're over a hundred and that's what you really want, is over a hundred. Yeah, 108. So 27 inches is kind of the biggest I'll go for 1440P. One of the cool things about buying either an NZXT or a Corsair product is you get their whole product suite. It all syncs up really well. Instead of using the navigation nipple to bring up your OSD I think we can change a few things in cam which is pretty cool. You will have to have your USB-B hooked into your PC but it looks like it's a displaying everything. We've got a display resolution at 165 Hertz. Our USB input is detected. We've got our normal response time set to normal, fast is okay. Fast, usually results in a bunch of badness that you don't want. Oh, cool. You can change the gamma from here. That's actually pretty sweet. What's 2.4 look like? Not much different. Ah, okay. Yeah. Its brighter. All right. Cool, cool, cool. It does work. Brightness. Crank it. Crank the contrast. Okay. I'll leave the contrast at 50. That's fine. But this brightness at a hundred. This is pretty good. It's probably about 300 nits. Ooh, saturation, sharpness. Yeah. This is actually great that you can just change all of this stuff from here because it's normally frustrating to try to go through onscreen displays especially when you don't have something as good as a navigation nipple. I don't know how color accurate this thing is outta the box. It does 89% of DCI-P3. And it does 98 or 99% of sRGB but you can totally calibrate it. You can also add a ton of different profiles to this thing. So let's say you wanna watch movies and you wanna change the color profile for that. So that things that look a bit more filmaker-y, you can do that. And then you can make a new profile for gaming. That automatically goes to a higher refresh rate. And maybe it ups the response time, if you want to go fast, instead of normal. It also has some auto dimming stuff. So you can set it where, oh, let's say it's 10:00 PM and you want your monitor to be a bit dimmer because the lights are out. You can do that. You can set up another profile for gaming and then it'll automatically switch to the gaming profile when you launch a game. Pretty cool stuff. Another thing to note, we got a little lazy with the USB cable, but our power. (power brick hitting floor) All right. Our power and our display port are cable managed through the stand. And if you can lift these up, you get 'em kind of really outta the way. I actually really like this method the best because it's very easy to put cables through there. Some are more hidden, but then you've gotta really force the cable through and anything bigger, like a display port cable is always a bit of a pain to try to actually fit it through and get it cable managed. And I like the stand. I think it fits in with pretty much anything. I'm a really big fan of these just square bases and set it down because you can then use this as part of your desk. Say you have little figurines or something on your desk and you wanna put 'em somewhere. Well, you don't have to worry about legs getting in the way of that. You can just be like, oh, it's a flat surface. Boop boop boop boop boop. Put 'em all along there. So I do like it. As for the panel itself. (sighs heavily) I wish it was ultra wide. I think that's my biggest complaint is if you're gonna be this big anyway I'd much rather they just shrunk it a bit, made it wider and then went with 21 by 9, 1440P Ultrawide instead. If I'm playing Counterstrike and I gotta do a fast flick, it's not the best. You see how blurry everything is. - [Bell] Is that not just regular blur? - No! A good display won't do this. It'll stay crystal clear the whole time. The reality is when you're just moving around normally, it's totally okay. Someone died there. I can't emote. Oh, wait, what? I get kisses. (smooching) There's eight different price points because of the different combinations of white or black or with or without stand or size. For the setup that you see in front of you, for the 32 inch white screen and the white stand it's 449. I would still definitely go for the 27 inch IPS though. Personally, if you wanna save a bit of money it's not too bad. You can get the 27 inch version the white one with the stand for 379.99. So $380 and it's 450 for the 32 inch guy. If you want an even cheaper price what you can do is you can buy just the panel for $320 for the 27 inch black version. That's not bad. At 320. I'd be okay with buying this monitor. Any more than that, I'm not so sure. I can't tell you guys if I wanna recommend this one or not because I'm really worried that the VA panel is gonna be just too blurry. However, we gotta check the IPS. It might fix this problem. Let's do it. It's better. It's not perfect. - [David] Yeah. It's not great. - It's not great. People really said this is like good motion clarity. It definitely, I can see the wall stays where it is though, here. Whereas before it turned into an entirely just green mess and same thing with this house up here, I can see the pink move instead of it kind of starting to blur with the blue of that house. It's not perfect on the 27 inch IPS panel but it is markedly better. So I would personally suggest that especially if you're on a budget I would get the 27 inch version. I think you're gonna just get a much better picture with this. And that's what I would personally go for. Thanks for watching everyone. This is NZXT's Canvas display. Not bad. If you wanna take a look at another display we did, check out the ultra gear. That was a fun video. Thanks for watching! Getting here. Good idea, Dad- David. Okay. - [David] Bad dad. - I almost called you dad. (David laughing) I almost called you dad. - [David] Daddy. Sorry. - Dadddddyy!",
    "transcript_keywords": [
        "HDR",
        "stand",
        "inch",
        "good",
        "thing",
        "white",
        "display",
        "kind",
        "pretty",
        "display port",
        "pretty good",
        "panel",
        "bad",
        "NZXT",
        "VESA certified HDR",
        "time",
        "HDR experience",
        "inch IPS panel",
        "bit",
        "cable"
    ],
    "transcript_entity_values": [
        "99%",
        "1500R",
        "20 bucks",
        "8",
        "20%",
        "USB",
        "Corsair",
        "Counterstrike",
        "27 inches",
        "350",
        "1440P",
        "380",
        "50",
        "10",
        "320",
        "SDR",
        "450",
        "27 inch",
        "VESA",
        "2",
        "175",
        "2.0",
        "1440P.",
        "Hertz",
        "a ton",
        "4k",
        "VA",
        "about six",
        "32 inches",
        "almost 400",
        "9",
        "320",
        "Canvas",
        "93 pixels per",
        "OSD",
        "Hertz",
        "David",
        "379.99",
        "CDM",
        "Alienware",
        "89%",
        "Nicholas",
        "Sony",
        "98",
        "two",
        "144",
        "the spring",
        "2.1",
        "eight",
        "449",
        "32 inch",
        "Eve",
        "32",
        "one",
        "60 Hz",
        "20",
        "1440P",
        "165",
        "about 300",
        "one millisecond",
        "DC",
        "second",
        "Grammarly",
        "2.4",
        "96",
        "Ultrawide",
        "DCI-P3",
        "HDMI",
        "120",
        "David] Eww",
        "10:00 PM",
        "six",
        "pa dap",
        "Ba da dee da bap",
        "One",
        "60",
        "1440P. One",
        "a hundred",
        "100",
        "108",
        "IPS",
        "21",
        "135",
        "31.5 inch",
        "16",
        "USB-C",
        "NZXT"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "QUANTITY",
        "ORG",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "TIME",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.05199568718671799,
        -0.017793219536542892,
        -0.01794237643480301,
        -0.04337838292121887,
        0.08960232883691788,
        0.004290166776627302,
        0.04819461703300476,
        0.028552411124110222,
        -0.04058058559894562,
        0.061079561710357666,
        -0.06464441120624542,
        -0.022005798295140266,
        0.04590964689850807,
        0.04984214901924133,
        0.054531507194042206,
        -0.00998011790215969,
        0.0314037911593914,
        -0.07671704143285751,
        -0.0003224941319786012,
        0.009832995943725109,
        -0.03170870244503021,
        -0.1241605207324028,
        0.06410705298185349,
        -0.07776894420385361,
        0.023181188851594925,
        -0.005575038958340883,
        -0.01642167754471302,
        0.00043443855247460306,
        0.06991247087717056,
        -0.053505007177591324,
        -0.054129648953676224,
        0.05271986871957779,
        0.05215774103999138,
        -0.024015367031097412,
        0.0031092825811356306,
        -0.021370619535446167,
        0.028534967452287674,
        -0.0442400723695755,
        -0.18702518939971924,
        -0.10336790978908539,
        -0.03844313323497772,
        0.05312829464673996,
        -0.07452923059463501,
        0.03952748328447342,
        0.05563875660300255,
        -0.043061818927526474,
        0.013854160904884338,
        -0.040749575942754745,
        -0.02701750211417675,
        0.10788976401090622,
        -0.042703304439783096,
        -0.18643200397491455,
        0.05778275430202484,
        -0.021535538136959076,
        -0.05170834809541702,
        0.07875918596982956,
        -0.07119061797857285,
        0.004244130104780197,
        0.08324947953224182,
        -0.05563456192612648,
        0.038343220949172974,
        -0.08809135854244232,
        -0.05699272081255913,
        0.0643678605556488,
        0.049634963274002075,
        0.014674690552055836,
        -0.02622189186513424,
        0.09916645288467407,
        -0.07575397938489914,
        -0.008064063265919685,
        -0.0039117406122386456,
        -0.018479814752936363,
        0.0342283770442009,
        0.005117299500852823,
        0.02671642415225506,
        -0.008746916428208351,
        0.02662993222475052,
        -0.05590399354696274,
        0.015830503776669502,
        0.0381769984960556,
        0.03948678448796272,
        -0.034841328859329224,
        -0.04906259477138519,
        0.06828055530786514,
        0.03995911777019501,
        0.01852840930223465,
        0.06800369918346405,
        -0.008538837544620037,
        -0.029872125014662743,
        -0.12473023682832718,
        -0.038770388811826706,
        0.08589082211256027,
        0.05900450423359871,
        0.04812514781951904,
        -0.025373684242367744,
        -0.04232405498623848,
        0.020865611732006073,
        -0.001496827113442123,
        -0.01236898172646761,
        0.09067252278327942,
        0.07278357446193695,
        -0.008842159993946552,
        0.10162133723497391,
        -0.0005412708851508796,
        -0.08309392631053925,
        -0.05131494253873825,
        -0.026411177590489388,
        0.08136473596096039,
        -0.018059980124235153,
        0.08974314481019974,
        -0.11459261924028397,
        0.09826262295246124,
        -0.06661304831504822,
        0.030853167176246643,
        0.04271397739648819,
        0.02809634804725647,
        -0.03070027381181717,
        0.058101046830415726,
        0.05454609915614128,
        0.010107294656336308,
        0.016535505652427673,
        0.011122600175440311,
        -0.05029669404029846,
        -0.010616776533424854,
        0.04795697703957558,
        0.01450494583696127,
        -0.052483730018138885,
        5.2090221160705435e-33,
        -0.04831983521580696,
        0.12302646785974503,
        -0.06834949553012848,
        -0.03028280660510063,
        0.07375562191009521,
        -0.0032771520782262087,
        0.030084097757935524,
        0.018142452463507652,
        -0.010400171391665936,
        0.04618063196539879,
        0.01508596632629633,
        0.07024380564689636,
        -0.024052515625953674,
        0.12334202229976654,
        0.08373304456472397,
        -0.09949908405542374,
        0.026114335283637047,
        -0.007374102249741554,
        -0.003945866599678993,
        0.056323789060115814,
        0.0004513429303187877,
        -0.1083642765879631,
        0.0029664321336895227,
        0.023621121421456337,
        0.03184037655591965,
        -0.010686127468943596,
        -0.011914963833987713,
        0.06421804428100586,
        0.029238572344183922,
        0.00796886719763279,
        -0.008375602774322033,
        -0.05921170487999916,
        -0.015898851677775383,
        -0.05979623645544052,
        -0.07303792238235474,
        -0.057905808091163635,
        -0.037520118057727814,
        -0.08124084770679474,
        0.010609760880470276,
        0.010374559089541435,
        -0.045917004346847534,
        0.004750674590468407,
        -0.08022414147853851,
        -0.08144684135913849,
        0.00027699139900505543,
        -0.013509069569408894,
        0.010772489942610264,
        0.01817166432738304,
        0.030942920595407486,
        0.025919264182448387,
        -0.09931955486536026,
        0.025085000321269035,
        -0.111480712890625,
        -0.052198946475982666,
        -0.010921793058514595,
        -0.0782206654548645,
        0.0024876005481928587,
        -0.017694350332021713,
        0.007675917353481054,
        -0.009368091821670532,
        0.010681693442165852,
        0.002653139643371105,
        0.02122257649898529,
        0.03129709139466286,
        -0.05898632854223251,
        0.06521576642990112,
        0.036669205874204636,
        -0.022911271080374718,
        -0.09715171903371811,
        -0.02498995140194893,
        -0.0690925195813179,
        0.04980622977018356,
        -0.035202424973249435,
        -0.029285291209816933,
        0.03785168379545212,
        0.018382271751761436,
        -0.09090365469455719,
        -0.008179990574717522,
        0.023479841649532318,
        0.0005857889773324132,
        -0.04063575714826584,
        0.009754379279911518,
        0.0012589840916916728,
        -0.00958956964313984,
        0.014519104734063148,
        -0.08274102956056595,
        0.028020981699228287,
        -0.01708880439400673,
        -0.04831056669354439,
        0.002437949413433671,
        0.012704136781394482,
        -0.02008241042494774,
        -0.02259375900030136,
        -0.006370360963046551,
        -0.06223292276263237,
        -5.471652900641182e-33,
        -0.06292661279439926,
        0.05421188846230507,
        -0.012470708228647709,
        0.047708455473184586,
        0.012821831740438938,
        -0.018069883808493614,
        0.0656319111585617,
        -0.0179736390709877,
        0.08070699870586395,
        -0.03734550625085831,
        0.007761565037071705,
        0.04160839691758156,
        -0.03671225160360336,
        0.06880982220172882,
        -0.026515426114201546,
        0.021080991253256798,
        0.05300392955541611,
        -0.07091619819402695,
        0.03772525489330292,
        -0.12645025551319122,
        0.0999663770198822,
        0.016064995899796486,
        -0.04943401739001274,
        0.03397474065423012,
        -0.015135195106267929,
        0.0669923797249794,
        0.05453707277774811,
        -0.02144768461585045,
        -0.033425118774175644,
        0.08302246779203415,
        -0.0467744879424572,
        -0.04065770283341408,
        0.02275869995355606,
        0.025525953620672226,
        0.04320881888270378,
        -0.029875418171286583,
        0.09941665083169937,
        0.03855643421411514,
        -0.04194265604019165,
        -0.029171155765652657,
        0.005733891855925322,
        -6.783092976547778e-05,
        -0.0443180575966835,
        -0.0036420116666704416,
        -0.03773476928472519,
        -0.020494956523180008,
        -0.034794870764017105,
        -0.006172748748213053,
        0.036221377551555634,
        0.011099020950496197,
        0.003498674836009741,
        0.03175492212176323,
        0.09639494121074677,
        -0.08473742008209229,
        -0.037240900099277496,
        -0.05178987234830856,
        -0.016290731728076935,
        -0.007346969563513994,
        -0.013685807585716248,
        -0.06132989749312401,
        0.05232742428779602,
        0.02396743930876255,
        -0.09669268876314163,
        -0.05175697058439255,
        0.0663243979215622,
        0.004565169103443623,
        0.0719822347164154,
        -0.024155830964446068,
        0.027860097587108612,
        -0.035229090601205826,
        -0.01999838650226593,
        0.08069354295730591,
        -0.015749365091323853,
        -0.030567383393645287,
        -0.07044313848018646,
        0.09791802614927292,
        0.06798150390386581,
        0.010932056233286858,
        0.044761985540390015,
        -0.04348986595869064,
        0.004456059075891972,
        0.00356579408980906,
        0.07317277044057846,
        -0.03857791796326637,
        0.05561777949333191,
        0.014705282635986805,
        -0.004297554027289152,
        -0.05664404109120369,
        0.03645896539092064,
        -0.01797119341790676,
        -0.004729446489363909,
        0.02719489298760891,
        0.011011430993676186,
        0.029878780245780945,
        0.0370870940387249,
        -6.169798183464081e-08,
        -0.020057881250977516,
        -0.07779709249734879,
        -0.05551347881555557,
        -0.02262638323009014,
        -0.004483229946345091,
        -0.06029236316680908,
        0.03355730324983597,
        -0.058842796832323074,
        0.057588208466768265,
        -0.03077714703977108,
        0.04030347988009453,
        -0.030221061781048775,
        -0.02718709409236908,
        0.046386972069740295,
        0.10210186243057251,
        0.052951645106077194,
        0.01977997086942196,
        0.09234903007745743,
        -0.0645507276058197,
        -0.008952309377491474,
        0.01258667279034853,
        0.05156980827450752,
        0.054768551141023636,
        -0.0020125433802604675,
        0.005976616870611906,
        -0.0326438844203949,
        0.01776966266334057,
        0.05074235424399376,
        0.032851144671440125,
        -0.06532341986894608,
        -0.10056325793266296,
        0.027072610333561897,
        0.046218324452638626,
        -0.03482040762901306,
        0.007982950657606125,
        -0.06926074624061584,
        0.0011187109630554914,
        0.03078894317150116,
        0.038962025195360184,
        0.07410644739866257,
        -0.01954265870153904,
        -0.014617109671235085,
        -0.03589693456888199,
        0.00866314023733139,
        -0.008355235680937767,
        -0.05049765110015869,
        -0.06893051415681839,
        -0.08784092217683792,
        -0.0290228258818388,
        -0.05485803633928299,
        -0.0298000518232584,
        -0.026038605719804764,
        0.023375943303108215,
        -0.025076663121581078,
        0.009641961194574833,
        0.041345275938510895,
        -0.02575106918811798,
        0.025676114484667778,
        -0.013707305304706097,
        0.1036500334739685,
        -0.042069680988788605,
        -0.04458991810679436,
        0.008038586936891079,
        0.012762282975018024
    ]
}