{
    "id": "BupP6jdaGZE",
    "title": "OnePlus Nord review: the best of OnePlus, for less",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-07-27T08:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=BupP6jdaGZE",
    "category": "Science & Technology",
    "tags": [
        "oneplus nord",
        "oneplus",
        "nord",
        "nord oneplus",
        "oneplus nord review",
        "review oneplus",
        "oneplus review",
        "new oneplus phone",
        "new oneplus",
        "oneplus 8",
        "oneplus 8t",
        "new phone",
        "oneplus phone",
        "phone",
        "phones",
        "review",
        "hands on",
        "first look",
        "camera",
        "price",
        "affordable",
        "how to buy",
        "where to buy",
        "compromises",
        "specs",
        "release date",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google",
        "iphone",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 340427,
    "likes": 7341,
    "comments_count": 542,
    "description": "The OnePlus Nord is the companys first serious attempt at a mid-range phone in years. Its more affordable, but that means OnePlus has had to make some compromises. So has it cut corners in the right places, or does the Nord have one compromise too many?  Read the full review here:   If you buy something from a Verge link, Vox Media may earn a commission. Seeour ethics policy:   Buy the OnePlus Nord:   Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/2CH61iH",
        "http://bit.ly/2TQsqjB",
        "https://fave.co/2OWrRRq",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "(gentle music) - The OnePlus Nord is an important moment for OnePlus. For years OnePlus has basically stuck to flagships. Nowadays it likes to do them two at a time but they're both designed to sit more or less at the top of the market. Now it's expanding with the Nord, its first serious attempt at a mid-range phone in years. Launching a mid-range phone means making some tough decisions about what the OnePlus name means to people. It still needs to have those features that people buy OnePlus phones for in the first place but it also needs to make some compromises. Not just because it needs to make it cheap but also so that once it is cheaper it doesn't end up so good that people choose it over your flagship phones. It needs to draw a line between OnePlus features and flagship OnePlus features. It's a balancing act where if you get the balance slightly wrong you could end up with the same kind of flagship killer that OnePlus liked to call its phones back in the day. Only now OnePlus has flagship phones of its own that risk getting caught in the crossfire. So what does a mid-range OnePlus phone look like? Which flagship features do you get to keep and which do you lose? (gentle music) So this is it, the OnePlus Nord. The model I've been using has 12 gigabytes of RAM and 256 gigabytes of storage and costs 469 pounds or 499 euros. But there's also a step down model with eight gigabytes of RAM and 128 gigabytes of storage which costs 379 pounds or 399 euros. So it's a mid-range phone sitting in a similarish sort of price category to this year's entry level, 419 pound iPhone SE or the 429 pound Galaxy A51 5G. Both models are releasing in Europe and India but OnePlus is only planning a limited beta launch in the US for now. At either price you're getting what is on paper quite a well specced device. There's a 6.4, four inch OLED display with a 1080p resolution and a 90 Hertz refresh rate, a quad rear camera array based around the same 48 megapixel sensor that OnePlus used for the 8, dual selfie cameras, including one with an ultra wide lens, and you're getting support for sub six gigahertz 5G. Now the trade-off, on paper at least, is that the Nord is powered by a Snapdragon 765G processor which isn't quite as fast as the flagship processors OnePlus used in the 8 and the 8 Pro. But specs can't tell you how premium a device feels to hold. And the OnePlus Nord's design is one of the more obvious indicators of it's lower price point. That said, I still really like it. I like the simplicity, there's no messing around with screens that curve round the edges of the device. Instead you're gonna get a flat screen with a smallish hole-punched notch for the Nord's dual selfie cameras and what I'd call reasonably small set of bevels around the edge of the screen. Generally the whole design does feel less premium than the 8 but not in a way that feels cheap, it's just more utilitarian. Battery life is also good. Now I'll admit that it's still quite hard to gauge this given the amount of time I'm spending at home right now and I'll also caveat this by saying that I was connected to 4G rather than 5G networks. But I was getting between eight and 10 hours of screen time between charges from the Nord's 4,115 million power battery. And that includes everything, from watching copious amounts of YouTube to keeping in contact with friends and colleagues over Slack and WhatsApp, taking photos and of course browsing plenty of Twitter. There's no wireless charging but there is support for OnePlus' Warp Charge 30T standard which the company says should get you about 70% of your charge back in half an hour. So good battery life doesn't seem to be exclusive to OnePlus flagships, it's more of a universal OnePlus feature. Now we already know you're not getting exactly the same display on this as you did on the 8, it doesn't have that same curve for example. It's also a little bit smaller at 6.44 inches compared to 6.55 inches with the 8. But honestly if you hold them next to each other you barely notice the difference. So it's a very similar screen which means it's pretty great. It's OLED so blacks are lovely and deep, colors are vibrant, it's still 1080p and hey, it's also got that 90 Hertz refresh rate display. Now I've said it before and I'll say it again but high refresh rate displays deserve to become the new standard. But there is a caveat and that's that the slightly less powerful processor on the Nord means that it doesn't feel exactly as smooth as the 8. I mean it's fine if you're scrolling through something simple like the app drawer but scroll through Twitter with its numerous videos and images and it does start to stutter, if only a little. It's a little bit hard to show on video but trust me when I say it is there. It's still better than a 60 Hertz display but it just doesn't feel as smooth as what we've seen from flagship phones with 90 Hertz displays. It's an acceptable trade off for the price but it's also something that's worth bearing in mind. Oh, and by the by, I found it hard to fault the in-display fingerprint sensor. It works basically every time and I've barely had to think about it. So a high-end display seems to be a OnePlus staple and not something that's exclusive to its flagships, even if you're not getting exactly the same performance. Audio isn't a strong suit of the Nord. There's a single downward firing speaker here which means that there's no stereo and while it gets plenty loud enough there's just not that much base there. So I guess good speakers are a flagship exclusive. (upbeat music) So far we've been trying to work out what features OnePlus thinks all of its phones need to have and which it wants to keep for its flagships. But cameras are a bit trickier to categorize here because they've never been one of OnePlus' core strengths. They've been good, but never best in class. Now the good news is that the Nord's cameras are in a very similar ballpark to the OnePlus 8 and the better news is there's at least one feature here that is exclusive to the Nord. Now the Nord has a lot of cameras. I mean on the back there's four. There's a 48 megapixel main camera, an eight megapixel ultra wide angle camera, a two megapixel macro camera and a five megapixel depth sensor. And on the front, there's two. There's a main 32 megapixel camera and an eight megapixel ultra wide with a 105 degree field of view, a neat little exclusive for the Nord. Now that's a lot of hardware. So here's what OnePlus actually does with it. In daylight I think you get very similar quality photos to the 8 with the Nord. I mean check out this photo from my living room. And if I didn't label the photos I think you'd have a hard time telling me which phone took which photo. Sometimes the OnePlus Nord decides to add a little bit more saturation to photos than the 8 does but most of the time you can barely tell the difference. It's the same when it comes to faces. There's more of a difference when it comes to wide angle shots though where you really miss the extra resolution on the 8's ultra wide camera. The Nord seems to overcompensate with a little too much image processing sometimes. But, it's probably acceptable at this price and I'd rather it was there than not at all. It's the same deal with the wide angle selfie camera. Sure, it's images are a little softer than the main 32 megapixel sensor and the selfie camera in general seems to make my face a bit weird and bright looking but it's super useful for group selfies or I guess couple selfies if you're socially distancing. Whatever, I like it. While we're talking extra cameras let's run down the other two that are on the back of this device. There's a macro camera and the camera for sensing depth. Both are kind of a mixed bag. I mean take the macro camera, it's certainly managed to focus on this amoeba that yes, I know, I always use to test macro cameras but try as I might my shots ended up looking muddy and blurry. Same with these flowers. It's not something I'd ever choose to use. Likewise with this depth sensing camera I think it did a decent enough job generating a convincing background blur on this photo of me in low light but in this shot of my flatmate it completely beefed the hair on the top left of his head. It quite a nice shot overall but once you notice the hair you can't un-see it. And speaking of low light shots, well, if you watched my review of the 8 then you probably have a good idea of what to expect here. It's acceptable, but nothing amazing. So, like the 90 Hertz display, the Nord has a lot of hardware but I don't necessarily think it gets the most out of it that it could. It's in a very similar league to the 8 and I just don't think that either are the phone to get if you want the absolute best camera available. That said I think those trade offs are far more worth it at this price point than they were on the 8. (gentle music) I think the Nord is a really solid mid-range phone but it's not perfect. It's well specced, yes. I mean, it's got lots of cameras, it's got that nice big high refresh rate display and of course it's got that big battery. But the reality of what it gets from that hardware sometimes leaves a little bit to be desired. I mean it's got lots of camera lenses but overall performance ends up only being okay. And it's got that high refresh rate display but sometimes its processor seems to let it down. They're compromises but I don't think they're unreasonable at this price point. Picking a mid-range phone is normally a matter of choosing the battles. You have to pick which features are most important to you because no mid-range phone is gonna be able to completely deliver on all of them. But you sort of can't do that with the Nord, it's too well-rounded, which means there are no serious pitfalls. There's also no one area that it completely delivers on. That's not a bad thing at all, it just kinda makes it hard to unreservedly recommend this phone to any one group of people. On the flip side though it does mean that I can sort of recommend this phone to almost anyone. OnePlus made a decent mid-range phone. But look, it's no flagship killer. Hey, so thank you so much for watching guys. If you're looking for another video to watch then obviously I just recommend watching this one again 'cause it's kind of great. But if you must have some variety in your life then Becca reviewed the OnePlus Buds last week which are the new true wireless earbuds that go along with this phone. So if you like OnePlus give it a watch.",
    "transcript_keywords": [
        "Nord",
        "OnePlus",
        "OnePlus Nord",
        "camera",
        "phone",
        "midrange phone",
        "flagship",
        "cameras",
        "flagship phones",
        "OnePlus Nord design",
        "display",
        "phones",
        "Nord cameras",
        "OnePlus Nord decides",
        "midrange OnePlus phone",
        "midrange",
        "megapixel",
        "flagship OnePlus features",
        "Hertz",
        "OnePlus features"
    ],
    "transcript_entity_values": [
        "The OnePlus Nord",
        "between eight and 10 hours",
        "90",
        "one",
        "256 gigabytes",
        "30",
        "6.55 inches",
        "four",
        "Nord",
        "eight gigabytes",
        "Snapdragon",
        "105 degree",
        "Twitter",
        "OnePlus Buds",
        "the day",
        "499 euros",
        "Slack",
        "OnePlus' Warp",
        "half an hour",
        "five megapixel",
        "four inch",
        "8",
        "128 gigabytes",
        "379 pounds",
        "year",
        "Europe",
        "US",
        "8",
        "5",
        "60",
        "6.44 inches",
        "the OnePlus Nord",
        "years",
        "469 pounds",
        "Becca",
        "399 euros",
        "Hertz",
        "765",
        "at least one",
        "32 megapixel",
        "two",
        "OnePlus",
        "OnePlus 8",
        "4,115 million",
        "429 pound",
        "4",
        "India",
        "1080p",
        "last week",
        "WhatsApp",
        "sub six gigahertz",
        "OnePlus",
        "the OnePlus Nord's",
        "YouTube",
        "eight megapixel",
        "first",
        "6.4",
        "about 70%",
        "48 megapixel",
        "RAM",
        "iPhone SE",
        "12 gigabytes",
        "419 pound",
        "OnePlus"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "DATE",
        "MONEY",
        "ORG",
        "PRODUCT",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "LOC",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT"
    ],
    "vector": [
        -0.023263979703187943,
        0.02075612172484398,
        0.02484513446688652,
        -0.0663907378911972,
        0.010749539360404015,
        -0.01986640878021717,
        -0.08488084375858307,
        0.1241057738661766,
        0.0020146318711340427,
        0.003008022205904126,
        -0.04702194035053253,
        0.058568160980939865,
        -0.012659977190196514,
        -0.036711085587739944,
        0.023699047043919563,
        -0.062372852116823196,
        0.10346832871437073,
        -0.13688895106315613,
        -0.0025729602202773094,
        0.02999015897512436,
        -0.005530401598662138,
        -0.05393044278025627,
        0.0006269612931646407,
        -0.014783983118832111,
        0.012921642512083054,
        -0.06333541125059128,
        -0.0781656801700592,
        -0.0446242056787014,
        -0.008503315038979053,
        -0.07610136270523071,
        0.07844631373882294,
        0.13456133008003235,
        0.07863409072160721,
        0.04659828543663025,
        -0.09676509350538254,
        -0.03852241486310959,
        0.05515996739268303,
        -0.016087835654616356,
        -0.1323062628507614,
        0.028868800029158592,
        0.02947370335459709,
        -0.005875089205801487,
        -0.055263664573431015,
        0.010625852271914482,
        -0.02825315110385418,
        -0.033882252871990204,
        -0.013758325949311256,
        -0.013681957498192787,
        0.004282496869564056,
        -0.04474515840411186,
        0.06457223743200302,
        -0.0680755153298378,
        0.02385355345904827,
        -0.03411201387643814,
        -0.08975885808467865,
        0.05139588192105293,
        -0.06384602934122086,
        0.06039247289299965,
        0.06794441491365433,
        -0.022439859807491302,
        0.05755193904042244,
        -0.06725508719682693,
        -0.02502257190644741,
        0.02811362035572529,
        0.03507343307137489,
        -0.014832239598035812,
        -0.01683933101594448,
        -0.0650033950805664,
        -0.11259639263153076,
        0.0019601439125835896,
        0.05392587557435036,
        -0.04047957435250282,
        -0.025158921256661415,
        0.054911233484745026,
        0.018635867163538933,
        0.08070183545351028,
        0.07187782973051071,
        -0.002861700253561139,
        -0.04916224256157875,
        -0.04215376824140549,
        -0.013742907904088497,
        0.060386840254068375,
        -0.07808899879455566,
        -0.05925559997558594,
        0.032314736396074295,
        0.008529084734618664,
        0.005947194993495941,
        -0.00014712628035340458,
        0.0021822883281856775,
        -0.1276070922613144,
        0.03743245452642441,
        0.015164525248110294,
        0.036452215164899826,
        0.010810510255396366,
        -0.010300173424184322,
        0.021089468151330948,
        -0.05527777969837189,
        -0.05121685191988945,
        -0.027459971606731415,
        -0.06579076498746872,
        -0.016036851331591606,
        -0.002247888594865799,
        0.035089537501335144,
        0.01142817735671997,
        -0.01485701184719801,
        -0.08183122426271439,
        -0.004252864513546228,
        -0.04514966532588005,
        0.05364697054028511,
        0.05679119750857353,
        -0.055139120668172836,
        -0.019145598635077477,
        -0.0061671859584748745,
        0.010167860426008701,
        0.025321893393993378,
        -0.03778715804219246,
        -0.0595528744161129,
        0.02566441334784031,
        0.1558704525232315,
        -0.05081519857048988,
        -0.04201251268386841,
        -0.02192276157438755,
        -0.03267684951424599,
        0.0002853713813237846,
        -0.03157662972807884,
        -0.020012132823467255,
        -0.012749016284942627,
        2.4731563601575968e-33,
        -0.03281240165233612,
        0.07968176156282425,
        -0.1006435751914978,
        0.057069916278123856,
        -0.01260655838996172,
        -0.014321377500891685,
        0.015769001096487045,
        0.029052341356873512,
        -0.01837368868291378,
        0.1317911148071289,
        -0.09500019252300262,
        0.050100699067115784,
        -0.001186217414215207,
        0.0819251760840416,
        0.030694857239723206,
        -0.031604792922735214,
        0.05661772936582565,
        -0.04197679087519646,
        -0.08009666204452515,
        0.004785300698131323,
        0.0520360991358757,
        0.0566873624920845,
        0.009743457660079002,
        -0.015641869977116585,
        0.10826041549444199,
        -0.06299303472042084,
        0.029594937339425087,
        -0.05071648955345154,
        0.07609228044748306,
        0.0001850989501690492,
        -0.09694024920463562,
        -0.03548325598239899,
        -0.009824302047491074,
        0.009577111341059208,
        0.03254054859280586,
        0.1066293716430664,
        -0.045103732496500015,
        -0.017763229086995125,
        -0.029107190668582916,
        -0.036816395819187164,
        -0.10150237381458282,
        0.04406171292066574,
        -0.12792250514030457,
        -0.03341143578290939,
        0.0781516507267952,
        0.057449012994766235,
        0.05007042735815048,
        -0.031051773577928543,
        -0.03422771394252777,
        -0.07217829674482346,
        -0.05421334132552147,
        0.07631461322307587,
        -0.017427250742912292,
        0.015932435169816017,
        -0.03289475664496422,
        0.00229511852376163,
        0.07213009148836136,
        -0.04843905568122864,
        0.06122630834579468,
        0.014014930464327335,
        -0.006656274199485779,
        -0.03464081510901451,
        -0.0814623162150383,
        0.0374348945915699,
        -0.005375698674470186,
        0.07899650186300278,
        0.03477833420038223,
        0.010631483979523182,
        -0.028574295341968536,
        0.019318435341119766,
        -0.03569331765174866,
        -0.01149312686175108,
        0.010973988100886345,
        0.01198914460837841,
        0.03910226374864578,
        0.04977058991789818,
        -0.014423076063394547,
        0.03730069100856781,
        0.07605288177728653,
        -0.03306448459625244,
        -0.05666014552116394,
        0.031826600432395935,
        0.003394837724044919,
        0.025035403668880463,
        0.0720391795039177,
        0.0012837568065151572,
        0.04145489260554314,
        -0.03024599514901638,
        -0.044967398047447205,
        0.07324063032865524,
        -0.017817120999097824,
        0.03431298956274986,
        0.004368714988231659,
        0.07469477504491806,
        0.0021621049381792545,
        -4.492375005594028e-33,
        -0.09685943275690079,
        -0.06025229021906853,
        -0.046546149998903275,
        0.01849224790930748,
        0.024560868740081787,
        0.07352308183908463,
        0.04846283793449402,
        0.027432527393102646,
        -0.034611158072948456,
        -0.007215776946395636,
        -0.007507981266826391,
        -0.03923508897423744,
        0.03207233175635338,
        -0.012776119634509087,
        0.019397040829062462,
        -0.037174273282289505,
        0.05825890228152275,
        0.015727605670690536,
        0.008009574376046658,
        0.030787521973252296,
        0.00404603173956275,
        -0.024736875668168068,
        -0.09436916559934616,
        0.005726946052163839,
        -0.04904268682003021,
        0.020111775025725365,
        -0.0023656936828047037,
        -0.047583695501089096,
        -0.05837095528841019,
        -0.033209994435310364,
        -0.0880235955119133,
        0.008708175271749496,
        -0.00900282897055149,
        -0.029163489118218422,
        0.07994026690721512,
        0.09366939216852188,
        -0.05452330783009529,
        -0.05078841745853424,
        -0.0035185653250664473,
        0.005360681563615799,
        0.007838134653866291,
        -0.0009655982721596956,
        0.05571063607931137,
        0.011251412332057953,
        0.04994935914874077,
        -0.06562739610671997,
        -0.044123005121946335,
        0.03715651109814644,
        -0.06038974970579147,
        0.01602206565439701,
        0.04031708091497421,
        0.03828541934490204,
        0.05920090526342392,
        -0.004979949444532394,
        0.0345706008374691,
        -0.10491515696048737,
        0.02637263387441635,
        -0.03803882375359535,
        -0.027974678203463554,
        0.013353683985769749,
        0.054574280977249146,
        0.03516232594847679,
        -0.006222227122634649,
        -0.016129689291119576,
        -0.025286201387643814,
        -0.017340296879410744,
        0.030455321073532104,
        -0.0922674685716629,
        -0.015048335306346416,
        0.022436175495386124,
        0.018220748752355576,
        -0.011112429201602936,
        -0.05448615923523903,
        -0.12598025798797607,
        -0.06920173019170761,
        0.021932242438197136,
        -0.01929364539682865,
        -0.08998356759548187,
        -0.0039005300495773554,
        -0.016121244058012962,
        -0.022037575021386147,
        0.05318417772650719,
        0.04409126192331314,
        0.024802258238196373,
        0.10730836540460587,
        0.027700092643499374,
        0.06509654968976974,
        -0.00461129704490304,
        -0.01796937733888626,
        0.03126421570777893,
        0.00804118625819683,
        0.025774970650672913,
        -0.06590350717306137,
        0.054705630987882614,
        -0.005219770595431328,
        -5.314680961987506e-08,
        0.039572395384311676,
        0.025835853070020676,
        0.05460507422685623,
        0.00395472627133131,
        0.001657278393395245,
        -0.06121166795492172,
        0.05247050151228905,
        -0.06286829710006714,
        -0.012756754644215107,
        0.07424773275852203,
        -0.01990501955151558,
        -0.028922006487846375,
        -0.10780372470617294,
        0.05009341612458229,
        0.04346913844347,
        0.03857046365737915,
        0.0026313236448913813,
        0.05685918405652046,
        -0.0028740952257066965,
        0.1114230826497078,
        -0.002085375366732478,
        0.04790414497256279,
        0.042514618486166,
        -0.11266789585351944,
        0.08873727917671204,
        -0.011521079577505589,
        0.014021480455994606,
        -0.00875069759786129,
        0.13806253671646118,
        -0.031572893261909485,
        -0.008942153304815292,
        -0.0037075034342706203,
        0.014163197949528694,
        0.03217288479208946,
        -0.012956030666828156,
        -0.054514769464731216,
        -0.013720586895942688,
        0.12504948675632477,
        0.07658395171165466,
        -0.0007810175302438438,
        0.027579180896282196,
        0.0026754122227430344,
        0.04082562029361725,
        0.06517846882343292,
        -0.041993752121925354,
        0.003586140926927328,
        -0.032800786197185516,
        -0.07776903361082077,
        -0.034408122301101685,
        0.028126563876867294,
        -0.07208940386772156,
        -0.030259890481829643,
        0.0142102912068367,
        -0.0036543954629451036,
        0.04213276505470276,
        -0.030637959018349648,
        -0.026507951319217682,
        0.016543161123991013,
        -0.020772689953446388,
        0.05545718967914581,
        0.031171459704637527,
        -0.09098057448863983,
        -0.023223403841257095,
        0.10781033337116241
    ]
}