{
    "id": "bxN2JSMpvCo",
    "title": "A record player that can play CDs: The Fisher DAC-145",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2020-08-19T14:58:57Z",
    "video_url": "https://www.youtube.com/watch?v=bxN2JSMpvCo",
    "category": "Science & Technology",
    "tags": [],
    "views": 1052768,
    "likes": 37240,
    "comments_count": 3663,
    "description": "Well now, what do we have here? It's a CD player... but also a turntable? Hmm... very interesting. But why? How? And is it actually a good idea? Lucky for you you've clicked on this video and will find out!  Anybody want some links? Here are the videos and playlist that I mentioned:  The Compact Disc playlist;  Record changers:   Technology Connextras (the second channel that stuff goes on sometimes):  Technology Connections on Twitter:  The TC Subreddit   This channel is supported through viewer contribution on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. It's how I can make fun of products like these! If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!   And thank you to the following patrons! Yaniv , Francis Fisher, The War Academy, ManicGamer, Jay , Dave Anderson, Eric Hansen, Dane Peterson, Jeremy Kitchen, Audin Malmin, Adam D. Ruppe, Matthew Giraitis, Kevin Landrigan, Carl Yazbek, Hunter Schwisow, Matt Falcon, Paul Williams, Brent LaRowe, Lurker239 , Felix Freiberger, James Ryan, Lukas Komischke, rozboris , Jason Nevins, Jeffrey , BlancoGrande , Stephen Pick, Technicalleigh , Adam Coddington, Lolucoca , Steven Metcalf, Justin Talbot, Christopher Jett, SovietBear , Mike Mason, Techmoan , Kotanu, Christopher Luna, Brian G. Shacklett, Chris Hartl, Andre, Matthew Baron, Mark Critchley, Andres Plaza, Charlie Hankin, Casey Kikendall, Sebi Jecklin, Warmo , The8TrackKid , Michael Snowden, Julian Rapoport, Christopher Bassett, Ryan Cozzubbo, Marcus Schwartz, Matt Taylor, Lars JJ, Richard Lindsey, Peek , blouerat , Robert Toth, Marc Ethier, Thijs Dortmann, Brady Brown, Stein Strindhaug, foophoof , Ernie Smith, Christopher Dickey, Andrey Tarantsov, Jeff M, Mitchel J. Mullin II, Matthew Razza, Trix Farrar, Marco Anastasi, Pavlo Pravdiukov, Howard Kraut, Mike Bailey, Matthias Dienelt, Yona , Fredrik Grufman, neko , Grayson Lang, Paul Virdone, Jeffery Grajkowski, Stefan Berndtsson, Michael Sims, Christopher Leidich, Sean Reigle, Mike Friedman, Andr Waage Srensen, Chris LeChien, fussel , Luc Ritchie, Eric Romero, Ryan Hardy, Ewen McNeill, Henrik Ripa, Shane Zamora, Alex Ilyin, Yorick Terweijden, Andrew \"FastLizard4\" Adams, Avi Drissman, Phil Taprogge, Pieter van der Eems, Brian Condron, Reto Jost, Vince Terranova, Andrew Montagne, David Scott, Brandon Enright, James Fialho, Christian Torelli, toasterking , Jason Boyles, Nick Pollard, Manalope , Andy S, Robert , Johan Greefkes, Jacob Dixon, Rob Kefford, Benjamin A., Nathaniel , Michel Sievers, Colin , MrHammond , Aaron Rennow, Countzero , Kodapan , Eli Krumholz, Guillaume Tremblay-Beaumont, Sha Nasti, Laria , Stephen Hinton, thegeoffreak , Jib Systems, Andrew Rosenwinkel, Grazer , Bob B, Mike Noe, Scott Rowland, Steve Kralik, Your name, Kirill Polstainen, Felix Winkelnkemper, BoostCookie , 98abaile , Owen O Byrne, Sebastian Sparrer, Matt Mullett, Andrew Bade, Paul Moffat, Max , Ryan Benson, Neil Forker, Vincent Beelte, Johnni Winther, Mark Hesse, Nathan Blubaugh, lululombard , Armando Fox, Nelson , William Evans, VilleS , Anton Afanasev, Kilrah , Ray , Liam O'Flynn, Petter Feltenstedt, Gideon Ritter, Oliver Lee, Lennart Sorensen, Mitch Radoll, Viorel , Reaghan Kekeis, lohphat , Vivian Pypher, Brandon Whiting, Robin Johnsen, Phia Westfall, Tom Rolfe, Jeremey Hastings, Mark Wayt, Arthur Robillard, Ramon Gamez, Garrett Rabenold, Vaughn B., Breunie Ploeg, Benjamin Cirker, Julien Oster, Jake Hickman, Trae Palmer, Lennart Rosam, Chris Wallace, Matt Shea, Jason Baker, Galimaufry, Michael Holmes, Kevin Hollywood, Trey Harris, Peter Pfundstein, Wilhelm Screamer, Alan Boyd, Mat Stu, Thomas Kolanus, Brett Morgan, Daniel Johnson, Potch , Reemt Rhmkorf, Robin Rattay, Bruce Justyn, Rae McIntosh, Justin D, Adam Zawisza, LordJakson , Triancia , Matthew Holder, Joshua Moncrieff, Max Barnash, Microfrost , Mitchell Schenk, Juan Olivares, Mike Bird, Emmett Ray, Michael Shaffer, Sputnik , Jason Spriggs, Gregory Kumpula, Zach Turner, Tom Burns, Daniel Pf, Yung Kim, John W Campbell, Matthew Jones, Slappy826 , Robert Howcroft, Some Random, Vince Batchelor, Peter Sarossy, Tracy Cogsdill, Matt Allaire, Guy , Will Hayworth, Benjamin Gott, Zach Le, Sean Fyles-Duggan, Fredrik strem, Anil Dash, Simon Safar, Michael Wileczka",
    "description_links": [
        "https://www.youtube.com/playlist?list=PLv0jwu7G_DFWBEyCKt4tKHIk8ez_pZS_P",
        "https://youtu.be/GuoFW2yAD7g",
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "In case you havent realized it by now, this channel is called Technology Connections because Ive always been fascinated by the way innovation happens. When we think up new things, were often just making a connection between a number of concepts and using those connections to achieve new goals. I also enjoy exploring the connections we humans have to technology itself such as how we interact with it and the way it changes our lives, or sometimes doesnt, despite monumental efforts. And today I have a device which fits neatly into both of these categories. And its not this. Youve seen the thumbnail and title. I know you know that, but first we must make a Technology Connection. The Compact Disc was a truly revolutionary product in a number of ways. First, it spins. Second, it brought digital sound technology to the masses. And third, it wound up being the first truly successful optical disc format, unequivocally proving the merit of the technology through finding applications in everything from sound, to video, to software. Sorry, Laserdisc, but being first isnt always best. Compact discs were a radical departure from the conventional audio storage technologies we had at the time. In 1981 you had your conventional vinyl discs, known as phonograph records -- Please. Never. Call this. \"A Vinyl,\" you heathens. It is a vinyl record -- as well as your tape formats, mainly the compact cassette but if you wanted to get reel fancy maybe youll have a reel-to-reel deck, too. Or perhaps youre clinging onto your 8-tracks like some sort of 8-track clinger. But in 1982 (more practically 1983) Sony and Philips released the fruit of their teamwork, the Compact Disc. See, its a disc, but smaller! And shinier. Using a laser, a photodiode, some focusy and tracky bits, a spoonful of signal analysis, a few quarts of quantization, some exciting error correction algorithms, a dash of data parsing and finally a delightful digital to analog converter (DAC), youll experience sound like never before. I made a bunch of videos about the compact disc which you can check out in that playlist. As time wore on and we got better at making the mechanisms which read the disc, we found we could make them more compact. Of course Sony had their famous Discman compact compact disc players, and so did everybody else, but along with smaller transports came ways to automate the changing of discs. In the late 80s CD changers started to appear on the market, many using magazines, with a particular niche establishing itself in the automotive world. The idea of setting up a sequence of discs to play one after another wasnt new at all, in fact for decades record changers were a thing. I also made a video about those! They were responsible for the record sets you might have come across which have their sides in a seemingly weird order. In fact, that order makes perfect sense for stacking changers. So, naturally, as CDs became more popular, CD changers became desirable. And the alternative to a magazine-based CD changer was the soon-to-be-popular carousel changer. With these, you can load up to five discs (usually) to be played one after another or even randomly, and some like this one even allow you to load new discs as the one its playing is playing. These work by placing the actual CD transport deep within the machine, and a specialized disc tray holds the discs on a motorized turntable. To change discs, the player simply releases the disc its playing and spins the turntable to move a new one into position. Then one day, somebody at Fisher thought to themselves \"Turntable! Tuuuurntable. Record players have those. What if\" and then this happened. This is a Fisher DAC-145, a very clever if a bit silly device. A combination 5 disc CD changer and standard phonograph. It seems to have been released in 1990, though I have found a reference to it as far back as 1988. It was also available as a component of the 9025 system; you might therefore find this device existing as a DAC-9025, but its the same thing. Now, Fisher Electronics began life as an American company manufacturing audio equipment. Founded by amateur violinist-turned philanthropist Avery Fisher in 1945, they specialized in hi-fi gear and were pretty significant in their early years. Among their accomplishments were the first solid state hi-fi receiver and also the precursor to the component systems this very product was a part of, introducing combination turntables and radio receivers. Their early products used the tradename The Fisher but at some point they dropped the The. Fisher the person sold the company to Emerson Electric in 1969, and apparently distributed a lot of the proceeds to his employees. Cool dude. Then in 1977, Emerson got bored with it and sold Fisher to Sanyo and from that point on, Fisher was a brand of Sanyo. At least until Panasonic then bought Sanyo, and now it seems they cant be bothered with the brand. Anyway, that means that really, this thing was made by Sanyo, and though I have admittedly not looked super deeply, I cant seem to find an equivalent Sanyo model so it looks like it was produced for the US-market only under the Fisher brand. Underneath the dust cover you will find a very bizarre looking layout. You have what is clearly a tone-arm to the right, and what looks to be another superlatively girthy tone-arm to the left. The turntable looks like nothing that could possibly belong in a record player, though. Its full of holes, and a bit bigger than it needs to be. But, no doubt about it, thats a turntable! Its got a silver spindle in the center, and we even have a space for your all-important 45 RPM adapter. You will find two buttons up here, a speed select button toggling between 33 and 45 ripms, and a mode selector button which toggles between the oh-so-fancily spelt analogue (very chic, very European) and CD. The power is on now, and if I unclip the tone-arm from its resting place, there goes the turntable. If I put a record on it, you can see that the record doesnt quite go to the edges. And you might also notice another glaring problem that well get back to. Every time you turn it on, it powers up in record playing mode, ready to play a record. In this mode, the players display simply shows the word uh-NAH-lo-guay to the right of a teeny tiny record player icon (it took me longer than I care to admit to realize that that wasnt just a stylized numeral 1) and of course it also indicates which speed it will spin at. Because this thing is in fact a functional phonograph. It even features automatic tone-arm return. How fancy. But of course, theres a lot more going on here. There are five spots for compact discs to go, complete with handy dandy labels. Now if you know a thing or two about compact discs, youll know that we should find a laser pickup mechanism of some sort under one of those cutouts. However, it appears we dont. I can spin this by hand quite easily, and nowhere do we find a lasers objective lens to cavalierly touch. Ah but hit that mode switch to switch into CD mode (annoyingly spelled in boring US english) and watch what happens. Nothing. OK but instead lets put a disc in the disc 1 position and now select disc 1 on the front panel and hit play. Now the turntable moves but in a slower and more deliberate fashion, and brings disc one near to the girthy tone-arm. Once it stops, that tone arm slides over the disc automatically, and as it does so we can see a little shutter move from under the disc, to the adjacent space. That exposes the transport hiding beneath, and the CD gets lifted up into the arms embrace. It starts spinning, and now witness the miracle of the Compact Disc. See, that tone arm wasnt really a tone arm. You probably knew that, but I appreciate the symmetry of the design here. The way these shoulders I guess flank the disc tray table is a nice visual touch. In reality the left arm contains the upper half of the CD transports disc clamp. See, aside from transports like these where you snap the disc onto the spindle, in general an optical disc transport will have a motorized spindle below the disc which spins it, and a receiving dead spindle above it which the disc gets sandwiched between. That helps ensure its centered correctly and can spin easily. And this is no exception. Most if not all tray-loading drives work this way. But unlike a conventional disc changer which has a fixed disc clamp and a spindle which moves up and down to grab hold of or release the disc, this machine moves both the spindle and the receiving clamp. This allows the entire CD mechanism to be completely out of the way for playing a record. The disc tray table can therefore be a literal turntable, and all it takes to make that play a record is a tone-arm and a phonograph cartridge. Oh but not so fast, already we have a bit of weirdness to explain. Every other carousel changer out there doesnt need to bother with moving the carousel at all gracefully. It can be a sloppy ol plastic gear train with a terrible motor and horrible bearings, and so long as it can move well nothing else really matters. But if you plan to use the carousel as a phonograph turntable too, that aint gonna cut it. You need it to move very smoothly so you dont get flutter from the record. And so, this is in fact made like a proper turntable. You can actually remove the disc tray, or, I guess, platter simply by pulling up on it and you'll reveal that its driven by a belt much like many record players out there. They even provide a rear access hole to help with changing the belt. And this makes it even more intriguing. See, every other record player just needs to spin the turntable at two maybe three speeds . But this one cant just spin it, it also needs fine control to turn it slowly and stop it correctly for the CD mechanism. Which of course means that the device needs some way to know the absolute position of the turntable as well. Thats done through these index markings which ride between an LED and photodiode beneath the platter. Each disc position has a unique pattern, allowing it to know in as little as one fifth of a rotation exactly where it is, and I suspect it also uses these markings as feedback for the speed of the platter when playing a record. Its actually quite a shame that Sanyo chose not to support 16 RPM records as it seems totally possible given the wide range of control it has over turntable speed and position. And yes, it does in fact use the turntable motor and belt drive to turn the tray table in CD mode. If you noticed these gears near the center, those are simply for returning the tone arm. There's a bit of an odd quirk, though. You might have caught that something engaged when it switched into CD mode. Listen carefully. [clunk occurs right before tray starts to move] And youll also notice that rather than spinning freely, theres a click now as each CD position passes the reader. That definitely wasnt there when it was playing a record. This was puzzling to me until I tried engaging CD mode with the plattertray removed. This little nubbin thing moves outward, thats what we hear being engaged, and youll find that it rides against this ridge which has an indentation at each position, causing that click. Im not entirely sure what the purpose of this is exactly. It may be simply to provide mechanical alignment with the tray table to ensure it stops in the full upright position, but if thats its task it doesnt do a great job of it. Youll see that as the CD reader lifts up it nudges the platter tray a bit, so clearly it didnt stop exactly where it should have. My other leading theory is simply that it needs to add some resistance in order to be able to stop it precisely. With the belt removed you can see that, thanks to a decent bearing design, the disc platter spins with very little resistance as any decent turntable should, and perhaps thats just too loosey-goosey for the precision world of Compact Disc. Oh, and Im sure many of you want to know this; Can you leave CDs in place and play a record? Why, of course you can! Records sit quite a bit higher than the CDs so you can leave as many CDs on there as you like and still listen to your vinyl. See, thats an appropriate use of the term \"vinyl\", you can have a collection of vinyl, but individual discs are not vinyls, GOT IT? Anyway, I must say that the sight of five CDs going for a spin at 45 RPM is mighty hilarious. You might also wonder what happens when you try to play one of those CDs while a record is still on the turntable. Well, because the record sits so much higher, as the CD player arm attempts to move into position, it slams right into its edge and cant move. After realizing the mechanism never made it to its final destination in time, it reverses the direction, gives up, and switches back to analogue mode. No harm no foul. Oh, and, by the way you dont have to press the mode selector button to switch it into CD mode. It will do that whenever you select a disc with the front panel, so its not like if you leave some CDs up there youll have to open the dust cover every time you turn it on. And, well, it will also switch back to analog mode whenever you move the tone arm out of its park position so in fact that button up there is completely redundant. I must admit this device is quite clever, and a delight to behold. I mean, ten-year-old me would be thrilled to see a CD spinning in the air like that. Thats objectively cool on its own. So much so that Fisher sold variants of this model which couldn't play records and were instead just unique CD changers. That probably explains these gear teeth under here that dont engage with anything at all on this model. On those other models, including the DAC-143 and its component system brother the DAC-9115, there's probably a gear engaged with those teeth to spin the tray. Interestingly, those models place the upper clamp in a fixed position and move the CD mechanism to the center-rear. Sadly they made the clamp much larger, so Im not sure how much of the disc is actually visible while it's playing, if any. But notice that the clamp extends over the center of the disc tray, likely to hide that center spindle which I suspect is *absolutely* still there and that its the same exact part, minus the rubber feet which grip the record. Which, appropriately, leads us neatly into the discussion about this devices merit. Just because an idea is clever or cool doesnt mean its useful or even good. As a CD player, this is perfectly fine. It has all the features of any other 5 disc changer, including the ability to change discs while another is playing because well theyre all right there. Just... just grab one and swap it out. As far as sound quality, well youve only got standard RCA jacks for output so youre stuck with its internal DAC, but honestly aside from hardcore audiophiles thats not gonna bother anyone. Your average person with a HiFi is gonna hook their CD player up this way, doesnt even know what TOSLINK is, and will be perfectly dazzled by this marketing babble. I mean, who wouldnt want an 18-bit 8 times oversampling digital filter and dual 16-bit linear high speed D/A converters? As a record player, though ehh its not fantastic. So, first; grip. That's the problem I referenced a long time ago when you saw this. There is hardly any contact between the turntable and the record. Its just these five little feet, and this rather small center puck thing which, by the way, is itself not solidly attached to the turntable. Pretty much any record is gonna slip when the turntable starts and stops, and some like this picture disc do so an almost alarming amount. Now, in fairness, thats generally not harmful to a record as the sound is in the grooves not on them, but it means that the record itself is pretty much the only thing providing noise and flutter isolating mass. Even if it had a really nice grip, the turnplatter is itself very light, and the entire device is, too. This is not prosumer gear by any stretch of the imagination. Its cheap. But, as many of you may know, I dont get along all that well with audiophiles because I say things like this; it sounds fine, though. Yep, I have but one complaint, honestly, about its sound - the cartridge is a little tinny and could use better bass response. But I dont hear any flutter, the speed is correct, and clarity is perfectly fine. I wouldnt mind this being my only way to play a record. Go ahead and revoke my audiophile card, I didnt want it anyway. Want a sample? Well, thanks to Anders Enger Jensen we have one right here; [electronic music fades in; Discovision] \"Now I'd like to show you some of the valuable things your MCA Discovision system lets you do\" \"Most persons find it more convenient\" \"Gently pull up as you press down on the center cap with your thumb\" \"You'll hear a click\" [instrumental portion] Here it is loaded up with 5 CDs, too. \"h-h-h-how 'bout that, pretty easy isn't it?\" [another instrumental section] \"D- D- D- D- Discovision!\" \"This red light comes on, simply press STOP\" And now just with two CDs on one side. \"After I've stopped the action, you're going to practice using these buttons\" \"The Discovision player gives you many special capabilities\" \"Stop Play Slow; forward and reverse\" \"Imagine a dog chasing a rabbit around a tree\" \"How can you get there in a hurry?\" [instrumentals resume, then speed suddenly changes] Oh right, that. Ahh, this unit is a bit faulty in a couple of ways. One is that the switch which activates the turntable when you move the tone arm is a little messed up, and rather frequently it thinks youve put it back for a brief moment leading to [music fades in, then slips drastically] that. The other thing is that in CD mode it rather frequently gets stuck in this loop where it stops at the correct disc, but then decides it should go for another spin. It can do this up to a dozen times before it finally decides to engage the transport. Luckily, once its done that, it doesnt have a problem going from disc to disc as it leaves the upper clamp in position. But anyway, back to the real problem with this thing. Who is this for? What problem does this solve? Consider that by 1990, conventional vinyl records were pretty close to over. Yes, they never went away and have seen quite a resurgence in the last decade and a half, but there was a time when they werent fashionable at all and the early nineties through to the early aughts was that time. It was compact disc for the home, maaaaybe cassettes for the car, and vinyl for your grandparents. If you had a collection of vinyl already, well then you almost certainly already had a turntable! So, when it came time to get with it and buy a totally rad CD player, you didnt need another turntable so this device has no appeal to you. Theres a small potential argument for space savings, but its not like a CD changer was a mandatory item. Yes, they were quite popular, and Id imagine for a time they represented the majority of HiFi component sales, but if you were sensitive to space requirements you would probably forgo that option and get a smaller single-disc player. Heck, you could even get a Discman and save even more space, plus get a portable player, too. Also, this thing is not small by any stretch - tons of much better turntables are nowhere near this big. And finally, if youre buying a component system, space is clearly not a huge problem for you anyway. But it is very neat. And I suspect that made for a meaningful point of differentiation for shoppers looking at entirely new HiFi systems. If youre building a system from the ground-up, then this device is quite logical in addition to dazzling. I do however wonder how many people looking for a new system in 1990 even cared about being able to play records. One of the many reasons I wish I had a time machine. But I can say that from personal experience, records were not a thing in my childhood. The first time I ever played one was in middle school, and me and this device are in the same ballpark of age. Regardless, although I suspect the venn diagram overlap between new system shoppers, five-disc CD changer seekers, and people who still wanted to play records in 1990 was pretty small, to people in that niche its an excellent option, though with a compromised turntable (not that my ears are good enough to care). However, I must add here that I think Fisher really missed the mark by not including a pre-amp for the record cartridge. It has two separate outputs for the CD player and the phonograph, and because theres no preamp you need an amplifier with a dedicated phono input. Of course, the component system this belonged to had one, and they were common at the time, but I still think it was a miss. It forces you to change the amplifiers input when you switch between modes when that could have been solved in the device itself. On a holistic level though, this device is clearly one of those things that, while it could be done, didnt need to be done. It doesnt really solve a problem and while Im sure its not like the R&D costs to build it were tremendous, I do wonder if Fishyo took a loss on it. The CD transport mechanism in this model is unique to it, as it uses a single motor and gear train to move the arm, shutter, nubbin thing, and transport up and down. I know because I had to deal with its belt that had gone to goo. Maybe thats easier to design and manufacture than I imagine, but my business sense tells me that the ROI on this was was probably pretty weak. And the derivative models that shared this design but couldnt also play records were bad CD changers. Again, novel, but who wants to need to access it from the top? This model gets away with it because thats just how record players do but forcing that design onto a CD-only player... is dumb. The entire reason VCRs went from top-loading to front loading was because people like to put things on top of other things. And so, in a HiFi, the record player usually ends up on the top. With this design, you really couldnt also have a record player unless you had a wide-enough space to put them side by side. Or you, just for fun, had a tray-loading record player and this top-loading CD player. Which, lets be honest, is totally something I would do. But anyway, again, I find myself back to saying that while this is a Certifiably Neat HiFi Gadget, it fails to actually solve a problem in a meaningful way. That meant that of course it had a small target market. Its mainly just flashy. And while Fishyo definitely made a good call by adapting the core design into multiple models to spread the development costs out, those models themselves required their buyers to value flashy design more than they do practical considerations. This is a very frustrating device to me. Upon first glance you think, oh wow, what a neat idea! and on second glance you see it in action and go Woah, thats so cool! (when it works) But when you start to look at it objectively, it makes less and less sense. I would totally love to get it working properly and use it in my main HiFi system because who wouldnt want to see this whenever you play a CD, but I dont like the record players cartridge (though I suppose that could be changed) and I also just dont particularly care for its design otherwise. Its... it's too busy, visually, and I really cannot stand the layout of these transport buttons. Like, at all. I hate how small stop is, and that its between track forward and back. Ugh, its just so bad. Im also not a huge fan of its display. This is certainly 100% personal preference territory, but while I of course love the fact that its a vacuum fluorescent display (and am happy its clear and bright on this example) I dont really like how its laid out. Track time elapsed is really small, though I appreciate that you can change it to time remaining among other settings with the display button. Though, I really dont like how the default state insists on leaving the word \"each\" floating over there. And while I commend Fisher for bothering to put an index display next to it, I actually think it makes the design too busy and they should have just left it out. The index, for those unaware, is a subdivision of a track which was extremely rarely used in CDs so this will read \"01\" essentially forever, and therefore I think it would be better to just... make it go away. Or at least, they should have had the time display the same size as the disc and track indicator. Ehhh.. I just dont like it. But am I getting rid of this? No! Its just way too cool. I mean, I love the idea of combining devices like this and think that it's done in an extremely clever way here. One day I will fix that switch and will get this going in a secondary HiFi system or something because it is certainly a treat to use, despite my qualms with it. But Im also not afraid to say that on the whole this wasnt the best idea out there. Im glad it exists, and that I get to share this fun novelty with you, but its easy to see why this didnt exactly take the world by storm. It was just too niche, too late, and full of compromises. Thanks for watching, and a big thanks to AmEv7Fam on Twitter for bringing this device to my attention. I had no idea these were ever made, and find the concept absolutely fascinating. If mostly questionable. Im willing to bet, though, that this device is just waiting for its own renaissance. Ive thought for a while now that it wont be too long before the CD gets the same resurgence that vinyl and lately the cassette have enjoyed. If and when that happens, maybe this is gonna make more sense than it ever has. combinational smooth jazz The compact disc was a truly revolutionary product in a oh I should totally be holding one And third, it would end up.. Ehh bibuduh It would up Wound up! Underneath the dust cover you will find a very creaky dust cover Well, because the record sits so much higher ah Fah theres a comma! This thing is in fact Because this thing is in fact a functional phonograph. Even though its not behaving right right now. Because this thing is in fact a functional phonograph. [laughs] Ugh! Why is it doing this now? Ok, were gonna turn you off and on again. Did you notice how I said \"rather frequently\" twice within like three sentences? I certainly did, but of course not during the MULTIPLE days of script work and revision. Only during the video edit, when it was way too late. So it goes.",
    "transcript_keywords": [
        "Disc",
        "Compact Disc",
        "record",
        "record player",
        "turntable",
        "compact compact disc",
        "discs",
        "player",
        "compact disc players",
        "Fisher",
        "Compact",
        "disc tray",
        "thing",
        "time",
        "play records",
        "records",
        "device",
        "called Technology Connections",
        "play",
        "mode"
    ],
    "transcript_entity_values": [
        "TOSLINK",
        "one day",
        "third",
        "1988",
        "half",
        "Second",
        "1",
        "the last decade",
        "as little as one fifth",
        "the early nineties",
        "1990",
        "a few quarts",
        "American",
        "Sony",
        "ten-year-old",
        "HiFi",
        "Fisher Electronics",
        "the Compact Disc",
        "1977",
        "two",
        "DAC-143",
        "between 33",
        "1983",
        "8",
        "the early aughts",
        "European",
        "Fah",
        "Emerson Electric",
        "three",
        "decades",
        "1981",
        "five little feet",
        "today",
        "RCA",
        "18-bit",
        "Fishyo",
        "venn",
        "DAC-9115",
        "45",
        "Avery Fisher",
        "100%",
        "Fisher",
        "US",
        "Anders Enger Jensen",
        "the MULTIPLE days",
        "first",
        "Compact Disc",
        "Discman",
        "Fisher",
        "one",
        "Stop Play Slow",
        "Technology Connections",
        "a Technology Connection",
        "up to five",
        "MCA Discovision",
        "5",
        "Sanyo",
        "secondary",
        "their early years",
        "1945",
        "16",
        "Emerson",
        "1982",
        "Fisher DAC-145",
        "One",
        "five",
        "english",
        "Discovision",
        "Panasonic",
        "First",
        "second",
        "Twitter",
        "1969",
        "the late 80s",
        "Philips",
        "9025"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "DATE",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "TIME",
        "NORP",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "NORP",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "PERSON",
        "GPE",
        "PERSON",
        "DATE",
        "ORDINAL",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "LAW",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "LANGUAGE",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.09084830433130264,
        -0.10873626917600632,
        -0.02126658894121647,
        -0.12447568029165268,
        -0.04706806689500809,
        0.07244297116994858,
        0.0577629953622818,
        0.0445081852376461,
        -0.016998035833239555,
        0.052263230085372925,
        -0.04220518097281456,
        0.03885730355978012,
        -0.027882356196641922,
        -0.004152801353484392,
        0.007113343570381403,
        0.0017801730427891016,
        -0.014292054809629917,
        -0.01436132937669754,
        0.02162644825875759,
        -0.006487466860562563,
        -0.01848530024290085,
        -0.05690062418580055,
        0.022032395005226135,
        -0.016969291493296623,
        -0.048724040389060974,
        0.06274919211864471,
        -0.04497664421796799,
        0.03259669616818428,
        -0.04027991369366646,
        -0.06366338580846786,
        -0.03013595938682556,
        0.11940528452396393,
        -0.00567347789183259,
        -0.024702386930584908,
        -0.008472125977277756,
        -0.04183446615934372,
        0.024976255372166634,
        -0.014136619865894318,
        -0.05839810147881508,
        -0.03008878231048584,
        0.0206953976303339,
        0.014859325252473354,
        0.04300808906555176,
        0.08296938985586166,
        -0.08934064209461212,
        -0.03582414612174034,
        -0.04629847779870033,
        -0.041987594217061996,
        -0.022077972069382668,
        0.046254903078079224,
        -0.06838909536600113,
        -0.007460115477442741,
        0.10659194737672806,
        0.026577096432447433,
        -0.03129371255636215,
        -0.030414847657084465,
        0.054927289485931396,
        0.031047334894537926,
        0.053784213960170746,
        0.02956024743616581,
        0.014567270874977112,
        -0.100655198097229,
        -0.029614398255944252,
        0.022618256509304047,
        -0.009713671170175076,
        -0.042234886437654495,
        0.003624869277700782,
        0.09548719227313995,
        -0.0038978024385869503,
        -0.030348628759384155,
        -0.024619005620479584,
        0.07004954665899277,
        0.017222344875335693,
        0.03204541653394699,
        0.051462408155202866,
        -0.029069658368825912,
        0.037699729204177856,
        -0.023848893120884895,
        0.05611128732562065,
        -0.015472760424017906,
        0.05412263795733452,
        0.05859675630927086,
        0.02151503786444664,
        -0.10543165355920792,
        -0.014316274784505367,
        0.015866661444306374,
        -0.04129138961434364,
        0.010935183614492416,
        -0.04710410535335541,
        -0.02479732781648636,
        -0.06538422405719757,
        0.08002711832523346,
        0.051940638571977615,
        -0.019213827326893806,
        -0.014503385871648788,
        -0.01741950213909149,
        0.03067655861377716,
        -0.06631746143102646,
        -0.004218189977109432,
        0.06341550499200821,
        0.032920703291893005,
        0.04894983768463135,
        -0.001727793482132256,
        -0.03258053958415985,
        -0.07534925639629364,
        -0.07874448597431183,
        -0.015986360609531403,
        0.07465372234582901,
        0.05457792431116104,
        -0.01994042657315731,
        -0.08934885263442993,
        0.05588502436876297,
        -0.05575425550341606,
        -0.05333814397454262,
        -0.03947900980710983,
        -0.010081709362566471,
        -0.05689143389463425,
        0.12017782777547836,
        -0.013557778671383858,
        -0.05643400549888611,
        -0.0018560559256002307,
        -0.06581245362758636,
        -0.06209572032094002,
        -0.005255396012216806,
        0.06386939436197281,
        -0.0664186030626297,
        -0.019173363223671913,
        8.979421348358985e-34,
        0.0575069934129715,
        0.026199501007795334,
        0.010983366519212723,
        -0.008925571106374264,
        0.06920020282268524,
        -0.09819886833429337,
        0.01787921041250229,
        0.02237769216299057,
        -0.11243203282356262,
        0.0315789058804512,
        0.0005880458629690111,
        0.0707940012216568,
        -0.09458471834659576,
        0.06190958619117737,
        0.02452627196907997,
        0.0069114649668335915,
        -0.1526668220758438,
        -0.038903459906578064,
        0.01843961887061596,
        -0.09624096006155014,
        0.02236824668943882,
        0.023840568959712982,
        0.06643162667751312,
        0.06468700617551804,
        0.03554587438702583,
        -0.0019307697657495737,
        -0.03660908341407776,
        -0.0021718426141887903,
        0.15472839772701263,
        0.02423824742436409,
        -0.05360754579305649,
        -0.05092331022024155,
        -0.0018705849070101976,
        -0.09936694800853729,
        0.07970603555440903,
        0.03740265220403671,
        -0.11328393965959549,
        -0.08410191535949707,
        0.023093368858098984,
        -0.0067105828784406185,
        -0.016168829053640366,
        0.03837961331009865,
        -0.0535699836909771,
        0.015419014729559422,
        -0.023257369175553322,
        -0.027120426297187805,
        0.09176404029130936,
        -0.0011713131098076701,
        0.019936110824346542,
        0.03907335177063942,
        -0.036793019622564316,
        0.027650559321045876,
        -0.0485181100666523,
        -0.041903045028448105,
        0.030957190319895744,
        -0.03948972746729851,
        0.04922133684158325,
        0.0350816436111927,
        -0.010875081643462181,
        0.021003160625696182,
        0.0684065893292427,
        -0.006691404152661562,
        -0.007174606900662184,
        -0.025083208456635475,
        -0.10682322084903717,
        0.08856889605522156,
        0.05722198635339737,
        -0.05380342900753021,
        0.0846703052520752,
        -0.03883277624845505,
        -0.026305455714464188,
        -0.05292727053165436,
        -0.024633249267935753,
        -0.08960026502609253,
        0.010233931243419647,
        0.05175923556089401,
        -0.04503708705306053,
        -0.045222360640764236,
        0.0018189288675785065,
        -0.026361707597970963,
        -0.0334148108959198,
        -0.031899549067020416,
        -0.09964131563901901,
        0.08239887654781342,
        -0.01098669320344925,
        -0.029697509482502937,
        -0.003707446390762925,
        -0.08179929852485657,
        -0.04526679217815399,
        0.00353549188002944,
        0.005928487051278353,
        -0.014301068149507046,
        0.006652758456766605,
        0.08807988464832306,
        0.026224158704280853,
        -2.2381425296625816e-33,
        0.0035770165268331766,
        -0.010824846103787422,
        0.022447526454925537,
        0.000876458128914237,
        0.03052402473986149,
        -0.05736355111002922,
        0.03816186264157295,
        0.06762410700321198,
        0.08747551590204239,
        -0.018568361178040504,
        0.008164736442267895,
        0.024179887026548386,
        -0.07992206513881683,
        0.007262821309268475,
        -0.10420180857181549,
        -0.07033844292163849,
        0.02478448860347271,
        0.07691407948732376,
        0.020922962576150894,
        -0.015282788313925266,
        0.0770600438117981,
        0.07917749136686325,
        0.0117605896666646,
        -0.004768561106175184,
        0.004007231444120407,
        0.02801867574453354,
        0.047097355127334595,
        0.020561140030622482,
        0.044984765350818634,
        0.03710506483912468,
        0.05961206182837486,
        -0.03762331232428551,
        0.0009674601606093347,
        -0.06394444406032562,
        0.022260533645749092,
        0.005896944086998701,
        0.15686851739883423,
        -0.00317548681050539,
        -0.10848630219697952,
        -0.07659315317869186,
        0.04117954894900322,
        0.04947715252637863,
        -0.05344937741756439,
        -0.007489007897675037,
        -0.008635073900222778,
        -0.006173684727400541,
        -0.01566406711935997,
        0.0694359540939331,
        -0.0705963745713234,
        0.032648615539073944,
        0.01933964341878891,
        -0.025663746520876884,
        0.04878038913011551,
        -0.07239353656768799,
        -0.0030334144830703735,
        -0.0029881636146456003,
        -0.0015054949326440692,
        -0.022576797753572464,
        0.018767043948173523,
        0.07358450442552567,
        0.0033240639604628086,
        0.060677967965602875,
        -0.02276541106402874,
        -0.006365914363414049,
        0.021906336769461632,
        0.029598232358694077,
        0.08120439946651459,
        0.11798591166734695,
        -0.05002480000257492,
        0.03187107294797897,
        -0.058482833206653595,
        0.03479480370879173,
        0.00879641529172659,
        -0.045043278485536575,
        -0.04783669859170914,
        -0.014854716137051582,
        -0.08159855008125305,
        -0.021110493689775467,
        -0.021858876571059227,
        0.02755243331193924,
        -0.0985565111041069,
        0.0066063133999705315,
        0.021838033571839333,
        0.0027583125047385693,
        0.07516685128211975,
        0.139971062541008,
        0.1258208006620407,
        -0.01766807772219181,
        -0.037187717854976654,
        0.028112271800637245,
        0.02365119196474552,
        0.020115265622735023,
        0.04988293722271919,
        0.07399681210517883,
        0.01100129820406437,
        -5.544293557591118e-08,
        -0.021120022982358932,
        0.02077602967619896,
        -0.028231481090188026,
        -0.04065822809934616,
        -0.0008318998734466732,
        -0.049554385244846344,
        0.03126770630478859,
        0.013297167606651783,
        -0.008913364261388779,
        0.04152596369385719,
        0.0788097083568573,
        0.0039752814918756485,
        -0.01045342069119215,
        0.007028433494269848,
        0.08748757839202881,
        0.05944916605949402,
        -0.031308628618717194,
        0.02817496843636036,
        -0.08090399205684662,
        -0.020679373294115067,
        0.01603231392800808,
        -0.0008663369808346033,
        0.10834814608097076,
        0.00027686147950589657,
        -0.002123087178915739,
        0.018426116555929184,
        -0.0017500740941613913,
        0.015882084146142006,
        -0.022367848083376884,
        0.00689207948744297,
        -0.05738842859864235,
        0.02852233313024044,
        -0.018720149993896484,
        -0.016983259469270706,
        0.03930061310529709,
        -0.05333496630191803,
        -0.06428650766611099,
        0.011311138048768044,
        -0.003504666965454817,
        0.033757470548152924,
        -0.05460668355226517,
        0.02220650389790535,
        -0.0341038852930069,
        0.06958842277526855,
        0.037383850663900375,
        0.03380472585558891,
        -0.07214155048131943,
        -0.0066576795652508736,
        -0.00782865285873413,
        -0.005455471109598875,
        -0.0450768917798996,
        -0.032233864068984985,
        -0.0743466392159462,
        -0.015701282769441605,
        0.04612354561686516,
        0.05847452953457832,
        0.014787660911679268,
        0.1098473072052002,
        -0.04816005751490593,
        0.038919638842344284,
        0.017085392028093338,
        -0.09883701801300049,
        0.0047433641739189625,
        0.06615465134382248
    ]
}