{
    "id": "BXogn99dOec",
    "title": "Google Pixel 3 event in 12 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-10-09T18:12:20Z",
    "video_url": "https://www.youtube.com/watch?v=BXogn99dOec",
    "category": "Science & Technology",
    "tags": [
        "google",
        "pixel",
        "google pixel",
        "pixel 3",
        "google pixel 3",
        "pixel 3 xl",
        "pixel 3xl",
        "3 xl",
        "pixel 3 review",
        "pixel review",
        "pixel xl",
        "pixel 3 xl review",
        "pixel 3 xl rumors",
        "google pixel xl",
        "smartphone google event",
        "google phone",
        "google pixel 2",
        "google io",
        "google home",
        "event",
        "io",
        "hands on",
        "first look",
        "price",
        "new phone",
        "phone unboxing",
        "new phones",
        "technology",
        "gadgets",
        "gadget",
        "tech",
        "new tech",
        "is it worth it",
        "processor",
        "review",
        "latest updates",
        "how can i",
        "apple",
        "android",
        "iphone",
        "verge",
        "the verge"
    ],
    "views": 1322860,
    "likes": 13114,
    "comments_count": 2074,
    "description": "Months of leaks were finally confirmed at the Pixel 3 event today in New York City where Google just unveiled its newest flagship Android phone and a few new devices, including the Pixel Slate and Google Home Hub. Unlike a typical Google event, the company announced its new lineup at the top of the hour and made the products immediately available for preorder before the event even concluded.   Director: Alix Diaconis Director of Audience Development: Ruben Salvadori Social Media Manager: Dilpreet Kainth  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- So this year marks Google's 20th anniversary. So let's talk about what we've been workin' on. First, for life on the go, we designed the world's best camera, and put it in the world's most helpful phone. Introducing the beautiful new Pixel 3. For life at work and at play (laughs), we're bringing the power and productivity of a desktop to a gorgeous tablet called Pixel Slate. And for life at home, we designed a smart display so you can hear and see the info you need and manage your connected home from a single screen. Introducing Google Home Hub. (audience whoops) And here they are, comin' up here in the pedestals for the first time, seen in real life. - Let me tell you about how we've reimagined Google for the home. With Google Home Hub, we've redesigned Google's most helpful services like Search, YouTube, Maps, Calendar, and Photos so they're easily controllable with your voice and provide glanceable help. You can also choose from four beautiful colors to complement any room. We also consciously did not put a camera on Hub so that it was comfortable to use in the private spaces of your home like your bedroom. We wanted to make sure that Hub is not a bright, glowing screen in your home. So we made sure that Hub can respond automatically to the ambient light in the room. Finally, we also wanted Hub to be a communal device, one that works for everyone in your home. So let me call up Mark, one of our product managers, to show you Hub in action. - With Hub, I can just say, hey, Google, good morning. - [Google Hub] Good morning, Mark. The time is 9:00 a.m. Currently, in San Francisco, it's 64 and sunny. The best way to get to work by car is via US 101 South, then will take 45 minutes. There are 11 entries in your calendar. By the way, remember to pick up eggs for dinner tonight. - Because Hub recognized my voice, it tells me everything I need to know while I'm finishing up my cup of coffee. You can simply use your voice to get help in the kitchen. You can set multiple timers. You can find out how many ounces are in a cup. You can even figure out what to cook for dinner tonight. Now, I'd like to tell you a little bit more about YouTube on Hub. The YouTube experience has been optimized so I have access to a ton of how-to videos, just by using my voice. With YouTube music, you can easily find the perfect song, video, or artist. Through December, Hub comes with six months of YouTube Premium on us, including ad-free videos and our new YouTube music streaming service. But sometimes, it's really hard to disconnect and enjoy time with friends and family. Hub can help with that, too. Just put Hub into Downtime Mode, and it won't interact with anyone in the house except for those critical things like alarms. With filters, you can assure that everyone in the home is enjoying family-friendly content. - You can even see the state of your entire home at a glance. With Hub, we're introducing Home View. With a swipe down from the top of the screen, you can bring up a simple Dashboard. The Dashboard shows you the state of your entire home at a quick glance so you can turn down the temperature in the bedroom and turn up the music in the living room. And we're providing the same level of control even if you're not near your Hub. We've redesigned Google Home App to be the mobile controller for your smartphone. It has the same Home View Dashboard as Hub. So now, you can control all your devices from any phone, even when you're not at home. So we made sure that Hub was deeply integrated with Nest devices, like Nest Camera, Nest Thermostat, and even Hello Doorbell. So, for instance, if you're having dinner, and someone happens to ring your doorbell, (doorbell rings) Hub will automatically show you the front door. And you can tap a quick response or use your voice to let your guest know that you'll be right there. Home View lets you control over 200 million devices from over a thousand brands, many of them in your home today. So now, with a simple tap or with your voice, you can control your Dish Hopper DVR, your Chromecast, your Vizio TV, and even your Philips Hue light bulb. You can pre-order Google Home Hub on the Google Store today for $149, and it's also available on October 22 at retail locations here in the US, UK, and Australia. - Last year, Chrome OS took a big step forward with the introduction of apps from the Google Play Store. And also with the introduction of helpfulness from the Google Assistant. And today, we're sharing a new chapter for our vision for Chrome OS with the launch of Google Pixel Slate. - We designed Pixel Slate to be both thin and light. It's crafted with beautiful lines and rounded edges in a stylish midnight blue. Pixel Slate is engineered with a stunning detail display, so sitting back to enjoy a movie is better than ever. It has 293 pixels per inch. That's six million pixels, for the sharpest picture in the category. So with Pixel Slate, we've positioned the speakers on the front of the device so they can direct stereo sound towards you. It's also a great device for cord cutters, and nothing brings this to life better than YouTubeTV. We're excited to give you three months of YouTubeTV with the purchase of a new Pixel Slate or Pixelbook. We're bringing some of that same innovative engineering to Pixel Slate's eight megapixel front-facing and rear-facing cameras. We've also designed the front-facing camera to be perfect for video chat. It has a wide-angle lens so you can fit everyone in the frame and a sensor with larger pixels which allows for excellent low-light performance. Check out the reconfigured launcher. Instead of hunting for the app you need, machine learning customizes the launcher just for you. You can easily multitask with features like Split Screen, which lets you seamlessly shift between work and play. And now with Pixel Slate, the Google Assistant is even more deeply integrated within Chrome OS. Simply use your voice, and the Assistant can help you find a restaurant, dictate an email, or play your favorite show. Pixel Slate's power button doubles as a fingerprint sensor, so you can unlock it just as quickly and securely as you do your Pixel Phone. The keyboard connects to Pixel Slate in a snap. No pairing or charging needed. Just connect it, and start typing. The folio is infinitely adjustable so you can comfortably use it an any angle you like. Pixel Slate comes in several configurations, starting at $599. Pixel Slate Keyboard is $199, and Pixelbook Pen, now in matching midnight blue, is $99. All three will be available later this year on the Google Store and at major retailers in the US, Canada, and the UK. - Finally, it's time to talk about phones. (audience applauding) Google Pixel 3 is designed from the inside out to be the smartest, most useful device in your life. - [Man] Pixel 3 comes in three colors, Just Black, Clearly White, and a new color, which is not pink. - The new Pixel comes in two display sizes. The 5 1/2 inch Pixel 3 and the 6.3 inch Pixel 3 XL. Both of 'em share the same features, but we know users who want a bigger phone really want a bigger screen. So we designed Pixel 3 XL's screen to extend all the way to the upper corners. - Our front-firing stereo speakers are 40% louder and richer than last year. Pixel 3 is the first phone that shifts with the new YouTube music streaming experience, and we're giving it to Pixel owners on us for six months. - Everyone raves about the Pixel camera, and today, the smartest camera gets even better with the Pixel 3. You can still miss the perfect shot if you don't hit the shutter at exactly the right moment. Top Shot solves that problem. Top Shot automatically captures alternate shots in HDR Plus. So if your timing wasn't perfect, it'll suggest a better one. You can also scroll through the alternates and save one of those instead. - And then, there's Super Res Zoom. Instead of shooting a grainy photo, Pixel 3 shoots a burst of photos, each a bit different, taking advantage of the natural tiny movements of your hand. You can guess what happens next. You run the variations through a merging algorithm to create a beautiful zoomed-in shot, so you can get closer to the details and frame your shot the way you want. - Another feature that we're really excited about is Night Sight. Night Sight works so well, you'll never use your flash again. In extreme low light, we turn to machine learning to choose the right colors based on the content of the image. - So we added a second camera on the front that captures 184% more of the scene than iPhone 10S. The difference is striking. You aren't just getting more people in the frame, you're getting more details. - We've evolved AR stickers to what we now call Playground and built it into both the front and rear cameras. - This year, we integrated Google Lens directly into the Pixel 3 camera. Point it at a takeout menu, and Lens will pull out the phone number to call. Point at a movie poster to click through to the URL. So now, when your friend's wearing a cool new pair of sunglasses, or you see some shoes you like in a magazine, you can use Lens to find them online and browse similar styles. - So here's a quick list of some of the other features you'll see in our demo area later. - Photo Booth Mode automatically snaps photos with a smile or when you make a funny face. No shutter button needed. - With Motion Auto Focus, just tap on people, puppies, or anything else that won't hold still, and they'll stay in focus as they move around the frame. And one of the best aspects of Pixel 3 is free unlimited storage at original quality. You'll never have to worry about storing, syncing, or finding your photos. And we're going even further to help you with phone calls with our new Call Stream Feature. When you get that call, and you can't or don't want to pick up, just tap the screen call button, and your phone will answer for you and ask who's calling and why. As you can see here, the conversation is transcribed in real time on your screen. Call Screen launches today with Pixel 3 in the US and comes to the entire Pixel family next month. - So we've developed a feature we call Flip to Shhh, an easy gesture to minimize distractions. Just turn your phone upside down on the table, and your Pixel will take the hint and mute sounds and notifications. - We're excited to introduce the smartest wireless charger ever, the new Pixel Stand. It charges your Pixel 3 super fast, even through cases. - Pixel 3 is available for pre-order now, starting at $799. And Pixel Stand is $79. Pixel 3 will arrive on October 18 in the US through Verizon, and unlocked on the Google Store in Project Fi. On November 1, it will be available in 12 more markets, including four new ones this year, France, Ireland, Japan, and Taiwan. Head over to our fresh, new online store at this address behind me for full details, pricing, and availability. I really appreciate you being here with us today. Thank you very much. Have a great day.",
    "transcript_keywords": [
        "Google Home Hub",
        "Pixel Slate",
        "Pixel",
        "Google Pixel Slate",
        "Hub",
        "Google",
        "Google Home",
        "home",
        "Home Hub",
        "Google Pixel",
        "Slate",
        "designed Pixel Slate",
        "Pixel Slate Keyboard",
        "Google Store",
        "Introducing Google Home",
        "Google Home App",
        "called Pixel Slate",
        "Pixel Slate power",
        "Home View",
        "Pixel Stand"
    ],
    "transcript_entity_values": [
        "Flip",
        "Philips Hue",
        "Google Lens",
        "9:00 a.m.",
        "Nest Camera",
        "Hub",
        "three",
        "5 1/2 inch",
        "Pixel 3",
        "Dish Hopper DVR",
        "Australia",
        "December",
        "Chrome",
        "Nest Thermostat",
        "Taiwan",
        "This year",
        "79",
        "YouTube",
        "799",
        "six months",
        "six million",
        "Pixelbook",
        "France",
        "October 18",
        "599",
        "184%",
        "over 200 million",
        "Downtime Mode",
        "Google",
        "Home View",
        "Pixel 3 XL's",
        "Pixel Slate's",
        "YouTube Premium",
        "Ireland",
        "293",
        "40%",
        "12",
        "Dashboard",
        "Pixel Stand",
        "November 1",
        "this year",
        "Google Home App",
        "Canada",
        "first",
        "Split Screen",
        "Pixel Slate",
        "a ton",
        "Mark",
        "the Google Store",
        "11",
        "last year",
        "Playground",
        "midnight",
        "Chromecast",
        "45 minutes",
        "Google Home Hub",
        "US",
        "October 22",
        "three months of YouTubeTV",
        "Lens",
        "next month",
        "64",
        "Google Pixel 3",
        "Last year",
        "YouTube, Maps",
        "Pixel Slate",
        "the Google Play Store",
        "Pixel 3 XL",
        "second",
        "later this year",
        "Project Fi",
        "99",
        "San Francisco",
        "Super Res Zoom",
        "eight megapixel",
        "Home View Dashboard",
        "First",
        "149",
        "Pixel",
        "one",
        "Pixelbook Pen",
        "Pixel Stand",
        "four",
        "today",
        "HDR Plus",
        "Nest",
        "Vizio TV",
        "tonight",
        "UK",
        "20th anniversary",
        "3",
        "Google Pixel Slate",
        "two",
        "thousand",
        "199",
        "6.3 inch",
        "Japan",
        "Verizon",
        "the Google Store",
        "Call Stream Feature",
        "Pixel Slate Keyboard"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "MONEY",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "MONEY",
        "PERCENT",
        "CARDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "FAC",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "TIME",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "EVENT",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "GPE",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "EVENT",
        "ORG",
        "ORG",
        "TIME",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "GPE",
        "GPE",
        "ORG",
        "EVENT",
        "PERSON"
    ],
    "vector": [
        -0.1115102469921112,
        -0.04954126104712486,
        0.10240856558084488,
        -0.09814969450235367,
        0.06421689689159393,
        -0.05178231745958328,
        0.020194878801703453,
        -0.0064506251364946365,
        0.018713409081101418,
        0.007340794429183006,
        0.020528797060251236,
        0.01738228090107441,
        -0.029544714838266373,
        0.017730530351400375,
        0.03825763985514641,
        -0.05677343159914017,
        0.08397451043128967,
        -0.10389102250337601,
        -0.0857587531208992,
        0.00241377972997725,
        -0.0013895136071369052,
        -0.10821747034788132,
        0.043269284069538116,
        -0.01300628762692213,
        0.03909667953848839,
        0.05142703279852867,
        0.01567891426384449,
        -0.08286907523870468,
        0.04903104901313782,
        -0.037299007177352905,
        -0.03447465971112251,
        0.10765192657709122,
        0.06251008808612823,
        0.01686124876141548,
        -0.06107847020030022,
        -0.02505728229880333,
        0.0015397588722407818,
        -0.01546307373791933,
        -0.04445360228419304,
        0.010419498197734356,
        0.026341205462813377,
        -0.07545024156570435,
        0.00040994593291543424,
        0.010063156485557556,
        0.0408836230635643,
        -0.0182195995002985,
        0.046102605760097504,
        -0.1145481988787651,
        0.006267386022955179,
        -0.01096680760383606,
        -0.059789299964904785,
        -0.05863124504685402,
        0.0005976606626063585,
        -0.04362083971500397,
        -0.07355404645204544,
        0.059616539627313614,
        0.01181554701179266,
        0.011646111495792866,
        0.05947822704911232,
        0.03348712995648384,
        0.01875746250152588,
        -0.04551674798130989,
        0.002060909057036042,
        0.06317499279975891,
        0.058842018246650696,
        0.014432615600526333,
        -0.004535499960184097,
        -0.1053096279501915,
        -0.009005825035274029,
        -0.016087008640170097,
        0.007587113417685032,
        0.029215581715106964,
        0.015313465148210526,
        -0.030911190435290337,
        -0.013323585502803326,
        0.005192852579057217,
        0.04232564941048622,
        0.03620488569140434,
        -0.0119611332193017,
        -0.08295760303735733,
        0.09415838122367859,
        -0.05265820026397705,
        0.007236190605908632,
        0.08553758263587952,
        -0.032492633908987045,
        -0.03627869859337807,
        -0.04435108229517937,
        0.07545279711484909,
        -0.026884498074650764,
        -0.059727687388658524,
        -0.07500124722719193,
        0.09381226450204849,
        -0.04705151170492172,
        0.05127064883708954,
        -0.04214230179786682,
        0.007000295910984278,
        -0.024268662557005882,
        -0.07529767602682114,
        0.006816127337515354,
        0.03337734565138817,
        0.003055556444451213,
        0.0739181786775589,
        0.06022779643535614,
        0.02642512135207653,
        -0.00955512747168541,
        -0.020005663856863976,
        -0.07466346025466919,
        0.00031556750764138997,
        0.005512774456292391,
        0.0920015275478363,
        -0.00427012424916029,
        0.009586642496287823,
        -0.022955503314733505,
        -0.04417916387319565,
        -0.036867137998342514,
        -0.0015437251422554255,
        -0.011218969710171223,
        0.016039209440350533,
        0.1790824979543686,
        -0.014456672593951225,
        0.05017024651169777,
        0.05626453459262848,
        -0.06578652560710907,
        -0.11005192250013351,
        -0.03269648924469948,
        -0.02532535046339035,
        -0.04740588366985321,
        4.976206276340574e-33,
        0.03505716100335121,
        0.05509289354085922,
        -0.01397817861288786,
        0.01730625331401825,
        -0.04863212630152702,
        0.0558277852833271,
        -0.017139678820967674,
        0.04663284868001938,
        -0.02968429960310459,
        -0.06085548177361488,
        -0.010047822259366512,
        -0.010671802796423435,
        -0.0775684043765068,
        0.04626469314098358,
        0.02807997539639473,
        0.015187484212219715,
        -0.0625137910246849,
        0.004042965359985828,
        -0.022845350205898285,
        -0.009696746245026588,
        0.008090944029390812,
        -0.0503389835357666,
        -0.03820076957345009,
        0.0037010509986430407,
        -0.015362461097538471,
        0.027972083538770676,
        0.07449602335691452,
        -0.0065592387691140175,
        0.015361843630671501,
        -0.01128394901752472,
        0.0009550083195790648,
        0.01665814034640789,
        0.048193421214818954,
        0.0034781431313604116,
        -0.07911456376314163,
        0.0212637260556221,
        -0.09452763199806213,
        -0.11311883479356766,
        0.04028554633259773,
        0.0423206090927124,
        -0.07250125706195831,
        0.03864189609885216,
        -0.06658812612295151,
        -0.07159075140953064,
        0.0018936465494334698,
        0.06429485976696014,
        0.02607269026339054,
        -0.055936165153980255,
        0.07582782953977585,
        0.01984359137713909,
        0.027452882379293442,
        -0.01493850164115429,
        -0.038717273622751236,
        0.012794798240065575,
        -0.025002924725413322,
        -0.022589270025491714,
        -0.015924785286188126,
        -0.05747239664196968,
        0.058390647172927856,
        0.035327598452568054,
        0.016216225922107697,
        0.03168619051575661,
        -0.06806143373250961,
        0.08734121918678284,
        -0.10053007304668427,
        0.047633733600378036,
        0.0833001509308815,
        0.07423514127731323,
        -0.07107402384281158,
        0.0180624108761549,
        -0.03341394662857056,
        -0.017007119953632355,
        -0.011249524541199207,
        -0.05369292199611664,
        0.03465234860777855,
        -0.009391375817358494,
        -0.05323005095124245,
        -0.05137800797820091,
        -0.012002435512840748,
        0.025739530101418495,
        -0.005633177235722542,
        -0.019100435078144073,
        0.05944192782044411,
        0.028868619352579117,
        -0.06331915408372879,
        0.012306553311645985,
        0.060870517045259476,
        -0.045793317258358,
        -0.09584198147058487,
        0.03460818529129028,
        -0.06736277043819427,
        -0.042874664068222046,
        0.02705954760313034,
        0.11251278966665268,
        -0.034234970808029175,
        -5.5947480976654e-33,
        -0.03106445074081421,
        -0.029234787449240685,
        -0.057974424213171005,
        0.017065081745386124,
        -0.018490862101316452,
        -0.04970703646540642,
        0.06365229934453964,
        0.039779312908649445,
        0.038531407713890076,
        0.04693126305937767,
        0.010659893043339252,
        0.07694432884454727,
        0.025177983567118645,
        -0.023647284135222435,
        -0.027076488360762596,
        -0.04119453206658363,
        0.03778748959302902,
        -0.1531919687986374,
        -0.09254015237092972,
        0.010371126234531403,
        0.07203155010938644,
        0.033175013959407806,
        -0.06900838017463684,
        0.009059254080057144,
        -0.012898160144686699,
        0.044289037585258484,
        0.09507577866315842,
        -0.002985543105751276,
        -0.031084956601262093,
        -0.035632554441690445,
        -0.056509360671043396,
        -0.046292372047901154,
        -0.04305729642510414,
        0.04618579149246216,
        0.15145008265972137,
        0.02297982946038246,
        0.0121035510674119,
        -0.08970478922128677,
        0.010363592766225338,
        -0.02843634970486164,
        -0.006001380737870932,
        0.026898715645074844,
        0.021694635972380638,
        -0.001986974850296974,
        0.028169361874461174,
        0.046191710978746414,
        -0.008813565596938133,
        0.02446596883237362,
        -0.019674716517329216,
        0.08808116614818573,
        -0.023029271513223648,
        0.05603669583797455,
        -0.025794293731451035,
        -0.04027513787150383,
        -0.012932239100337029,
        -0.028987742960453033,
        -0.029592234641313553,
        -0.013460307382047176,
        0.024293407797813416,
        -0.008773325011134148,
        0.008754733018577099,
        -0.010596883483231068,
        -0.03810010850429535,
        -0.012167776934802532,
        -0.07211551070213318,
        0.0764886811375618,
        0.01724810153245926,
        0.02973804995417595,
        0.029583841562271118,
        0.09214412420988083,
        -0.049869902431964874,
        0.008545386604964733,
        -0.03024325892329216,
        -0.08135990053415298,
        -0.06396777927875519,
        0.04714876413345337,
        -0.0009537586010992527,
        -0.021572211757302284,
        -0.00028894655406475067,
        -0.05370616540312767,
        0.025851411744952202,
        0.03170105442404747,
        0.07970458269119263,
        0.005919337272644043,
        0.08916478604078293,
        0.00477202795445919,
        -0.022792385891079903,
        0.02058732695877552,
        -0.050511568784713745,
        -0.01264406181871891,
        -0.0685938373208046,
        0.028723731637001038,
        -0.1074991524219513,
        0.102838896214962,
        0.035574574023485184,
        -6.018207443503343e-08,
        0.052497584372758865,
        0.0320352241396904,
        0.010249467566609383,
        -0.04923291131854057,
        0.05587456747889519,
        -0.12461654841899872,
        0.04039662703871727,
        0.039191316813230515,
        0.08776220679283142,
        -0.0007430640398524702,
        0.04351933300495148,
        -0.11135243624448776,
        -0.04247249290347099,
        0.07308400422334671,
        0.09048546105623245,
        0.05187539383769035,
        0.013622276484966278,
        -0.016464021056890488,
        -0.021134663373231888,
        -0.059271764010190964,
        -0.03134315088391304,
        0.006323271431028843,
        0.04687150940299034,
        -0.06300464272499084,
        -0.006103629246354103,
        0.024846458807587624,
        -0.03380636125802994,
        0.00246623158454895,
        0.05370340123772621,
        -0.008564058691263199,
        -0.004336434882134199,
        -0.023221567273139954,
        0.04025135189294815,
        -0.01660463958978653,
        0.004270975012332201,
        -0.04003755748271942,
        -0.009471765719354153,
        -0.05188224837183952,
        0.14448538422584534,
        0.012299816124141216,
        0.022516366094350815,
        -0.027878649532794952,
        0.0462266281247139,
        0.053653959184885025,
        0.0073332469910383224,
        -0.04628341272473335,
        -0.0015210816636681557,
        -0.07839792966842651,
        -0.013590926304459572,
        0.05552266538143158,
        -0.10538706183433533,
        -0.04938647896051407,
        -0.003638399066403508,
        0.0496983639895916,
        0.09599523991346359,
        -0.011653853580355644,
        0.006844452116638422,
        -0.014577426947653294,
        0.01313406229019165,
        0.07122711837291718,
        0.052981000393629074,
        -0.04794224351644516,
        -0.018412329256534576,
        0.12334398180246353
    ]
}