{
    "id": "By3WGOw8XUE",
    "title": "I Didn’t Care About The iPhone 11 – Until I Used It",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-09-21T00:32:56Z",
    "video_url": "https://www.youtube.com/watch?v=By3WGOw8XUE",
    "category": "Science & Technology",
    "tags": [
        "iphone 11 review",
        "iphone 11 pro max review",
        "iphone 11 pro review",
        "iphone 11 hands on",
        "iphone 11 pro vs pro max",
        "iphone 11 first impressions",
        "iphone 2019",
        "best iphone",
        "best phone 2019",
        "best smartphone 2019",
        "iphone 11 vs pixel 3",
        "iphone 11 vs note 10",
        "mrmobile",
        "michael fisher",
        "android central",
        "rene ritchie",
        "imore",
        "vector"
    ],
    "views": 845997,
    "likes": 22631,
    "comments_count": 1461,
    "description": "Sponsored by Tech21. Protect your iPhone 11 (and save 10%!) here:  Code: MRMOBILE10   [IPHONE 11 HANDS-ON / IPHONE 11 PRO HANDS-ON]  I came to New York City specifically to go hands-on with the new iPhone 11. Ive now gotten to try all three of them, from the bone-stock iPhone 11 to the petite iPhone 11 Pro to the prodigious iPhone 11 Pro Max. Ive shot endless sample photos with their new wide angle cameras (which Ive been badgering Apple to include for three years). The phones are thicker and heavier  but trade-off we've been insisting Apple make for years. And most surprising of all, the price point on the entry model is $50 lower than last year, while the Pros have retained their price despite adding many new features. In short: Apple has given us nearly everything weve asked for.   So why, as I walk the NYC streets with my friends Rene Ritchie and Hayato Huseman, with a brand new smartphone on its very release day  why is it so hard for me to care?  Find out in my Day-One Deep Dive with the iPhone 11, iPhone 11 Pro and iPhone 11 Pro Max ... and stay tuned for my iPhone 11 Review series, coming soon!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S IPHONE 11 HANDS-ON / IPHONE 11 PRO HANDS-ON]  MrMobile's iPhone 11 Hands-On / iPhone 11 Review Part 1 was produced following 24 hours with an iPhone 11, iPhone 11 Pro, and iPhone 11 Pro Max. The devices were retail devices running a blend of beta and release software. MrMobile does not produce paid or sponsored reviews; Apple was not offered copy review or approval prior to publication, and no compensation was requested or provided in exchange for this coverage.   Special thanks to Rene Ritchie of Vector and Hayato Huseman of Android Central, who provided support critical to the production of this video. See their iPhone 11 videos below.   [LINKS]  iPhone 11 Review [Vector / Rene Ritchie]:   iPhone 11 Pro Review: The new Night King [Vector / Rene Ritchie]:   Galaxy Note 10+ vs. iPhone 11 Pro Max [Android Central]   Deep Fusion is the iPhone's take on AI photography [Engadget]:   The iPhone 11 lineup has a U1 location chip, but what about Apple Tags? [iMore]:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links, which afford Mobile Nations a commission if you make a purchase. See Mobile Nations' disclosure policy for more details:   #iPhone11 #iPhone11Pro #iPhone11ProMax #iphone #smartphones #smartphone #apple",
    "description_links": [
        "https://bit.ly/2mkXZ6r",
        "https://www.youtube.com/channel/UCSOp...",
        "https://www.youtube.com/watch?v=15S6q4Tptc0",
        "https://www.youtube.com/watch?v=epkd4jbmQhw",
        "https://www.youtube.com/watch?v=OtTgI2UU9zw",
        "https://www.engadget.com/2019/09/10/apple-iphone-deep-fusion/",
        "https://www.imore.com/iphone-11-lineup-has-u1-location-chip-what-about-apple-tags",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael Fisher] This video is sponsored by tech21. I didn't expect to have to try this hard. I came to New York city specifically to go hands-on with the new iPhone. I've now gotten to try all three of them. I've shot endless sample photos with their new wide-angle cameras, which I've been badgering Apple to include for three years. The phones have slipped back into my pockets with a resounding thud, testament to another answered prayer. Stop making your phones thinner, we said. We don't need thinner phones, we need better battery life. Well, wish granted. These are thicker, heavier and they promise to last longer. And most surprising of all to me, the price point is $50 lower than last year. In short, Apple has given us everything we've asked for. So why, as I walk the streets with my friends Renee and Hayato with a brand new smartphone on it's very release day, why is it so hard for me to care? (exciting electronic music) I have a theory about that but I'll save the navel gazing for the end, because right now I want to tell you about the phone you came here to see. You've probably heard that the iPhone 11 is split into two categories, one of which has a pro at the end of it and comes in two sizes. How do you tell them apart? Well, the colors are different, the display bezels are thinner on the pro, and the pro also packs many more pixels per inch on a more saturated, higher contrast display. But the main difference is this electric razor, fidget spinner, journeyman project Turbo logo, however you want to make fun of it, it's the camera module. And look, while it does look goofy in pictures, the triple lens on the iPhone 11 Pro is actually okay in person. And really, what matters is the camera's output, right? The iPhone 11 and 11 Pro each pack the same two base cameras. A 12 megapixel primary and a matching 12 megapixel sensor behind an ultrawide 120 degree lens. Many Android phones have similar arrangements, but almost always the differences in either sensors or lenses. or both, have meant that the colors vary significantly between wide and ultrawide. The iPhone 11 hasn't totally solved for this. The smaller aperture on the ultrawide means it can't let as much light in and so it does suffer in the dark. But the color matching across cameras has never been better than it is on this phone. That applies to the third camera, on the 11 Pro as well. Another 12 megapixel sensor made into a telephoto lens for long shots. I'm disappointed Apple stuck to just 2X magnification here while the competition is out doing 3x and even 5x optical zoom. But you forget all about that when you try Apple's new night mode. First it was Huawei then Google then... ...well, technically Samsung but (derisive vocalization) point is, Apple has finally put some work into photos taken after dark. And the results early on are hugely promising. Dimmer but more authentic than Huawei. Better in all respects than Samsung. And going below for blow with Google. That's truly astounding. After a year of falling over myself saying how great the Pixel 3's night sight because it is, but Apple it seems has caught up. I'm going to talk a lot more about these cameras in the review so let me wrap up with a word on selfies and a word on portraits. We finally have a wider front facing camera on the iPhone. Not as wide as the Pixel 3 can go it maxes out at 85 degrees. But it does compare favorably against the Galaxy Note 10+ in terms of quality. Look how much more there is to the picture. Watch out. Also I'm a big pumpkin man over there. And I'm my real self over there. Video, the iPhone does it better. No new lessons were learned. And over in portrait land the iPhone continues to just kill it when it comes to color science. The Pixel has the edge in... ...edge detection. And Samsung does do good work too, but in terms of colors and the quality of the bouquet Apple usually wins. It's just a shame that in 2019, nearly six years after HTC first made portrait photos a thing, screwing up these photos is as easy as having glasses, or, you know, hair. What else is new? Well Apple is finally shipping a fast charger in the box, at least relatively fast at 18 watts and only if you buy the Pro. Face ID is said to be 30 percent faster and capable of working at a wider range of angles but in my brief testing against an older version of iOS that improvement wasn't consistent, either on the table or in the hand. And 3D touch is gone now which makes me sad because it was one of the first truly new ways to use a touchscreen. The other stuff- the longer lasting batteries, the spacial audio, I need time to test it. And yes, I'm getting ready to wrap up but don't go anywhere because we still have to talk about my pesky disillusionment. Right now though, in the midst of a hectic Day 1, it's all I can do to remember that the 11 has glossy glass while the 11 Pro's is frosty glass. And that glass may be the strongest ever but I wasn't willing to test that claim on some of the first iPhones 11's to hit the street. So, to protect yours in case it literally hits the street, check out the new cases from my sponsor tech21. What makes them new? How about anti-microbial protection built into the material itself so it's 99.99% microbe free. Or that fact that the cases are more sustainable now, created from plant based materials. And of course tech21 cases are still grown to be thrown with the best drop protection you can ask for. Keep your iPhone 11 safe and save 10%. Click the link in the description below. And use code: MRMOBILE10 Now here's why getting excited for this iPhone this time around has been tougher for me. I look back to how jazzed I was about the iPhone 10 a couple years back and it's because so much was new, from the gestures to the hardware, even the notch. It's natural for Apple to have a so-called S year but that was last year and I think I just expected more. On top of that, and this is more important, the new software iOs 13.1 still won't be here for another week. And that will enable a lot of features no one has been able to try yet, like the U1 chip inside this thing and Deep Fusion for even better photos. So it's kind of hard to evaluate this phone on the merits while it's still waiting for half its brain to get delivered, you know? Maybe most of all... ...I still believe we're on the brink of a sea change in mobile. With foldable phones just on the cusp of release. And while I know it's so early for those, and really no one should buy them yet, probably, they're always on my mind when I'm testing out the latest plain old rectangle. I'm just eager for the next step, I guess. That's said, if there is a rectangle you buy this year, there probably will be, these should be near the top of your list for consideration. And if you want a lot more photo samples and insights than I was able to get into here, hit up Renee Ritchie's videos at Vector. And also Hayato Huseman's face-off between the iPhone 11 and the Galaxy Note 10+ at Android Central. I'll link them both below. Thanks to both of those gentlemen for all their help putting this video together. And for the record, Mobile Nations purchased both of my review iPhones from Apple. They are retail units and no copy approval or compensation provided either, of course. If that's the kind of tech video you'd like to see more of please subscribe to theMrMobile on YouTube and stay tuned for that review coming soon. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "Apple",
        "iPhone",
        "pro",
        "phones",
        "year",
        "cameras",
        "camera",
        "photos",
        "phone",
        "Galaxy Note",
        "Pixel",
        "Samsung",
        "video",
        "years",
        "iPhones",
        "colors",
        "thinner",
        "York city specifically",
        "badgering Apple",
        "hard"
    ],
    "transcript_entity_values": [
        "Huawei",
        "5x",
        "First",
        "third",
        "a hectic Day 1",
        "Turbo",
        "Michael Fisher",
        "85 degrees",
        "half",
        "another week",
        "Mobile Nations",
        "Samsung",
        "Hayato",
        "12 megapixel",
        "Apple",
        "last year",
        "Android Central",
        "99.99%",
        "YouTube",
        "three years",
        "nearly six years",
        "10%",
        "18 watts",
        "a year",
        "120 degree lens",
        "Pixel",
        "this year",
        "Hayato Huseman's",
        "iPhone",
        "Deep Fusion",
        "first",
        "Pro's",
        "Google",
        "two",
        "3x",
        "30 percent",
        "13.1",
        "Vector",
        "Galaxy Note 10+",
        "2019",
        "iPhones",
        "Renee",
        "New York",
        "Renee Ritchie's",
        "2X",
        "HTC",
        "11",
        "U1",
        "three",
        "one",
        "Android",
        "50"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "DATE",
        "FAC",
        "PERCENT",
        "ORG",
        "DATE",
        "DATE",
        "PERCENT",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY"
    ],
    "vector": [
        -0.0431830957531929,
        0.019682496786117554,
        0.07787258923053741,
        -0.08989301323890686,
        0.06333569437265396,
        -0.025801684707403183,
        0.021640105172991753,
        0.10227353125810623,
        0.040349431335926056,
        0.05861295387148857,
        0.03900893032550812,
        0.07437750697135925,
        -0.0140486229211092,
        -0.018426954746246338,
        0.002974121365696192,
        -0.035115472972393036,
        0.101972296833992,
        -0.06634651869535446,
        -0.14916741847991943,
        0.015610035508871078,
        0.00014702571206726134,
        -0.04618702083826065,
        0.11246166378259659,
        0.023141689598560333,
        0.0006377301760949194,
        -0.03269940987229347,
        -0.10307811200618744,
        -0.0529637411236763,
        -0.010400904342532158,
        0.0148581862449646,
        -0.0074147749692201614,
        0.06197194755077362,
        0.028483988717198372,
        0.012332034297287464,
        0.03201794996857643,
        -0.1237250417470932,
        0.005584841128438711,
        0.01648554392158985,
        0.020166516304016113,
        -0.028821440413594246,
        -0.033751945942640305,
        -0.012505733408033848,
        -0.038749296218156815,
        0.0732840970158577,
        0.04355732724070549,
        -0.057211536914110184,
        0.04739753156900406,
        0.024955175817012787,
        0.029627850279211998,
        -0.05156928673386574,
        -0.0036952453665435314,
        0.015528416261076927,
        -0.024569431319832802,
        -0.01443354319781065,
        -0.05579210817813873,
        0.03129248693585396,
        -0.018359102308750153,
        -0.013458664529025555,
        0.06307932734489441,
        -0.0005018988740630448,
        0.034771572798490524,
        -0.04381778836250305,
        -0.028587311506271362,
        0.016658708453178406,
        0.00599485170096159,
        -0.09082558751106262,
        -0.04368692636489868,
        -0.01847723126411438,
        -0.017759835347533226,
        0.012583068571984768,
        0.07724571973085403,
        0.027092989534139633,
        0.0439530611038208,
        0.006084325257688761,
        0.04095456376671791,
        0.037532854825258255,
        0.034991536289453506,
        -0.02361818589270115,
        -0.08842600882053375,
        0.023840727284550667,
        0.07910257577896118,
        -0.037575870752334595,
        -0.012174969539046288,
        -0.03457673639059067,
        0.01557700801640749,
        -0.040525078773498535,
        -0.023715101182460785,
        0.05524616315960884,
        -0.018336566165089607,
        -0.05519775301218033,
        -0.00719073973596096,
        0.09844645857810974,
        -0.0788876861333847,
        -0.02839892916381359,
        0.011687994003295898,
        -0.008206838741898537,
        0.0001650921767577529,
        0.00044455655734054744,
        -0.08194262534379959,
        0.030165722593665123,
        0.058464568108320236,
        -0.03457888960838318,
        0.04016638174653053,
        0.006872235331684351,
        0.022493652999401093,
        -0.032846707850694656,
        -0.04330970346927643,
        -0.04967903718352318,
        0.030564289540052414,
        0.1076047420501709,
        -0.02892901748418808,
        -0.02012128382921219,
        -0.10934333503246307,
        0.04241802915930748,
        -0.04728272929787636,
        -0.04717449098825455,
        -0.06463895738124847,
        0.06191597506403923,
        0.0940038412809372,
        -0.007143501192331314,
        -0.02623053640127182,
        -0.028962187469005585,
        -0.10593011975288391,
        -0.005370036233216524,
        -0.031256720423698425,
        0.031771477311849594,
        -0.02401767484843731,
        5.021023467833612e-33,
        0.04887980595231056,
        0.07161411643028259,
        -0.07378297299146652,
        0.024185413494706154,
        -0.04940817132592201,
        -0.02872563898563385,
        -0.03752438351511955,
        0.032550763338804245,
        0.0354246087372303,
        0.027259530499577522,
        -0.014814918860793114,
        -0.018570605665445328,
        -0.05285007879137993,
        -0.026036694645881653,
        0.05477020516991615,
        -0.018962066620588303,
        -0.08316054195165634,
        -0.0635022222995758,
        0.03444978967308998,
        -0.007315862458199263,
        -0.024055613204836845,
        -0.08314444869756699,
        -0.0066459039226174355,
        0.0291029941290617,
        -0.08357866108417511,
        -0.017163310199975967,
        0.060296449810266495,
        0.04940159618854523,
        0.008040796034038067,
        0.007141993381083012,
        -0.050455763936042786,
        0.011408056132495403,
        0.06861025094985962,
        -0.029894068837165833,
        -0.03721179440617561,
        0.028370417654514313,
        0.07388678938150406,
        -0.057862039655447006,
        0.061271294951438904,
        -0.07363691926002502,
        -0.08237641304731369,
        0.039937954396009445,
        -0.02860015444457531,
        0.06398490071296692,
        0.0760873332619667,
        0.028257787227630615,
        -0.04482823982834816,
        -0.02657800354063511,
        -0.04220962151885033,
        -0.0345502607524395,
        -0.022623443976044655,
        -0.013955291360616684,
        -0.030901726335287094,
        -0.007854999974370003,
        -0.09063725173473358,
        -0.01862538978457451,
        0.054693613201379776,
        -0.08882004767656326,
        0.03170614689588547,
        0.016003508120775223,
        -0.03780624642968178,
        -0.003276991657912731,
        -0.05029302090406418,
        0.12022895365953445,
        -0.04055444523692131,
        0.05385955423116684,
        0.037800271064043045,
        0.06329328566789627,
        -0.06023033708333969,
        0.16088171303272247,
        0.011392222717404366,
        -0.035412296652793884,
        -0.011138488538563251,
        -0.05096922814846039,
        0.12156300991773605,
        0.02482958883047104,
        0.051486849784851074,
        -0.03042658045887947,
        0.044086579233407974,
        0.004572366364300251,
        0.01824239082634449,
        0.11171895265579224,
        -0.014713908545672894,
        0.053704485297203064,
        0.02454475872218609,
        -0.05010051652789116,
        -0.07775615155696869,
        -0.02631806582212448,
        0.02958412654697895,
        0.11117010563611984,
        -0.01017935574054718,
        0.0030853976495563984,
        -0.03186530992388725,
        0.028968026861548424,
        0.0322592593729496,
        -6.876359098982215e-33,
        -0.05486227944493294,
        -0.07392328977584839,
        -0.02325054444372654,
        -0.09266254305839539,
        -0.0691744014620781,
        -0.05339246243238449,
        -0.02525671012699604,
        -0.01713559962809086,
        0.004970925860106945,
        -0.03508666902780533,
        -0.07180549204349518,
        0.004308443516492844,
        -0.033384889364242554,
        0.04154912382364273,
        -0.03903605416417122,
        -0.03319191932678223,
        -0.04747144132852554,
        -0.07471870630979538,
        0.06727146357297897,
        0.020913399755954742,
        0.09050049632787704,
        0.0857255756855011,
        -0.021935539320111275,
        0.02529558539390564,
        -0.0425647608935833,
        -0.030124641954898834,
        -0.0549861341714859,
        0.049311812967061996,
        0.03218979388475418,
        -0.05994482710957527,
        -0.019932901486754417,
        -0.11691887676715851,
        -0.04484323784708977,
        0.03392113000154495,
        -0.01509761530905962,
        0.08198221772909164,
        -0.037525467574596405,
        -0.00037428204086609185,
        0.028501439839601517,
        0.021233603358268738,
        0.007091477047652006,
        -0.025483302772045135,
        -0.020051533356308937,
        -0.060148343443870544,
        0.04798265919089317,
        -0.044314511120319366,
        0.010459945537149906,
        0.007092857267707586,
        0.02310621179640293,
        0.08472128212451935,
        0.04895669221878052,
        0.05039019137620926,
        -0.01790544018149376,
        0.044765811413526535,
        -0.06361870467662811,
        -0.014980279840528965,
        0.04204995557665825,
        -0.03494785353541374,
        -0.03331643342971802,
        0.02954300120472908,
        0.10196681320667267,
        0.07713720947504044,
        -0.06373877078294754,
        -0.022986263036727905,
        -0.09870721399784088,
        0.005516073666512966,
        0.08139574527740479,
        -0.04696039855480194,
        -0.00267129298299551,
        0.08614488691091537,
        -0.05536424741148949,
        -0.041016820818185806,
        -0.0651344507932663,
        -0.06353138387203217,
        -0.04724785313010216,
        0.06689199060201645,
        -0.08572647720575333,
        0.04730241000652313,
        -0.052468158304691315,
        -0.03880772739648819,
        0.010796054266393185,
        0.06516940146684647,
        0.0420953594148159,
        0.011668812483549118,
        0.0665658637881279,
        0.06584329158067703,
        0.03916974365711212,
        -0.009513049386441708,
        -0.002593032084405422,
        0.09681591391563416,
        0.04968588426709175,
        0.008268769830465317,
        -0.08599937707185745,
        0.031063299626111984,
        -0.0922665223479271,
        -5.5586859559753066e-08,
        0.05785926431417465,
        0.006855968851596117,
        0.05937264859676361,
        -0.06533793359994888,
        0.0421573631465435,
        -0.0800093412399292,
        -0.07049363106489182,
        0.007448658347129822,
        0.1445789337158203,
        -0.005139367189258337,
        0.004472036845982075,
        -0.03312169760465622,
        -0.07568293809890747,
        0.09983106702566147,
        0.04035845771431923,
        0.09519217163324356,
        0.006112848874181509,
        0.002044833730906248,
        -0.01234154962003231,
        0.061958469450473785,
        -0.06501259654760361,
        0.0629873126745224,
        0.02081635780632496,
        -0.061638955026865005,
        -0.013536619022488594,
        -0.011671806685626507,
        -0.053286656737327576,
        -0.05868839845061302,
        0.01582198776304722,
        0.019386708736419678,
        0.013075321912765503,
        0.005217482801526785,
        -0.031345613300800323,
        -0.05232081189751625,
        0.009696156717836857,
        -0.031003734096884727,
        0.053642578423023224,
        -0.035345979034900665,
        0.01697002351284027,
        -0.02824663557112217,
        0.03679955005645752,
        -0.0389583483338356,
        -0.04402390122413635,
        0.030439354479312897,
        0.03617168217897415,
        -0.06572424620389938,
        -0.04430706426501274,
        -0.05869367718696594,
        0.005072642117738724,
        0.0678597167134285,
        -0.018041260540485382,
        -0.06065215542912483,
        0.00010635212674969807,
        -0.018036140128970146,
        0.001675790990702808,
        -0.019147519022226334,
        0.018543826416134834,
        -0.03254009410738945,
        -0.023150410503149033,
        0.07728548347949982,
        0.04263480380177498,
        -0.06297852098941803,
        0.002860104665160179,
        0.03578253090381622
    ]
}