{
    "id": "byfWscC87Vg",
    "title": "I'VE BEEN ROBBED",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-11-23T14:00:28Z",
    "video_url": "https://www.youtube.com/watch?v=byfWscC87Vg",
    "category": "Howto & Style",
    "tags": [
        "Casetify",
        "Teardown Skin",
        "Teardown",
        "robbed",
        "stolen",
        "casetify review",
        "dbrand",
        "JerryRigEverything",
        "JerryRig",
        "JerryRig Skin",
        "Inside out collection"
    ],
    "views": 8649995,
    "likes": 542361,
    "comments_count": 23657,
    "description": "I don't often get robbed by Billion dollar corporations... but when I do, I win. Grab an X-RAY skin for your device HERE:  and help us fight the unprincipled behemoth that is Casetify.  Get my JerryRig Razor knife HERE:   Follow me for updates!  Instagram:   Facebook:   Twitter:    Looking for a Casetify Review? Maybe look at this first.",
    "description_links": [
        "http://dbrand.com/x-ray",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig"
    ],
    "transcript": "I've got something a little bit different for you today. A video I never thought I'd have to make. There's a company, a company you've all heard of, and a company worth probably close to a billion dollars that's stealing my stuff. And today we're going to fight back the way Uncle Sam intended with a lawsuit. It's Casetify. Casetify is stealing my stuff. And the story of how I found out is rather fascinating. It all started back in December of 2019 when I decided to upgrade my cell phone. I went from a Galaxy S8 to a Note 10 Plus and little did I know that that upgrade was going to land us in court. It was that exact day when I launched the Teardown Skin with my friends over at dbrand. Teardown is obviously a line of cases and skins that show the inside of your device on the outside. It's kind of what I do and dbrand and I go to extreme lengths to ensure that every tear down skin is an accurate representation of what's actually on the inside. But that also doesn't stop us from sneaking in a few Easter eggs for people to find. For example, on the back of this Galaxy S23 Ultra ribbon cable it says, Glass is glass and glass breaks. Definitely not something Samsung would ever put inside their device. But that is something I say very often and we toss a few of these treats onto every skin. These Easter eggs are going to be extraordinarily important here in a second because extraordinary claims of theft require extraordinary proof. Luckily for me though, Casetify is more like the Home Alone thieves and less like the Ocean's 11 thieves. But I'll get to that. Keep in mind that this is a true partnership between dbrand and I. We share profits like partners and we're constantly growing the product line and figuring out which devices to support next. Since that launch in December of 19, we've supported over 100 devices with Teardown Skins and we'll keep going as long as you support us, or until Apple stops making iPhones, whichever comes first. But let's go back. What did castify do to Warrant all of this negativity. Well back when Twitter was still called Twitter. someone tagged dbrand in a post pointing out that castify was selling a Samsung Galaxy s23 phone case with the internals of an iPhone. And not only that every single product they were selling was using the exact same iPhone image. The average person might not have been able to spot the error, but anyone watching my channel could have spotted the internal differences from a mile away. dbrand being dbrand took a little shot at Casetify, which is fine. Just a little Twitter banter between companies. dbrand and I continue along our merry way making accurate Teardown products while Casetify is dressing up Androids like iPhones. No big deal. I thought that was the end of it, but it wasn't. A few months go by and we get tagged in another tweet. I found a product like Teardown, but more expensive. Clicking the link it takes us to a landing page for a new product line from Casetify called Inside Out. And when you click to the website, check it out, they did it. A much more accurate look at the insides, and normally I'd be very proud of Casetify for actually taking the effort to actually portray the insides. Because I'm not the only person on the planet who likes to take things apart. I don't own the idea of repairing things yourself, or am I the only person who appreciates the beauty of internal hardware. If Case toy went back to the drawing board purchased a bunch of phones. Took them apart scane the internals to properly make a tear down skin competitor bring on the competition. If that's what they did. Spoiler alert, that is not what they did. Do you remember all those Easter eggs I told you about earlier? While we were scanning this new competition from Casetify, we noticed something interesting on their Galaxy S23 Ultra case, which I happen to have right here. The print quality is extraordinarily subpar, but I think you'll be able to notice what we noticed right here on Casetify's case that Casetify sells on Casetify's website. Glass is glass and glass breaks. I know for sure Samsung didn't put that there. So what does my phrase that I use all the time do on one of Casetify's products? After seeing this, we decided to investigate a little further. Check out this R0807. If you've been around long enough, you'll know that this is a reference to dbrand's robots. R-O-B-O-T. And one more here near this Lego style ribbon connector, it says C-T-F-Y, surrounded by a trio of 11s. 11.11.11. it's not just the day Skyrim came out, it's already the day dbrand started its business. Now why would Casetify include the day that dbrand was founded on their products? Unless... do you see where I'm going with this? Let's take a look at my Galaxy S23 teardown skin. We have the same 11, 11, 11 around the subscribe ribbon, and the robot Easter egg is also front and center. Would it surprise you to learn that nearly every single Casetify product on my desk right now has at least one of our teardown skin Easter eggs on it? I'm starting to think that Casetify's Inside Out product line isn't as authentic as they say it is. dbrand was first to notice that our Easter eggs were showing up in Casetify products and we both couldn't figure out why Casetify would create their own version of Teardown and painstakingly recreate the JerryRigEverything Easter eggs. Unless... Casetify didn't recreate the JerryRigEverything Easter eggs and the ones that are left are the ones left behind in their rush to ride the Teardown train. To put it another way, maybe Casetify didn't digitally recreate my Glasses Glass and Glass Breaks, or dbrand's Pyramid, or the 11, 11 watt hours on this Pixel 7 Pro. The Pixel 7 Pro actually has 19.25 watt hours of battery capacity, but Casetify wouldn't know that since they probably didn't even take apart a phone to get this image. And if you squint really hard you can literally see a cut and paste of dbrand's logo on Casetify's case. I'm starting to think that these Easter eggs are still here because Casetify didn't realize they were transferring over a decade's worth of inside jokes and connections that I have with all of you as they stole the Teardown designs. Casetify did attempt to remove some of the more obvious Easter eggs, but that kind of makes it worse. This is Home Alone's skill levels of thievery and if you haven't watched that movie, I highly recommend it. You might be thinking to yourself, hey Jerry, why would they do this? After all, isn't it a simple scan the device that you print out and slap on a case? It can't be that difficult. To answer that question, I'm going to open the curtain a little bit and let you see behind the scenes. What you're seeing here is a sped up recording of what it looks like to create a Teardown scan for the iPhone 15 Pro. We first scan the phone in ultra high 2400 dpi resolution, giving us an image up to about 41,000 pixels wide by 30,000 pixels tall. Enough detail to print out on a billboard. Then it takes about 10 hours worth of editing, a first draft in Photoshop, before producing prototypes, making adjustments, and getting it ready for mass production. Nearly every imperfection gets cleaned up while taking a few creative liberties to spruce up the internals, like undressing the wireless charging pad so it's bare copper coils pop better. Not only just a lot of work, but we put the same level of attention on to every device in the Teardown product line. I'm not kidding when I say we've put over 10,000 hours into editing alone. Check out these example images. What the device looks like in the initial scan and what it looks like after we are finished with it. It's just as much of a work of art as a realistic representation of the internals. The original images are just like what you'd see in one of my Teardown videos, and the polished up image in incredible detail, with Easter eggs added, is what you'd get with a Teardown skin or on a Teardown grip case. It takes a lot of work to make a Teardown skin, so I think you can see why we are a little upset that a massive company, whose by their own CEO's admission is worth close to a billion dollars, might have just swooped in and copied 10,000 hours worth of work. But there's more. In order for us to confirm our suspicions, dbrand conducted an experiment. I'm going to show you a video, and on the right is our artistically perfected Teardown skin for MacBooks, and on the left is Casetify's Inside Out case for MacBooks. Now watch as we take the entire chunk of the MacBook Teardown and move it over to Casetify's product. You might be surprised to notice how perfectly they match up. Or, considering everything you've seen up to this point, maybe you aren't surprised anymore. We're going to flip between Casetify's image and the one we just made with our Teardown skin. We did this for every single one of Casetify's Inside Out products, and sure enough, every single one failed our plagiarism test. Literally all of these Casetify designs you're looking at, from Pixel to Samsung, weren't made by Casetify independently taking apart devices and digitally reconstructing their internals. They were made from our Teardown designs. And to add insult to injury, if you look at Casetify's website and check out their... I mean, my Galaxy Z Fold 4 case, it looks just like a normal rip off. But if we zoom in, we notice a random extra camera lens at the top of the picture a portion of a fourth circle. Turns out it's not just a random camera lens, it's literally the camera from our Teardown product image on our product page. So not only did Casetify steal our Teardown products, but we also think they didn't have the decency to buy them first and scan the real thing. It appears as if they went to our Teardown product page, right clicked the image, saved it, and used it for their own profit. And to be fair, this isn't the first time someone has tried to rip off our Teardown skin, but Casetify is not a mom and pop shop. They are a global brand with a nearly $1 billion valuation with a B. Considering their size and cash flow, I don't see why they couldn't just buy a few phones, take it apart, and do the work themselves. And honestly, if they had, I would love it. Competition is a marvelous thing. I know how much work goes into... creating a teardown product, and if someone wants to create decent competition, I'm all for it. But hopefully you can see with everything that I've shown you that fair competition isn't the route that Casetify decided to take. So when we had this all figured out, dbrand and I just had one last question. What do we do about it? I'm not normally a legal action kind of guy, but I also don't get ripped off by billion dollar corporations every day. I could call them out on social media of course, or dbrand could tweet some witty tweets, but at the end of the day in this David and Goliath situation, Goliath doesn't have the obligation to remove my products from their website just because I made a video calling them out on it. So instead, we're giving them something they can't ignore a lawsuit. If you're watching this on the day it's uploaded, and I hope Casetify is, we've officially filed a federal lawsuit against Casetify for copyright infringement as of yesterday morning. Uncle Sam has indeed been notified. The legal system isn't exactly known for its speed and efficiency, especially when dealing with an international company overseas, but when I do have any updates or any new information, I'll be sure to let you know. But it will probably going to take take a while. This isn't about the money. Theft is just not cool, and I think the biggest way we can teach Casetify a lesson is with a multi-million dollar lawsuit. Getting hit in the wallet is what hurts these giant corporations the most. There is a real possibility that no one wins here. I think they stole something, and I think they know they stole something, but the wheels of justice turn extremely slowly. And if by chance we do win, you won't find me in a new Ferrari or a private jet. I will turn Casetify's thievery into Furnishing my wheelchair manufacturing facility with laser cutter CNC mandrel Benders and just give away wheelchairs for free as much as I can. For the past three years I've thrown every extra penny I have at my wheelchair manufacturing business, and if we win anything, I'll continue to do just that. I don't know what dbrand is going to do with their cut obviously. Maybe buy a hot air balloon with my face on it, or build a life-size pyramid in their parking lot. Something strange probably. But for me, it's not about the money, it's about the message. Don't right click my stuff. Lawsuits aren't cheap though, and normally I would say if you want to help us thwart thievery, you could just buy a teardown skin. But I imagine most of you watching this probably already have one. So dbrand and I created something a little special instead. An all new x-ray skin. It's a state of the art method of getting the incredible real details of the insides on the outsides. You can think of it as teardown's monochromatic cousin. Check out the pen detail on the USB-C charging port of the S23 Ultra, or the leads on the speaker inside the iPad Pro. Or even better yet, the turbo fans and vapor chamber on the MacBook. Unlike teardown where we physically disassemble a device and run it through a high DPI scanner, this time around we take the device to a metrology lab where we use a one-of-a-kind x-ray machine that's normally used to scan minuscule parts in the assembly of spacecraft. Literal rocket science. And you can't get a more in-depth look than that. If you want a behind the scenes look of how that x-ray machine works, let me know if that's the kind of video you want to see. And I haven't even shown you the best part yet. Light mode, and you don't even have to pick. For a limited time, buy either shade of the x-ray skins and we'll give you the other for free. Except for you, Casetify. Not that you ever bought anything in the first place. They'll probably just right click and save again. If you want to support the channel and our fight against an unprincipled behemoth or just want the coolest looking device on the planet, I'll leave a link for these x-ray skins down in the video description. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Casetify",
        "Teardown",
        "Teardown Skin",
        "Easter eggs",
        "Teardown product",
        "teardown skin Easter",
        "Casetify Inside",
        "dbrand",
        "Easter",
        "Casetify products",
        "Skin",
        "product",
        "Casetify case",
        "inside",
        "Teardown product image",
        "single Casetify product",
        "eggs",
        "Glass",
        "skin Easter eggs",
        "Teardown product line"
    ],
    "transcript_entity_values": [
        "15",
        "December of 19",
        "Teardown",
        "Pyramid",
        "Casetify",
        "CNC",
        "Easter egg",
        "Ferrari",
        "Galaxy S23",
        "the MacBook Teardown",
        "19.25 watt hours",
        "the end of the day",
        "first",
        "11",
        "the day",
        "Teardown",
        "MacBooks",
        "iPhone",
        "Galaxy S23 Ultra",
        "at least one",
        "morning",
        "11 watt hours",
        "the past three years",
        "Jerry",
        "Goliath",
        "Apple",
        "iPhones",
        "Easter",
        "decade",
        "fourth",
        "this Pixel 7 Pro",
        "one",
        "a mile",
        "David",
        "10,000 hours",
        "Samsung Galaxy",
        "Uncle Sam",
        "Teardown",
        "Glass Breaks",
        "The Pixel 7 Pro",
        "Teardown",
        "100",
        "Glass",
        "the iPad Pro",
        "yesterday",
        "nearly $1 billion",
        "Easter",
        "11",
        "about 10 hours",
        "Casetify",
        "second",
        "December of 2019",
        "Samsung",
        "the S23 Ultra",
        "multi-million dollar",
        "iPhone",
        "MacBook",
        "the Teardown Skin",
        "Twitter",
        "11s.",
        "Galaxy Z Fold",
        "Teardown Skins",
        "Lego",
        "about 41,000",
        "Skyrim",
        "Easter",
        "billion dollar",
        "Ocean",
        "Photoshop",
        "4",
        "Casetify",
        "Home Alone's",
        "A few months",
        "close to a billion dollars",
        "30,000",
        "today",
        "every day"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "EVENT",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "DATE",
        "DATE",
        "FAC",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "TIME",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "NORP",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "TIME",
        "PRODUCT",
        "PERSON",
        "NORP",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "LOC",
        "MONEY",
        "NORP",
        "FAC",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "GPE",
        "MONEY",
        "LOC",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE"
    ],
    "vector": [
        -0.10093014687299728,
        0.08589903265237808,
        0.058236703276634216,
        -0.11416906863451004,
        0.05819723382592201,
        0.02197127789258957,
        0.11237287521362305,
        0.03590665012598038,
        0.017034202814102173,
        -0.02904227189719677,
        0.0615590400993824,
        0.06947305053472519,
        0.1033925786614418,
        -0.019028350710868835,
        0.0147881880402565,
        -0.04593099653720856,
        0.06217840686440468,
        -0.02848951146006584,
        -0.10778719186782837,
        0.03626803681254387,
        -0.0019171887543052435,
        -0.00977906584739685,
        -0.011529109440743923,
        -0.040141187608242035,
        -0.03920673578977585,
        0.06671188771724701,
        -0.00802446436136961,
        -0.04309829697012901,
        -0.08648920059204102,
        -0.061357397586107254,
        -0.010914609767496586,
        0.03418269380927086,
        -0.006506142672151327,
        0.007166863884776831,
        0.048535991460084915,
        -0.009935537353157997,
        -0.009137319400906563,
        0.016273628920316696,
        0.011443695984780788,
        -0.07002390176057816,
        -0.007795202080160379,
        -0.07441451400518417,
        0.030815519392490387,
        -0.012565135955810547,
        -0.04396912455558777,
        -0.01865200698375702,
        0.05866482853889465,
        0.06841026246547699,
        -0.020924625918269157,
        -0.04104282706975937,
        -0.0572429783642292,
        -0.00792663637548685,
        -0.009920129552483559,
        0.01542290672659874,
        -0.03891659528017044,
        0.03600221872329712,
        0.07947871834039688,
        0.05307070165872574,
        0.035424601286649704,
        -0.04747431352734566,
        0.06922703236341476,
        -0.012310009449720383,
        0.029559899121522903,
        0.053286802023649216,
        0.025596490129828453,
        0.02967451699078083,
        0.08647923171520233,
        0.03383520245552063,
        -0.057668525725603104,
        0.07361425459384918,
        0.10701921582221985,
        -0.019201595336198807,
        -0.006363771390169859,
        0.07781516015529633,
        -0.01758568361401558,
        0.0683688074350357,
        0.01757252961397171,
        0.01780989207327366,
        0.012407302856445312,
        -0.0010525553952902555,
        0.02742159180343151,
        -0.020382406190037727,
        -0.04711339250206947,
        -0.03046679124236107,
        -0.06823991239070892,
        0.003492464078590274,
        0.01193422544747591,
        0.06918778270483017,
        0.06869222968816757,
        -0.03998052328824997,
        -0.019086260348558426,
        0.005755570251494646,
        0.052236590534448624,
        -0.08129692077636719,
        0.00014601332077290863,
        -0.05090527608990669,
        -0.06591164320707321,
        -0.006694648880511522,
        0.008177966810762882,
        0.036591026932001114,
        0.03829190507531166,
        -0.000990085769444704,
        0.07051383703947067,
        -0.08130434900522232,
        0.12404448539018631,
        -0.027556996792554855,
        -0.05242141708731651,
        0.016133766621351242,
        0.0034699379466474056,
        0.012709468603134155,
        0.03594137728214264,
        0.07383248209953308,
        0.021657437086105347,
        0.015846816822886467,
        0.026374485343694687,
        -0.0018715843325480819,
        -0.0543157197535038,
        0.07780420035123825,
        0.011689824983477592,
        0.0019400896271690726,
        0.09861746430397034,
        0.08318337053060532,
        -0.08437968790531158,
        0.045155443251132965,
        -0.04042086750268936,
        0.028238896280527115,
        -0.10353325307369232,
        1.2883455737565696e-33,
        -0.003243394661694765,
        0.09683272987604141,
        -0.043781641870737076,
        0.010986287146806717,
        -0.0071433051489293575,
        -0.031593021005392075,
        0.002081778133288026,
        0.048498108983039856,
        -0.04883171245455742,
        0.08996108919382095,
        -0.035014014691114426,
        0.05365049093961716,
        0.03776964545249939,
        -0.01203142385929823,
        -0.028151027858257294,
        0.0427643284201622,
        -0.08906767517328262,
        -0.07133379578590393,
        0.03232954069972038,
        -0.030254613608121872,
        0.054269757121801376,
        -0.022438472136855125,
        0.024098699912428856,
        0.05546995997428894,
        -0.021823465824127197,
        -0.030083058401942253,
        -0.008791293948888779,
        -0.05455469712615013,
        0.05322447791695595,
        -0.018206875771284103,
        -0.028077419847249985,
        0.02243909239768982,
        0.07477519661188126,
        0.053611721843481064,
        0.029118133708834648,
        0.05291437730193138,
        0.01467121858149767,
        -0.05618890002369881,
        0.048935532569885254,
        -0.03455057367682457,
        -0.09452690184116364,
        -0.004101716913282871,
        -0.04291337728500366,
        -0.04903244972229004,
        0.019784456118941307,
        0.04331621155142784,
        -0.07330553978681564,
        -0.0850147157907486,
        -0.08218145370483398,
        -0.04226577654480934,
        0.010808983817696571,
        -0.0327097550034523,
        0.047823406755924225,
        0.005331179592758417,
        -0.11766096204519272,
        -0.04154178127646446,
        -0.018062453716993332,
        -0.036660004407167435,
        0.09613122045993805,
        0.06680352985858917,
        0.0031535185407847166,
        0.04901564121246338,
        0.006858104839920998,
        0.059200774878263474,
        -0.11035335063934326,
        0.02019774541258812,
        0.05382855609059334,
        -0.001451793359592557,
        -0.0596371665596962,
        -0.0014006487326696515,
        0.04148053377866745,
        -0.03581865504384041,
        0.01030230987817049,
        0.007690025493502617,
        0.036688920110464096,
        -0.03428216278553009,
        -0.015991350635886192,
        0.01088150404393673,
        -0.04703142121434212,
        -0.0657016709446907,
        -0.03639388456940651,
        0.008089553564786911,
        0.08984487503767014,
        0.024974200874567032,
        0.022593121975660324,
        -0.01732480712234974,
        0.028263255953788757,
        -0.1119752824306488,
        0.004379695281386375,
        0.03267736732959747,
        -0.06999830901622772,
        -0.05862928554415703,
        -0.004072472918778658,
        0.0416625551879406,
        -0.009555649943649769,
        -2.9875313822423212e-33,
        -0.06319767236709595,
        -0.07555847615003586,
        0.04793251305818558,
        0.019177347421646118,
        0.009460847824811935,
        -0.07883627712726593,
        -0.0621647946536541,
        0.04357927665114403,
        -0.034839387983083725,
        -0.05006682872772217,
        -0.0443902388215065,
        0.017061181366443634,
        -0.006776121445000172,
        -0.06474103778600693,
        -0.026113303378224373,
        -0.026134982705116272,
        0.0804021954536438,
        -0.0718248039484024,
        -0.09116526693105698,
        -0.061837486922740936,
        0.026661548763513565,
        0.023350760340690613,
        -0.025217587128281593,
        0.04422188922762871,
        -0.11354151368141174,
        0.05548984557390213,
        0.030551718547940254,
        -0.06399941444396973,
        0.07610499113798141,
        0.03662368282675743,
        -0.03439120948314667,
        -0.022302808240056038,
        -0.09761515259742737,
        0.05527602136135101,
        -0.04291413724422455,
        0.016177861019968987,
        0.06157659366726875,
        -0.054218001663684845,
        -0.06809111684560776,
        -0.06843569874763489,
        -0.06494802236557007,
        0.016789952293038368,
        -0.03641337901353836,
        0.0644107237458229,
        -0.0383266806602478,
        -0.05600300058722496,
        0.031743988394737244,
        -0.03154240548610687,
        0.07108379900455475,
        0.0006154390866868198,
        0.044304367154836655,
        0.004330395255237818,
        0.05708703771233559,
        0.022844212129712105,
        -0.11105309426784515,
        0.0350843109190464,
        0.14405158162117004,
        -0.01681326888501644,
        -0.04407492280006409,
        0.03699212521314621,
        0.032988835126161575,
        0.05298297107219696,
        -0.07617297768592834,
        0.0022639904636889696,
        -0.042350515723228455,
        -0.027670590206980705,
        0.04860873147845268,
        -0.004080715589225292,
        -0.0222593005746603,
        0.007069726474583149,
        -0.022239986807107925,
        0.008868138305842876,
        -0.025541875511407852,
        -0.08633647114038467,
        0.06617064774036407,
        0.07601086795330048,
        -0.02551732026040554,
        0.039057016372680664,
        -0.10724548995494843,
        0.005061041098088026,
        0.11455033719539642,
        -0.07218873500823975,
        0.04288372024893761,
        0.04994487017393112,
        0.08485336601734161,
        0.05926969274878502,
        0.01687842607498169,
        -0.04026668518781662,
        -0.05978765711188316,
        -0.024551082402467728,
        -0.09122464805841446,
        -0.04710843041539192,
        -0.06981885433197021,
        0.05821174755692482,
        0.04272633418440819,
        -5.4967568274832956e-08,
        -0.009818119928240776,
        0.024847710505127907,
        0.014970340766012669,
        0.015698231756687164,
        0.020534666255116463,
        -0.022063283249735832,
        -0.03559349477291107,
        0.07040683180093765,
        0.04481961950659752,
        -0.029874594882130623,
        -0.022143883630633354,
        -0.04739775508642197,
        -0.0754646435379982,
        0.06528319418430328,
        -0.07879041135311127,
        0.0071089728735387325,
        0.002136997878551483,
        -0.03471817076206207,
        -0.03600768744945526,
        -0.006866294890642166,
        -0.08525798469781876,
        0.02865184284746647,
        0.015263006091117859,
        -0.10890602320432663,
        0.0012661668006330729,
        -0.0011198337888345122,
        0.030508210882544518,
        0.00968236941844225,
        0.001402658992446959,
        0.09008659422397614,
        -0.07480768859386444,
        -0.02725345641374588,
        -0.06257159262895584,
        0.002359858714044094,
        -0.0039037105161696672,
        -0.07797512412071228,
        0.0694379135966301,
        0.013381652534008026,
        0.03455282375216484,
        0.01597549207508564,
        0.000933698145672679,
        -0.0008362843072973192,
        0.04298878833651543,
        0.0739302933216095,
        -0.0342429019510746,
        -0.07963982224464417,
        -0.04636182636022568,
        -0.0453200601041317,
        0.07459188252687454,
        0.03451910614967346,
        0.030829407274723053,
        -0.06505623459815979,
        -0.03846009448170662,
        0.006628341507166624,
        0.04943766072392464,
        -0.024280915036797523,
        0.03714628517627716,
        0.04520917311310768,
        -0.026405517011880875,
        0.05267127603292465,
        0.05375983938574791,
        -0.07149803638458252,
        0.015450552105903625,
        0.005368533544242382
    ]
}