{
    "id": "BZnljKjJLvM",
    "title": "How to Make a One-Click Backup Button",
    "channel": "DIY Perks",
    "channel_id": "UCUQo7nzH1sXVpzL92VesANw",
    "subscriber_count": 4640000,
    "upload_date": "2015-05-27T18:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=BZnljKjJLvM",
    "category": "Science & Technology",
    "tags": [
        "hard drive",
        "backup",
        "automatic",
        "mod",
        "hack",
        "lifehack",
        "button",
        "freefilesync",
        "recovery",
        "repair",
        "external",
        "drive",
        "computer",
        "pc",
        "hdd",
        "disk",
        "laptop",
        "fix",
        "damaged",
        "faulty",
        "recover",
        "data",
        "backup data",
        "diyperks55",
        "cloud unit",
        "software",
        "broken",
        "restore",
        "technology",
        "tech",
        "gadge",
        "nvidia",
        "ati",
        "intel",
        "core",
        "amd",
        "windows",
        "microsoft",
        "google",
        "dekonifenta",
        "melhobankof",
        "data recovery",
        "diy",
        "make"
    ],
    "views": 847312,
    "likes": 28504,
    "comments_count": 833,
    "description": "In this video we'll be making a simple one-click backup button so that you can make data backups regularly with ease.  OFFICIAL LINKS:  Support me on Patreon:   Official Website:   Discord:   Forums:   Twitter:    Parts links:   Disclosure: These are affiliate links. If you click them and make a purchase from the various merchants they link to, DIY Perks may earn a commission. Affiliate programs and affiliations include, but are not limited to the eBay Partner Network and Amazon Associates.  Here's the button I used in this project:  eBay US/Worldwide:    Also, here are some other buttons that are compatible with this project:    FreeFileSync:   Badge vector by Vector Open Stock",
    "description_links": [
        "https://www.patreon.com/DIYPerks/",
        "https://www.diyperks.com/",
        "https://diyperks.com/discord-server/",
        "https://diyperks.com/community/",
        "https://twitter.com/DIYPerks",
        "https://ebay.us/7fyc62",
        "https://docs.google.com/document/d/1E4ua-HKPTDZkk3WHK-iLYYe3Tn9_HDIC8plI-S6jEJM/edit?usp=sharing",
        "http://www.freefilesync.org"
    ],
    "transcript": "Backing up data can be a bit of a tedious task, so many of us don't do it as often as we should, despite our drives being full of so many irreplaceable files these days. So in this video, we'll be making the backup process much easier by making a one-click automatic backup system, that requires no user interaction after pressing it. The net result is that backups are made much more regularly as it's so easy to do. Laptop users can also benefit, as the same system can also be set up for external drives where the backup process will be automatically triggered as soon as the drive is plugged in. This method doesn't require a button, and is entirely software based, so I'll be covering it in more detail later in the video. We'll be building the button into the drive bay of a standard computer to start with, but you can of course reposition the button to wherever you like, or even make it external, depending on your requirements. Using just any old button or switch won't do, as we specifically need one that is latching and has two poles. Having two poles means that a button has two individual switches inside, allowing it to make or break two separate circuits. This is usually shortened as DP, which stands for Double Pole. As these switches are a little less commonly found, I've placed international purchasing links in the description to a variety of suitable switches for you to choose from that will work with this project. So let's begin by removing the drive bay cover. This process varies from case to case, but generally it involves removing the front facade of the chassis and simply unclipping it. Once we've got it, we can place it on some scrap wood and then drill a hole in it for the button. To make the process easier and more accurate, it's a good idea to start with a small drill bit and progressively move to a larger one. If your largest drill bit is still too small for the button to fit through, it's possible to widen it with a circular file. It doesn't have to be perfect, as imperfections in the circle are masked by the button's lip. Now that the button's in we can secure it in place using its nut. As you can see here, I've also drilled a hole for an LED, which we'll later configure to light up when the button is pressed. The next thing we'll need for this build is a SATA male to female power extension cable. To wire up the button to it we'll first cut through the yellow wire, which corresponds to the 12v rail from the power supply, and solder a spare length of yellow wire to one of the ends, wrapping the joint afterwards with electrical tape or heatshrink. The other end of this extension can now be soldered to the button, but first we need to identify which contacts to solder it to. So after making sure that the button is turned on, we can use a multimeter to check which contacts get connected together, and then solder the yellow extension to either one of them. Now we can get yet another length of spare yellow wire, solder it to the other contact. Its loose end can now be soldered to the remaining wire on the power cable. These steps need to be repeated in exactly the same way for the red wire, which is the 5v rail. However, on the spare length of wire that connects to the female side of the extension cable, we need to add an extra little blue wire. This is for wiring up to the LED later. The LED obviously needs a ground connection too, so we can cut through either one of the black wires, and twist them back together after exposing the ends. This leaves us with some exposed copper to which we can solder a ground wire for the LED. After insulating the joint we can solder the end of this wire to the cathode leg of the LED. For reference, the cathode leg of an LED is usually the one that goes to the larger plate inside the diode itself. To the other leg we can solder a current limiting resistor. This drops the 5v rail down to whatever the LED needs, and you can use the values in this chart depending on the colour of your LED. To the other end of the resistor we can solder that extra blue wire that we added earlier. The LED can now be inserted into its hole and glued in place. So that's the backup button completed, and it's ready to fit into the case. However, if you're the kind of user who likes a tidy looking interior to your PC, you might want to consider using some braided sheathing over the wires to give it a more professional appearance. So now we can put the case back together and plug the button in between the power supply and a additional blank hard drive, which will soon function as the backup hard drive. So, after making sure that the backup button is on, we can boot the computer up and enter into the BIOS, as we need to enable SATA hot swapping so that the computer will treat the backup drive as removable storage. This feature is available on most decent motherboards, however if yours doesn't have it you can use a SATA to USB adapter instead. The process of enabling hot swapping will vary depending on your motherboard brand, so you may need to refer to the user manual if you don't know how to do it. So once hot swapping is enabled for the backup drive, we can save the changes and let the computer now boot into Windows. Now when the backup button is pressed the drive should be detected automatically by the system, and we can now set up the software for it. So to get the backup to launch automatically we'll be using a free piece of software called FreeFileSync. As the official installer annoyingly tries to install optional adware, take care to deselect it during installation. After installing it we can launch the main program by double clicking the green icon on the desktop. We'll start by choosing the folders that we want the software to backup by pressing the browse button on the left hand side. For now let's go with the My Documents folder. Now we need to choose the backup destination. So we'll click the browse button on the right hand side and make a new folder on the backup hard drive with the same name as the source folder. It's worth noting that we can add more source folders and destinations by simply pressing the green plus icon. Now we can press the green cog on the right, and change the mode to mirror mode. This mode is what I recommend for most users, as it makes an exact copy of your source files and synchronises deletions. For example, if you were to make a new word document and start the backup process, the file would be copied to the backup drive. If you were to modify it, the backup process would update it, and if you were to delete it, the file would be deleted on the backup as well. Think of it as a one-way synchronisation folder, keeping an always up-to-date version of your important files. If you don't think this mode will suit your needs, there are plenty of other ways you can configure the software, including versioning and historical backups, so have a look at the software's documentation if you want to find out more. So now we can hit ok, and save our settings as a batch job by pressing this icon. Now we can open the second icon that was placed on the desktop, which launches the monitoring configuration, and go to file>open, and select the batch file we just made. As you can see it's added both the source and destination folders. Now we can go to file and again save it to the C drive, and then close the window. Going to the C drive we can see the new red batch file. This red batch file links back to the original batch file, so we need to leave the original one where it is. The red batch file however can be dragged into the startup folder in the start menu. This means that the computer will launch the batch file at system startup, where it will wait for the backup drive to be detected. So now all that's left to do is try it out. So we'll press the backup button, and the backup should initiate by itself. On your first backup a warning will display informing you that the drives are significantly different. This is normal as it's the first backup, and can be ignored. Once the backup's completed, we can simply press close and turn off the backup drive. As the backup drive is physically disconnected from the power supply when it's not actually backing up, data is given another layer of protection against power supply failures and even ransomware. So what about using external drives with this method? Well, the software side of things is exactly the same - just set your backup folders up on your external drive and it will work in the same way when it gets plugged into the computer. Handy! So, what to do if your motherboard doesn't support SATA hot swapping? Well, as I mentioned earlier there is a walkaround, which is simply to get a SATA to USB converter, and hook the drive up to one of the spare USB headers on the motherboard. So if you've enjoyed this video, don't forget to give it a thumbs up, and perhaps consider subscribing to DIYPerks if you haven't already. Also, if you're interested in another hard drive related video, then why not check out this one in which we attempt to recover the data from a dead drive. The results are really surprising. Other than that, I'll see you next time.",
    "transcript_keywords": [
        "backup",
        "backup drive",
        "button",
        "drive",
        "backup button",
        "LED",
        "backup process",
        "backup hard drive",
        "wire",
        "file",
        "batch file",
        "hard drive",
        "solder",
        "process",
        "SATA",
        "backup button completed",
        "drives",
        "software",
        "batch",
        "red batch file"
    ],
    "transcript_entity_values": [
        "first",
        "12v",
        "these days",
        "SATA",
        "two",
        "5v",
        "poles",
        "FreeFileSync",
        "USB",
        "one",
        "second",
        "DP",
        "DIYPerks"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.14789561927318573,
        -0.02956642396748066,
        -0.050114959478378296,
        0.03881490230560303,
        0.0823502317070961,
        0.03765907883644104,
        -0.00072681182064116,
        0.004008225630968809,
        -0.04190238192677498,
        0.0006906982744112611,
        -0.005314637906849384,
        0.04453536123037338,
        0.04898009076714516,
        -0.08925845474004745,
        -0.023035913705825806,
        0.0344526432454586,
        -0.02237192541360855,
        -0.045042674988508224,
        -0.028554338961839676,
        0.012735474854707718,
        -0.11301735788583755,
        -0.10744678229093552,
        0.05925867334008217,
        -0.007682526484131813,
        -0.027731023728847504,
        -0.06653189659118652,
        0.029123689979314804,
        -0.003360850503668189,
        -0.04502565413713455,
        -0.04328257963061333,
        0.0459345318377018,
        -0.0263080894947052,
        0.019711801782250404,
        -0.010349847376346588,
        -0.022501563653349876,
        0.04354039952158928,
        -0.017614372074604034,
        0.027028648182749748,
        -0.061609651893377304,
        -0.011107686907052994,
        -0.009336111135780811,
        -0.06658343225717545,
        -0.08441014587879181,
        0.04460547864437103,
        -0.05003298446536064,
        -0.01912657916545868,
        -0.028664587065577507,
        0.06398701667785645,
        0.0557500422000885,
        0.03436267003417015,
        0.054040729999542236,
        -0.012992863543331623,
        -0.014478429220616817,
        -0.08549271523952484,
        -0.038259103894233704,
        0.060712192207574844,
        0.0034942547790706158,
        0.0015704808756709099,
        -0.052375856786966324,
        -0.051583509892225266,
        0.08740293979644775,
        -0.06628136336803436,
        -0.025396399199962616,
        -0.020128389820456505,
        0.04967273399233818,
        0.15493284165859222,
        -0.024238495156168938,
        0.06309014558792114,
        -0.10172663629055023,
        -0.04126755893230438,
        -0.041438374668359756,
        -0.0038067414425313473,
        -0.06747818738222122,
        0.10182520747184753,
        0.0219645407050848,
        -0.05177921801805496,
        -0.026858843863010406,
        0.01029345951974392,
        -0.11206988990306854,
        0.011636575683951378,
        -0.014150972478091717,
        -0.04422346130013466,
        -0.06401139497756958,
        0.028306271880865097,
        -0.004684124141931534,
        0.03163031488656998,
        0.017838820815086365,
        0.03798546642065048,
        -0.010709394700825214,
        -0.0638849139213562,
        0.018158165737986565,
        0.04416200518608093,
        0.05876844376325607,
        -0.058644410222768784,
        0.084879070520401,
        0.03121938183903694,
        -0.014318297617137432,
        0.0315338559448719,
        -0.010669027455151081,
        -0.02548150345683098,
        0.028233880177140236,
        0.053424376994371414,
        0.011246049776673317,
        -0.05620979890227318,
        0.038763221353292465,
        -0.012610886245965958,
        0.028134983032941818,
        0.02454187721014023,
        0.045006077736616135,
        -0.006714074406772852,
        -0.09502370655536652,
        0.06694505363702774,
        -0.05844712257385254,
        -0.0014110036427155137,
        0.008753219619393349,
        -0.04235382005572319,
        -0.02436886914074421,
        0.03234230354428291,
        0.09916482120752335,
        -0.08339269459247589,
        0.11398661881685257,
        -0.0034859091974794865,
        -0.010832215659320354,
        -0.054639630019664764,
        0.01935436576604843,
        -0.038777146488428116,
        0.04912012442946434,
        4.378255075280323e-33,
        0.015268176794052124,
        0.10722746700048447,
        -0.030548598617315292,
        -0.059141382575035095,
        0.05258258432149887,
        0.04765758663415909,
        0.05999569594860077,
        0.028717750683426857,
        -0.09346321225166321,
        0.04157528281211853,
        0.019426902756094933,
        0.01531609520316124,
        -0.013958669267594814,
        0.02060340717434883,
        -0.02508980967104435,
        -0.05414114147424698,
        0.027995575219392776,
        0.04743078351020813,
        0.0399969182908535,
        -0.11198630183935165,
        0.051842547953128815,
        0.0673345997929573,
        0.0012454233365133405,
        0.042601801455020905,
        0.002584535162895918,
        -0.0012893612729385495,
        0.08984015136957169,
        0.070664182305336,
        0.06523589044809341,
        -0.017855875194072723,
        -0.008335327729582787,
        -0.013993519358336926,
        -0.0011623711325228214,
        0.0008977447869256139,
        -0.021532557904720306,
        0.004006796516478062,
        -0.0987049862742424,
        -0.05483881011605263,
        0.005117486696690321,
        -0.020483531057834625,
        -0.033208660781383514,
        -0.05772130563855171,
        -0.03481872007250786,
        -0.06881680339574814,
        -0.10359950363636017,
        -0.0011998004047200084,
        0.037894971668720245,
        -0.016011204570531845,
        -0.034579623490571976,
        -0.0170209389179945,
        0.00435491232201457,
        0.013896315358579159,
        -0.020651189610362053,
        -0.11271174997091293,
        -0.033076200634241104,
        -0.09815844148397446,
        -0.0026675795670598745,
        -0.041157905012369156,
        0.01716158539056778,
        -0.05216997116804123,
        0.09060485661029816,
        -0.017851708456873894,
        0.02310776151716709,
        -0.01474879588931799,
        -0.12673698365688324,
        0.014552753418684006,
        -0.01132627110928297,
        -0.0021453986410051584,
        0.018776288256049156,
        0.01987086422741413,
        0.030378147959709167,
        0.022811347618699074,
        -0.06034526973962784,
        -0.08404847234487534,
        0.059930358082056046,
        0.027166718617081642,
        -0.05363910645246506,
        0.0067824386060237885,
        0.06419125199317932,
        -0.021116437390446663,
        -0.06986097246408463,
        -0.09349220991134644,
        -0.04722664877772331,
        -0.028062853962183,
        0.12717267870903015,
        0.01587381213903427,
        -0.0044370731338858604,
        -0.05115705728530884,
        0.00645281421020627,
        -0.01998533308506012,
        0.021453900262713432,
        0.0007788352086208761,
        -0.04768986254930496,
        -0.013163159601390362,
        0.04640469327569008,
        -5.035921389362346e-33,
        0.050969645380973816,
        -0.0182462390512228,
        0.010391895659267902,
        0.055779047310352325,
        -0.008315679617226124,
        0.08739349246025085,
        -0.03442101553082466,
        0.05329957976937294,
        0.02124756947159767,
        0.006561641581356525,
        -0.030649710446596146,
        -0.00514469388872385,
        -0.06219596415758133,
        -0.12120992690324783,
        -0.02535288594663143,
        0.03605927526950836,
        -0.019658774137496948,
        -0.01593514159321785,
        -0.061319585889577866,
        -0.06039058044552803,
        -0.020812075585126877,
        0.0372067391872406,
        0.0007545725093223155,
        0.07050179690122604,
        -0.05071043595671654,
        -0.04106868430972099,
        0.0029900192748755217,
        0.11419592052698135,
        0.09766529500484467,
        -0.04965396225452423,
        -0.005098002962768078,
        -0.005026215221732855,
        -0.00011708770762197673,
        0.0021164328791201115,
        -0.022856691852211952,
        0.05796034634113312,
        -0.02048647776246071,
        0.10857094079256058,
        0.019536955282092094,
        -0.0006735518691129982,
        -0.004501972813159227,
        -0.05364527180790901,
        -0.06321404874324799,
        -0.030657313764095306,
        -0.0035689491778612137,
        -0.01179404929280281,
        -0.09509413689374924,
        0.052039746195077896,
        0.004831303842365742,
        0.05462033674120903,
        0.0189808439463377,
        0.02785635180771351,
        0.010419722646474838,
        0.002731514163315296,
        -0.013546600937843323,
        0.08315568417310715,
        0.04196421429514885,
        0.014450369402766228,
        0.021939346566796303,
        0.03345826640725136,
        -0.045572616159915924,
        -0.05720655992627144,
        0.10269603878259659,
        0.0373820886015892,
        -0.008600098080933094,
        -0.04995761066675186,
        0.10985290259122849,
        0.06038473919034004,
        -0.044815316796302795,
        0.04323297366499901,
        0.005334325134754181,
        0.05052882805466652,
        0.0537920705974102,
        -0.07154982537031174,
        0.05492142587900162,
        -0.008620178326964378,
        -0.0009527941001579165,
        -0.08405803889036179,
        0.024251308292150497,
        -0.012016543187201023,
        0.007115751504898071,
        0.02253102697432041,
        0.05544745549559593,
        0.018058093264698982,
        -0.031544674187898636,
        -0.011557850055396557,
        -0.0011558202095329762,
        0.04221683740615845,
        0.06532762944698334,
        0.012264572083950043,
        -0.05540969595313072,
        0.05327530577778816,
        0.028198719024658203,
        0.10238924622535706,
        0.0410076268017292,
        -5.478022657712245e-08,
        -0.06524498015642166,
        0.05695885047316551,
        0.004786336794495583,
        0.07194855064153671,
        -0.00972774438560009,
        -0.07030130177736282,
        0.02334536612033844,
        0.05345028638839722,
        -0.0280314851552248,
        -0.04267481714487076,
        0.026701580733060837,
        -0.05734216794371605,
        -0.08900328725576401,
        0.06807146221399307,
        -0.06838679313659668,
        -0.0013421104522421956,
        0.03620637580752373,
        0.03370535373687744,
        0.030041316524147987,
        0.03612605109810829,
        0.07110142707824707,
        -0.04108038172125816,
        0.07274339348077774,
        0.044479239732027054,
        0.05092887207865715,
        -0.009724442847073078,
        -0.0129740284755826,
        0.08772192895412445,
        0.07909523695707321,
        -0.018711049109697342,
        -0.0032479441724717617,
        -0.05438472330570221,
        -0.022710241377353668,
        -0.008015287108719349,
        -0.07396106421947479,
        0.03515659645199776,
        0.0014790790155529976,
        0.016179131343960762,
        -0.032288651913404465,
        -0.013201248832046986,
        0.07747845351696014,
        -0.03154115751385689,
        -0.060979701578617096,
        0.0029289727099239826,
        -0.022446556016802788,
        -0.0391923263669014,
        -0.07446184009313583,
        -0.03532670810818672,
        -0.05224389582872391,
        -0.01716364175081253,
        0.006859577726572752,
        -0.08703120052814484,
        0.10644786059856415,
        0.06818170845508575,
        0.08293218910694122,
        0.0301988422870636,
        -0.007493544369935989,
        0.04576990380883217,
        0.1543014943599701,
        0.09866337478160858,
        0.06346651166677475,
        -0.030146250501275063,
        -0.027212373912334442,
        0.01339830830693245
    ]
}