{
    "id": "c0TcGjzKbag",
    "title": "No Backlight? No Problem - Sun Vision rE reflective LCD Display",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-04-22T17:04:40Z",
    "video_url": "https://www.youtube.com/watch?v=c0TcGjzKbag",
    "category": "Science & Technology",
    "tags": [
        "reflective display",
        "rlcd",
        "reflective lcd",
        "anti blue light dispaly",
        "display for sensitive eyes",
        "sunvision display",
        "e-ink monitor alternatives",
        "alternative monitors",
        "monitor",
        "gaming monitor",
        "gaming display",
        "eink display"
    ],
    "views": 1055445,
    "likes": 38862,
    "comments_count": 2463,
    "description": "Get 20% off DeleteMe US consumer plans when you go to   and use promo code LTT at checkout. DeleteMe International Plans:   Check out the MSI MPG 491CQP QD-OLED at   It's not an OLED, but it is pretty unique. This Sun Vision Display brings what they call rLCD, a whole new tech that we need to reflect on for a second. So is the solution any good? Like Blue light defeating good? Well, only one way to find out!  Discuss on the forum:  Check out the Sun Vision Display rE rLCD Display:  Buy a ViewSonic XG2431 24\" 240Hz Gaming Monitor:  Buy a Dell Alienware AW3225QF 31.6\" QD-OLED 240Hz Curved Gaming Monitor:  Buy a LG UltraGear 27\" QHD 240Hz Gaming Monitor:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:18 What the heck is this? 3:07 Outdoors Experience 4:05 What makes this unique 8:04 Why does it exist 9:02 A weird choice 9:53 Indoor Experience 14:12 Outro",
    "description_links": [
        "http://joindeleteme.com/LinusTechTips",
        "https://international.joindeleteme.com/",
        "https://lmg.gg/C042H",
        "https://linustechtips.com/topic/1567378-how-could-the-brightest-monitor-have-no-backlight-sun-vision-re-rlcd-display/",
        "https://lmg.gg/TpyTz",
        "https://geni.us/WqAc",
        "https://geni.us/Y1vC",
        "https://geni.us/UxH5k",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "Ah, the sun, a beloved source of life on our planet, but also deadly. It causes cancer, evaporates our water, and worst of all, makes it hard for me to read my screen. Or at least it used to. This monitor from Sun Vision Display is the brightest we have ever seen. It has no backlight, allowing it to draw just six watts of power and measuring over 2,200 nits. Look at how it handles direct sunlight compared to a traditional display. In fact, the more sunlight there is, the more powerful it becomes. But there is a small catch because you see the less sunlight there is, the less powerful it becomes. But unlike your phone, it's not using a sensor to adjust its output and the trick lies in the panel technology itself. And I'll tell you all about it. Right after this message from our sponsor. MSI, experience stunningly color accurate visuals and blistering fast response times with MSI's new QD OLED monitors. Plus use their gaming intelligence app to fine tune your experience so you're always locked, loaded, and ready to go. Check them out down below. The name of the brand, SunVision Display, might give you your first clue as to how this monitor works, but it's not solar powered. At least not in the way that you think. I already said it doesn't have a backlight so all right Linus it's a self-emissive OLED then? No. More like no- LED. In fact it uses an LCD panel but unlike the ones you're used to it has no backlight of any kind. It doesn't even have a front light like this e-ink monitor from Dasung which seems kind of crazy in 2024 but it isn't exactly new. The Game Boy Color and Game Boy Advance both used LCD displays that weren't lit so how did we see anything on those? They were reflective. Just behind the display layer was a mirror-like layer that reflected ambient light back to you and this monitor operates on the same principle. Overall I'd say the specs are not the highlight here it's 32 inches 1080p so the pixel density is a little on the low side for our modern display it's 60 hertz it has curiously dual HDMI inputs but no DisplayPort and then it has a USB A port for charging? That's a little weird I mean built-in hubs we've seen that before charging not so much. It has built-in speakers, VESA mounting holes, old school behind the monitor so you can't see the labels navigation and the pixel response times are rated at 10 milliseconds. Really. Two-thirds of a frame just to finish the transition. Let's give it a shot, but not here. Let's take it to its natural habitat. Given we normally test displays in near blackness in order to prevent ambient light from affecting our measurements, we had to get a little creative in order to test this thing. Luckily we were graced with a bright sunny day so we brought the monitor outside to see it in its ideal environment. At a hundred percent window size, meaning basically the full screen is entirely white, this hits over 2,200 nits. That is truly impressive, but here's something to think about. A white piece of paper in that same sunlight measured nearly 24,000 nits. So there's clearly a massive amount of light that's being lost before it's reflected back to our eyes. With that said, it's still vastly more readable than pretty much any other display that we could bring outside. So, is there a use case for this thing? Sure. No. A boat, a boat that doesn't get wet. It's not IP rated. And while it does a great job of maintaining the readability of text under very challenging conditions, you'll notice that as soon as you bring up pretty much anything else, it doesn't look that good. It's not because it uses a different panel technology like the e-ink that we checked out recently. It's an LCD like any other. So what is up with that? Well, for starters, the rated contrast is just 25 to one. And under our test conditions, we measured under that. Yikes. For reference guys, even without any backlight dimming tricks, a typical IPS display these days would be rated to about a thousand to one. With VA being about five times that and OLED panels more like a million to one. However, it's worth noting that you can have the best contrast ratio in the world. But if your peak brightness is well below the environmental conditions, your eyes, which are adjusted for sunlight, are not going to be able to perceive that contrast. I mean, okay, here, here, this is a perfect example. Look at my OLED phone, right? A million to one my a**. So the disadvantage for our RLCD is that it can't really darken or boost its brightness relative to its environment but kind of like a book what it can do is reflect the conditions of its environment which keeps it within a usable range for your eyes, so to illustrate this right here looks black but when we measured it we found that it was over 100 nits which to put in perspective is brighter than what would have been white on the CRT monitors in my school computer lab as a kid. Another disadvantage that stems from reflecting environmental light is that the display's color performance is also impacted by factors like time of day and weather. If you were using this on a patio, for instance, the color temperature of the display would change with the rising and setting of the sun. I mean, you're probably not going to notice this since your eyes and your brain have God-tier auto white balance. But this lack of consistency means that this thing is functionally useless for color sensitive work. And even if it was accurate enough, the color gamut wouldn't be. It managed just 17% of the sRGB color space, which doesn't make sense. I mean, if you're feeding it direct sunlight, which is, you know, all of the colors, why doesn't it s*** all those colors back out into your eyes? Well, actually, that's kind of the problem. It does. Here's a keyboard towel from LTTstore.com. Clean yourself up. The thing is, if you want to make specific colors, you don't want a full spectrum light cannon. You want fine control over specific wavelengths. So a normal monitor spectral distribution has very acute peaks for green, red and blue, but the diffuse spectral power distribution of sunlight means you can't get pure green very easily. Combine that with the lack of brightness needed to create some colours and you've got a recipe for bad colour accuracy. And I promise you guys, digging around in the comically bad on-screen display is not going to fix it. Maybe gaming is good? No. Well, you can certainly play games. They aren't even sugar-coating how not ideal it is. Even for a 60 Hertz display, the rated 10 milliseconds of pixel response time means that any fast paced motion is going to be noticeably smeary to the eye. And we found the input latency was best described as gnarly. It wasn't easy to get a number that's comparable to our other testing because our latency tester needs to be mounted to the display and inconveniently blocks this one from outputting anything at all. Ha ha! So then, you've heard a lot of arguments for not buying the SunVision RLCD display. Maybe you're ready for why it exists? Well, it was a sign. No, not that kind. This kind. SunVision Display specializes in using this technology in applications like digital signage where, honestly, it makes a ton of sense. I mean, how cool would it be to have your food truck or your... ...golf course weather report be readable in basically any real-world conditions? And this is all while consuming a tiny fraction of the power of a regular display. That's pretty cool, and business seems to be going pretty good for them. So good, in fact, that some folks started buying their signage products to use with their computers, and... ...well, the customer is always right, right? So they made... ...this. Except... Sometimes the customer isn't right. The RE monitor is heavily marketed towards people who suffer from computer vision syndrome. And while CVS does exist, it's one of those things where the nuggets of good information are often buried in mountains of marketing nonsense and pseudoscience. For example, SunVision talks about blue light emissions, but as we mentioned in our E-Ink monitor review, there isn't strong evidence that blue light emitted from a screen is harmful at all. And, when we look at a spectrogram, we can see that because this monitor's backlight is effectively a mirror that is bouncing back broad-spectrum sunlight, this thing reflects more blue light towards you than a regular monitor would emit. Just so you can actually see what we're doing on the monitor, we're gonna try and give it enough light to... ...like, look like anything. Unless you happen to use lights that are this bright, the RE monitor is just not a good experience indoors. It's usable in a typical office, but here go ahead and hit it. It's really not bright. And, well, you probably won't need dark mode if you happen to be a dark mode kind of person. The lack of contrast can make distinct shades of grey disappear faster than a book about gender in a Florida library. And this is a real problem. In a 300 lux office environment, this achieves just 5.2 nits. For contrast, pun intended, a white sheet of paper is 90 nits. So why are we getting under 10% of the amount of reflected light compared to this? It comes down to the way the panel is made. Each of the individual pixels consists of a mirror, a transistor and a 10 micrometer surrounding gap. The problem is that the gap part is non-reflective and with their current manufacturing capabilities, it's non-shrinkable. So under a microscope, only about 80% of the surface area of the display is reflective at all. And even the parts that are reflective have to deal with a lot of loss. Have you ever taken apart a regular monitor and noticed how flipping bright the backlight is compared to the final image? Well, that's because every layer of a display including polarizing filters, the glass, the diffusers There's more layers than you think and all of them are lossy. And in our reflective display, light has to travel through all of those layers not once but twice. So to even achieve the brightness that they have Sun Vision had to compromise on pixel density. Optimizing their mirror to gap ratio, and they had to go with a color filter that allows more light through but compromises color saturation We were curious if this was also the reason that they left off having a front light which might have improved indoor usability but at the expense of probably needing yet another diffusion layer when we asked Sun Vision though, it turns out that it was because their customers said they wouldn't use it and didn't want it. Which is fair enough, I guess since If I can afford one of these, I can also afford a waterfront property with floor-to-ceiling windows to let the sun shine through on it. Even on special, for $1,499, this thing ain't cheap. Which would bother me less if it wasn't for the budget-feeling build quality. I mean, admittedly, I have no idea what the margins are like on a niche product like this. Obviously, they aren't making that many of them But even Dasung was able to produce what felt like a more complete package for their e-ink display. That being said, if you can afford it and you absolutely MUST not have a backlight in your monitor I think I would recommend this one over an e-ink display thanks to its better motion performance. And that would be especially true if they do a V2 that has some kind of flicker-free LED front light. As it is now, though I think I'll stick to regular monitors. You can get some absolutely sick displays for this kind of money. And we're gonna have this link down below, but we're also gonna put some stuff we'd actually recommend down there, along with this link to our sponsor. Delete Me. Privacy isn't just about individuals, it's about families. That's why Delete Me is expanding to offer coverage not just for yourself, but for your loved ones too. Their family plans make sharing and caring simple. With their family account management, you can easily add multiple members, ensuring personalized protection for each person and make overseeing your family's privacy easier than ever. Their privacy-first design means that each family member gets their own data sheet, keeping their online footprint secure. From kids to adults, everyone's covered, reducing the risk of exposure, spam, and scams. Choose Delete Me for peace of mind for your entire family in the digital world. Check them out using the link below today and use code LTT at checkout for 20% off. Thanks for watching. If you guys liked this video, go check out the one we did on Dasung's E-Ink Monitor. They have a second gen now, right? They have the full color, yeah. Ooh, full color. We're gonna do a video on that soon, right? Sure. Yeah.",
    "transcript_keywords": [
        "Display",
        "monitor",
        "light",
        "color",
        "kind",
        "sunlight",
        "Sun Vision",
        "sun",
        "Sun Vision Display",
        "eink monitor",
        "backlight",
        "beloved source",
        "source of life",
        "thing",
        "nits",
        "OLED",
        "eink display",
        "eink",
        "good",
        "blue light"
    ],
    "transcript_entity_values": [
        "IP",
        "Sun Vision Display",
        "Florida",
        "DisplayPort",
        "one",
        "second",
        "about five",
        "six watts",
        "first",
        "100",
        "CRT",
        "E-Ink Monitor",
        "Hertz",
        "Dasung",
        "A million to one",
        "1,499",
        "Sun Vision",
        "VESA",
        "10%",
        "Dasung",
        "10 micrometer",
        "10 milliseconds",
        "SunVision Display",
        "Delete Me",
        "E-Ink",
        "today",
        "nearly 24,000",
        "Two-thirds",
        "MSI",
        "300",
        "VA",
        "a ton",
        "about a thousand to one",
        "just 25 to one",
        "60 hertz",
        "a hundred percent",
        "RLCD",
        "20%",
        "LTT",
        "just 17%",
        "90",
        "SunVision",
        "USB",
        "over 2,200",
        "Linus",
        "only about 80%",
        "LCD",
        "QD",
        "60",
        "32 inches 1080p",
        "2024"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "PERCENT",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE"
    ],
    "vector": [
        -0.0949702113866806,
        0.010980031453073025,
        0.026862137019634247,
        -0.014497904106974602,
        0.05238020792603493,
        0.037299469113349915,
        0.00399346137419343,
        0.02255489118397236,
        -0.004238406661897898,
        0.010255975648760796,
        -0.00418742373585701,
        0.013699259608983994,
        0.04128202423453331,
        0.011880073696374893,
        0.06788556277751923,
        0.03727462887763977,
        0.09947976469993591,
        -0.03942228481173515,
        0.01390146929770708,
        -0.012697928585112095,
        0.031801436096429825,
        -0.0692976787686348,
        0.005162893328815699,
        -0.04280121624469757,
        -0.002504546195268631,
        -0.036343373358249664,
        0.01450430229306221,
        -0.03960198909044266,
        -0.04399256035685539,
        -0.0003410562057979405,
        0.012079991400241852,
        0.04683817923069,
        -0.07413066178560257,
        0.04301541671156883,
        -0.023986514657735825,
        -0.05311210826039314,
        0.05327868461608887,
        -0.10522204637527466,
        -0.050410859286785126,
        -0.024730678647756577,
        -0.06472799926996231,
        -0.054180894047021866,
        -0.008056010119616985,
        -0.0619514063000679,
        0.03659816086292267,
        -0.10968541353940964,
        0.02061828225851059,
        -0.005509668495506048,
        -0.025575244799256325,
        -0.06660325080156326,
        0.06651231646537781,
        -0.03259311988949776,
        0.011677546426653862,
        0.003378793830052018,
        0.007921583950519562,
        0.09255034476518631,
        -0.08114586025476456,
        -0.015215110965073109,
        0.04439986124634743,
        -0.05598096549510956,
        0.07685030996799469,
        -0.018369199708104134,
        0.00090222671860829,
        0.027368487790226936,
        -0.007957999594509602,
        0.03293886408209801,
        -0.07611992210149765,
        -0.07406321913003922,
        0.0031845606863498688,
        -0.05006057024002075,
        -0.08150025457143784,
        -0.0006077871075831354,
        0.0039208861999213696,
        -0.053213413804769516,
        -0.0018565468490123749,
        0.03906255215406418,
        0.06659774482250214,
        -0.10772840678691864,
        -0.04282568022608757,
        -0.041900116950273514,
        0.10018457472324371,
        0.036708418279886246,
        -0.036875855177640915,
        0.06712102890014648,
        0.09421814233064651,
        -0.07165168970823288,
        0.046370767056941986,
        0.10236606001853943,
        0.01759546808898449,
        -0.014591830782592297,
        -0.0006171410204842687,
        0.07620689272880554,
        -0.06246115267276764,
        0.033206578344106674,
        -0.015892494469881058,
        -0.01942657306790352,
        0.012453430332243443,
        -0.0667262077331543,
        0.004155744798481464,
        0.012243854813277721,
        -0.007361429277807474,
        -0.003930582199245691,
        0.04833119362592697,
        0.010122078470885754,
        -0.07218711823225021,
        -0.04354251176118851,
        0.0355055071413517,
        0.07236266881227493,
        -0.061857517808675766,
        -0.043074965476989746,
        0.007950722239911556,
        0.0603194460272789,
        -0.053935129195451736,
        0.04189358651638031,
        -0.007382705807685852,
        0.07331482321023941,
        0.013532765209674835,
        0.00917511060833931,
        0.04289185255765915,
        -0.05894039571285248,
        0.0013760236324742436,
        0.010248065926134586,
        -0.009740051813423634,
        0.03208567947149277,
        0.09934648871421814,
        0.02553671970963478,
        -0.027345286682248116,
        9.352792149642729e-33,
        0.008586486801505089,
        0.11760454624891281,
        -0.11369328945875168,
        -0.07611101120710373,
        0.010707736015319824,
        0.14101476967334747,
        0.05087165907025337,
        0.07600752264261246,
        0.0156162790954113,
        -0.026347778737545013,
        0.03901952505111694,
        0.02316177822649479,
        -0.005124695599079132,
        0.008363896980881691,
        0.053257331252098083,
        -0.08232751488685608,
        0.015676820650696754,
        0.049034833908081055,
        -0.08671589940786362,
        -0.03310689702630043,
        -0.033592987805604935,
        -0.002722695004194975,
        0.023041540756821632,
        -0.06491738557815552,
        0.006004527676850557,
        0.025645768269896507,
        0.062288105487823486,
        0.06990309804677963,
        0.03353405371308327,
        0.015988454222679138,
        -0.013650495558977127,
        -0.0329732671380043,
        0.05593113973736763,
        0.01723431795835495,
        -0.03226079046726227,
        0.005502182524651289,
        -0.12867964804172516,
        -0.0309482179582119,
        -0.005515669006854296,
        -0.0032813644502311945,
        -0.02560023032128811,
        0.15383677184581757,
        -0.03556918725371361,
        -0.01607804372906685,
        -0.017365531995892525,
        0.03355611488223076,
        0.02598380111157894,
        0.036325275897979736,
        -0.0026097598019987345,
        0.05310972034931183,
        -0.05920661985874176,
        0.00876725185662508,
        -0.11004585027694702,
        -0.09334278851747513,
        -0.04209716245532036,
        0.035690534859895706,
        0.0009352503111585975,
        0.026662657037377357,
        0.008754716254770756,
        0.035502802580595016,
        0.03404862806200981,
        -0.01843639276921749,
        -0.016596509143710136,
        0.0021334760822355747,
        -0.0646425262093544,
        0.031294889748096466,
        0.046081602573394775,
        0.0467316210269928,
        -0.14520370960235596,
        -0.03333238884806633,
        0.02490796521306038,
        -0.0228703822940588,
        0.10475266724824905,
        -0.06530927121639252,
        0.09951163828372955,
        -0.027716241776943207,
        0.012292545288801193,
        0.03303687646985054,
        0.014085203409194946,
        -0.04941682890057564,
        -0.06568620353937149,
        -0.012538096867501736,
        0.07705075293779373,
        -0.036224063485860825,
        0.0027818602975457907,
        -0.008360179141163826,
        -0.040594205260276794,
        0.027459394186735153,
        -0.033714648336172104,
        -0.04880974814295769,
        0.004186063073575497,
        -0.06586694717407227,
        -0.012276430614292622,
        -0.014031657949090004,
        -0.050963252782821655,
        -7.559936247292238e-33,
        -0.0034908822271972895,
        -0.007006093394011259,
        -0.03547804430127144,
        -0.046272873878479004,
        0.05402657017111778,
        -0.07386678457260132,
        0.04919988289475441,
        0.07130257785320282,
        0.015025676228106022,
        -0.05134247988462448,
        0.12875929474830627,
        0.04109688103199005,
        -0.1275893747806549,
        0.04058842733502388,
        -0.02860012650489807,
        -0.044754449278116226,
        0.03530508279800415,
        -0.013968311250209808,
        -0.05429602786898613,
        0.026200124993920326,
        8.932118362281471e-05,
        0.023848270997405052,
        -0.0031022480688989162,
        0.05672934278845787,
        0.026804549619555473,
        0.05724307522177696,
        0.08571647107601166,
        0.01991628110408783,
        -0.021256381645798683,
        0.04276174306869507,
        -0.027158543467521667,
        0.01421212125569582,
        0.013902838341891766,
        -0.01922820508480072,
        0.08138681948184967,
        -0.0014856875641271472,
        0.06946223974227905,
        -0.04978780075907707,
        -0.06272866576910019,
        0.01899159513413906,
        0.004730144049972296,
        0.07661745697259903,
        -0.03309960290789604,
        -0.02501973882317543,
        -0.01819315366446972,
        0.0434255450963974,
        -0.026291310787200928,
        -0.04435979202389717,
        -0.01090269722044468,
        -0.006035470869392157,
        -0.022367389872670174,
        -0.04470657929778099,
        0.035471826791763306,
        0.005795972887426615,
        -0.040436889976263046,
        -0.06313923746347427,
        0.012834935449063778,
        0.11674746125936508,
        -0.012866702862083912,
        -0.01933147758245468,
        0.07097917050123215,
        0.055795349180698395,
        -0.034881919622421265,
        -0.05882668495178223,
        0.05424291640520096,
        -0.04267532750964165,
        0.03047901578247547,
        0.02681402489542961,
        0.10462657362222672,
        0.011028419248759747,
        -0.0089944526553154,
        -0.08122307807207108,
        -0.05481090396642685,
        -0.05368490889668465,
        -0.01784006878733635,
        0.036931734532117844,
        0.034733809530735016,
        0.0006132760900072753,
        -0.001244196086190641,
        0.015116974711418152,
        -0.007593093439936638,
        -0.04394756630063057,
        0.059496067464351654,
        0.0290965735912323,
        0.06600485742092133,
        -0.04984061047434807,
        -0.02363729290664196,
        -0.027538921684026718,
        -0.07204914093017578,
        0.04110468178987503,
        -0.09896457195281982,
        0.02995147369801998,
        0.014833711087703705,
        0.05141439661383629,
        0.1188838928937912,
        -5.010171832964261e-08,
        -0.011576774530112743,
        -0.010289449244737625,
        0.006775202229619026,
        0.04348945617675781,
        -0.037897299975156784,
        -0.10410609841346741,
        -0.00638016639277339,
        -0.06487127393484116,
        0.025454094633460045,
        -0.07140524685382843,
        -0.027576103806495667,
        -0.10732412338256836,
        0.03498271107673645,
        0.009114214219152927,
        -0.029928870499134064,
        0.02271287702023983,
        -0.025586819276213646,
        -0.007326625287532806,
        -0.04318489879369736,
        0.026996146887540817,
        -0.023134995251893997,
        0.02008388191461563,
        0.04717801883816719,
        0.015001455321907997,
        0.045993734151124954,
        0.10121849924325943,
        -0.012612029910087585,
        0.0018650651909410954,
        0.09591700881719589,
        -0.03596979379653931,
        0.035417355597019196,
        -0.00506257452070713,
        0.04568127542734146,
        0.0006749021704308689,
        0.00891288835555315,
        -0.03704826161265373,
        -0.03130892291665077,
        0.016524475067853928,
        0.11080322414636612,
        0.12478742748498917,
        -0.03610577806830406,
        -0.05903405323624611,
        -0.03629568964242935,
        0.04182637110352516,
        0.06819465011358261,
        -0.06039620190858841,
        -0.03745831176638603,
        -0.08457380533218384,
        -0.0911935344338417,
        0.0067296139895915985,
        0.007492956705391407,
        -0.07888674736022949,
        -0.04559977352619171,
        -0.08677627891302109,
        0.023691972717642784,
        -0.04567041993141174,
        0.061715614050626755,
        0.09272713959217072,
        -0.020779510959982872,
        0.031151456758379936,
        0.08664621412754059,
        -0.07102110981941223,
        -0.023978756740689278,
        0.08048564940690994
    ]
}