{
    "id": "C4J3QREiuJ0",
    "title": "When Phones Were Fun: Samsung's PalmOS Flip Phone (SPH-i500, 2002)",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-08-06T21:07:29Z",
    "video_url": "https://www.youtube.com/watch?v=C4J3QREiuJ0",
    "category": "Science & Technology",
    "tags": [],
    "views": 529656,
    "likes": 18247,
    "comments_count": 955,
    "description": "As this episode of \"When Phones Were Fun\" hits the server, Samsung has just announced its Galaxy Note20 device family, the tenth generation of its stylus-centric smartphone first announced in 2011. The subject of todays throwback is *not* that first Galaxy Note  but rather, an 18-year-old forerunner that folds like the Galaxy Z Flip; packs a stylus like the Galaxy Note; and despite its age, runs a true smartphone OS. The year is 2002, and the phone is the Samsung SPH-i500  a pioneering smartphone from back in the days when Palms would fold!   [SPECIAL THANKS]  Judie Stanford [GearDiary]:   PhoneScoop:    [SUBSCRIBE TO MRMOBILE]     [ABOUT WHEN PHONES WERE FUN SAMSUNG SPH-i500]  This is the eighth in a series of MrMobile videos exploring the mobile tech world's most vibrant period in design and experimentation. In When Phones Were Fun, Michael Fisher re-reviews cellphones from the golden age of mobile, the decade-long span from the turn of the century to approximately 2009.  When Phones Were Fun: Episode 8 features a deactivated Samsung SPH-i500 device purchased on eBay by MrMoble/Future plc and a Kyocera 7135 purchased on eBay by MrMobile/Future plc. No company paid a fee or otherwise offered compensation in exchange for this coverage, nor did any company preview or approve this content before publication.   [LINKS]  Special thanks to Judie Stanford [GearDiary]:   Sprint PCS Samsung SPH-i500 PalmOS-Powered Phone Review [The Gadgeteer]:   Palm Officially Debuts the SPH-i500 [PalmInfoCenter]:   Samsung SCH-i539 Smartphone Available in China [PalmInfoCenter]:   Bringing PalmOS devices back online  A journey into vintage computing [Medium]:   Samsung SPH-i500 [PhoneScoop]:   Kyocera 7135 [PhoneScoop]:   Samsung SPH-i550 [PhoneScoop]:   New Samsung PalmOS Smartphone Comes to China [BrightHand]:   The History of Us: A Sprint Story [YellowFan Studios]:   Samsung Galaxy Note Unboxing [Pocketnow]:   Throwback Unboxing Palm Pre [Pocketnow]:   Palm Holiday Commercial [The Phone Commercials HD]:   Palm VII Commercial [scienceapps]:   Handspring Treo 180 Commercial [scienceapps]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase. See our affiliate link policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #samsung #palmos #palmpilot #vintagephone #vintagetech #i500 #sprintpcs #pda #whenphoneswerefun",
    "description_links": [
        "https://geardiary.com",
        "https://phonescoop.com",
        "https://www.youtube.com/channel/UCSOp...",
        "https://geardiary.com/",
        "https://the-gadgeteer.com/2003/10/14/sprint_pcs_samsung_sph_i500_palm_os_powered_phone_review/",
        "http://www.palminfocenter.com/view_story.asp?ID=4840",
        "http://www.palminfocenter.com/news/7823/samsung-schi539-smartphone-available-in-china/",
        "https://medium.com/@jankammerath/bringing-palm-os-devices-back-online-a-journey-into-vintage-computing-1282d27406e9",
        "https://www.phonescoop.com/phones/phone.php?p=187",
        "https://www.phonescoop.com/phones/phone.php?id=173",
        "https://www.phonescoop.com/phones/phone.php?p=522",
        "http://www.brighthand.com/news/new-samsung-palm-os-smartphone-comes-to-china/",
        "https://www.youtube.com/watch?v=IGPtWXGpqUw",
        "https://www.youtube.com/watch?v=2nR2ad0Pn-E",
        "https://www.youtube.com/watch?v=tZgdTuv6ylI",
        "https://www.youtube.com/watch?v=NatcefK02L4",
        "https://www.youtube.com/watch?v=uXEnblNKfvA",
        "https://www.youtube.com/watch?v=H58FMSne4U4",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "(gentle chiming music) - There you are, you wonderful weirdo. Samsung just announced its Galaxy Note 20, the 10th generation of its stylist centric smartphone first unveiled in 2011. Now the subject of today's throwback is not that first Galaxy Note, but instead, an 18-year-old forerunner that packs a stylist like the Note, folds like a Z Flip, and despite its age, still runs a true smartphone OS. The year is 2002, and this is the Samsung i500, from back in the days when Palms would fold. (upbeat electronic music) Now, if you've never heard of this phone, don't worry you're not alone. The Samsung of 2002 was a substantially smaller brand and it tended to launch most of its most interesting devices on Sprint, which has never been the United State's largest carrier. RIP, by the way. Smartphones themselves were also virtually unknown at the time. I mean, I was an early adopter and I didn't even get my first Blackberry until 2004. But people did know what this was. In 1996, Palm Computing pioneered a new era of mobile tech with a line of devices called Palm Pilots. Dudes, in the late '90s, rolling up a calendar, notebook, and Rolodex into one device was the cutting edge of mobile tech. The thing is for a long time, PDAs didn't have wireless data, which makes sense since there were no mobile data networks fast enough to support them. Each time you wanted to add new information to a Palm Pilot, you had to drop it into a cradle to synchronize it with your PC. Well, by 2002, those data networks had finally started to crystallize in the form of the first 2G and 3G deployments in the U.S. and wireless carriers were keen to drum up excitement for these new and expensive networks. Sound familiar? So, products started to hit the scene that blended phone and PDA. But capable though they were, those devices like the Treo 180, the Kyocera 6035, and the Samsung i300 were too big and brick-like to really hold my attention. What I wanted was something really small, like the A series clamshells I was already carrying, but with smartphone capabilities, and the SPH-i500 was exactly that. Holding this eBay sourced example from 2002, I can't help but notice its key commonality with the Galaxy Z Flip of 2020. A fragile screen that you can protect by folding it in half. As with nearly all touchscreens of the period though, this one is small and resistive, responding to pressure instead of a change in capacitance. Hence the inclusion of that telescoping stylist, which just like on the Galaxy Note lives in its own little silo. This is Palm software and navigating it, it's easy to see why this platform lasted as long as it did. Only being truly retired 2009 when it was replaced by webOS on the Palm Pre. Sure, the resolution is low and the iconography is simplistic, but everything you could have wanted in a smartphone of the period is here. A datebook, a calendar, to-do list, memo pad. And while the iPhone would later popularize third-party apps with an on-device app store, Apple didn't invent the concept. Even back in the days of the i500, you could download thousands of third-party Palm OS apps. And when I would later buy my first Palm phone, a Treo 700p, I remember my favorite third-party app was an autoresponder that would automatically reply to a missed call with a text message. I never used it, but I thought it was a really cool idea. Now, one thing Palm didn't offer was a text input method you'd actually wanna use. That's what this little touchpad beneath the hinge is for. You use the stylist and an input language called Graffiti to enter text instead, or at least try to. This is my attempt at spelling out Samsung Unpacked in my datebook. Yeah, Graffiti wasn't just drawing letters. You had to do it in the way Palm wanted you to with specific glyphs drawn in a specific sequence. By the time I started using Palm devices, thankfully all of them had keyboards, but I remember hearing about people really getting quick with Graffiti once they adapted. And you can even set specific shortcuts for things like date and time and often used phrases. Then, as now, business people love their lunch meetings. Speaking of shortcuts, boy oh boy did Palm have you covered there. In addition to the home, menu, search, and calculator keys on the touchpad, you got four physical buttons under the screen. They had their defaults, but you can pair them with any app you wanted. Factor in the side keys for phone, voice dial, and another menu key, and that's 11 single touch shortcuts. Even the charging cradle has one. A physical key to sync all data between phone and computer. Kind of like the emergency button on a tricorder. Neat. Also, you've got not just one removable battery, but two right in the box, all for a suggested retail price of 599 at launch. If there's a criticism I can levy against the i500, it's the gulf that existed between its phone and PDA selves. The phone is really just an app that lives in its own silo and some toggles like the talk and end keys only work in the specific context of that app. There was also no camera on the i500, but that was pretty common for the time. What was uncommon was lacking an external display on a clamshell. Oh, the Mobile Intelligent Terminal logo would light up for inbound calls, but there was no way to know who was calling unless you assigned them a custom ringtone. Such as the best manufacturer ringtone of all time, don't @ me, Samsung's \"Ringer 1\". (gentle electronic music) Aw, that's nice. That color ID imperfection would be rectified, not by Samsung, but by Kyocera, with it's very similar 7135 of the same era. This one came to Verizon, so as a Sprint customer I didn't covet it nearly as much, but ironically, I did have more exposure to it because one of my favorite theater professors carried it. And because he had to be available for calls from his agent, I remember this ringtone constantly going off in class. (phone bleeping) (laughs) Keith, you left it on the default? That doesn't sound like you. To close us out, I wanna pour a little out for the sequel that never was. The i550 was supposed to include external caller ID, an MP3 player, SD card support, a camera. And when I first saw it announced on Phone Scoop, I remember spending an entire lunch hour at Bennigan's just scheming up a way to clear enough space on my credit card to buy the thing. No, it wasn't a business launch. But Sprint canceled the i550 to focus on the new Palm Treos. And as far as I can tell, it was only released on China Unicom as the i539 Nevertheless, my friend Judie Stanford got her hands on and i550 prototype back in the day. And while that unit has since been eBayed, her original review of the i500 is still up at The Gadgeteer. But it's not only an awesome nostalgia dive, much of it still holds up today in the context of a defense of our modern foldable phones. As I said in the intro, Samsung is bringing more to the table on both the foldable and pen packing fronts. The Z Fold 2 and Note 20 are doing a lot to bring excitement back to mobile, and I'm eager to cover each. But I'll always have a place in my heart for devices like the i500. A pioneer of the past and an overlooked custodian of an era when phones were fun. (upbeat music) See the description on YouTube for links to Judie's excellent i500 review and her current writing at Gear Diary, as well as a very fun blog post from a guy who got a Palm m515 working in 2019. Crazy. Let me know in the comments if you'd like to see a full video on that 7135 someday. And if you have one of those rare i550s get at me, I'd love to take that off your hands. Samsung wasn't involved in this content and no manufacturer ever has copy approval or an early preview of my videos. Please subscribe to theMrMobile on YouTube if you wanna see more videos like this one. Until next time, thanks for watching, remember to wear your mask when you go out and stay mobile, my friends.",
    "transcript_keywords": [
        "Palm",
        "Galaxy Note",
        "Samsung",
        "phone",
        "wonderful weirdo",
        "Note",
        "time",
        "Galaxy Note lives",
        "called Palm Pilots",
        "Palm phone",
        "Galaxy",
        "devices called Palm",
        "Palm Treos",
        "mobile",
        "Palm Pilots",
        "Palm devices",
        "devices",
        "app",
        "Palm Computing",
        "Palm wanted"
    ],
    "transcript_entity_values": [
        "SPH",
        "2011",
        "eBay",
        "2020",
        "599",
        "an entire lunch hour",
        "third",
        "18-year-old",
        "Rolodex",
        "Kyocera",
        "Palm",
        "Palm Treos",
        "half",
        "Unicom",
        "2009",
        "Phone Scoop",
        "Graffiti",
        "Gadgeteer",
        "the Palm Pre",
        "Samsung",
        "The Z Fold 2",
        "Judie",
        "180",
        "Apple",
        "thousands of third",
        "Bennigan",
        "i500",
        "YouTube",
        "four",
        "the Mobile Intelligent Terminal",
        "the late '90s",
        "7135",
        "the days",
        "China",
        "Palm Pilots",
        "Judie Stanford",
        "Treo",
        "the United State's",
        "3",
        "today",
        "2",
        "iPhone",
        "first",
        "The year is 2002",
        "2004",
        "YouTube",
        "2002",
        "U.S.",
        "gulf",
        "10th",
        "1996",
        "two",
        "Keith",
        "a Palm Pilot",
        "the day",
        "Treo",
        "Galaxy Note 20",
        "2019",
        "Galaxy Z Flip",
        "Palm Computing",
        "webOS",
        "Verizon",
        "Gear Diary",
        "11",
        "SD",
        "i500 review",
        "Palm",
        "one",
        "Sprint"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "GPE",
        "LOC",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "GPE",
        "FAC",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.1451413929462433,
        0.026151791214942932,
        0.0521092526614666,
        -0.06162257865071297,
        -0.01379997655749321,
        -0.048726245760917664,
        -0.000924043299164623,
        0.13611915707588196,
        -0.016212832182645798,
        -0.0020174758974462748,
        0.10688213258981705,
        0.07149820029735565,
        0.02461455762386322,
        0.03411809355020523,
        0.04331730678677559,
        -0.017453983426094055,
        -0.00953033659607172,
        -0.09057711064815521,
        -0.013316426426172256,
        0.06394441425800323,
        0.09662040323019028,
        -0.013822322711348534,
        0.009888449683785439,
        -0.06443808227777481,
        -0.005369259975850582,
        0.012302552349865437,
        -0.05237266793847084,
        -0.05804022401571274,
        -0.0016411051619797945,
        0.058125756680965424,
        0.007070840802043676,
        0.15618640184402466,
        0.019843341782689095,
        0.01473667100071907,
        -0.035526812076568604,
        -0.09499645978212357,
        0.014861596748232841,
        0.02592260204255581,
        0.008143282495439053,
        0.011855941265821457,
        -0.062099676579236984,
        -0.05599687993526459,
        0.05106568709015846,
        -0.06305710971355438,
        0.05355881154537201,
        -0.02465718984603882,
        0.017307622358202934,
        0.044962022453546524,
        -0.032709307968616486,
        0.020664408802986145,
        0.012531078420579433,
        0.02201024815440178,
        -0.01268661767244339,
        -0.032336071133613586,
        -0.04794049635529518,
        0.02796626091003418,
        -0.024311574175953865,
        0.05828988179564476,
        0.05440554767847061,
        0.042639050632715225,
        0.09365531802177429,
        -0.051541201770305634,
        -0.02239229530096054,
        0.010886303149163723,
        -0.04039330035448074,
        0.013289294205605984,
        0.05509670823812485,
        -0.11859285086393356,
        0.04910353198647499,
        0.021313270553946495,
        -0.025871045887470245,
        -0.022046608850359917,
        0.0535271055996418,
        0.058254312723875046,
        -0.0016019786708056927,
        0.06618476659059525,
        0.04685597121715546,
        0.01654215157032013,
        -0.08373761922121048,
        -0.008525868877768517,
        0.05358526483178139,
        -0.04934106394648552,
        -0.03985225409269333,
        -0.020821578800678253,
        0.010524711571633816,
        -0.027242304757237434,
        -0.053775299340486526,
        0.08639564365148544,
        -0.08376497775316238,
        -0.06504982709884644,
        -0.02914574183523655,
        0.08797387033700943,
        -0.09410817176103592,
        -0.050303809344768524,
        -0.06986900418996811,
        -0.03792837634682655,
        -0.0554141141474247,
        -0.036655936390161514,
        -0.0017316261073574424,
        0.031076112762093544,
        0.027768494561314583,
        0.043875228613615036,
        0.08056199550628662,
        0.07213589549064636,
        0.060582246631383896,
        -0.0139600345864892,
        -0.012816010043025017,
        -0.04876746982336044,
        -0.034543365240097046,
        0.004391831811517477,
        0.0022170995362102985,
        0.012321868911385536,
        0.006270815152674913,
        -0.021083738654851913,
        -0.06289061903953552,
        -0.12355490028858185,
        -0.07098707556724548,
        0.06821736693382263,
        0.0810183435678482,
        0.06388633698225021,
        0.0016380962915718555,
        0.027662893757224083,
        -0.09938843548297882,
        -0.10555662214756012,
        -0.037900444120168686,
        0.06285959482192993,
        -0.040919896215200424,
        -1.7492230673336543e-34,
        0.0023945793509483337,
        0.07899200171232224,
        -0.005190175957977772,
        0.035621240735054016,
        0.0005653505795635283,
        -0.03021760657429695,
        -0.041819896548986435,
        -0.012093300931155682,
        -0.009586990810930729,
        -0.010502307675778866,
        0.026357192546129227,
        -0.04001207649707794,
        -0.017265673726797104,
        -0.0055811433121562,
        0.042065881192684174,
        -0.05945585295557976,
        -0.07755974680185318,
        -0.05839836969971657,
        0.03705859184265137,
        -0.05435985326766968,
        -0.012805118225514889,
        -0.07058627903461456,
        0.050210919231176376,
        -0.054978884756565094,
        0.08053752034902573,
        0.0750698372721672,
        0.06188874691724777,
        -0.06473765522241592,
        0.09848830103874207,
        0.0014995892997831106,
        -0.033593785017728806,
        -0.024021338671445847,
        -0.005645737983286381,
        -0.11147382855415344,
        0.020567219704389572,
        0.02111678756773472,
        0.05886378139257431,
        -0.08943139016628265,
        0.05673287436366081,
        -0.059344448149204254,
        -0.027521753683686256,
        0.04515235871076584,
        -0.04503544047474861,
        0.07303237915039062,
        -0.014025187119841576,
        -0.0018311350140720606,
        -0.0009673194144852459,
        0.022855669260025024,
        0.0241426769644022,
        -0.060035619884729385,
        -0.055273160338401794,
        -0.0795561671257019,
        -0.02301531285047531,
        0.0020032012835144997,
        -0.06667172908782959,
        -0.04303543269634247,
        0.03100498951971531,
        -0.04086907207965851,
        -0.03464752808213234,
        0.08742839843034744,
        0.019323861226439476,
        0.027648428454995155,
        -0.07668834924697876,
        0.020764926448464394,
        -0.0487816259264946,
        0.050882745534181595,
        0.0493474081158638,
        -0.04207349568605423,
        -0.05051841214299202,
        0.031854048371315,
        0.050389502197504044,
        -0.02821236103773117,
        -0.019432803615927696,
        -0.05680175870656967,
        0.02812907099723816,
        0.05516814813017845,
        0.0763990581035614,
        -0.006869925651699305,
        -0.06778104603290558,
        -0.01712190732359886,
        0.009259546175599098,
        -0.02382015623152256,
        0.022442419081926346,
        -0.004033830948174,
        -0.004403996281325817,
        -0.04781663417816162,
        -0.02370363473892212,
        -0.1470901072025299,
        0.0019454322755336761,
        0.02153128758072853,
        -0.06013975292444229,
        -0.04350678622722626,
        0.06929726153612137,
        0.01687518320977688,
        -0.01696612872183323,
        -1.4334035970289553e-33,
        -0.09811938554048538,
        0.008167567662894726,
        -0.009817543439567089,
        0.026314036920666695,
        0.023600799962878227,
        0.006430385634303093,
        0.034670639783144,
        0.05161932110786438,
        -0.06173946335911751,
        -0.05553724616765976,
        0.017693104222416878,
        0.0779869481921196,
        0.03346623107790947,
        -0.01722083054482937,
        -0.029636971652507782,
        0.04295344650745392,
        0.006844302639365196,
        -0.05927994102239609,
        -0.0005695493891835213,
        0.011113888584077358,
        0.07627908140420914,
        0.06413304060697556,
        0.029836760833859444,
        0.09847971796989441,
        -0.0007868008106015623,
        0.014648818410933018,
        0.009447443298995495,
        -0.011823070235550404,
        0.05566210672259331,
        0.012532956898212433,
        0.018910393118858337,
        -0.056470416486263275,
        0.059937115758657455,
        0.058554086834192276,
        0.052668627351522446,
        0.020563095808029175,
        -0.015110000036656857,
        -0.06208881363272667,
        -0.006839865818619728,
        -0.005165062379091978,
        0.039704855531454086,
        0.04046899825334549,
        -0.005008453968912363,
        -0.025489389896392822,
        0.0021248687990009785,
        -0.05670838803052902,
        -0.07725094258785248,
        0.04519357532262802,
        -0.00491528632119298,
        -0.03155725821852684,
        0.03025970794260502,
        0.018452011048793793,
        -0.011270440183579922,
        -0.06785600632429123,
        -0.05492621287703514,
        -0.005997555796056986,
        0.0806584358215332,
        -0.05555638670921326,
        0.006456597242504358,
        -0.006381932646036148,
        0.06194619461894035,
        0.016980789601802826,
        -0.05904335901141167,
        -0.1017138659954071,
        -0.034236371517181396,
        0.0241844579577446,
        0.11328285932540894,
        -0.04139566048979759,
        -0.03007866069674492,
        -0.0022182315587997437,
        -0.03132202476263046,
        0.042070820927619934,
        -0.02816249057650566,
        -0.07898353040218353,
        0.0022110017016530037,
        0.07786894589662552,
        -0.12511374056339264,
        -0.026643916964530945,
        -0.012580365873873234,
        -0.06487222760915756,
        0.03440077230334282,
        -0.000764278753194958,
        0.027708984911441803,
        0.043215516954660416,
        0.027550209313631058,
        0.026518497616052628,
        -0.006850588135421276,
        -0.006288009230047464,
        -0.054974135011434555,
        0.08289718627929688,
        -0.022297002375125885,
        -0.0124415447935462,
        -0.06455350667238235,
        0.09844180941581726,
        -0.00798920076340437,
        -4.4497117102082484e-08,
        0.08198986202478409,
        0.07926934212446213,
        0.06204988807439804,
        -0.05329928919672966,
        0.020924478769302368,
        -0.042810581624507904,
        0.055463556200265884,
        -0.07610964775085449,
        0.1298673450946808,
        -0.03656391426920891,
        -0.06581104546785355,
        -0.0952606201171875,
        0.0079812565818429,
        0.048792995512485504,
        0.06722383201122284,
        0.07658454775810242,
        -0.017966069281101227,
        0.019617542624473572,
        -0.010639031417667866,
        0.07743648439645767,
        0.047887932509183884,
        0.04104139283299446,
        0.007041736505925655,
        -0.05929245054721832,
        0.06901121139526367,
        -0.04545886814594269,
        -0.01584632880985737,
        0.06560109555721283,
        0.030453655868768692,
        -0.007163985166698694,
        -0.01492941752076149,
        -0.02030031941831112,
        -0.04128790646791458,
        0.026805486530065536,
        -0.02240607514977455,
        -0.024620583280920982,
        -0.00955435074865818,
        -0.03066212311387062,
        0.065243661403656,
        0.046716392040252686,
        0.04055704548954964,
        0.021114101633429527,
        -0.054144248366355896,
        0.0643414855003357,
        -0.05914172902703285,
        -0.08168093115091324,
        0.010630476288497448,
        -0.08211059123277664,
        -0.008945361711084843,
        0.06778396666049957,
        -0.08247888833284378,
        -0.007469273172318935,
        -0.07079945504665375,
        -0.008110271766781807,
        0.028059132397174835,
        -0.015708286315202713,
        0.019691195338964462,
        0.023361673578619957,
        -0.032693833112716675,
        0.046244341880083084,
        0.056813761591911316,
        0.023818984627723694,
        -0.0036781870294362307,
        0.08707956969738007
    ]
}