{
    "id": "c74mtrcHE1M",
    "title": "DJI Osmo Action Review",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-05-15T13:04:10Z",
    "video_url": "https://www.youtube.com/watch?v=c74mtrcHE1M",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "dji osmo action",
        "dji",
        "osmo",
        "review",
        "unboxing",
        "4k",
        "4k hdr",
        "underwater test"
    ],
    "views": 712372,
    "likes": 16753,
    "comments_count": 1462,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Today we are checking out the brand new DJI Osmo Action. This is super exciting, this was just announced by DJI. And what's really cool about this is it has duel screens. There's a screen on the front and one on the back. (upbeat electronic music) It shoots 4K HDR and it also has this really cool mode called Rocksteady. So that'll allow you to get those gimbal-like shots using electronic image stabilization. And it also shoots 4K 60 and it's waterproof up to 11 meters. So you don't need any external housing, it's waterproof just as it is. I'll be traveling over the next week testing this thing out. But first, we have to unbox it. So upon first inspection of this, it does look a lot like a GoPro. So here's the place for a battery. And one of the things that I already kind of noticed is it looks like this battery slot is a lot bigger than GoPro. Instructions. Look at this cute little case for a battery. So here's the battery and that just goes right in here. So over here is an SD card slot and also a USB-C port. Power button, our display button, and we've got another little quick shot button right over here. Let's turn it on. So the back is touch screen. We got the app all here, click to connect. We're activating the camera now. Download the firmware. And then we'll take a look and see what else we have here. We've also got these two mouths. We've got this little rectangular one and this circular one. And just has the little sticky film so you can just put these and mount them to anything. Looks like we've got a USB-C cable and the little screw that you'll use to mount your camera to those mouths. One thing that is great is if you do have any GoPro accessories, whether they're made by GoPro or any third party accessories, this little mount looks like it will work with all of those. You're basically set and ready to go. Hey our firmware is updating. Whoa, yes! It is happening, everything is awesome. So here's the app. We've got time lapse, slow motion, we have HDR video, we've also got regular video, and we've got photo. So I'm just gonna take a picture real quick here using the app. The quick switch button. This gives us quick access to switching between all of the different shooting modes. So one of the cool things about this is it does have a front screen on it, so if you are filming yourself and trying to get difference angles, especially if you have this mounted in some sort of weird position, it's really hard to be able to see what you're shooting. If you want to use the front screen all you have to do is double tap with two fingers. (gasps) And voila. You can now see yourself or see whatever it is your shooting in your front screen. I am really excited about this camera. I'm just gonna click record and see what we got. (gasps) Oh my gosh I'm recording and I see myself in the front screen. This is so neat! This is so crazy! Like, look at this. Wow. So now that this is unboxed and set up, that means we can go outside and test it out. (fun electronic music) - Do you see yourself? - [Cameraman] Yeah. - Isn't this crazy? So it's a little bit windy so the audio probably is struggling a little bit. But this is, man, I am loving this thing so much. I just shot a quick little time lapse, I'm not sure how it turned out because we didn't wanna go all the way down there to get the really good shot 'cause it's kinda cold and it's raining. Good thing this thing is waterproof. Hey Jen. - Hi, I was eating my peanut butter pack. How are you? - We are here in Palos Verdes, it's so beautiful. Like look at this. - [Jenna] Oh my gosh, spring has sprung people. - It has sprung. I'm not using the Rocksteady right now, this is just the normal 4K. It is so beautiful, we've come here so many times and I've never seen it like this. - I've never seen it like this. I'm also very jealous of this. Like super jealous. Super jealous. - This camera's really great. - It's cool. - Okay, I'm gonna flip it onto Rocksteady and see what that looks like. I keep looking at the front facing camera though, instead of where I need to look as the lens. Bad habit. - Look at this, it's as tall as me. - Now this is with Rocksteady on, and already I can tell just by looking at it that the stabilization is really awesome. It does crop in slightly, but honestly for this type of stabilization and you already have a super wide angle lens, looks really great. Whoa! I almost fell. (upbeat dance music) There's the sunset. The clouds kinda came in and we missed it. But oh well. Now we're gonna go to dinner. So stay tuned for some really great food content. It's kinda in there though, I don't know if you'll be able to see it. - Well we'll test out the low light. - That's true. We are now at dinner, I'm so excited. This is one of my favorite places. We're in Manhattan Beach, this place is called Love & Salt. If you guys like pasta and you happen to be anywhere near this place, go to it. - They also have really good pizza. I got the spaghetti though. - It's pretty dark in here but there it is, the kale salad. And that's the end of this segment of the video. Move on. (chill electronic music) So I am now in New York and I was here for YouTube's Brandcast. They have all kinds of creators come out and lots of brands and advertisers and all kinds of fun stuff. But I had a really fun week. But now I have some free time, so of course the first thing that I'm gonna do is I'm going to test out this camera. And as you can see, I just tested out some slo mo going through those doors. I'm on my way right now to find a Yerba Mate, it's that drink that you guys are always like, Justine what is that that you're drinking. Well, this is what it is. And hopefully I can find one. I used their store locator and it showed that there was this market that had it. There it is. I want you guys to go in the comments right now and say good luck Justine 'cause we're going in. That's not what I was looking for. Maybe they've got more back here. I've never been so sad in all of my days. No I've definitely been sadder, but that just means I have to find another place to get one. What. Okay so this is like, it's a sparkling one. I think I should get both of them and do a taste test. This is disgusting. If this was like the last drink on earth, like if I was on my death bed and they're like, Justine this is what you have to drink to stay alive, I don't even know if I could do it. It's so terrible. We gotta go to Whole Foods. Hey Justine, you went to New York to do a camera review, what did you do? I was searching for canned Yerba Mate. What a great video. Classic Justine. (fun music) The search is getting real, just Ubered to Whole Foods. It's been such a long journey to get here, I'd like to thank my friends, family, I would like to thank you guys, I would like to thank Yerba Mate, I'd like to thank DJI for making this incredible Osmo Action. Right now if you can't tell, we're using the Rocksteady so everything is super, super smooth. And I'm gonna go and check out now. I planned on getting some really great shots today for you, well guess what. It's raining. Good thing that the Osmo Action is waterproof. I had mentioned previously that the Osmo Action is in fact waterproof up to 11 meters, so we're test that out. We're not gonna go 11 meters, we're probably not even gonna go more than three feet to be honest with you. 'Cause I don't actually like to go underwater so. I have a mask, got the action, and we're gonna go in and test it out, it's also very cold today. So just keep that in mind. We're recording in 4K 30. We're using Rocksteady because it's my favorite mode. I hate going underwater. - [Jenna] There she goes. - I hate going underwater. Pathetic okay. - [Jenna] And she's off. Wow, I should have got you the snorkel. - I should have got the snorkel. - [Jenna] So graceful. - Can't swim! When you guys make fun of me for saying like, of course she can swim. Absolutely can't. That was a really super pathetic attempt at swimming, so now we're gonna try again in 4K 60 frames a second. (electronic rock music) Look how far I went! Oh god. Okay well, I think you guys get the point. It's waterproof. I think next time I need to find someone who can actually swim or do underwater activities because I am not that person. - [Jenna] I offered you my underwater scooter. - Ah! Next time. So I'm gonna try to get a sunset time lapse, except it's raining outside, so I don't think I'm gonna get much of a sunset. But this is the little setup that I have right here. I have it connected to a battery charger, so I'm just gonna leave this for several hours and see what happens. Ready. Let's go. So I have this set to taking infinity photos, so basically this is gonna last until the SD card fills up or this nimble charger dies. See ya in a few hours little time lapse. (gentle music) So I'm back after about two and a half hours, the time lapse is still going and I'm so excited about it that I think I'm gonna just keep it running until tomorrow. We're gonna get a sunset to sunrise if this all works out. (gentle music) This is a little editor's note, I'm actually working on this video right now. I just wanted you guys to know that this time lapse went for about 15 hours. I am so impressed with how awesome it turned out. Let me know what you guys think in the comments below. (upbeat music) Start recording. Oh my gosh. - Now you don't have to say its name. - No way. - It will just start recording. - That's actually the first time I tried that. - But wait there's more. - What else is there? - You can say stop recording. Yes. - Take photo. Is that the right command? - Let me check. Take a photo. - [Justine] Take a photo. Oh you just took a picture of the ground. Screen switch. Oh! This is so great. - What happens if I say it from far away? - Go ahead. - Stop recording. - It stopped. We are going on a road trip and I'm testing out the Osmo Action here. And one of my favorite things is the voice control. Screen switch. (gasps) - [Jenna] How does it work? - [Justine] It's like magic. - [Jenna] Screen switch. Oh good it obeys me. - There it goes. Start recording. Oh my goodness. - Get out of here. - Isn't it great? Stop recording. Take a photo. (both gasp) - [Jenna] That's the future. - Well it's, no it's now. It's now. (upbeat rock music) - [Both] Wow! - My god my brain. - Geez! - Yeah, yeah, you wanna race. - [Girl] Yas queen. (shouting) - Thank you! - Go, go, go. - I just got a rose. - Wow I love them. Give me a rose. - Careful you don't get pinched. I was giving them the. - They beat us. - Oh my gosh that's amazing. - They definitely beat us. - We're testing this out, I turned Rocksteady off, so I wanna show you guys how stabilized this was previously and how stabilized it's not now. - I'm so nervous. - Guys this is super dangerous. You absolutely should, you should do this. - Ah, did you signal? - I don't know. - You didn't signal. - I think my signal's still on. This is fun. (both shouting) Oh my god. Oh my god. (upbeat electronic music) So this isn't slo mo, it's just moving very slow. Should we play some games maybe? - Yeah, yeah. - Let's do that. We want a large prize. All we do is win win win no matter what. (playful music) Oops. Did I have another ball? How many did I throw. I got three. We are super skilled. - [Man] You weren't even paying attention. - I wasn't. (laughing) Yay thank you. (fun upbeat music) You guys don't wanna ride it with me? - [Faruk] Yeah I don't wanna leave you alone. - It's fine. (chill electronic music) (Justine shrieking) This is not as fun as I thought it was gonna be. Oh my gosh. There's a lot more movement on this ride than I was ready for. - I did not like it so much. I can't even tell you. - I'm actually crying. - Thank you. - That was. - You're welcome. - That was. Thank you. I almost threw up five times. - Yeah. - I'm so sorry. Oh I'm dizzy, should we sit down? - Yeah that's what I'm saying. - Let's go sit down. - We should go and sit down. - We should sit down. What do we do now? Oh my heavenly! (fire spurring) Oh god, it doesn't stop, it doesn't stop, it doesn't stop when you, it's a very poor design, it's a very poor design, very poor design. Very poor design. (light techno music) I guess that's it. Make sure you guys go check out Faruk's channel. I am such a huge fan and thank you so much for coming over. - Of course. Thanks so much for having me. - And playing with the new DJI Osmo Action. What's your favorite feature about it? - I really like the front screen. You cannot really see everything, but it gives you an idea about the frame and it changes the game a lot. - Thank you guys for watching. If you guys enjoyed this video make sure you give it a thumbs up and be sure to hit subscribe, hit the bell, whatever else it is that you do on YouTube. I don't know, run around in a few circles. - Maybe by that time they'll put a new thing in there. - Probably. - Hit the bell. - Hit the frying pan. - Pull the cockpit. - Let's go burn more things. (gentle electronic music)",
    "transcript_keywords": [
        "Osmo Action",
        "DJI Osmo Action",
        "guys",
        "time",
        "screen",
        "front screen",
        "Rocksteady",
        "Action",
        "time lapse",
        "thing",
        "super",
        "Osmo",
        "great",
        "Yeah",
        "recording",
        "DJI Osmo",
        "front",
        "Justine",
        "camera",
        "Yerba Mate"
    ],
    "transcript_entity_values": [
        "Classic Justine",
        "Yerba Mate",
        "Osmo Action",
        "second",
        "one",
        "DJI",
        "USB-C",
        "New York",
        "about 15 hours",
        "the Osmo Action",
        "DJI Osmo Action",
        "Faruk",
        "Justine",
        "a few hours",
        "4",
        "three",
        "Manhattan Beach",
        "YouTube",
        "more than three feet",
        "several hours",
        "Jen",
        "five",
        "Whole Foods",
        "SD",
        "today",
        "third",
        "two",
        "YouTube",
        "first",
        "Love & Salt",
        "tomorrow",
        "Palos Verdes",
        "11 meters",
        "USB",
        "about two and a half hours",
        "the next week",
        "GoPro",
        "One"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "TIME",
        "LAW",
        "ORG",
        "PERSON",
        "PERSON",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "QUANTITY",
        "TIME",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "DATE",
        "GPE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL"
    ],
    "vector": [
        -0.04392404109239578,
        -0.06942068785429001,
        -0.06967999786138535,
        -0.1328764259815216,
        0.0070044733583927155,
        0.005318062845617533,
        0.040655892342329025,
        0.027440648525953293,
        -0.020833484828472137,
        0.04565248265862465,
        0.02889685146510601,
        0.004352935589849949,
        -0.012371599674224854,
        0.006457624491304159,
        0.00850347988307476,
        0.05858625844120979,
        0.028644582256674767,
        -0.006263358984142542,
        -0.007477563340216875,
        0.07843633741140366,
        -0.002648130524903536,
        -0.05116801708936691,
        0.030483631417155266,
        -0.002400351921096444,
        -0.052413877099752426,
        0.07648424059152603,
        0.022147515788674355,
        0.08437279611825943,
        -0.08449865132570267,
        -0.046215277165174484,
        0.0027652995195239782,
        0.057659730315208435,
        0.11971376836299896,
        -0.041160956025123596,
        0.016146423295140266,
        -0.028324848040938377,
        0.041162796318531036,
        -0.03729351982474327,
        -0.010129636153578758,
        -0.03086741827428341,
        0.014443784952163696,
        -0.04235665500164032,
        -0.0019951839931309223,
        -0.028965234756469727,
        -0.05180119350552559,
        -0.13447172939777374,
        -0.00042126126936636865,
        -0.07364752143621445,
        0.06832138448953629,
        0.05746612325310707,
        -0.10102413594722748,
        -0.04955945909023285,
        0.07155858725309372,
        0.004294096026569605,
        -0.07532171159982681,
        -0.018051885068416595,
        -0.09434118866920471,
        0.009039590135216713,
        0.03518776595592499,
        -0.10826712846755981,
        0.030579710379242897,
        -0.039097920060157776,
        0.0037913767155259848,
        0.04508613422513008,
        -0.04499119892716408,
        -0.06497477740049362,
        0.015403714030981064,
        -0.03568994626402855,
        0.003620194736868143,
        0.005630924832075834,
        -0.10249655693769455,
        0.03351740166544914,
        -0.02879239432513714,
        0.03880581259727478,
        -0.020558420568704605,
        0.05788416042923927,
        0.024788789451122284,
        -0.059584349393844604,
        -0.01260443963110447,
        0.03185892477631569,
        0.04899674654006958,
        -0.04330889880657196,
        -0.09517829120159149,
        -0.012278889305889606,
        0.013924614526331425,
        0.007592912297695875,
        -0.009685310535132885,
        0.040718261152505875,
        -0.006069748196750879,
        -0.016064239665865898,
        -0.07802222669124603,
        0.01037968136370182,
        -0.01904289983212948,
        -0.04169457033276558,
        0.01643579825758934,
        -0.059334468096494675,
        -0.020453108474612236,
        -0.04878511279821396,
        -0.03028583712875843,
        0.0914095789194107,
        0.043368276208639145,
        -0.07133354991674423,
        -0.004425961524248123,
        -0.027157843112945557,
        -0.019342271611094475,
        -0.09314562380313873,
        -0.035157155245542526,
        0.02989724464714527,
        -0.008787260390818119,
        0.00918376725167036,
        -0.0530497208237648,
        0.015659432858228683,
        -0.06322304904460907,
        -0.05701600760221481,
        0.017701657488942146,
        0.1365690529346466,
        -0.014006707817316055,
        0.09725012630224228,
        0.02620915323495865,
        -0.01461855135858059,
        -0.014561876654624939,
        -0.10536530613899231,
        -0.022768719121813774,
        0.04204306751489639,
        0.04218268021941185,
        0.0171885397285223,
        -0.10262852907180786,
        1.316560578950273e-32,
        0.004097780212759972,
        0.0487583689391613,
        0.01713721640408039,
        0.06800276041030884,
        0.006489464547485113,
        -0.04104660451412201,
        -0.035650961101055145,
        0.07093696296215057,
        -0.013471134006977081,
        0.006132000591605902,
        0.004685678519308567,
        0.06540047377347946,
        -0.04403163492679596,
        0.04843105003237724,
        0.05613473057746887,
        -0.048363517969846725,
        -0.010363820008933544,
        -0.044650185853242874,
        -0.05255990847945213,
        0.00462687062099576,
        0.0427081398665905,
        -0.0350082591176033,
        0.010343055240809917,
        0.09609487652778625,
        0.10554508119821548,
        0.07824818044900894,
        0.07509585469961166,
        -0.0164429172873497,
        0.0701068863272667,
        0.006285612005740404,
        -0.028268877416849136,
        -0.08069350570440292,
        -0.025683818385004997,
        -0.11643769592046738,
        0.012734854593873024,
        0.007832592353224754,
        -0.06809216737747192,
        -0.0020237008575350046,
        -0.03157896548509598,
        -0.08017706871032715,
        -0.036575183272361755,
        0.012058956548571587,
        -0.05938408523797989,
        -0.04591592401266098,
        0.06109943985939026,
        0.029910309240221977,
        0.018101071938872337,
        0.0775500014424324,
        -0.0089262118563056,
        0.019152769818902016,
        -0.01622505858540535,
        -0.013727279379963875,
        -0.029609479010105133,
        0.010097741149365902,
        -0.045299869030714035,
        -0.08784792572259903,
        -0.01823725551366806,
        0.06538308411836624,
        0.03397015854716301,
        0.062327831983566284,
        -0.006454723421484232,
        -0.0495762899518013,
        0.0037603192031383514,
        -0.014369185082614422,
        -0.05265397951006889,
        0.11387895047664642,
        0.05818541347980499,
        -0.0490516796708107,
        0.04477624595165253,
        0.06500490754842758,
        -0.006877935957163572,
        0.029155569151043892,
        0.043889135122299194,
        0.03230041638016701,
        0.04104752093553543,
        0.05466469004750252,
        -0.06585874408483505,
        -0.04430890828371048,
        0.0063969832845032215,
        -0.010801461525261402,
        -0.0915425717830658,
        0.09357696771621704,
        -0.011955534107983112,
        0.10937833786010742,
        -0.04475851729512215,
        -0.043083254247903824,
        0.04616447165608406,
        -0.02265905775129795,
        -0.045530807226896286,
        0.006250385660678148,
        0.0018641444621607661,
        0.07955654710531235,
        -0.06882079690694809,
        -0.03439757227897644,
        -0.02335566096007824,
        -1.2770426629275356e-32,
        0.03009796515107155,
        0.018323203548789024,
        0.01896749995648861,
        -0.05601191520690918,
        0.022115608677268028,
        -0.0265408456325531,
        0.015159225091338158,
        0.09452829509973526,
        0.0814288929104805,
        -0.08464115858078003,
        0.042336899787187576,
        -0.07891405373811722,
        -0.09197454899549484,
        0.014072069898247719,
        -0.033631470054388046,
        -0.009535901248455048,
        -0.07371407002210617,
        -0.06270942091941833,
        0.05887828394770622,
        -0.016681360080838203,
        0.07535569369792938,
        0.15300379693508148,
        0.10762593895196915,
        0.003955337218940258,
        0.012338371947407722,
        -0.010804656893014908,
        0.025058381259441376,
        0.07386750727891922,
        0.015471999533474445,
        0.050101663917303085,
        -0.006834082771092653,
        -0.06062600761651993,
        -0.03329214081168175,
        -0.016899123787879944,
        0.05292946845293045,
        0.06253810226917267,
        0.012202982790768147,
        0.0528109036386013,
        0.00929347239434719,
        -0.031044619157910347,
        0.03235454484820366,
        -0.008101359009742737,
        0.020710958167910576,
        0.008270595222711563,
        -0.005267474800348282,
        -0.10242430120706558,
        -0.04960561916232109,
        0.027120787650346756,
        -0.021049927920103073,
        -0.02174944430589676,
        -0.0685163214802742,
        -0.0468645878136158,
        -0.02400028333067894,
        -0.016582606360316277,
        0.03140998259186745,
        -0.000167425925610587,
        -0.04416448250412941,
        -0.025349481031298637,
        -0.0017256034770980477,
        -0.004196010064333677,
        0.0369548536837101,
        -0.016907645389437675,
        -0.06753332912921906,
        -0.08070341497659683,
        -0.01022337470203638,
        -0.04834674298763275,
        0.09673097729682922,
        0.0023188204504549503,
        -0.00510369474068284,
        -0.00019825481285806745,
        0.010761193931102753,
        0.012657473795115948,
        0.04048088565468788,
        0.0363912470638752,
        0.0669381394982338,
        0.004396935924887657,
        -0.09659326076507568,
        0.017571359872817993,
        0.07869843393564224,
        -0.03268152475357056,
        -0.05540822446346283,
        -0.03472106531262398,
        0.0037667853757739067,
        0.06718292087316513,
        0.07949728518724442,
        0.10668225586414337,
        0.09725392609834671,
        -0.026198968291282654,
        -0.02005576714873314,
        0.046483490616083145,
        0.029611006379127502,
        0.06208936125040054,
        0.08542261272668839,
        0.11881992220878601,
        -0.12697811424732208,
        -6.422948928275218e-08,
        0.018161900341510773,
        0.014974471181631088,
        -0.03264192119240761,
        -0.0014452642062678933,
        0.030304696410894394,
        -0.055633217096328735,
        -0.017598146572709084,
        -0.00022070719569455832,
        0.05961106717586517,
        -0.048508044332265854,
        0.1168888583779335,
        -0.008141863159835339,
        -0.0037777796387672424,
        0.07147479057312012,
        0.020927395671606064,
        0.02035859413444996,
        -0.09830302745103836,
        0.0863763764500618,
        -0.04024503007531166,
        -0.06686758995056152,
        -0.0316992849111557,
        0.06308020651340485,
        0.026601463556289673,
        -0.012479061260819435,
        0.061169229447841644,
        0.007062086835503578,
        -0.039272479712963104,
        -0.02674700878560543,
        0.0090902429074049,
        0.007237880490720272,
        -0.04418587312102318,
        0.016702530905604362,
        0.027521075680851936,
        -0.01164317224174738,
        -0.06358864158391953,
        -0.025785142555832863,
        -0.04549093171954155,
        -0.02097173035144806,
        0.04100250080227852,
        0.013296696357429028,
        0.0018596741138026118,
        -0.13495826721191406,
        -0.06418654322624207,
        -0.01311497762799263,
        0.009627548046410084,
        -0.024817416444420815,
        0.015265889465808868,
        -0.07695221155881882,
        -0.042041949927806854,
        -0.056513674557209015,
        -0.020805735141038895,
        0.035265352576971054,
        0.042914532124996185,
        -0.007880475372076035,
        0.03747057169675827,
        0.003542660502716899,
        0.03354724124073982,
        0.061180248856544495,
        0.007822368294000626,
        -0.02520236000418663,
        0.028677893802523613,
        0.0036713555455207825,
        -0.06405668705701828,
        0.018734244629740715
    ]
}