{
    "id": "cBbFpPOhrY4",
    "title": "Phil Spencer Interview - Halo Infinite and Xbox Games Showcase!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-07-24T14:20:23Z",
    "video_url": "https://www.youtube.com/watch?v=cBbFpPOhrY4",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 88181,
    "likes": 4065,
    "comments_count": 585,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine. - And I'm Jenna. - Welcome to episode eight of Same Brain Podcast. - Featuring a special guest. - This is our first guest. (upbeat music) I'm so excited, Jenna. Today, we have Phil Spencer on our podcast. - Today, Xbox had the Xbox Games Showcase with so many incredible announcements and of course, the highly anticipated Halo Infinite. Yeah, we got actual gameplay today, which was really exciting and this is a game that is very special to me in Jenna because we used to play this game together all the time. I mean, even Xbox in general, I feel like it's so special. Like we grew up gaming, but we really got into console gaming with Xbox. - For sure and I mean, Halo was one of the first games that I'd ever played on Xbox. So to kind of just watch this, especially watch it with Jenna, it was just... That nostalgia feel, I think is something that a lot of people experience while watching this, and what's even better is we got a chance to sit down with Phil Spencer and talk about the Xbox Games Showcase. Phil, thank you so much for joining us on our podcast. This is our first guest ever. - How are we going to top this? - I'm honored to be the first guest. When they told me that, I was like, \"No way,\" but you guys just started in June, right? - We did. - We the Same Brain? - Yes, so. - Congrats on that, it's awesome. - Thank you. - Thank you. Now we're on episode what, eight I believe, and this is a very exciting and a special edition, obviously and congratulations on the showcase today. It was incredible. - It was really fun. So for you guys, I mean, you're so used to doing these events live. I mean this whole thing has been such a completely different experience. So how has it been for you guys trying to put these things on and sort of appeal to everything that gamers are hoping to see? - Yeah, both of you are so familiar with production and just all the work that goes into this. And, you know, we did this in a production studio here in Seattle and everybody is social distancing, everybody has their masks on. People are obviously working on getting the games done and the trailers done. So, I was just really proud of the way the team showed up to really show the best that they had. The show came off... I'll admit, I missed the energy and the fans kind of onstage at E3, it's always one of those special moments, but it was really cool just to see how the team came together to pull off something in a unique way. - It looked really great. I think that's completely changing the way that everyone is sort of operating, especially with gaming. I mean, even during all of this, I feel like gaming has brought us all so much closer together. - Hmm for sure, yeah. - Yeah, we definitely see that. I mean, I was... I'm trying to remember the stats. It was like from the beginning of Stay at Home, we've had like over 270 million new friend connections made on Xbox Live and something. - Oh my gosh. - Which is just... I mean, it's not so much about Xbox Live. It's just the power of gaming that allows people, when they can't physically be with their friends or hang out with people. That they can do that through the power of play and I just think that's such an awesome thing about our industry. - For sure, yeah. And we're so used to like traveling so much, you know, for fun and work, and we've been gaming our entire lives and just being busy, you know, being adults and working, we kind of stepped away just because there wasn't enough time. - So now being home- - Yeah. - We kind of rediscovered our love for gaming and we're like, \"We missed this so much.\" And, we've actually probably talked to our friends more so now being at home 'cause we'll like hop on and play games every night. So it's definitely really interesting and I've been having a great time just staying home playing video games. - And even for us though, Halo, like us watching this showcase, it brought back so many fun times because before Jenna moved to Los Angeles, she was living with me and we used to play split-screen multiplayer and co-op and everything together, just sitting in our living room. So just watching this, I think for both of us, it brought back that nostalgia. So I know that's something that's very important to you guys as well. - Yeah. You know, Bonnie Ross and the team at 343 wanted really to bring back that kind of classic Halo feel, and as I've watched the gameplay come together, there was just something about when Chief walks out the back of that Pelican. That just I felt at home every time I've seen it, obviously, I've played the game a number of times. But you're right, I mean, gaming creates those memories, those memories of who we played with, where were we and who we're with at the time we finished this game and Halo plays such a special role. Not only for us in Xbox, but I think for so many gamers, it was just awesome to be able to open the show with Halo and all of the love that we've been feeling today, people, yes. Like the the sound, the look, the characters, the ring. Like it's just really nice like a coming home moment for millions of Xbox fans. - I mean, Halo was definitely my first introduction to Xbox a long time ago. I'm a little bit older than Jenna. - So I feel like we kind of have that little bit of a disconnect, but again gaming did bring us together when I was living in California and she was back in Pennsylvania. So I just, I love the way that gaming has just made that connection. - For sure. - So I think we... There was also one of the things on Twitter that I saw a bunch of people were so surprised to see the announcement of Fable. - Yes. - So that small little teaser, I mean, everyone was really excited and I think what's amazing is all of the games that you guys showed here today were all Xbox Game Pass games. - Yeah, I definitely think Game Pass was the star of the show and, you know, that's a big change. Like it's normally when we think about a console launch, it's just focused on the individual game titles and we want to do that. Clearly, we want to do that, but at the same time we know, especially right now, value in gaming is important. Obviously, there's a global pandemic going on around us and the economy is where it is and we want to give families and people choice about how they build their libraries. And the fact that we could do a full show in every game in the show was in Game Pass, I thought was just such a great statement for the service and how it's grown, and be able to close the show, as you said. with Fable. A great studio with playground. I think it's kind of been the worst kept secret in video games that we're working on Fable. Some of those leaks might even been from me. - Oops. - But it's really nice to now have it out there so we can talk about it and just kind of have more of a direct discussion with the fans. Honestly, I've been surprised by the reaction to Fable. I worked on the first Fable and as you... When you work on a game sometimes you have a different connection with it but today just the fanfare around the Fable announce has been fantastic to see and I thank everyone for that. - I think we were all so focused on Halo, Halo, Halo, but there was nothing that we thought that you could do that could top sort of that announcement. So I think you guys did a really great job with that. - We were even talking earlier, we were like, \"Man, I remember it was 2019 E3 even when like the Halo was teased and the Series X and like how excited we were. And we were like, \"Well, here we are, you know, it's happening soon, holiday 2020. It's gonna be here before we know it.\". - Our CFO in the Microsoft earnings yesterday and the Microsoft earnings got asked when were console launches. Which, you know, we've come a long way inside of Microsoft when they're asking our corporate executives about console launches. But yeah, it's 2020, it's a launch year. Not just us, our friends at Sony, obviously, launching a console as well. So it's, you know, a lot of excitement in gaming right now. Nintendo is doing incredibly well, I think you guys were playing a lot of Animal Crossings and stuff that's- - Oh, yes. Yeah. I mean, I'm over like 650 hours right now, so... And it's honestly- - Unhealthy. - It really is unhealthy but I think I would have never had time to do that previously. So we're in such this unique position to sort of refocus and do a lot of things that we might not have had time to do before. So I mean, for you, like are there any games that you feel like you have more time to play now or like able to do other sort of activities that you couldn't before? - Yeah, I'm playing a lot, which is always part of my life. You know, and I think about that experience, I mean, you're the perfect example. You're not at home right now, you're in your secret location doing your cool stuff. You know, when we think about xCloud and allowing people to bring their Game Pass games with them and continue to play them wherever they are, as they move around. I think it's just a great thing about today's big franchises, whether it's a Fortnight or a Minecraft, where you can kind of always stay connected with them wherever you go and obviously the portability of a switch gives you that with Animal Crossing. So, when we were thinking about xCloud coming into Game Pass and then that means, now I can take my Xbox library with me. Sure, when I'm at home, I'll probably play on my big screen because that's what I like. But when I'm not at home and I want to have those options. I just think it makes gaming more ubiquitous and kind of a constant part of my life, which is something I love. - Yeah, 'cause I feel like before we used to be tied to our TV and we used to travel home like for the holidays. Both of us would bring an Xbox, be like fully prepared. So now we can play it all on mobile and I also love that Minecraft Dungeons was on Nintendo Switch. - That was cool. - Which was so fun because I could easily take that kind of stuff with me. So I'm definitely looking forward to the future of more sort of collaborations like that, if that's anything that is in the future. I'm here for it and I know a lot of people would be too. - I'm just glad we don't have to carry our Xbox home with us now as our carry on- - Yeah. - Because I mean, you know, there weren't many direct flights from L.A. to Pittsburgh and that thing got a little heavy. So now that, you know, xCloud is a thing, I'm personally very excited. I've been running the beta playing Halo and it's been really great. - Oh, that's awesome. - It's so great. - Well, maybe we just buy mom and dad an Xbox. - We have one. - So we have upgraded, we have eventually. They have one there. - They do. My grandmother actually had, it was like the Gears, one of the first Gears Xboxes. - Oh no. - Yeah, so when I upgraded, I gave her my Gears Xbox, which is incredible. - She still has it. - She does. - We came over one day and she was just like playing. I was like, \"Grandma, are you playing like Gears of War right now?\" - She's playing Call of Duty and Gears of War. She's like, \"I wanted to try it out.\" I'm like, \"This is incredible.\" - Yeah. Gaming does cross such a huge expansive audience and I just... I think it's incredible and it really has changed the world. - For sure, yeah. - Like what you guys are doing, what everyone is doing. - Yeah and I think as you said, people staying connected across different devices. Every time I sit down I have my characters, my friends are there, I can just keep playing. I mean, that's what gaming is about. To me gaming is a unique art form on our planet that I do with my community, I do with my friends. Usually when I'm watching TV or listening to music, it's kind of a solo thing but when I play video games, I just love playing co-op with friends and the fact that gaming has just become more connected overall and especially right now. And, you know, we feel so disconnected or we're on the road and I think it's fantastic. And seeing the industry embrace that and realize that all of us working together to allow gamers to stay connected is actually a great way for gaming all up to continue to grow. And that just is gaining more and more momentum across the industry, which is a lot of fun. - And we recently started streaming 'cause we were like, \"Okay, we're home, like we're not making the usual content. Like how do we, you know, interact with our audience?\" We're like, \"Well, let's just start streaming our video games.\" And I mean, I've been doing YouTube for 10 years. you've been doing it for? - It's way too long. - Way too long and I finally feel like this streaming and like the video games have brought us like so much closer to our audience. So it's just been this weird thing, we're like, \"Wow, what have we been doing wrong for 10 years?\" But like gaming has just like brought us all together, so it's been really cool. - Yeah, the content creator, I mean it's, you know, as important as players, as creators of the games themselves, you just have so many kind of different people that play a role in someone's game experience. Like we see it, people will go online now to see what their kind of trusted people they follow, what do they think of the games, getting their opinions. I mean, it just really bring... It makes gaming more accessible when I can go online, I can search for a game and watch a streamer play it, or watch somebody on YouTube kind of give their impression. And I think that that kind of ability for me to find my next favorite game, something that's outside of the three or four games that I always go to. That diversity of games that we see in the market right now, is I just think a real strength for our industry. - Hmm. - We need more people to find more games to play and that's just- - For sure. Also I wanted to talk about accessibility because you had hit on that a little bit. so as far as- - Yeah. Making games more accessible, I think is something that you guys have been very ahead of the curve on. I know we went up to Microsoft, it was a few years back, to get a chance to see like the accessibility and talk about like the controller that you guys... the adaptive controller. So, like things like that, like that's incredible. So, is that all gonna be supported as well on Series X and are you doing anything to kind of push that- - Yeah. - Initiative? - The Xbox Adaptive Controller will be there, It'll be supported. I think it's, as you said, we want more people to play, more voices are heard, more voices to be... For that to be safe, I mean, it's something I know you've about in terms of when you're online. I want to make sure that the community I'm playing with, interacting with, the people I choose and that I'm able to kind of manage those communities and bringing more people in with different perspectives, accessibility is a critical part of that. And again, I'll say as the industry, we've done our part with the work that we've done, but, you know, The Last of Us II just came out and congrats to Neil and the team, did a great job with the accessibility in that game. And I see us all kind of learning and building on the work of each other, which is absolutely the way it should be. Like accessibility should not be a platform competitive thing. It should be something that we all embrace in order to allow more people to play. And even after the show today, and we did a bunch of work on localization, sign language in our show to make sure more people can see it. The feedback we get from sight impaired people about how we can continue to work to make gaming more accessible. It's just, I think as you said, a really important thing for us as an industry to focus on, and I'm really pleased with the progress that we continue to make. - It's amazing, when I saw firsthand just, you know, a bunch of YouTube videos, people talking about how this really did change their lives because before they were never able to play. And just seeing people play video games for the first time was just... It was so heartwarming, so. - For sure. - I mean, for all of them, thank you guys. So that's, it's really impressive. - Well, it's good to talk about it. I'm glad you bring it up because I think that's what it needs, right? It needs to be constantly in our conversation of how do we have representation in our games, representation in our community. Yeah, it's almost like a meme now, I say it so often, there are over 2 billion people on the planet that play video games, so it's just amazing- - Wow. - To think about and getting those creator voices, whether those are creators of people as in making videos about video games or making the games themselves. It just really strengthens what gaming can do on the planet as more people are able to engage. So I appreciate you talking about it and continue to do that please. - For sure. 'Cause I think it just makes it a focus. - All right, you don't have too much time, but is there anything else that you want to tell us about Halo that we think the audience might enjoy? 'Cause I know we're super-excited about it. I mean, I love the campaigns, but obviously, we're huge multiplayer fans. So we're just going to wait very patiently. You know, whenever that announcement comes. - Whenever, you know, we'll be ready, waiting. - But as far as like the campaign goes, I mean, what are you most looking forward to? - Yeah, the multiplayer in Halo Infinite, I think is gonna be special when we talk about it. You know, it's such a big game when you think about all the work that goes into the single player campaign, to the community features, to multiplayer. But we know for so many people, you know, Halo:CE started with us lugging our Xboxes around, plugging them in together and playing console multiplayer, for many of us the first time. So, I'm excited about what we'll get to see and what we'll get to show. I think the team is building on what they did with Halo 5 and the multiplayer in Halo 5 was received very well. So, it's cool to kind of see the team continue to iterate on things that the community loves. The Esports players have been heavily involved in what we're doing 'cause we know that's a strong part of the community, the professional players. And there's some kind of technical challenges the team has set for themselves on multiplayer that I'm really encouraged to be able to talk about when we get there, so soon, we will be able to talk about Halo multiplayer soon, but Bonnie and the team are doing a really good job with Halo and it it's nice. It's been a long time, 19 years since we had a Halo at the launch of an Xbox. - Oh my gosh, that's really crazy. - Oh my gosh. - 2001, the original Xbox and Halo:CE, so this is like a seminal moment for us. These are chocolate and peanut butter coming together. - That's incredible. - Like it's gonna be a special time, when we're able to launch Halo in the next console. - I mean, I feel like you're in such a unique position because you've been with Microsoft for so long. So I mean, how exciting is this though for you to sort of see all of this just happen in a lifetime? Like it's really incredible. - Yeah, you know, I went back so as my... I was there at the original Xbox launch of 360, Xbox One and there are a lot of team members on Xbox that haven't been around as long as I have. And I really push the team to embrace it and to kind of... It's one of those career accomplishments and frankly, life accomplishments that it's easy to kind of just fly right through, but you've been around console launches before there's something special about that. I went back and I watched some of the video from Zero Hour, if you remember that on 360. When we went out in the desert and brought a bunch of people in and, you know, it was just such a special time for the community and the team. So I get excited, I was nervous today. Which I thought was funny because the whole thing was recorded, so like I couldn't really mess anything up. But it's nice to get the kind of energy flowing and just to feel the fan energy, the viewership today was amazing and this is gonna be great, this is kind of what it's all about. It's just celebrating with the fans, love of video games, launching a new Xbox, launching some great games and getting to talk to people who really care about it. So I appreciate the opportunity for that. - I mean you guys are saving our 2020, I'm just gonna say it. - Yeah, you really are. Like video games are keeping us all sane, so yeah. Thank you to you guys, but yeah. It's not a very high bar achieving in 2020, We're ready for 2021. - Yeah, oh my gosh, we'll have lots more games. - Well, I mean, that's also gonna be exciting because the future of games. So 2021, I can only imagine what we're gonna be expecting. Maybe we'll have a real- - 120 frames per second, Ori by the way, Ori is... Oh my gosh, I personally, am just gonna be so excited 'cause it's just gonna look so nice. I mean already it's such a beautiful game, but 120 frames, oh my gosh. - Yeah, it's a big focus. We're seeing a lot of games, right? Like Dirt was another one that's talking about 120. We'll have more to talk about in terms of high frame rate. Like that feel of games is something that we're definitely gonna feel at launch and as you talk about into the future. I think that's an area that I see developers really getting into is, \"How do I make sure that the games feel as great as they look?\" A huge opportunity and really it'd be fun to be able to talk more about that as news comes out. - Yeah, I mean especially because a lot of these games, you are gonna be able to play backwards compatible and on other things. So, I think it's gonna be such a challenge to make sure it plays incredible on the new gen consoles but also, you know, previous as well. For sure, yeah. - The back compat team for us is, they're like our ninjas in the back room that just do amazing work and without spoiling too much. Seeing some of the frame rate work they've been able to do on our back compat games, to up the frame rate on existing games is... It's not normal in console that when I buy a new console, my old games actually play and they play a little better. But as we get to continue to tell more of that, I think people will really be impressed with the work that that team has done. I'm really proud of them. And focusing, I think on the investment gamers have made in Xbox and making sure that continues. Whether it's the controllers that you already own, whether it's the games that you already own. Respecting a gamer's relationship with our product, to me is just critically important and something that's just become a pillar for the team just. And I'm encouraged to be able to talk more about it, it should be August. I think August we'll have more to say on that. - Oh my birthday month, a nice treat. - Oh great. - Totally amazing. - Oh, happy birthday. - Thank you. - Happy birthday. - Well, thank you so much for being our first guest on. Before we let you go, is there anything else that you would have liked to have added to the showcase that you didn't get a chance to say since it was already prerecorded? - Yeah, as you said, I've been in the industry for a long time and I visit studios and I thought it was really cool to see the way like Dragon's Quest showed up as a game coming to Xbox. The support from Japanese publishers Square, bringing new IP into our show. Obviously, Tetris Effect was there, PSO is coming to Xbox, again with their new version. It's just an area of focus for us to make sure all creators globally feel like Xbox is a great platform for them and that they can deliver their games to a large global audience. It's an area that our team in Japan has really been working hard on and to be able to open the pre-show with Dragon's Quest. And then continue to see support from great Japanese publishers, I think was something that really popped for me in the show and it was nice to see a lot of fans of Japanese publishers react to that. So, that was something that I just wanted to call out because it means something to me. - That's amazing. - Very cool. - Thank you so much. - Yes, thank you. - This was incredible and we'll have to game sometime soon, maybe when the new Destiny expansion comes out? - Oops, Oh Destiny, we're obsessed. - That's- - Yes. - Yes. - I know you play that. - Yes, we are obsessed with Destiny. - We were huge Destiny fans like for- - It's dangerous because we would never leave the couch for days. - No, we set up two TVs next to each other and we would just down bags of Doritos. Like just, it was not a lifestyle that I should continue 24/7. - I have to admit, I'm with you on that. I think I'm at, what am I at 1055 right now in my light level, my Titan is doing well. - Oh, my gosh. - And, it was a kind of a personal project to get Destiny into Game Pass, getting them to support some stuff. So it was really cool to see Sarah get to announce that in the show and thanks to my friends at Bungie for supporting and coming into Game Pass. - Yeah, it's amazing. - So, it'll be a lot of fun to bring more players to- - Yeah, amazing. - Amazing. - We'll do some raid soon. - Oh, yeah. - Well, that's it. Well, thank you so thank. - Thank you so much, congratulations on everything. - Yeah, thank you. Good luck on the secret location and all that you're doing there. - It's gonna be pretty cool. - It's just a lot of sweating too, it's so hot. - That's ridiculous. - Awesome, well, that's great. Thank you. - Thank you. So there was so much announced today. We couldn't cover everything with Phil, but man, I'm just, I'm really excited for the future of gaming. - We forgot to talk about Forza. That's like one of our also favorite games. We went to London last year. - We did. - For launch, oh my gosh, they wouldn't let me drive the McLaren. - Well, I mean- - I don't know why, I'm not sure why they wouldn't let me. - Well, the good news is you can play it in the game safely. Like I'm happy, but I'm also sad because of E3. It's always that really fun time of the year, where we get to actually go and play the games and see all of our friends. I think what Xbox and a lot of companies have been doing is they're doing a really great job at these events in trying to make it feel like we're together when we're really not. - For sure, I mean, even like I was just on Twitter, like seeing what all my friends were saying, like seeing everyone interact that way, like online. You know, it doesn't have the same feel, but it still does have the community feel of just bringing people together. What game are you most excited about? - So the Grounded trailer was so funny. If you're waiting for the most anticipated game, you should wait for Cyberpunk, but in the meantime... - Yes. - It was just... it was so funny, that's like my type of humor, so that looked good. State of Decay 3 looked so good. - It looked scary. - Well, I got a little skip in that, when the deer was like. - The deer, zombie deer. - Ori would have 120 frames per second. Ori is already such a beautiful game. - It really is beautiful. - Man, just the future, we're gonna have 60 frames per second Halo. Very excited though for the multiplayer of Halo. I mean, I've played the campaigns but for me, like multiplayer is where I shine. I just love playing multiplayer because I get to play with my friends. I mean, obviously you can do co-op campaigns and stuff like that, which I don't think they even mentioned any co-op campaign stuff yet, did they? - I don't think so, I don't think so, but I am excited because the campaign is gonna have like this new open world, it's gonna be bigger, there's gonna be more like side quests, so I think so like I love a good side quest. - 3D maps. - Oh. - Those looked really cool. We got a little example of what that kind of looks like, some new weapons, some new abilities. - Grappling. The grappling hook. - Hello. We didn't even talk to Phil about the grappling hook. - We did (mumbles). - Call him back up. - No. - Hey Phil, we forgot to talk about Forza, we forgot to talk about the grappling, I mean I just love... I dunno, I just love playing games and I'm just really excited that, you know, this is gonna be here before we know it. And I know we were joking about gaming, saving 2020, but honestly, I don't know what I would have done without video games during this time. - Me, I probably could have done more work, but I didn't want to. Gaming is like our escape, it's incredible, we got to talk to our friends, play with our friends. It just made life feel normal. - And I think the main key about this Xbox Games Showcase is all of these games are on Xbox Game Pass. And I think having a subscription to games like this is huge because you're paying one monthly fee and you can play a ton of different games. And they're constantly always adding more games too, so you don't have to pay $60 for just one game. You could be paying a monthly subscription and play all kinds of games. - There's probably been every single person, where they were like, \"Man, I would really like to play that game, but do I really want to spend $60?\" I've done that. - For sure. - So now like having the Game Pass, if there's a game, if I want to try it out. I can actually discover for the first time, maybe I've been missing out on something just because I didn't want to pay the $60. So Game Pass, I love what they're doing with that, I think it's incredible. I think it's genius and it's just really opening up a whole new Avenue of games to people. - Yeah, even Phil was talking about how great it is to be able to take games with you and also playing in xCloud. - xCloud. - So, you know, before we used to be just locked to our TVs. Like now we can take games with us and I think that's really important, especially back when we used to travel a lot. I mean, now we're not doing it as much. I don't know. I mean, I'm looking forward to traveling, actually right now we're traveling. We're not at home, we are out on a special project, shooting something really fun. So we brought everything with us and you have your Surface Book up there. - Yeah, that's Surface Book 3. - Hookup your controller and we could be playing anything that's compatible. - I mean, well yeah, (mumbles). - So it's really exciting. - Wait until 5G is a thing like there's gonna be like that low latency, just high speed. Like it's gonna feel like we're at home, but we could be anywhere. - I love it - Oh I'm excited. The future is gonna so... Well, hopefully, I think the future is gonna be cool. - I think it's gonna be cool. - We're gonna have good games and good consoles to look forward to at least. - We will go back into playing video games and live our life there. - Okay. - But I know we were also talking about how fun it's been kind of reinventing ourselves on Twitch Like just being able to connect with the community has been so much fun because we actually get to talk to you guys directly and play games with you guys. Oh, it's so much fun, so thank you guys for being so amazing and so supportive. I think that's it for this special episode. I look forward to hearing what you guys thought of the Xbox Games Showcase and what you're most looking forward to because there was so much more to announce. This was just games that were coming out, that you could play on Game Pass. Like this is... There's so much more that we don't even know. - It's just a little tease. - Yes. - (mumbles). Thank you guys so much for watching or listening. You can leave a review on our Apple podcast, as well as a voice message on ANCHOR.FM/SAMEBRAIN, we listen to those. We didn't do any today, but- - We didn't. - In the next episodes you can stay tuned and you can hear some of those, so. - That's it. - Yay, thank you guys so much. - We'll see you guys later. - We'll see you later. - Bye. (upbeat music)",
    "transcript_keywords": [
        "Games",
        "Xbox Games Showcase",
        "Xbox Game Pass",
        "Xbox",
        "Game Pass",
        "Game Pass games",
        "game",
        "Xbox Games",
        "Halo",
        "video games",
        "Yeah",
        "play",
        "people",
        "kind",
        "Xbox Game",
        "play video games",
        "gaming",
        "Games Showcase",
        "time",
        "guys"
    ],
    "transcript_entity_values": [
        "Halo",
        "Game Pass",
        "Bungie",
        "Halo, Halo, Halo",
        "xCloud",
        "one",
        "Dragon's Quest",
        "YouTube",
        "Nintendo",
        "Xboxes",
        "Dragon",
        "10 years",
        "Surface Book 3",
        "Twitter",
        "a launch year",
        "Xbox",
        "last year",
        "5",
        "August",
        "Xbox Game Pass",
        "one day",
        "Twitch",
        "Titan",
        "360",
        "Halo Infinite",
        "343",
        "Zero Hour",
        "YouTube",
        "Ori",
        "first",
        "Phil",
        "Bonnie",
        "Xbox One",
        "Halo",
        "Minecraft",
        "Ori",
        "Xbox Live",
        "YouTube",
        "Sarah",
        "Japan",
        "2 billion",
        "monthly",
        "the Game Pass",
        "60",
        "eight",
        "a few years back",
        "today",
        "Avenue",
        "Same Brain Podcast",
        "Square",
        "60",
        "Xbox",
        "Halo 5",
        "Xbox Game Pass",
        "Halo Infinite",
        "Call of Duty and Gears of War",
        "120",
        "yesterday",
        "Pelican",
        "second",
        "E3",
        "Animal Crossing",
        "Justine",
        "Bonnie Ross",
        "Sony",
        "24/7",
        "Gears Xbox",
        "2020",
        "three",
        "Esports",
        "Grandma",
        "Los Angeles",
        "Xboxes",
        "Xbox",
        "Japanese",
        "Halo 5",
        "Nintendo Switch",
        "Tetris",
        "Pittsburgh",
        "L.A.",
        "every night",
        "California",
        "Microsoft",
        "Neil",
        "Dirt",
        "the Xbox Games Showcase",
        "Seattle",
        "millions",
        "Forza",
        "Halo",
        "McLaren",
        "Animal Crossings",
        "Gears of War",
        "Fable",
        "2021",
        "Apple",
        "Today",
        "Gears",
        "Phil Spencer",
        "Minecraft Dungeons",
        "four",
        "Game Pass",
        "June",
        "19 years",
        "Pennsylvania",
        "Fortnight",
        "Us II",
        "2019",
        "two",
        "Halo",
        "270 million",
        "Doritos",
        "PSO",
        "London",
        "Jenna"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "EVENT",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "FAC",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "PERSON",
        "ORG",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL",
        "DATE",
        "EVENT",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "FAC",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "EVENT",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "DATE",
        "NORP",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "PRODUCT",
        "FAC",
        "NORP",
        "PRODUCT",
        "ORG",
        "ORG",
        "GPE",
        "GPE",
        "TIME",
        "GPE",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "GPE",
        "DATE",
        "EVENT",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "PERSON"
    ],
    "vector": [
        -0.00910978764295578,
        -0.03923647478222847,
        -0.07292938232421875,
        -0.15251955389976501,
        0.049592193216085434,
        0.04392796382308006,
        0.07784640789031982,
        0.03626222535967827,
        -0.004399656783789396,
        0.07728059589862823,
        -0.035615503787994385,
        0.0075981165282428265,
        -0.00472829258069396,
        -0.017516663298010826,
        0.014956559985876083,
        0.05864810571074486,
        0.055860552936792374,
        -0.0363260842859745,
        -0.005085890181362629,
        0.020708147436380386,
        -0.010348266921937466,
        -0.04308118298649788,
        -0.0012068278156220913,
        0.01778033748269081,
        -0.06876348704099655,
        0.1081838309764862,
        -0.024377504363656044,
        0.02678876556456089,
        -0.09638969600200653,
        -0.07136546075344086,
        -0.027530135586857796,
        0.0291079580783844,
        0.10900798439979553,
        0.034477416425943375,
        0.039129842072725296,
        -0.05290352925658226,
        0.015846554189920425,
        -0.027154972776770592,
        -0.07197118550539017,
        -0.07035631686449051,
        -0.05189840868115425,
        -0.04805450513958931,
        0.01114562526345253,
        -0.023109151050448418,
        -0.04449665546417236,
        -0.07015158236026764,
        -0.047540344297885895,
        -0.04154383763670921,
        0.05545505881309509,
        0.09168317168951035,
        -0.0574713796377182,
        -0.0564173124730587,
        0.07420319318771362,
        -0.03229619190096855,
        -0.023717859759926796,
        0.060272395610809326,
        -0.13493914902210236,
        0.05467241629958153,
        0.03713933005928993,
        -0.06684597581624985,
        0.0035850433632731438,
        -0.07255662977695465,
        -0.03447668254375458,
        0.0745391920208931,
        -0.0416504442691803,
        -0.03982420265674591,
        0.029496731236577034,
        -0.010496062226593494,
        -0.03551338240504265,
        -0.00886587519198656,
        -0.09060382097959518,
        0.048741813749074936,
        -0.02524125576019287,
        -0.019183360040187836,
        -0.0010171248577535152,
        0.06739914417266846,
        -0.005188604351133108,
        -0.06341290473937988,
        -0.02093636430799961,
        0.07258059084415436,
        0.0632202997803688,
        -0.044806770980358124,
        -0.09032494574785233,
        -0.058132145553827286,
        -0.011162678711116314,
        0.05767112970352173,
        0.0012324181152507663,
        0.000973331683780998,
        -0.04900157079100609,
        -0.02050194703042507,
        -0.12032961845397949,
        -0.010626796633005142,
        0.03603630140423775,
        0.015230722725391388,
        -0.012432759627699852,
        -0.029198531061410904,
        -0.010370197705924511,
        -0.07309911400079727,
        -0.042723480612039566,
        0.06529019773006439,
        0.019169585779309273,
        -0.06789305061101913,
        0.0032213395461440086,
        -0.0367761105298996,
        -0.02433745004236698,
        -0.1085008829832077,
        -0.058891333639621735,
        0.07484496384859085,
        -0.002172501292079687,
        -0.0013688696781173348,
        -0.06717275083065033,
        0.0047719585709273815,
        -0.05751268193125725,
        -0.029180647805333138,
        0.04915957525372505,
        0.07048055529594421,
        0.0056012594141066074,
        0.07949493080377579,
        -0.0034169969148933887,
        0.041997019201517105,
        0.045693181455135345,
        -0.06952086836099625,
        -0.02182365395128727,
        0.05185466632246971,
        0.01216347049921751,
        0.030307883396744728,
        -0.009426330216228962,
        1.2990255827822632e-32,
        -0.01589842326939106,
        0.07794969528913498,
        0.06769802421331406,
        0.05290045961737633,
        -0.016227174550294876,
        -0.021522725000977516,
        0.04825422540307045,
        0.07842878252267838,
        -0.024697821587324142,
        0.03731692582368851,
        -0.019812775775790215,
        0.1146964505314827,
        -0.04532124102115631,
        0.025003250688314438,
        0.06389057636260986,
        -0.03729572519659996,
        0.010724022053182125,
        -0.022382065653800964,
        -0.04154254496097565,
        -0.003948621451854706,
        -0.01592242531478405,
        -0.0016469352412968874,
        0.011148115620017052,
        0.053107850253582,
        0.0896146297454834,
        0.07082561403512955,
        0.0007932381704449654,
        -0.052979979664087296,
        0.14901308715343475,
        0.03394397348165512,
        -0.09725877642631531,
        -0.02763454057276249,
        -0.03938215225934982,
        -0.04751956835389137,
        0.035275693982839584,
        0.04266325756907463,
        -0.044562820345163345,
        -0.033391378819942474,
        -0.05812041833996773,
        0.010957174934446812,
        -0.023321116343140602,
        -0.00828386191278696,
        -0.0999022126197815,
        -0.05687859281897545,
        0.025773152709007263,
        -0.005251776427030563,
        0.047499869018793106,
        0.013352993875741959,
        -0.03329218178987503,
        0.03629785031080246,
        -0.03331572934985161,
        0.022602645680308342,
        -0.07252064347267151,
        -0.029060205444693565,
        0.015237092971801758,
        -0.09800279140472412,
        -0.03922874853014946,
        0.013427747413516045,
        0.01246980857104063,
        0.06439787894487381,
        -0.010401477105915546,
        -0.05506817623972893,
        0.0037361776921898127,
        -0.05004691705107689,
        -0.06495680660009384,
        0.05687341094017029,
        0.05021011829376221,
        -0.05299467593431473,
        0.0009542127954773605,
        0.05497599393129349,
        0.04369345307350159,
        -0.004519650712609291,
        0.08348149061203003,
        0.02106115035712719,
        0.07781244814395905,
        0.05255117267370224,
        -0.11140254884958267,
        -0.030871059745550156,
        -0.006115295458585024,
        -0.03284440562129021,
        -0.05299896001815796,
        0.07741428166627884,
        0.004794730804860592,
        0.07779670506715775,
        -0.014390080235898495,
        -0.023896194994449615,
        0.022462988272309303,
        -0.012346621602773666,
        -0.04485772177577019,
        -0.010669009760022163,
        -0.06201864406466484,
        0.02924441173672676,
        -0.006705410312861204,
        -0.05343236029148102,
        -0.010277964174747467,
        -1.3415919964670644e-32,
        0.01622079871594906,
        -0.016820605844259262,
        -0.013331015594303608,
        0.009607572108507156,
        0.09449365735054016,
        0.017856840044260025,
        -0.025450918823480606,
        0.06601670384407043,
        0.059161458164453506,
        -0.06645018607378006,
        0.023926328867673874,
        -0.003139113076031208,
        -0.07812611013650894,
        0.028134876862168312,
        -0.04724844917654991,
        -0.07332319021224976,
        -0.012561938725411892,
        -0.0490746945142746,
        0.06441301852464676,
        0.00597527576610446,
        0.133748397231102,
        0.06182217597961426,
        0.06260900944471359,
        0.011661955155432224,
        -0.003305082907900214,
        0.01886657625436783,
        0.017307618632912636,
        0.03796087205410004,
        0.08106125891208649,
        0.07008617371320724,
        -0.032214052975177765,
        -0.003351535415276885,
        0.0003189119743183255,
        -0.010235242545604706,
        0.04522810876369476,
        0.05090411379933357,
        0.018749024718999863,
        0.024367233738303185,
        -0.020570602267980576,
        -0.05935480445623398,
        -0.0022452715784311295,
        -0.052435778081417084,
        0.00786499958485365,
        -0.03672429174184799,
        0.042366109788417816,
        -0.10477650165557861,
        -0.008046947419643402,
        -0.009790170937776566,
        0.061727240681648254,
        0.01170314196497202,
        -0.06512315571308136,
        -0.04540088027715683,
        -0.037936292588710785,
        0.018691081553697586,
        -0.05601397156715393,
        -0.012689623050391674,
        -0.09666207432746887,
        -0.018805498257279396,
        0.07594678550958633,
        -0.016067907214164734,
        0.02169722504913807,
        0.005547587294131517,
        -0.1004205197095871,
        -0.039072565734386444,
        0.027382100000977516,
        -0.025845268741250038,
        0.10013177990913391,
        -0.0035946196876466274,
        -0.042091067880392075,
        -0.03346463292837143,
        -0.05155070126056671,
        -0.016833283007144928,
        0.03754623606801033,
        0.024214545264840126,
        0.015065601095557213,
        -0.023901091888546944,
        -0.09574665129184723,
        -0.0027587602380663157,
        0.08803240209817886,
        -0.023730630055069923,
        -0.07301302999258041,
        -0.017581382766366005,
        0.030475245788693428,
        0.10343282669782639,
        0.09002005308866501,
        0.05025525018572807,
        0.0909874439239502,
        -0.024274222552776337,
        -0.0830007940530777,
        0.025139670819044113,
        0.042423222213983536,
        0.061263564974069595,
        0.05950930714607239,
        0.07631398737430573,
        -0.06866783648729324,
        -6.879953673433192e-08,
        0.05788348987698555,
        0.04088873043656349,
        -0.058018263429403305,
        -0.023102356120944023,
        0.058622315526008606,
        -0.009627346880733967,
        -0.031377289444208145,
        -0.009872318245470524,
        0.0586257167160511,
        -0.052621029317379,
        0.05819521099328995,
        -0.006141523830592632,
        0.017647212371230125,
        0.10332534462213516,
        0.02516564354300499,
        0.054722074419260025,
        -0.06613202393054962,
        0.027251088991761208,
        -0.0291888490319252,
        -0.019511546939611435,
        -0.03693165257573128,
        0.06948795914649963,
        0.040898896753787994,
        -0.07829703390598297,
        0.008645785972476006,
        0.002627312671393156,
        -0.03381785750389099,
        -0.021033480763435364,
        0.04377451166510582,
        0.03703686594963074,
        -0.06383447349071503,
        0.030326509848237038,
        0.025598900392651558,
        -0.030566010624170303,
        -0.02672487124800682,
        -0.042348071932792664,
        -0.00041915493784472346,
        -0.003213234944269061,
        0.04266699403524399,
        0.010046644136309624,
        -0.010834479704499245,
        -0.08702794462442398,
        -0.04847253859043121,
        0.0031040916219353676,
        0.01730070635676384,
        -0.03992949426174164,
        0.011914387345314026,
        -0.09285885840654373,
        -0.10752227902412415,
        -0.056288838386535645,
        -0.06279522180557251,
        0.0470585860311985,
        0.006128200329840183,
        -0.015478837303817272,
        0.11025997251272202,
        0.0412713922560215,
        0.07937609404325485,
        -0.01072260644286871,
        -0.013493334874510765,
        -0.018275011330842972,
        0.03533312678337097,
        0.009130952879786491,
        -0.09604275226593018,
        0.05898953229188919
    ]
}