{
    "id": "CfirQC99xPc",
    "title": "Build a DIY screen out of recycled parts for cheap",
    "channel": "DIY Perks",
    "channel_id": "UCUQo7nzH1sXVpzL92VesANw",
    "subscriber_count": 4640000,
    "upload_date": "2016-10-20T08:30:00Z",
    "video_url": "https://www.youtube.com/watch?v=CfirQC99xPc",
    "category": "Howto & Style",
    "tags": [
        "secondary",
        "laptop",
        "screen",
        "build",
        "make",
        "diy",
        "hack",
        "monitor",
        "control board",
        "second",
        "computer",
        "portable",
        "vinyl",
        "wrap",
        "carbon",
        "fiber",
        "upcycle",
        "recycle",
        "pinterest"
    ],
    "views": 5298106,
    "likes": 174071,
    "comments_count": 5029,
    "description": "Laptop users generally have to just put up with having a single main screen, but thanks to upcycling we can build a DIY portable secondary screen for laptops using recycled parts to keep the cost as low as $25! It not only performs really well, but it looks incredibly unique - it's a piece of solid industrial tech this one! Once you use two screens you can never go back!  Parts links:   Disclosure: These are affiliate links. If you click them and make a purchase from the various merchants they link to, DIY Perks may earn a commission. Affiliate programs and affiliations include, but are not limited to the eBay Partner Network and Amazon Associates.   eBay affiliate link for the control board; add the model number as shown in the video (be sure to include any suffixes like (sp) or (k1):  US buyers:   UK buyers:   If your screen isn't listed, most sellers of the control boards allow you to contact them directly and they will program a control board for your specific screen at no extra cost. Just send them the model number and you should be good to go.  Vinyl Wrap:  eBay US:   eBay UK:    This video is sponsored by Squarespace. Want to build a website? Visit  for a free trial and 10% off.  OFFICIAL LINKS:  Support me on Patreon:   Official Website:   Discord:   Forums:   Twitter:",
    "description_links": [
        "http://rover.ebay.com/rover/1/711-53200-19255-0/1?icep_ff3=9",
        "http://rover.ebay.com/rover/1/710-53481-19255-0/1?icep_ff3=9",
        "http://rover.ebay.com/rover/1/711-53200-19255-0/1?icep_ff3=2",
        "http://rover.ebay.com/rover/1/710-53481-19255-0/1?icep_ff3=2",
        "http://www.squarespace.com/diyperks",
        "https://www.patreon.com/DIYPerks/",
        "https://www.diyperks.com/",
        "https://diyperks.com/discord-server/",
        "https://diyperks.com/community/",
        "https://twitter.com/DIYPerks"
    ],
    "transcript": "This video is sponsored by squarespace, the simplest way to make a professional looking website. When using a computer for any kind of serious work, being able to hook up a secondary monitor can have some major advantages for multitasking and overall productivity - it's one of those things that you can't do without once you start using it. While this isn't a problem for desktops, as another monitor can just be added, laptop users generally have to just stick with just the single main screen, which can sometimes be frustrating depending on what you are doing. So in this video, we will be building a DIY secondary monitor for laptops, using recycled parts to keep the cost low - perfect for anybody on a budget. Its very thin and light, which makes it easy to take around with you, and its also remarkably sturdy this thing really doesnt feel like something thats been built at home, but instead feels like a piece of solid industrial tech, and it really looks the part as well. If you do make one of these, you will certainly look like you mean business. To make it, the first thing we will need is a screen from an old laptop. You can of course buy these separately as a spare part, but as this is a budget build it makes sense to recycle one, particularly if the laptop you're removing it from is dead. To get it out is just a case of removing the screen bezel, and then unscrewing the panel itself. Mine is pretty decent, as its not only full 1080p HD, but also IPS, making for exceptional viewing angles and colours. Once you've got the panel, you need to look at the back for the model number, and punch this into eBay with the phrase 'control board' after it. This brings up a variety of results, so sort it by price plus shipping lowest first to ensure you get the best deal. Now, I want mine to have an HDMI input, so adding HDMI to the search results will narrow the search down even more, giving the perfect board at the lowest price. By the way, if you want to support this channel, purchasing a board through the affiliate link in the description will send me a few pence at no cost to yourself, so many thanks if you do that. This control board is the backbone of the entire build, as it has all of the inputs you could want for your particular LCD screen, allowing it to be used with pretty much any device. We can now start working on the casing - this is very important as not only are the cables very delicate, but the screens are so thin that they are flexible and need reinforcing. To do this, we can get some thin board - 6mm MDF in my case - and cut it down to match the size of the monitor. As you can see, Ive cut mine slightly taller to allow room for the connector at the bottom. A little gap can now be made for this so that it can later be routed through to the back. Now we can drill some mounting holes for the control board. Keep in mind however that these holes need to be countersunk on the front side so that the screw heads wont be in the way of the screen fitting flush later. Now this being a DIY Perks project we want it to look cool aftewards, so what well be using to give it an industrial look is some vinyl wrap. This stuff mimics carbon fibre, so its texture changes depending on the angle you look at it from. Its very cool stuff, and you can find links to it in the description. This can now be stuck to the board, using a hairdryer to soften the adheisive for a more secure fit. As this wrap covers the mounting holes, we can use a sharp point to punch through it, and then insert the screws from the other side. These can now be tightened on to some short PCB standoff pillars. The control board should now fit nicely on top of these, and to secure it in place well need some more of them, this time much longer with both ends being female. As you can see, the tops of these standoffs sit above the components on the board itself. The button board too can be mounted, only this time secured in place with some nuts. We can now make a little cover for the main PCB using a very thin piece of board, again wrapping it in vinyl, which can then be screwed on top to protect the circuitry. The wire too can be protected by using some cable sheathing, which also adds to the industrial look. Now, as this cable runs through to the front, we can use some more thin board to build up a surround around it, so that later we can encase it entirely underneath a piece of thin aluminium. With that done we can now mix some fast drying epoxy and use it to stick the vinyl wrap down along the edges. While the wraps adhesive is decent enough, adding this epoxy will ensure that it will never peel away. Once its dried, the excess can be trimmed off with a knife. Now its time to stick down the screen itself with some more dabs of epoxy on the edges its a good idea to add some underneath the cable too as this will ensure that it can never become loose. Once this has all dried, we can add some masking tape along the edges of the screen this is because were going to again use some epoxy to stick down some thin strips of vinyl along the edges and down the sides, and the masking tape ensures that no epoxy will stray onto the screen itself. Looking good. Now we can stick down that thin piece of aluminium I mentioned earlier. As you can see, it has first been wrapped in vinyl before being added. The excess wrap can again be folded over the bottom edge and again stuck down with epoxy, finishing it off by again trimming it down with a knife. The wire too can be glued in place on the back. With that the screen is almost complete, but as you can see it still needs some kind of support so that it can remain upright on its own. To do this we can recycle the hinges from the laptop the monitor came from these are quite stiff so are ideal for our needs. To mount them, we can simply drill some holes through from the front, and then screw them in place. The monitor is complete! Now it can be plugged into the laptop. As the screen also needs 12v for power, we need to hook it up to a power adapter as well, although there is a way you can power it from the laptop itself which Ill get to in just a minute. As the workspace is now expanded over two screens it makes it much easier to get some serious work done situations where I find a screen like this useful are when Im editing videos, working on graphics, or building websites... which leads me nicely on to the sponsor of this video; Squarespace. Using their many templates you can quickly build a website that looks professional, all from a browser, with no extra software required. For those who want to customise things more deeply they have plenty of under the hood settings so you can fit it to your own personal needs. I am in fact building a DIY Perks website with it and it's actually starting to look really nice. So if you'd like a free trial for yourself, visit Squarespace.com/perks or sign up using the link in the description. Also, using the offer code 'PERKS' at checkout will give you a 10% discount if you do decide to go with them. Now, to power the screen from the laptop itself we'll need a little extender for the laptop's power supply, and a voltage step down board. The extender first needs to be chopped in half to expose the internal wires, after which we can get the input side and solder it to the input of the voltage regulator, with red being positive and black being negative. Now we need a wire with a connector on the end that fits into the screen, which we can again solder to the regulator - only this time to its output. With that done they can be glued together to keep it all secure. If we plug in the laptop's adapter and monitor the voltage of this output with a multimeter, we can adjust it so that it outputs 12v by turning its built in variable resistor. Once that's done the other connector can be soldered to the input side of this board, which hooks it directly up to the first connector we added. As my wire was a little on the short side, I extended it before wrapping the whole thing in some heatshrink, which can then be held over a source of heat to shrink it. Now it can be plugged in between the laptop and its adapter, allowing the DIY screen to be powered at the same time. Now although I did build this screen specifically for its portability for use with my laptop, Ive actually found it to be very useful as a secondary screen on my main desktop too, as it is quite small, yet is still full HD, making for a high DPI not usually seen on desktop screens. So I hope youve found this project interesting, and if you do make one of these then why not send me a picture @DIYPerks, especially if you use a different colour for the vinyl wrap, as I'd really like to see how that looks. Now if you did enjoy this video then you might enjoy this one too, where we convert some shattered, dead, destroyed laptop screens into a fake window, which actually ended up looking pretty cool. Other than that, don't forget to give a like on this video if you did enjoy it, and also consider subscribing if you haven't already. I'm Matt, and thank you very much for watching.",
    "transcript_keywords": [
        "screen",
        "board",
        "laptop",
        "control board",
        "thin",
        "monitor",
        "make",
        "thin board",
        "screens",
        "vinyl",
        "epoxy",
        "DIY",
        "DIY secondary monitor",
        "DIY Perks",
        "wrap",
        "vinyl wrap",
        "side",
        "video",
        "makes",
        "stick"
    ],
    "transcript_entity_values": [
        "first",
        "PCB",
        "just a minute",
        "12v",
        "squarespace",
        "two",
        "HDMI",
        "LCD",
        "10%",
        "half",
        "a few pence",
        "DIY",
        "Squarespace",
        "eBay",
        "Matt"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON"
    ],
    "vector": [
        -0.09739752858877182,
        0.010385522618889809,
        0.024049924686551094,
        -0.1300121396780014,
        0.04614267125725746,
        0.005949655547738075,
        0.022470779716968536,
        0.051211778074502945,
        -0.027685951441526413,
        -0.04357568547129631,
        0.05302389711141586,
        0.010450627654790878,
        0.08523831516504288,
        0.007373514119535685,
        0.03265843912959099,
        -0.022070609033107758,
        0.030237747356295586,
        -0.026912229135632515,
        -0.013160401955246925,
        0.019704917445778847,
        -0.023991741240024567,
        -0.08433280140161514,
        -0.011792032979428768,
        -0.07992595434188843,
        -0.01768813468515873,
        -0.03305840492248535,
        0.04657973349094391,
        0.018396103754639626,
        -0.04571248218417168,
        -0.06493467837572098,
        0.04196702316403389,
        0.023711148649454117,
        -0.05607972666621208,
        0.05523597076535225,
        0.05333327874541283,
        -0.0836569219827652,
        0.007915893569588661,
        -0.034436363726854324,
        -0.06397970765829086,
        -0.12169723212718964,
        -0.05146506428718567,
        -0.024822194129228592,
        -0.04389691352844238,
        0.03939703851938248,
        0.038462862372398376,
        -0.027006439864635468,
        0.043165165930986404,
        0.04157973453402519,
        0.05123386159539223,
        -0.08656350523233414,
        0.08638998121023178,
        0.001662199036218226,
        0.007228611037135124,
        -0.05010377615690231,
        -0.033408213406801224,
        -0.04957792907953262,
        0.03586418926715851,
        0.012803788296878338,
        -0.000125795035273768,
        -0.029382066801190376,
        0.14870542287826538,
        -0.03260479122400284,
        -0.030735548585653305,
        5.605518526863307e-05,
        0.010747763328254223,
        -0.029293587431311607,
        0.04420928657054901,
        0.016554120928049088,
        -0.07815051078796387,
        -0.014128664508461952,
        -0.08178199082612991,
        -0.08239449560642242,
        0.07233993709087372,
        0.016042977571487427,
        -0.03142266720533371,
        -0.038416557013988495,
        0.05895242840051651,
        -0.042261753231287,
        -0.036150798201560974,
        0.06697835773229599,
        -0.08369007706642151,
        0.07411257922649384,
        -0.03488646075129509,
        0.016808046028017998,
        -0.0393746942281723,
        -0.03955921530723572,
        0.010497788898646832,
        0.04204919561743736,
        0.020863844081759453,
        -0.05336414650082588,
        -0.06678742915391922,
        0.07537559419870377,
        -0.044527411460876465,
        -0.05819545313715935,
        -0.013863093219697475,
        -0.044119905680418015,
        0.04992952197790146,
        -0.010469779372215271,
        0.016922054812312126,
        0.048085689544677734,
        -0.03547009453177452,
        0.050965581089258194,
        0.17156729102134705,
        -0.07173998653888702,
        -0.03656626120209694,
        -0.10632413625717163,
        -0.03860170766711235,
        0.052232008427381516,
        0.016958335414528847,
        -0.0011770774144679308,
        -0.1344948709011078,
        0.015997258946299553,
        -0.0491052120923996,
        0.05614751577377319,
        0.0628902018070221,
        0.0074441516771912575,
        -0.013205804862082005,
        -0.03249693289399147,
        0.14174839854240417,
        -0.05600395053625107,
        0.04585420340299606,
        -0.02793199010193348,
        0.03954378888010979,
        -0.031798865646123886,
        0.03334007412195206,
        0.012979090213775635,
        -0.0009753872291184962,
        5.6547001462672595e-33,
        0.04424383118748665,
        0.11523538827896118,
        -0.04088623821735382,
        -0.044540029019117355,
        0.06321229040622711,
        0.08768647164106369,
        0.05322609841823578,
        0.06300573796033859,
        0.021165942773222923,
        0.02241368778049946,
        -0.029070623219013214,
        0.00035943882539868355,
        -0.06639443337917328,
        0.05024441331624985,
        0.030232438817620277,
        -0.053358081728219986,
        0.007744609843939543,
        -0.017499864101409912,
        -0.03191010281443596,
        0.007717703934758902,
        -0.04725172370672226,
        -0.022801758721470833,
        -0.008427492342889309,
        -0.051757488399744034,
        0.03095114417374134,
        0.01801888458430767,
        -0.0003442208981141448,
        0.06589183211326599,
        0.05572886765003204,
        0.02973872981965542,
        0.0051969485357403755,
        -0.02428339049220085,
        0.02288847044110298,
        -0.048613134771585464,
        -0.058331672102212906,
        -0.08107951283454895,
        -0.10268125683069229,
        -0.025810448452830315,
        0.09269940108060837,
        0.008585484698414803,
        -0.07432540506124496,
        0.04729752615094185,
        -0.008077418431639671,
        -0.042198579758405685,
        0.05555933341383934,
        0.0005900492542423308,
        0.023411475121974945,
        0.07609401643276215,
        0.013341063633561134,
        -0.03707738593220711,
        -0.04747875779867172,
        -0.028119497001171112,
        0.0055428436025977135,
        -0.12355419993400574,
        -0.1407126784324646,
        -0.026328567415475845,
        0.035328224301338196,
        -0.02514181286096573,
        0.0871991366147995,
        -0.008618894033133984,
        0.034349218010902405,
        0.05865895748138428,
        -0.016763700172305107,
        0.019716793671250343,
        -0.04401222616434097,
        -0.0026876903139054775,
        0.07748246937990189,
        0.04876928776502609,
        -0.10159644484519958,
        -0.05727383866906166,
        -0.04908101633191109,
        -0.029640857130289078,
        0.016201866790652275,
        -0.07491469383239746,
        0.027601588517427444,
        -0.008682677522301674,
        -0.01768828183412552,
        0.026529846712946892,
        -0.0026822476647794247,
        -0.037803929299116135,
        -0.027677111327648163,
        0.0009776907972991467,
        0.008362825959920883,
        -0.017960555851459503,
        0.046384453773498535,
        -0.0059232888743281364,
        -0.020113011822104454,
        -0.022107545286417007,
        0.008996108546853065,
        -0.014864906668663025,
        -0.006094865035265684,
        -0.017623908817768097,
        -0.09854993969202042,
        0.003604446304962039,
        0.05860975384712219,
        -6.814293731942768e-33,
        0.028743181377649307,
        -0.07247031480073929,
        0.017951905727386475,
        -0.015828855335712433,
        0.06969773024320602,
        0.02755988948047161,
        0.011466474272310734,
        0.007867556996643543,
        0.04330218583345413,
        -0.0056810565292835236,
        -0.08541931957006454,
        0.07947682589292526,
        -0.005348789971321821,
        -0.015063203871250153,
        -0.004660594742745161,
        0.03074084222316742,
        -0.06734165549278259,
        0.025828668847680092,
        -0.029599333181977272,
        -0.0321509875357151,
        0.050309062004089355,
        0.027023138478398323,
        0.020218420773744583,
        -0.006051964592188597,
        0.011974758468568325,
        -0.06584057956933975,
        -0.025955142453312874,
        0.045064929872751236,
        0.056865472346544266,
        0.06517677009105682,
        -0.0321696400642395,
        -0.08691459149122238,
        0.034711405634880066,
        0.07952409237623215,
        0.02821982465684414,
        -0.06364081799983978,
        -0.0010896098101511598,
        0.017413582652807236,
        0.010942784138023853,
        -0.029849061742424965,
        0.02975868619978428,
        0.07120472192764282,
        -0.041051462292671204,
        0.019352920353412628,
        0.014316443353891373,
        -0.008767412044107914,
        -0.036980122327804565,
        -0.07292627543210983,
        0.04067115858197212,
        -0.02404710277915001,
        -0.01912406086921692,
        0.05750388652086258,
        0.03148481994867325,
        -0.006644048262387514,
        -0.043752461671829224,
        0.007757425308227539,
        0.060919634997844696,
        0.09837563335895538,
        0.07651286572217941,
        -0.03110700473189354,
        -0.019283097237348557,
        0.006111367605626583,
        -0.009902819991111755,
        0.009954734705388546,
        0.022842679172754288,
        -0.033420536667108536,
        0.09944455325603485,
        0.08292314410209656,
        -0.03402198478579521,
        -0.013712345622479916,
        -0.058924492448568344,
        -0.032436519861221313,
        -0.002802884206175804,
        -0.08014766126871109,
        0.028386428952217102,
        0.011340206488966942,
        -0.034104082733392715,
        -0.005466803442686796,
        0.004201384726911783,
        0.02170731872320175,
        0.032510168850421906,
        -0.06183740869164467,
        0.051723845303058624,
        -0.015573256649076939,
        0.0367448627948761,
        -0.023285547271370888,
        -0.01821981742978096,
        0.04243034869432449,
        -0.015437819994986057,
        0.01254932302981615,
        -0.012895203195512295,
        0.04503032937645912,
        -0.009634129703044891,
        0.08601964265108109,
        0.06638868153095245,
        -5.623710919167024e-08,
        0.03599037230014801,
        -0.01810382679104805,
        0.09089387953281403,
        0.07218614220619202,
        -0.03665703535079956,
        -0.0812106803059578,
        0.0638449490070343,
        0.031957682222127914,
        0.0648670420050621,
        -0.04468097910284996,
        -0.01641690544784069,
        -0.10908922553062439,
        -0.015095285139977932,
        0.031011443585157394,
        -0.017761318013072014,
        0.06588678061962128,
        0.05110322684049606,
        0.09817591309547424,
        -0.0023854589089751244,
        0.04735538363456726,
        -0.03989101201295853,
        -0.04054601117968559,
        0.14108256995677948,
        0.003989245276898146,
        -0.0008332666475325823,
        0.04349001869559288,
        -0.05283214524388313,
        0.040689773857593536,
        0.026349732652306557,
        0.015505312941968441,
        -0.0012485245242714882,
        -0.021381434053182602,
        -0.006651139352470636,
        -0.01579740270972252,
        -0.03469289839267731,
        -0.07949754595756531,
        -0.0831250548362732,
        -0.0022869440726935863,
        0.04255886375904083,
        0.046370506286621094,
        0.020636167377233505,
        -0.11600049585103989,
        -0.10092725604772568,
        -0.004074191674590111,
        0.09707759320735931,
        0.03193717449903488,
        -0.07888970524072647,
        -0.13048559427261353,
        -0.06051618978381157,
        0.06564202904701233,
        0.058905210345983505,
        -0.06282511353492737,
        0.01856144703924656,
        -0.018478570505976677,
        -0.038625966757535934,
        0.05707579106092453,
        0.015435256063938141,
        0.03850845620036125,
        0.09971395879983902,
        0.06327074021100998,
        0.04332845285534859,
        -0.019438136368989944,
        0.008085764944553375,
        0.02598748542368412
    ]
}