{
    "id": "cfOrCbq11W0",
    "title": "I likea da truck - Rivian R1T",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-03-26T19:15:10Z",
    "video_url": "https://www.youtube.com/watch?v=cfOrCbq11W0",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "rivian",
        "truck",
        "ev",
        "r1t",
        "cool",
        "car",
        "tow",
        "electric",
        "lightning"
    ],
    "views": 534643,
    "likes": 22854,
    "comments_count": 1432,
    "description": "Communicative effectively with the right tone at work! Sign up for an account and get 20% off Grammarly Premium:   Alex has been testing EVs on ShortCircuit for a while now, but nothing has made him as excited as Rivian's R1T has. With a quad-motor setup, great range and acceleration, and a ton of included extra features like a gear tunnel, removable speaker, and tonneau cover (well, kinda), this EV seems to be setting a new bar for all vehicles to come. Does it all work together, or should you stick with a more established brand?   Thank you to Kessler & Ascending Works for sending us the Killshock EZ Mounting Bundle! Check it out here:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 THIS is an EV! 0:27 Junk in the Frunk 1:01 Exterior design, charging, tires, and storage 4:08 Trying out auto-leveling 4:50 Interior tour and software impressions 8:12 Sponsor - Grammarly 9:00 Driving impressions (it's fast!) 16:13 Sound system and Labs results 17:28 A downside for heavy truck users 18:09 Overall thoughts 19:59 Outro",
    "description_links": [
        "https://grammarly.com/shortcircuit",
        "https://lmg.gg/CVw6w",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- The Rivian R1T, we've got one here and holy frig! This thing is something sweet. I absolutely love it. Ever since Tesla brought out the Model S, that was the first car that was very clearly thought, from the ground up to be an electric car. And since then everyone's been, well, for the most part, they've just been making normal cars, just cramming the trunk full of electronics and crap, not a care in the world. Rivian though, they have done a fantastic job. Look at the size of this frunk. (frunk popping open) Like look at how much stuff in here. We have the LTT backpack, water bottle, the holder for the water bottle. Sorry Nick, I just stole that from you. And even the wireless transmitter and that's not all. Down here, we have this magnetically attaching cover and below that, we have our bike lock as well as your AC charge, that you can use at your house. I have been absolutely loving, just throwing all of my crap into this frunk. It isn't the largest on the market. That goes to F-150 Lightning. But in fairness to Rivian, that is a much larger truck. The overall design I think, is fantastic. I have never gotten as much attention in an electric car, as this one right here, spare maybe the Taycan. Everyone absolutely loves it, well not everyone. Some people think these look kind of stupid, but they are factually wrong. Moving around to the side here, we have our charging port, which opens every single time you touch it. Fantastic. And it's able to do 200 kilowatt DC Fast Charging. That isn't quite as fast as you might find from like Genesis or some others. But, it still is pretty darn good, and it has worked every single time for me. For tires, they have done this incredible thing, where they give you options of tires, that you might actually want. (chuckles) These ones right here, we have the All Terrains and they are sweet, good old Pirelli Scorpions. And of course all of the rim options I think look fantastic. The amount of crap that you can fit in here is truly incredible. You have all of this space that's underneath the seats. That's pretty average. But there's also space behind the seats. (truck door shuts) By pushing this button right here, you gain access to the gear tunnel, which goes behind those seats, but in front of the bed, and you can fit just, a lot of crap in there. It isn't quite as practical as I thought it might be at first. Like, I found my stuff always ended up in the middle and I kind of have to like, (muffled grunt) do one of those, but at the same time it exists. And as a bonus, if you're putting like a kayak, or something on top, you can just hop right up here. 250 pounds, it'll hold. So you can, you know, grab something, put it up on the roof racks or put something into the bed. It's just a nice spot to have. Ours came with the Power Tonneau cover, and to use it, you just press right here. (background music stops suddenly) You just press right, you press. Yeah, about that. So the Power Tonneau cover, it turns out, you get any sort of dust or crap, or basically just use it and it breaks completely. They are going to fix it but they haven't on this one yet. So for now, it's just disabled. Of course, this being a truck, you've got a nice big ole' bed. It isn't as large as you'll find on some but, thank you Mr. Snazzy for confirming that four by eight sheets of plywood will go in here, just fine. Also back here is the spare tire area, which notably, does not have a spare tire in it, and you cannot buy a spare tire from Rivian. Anyway, it's a nice spot to throw your stuff. It's like a ridge line. Back here, we've also got an air compressor. Love it. You can just dump your tire pressures when you're going off road, and then you know, plug 'er in and put them back up for when you're going home. And also we have, a very loud Miata. (car engine roaring) Hell yeah. And also we have our bike lock, which you can put through like that, and attaches right in here so you don't have to worry about anyone walking off with it, assuming your car's locked. Also back here, we've got dual 124 volt outlets and some lighting for your bed. In both sides of the gear tunnel, we also have 120 volt outlets. On the other side it's 12. And right here we have a first aid kit. (door slamming shut) On the other side, is the air compressor line. One of the coolest things about this air suspension though, is that if you want to use the, well the bed, as a bed, or get one of those fancy camping chummies, it'll auto level for you. Let's see how well it works. (upbeat music playing) Now if I come in here, to camping mode, and hit level truck, apparently it will level it. (upbeat music playing) Apparently it can take a while. (electronic whirring) (music continues) Okay, apparently it's done it. Let's go check their homework. We've got the level here, put it on. Ah, let's go right here. Not bad, they're within a degree. Given how we set 'em up within a degree is pretty darn good. (upbeat music continues) (truck door shutting) Hoping into the back here, this is a very nice spot to be. We've got USB-C charging, USB-C charging. Seats are very comfortable. I've got plenty of headroom. We've also got two cup holders, access to the gear tunnel, and a little control for the rear climate and your rear seat heaters. I really appreciate all the little details they have. Like this right here. It feels premium without feeling like you're gonna destroy it, the first time you touch it. (car door shuts) In the driver's seat, first thing I wanna talk about, is the key. It looks really cool. It's like a little, carabiner thing. And it's also one of the worst keys I have ever experienced. Yeah, it doesn't work most of the time. I'm now concerned about the car not turning on, but it doesn't always wake up. Doesn't matter. I just use my phone now. (breathy laugh) By just using the Rivian app, I can access the car, like you normally would, just through my phone. I still do keep the key on me, but it's really nice to be able to just use this to, you know, lock, unlock. You've got all the controls that you'd expect, climate control, so if it's super hot or cold, you can have it be comfy when you get in. I like it. In here, we've got loads of space, good ole' cup holders. In here there's, a lot more room than you'd think. And we even have, a Bluetooth speaker for some reason. It's cool I guess, a little bit gimmicky but it is cool. In here, they have eliminated almost all of the buttons that you want. But they at least haven't done it in a dreadful way. So steering wheel controls, really nice. We've got rollers, we've got buttons, so you can do your sound and your cruise control, easily enough. We've got stocks. Shouldn't be something that you have to talk about, but here we are. And of course, the star of the show is this great big touch screen right here. Essentially every single thing that you want to do with this truck requires watching a tutorial. But at the same time, once you've watched said tutorial, it all makes sense and you can just do it again and again. Let's look, we've got our Tidal app right here, really nice and large to look at. We've got Spotify if you want crappier audio. And of course, like your phone or your radio. Now, one of the problems, is that there's no Android Auto or Apple CarPlay. Rivian says that this is because, they can do a better job of their apps by doing it natively. Which in fairness, the Tidal app does not look this pretty, if you're doing it through Android Auto. The problem though, how long are they going to support it? I don't know. It would be really great if they supported it for five years or so. That's great for tech. But that's pretty fricking terrible for a car. And I would really appreciate to be able to plug in my phone and know for sure that in 10 or whatever years, Android Auto will still go through my phone, and I don't have to worry about this being good at all. Also, you have to use Alexa, which is fine, but nowhere near as good as Google Assistant. One thing that is very nice though, is that they use Google Maps for navigation, so you don't have to worry about it sending you to the complete wrong spot, like the Lucid was doing. And overall, even though for like climate control, I'd really like to have physical dials. You can just press this here, it all makes sense. The controls that you want, are on the main screen, at all times. It's not bad. I don't hate using it and well, yeah, it's not bad. (breathy laughing) What else can we say Andy? That's that's about as shining of a review as you can get these days, on an electric car. - [Andy] I know something we can say, our segue to sponsor! - (beep) me, Andy. (breathy laughing) Grammarly. Thanks to Grammarly for sponsoring this video. Communicating online through email, Slack, or Discord can be easily misinterpreted or become a huge time block. That's why all working professionals need a desktop app, like Grammarly. Grammarly provides comprehensive spelling and grammar suggestions, and ensures your writing is mistake free, professional, and polished. Simply install the free desktop app, log in and start typing. There's also Grammarly Premium, which provides more in-depth feedback on your writing, such as tonal transformations, to adjust your tone, and sound confident. You'll be more productive with their Clarity full sentence rewrite feature, that helps you rephrase hard to read sentences, so you come across more clear and confident. Work smarter, not harder. Go to grammarly.com/shortcircuit to get a a free account and get 20% off Grammarly Premium today, to help you get more productive with your projects moving forward. (upbeat music playing) Driving this thing is (chuckles) freaking incredible. All right, let's put her into sport mode here. Break Regen, Stability off. Thank you. Foot all the way on the brake, gas. Ooh, oh my god, this thing is fast! Holy (bleep) balls. Even though this thing is 8,500 pounds, it also has four electric motors, and a grand total of 850 horsepower. That means that you have a zero to 60 time of just three seconds. This thing tops the Lambos. You can have a V12 and get absolutely dusted by this thing. She's like, (truck humming) oh my god, it is so good. (chuckles) It is hilarious. And when you think of the performance for money, it's like actually pretty good. This is an expensive car. This thing is 120,000 Canadian dollars. But at the same time, not many cars can do that kind of acceleration. And especially, it has a truck bed on it. It has a frunk. I can store all my stuff here, and it does that! (chuckles) Oh my god! (laughing and truck humming) Andy just asked if this is the fastest 120 grand car, 120 grand Canadian. It very well could be. I don't know. Now as for cornering, it's a truck. I've actually had a little bit of trouble, kind of figuring out exactly how good it is. Just because like, it's so incredibly fast. So you can end up being extremely, extremely fast in corners and the chassis isn't quite able to handle it. But at the same time, for a truck, it's the best handling truck I have ever experienced. Now the ride when you're in sport mode, is pretty stiff. So let's just put it back into all purpose, and have things soften up a bit, for us here. This is a very bumpy road. For just everyday cruising around, this is very quiet and comfy. It isn't quite as quiet as some of the other EVs, and most of the noise is coming from, just the air around you. This is not the most aerodynamically shaped truck. Well, for a truck it's pretty good, but for a car it isn't. But it does mean that you have a little bit of wind noise, coming as, I don't know, there's probably some weird turbulence right around here. Overall though, I think they have done a fantastic job at hitting what they actually want to do. We can talk about going camping and blah blah blah. Most people are probably gonna be just taking this, to and from work every single day, and it will be great for that. These seats, super comfortable. This whole interior, it manages to be premium, but I'm not worried about like scuffing it up, making it all dirty. It isn't like those white interiors in the Genesis. Overall, it is just a very comfy spot to be, and I quite like it. Oh, it just started freaking out there. (beeping) That's one thing that I have noticed. The adaptive cruise in this, is not quite as good as what you'll find on some other cars, like Genesis or VW or GM or pretty much everybody. It's pretty bad. (chuckles) Overall, it is good at holding the distance, to the person in front of you, but sometimes, if there's a car parked on the side of the road, or turning left, or maybe there's even just like a hedge that's kind of close to the road, it freaks out a bit and it was like, \"Ah, is that someone, oh no, it's fine. Oh ah!\" It's not the most confidence inspiring, but it's a sort of thing where, you kind of know when it's gonna screw up, after a little bit. One thing that it also has, is the highway assist feature, which has never worked for me. It just has highway assist not available on this road. And that's always been the end of the story, in my testing. Going back to the whole this has four electric motors thing, there's a motor on every single axle. So you don't have to worry about like, a differential not doing a good job, or like you know, it locking up while you're on the road, bad time. It just is always going to be able to do it, so that the exact amount of torque that you need, is going to the tire that requires it. This also has a really cool thing, where by using those four motors, they're able to calculate the coefficient of friction for a given surface. This means that they're able to pretty accurately guess if it's like gravel, dirt, mud, snow, so on and so forth. Because for all of those different surfaces, you're going to want different, allowable amounts of slip. So on tarmac like this, you want traction control, to have it so that your tire is slipping as little as possible. The more that it slips, the more you're just gonna be turning energy into heat. Bad time, you will go slow. On dirt though, it's a little bit different. So if you say, want to do a really tight corner, or do some hard breaking, you want to actually be biting into that surface a little bit, and slipping the tire will allow you to be going faster and have more traction. That's why in rally they're doing those big ole' (speaker imitates engine roaring of car), big ole' slide-y slides, they're able to get more grip by doing that. Whereas on a race track, you do not want that, in the slightest. The limiting factor, when you're off-road with this, is not going to be the capabilities of the car. With this four wheel drive system, it will go there. The limiting factor is, how hard do you want to push it, with $120,000 truck? (chuckles) I guarantee you, that buddy in a 30 year old Pajero, is gonna be ripping past you, because he does not give a (beep). Now there is also an option for a dual motor setup. So this right here, has an open differential for the front and the rear, so it isn't going to be as capable off road. But at the same time, you have motors on the front and the rear, so as long as you don't have, like each corner in the air, you should be fine. And using the brakes, they probably still can get you out of most situations. One advantage of the dual motor setup though, is that, well there's a couple advantages. One, it's cheaper and two, you have more battery options. So this right here has the 135 kilowatt hour battery, which is good for about 500 kilometers of range. There also is is a 400 kilometer of range, 108 kilowatt hour battery that's available with the dual motor, and an incredibly beefy 135 kilowatt hour battery, that's also available with the dual motor. So if you do want over 600 kilometers of range, that is possible, although it is expensive and you don't get the quad motor. The seats are a little bit high up, for my liking. But at the same time, like it's a truck, of course they are. And oh, we've got a corner coming up right here. Doo da doo dee. (upbeat music playing) (truck humming) (chuckles) It's not the most confidence inspiring. I'm sure with the sport tires, instead of the all terrains, it would be a little bit better. But at the same time, it's a truck. And these seats you're just gonna be, (swishing from seats) yeah, just flopping all around at a tight corner. They're not super bolstered. But again, it's a truck. (breathy laugh) You can chop just about everything on the road, like I am certain this goes faster around corners than my GTI, and this is 8,500 pounds. Incredible what you can do with 850 horsepower. (breathy laughing) (upbeat music continues) You do get a surprising amount of inverter whine in here. I don't know if you can hear that right now, but you can, sort of, constantly hear the electric motors. But for one, it sounds cool, and two, you don't hear it too much once you start playing some music. In here, we have a sound system from Meridian Audio and it is pretty dang good. (upbeat music playing in truck) It isn't perfect, but they gave us a full blown EQ, so any weirdness that there was, we were able to just take out and it's, (song base intensifies) yeah! Okay, at that loud it distorts a little bit, but when you're right around here, (lowers music volume) it is pretty darn good. For all of you R1T owners out there, this is the EQ settings that we used, to hit our LMG target curve. But with an EQ like this, you can put it in however you want, and the 3D surround is actually pretty darn good. Now, in audio there's a thing called staging. So you want your singer right in the center, and then your instruments pan from left to right. And in cars that's really hard to do, because you know, you're right against the side. There's these reflective panes, and so on. So for the most part, you just hear the speaker that's closest to you. In this though, it does a great job of, sort of, surrounding you. They have this 3D surround in here. So enhanced sucks, it brings too much to the back. But on and off both sound pretty darn good. It is a little bit roomy, but at the same time, like we have this huge pan of glass. We have glass, glass, glass. They've done a pretty good job. Now, although practicality wise, this thing is fantastic. There is one thing, that I'm sure all of the truck people have been absolutely screaming about and that's towing. And yeah, if you wanna tow things far, don't buy this, get a diesel. Like that's pretty much it. You're going to have to be charging it up, because at the end of the day, like F equals MA. You add a trailer and all of it, to drag back there, you're not gonna be able to go that far. It's just physics. That said though, if you just wanna tow something locally, you're gonna have no trouble. This has heaps, gobs of torque. It's gonna be a good time. And like I fricking love this thing. (chuckles) This is a fantastic car. Sure, $120,000 Canadian is a lot of cash, but at the same time, trucks are fricking expensive. And this one right here is, the best one that I've ever been in, for the most part. The vast amount of people that are buying electric trucks, it is their very first truck. And I have to say, for most people this is gonna be great. Like we are in Langley and there are so many city trucks around and I frigging hate it. Like I'm from rural Nova Scotia, and I absolutely love a truck for like, you know, doing some good truck things. Hate it when someone's just driving this big stupid thing around to take their kids to soccer practice and stuff. So stupid. So for the vast majority of truck owners, around here, this is gonna be, just plain better for them. Like way faster, way more convenient, and also just way cheaper to run. Have you seen the gas prices here? (chuckles) Brutal. But yeah, if I had the money, I would go out and buy this thing tomorrow. Like, I like it that much. It is absolutely fantastic. Probably my favorite car that we've reviewed so far. It is, oh it is so good. Like, what truck can you do this in, Andy? - [Andy] Nothing. - (breathy laughs) nothing. Yeah, it's sick. Guys, please make the R1W, the wagon. I would buy that in a heartbeat. I don't even care. Go into debt. Oh, we have a corner. Oh my god. Uh, right? Sport, lowest. Turn off stability. Sure, (beep). Actually no, I want stability on. I'm not that confident. We don't have time. Oh, oh (truck humming) Yeah, it corners pretty darn well, for something this massive. How do they get 8,500 pounds, to go around like this? You guys did a darn good job, Rivian. So if you like this video, hit like, get subscribed. And maybe just tell us down below, what car you wanna see us review next. Have a great day.",
    "transcript_keywords": [
        "thing",
        "good",
        "truck",
        "time",
        "pretty darn good",
        "pretty",
        "car",
        "bit",
        "darn good",
        "pretty darn",
        "pretty good",
        "Yeah",
        "good truck things",
        "Rivian",
        "back",
        "nice",
        "put",
        "fantastic",
        "road",
        "Grammarly"
    ],
    "transcript_entity_values": [
        "Alexa",
        "120,000",
        "Slack",
        "Tesla",
        "20%",
        "about 500 kilometers",
        "LMG",
        "Rivian R1",
        "Google",
        "200 kilowatt",
        "120,000 Canadian dollars",
        "135 kilowatt hour",
        "no Android Auto",
        "AC",
        "Tidal",
        "$120,000",
        "120 volt",
        "400 kilometer",
        "GTI",
        "108 kilowatt hour",
        "Doo da doo dee",
        "Apple CarPlay",
        "Miata",
        "Snazzy",
        "tomorrow",
        "today",
        "250 pounds",
        "850",
        "five years or so",
        "Break Regen",
        "GM",
        "F equals MA",
        "Andy",
        "LTT",
        "just three seconds",
        "Discord",
        "first",
        "two",
        "600 kilometers",
        "eight",
        "zero",
        "Nick",
        "8,500 pounds",
        "one",
        "Pirelli Scorpions",
        "Pajero",
        "124",
        "Grammarly",
        "Lambos",
        "Taycan",
        "Google Maps",
        "Meridian Audio",
        "F-150 Lightning",
        "these days",
        "120",
        "Nova Scotia",
        "Spotify",
        "V12",
        "12",
        "the end of the day",
        "30 year old",
        "Grammarly Premium",
        "Tidal",
        "One",
        "VW",
        "Genesis",
        "60",
        "Stability",
        "Rivian",
        "10 or whatever years",
        "Power Tonneau",
        "Canadian",
        "Langley",
        "four",
        "the Model S",
        "EQ",
        "USB-C",
        "every single day",
        "Android Auto"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "NORP",
        "ORG",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "FAC",
        "CARDINAL",
        "PERSON",
        "NORP",
        "NORP",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "LOC",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "NORP",
        "DATE",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORG",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.07428033649921417,
        0.004178483039140701,
        0.02891385369002819,
        -0.09308566153049469,
        0.018837952986359596,
        0.0357055701315403,
        -0.007149410899728537,
        0.051466379314661026,
        -0.07677870988845825,
        -0.02088121883571148,
        0.03031178005039692,
        0.011526582762598991,
        0.07485764473676682,
        -0.054182298481464386,
        0.07203344255685806,
        -0.0025090069975703955,
        0.10614565014839172,
        -0.008589892648160458,
        0.035463280975818634,
        0.021560104563832283,
        0.01650495082139969,
        -0.03255515173077583,
        -0.012904970906674862,
        -0.014576757326722145,
        -0.024600224569439888,
        -0.05923451483249664,
        0.019382165744900703,
        0.05712364986538887,
        0.0005764953675679862,
        -0.11689914017915726,
        0.0776849016547203,
        0.032073620706796646,
        -0.003668444463983178,
        -0.06130825728178024,
        -0.05924557149410248,
        -0.0071612270548939705,
        -0.003406715812161565,
        -0.07126035541296005,
        -0.08357600122690201,
        -0.006925126537680626,
        -0.06471255421638489,
        -0.040501683950424194,
        -0.01834610104560852,
        0.01197741273790598,
        -0.006600069347769022,
        -0.03875211626291275,
        0.025822019204497337,
        0.0004172281769569963,
        0.06108783185482025,
        -0.024006465449929237,
        0.06916755437850952,
        -0.07615715265274048,
        0.07279933243989944,
        -0.022664867341518402,
        -0.044921647757291794,
        0.017209267243742943,
        -0.12647826969623566,
        -0.0007122762617655098,
        -0.002414730377495289,
        -0.06718723475933075,
        0.07253400981426239,
        -0.0008797058253549039,
        -0.021396074444055557,
        0.04880482703447342,
        -0.008231991901993752,
        -0.01876732148230076,
        -0.01758144050836563,
        0.036479417234659195,
        -0.0688086673617363,
        0.05450257286429405,
        0.0445687510073185,
        -0.0195072740316391,
        -0.011396022513508797,
        0.10025078803300858,
        0.04347909241914749,
        0.045924264937639236,
        0.09914580732584,
        -0.014826151542365551,
        -0.0039054059889167547,
        -0.050573546439409256,
        -0.014174296520650387,
        0.0026900649536401033,
        -0.03428546339273453,
        -0.04034855589270592,
        0.0167675893753767,
        -0.014245983213186264,
        0.018702052533626556,
        -0.053235214203596115,
        -0.039704643189907074,
        0.030078532174229622,
        0.06861639022827148,
        -0.039296478033065796,
        0.03456556797027588,
        0.004444591235369444,
        -0.003572470974177122,
        0.02751540206372738,
        -0.03734077140688896,
        -0.019451363012194633,
        -0.05291055142879486,
        0.07129473239183426,
        0.013951265253126621,
        0.07639102637767792,
        0.01900307834148407,
        -0.029864028096199036,
        -0.115328848361969,
        -0.04454908147454262,
        -0.0078573701903224,
        0.03295860067009926,
        -0.009137156419456005,
        -0.013677600771188736,
        -0.03459470719099045,
        0.0050197988748550415,
        -0.05636829137802124,
        0.018473464995622635,
        -0.12833301723003387,
        0.027660349383950233,
        -0.07800869643688202,
        0.024499204009771347,
        0.06725920736789703,
        -0.05256269499659538,
        -0.026100926101207733,
        -0.002876362996175885,
        0.041373107582330704,
        0.04736935347318649,
        0.03702235594391823,
        0.035370077937841415,
        0.013408460654318333,
        5.678973002585786e-33,
        -0.10559488087892532,
        0.05596673861145973,
        -0.08821661025285721,
        0.011376716196537018,
        0.05454606935381889,
        0.04000210389494896,
        -0.04053708165884018,
        0.048262376338243484,
        -0.0347883403301239,
        0.051041826605796814,
        -0.042510032653808594,
        0.06627161055803299,
        -0.0322796069085598,
        0.03077138215303421,
        -0.02712273970246315,
        -0.09759725630283356,
        -0.015175079926848412,
        -0.024899952113628387,
        -0.08227261900901794,
        -0.08265621215105057,
        -0.06418498605489731,
        0.032985951751470566,
        0.050644565373659134,
        0.013586161658167839,
        0.08246410638093948,
        -0.006696842610836029,
        0.09780125319957733,
        0.0007194035570137203,
        -0.0214392077177763,
        0.06805054098367691,
        -0.1344635784626007,
        0.0015928784850984812,
        0.02805051952600479,
        0.012981845065951347,
        -0.04602820426225662,
        0.004418971948325634,
        -0.08783084899187088,
        -0.0739167109131813,
        -0.05199389159679413,
        -0.021925516426563263,
        -0.006587340496480465,
        -0.034956417977809906,
        -0.13775722682476044,
        -0.02945653349161148,
        -0.10003487020730972,
        0.017392868176102638,
        0.10851515084505081,
        0.03486862778663635,
        0.05214956775307655,
        0.03287660703063011,
        -0.04649161547422409,
        -0.004649987444281578,
        -0.06836943328380585,
        -0.03203357383608818,
        -0.04038975015282631,
        -0.021957004442811012,
        -0.04229001700878143,
        0.027555614709854126,
        0.04454285651445389,
        -0.09497284144163132,
        -0.01754694990813732,
        0.08548031747341156,
        0.09008076041936874,
        -0.05335645377635956,
        -0.018362993374466896,
        0.06498915702104568,
        -0.00985720008611679,
        -0.10073806345462799,
        -0.0015598400495946407,
        -0.024221470579504967,
        0.010697419755160809,
        -0.05170588940382004,
        0.017449963837862015,
        -0.011652764864265919,
        0.08414439857006073,
        0.0423181876540184,
        -0.030767865478992462,
        0.018028099089860916,
        0.08564276993274689,
        0.0011252312688156962,
        -0.05522092059254646,
        0.04905503988265991,
        0.02040848694741726,
        0.03484678640961647,
        0.13557885587215424,
        -0.032504208385944366,
        0.021568994969129562,
        -0.04744179919362068,
        -0.018032504245638847,
        0.014600139111280441,
        0.01253452431410551,
        -0.024454735219478607,
        -0.03349895775318146,
        0.04388606175780296,
        0.03984435275197029,
        -6.243450165296449e-33,
        0.009710087440907955,
        0.010156748816370964,
        0.05990103632211685,
        0.03335316851735115,
        0.04954155161976814,
        0.02747892402112484,
        0.031392764300107956,
        0.014279292896389961,
        -0.014602649956941605,
        0.029745157808065414,
        0.014648506417870522,
        0.027285583317279816,
        -0.09652210772037506,
        -0.05847393348813057,
        0.07013373076915741,
        -0.06711768358945847,
        0.08720774948596954,
        -0.06269603967666626,
        0.02758815884590149,
        -0.0042830174788832664,
        0.1032702773809433,
        0.020621100440621376,
        -0.0877113789319992,
        0.014527571387588978,
        0.045002903789281845,
        0.0032684586476534605,
        0.03843554109334946,
        0.05393710359930992,
        -0.06762021034955978,
        -0.051429469138383865,
        -0.06873292475938797,
        0.009678034111857414,
        0.008627493865787983,
        0.009033079259097576,
        -0.016865959390997887,
        -0.004033218137919903,
        0.05247051641345024,
        0.08751311153173447,
        -0.027471859008073807,
        -0.06402947753667831,
        -0.01192704401910305,
        -0.05391186103224754,
        -0.04232531785964966,
        0.012590218335390091,
        0.028094105422496796,
        -0.0982552021741867,
        0.004420239478349686,
        -0.055962879210710526,
        0.06573799252510071,
        0.06365534663200378,
        0.013438878580927849,
        0.004506126511842012,
        0.060925111174583435,
        0.07026362419128418,
        -0.0028130789287388325,
        -0.04764402657747269,
        -0.02252614125609398,
        0.009713049046695232,
        -0.033033326268196106,
        0.024352848529815674,
        0.029060302302241325,
        0.016912974417209625,
        0.02942943014204502,
        -0.015429171733558178,
        0.0644797757267952,
        -0.1343562752008438,
        0.024002771824598312,
        0.00041146809235215187,
        -0.047503452748060226,
        0.0006793470238335431,
        -0.01922919787466526,
        -0.0063285320065915585,
        -0.017434924840927124,
        -0.15343275666236877,
        -0.04022710397839546,
        -0.019453760236501694,
        0.025461701676249504,
        -0.060244809836149216,
        0.0353156179189682,
        -0.05694848299026489,
        -0.0210401751101017,
        -0.02698567695915699,
        0.040460020303726196,
        0.06325433403253555,
        0.03103199601173401,
        0.09098190069198608,
        -0.04163983091711998,
        0.03236214071512222,
        0.04229896888136864,
        0.07970576733350754,
        0.015325423330068588,
        0.08296054601669312,
        0.05291350558400154,
        0.07973691821098328,
        0.003740302287042141,
        -6.648886596849479e-08,
        0.01784335821866989,
        0.03446713089942932,
        0.002731723478063941,
        -0.01852423883974552,
        0.01555246114730835,
        -0.03352561965584755,
        -0.07593590021133423,
        -0.02214522287249565,
        -0.10104954987764359,
        0.01220887154340744,
        0.043245505541563034,
        -0.03385840728878975,
        0.0016503588994964957,
        0.020098714157938957,
        -0.03448890522122383,
        0.008405803702771664,
        -0.018183115869760513,
        0.09178213030099869,
        -0.08902512490749359,
        -0.030306896194815636,
        0.010119644924998283,
        0.036260951310396194,
        0.06023682281374931,
        0.027855053544044495,
        0.027948973700404167,
        -0.013812006451189518,
        0.007811325136572123,
        0.01203824020922184,
        0.09086818993091583,
        -0.10783884674310684,
        -0.11113256216049194,
        0.028139617294073105,
        0.03454025462269783,
        0.014325876720249653,
        -0.004202687181532383,
        -0.10123509168624878,
        -0.041996799409389496,
        0.11785341799259186,
        0.033986177295446396,
        0.029266970232129097,
        0.028008196502923965,
        -0.01458769105374813,
        0.022867387160658836,
        0.021306699141860008,
        -0.00969428289681673,
        0.05505219101905823,
        -0.033764660358428955,
        -0.04693464934825897,
        -0.05273070186376572,
        0.0033888150937855244,
        -0.008376340381801128,
        -0.062283679842948914,
        -0.03514719381928444,
        0.09782904386520386,
        0.059002432972192764,
        0.014647025614976883,
        -0.0435018427670002,
        0.04492225497961044,
        0.027045756578445435,
        0.04396600276231766,
        -0.014758992940187454,
        -0.07774918526411057,
        -0.0650194063782692,
        0.06357941776514053
    ]
}