{
    "id": "cIiLIrs6dzU",
    "title": "This keyboard has a WORLD’S FIRST! - Angry Miao AM AFA",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-11-25T20:00:48Z",
    "video_url": "https://www.youtube.com/watch?v=cIiLIrs6dzU",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "keyboard",
        "angry miao",
        "am afa",
        "flex",
        "mush",
        "customize",
        "ergonomic",
        "ergo",
        "alice",
        "leaf spring"
    ],
    "views": 340309,
    "likes": 10846,
    "comments_count": 477,
    "description": "Get your next PC built with LYTE:   Plouffe is here with the Angry Miao AM AFA keyboard, which is designed to look similar to the Macross VF-19 jet. This interesting design also comes with a world's first -- a 3-way adjustable leaf spring! Does this give the user unprecedented control over their typing feel, or does it leave the keyboard feeling mushier than a cheap laptop?  Buy an Angry Miao Alice Keyboard:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Shh... it's a secret 0:27 Unboxing 1:49 Initial design impressions 3:29 Sponsor - LYTE Gaming 3:56 Typing and keycap impressions 5:50 Tearing it down is complicated 6:29 Looking at the RGB settings 7:07 Opening it up and adjusting the leaf spring 11:07 Overall thoughts, pricing, and alternatives 12:27 Outro",
    "description_links": [
        "https://lmg.gg/p4RHk",
        "https://lmg.gg/X8NhZ",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Okay guys, we've got something top secret from Angry Miao. They made the Cyberboard. I like it but it's too expensive. Comes in another cool carrying case like the last guy. That's the packaging they use. It's the same thing. We've got our user manual and disassembly instructions. I think this thing comes with a custom tool because it's got the world's first three way adjustable leaf spring system. I was gonna say a proper case would be nice, but I guess you get this guy with it. You'll use the QR code for the instructions later, see if I actually need them. Here's the tool I'm pretty sure. Leaf spring with mount. I've never used a leaf spring mounting system at all. I have no idea how it works. I'm very curious to find out and especially the fact that I can adjust it on the fly is really intriguing to me. What's in this black little container case paper folder here thing? Oh that's actually really nice that they give you extra mounting hardware 'cause I'm pretty sure mine is already put together. I don't know if that'll come standard in every build. Bare bones kit is a bit cheaper at like $580, which is. So, I mean yes this is expensive, but if you're into this hobby you know that really fancy keyboards can honestly go up for like a thousand dollars. Is this thing worth that? I don't think so, but we'll see. We also got these two white mystery boxes. If these are feet to like let it move around that's really cool. They come with extra padding. This is little rubber pads on the bottom here. They come with extras in case you rip them off. All right, I don't know how these work. (wrist rests clicking) that's my terrible castanet usage. Okay, the keyboard though, it's hefty but not super heavy. It's got these little plastic guys on top. Grey text on clear plastic. They could have just done a paper insert. This actually feels bad because they didn't need to use plastic for this but whatever. And they've got these like see through key caps because there is RGB in this apparently. I love this thing already just in terms of design it's pretty unique. As for what makes it Alice, it's the layout of the keyboard. So we've got this kind of ergonomic split system here. (keys tapping) It's pretty neat. This is the velocity color. It comes in four different color ways, in Dark Night, Velocity, VF-19 and Ranger. We've got a Qi charger here so it'll do Bluetooth as well as usbc if you just wanna keep it plugged in if you've got a nice cable that go would go with it. I see feet already on the bottom actually really like the systems, these two really long strips on either end. So what are these guys? Apparently, they're wrist rests, which I can dig it. Actually I've said this before. I'm a big fan of the soft memory foam kind of material so I already like these wrist rests more than like any of those wooden or plastic or ceramic ones. They slide around really easy, which I guess is the intent. That looks like a Teflon skate. Kinda like what you'd see on a mouse. Oh I just noticed this look, it says ShortCircuit in the bottom corner right here. This should be hot swap as well. I'll take a key cap off. (key tapping) They feel okay. I can feel the flex quite a bit. I don't know what setting we're on currently. There's three different levels from like firm to loose basically. Don't get me wrong, I like a good gasket mount but this is like wild how much you can see it just flexing right now. Flexing on me with how much it can flex. My initial thoughts are just that, you know it's pretty cool looking, it's really unique. I'm gonna open it up a little bit and adjust it and you know turn it on and see all this RGB but not before a word from our sponsor, Lyte Gaming. Thanks to Lyte Gaming for sponsoring this video. Lyte offers both preconfigured and custom PCs along with build kits and custom accessories. Their builds show market prices for each part and their nominal $100 Build fee is competitively priced. Lyte's Black Friday sale is live now and they're completely waving their build fee on all PCs. Every computer comes with a wheel spin guaranteeing upgrades to your order. Get your PC built with Lyte at the link below. So I wanna type on it before I open it and try all the different flex stuff. I also wanna just see what the RGB looks like turned on. Ooh, this thing is so cool. I'm just gonna jump straight into a typing test and see if I can actually type with an Alice layout. (keys clicking) Okay, that's probably my worst run ever. 78 words per minute, 91% accuracy. It's weird and you have to get used to it and there's definitely keys that I go over up where I need to just go like a slightly different angle because as you can see the keys are like all shifted over a little bit on either side. They're angled in which really suits this like wing swept look. They're trying to model that, one of those jets that has the forward sweeping wings. Otherwise as for the current level of springiness on the gasket, I'm okay with it. It can be adjusted. The leaf springs on this thing to change how much flex it has. So as you can see like the more I press the more it flexes, right? There's a leaf spring in there. Basically you change part of the leaf spring so that it flexes less or more. I actually really like how this glass is like just this weird dark glass and it shows like whether you're doing Bluetooth or whether there's power going to it and stuff like that. It's super cool. The key caps feel fine. They're this weird clear plastic. I actually don't know what the material is. I don't think it's ABS or PBT I could be wrong but it feels like a weird glossy plastic and I don't know I kind of dig it. It's not the best feeling key cap I've felt but the effect of being able to see this crazy RGB shine through is very interesting especially when you get these like clear switches. Wow, really? You really see it flex when you take a key cap off but it really helps having these clear switches underneath here to help accentuate the RGB. It looks like a cool package once it's all put together. It's a 65% so if there's any keys you're missing like you need a function row then this keyboard probably isn't for you. But you know what? You've got a handy function key to hit like F five. Let's unplugging and open it. I'm very curious. I got warned that this thing is actually breakable if you don't, don't follow the instructions because of so many flex cuts in the pcb. Well I'm gonna get the QR code up and I'm gonna follow the manual to make sure I don't break anything. The board is hot swap but if I'm worried about damaging anything and I have to take it entirely apart to just hot swap, then it's kind of pointless in my opinion. Okay, I'm looking through this PDF and it looks great. I could probably follow the guide. Some of the tools are labeled in English but the reality is this all looks like simplified Chinese. I'm actually gonna ask Andy to come take a look just to make sure I'm doing everything correctly. Andy, before that though, just in case if we wanna change the RGB, I'm gonna use our handy little quick guide here and I want to switch between lighting effects. So FN and then this guy. Oh cool. It's all red, it's ooh, I really like the all one color. We should be able to change the mode as well, so you can make them dimmer. Where's the max brightness? There we go. Wow, that's actually really pretty. Angry Miao has got an app or something on their website called DIY that will let you change this a lot more. So awesome, that sounds great to me. You can make this like all blue or all red or all green you know whatever you want to do or, oh, let's weigh it first. I'll give it a weigh before I take anything apart. Oh man, that was like perfect. - [Bell] Editor, cut that. (laughing) - This thing is actually lighter than I expected. It looks like it's 2.2 kilos so that's only about five, oh no, I said five or six pounds. There's a couple tools. There's this guy which is, I actually really like these 'cause they're really easy to spin when you've got these long screws and then there's this guy oh this one fits nice. Oh my god - [Bell] Editor, leave that in. - Leave the fumble in - [Bell] Put an audience going (groans). - So we take this off and it's probably got a ribbon cable 'cause of the Qi charging. No, oh that's really cool. There's contacts for it so you don't have to worry about ribbon cables. And look, the batteries are in the bottom here. I really like that 'cause dealing with ribbon cables is always my nightmare. So they've also included two extra ribbon cables which I've never seen before either. I'm glad that they give you those in case you do break them. And then yeah, as you can see we've got a couple ribbon cables here that I'm gonna try to disconnect. I love this keyboard but it's really hard to justify spending $600 on a board that you have no idea if you're gonna like, oh I got it. Good thing we got those replacements 'cause I probably damaged one of these ribbon cables already. That's removed, now what's next? Now I do the white, the ones in the center. If we can't, there's not much point in doing any of this. Okay, so now that I've got this guy off now I can take that tool and I should be, eh, there it goes, now it's just coming up. That's really cool though. It's really nifty. I do like these top plates and I feel like there's magnetism in there too. And then after that then we take out what these next screws. I'll be honest this has taken so much work that I'm personally comfortable doing, but like unless you're a real enthusiast I probably wouldn't buy this thing if only for the fact that it's a major pain to disassemble. Then I do these four side screws. Wow, does this just come out now? Oh yes it does. Okay, so what I'm talking about for those leaf springs is these guys here and we got a whole bunch of extras in this box, which is super neat. What's happening is your keyboard is sitting on these springs, right? And then they press down when you press into it normally they're gasket mounted or they're just like fixed mounted. And what that's letting you do is get more of a flex on your keyboard when you type on it. Not everyone prefers that. Some people prefer no flex at all. Some people really like a nice loose gasket. Okay, so you take these little rubber stoppers - [Bell] No, wait till he is outta here. Okay fine. Yeah you wanna, you take a screw out, you take out these rubber stoppers and then you just move them over, I think. Even this is a pain, honestly, just getting this little rubber stopper into this tiny little hole here. What do you think Bell? Should we go to zero? Like should we go to one or three? - Nah, three. - Okay. 'Cause it started at two. - That's more standard. - Yeah, I already thought two was like pretty flexible. So if you can go down to one where there's absolutely no rubber stoppers and you're basically just going with the screw on one end, that's kind of wild. That's really flexy. I don't think that's for me. We're gonna go up to three to see if less flex is more kind of my speed. Take out the spring, pull out this little rubber stopper and then we're just gonna move it up a slot. I'm gonna reinstall the leaf spring and then I'll show you the difference on the two sides here. Overall, honestly I think it's a pretty clever system. I just don't think it's for most people and I guess that's why it's part of a more premium product. Like don't get me wrong I would like to see leaf springing mounting on more keyboards. I just don't know if you need this adjustment factor that they've kind of included in this one. But yeah, the quality of the materials is solid. Like this is all neoprene foam so you're not getting any cheap foam when you order this as well. It's all really quality stuff. I'll be honest, this still isn't for me. Even with the least amount of flex possible. The problem is you've got the four leaf springs on the four corners of the pcb, it just presses right down and so I'm not personally as big of a fan for that. It's still really cool and I still kind of want one even though the price is outrageous. I don't know, what else do we talk about at this point? I can put it back together. - [Bell] Yeah, put it back together. 'Cause your final thoughts should be with the completed board. (keyboard clicking) - I guess I feel the difference, like this is looser it is flexing more, but I'm just, it's not enough. There needs to be like a fourth option where there's basically zero flex and then I would see some value in it. But as for right now, I just I maybe I just don't like leaf spring. Otherwise this thing is sick. Like there's no denying that. The metal design is super cool. I think it's an absolute like statement piece on your desk. I have no real complaints. I mean the battery life might not be amazing. I think the colorway looks sick. The key caps that you're getting with this one at least are really cool, this like smokey clear kind of version. I actually liked the typing experience. It sounds fantastic. I just, it's the price, man, I can't get over that this even base is $580. That being said, if you're an Alice layout fan and you really want something super premium and you want something really cool on top of being really premium with this really fancy design, then maybe it's for you. Unfortunately, the pre-order is already kind of full. They only just sent us this board. We're only getting it now, so I'm sorry we're not gonna get it earlier for you guys, but would I buy it? No, do I want one? Yes, that being said, if you can't afford to spend almost $600 on a keyboard, then maybe check out Keychron, they've got the Q8. That's their own version of the Alice layout. Personally, that's probably what I'd lean towards if I do want to pick up an Alice board in the future. Otherwise, you know that's ShortCircuit. Thanks for watching. If you wanna watch another video related to keyboards maybe check out the Promise 87. I think that one costs about the same as this one does. Which one's better? I don't know, you decide.",
    "transcript_keywords": [
        "leaf spring",
        "cool",
        "thing",
        "leaf",
        "kind",
        "flex",
        "spring",
        "RGB",
        "pretty",
        "key",
        "keyboard",
        "guy",
        "Alice",
        "ribbon cables",
        "case",
        "Lyte",
        "guys",
        "plastic",
        "key caps",
        "key cap"
    ],
    "transcript_entity_values": [
        "Cyberboard",
        "F five",
        "DIY",
        "three",
        "Qi",
        "one",
        "Bell",
        "Alice",
        "usbc",
        "78",
        "91%",
        "Andy",
        "VF-19",
        "only about five",
        "Miao",
        "Lyte",
        "580",
        "Dark Night",
        "max",
        "Lyte Gaming",
        "pcb",
        "Keychron",
        "Bluetooth",
        "first",
        "Q8",
        "Chinese",
        "two",
        "the spring",
        "the leaf spring",
        "four",
        "Black Friday",
        "six pounds",
        "600",
        "Angry Miao",
        "a thousand dollars",
        "Bell",
        "RGB",
        "ShortCircuit",
        "fourth",
        "Ranger",
        "2.2 kilos",
        "five",
        "65%",
        "almost $600",
        "PDF",
        "zero",
        "English",
        "Grey"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "GPE",
        "NORP",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "EVENT",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "MONEY",
        "ORG",
        "CARDINAL",
        "LANGUAGE",
        "PERSON"
    ],
    "vector": [
        -0.07053565979003906,
        -0.0692979246377945,
        0.002661622129380703,
        -0.028669556602835655,
        0.025477644056081772,
        0.05927160382270813,
        0.052639372646808624,
        0.0497300885617733,
        0.06684048473834991,
        0.07972798496484756,
        0.06893254071474075,
        0.034159716218709946,
        0.04501120001077652,
        -0.07623215764760971,
        0.017160041257739067,
        -0.002921963343396783,
        0.022330034524202347,
        -0.04651331901550293,
        -0.048819415271282196,
        0.03579279035329819,
        -0.013821907341480255,
        -0.020919233560562134,
        0.04188869148492813,
        0.04894508421421051,
        -0.024674315005540848,
        -0.036011312156915665,
        -0.009819034487009048,
        0.026207320392131805,
        -0.011045989580452442,
        -0.11148367822170258,
        -0.07712108641862869,
        0.09637005627155304,
        -0.00041602147393859923,
        -0.007218873593956232,
        -0.0629822388291359,
        0.0013213426573202014,
        0.021366795524954796,
        -0.06629706919193268,
        -0.06585414707660675,
        -0.0642319992184639,
        -0.0785054937005043,
        -0.061400897800922394,
        0.076285220682621,
        0.005288898479193449,
        0.06327342987060547,
        0.018177708610892296,
        -0.0058102235198020935,
        -0.022068817168474197,
        -0.005369639489799738,
        0.05598195642232895,
        -0.024462200701236725,
        -0.10082002729177475,
        0.037302423268556595,
        -0.038531385362148285,
        -0.028541166335344315,
        0.02911224775016308,
        0.005380820017307997,
        0.02918287180364132,
        0.07111498713493347,
        -0.013290170580148697,
        -0.024964556097984314,
        -0.002746353391557932,
        -0.005019616801291704,
        0.03240370377898216,
        0.0050238557159900665,
        0.016509689390659332,
        0.013871103525161743,
        -0.0764424130320549,
        -0.0042765503749251366,
        -0.0383155532181263,
        0.025092976167798042,
        -0.06145134195685387,
        0.050889838486909866,
        -0.009527310729026794,
        -0.003753024386242032,
        -0.030784370377659798,
        0.01568165421485901,
        -0.012537960894405842,
        0.06288080662488937,
        0.10300222039222717,
        0.009839193895459175,
        0.03452740237116814,
        0.012295249849557877,
        0.008536359295248985,
        -0.028343746438622475,
        -0.02584509737789631,
        0.013504608534276485,
        -0.06742890924215317,
        -0.004170966800302267,
        0.03594394773244858,
        -0.010685971938073635,
        -0.049571312963962555,
        0.08029033988714218,
        -0.0019315490499138832,
        -0.10066956281661987,
        -0.00972028449177742,
        0.041139256209135056,
        0.0066388752311468124,
        -0.11853402107954025,
        0.07189200818538666,
        0.05273941159248352,
        0.08756651729345322,
        0.04838178679347038,
        -0.01919476129114628,
        0.021238116547465324,
        -0.034387536346912384,
        0.06274375319480896,
        -0.06523258239030838,
        -0.03048325888812542,
        -0.053618647158145905,
        -0.1055726706981659,
        -0.021968701854348183,
        -0.10484164953231812,
        -0.006376918870955706,
        -0.05186302959918976,
        0.019875114783644676,
        0.011833648197352886,
        0.043362103402614594,
        0.10833745449781418,
        0.05914941430091858,
        -0.03626031428575516,
        -0.11349211633205414,
        -0.0670299381017685,
        0.01246572844684124,
        -0.006281952373683453,
        0.05954933166503906,
        -0.06345386803150177,
        1.595655521069521e-33,
        -0.024090776219964027,
        0.08705224096775055,
        -0.009831015951931477,
        -0.028887666761875153,
        0.08896525949239731,
        -0.00913966353982687,
        -0.014687111601233482,
        0.005355712026357651,
        -0.06427046656608582,
        -0.026080304756760597,
        -0.09539743512868881,
        0.020481446757912636,
        -0.06849179416894913,
        0.07406570762395859,
        0.06165512278676033,
        -0.1148117333650589,
        -0.03091120533645153,
        0.017912646755576134,
        -0.09270400553941727,
        -0.06333345174789429,
        0.04929548129439354,
        -0.005680270027369261,
        0.019539939239621162,
        -0.07214296609163284,
        0.06150595471262932,
        0.02134520933032036,
        -0.009055539034307003,
        -0.007063215598464012,
        0.012980076484382153,
        0.037042323499917984,
        -0.04165364056825638,
        0.01802542619407177,
        -0.13622243702411652,
        -0.08532815426588058,
        -0.11420976370573044,
        -0.04934544488787651,
        -0.04175229370594025,
        -0.09681113064289093,
        0.05809098109602928,
        -0.00652327761054039,
        -0.02671274170279503,
        0.032354194670915604,
        -0.04763283580541611,
        -0.09630349278450012,
        0.03074653446674347,
        0.020026106387376785,
        0.057560041546821594,
        0.05383143573999405,
        0.06312146782875061,
        -0.06354650110006332,
        -0.03749014809727669,
        -0.0021956469863653183,
        -0.02246769145131111,
        0.01750131882727146,
        0.05300845578312874,
        -0.07737338542938232,
        -0.04519476741552353,
        0.024921411648392677,
        0.11395347863435745,
        0.08218519389629364,
        0.0030018379911780357,
        0.019011350348591805,
        0.13071803748607635,
        -0.007440138608217239,
        -0.002792405430227518,
        0.06984463334083557,
        -0.01420233491808176,
        -0.05996611714363098,
        0.011511175893247128,
        -0.016749657690525055,
        0.010996885597705841,
        -0.047409266233444214,
        -0.02324659377336502,
        0.0031991302967071533,
        -0.053330112248659134,
        -0.018662190064787865,
        -0.0030824195127934217,
        -0.13182000815868378,
        0.04707261547446251,
        -0.05583348870277405,
        0.023320354521274567,
        0.06827253103256226,
        0.0827474594116211,
        0.08509314060211182,
        0.034761540591716766,
        -0.06168697029352188,
        0.0028491863049566746,
        -0.07618730515241623,
        -0.06818114966154099,
        -0.003298303345218301,
        -0.03477812185883522,
        -0.004329519346356392,
        -0.010411625728011131,
        -0.026788340881466866,
        -0.08759783953428268,
        -2.8140875581204773e-33,
        0.007488036993891001,
        -0.024370979517698288,
        -0.060351528227329254,
        0.022775746881961823,
        -0.013251991011202335,
        0.039259493350982666,
        0.011860614642500877,
        0.012407881207764149,
        0.020882779732346535,
        0.0006047778879292309,
        -0.0012348436284810305,
        0.028466297313570976,
        0.010982034727931023,
        -0.06851401180028915,
        0.057118069380521774,
        -0.016812561079859734,
        0.05027749389410019,
        -0.03150440379977226,
        0.04527958855032921,
        -0.0511232353746891,
        0.04652373120188713,
        -0.05386903136968613,
        -0.07685910165309906,
        0.06729192286729813,
        -0.027243824675679207,
        -0.004683965351432562,
        0.005707164760679007,
        0.027654381468892097,
        -0.09351322054862976,
        0.05403146520256996,
        -0.0729696974158287,
        0.020454511046409607,
        0.020855361595749855,
        -0.003940191585570574,
        0.036780573427677155,
        -0.05405200645327568,
        -0.043875209987163544,
        0.09542636573314667,
        -0.015793392434716225,
        0.06440161913633347,
        0.05749975144863129,
        -0.019475111737847328,
        0.04061244800686836,
        0.04099992662668228,
        0.01559995487332344,
        -0.04263576492667198,
        -0.06768016517162323,
        -0.07472638040781021,
        0.09233004599809647,
        0.024285541847348213,
        0.01828203722834587,
        -0.0845862627029419,
        0.05861598253250122,
        -0.01919800601899624,
        -0.10400644689798355,
        -0.01971493847668171,
        -0.03990856558084488,
        -0.013363606296479702,
        -0.01708565279841423,
        -0.030853675678372383,
        0.02211453951895237,
        -0.022027703002095222,
        0.008762781508266926,
        -0.02717874012887478,
        0.07361487299203873,
        -0.06030698120594025,
        0.07055886834859848,
        -0.013139798305928707,
        -0.012743625789880753,
        -0.04648476839065552,
        0.09065089374780655,
        -0.0009069156949408352,
        -0.02879399247467518,
        -0.026776272803544998,
        0.036715686321258545,
        0.045110199600458145,
        0.0845533013343811,
        -0.022707941010594368,
        -0.005827633198350668,
        -0.07278207689523697,
        -0.0001281987497350201,
        0.014980548992753029,
        0.04359813779592514,
        -0.011246607638895512,
        -0.02474585361778736,
        0.07146713137626648,
        0.004702173639088869,
        -0.007368894759565592,
        -0.04172315448522568,
        0.09219171106815338,
        0.027895363047719002,
        0.025808392092585564,
        0.007681927178055048,
        0.048909541219472885,
        0.0391678661108017,
        -6.405232255701776e-08,
        0.010369914583861828,
        0.026158170774579048,
        0.04915600270032883,
        0.06154703348875046,
        -0.04725051671266556,
        -0.026407824829220772,
        0.01953474059700966,
        -0.04855833202600479,
        -0.0007993631879799068,
        -0.03497028723359108,
        0.018734224140644073,
        -0.00863876286894083,
        0.017239246517419815,
        0.02788056805729866,
        0.06481907516717911,
        0.13777288794517517,
        -0.031688448041677475,
        0.09635806083679199,
        -0.08466554433107376,
        -0.009915660135447979,
        0.07581841945648193,
        0.03754822909832001,
        0.04088509827852249,
        -0.02120107039809227,
        0.03674894943833351,
        0.01674288511276245,
        -0.056707363575696945,
        0.08921439200639725,
        0.045108940452337265,
        -0.03293055668473244,
        0.001997021958231926,
        -0.02230318821966648,
        0.023393170908093452,
        0.021071065217256546,
        -0.08764036744832993,
        -0.027294250205159187,
        -0.049700669944286346,
        0.022059055045247078,
        -0.06695272773504257,
        0.02656092494726181,
        -0.0074439686723053455,
        -0.04181434586644173,
        -0.03627464920282364,
        -0.015879206359386444,
        -0.03803243488073349,
        0.019796809181571007,
        0.05816670507192612,
        -0.08770698308944702,
        -0.06283050030469894,
        0.053979746997356415,
        0.03087630122900009,
        0.011793776415288448,
        0.04426540061831474,
        0.09001373499631882,
        0.02769775502383709,
        0.08418919891119003,
        -0.0054883332923054695,
        0.06431954354047775,
        0.035767294466495514,
        0.03172419220209122,
        0.03965422511100769,
        -0.06742667406797409,
        -0.07971544563770294,
        0.06606782972812653
    ]
}