{
    "id": "CjKW8FdMr1M",
    "title": "Apple + Microsoft = 🤯",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-11-25T02:31:11Z",
    "video_url": "https://www.youtube.com/watch?v=CjKW8FdMr1M",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "M1 Macs",
        "Apple",
        "M1",
        "M1 Pro",
        "M1 MAx",
        "Windows 11",
        "Windows on Arm",
        "Qualcomm",
        "exclusivity",
        "deal",
        "processors",
        "hackintosh",
        "M1 Boot Camp",
        "MediaTek"
    ],
    "views": 584150,
    "likes": 30249,
    "comments_count": 647,
    "description": "Get 15% off your first order at    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 TGIF 0:07 Windows Arm Qualcomm exclusivity 1:18 Xbox bundles + metaverse 2:45 AMD upping Radeon prices? 3:56 Made In Cookware 4:41 QUICK BITS 4:50 Tesla using FSD footage 5:15 Fairphone 2 gets Android 10 5:45 Tile acquired 6:23 Turn down the 5G 6:56 JRR Token taken down  AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  Techquickie:  ShortCircuit:  LMG Clips:  Channel Super Fun:  They're Just Movies podcast:",
    "description_links": [
        "https://madeincookware.com/TechLinked",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/35X28",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/TheyreJustMovies"
    ],
    "transcript": "- Hey, what do you call Black Friday during a supply shortage? - What? - Friday. (man offscreen weeping) Apple's M1 Macs are the best consumer ARM-powered computers out there, which isn't really saying much since every laptop running Windows on ARM kinda sucks. - Ow! - Well, that may change soon, as XDA developers has reported that the reason we've only seen Windows on ARM devices powered by Qualcomm processors is because of an exclusivity deal between the two companies. I don't know why Qualcomm and Microsoft thought it, that meant they had to make their chips and software suck. Maybe there was a clause about that or something. A legalese. - Standard. - Whereas the processor will be junk, and whereas, (man offscreen laughs) Microsoft will only use our processors thereby, anyway, the good news is the deal is reportedly set to expire soon, meaning MediaTek or anyone else will be free to make processors for Windows on ARM devices. But perhaps more importantly, it could mean Windows on ARM could be installed directly on M1 Macs with Boot Camp, - Yeah. which traditionally has run a little faster than virtualizing Windows with Parallels. But don't celebrate just yet though, Apple would still have to support it. Time to start being nice to them again, I guess. We're willing to start calling Tim by his legal last name. - I looked it up. - If you'll budge on this. - [Man Offscreen] It's Apple. - (chuckles) You smell with the cook is cooking. In other Microsoft news, the company's continuing to celebrate the 20th anniversary of the first Xbox console by sending free gift bundles to randomly selected FanFest members with a special edition controller and a plaque engraved with their gamer tag. - [Man Offscreen] Ooh, so cool, a plaque? - For me? - I wanna a plaque. - Others are receiving special offers to purchase a limited edition Xbox console bundle via email, which is less exciting. Thank you, benevolent Microsoft gods. The chance to buy something in this market? (both chuckle) Wow. - That's as good as you get. - What's even more sad is not that there's an interactive Xbox museum full of memorable moments from Xbox history, but the fact that it's being called a Metaverse, which is like calling a sandwich a four-course meal, or saying Mark Zuckerberg has charisma. - [Man Offscreen] (laughs) I thought that was funny. - I mean, compared to my other iguanas and bearded dragons I've had. (man offscreen laughs) Very lively. - Way charismatic, yeah. He can actually curl the corners of his mouth. One interesting document the museum holds is a letter Microsoft sent to Nintendo in 1999, offering to acquire them, which leads into some interesting, what if scenarios, like a Halo movie starring Master Chief voiced by Channing Tatum. (man offscreen guffaws) He's dancing. He can move, he can tumble. - [Man Offscreen] That's not even, the Chris Pratt is the punchline. - Oh, 'cause this is Nintendo? - Yeah, Super Mario. - (laughs) I was supposed to say Chris Pratt. And there's a bunch of news about AMD making moves, some good, some so good. Like this rumor claiming AMD has informed GPU board partners that it's increasing GPU prices. - Yo, it's not good. - By about 10%. - It's not good! - Which is not great news when GPU prices are still hovering around twice their original MSRP. It's only fair though. Right now, retailers are getting most of the profits from those markups and Lisa deserves, - She works hard. she deserves some more of that, yeah? - She's a doctor. - She's a doctor. The doctor is in, check, please. This ain't Canada you gotta pay. Next up, AMD has released a FidelityFX super resolution plugin for Unreal Engine 4, meaning the tech can be easily implemented into games that use UE4, that's it, nice. Lastly, a report out of Taiwan claims at AMD and Qualcomm, there they are, again, will be shifting their chip manufacturing from TSMC to Samsung, because TSMC prioritizes Apple orders, presumably because Apple pays more. Unbelievable these guys, you know? It's like, it's all about money for these people. - Yeah, what about the art? - Yeah. - Okay. - The Artisan chips. That's what Apple makes, actually. - [Man Offscreen] Make this in my kiln. - Now it's time for the quick bits brought to you by MadeIn, professional quality cookware and kitchenware. You can cook with it in your kitchen. You can wear whatever you want. You may have been burned by your past cooking attempts but MadeIn wants everyone to be able to make restaurant quality food at home. So they sourced the finest materials and partner with renowned experts to make premium kitchen tools available directly for you without the markup. So even if you suck at cooking, your dishes look cool. The cookware distributes heat evenly and can easily go from stove top to the oven. Plus they've got 45,000 5-star reviews, they are all real and they offer a lifetime guarantee. So go to madeincookware.com/techlinked, or click the link in the description for 15% off your first order. That's pretty good. - Yeah. - It's not every day you get quick bits, but when they do show up, Mmm, yeah. - Sing it. - It's like, \"MMMBop,\" but new. - Yeah, yeah. Tesla's now asking owners who opt into the full self-driving beta program to agree to let Tesla use footage from their cameras, both inside and outside their vehicle, in the event of an accident. There's cameras on the inside? - Gotcha! - Presumably in a bid to help authorities decide whether it's the car or the driver's fault. And if they're equally at fault, then they're both going away for a long time. - Cell mates. (both chuckle) - The modular upgradable Fairphone 2 is getting Android 10. Sure, that's a two year old OS, but it's been six years since their phone originally shipped with Android 5, matching Apple's six year support cycle for iPhones. Fairphone worked with the Lineage OS Android community on the update, proving that Google, Samsung, and others totally could support Android devices for longer, if they wanted to but you know. Money, money, money, money. Money, money, money, money. - Money, I was going with Abba, it's 2021 and Abba's, - Money, money. - Money. Speaking of money Tile, the company that makes those things that are like Apple AirTags, but way crappier, such that you just put them in a junk drawer 'cause they don't actually work, is being acquired by family tracking company Life360 for $205 million more than they're worth, which is zero. Together, they'll make sure there's no way you'll lose your kids or your parents. My father left us when I was nine. We found him pretty cooked pretty quick with the app. (man offscreen laughs) Papa, is that you beeping over there? - Oh, c'mon. - Just joking. The app doesn't work. - Yeah. Pop, it'll just say, \"Dad not found,\" every time you need to use it. - Ooh, (chuckles) geez. - That's how, it sucks. I have like five of them. Verizon and AT&T have agreed to minimize energy coming from their 5g base stations for a period of six months, after the federal aviation administration raised concerns that 5g could cause interference with aircraft electronics, and your brain. - Aagh! - Oh my cells. It hasn't been a significant issue in other countries with 5g infrastructure. So I say, we turn this around and explore the defense implications of 5g, being able to take out planes. Put vaccinated people on the front lines. - [Man Offscreen] Protect us! - And the makers of a cryptocurrency called JRR Token, (man offscreen laughs) are saying they created the one token that rules them all, baby. They've had their operations shut down after a legal complaint from the estate of J.R.R. Tolkien. - Aah. - Not even close, making this story even more ridiculous is the fact that the JRR Token guys paid Billy Boyd, the actor who played Pippin, to read an advertisement for the coin on Cameo, the app. \"Fool of a took.\" - [Man Offscreen] \"Throw yourself in next time.\" - While the cryptocurrency itself is out of commission, there are still JRR Token, I can't even, yeah, Token NFTs for sale on OpenSea. So the power of the token may not yet to be undone. \"Cast it into the fire.\" (man offscreen laughs) Time to cast this episode in the fire, because it's over and the eagles aren't coming for us. Come back on Friday for more tech news before it sets sail for the shores of Valinor. (man offscreen sings) You bow to no one.",
    "transcript_keywords": [
        "call Black Friday",
        "call Black",
        "Black Friday",
        "Windows on ARM",
        "Yeah",
        "money",
        "Apple",
        "supply shortage",
        "Windows",
        "Microsoft",
        "JRR Token",
        "ARM",
        "Token",
        "ARM devices",
        "good",
        "Black",
        "Friday",
        "make",
        "Xbox",
        "Time"
    ],
    "transcript_entity_values": [
        "Tim",
        "Super Mario",
        "Valinor",
        "Apple AirTags",
        "OpenSea",
        "Fairphone 2",
        "a period of six months",
        "Qualcomm",
        "FanFest",
        "Cameo",
        "Mark Zuckerberg",
        "One",
        "$205 million",
        "4",
        "Tesla",
        "AT&T",
        "one",
        "Tile",
        "Windows with Parallels",
        "Google",
        "2021",
        "about 10%",
        "Lisa",
        "TSMC",
        "the federal aviation administration raised",
        "Windows",
        "Pippin",
        "six year",
        "Nintendo",
        "a two year old",
        "J.R.R. Tolkien",
        "Microsoft",
        "Samsung",
        "Friday",
        "Metaverse",
        "iPhones",
        "Channing Tatum",
        "nine",
        "Billy Boyd",
        "20th",
        "45,000",
        "Boot Camp",
        "1999",
        "first",
        "AMD",
        "Fairphone",
        "Abba",
        "Papa",
        "MediaTek",
        "two",
        "Token",
        "Verizon",
        "Chris Pratt",
        "Canada",
        "Android",
        "four",
        "Black Friday",
        "GPU",
        "Taiwan",
        "Xbox",
        "MSRP",
        "15%",
        "MMMBop",
        "M1 Macs",
        "six years",
        "Android 5",
        "five",
        "JRR Token",
        "Apple",
        "5",
        "zero"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "PERCENT",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "CARDINAL",
        "EVENT",
        "ORG",
        "GPE",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "PERSON",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.03302624449133873,
        0.0021578867454081774,
        0.05967860668897629,
        -0.08144116401672363,
        0.06474194675683975,
        -0.03682330623269081,
        -0.013262991793453693,
        0.0308640468865633,
        0.006314930040389299,
        0.040701158344745636,
        0.030375368893146515,
        -0.017854854464530945,
        0.00569946551695466,
        -0.00758693553507328,
        0.006685138214379549,
        0.01567808724939823,
        0.03296695649623871,
        -0.10983139276504517,
        -0.10788113623857498,
        -0.0033963529858738184,
        -0.03304307907819748,
        -0.027693800628185272,
        -0.002360081532970071,
        -0.03159482777118683,
        0.12304557114839554,
        0.005433409940451384,
        -0.03334260731935501,
        0.016382917761802673,
        -0.012572615407407284,
        0.001124651520512998,
        -0.02545165829360485,
        0.06673116236925125,
        0.04109754413366318,
        0.015569055452942848,
        0.002627688692882657,
        -0.05723882466554642,
        0.032642822712659836,
        -0.09907087683677673,
        -0.03272850438952446,
        -0.08105999231338501,
        -0.03699631243944168,
        -0.0626433938741684,
        -0.02104055881500244,
        0.07751588523387909,
        -0.013747051358222961,
        -0.027035769075155258,
        0.0635523870587349,
        -0.01482511404901743,
        0.015625013038516045,
        0.07520262897014618,
        -0.0030328144785016775,
        -0.014209172688424587,
        0.03216828778386116,
        -0.007139336317777634,
        -0.0653081014752388,
        0.0007933948072604835,
        -0.03978153318166733,
        0.018051752820611,
        0.10310656577348709,
        0.010273543186485767,
        0.026794513687491417,
        -0.08241283893585205,
        -0.06935662031173706,
        0.057579800486564636,
        -0.012943808920681477,
        -0.017479073256254196,
        -0.047267064452171326,
        0.0043082283809781075,
        -0.029694147408008575,
        -0.06807535141706467,
        0.018214497715234756,
        0.01707150600850582,
        0.04925372079014778,
        -0.023839155212044716,
        -0.03766699880361557,
        0.041130609810352325,
        0.11671232432126999,
        -0.01729520410299301,
        0.016932129859924316,
        -0.022953445091843605,
        0.01607378013432026,
        -0.08173969388008118,
        -0.05768132582306862,
        -0.03595372661948204,
        -0.007965913973748684,
        -0.027806289494037628,
        0.026095792651176453,
        0.040850844234228134,
        -0.0077909971587359905,
        -0.03644809499382973,
        -0.045182965695858,
        0.09653008729219437,
        0.06108364090323448,
        0.056162845343351364,
        0.03887803480029106,
        0.017962975427508354,
        -0.04236858710646629,
        -0.06830663233995438,
        -0.06618225574493408,
        0.08160728216171265,
        0.024073688313364983,
        0.08412104845046997,
        0.06267068535089493,
        -0.003118345979601145,
        -0.0030030193738639355,
        -0.09403257817029953,
        -0.04050955921411514,
        0.14240826666355133,
        -0.01812334544956684,
        0.03375815227627754,
        -0.0009939062874764204,
        -0.0012920030858367682,
        -0.07916107028722763,
        -0.08377991616725922,
        -0.02902817726135254,
        0.02549757994711399,
        -0.06107093393802643,
        0.04551278427243233,
        0.09962096065282822,
        -0.029067695140838623,
        0.0006885926122777164,
        0.05069367587566376,
        -0.034705936908721924,
        0.007790946401655674,
        0.05111333727836609,
        0.008363465778529644,
        -0.059513118118047714,
        9.582061302511077e-33,
        -0.06956547498703003,
        0.015181145630776882,
        -0.05768837407231331,
        -0.042668089270591736,
        0.024193506687879562,
        -0.03833384811878204,
        0.010592123493552208,
        0.07257218658924103,
        -0.0059659043326973915,
        -0.009096002206206322,
        -0.004499247297644615,
        0.060951896011829376,
        -0.03621218726038933,
        -0.009412004612386227,
        0.07989968359470367,
        -0.10834122449159622,
        0.0003589229891076684,
        -0.012927806936204433,
        -0.007361130323261023,
        0.0004911577561870217,
        -0.015667857602238655,
        -0.06035798788070679,
        -0.017083773389458656,
        -0.0611233226954937,
        -0.02385716140270233,
        0.01922111213207245,
        -0.0008434406481683254,
        0.015046874061226845,
        0.09311093389987946,
        0.025524413213133812,
        -0.0340455025434494,
        -0.019308459013700485,
        0.026352733373641968,
        -0.044829919934272766,
        0.011512445285916328,
        0.05105672404170036,
        -0.04927091300487518,
        -0.07175292819738388,
        0.012114240787923336,
        0.01392465177923441,
        -0.1035546213388443,
        0.03707731515169144,
        -0.07890565693378448,
        -0.07763653248548508,
        0.03215167298913002,
        0.007021211553364992,
        -0.029298163950443268,
        -0.07298611104488373,
        -0.0005666196811944246,
        0.053378187119960785,
        -0.0725657269358635,
        0.054234325885772705,
        -0.04340828210115433,
        -0.008159528486430645,
        0.020687518641352654,
        -0.05200355872511864,
        0.00385521468706429,
        -0.01532831508666277,
        -0.0041092135943472385,
        0.1080038920044899,
        -0.05031200125813484,
        0.02430831640958786,
        -0.00785201508551836,
        -0.01030033454298973,
        -0.1580057293176651,
        0.08558415621519089,
        0.07794330269098282,
        -0.011536553502082825,
        -0.07785025238990784,
        0.14269709587097168,
        0.012826696038246155,
        -0.023943055421113968,
        0.1103522852063179,
        0.02686494216322899,
        0.006725099869072437,
        0.04192991182208061,
        -0.04737688973546028,
        -0.050717756152153015,
        -0.04406275972723961,
        -0.006389077287167311,
        -0.04026630520820618,
        -0.0026675525587052107,
        0.016392765566706657,
        0.027886513620615005,
        -0.01908818818628788,
        0.02785448543727398,
        -0.003231035778298974,
        -0.019891178235411644,
        0.019672486931085587,
        0.024182187393307686,
        -0.09221328794956207,
        -0.01952880620956421,
        0.0110264141112566,
        0.02193894051015377,
        -0.10220260173082352,
        -1.0728751633634403e-32,
        -0.11715447157621384,
        0.047819849103689194,
        -0.03932588919997215,
        0.04312314838171005,
        -0.017373694106936455,
        0.0018468841444700956,
        0.029453177005052567,
        0.028335347771644592,
        0.005749826319515705,
        -0.021023595705628395,
        0.0006449033971875906,
        0.04359324276447296,
        -0.04663122072815895,
        -0.009153786115348339,
        -0.012703071348369122,
        -0.04682958126068115,
        0.09611114114522934,
        -0.0806620791554451,
        0.02517671510577202,
        0.02305971272289753,
        0.008455278351902962,
        0.08713503181934357,
        -0.030221831053495407,
        0.09936458617448807,
        0.04368181154131889,
        0.028419341892004013,
        0.034589625895023346,
        0.02630036137998104,
        0.005454217549413443,
        -0.0435757152736187,
        -0.009342921897768974,
        -0.036680206656455994,
        -0.00632532499730587,
        -0.012375477701425552,
        0.07452643662691116,
        0.012758453376591206,
        0.05270233750343323,
        0.043098509311676025,
        -0.0025027201045304537,
        -0.03912635147571564,
        0.05626090243458748,
        -0.04217662662267685,
        -0.01097746379673481,
        0.08672600984573364,
        -0.0023190623614937067,
        -0.0025097632315009832,
        -0.03183157742023468,
        0.018002066761255264,
        0.004039525054395199,
        -0.01848967932164669,
        0.0061922152526676655,
        0.0008308797259815037,
        -0.008140535093843937,
        -0.010255546309053898,
        -0.09297914057970047,
        -0.006149100139737129,
        -0.003812810406088829,
        0.048809878528118134,
        -0.030349915847182274,
        -0.03849267587065697,
        0.07033941894769669,
        -0.006325900088995695,
        -0.01809224858880043,
        -0.027349749580025673,
        0.00898133497685194,
        -0.056345384567976,
        0.06005430594086647,
        0.01259379368275404,
        -0.06507658213376999,
        0.023434843868017197,
        -0.03349139913916588,
        -0.011476453393697739,
        -0.0673917904496193,
        -0.11848998069763184,
        -0.04234301298856735,
        0.07901833206415176,
        0.04380582645535469,
        -0.011286647990345955,
        -0.02035980485379696,
        0.009784501977264881,
        0.02313576266169548,
        0.12386071681976318,
        0.07309999316930771,
        -0.01978745311498642,
        0.032007962465286255,
        -0.02709279954433441,
        0.03521675616502762,
        -0.04374069347977638,
        -0.08937855064868927,
        -0.01307971216738224,
        -0.1286565363407135,
        0.013937960378825665,
        -0.07370909303426743,
        0.1129785105586052,
        -0.041322484612464905,
        -7.479809482902056e-08,
        0.04121378809213638,
        -0.02869417332112789,
        -0.00500179547816515,
        -0.006562468595802784,
        0.026078565046191216,
        -0.006244343239814043,
        0.015659036114811897,
        0.021967895328998566,
        0.03958231955766678,
        -0.0003313104098197073,
        0.02717161364853382,
        -0.08765512704849243,
        -0.16728328168392181,
        0.050372105091810226,
        -0.02021174505352974,
        -0.00349544663913548,
        -0.08585770428180695,
        0.040697745978832245,
        -0.031618520617485046,
        -0.11425149440765381,
        -0.0351102240383625,
        0.09401658177375793,
        0.06910873204469681,
        -0.06259465217590332,
        0.00922736432403326,
        0.06631927192211151,
        0.04708494991064072,
        0.046427737921476364,
        0.06660903990268707,
        0.04777590185403824,
        -0.04998590052127838,
        -0.004637120291590691,
        -0.007807450834661722,
        -0.04175471514463425,
        -0.03813569247722626,
        -0.033737339079380035,
        0.004235927015542984,
        0.08162369579076767,
        0.08201900124549866,
        0.05401214584708214,
        -0.04193440079689026,
        -0.02322581596672535,
        0.010768871754407883,
        0.046499479562044144,
        -0.01736028864979744,
        -0.04198829457163811,
        -0.12352140992879868,
        -0.03063874877989292,
        0.0596282035112381,
        -0.032888781279325485,
        0.010121875442564487,
        -0.05290800705552101,
        -0.03962789848446846,
        -0.007549275178462267,
        0.05081046745181084,
        -0.0155678391456604,
        -0.033991340547800064,
        -0.03595319017767906,
        -0.013766267336905003,
        0.08839229494333267,
        0.05235360935330391,
        -0.13228262960910797,
        -0.06216001510620117,
        0.0627974420785904
    ]
}