{
    "id": "CkoquiSnqbk",
    "title": "Ford F150 Lightning is the iPhone of Pickup Trucks!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-06-24T19:33:48Z",
    "video_url": "https://www.youtube.com/watch?v=CkoquiSnqbk",
    "category": "Science & Technology",
    "tags": [],
    "views": 3603644,
    "likes": 121585,
    "comments_count": 6435,
    "description": "Ford's F150 Lightning is actually the most important vehicle they've made in a long time.  MKBHD Merch:   Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   Truck provided by Ford for review.  ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "- The F-150 Lightning is the iPhone of pickup trucks. Like it's not new new, we've had pickup trucks before, but this is the first very clearly in a new generation that will all be different. And so Lightning also Lightning so yeah. (hip-hop music) - Okay, so if you've ever driven around the United States and just looked, for more than a few seconds, you'll find it impossible not to notice that there are Ford F-150s everywhere, and it's not just on construction sites, it's on the roads. It's at grocery stores, it's taking the kids to school. It has been the most popular vehicle, not the most popular truck, the bestselling vehicle, in America for the past 30 plus years in a row. And it shows. And so that's exactly why the F-150 Lightning is a really big deal, especially for Ford. It's kind of like, you probably know someone like this. People who have older iPhones, who are not really considering getting any other phone, other than a new iPhone, don't really know which new iPhone but eventually they will upgrade to one of the newer iPhones. It might not be you and I, but there's a lot of people just like that here with their Ford trucks. So I've been driving and living with the all-electric F-150 Lightning for a couple days now enjoying its tons of features, living in a world of an electric pickup truck. And I am very impressed, but it's not me they have to impress, it's the whole world of F-150 loyalists and pickup truck buyers that are waiting for the next convincing F-150 upgrade, before they buy one again. Basically, if the future of cars is electric, then this is one of the most important cars in the world. (upbeat music) So in a lot of ways, it doesn't actually matter how this thing drives. Like I could talk to you all day about driving dynamics, but most people buying a truck like this aren't too concerned with that. But the fact is, it is actually better than a regular F-150 in a couple of ways. One it's much quieter. You can turn on the propulsion sound, which I haven't, but it's very quiet for a truck. And then two, it is much smoother. I am a big fan of the one pedal driving option. A lot of EVs don't have the option. You should always have the option. This gives you that. And so the regenerative breaking is pretty smooth. The pedal calibration's pretty smooth and overall, it drives pretty well. And if you wanna kick it in a straight line, you definitely can. This happens to be the first F-150 with independent rear suspension. And that's actually just a result of the way they built the car with the battery pack underneath. But otherwise it drives the same way as the other F-150s. If you're used to a big truck, it drives like a big truck. If you're used to being high above the road, it's still high above the road. And that's actually important. It's gotta feel familiar. It's gotta feel like truck you're used to. And in so many ways, it still does, just a little better. But clearly it does not look too outta place on a road. I drive past other F-150s all the time. It looks exactly the same from the outside. If you don't look at the badges, if you don't know what to look for as far as the bar headlights and the bar taillights, yeah this is very much familiar. And that's a good thing. It's supposed to be. We just need an EV version of a car that's already very well accepted. And Ford did that with the name Mustang, but they really did it with the entire truck here with the F-150. Even if nothing else is different about the F-150 Lightning against the gas F-150 Lightning, the one thing it does have is called the Mega Power Frunk, which will make a lot of sense. If I open it, it beeps for a second to let me know it's gonna open. Then it opens to reveal 400 liters or 14 cubic feet of enclosed storage, which pickup trucks normally don't have. That's bigger than the trunk of a Toyota Corolla. So it's a real trunk. You can put up to 400 pounds of stuff in here. There is a false floor at the bottom, underneath which you will find space for your charging cable. But even without that there's plenty of space for bags, grocery shopping. You can fit a full set of golf clubs in here, like I've done in the past, but it's also called the Mega Power Frunk, because you can kind of just operate again work out of the frunk. There's four full size outlets over here, a USB-C port, a USB-A port, or if you just wanna use it as a tailgating, but what's the opposite of a tailgate, whatever. As a cooler, you can fill it with ice and there's a drain hole in the bottom. So this becomes the place where you sort of party out of your truck. It's just multipurpose in every way. But really the cherry on top is this is the feature that would visually differentiate it and make it obvious that this truck was different from the others. Like this would pull up in a parking lot alongside all of the rest of the other trucks there. And no one would bat an eye, unless you recognize the badging or the taillight bar or the headlight bar. You wouldn't know but the second the front truck opens, that's when other truck owners heads would turn like, \"Wait that's not the same thing as the truck I have.\" So that is the main fun part of the Lightning's Mega Power Frunk. (boot clanks) You could also fit a human body in it. So I could point out the work truck theme and how it's present all over the F-150 Lightning, but it would also be kind of redundant, because that's all over every F-150, spraying truck liner, how massive this thing is, all the measuring equipment on the side. But my favorite part is definitely how many power outlets this thing has, and everything it can power because it's essentially a giant battery bank, probably the biggest battery bank you'll ever have. So the trunk has a whole bunch of 120 volt outlets. It has a 240 volt outlet. That's your power tools, your air compressor, whatever else you want it to be. But then the inside of the cab, you've got full size outlets in there too. USB ports, wireless charging. The frunk like I said, also has power, but the best part of it is the truck can power your house if you wanted it to. So Ford sells an inverter, you put it in your garage, and you plug this thing in and it can back up your house if it loses power for days at a time. Several times the size of a Tesla power wall. So that's pretty sick. I guess the point I'm making is even though I'm not in the market for an F-150 Lightning, I love this thing. Some new EVs are super different from the rest of the company's lineup. But as I keep saying, this one's basically the same and that's on purpose. Of course, the similarity in parts makes for much easier cheaper manufacturing, which by the way, is already topnotch from the company that literally invented the assembly line. And the familiarity of the F-150 brand lends itself to people being more likely to give it a shot, but also not only is this just another F-150, but it's the best F-150 ever made. The F-150 Lightning is more powerful than the most powerful gas F-150. It has more horsepower and more torque than the best gas F-150. It has a massive max towing capacity, the most covered cargo space, the most high tech features. It has the least maintenance. It's the least expensive per mile to run and own. And by the way, it's the fastest, quietest, smoothest and the easiest to drive if any of that matters to you. So it delivers, it delivers on the promise, and I can see it making a lot of the pre-order holders happy. We even used a second F-150 Lightning to shoot this first F-150 Lightning. So it's already putting in work. My only question going in was about range. You might have remembered some of the things left unclear from my impressions video. So this extended range version promised 300 miles. I lived with it for a week and I found that real world use gets you a little bit below that, which is not surprising, about 280, but then there's even a sick feature that measures how much you're either hauling or towing with a built-in scale and then adjusts your estimated range from there, which is a great idea for a truck, which will be towing and hauling all the time. So here we are, Ford's gonna start shipping these. We'll see how fast they can ramp up manufacturing. And now it's up to the rest of the competition the electric Ram, the electric Toyota Tundra, even the Cybertruck, the ones on the horizon, it's up to all of them to catch up to this one. Thanks for watching. Catch you out in the next one. Peace. (hip-hop music)",
    "transcript_keywords": [
        "truck",
        "Lightning",
        "Mega Power Frunk",
        "Power",
        "Lightning Mega Power",
        "Ford",
        "pickup trucks",
        "Power Frunk",
        "Mega Power",
        "thing",
        "trucks",
        "Frunk",
        "lot",
        "Ford trucks",
        "Lightning Mega",
        "big truck",
        "pickup",
        "electric pickup truck",
        "United States",
        "drives"
    ],
    "transcript_entity_values": [
        "Tundra",
        "400 liters",
        "a couple days",
        "iPhones",
        "one",
        "days",
        "four",
        "One",
        "Corolla",
        "300 miles",
        "iPhones",
        "Ford",
        "14 cubic feet",
        "EV",
        "F-150 Lightning",
        "Toyota",
        "a week",
        "the past 30 plus years",
        "America",
        "first",
        "Mustang",
        "Cybertruck",
        "about 280",
        "iPhone",
        "the F-150 Lightning",
        "240 volt",
        "F-150",
        "Mega Power Frunk",
        "second",
        "USB",
        "Tesla",
        "two",
        "the United States",
        "more than a few seconds",
        "up to 400 pounds",
        "F-150",
        "120 volt"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "NORP",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "GPE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY"
    ],
    "vector": [
        -0.030068442225456238,
        -0.07550068199634552,
        0.041710950434207916,
        0.024990035220980644,
        0.06684361398220062,
        0.0717913806438446,
        0.007445703726261854,
        -0.010789030231535435,
        0.027453428134322166,
        -0.0182170569896698,
        0.023861542344093323,
        0.08023437112569809,
        0.04465366154909134,
        -0.011286918073892593,
        0.011314673349261284,
        -0.006730296649038792,
        0.08887817710638046,
        -0.13797210156917572,
        -0.044215984642505646,
        -0.06899450719356537,
        -0.054563626646995544,
        0.021614324301481247,
        0.0005261379992589355,
        0.0751132220029831,
        -0.034928251057863235,
        0.09621796756982803,
        -0.05452626571059227,
        -0.018099717795848846,
        -0.09027008712291718,
        -0.06878770887851715,
        -0.016555562615394592,
        0.08922581374645233,
        0.03175013139843941,
        -0.008337769657373428,
        -0.05759411305189133,
        -0.12362410128116608,
        -0.016774270683526993,
        0.04222541302442551,
        0.06124936416745186,
        -0.0784592404961586,
        -0.04370329529047012,
        -0.09142684936523438,
        0.01948179304599762,
        -0.0499214231967926,
        -0.05473820120096207,
        0.02564871497452259,
        0.034585174173116684,
        -0.04262755066156387,
        0.02876373939216137,
        -0.03236936777830124,
        0.025879113003611565,
        0.0416957288980484,
        0.010015354491770267,
        0.04209627956151962,
        0.02814469486474991,
        -0.050930652767419815,
        -0.022568656131625175,
        0.018545588478446007,
        0.07457204908132553,
        0.05363144353032112,
        0.012162379920482635,
        0.00919365044683218,
        0.0065074339509010315,
        0.013724968768656254,
        0.005553467199206352,
        -0.028576685115695,
        -0.05986564978957176,
        0.0020380751229822636,
        -0.033513393253088,
        0.02518942765891552,
        0.09980663657188416,
        0.01547461561858654,
        0.012540212832391262,
        0.05746282637119293,
        0.06139921396970749,
        0.014435214921832085,
        0.058570683002471924,
        0.02679852955043316,
        -0.06927719712257385,
        0.016427073627710342,
        0.0706120952963829,
        0.022041460499167442,
        0.009508700110018253,
        -0.06733882427215576,
        -0.006154925096780062,
        0.01583048328757286,
        0.05305205658078194,
        -0.03271087259054184,
        -0.12252198904752731,
        0.03907753527164459,
        -0.08262049406766891,
        0.01738591678440571,
        -0.05665110796689987,
        0.010182932019233704,
        -0.023048292845487595,
        0.008565395139157772,
        -0.013239415362477303,
        -0.05328536033630371,
        -0.029888508841395378,
        0.016099996864795685,
        -0.028665142133831978,
        -0.01107233390212059,
        0.0785011276602745,
        -0.003940070513635874,
        -0.058780744671821594,
        -0.09829799830913544,
        -0.04781586676836014,
        0.07229725271463394,
        0.023323411121964455,
        0.03422500938177109,
        0.08678251504898071,
        -0.017651787027716637,
        -0.07675731927156448,
        -0.003918410278856754,
        -0.034758083522319794,
        -0.06338810920715332,
        -0.037705861032009125,
        0.06941719353199005,
        0.06627272069454193,
        0.05907314643263817,
        0.013419589027762413,
        -0.036337800323963165,
        0.03958246484398842,
        0.04712715744972229,
        0.026467634364962578,
        -0.00034495245199650526,
        -0.034377265721559525,
        1.3426442292149435e-33,
        -0.03340534493327141,
        -0.002612146781757474,
        0.014539025723934174,
        -0.00808383896946907,
        -0.003516515251249075,
        -0.11528901010751724,
        0.03030221536755562,
        0.018472542986273766,
        0.035066038370132446,
        0.051019441336393356,
        -0.032583609223365784,
        0.07113676518201828,
        -0.009171790443360806,
        -0.03135213255882263,
        0.0031423179898411036,
        -0.0668080598115921,
        -0.1452280431985855,
        -0.0958406999707222,
        -0.08307603746652603,
        -0.01656264439225197,
        0.024892661720514297,
        0.04320418834686279,
        0.06452638655900955,
        0.0014460461679846048,
        0.012239597737789154,
        -0.007296193391084671,
        0.007928682491183281,
        0.010120494291186333,
        0.03399494290351868,
        0.02366834320127964,
        -0.04417793080210686,
        -0.00018893978267442435,
        0.06898041814565659,
        -0.011216693557798862,
        -0.028782721608877182,
        0.017748665064573288,
        0.026323633268475533,
        -0.11176782101392746,
        -0.0422804020345211,
        0.0007020346820354462,
        0.010463982820510864,
        0.012699007987976074,
        -0.1926881968975067,
        0.013867182657122612,
        -0.006449317559599876,
        0.07657350599765778,
        -0.03926267474889755,
        0.00040845360490493476,
        -0.07807976007461548,
        0.07996924966573715,
        -0.07095964252948761,
        -0.011481908150017262,
        0.046983588486909866,
        -0.027334291487932205,
        0.00836873147636652,
        0.06869852542877197,
        0.02552076056599617,
        -0.022563911974430084,
        0.12214541435241699,
        -0.006832029204815626,
        -0.05969497561454773,
        0.025159811601042747,
        0.011716523207724094,
        -0.015963803976774216,
        -0.0072865416295826435,
        0.038054611533880234,
        0.04939655587077141,
        0.015492217615246773,
        -0.00024826754815876484,
        0.0906044989824295,
        0.041640907526016235,
        -0.03762825205922127,
        0.010014583356678486,
        -0.025233304128050804,
        0.09708356857299805,
        -0.02947857789695263,
        -0.03704533725976944,
        -0.004307133611291647,
        0.055736977607011795,
        -0.026584887877106667,
        -0.09637847542762756,
        -0.033964332193136215,
        0.018309496343135834,
        0.06799378246068954,
        0.07753743976354599,
        -0.010844183154404163,
        -0.05767446383833885,
        -0.04240449145436287,
        -0.0131743298843503,
        0.04325083643198013,
        -0.07505417615175247,
        0.07643865793943405,
        0.01336534135043621,
        0.06326836347579956,
        0.010626191273331642,
        -3.0742452127795812e-33,
        0.06419197469949722,
        -0.04818526282906532,
        -0.01208516862243414,
        0.04546818509697914,
        0.028763413429260254,
        0.03820471465587616,
        -0.01365579292178154,
        0.0037570574786514044,
        0.0015691836597397923,
        0.07408583909273148,
        0.05288856849074364,
        0.02118953876197338,
        -0.07906340807676315,
        0.02899719960987568,
        0.024540992453694344,
        -0.053039196878671646,
        0.024250276386737823,
        -0.02208752930164337,
        -0.02607806585729122,
        0.10040230304002762,
        -0.020738396793603897,
        0.0025458254385739565,
        -0.05365142226219177,
        -0.04058721289038658,
        -0.07388904690742493,
        0.014695377089083195,
        -0.09234727174043655,
        0.06336253136396408,
        -0.0062225693836808205,
        -0.08280878514051437,
        0.0028597302734851837,
        0.0006694160401821136,
        0.04320016875863075,
        -0.03730118274688721,
        -0.0016070136334747076,
        0.025277119129896164,
        0.025458671152591705,
        -0.04569993168115616,
        -0.07498791813850403,
        0.010840201750397682,
        0.006015827413648367,
        0.07530631124973297,
        0.044080641120672226,
        -0.0001557901850901544,
        -0.01634610816836357,
        -0.004679682198911905,
        -0.0193688552826643,
        0.05098646879196167,
        0.04438861459493637,
        0.007345708552747965,
        0.0575079508125782,
        -0.01928488165140152,
        -0.05663151666522026,
        0.045279793441295624,
        -0.1261652112007141,
        -0.017207447439432144,
        0.07271727919578552,
        0.050142552703619,
        -0.03882391005754471,
        0.09267875552177429,
        0.04940781369805336,
        -0.00827567745000124,
        0.027869030833244324,
        -0.050073154270648956,
        -0.02605604939162731,
        -0.13402938842773438,
        0.014617699198424816,
        -0.016224058344960213,
        0.009488937444984913,
        0.032246291637420654,
        -0.010546510107815266,
        -0.08529254049062729,
        0.0011726939119398594,
        -0.023834804072976112,
        -0.10807085037231445,
        0.012322413735091686,
        0.03968903422355652,
        -0.04081682860851288,
        0.048463575541973114,
        -0.06101933866739273,
        0.09901528060436249,
        0.06979900598526001,
        -0.047647979110479355,
        0.007901872508227825,
        0.001684929826296866,
        0.0948229506611824,
        -0.0028060751501470804,
        -0.016767237335443497,
        -0.018760064616799355,
        0.05751631036400795,
        0.043821994215250015,
        0.047093089669942856,
        -0.07172484695911407,
        0.05153348296880722,
        -0.05347524583339691,
        -5.491658328082849e-08,
        0.020672906190156937,
        0.06396789848804474,
        -0.07406390458345413,
        -0.024068541824817657,
        0.0762862116098404,
        -0.0013043725630268455,
        0.10527495294809341,
        0.04108661040663719,
        0.007319367490708828,
        -0.055915769189596176,
        0.021385004743933678,
        -0.057723384350538254,
        -0.025239888578653336,
        0.05668975040316582,
        0.005352567881345749,
        0.04828047379851341,
        -0.03656177222728729,
        0.009653089568018913,
        -0.02375486120581627,
        0.03969419002532959,
        -0.02499418333172798,
        0.011251057498157024,
        0.03724108263850212,
        -0.02993524819612503,
        0.00974502693861723,
        -0.01860938034951687,
        0.05192309617996216,
        -0.04721379280090332,
        0.03253437578678131,
        -0.010064278729259968,
        -0.08905219286680222,
        -0.003826697589829564,
        -0.008537226356565952,
        -0.02900959737598896,
        0.034587740898132324,
        -0.034031350165605545,
        -0.004857975989580154,
        -0.026972737163305283,
        -0.02942517399787903,
        -0.0382116325199604,
        0.03106244094669819,
        -0.05423922836780548,
        -0.04531128332018852,
        -0.05222800374031067,
        -0.036006856709718704,
        -0.030392315238714218,
        -0.03020430915057659,
        -0.015871983021497726,
        -0.10243698209524155,
        0.12512265145778656,
        -0.07374805957078934,
        -0.07221657037734985,
        -0.03180999681353569,
        -0.014804450795054436,
        0.05372152850031853,
        0.060064833611249924,
        -0.0431220643222332,
        -0.008784114383161068,
        -0.010230344720184803,
        -0.1065375804901123,
        0.07431276142597198,
        0.006835596635937691,
        0.09234122186899185,
        0.10594296455383301
    ]
}