{
    "id": "Cm-kZGnQ42s",
    "title": "How GOOD are $40 earbuds? - OnePlus Nord Buds",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-05-25T13:07:56Z",
    "video_url": "https://www.youtube.com/watch?v=Cm-kZGnQ42s",
    "category": "Science & Technology",
    "tags": [
        "OnePlus",
        "Nord Buds",
        "Earbuds",
        "Audio",
        "Quality",
        "OnePlus Nord Buds",
        "$40 Earbuds",
        "Wireless",
        "True Wireless",
        "TW",
        "Sound",
        "Apple",
        "Airpods",
        "Fake"
    ],
    "views": 268074,
    "likes": 13587,
    "comments_count": 600,
    "description": "Join us in War Thunder for FREE at  and get an exclusive bonus using our link - thanks for supporting the channel!  $40 for earbuds isn't uncommon today, but you're always going to be a bit suspicious of claimed audio quality by the brand. The OnePlus Nord Buds had us interested, and they delivered all of the claims. Well, maybe except for the pairing function, but small details.   Check out the OnePlus Nord Buds at   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 - Oh hey, new host! 0:25 - Pricing and overview 1:13 - Unboxing 2:07 - Exterior first impressions 3:18 - Comfort impressions 4:08 - Specs and weight 4:48 - App overview 5:20 - Sponsor - War Thunder 6:06 - Pairing the earbuds impressions 7:24 - Affordability thoughts 8:26 - EQ settings 8:51 - Audio quality impressions 11:02 - Call quality impressions 11:40 - Outro",
    "description_links": [
        "https://playwt.link/lttsc",
        "https://lmg.gg/sq55f",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Oh (beep) it's ShortCircuit time. Yo, what's up? My name's Adam, this is my first ShortCircuit. Should we just get into it? [David] Who are you? - Oh, I'm Adam, I'm a writer here. I write some of the videos that you watch. I just worked on an upcoming video about our lab that we're building that's gonna be doing objective headphone testing. That is not what we're here for today. What we're here for today is a first impression, an unboxing, of the OnePlus Nord Buds. The OnePlus Nord Buds are $50 Jono? - [Jono] $39 US? - $39 US? - [Jono] Yeeeeee. - Okay, these are the newest headphones from OnePlus, it's part of their Nord lineup, which is their more budget kind of aim lineup. Like they have the OnePlus Nord phone, as opposed to their flagships. This is my personal device, OnePlus 7 Pro. This is one that we got from work. Yeah, so OnePlus has been making wireless earbuds for a little while now. I remember their first ones were iconic for being the cheapest looking knockoffs that you could find of the Apple AirPods, so much so that, do you remember that they got caught at the border? There was a tweet from the US Border Patrol. \"We just blocked a bunch of fake AirPods from coming in.\" But they were legitimate OnePlus products. It was not, they're not knockoffs. So OnePlus did come from kind of trying to bite Apple's (mumbles), but now it looks like they're trying something that looks pretty different which is kind of cool. I like the shape of this actually. It's kind of a, it's like a very small watch box. Oh, we got some \"Never Settle\" booklets. That's just documentation. Instructions that I may refer to later, the classic white and red OnePlus cable. - [Jono] That's short. - It is very short, a little bit shorter than my face, or a little bit longer than my face. - [Jono] Actually, you know what you should use for reference? - A banana. If you're measuring from the outside it's one banana in length, if you're measuring from the inner radius it is a little bit longer. - [Jono] Whoa, that sounds too technical for ShortCircuit. - Okay, I'm sorry, I'm sorry. - I forgot it's an unboxing. We got some spare ear tips. Good, because I don't know, my ears don't always work with the default ones. And now it's time for the OnePlus Nord buds. Ooh, that's actually a pretty slick look. A nice hinge. I like the hinge. It's lightweight, it doesn't feel premium because it's light. I don't think that that makes it feel cheap in this part because the mechanisms is really smooth but I'm not gonna get caught up on the hinge of a $40 set of headphones, there's a lot more. There's things that I'd rather worry about. There's random bits of plastic like to peel two, three, four, five, get off me. Six peels. If you have a button, when you put it in your ear you press the button and you push it deeper into your ear, which feels not good. Also changes the seal sounds, it's all not great. And I agree that is bad, but you have these beautiful little like Tic-Tacs here where you could have put a button all along the side, maybe two buttons even which would allow you to press the button here that would allow, you wouldn't be pushing into your ear, creating more pressure. You would still be able to like control things easily but who knows? Capacitive can be done, well, it remains to be seen. Okay. Actually the default ones for my ears gotta a pretty good seal. They feel like they're in pretty secure. I actually find these surprisingly comfortable, a lot better than I thought. We'll see if it is, we'll see if they can hold on. (rock music) Yeah, those are in. I don't even think that like they're not even like loose, like those are in really nicely. From the side view, Mm mm yeah, I know, I find these rather comfortable. And I actually do like the look of them, I think they're quite stylish, It's all plastic, but I think it looks classy, this little reflective bit which I assume is gonna be the capacitive touch controls, It like immediately got greasy and nasty. I don't know, who's looking that closer into your ears, probably weirdos. - [Jono] I am. The charging case and headphones, they weigh about 50 grams together, case alone is saying 43. So they're about four and a half grams each in terms of weight, which is good. They're nice and lightweight. 12.4 millimeter titanium drivers, Bluetooth 5.2 which is great. It allows you to connect to more than, to multiple devices type C charger with fast charging allows you to charge the headphones for 10 minutes. That means you get three hours of charge, seven hours of playback with these at a full charge, 30 hours if you include the case, so an extra 23 in the back, so like three extra charges, not bad, they're IP 55 water (mumbles) resistant, which is great. If you're working out, stuff like that don't take 'em swimming though. These have an app called the HeyMelody App. You don't need the app if you have a OnePlus 6 or later which is different than what I saw online. So I might not actually need to get the app on my aging, but lovely OnePlus 7 Pro. I agree, it is the last good one and it has the amazing pop-up camera, selfie camera. So I get the whole screen all the times. When you put the (mumbles) case on it, it gets a little sharpo, the little paperboy hat, it's like getting you the news, and the news is that you look great, honey. Alright, we're gonna connect these, put on some music, take a listen, but before we get to that, we're gonna get to our sponsor, War Thunder. War Thunder is a free to play online military vehicle combat game available on a variety of platforms with cross-play. It features an incredible arsenal of more than 2000 historically accurate playable tanks, aircrafts and ships from the 1910s to vehicles still in service today. You'll compete in massive combined arms battles on over 100 major battlefields from world war II to modern environments. How have those environments changed? I don't know, it's same earth. (laughs) War Thunder's vehicles are implemented with a high level of authenticity and detail. Adding a huge amount of depth to its gameplay. Head to the link below and start playing War Thunder for free. You'll also get access to a premium vehicle just for signing up. Oh, there is a pairing button I didn't mention that there's a pairing button. There's a charging light indicator, I assume a pulse is looking for something. It is actually not working in the slightest bit. So if you have an iPhone, Apple's very good at making their pairing system relatively seamless unless though there's the issue of having other iPhones in the area. But if you have an iPhone and you open up your AirPods, it lights up the phone, saying that your AirPods have connected. I'm not cutting them slack, come on OnePlus this is no good, if Apple can do it, you can. Now they got charged, like the case has charged. If they didn't come charged, that'd be a big issue. Hey Melody. - [Jono] Heeeeey Melody. - [David] Yah! - This is fun, we get to do the permissions game. Should we allow HeyMelody access to my location? - [Jono] Yeah. - Okay, we'll say while using the app. Add, okay, that's it. That's it, apparently they only wanna know where I am. - [David] Good job OnePlus. I mean, why do they need to know where I am? Maybe before we get anywhere, we should try pairing with one of their newer phones because that's the ones that they said should just it should do the Apple magic pairing experience. Because I read online that it only worked on the 9 and 10 Pro, which is why I specifically asked Jono to bring out a 9 and 10 Pro. In the documentation in the device it says OnePlus 6 versions are supported for this pairing and connecting. So we shall get to the bottom of that. How is this possible? So OnePlus back in the day, I remember buying their OnePlus bullets, which were like $20 wired headphones. It was like the first rise of what was called Chifi, Chinese hi-fi. Chinese brands started making really high quality headphones and selling them at very, or at least I guess I'd say, high quality for the price. And so OnePlus was able to take advantage of that by releasing their bullets, which were pretty which were quite well received. I liked them. I thought they sounded really good. And they were only 20 bucks. The fact that like six, seven years later they can now release a set of wireless earbuds with way more tech in them for just $20 more? I did a video about knockoff AirPods and we had $35 AirPods. These are $5 more than those knockoffs, but like it's not like you're buying it from some sketchy like random seller online-- - [Jono] Or AliExpress. - Or AliExpress, exactly, where you just don't really have any recourse for if you get a crappy product or a malfunctioning product. Oh my God, look at these titles. We have Balanced, there's just default, Bold, which is the featured sound signature of today, Serenade and Bass. There's a customizable six level EQ. And you can make custom profiles. That's actually-- - [Jono] On a $40 head earbud. - $40 earbud. Oh, it just offered me to do the tutorial after I spent 10 minutes fiddling in the app. All controls learned. To learn again go to earbud controls, learn earbud controls. That's actually a nice experience. I think for, the issue is that you have to download an app. We're gonna listen to some tunes, I use YouTube music. Sweet, let's listen. Initial impressions, it tends to be a little bit sharp in the high end, I think they kind of do that to boost it, make a more excited sound. It's a little bit bassy, not super detailed. Yeah, so this is kind of actually, I don't know, I mean, maybe I have to mess around. Maybe I need something more like Serenade rather than, so this is the EQ. If the bass is boosted pretty heavily on the headphone the bass just disappears when it, (mumbles) it jumps up and that's a hundred percent what's happening here. So they're very much, they're very aggressively curving the audio to give it that kind of more fun and popular V-shaped feel. I'm actually surprised by the imaging, it actually makes a pretty wide sound stage. A lot wider than I expect from something that's cheap. If you listen to something really dense let's see how we can hear that (mumbles). So this is a really dense track, it's got a lot of instruments, it's very noisy. So trying to test, like to hear if the separation's good. - [Jono] Can you hear me? - I can't hear you. I'm not playing the music very loud, I see you talking, but I can't really hear you. I'm very much in my own head here. I'm pretty impressed, I don't see at this point, we're gonna listen to crab rape because if, if crab rape sounds like crap on this then what are you gonna do? So Jono, this one's for you. (upbeat music) The bass, it's very, it's very fun. It's a good experience, the bass is tuned for a fun experience. Let's check out that's Balanced, it's not. Let's check out Bold. Okay, Bold is literally just that same V-shape that I was talking about, but worse. Serenade just tones down the highs a little bit. Bass sounds stupid. It's just all bass. It's just, it's just, it's just 'brrrrrrrrrrrrr' and then they're like the rest of it's like 'titititititit', 'boom boom boom' like it's horrible. Hi Jono, - [Jono] Hey, how you doing? - I'm doing pretty good. - [Jono] Oh, I mistakenly called Nicole before calling you. - Oh, that's okay, we have very similar names and also look the same. You sound great, how do I sound though? - [Jono] You actually sound really good. Like, it sounds like you actually answered the phone itself, not like earbuds or anything. - Yeah, that's good to hear 'cause I am definitely on the earbuds. Bye Jono. (kissing sounds) You know, all things considered, at the end of the day for $40 pretty good for 40 bucks. Your next challenge is to just be flat out pretty good. If this is too poor for your blood, you can check out some of the more expensive stuff that Linus has unboxed like the Sennheiser headphones. I600, I think they're 3D printed, check them out. I think Linus liked them, right? It ruined other things for him? Yeah, so they're that good. These didn't ruin anything for me. (laughs)",
    "transcript_keywords": [
        "OnePlus Nord Buds",
        "OnePlus",
        "OnePlus Nord",
        "Good",
        "Nord Buds",
        "pretty",
        "pretty good",
        "War Thunder",
        "Nord",
        "bit",
        "headphones",
        "app",
        "Yeah",
        "Bass",
        "OnePlus Nord phone",
        "Apple",
        "kind",
        "Jono",
        "sound",
        "button"
    ],
    "transcript_entity_values": [
        "10 minutes",
        "AirPods",
        "over 100",
        "playing War Thunder for free",
        "world war II",
        "HeyMelody",
        "Six",
        "OnePlus 6",
        "the day",
        "seven hours",
        "Serenade and Bass",
        "Yo",
        "three",
        "Adam",
        "40 bucks",
        "OnePlus",
        "about four and a half grams",
        "the 1910s",
        "US",
        "one",
        "20",
        "5",
        "30 hours",
        "iPhone",
        "Bold",
        "9",
        "OnePlus 7 Pro",
        "Nord",
        "the Apple AirPods",
        "three hours",
        "seven years later",
        "War Thunder's",
        "Sennheiser",
        "just $20",
        "Melody",
        "OnePlus Nord",
        "about 50 grams",
        "Serenade",
        "OnePlus Nord",
        "David",
        "40",
        "Jono] Yeeeeee. -",
        "Jono",
        "Nicole",
        "10",
        "first",
        "The OnePlus Nord Buds",
        "Chinese",
        "I600",
        "Chifi",
        "two",
        "12.4 millimeter",
        "iPhones",
        "55",
        "four",
        "35",
        "EQ",
        "AliExpress",
        "six,",
        "43",
        "a hundred percent",
        "23",
        "the end of the day",
        "the OnePlus Nord Buds",
        "the US Border Patrol",
        "ShortCircuit",
        "Linus",
        "six",
        "50",
        "five",
        "YouTube",
        "Bass",
        "$39 US",
        "Apple",
        "today",
        "War Thunder"
    ],
    "transcript_entity_types": [
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "EVENT",
        "EVENT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "TIME",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "GPE",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "TIME",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "TIME",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "PRODUCT",
        "PERSON",
        "MONEY",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "NORP",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.03727958723902702,
        -0.003569825319573283,
        -0.01661410927772522,
        -0.09720665216445923,
        0.06957706063985825,
        0.0486486479640007,
        0.023918308317661285,
        0.030080758035182953,
        -0.0030906705651432276,
        0.012770160101354122,
        -0.04475058615207672,
        -0.005987404379993677,
        -0.006696569733321667,
        -0.01980753429234028,
        0.006293212994933128,
        -0.049923092126846313,
        0.047001659870147705,
        -0.03375043720006943,
        -0.059530697762966156,
        -0.028285043314099312,
        -0.05032734200358391,
        -0.019709458574652672,
        0.04866247624158859,
        0.037922218441963196,
        0.0546802319586277,
        -0.06400406360626221,
        -0.027785180136561394,
        -0.09754694998264313,
        -0.03650970757007599,
        -0.08599164336919785,
        0.039978187531232834,
        0.053732868283987045,
        0.05667094513773918,
        -0.042851772159338,
        -0.051754679530858994,
        -0.04344567656517029,
        0.031558528542518616,
        -0.060685109347105026,
        -0.14318811893463135,
        0.04314744099974632,
        0.0078787412494421,
        0.026854410767555237,
        -0.08270272612571716,
        -0.06813918799161911,
        -0.0767832025885582,
        0.0028988379053771496,
        0.01074069645255804,
        0.012803972698748112,
        -0.006395689211785793,
        0.05306331813335419,
        0.07752997428178787,
        -0.03386596962809563,
        0.010543685406446457,
        0.013743405230343342,
        -0.04617688059806824,
        0.01824636571109295,
        -0.0577530674636364,
        -0.0069756340235471725,
        0.0019988627173006535,
        -0.006880768574774265,
        0.048028696328401566,
        -0.0417986661195755,
        0.004495465196669102,
        0.01912938989698887,
        0.0077041322365403175,
        0.01905132830142975,
        0.025791283696889877,
        0.062090516090393066,
        -0.049112528562545776,
        -0.02257811836898327,
        -0.0313493013381958,
        0.002036507474258542,
        -0.011376273818314075,
        0.0723266676068306,
        0.042136434465646744,
        0.06158733367919922,
        0.032812148332595825,
        -0.05659237504005432,
        -0.022906221449375153,
        0.0380178801715374,
        -0.036525215953588486,
        -0.06271257996559143,
        0.002935791853815317,
        -0.0723017230629921,
        0.08003093302249908,
        0.011570735834538937,
        0.017404945567250252,
        0.03717896342277527,
        -0.024252403527498245,
        -0.07119937241077423,
        -0.08709212392568588,
        0.09827619791030884,
        0.016120772808790207,
        -0.032812152057886124,
        0.03989163041114807,
        -0.006132632959634066,
        -0.03587150201201439,
        -0.016740119084715843,
        -0.014562169089913368,
        0.05421764403581619,
        0.027704846113920212,
        0.01558620110154152,
        0.015346972271800041,
        -0.10732175409793854,
        0.014361190609633923,
        -0.1112951934337616,
        -0.05790448561310768,
        -0.005947630852460861,
        0.061795011162757874,
        0.06013742834329605,
        -0.04366204887628555,
        -0.0034990010317415,
        -0.03494071587920189,
        -0.010702619329094887,
        0.06669291108846664,
        0.04042540118098259,
        -0.08786115795373917,
        0.060369644314050674,
        0.06293890625238419,
        -0.12565019726753235,
        0.0368407666683197,
        -0.03284072130918503,
        0.03824147954583168,
        -0.02614852972328663,
        -0.07619757205247879,
        -0.017420943826436996,
        -0.04548080265522003,
        2.1115063395775043e-33,
        -0.025649061426520348,
        0.04375721141695976,
        -0.07244221121072769,
        -0.013518815860152245,
        0.021363066509366035,
        0.0037079884205013514,
        -0.050614502280950546,
        0.0066959741525352,
        -0.05708552151918411,
        0.06730485707521439,
        -0.1224038153886795,
        0.02714984491467476,
        -0.012048556469380856,
        0.039877600967884064,
        -0.035216074436903,
        -0.039125535637140274,
        -0.03746140003204346,
        0.014510922133922577,
        -0.0483727790415287,
        0.026941897347569466,
        0.012086980976164341,
        0.043188486248254776,
        -0.026506289839744568,
        0.03508498892188072,
        0.08119498938322067,
        -0.058471500873565674,
        -0.002262987196445465,
        -0.044273387640714645,
        0.12637683749198914,
        -0.002737815724685788,
        -0.09045960754156113,
        -0.028988810256123543,
        0.039055727422237396,
        -0.08301390707492828,
        0.06706641614437103,
        0.019475746899843216,
        -0.0767936110496521,
        0.013956968672573566,
        -0.024729721248149872,
        -0.028884241357445717,
        0.07120010256767273,
        0.004570659250020981,
        -0.05409057438373566,
        -0.07977340370416641,
        0.02540694922208786,
        0.04541204497218132,
        0.024306215345859528,
        0.03688567131757736,
        0.009040211327373981,
        -0.067794069647789,
        -0.013543813489377499,
        0.04489697888493538,
        -0.1020955890417099,
        -0.002809970173984766,
        -0.00481461500748992,
        -0.026511898264288902,
        0.03755389526486397,
        0.005668157711625099,
        0.021796656772494316,
        0.0034209475852549076,
        0.05279058218002319,
        0.049339666962623596,
        0.03875410184264183,
        -0.08766525238752365,
        -0.07709534466266632,
        0.0426204577088356,
        0.037646595388650894,
        -0.003991184290498495,
        -0.06928180903196335,
        -0.0660175308585167,
        0.01786702498793602,
        0.08588298410177231,
        0.01482296735048294,
        -0.06729275733232498,
        -0.004914521239697933,
        0.040478356182575226,
        -0.026247182860970497,
        -0.02008424699306488,
        0.08955549448728561,
        0.011987229809165001,
        -0.04480941221117973,
        0.0082926070317626,
        0.07118137925863266,
        0.0496324859559536,
        0.09007053822278976,
        -0.013821029104292393,
        -0.004040098283439875,
        -0.054537899792194366,
        -0.08457183837890625,
        0.0436808280646801,
        0.015308814123272896,
        0.09490764141082764,
        -0.06505248695611954,
        -0.054393988102674484,
        0.06381041556596756,
        -4.378282993271155e-33,
        -0.02358318492770195,
        0.055287886410951614,
        0.05433427914977074,
        0.03941323608160019,
        0.11178209632635117,
        0.08700959384441376,
        0.08019637316465378,
        0.01665326952934265,
        0.057033807039260864,
        -0.013741008937358856,
        0.015865890309214592,
        -0.04092428833246231,
        -0.11289133876562119,
        -0.004890484735369682,
        -0.00512667978182435,
        -0.10728295892477036,
        0.00948302261531353,
        -0.017364749684929848,
        0.04188643768429756,
        -0.04544083774089813,
        0.06803248077630997,
        0.02380365878343582,
        0.06023285910487175,
        0.015652980655431747,
        -0.11960174888372421,
        0.0013215318322181702,
        0.09488619863986969,
        -0.007457680068910122,
        0.007648490834981203,
        0.0018618871690705419,
        0.05070886015892029,
        0.00458023976534605,
        -0.10796568542718887,
        -0.018645118921995163,
        0.027331314980983734,
        0.02925729751586914,
        0.032072022557258606,
        0.06434965878725052,
        -0.028534993529319763,
        -0.08403334766626358,
        -0.02190355397760868,
        0.045602310448884964,
        -0.019591690972447395,
        -0.08540920168161392,
        0.031149502843618393,
        -0.09016777575016022,
        -0.09938517212867737,
        0.0063399397768080235,
        -0.038348983973264694,
        0.006997983902692795,
        0.029950793832540512,
        0.018286820501089096,
        0.0577910915017128,
        -0.02313951589167118,
        -0.09979653358459473,
        -0.04519354924559593,
        -0.0419703871011734,
        -0.0038988692685961723,
        0.05515957996249199,
        -0.0198816005140543,
        0.012702297419309616,
        -0.007344828452914953,
        -0.03215464949607849,
        -0.0027606163639575243,
        -0.04537225142121315,
        -0.011759592220187187,
        0.0822751447558403,
        0.008308973163366318,
        -0.0018078809371218085,
        0.012302092276513577,
        0.05276446044445038,
        -0.03818723186850548,
        0.01694372482597828,
        -0.036258336156606674,
        -0.0007259503472596407,
        0.054972365498542786,
        -0.05992189049720764,
        -0.045442577451467514,
        0.11287610232830048,
        -0.006410188041627407,
        -0.03757091611623764,
        0.03912985324859619,
        0.043021488934755325,
        0.03672216087579727,
        0.10256314277648926,
        0.012765076942741871,
        0.07728462666273117,
        -0.015983467921614647,
        -0.03289269655942917,
        0.09736277163028717,
        0.014780668541789055,
        0.029213208705186844,
        -0.017397234216332436,
        0.0803031474351883,
        0.045332204550504684,
        -5.7468486858169854e-08,
        -0.02252030000090599,
        0.05072609707713127,
        -0.02319958433508873,
        -0.017916377633810043,
        -0.03189108893275261,
        -0.07784482836723328,
        0.004981254227459431,
        -0.004760900046676397,
        0.04441229999065399,
        -0.038770027458667755,
        0.016026269644498825,
        -0.039523541927337646,
        -0.09385164082050323,
        0.03997883200645447,
        0.0025232858024537563,
        -0.0030954130925238132,
        -0.03603969141840935,
        0.07431505620479584,
        -0.018125392496585846,
        -0.04869890585541725,
        -0.0045029702596366405,
        0.1202583983540535,
        0.04616706073284149,
        -0.06153043732047081,
        0.0035378329921513796,
        0.017962448298931122,
        0.10175210237503052,
        0.0639844611287117,
        0.09732934832572937,
        -0.03959672898054123,
        -0.0629391074180603,
        0.007893788628280163,
        -0.09338261187076569,
        -0.03524668514728546,
        0.024971209466457367,
        -0.09725841134786606,
        -0.08156219124794006,
        0.08322363346815109,
        0.010579724796116352,
        0.05655219405889511,
        -0.0209264624863863,
        -0.029246941208839417,
        0.03542844206094742,
        0.024492716416716576,
        0.038311246782541275,
        0.01387107465416193,
        0.056955426931381226,
        -0.031661368906497955,
        -0.07906221598386765,
        0.04507239907979965,
        -0.028629546985030174,
        0.0387549102306366,
        -0.0203753262758255,
        -0.011908868327736855,
        -0.008503055199980736,
        -0.01640436425805092,
        -0.006473221350461245,
        0.04293448105454445,
        -0.0383659191429615,
        0.03401396796107292,
        -0.07160217314958572,
        -0.09778346121311188,
        -0.00011825780529761687,
        0.10141701996326447
    ]
}