{
    "id": "Cm2CAqCo_6A",
    "title": "I built the Ultimate Switch OLED 😅",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2023-04-01T15:04:13Z",
    "video_url": "https://www.youtube.com/watch?v=Cm2CAqCo_6A",
    "category": "Science & Technology",
    "tags": [
        "nintendo switch",
        "switch",
        "switch oled",
        "oled",
        "nintendo switch oled",
        "ultimate",
        "accessories",
        "joycon",
        "joy con",
        "austin",
        "austin evans",
        "upgrade"
    ],
    "views": 937587,
    "likes": 23307,
    "comments_count": 557,
    "description": "Nintendo Switch OLED on Amazon:  1TB SanDisk MicroSD on Amazon:  Clear Switch OLED & Joycon Shell on Amazon:  GuliKit Switch Joycon Hall Sensor Replacement on Amazon:  Retroflag Switch Controller on Amazon:  Retroflag Joycon Charger on Amazon:  mClassic HDMI Upscaler on Amazon:  Switch Gaming Station on Amazon:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  Subscribe for more!  TikTok:  Instagram:  Twitter:   Chapter Titles: 0:00 The Ultimate Switch OLED 0:50 Clear Switch Mod 1:37 Hall Sensor Joycons 2:52 Installing the Clear Shell 4:29 Clear Joycons 6:41 The \"Ultimate\" Switch Controller 8:09 This Was a Mistake 9:01 Nintendo Switch \"Graphics Card\" 11:10 Switch Gaming Station",
    "description_links": [
        "https://austin.tech/switcholed",
        "https://austin.tech/1tbmicrosd",
        "https://austin.tech/clearoled",
        "https://austin.tech/halljoycon",
        "https://austin.tech/retroflagswitch",
        "https://austin.tech/retroflagjoycon",
        "https://austin.tech/mclassic",
        "https://austin.tech/switchstation",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Welcome, my friends, to the Ultimate Switch OLED. With the Switch 2 right around the corner, it is time to take this average, ordinary, regular Switch OLED, and turn it into something truly next level. Or I'm gonna ruin it and it'll be a hilarious bit of YouTube content. The Switch OLED is outfitted with a monstrous 64 gigabyte capacity. Double the original Switch, but that's clearly not enough. So, how about we put a terabyte inside? Can I just say though, I don't really buy digital Switch games 'cause Nintendo Online suck and I don't trust that they won't just disappear in a few years when Nintendo decides that they don't wanna make the Switch anymore. So, now that I've test fit the micro SD card, we have a very important thing to do, which is to take apart the Switch. So, the first thing we have, is the ExtremeRate, clear Switch OLED replacement. Now, if you've seen my Switch Lite, you'll know that one of my favorite parts of that is that it is a clear back on the shell, which I think looks cool. Now, to be fair, I'm not entirely sure what the inside of the Switch OLED looks like, but we should have everything we need right here. And, importantly because we've gotta match, we also have clear Joy-Con housing shells. So, let me ask the room a question. What is the biggest problem with Joy-Cons? - [Matt] They're too small. - What's the second biggest problem with Joy-Cons? - [Matt] They taste bad when you put 'em in your mouth. - [Kinsey] \"Tokyo Drift?\" (bell dinging) - Joy-Con drift. It's a real problem, my friend. Which is why I have a solution. So this is the GuliKit, Gilkit, whatever you call it, hall sensing joysticks for Joy-Cons. Hall sensing, if you're not familiar, instead of using an actual pressure point, uses magnets, which are much less prone to being worn out over many furious nights of playing \"Smash.\" Oh my god, the instructions are an hour long! - [Ken] Hey yo! (crew laughing) - All right, two little baby screws and. Ah. (Matt laughing) - [Matt] What's the over under that we even get to two o'clock before he gives up on this? - Okay, so I'm already in danger of rounding off one of my very first screws, so this is great. This is going really well. My friends. - Oh wow. - Finally. - I did a thing. I did a thing. 700 more screws left. - [Ken] Wow, unhinged. (drum roll) (cymbal crash) - That was a good one. That was a good one. So, one thing I will give to this kit is that it has thankfully included a second set of screws and those are actually really helpful because the screws that were inside the Switch OLED were awful and soft. Out of the six side screws on the rails, four of them were stripped pretty much immediately. (crew laughing) No way! That's okay. Is there very big obvious pieces of tape on it? Yes. - [Ken] Wait, idea, idea, idea, idea. Idea, idea. - Yeah, go ahead. Idea, take your pick. - Oh! Put a Pokemon card in here. Oh bro, it fits! That actually is not bad, right? This is not an incredibly rare or valuable card, but the Lugia V, I love this art. I think this look cool. The one problem I'm gonna have, and I think it's okay, is that there is this antenna, I assume one's for wifi, one's for Bluetooth, or maybe it's for dual band wifi or whatever, but there are these big tape marks. So, essentially I'm gonna have to slightly bend the card to go flat, but I think it'll work. Then literally just transferring the buttons and all the little bits and bobs into my new Switch. There we go. Look at that. Those are some buttons right there, just like 17 more to go. So, the clear backplate is on. Now there are, with this kit, a few additional options that I have chosen to forego. Namely, there's a little plastic piece that could go on the bottom that would replace the black here. And I'll be honest, I kinda think the black looks better than this being clear and seeing nothing but a little bit of metal behind it. Does anyone know know how long this took me? - [Ken] An hour and a half. - It was an hour and a half of hard work, but we've got ourselves a kickstand which is a very kickstandy. Woo. Woo. And now, importantly, I can finish it off by inserting my micro SD card once again, boom. One terabyte of clear Lugia-powered goodness. I'm just stalling right now because this was the easy part and the Joy-Cons are going to take me quite literally like two or three hours. So, we have gotten lazy and ignored the instructions altogether and then I just started ripping Joy-Cons apart which I will say is being actually quite, quite useful. We're almost done, right? - I'm a lot farther than you. - But, looky what we've got here. This is the original garbage town, little stick. Why are there so many things underneath here? Bruh. Ah, ooh, who needs an X button anyway? - Notice how I've not had to swear because mine are coming out just fine. (upbeat music) So, what's going on? - Okay, so I got a little frustrated last night with my Joy-Con, which I will say looks dope. Taking it apart for the third time. So, basically when I put it on the Switch, it shows up and it does charge and the stick works, but the buttons do not work at all. The stick is the only thing that is functional which is really weird to me because these face buttons are on the board and they click fine. So, I don't know why. Oh, have you come to gloat? - No. - It don't work. - I came to check on you because you said it was gonna be 10 minutes and that was four hours ago. - So, this may look just like the Joy-Con I was working on a couple of hours ago, but this is the Joy-Con I was working on a couple of hours ago. So, after assembling, dissembling, and double checking everything, my face buttons still weren't working on this Joy-Con. I then took a second Joy-Con, swapped it over, which is why you can see I have my little salmon buttons 'cause I don't care. I'm just trying to see if this thing works. So, lemme turn this Switch on. Here we go. Okay, it takes a second. It shows up as red, which is fine. Now here's the test, stick works, excellent. Yes! Yes! - It was actually the stupid PCB. B, X, Y, home button? - Congratulations. - Thanks. We have the Retroflag Ultimate Switch controller. Now you might ask, after spending literal days on my Joy-Cons, why would you want to replace it with a Pro Grip? And I would say, as great as my Joy-Cons are, unfortunately there's one major flaw. They have batteries. That is where this comes in. Joy-Con charging and game case. It looks like a little Super Famicom, a regular Famicom, right? This is gonna look really cool in a minute. Also, I've never opened this before in my life and I don't understand how it works. How does that even work? Oh, that's neat. Oh, okay, okay, I got it now. Look, see, look how cute that is. So, my Joy-Cons are charging and then I can just be like, while my Joy-Cons are charging, oh no, I can't play my Ultimate Switch. Whatever shall I do? I pull out the even better controller. My friends, hall sensing, what? It's purple? (people laughing) - [Matt] It's almost like the transparent purple that we tried to get you to get. - This has gone horribly wrong. - I like that though. - Though, this is really cool. So, I've seen this in the past, I've never actually used it before. So, this is essentially a GameCube styled, pro controller for the Switch and the Switch OLED. So unfortunately, I'm gonna cover up my Switch with this. (crew laughing) That's fine. - [Ken] He can't put the Switch in. - [Matt] Nope, nope. This is meant for a regular Switch and not a Switch OLED. Do you want some WD-40? - Boy, get a close up on that. That's a really great tolerance. Can you see how my USB-C fits in there? Hey, does anyone have a Switch OLED in the office I could test? - [Ken] I can grab mine from downstairs. - That'd be great. Can we just double check? The Switch OLED kickstand actually sticks out a little bit. So the regular Switch, if I remember correctly, was pretty much flush on the back, but this one has a little bit of a divot. - [Ken] I think what what you mean to say is Lugia's thick. - Look, so a normal Switch OLED and a normal Switch. - Oh yeah. - The original is a denser plastic, So it's more rigid on its own. Oh, look, look at the time. My Joy-Cons have charged, how convenient. Ready to move on to the next item. Hello friends, I'm back and I've got the solution to all our problems. There's one thing to make that blurry, terrible, ugly image quality on the Switch far better. It's the graphics card. - Huh? - No. - Mm-hm. Hello my friends, and welcome to the mClassic graphics card. Now this, some might call it an HDMI upscaler, which- - 'Cause that's what it is. - Is what might be referred to as an upscaler. However, the esteemed GameStop has clearly described this as a graphics card for Switch, which will make my games look better. And who am I to question the glorious GameStop? Purveyors of fine products and wonderful deals. Game console graphics processor. This is listed on GameStop's website as a graphics card. This is not a graphics card. This is not going to revolutionize your console. You know what? I have seen the light. Did I call this a scam once? Nope, I didn't. In fact, I would say it's a really good product. I'm gonna plug in my HDMI using a handy little extender because this is so powerful it doesn't fit. Oh, oh oh. Silly me. I was so busy gazing upon the glory of these Joy-Cons, I completely forgot. How am I supposed to control my Switch when my Joy-Cons connected to my Switch? That's crazy! You can't do it. No, it's impossible. Now, is there some easy to use accessory that comes with my Switch that I could just attach it and use my Joy-Cons in a slightly more meaningful way? No, there's not, it doesn't exist. Instead I got another controller. There you go, look, it's a Switch controller from PowerA. - [Ken] It looks like it matches the blue screen. - [Austin] Now, my friends, you can see we've got ourselves the Ultimate Switch on an Ultimate OLED. There you go. Suck it Pikachu. - [Matt] You're about to talk a lot of trash and then get destroyed. (screaming) - Is there a Virtual Boy in the back? Oh my God. That was, wow, that was really good. Okay, we don't need that page anymore, which, yeah, oh cool. So, I'll say we could end the video here and some would argue we should end the video here. However, there's one more thing. There's one more thing. What happens when I want a Switch that's a little bit bigger, but not this big, right? 'Cause I'm not gonna, you think I'm gonna get on a plane with this, please. But this is too small to use on an everyday basis. So this. - [Ken] Oh, we gave him a weapon. - Might, wait, no, no, no. - [Kinsey] Is this why you always get stopped on planes? - This is not. - [Ken] This is Austin's second amendment. We get it. - Behold my friends. (crew laughing) The Switch Ultimate experience. The Switch is a 720p display. This is a 768p display. - Wow! - You got literal dozens of additional pixels. - [Matt] Can we upscale this six pixels? - No, actually we're downscaling because the Switch will output 1080p and then it is thrown out the rest of those pixels and it's running at 768p. That's fine. - [Matt] But those thrown out pixels are gonna look absolutely fire. We have diluted the meaning of Ultimate so much in this video. - Hey, look at, look. Wow. - Wow. - Look at the contrast on C right now. - It looks- - Look at the beautiful viewing angles. - [Ken] So, different between the three cameras. - You know what? Do you even trust me to be a conductor right now? - [Matt] I don't trust you to open a jar of pickles right now. - All right, 55. Okay, we are exceeding the speed limit, now. Go, go, go. - Go. - You were, we're overtime. - Woo! Oh, we're in a station. Wait, slow down, slow down, slow down. That's the end, that's the end. Oh, nope, nope, nope, nope. We missed it, okay. Where's Toby McGuire when you need him? (upbeat music) - Good tone. - At least we got good music to go out on. (upbeat music)",
    "transcript_keywords": [
        "Switch OLED",
        "Switch",
        "Ultimate Switch",
        "Ultimate Switch OLED",
        "OLED",
        "clear Switch OLED",
        "JoyCons",
        "regular Switch OLED",
        "Retroflag Ultimate Switch",
        "regular Switch",
        "Switch OLED kickstand",
        "normal Switch OLED",
        "Switch OLED replacement",
        "Ultimate Switch controller",
        "JoyCon",
        "Ultimate",
        "thing",
        "Switch Ultimate",
        "card",
        "Switch controller"
    ],
    "transcript_entity_values": [
        "last night",
        "Lugia's",
        "six",
        "768p",
        "Super Famicom",
        "Joy-Cons",
        "Joy-Con",
        "Ken] Wait",
        "micro SD",
        "the Joy-Con",
        "Switch Ultimate",
        "third",
        "three",
        "Switch Lite",
        "the Joy-Con",
        "two o'clock",
        "first",
        "Nintendo Online",
        "Tokyo Drift",
        "Lugia-powered",
        "Ken",
        "Nintendo",
        "Austin",
        "an hour and a half",
        "GameCube",
        "two",
        "GameStop",
        "the Joy-Cons",
        "a few years",
        "Matt",
        "Switch",
        "two or three hours",
        "four",
        "PCB",
        "Y",
        "HDMI",
        "Ultimate Switch",
        "one",
        "YouTube",
        "second",
        "Bluetooth",
        "55",
        "Pokemon",
        "700",
        "10 minutes",
        "four hours ago",
        "Ultimate",
        "An hour and a half",
        "Smash",
        "mClassic",
        "a couple of hours ago",
        "SD",
        "Switch OLED",
        "the Retroflag Ultimate Switch",
        "these Joy-Cons",
        "1080p",
        "One terabyte",
        "My Joy-Cons",
        "64 gigabyte",
        "a minute",
        "Famicom",
        "17",
        "dozens",
        "Toby McGuire",
        "ExtremeRate",
        "Kinsey",
        "Gilkit",
        "the Ultimate Switch"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "FAC",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "TIME",
        "ORDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "TIME",
        "TIME",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "TIME",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "GPE",
        "ORG"
    ],
    "vector": [
        -0.07720383256673813,
        -0.018965542316436768,
        -0.0038635225500911474,
        -0.009340323507785797,
        0.08198369294404984,
        -0.0047880858182907104,
        -0.010538540780544281,
        0.06865209341049194,
        -0.0015965753700584173,
        -0.014914149418473244,
        0.04984218627214432,
        -0.01854395866394043,
        -0.03899335488677025,
        -0.024383652955293655,
        0.03734482824802399,
        0.033738017082214355,
        0.009605390019714832,
        -0.053906578570604324,
        -0.02079733833670616,
        0.007325233891606331,
        0.007227701134979725,
        -0.08585143089294434,
        0.024351712316274643,
        -0.07511164993047714,
        -0.06586913764476776,
        0.022371450439095497,
        0.03098633699119091,
        -0.01795083098113537,
        -0.02692297473549843,
        -0.10623656958341599,
        0.016755947843194008,
        0.049239881336688995,
        0.028870852664113045,
        -0.003912709653377533,
        -0.036254025995731354,
        -0.13231176137924194,
        -0.013596602715551853,
        -0.1510332226753235,
        -0.011866900138556957,
        -0.0728970542550087,
        0.02883945405483246,
        -0.03051191382110119,
        -0.030970517545938492,
        -0.055763453245162964,
        -0.01933063007891178,
        -0.040131643414497375,
        0.043189313262701035,
        -0.061733320355415344,
        0.05790872499346733,
        -0.009490685537457466,
        0.04255078732967377,
        0.011203397996723652,
        0.007139057386666536,
        -0.09959785640239716,
        0.03481805697083473,
        0.09033916890621185,
        0.0286246407777071,
        -0.029976708814501762,
        0.05669224262237549,
        -0.019147668033838272,
        -0.011741705238819122,
        0.0021123301703482866,
        0.07673490047454834,
        -0.005315676331520081,
        -0.05233931168913841,
        0.02353028580546379,
        -0.007970628328621387,
        -0.040992528200149536,
        -0.009641328826546669,
        -0.08758526295423508,
        -0.05534660071134567,
        0.0346335805952549,
        0.0222264863550663,
        0.010026978328824043,
        0.061863530427217484,
        -0.021346833556890488,
        -0.010245554149150848,
        -0.042680103331804276,
        -0.037226833403110504,
        0.0021689056884497404,
        -0.07694315165281296,
        -0.06833808869123459,
        -0.01773526519536972,
        -0.011237225495278835,
        0.06705378741025925,
        -0.038040582090616226,
        0.045677658170461655,
        0.024264488369226456,
        -0.025165606290102005,
        0.02838573046028614,
        -0.022886795923113823,
        0.0050009507685899734,
        0.028259819373488426,
        0.05040937662124634,
        -0.0005838494980707765,
        -0.046614278107881546,
        0.03206471726298332,
        -0.08592015504837036,
        -0.04433388262987137,
        0.041183244436979294,
        -0.03947946056723595,
        0.0008981321007013321,
        0.06804241985082626,
        -0.04409623146057129,
        -0.013057493604719639,
        -0.055127277970314026,
        0.03451617434620857,
        0.13211216032505035,
        -0.07753998786211014,
        -0.060992274433374405,
        0.048272453248500824,
        0.014023625291883945,
        -0.010103343985974789,
        0.004508955404162407,
        -0.027853580191731453,
        0.03177810460329056,
        -0.058887965977191925,
        -0.0842374712228775,
        0.049864742904901505,
        -0.031517256051301956,
        0.06753454357385635,
        0.025016356259584427,
        -0.04466971382498741,
        0.038859397172927856,
        -0.015454956330358982,
        0.03161250799894333,
        0.05300258845090866,
        1.0502873047284208e-32,
        0.004468461498618126,
        0.007980291731655598,
        -0.049327533692121506,
        -0.043476611375808716,
        -0.03521818667650223,
        0.12557928264141083,
        0.006726370193064213,
        0.03663524240255356,
        0.00914432667195797,
        -0.053629398345947266,
        -0.031900983303785324,
        0.04996557533740997,
        -0.06607554852962494,
        0.03195907175540924,
        0.005849925801157951,
        -0.1417967826128006,
        0.02109445445239544,
        -0.006612229160964489,
        -0.0211148951202631,
        -0.06812058389186859,
        0.08963444083929062,
        0.06026746705174446,
        0.040969181805849075,
        -0.06216774880886078,
        -0.06460887938737869,
        0.11553949117660522,
        -0.03251297026872635,
        -0.0051629566587507725,
        0.09194168448448181,
        0.03218977153301239,
        -0.00959025602787733,
        -0.04382386431097984,
        -0.030992479994893074,
        -0.011586938053369522,
        0.030760489404201508,
        0.06077749282121658,
        0.03209427744150162,
        -0.031166328117251396,
        -0.031629037111997604,
        -0.0018939068540930748,
        -0.04482497647404671,
        0.03076832741498947,
        -0.020480386912822723,
        0.029815247282385826,
        -0.016558492556214333,
        0.03283829614520073,
        0.06055613234639168,
        0.008547301404178143,
        0.00795591901987791,
        0.10248620808124542,
        -0.11911507695913315,
        -0.049187660217285156,
        0.07803954184055328,
        0.009676934219896793,
        0.004285494331270456,
        -0.11128640174865723,
        -0.0029296153225004673,
        -0.01912578195333481,
        0.0525757260620594,
        0.03280924633145332,
        0.032370470464229584,
        0.05181994289159775,
        -0.02086489275097847,
        0.0007469961419701576,
        -0.09460365027189255,
        0.10827918350696564,
        0.052666448056697845,
        -0.0336000882089138,
        -0.09330566227436066,
        -0.028135741129517555,
        0.058655932545661926,
        -0.001926761120557785,
        0.05093646049499512,
        -0.037528444081544876,
        -0.0002439832896925509,
        0.006605127826333046,
        -0.02139127254486084,
        -0.02975178323686123,
        -0.001954159466549754,
        -0.0878133773803711,
        0.03080623596906662,
        0.008288417011499405,
        -0.03840536251664162,
        -0.08486013114452362,
        0.01515714731067419,
        -0.04420175030827522,
        -0.025628283619880676,
        0.013604295440018177,
        -0.09125585108995438,
        0.01631953939795494,
        -0.028298495337367058,
        -0.0002808355202432722,
        0.08321257680654526,
        0.05751650780439377,
        0.052003055810928345,
        -9.679528151293477e-33,
        0.03063630498945713,
        -0.08123171329498291,
        0.05211644992232323,
        0.04699501767754555,
        -0.02191741392016411,
        0.013198897242546082,
        0.0596512146294117,
        0.08009324222803116,
        0.022382039576768875,
        -0.03762442246079445,
        0.009738883934915066,
        0.021543879061937332,
        -0.049923814833164215,
        -0.07502097636461258,
        -0.011325503699481487,
        -0.013738376088440418,
        -0.007693740539252758,
        -0.03943628817796707,
        0.052905451506376266,
        0.04508642479777336,
        -0.0500970259308815,
        0.07269369065761566,
        -0.06079045683145523,
        0.015920495614409447,
        0.024608729407191277,
        0.09753326326608658,
        0.05851898714900017,
        0.005975303705781698,
        0.051860496401786804,
        0.026094356551766396,
        -0.022353539243340492,
        0.019778449088335037,
        -0.032794710248708725,
        0.10650821775197983,
        0.06610459834337234,
        -0.002722795121371746,
        0.10262811183929443,
        0.017690222710371017,
        -0.0787011981010437,
        -0.05440771207213402,
        -0.03147817775607109,
        -0.018850082531571388,
        -0.019333569332957268,
        0.009535698220133781,
        0.07700648903846741,
        0.04628067836165428,
        -0.054624561220407486,
        -0.056459520012140274,
        -0.031711332499980927,
        0.05137920752167702,
        -0.025981741026043892,
        0.01122694555670023,
        0.032090891152620316,
        -0.05425824597477913,
        -0.03686024993658066,
        -0.05114419758319855,
        -0.041446272283792496,
        0.08003886044025421,
        0.0228201262652874,
        -0.059041157364845276,
        0.08865619450807571,
        -0.028590040281414986,
        -0.0034532099962234497,
        -0.11594535410404205,
        0.023239051923155785,
        -0.039854951202869415,
        0.10850652307271957,
        0.005117533728480339,
        0.05887351930141449,
        -0.027404682710766792,
        -0.03127675503492355,
        -0.022395655512809753,
        0.017773112282156944,
        -0.15437647700309753,
        0.01771687902510166,
        0.02896522730588913,
        0.0119053665548563,
        -0.006775613874197006,
        0.018102817237377167,
        -0.021752098575234413,
        -0.024723809212446213,
        -0.050699811428785324,
        0.05602892115712166,
        0.008763350546360016,
        -0.0050966693088412285,
        -0.006229446269571781,
        -0.012854298576712608,
        0.01388476137071848,
        0.015466318465769291,
        0.025427114218473434,
        -0.12531547248363495,
        0.028058309108018875,
        0.0008655146230012178,
        0.10030500590801239,
        0.023472381755709648,
        -6.410748198959482e-08,
        0.01785966008901596,
        0.04579582065343857,
        0.03266878426074982,
        0.029189512133598328,
        0.07674812525510788,
        -0.08315073698759079,
        -0.004830008838325739,
        -0.002606810536235571,
        -0.041929006576538086,
        -0.10318473726511002,
        0.05205116420984268,
        0.036781564354896545,
        0.028904186561703682,
        -0.02622411772608757,
        0.11440293490886688,
        0.02520247921347618,
        -0.05187634751200676,
        0.04759901016950607,
        0.013556066900491714,
        0.01377917267382145,
        -0.05288179591298103,
        0.021399304270744324,
        0.05384504422545433,
        -0.11664584279060364,
        -0.039815519005060196,
        0.055408772081136703,
        0.022979188710451126,
        0.032588761299848557,
        0.05336073786020279,
        -0.0868280678987503,
        0.012029768899083138,
        -0.04062514752149582,
        0.019890913739800453,
        0.043936897069215775,
        0.033025577664375305,
        -0.02581251785159111,
        -0.014843459241092205,
        0.03278344124555588,
        0.023982537910342216,
        0.015579832717776299,
        0.006806342396885157,
        -0.06003809720277786,
        -0.06917048245668411,
        0.01491925586014986,
        -0.005946041084825993,
        -0.06670594215393066,
        0.0518624410033226,
        0.02489846758544445,
        -0.0039723883382976055,
        0.04050087928771973,
        -0.044838257133960724,
        -0.02317936159670353,
        -0.0858594998717308,
        0.04227733239531517,
        0.04930288717150688,
        -0.03610675781965256,
        0.0034059600438922644,
        0.031780846416950226,
        -0.06440174579620361,
        0.08797262609004974,
        0.10620886832475662,
        -0.04155374690890312,
        -0.12275076657533646,
        0.11917122453451157
    ]
}