{
    "id": "cnuSQYve6ZA",
    "title": "Big Laptop Go Fast - AORUS 17X",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-02-21T20:30:24Z",
    "video_url": "https://www.youtube.com/watch?v=cnuSQYve6ZA",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "laptop",
        "gaming",
        "aorus",
        "4090",
        "streaming"
    ],
    "views": 348703,
    "likes": 12103,
    "comments_count": 619,
    "description": "Thanks AORUS for sponsoring todays video! Check out the AORUS 17X Gaming Laptop at   We finally received a laptop with a RTX 4090 Mobile inside and we're stoked to take a peek at what kind of performance we can expect. Join Alex as we dive into AORUS' latest laptop offering!  Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   OUR WAN PODCAST GEAR:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 BIG BOI BOX 0:26 What's inside? 1:35 I/O, weight, build quality 3:15 RGB on RGB 6:11 Valheim 7:37 DOOM Eternal 9:35 Labs Testing Results 11:34 Speakers/Webcam 12:41 Teardown time",
    "description_links": [
        "http://bit.ly/3YuhmXK",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/masponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Wow, this is the biggest box we've had in a while. This thing is freaking massive, how heavy is this thing? Well, I can tell you for sure it is one heck of a laptop. This right here is the AORUS 17X and it has an RTX 4090 and a first one we've seen here. Security seal's already broken. That's 'cause labs had a little look at it. \"Team up, fight on.\" Oh and also this is sponsored by AORUS, thanks guys. Let's have a look here. (box shuffling) Let's go over here first. This thing is 330 watts gallium nitride. So like you have seen chargers that are this big before but not this dense, this thing, (table clanks) actual weapon. (laughs) Okay. Nope. What do we have in here? Warranty card, quick start guide. Is it plug it in, turn it on? Yep, plug it in, hit the power button, thank you guys. Wow this is not a light laptop that you got us here Jeff. Oh, can you see all the different colors that this AORUS logo is changing to? That's pretty cool. And overall the design is very gamer. It's not like quite as over the top as some stuff that we've seen in the past. They say it's space themed and they are certainly accurate there. Also look at the amount of copper that you can see here. That right there, you take that to the scrapyard and you can get a pretty penny or two. Anyway, let's have a look at the IO here. So we have headphone, microphone combo jack, two USB type A's, around back we have ethernet. Not sure if it's 2.5 or gigabit. We'll put that right here, hopefully 2.5. We also have display port out. I really do appreciate mini display port. It seems kind of a little bit like a weird one but it can be very nice for VR headsets. HDMI 2.1, our power in. And around the other side we have thunderbolt four and another type A. 6.5 pounds, yeah that is an exceptionally heavy laptop. It's pretty thin though given, like it's not bad. Oh, apparently the chassis' been redesigned and it's all CNC'd aluminum now. And the overall chassis rigidity here seems really good. You can get some like if I really push on it, some flexing, but it's nothing that you're gonna notice unless you're really given her. The way that they've designed the chassis here is a little bit interesting. They have this sort of step down to the keyboard which is nice because it doesn't smack in the display but it does leave not quite as much space as I'd like to see for the track pad. To be clears, still nice large track pad and they did put their little AORUS logo on there, you can see the that in the the correct light. But this is a massive device, they could put a much bigger one on here. How does it work though? Well we're gonna find out after, wait, I don't have to tell you about our sponsor 'cause it's a Gigabite. - [Jeff] (laughs) AORUS. - Ah, same thing. You said there's RGB back here, where? Oh right there, I see. It's like RGB on the RGB thing. You have analog and digital RGB. Okay, we're in here, let's see how it all feels. Notepad. (keyboard clacking) Keyboard is really good. Now it's a little bit on the soft side but it does have a really nice actuation and it doesn't have any bad, like look here, you can push the side of the key and the key still actuates instead of like the whole thing just sort of goin wah. It is quite well done. I personally for typing would like something that's a little bit snappier but this is primarily a gaming laptop so having something that's a little bit more linear, a little bit softer is nice 'cause you're gonna be just like holding down W for a super long time or whatever. Those stupid games that don't have auto run. The track pad also is fantastic. Again, it's not quite as large as I would've liked on something like this, but when I'm using it I don't really care. I didn't even need hand lube and it already just feels great. So nice and smooth to go around on. No tracking issues at all and the click feels nice and good. It's even pretty satisfying here, like. (keyboard clacking) Good job. The display also is fantastic. So 1440p, 240 hertz, pretty much as good as you can get on a laptop. I do really wish that they had 16 by 10. Just bring her down there a little bit. I would've liked it, but you can get away with 16 by 9 on a display that is just this big. Again, 240 hertz, this is probably gonna be wicked to game on. And here we have the I913 950HX. That is 24 CPU cores at 5.5 gigahertz maxim, that is mental. Also 32 gigabytes of DDR5 at 5,600 mega transfers per second. One terabyte SSD made by Gigabyte, makes sense. And another one terabyte SSD, also made by Gigabyte. For wifi we have Intel wifi 6E, love to see it. And of course the Nvidia RTX 49. This thing goes up to 175 watts on the GPU which is as much as Nvidia will let you put in your bios. You can cool it better and they probably do but Nvidia won't let you have more. Oh, also had 16 gigabytes of GPU memory. So you should remember that the 4090 in a laptop is not a 4090 on the desktop. This right here is the same dye as the 4080 but at the same time like you've seen the size of the coolers on the 4090, there's no way that could exist in something like this without it turning into, I don't know, a star or something. Anyway, I wanna play \"Valheim\". Oh yeah that looks good. We've been doing so many stupid thin and lights lately. It's so nice to have a laptop that actually can do this. So we're getting 85 FPS Quad hd while recording it, so screen recording, that is important to note. And this thing right here no trouble at all playing this game. Now it should be noted that we are in the Balanced profile so you might be able to in the future get a little bit more out of this. But for now you can't and we'll explain that later. Anyway for now, I want to hit this deer with some fire. Nevermind he's running away from me, that is wise Mr. Deer. Anyway plays \"Valheim\" just fine and a 70 FPS when it's a little bit more stuff around you, but that's pretty good. How does playing something a bit more challenging? Oh we just saw that down in the corner there and it said \"Display Mode GPU Only\". That is because this has Nvidia Advanced Optimus and that allows your GPU to connect directly to the panel instead of, in some gaming laptops it will go dedicated GPU, integrated GPU, panel, and you can lose like 10, 15% of your gaming performance by doing it that way. So love to see if they did it correctly. Apparently it is very expensive to license from Nvidia. Alright, so 1440p, ultra nightmare. We are currently looking at 250, 240, 260 FPS, somewhere right around there. Yeah, this thing is a good laptop to play \"Doom\" on, that is for sure. 240 Hertz panel means that even though I'm pretty bad, I am nowhere near as bad as I would be on other laptops, that is for sure. Yeah, this is about as good as you can get for something like this. Who would've thought 4090 in a laptop, 240 hertz panel, it's good for gaming. Now, although this is about as good of a gaming experience as you can get, there is a bit of a problem. Now we are currently at 240 FPS. Let's see what happens when I unplug the power. (laughs) Oh, that's worse than I thought it would be. We are now at 30 FPS. So yeah, going from 250 FPS plugged in to 30 FPS which I think Nvidia might be artificially limiting, but yeah, this is not the same gaming experience. We just, yeah, completely different laptop right now. Not even remotely in the same league as what we were just experiencing. Let's see, I'll put this back in, will it come right back? Oh, 40, 160, 200, 240, okay and now it's back. So yeah, it will very quickly return to its normal power limits when you plug in the charger. But that is pretty disappointing that it just completely poops itself when you take the charger out. Which I feel like is going to get fixed in the future. And I say that because a lot of this laptop currently seems like it's a a little bit broken. Now for the most part that isn't going to matter because for the time being you're going to go to the power mode here in Windows, make sure it is on balanced. This is crucial because for whatever reason, better performance, gigabytes, turbo profiles, so on, yeah, they're broken. So if we look at the lab's testing data that we have here, first of all we can confirm, very fast laptop, exceptionally fast. Turns out 4090 in here does a good job. Problem is, so if we have it in Best Performance Mode, we'll just use \"Forza Horizon\" as our example, but it's consistent across \"Modern Warfare 2\" and \"Cyber Punk 2077\" as well. So Best Performance Mode, the one that you would think it would perform the best in, We got 94 FPS, Balanced Mode, 109, and then we use Gigabytes AI, auto overclocking boost and it's 102. Game boost, even worse, 94 FPS. So strangely, Balanced Mode is by far the best mode to have this in. And I think it's just simple firmware problems. This right here, very early. So many people are always like, \"Oh you guys get the press samples, those are the best ones.\" No, those are the very first ones to come off the production line and they're normally broken. So that's what I think's going on here. That said, this is a very easy firmware update to fix, and with any luck Gigabyte will have a firmware update here, down there in the description. I don't know, hopefully it's there, we'll see. What I also want to see is how good the speakers are. (upbeat electronic music) Sounds a bit loud, but kind of thin. I'm suspicious there won't be much in the drop. Well everyone back there is dancing but I don't know that's what, like a B minus maybe. Whatever, it's a laptop just get other speakers. You could afford this thing. You can afford a hundred dollar bluetooth speaker to go with it. What else do we have here? Oh, webcam. Now we've got here looks a little bit on the grainy side, that is for sure. This right here is what, 720p I am guessing? No, no, 1080p, coulda fooled me. It seems like it's struggling a bit. I am very grainy but at the same time I look fairly natural. Let's see, does it improve if I kinda, this is a pretty challenging scene. It is exposing well for my face, it is just exceptionally grainy. That said, I am incredibly happy that they were able to get Windows Hello Facial recognition in on this thing. Not something you normally see on gaming laptops and love to see it on here. Alright, let's take it apart. (video whirring) A bunch of T6 screws later and we are in. Now do note there are different size screws in here so make sure to put them on like a tray or something like this to keep track of where they go. 'Cause if you put one that's too long in the hole of one that's too small you will go through your laptop, ask me how I know that. Wow, that is a cooling system right there. Big, old vapor chamber all the way right along here. And then some heat pipes to get that heat extra far down. Four fans, two big boys, two little ones, and just so much copper heatsink, going all the way down here and along up there. We do fortunately have upgradeable memory. So in the past 4,800 mega transfers per second was as fast as you could get unless you soldered it down. Now with new 13th gen processors you can get 5,600 mega transfers per second and you can just put it right in your palm like, okay, that was a thermal pad on the bottom that was a little bit difficult, but you can have it in the palm of your hand just like that. Also in here we have easy access to our two SSDs, and is this a 99 watt hour battery? Do, do, do, yep, 99 watt hours right there, perfect. That is as large of a battery as you can put in the laptop and legally take it on a plane, so love to see that. I'm guessing there's a lot of performance in this machine. So what do they claim the battery life is? Well, I wasn't able to find any claims of battery life on their website, which means it's probably terrible. But the good news is with that massive charger you can get 50% battery in just 30 minutes by plugging it in, so you are good off there. So just look at how much mesh there is on this bottom. Lots and lots of air can go through here to their wind force infinity stuff. I like it, I really like the rockhopper. Anyway Jeff, hit me with the price, 4090, 13th Gen, I know these things are just ridiculous. How much damage will this do to your wallet? Generational debt? - [Jeff] 3,500 USD. - Oh okay, 3,500 USD, honestly better than I was expecting given some of the prices that I've seen. Still a lot of money to spend on a gaming laptop. I'm not gonna comment on the value because well for one is a sponsored video. And also this is the first 4090 laptop we've properly tested. But it is one heck of a gaming beast, that is for sure. And huge thanks to AORUS for sponsoring this video. So if you like this video hit like, get subscribed, and just have a fantastic old day. Go play your favorite game or something. Or don't, I don't care, just have a good day.",
    "transcript_keywords": [
        "laptop",
        "bit",
        "good",
        "FPS",
        "thing",
        "AORUS",
        "Mode",
        "pretty",
        "gaming",
        "yeah",
        "put",
        "Nvidia",
        "GPU",
        "nice",
        "Display Mode GPU",
        "display",
        "biggest box",
        "Balanced Mode",
        "gaming laptop",
        "gigabytes"
    ],
    "transcript_entity_values": [
        "24",
        "99 watt hours",
        "USB",
        "Doom",
        "160",
        "Deer",
        "just 30 minutes",
        "32 gigabytes",
        "10",
        "IO",
        "Nvidia",
        "2.5",
        "4080",
        "30",
        "50%",
        "Modern Warfare 2",
        "102",
        "RGB",
        "5.5 gigahertz",
        "4090",
        "16 gigabytes",
        "Valheim",
        "FPS",
        "hundred dollar",
        "Hertz",
        "Balanced Mode",
        "Gigabyte",
        "9",
        "40",
        "Jeff",
        "240 hertz",
        "a good day",
        "first",
        "AORUS",
        "two",
        "10, 15%",
        "GPU",
        "109",
        "330",
        "3,500 USD",
        "250",
        "CPU",
        "2.1",
        "30 FPS",
        "SSD",
        "240 FPS",
        "Gigabite",
        "49",
        "260",
        "second",
        "200",
        "13th",
        "175 watts",
        "4,800",
        "Balanced Mode",
        "Gigabyte",
        "70 FPS",
        "hertz",
        "6E",
        "4090",
        "94",
        "Windows",
        "Intel",
        "One",
        "Display Mode GPU",
        "240",
        "Gigabytes AI",
        "99 watt hour",
        "5,600",
        "Best Performance Mode",
        "Four",
        "85",
        "16",
        "four",
        "RGB",
        "T6",
        "Forza Horizon",
        "FPS Quad hd"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "TIME",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "LOC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "WORK_OF_ART",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG"
    ],
    "vector": [
        -0.052802007645368576,
        -0.018196972087025642,
        0.006108232773840427,
        -0.053807713091373444,
        0.09862794727087021,
        0.0028241577092558146,
        -0.022414615377783775,
        0.002667879918590188,
        -0.03414110094308853,
        0.008705801330506802,
        0.014134807512164116,
        0.05178983882069588,
        0.025906149297952652,
        -0.0068813953548669815,
        0.04522835835814476,
        -0.03202172741293907,
        0.08286537975072861,
        -0.12832129001617432,
        -0.022881634533405304,
        -0.05182074010372162,
        -0.03829449787735939,
        -0.07098300009965897,
        0.01604565419256687,
        -0.044311873614788055,
        0.04015111178159714,
        -0.036443356424570084,
        -0.005707345902919769,
        -0.05317392200231552,
        -0.02434876188635826,
        -0.05947974696755409,
        0.02063033916056156,
        0.07514326274394989,
        -0.024357449263334274,
        -0.023676583543419838,
        -0.045900363475084305,
        -0.07619018107652664,
        -0.029400277882814407,
        -0.0783410295844078,
        -0.02236015908420086,
        -0.07337299734354019,
        -0.0008364481618627906,
        -0.05757267028093338,
        0.019686048850417137,
        0.004726195242255926,
        0.03130023181438446,
        -0.10040480643510818,
        0.0006944398046471179,
        -0.035019662231206894,
        0.004256463143974543,
        0.08027803152799606,
        -0.03222337365150452,
        -0.032862480729818344,
        0.02214163914322853,
        -0.020780708640813828,
        -0.12019041925668716,
        0.014590330421924591,
        0.008428576402366161,
        -0.012524519115686417,
        0.005412933882325888,
        -0.039201848208904266,
        0.060935162007808685,
        -0.09052606672048569,
        -0.04001675173640251,
        0.06285472959280014,
        -0.05016249418258667,
        -0.04529543220996857,
        0.032747626304626465,
        0.05471941456198692,
        -0.020189903676509857,
        0.03349796310067177,
        0.025770403444767,
        0.07709287852048874,
        0.02386474423110485,
        0.0729416236281395,
        0.028480835258960724,
        -0.008357061073184013,
        0.06730102002620697,
        -0.0553964227437973,
        0.01691002957522869,
        0.0381142795085907,
        0.036834198981523514,
        -0.046023424714803696,
        -0.023832719773054123,
        -0.011649186722934246,
        0.01681419648230076,
        -0.05887824296951294,
        0.04550753906369209,
        0.0003333424683660269,
        -0.06402554363012314,
        -0.08520524203777313,
        -0.03140142932534218,
        0.07893010228872299,
        0.04439428448677063,
        0.026917649433016777,
        -0.027097752317786217,
        2.3981049253052333e-06,
        0.00025050510885193944,
        -0.08262814581394196,
        -0.06663507968187332,
        0.07664377242326736,
        0.015451147221028805,
        0.07694856822490692,
        0.04669078066945076,
        0.013226992450654507,
        -0.10257699340581894,
        -0.06819414347410202,
        0.013056790456175804,
        0.07375168800354004,
        -0.010295508429408073,
        -0.02427448146045208,
        -0.03991125896573067,
        0.07170724123716354,
        -0.04056372493505478,
        -0.048678215593099594,
        -0.011662174016237259,
        0.0420541986823082,
        -0.05304985120892525,
        0.01669500023126602,
        0.09528714418411255,
        -0.015224279835820198,
        -0.052925124764442444,
        -0.03509313985705376,
        -0.015186929143965244,
        0.026753943413496017,
        0.05446470528841019,
        0.021657103672623634,
        -0.07085387408733368,
        3.332190366665247e-34,
        -0.012931747362017632,
        -0.012441927567124367,
        -0.06309797614812851,
        -0.03543996810913086,
        0.06618738919496536,
        0.0018794393399730325,
        0.004641283769160509,
        -0.03843383863568306,
        -0.06484328955411911,
        0.010414541698992252,
        -0.08405409008264542,
        0.016026806086301804,
        -0.04459935426712036,
        0.05930253490805626,
        0.07944884896278381,
        -0.13642607629299164,
        -0.010177252814173698,
        0.05468247830867767,
        -0.0928063914179802,
        0.038654107600450516,
        0.04012785851955414,
        -0.011002136394381523,
        -0.015457221306860447,
        -0.03125990554690361,
        0.0790356993675232,
        0.056381285190582275,
        0.010954279452562332,
        0.0064941514283418655,
        0.054875053465366364,
        0.058567311614751816,
        -0.056405339390039444,
        -0.057532794773578644,
        -0.08232613652944565,
        -0.08957163989543915,
        -0.018764525651931763,
        -0.01602582447230816,
        -0.10004615783691406,
        -0.09021724760532379,
        0.0944380983710289,
        -0.041162747889757156,
        -0.02265450730919838,
        0.052994705736637115,
        -0.10146183520555496,
        -0.12084033340215683,
        -0.08161528408527374,
        0.03877083584666252,
        0.028723489493131638,
        0.03777601942420006,
        0.03512803837656975,
        0.017739232629537582,
        -0.07281871140003204,
        0.03810080513358116,
        -0.09494058787822723,
        -0.06698105484247208,
        0.018727434799075127,
        -0.057103969156742096,
        0.009221202693879604,
        0.013784891925752163,
        0.09368930757045746,
        0.08766639977693558,
        0.08365026861429214,
        -0.003012616652995348,
        -0.0068459478206932545,
        -0.0036466382443904877,
        -0.10406481474637985,
        0.06437157094478607,
        0.09735899418592453,
        -0.057687558233737946,
        -0.028156308457255363,
        -0.014404527842998505,
        -0.005090709310024977,
        -0.021756358444690704,
        0.07919533550739288,
        -0.09535825997591019,
        0.0970744863152504,
        0.03333662450313568,
        -0.056436583399772644,
        -0.04526685178279877,
        -0.01086004264652729,
        -0.013120701536536217,
        -0.06880621612071991,
        -0.004068776965141296,
        0.044905249029397964,
        -0.01094978116452694,
        -0.008778299205005169,
        0.03344451263546944,
        -0.015062261372804642,
        -0.04804800823330879,
        -0.031907059252262115,
        0.07144798338413239,
        -0.062323302030563354,
        0.01032870914787054,
        -0.03142174705862999,
        0.021128132939338684,
        -0.07691147178411484,
        -3.6785211244602326e-33,
        -0.0034173124004155397,
        0.011614404618740082,
        -0.04637317731976509,
        0.004610226955264807,
        0.017972571775317192,
        0.007401731330901384,
        0.026315515860915184,
        0.10232580453157425,
        0.0037079541943967342,
        -0.029296550899744034,
        0.03736882656812668,
        0.031369343400001526,
        -0.09218250960111618,
        -0.031810492277145386,
        0.03933936730027199,
        -0.10334835201501846,
        0.09094025939702988,
        -0.052425842732191086,
        0.008528036065399647,
        -0.02429257519543171,
        0.057021576911211014,
        0.033434879034757614,
        0.02870854176580906,
        0.07407542318105698,
        0.0058998242020606995,
        -0.00792286079376936,
        0.03843157738447189,
        0.04081591218709946,
        -0.03476633504033089,
        -0.02563534677028656,
        -0.05327264219522476,
        -0.0686987116932869,
        0.00273590418510139,
        0.05167876556515694,
        0.09072011709213257,
        -0.005601441953331232,
        0.07933838665485382,
        0.03952508792281151,
        -0.0459105521440506,
        0.007209336385130882,
        0.10057704895734787,
        -0.013207655400037766,
        -0.00877378135919571,
        -0.031366001814603806,
        0.01637653075158596,
        -0.0623200498521328,
        -0.08362854272127151,
        -0.06817596405744553,
        0.02564028464257717,
        -0.039394013583660126,
        0.007435478735715151,
        -0.029682179912924767,
        0.092937171459198,
        -0.01588287390768528,
        -0.004377459175884724,
        -0.02752053737640381,
        -0.0638631209731102,
        0.030487842857837677,
        0.007286377716809511,
        -0.025825943797826767,
        0.026581255719065666,
        0.0021904397290199995,
        -0.025616757571697235,
        0.0014692515833303332,
        0.03191354125738144,
        -0.02924412675201893,
        0.0402967669069767,
        0.004305866546928883,
        -0.02419937029480934,
        0.003634038148447871,
        -0.0715484470129013,
        -0.015072647482156754,
        -0.017751717939972878,
        0.007292174734175205,
        -0.0006324996938928962,
        0.011522943153977394,
        0.04036997631192207,
        -0.0034219888038933277,
        0.03330070525407791,
        -0.052523527294397354,
        -0.03421209752559662,
        0.048240240663290024,
        0.01159223448485136,
        -0.02433771640062332,
        0.03691091760993004,
        0.030737685039639473,
        -0.015452481806278229,
        -0.03450074419379234,
        0.01060399878770113,
        0.04033336788415909,
        0.0021570995450019836,
        0.04884319379925728,
        -0.033397749066352844,
        0.02450539730489254,
        0.06240596994757652,
        -5.547386194848514e-08,
        -0.05571978911757469,
        0.04881571605801582,
        0.024096457287669182,
        0.09131249785423279,
        -0.0714515820145607,
        -0.0749916136264801,
        0.054048534482717514,
        -0.027463339269161224,
        0.0950084701180458,
        0.004552952945232391,
        0.07830844074487686,
        -0.10492471605539322,
        -0.0014437319478020072,
        0.006946703419089317,
        -0.004169950261712074,
        -0.0019672352354973555,
        -0.05389396473765373,
        0.06124139949679375,
        -0.02647116221487522,
        -0.03681979328393936,
        -0.005235997028648853,
        0.0709969699382782,
        0.14217355847358704,
        -0.03097142092883587,
        0.04017339274287224,
        0.0673232227563858,
        -0.014162714593112469,
        -0.002229726407676935,
        0.1125066876411438,
        -0.06124380603432655,
        -0.11631309986114502,
        -0.0034037139266729355,
        -0.056708965450525284,
        -0.02285097725689411,
        -0.0020797632168978453,
        -0.02919543907046318,
        -0.01572420448064804,
        0.06034838408231735,
        0.09565959125757217,
        0.06406828761100769,
        -0.022855395451188087,
        -0.02567387744784355,
        0.020190821960568428,
        0.02062675915658474,
        0.05463872104883194,
        0.0020580627024173737,
        -0.0256491806358099,
        -0.07273688167333603,
        0.022143082693219185,
        -0.030206384137272835,
        -0.03820300102233887,
        0.0008559053530916572,
        -0.03568800538778305,
        0.021866947412490845,
        0.03120838850736618,
        -0.03934087976813316,
        -0.04072175920009613,
        0.031223691999912262,
        0.009472236968576908,
        0.058786503970623016,
        0.08527125418186188,
        -0.1046421229839325,
        -0.07866336405277252,
        0.08856052905321121
    ]
}