{
    "id": "cQgcTkXacAc",
    "title": "Once again I attempt to add polish to LED holiday lights",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2021-11-30T15:47:41Z",
    "video_url": "https://www.youtube.com/watch?v=cQgcTkXacAc",
    "category": "Science & Technology",
    "tags": [],
    "views": 659896,
    "likes": 38474,
    "comments_count": 4086,
    "description": "What a strange tradition.  Links 'n' stuff: If any of you want to take a look a Tru-Tone's products, here's a link to their site. Unfortunately they're sold out of a lot as of the time of posting this video.  Technology Connections on Twitter:  The TC Subreddit   This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!   Oh, and look at these wonderful patrons!   Aaron Nichols, A_Spec , Paul Z, Anthony Castelli, PrettyTarable, Evin Sellin, Tony Drake, Zachariah Elliott, Jacob Jernigan, Travis, Isaac Oxendale, kyle, Ryan the Human, Sean King, Martin Wilson, Rad , Syswrek, Brian Roediger, Andrew Newton, Kas, S. C., Randall, Ian Washish, Neil Sly, Connor Crowley, the-alchemist , Neil Enns, Robert Lavery, Lettow , Brian Place, monoirre , Roland Roberts, Kurt Yun-Doyle, Jaap van Muijden, Dave Plummer, Anatoly Tishaninov, Michal Hona, Dan Coster, Tyler Young, naota3k , James Hartnett, Laketri, Logan Koch, Patrick Neary, Andrew Larson, Trevor Powell, Your name isnt the longest anymore but you can still feel smug because it IS higher than mine, Dan Stark, Danny Griffin, Cale Sugg, Philip , Tristen Locklin, Spirit Bear, GigaDan , Simon , Jeffrey McGlinn, Richard Walker, Amir Omidi, Robert Gilbert, Christopher McKeen, Austin Griffith, Sophie Wagner, Marc Chametzky, Mike Menzel, Matt Nunes-Spraggs, Blythy, Cameron Duncan, Madellyn S, Javier Marinkovic, Dahip95, Five-Toed Sloth Bear, Josh Rawls, Kevin Copeland, ZeosPantera, Joseph Schmigel, Harald Dehner, Bob D'Errico, Bill Wert, Brian Lalonde, John Kuras, Alabammy Skwirl, Ben Axford, Joshua Shearer, Justin Ward, Steven Almanzar, Marco Eberhard, Benjamin Mitchell, VerySerious, Patrick Herke, TecknicGamer, Jonathan Reilly, Schuyler Thompson, Nick Evans, Vojtech Trefny, Kevin Trippel, Nick Dawson, Morerandom, Kendric Evans, Sandy Anthis, Dean Gallea, Christian Lwel, Sathale, Scott Stokes, Eric Shalosky, Krzysztof Parzyszek, Connor Nicholson,  , Adam Korman, Justin Voss, Richard Ertel, Zeta Grey, Anthony Murray, Eric Bridgeford, Andrew Swab, Tibor Kovcs, Lori Reeder, Kevin Maher, Colm Byrne, Patrick McCarron, Hector Martin, William Hilton, Frans Sturmans, Thomas Wright, Matt Barber, Brian Zimmerman, Clinton Peterson, Kenneth Garrett, Phil Roberts, Peter, Rob C, John Dye, Ryan Stenhouse, Hannah Ward, Tiziano Santoro, Aubron Wood, Tyler Nichols, Deaf Naked Hipster, Eric Wood, Jordan Stewart, Christian Pionke, Zach, Sethkj, Andreas G, Trevers Astheimer, Tommy D, Brad Meiser, Russell Peto, Bruce Petty, Myles Johnson, Michael Blazicevich, Eric Barch, Carlo B, Scott Reynolds, augs, Random Jones, thoughtdreams, Hexapuma, Ryan McQuillen, Jordan Byron, Christy Ramsey, Seth , June Redmer, Nick Wharff, Harrison Diamond, Pat Stahl, Natalie Cummins, PAC, Eelke, Jason White, Anthony Gargiulo, Tommy Hetrick, Zach Hartman, Mike Litoris, Leeo, Paul Stoetzer, Austin Crawford, Microwaive, Haze Skunk, crafty_geek , Andrew Conner, Keith Burzinski, Nick Gordon, Owen Lane, Anton Markov, Katherine Huffman, Peter Hing, Kyle Cuzzort, Ross Vegas, Seth Hensinger",
    "description_links": [
        "https://tru-tone.com/",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Its time. [claps twice] Hello and welcome to the final installment of this years No Effort November. Once again Im testing various ways to fix the horrors of modern LED christmaholiday lights. Since its been a couple of years since Ive done this and the channel has grown a lot since then, allow me to fill you in on this madness. I love Christmas lights. I dont go all out like Clark Griswold does but decorating with electric lights on strings has always been perhaps my favorite part of the holiday season. I also like LEDs. The light emitting diode is a fantastic invention and its only been getting better and better. Except... in this particular application where they make my eyes burn because apparently people are still impressed by copious amounts of monochromatic blue and havent realized how hideous it is yet. Now, white lights? Weve got these down pretty good. Well, except for the fact that we still only put a few diodes in the circuit on one end to protect the lights from reverse current flow and thus theyre only half-wave rectified. I can see that these are pulsing just looking at them. Its even worse in my peripheral vision. That still needs work no doubt but this color is a fine warm-white, particularly when you consider how dirt cheap these are. You would think that somebody in charge of the manufacturing of mass-market Christmas lights would think to themselves Hey, what if we just made a whole bunch of white LEDs, you know like in the days when lights were always white? And then to give them color we put differently-colored caps over them to filter that light and make colors the ol' fashioned way? That might even cost a little less because then we could just make 12 trillion white LEDs instead of 6 trillion white ones and then 1 trillion each of a bunch of other colors. Much to my chagrin that still hasnt happened, so Ive been sticking to incandescent lights for my multi-colored needs. But in the meantime, Ive been testing various methods of hand-coloring the lights and here we are yet again. In 2018 I tried using ordinary paints. I was hoping to use something that was pigmented rather than dye-based for colorfastness. That just didnt work at all because it was too hard to get the correct coat thickness. But, I discovered that just coloring the bulbs with Sharpies did a pretty good job at replicating the look of incandescent light sets. However, those lights quickly faded in the Western sun. Only a month (of the shortest days of the year, mind you) made them pretty dull. I mean, I really wasnt expecting much in the way of longevity but hoped for a little better than that. In 2019 I tried transparent model paints. That appeared to work a treat except for the fact that my bottle of yellow paint was apparently super old and wasnt working well. I ended up mixing in just a smidge of red paint and this improved the color quite a bit. I dont remember if I ever did what I meant to do and put a video up on Conenxtras about how well they held up over the wait. I can just look into that. Wow, I did, apparently! Heh, look at that. Uh, but so that everyone knows, they actually held up quite well. In fact, here they are! I couldnt even notice a color difference between the half that got a UV protective clear coat and the half that didnt. Oh right, I did that, too. So, whats in store for this year? Well a few things. But first! I ran to Warrlllmart to get some plain white lights for 'sperimenting on and for giggles got this matching set of colored lights to see if I could maybe swap the caps over. Sometimes thats possible but its really hit or miss, but folks I might be able to tolerate these. For one, I didnt notice in the store that this is the objectively supreme combo of red, green, blue, and yellow with none of that orange, pink, teal, magenta, or purple nonsense but also this yellow isnt a monochromatic yellow. Thats a white diode under a yellow cap! So it actually pops in brightness, just like the old sets. Were the way there! The blue, green, and red are still monochromatic but this is real progress. Whats more, in the last video I said I probably wouldnt mind LED sets that much if they could just tone down the blue and well they didnt tone it down on any individual light but they reduced the number of them in a set! There are fewer blue lights in these strands than the other colors, and honestly? I plugged these in and thought I could deal with this. Now Ive since returned to the store and can report that regrettably its only these 50 light sets that are like this the 100 light sets had orange, too, but I didnt plug them in to judge them. Actually its real slim pickins at my local Warrrlllmart this year but anyway Im just saying that this combo aint half bad. Still, this aint gonna stop me from seeking perfection. Remember, this is what I want to emulate. These beautiful sets of mini-lights. Given that transparent model paint was the winner last year, I ordered a couple of different varieties of transparent craft paints to see if they might be any better. They were not. I gave up with this set after realizing this was a finicky pain, and while the other set of paints was much more promising it was also quite thin and would have required multiple coats to get a good color. If this were any other month I might have stuck with it but no. Actually if I do this again Im gonna get an airbrush and try applying the paint that way because I think that might solve a lot of headaches but anyway... I also tried dye. As in fabric dye. I saw a comment about this stuff being effective for dyeing plastics so I thought it was worth a shot. It showed some promise but also the clear plastic I actually wanted to dye... doesnt seem to tolerate the high temperatures required all that well. And also just wasnt taking to the dye. Even if this did work, it would have been a pretty finicky process since it would require removing the bulbs, which I discovered the last time I did this isnt very smart. But I forgot about that discovery and removed em all from this set anyway when I first started this years nonsense. When will I ever learn? So now I bring you to this years winner. And its something that can be obtained just about anywhere, is easier to apply than anything weve tried so far, and can be had in many, many colors. Here are the results on a completed strand. This product gives a frosted look which isnt exactly common in the mini-light space but isnt unheard of, either. And honestly in some ways I prefer it because, while these mini-lights have gotten pretty good, they still throw light rather directionally and frosting the plastic helps tame that. What is this product? Nail polish. Yep. Just cheap nail polish and nothing more. Honestly this hits a pretty huge sweet spot for me when it comes to overall practicality. The bottles come with their own applicator brushes, the product itself goes on thick and uniformly, and it dries quickly, too. The only thing I wish I had was a deeper green I couldnt see anything quite as dark as I was hoping to get, so this color is a little more like an apple green than Id like. Still, though, its not bad. And the blue is letting plenty of light through even with a fairly thick coat. Now, when its wet nail polish is flammable which might concern some of you out there. If youre worried about that, just apply it when the lights are off. However, since these are LEDs and basically dont produce heat at all, Im not concerned about that and would rather be able to see how well its applying. I also sacrificed some bulbs to test the flammability of dried nail polish and at least with these products, I wouldnt call this a concern. Oh by the way I did this outside first, then found out it was safe enough to do in here. I mean, Its - it's cold out there! Anyway, whats burning here is the plastic of the light itself. The nail polish doesnt seem to have any accelerating effect. I will admit that I think this is a worse result than the transparent model paint (though I actually think the red on the nail polish strand is considerably better) but I would consider this less of a hassle overall for a lot of reasons. Its pretty much a have right at it kind of thing with no additional prep or equipment required. Plus you can get this is a wild array of colors in many common stores so it has that benefit as well. A second coat did make the colors more intense so I would probably do two coats if I were committing to a run of these. And who knows how long this might hold up in the elements. Well find out, though! I didnt get anysort of top-coat product and that would probably help these out, but also if these do well on their own yippee I guess. Now, I have a confession to make. At this point, Im just doing this to prove a point. That these colors are just waiting to be implemented by the manufacturers, and as I said in the last video, I dont get why this isnt a thing yet. I even suggested selling sets without caps and selling the caps separately for make-your-own-color sets and in these two years I dont think thats been a thing. Now I can sort of see why, maybe none of the Christmas light set manufacturers have watched my video, maybe none of the mental energy I project towards them when I brush my teeth every night is making it, or maybe its just hard to sell a light set thats incomplete like that. Perhaps getting UL certification on a set like that wouldnt be easy, but surely somethings gotta be possible. I cant possibly be the only person on this Earth who is bugged by these garish colors. I mean, for one thing they still sell incandescent light sets every year! And like, I might be annoyed with that were it not for the fact that theyre just so much better looking than these. And thats not, like, my opinion, that's an objective fact! Plus they only get about a month of use each year which also happens to be during a part of the year where electrical demand tends to be low. Plus - these beautiful twinkling sets exist and the LED versions, while nice in their own way, dont hold a candle to 'em. It turns out Im not the only person who dislikes these gaudy colors. Theres at least one other person out there, and unlike me they were willing to go the extra... thousand miles to start their own business manufacturing LED replacements for these beauties. Quick note - this is a C9 set, and C9 is a bulb-shape designation that for some reason or another has hung around all this time to describe Christmas lights. You can still get these as incandescent sets, at least in my next of the woods, and they sure are pretty but holy cow are they not efficient! You can just *feel* the heat coming off of these. Its not great. The folks behind Tru-Tone light bulbs, who are not sponsoring this and besides I dont even have any that I could show you yet did the work of contracting with a light bulb manufacturer to make LED versions of these. And like, yeah! Why the heck not? Weve been making LED filament bulbs for a long time now and theyve gotten really good and pretty small, so why not just make a little 5 or 7 watt equivalent bulb in this shape and then put a ceramic paint coating on there like we used to? Im glad somebodys thinking this through. Apparently theyve gone so far as to mimic the little tent-shape filament most clear bulbs had and they sell clear as well as different colored tinted clear sets, too (in the C7 size at least.) Again, I dont have any affiliation with these people but I like the way they think and I hope they succeed. Theyve even specifically put in the FAQ that no, they dont use colored LEDs, all the filaments are warm-white and the color comes from the glass just like the good ol days so clearly they're after my heart. It looks like theyre doing pretty well as some varieties are sold out already. Sadly to those of you in 240 lands, they dont make them for you yet. Heres hoping, though! Oh, but did you ever have sets like this? I dont know enough about your holiday light norms over there but I kind of get the sense that mains voltage running through cheaply-made light sockets intended to be stung outdoors isnt exactly the norm. If the folks at Tru-Tone are watching, I would highly suggest a couple of things. One, could you pretty please maybe come up with some sort of colored sleeve product for slipping over these mini-lights? I love C9 sets and use them, but I also like the mini-lights a lot, too, and I feel like this would be a fairly simple thing to manufacture. Plus it would allow for really easy color changes and you could potentially sell them for more seasonal occasions than just the winter holidays. You might find people really like the idea of changing the colors to all sorts of combos. Most importantly, though, it could end this madness. The other thing Id suggest is a look at search engine optimization. I had heard of your product last year and actually went looking for it a couple of weeks ago but whatever search terms I was using didnt pull you up right away. Im not sure what all you could do about that, but I thought Id let you know. In fairness I wasnt trying super hard and I think I forgot your products name so I might have just looked right past it, so thanks to Vwestlife for tweeting a link a me. Oh, and while I know the world of supply chains is just a... mess right now and its your business, not mine, I hope you implement some way to pre-order whats currently sold-out for next year. But anyway, thats it! What have we learned today? Well first, Im eccentric! But we knew that already. Second, nail polish seems to be a pretty good product for coloring white LED sets so long as youre OK with the frosted appearance. Third, there are some folks in Michigan who are easing my pain just please please pretty please come up with some sort of color caps please. Oh right dyes a wash. Uhh but I think thats it! I hope you all have a wonderful and safe holiday season, and when I see you next well be talking about photographic printing. Which is great because well get to talk about another kind of colored light! The safelight. Oooohhhh. unexpectedly holiday jazz Its not great. Lets see if we can get this green bulb to come back. Did you seriously burn out on me? I bought two of these sets to have just for spare bulbs and for whatever reason green is extremely prone to burning out. At I plugged this in once, this bulb had a life of what, 10 seconds? Its like its taunting me. Thats... this is the last green from my first set of spares so as of now I have just five green spares left. Jeh! And its only been getting better and better. Except in this hhhhhh wheres the string! Should have planned that out. This is what you call a live fact-check. Yes. I couldnt even notice a difference between the half that got a UV protective coke... Clear coat. Now, white lights? Weve got oh I grabbed... not color and white. I dont go all out like clr eugh. I'm really hoping that Tru-Tone comes through with some little light cap thingies. As much as I enjoy this silly tradition, I also don't want to spend an entire day painting light bulbs. And I never actually have - I just keep doing this for youuuu! Really breaking the illusion, huh? Well... whatever.",
    "transcript_keywords": [
        "light",
        "lights",
        "sets",
        "light sets",
        "set",
        "pretty",
        "color",
        "colors",
        "Christmas lights",
        "incandescent light sets",
        "Christmas light set",
        "white lights",
        "LED",
        "light set",
        "white",
        "Effort November",
        "LED sets",
        "year",
        "white LED sets",
        "bulbs"
    ],
    "transcript_entity_values": [
        "2019",
        "each year",
        "the year",
        "Only a month",
        "an entire day",
        "a couple of years",
        "only half",
        "next year",
        "polish",
        "Second",
        "Third",
        "Warrrlllmart",
        "Sharpies",
        "12 trillion",
        "about a month",
        "Tru-Tone",
        "FAQ",
        "two",
        "Vwestlife",
        "last year",
        "Jeh",
        "C9",
        "a couple of weeks ago",
        "November",
        "Christmas",
        "Michigan",
        "50",
        "this years",
        "the shortest days of the year",
        "6 trillion",
        "every year",
        "today",
        "10 seconds",
        "Clark Griswold",
        "the holiday season",
        "at least one",
        "this year",
        "Conenxtras",
        "the good ol days",
        "first",
        "one",
        "thousand miles",
        "Earth",
        "these two years",
        "7 watt",
        "100",
        "1 trillion",
        "Warrlllmart",
        "2018",
        "every night",
        "One",
        "the days",
        "five",
        "C7",
        "240",
        "second"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "NORP",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "PERSON",
        "PRODUCT",
        "DATE",
        "DATE",
        "DATE",
        "GPE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "TIME",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "LOC",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "TIME",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "ORDINAL"
    ],
    "vector": [
        -0.1302892565727234,
        -0.023320812731981277,
        0.00393306277692318,
        -0.04468298703432083,
        -0.08579257875680923,
        -0.019119858741760254,
        0.07943163067102432,
        0.035633478313684464,
        -0.11780530959367752,
        -0.004521557595580816,
        -0.011107371188700199,
        0.02023634873330593,
        -0.0031280608382076025,
        0.03935425356030464,
        0.020020227879285812,
        0.012281819246709347,
        -0.013582549057900906,
        -0.03678600862622261,
        -0.027804819867014885,
        -0.039434682577848434,
        0.0012952324468642473,
        -0.12348739802837372,
        0.037178266793489456,
        0.028532162308692932,
        0.0576806366443634,
        0.008890680968761444,
        -0.035199396312236786,
        -0.008272789418697357,
        0.01251659169793129,
        -0.04636172205209732,
        -0.07843618839979172,
        0.13314592838287354,
        -0.030279165133833885,
        -0.02275107614696026,
        0.012775630690157413,
        -0.015239990316331387,
        0.04885827749967575,
        -0.017278850078582764,
        -0.06440706551074982,
        0.02467404119670391,
        0.017159024253487587,
        -0.07298815250396729,
        0.010142499580979347,
        0.017343342304229736,
        0.0475032739341259,
        -0.04673836752772331,
        0.028129490092396736,
        -0.01804543472826481,
        -0.07225501537322998,
        0.014156723394989967,
        0.0024562885519117117,
        -0.04230037331581116,
        0.10731226205825806,
        0.02697116509079933,
        -0.012492559850215912,
        -0.0014360627392306924,
        0.023756807669997215,
        0.014224831014871597,
        -0.006257086526602507,
        -0.04982124641537666,
        0.016928428784012794,
        -0.08171353489160538,
        -0.11606419086456299,
        -0.013850364834070206,
        0.013426687568426132,
        0.011288203299045563,
        -0.06149054691195488,
        0.052687954157590866,
        0.026103978976607323,
        -0.03611138090491295,
        -0.04761325195431709,
        -0.04177258163690567,
        -0.004031539894640446,
        0.05580843240022659,
        6.000836583552882e-05,
        0.02150661312043667,
        0.08079925924539566,
        -0.06567724794149399,
        -0.03005167283117771,
        -0.048260513693094254,
        0.08024799823760986,
        0.024957096204161644,
        -0.03815987706184387,
        0.047395844012498856,
        0.03256342560052872,
        0.04880257695913315,
        -0.031430236995220184,
        0.051516760140657425,
        -0.022929785773158073,
        0.07807411253452301,
        -0.026545265689492226,
        0.05060603469610214,
        -0.024461746215820312,
        -0.03547249361872673,
        -0.07062236964702606,
        0.01012321375310421,
        0.027904560789465904,
        -0.05338684096932411,
        -0.032429080456495285,
        0.10693477094173431,
        0.010032637976109982,
        0.008185318671166897,
        0.028105594217777252,
        -0.10831836611032486,
        -0.11472458392381668,
        -0.03593778610229492,
        -0.05385524407029152,
        0.048796169459819794,
        0.009143780916929245,
        -0.05276981741189957,
        -0.011871402151882648,
        0.03154810890555382,
        -0.0698065534234047,
        -0.06705287098884583,
        -0.005363911855965853,
        0.04186951369047165,
        -0.014551358297467232,
        0.05880027636885643,
        0.11657539755105972,
        -0.02755719982087612,
        -0.005261420737951994,
        0.0708911195397377,
        -0.019188955426216125,
        0.07180358469486237,
        0.07442676275968552,
        0.024031274020671844,
        -0.06232545152306557,
        4.053480312485526e-33,
        0.0037379595451056957,
        0.15882138907909393,
        -0.03247583657503128,
        0.03830280527472496,
        0.04066317155957222,
        -0.00025740216369740665,
        -0.05565228313207626,
        -0.008644080720841885,
        -0.1262163519859314,
        -0.05640345439314842,
        0.01374513003975153,
        0.12878265976905823,
        0.024659404531121254,
        -0.02300403080880642,
        -0.016021206974983215,
        -0.12192296981811523,
        0.009654245339334011,
        0.0038325719069689512,
        -0.015443384647369385,
        -0.042036768049001694,
        0.014649835415184498,
        0.014166068285703659,
        0.028168678283691406,
        0.030810773372650146,
        0.03930457681417465,
        0.02426201105117798,
        -0.006674470379948616,
        0.0476047620177269,
        0.07579566538333893,
        0.01789204403758049,
        0.04760083183646202,
        0.08017483353614807,
        0.02020561695098877,
        -0.023903489112854004,
        0.03142527863383293,
        -0.005481204483658075,
        -0.08852983266115189,
        -0.15696638822555542,
        0.07918321341276169,
        -0.03389476612210274,
        -0.012386401183903217,
        0.06806669384241104,
        -0.013039137236773968,
        0.0827639251947403,
        -0.024627255275845528,
        0.012898282147943974,
        0.02838527038693428,
        -0.006902673281729221,
        0.07166771590709686,
        0.013303139247000217,
        -0.05220583826303482,
        0.02639801986515522,
        -0.05213459953665733,
        -0.0039793807081878185,
        0.04876622185111046,
        -0.006349729839712381,
        0.010984831489622593,
        0.0037217317149043083,
        0.09337453544139862,
        -0.06091609224677086,
        0.0005753297009505332,
        0.06490567326545715,
        -0.03190620243549347,
        0.003180187428370118,
        -0.06755652278661728,
        0.03045220486819744,
        -0.011094987392425537,
        0.03640918806195259,
        -0.027679871767759323,
        -0.027683550491929054,
        -0.06696716696023941,
        -0.045340824872255325,
        -0.012004259042441845,
        -0.053712766617536545,
        0.05389390513300896,
        0.04094835743308067,
        -0.001043742522597313,
        -0.00903570931404829,
        0.06004977598786354,
        0.006375316064804792,
        -0.09439254552125931,
        -0.02987314760684967,
        -0.008544660173356533,
        -0.010273734107613564,
        -0.028962457552552223,
        -0.01915304735302925,
        0.03279821574687958,
        -0.009932980872690678,
        -0.0021062344312667847,
        -0.021808750927448273,
        0.015877172350883484,
        -0.051294922828674316,
        0.0918867290019989,
        0.002522652968764305,
        -0.08263599127531052,
        -4.3930688754945765e-33,
        0.04756917059421539,
        -0.03058737702667713,
        -0.024488622322678566,
        0.028601013123989105,
        0.10497685521841049,
        -0.04654866084456444,
        0.016085708513855934,
        -0.08268334716558456,
        0.08724606037139893,
        0.042465802282094955,
        0.11668354272842407,
        0.02636137045919895,
        -0.012976515106856823,
        -0.007063292898237705,
        -0.0187041275203228,
        -0.08628255128860474,
        0.013076955452561378,
        0.1132340133190155,
        0.05515745282173157,
        -0.032690614461898804,
        0.018490374088287354,
        0.08381074666976929,
        -0.09715539216995239,
        0.007543409243226051,
        -0.06820785254240036,
        0.013794532045722008,
        0.0011121187126263976,
        -0.020942330360412598,
        -0.0072600338608026505,
        0.06619815528392792,
        -0.0884462520480156,
        0.020980890840291977,
        -0.0492851622402668,
        -0.02873564139008522,
        0.0568377710878849,
        0.09359034150838852,
        0.07061787694692612,
        0.04062192887067795,
        -0.06705306470394135,
        -0.009659914299845695,
        0.02791772224009037,
        -0.025646476075053215,
        0.00678259925916791,
        -0.010898011736571789,
        -0.0034517140593379736,
        0.037107374519109726,
        -0.06105244532227516,
        0.02827836200594902,
        -0.12290537357330322,
        0.017484599724411964,
        0.06742704659700394,
        0.06207816302776337,
        -0.01996091939508915,
        -0.07316329330205917,
        -0.019712943583726883,
        0.016429774463176727,
        0.04640941321849823,
        -0.039548732340335846,
        -0.06401229649782181,
        0.027411239221692085,
        -0.013958735391497612,
        -0.054877061396837234,
        0.06186167150735855,
        -0.03550466522574425,
        0.026186421513557434,
        -0.07033691555261612,
        0.07557261735200882,
        0.07809998095035553,
        0.0017865579575300217,
        -0.0037900665774941444,
        0.04983709380030632,
        -0.02371113747358322,
        -0.04808332026004791,
        -0.0075363717041909695,
        0.004761934746056795,
        -0.08889342844486237,
        -0.016834015026688576,
        -0.0204129908233881,
        -0.051836878061294556,
        -0.026236314326524734,
        -0.015861766412854195,
        0.03962571918964386,
        0.04470745846629143,
        0.032688602805137634,
        0.12719902396202087,
        0.04724426567554474,
        -0.02592448890209198,
        0.030144771561026573,
        -0.03934408351778984,
        0.07634896785020828,
        -0.011179903522133827,
        0.04699649661779404,
        0.04922680929303169,
        0.06716041266918182,
        0.03374987468123436,
        -7.412029390252428e-08,
        0.04374618083238602,
        0.049184758216142654,
        0.007049399893730879,
        0.012929675169289112,
        0.02362164296209812,
        -0.10817072540521622,
        0.06061346456408501,
        -0.03890834376215935,
        -0.07217316329479218,
        0.04014498367905617,
        -0.05597131326794624,
        0.019894039258360863,
        0.02408674545586109,
        0.03748404234647751,
        0.09914787113666534,
        0.07052144408226013,
        -0.07894116640090942,
        0.007340652402490377,
        -0.08503782749176025,
        -0.04153415188193321,
        0.05843932554125786,
        0.036597248166799545,
        0.050339460372924805,
        -0.010545987635850906,
        -0.02821962535381317,
        0.07754804193973541,
        0.022473169490695,
        0.042891036719083786,
        0.026781881228089333,
        -0.03272384777665138,
        -0.03302062675356865,
        -0.024603838101029396,
        0.0007336114067584276,
        -0.012319592759013176,
        0.01670730672776699,
        -0.03135426342487335,
        -0.0730486735701561,
        -0.04951607063412666,
        0.011447429656982422,
        0.09199360013008118,
        -0.10866481810808182,
        -0.034086503088474274,
        0.019782202318310738,
        0.08935187757015228,
        0.043362803757190704,
        0.008682467974722385,
        -0.029505150392651558,
        -0.05339009314775467,
        -0.043303292244672775,
        0.06534833461046219,
        -0.00678500859066844,
        -0.0004760822339449078,
        -0.03335928916931152,
        -0.03521372377872467,
        -0.0037992477882653475,
        0.051218874752521515,
        -0.004827672615647316,
        0.03546064347028732,
        -0.026138557121157646,
        0.0048904577270150185,
        0.03806762024760246,
        -0.02096506953239441,
        -0.007469004485756159,
        -0.019856324419379234
    ]
}