{
    "id": "crsqqTFAu7c",
    "title": "A better keyboard than QWERTY | The Vergecast",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-04-02T13:00:37Z",
    "video_url": "https://www.youtube.com/watch?v=crsqqTFAu7c",
    "category": "Science & Technology",
    "tags": [
        "The Vergecast",
        "Vergecast",
        "The Verge",
        "Tech",
        "Technology",
        "podcast",
        "gadgets",
        "keyboards",
        "qwerty",
        "RSI",
        "repetitive stress injury",
        "mechanical",
        "switches",
        "ferris",
        "trackball",
        "Colmack",
        "Workman",
        "Dvorak",
        "BEAKL",
        "programming",
        "VIM",
        "T-34",
        "Jonas Hietala",
        "interview",
        "microsoft",
        "surface",
        "pavan davuluri",
        "panos panay",
        "hardware",
        "chatgpt",
        "AI",
        "artificial intelligence",
        "PC",
        "Netflix",
        "Pat Flemming",
        "recommendations"
    ],
    "views": 15237,
    "likes": 218,
    "comments_count": 23,
    "description": "Today on the flagship podcast of alternate keyboard layouts:   The Verges David Pierce talks to Jonas Hietala about his ultra-custom keyboard he built from the ground up to fit his specific needs.   The Verges Tom Warren explains the next phase of Microsoft with a new leader on the Windows and Surface team.   Later, David answers a question from the Vergecast Hotline about tricks for Netflix recommendations.  Further reading:  Jonas Hietala: The T-34 keyboard layout:  Microsoft has a new Windows and Surface chief:    Microsofts first AI PCs are the Surface Pro 10 and Surface Laptop 6 for businesses:   Rewinds new feature brings ChatGPT to your personal information:    How Planet Earth  and the Netflix homepage  get made:   00:00 - Intro 02:04 - The T-34 keyboard layout 26:33 - Microsoft and AI PCs w/Tom Warren 52:29 - Netflix recommendations tips (Vergecast Hotline)  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   If you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit:",
    "description_links": [
        "https://www.jonashietala.se/series/t-34/",
        "https://www.theverge.com/2024/3/25/24111931/microsoft-windows-surface-pavan-davuluri",
        "https://www.theverge.com/2024/3/21/24107513/microsoft-ai-pc-surface-pro-10-laptop-6-specs-release-date-price",
        "https://www.theverge.com/2023/3/23/23653127/rewind-ai-chatgpt-for-me-chatbot-mac",
        "https://youtu.be/eqUspnjuMp8?si=BbhM0MMbDB2CvgDh",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://link.chtbl.com/vergecast",
        "https://link.chtbl.com/decoder",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3P4bJgz"
    ],
    "transcript": "Welcome to the Vergecast, the flagship podcast of Alternate Keyboard Layouts. I'm your friend David Pierce, and I am sitting here at my dining room table, going through what I guess I like to call just my tech crap bag. So a bunch of years ago, I started basically buying duplicates of all of my chargers. and plugs and cords and backup headphones just to have one thing that I can just leave in a bag in my suitcase at all times. So I don't have to unplug everything from my room when I want to leave. I don't have to constantly be schlepping stuff back and forth. I kind of leave everything where it is at home and then I have this stuff for travel. It has saved me so much time and so much effort and so much forgetting of stuff over the years. I cannot recommend it enough. But when I travel a bunch in a row, it gets like this. It's kind of messy and tangled, and I don't know where anything is, and there's a bunch of stuff that's supposed to be in here that I'm sure is not in here. So every once in a while, I have to sit down and very quietly and lovingly coil it all back up, put it back in neatly, and then slowly destroy it again over time. Works out great makes me feel good. No regrets. Anyway, we have an awesome show coming up for you today We're gonna talk about two different things first Starting off with our kind of accidental keyboard series that we're doing. We're gonna talk to somebody who spent two years Reinventing from the ground up How his keyboard works and how he uses it. It's a super fun story. Then we're going to talk to Tom Warren about a surprising amount of change happening at Microsoft right now, and what that means for its plans for AI and its plans for surface devices and what an AI PC is and a whole bunch of other stuff. We're also going to do a hotline question. We got a lot coming up this episode. All that is coming up in just a second. But first, I just discovered that one of these cables has finally come like fully undone, uh, and doesn't charge anymore. And so I need to buy the replacement. This thing has lived a long life. It's time for a new one. This is The Verge Casts. We'll see you in a sec. Welcome back. Here's a question. How often do you think about your keyboard? I think for most people the answer is never. You just, like, have a keyboard on your laptop or your phone. That's your keyboard. The end. At the very top end of the spectrum, I think, are the mechanical keyboard people who obsess over switches and colors and all that kind of stuff. I think as regular computer users go, that's about as intense as it gets. But there is a community of people online who go much, much deeper than that. And I recently got on a call with one of them, who spent an evening in his office in Sweden talking to me about keyboards. I'm Jonas, Jonas Hietala I studied computer science, but I prefer to see myself as a self taught developer. I found Jonas because over the last couple of years on his blog, he's been keeping a journal of sorts about his attempt to build the perfect keyboard. Because the keyboard he had, the ones that you and I use all day without thinking much about them, wasn't working for him anymore. I mean, it was fine in a certain sense. Jonas is a programmer and a pretty fast typist. I've never used these typing trainers or websites or stuff, but I think I typed in like 120 words per minute or something. It's okay, but it's not super incredible. When I started looking at this, it was actually when I got RSI. RSI, by the way, stands for repetitive strain injury or repetitive stress injury. It's an umbrella term for what essentially is a lot of problems caused by doing the same thing the same way over and over and over again. I started feeling pain in my hand, specifically my right hand. I had also broken my, on the top of the hand, close to the, the pinky. So when I started typing, I'm like, Oh, pressing like enter and other keys with my pinky kind of hurt. So the first thing Jonas thought was, okay, maybe I'll get an ergonomic keyboard, one of those that's either split in two or just has that kind of wavy shape that's supposed to be less intense on your wrists and forearms. He had actually tried these keyboards before. Like 15 years ago or something, I was really into mechanical keyboards. But at that time, it was just, Oh, pretty keycaps. Oh, maybe these switches that sound cool. Oh, look at how fast I'm typing. It sounds like I'm typing fast with these switches. And I also bought like an Ergodox. I think it's what's one of the first like ergonomical mechanical keyboards. And I got it. I was super excited. I tried that out and hated it. And I just put it in the box. So when I got the RSI problems again, I'm like, Oh, but I had the solution here in a box somewhere. So I put it together and like, Oh, I theory crafted, like, because it doesn't look like a regular keyboard, right? So you have to figure out where to put your, at least your enter key, space keys, and some of these things. So I theory crafted them like, Oh, this will be perfect. It was so good. Put it together. And I start typing like. Oh shit, this sucks. I mean, I hate this. What should I do? Well, of course, I bought another keyboard. He eventually bought a keyboard called a Ferris. It looks kind of like a normal keyboard deconstructed. It's made up of two panels of 17 keys. So 34 keys in all with a wire at the bottom, connecting the two parts. Each panel has five rows of keys aligned, kind of like your hand with the tallest one in the middle, like your middle finger, and then two more keys right where your thumb goes. The idea is that you rest one hand on each panel and then you have easy access to all 34 keys without moving your fingers or wrists too much. So Jonas buys that keyboard. Oh, and a mouse. I also got this trackball because I got some RSI in the thumb and most of these mouse alternatives, you have the ball of the thumb, but that was really counterintuitive. So I got this like big trackball thing, which I move with the fingers. So of course I started that route as well. So he's got all this and feels like he's set. But the thing about Ferris keyboards is that generally speaking, all the keys are blank. This thing isn't a normal qwerty keyboard like you're used to. And so you actually have to decide where you want all the keys to go. And oh boy, is that quite the rabbit hole. It turns out there's nothing really magic about the QWERTY layout that we're all used to. There are a lot of theories about where QWERTY came from, actually. One you hear a lot is that it was created for typewriters, and that actually it deliberately moved the commonly used keys away from each other so that the typewriter mechanisms wouldn't crash into each other. I'm honestly not sure if that's a myth or the truth, but that is kind of the common story that's out there now. And really, the reason we all use these keyboards is just that we've used them all for so long. There's honestly not a better reason that QWERTY has won, except that it has won. And retraining our brains to a new way of typing is just too much work. But when you start thinking about it, when you really step all the way back and start thinking about it, there are a lot of ways it could be better. QWERTY is like one of the worst, or if not the worst, keyboard layout that's actually used. I mean, there are a lot of different ways you can evaluate keyboard layouts on, and almost no matter what way you choose to evaluate it, QWERTY is really, really bad. I don't really care if you want to argue that ColMac is better than Dvorak, or if it's better than Workman. All of these are so much better than QWERTY. Isn't it weird that if you type quote unquote correctly, the only thing your thumb ever does is hit the spacebar? You're wasting two perfectly good fingers on a single key, not to mention the easiest to hit key on the whole keyboard. Also, your index finger is typically more dexterous and powerful than your pinky, so why isn't it given more to do? And why are letters like O and A and even E the most common letter right in the middle of the keyboard? I should say, by the way, that keyboards and keyboard needs vary widely across languages. One reason a lot of non English speaking countries have gravitated to software keyboards in particular, and one of the reasons phones have been so successful in those places, is that they can be customized and vary so much more. But for my purposes here, I only know how to type in English, so I'm gonna focus on English keyboards. Jonas does type some in Swedish, too, but that didn't figure too much into his story. Talking to Jonas got me wondering about keyboard layouts. I know about, like, Dvorak, which rearranges all the letter keys to try and put the most common letters and combinations right on the home row so that you don't have to move your fingers as much. But there are actually a million others, too. There's Colmac, which does the same thing as Dvorak, but rearranges them in a slightly different way. There's Workman, which tries specifically to minimize how much your fingers move side to side, which is one of the most painful things for them to do, and how much work your pinkies have to do. There's one called Hands Down that is particularly useful if you type in multiple languages. On and on and on. There are so many more of these than I realize. The one I'm most interested in, personally, is called Beakle. B E A K L. It's designed to do most of the same things as the rest. Minimize finger and wrist movement, especially side to side. Balance the load between your two hands. Make it easier to use the same finger for multiple letters in a row. But Beakle is also big on shifting work from your ring and pinky finger to your thumb. There's a website that I found with the principles of Beacle Theory, which is a thing, and one of them is to exploit the powerful thumbs to their maximum potential. What a cool sentence that is. So, you could put, let's say, the E key, which again is the most commonly used key on the keyboard, on your thumb. It's wild and different, but intellectually, this makes sense to me. Anyway, Jonas tried Beagle and a bunch of others and he started to lock in on something that felt really good to type on, like physically good. And he also started to realize that especially for his purposes, using a keyboard involved a whole lot more than just typing the 26 letters of the alphabet. When people talk about keyboard layouts, they almost always refer to just the alpha keys like A, B, C, up to Z. And it's like, Oh, you have Colmac. Well, they just changed all these letters, but the numbers and the enter keys and the space and everything else, they're always in the same place. But when you use like a really small keyboard, like I do, then you don't even have these keys. So this is something that you have to design. For Jonas, there was one app in particular that he cared about most. This is like the only thing he talked to me about in our whole conversation. Vim. It's a 30 year old, outrageously customizable text editor. It's one of those apps that people, particularly programmers, kind of live their whole life inside of. One of the things about WIM is that you have all these strange key bindings. You can almost talk to any WIM user about this. What is their number one fear of switching to a new layout? It's will my WIM key bindings work? And you have like this arrow keys like H, J, K, L, and you have them on a regular keyboard. It's on the home run. It's super convenient. And most WIM users abuse them. People use them too much. Because, well, that's what people do. So they also always worry, well, will this work? I mean, should I? Because switching to another layout, it's a huge task. You need a ton of effort. Like, never mind just designing your own. Just learning something new is really, really painful. And do you, risk going into this journey and you end up with something that might not work for the tool that you use. And, you know, myself and a lot of other people who use WIM, we use WIM for everything. I mean, we use WIM all the time when we're programming, when we're writing. I mean, there are hours and hours every day we, we use this tool. So, I mean, I would say that it's Something that I was worried about from the beginning, it was something I looked at when looking at other keyboard layouts, because you don't want to have your most used key. Like J is one of the least used keys in English. So most keyboard layouts that try to optimize for English, because most do that, they will just put J in the worst spot. But then as a Vim user, that's like, Oh, that sucks. I can't layout anymore. Well, it's not that bad. I mean, a lot of people use something like a navigation layer, or they try to force themselves to reduce the usage of YAY and the other movement keys. W jumps to the next word, for instance. And it's a lot better to use that than the Vim arrow keys. But it was still something that I was worried about. So, for an extremely specific, extremely customized use case, Jonas decided to get an extremely specific, extremely customized keyboard. There's no world in which you or I could sit down and use his computer, which is actually a thing about this whole process that I kind of love. We all use the same gadgets in the same super prescribed ways now, and Jonas just decided to blow all that up and set up something that worked just for him and nobody else. The, this was just for me to reduce my RSI. And I mean, should I do this because of popularity or, or because I want everyone else to use it? No, I don't. I just want it to feel good for me. And it's the same reason why I spent hours of configuring my own NeoVim configuration. I mean, that, that's just time sink that will, no one will ever get in the use of it, it's just for me. And it's the same for my layout, really. And I know there are a lot of people who designed these like general layouts, but I really feel that customizing the layout, even if you just, you know, change escape to a better position, because as a Wind user, escape is like a super important key. So maybe you just change that. And I think customizing things is actually a bit underappreciated in the keyboard. layout community. I mean, a lot of people want to make these generalized good things like, Oh, this is the perfect layout for English. And I think more people should try to customize, especially when you go down this rabbit hole of choosing a smaller keyboard or a more economical keyboard. So Jonas starts experimenting at this point. He puts in a layout, uses it for a while and starts trying to really notice what's working and what isn't. I both do and don't recommend doing this for yourself, by the way, because it'll make you strangely self aware of how you type. And at least for me, I'm convinced it's making me worse at typing. I think about it much more than I ever have, and I'm not sure that's a good thing. But Jonas got really good at figuring out what worked and what didn't, and most importantly, what hurt. And what didn't? I think there are two directions you can do this. One is to take the purely algorithmical approach. You create a computer program that optimizes to find the perfect layout for you. And then you just tweak the settings. Oh, I don't like same finger biograms. So this is a penalty. For having these two keys on the same finger, and then you just tweak all the settings all the time until you find something that's good. So that's one way of doing it. I did not do that. I instead went mostly on feel. So, When designing the alpha layer, I looked a lot at the same finger biogram because I know that it was something I really disliked. So, oh, maybe I can switch around these three characters and I thought about it like a lot. Oh, I'm going to try it and I look in this like analyzers. Oh, but that biogram is really common. That's not good. So then I went back to the drawing bug, but mostly it was. Think about it. Think about it some more. Try it. That was basically my approach. It's probably not the best approach, but it was the one I used. Mostly because I think it's extremely hard for me to put down this feeling. of how good this feel into numbers. You can do a basic exercise to just how hard is it to press one key on your keyboard. So if it's on the home run, you can put the zero because it's the easiest, but in the edge of the screen of the keyboard, is that a four or is that a three or maybe a five? I tried to do this exercise and every time I went back to do it again. I got a different result. It's so freaking hard for me to just put these things into numbers. So that's why I gave up on the idea. And I said, Oh, I will just try it, feel it and change it whenever I dislike something. Did you ever try something and then just immediately the first time you hit the key, you were like, I hate this. This feels bad. Failed attempt. Yes. I think I had R and underscore, like, they're not on the same finger now, but I, I tried it and it's like, oh, I can just switch these two keys and it would be much better. And the first time I just typed something, because in coding you have like R and underscore quite often next to each other when you type variable names with snake case, I was like, oh, I hate this. And I immediately just threw it away. Once you start to think about this stuff in terms of minimizing pain and movement, you come across all sorts of hacks. One thing I had never heard of, but Jonas and others talk about a lot, is the idea of a repeat key. I don't remember exactly where I got this idea from, but the repeat key basically repeats the last key you pressed. So for instance, if you want to type fool, you press F O O L. But in this case, you press F O Repeat L. Why is this useful? Well, if you're just looking at same finger diagrams, which I don't like, I dislike pressing the same key multiple times. So instead of typing OO with the middle finger, I type middle finger and then the pinky, which is my repeat key location right now. So you can do this like rolling motion and rolling motions, they're Really quite nice and a lot of different keyboard layouts optimize more for rolling motions than same finger Goodbye grams. So I think empty gap is one layout, which has really good rolls. Rolling meaning kind of just the way your fingers move from into out. Yeah, into out or out win. If they're not next to each other, they're usually really easy to press. This is what I mean when I say it's a deep rabbit hole. The people who work on this stuff are thinking about keyboards the way I think we all should. As incredibly important, incredibly complex tools that get used for countless hours every day, and in which even a small improvement can be a huge deal. And there are so many small improvements out there. One thing a lot of keyboard tinkerers like to use is what's called a one shot key instead of pressing and holding. So if you want to capitalize something, you hit shift and then the letter you want instead of having to hold shift down and stretch your hand all the way across the keyboard. It's a little thing, but can be a real pain reliever. The problem is all that improvement is fighting against literally a hundred years of muscle memory and how to use QWERTY keyboards. And so the improvements keep losing. It took Jonas, someone who was deeply dedicated to this, two years to get around to something that fit. That he didn't feel like he needed to obsessively tweak anymore. I tried a bunch of times to get him to describe kind of his mental model of his keyboard, how he designed it, how it works, and how he uses it, and he kind of couldn't do it. I was worried you, I would have to explain, oh where is x, oh where is this, because I can't. It's almost all muscle memory right now. I mean, if I really think about it, sure, the most used keys I could probably map out. But I mean, most of it is just, I need to sit down and press the buttons. Since he can't explain it, let me try. Jonas's layout, which he now calls T34, is basically a bunch of layers of keys. The top layer is the alphabet and some basic punctuation, and he put common letters like T and K and I in the center, and E on his thumb. He has two modifier keys that then let him go down a layer to a new set of keys. This part he does explain pretty well. So for instance, you can have, Oh, where do you have your arrow keys? Well, I just pressed down my left thumb and then I have arrow keys on the right hand, just below my fingers. I also have it on the left hand, like in the arrow configuration that normal keywords have at 12. So when I press the thumb, I activate the navigation layer. And then you have this, like, like you said, you stack the keys on top of them. So that's a way you can access arrow keys, function keys. I also access number keys, because I don't have a number of symbols, etc. So you have, I don't know how many layers I have. It ends up quite a lot. I have a lot of layers that I don't need. Even remember, like I had this idea of wanting to be able to type regular shortcuts because like control X is a super common shortcut in a lot of different applications, but I have X on the right hand. So sometimes I just want to use. The mouse with my right hand, so I don't want to remove my mouse and do control X. So I have a layer. Well, control X is on the left side. So layers is a super important thing. This all feels to me a little like trying to use Excel just with a keyboard, remembering all of the navigation tools and keyboard shortcuts and formulas and everything else. But Jonas says that once he figured it out, it began to feel much better, at least for him. I should again be clear here that never for one second did he think he was designing a better keyboard for everybody, just a better keyboard for himself. And honestly, in this case, even better depends on how you define the word. I thought I would really enjoy this process of gradually getting better, like, uh, getting better. Because I had this idea in my head, another cool thing is to be a really fast typer. So I want to, you know, continue with practicing every day until I, I beat my old score and maybe even surpass it. But then I just figured, ah, this is just super hard work. It's really boring and I cannot do it anymore. So I'm not even close as fast as I'm on a regular keyboard. I don't really care that much that I'm a bit slower. I mean, I really care about my hand not hurting every day. So victory, right? As for whether it was worth all the time and energy to get to this point, well, debatable. I actually started this journey when we had our second child, our middle child, and he was awake like one to two hours. every night is on my chest in some kind of strap and I'm just standing and I don't want to play with him because I want him to sleep so I just ended up just standing in front of my computer and doing stuff and that's when I really designed most of my layout and learned most of my layout so in the middle of night like for six months or something I was just like a bit sleep deprived and maybe that's what it takes to go on on this kind of journey but I don't know. All that said though, he does kind of think everyone should go through at least a bit of this process, and I think I agree. If you spend hours a day with your wrists cocked awkwardly and stretching painfully around a keyboard, why shouldn't you invest the time and energy to get something better? The first thing I would recommend is just to get a programmable keyboard. If you use WIM, you know that escape is the best key there is. And there are lots of different ways to solve this, but you, if you have a programmable keyboard, you can just move it to caps lock, or you can make a combo on the home row, or maybe you use Emacs and you say that, oh, the control key is most horrible key. There is, because you need like a sixth finger. If you use Emacs, you really should have a sixth finger so you can press that damn control key all the time. If you have a programmable keyboard, then you can just move control up to caps lock. You can even have escape and caps lock on the same key. So if you tap it, it's escape. And if you hold it down, it's controlled. So that's really the first thing I would recommend people to do because you don't have to relearn anything. You can just remap. escape or control, or you can put the navigation layers, like instead of having the arrow keys, like far away on the keyboard, you can just have it on the home row and just hold down something. And that's pretty easy to get right. He also recommended a split keyboard, which makes total sense to me, but I should confess something here. I hung up our call expecting to go make a bunch of changes, explore a new layout, try and combat the pain that I'm also starting to feel typing all day, every day. And then I did nothing. Just nothing. The thing is, I type too much, too often, and I type really fast, and it just seems like so much work to essentially learn what amounts to like a new instrument, just to be able to do my job all day. I'm not sure how long I could get away with not filing stories because I can't type fast enough. You know what I mean? So, I'm stuck, sitting here, staring at this stupid, qwerty keyboard on my desk, which apparently everyone agrees is a bad option, but is kind of just the one we're stuck with. And so now, I'm looking around my desk, wondering what else is like this. What other tech is this way, just because it is this way? We talk about AI as upending the way we do everything online, and maybe that's good, even if the AI isn't good, and ultimately isn't going to change everything about how we do everything. Because maybe it's good to sit down and rethink how we do everything, every once in a while. My image of the ultimate keyboard was just a regular keyboard with cooler switches. So that was the extent of my knowledge. I knew I had this ergodox, but it's like, that's just a weird, strange thing. But I mean, I think it's, uh, when you start going down the rabbit hole, the hole starts to open and you realize, oh, there are so many other things. Alright, we're gonna take a break, and then we're gonna come back and talk about Surface, Windows, and the future of Microsoft. We'll be right back. Welcome back. Over the course of the last few weeks, there's been a lot of what I'd call sneaky shakeups happening inside of Microsoft. I mean, nothing to the level of last year when it looked like Microsoft might just hire the entirety of OpenAI. And of course, all of that turned out to be nothing. But there have been a few corporate moves, and a couple of product launches, and even a different non acquisition acquisition that all make me think there is something big going on here, in terms of how Microsoft thinks about AI, and Windows, and Surface in particular. So, it's time to do what we always do in these situations, which is get the Virgin's Tom Warren on the line to help us figure out what's actually going on here. Tom Warren, welcome back to the show. Hey, good to be back. I feel like I have to bring you on every time Microsoft does something weird and confusing and you have to make sense of it. I feel like this is, this is not what your job should be, but, uh, this is, this is what I need you for. It does feel like that's my job. It's just explaining Microsoft's mess, essentially. Just forever. Like reading the org chart of Microsoft, it makes sense. Uh, and so actually the org chart is where I want to start. I want to talk about AI PCs and I want to talk about services, but we're going to get to all that in a minute. Cause I actually think what is happening inside of Microsoft actually explains a lot of that stuff. So let's go back to six ish months ago, I think, which is when. Panos Pene announced he was leaving Microsoft. Yes. Describe that moment to me at Microsoft. Because he's a guy who'd been there forever. He was a big face of Microsoft. He was in charge of a lot of things. Like what happened when Panos left? Yeah, I think it was, it was kind of a surprise, right? I think it took us up by surprise. And I think it probably took Microsoft by surprise as well. Like the thing is, it was a few days or like before a surface event, which was also like timing, you know, but they announced it publicly anyway. And I think like catching up with people at the event, you could, you got that sense that it was a surprise, you know, this wasn't expected to happen. So, yeah, I think that, that, that was the big takeaway was it was a surprise. And I think the way that. Microsoft kind of responded to it, like Nadella's shape shifting of Windows was that they split Windows and Surface, so Panos responsibilities into two different leaders. And if I'm not mistaken, Microsoft had made a big deal out of uniting those things under Panos, right? That was like, that was supposed to be this coherent, like holistic way of thinking about devices. Right. And that wasn't that long ago. No, it wasn't. And it was around, actually, I think it was just before the pandemic started. Oh, wow. Okay. Which I guess at this point is a while ago, but it doesn't seem like that long ago. It doesn't feel like it. Right. Okay. But it was interesting timing because It was a few months after, uh, Panos and the rest of the Surface team had unveiled the, you know, dual screen Surface stuff, and that was going to be the future of Windows and all that sort of stuff. Um, so it seemed like they, you know, putting everything under Panos was going to align Surface hardware and Windows software. So that seemed like that was what was going to happen, that's what Panos had been working on, and then they just split it out. In a really weird way. So obviously Panos left for Amazon. They gave the Surface hardware stuff to Pavan Davaluri. He's been at Microsoft for over 20 years. He's a pretty key Surface engineer. He's definitely a key player there. Um, it was pretty instrumental to The Qualcomm and AMD relationships where they've done the customs SQ one processes and stuff for these. So like a natural guy to put in charge of this after a pot of sleep, definitely for the hardware side. And then they split off the windows sort of engineering efforts and all those teams over to, to McCall, uh, paraking. Who had been at Microsoft for, for a number of years as well, but was essentially his official title was formerly now, but, uh, CEO of like web and advertising. I feel like he's a name I started to hear with some of the AI stuff over the last year. So is that right? Yeah. So he was looking after you'd hear him a lot when he was tweeting for about the Bing chat stuff. Oh yeah. Okay. Edge, maybe, um, all that sort of stuff. So it was difficult for me to wrap my head around this because it was like, it didn't seem like the natural person to take over windows just given his role, but he's obviously a talented engineer and leader, but it seems strange for it to go that way, given where Windows and Surface have been. So that happened about six months ago. He's been looking after that and then not so much anymore. Yeah. So that, that brings us to, to now. And basically that has been, at least as far as I can tell, sort of pretty cleanly undone pretty much. Yeah. So the teams that I'd say most of the teams that went over to, uh, Mikhail's organization, uh, have gone back essentially, if you want to call it that, um, to, uh, Pavan Davaluri, who was obviously looking after the surface hardware. So he's now looking after windows, most of the windows engineering, um, and surface hardware. The key thing is that it all kind of ties into a big move that Nadella made. So this is why it's actually happening. Um, and he's obviously hired the former co founder of Google DeepMind, Mustafa Suleiman, and he hired him into a position as CEO of Microsoft AI. So a new group, um, inside Microsoft, or you might say the same group that Mikhail was looking after and has kind of been pushed out slightly. He's given a lot to Microsoft and particularly on their ads and search side. Like they've become a lot more relevant in the last few years on that side than they've been before. You can argue they've been pushing Bing in weird ways, pushing Edge in weird ways that haven't been too Great for consumers. You're saying you don't love giant pop ups telling you to use Bing chat? I love it when I'm in the middle of playing a game or like in my Excel spreadsheet and there's this giant, please use co pilot or whatever. Yeah. Perfect. Yeah. It's the clippiest thing Microsoft has done since Clippy and I'm not a fan. But okay. So if I, if I understand sort of the org structure now, You have basically the sort of windows and devices side of things, which is basically like hardware that people use. And that's all under Pavan Davaluri now. He has like most of the Pano's job is now his. Yeah. And he's not like, he's still not on like the senior leadership team. So he still reports up to someone, but essentially that's what he's looking after. And I think. I get the impression that most of that work that he's going to be looking after is, is how they optimize windows for the new silicon that's coming. And, you know, the NPUs, um, all that sort of stuff, because that seems to be pretty key. And we'll also talk about that soon, but that's why I think they're bringing it back to that side because they know they need that engineering effort. Got it. Okay. I do want to talk about that in just a sec, because I think how all of this comes like back together in the product is the part of this that I understand the least. And, uh, we're going to talk about that, but the other side of this, we haven't really talked about all of the inflection AI non acquisition acquisition stuff going on. So basically as I understand it, Microsoft hired Mustafa Suleiman, who is the co founder of DeepMind and then went and founded this company called inflection AI. Yep. paid a ton of money for him and a bunch of other executives to come join the company, didn't call it an acquisition. A lot of people are saying that's because it was worried about the antitrust ramifications of calling it an acquisition, but essentially they aqua hired or like whatever the opposite of an aqua hire is like higher positioned a bunch of inflection AI people to come do AI. for Microsoft, which again, to me says Microsoft doesn't feel like it is where it needs to be in terms of like winning the AI race. And this is the company that 12 months ago was just as confident as you could possibly be about the future of AI and being being the thing and making Google dance and that they were really going to win. This says to me that Microsoft is much less Feeling in itself maybe than it was a year ago. Uh, what's your read of this situation? I think that's, that's spot on. Yeah. So they, a year ago obviously, and I've written about this recently, they, they were obviously all in on Bing and Bing chat, all that sort of stuff. And internally they were talking about picking the Bing brand because obviously this, I think particularly among tech people anyway. And, and the, the general consumer could look at Bing and probably be like, don't even know what it is maybe. But along the, along the tech sort of, um. People it's, it's kind of laughed at, right. It's frowned upon the, the Bing brand. And they were talking internally at that time that, you know, it's, it's, it's 500 million or whatever it is marketing spend to pick a new name. So they were like, we're going to go with being, that's the way forward. It didn't really shift the needle, right? Like Nadella wanted Google to dance. They wanted to get all these, you know, percentage points off of Google. I don't, I think they probably only got about one or 2%. Um, If that was they were they were aiming for for more for there to be an impact, you know, my impression is that most people who use being through Microsoft think they're using chat GPT. I can't prove that. But like, when I talk to people who are using being as AI stuff, they think they're using chat GPT, which is a. Bad sign for Microsoft. Yeah, that's probably reasonable. And they obviously rebranded the Bing chat stuff to co pilot. Right. And they've done a Superbowl ad, all that sort of stuff. So that's, that's all linked him with this. And then like, when I've been speaking to people about working under Mikhail, it sounds like it was run as, as kind of like a startup atmosphere there where you're, you're constantly working, like you're trying to do as much out of as little resources as you have. Um, so it seems like it was kind of a bit crunchy over there and I think there was some micromanaging going on there as well. There's some, some of that sort of stuff that has been happening, which to be fair is probably happens in a bunch of organizations anyway. But it seemed like it just, I think from the fact that Nadella has gone and hired someone into the CEO position, it clearly wasn't working, right? Like whatever they were doing in that team wasn't working. And that's the key point that I think Bloomberg reported that Nadella was frustrated That that team or frustrated that the timeline is there or something because he obviously wants to go fast and Microsoft has been going very fast and co pilot in office and in that world where where they can push it and actually there's revenue opportunities there and you see it in the stock price and all that sort of stuff. So they want to really push it on the consumer side as well. And obviously it hasn't skyrocketed to relevance. So, but I will say though that. I think it's the first time I've known people to be downloading the Bing mobile app or actually talking about being right. Yeah. So it's, it's had some sort of impact, but obviously not enough. And it does seem like I will say credit where credit's due for Microsoft in terms of like baking copilot into the office apps and stuff and sort of giving people like real actual business uses for AI. It's done a better job, I think, than anybody, right? And chat GPT is sort of neater. Uh, and Gemini is weird and whatever. And as a, as consumer brands, those are really the two that people talk about. But in terms of like the, whatever, 30 a month, you're trying to get it departments to pay for. I actually think Microsoft is at least my own perception ahead of everybody else on that front. So credit where credit's due for that. It's just, that's not a victory for. Bing. No, exactly. Like, the good thing about Copilot, uh, in, in that office space is the teams integration where you can literally like, you know how you're like, do I really need to go to that meeting or not? Hmm. Can I catch up? Like in the notes and you don't even have to worry that you just click on the link and it tells you if someone even spoke about you and you can just click. Like, and it will just instantly go to that part. It's like, Oh, that's awesome. It's pretty, yeah, it's pretty wild what they've done for the teams integration. And also like your outlook, um, like I tested out the copilot pro stuff, which is for consumers actually. Um, the team stuff isn't available for consumers, but I tested that out. And the most impressive part of that is you go into outlook and there's an email and is summarized the email at the top of it. So, which is really useful when you have a back and forth of like customer support rep and you're like, I can't even remember what I was doing in this email. Like there's, there's loads of little interesting touch points to it. It's still a little bit still and it needs to mature and stuff. Yeah. But yeah, they have, they have nailed some of it on the office side, but on the windows side, they've been promising a bunch of stuff and it hasn't, I'm not sure what this AI PC stuff is yet. So yeah, me neither. So let's talk about that because. We came on this show a few weeks ago when Apple announced the new MacBook Airs, and we made a lot of fun of Apple for saying that these are really great AI PCs, which amounted to essentially, like, you can do some photo editing and also use the Internet. Thus, these are AI PCs. And Microsoft and Intel and others are out here making all this noise also about. AI PCs and they have the co pilot key and it feels like if they want to be consumer winners in this space, it seems like Microsoft is betting a lot on really having like a hardware instantiation of AI be the thing. Yeah. But like, just back all the way up for me, like when Microsoft says AI PC, the hell is it talking about? That's what I want to know. Yeah. That's the key question at the moment. Yeah. Like, I think AI PC is definitely a bit of a marketing term right now. Because Microsoft's saying all this stuff and it's like the definition, which we actually learned this week from Intel is that it needs to have the latest CPUs and GPUs and an NPU, right? So the neural processing unit, which is a chip that we've seen on a bunch of ARM powered Windows laptops for years now. And essentially it's been there and accelerates tasks like background blowing on a video call and like noise cancelling when your dog's barking behind you on a, on a call. So there's obviously other instances and software developers are working on stuff that will utilize it. But for all intents and purposes, that's the most consumer friendly option you have for that MPU right now. So what else is the MPU going to do? What other AI tasks are going to leverage that in windows? That's still the mystery. So although Microsoft's coming out saying here's our Surface Pro 10 for business, yes, that's the. Full name of the product and it's our first surface AI PC. It still doesn't really explain like why, like, cause the AI stuff that they have been pushing is co pilot, which is cloud based. So it doesn't need an NPU locally to accelerate or anything. So there's just that that's a missing part of the puzzle. And I think that it's all going to make sense on May 20th when they, when they do this. Surface and windows event. Yeah. What do we know about the surfaces so far? Microsoft just released a couple of business C surfaces, which seemed like that reading your story about them, you seem to see those as sort of a hint at what we might see from the consumer facing surfaces, but also those might be different and I don't know, like, well, what, what's your sense of kind of how much we know about this next generation of services that's coming? Yeah. So, so they announced the surface pro 10 for business and the surface pro 10 Uh, laptop six for business, and they're both running Intel core ultra chips, which do have MPUs. And I'd say beyond that, there's some webcam changes, but the designs are pretty much the same. It's not, it's, it's pretty much a very plain release, but some good upgrades for, for business customers. And the hardware is good. Like I like the surface and the surface laptop. So I think to the extent that it's like desperate for a hardware redesign, like whatever, But I think that what you just described to me in no way makes these things qualify as AI PCs. So that that's still where I'm stuck, right? It's like, what is the AI PC story inside of this thing? So on May 20th, they're going to do the same devices, but for consumers, um, there'll be some tweaks to the designs. The surface pro 10 is supposed to get an OLED display, which is nice. There's all sorts of stuff you expect from the consumer side. More importantly, they're not going to be Intel. So they're not going to be Core Ultra PCs, they're going to be Qualcomm, Snapdragon, XElite, or Elite X, I can't remember which way it goes. So ARM based, which is not unusual for Microsoft to do ARM based Surfaces. They've done Surface Pro X in the past, but it's unusual for them to only do that for consumers. Yeah, as the main option, that's a pretty big deal. I mean, they could, I guess, offer it as an option. Um, later it could be some sort of exclusive, but as far as I know, they're launching exclusively with Qualcomm, which is, I think that speaks to some sort of confidence in these Qualcomm chips, because the Qualcomm's been promising this performance to match MacBooks and stuff for years and it's never really delivered. Right. So the year of windows on arm has been every year for like a decade at this point, but it seems like Microsoft is really confident from what I understand internally that they're going to even be able to beat M3 performance. Which is, which is interesting. Yeah. Cause even if they can beat, that would be a huge deal. Yeah. Like it, it seems like they're unusually confident, which I don't usually see. I mean, forget M three performance. If it can get to like Apple's M one performance on these things, like that's a huge leap forward, both for Qualcomm in general, which can then go sell these things to other people. Also. Also for the surface line, like that would make the surface probably more interesting to more people than it has been in a really long time. Yeah. I think, I think it's gonna be super interesting, obviously, cause these chips are obviously going to go into regular laptops as well. And it does feel like with the rumors of, was it AMD and Nvidia potentially doing Windows on ARM next year or the year after, I can't remember the exact year, it does feel like there's something going on here. And Intel keeps inviting me to briefings. About the core ultra. So they obviously know that something's going on. So I feel like there is something going on here, but I'm not fully committed to trusting that this is going to be M3 performance. Yeah. And in terms of the AI stuff, right? Like I think the one part of the AI story that I do buy is that basically efficient performance goes a really long way. Yes, definitely granted every computer with good performance and good battery life is a better PC for AI. Yeah. Is that an AI PC? No, that's just like a pretty good laptop in 2024. But I digress. But as you we've seen Microsoft on the consumer side, I feel like try a bunch of different ways to put AI in front of people, right? There's being chat. They've made all this big deal about edge. They're trying to put it in the start menu. What's your sense? Of what, if anything, is, is working there, like what would you bet on kind of being the front face of AI on Windows going forward? Yeah, I think co pilot is definitely the front face. So Intel obviously had these specs and there was the chip side, but then there was the, it has to have access to co pilot software, which is like, sure, it's Windows 11, whatever, but it has to have the co pilot key as well. For it to be an AI PC in Microsoft's definition, which is like, okay, interesting. So it has to do AI and it has to have an AI button. Yeah. That's what I'm hearing. And then it's an AI PC. I don't know if they can have stickers on these things, but I mean, you never know. That would be amazing. Instead of Intel inside, it should just start saying AI inside. Like that's the stuff right there. That's it. Um, but Copilot is definitely their, their portal. Now how they'll Get away from it. Just being a chat bot or seen as just a chat bot on the side in windows, which is basically what it is right now. That's gonna be interesting to see how it integrates with the apps. They do have something coming called, I think it's called AI Explorer. And it sounds real creepy, but it's gonna essentially record everything you do on your PC. And then say you were, I don't know, researching a holiday last week, you could say to it. I was looking at holidays last week, but I can't remember where it was. And then it'd be like, Oh, you were looking like holidays to Europe last week. Do you want to check out the tabs that you had? Oh, sure. And then you click and it brings up all the types you're working on documents, whatever. So it's like a timeline of how you're using your PC and the state it was in and all that sort of stuff. Yes. I don't know exactly how it's going to work in reality, but that's, that's what they've been, that's what they're building at the moment, essentially. So that's going to be the, the killer, the killer feature for, because it's going to leverage the MPU, um, obviously to, to quickly pull up this, this stuff, um, and reference it, which sounds, Very similar to the windows 10 timeline feature they tried to do, which was like a similar sort of thing, but sort of going across mobile apps, but it needed app support. So it was kind of like dead in the war without developers actually supporting it. This doesn't need app support. They can just do it because they You know, it runs on top of windows. It knows what's on the screen. Yeah. I mean, privacy minefield, but yeah. Well, yeah, I, I remember I wrote about this company, uh, rewind maybe a year ago that is doing something very similar. And there's this like a separate app that you download that then gets permission to record your screen and all this stuff. And in talking to people about that. Everybody immediately goes one of two ways where it's like, Oh, awesome. That runs locally on my computer and doesn't go anywhere else. Kick ass. What an incredible productivity tool that's going to be. And then a bunch of other people who are like, absolutely not under no circumstances, never, ever, ever, ever, ever. Yeah. And I literally, I talked to a bunch of people around that story and found no one who was in the middle of those two points. Yeah. I think that's definitely what this is going to be like. Yeah. It's obviously going to run locally and all that, but it's still, it doesn't matter if it's recording you, it's still weird. Right. Yeah. I agree. But I will say. If that becomes kind of part of the interface of a computer, which I actually think done well is pretty interesting. The idea of like, cause I mean, you think about your browser history, right? Like the fact that you can't sort of query your browser history to be like, what was that page I was looking at about X, Y, and Z is silly. Like you should be able to do that. The information's right there. It has it anyway. Right. So to be able to take information that like, of course it already has and do something with it, that's a pretty compelling use of AI. To me again, I, I wonder what that will look like and whether it will totally collapse this supposed good performance battery life of my computer. Yeah. And advertising companies basically have access to your search history. I mean, not in the literal sense, but by tracking you around the web, so, and they can make relevant queries. So it would be really useful to be able to look back in useful AI powered ways. So yeah, I see the, I see the big benefits of it. It's just how they sell it and the privacy aspects and everything else. Do you think all the other Windows manufacturers are going to be? Into the co pilot idea and co pilot key the same way that Microsoft is? Yeah, I think I probably, um, because usually they, they follow. I guess they don't have much choice in a lot of cases. Microsoft will say, you can put, you know, some of your stuff where you can make a tiny bit of revenue on everything. And they have all these big deals, um, with OEMs to incentivize all this sort of stuff. So that they'll have like marketing deals. It would just basically be one of those things where it's like, if you're an OEM, you kind of have to go with it. Cause we obviously saw in the past, um, support for windows alarm from a bunch of OEMs, some of them pull it pretty quick, but they all kind of, most of them did one or two models just in support of it. So I think, I think there will be support for it. Um, I think most of them will probably ship the co pilot key, um, eventually as well, um, even if not all of them have yet, but, um, yeah, I think it'd be pretty poorly supported. Okay. And for Microsoft, it seems like this event in may actually turns out to be a pretty big deal. Even if it is, you know, relative sort of spec updates of things like, I don't know, my, my last question for you was basically going to be like, what do we think year two of Microsoft's all in on AI bet is going to look like? And I kind of feel like what it sounds like is we're going to know the answer to that much more clearly when we see this new hardware that like, that is going to be the. Way to see what all this looks like. Yeah, I think the key is the snapdragon chip, like how, how that performs. If it lands well, then you can imagine there's gonna be next gen AI PCs, which they, they will see talking about internally. I think these are considered next gen, whereas. Perhaps the stuff that's in the market right now of NPUs is, is, you know, current gen or whatever, but yeah, I think year two will be, I hope it's like more fleshing out windows and how it's actually using all this, this NPU power, um, and leveraging it all locally on the device, because it's still, that's the main feature. I think there's going to also be a video streaming improvement as well. And that's the other. Kind of main feature that there, um, there's two features that they're kind of selling for the next gen AI PCs, but marketing slogan. It's interesting to hear you talk about AI as the sort of startup inside of Microsoft. It like, it actually makes a lot of the last 12 months make a lot of sense. Yeah. Both in terms of this sort of like flailing around all over windows, trying to figure out what to do, but also some of the stuff like. The growth hacking inside of edge inside of windows. Like that's the kind of stuff that big mature companies do less of, but startups do lots of, and that culture clash, I think it's like maybe why it felt so bad as a user to get some of that stuff over the last year where it's like, Microsoft, this is gross. Like, leave me alone. I'm just trying to use your web browser for God's sake. But it's interesting because the Windows engineers have obviously gone back to the Surface side, but they've kept Bing, Edge, and Copilot on that Microsoft AI side. So that does suggest that they'll be doing all of the AI work within those, those three brands. So we might not get as, I don't know, as pushy, hopefully as pushy stuff in the Windows. Um, experience itself. So, but it's just probably still going to be messy. Yeah. I did want to mention one thing that the interesting thing that I think they're going to say, and I, well, I kind of know from sources is, you know, how Microsoft used to say a PC in every home was like the window slogan, right? It's going to be a copilot for every person. Like that's how they're going to sell this now. Yeah. And, and they're hoping to get to like 50 percent of new laptops, like by the end of 2026 will be have all these, all the NPU hardware on them. Interesting. And that's very telling. Yeah. When you get to that scale, then it's quite telling of their, their ambitions and where they might go with us. Fair enough. All right. Well, we're, we're going to have to check back in, in May. I'm so skeptical of these Qualcomm chips, Tom. I cannot even tell you, but boy, I hope they're awesome. I'm so skeptical of AIPC slogan, marketing nonsense. Yeah. If anyone knows what an AIPC is, please email us vergecast. com. I want to know. I want to know too. All right. We got to take one more break and we'll be right back with the Vergecast Hotline. Thank you, Tom. All right. Thank you. All right. We're back. Let's get to the hotline. As always, the number is 8 6 6 Verge one one. The email is vergecast@theverge.com. We love all of your questions. We try to answer at least one on the show every week. Thank you to everybody who has been calling in. The questions have been so weird the last few weeks. I love it. I wish we could do more of them. We're gonna do more of them. We've definitely gotta do a hotline episode soon because we've got a bunch of really fun ones to get into. For now, we have a question from Josh. Hey David, this is Josh calling from Northern Washington State. I recently watched a World War II documentary on Netflix, which is pretty meh. Now, my question is, I like World War II documentaries. So how should I rate this on Netflix? Should I give it the thumbs up, the two thumbs up, or the thumbs down? Because I want to see more World War II documentaries. So how does the algorithm take it? If I say thumbs down, will it not recommend any more documentaries for me? Or if I give it two thumbs up, would it say, Oh, you like mediocre documentary. So I'm going to recommend more mediocre documentaries for you. I'm really confused on how to train the algorithm when it comes to mediocre shows and all of these algorithms that, you know, really want to show me things rather than me letting me choose things. Really appreciate your help with this. Thanks. If you've been listening to this show for a while, you know that recommendation systems are like an obsession of mine. So, in order to answer this question, I went back to an interview I did last year with Pat Fleming, who is a Senior Director of Product Management at Netflix. Basically, he runs the member experience team. So, everything that you do when you use the app, that is his responsibility. And one of the things that is his responsibility is all of this recommendation stuff. You can listen to a lot of our interview in an episode from last fall, I'll put that in the show notes. But one of the things we talked about specifically was basically how to tell Netflix what you do and don't want to watch. He gave me a bunch of information on kind of what Netflix cares about, what it's paying attention to, what you can do to signal it. All this good stuff. So the first one is, let me just play you a clip from that interview in which he described a few of the things that Netflix is looking for. The biggest one is what you watch. What you watch and don't matters most. But here is Pat describing some of what Netflix cares about. You could think of titles as being broken down into these constituent components. This metadata, it's, is it a movie or a film? What's its originating country? How long is it? What language is it available in genre, perhaps some tagging about attributes of the title. And those things all help to sort of round out what a title is like. And then you match that against member tastes and preferences and take that sports docs, drama, baking shows. If you watch any two of those things, And lots of people watch all three of those things, then it's a pretty good chance that that third genre might be interesting to you. And so some point in time, you'll discover some genre that what wouldn't otherwise have been your consciousness and try it out on Netflix. One of the other things Pat and I talked a lot about was these thumbs. I've always been fascinated by the thumbs versus stars thing. Uh, here's actually how Pat described why Netflix goes with the thumbs thing, two thumbs up, one thumbs up or thumbs down instead of like a zero to five stars ranking. When you really love it, give it two thumbs up. When you love it, give it a thumbs up. And if you didn't like it, that's okay, let us know. Give it a thumbs down. So that's one very concrete way. I actually like that explanation a lot. And it really makes sense to me. I think about things like Yelp, where everything seems to be 3. 5 stars, and you don't know whether that's good or bad. Any restaurant on Yelp that's over four stars, I assume, is great, and anything that's under, like, 3. 8, I assume, is awful. That doesn't make any sense, but that's kind of where we are. And then you get in an Uber, and anything other than five stars essentially means, I would like for you to be fired, which also doesn't make any sense. So we're in this odd place where different levels of stars mean different things depending on where you are, and there's no real rubric for it. So I think in this case, the thumbs up, thumbs down thing, is much easier to parse. But again, for our friend Josh here, not quite as easy to parse. One more thing about the thumbs. I think this is actually kind of relevant, which is that a thumbs down is very important. So what I would say in this case is unless you truly loathe this documentary and don't ever want to see anything like it, do not thumbs down. Because what I heard from Pat is that they'd love to have more information about why you gave something a thumbs down, but they really don't. The magic would be the longer that you spend, the better that final recommendation would be, because we would then have known so much more about the things you could have been interested in and might not have been interested in. So one thing that's a little more challenging is extracting, say, negative feedback from you. So it would be nice for us to know with a little bit more precision when you skip over something, whether you spend a little bit of time with a trailer and you say, Oh, that's not for me tonight. Sometimes that's a little more challenging for us to know precisely in the moment. And that's an area where we want to spend a little more time. So basically, where Pat landed on that one is, if you're going to do a thumbs down, they are going to take that as a very strong signal that you don't want to see this anymore. And it's possible that over time, Netflix will get better at understanding what you mean by that. Whether, like Pat said, you never want to see it again, or you just don't want to see it tonight. I would use that pretty sparingly and as a kind of gavel that just says, get this out of my face. So that's a thumbs down. Wouldn't do that for this one. So we're down to one thumbs up or two thumbs up for this one. Here is how Pat described the difference, which I would argue is both helpful and unhelpful. Thumbs is a simple way for you to provide feedback on whether you like something or didn't like something. The the trick on stars is sometimes you might rate something very highly. Stars because that's how something you think something ought to be perceived. So it's critically acclaimed. And so you feel like it deserves many stars as opposed to how did you actually feel about it? And that's what's more meaningful to improve. Your recommendations is the reflection of how you actually felt about something and whether it was good for you. And so thumbs has the benefit of one being simpler and to hopefully being a better reflection of what you actually love or didn't love about what you're watching on Netflix. Okay, right. Helpful and unhelpful. But I would say, for you, Josh, I think we are squarely in one thumbs up territory. To me, I think of it as, one thumbs up is like, I had a nice time, or I'm glad I watched this, or Or I'm psyched that this exists and was being recommended to me. It's kind of like, uh, anything that you see that you'd make the noise of just like, yeah, it was good. Like that to me is one thumbs up, right? It's not, I'm staking my reputation on the quality of this. This is the greatest thing that I've ever seen. I would watch this every single day if it made sense for me to do so. It's just like, yeah, it's a, I had a nice time. It's how I feel about like 95 percent of movies I've ever watched on planes. Right. Not the worst way to spend two hours. We'll do it again. Probably not going to write about it in my diary at the end of the day. Whereas two thumbs up is like, yes, please. Netflix ruin my recommendations with this one. I want to see everything that you think is associated with this specific title, the people who made it, the thing it's about when it came out, what it looks like, the colors in the background in the third scene, like, yes, Netflix. Yes. And I don't think we're there on this one. So I think we are squarely in one thumbs up territory. I'd be curious to know what everybody else thinks, how you would rate this, but I feel like I'm saying, yeah, show me more stuff kind of like this, but I want you to know this was not the best version of this. One thumb up. Before I go though, I went back through the interview with Pat and tried to pull out a bunch of the things that he told me about how to signal to Netflix what you do and don't like. So let me just run through a few of them. One of the ones that he said is if you go to the upcoming stuff, the stuff that hasn't come out on Netflix yet. If you watch a trailer for something, but especially if you hit the remind me button to get notified when something comes out, that's a super strong signal that you like that stuff. It means you went way out of your way to actually go and get it and declare your intention to watch it to Netflix. That's a super strong signal. So is watching stuff to the end. Netflix cares a lot about where you fall out of a show, so the more of it you watch, the better. And I would say even in the case of like a documentary you ought to like but isn't your favorite, if you just sort of leave it on and leave the room until it ends, that's a pretty good signal that you want to see more of this. Whereas if you shut it off after three minutes, that might be a strong signal that you don't. All of this is tricky push and pull stuff, but how far you watch is a strong signal. What you scroll past is also a strong signal. This kind of goes with the thumbs down that Pat was talking about, where if I scroll past 10 thumbnails of things, it's very hard for Netflix to figure out why I don't want to watch those things, but it knows that I don't want to watch those things. And it's getting stronger and stronger. at recommending stuff after that, right? It can say not only here's what you watched and liked, but okay, you don't want to watch this. You don't want to watch this. You don't want to watch this. Oh, that must mean you're in the mood for a movie or a cooking show or whatever it has to be. And so that stuff is coming more slowly, but actually what you don't watch is a real signal. So is what you search for, even when you search for stuff that's not on Netflix. If you go in and type in the title of something, it'll both give you the recommendations for things similar to that that you might watch on Netflix, which, again, if you go watch, strong signal that you like that, but also, it just shows Netflix what you care about. It's tracking that stuff. It wants to know what you want to watch. Even the stuff that's not on Netflix. So that is a strong signal. One other one is just the taste profile that you have. I don't know if you do this too, but I always just leap through the thing at the very beginning of any music service or streaming service or whatever, where it's like pick three titles that you like, but it turns out that's actually pretty important and goes a long way towards sort of kickstarting the personalization that Netflix and all these other services do. So if you're new to Netflix or if you want to go back in and do it again. That is a thing you can do, and it is apparently more important than I have given it credit for. It's called your taste profile, and Netflix cares a lot about it. But again, the single most important thing you can do, according to Pat, is just watch stuff. It is much more attuned to what you click on and what you actually watch than anything else. I'm kind of in this position where every time I scroll on Netflix or click on anything, I'm petrified of what I'm teaching the algorithm. I think we all feel this way about YouTube and TikTok and all these other things where it's like, Oh no, did I linger too long? Is the app going to think I like this and show too much of it to me? I think Netflix is working on that a little bit. But again, the fact that you went in and watched this whole documentary is a stronger signal to Netflix than how you rate it. So, if you want more of these documentaries, I wouldn't worry too much about it. Just keep watching the documentaries. That's my main advice. One thumb up for Netflix. Two thumbs up for cool documentaries. Alright, that is it for the Verge cast today. Thank you to everybody who was on the show. Thank you to everybody who called the hotline and sent us emails. And thank you as always for listening. There's lots more on everything we talked about and my old conversation with Pat in the show notes on theverge. com. Read the website. It's a good website. There is so much stuff going on this week. It's nuts. As always, if you have thoughts, questions, feelings, keyboard layouts I should know about, or anything else, email us vergecaststotheverge. com, call the hotline 866 VERGE 11, looking forward to hearing from you. This show is produced by Andrew Marino, Liam James, and Will Poore. The Verge Cast is a Verge Production and part of the Vox Media Podcast Network. Neal, I, Alex, and I, after a series of vacations and illnesses, will be back on Friday, and we have a lot of news to catch up on. We'll see you then. Rock and roll.",
    "transcript_keywords": [
        "Microsoft",
        "stuff",
        "Keyboard",
        "thing",
        "Yeah",
        "things",
        "Netflix",
        "kind",
        "key",
        "Alternate Keyboard Layouts",
        "lot",
        "keys",
        "Windows",
        "thumbs",
        "surface",
        "people",
        "Keyboard Layouts",
        "good",
        "sort",
        "Jonas"
    ],
    "transcript_entity_values": [
        "hours",
        "Bing",
        "theverge",
        "over 20 years",
        "AMD",
        "The Verge Cast",
        "Vox Media Podcast Network",
        "Virgin",
        "Andrew Marino",
        "three",
        "a bunch of years ago",
        "F O Repeat L.",
        "Surfaces",
        "AI Explorer",
        "last fall",
        "the last few years",
        "Ferris",
        "six ish months ago",
        "5",
        "the end of the day",
        "Google DeepMind",
        "2%",
        "Bloomberg",
        "Colmac",
        "Verge",
        "Yelp",
        "Mikhail",
        "a few months",
        "every year",
        "2024",
        "AI PC",
        "three minutes",
        "English",
        "Pavan Davaluri",
        "Two",
        "One",
        "the last 12 months",
        "Tom Warren",
        "T34",
        "Alex",
        "a million",
        "Gemini",
        "TikTok",
        "Edge",
        "YouTube",
        "Microsoft",
        "Apple's M one",
        "like 50 percent",
        "David Pierce",
        "MacBook Airs",
        "six months",
        "Swedish",
        "Sweden",
        "May",
        "this week",
        "third",
        "The Verge Casts",
        "the last year",
        "a number of years",
        "Tom",
        "Windows 11",
        "Google",
        "countless hours",
        "about six months ago",
        "May 20th",
        "Windows and Surface",
        "Excel",
        "XElite",
        "Qualcomm",
        "every week",
        "30 a month",
        "NPU",
        "Alternate Keyboard Layouts",
        "ColMac",
        "12",
        "a hundred years",
        "Pano",
        "Netflix",
        "Liam James",
        "first",
        "one to two hours",
        "Friday",
        "a year ago",
        "Windows",
        "a ton",
        "Snapdragon",
        "10",
        "Fair",
        "GPT",
        "Surface",
        "last year",
        "Mustafa Suleiman",
        "next year",
        "a few days",
        "30 year old",
        "MacBooks",
        "QWERTY",
        "Clippy",
        "500 million",
        "Ergodox",
        "Hands Down",
        "about one",
        "Josh",
        "like a zero",
        "Windows",
        "AI",
        "AMD",
        "Windows",
        "8",
        "an evening",
        "Z.",
        "Neal",
        "AIPC",
        "the last few weeks",
        "Beacle Theory",
        "two hours",
        "15 years ago",
        "last week",
        "about like 95 percent",
        "second",
        "Core Ultra",
        "five",
        "this every single day",
        "QWERTY",
        "Intel",
        "Northern Washington State",
        "Pat Fleming",
        "Panos",
        "12 months ago",
        "the year",
        "about two",
        "Emacs",
        "sec",
        "Thumbs",
        "Beakle",
        "M3",
        "Beagle",
        "2026",
        "a few weeks ago",
        "one",
        "Microsoft AI",
        "Jonas",
        "Apple",
        "OO",
        "four",
        "Superbowl",
        "Panos Pene",
        "today",
        "Will Poore",
        "hours and hours",
        "every night",
        "Bing",
        "holidays last week",
        "Vim",
        "Europe",
        "six",
        "120",
        "34",
        "tonight",
        "Nadella",
        "two years",
        "years",
        "the years",
        "17",
        "Jonas Hietala",
        "F O O L.",
        "3",
        "866",
        "at least one",
        "Pat",
        "the last couple of years",
        "World War II",
        "two",
        "Product Management",
        "sixth",
        "all day",
        "Dvorak",
        "Amazon",
        "Bing and Bing",
        "David",
        "Windows and Surface",
        "the end of",
        "NeoVim",
        "RSI",
        "one second",
        "McCall",
        "26",
        "Nvidia",
        "Jonas",
        "Workman"
    ],
    "transcript_entity_types": [
        "TIME",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERCENT",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "TIME",
        "LANGUAGE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "DATE",
        "NORP",
        "GPE",
        "DATE",
        "DATE",
        "ORDINAL",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "TIME",
        "DATE",
        "DATE",
        "NORP",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "CARDINAL",
        "TIME",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "DATE",
        "DATE",
        "PERCENT",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "LOC",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "TIME",
        "TIME",
        "ORG",
        "DATE",
        "PRODUCT",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "EVENT",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "PRODUCT",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON"
    ],
    "vector": [
        -0.07861749082803726,
        -0.14639534056186676,
        0.0024443138390779495,
        -0.10631659626960754,
        0.019670935347676277,
        0.03724251687526703,
        -0.009521313942968845,
        0.041414715349674225,
        0.061103641986846924,
        0.09032972157001495,
        0.012088915333151817,
        0.04938996210694313,
        0.051106046885252,
        0.004209328908473253,
        0.015408857725560665,
        0.001941078226082027,
        0.05696365237236023,
        -0.10684990882873535,
        -0.034612786024808884,
        -0.003094683401286602,
        -0.05543418973684311,
        -0.029095439240336418,
        -0.004277457483112812,
        -0.07146723568439484,
        -0.020495112985372543,
        0.00964605063199997,
        -0.032696425914764404,
        -0.010492967441678047,
        -0.004229751881211996,
        -0.01878160797059536,
        -0.06063917279243469,
        0.0714883878827095,
        0.05894128605723381,
        -0.00957801565527916,
        -0.07369203865528107,
        -0.041371945291757584,
        -0.005274865310639143,
        0.0192221961915493,
        -0.11541768163442612,
        -0.07351536303758621,
        -0.07332766801118851,
        -0.05460334196686745,
        -0.004675670992583036,
        0.026225754991173744,
        0.11436741799116135,
        -0.007519696373492479,
        -0.02602674625813961,
        -0.07476044446229935,
        -0.0012159827165305614,
        0.054349999874830246,
        -0.05328478664159775,
        -0.07772120833396912,
        0.05890483036637306,
        0.010868693701922894,
        -0.06568180024623871,
        0.07405249774456024,
        -0.001153399352915585,
        0.07979559153318405,
        0.08413843810558319,
        -0.0496179573237896,
        0.05577270686626434,
        -0.09602176398038864,
        0.005496302619576454,
        0.020160363987088203,
        -0.003452602308243513,
        0.07938813418149948,
        -0.05072733759880066,
        -0.01403870526701212,
        -0.0009241383522748947,
        -0.037614598870277405,
        -0.0825093612074852,
        -0.026320237666368484,
        -0.0193804781883955,
        -0.06925060600042343,
        0.013708550482988358,
        -0.0245366208255291,
        0.05996675416827202,
        -0.084069162607193,
        -0.014430807903409004,
        -0.025837885215878487,
        0.029534028843045235,
        0.021337199956178665,
        -0.0027477482799440622,
        0.056378547102212906,
        0.055126942694187164,
        -0.01630077138543129,
        0.025174668058753014,
        0.008380115032196045,
        -0.03917650133371353,
        -0.03272353485226631,
        -0.03697948902845383,
        -0.013078901916742325,
        0.043500807136297226,
        -0.01802949607372284,
        0.00543744582682848,
        -0.014733253046870232,
        -0.012462703511118889,
        -0.1060313954949379,
        -0.08816858381032944,
        0.02419285848736763,
        0.03861241042613983,
        -0.01592203974723816,
        -0.005909486208111048,
        -0.08341629058122635,
        0.047841060906648636,
        -0.03378446400165558,
        0.04933375120162964,
        0.03700893744826317,
        0.03548368811607361,
        -0.03307671472430229,
        -0.020635249093174934,
        0.02366061508655548,
        -0.04579226300120354,
        -0.020576711744070053,
        -0.014862040989100933,
        0.013800714164972305,
        0.08027644455432892,
        0.0667385533452034,
        0.1332472860813141,
        0.033959824591875076,
        -0.0020076357759535313,
        0.027791572734713554,
        -0.13133566081523895,
        -0.005728761665523052,
        -0.007283719256520271,
        0.017056506127119064,
        -0.05031662434339523,
        6.796038304674498e-33,
        0.01448189839720726,
        0.14171750843524933,
        -0.06012421101331711,
        -0.07568354904651642,
        0.10590517520904541,
        0.024501599371433258,
        0.04664148390293121,
        0.05535242334008217,
        -0.03730462118983269,
        -0.04277117922902107,
        -0.02634972333908081,
        -0.0001311276137130335,
        -0.014087171293795109,
        -0.009084983728826046,
        0.0032588995527476072,
        -0.07480300217866898,
        -0.01316817756742239,
        0.07561756670475006,
        -0.14480677247047424,
        -0.07572829723358154,
        0.030986545607447624,
        -0.010211223736405373,
        0.006348967086523771,
        -0.0703025832772255,
        0.03732440248131752,
        0.013383455574512482,
        0.02000705897808075,
        0.0006093005649745464,
        0.11070918291807175,
        0.019373714923858643,
        -0.11758887767791748,
        -0.01602535881102085,
        -0.07662246376276016,
        -0.06711344420909882,
        -0.042373932898044586,
        -0.01457538828253746,
        -0.026912810280919075,
        -0.08499179035425186,
        0.027241405099630356,
        -0.020536666736006737,
        -0.09299732744693756,
        0.028434570878744125,
        -0.0033864378929138184,
        -0.08476859331130981,
        0.009024606086313725,
        -0.007716583088040352,
        0.038869235664606094,
        0.07736756652593613,
        0.03915678337216377,
        -0.04348631203174591,
        -0.013206377625465393,
        0.02378549426794052,
        -0.054646752774715424,
        -0.02186715044081211,
        -0.016638899222016335,
        -0.12086992710828781,
        -0.014848806895315647,
        0.04809381812810898,
        0.05482635647058487,
        0.0789734497666359,
        0.06139965355396271,
        -0.005213097669184208,
        0.006403025239706039,
        0.03870270028710365,
        -0.059125933796167374,
        0.010566419921815395,
        0.09476140141487122,
        0.04203767329454422,
        -0.04582487791776657,
        0.028933940455317497,
        -0.033311598002910614,
        -0.0022791509982198477,
        0.003925609868019819,
        0.05320403724908829,
        -0.017540469765663147,
        0.009188661351799965,
        -0.019774720072746277,
        -0.08163769543170929,
        -0.005298548843711615,
        0.004332870244979858,
        -0.03706618398427963,
        0.07020962238311768,
        0.016946831718087196,
        -0.03831399977207184,
        -0.02150818146765232,
        -0.05071656405925751,
        -0.003756183199584484,
        -0.04951433464884758,
        0.025511672720313072,
        0.004311876371502876,
        -0.06833972036838531,
        -0.03569788113236427,
        -0.01426522433757782,
        0.0555647537112236,
        -0.07332022488117218,
        -5.5928588578384375e-33,
        -0.0959109514951706,
        0.021012082695961,
        -0.0918220654129982,
        0.03325876593589783,
        -0.05176283046603203,
        0.004148290492594242,
        0.004848239943385124,
        -0.03769337013363838,
        0.0114279231056571,
        -0.08768089860677719,
        0.021615633741021156,
        0.020506128668785095,
        0.0330822728574276,
        -0.033691875636577606,
        9.708463767310604e-05,
        0.01725718192756176,
        -0.0037064487114548683,
        -0.004891734104603529,
        0.02463134564459324,
        -0.038891129195690155,
        0.04130573943257332,
        -0.032932206988334656,
        -0.14192689955234528,
        0.05151060223579407,
        0.008182651363313198,
        0.055711399763822556,
        0.07448425143957138,
        0.09647546708583832,
        -0.006611665710806847,
        0.035035282373428345,
        -0.06739120930433273,
        0.0023787894751876593,
        -0.05319034308195114,
        0.017727449536323547,
        0.03807883337140083,
        0.11872534453868866,
        -0.038600485771894455,
        -0.05001537501811981,
        -0.03448270633816719,
        0.04780086129903793,
        0.07621490210294724,
        -0.044435176998376846,
        0.056137435138225555,
        0.00031177737400867045,
        -0.021597642451524734,
        -0.021666288375854492,
        -0.05853438377380371,
        -0.02046264335513115,
        0.009077247232198715,
        -0.013360896147787571,
        0.06690680235624313,
        0.010672314092516899,
        -0.004177328199148178,
        0.0028348760679364204,
        -0.11230779439210892,
        0.01178805809468031,
        -0.03369078412652016,
        0.060586005449295044,
        -0.0060485973954200745,
        -0.05080801621079445,
        -0.016538996249437332,
        -0.0094152158126235,
        0.018186286091804504,
        0.010010141879320145,
        0.04210517928004265,
        0.04073946177959442,
        0.09794211387634277,
        0.00926261954009533,
        -0.03270129859447479,
        -0.027761239558458328,
        0.001679487177170813,
        0.012673299759626389,
        0.038187962025403976,
        -0.007223119027912617,
        -0.0016215420328080654,
        0.06229144334793091,
        0.08480505645275116,
        -0.016570808365941048,
        -0.056457869708538055,
        -0.019510067999362946,
        0.026670094579458237,
        0.007005944848060608,
        0.09215772151947021,
        0.03816729038953781,
        0.058919548988342285,
        0.09402509033679962,
        0.019902169704437256,
        0.0642051249742508,
        -0.02648789808154106,
        0.06150616332888603,
        -0.0270073264837265,
        -0.010164533741772175,
        -0.030318617820739746,
        0.10581915080547333,
        0.07842716574668884,
        -5.604451303042879e-08,
        0.008024505339562893,
        0.022528845816850662,
        -0.015329812653362751,
        0.02569379098713398,
        -0.040029119700193405,
        -0.028908006846904755,
        0.06703954935073853,
        0.002938506193459034,
        -0.03903716430068016,
        -0.0035781969781965017,
        -0.036325596272945404,
        -0.0827639251947403,
        -0.03837554529309273,
        0.015365365892648697,
        0.11655260622501373,
        0.15721793472766876,
        -0.007309077773243189,
        0.0313761867582798,
        0.0031843583565205336,
        -0.029544783756136894,
        0.077192023396492,
        0.020930806174874306,
        0.051823362708091736,
        -0.03536675497889519,
        -0.005454179365187883,
        0.023094335570931435,
        -0.02738756127655506,
        0.07079305499792099,
        0.03934388980269432,
        -0.06447473168373108,
        0.03323772922158241,
        -0.0019290202762931585,
        0.03061792440712452,
        -0.018927277997136116,
        -0.057243406772613525,
        -0.014899216592311859,
        0.003560525830835104,
        0.030970703810453415,
        0.04835416004061699,
        0.0971449688076973,
        0.0019510751590132713,
        -0.029917037114501,
        -0.058341722935438156,
        0.0023038089275360107,
        -0.018388964235782623,
        -0.003441709093749523,
        -0.017250632867217064,
        -0.05184916406869888,
        0.01352763269096613,
        0.01690281368792057,
        0.0016857647569850087,
        -0.03936220705509186,
        0.12771178781986237,
        0.05712030082941055,
        0.04471747577190399,
        0.060597408562898636,
        0.014470848254859447,
        -0.005212056450545788,
        0.015329267829656601,
        0.057960111647844315,
        0.01847248710691929,
        0.0315164290368557,
        -0.049589645117521286,
        0.04320807009935379
    ]
}