{
    "id": "CT_gHSwdj2c",
    "title": "The Thin and Light Gaming Laptop - Alienware X15",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-10-04T19:37:33Z",
    "video_url": "https://www.youtube.com/watch?v=CT_gHSwdj2c",
    "category": "Science & Technology",
    "tags": [],
    "views": 475607,
    "likes": 14259,
    "comments_count": 662,
    "description": "Save 10% and Free Worldwide Shipping by using offer code CIRCUIT at   If you're looking for a gaming laptop without the bulk, then the 2021 Alienware X15 might be for you.  Buy Alienware X15 On Best Buy (Paid Link):  On NewEgg (Paid Link):   Buy Alienware X17 On Best Buy (Paid Link):  On NewEgg (Paid Link):   Buy Dell XPS 15 On Amazon (Paid Link):  On Best Buy (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 Intro 0:30 Charger 1:00 Unboxing 1:28 Overview 3:20 Downloading 5:10 Display 7:55 Gaming 8:47 Webcam 10:01 Audio 11:05 Cracking it open 12:30 Outro",
    "description_links": [
        "https://www.ridge.com/CIRCUIT",
        "https://geni.us/lRalfDv",
        "https://geni.us/ZHpjR",
        "https://geni.us/OG2e",
        "https://geni.us/0q4o",
        "https://geni.us/VMBByRH",
        "https://geni.us/NLRY",
        "https://geni.us/rlK7A9B",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Sure, lots of gaming laptops have loads of FPS and vapor chambers or whatever the crap, but I don't want to carry this in my backpack. Super heavy. I want something more like this. The new Alienware X15, and well, I haven't seen it yet, so I guess we'll see if it's good or not pretty soon. Oh, fancy box. Can you see that? There's like an exploded view of the laptop. We'll open that in a second though. Here's the charger. It's not type C, although I would not expect you to be given it's 240 Watts, which is very impressive. Look at the size of this thing for 240 Watter, that is not bad. Oh, Alienware, strike number one. We have a USB type C two ethernet adapter, which means there's presumably no ethernet on this laptop, which makes me sad. Here we go. (smooth RnB music) Do do do do. (beep) (laughter) It's very fancy, more exploded view, but this time in black and gloss, and we get our laptop. This is quite thin and surprisingly light. The XPS15, just under two kilograms, where as the Alienware X15, 2.3 kilograms. So it is a little bit more, that is rather light for a gaming laptop, especially given this has a 3080 in it. So right off the bat, the IO is not fantastic. We have full-size HDMI, like to see that. USB type C, mini SD reader, Thunderbolt, and USB type A, one USB type A and that's it. The most confusing part here is that it looks like there's lots of space where they could have put, like, if they had two or three USB type A's back here, that would be just so much nicer and so much more usable, because like right now you're going to plug in a mouse, and you're done, that's your USB right there. On the X17, we have two USB type A's, full-size ethernet, and also mini display port. Was there one of those on here? No. What is definitely undeniable though, is that this is very thin for a gaming laptop. Okay. Oh, it just started up. I didn't even have time to tell you about our sponsor, Ridge Wallet. Thanks to Ridge Wallet for sponsoring today's video. We give you a compact wallet to keep your pant bulge down. It has RFID blocking plates to keep people from stealing your info, and there are over 30 colors and styles, including carbon fiber and burnt titanium. Save 10% and get free worldwide shipping by using offer code CIRCUIT at Ridge.com/circuit. How is this looking, at as a small track pad. That's my first impression. Alienware did the same thing with the X17, where they sacrificed track pad size in the name of venting. So, vents along the sides, vent along the top, vents along the other side, vents on the back, and also there's a bunch of venting on the bottom. This apparently is very well cooled. Look, there's half my IO gone. Stupid. All right, we are downloading some games, and it's already a bit on the loud side. Let's go to hardware info and try and figure out just how hot it is getting, like we are just installing games. It shouldn't be too bad. Peak CPU temperature so far is 95 degrees. So, that's kind of hot. Actually, what I'm going to do, let's make sure that this is totally fair. I love these desk pads, but it's probably not great for the thermals. Don't want people getting mad at me in the comments. All right, while the games download, let's just figure out how the rest of it is. Track pad, it's too small. I was just using it and my finger stopped being on the track pad and started being on the keyboard, when I thought it should have still been on the track pad, so, but it's RGB, Most track pads can't say that much. Okay, Brandon just said, \"it's a gaming laptop, will you use the track pad all that much.\" Maybe not, but the Zephyrus M16 has a really, really good track pad, and it's a similar size to this, so I want a big track pad. (typing) Keyboard is fantastic. I do wish that there was an option so that I could give Alienware a bit more money, and they would give me their really excellent Cherry keyboard. It still is, like, A+ territory for gaming laptop keyboards. It's just not like the cherry one. One thing that is rather disappointing for me, I didn't care on the 17, but on the 15, I really want 16 by 10. So like, there's loads of space here, like you can see there's bezel down here that could be not bezel. There's also a lot of hinge, that could be screen, and not hinge. The panel itself though, it is very good. I would not get this one. So this is the 1080p, 360 Hertz version. This right here is, like, try hard mode, you're trying to get ranked in CS:GO or whatever. There is a 1440p version that's 240 Hertz, 240 Hertz is a lot of Hertz and 1440p is wicked, so I would go for that one for sure. Let's go over the full specs here though. So for the CPU, we have an i7-11800H, so eight cores. I think that's 4.7 gigahertz total. 32 gigabytes of Ram, 3,200 megahertz. We have, oh, it looks like two, one terabyte SSDs in a raid zero config, super speedy. Oh cool. I was thinking our download was really fast, It's peaked at 140 megabytes per second, and that's because this little adapter right here is two and a half gig. I wasn't expecting that, but that's quite an awesome little adapter then. And we also have an RTX 3080. So, we don't get the RTX 3080 in this laptop. I'm just going to say that, even if it is well cooled, you're kind of just wasting your money. It's 110 watt version, and at that point you might as well get the 110 watt version of the RTX 3070. I guess, do we just start some gaming? I want a game. One problem I've noticed almost immediately, is that, not only is the track pad super small, but because they have all this venting up top, the keyboards move down, and my hand just is not comfortable. It's like it's resting here, but like, my wrist is kind of resting off of the edge in a rather uncomfortable manner. It wasn't really a problem when I was typing, to kind of go like that, but when I hit WASD, and like, a finger comes down to shift, it's sort of hanging off the edge in like this weird, not super comfortable way. Also, this screen is not particularly bright. Having trouble figuring out what's on the go here, but, actually Brandon, can we turn the lights down a little bit in here? Okay, yeah, I just looked it up, so both of the 1080p panels are only 300 nits, and like, we turn the lights down in here, and this is actually a very good looking display, and, the 360 Hertz of it is very nice, but the 1440p panel is 400 nits, and I probably wouldn't have had to ask Brandon to turn on all the lights in here, if I was using that one. I don't know quite how many FPS we're getting right now, but it's more than enough for Valheim, it's easily in the hundreds, I would say. Right in the basement, we're getting like 30, 40 FPS. That's kind of about what I would expect. That's kind of all that you get in this house. Well, I just opened up Hardware Info, CPU's been hitting a hundred degrees Celsius, love to see that. How's the GPU doing? Oh, the GPU, at least, is doing pretty good. So, maximum of 75.9 degrees, they have clearly preferred GPU cooling over CPU cooling in this chassis. You're not using open back headphones if you buy this thing. While we wait for battlefield to finish installing, let's check out the webcam. Testing, testing. I have no clue if the audio is working in this clip, but it looks okay-ish. This isn't great. That's for sure. I don't expect a whole lot out of these webcams. The one thing that is nice about the webcam though, is that, along with the webcam, you also get Windows Hello facial recognition. Awesome way to get into a device. Really like to see that. Wow, this is running incredibly well, so I'm an ultra right now, and we are getting 190 FPS. That is extremely good for this game. This is definitely not a super bright display, but at the same time, I wouldn't be incredibly concerned about it, unless you, like, game outdoors or something, because most of you aren't gaming with studio lights on you. So again, in Battlefield there, we hit a hundred degrees on the CPU. Now, if that's a bad thing or a good thing, it's kind of hard to say. We don't have the time in a short circuit to figure it out, but it's the sort of thing where, a hundred degrees on the CPU in a thin laptop like this, is not necessarily a bad thing. And I don't know if, when it's at a hundred degrees, it's dropping down, but like, I didn't notice any problems in the game, although I also didn't play for a super long amount of time. Okay, we haven't started Crab Rave yet, but this kind of gets to my main problem with this laptop. Like, you can see that the display is like, what, nearly an inch taller than the one on the XPS 15, but you're just getting less screen than you have here on the 16 by 10. (Crab Rave) So this is, this is terrible. These are awful speakers, so, Alienware to Dell. (Crab Rave) It's not even not even close. The X15 is good at making noise, but not out of it's speakers. Oh, one thing that definitely should be noted, this has a MUX in it. So you are not going to be losing any of the performance from the GPU, getting to the display. The X17, which I complained a lot about in that review, also has a MUX in it, and they enabled it the day before review went up. Didn't tell us. So, I'm sorry, Alienware. You actually made a really good laptop that's super fast. So for the battery, we have an 87 watt hour version in here, it takes up a lot of space, and given how thick this thing is, I'm surprised they were able to fit that much battery in there. I have no clue how long this is going to last. It might be four hours, it might be eight. Aside for the battery, we have a wifi module that you can swap out, and two SSDs. No Ram though, that is soldered straight to the motherboard. We do get a glimpse at the cooling system in here. So we have our four fans, radiator goes all the way along here, fins just along the sides, also, all of the top up here is all fins. The cooling in here is freakin' sweet, as is, like, the build quality of this thing is exceptional, but I don't know how to feel about it, if I'm honest. What are you going for Alienware? On one hand, this is an exceptional gaming device, like, if you just want to game, put on some headphones, awesome. But on the other hand, it's so thin and light. I wish that they'd just sacrificed a bit of that gaming, and given me a little bit more of, like, productivity and general usefulness, like, this had just a slightly larger track pad, and a 16 by 10 display, I would be like, buy it. I would recommend it, but I don't know if I love it. Oh, I haven't talked about pricing, but the starting price is over two grand, so, like, R.I.P. your wallet. Well, thanks for watching guys, hit like, get subscribed, and just have a great ol' day. See you later!",
    "transcript_keywords": [
        "track pad",
        "USB type",
        "thing",
        "laptop",
        "track",
        "USB",
        "Alienware",
        "pad",
        "gaming laptop",
        "gaming",
        "good",
        "CPU",
        "kind",
        "type",
        "Hertz",
        "Super",
        "vapor chambers",
        "bit",
        "degrees",
        "good track pad"
    ],
    "transcript_entity_values": [
        "RFID",
        "190",
        "half",
        "1440p",
        "MUX",
        "over two",
        "FPS",
        "Battlefield",
        "IO",
        "Thunderbolt",
        "the Alienware X15",
        "15",
        "Hertz",
        "three",
        "One",
        "RnB",
        "WASD",
        "a hundred degrees Celsius",
        "one",
        "Ram",
        "USB",
        "Alienware X15",
        "Crab Rave",
        "87 watt hour",
        "240",
        "17",
        "240 Watter",
        "Dell",
        "second",
        "95 degrees",
        "hundreds",
        "3080",
        "Watts",
        "IO",
        "Cherry",
        "C",
        "3080",
        "4.7 gigahertz",
        "Ridge Wallet",
        "140 megabytes",
        "2.3 kilograms",
        "32 gigabytes",
        "Hardware Info",
        "Windows",
        "the day before",
        "360",
        "3,200 megahertz",
        "Valheim",
        "Brandon",
        "10",
        "Alienware",
        "first",
        "40 FPS",
        "16",
        "two",
        "the Zephyrus M16",
        "10%",
        "two and a half",
        "400",
        "four",
        "30",
        "GPU",
        "four hours",
        "RGB",
        "SD",
        "CPU",
        "110 watt",
        "two kilograms",
        "a hundred degrees",
        "eight",
        "only 300",
        "75.9 degrees",
        "today",
        "zero",
        "over 30"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "FAC",
        "GPE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "NORP",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.05916972458362579,
        0.02276172675192356,
        0.036441583186388016,
        -0.05667790770530701,
        0.09808537364006042,
        0.021804697811603546,
        0.014117278158664703,
        0.02366645634174347,
        0.03239918872714043,
        0.04227720946073532,
        0.04884904995560646,
        -0.03722304105758667,
        0.06365644186735153,
        -0.015197653323411942,
        0.10327664017677307,
        -0.010072458535432816,
        0.0641663670539856,
        -0.07305120676755905,
        0.024628447368741035,
        -0.05755743384361267,
        -0.0007448804099112749,
        -0.025609731674194336,
        -0.022547410801053047,
        -0.022798625752329826,
        0.01308152824640274,
        -0.06568699330091476,
        0.035779356956481934,
        -0.06332547962665558,
        -0.05108729749917984,
        -0.027913663536310196,
        0.0067185331135988235,
        0.05148860812187195,
        -0.03640984371304512,
        -0.01455801259726286,
        0.00565062602981925,
        -0.05336223170161247,
        0.024476462975144386,
        -0.10645981132984161,
        -0.0238815750926733,
        -0.07724165916442871,
        -0.056391652673482895,
        -0.03449114039540291,
        -0.029769817367196083,
        0.05215707793831825,
        0.03020961955189705,
        -0.06240396946668625,
        -0.03375554457306862,
        0.016235122457146645,
        0.002768865553662181,
        0.0877726748585701,
        0.019294075667858124,
        -0.03715311735868454,
        0.04797593131661415,
        -0.014217633754014969,
        -0.029798034578561783,
        0.012872233986854553,
        -0.01374586671590805,
        -0.021417679265141487,
        0.004150115419179201,
        -0.051081229001283646,
        0.06345467269420624,
        -0.15900814533233643,
        -0.049521252512931824,
        0.07231161743402481,
        -0.06577852368354797,
        -0.0002600446459837258,
        0.023166237398982048,
        0.026352984830737114,
        -0.07064232975244522,
        -0.040008820593357086,
        0.003658435307443142,
        -0.016575990244746208,
        0.02510029822587967,
        0.011168058030307293,
        -0.009735665284097195,
        0.018757611513137817,
        0.15307359397411346,
        -0.028304392471909523,
        0.015360536985099316,
        0.03173953667283058,
        -0.05200941488146782,
        0.03528887778520584,
        -0.022729400545358658,
        -0.05664008483290672,
        -0.025346530601382256,
        -0.011617662385106087,
        0.02255578525364399,
        0.06303860992193222,
        -0.017528722062706947,
        -0.04933498799800873,
        -0.02175484225153923,
        0.08482279628515244,
        0.002203325042501092,
        0.05956396460533142,
        0.015877220779657364,
        -0.014728098176419735,
        0.04641902819275856,
        -0.05864674597978592,
        -0.026857325807213783,
        0.044055625796318054,
        0.03048665076494217,
        0.04027972370386124,
        0.10387520492076874,
        -0.015909096226096153,
        -0.09815938770771027,
        -0.07380644977092743,
        0.011062610894441605,
        0.06432300060987473,
        0.007364199962466955,
        -0.00015750183956697583,
        -0.1032160297036171,
        -0.02140812575817108,
        -0.06495524197816849,
        -0.007070079445838928,
        0.010850710794329643,
        0.06776317209005356,
        -0.028839118778705597,
        0.048257794231176376,
        0.14748413860797882,
        -0.022321363911032677,
        0.015953440219163895,
        -0.03169766068458557,
        -0.06693928688764572,
        0.005540969781577587,
        0.0022892002016305923,
        0.029465138912200928,
        -0.07356290519237518,
        3.105192489287878e-33,
        -0.03169333562254906,
        0.06125501170754433,
        -0.04695302993059158,
        -0.07281416654586792,
        0.03128746896982193,
        0.040013574063777924,
        0.10877598077058792,
        -0.0039567188359797,
        -0.10673613101243973,
        0.01898832432925701,
        -0.12339785695075989,
        0.06159209460020065,
        -0.08210717141628265,
        0.0490415021777153,
        0.030472300946712494,
        -0.04169704020023346,
        -0.030917339026927948,
        0.03899819031357765,
        0.013302339240908623,
        0.04698576033115387,
        -0.0019375201081857085,
        0.004363647662103176,
        0.0321212075650692,
        -0.017826030030846596,
        0.02634960599243641,
        -0.05177736654877663,
        -0.060986366122961044,
        -0.022907283157110214,
        0.062045857310295105,
        0.024164050817489624,
        -0.08275971561670303,
        -0.06666348874568939,
        -0.011477183550596237,
        -0.06370416283607483,
        -0.03205660730600357,
        0.009657365269958973,
        -0.056192316114902496,
        -0.08241664618253708,
        0.028252240270376205,
        -0.029071826487779617,
        -0.0361066497862339,
        0.10372146964073181,
        -0.0596589632332325,
        -0.10161669552326202,
        -0.027191858738660812,
        0.020312950015068054,
        -0.013542860746383667,
        -0.0020664676558226347,
        0.037133459001779556,
        0.043458133935928345,
        -0.14056308567523956,
        0.027778131887316704,
        -0.05536240339279175,
        -0.10684581845998764,
        -0.04318610578775406,
        -0.059331681579351425,
        0.011816238053143024,
        0.009698377922177315,
        0.03652248531579971,
        0.04415230453014374,
        0.034637901932001114,
        -0.0016414416022598743,
        0.06004616245627403,
        -0.026897719129920006,
        -0.024347668513655663,
        0.04669001325964928,
        0.10434146970510483,
        -0.0333290696144104,
        -0.10462110489606857,
        0.006673998199403286,
        -0.02583008073270321,
        0.01359337568283081,
        0.07307305932044983,
        -0.0038440877106040716,
        0.05590669438242912,
        -0.012582612223923206,
        -0.07443475723266602,
        -0.10606696456670761,
        0.013323713093996048,
        0.005508056376129389,
        -0.060850318521261215,
        0.018624648451805115,
        -0.016958585008978844,
        0.040846846997737885,
        -0.044270239770412445,
        0.049820322543382645,
        -0.010622422210872173,
        0.032072074711322784,
        0.05551685765385628,
        -0.0011739340843632817,
        -0.07677532732486725,
        -0.06194792687892914,
        -0.021419672295451164,
        0.027349261566996574,
        -0.028277264907956123,
        -4.919308308998944e-33,
        -0.05442532151937485,
        -0.029514726251363754,
        0.013360647484660149,
        0.02954667992889881,
        0.017578566446900368,
        0.04436231777071953,
        0.006549714598804712,
        0.0240179430693388,
        0.016021927818655968,
        -0.041350483894348145,
        -0.015873994678258896,
        0.10897339880466461,
        -0.03834822401404381,
        0.023356616497039795,
        0.005247748456895351,
        -0.03229788318276405,
        -0.0050500608049333096,
        -0.0733252689242363,
        0.0313231498003006,
        -0.028802262619137764,
        0.053006961941719055,
        0.018233101814985275,
        -0.015712475404143333,
        0.04812360927462578,
        0.034932080656290054,
        -0.005450890399515629,
        0.011231581680476665,
        0.023761320859193802,
        -0.015242823399603367,
        0.031013529747724533,
        -0.004959508311003447,
        -0.006363337393850088,
        0.01277763582766056,
        0.010319623164832592,
        0.09616808593273163,
        -0.02290714718401432,
        0.05139564350247383,
        0.054943330585956573,
        0.03800830617547035,
        -0.02117975801229477,
        0.004273538943380117,
        0.022574719041585922,
        0.04498427361249924,
        0.06449543684720993,
        0.043493058532476425,
        -0.04618913307785988,
        -0.05149316415190697,
        -0.12870682775974274,
        0.03908202797174454,
        0.013251936994493008,
        -0.045086272060871124,
        -0.030374037101864815,
        0.06195705384016037,
        0.019462021067738533,
        -0.08612048625946045,
        -0.022927716374397278,
        -0.0926058441400528,
        0.1094706729054451,
        0.02586248144507408,
        -0.06240133196115494,
        -0.01115372497588396,
        0.040683675557374954,
        -0.026692166924476624,
        0.04606683924794197,
        0.018607117235660553,
        -0.025876237079501152,
        0.03526879847049713,
        0.07032037526369095,
        -0.04450869932770729,
        -0.013260198757052422,
        -0.07668685168027878,
        -0.026407504454255104,
        -0.05032096803188324,
        -0.03832297772169113,
        -0.0905248150229454,
        0.04410114139318466,
        0.03069376014173031,
        0.013661992736160755,
        -0.006812467239797115,
        0.009358253329992294,
        0.06226525455713272,
        0.026496872305870056,
        0.04331955686211586,
        -0.0030231354758143425,
        -0.005894864443689585,
        0.010810837149620056,
        0.04992014169692993,
        -0.016806505620479584,
        -0.06569860130548477,
        -0.012942314147949219,
        -0.0430067703127861,
        0.011252110823988914,
        -0.034467242658138275,
        0.03990287333726883,
        -0.008648179471492767,
        -5.4963663842499955e-08,
        0.017775584012269974,
        -0.015603744424879551,
        0.025480983778834343,
        0.04837776720523834,
        -0.020397398620843887,
        -0.03959053009748459,
        0.03289270028471947,
        -0.02722482942044735,
        0.12118502706289291,
        0.059573132544755936,
        0.052020154893398285,
        -0.15081292390823364,
        0.019546058028936386,
        -0.01766187511384487,
        -0.0037048514932394028,
        0.05919630080461502,
        -0.02138185128569603,
        0.1116962656378746,
        -0.015097863972187042,
        -0.019726699218153954,
        -0.034129880368709564,
        0.05909647047519684,
        0.09585157781839371,
        -0.04138106107711792,
        0.06121295690536499,
        -0.014979550614953041,
        0.020303994417190552,
        0.007257200311869383,
        0.09344204515218735,
        -0.028705358505249023,
        -0.07890097796916962,
        0.003289273474365473,
        0.01650870405137539,
        -0.02416684478521347,
        0.01817583478987217,
        -0.0389859601855278,
        -0.03569292649626732,
        0.08404175937175751,
        0.10496508330106735,
        0.09056661278009415,
        -0.0285849217325449,
        -0.07211774587631226,
        -0.019119655713438988,
        -0.058515723794698715,
        0.048806332051754,
        -0.046349260956048965,
        -0.07555951178073883,
        -0.14036446809768677,
        0.026111047714948654,
        0.04564329609274864,
        -0.028857074677944183,
        -0.01175767369568348,
        0.006830937694758177,
        0.008531267754733562,
        -0.0021063932217657566,
        0.061759814620018005,
        -0.04647855460643768,
        0.0853705182671547,
        0.030765289440751076,
        0.06679898500442505,
        0.025405464693903923,
        -0.101927250623703,
        -0.03601444140076637,
        0.05692841485142708
    ]
}