{
    "id": "CTIpNtHWVtQ",
    "title": "Why Pay $1000 for a 25 year old PC! - NIXSYS Windows 98 PC",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-08-27T17:01:32Z",
    "video_url": "https://www.youtube.com/watch?v=CTIpNtHWVtQ",
    "category": "Science & Technology",
    "tags": [
        "windows 98",
        "nixsys",
        "nicksys",
        "nick sys",
        "nix sys",
        "windows 95",
        "old os",
        "scale",
        "anthony",
        "windows 98 pc new"
    ],
    "views": 2079507,
    "likes": 63787,
    "comments_count": 3681,
    "description": "New Customers Exclusive  Get $25 off your purchase of any AMD and Intel Processor (limit one per customer):   Check out Micro Centers Custom PC Builder:  Submit Your Build to the Build Showcase:   Enter SignalRGB's Minecraft PC giveaway at   A brand new Windows 98 PC?! But how? And why would anyone need Windows 98 in 2022?  Discuss on the forum:   Check out some legacy PCs available for purchase at   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:43 Who is NIXSYS? 1:37 The machine 3:33 A GENUINE WINDOWS 98 STICKER?! 4:07 Checking out the internals 7:24 Why not PCI Express? 8:52 Why does Anthony have an old weigh station PC? 10:04 Something frivolous 10:45 Some benchmarks 12:34 Peripherals and driver issues 15:02 USB Audio? Maybe not 16:49 Conclusion",
    "description_links": [
        "https://micro.center/pi2",
        "https://micro.center/nv8",
        "https://micro.center/9kz",
        "https://bit.ly/LinusPCGiveaway",
        "https://linustechtips.com/topic/1451911-we-paid-1000-for-a-25-year-old-os/",
        "https://nixsys.com/legacy-computers/windows-98-computers",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- I just bought this brand new thousand dollar Industrial Strength PC. So what the hell is this? Why is this a thousand dollars who would buy this? Oh, wow. Maybe this is brand new. Maybe I would buy this. Look at all these new features. Multiple monitor support, DVD playback, USB. In 2022. Thank you, Billy and Steve. Thank you. Wait, what's this for again? Whatever. Thank you to our sponsor. - SignalRGB. They're giving away a Minecraft themed PC with over 400 LEDs enclosed in a one of a kind case. Enter for a chance to win at the link down below. - One of our writers was looking into making a high powered Windows 98 gaming rig for some reason. I feel like I know why that reason is. And got an ad for a company called NIXSYS for a new PC running Windows 98. Apparently they're a small business in Orange County California that used to primarily sell servers. Their side hustle was building legacy systems for companies that didn't have the time money or resources to retrain their employees or buy new versions of software. But they found themselves selling old systems at such a rate and it was such a good market that they ditched IT entirely. And just started building rigs that throw back to a bygone era. Now full disclosure, we didn't actually buy this PC. We would have, but we reached out to NIXSYS and they were kind enough to send us a sample to test so long as we didn't let Linus pull a Fred Durst on it and break stuff. Now, looking at the exterior. This looks like the kind of PC that I would've sold in my very first IT job back in like 2006. Yeah. It's written in the script there that it looks like it's from the mid 2000s and belongs in an office. And that's about correct. This case design is very much mid 2000s. We even have a floppy drive here as well as an M-DISC. I'm not sure if this is a DVD rom drive or not but M-DISCs basically, I think they're millennium discs. They're supposed to archive data for a thousand years or something like that. I don't know if that's actually true. I don't think that anybody's ever tested a thousand year disc. A lot of these legacy systems have stuff on floppy discs or just spinning media. And this would actually be pretty good for transferring that out to something more modern. On the back. We've got, oh man. We've got PS/2 ports for keyboard and mouse. Fair enough. Serial. That's actually pretty important. Parallel, also pretty important. VGA. Then we've got grand total of four USB 2.0 ports on the back. With a, I believe that's a 10/100 Nic. Plus we've got some basic audio on the back here. Nothing really special. But this serial port and parallel port are actually very interesting for most older use cases. Because a lot of old human machine interfaces and SCADA interfaces stuff that's for like heavy industrial use will use serial or parallel. And the thing about serial and parallel is they can actually go pretty far or at least serial can, I don't know about parallel. But you can run serial for I think several kilometers. - [David] Whoa - And also around the front. Are another two USB ports. These are also 2.0 and front panel audio. Now for reasons we'll get into later, these are only running at USB 1.1 speeds, but they are 2.0 capable. Now, if you thought we were done talking about the exterior. We're not. Check this out. This is a genuine Windows 98, second edition serial key. I don't know where they got that. It looks brand new. Like it's not scuffed or anything like that. Like you might expect from a pull from an old system. Does Microsoft still make these? Like do they still sell these to companies that need it? Or are there just some warehouse full of new old stock of this stuff? I mean, I wouldn't be surprised. Let's get the side panel off of here. It's pretty thin metal. Yeah. That's typical of mid 2000s grade PC cases. There's that fan just spinning at maximum RPM forever because there's no control. This motherboard reminds me a lot of an old gigabyte board. It's got that kind of blue with the copper ish heat sink on the north bridge there. Oh yeah. That's a north bridge, right? This doesn't have a chip set per se. Well, I mean it does. It's a chip set. There are multiple chips. Whereas these days we only have a single chip for that. Ah, let's see. We got USB here. And we got front panel audio here. All the front panel stuff. Including a nice tiny little buzzer speaker. Little Piezoelectric thing. Single stick of RAM. That's DDR1, 400 megahertz. But I don't think it's running at that right now. There's not a whole lot else going on here. But there are some interesting things about this motherboard that are worth noting. First off, it's got an AGP slot on that. That's accelerated graphic's port. And basically what that is, is a version of PCI that is just completely dedicated to the graphics card. They don't have anything in here right now, but they went up to, from at least two times as fast as PCI to as much as eight times as fast as PCI. Which is actually pretty good because PCI I think was 133 megabytes per second. These PCI here are shared that's typical of the PCI bus. What that means is that all of the 133 megabytes per second transfer rate that the PCI bus is capable of will be split between all of the devices plugged into it. This is pretty much analogous to PCI express today but PCI express is dedicated and connected directly to the CPU and chip set versus this shared bus that these old cards used. Below the PCI slots are ISA slots. Or industry standard architecture. That's what compact called it back in the day because they didn't wanna have to keep calling it PC compatible. These are 8 and 16 Bit bus. So this would be the 8 Bit. That's the 16 Bit extension. The reason why these are super important for a machine that's targeting like legacy systems. Is a lot of interface cards. For say, communicating with old printers or, you know, HMIs. Industrial equipment, weight scales that kind of thing. They use ISA. And that can't be adapted at least not easily to PCI. Some other stuff of note in here, these ribbon cables. They're not going to what you might think they are. Yes, one of them is going to the floppy drive, but both the optical drive and the SSD. Yes that's an SSD, are connected with these. IDE to static converters. Basically they turn these serial ATA drives into something that this old motherboard can comprehend. I think that's basically it. Right. The power supply. This is an FSP Sparkle Power. So these aren't super amazing, but they're not no name things that are gonna break immediately. The idea behind these is that they're old enough that they can handle the power demands of these older machines that we've kind of evolved past. So 3.3 volt and 5 volt Rails on modern systems are very underpowered compared to in previous times, that's what we have here. So we have a total of 500 Watts of power available with 150 Watts available on the 3.3 and 5 volt Rails. Which is a lot more, I think than most power supplies today will give you. You might be asking yourself why not PCI express? Well, the thing about Windows 98 is that Windows 98 doesn't support PCI express. AGP is the best it'll do. Kind of like water bottles from lttstore.com. They only supported AGP on the first version but they upgraded to PCI express. And either way they can still support your thirst no matter what your socket type. The compatibility with all of these older standards is really the main selling feature of these machines. A business that relies on millions of dollars of automation equipment controlled by ISA compatible cards. Aren't gonna bat any eyes at occasionally dropping a thousand dollars on a warrantied machine that will keep their entire operation up and running. Especially if the interface card hasn't been made since the Reagan administration. The sky train. The longest driverless train network in North America and our local Metro system here in Vancouver is in that exact situation. A half million people a day in this city ride trains that rely on ISA cards and backups stored on floppy discs. - It may be old. But it's very reliable. - That's NIXSYS's niche. Their clients seem to be from a wide range of industries. There's textiles. Accounting. Healthcare, commercial weigh stations. In fact, a weigh station is probably the original home of my personal Windows 98 computers scale. Which I recently brought into the office to show off to the youth. I have an old weigh station computer because well for an individual with a propensity to tinker. Building a new Windows 98 PC doesn't make a lot of sense. Sure. This motherboard here is brand new. So it comes with a bit more certainty that it won't experience burst capacitors or cracking sodder joints anytime soon. But that comes at a cost. Even from the shadiest sellers on LA express. They still command over a hundred dollars. And that's without any real warranty on them. Or taking shipping into account either. When there's still full computers floating around for that same price, it's worth rolling the dice. For those of us who know what we're doing. When your business is on the line, rolling the dice to save a bit of cash is an unaffordable luxury. So hundred dollar or even $500 motherboard that uses 20 year old technology can be a straight up good deal. The same thing can be said for folks with accessibility needs, who rely on legacy software for some quality of life improvements. They may or may not have as much cash to throw around as a business. But if a computer makes life much easier and better to live having one becomes a high priority. NIXSYS pointed this out in our email exchanges as a big reason for individual customers purchasing machines for non gaming purposes. But this bad boy is not so mission critical to me. So why don't we find something more frivolous to do with it? (man laughing) Oh God. Even the intro cinematic is bad. (man sighing) Unfortunately, every AGP graphics card we've tried on this hasn't booted. Which I mean I'm not sure if I'm super upset about it or not, but it leaves us with just Intel Extreme Graphics. When I ran the Sims 2, the intro movie was at like two frames per second. So yeah, obviously this is not a gaming machine. But maybe we can run some benchmarks. That'll be fun. We got PCMark. We got 3DMArk 2001 SE let's see how 3DMark 2001 SE works with our incredible Intel extreme 8/45 graphics. Turns out the capture device we were using. Didn't like 10/24 by 7/68. So I had to change that real quick. Benchmark. Um, solid 15 FPS. That's cool. When I was a kid, I say kid, but like in school. Fiddling around with this stuff. I was like, what game is this? I wanna play this game. With Mex and monster trucks and missiles and stuff. Oh yeah. There's a nice solid. 8. 6. 7. 6. Yeah. 13. Oh. Spicy. Oh 6. 4. Well, it's actually pretty solid. Oh, 16, 20. Nevermind. It's jumping all over the place again. If Linus were here, he'd be all like. \"(indistinct) burned and ate the peasants\". Which is exactly what just happened. Yeah. See, that's just friendly fire. They're launching flaming arrows up at the dragon, into the town. That's just gonna burn the town. The dragon doesn't even have to do all the work. Oh man. The Matrix demo. I used to think this was super cool. Come to think of it. I think this is about how well this ran on my Pentium 4 1.5. With rage 64 or whatever rage 2 plus. That's about how well it ran. I remember it being pretty bad. Only in demo mode did it run half decent. But I'd watch that demo mode. You have successfully run the benchmark. Well, that depends on your definitions of successful because a lot of those tests were skipped. Average FPS in Car Chase was 15.3 in low detail. 8.9 in high detail. Yeah. Yeah. No. I can't imagine there being anything wrong with the wireless mouse. This here receiver, pretends that it's one of these. So everything that this mouse does receives those commands and then just translates it into more or less one of these. So if I plug this in, yeah, there we go. Working fine. When we first booted this thing up, we had to use a PS/2 keyboard and mouse on the back there. For, well compatibility reasons. Specifically because Windows 98 doesn't ship with up to date USB keyboard drivers, or just drivers in general. The drivers for the USB stuff had to be installed manually before any of it would work. Now that the drivers were installed everything obviously works just fine, but it is something we had to do the first time we booted it up. USB flash drives are an interesting case. So this one is a USB 3.0, as you can see here. The thing with these that you're limited to FAT32 at best. There are drivers you can get for NTFS and other file systems. But by default, the stock version of Windows 98 is limited to FAT32. Which if you format this on any modern Windows machine, you're limited to 32 gigs. That being said it can do up to two terabytes. So I'm just gonna throw this in here. And we should see. That we have removable hardware check that out. It thinks that the USB flash drive is like a floppy drive kind of thing, like a zip drive. And that's because that was the storage paradigm for a long time. Which made all the sense in the world back then. But now is just not how we do things. And as we can see, we have a bunch of stuff on this here Flash drive. A bunch of CPU-Z screenshots. And yeah, it's pretty much it for that. I can eject it. Not that that seems to have done anything. Let's unplug or eject that there. We'll stop the USB mass storage device. Please. Can now be safely removed. That is a thing that you actually have to do with older versions of Windows because it gets corrupt and FAT32, unlike NTFS doesn't have journaling. So if anything goes wrong in the unplugging process you are dealing with file system corruption. Well, I've been set up to fail I think. I don't know that Windows 98 supports USB audio. I don't remember if it does or not. Device manager. Okay. It found it USB audio device. So presumably it should work. Let's go to the control panel. To make sure we select it first. So USB audio device doesn't seem to have any playback options, but the recording does. USP audio device. Yeah. It has recording and other. Okay. So the other is where that is. And I will test direct sound, I guess. Oh. So what I'm looking at right now is a blue screen. I think I should still be able to interact with the system slightly. No, it's. It's dead, wait. Oh yeah, yeah. It's still slightly working, but it's like. It was not happy about that. Is this expecting a higher sample rate or something than Windows 98 can handle? I have to wonder why this happened the way it did. - [Cameraman] You killed it. My God, you killed it. - He's dead, Jim. I mean, I guess we'll see if it comes back. I didn't expect this to kill it. Huh? Well, we rebooted into safe mode following that crash. And I'm just looking at the adoro programs list here just because, I mean it's a thing to do when you're in safe mode. And they've got the unofficial universal USB 2.0 stack on here. Did we install that? From what I understand this was more or less completely stock Windows 98 and that's kind of what they claimed they've been selling. But they do include this USB 2.0 thing. And that's interesting to me because we had to disable USB 2.0 because if we tried running Windows with USB 2.0 we'd get one boot out of it. And then after that it would basically just not work. That being said, all of the important stuff did pick up via USB. We got the flash drive working, we got SD cards working. We got wireless peripherals working and wired peripherals. So pretty much anything you can expect to need to deploy seems to work just fine. USB audio aside. It's about as good an experience as you could reasonably expect from Windows 98 out of the box. Actually upgrading the machine is not all that easy compared to contemporary Windows PCs however. I blame the firmware. If you're looking to get yourself a warrantied. Reliable Windows 98 PC or a PC with any older windows installation on it. Then NIXSYS has made it pretty plug and play outta the box. So long as you don't mind forking over just a bit more cash compared to a used system from the era. And I mean, I don't mind forking over segways to sponsors like. Micro Center. Micro Center is one of the best places to shop for desktops. Laptops. Computer components, and all your technology needs. New Micro Center customers can get $25 off all AMD and Intel CPUs at any of Micro Center's 25 locations across the US. If you're looking for a new PC check out Micro Center's custom PC builder. Help spec out the best PC for your budget. Be sure to check the box marked same day pro assembly to have Micro Center's expert technicians assemble your PC for you for an additional fee. As well you can submit your build to the build showcase in the Micro Center community and to receive a coupon for your next Micro Center in-store purchase. Grab your coupon and everything mentioned in the video description below. Thanks for watching guys. If you wanna check out one of your old legacy PCs like this the link is down below, and if you wanna watch more videos on Windows 98, you can take a look at this video where I got the SCALE out and showed the youngins what for.",
    "transcript_keywords": [
        "USB",
        "Windows",
        "Micro Center",
        "PCI",
        "Yeah",
        "PCI express",
        "USB audio",
        "pretty",
        "dollar Industrial Strength",
        "thing",
        "Center",
        "stuff",
        "Industrial Strength",
        "Micro",
        "USB audio device",
        "back",
        "drive",
        "kind",
        "lot",
        "Serial"
    ],
    "transcript_entity_values": [
        "one",
        "millions of dollars",
        "500",
        "Mex",
        "13",
        "SSD",
        "a thousand years",
        "VGA",
        "thousand dollar",
        "North America",
        "SCADA",
        "3.3",
        "New Micro Center",
        "7/68",
        "7",
        "NIXSYS",
        "Linus",
        "the day",
        "PCMark",
        "adoro",
        "64",
        "Microsoft",
        "Steve",
        "half",
        "FSP Sparkle Power",
        "the 133 megabytes",
        "Orange County California",
        "first",
        "25",
        "2022",
        "CPU-Z",
        "First",
        "over a hundred dollars",
        "32",
        "ISA",
        "6",
        "20",
        "25",
        "A half million",
        "133 megabytes",
        "4",
        "USB 2.0",
        "NIXSYS",
        "at least two",
        "CPU",
        "Minecraft",
        "Vancouver",
        "2006",
        "Micro Center",
        "Intel",
        "Fred Durst",
        "Windows 98",
        "LA express",
        "the mid 2000s",
        "Reagan",
        "Windows",
        "four",
        "10/100",
        "8/45",
        "as much as eight",
        "the Sims 2",
        "SD",
        "mid 2000s",
        "Jim",
        "a thousand dollars",
        "16",
        "AGP",
        "15.3",
        "Watts",
        "150",
        "15",
        "2.0",
        "8.9",
        "16",
        "Micro Center's",
        "two",
        "400 megahertz",
        "USP",
        "these days",
        "Billy",
        "Intel Extreme Graphics",
        "second",
        "NTFS",
        "Metro",
        "today",
        "Windows 98",
        "a thousand year",
        "Healthcare",
        "PCI",
        "20 year old",
        "RAM",
        "8",
        "hundred dollar",
        "US",
        "10/24",
        "3.3 volt",
        "AMD",
        "500",
        "2",
        "Windows",
        "USB",
        "Fair",
        "several kilometers"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "LOC",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "GPE",
        "ORDINAL",
        "MONEY",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "LAW",
        "ORG",
        "DATE",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "FAC",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "QUANTITY"
    ],
    "vector": [
        -0.028515545651316643,
        0.003486013039946556,
        0.04193930700421333,
        -0.08526815474033356,
        0.09431824833154678,
        0.03243345022201538,
        0.010540840215981007,
        0.05534264072775841,
        -0.09059909731149673,
        -0.01518132071942091,
        -0.019439857453107834,
        -0.007347984239459038,
        0.0028302958235144615,
        0.006511278450489044,
        0.04116373136639595,
        -0.006973133888095617,
        0.049131426960229874,
        -0.09005104750394821,
        0.0038239217828959227,
        -0.04884642735123634,
        -0.05822251737117767,
        -0.018635252490639687,
        -0.07300443947315216,
        -0.0809837058186531,
        0.0050019691698253155,
        -0.06409792602062225,
        0.025614168494939804,
        -0.03163975477218628,
        0.011121697723865509,
        0.059702955186367035,
        -0.02689010463654995,
        0.04951014742255211,
        0.03345109894871712,
        0.0500907376408577,
        -0.014110544696450233,
        -0.110812708735466,
        0.08030527830123901,
        -0.005260366480797529,
        -0.13043659925460815,
        -0.09978616237640381,
        0.02563372254371643,
        0.01267249509692192,
        -0.026551999151706696,
        0.04625578969717026,
        0.008342896588146687,
        0.025012623518705368,
        0.0260007344186306,
        -0.03973321244120598,
        0.004706762731075287,
        0.030830036848783493,
        -0.06137736886739731,
        -0.11056972295045853,
        0.019204843789339066,
        -0.08755967020988464,
        -0.1343131810426712,
        -0.026001298800110817,
        0.03248889371752739,
        -0.011859645135700703,
        -0.003338993526995182,
        -0.059097226709127426,
        0.05269782617688179,
        -0.15568198263645172,
        -0.00411764532327652,
        0.04667703062295914,
        0.02352573536336422,
        -0.01622643694281578,
        0.027425503358244896,
        0.005223248153924942,
        -0.0015613534487783909,
        -0.09355682134628296,
        0.02869255468249321,
        -0.05917440354824066,
        -0.0021944567561149597,
        0.017098382115364075,
        -0.03386976569890976,
        0.01898239552974701,
        0.08102837204933167,
        0.006844263058155775,
        0.03791191056370735,
        0.00778102595359087,
        -0.012860380113124847,
        -0.009406947530806065,
        -0.006598480511456728,
        -0.09973356872797012,
        -0.025783291086554527,
        0.023158520460128784,
        -0.0045869299210608006,
        -0.0003581974597182125,
        -0.0005450074677355587,
        -0.0999213308095932,
        0.0029659271240234375,
        0.004123834427446127,
        0.06202317401766777,
        0.040187399834394455,
        0.05565345659852028,
        0.02690953016281128,
        0.0490383543074131,
        -0.030282219871878624,
        -0.006231577601283789,
        0.03051823191344738,
        -0.026796523481607437,
        0.03002614714205265,
        0.0341438464820385,
        -0.021870149299502373,
        -0.06816871464252472,
        -0.0685381069779396,
        -0.037132326513528824,
        0.08845704793930054,
        -0.005543604493141174,
        -0.03120969794690609,
        -0.03792565315961838,
        0.03396591916680336,
        -0.016628069803118706,
        -0.03838083893060684,
        0.08433874696493149,
        -0.09126487374305725,
        -0.03659074753522873,
        0.09248080104589462,
        0.06966006010770798,
        -0.0036159756127744913,
        -0.019081104546785355,
        0.013847450725734234,
        -0.047652773559093475,
        -0.03597135841846466,
        0.020390069112181664,
        0.02180228941142559,
        -0.10029137879610062,
        -1.008393604420076e-33,
        -0.0373593345284462,
        0.040315963327884674,
        -0.03985576704144478,
        -0.018945185467600822,
        0.024899883195757866,
        -0.02533385157585144,
        0.0018732936587184668,
        0.044664882123470306,
        -0.03395143151283264,
        0.021964192390441895,
        -0.015837009996175766,
        -0.02480398677289486,
        -0.03090095892548561,
        0.04933444783091545,
        0.04721909016370773,
        -0.02667667716741562,
        -0.0163718368858099,
        0.030402015894651413,
        0.03609200567007065,
        -0.0022532169241458178,
        0.002823570277541876,
        0.007034021895378828,
        0.020286286249756813,
        -0.03136937692761421,
        0.05854140967130661,
        -0.04404699429869652,
        -0.031228259205818176,
        0.016598230227828026,
        0.07655628770589828,
        -0.005424526985734701,
        -0.018332097679376602,
        -0.0634864941239357,
        -0.002047502901405096,
        -0.09365329891443253,
        -0.02488214150071144,
        0.0376809798181057,
        -0.06356760114431381,
        -0.09713606536388397,
        0.051831118762493134,
        -0.03303534910082817,
        -0.05377393215894699,
        0.03742056339979172,
        -0.053116634488105774,
        -0.1286691576242447,
        0.04117854684591293,
        -0.06098896265029907,
        0.029467012733221054,
        0.012532309629023075,
        0.03522920981049538,
        0.03187524899840355,
        -0.0775296539068222,
        0.025136133655905724,
        -0.06182035803794861,
        0.07743314653635025,
        -0.04489930719137192,
        -0.14520999789237976,
        0.028106871992349625,
        -0.055998511612415314,
        0.07005544751882553,
        0.05893001705408096,
        0.022311890497803688,
        -0.031971629709005356,
        -0.016484439373016357,
        -0.0127229243516922,
        -0.03796546533703804,
        -0.0021278993226587772,
        0.11003930121660233,
        0.010133427567780018,
        -0.0766037181019783,
        0.10578490793704987,
        0.03925883769989014,
        -0.08316466957330704,
        -0.006431604735553265,
        -0.04266291856765747,
        -0.0023829287383705378,
        0.05719437077641487,
        -0.05927200987935066,
        -0.09732206910848618,
        0.02285631187260151,
        0.0007704528397880495,
        0.02774464711546898,
        0.0792573019862175,
        -0.033047180622816086,
        0.0883292406797409,
        0.07798746973276138,
        0.08627490699291229,
        -0.005684811156243086,
        -0.03722333535552025,
        -0.007638300769031048,
        0.020865317434072495,
        -0.013095946051180363,
        0.007452505640685558,
        -0.03810248151421547,
        0.08664316684007645,
        0.019784007221460342,
        -2.3301086158961095e-33,
        -0.03112420253455639,
        0.0029977664817124605,
        -0.051955562084913254,
        0.014814956113696098,
        0.016056111082434654,
        -0.015549026429653168,
        0.0032171807251870632,
        -0.047080520540475845,
        0.0189228355884552,
        -0.04032212495803833,
        -0.009756142273545265,
        -0.005360402166843414,
        0.020720653235912323,
        0.011738823726773262,
        -0.03780944272875786,
        -0.05515112727880478,
        0.014688047580420971,
        -0.03541652485728264,
        0.07847555726766586,
        -0.02147904969751835,
        0.016496211290359497,
        0.05587879940867424,
        -0.013214578852057457,
        0.004807307384908199,
        0.003117098705843091,
        -0.03695005178451538,
        -0.03514525666832924,
        0.023295486345887184,
        0.02102368138730526,
        0.05910030007362366,
        -0.011377784423530102,
        -0.023309696465730667,
        -0.008307630196213722,
        0.012904096394777298,
        0.1205565333366394,
        -0.04438868910074234,
        0.061815984547138214,
        0.031353700906038284,
        0.04116862639784813,
        0.03299185261130333,
        0.06510218977928162,
        0.013166958466172218,
        -0.003747303271666169,
        0.02389596402645111,
        0.0287316907197237,
        -0.040909044444561005,
        0.018658749759197235,
        -0.03403396159410477,
        0.026360411196947098,
        0.0089176706969738,
        0.01934472657740116,
        -0.05968629941344261,
        0.13806501030921936,
        0.02627580426633358,
        -0.04709284007549286,
        0.0003753844939637929,
        -0.028243141248822212,
        0.08957251906394958,
        0.003918288741260767,
        -0.05299287661910057,
        0.030356578528881073,
        -0.01484315749257803,
        -0.012737488374114037,
        -0.015450817532837391,
        0.0033873405773192644,
        0.05387279763817787,
        0.03449895232915878,
        0.07972002029418945,
        -0.09645745158195496,
        -0.0748797282576561,
        -0.04861011356115341,
        0.0025637939106673002,
        -0.06234264373779297,
        -0.08017393201589584,
        -0.08984430134296417,
        0.03600190579891205,
        0.012091880664229393,
        0.04802478477358818,
        0.007902883924543858,
        -0.007661920040845871,
        -0.019409026950597763,
        0.02179858088493347,
        0.07417034357786179,
        -0.01942463032901287,
        0.041533663868904114,
        -0.06938792020082474,
        0.03596175089478493,
        -0.02301492728292942,
        -0.04165961220860481,
        -0.10063997656106949,
        -0.07579641044139862,
        -0.03218231350183487,
        -0.02983306720852852,
        0.010912751778960228,
        0.01761189103126526,
        -5.17002440858505e-08,
        0.004919423721730709,
        -0.0006698459619656205,
        0.00035209953784942627,
        0.014005630277097225,
        -0.018761271610856056,
        -0.04251767694950104,
        0.03323483467102051,
        -0.020628362894058228,
        0.011197525076568127,
        0.05241314694285393,
        0.0532955564558506,
        -0.13624341785907745,
        -0.030097058042883873,
        0.035231348127126694,
        0.11161811649799347,
        0.07139260321855545,
        -0.1322171539068222,
        0.06573955714702606,
        -0.020015619695186615,
        -0.0258485134691,
        -0.002194127067923546,
        0.049325477331876755,
        0.07558193802833557,
        0.0354415662586689,
        -0.06622771918773651,
        0.05113566666841507,
        0.09314925968647003,
        0.041857894510030746,
        0.0928964838385582,
        -0.0320170521736145,
        -0.025137946009635925,
        -0.010850775986909866,
        0.028316423296928406,
        0.0023368769325315952,
        0.03428535908460617,
        -0.10181926935911179,
        -0.0023570714984089136,
        0.11240381747484207,
        0.09815968573093414,
        -0.004660089500248432,
        -0.05208597704768181,
        -0.023983005434274673,
        -0.044481661170721054,
        0.02207033894956112,
        0.062998928129673,
        -0.03222644329071045,
        -0.13563169538974762,
        -0.04151993989944458,
        -0.05547439306974411,
        0.03139447420835495,
        -0.0021740561351180077,
        0.056800391525030136,
        0.018241500481963158,
        0.073109932243824,
        0.022410452365875244,
        -0.04409260302782059,
        -0.04887966439127922,
        0.055639661848545074,
        -0.010342152789235115,
        0.1277654618024826,
        0.046236827969551086,
        -0.05893469229340553,
        -0.004067930858582258,
        0.020342223346233368
    ]
}