{
    "id": "cU_TMypuHXs",
    "title": "THIS is why your phone is so damn expensive",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-03-18T14:54:14Z",
    "video_url": "https://www.youtube.com/watch?v=cU_TMypuHXs",
    "category": "Science & Technology",
    "tags": [
        "phone",
        "phone price",
        "phones",
        "price",
        "most expensive",
        "iphone",
        "samsung",
        "google pixel",
        "galaxy fold",
        "iphone xs max",
        "iphone xs",
        "huawei mate x",
        "mate x",
        "smartphone",
        "price tag",
        "best smartphone",
        "expensive",
        "foldable phone",
        "samsung price",
        "iphone price",
        "phone sales",
        "apple",
        "apple iphone",
        "google",
        "huawei",
        "big picture",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 823448,
    "likes": 18155,
    "comments_count": 1623,
    "description": "Phones are more expensive than ever. Flagship devices from Apple, Samsung, Google, and other top manufacturers can now cost hundreds of dollars more than they did just a couple years ago. With extra storage, many of them reach well above $1,000. And with the arrival of foldable phones, which are being priced around and above $2,000, it looks like the upper limit for phone prices is going to keep growing.  Read more here:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Listen to our podcasts:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2Y9jPbg",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "The iPhone XS Max gets up to more than $1,400. A specced-out Galaxy S10 Plus can reach $1,600. Samsung's foldable phone is going to sell for $2,000. And Huawei has gone even higher with a foldable thats going to start at close to $2,600. Phone prices have gotten wildly more expensive in the past couple of years. Apple, Google, Samsung, and others now charge hundreds of dollars more for phones than they did just a couple of years ago. And the upper limit on phone prices won't stop growing. If you're trying to buy a phone, this can be pretty intimidating. Why do these very necessary devices suddenly cost so much? There are a few different reasons that phone prices keep going up. Some good, some bad. I'm going to talk about three key pieces to this story. To understand why, we have to step back and look at the big picture. (upbeat music) Prices have been rising at pretty much every high-end phone company. But, for this video, I'm going to focus on Apple, particularly in the US, because its prices stayed consistent for a really long time. Also, the iPhone is just really popular here. So, the first thing is phone prices used to be a lie. You might remember getting a brand-new iPhone for $200, but, in reality, that phone cost a lot more. Probably closer to $650. The cost was just hidden to you. This is how phone sales worked in the United States for years. And it kind of seemed like it would never change. But then came T-Mobile's boisterous, trash-talking CEO John Legere. That is a complete crock of bullshit. When Legere became CEO in 2012, T-Mobile was in a bad place. The carrier was in a distant last to Verizon and AT&T. It even had 20 million fewer subscribers than Sprint. Legere wanted to do something bold to get eyes back on T-Mobile. So after just six months on the job, he did something previously unthinkable for a major US phone carrier: he killed two-year contracts. Now, Legere's kind of ridiculous, and we make fun of him a lot. But this was a legitimately game-changing idea. It made the carrier more consumer-friendly, and it allowed the company to lower prices. A T-Mobile plan could easily be half the price of a Verizon or AT&T plan. This had a huge effect in turning T-Mobile around and making it the competitive number three it is today. But getting rid of contracts and lowering prices really meant getting rid of phone subsidies. Carriers had only been able to give you a $200 iPhone because they were quietly charging you for the rest of the phone every single month as part of your bill. The iPhone was always about $650. You just couldn't see it. Within two years, Verizon, AT&T, and Sprint all followed suit. The contract was dead. And now what you saw was the exact price of the phone along with the monthly fee you'd need to pay in order to buy it. So that's part of the story. And it brings phones from about $200, to about $650 in just a couple years time. But this isn't just a story about sticker shock. Phones really are getting more expensive. And there's been a big jump from $600, to well past $1,000 in just the last few years. These price hikes aren't just about what consumers want. They're also about what companies like Apple need. And that brings us to the second part of this story. As weird as it sounds, Apple is running out of people to sell iPhones to. When the iPhone 4S came out, around one in three Americans owned a smartphone. Just five years later, there's a smartphone in the hand of three out of every four Americans. The death of contracts has also made it harder to sell a phone. Customers no longer have a good reason to buy a new phone every two years, which means Apple isn't guaranteed those biannual purchases. In fact, carriers have even started extending the time over which we pay for our phones. AT&T defaults to splitting up costs over two and half years. T-Mobile does it over three. All of this has had an impact. By 2017, Americans were holding on to their phones for more that two and a half years. That doesn't sound like a lot, but it'd been closer to two years just the year before that. To see the real story, you can just look at this chart. Thanks to the success of the iPod, Apple had been setting company-best revenue records quarter after quarter. When the iPhone came out, that only accelerated. Apple was on a 13-year record-setting streak. But then, this happened. In April 2016, Apple missed. For the first time in more than a decade, Apple made less money in a quarter than it did the year before. Now, don't get me wrong Apple still made a ton of money: a whopping $50 billion in just three months. But Apple lives and dies by the iPhone. At the time, the iPhone made up 65 percent of Apple's overall sales. So Apple's main goal was to send that arrow back in the right direction. And that means one of two things: either selling more iPhones or selling more expensive iPhones. And you know which one they chose. So everyone got cheap phones on a two-year contract. Then those contracts died. People bought fewer phones, and prices had to go up. It all sounds a little bit evil, but there is a bit more to it. And that's the third piece of this story. It is the most advanced iPhone we've ever created. We designed the world's best camera, and put it in the world's most helpful phone. Galaxy Fold is a device unlike any that's come before it. But seriously, modern phones do have a lot more stuff and a lot nicer stuff, especially at the high end. There are larger screens, nicer display technologies, multiple cameras, tons of RAM, waterproof builds. It adds up. If you count up how much every part inside an iPhone 4 from 2010 costs, it comes out to less than $200. Do the same thing for last year's iPhone XS Max, and it's closer to $400. Now, yes, that is a lot less than Apple sells the phone for, but that's just the cost of parts. It doesn't include R&D, manufacturing, shipping, support, the salary of the Apple Store employee who sold it to you, and a lot more. The prices for new iPhones haven't necessarily gone up a ton. Apple charged $650 for its flagship iPhone in 2011. With inflation, that's now about $720, which is close to the cost of an iPhone XR, a phone that likely costs a lot more to make. So, in reality, it's less that the iPhone got more expensive and more that Apple has pushed the boundaries on what the most expensive iPhone looks like. And it's worth keeping in mind that if you buy a $1,000 iPhone, you're actually in the minority. In the US, phones sell for $400 on average. (PRICE: OnePlus 6T is $549) And it's even less worldwide. (PRICE: Moto G6 is $250) You may need to spend a grand to get the absolute best out there, but phones have gotten so good that you can now spend a few hundred dollars and get something that checks most of the boxes one could reasonably need. Even Apple will sell you a brand-new iPhone 7 for $450. So yes, phone prices have risen a lot. You have to spend more to get today's best phone than you had to spend to get the best phone just a few years ago. But the difference is that you no longer miss out on quite as much if you choose to spend less. And the phone you do end up with, you'll probably hang on to for longer. So unless you're still buying the best every two years, you might not end up spending all that much more. Speaking of expensive phones, if you haven't seen them already, you should absolutely check out our hands-on videos with some of the first foldable phones. These things are really cool, and they're one of the first things in a while to really redefine what a phone can look like. You can check those out. And, be sure to like and subscribe for more.",
    "transcript_keywords": [
        "Apple",
        "phone",
        "iPhone",
        "phones",
        "years",
        "Phone prices",
        "prices",
        "lot",
        "TMobile",
        "story",
        "expensive",
        "Legere",
        "iPhones",
        "cost",
        "Samsung foldable phone",
        "sell",
        "time",
        "made",
        "spend",
        "Verizon"
    ],
    "transcript_entity_values": [
        "about $720",
        "Sprint",
        "three",
        "iPhones",
        "650",
        "two-year",
        "XR",
        "T-Mobile's",
        "about $200",
        "just six months",
        "1,600",
        "a couple of years ago",
        "2,000",
        "Moto G6",
        "1,000",
        "a few hundred dollars",
        "biannual",
        "less than $200",
        "April 2016",
        "RAM",
        "Legere",
        "Huawei",
        "every two years",
        "third",
        "2010",
        "Google",
        "2017",
        "250",
        "quarter after quarter",
        "every single month",
        "Samsung",
        "600",
        "OnePlus 6",
        "iPhone XS Max",
        "2011",
        "4S",
        "first",
        "about three",
        "a ton",
        "Galaxy Fold",
        "2012",
        "the year before",
        "AT&T",
        "Americans",
        "Verizon",
        "T-Mobile",
        "65 percent",
        "US",
        "just a couple years",
        "549",
        "20 million",
        "more than a decade",
        "$50 billion",
        "400",
        "200",
        "over two",
        "second",
        "iPhone 7",
        "John Legere",
        "about $650",
        "450",
        "one",
        "Apple",
        "four",
        "Just five years later",
        "just a few years ago",
        "well past $1,000",
        "today",
        "13-year",
        "more than $1,400",
        "two years",
        "years",
        "Galaxy S10 Plus",
        "Apple Store",
        "monthly",
        "a quarter",
        "half",
        "the United States",
        "hundreds of dollars",
        "two",
        "the past couple of years",
        "two and a half years",
        "iPod",
        "Verizon",
        "Max",
        "iPhone",
        "just the last few years",
        "close to $2,600",
        "last year's",
        "just three months"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "MONEY",
        "DATE",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "PERCENT",
        "GPE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "GPE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "DATE"
    ],
    "vector": [
        -0.0636211633682251,
        -0.04863428324460983,
        0.08669710159301758,
        -0.007845385931432247,
        0.026546919718384743,
        -0.0382428839802742,
        -0.066236712038517,
        0.14892107248306274,
        0.04944807291030884,
        0.040249280631542206,
        0.01290682889521122,
        0.03629887476563454,
        0.053124479949474335,
        0.021990664303302765,
        0.04661966487765312,
        -0.009245490655303001,
        0.052288591861724854,
        -0.07711847126483917,
        -0.09847412258386612,
        -0.0055334134958684444,
        0.014219552278518677,
        0.006915547885000706,
        0.010336649604141712,
        -0.023806104436516762,
        0.05186210945248604,
        0.005930478684604168,
        -0.10256072878837585,
        -0.12061508744955063,
        0.022416651248931885,
        0.025337766855955124,
        -0.02571846917271614,
        0.12628306448459625,
        0.0086660822853446,
        0.04161243513226509,
        0.000899560225661844,
        -0.11357991397380829,
        -0.005643174052238464,
        0.030334556475281715,
        -0.014194461517035961,
        -0.007267022039741278,
        -0.03208143636584282,
        -0.0063594551756978035,
        -0.029915161430835724,
        -0.01661405898630619,
        -0.003075612708926201,
        -0.052764203399419785,
        0.033862531185150146,
        0.01321101002395153,
        0.006111906375735998,
        0.006179836578667164,
        0.017203696072101593,
        0.009693329222500324,
        -0.0054094609804451466,
        -0.01970677636563778,
        -0.06486812978982925,
        0.006559956353157759,
        0.016819199547171593,
        0.007900259457528591,
        0.072335384786129,
        0.045228783041238785,
        0.017723694443702698,
        -0.014226250350475311,
        -0.019145101308822632,
        -0.011872612871229649,
        -0.00463886046782136,
        -0.007235568482428789,
        -3.071286482736468e-05,
        -0.01809408888220787,
        -0.02477065660059452,
        0.061133820563554764,
        0.05933288112282753,
        0.048653312027454376,
        0.03182192146778107,
        0.019498810172080994,
        0.026457911357283592,
        0.05216062068939209,
        0.1628449261188507,
        0.0021833982318639755,
        -0.004212517291307449,
        0.006183256395161152,
        0.014348505064845085,
        -0.09040965139865875,
        -0.048216335475444794,
        -0.0358709953725338,
        0.032399389892816544,
        -0.04369058832526207,
        -0.02181749977171421,
        0.07210396975278854,
        -0.058898866176605225,
        -0.03908991441130638,
        0.014809316024184227,
        0.036259230226278305,
        -0.06054427847266197,
        0.0036746757104992867,
        -0.023856008425354958,
        0.0430758036673069,
        -0.08835375308990479,
        -0.0406719446182251,
        -0.009774530306458473,
        -0.060835130512714386,
        0.019882572814822197,
        0.05165775865316391,
        0.1127777174115181,
        0.03705056756734848,
        0.028683694079518318,
        -0.08188612014055252,
        0.007943063043057919,
        -0.03897566348314285,
        0.004828380420804024,
        0.04631756618618965,
        -0.02626625820994377,
        -0.04175018146634102,
        -0.07035765796899796,
        0.02239929884672165,
        -0.06368128955364227,
        -0.01330392062664032,
        0.02352837845683098,
        -0.002798547502607107,
        0.06831644475460052,
        0.024196429178118706,
        -0.04320630803704262,
        0.012747390195727348,
        -0.09325219690799713,
        -0.07304747402667999,
        -0.02646692283451557,
        -0.04147239774465561,
        -0.0846596285700798,
        5.364600997453781e-33,
        -0.013974840752780437,
        0.09955894201993942,
        -0.043442193418741226,
        -0.05449969321489334,
        -0.0514945462346077,
        -0.022167565301060677,
        0.0009928252547979355,
        0.07823073118925095,
        -0.03291303291916847,
        0.014771903865039349,
        -0.04361891746520996,
        0.027331968769431114,
        -0.03580087795853615,
        0.015620849095284939,
        0.10156450420618057,
        -0.11384940147399902,
        -0.006596153136342764,
        -0.056265201419591904,
        0.018051877617836,
        -0.055230505764484406,
        -0.03866994008421898,
        -0.05688164010643959,
        0.02305220253765583,
        -0.008418514393270016,
        -0.009678663685917854,
        0.0009045866318047047,
        0.06517583131790161,
        -0.03421204164624214,
        0.05274272710084915,
        -0.009270905517041683,
        -0.08344627916812897,
        0.026570655405521393,
        0.06534653902053833,
        0.008436302654445171,
        -0.05035911127924919,
        0.0709114819765091,
        0.03692787140607834,
        -0.047142792493104935,
        0.0462690144777298,
        0.007703378796577454,
        -0.10044761002063751,
        0.05817500129342079,
        -0.07267870008945465,
        0.0027162451297044754,
        0.05883000046014786,
        0.010515821166336536,
        -0.03684746474027634,
        -0.035455815494060516,
        -0.05523448809981346,
        -0.03508531674742699,
        -0.045035772025585175,
        0.0284714438021183,
        -0.07638014853000641,
        0.018922854214906693,
        -0.0376146174967289,
        -0.041781190782785416,
        0.039440467953681946,
        -0.07847457379102707,
        -0.0011178062995895743,
        0.02169642224907875,
        -0.03838849440217018,
        -0.017685681581497192,
        -0.037108100950717926,
        0.07499083131551743,
        -0.051980528980493546,
        0.07755499333143234,
        0.026308689266443253,
        0.01847812719643116,
        -0.07086332887411118,
        0.1282263994216919,
        0.0009766711154952645,
        -0.034217070788145065,
        0.02049996517598629,
        -0.017875343561172485,
        0.07418008148670197,
        0.030281145125627518,
        0.019834330305457115,
        -0.029708661139011383,
        0.030987419188022614,
        0.04665764048695564,
        -0.04107993468642235,
        0.006108332425355911,
        0.06986303627490997,
        0.014727902598679066,
        0.02784794755280018,
        -0.0365460179746151,
        -0.02909500151872635,
        -0.006857381202280521,
        0.01640389859676361,
        0.05145542696118355,
        -0.037968192249536514,
        -0.008712997660040855,
        -0.004655218217521906,
        0.009929399937391281,
        -0.011700661852955818,
        -5.595514005703357e-33,
        -0.06408605724573135,
        -0.008624637499451637,
        0.03473866358399391,
        0.02682565525174141,
        0.008639981038868427,
        -0.054280444979667664,
        0.014234321191906929,
        0.03624409809708595,
        -0.05967395007610321,
        -0.04073135182261467,
        -0.10133412480354309,
        0.07033530622720718,
        0.06516216695308685,
        0.0426468662917614,
        -0.04898110032081604,
        -0.04226337745785713,
        0.007864799350500107,
        -0.06642518937587738,
        0.07739309221506119,
        -0.032481223344802856,
        -0.04492419958114624,
        0.05954843387007713,
        -0.008478911593556404,
        0.0950547307729721,
        -0.05958540737628937,
        0.0056876265443861485,
        -0.06331907212734222,
        0.00910402275621891,
        0.048881955444812775,
        -0.012026205658912659,
        -0.07535195350646973,
        -0.08337877690792084,
        0.023955728858709335,
        0.035452038049697876,
        0.031734004616737366,
        0.06260209530591965,
        0.008239722810685635,
        -0.04207059368491173,
        0.05270925536751747,
        -0.014420654624700546,
        0.012666935101151466,
        0.011258799582719803,
        0.04643659666180611,
        -0.06777039915323257,
        0.09358809143304825,
        -0.07107540965080261,
        -0.038934510201215744,
        0.017167478799819946,
        0.00696925912052393,
        -0.0008726569940336049,
        0.0918281227350235,
        0.057341910898685455,
        -0.00872890092432499,
        0.021473921835422516,
        -0.0927654504776001,
        -0.011245747096836567,
        0.0009969610255211592,
        -0.00993664376437664,
        -0.0007767622009851038,
        -0.028754016384482384,
        0.05989627540111542,
        0.05671965330839157,
        -0.06137212738394737,
        -0.007442513480782509,
        -0.06348837912082672,
        0.001943656476214528,
        0.12572667002677917,
        -0.04758421704173088,
        -0.025350164622068405,
        -0.05307859554886818,
        -0.012730753980576992,
        -0.021041985601186752,
        -0.010183100588619709,
        -0.02529868297278881,
        -0.0452694334089756,
        0.08464274555444717,
        -0.10079122334718704,
        0.005842114333063364,
        0.04590754583477974,
        -0.03219148889183998,
        0.08520808070898056,
        0.08625369518995285,
        0.06820854544639587,
        -0.04377484694123268,
        0.021591966971755028,
        -0.021158698946237564,
        -0.019502690061926842,
        0.051291342824697495,
        -0.053849101066589355,
        0.01068657822906971,
        -0.13059523701667786,
        -0.050436507910490036,
        -0.09396282583475113,
        0.07313837856054306,
        0.020758280530571938,
        -5.390186075260317e-08,
        0.05711169168353081,
        -0.016627974808216095,
        0.04743038862943649,
        0.0005424647242762148,
        0.031770478934049606,
        -0.059547971934080124,
        0.05740571394562721,
        0.049065254628658295,
        0.1573524922132492,
        0.06031709164381027,
        -0.018035605549812317,
        -0.09332629293203354,
        -0.08831539005041122,
        0.08460384607315063,
        -0.03202652558684349,
        0.0691949725151062,
        -0.016072694212198257,
        -0.012188856489956379,
        0.04201590642333031,
        0.013647854328155518,
        -0.010043151676654816,
        0.07667339593172073,
        0.0071186195127666,
        -0.035978373140096664,
        0.06336438655853271,
        0.03521398827433586,
        -0.09638232737779617,
        0.026716306805610657,
        0.008966530673205853,
        0.024707607924938202,
        -0.009189940989017487,
        -0.062478262931108475,
        0.005449200049042702,
        0.016833048313856125,
        0.013020089827477932,
        -0.06250585615634918,
        -0.007879053242504597,
        -0.052743468433618546,
        0.07765708118677139,
        0.014638273976743221,
        0.08221274614334106,
        -0.037297267466783524,
        -0.02527814544737339,
        0.04534279927611351,
        0.023991061374545097,
        -0.09512894600629807,
        -0.051643144339323044,
        -0.038016337901353836,
        0.02101503126323223,
        0.052315350621938705,
        0.008022842928767204,
        -0.02715369500219822,
        0.0015580588951706886,
        -0.07114589959383011,
        0.0008795527392067015,
        -0.027831774204969406,
        0.0020831685978919268,
        0.02576906979084015,
        -0.0756218433380127,
        0.09934263676404953,
        0.03638464957475662,
        -0.14997915923595428,
        0.022919679060578346,
        0.08792976289987564
    ]
}