{
    "id": "cuRZZ4p9Sl0",
    "title": "Best Action Camera! Insta360 GO 2 Review",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-09-02T18:30:55Z",
    "video_url": "https://www.youtube.com/watch?v=cuRZZ4p9Sl0",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "insta360"
    ],
    "views": 208316,
    "likes": 7706,
    "comments_count": 417,
    "description": "Thank you to Insta360 for sponsoring this video! Check out the Insta360 GO 2 here:    PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "https://www.insta360.com/sal/go_2?insrc=INR9M2I",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and today's video is gonna be a followup video to a video that I did a while ago, it was on the Insta360 GO 2. I'm sure you've seen some of my videos featuring some of the Insta360 cameras, but this one is very special, and the first one came out, maybe like a year, almost two ish years ago. This one's been out for a few months now, this is the Insta360 GO 2, this is it, this is a camera. It comes in this little case and this is the camera, it pops out just like this. It actually has an ND filter on it, which those are something new that they recently released. So they come in this little case. So you can just screw these off and on. Oh, I dropped it. This will give you such a better image when you're shooting in really bright light conditions. And I noticed a huge difference the first time that I tried this, in the car, just doing some driving shots when I was testing it out. So this little camera connects to the little case, this case will charge it. You can also plug this into your computer using USB-C to A, and you'll be able to mount this like an external drive, and you can just copy all of the files on here that you shoot. The cool thing is you can be using this as a remote though, because it does use Bluetooth. I can place this somewhere random, like up here in the corner, use this to record, this connects to the camera, so you can change various settings. You can do time-lapses, hyper-lapses, you can shoot photos, you can shoot the promo video, which is really cool, 'cause it basically is shooting, kind of like a 180 view. And then it takes that 180 view and it uses flow state stabilization to stabilize the image, and it gives you this super smooth look, that it's almost like if you're holding this out here and walking, it's kind of like a drone is following you. I also love that this connects to the Insta360 app, and you're able to just kind of edit this content on the go, and I love being able to do that. This video was a little bit different, because I actually had a couple of these, I was filming a ton of content all the time, so I was transferring the footage from these to my computer. Then bringing that footage into the Insta360 Studio, exporting those out and then editing them in Final Cut. Which is kind of a long process, but really once you kind of get the workflow down with this, kind of figure out the controls, because I'm not gonna lie, when you first get this, it feels very confusing. And I have spent so much time with this, that this camera feels like second nature to me. If you do have it connected to this little controller and to the case, obviously it's easy to tell what's happening, but you can program the different types of, I guess, button presses inside of the app. So if I do one press, this will automatically start capturing pro video. But if I do two presses of the button, it'll start doing a time-lapse. And why I love this is what I've been doing this entire trip is I've been wearing this necklace, and this is a really cool little accessory. It's a magnetic necklace, and since this little camera is also magnetic, I've kept this case in my pocket. I basically have had this necklace on and you just kind of wear it right under your shirt, and you can attach to the camera just like this. The first thing that you're gonna notice is, it doesn't really look cool. I mean, I guess if you wanna define what cool is, if I saw this, I would think you were cool, but maybe the general public might be a little bit confused, but I have had a lot of conversations with people, randomly on the trail, they're like, what is that? It's a camera. This is where it's so cool, because it is so easily accessible right here, if I wanna start filming something, I just go like this. I'm now filming, and it gives you this kind of haptic feedback, like a little vibration. So I know that it's recording, and then when I hit it again, it gives you kind of like a long vibration, so you know that it has stopped recording. And why I love having it just easily accessible right here, is even if I see something happening, I just grab it off my necklace. I hit the button, I start recording, and I don't miss the shot. And since I made my first unboxing video, they have come out with a few more accessories, they have one that you can attach to like a GoPro mount, so that this will be encased inside of an outer case, so it won't go anywhere, but I unfortunately did not bring any GoPro mount pieces to Hawaii. And you know what's kind of crazy? You can't find any on the island, because I feel like, that is one of the most purchased things here, because everyone is out doing water sports. I couldn't find any. And then the one that I ordered online, it just, I don't know where it went, it never showed up. So that wasn't something that I got to test, but what I did get the test was a head mount, so it's like this little hat mount that I was able to wear, so it gives you kind of like this cool downward perspective. So when I was hiking I could see my feet, and then kind of like my body, super strange, but really cool. But most of the time, this is what I was doing. So I'm gonna show you guys how I've been using this camera, I have it attached to the magnetic necklace, and as I'm walking, I just go, boop, and hit it. I've got it set to do pro video recording, and now I'm filming. And a lot of times I'll just go like this, grab it off the necklace, hold it up, get some shots. I also have a bunch of accessories that I've been using with it as well, but this has been the main kind of go to. Just like that. This other little accessory that I've really been loving is this, which will attach to like a little tripod mount. There's also a really cool mount that have a little sticky on the back of it, so I've been using that in the car, to get driving shots, or shots of me driving. And it's great, because I'm able to also capture something that is happening randomly outside very quick. Another accessory that is really cool, hold on a second. This is a very, very, very, very long pole that Insta360 has, and this I was out, I guess, kind of trying to get some sea turtle action. This was so cool, 'cause I was able to attach this little tripod mount to that stick and I put it in the water and I even saw, I think it was an octopus or a squid, I'm not sure, I saw a little leggy, a little tentacle. Let me know if you know what this is, and it's cool because the actual camera itself is waterproof, so you are able to submerge that into water, but the one thing that isn't waterproof is the case. So just be careful if you do happen to put this in water, just make sure it's completely dried off before you put it back in the case. They also have this other smaller Insta360 selfie stick, which you can see I'm using here on this hike, 'cause it does kind of give you that opportunity to reach out further, see more things, and I also loved doing this shot, where I kind of put it behind me, so it sort of looked like the camera was following me, or somebody else would filming me, but really I was just holding the stick behind me. So now I guess I'll take you into the vlog portion of this footage, all of this was shot on the Insta360 GO 2, I hope that you guys enjoy it, because I had so much fun filming this and editing it. (upbeat music) I'm not a light packer at all. Made it to the airport. Traditional mix. (upbeat music) We've made it to Hawaii and met up with Jenna. Jenna has had over a 20 hour travel day. - I'm sleepy. - She's sleepy. (car beeping) Dude, the car is not starting, are you freaking kidding? Unfortunately, I'm very familiar with this type of thing. See that, look at that? Round two, let's hope for the best. (gentle music) Yes! (gentle music) This is the secret beach at Kuaola Ranch, it's so freaking beautiful. The sun just came up, it's absolutely just, it's a freaking dream. Got up at 3:00 AM to catch the sunrise, we're hopping on a boat. It's a small boat, let's hope that we don't get seasick. - We're, not we're fine. (gentle music) - We're about to do the Koko Head Crater hike, it's 8,000 stairs all the way up to the top, and then you have to come back down. (upbeat music) This is where it gets a little iffy, because you have to go across these railroad ties. You slip, you fall. I remember the first time I did this, I cried. Didn't check the weather, now it's raining, pretty normal occurrence in Hawaii though. Carry on. And we did it. (gentle music) On our way back down. (gentle music) Just finished the hike and I've done this hike so many times and they're actually doing some restoration to it, so I will definitely be donating to their GoFundMe, because this hike actually, it's improved significantly, with all the added little extras that they've put in. (upbeat music) We're at Kualoa Ranch, and this is one of my most favorite places in Oahu, it's a 4,000 acre private ranch. (upbeat music) Do you wanna say hi to my hat? - Hello hat. - I'm testing out hat cam today. Like, look, I'm looking down, I'm looking up, looking all around. (upbeat music) I'm so excited, this is one of my favorite shave ice places here in the island, it is so good, I'm hyped. Thank you, check this out. (upbeat music) Off we go, this is about a five plus mile adventure that we're about to embark on. (tense music) - Ow. - Oh, so sorry. We are about halfway up to the first place that we need to go, and then there is another spot. - Why are you not sweating? - Am I not sweaty? I feel it. - I'm like, drenched. (tense music) (wind blowing) (gentle music) - I hope you guys enjoyed this follow up video with Insta360 GO, this camera has been so much fun to use, and even since the day that it came out, even since the first version of this, I knew that the second version was gonna be awesome, and it has not disappointed me since. A huge thank you to Insta360 for sponsoring this video, they have always been so supportive of my channel and I have been such a huge fan of their cameras, like don't tell them that I would have done this video for free, but the fact that they did sponsor this, thank you, I appreciate it. Thank you guys so much for watching, and I'll see you in the next video, bye. (gentle music)",
    "transcript_keywords": [
        "kind",
        "camera",
        "cool",
        "video",
        "case",
        "mount",
        "Justine",
        "necklace",
        "filming",
        "time",
        "Justine and today",
        "followup video",
        "ish years ago",
        "put",
        "guys",
        "hike",
        "gives",
        "shots",
        "thing",
        "years ago"
    ],
    "transcript_entity_values": [
        "GoFundMe",
        "20 hour",
        "4,000 acre",
        "second",
        "about a",
        "one",
        "USB-C",
        "2",
        "GoPro",
        "Justine",
        "Hawaii",
        "Oahu",
        "a ton",
        "the day",
        "Bluetooth",
        "3:00 AM",
        "selfie",
        "Kuaola Ranch",
        "ND",
        "Final Cut",
        "today",
        "two",
        "Kualoa Ranch",
        "first",
        "a few months",
        "180",
        "Jenna",
        "8,000"
    ],
    "transcript_entity_types": [
        "NORP",
        "TIME",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "LOC",
        "PERSON",
        "GPE",
        "GPE",
        "QUANTITY",
        "DATE",
        "PERSON",
        "TIME",
        "PRODUCT",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.02869386598467827,
        -0.07023541629314423,
        -0.0770580992102623,
        -0.11825880408287048,
        0.03670011833310127,
        0.018351685255765915,
        0.07066290825605392,
        0.060779403895139694,
        -0.028744447976350784,
        0.11371908336877823,
        0.03946627676486969,
        0.006654753815382719,
        -0.021448684856295586,
        0.03470400348305702,
        0.04280487447977066,
        0.03407701104879379,
        0.05026962235569954,
        -0.025296423584222794,
        -0.015230433084070683,
        0.021600978448987007,
        -0.03370562195777893,
        -0.056798942387104034,
        0.016735097393393517,
        0.011836573481559753,
        -0.03664371743798256,
        0.06723719090223312,
        -0.015569675713777542,
        0.016819419339299202,
        -0.11799447983503342,
        -0.07828478515148163,
        -0.04557280242443085,
        -0.0038896638434380293,
        0.05428261309862137,
        -0.03441084176301956,
        -0.01311504002660513,
        -0.048563554883003235,
        0.016080984845757484,
        -0.04167930409312248,
        -0.0312841460108757,
        -0.032041240483522415,
        0.009756475687026978,
        -0.00942929182201624,
        0.019676294177770615,
        -0.04975629970431328,
        -0.014610867947340012,
        -0.06114912033081055,
        -0.0005523826112039387,
        -0.03280780464410782,
        0.04632526636123657,
        0.05234187841415405,
        -0.09304457157850266,
        -0.02422419935464859,
        0.019289767369627953,
        0.03906413912773132,
        -0.10800854116678238,
        -0.01499295886605978,
        -0.11416172236204147,
        -0.027851926162838936,
        0.039103440940380096,
        -0.0561232827603817,
        0.06797229498624802,
        -0.04087865725159645,
        0.005372705403715372,
        0.03253248333930969,
        -0.07692267745733261,
        -0.028110774233937263,
        0.06656980514526367,
        -0.03268586844205856,
        0.019976040348410606,
        0.0060491194017231464,
        -0.10437118262052536,
        0.0461149737238884,
        -0.043043024837970734,
        0.008036406710743904,
        -0.03542128577828407,
        0.006310292053967714,
        0.03402979299426079,
        -0.046324703842401505,
        -0.038535453379154205,
        0.02576477639377117,
        0.08917143195867538,
        -0.042245104908943176,
        -0.10026324540376663,
        0.020874612033367157,
        0.0042059579864144325,
        0.0218999944627285,
        -0.03063822165131569,
        0.011989782564342022,
        0.0015105863567441702,
        -0.05771094560623169,
        -0.07238894701004028,
        0.04211296886205673,
        -0.03928547352552414,
        -0.03456926345825195,
        -0.021074919030070305,
        -0.03520732372999191,
        -0.029582448303699493,
        -0.04668315872550011,
        -0.05007409304380417,
        0.061632685363292694,
        0.05143046751618385,
        -0.04766051843762398,
        -0.04523047059774399,
        -0.01594134420156479,
        -0.02103877253830433,
        -0.06781087070703506,
        0.008280222304165363,
        -0.002247030846774578,
        0.023131733760237694,
        0.022437632083892822,
        -0.04274627938866615,
        0.018930882215499878,
        -0.046324361115694046,
        -0.038408517837524414,
        0.022064287215471268,
        0.08282410353422165,
        -0.04950864240527153,
        0.08572913706302643,
        0.03324156999588013,
        -0.030291035771369934,
        0.03363898769021034,
        -0.09413191676139832,
        0.03012162074446678,
        0.06711602956056595,
        0.04142925143241882,
        0.002639512065798044,
        -0.08011369407176971,
        1.1467674729400986e-32,
        -0.02294228784739971,
        0.1252356767654419,
        0.05251292139291763,
        0.03101365640759468,
        0.016836147755384445,
        -0.012538147158920765,
        0.01830245554447174,
        0.06468196958303452,
        -0.05291420593857765,
        0.022199444472789764,
        -0.05549025163054466,
        0.013213745318353176,
        -0.04561638832092285,
        0.033492665737867355,
        0.062297273427248,
        -0.0009455606923438609,
        -0.012758560478687286,
        -0.029309101402759552,
        -0.0637732520699501,
        0.011847789399325848,
        0.05295027792453766,
        0.019054727628827095,
        0.0023197417613118887,
        0.086293064057827,
        0.12862376868724823,
        0.08114121109247208,
        0.08620983362197876,
        -0.017741646617650986,
        0.016344789415597916,
        0.004271822515875101,
        -0.04568757116794586,
        -0.05989288538694382,
        -0.004138018935918808,
        -0.041167207062244415,
        0.05227293446660042,
        -0.05590229108929634,
        -0.11109618842601776,
        -0.008278713561594486,
        -0.024549774825572968,
        -0.011717146262526512,
        -0.007775439415127039,
        0.0433686226606369,
        -0.061724964529275894,
        -0.06350710988044739,
        0.06119148060679436,
        0.0625070109963417,
        0.06436239928007126,
        0.14034312963485718,
        -0.017316382378339767,
        0.032051898539066315,
        -0.0074714552611112595,
        -0.004871294368058443,
        -0.034499287605285645,
        0.01856992393732071,
        -0.046060241758823395,
        -0.05810903012752533,
        -0.05909505486488342,
        0.04627368971705437,
        0.03991422802209854,
        0.04309685528278351,
        -0.012974591925740242,
        -0.033013153821229935,
        -0.035551417618989944,
        -0.007561391685158014,
        -0.054469358175992966,
        0.07823055237531662,
        0.020292455330491066,
        -0.03256695717573166,
        0.04977542906999588,
        0.04670093208551407,
        0.0015647988766431808,
        -0.023291470482945442,
        0.07084563374519348,
        0.0012420443817973137,
        0.08520754426717758,
        0.020609766244888306,
        -0.0980125218629837,
        -0.0686517134308815,
        0.02049313485622406,
        -0.003478300990536809,
        -0.10901329666376114,
        0.03822069987654686,
        -0.0016382918693125248,
        0.09099271148443222,
        -0.047552548348903656,
        -0.036343347281217575,
        0.016419142484664917,
        -0.02643577940762043,
        -0.04516374319791794,
        0.05411827564239502,
        0.011573174968361855,
        0.05406089127063751,
        -0.031897515058517456,
        -0.016214992851018906,
        0.012144019827246666,
        -1.0923270969440537e-32,
        0.08991352468729019,
        0.023305775597691536,
        -0.01131505984812975,
        -0.020006341859698296,
        0.06226452440023422,
        -0.035784222185611725,
        0.04592179134488106,
        0.11751791089773178,
        0.11570251733064651,
        -0.030250927433371544,
        0.0641971305012703,
        -0.02739633433520794,
        -0.0999777540564537,
        0.018196705728769302,
        -0.012132611125707626,
        -0.0049796379171311855,
        -0.014336403459310532,
        -0.11750690639019012,
        0.08265139162540436,
        -0.04175012931227684,
        0.07415715605020523,
        0.0907139703631401,
        0.0548982173204422,
        0.031065452843904495,
        0.0013991998275741935,
        0.02990436553955078,
        0.05256221815943718,
        0.04684078320860863,
        0.05254668369889259,
        0.0214510727673769,
        -0.05408964306116104,
        -0.04800286144018173,
        0.004404536448419094,
        -0.006196387577801943,
        0.002294532721862197,
        0.059158895164728165,
        0.019898205995559692,
        0.03010227344930172,
        -0.024793250486254692,
        -0.006921134889125824,
        0.032751090824604034,
        0.0020912629552185535,
        0.020435212180018425,
        0.00844497513025999,
        0.02557802014052868,
        -0.08329647034406662,
        -0.05085145682096481,
        0.07245529443025589,
        -0.051425039768218994,
        0.01336023211479187,
        -0.051262207329273224,
        -0.0290188267827034,
        -0.05894475802779198,
        -0.0009646855178289115,
        0.017526302486658096,
        -0.07884267717599869,
        -0.05206364020705223,
        -0.027639811858534813,
        -0.037064503878355026,
        0.03199689835309982,
        0.017206726595759392,
        -0.02032635360956192,
        -0.08251623809337616,
        -0.027398452162742615,
        0.010526025667786598,
        -0.04759401082992554,
        0.07745860517024994,
        0.024613995105028152,
        -0.01437502633780241,
        0.024617308750748634,
        -0.01323236245661974,
        -0.0222947858273983,
        -0.008050681091845036,
        -0.031522493809461594,
        0.025548167526721954,
        -0.028549378737807274,
        -0.058198925107717514,
        0.0123438136652112,
        0.10360632091760635,
        -0.03504185006022453,
        -0.03514903783798218,
        -0.03569843992590904,
        -0.008080914616584778,
        0.08174548298120499,
        0.09340745955705643,
        0.1491807997226715,
        0.04959073290228844,
        0.01917767897248268,
        -0.0014429838629439473,
        0.11704441905021667,
        0.03822940215468407,
        0.058372389525175095,
        0.08966674655675888,
        0.07268383353948593,
        -0.06092620640993118,
        -5.3959809065418085e-08,
        0.014676661230623722,
        0.05737444385886192,
        -0.006619975436478853,
        0.026735996827483177,
        0.0007257777033373713,
        -0.08431481570005417,
        -0.003434982616454363,
        0.05662097781896591,
        0.07259102165699005,
        -0.04766785725951195,
        0.08251876384019852,
        0.0017888399306684732,
        0.015269199386239052,
        0.06404999643564224,
        -0.012501729652285576,
        -0.02952648513019085,
        -0.06859410554170609,
        0.09230078756809235,
        -0.03932308033108711,
        -0.02134604938328266,
        0.0024120218586176634,
        -0.001809134497307241,
        -0.02623586356639862,
        -0.056805569678545,
        0.011769703589379787,
        -0.02685004286468029,
        -0.041438885033130646,
        -0.05031459033489227,
        0.036927465349435806,
        -0.008564417250454426,
        -0.09479852020740509,
        -0.0369972363114357,
        0.03961849585175514,
        0.016766240820288658,
        -0.06003998965024948,
        -0.05779825150966644,
        -0.0413348563015461,
        -0.05683544650673866,
        0.032622333616018295,
        -0.05031514912843704,
        0.00208881963044405,
        -0.051311105489730835,
        -0.0466654933989048,
        -0.025250615552067757,
        3.859450953314081e-05,
        -0.036106452345848083,
        0.016179144382476807,
        -0.15105435252189636,
        -0.016979485750198364,
        -0.04701672121882439,
        -0.09318529814481735,
        0.02212616428732872,
        -0.0017739247996360064,
        0.02768298052251339,
        0.0963677167892456,
        0.04549158737063408,
        0.061045531183481216,
        0.0378926657140255,
        0.005916358437389135,
        0.03388432785868645,
        0.06915163993835449,
        -0.042983416467905045,
        -0.09563540667295456,
        0.04305022582411766
    ]
}