{
    "id": "cVzCxCk8klg",
    "title": "I got caught in the hype - Google Pixel 8 Pro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-10-12T23:49:58Z",
    "video_url": "https://www.youtube.com/watch?v=cVzCxCk8klg",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "google",
        "pixel",
        "pixel 8",
        "pixel 8 pro",
        "phone",
        "smarthpone",
        "smartphone",
        "ai",
        "tensor"
    ],
    "views": 1288467,
    "likes": 31717,
    "comments_count": 2277,
    "description": "Get your Grip case with MagSafe for your new Pixel 8 or 8 Pro at   Linus has been using Samsung phones for quite a while now, but after reading constant leaks, he found himself falling for the Pixel hype cycle. With lofty camera claims, a new focus on AI, and a built-in thermometer(?), will Linus be impressed, or has Google promised more than they can deliver?  Buy a Google Pixel 8 Pro:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 The hype is real 0:20 Camera bump impressions 1:33 Tensor G3 and specs 2:18 What's in the box 3:05 Display specs and LABS results 4:06 LABS battery testing results 5:07 LABS gaming performance and thermal results 6:05 Design impressions and pricing 7:13 Misc. specs and trying out face/finger unlock 8:49 Buttons/ports 9:12 Sponsor - dbrand 10:39 Trying out the main cameras 13:57 Selfie camera impressions 14:45 Thermometer test 16:05 Speaker impressions 16:51 Where's the Pro mini? 17:16 Outro",
    "description_links": [
        "http://shortlinus.com",
        "https://lmg.gg/qgQg9",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "The thing with covering tech is sometimes it's hard not to get caught up in the hype train yourself. I've spent so much time talking about how exciting it is that the Pixel 8 and the Pixel 8 Pro come with seven years of software support that I haven't stopped to ask myself, are these phones I would wanna use for seven years? I guess it's time to answer that. Wow, that is a hard, that's not a camera bump, that's a camera lip. Truth be told, I haven't daily driven a Pixel since, good Lord, Gen 4, Gen 5? So this Geordie from Star Trek Next Generation whole thing that they've got going on here is kind of a new experience for me. Wow, that's really sharp. Does someone have like a, do we have a seven handy? David, are you seeing this? That's pretty wild. I mean, yours has that same hard edge on it, but man, they needed to rethink that on this. I could see that getting caught on your pocket. Hold on, let's try it. Oh no, no, she slides, she slides. Okay, hold on, let's try it again. Okay, all right. Maybe I'm making a mountain out of a small mountain here. Compared to the 7 rather than the 7A though, the difference is, wow, really subtle. Like, can you see that? Like barely, it seems to be there, but it's not that noticeable. Of course, the polarizing camera bump is not the star of the show here. That honor goes to the new Tensor G3 processor. It has a nine core CPU, one high performance core, four mid cores, four low performance energy efficient cores, and it's accompanied by either eight or 12 gigs of LPDDR5X, depending on whether you go for the 8 or the 8 Pro. Either of them is gonna be equipped with a seven core Mali 715 GPU, so we should see pretty strong gaming performance on the Pixel 8, but there are some key features that are different between the two devices, some of which are hardware, and some of which are really more software, which makes it feel kind of arbitrary. Like, oh, well, you didn't spend enough. Well, I guess you don't get those features. Talk about that in a minute. First, let's have a look at what comes in the package. You get a cable and an adapter for your cable. I was gonna say this, surely this can't be to do anything with this cable. I mean, you could jam that in there, but you might cause a short. Don't do that, please. Hopefully you have a USB-C wall wart or a computer to charge this thing off of because this is not a type C to type A adapter. Rather, this is just a transfer adapter so that you can move all of your data off of your old phone. In fact, that's one of the cool software features that is applicable to both of these devices. Google has beefed up their transfer wizard to allow you to move over not just your apps and data, but even things like your home screen layout, which if you're a creature of habit like me is actually kind of a big deal. I'm pretty excited about that. Wow, that's bright. And that is apparently by design. Google claims that on top of the better processor, these phones, particularly the 8 Pro, have the best screens they have ever put on their devices. With the 8 Pro boasting an LTPO OLED panel that can do from one to 120 hertz variable refresh rate and up to 2,400 nits peak brightness. Now, we weren't able to replicate those results. Our peak brightness was measured at about 1,900 nits, but it should be noted, we measured that in SDR. We don't have the tools for HDR yet, so it's not impossible that this would reach those lofty highs. By contrast, the Pixel 8 does not get quite the same capabilities. It only supports a 60 to 120 hertz refresh rate window, so there could be some efficiency losses there. And it only reaches 2,000 nits peak brightness according to Google's marketing materials. In a 5% window though, we saw about 1,600 nits. Again, it's possible we do 2,000 in HDR, we just aren't sure yet. On the subject of efficiency, they do get different sized batteries. What's funny though is our battery life testing didn't reveal an advantage for the 8 Pro in spite of the fact that it has a larger physical battery. And there's a number of reasons for this. One is that it has a larger, well, brighter display, but two, it also has a higher resolution display. So that's going to be more expensive for the GPU to drive in terms of power consumption. The last reason is that our battery life testing is actually done running full screen apps like video playback. So you're not gonna be able to take advantage of that super low refresh rate display when it isn't sitting idle, and it's actually displaying moving content. So in the real world, you may end up with a much more similar experience between the two. One thing that was similar was the charging speed. They both reached over 90% in one hour of charging and managed a full charge in about an hour and 15 minutes. Man, modern fast charging just makes the whole charge at night paradigm seem kind of quaint and antiquated. I'm not gonna get too much into gaming performance other than to say that both of them are notable upgrades over the Pixel 7 and Pixel 7 Pro. Genshin Impact in particular is really playable now with 1% lows that are over 30 FPS. But knowing from our thermal testing that most of the heat is escaping from this phone via the aluminum frame and the camera bump, I am a little bit worried about how hot those components got while we were doing our gaming testing. The outside of the phone reached as high as 44 degrees Celsius, which isn't enough to burn you immediately. Actually, I should look that up. 45 is enough to give you a second degree burn after two hours. So if you're at 44 and you game for two hours, you could conceivably burn your skin. Of course, I would expect you to be a very smart person who shifts their hands around a little bit every once in a while. But I don't know, I've met some people who get pretty dialed in when they game. It's pretty hot. I do have to say, I like the overall just fit and finish of these. Like I said before, it's been a while since I've daily driven a Pixel. Man, have they ever come a long way. It actually feels like $1,000 phone now, which it should because it is. $700 for the 8, $1,000 for the 8 Pro. I gotta say, I actually like the matte finish on the 8 better than the gloss on the 8 Pro. This feels, it almost feels like it's made of plastic. Do you guys find that? Here, come touch it. Somebody come touch it. Like honestly, if I told you this, just the edges. If I told you that cost more than that. It feels greasy. Yeah, and I like- This size is so much better too. My hands are not even dirty. Anyway, yeah, I'm not a huge fan. Though I do like the frosted back compared to the glossy glass back. Why can't I have the best of both worlds, Google? Like look, oh man, look at that. You see how much glare there is in the 8 compared to the 8 Pro? That's a really, really nice blasted glass back. Speaking of glass backs, they both do wireless charging with the Pro doing 23 watts and the non-Pro doing 18 watts, which is a little slower than what they do over a wire, but not that much. I mean, that's within striking distance, which is not bad. Both phones get Wi-Fi 7 and they get this new class three biometric face unlock, which is still just face unlock, except instead of needing an array of sensors, they're able to do class three with just the front facing camera. Kind of ironic, given that one of the controversies around this phone is the blurriness of the front facing camera. Okay, we'll look at the camera in a second. First, I wanna just try setting up that facial unlock. Start. That was it? Wow, that was... Wow. It's pretty fast. I'm still not a huge fan. I'd still rather just use a fingerprint if I'm gonna have to touch the screen anyway. Okay, let's see how fast the fingerprint is. Let's try fingerprint unlock. Boom. But, but, oh, I have to wake it first. Really? Okay, it should wake when I pick it up though. Bleh. I mean, maybe that was an outlier. Outlier, right? Yeah. Okay. I am on the thing. I think it doesn't start reading until... Oh, that's, that's, oh, that's terrible. Okay, it's fast when it decides to finally start actually reading it. Okay, well, I mean. Physically, aside from the camera bump, I mean, there's not a lot to say. Lock button, volume rocker, USB-C port, got some speakers on there, SIM card, and yeah, all the same things, but smaller. And overall, the theme kind of feels like, yeah, it's better than last gen, but we didn't really think outside the box on this one, which incidentally is the theme of this message from our sponsor. dbrand did no thinking outside the box. This is a boring old sponsor read, or is it? dbrand has you covered with their line of grip cases. For the Pixel 8 Pro and Pixel 8, they've integrated magnets, so they're compatible with MagSafe accessories. Okay, no, that's actually pretty cool. dbrand also sent over some MagSafe accessories for us to test to show how, with the grip case, a whole ecosystem of Apple accessories suddenly become compatible with the Pixel 8 and the Pixel 8 Pro. That is super cool. The magnets are extra strong, twice as strong as the iPhone MagSafe cases last year, so you can actually vigorously shake the case with the wallet attachment, and it's not gonna come flying off, and you can get yours at shortlinus.com. And my plan was to just tell you about all that, but no, dbrand insists that I show you, so okay, fine, dbrand. It goes in your case, there you go. Grip case, there you go, you happy? Here's a little charger. You can stick your phone to that, all MagSafe-like, and then put your, watch, doesn't matter. The point is, here's a first-party Apple accessory. Let's throw that on there. Oh, yeah. Oh, yeah, look, hey, a wallet. Boom. There, you happy, dbrand? You wanna see me go like this? For you. Hey, press power button twice to open up the camera. Love it. Can you also switch lenses? Nope. That is not how this one works. That just doesn't do anything. You still got some things to learn from your old pal, Samsung. Double-click, okay, it's a Note 9, it's pretty slow. Double-click, ooh, selfie camera, what's up? Oh, that's sick. It tells you if you're level? Shut up. Yeah, I believe you. Like I said, I haven't dailyed a pixel in forever. I mean, it's not the kind of thing that I would need, but that idiot I hand my camera to when I'm on the Las Vegas strip or whatever, and I just wanna get a picture with the wife, and they're like, oh, I don't know, it seems pretty good. Really? Eyes closed in the picture, James? I don't know what you're doing. He's like napping over here. Naturally, it's flipping sharp, even shooting directly into a light. It's kind of shocking how much detail it retains, and I can even see things that my own eyes can't make out. Start. Oh, interesting. That's cool, it prompted a fingerprint scan in order to start screen recording. I actually kinda like that. Now, with the Pixel 8, I would expect the main shooter to behave in pretty much exactly the same way, all the way down to James having his eyes closed. Thank you very much for that. Oh, that's funny. It's trying to boost the completely covered lens that is face down on this mouse pad, lttstore.com, by the way, into something usable. Okay, can Night Sight do it? No. At least it knows it can't do it, though. While they both have the same 50 megapixel main camera, the 8 has a 12 megapixel ultra wide, while the 8 Pro has a 48 megapixel ultra wide and a 48 megapixel 5X telephoto lens. So, theoretically, you should be able to, oh, wow, 5X is a frickin' lot. And what's really cool is not only are you getting a high resolution secondary sensor, you're also getting advanced features like optical image stabilization. So, unlike older phones where, sure, you have these secondary cameras, but realistically, you're better off just taking a shot with your main one and then zooming in on it, you may actually be better off using your telephoto. Like, this looks really sharp. That is definitely, without question, way sharper than what I would have if I just zoomed this in. Not even close. I'm moving a bit. Shake it, baby. That's not bad. It's definitely a little bit of jello, and it's kinda sticky, especially in 5X. Do you know what I mean by sticky? Ooh, it's sticky in 1X too. I can see what it's trying to do. It tries to kind of, it seems like, use an outer part of the sensor to kinda compensate a little bit when I'm moving and then slowly catch up once it figures out that my movement was intentional. Obviously, this is just a quick and dirty test, but I can already tell if the screen is anywhere near color accurate. What it's recording is not, and the iPhone is still gonna be king for video for another generation or two. But I wanted to talk about the selfie camera, right? Let's try it on both of them. That's interesting. I hit the shutter and made movement. It didn't actually make the click until later in the movement, but it was blurry. So it started capturing stuff for sure. On the subject of blurry, um, I gotta say, I feel like there might be a little bit of user error here because that seems like a perfectly sharp selfie camera to me. And it's kind of ironic because if they sharpened it too much, they might end up in the same kind of controversy hot water that Apple's in right now with people saying, oh, my selfies look so ugly on the iPhone 15 Pro. It's too sharp. I was hoping to play around with some of the, some of the tools for editing photos, but it looks like maybe some of that's pending. We're recording this a little early. There are some other things that were like that. The temperature sensor on the 8 Pro, for example, didn't work until an update that we got this morning. Google advertises their thermometer as being able to be used to check the temperature of everyday objects. It is a little limited in that you need to be within five centimeters or two inches of whatever it is that you're trying to measure. But hey, here, let's grab a temperature reading from, oh, wow, that two inch, that is really close. From this box, 22.9 degrees Celsius. Okay, that seems kind of believable. Let's validate that with a professional grade thermal camera now. The FLIR camera says 23.7. Okay, yeah, that's within a degree. I'd say that's pretty, oh, and it also depends where on the box we're measuring. Let's try, oh, let's try skin, my skin temperature. Okay, 34 degrees Celsius. Here we go. Sorry, guys, I just gotta check my temperature real quick here. Uh-huh. Now, obviously, these aren't using exactly the same method for recording temperature, but I mean, it's consistent at least. I don't know how useful that is. But hey, I mean, we weren't sure how useful the accelerometer would be in the iPhone, and here we are. Oh my God, just call it sRGB, or like, allow me to set a white point. This sucks. It's not loud yet. I haven't turned it up yet. But that really does seem like unusually good imaging. Max volume, obvious distortion. Before max volume, though, actually not bad. Not the best I've heard, not bad at all. How's the smaller Pixel 8, though? Makes a really big difference exactly how you hold it, but I'd be perfectly happy with either of those. One thing I would like to say still is, man, I do wish that you could get the 8 in the bigger size or the 8 Pro in the smaller size, because man, this is a lot more handleable for me, but I feel like, especially having seen what this camera is capable of, I would be very tempted. The ultra-wide, for example, also has optical image stabilization and better autofocus now, like, trs compelling. Trs, subscribe to Short Circuit, and I'll see you in the next one.",
    "transcript_keywords": [
        "Pro",
        "Pixel",
        "camera",
        "kind",
        "pretty",
        "Yeah",
        "Wow",
        "thing",
        "camera bump",
        "phone",
        "covering tech",
        "hype train",
        "things",
        "man",
        "selfie camera",
        "Google",
        "dbrand",
        "bit",
        "feels",
        "temperature"
    ],
    "transcript_entity_values": [
        "seven",
        "Wi-Fi 7",
        "15",
        "22.9 degrees Celsius",
        "23 watts",
        "last year",
        "three",
        "Pixel 8",
        "One",
        "Geordie",
        "8",
        "one",
        "about 1,900",
        "60",
        "USB",
        "Grip",
        "iPhone",
        "12 megapixel",
        "Google",
        "44",
        "700",
        "Tensor G3",
        "Max",
        "night",
        "Apple",
        "Star Trek Next Generation",
        "nine",
        "second",
        "about 1,600",
        "23.7",
        "seven years",
        "two inch",
        "max",
        "David",
        "two hours",
        "over 90%",
        "Samsung",
        "FLIR",
        "1%",
        "1,000",
        "Las Vegas",
        "2,000",
        "5X.",
        "7A",
        "Bleh",
        "first",
        "50 megapixel",
        "7",
        "two",
        "120",
        "SDR",
        "5%",
        "four",
        "GPU",
        "two inches",
        "about an hour and 15 minutes",
        "45",
        "up to 2,400",
        "five centimeters or",
        "Short Circuit",
        "this morning",
        "12",
        "LPDDR5X",
        "one hour",
        "34 degrees Celsius",
        "CPU",
        "First",
        "James",
        "Mali 715 GPU",
        "eight",
        "48 megapixel",
        "a minute",
        "18 watts"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "TIME",
        "PERCENT",
        "ORG",
        "ORG",
        "PERCENT",
        "MONEY",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "QUANTITY"
    ],
    "vector": [
        -0.16643618047237396,
        -0.020365528762340546,
        0.08514953404664993,
        -0.0454523041844368,
        0.13639715313911438,
        0.014295214787125587,
        0.05778660997748375,
        0.05523895099759102,
        -0.0489761084318161,
        0.0023369756527245045,
        0.005259833298623562,
        -0.025163544341921806,
        0.022901363670825958,
        -0.07395237684249878,
        0.03078138455748558,
        -0.049833398312330246,
        0.06389980018138885,
        -0.1000818982720375,
        -0.12931741774082184,
        -0.029809478670358658,
        0.016645656898617744,
        -0.081211157143116,
        0.05406275391578674,
        0.0349179245531559,
        0.026734739542007446,
        -0.03185076266527176,
        0.03725277632474899,
        -0.11177433282136917,
        -0.006347422022372484,
        -0.03732602298259735,
        0.007655769120901823,
        0.06941866874694824,
        0.00718151917681098,
        -0.0012573935091495514,
        0.02160840854048729,
        0.02108645997941494,
        -0.02162831649184227,
        -0.08383160829544067,
        -0.05017634108662605,
        0.013112306594848633,
        0.04940411448478699,
        -0.09035331010818481,
        -0.0542958565056324,
        -0.002441492397338152,
        0.03457123041152954,
        -0.004214329179376364,
        0.09433797001838684,
        -0.05446324497461319,
        0.007182396948337555,
        0.012754013761878014,
        -0.050044767558574677,
        -0.05918208509683609,
        -0.006512611173093319,
        -0.044634535908699036,
        -0.07889057695865631,
        0.04103805124759674,
        -0.020339064300060272,
        -0.07380833476781845,
        0.0472930409014225,
        0.04665876924991608,
        0.010528266429901123,
        -0.05749732628464699,
        -0.03687244653701782,
        0.13519994914531708,
        0.08435574173927307,
        0.0029253920074552298,
        0.0008597482228651643,
        0.019885655492544174,
        -0.060142483562231064,
        -0.017586808651685715,
        0.09767273813486099,
        0.054280005395412445,
        0.015963947400450706,
        0.04025997221469879,
        -0.017894113436341286,
        0.0039757052436470985,
        0.027311868965625763,
        -0.02341250702738762,
        0.07343001663684845,
        -0.03169950470328331,
        0.027281884104013443,
        -0.08965178579092026,
        0.002278634114190936,
        0.03884514421224594,
        -0.013192737475037575,
        -0.044455256313085556,
        0.041047245264053345,
        0.03725065663456917,
        0.013525060378015041,
        -0.07237395644187927,
        -0.026618510484695435,
        0.06052536889910698,
        0.017493881285190582,
        0.06511910259723663,
        -0.04053043574094772,
        0.037639934569597244,
        -0.014741870574653149,
        -0.08643531054258347,
        -0.06329319626092911,
        0.05793897435069084,
        -0.025816164910793304,
        0.032148584723472595,
        0.011691820807754993,
        -0.00870107114315033,
        -0.04478722810745239,
        -0.07695692032575607,
        0.012310463935136795,
        0.025186294689774513,
        0.05221172794699669,
        0.07132011651992798,
        -0.04880767688155174,
        0.04961412772536278,
        -0.04037676379084587,
        -0.006576141342520714,
        0.009917978197336197,
        -0.029487861320376396,
        -0.04564978554844856,
        0.010927329771220684,
        0.08847668021917343,
        -0.04708113148808479,
        -0.010127966292202473,
        0.0364738404750824,
        -0.02378886006772518,
        -0.015103084966540337,
        -0.06233936920762062,
        0.04089993238449097,
        -0.08684463798999786,
        1.814000841669876e-33,
        0.01542357075959444,
        0.06295319646596909,
        0.0007793112308718264,
        -0.07168426364660263,
        -0.015285387635231018,
        0.06291048973798752,
        -0.013928648084402084,
        0.025889061391353607,
        -0.025472547858953476,
        -0.04151088744401932,
        -0.0802765041589737,
        0.047557320445775986,
        -0.1227187067270279,
        0.045061856508255005,
        0.03841957449913025,
        -0.006100637838244438,
        0.022540803998708725,
        0.0344487726688385,
        0.02124973013997078,
        -0.01118561252951622,
        -0.04405985772609711,
        -0.005876400973647833,
        -0.011356503702700138,
        -0.023723099380731583,
        0.054714154452085495,
        -0.02993619441986084,
        0.038741644471883774,
        0.01731538213789463,
        -0.02218499779701233,
        0.018218491226434708,
        -0.01786818355321884,
        0.013170268386602402,
        -0.004788021091371775,
        -0.016126474365592003,
        -0.04982807859778404,
        -0.022241460159420967,
        -0.07966908067464828,
        -0.06000010296702385,
        0.05484797805547714,
        0.030127542093396187,
        -0.019007185474038124,
        0.06303241103887558,
        -0.044613905251026154,
        -0.06824087351560593,
        0.0011109018232673407,
        0.05285317078232765,
        -0.013974267058074474,
        -0.09498301893472672,
        0.029457177966833115,
        0.01795167848467827,
        0.026492970064282417,
        -0.012957222759723663,
        -0.10958733409643173,
        -0.06154154613614082,
        -0.005584319122135639,
        -0.040791105479002,
        -0.04087730497121811,
        -0.08198322355747223,
        0.08034498989582062,
        -0.013576686382293701,
        0.08138006925582886,
        0.07123097032308578,
        0.04242275655269623,
        -0.019287843257188797,
        -0.1048685610294342,
        0.0627826452255249,
        0.028140787035226822,
        0.02372419461607933,
        -0.10723985731601715,
        -0.0011441210517659783,
        -0.05538041889667511,
        -0.00915176048874855,
        -0.039767391979694366,
        -0.04390750452876091,
        0.02650005929172039,
        -0.015333045274019241,
        -0.09826338291168213,
        -0.06611037254333496,
        0.042211852967739105,
        0.01008107140660286,
        0.02568039484322071,
        -0.03353888541460037,
        0.10320264846086502,
        0.0560554563999176,
        -0.01768495701253414,
        -0.03196508064866066,
        0.02967526949942112,
        -0.0026321380864828825,
        -0.08658549934625626,
        0.05336928367614746,
        -0.0325852632522583,
        -0.016787318512797356,
        -0.034239694476127625,
        0.036652158945798874,
        -0.07748877257108688,
        -4.6169733660193595e-33,
        -0.061755768954753876,
        0.0005343885277397931,
        -0.03940035030245781,
        0.03158213943243027,
        0.01875593326985836,
        -0.030683869495987892,
        0.04930708929896355,
        -0.02446720376610756,
        0.05707192420959473,
        0.04576163738965988,
        -0.022124802693724632,
        0.054374031722545624,
        -0.021758252754807472,
        -0.08036021888256073,
        -0.04955299198627472,
        -0.09777648746967316,
        0.04136773198843002,
        -0.07434655725955963,
        -0.013715244829654694,
        -0.05396776273846626,
        0.09583337604999542,
        -0.010412308387458324,
        -0.028285911306738853,
        0.01935422793030739,
        -0.0037226493004709482,
        -0.039253655821084976,
        0.04465942457318306,
        0.039181679487228394,
        -0.02278786711394787,
        -0.027968978509306908,
        0.024332424625754356,
        -0.04869094118475914,
        -0.057730354368686676,
        0.013218071311712265,
        0.05747845396399498,
        -0.0137036656960845,
        0.06232006475329399,
        -0.005593359470367432,
        0.01771184429526329,
        -0.03742096573114395,
        0.04334230348467827,
        -0.07808610051870346,
        0.021538741886615753,
        -0.030090119689702988,
        0.016445528715848923,
        -0.02141653001308441,
        0.026120813563466072,
        -0.04054201394319534,
        0.01869875006377697,
        0.12803751230239868,
        0.011707641184329987,
        0.02789795584976673,
        0.010550561361014843,
        -0.004845461342483759,
        -0.07689773291349411,
        -0.026545638218522072,
        -0.06053191423416138,
        -0.0006191945285536349,
        0.013743508607149124,
        -0.012640955857932568,
        0.04537312313914299,
        0.0014674472622573376,
        -0.026976777240633965,
        -0.024344203993678093,
        -0.05104317143559456,
        0.02509152702987194,
        0.010136159136891365,
        0.029669033363461494,
        0.015783242881298065,
        0.019639404490590096,
        0.06719702482223511,
        -0.06522752344608307,
        -0.04640950262546539,
        -0.07681668549776077,
        -0.057842057198286057,
        0.0775218978524208,
        -0.005963447503745556,
        -0.011850852519273758,
        0.05301601439714432,
        -0.06047901138663292,
        0.023846402764320374,
        0.03668256476521492,
        0.09804956614971161,
        0.010075321421027184,
        0.0812574028968811,
        0.005420884117484093,
        0.04146512970328331,
        -0.1204901859164238,
        0.0014256981667131186,
        0.047909051179885864,
        -0.07142723351716995,
        -0.004328317940235138,
        -0.05056501552462578,
        0.061158958822488785,
        -0.00031592592131346464,
        -6.057767620859522e-08,
        0.0024228207767009735,
        0.007653954904526472,
        0.07498568296432495,
        0.01939261145889759,
        0.076149120926857,
        -0.102375827729702,
        -0.04056922718882561,
        -0.010259324684739113,
        0.10129661113023758,
        -0.017207523807883263,
        0.048365697264671326,
        -0.029171060770750046,
        -0.026364637538790703,
        0.04494590684771538,
        0.027504542842507362,
        0.023859161883592606,
        0.0029567894525825977,
        0.0051612239331007,
        -0.011172347702085972,
        0.005359036382287741,
        0.005127746611833572,
        0.03643174469470978,
        0.05255257710814476,
        -0.06944788247346878,
        0.024122165516018867,
        -0.0020730255637317896,
        -0.023832904174923897,
        0.022991375997662544,
        0.11201617866754532,
        -0.017453758046030998,
        -0.03977678716182709,
        -0.0032452952582389116,
        0.033378466963768005,
        0.006720433942973614,
        0.04639729484915733,
        -0.05126862972974777,
        -0.04781221225857735,
        0.044899314641952515,
        0.08940334618091583,
        0.03168034180998802,
        0.006232202984392643,
        0.0402187705039978,
        0.08850153535604477,
        0.02636980637907982,
        0.0633491799235344,
        -0.054974596947431564,
        0.04391920939087868,
        -0.08248056471347809,
        0.02895091101527214,
        0.08904624730348587,
        -0.04086535423994064,
        -0.032385919243097305,
        -0.019977033138275146,
        0.048704102635383606,
        0.06036867946386337,
        -0.09039201587438583,
        -0.013568580150604248,
        -0.007720713969320059,
        -0.04069871827960014,
        0.11392686516046524,
        0.05112375319004059,
        -0.14976921677589417,
        -0.05690523609519005,
        0.10424525290727615
    ]
}