{
    "id": "cxkoAmJJbAo",
    "title": "Gamer power (for gamers) - Eaton Tripp Lite Gaming UPS",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-11-09T21:04:34Z",
    "video_url": "https://www.youtube.com/watch?v=cxkoAmJJbAo",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "Eaton",
        "Eaton TrippLite",
        "UPS",
        "Eaton UPS",
        "TrippLite UPS",
        "Gamer",
        "RGB UPS",
        "GAMER UPS"
    ],
    "views": 577412,
    "likes": 20412,
    "comments_count": 1352,
    "description": "Thanks to Eaton for sponsoring this video! Buy an Eaton Tripp Lite Gaming UPS at:   Are you a gamer? Do you like having a battery backup with built-in RGB? Well, Eaton's Tripp Lite Gaming UPS just might be the product for you.  Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Intro 0:30 Gamer UPS unboxing & overview 3:32 What makes this for Gamers? 4:15 Plugging in & testing the GAMER UPS 7:21 Extended battery for more POWER 9:17 Outro",
    "description_links": [
        "https://lmg.gg/o1PL4",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- What's heavy, and every gamer needs one, but nobody wants to spend money on it? Ow! A UPS. This is the gaming UPS. And you laugh, but whether it's a workstation or whether it's a gaming PC, you should probably have a UPS. And Eaton sponsored this video, where we're gonna be taking a look at what is, to my knowledge, the first ever gaming uninterruptible power supply. Now, this is not to be confused with the power supply unit, or PSU, that your gaming PC already has. That thing converts AC power to DC power to ensure that all your sensitive electronics can operate correctly. What this does is entirely different, and its main functions are twofold. One... Whoa! Is that it actually cleans up any potentially dirty power that is coming into your PSU. So say, for example, the voltage in your house is lower than spec, or you have other noisy or high-draw devices that are being turned on and turned off, like air conditioners or blenders or vacuum cleaners. This will ensure that whatever's coming in will get tidied up and smoothed out before going out to your presumably expensive PC. And one of the main features of this particular unit, aside from the removable display for gamers... Wireless. Okay, we're definitely taking a look at that later. One of the main features of this one is that it is a pure sine wave unit. That means it tends to be more reliable and efficient, and transition more seamlessly between mains power and battery power. Because that's the second main feature of a UPS: it allows you to actually continue to run even a high-powered gaming PC like this one in the event of a power outage. Not for a long time, mind you. Eaton rates this one at about 17 minutes of operation under 300 watts of load, and up to 50 minutes of operation under 250 watts of load with their optional extended battery pack. So that's plenty of time to get to the next checkpoint or wrap up a document you're working on, and save and shut down properly. Of course, that doesn't mean you're actually limited to just 250 or 300 watts of load. Oh, actually, I shouldn't put this down here yet. (Linus groans) This is a 1,500-volt-amp unit, which means it can do a total of about 900 watts protected. But not all of these outlets are the same. This right here is the master UPS and surge outlet. This is the one we're gonna plug our computer into. All of these are controlled by the master. So UPS means that it is uninterruptible, it is battery-backed up, and surge protection means that just in the event of ugly, dirty power coming in, it's not going to be passed though to your sensitive electronics. So these guys right here are surge only. All of these are both surge and battery-backed up. But what's really cool is that the master controls all of these secondary units, so when the load on the master goes under 20 watts, all of these will actually turn off. It's a cool way to put your workstation to sleep and then have all of your lights and attached peripherals just switch off instead of being annoying vampire loads that are sucking away your power. It'll also to surge protection on your RJ11 or RJ45 connections, so for your land connection for your gaming PC, for example, but none of this inherently makes this gaming. Let's talk about what does. I guess you could argue that... Whoa. A USB Type-A or a USB Type-C charging port on the front is kind of gaming. But lots of non-gamers charge phones too, so... (laughs) What really makes it gaming is the RGB! - Did you just break it? - Whoa. You can see our voltage is a little low. Here in our office, we do know that we have kinda ugly power here, but now we've confirmed it. 124 minutes of runtime, if all we're powering is this display. That makes sense. It uses lead-acid batteries. That's why it's so heavy, and that's also why it takes about seven hours to charge from 10% to 90%. And it's got some other cool features. So let's say you're not actually there. Tripp Lite by Eaton has a software utility that will, if you connect to your PC via USB... Which you can see I'm about to do. Ah, there you go. Notify your computer of a power outage and then automatically shut it down once the battery reaches a critical level. So that way if you're on vacation or something... Let's say you hooked it up to a server instead of a gaming PC. It can automatically shut it down safely and ensure that no data gets corrupted or anything like that. This is cool. Apparently the RGB is configured out of the box to change color depending on your load. Boop. Hey, there we go. Oh, now she's kicked in. Thing thing draws 153 watts just on boot-up? Wait, I'm sitting here like an idiot. I was trying to figure out like, \"Aw, man, why would anyone really need a detachable screen for their UPS? So they're not crouched over their UPS trying to figure out what's going on with their computer, like a moron. Ha! Heh heh! 20 hours of battery life and apparently it works up to, what'd they say, 12 feet away or something like that? Gaming UPS, Brandon. I've officially seen it all. Oh, that reminds me. ShortCircuit has a new hoodie. There's this ShortCircuit hoodie on LTTStore, but there's also the new Color Block Hoodie in ShortCircuit colorway. Sick, right? This is so extra. It's definitely the right word. This is very extra. And if you want this feature, Eaton is the only one on the market who can provide it. No one else has a detachable display for their gaming UPS. Not a one. There's our banana for scale. There, okay. So we're sucking back... Wow, 260 watts right now, just sitting at the desktop? Man, our input voltage is low here. Yeah, it's like 105 volts. What is that? To be clear, when I'm complaining about our low voltage, I'm talking about from the transformers here in our building. What? You have to create a Bethesda account now? Why, gaming? I'm just not gonna play this game anymore. There, easy. \"Cyberpunk.\" \"Continue without account.\" Look at that. This is a frickin' spicy computer. I forgot what kinda specs we had on this thing. I don't even have the monitor hooked up to this yet. The fan is definitely audible, but the UPS works hardest when it's charging the battery or running off of battery. So what I suspect is that once the battery is charged, it should quiet down. Now, what I want to know, is even with just 44% battery life left, is it gonna manage to sustain this? (Linus yelps) The answer is yes, but I have no idea for how long because my display's over here. Input is zero volts AC. Yeah, zero hertz, that makes sense. And... Oh, oh, oh, oh. That remaining battery percentage, it's going down pretty quick! Oh, we got one minute of runtime, that makes sense. Uh, we should probably plug it back in. Yeah, yeah, yeah, I'm working on it. There we go. So that's the idea. You have a brownout or even a short power outage, your gaming session is completely uninterrupted. Or whatever else it is that you happen to be doing. While we're waiting for Eaton's Power Alert software to install, we're gonna go ahead and hook up our extended battery. And this guy right here uses the same chassis, but you can see there's no fan there, there's no outlets, nothing like that. I think all you need to do is take off this external battery plate... I think. I actually don't know. I am literally guessing right now. Plug in this. There you go. And then it just goes next to your primary unit. There's no external display on the extra battery unit. This is just a dummy. Our Power Alert system tray is set up, so now we just go to the web interface. All right, \"scan for devices,\" here we go. \"Discovery completed.\" Um... Oh. I'm not sure if I plugged it in all the way, actually. Uh... Oh. Yeah, it shut down safely. Let us find out why. Wait, it was only asleep. My game is even still running. Okay, well, hold on. \"One or more devices are initial...\" I'm sure there's a user's guide somewhere that explains what's happening, but I didn't read it. Is this really a 90-page document? You can tell Eaton's pedigree is enterprise. Which is a good thing. Ah, here we go. \"Shut down my system when the amount of battery power remaining falls below,\" let's say 20%. Right? Apply. Let's go ahead and pull the power and see if it shuts down gracefully. Ready, and, boom! Uh, where'd the thing go? Oh, right, I put it back on the thing. Ah! Okay. Oh. (UPS beeps) Okay, yes. Check out the Amazon links down below to pick up an Eaton Pure Sine Wave Gaming UPS today. And subscribe to ShortCircuit.",
    "transcript_keywords": [
        "power",
        "UPS",
        "gaming UPS",
        "gaming",
        "battery",
        "Eaton",
        "Wave Gaming UPS",
        "watts",
        "Eaton Power Alert",
        "unit",
        "battery power",
        "spend money",
        "thing",
        "Yeah",
        "power outage",
        "Power Alert",
        "shut",
        "load",
        "Gaming UPS today",
        "surge"
    ],
    "transcript_entity_values": [
        "10% to 90%",
        "Eaton",
        "just 44%",
        "about seven hours",
        "secondary",
        "153 watts",
        "One",
        "zero",
        "one",
        "20%",
        "USB",
        "up to 50 minutes",
        "Bethesda",
        "90",
        "just 250",
        "Amazon",
        "DC",
        "second",
        "PSU",
        "LTTStore",
        "AC",
        "Tripp Lite",
        "105 volts",
        "Eaton",
        "124 minutes",
        "300 watts",
        "about 900 watts",
        "Brandon",
        "first",
        "1,500-volt",
        "20 hours",
        "20 watts",
        "Boop",
        "Power Alert",
        "one minute",
        "Color Block Hoodie",
        "12 feet",
        "about 17 minutes",
        "Discovery",
        "Linus",
        "RGB",
        "ShortCircuit",
        "hertz",
        "Eaton Pure Sine Wave Gaming UPS",
        "260 watts",
        "250 watts",
        "today",
        "RJ45"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "PERSON",
        "PERCENT",
        "TIME",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "TIME",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORDINAL",
        "ORG",
        "EVENT",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "ORDINAL",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "PERSON",
        "ORG",
        "TIME",
        "FAC",
        "QUANTITY",
        "TIME",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.09532440453767776,
        0.02509577013552189,
        -0.029121695086359978,
        -0.08342146873474121,
        0.0622422993183136,
        0.050499286502599716,
        0.0853903591632843,
        0.03648994863033295,
        -0.026104455813765526,
        0.045471496880054474,
        -0.03429757058620453,
        0.009887747466564178,
        -0.01366286352276802,
        -0.035295553505420685,
        0.06051021069288254,
        0.053436730057001114,
        0.0574062243103981,
        0.018851811066269875,
        -0.07774817943572998,
        -0.04980368912220001,
        -0.030288446694612503,
        -0.08942694216966629,
        0.0375450998544693,
        0.02625930681824684,
        -0.03887849301099777,
        -0.0139102041721344,
        0.019292214885354042,
        -0.01065909955650568,
        -0.06558975577354431,
        -0.02743062749505043,
        -0.026367880403995514,
        -0.0010942976223304868,
        -0.023014822974801064,
        -0.029757006093859673,
        0.02606724202632904,
        0.05666616931557655,
        0.022043228149414062,
        -0.011904412880539894,
        -0.07602450996637344,
        -0.09047948569059372,
        -0.04334117844700813,
        -0.055726632475852966,
        0.033524297177791595,
        -0.020370472222566605,
        -0.02119983360171318,
        -0.0029341906774789095,
        0.0015564162749797106,
        -0.013999617658555508,
        0.04029277712106705,
        0.023701312020421028,
        0.08887701481580734,
        -0.07780498266220093,
        0.03433134779334068,
        -0.037120141088962555,
        -0.026639031246304512,
        0.09044914692640305,
        -0.020360099151730537,
        -0.024505821987986565,
        0.044253598898649216,
        -0.04673206806182861,
        -0.020750725641846657,
        -0.05068149417638779,
        -0.029123488813638687,
        0.07576095312833786,
        0.001988727366551757,
        0.005582673009485006,
        0.004826365038752556,
        0.06663017719984055,
        -0.07124479860067368,
        -0.043218959122896194,
        0.019621238112449646,
        -0.00041527763823978603,
        -0.050645023584365845,
        0.013207901269197464,
        -0.032587889581918716,
        0.007454724051058292,
        0.06311745196580887,
        -0.01586838625371456,
        0.006447124294936657,
        0.03635213524103165,
        0.018354127183556557,
        0.009614563547074795,
        -0.004616261459887028,
        -0.00022169933072291315,
        0.027590204030275345,
        -0.02542913518846035,
        0.06586339324712753,
        0.013682440854609013,
        -0.0683886781334877,
        -0.08152550458908081,
        -0.09586098790168762,
        0.08372803032398224,
        0.09498446434736252,
        0.06902589648962021,
        -0.04195345193147659,
        0.015377276577055454,
        -0.030284631997346878,
        -0.10036716610193253,
        -0.07554358243942261,
        0.05998742952942848,
        0.020084770396351814,
        0.09199530631303787,
        0.060462724417448044,
        -0.014219462871551514,
        -0.09472252428531647,
        -0.15194453299045563,
        -0.02069821208715439,
        0.10416311770677567,
        0.039338428527116776,
        0.010009552352130413,
        -0.03659114986658096,
        0.01827070489525795,
        -0.04292632266879082,
        0.036645352840423584,
        0.03640826418995857,
        -0.012405711226165295,
        -0.05470127612352371,
        0.02649005316197872,
        0.08152701705694199,
        -0.025343120098114014,
        0.05091681331396103,
        0.026240337640047073,
        -0.0049086748622357845,
        0.035576850175857544,
        0.005257213953882456,
        0.012280311435461044,
        0.06457190215587616,
        -2.3341052966889053e-33,
        -0.03856753557920456,
        0.013539465144276619,
        0.04088595509529114,
        -0.0006866734474897385,
        0.10984531044960022,
        0.020914196968078613,
        -0.029641268774867058,
        -0.0033047280739992857,
        0.004433436319231987,
        0.03603743761777878,
        -0.0591011606156826,
        0.10700208693742752,
        -0.04354318603873253,
        0.08618150651454926,
        0.026326647028326988,
        -0.0985066220164299,
        0.013507867231965065,
        0.02567407861351967,
        0.0043664113618433475,
        -0.03616566210985184,
        -0.028301678597927094,
        -0.01607602834701538,
        0.018204670399427414,
        0.009556871838867664,
        0.05939807742834091,
        -0.0068214042112231255,
        -0.009821097366511822,
        0.016449743881821632,
        0.07577359676361084,
        0.018824459984898567,
        -0.021572668105363846,
        -0.07445953041315079,
        -0.04375016689300537,
        -0.06787382811307907,
        -0.04343293234705925,
        0.001499530510045588,
        -0.032240595668554306,
        -0.05600171536207199,
        -0.0107644721865654,
        0.019310222938656807,
        0.003204807173460722,
        0.04160046577453613,
        -0.11308954656124115,
        -0.10141098499298096,
        -0.06938918679952621,
        -0.00528628658503294,
        0.06304086744785309,
        -0.061178259551525116,
        -0.005360398441553116,
        0.02248194068670273,
        -0.08009970933198929,
        0.006922874134033918,
        -0.08684065192937851,
        -0.08450774103403091,
        -0.03686634078621864,
        -0.10174629092216492,
        0.006573422346264124,
        -0.029205748811364174,
        0.12678289413452148,
        -0.013165326789021492,
        0.09344439208507538,
        0.07656735181808472,
        0.06140698119997978,
        -0.04176335781812668,
        -0.06583815813064575,
        0.0001024599841912277,
        0.06407193094491959,
        -0.057086281478405,
        -0.1365477293729782,
        -0.05139804631471634,
        0.004019241314381361,
        -0.009359518997371197,
        0.04475795477628708,
        -0.07347273826599121,
        0.025199247524142265,
        -0.002469561994075775,
        -0.10533087700605392,
        -0.055204667150974274,
        -0.06450272351503372,
        -0.02168206125497818,
        -0.07939402759075165,
        -0.07326511293649673,
        0.006030362099409103,
        -0.03906223922967911,
        0.0134514719247818,
        -0.0622393898665905,
        -0.030100548639893532,
        -0.004305160138756037,
        -0.05899965018033981,
        -0.023841409012675285,
        -0.10143895447254181,
        0.014055544510483742,
        -0.01019914261996746,
        -0.007345638237893581,
        -0.02481154166162014,
        -2.090076526549037e-33,
        -0.0612603984773159,
        0.006183838006108999,
        -0.04033686965703964,
        0.02685295045375824,
        0.13542217016220093,
        0.05387166514992714,
        0.06708849221467972,
        -0.005361631512641907,
        0.09548667818307877,
        -0.0007912954315543175,
        -0.052054375410079956,
        0.0385671928524971,
        -0.1063869521021843,
        -0.036553382873535156,
        0.008059957064688206,
        -0.027153274044394493,
        -0.003768907394260168,
        -0.0032667608465999365,
        -0.0039217062294483185,
        -0.04585365206003189,
        0.07112276554107666,
        0.03515177592635155,
        -0.02138138748705387,
        0.05437259003520012,
        0.01312798261642456,
        0.04096759855747223,
        0.06535712629556656,
        0.0528385229408741,
        -0.02154596522450447,
        0.059631578624248505,
        -0.007524427026510239,
        -0.015567886643111706,
        0.008925112895667553,
        0.05543166399002075,
        -0.017788538709282875,
        -0.06520893424749374,
        0.07922869920730591,
        0.05075209587812424,
        -0.05836935713887215,
        -0.03208573907613754,
        0.0482567623257637,
        -0.020160997286438942,
        -8.50795288442896e-07,
        0.03012176789343357,
        -0.02327708899974823,
        -0.04589230939745903,
        -0.07777537405490875,
        -0.033531416207551956,
        -0.014922349713742733,
        0.04494946822524071,
        -0.04834086075425148,
        -0.033061832189559937,
        0.023993000388145447,
        0.030695980414748192,
        -0.022958554327487946,
        -0.06737948209047318,
        0.017989106476306915,
        0.09274060279130936,
        -0.024196000769734383,
        -0.024831505492329597,
        0.01617872528731823,
        -0.03069409355521202,
        -0.019766636192798615,
        -0.004677999764680862,
        -0.014878966845571995,
        -0.008565336465835571,
        0.06189941242337227,
        -0.011943803168833256,
        -0.0016822045436128974,
        0.02001008950173855,
        -0.03625338524580002,
        0.001664510928094387,
        0.03484368696808815,
        -0.05390193685889244,
        -0.09049590677022934,
        0.020016955211758614,
        0.06996839493513107,
        0.0010685991728678346,
        0.06505744159221649,
        -0.12422621250152588,
        -0.030374059453606606,
        -0.008181066252291203,
        0.05304378271102905,
        -0.01533437892794609,
        0.038311176002025604,
        -0.04882783070206642,
        0.005661404691636562,
        -0.0251767635345459,
        -0.039857737720012665,
        -0.004561179783195257,
        0.015615935437381268,
        0.02537498064339161,
        -0.01712348684668541,
        0.07956399023532867,
        0.022067965939641,
        -5.7965216626598703e-08,
        0.00502026965841651,
        0.029045825824141502,
        0.01040387712419033,
        -0.005619355943053961,
        -0.0178761538118124,
        -0.0475226454436779,
        0.07362151890993118,
        -0.017428617924451828,
        0.05952766537666321,
        -0.11279154568910599,
        0.051067765802145004,
        -0.12127053737640381,
        0.08169884234666824,
        0.01118084229528904,
        0.04752318933606148,
        0.027168314903974533,
        -0.01837565191090107,
        0.10080958902835846,
        -0.058681488037109375,
        0.04240882024168968,
        -0.04033360630273819,
        0.05454862490296364,
        0.08620359748601913,
        -0.06833174079656601,
        0.03830796852707863,
        0.05971672758460045,
        -0.03857595473527908,
        -0.00792276207357645,
        0.09141836315393448,
        -0.045326992869377136,
        -0.008458616212010384,
        0.02719256281852722,
        0.008277359418570995,
        -0.012264126911759377,
        0.017247069627046585,
        -0.02867579646408558,
        -0.020862236618995667,
        0.05305355787277222,
        -0.018532589077949524,
        0.008904535323381424,
        -0.09465014189481735,
        -0.09457080811262131,
        0.015316333621740341,
        -0.02887915074825287,
        0.029673265293240547,
        -0.02707231417298317,
        -0.02256646379828453,
        -0.0466531403362751,
        -0.04354335740208626,
        0.11305757611989975,
        -0.043572064489126205,
        -0.022469324991106987,
        0.02298170141875744,
        -8.163972961483523e-05,
        0.07969527691602707,
        0.013396820984780788,
        -0.0648777186870575,
        0.06394834071397781,
        -0.00801925640553236,
        0.04031333327293396,
        0.04394246265292168,
        -0.09051162749528885,
        -0.055981531739234924,
        0.10242551565170288
    ]
}