{
    "id": "CY7tahx7VQM",
    "title": "Is A Robot Cat Toilet Really Worth $500?",
    "channel": "Dawid Does Tech Stuff",
    "channel_id": "UCvcRA2Hva1lULVf4GCouH8w",
    "subscriber_count": 688000,
    "upload_date": "2024-03-26T13:00:11Z",
    "video_url": "https://www.youtube.com/watch?v=CY7tahx7VQM",
    "category": "Science & Technology",
    "tags": [
        "dawid",
        "dawid does tech stuff",
        "PC",
        "gaming",
        "intel",
        "AMD",
        "Corsair",
        "Gaming",
        "Game",
        "Computer",
        "Gaming PC",
        "David Does Tech Stuff",
        "DDTS",
        "Tech",
        "Stuff",
        "David",
        "Linus",
        "Linus Tech Tips",
        "Windows",
        "Microsoft",
        "CoolerMaster",
        "DeepCool",
        "bequiet!",
        "Technology",
        "cloud gaming",
        "streaming",
        "xbox",
        "playstation",
        "sony",
        "Windows OS",
        "GPU",
        "Nvidia",
        "gaming laptop",
        "laptop",
        "gaming computer monitor",
        "monitor",
        "Nvidia GeForce RTX"
    ],
    "views": 115918,
    "likes": 7441,
    "comments_count": 604,
    "description": "My cat grows to love a robot toilet.  What do you think of the Neakasa Automatic Cat Litter box? Official purchase link:  *Get 8% off with code M1NEW* Amazon (Affiliate) purchase link:  *Get $30 off with CATCATNEW3*  Get some AWESOME Dawid T-shirts, Mouse pads and more here:   Play some Minecraft on the Dawid Does Minecraft server courtesy of our friends at Linode! Dawid Does Minecraft Name: Mctenthiddy, server IP: mc.tenthiddy.com It works on Java version 1.19.3  Support the channel on Patreon:    *Follow me on whichever Social media you don't hate* Discord:  Twitch:  Twitch bits on YouTube:",
    "description_links": [
        "https://pxle.me/vgE6rkFV",
        "https://amzn.to/3IWA0BJ",
        "https://dawiddoesmerch.com",
        "https://www.patreon.com/DawidDoesTechStuff",
        "https://discord.gg/b34uVGaYVB",
        "https://www.twitch.tv/dawiddoestechstuff",
        "https://www.youtube.com/channel/UCAiMJaOrvTik7XyJethz-ig"
    ],
    "transcript": "This is my cat neko... and I know a bunch of you are going to comment Your cat'sname is Cat and that's stupid. Well, do you know what? You're a stupid! How about that? huh? How do you like that? Anyway, moving on from my little outburst... For today's video, Neakasa sent over one of their fancy new robot toilets for Neko to defile. [Music] [Music] Now the fancy new cat lavatory in question is the Neakasa M1 Automatic Cat Litter Box... whose box looks like it was passed through an actual cat... one with a very violent digestive system. This has some exciting features on the side of the Box. Apparently it's hands-free for a maximum of 14 days and there's an app which helps your big brother track your cat's poop schedule which kind of weirds me out. I don't know if I'm going to be able to get Neko's consent for that. One there are some safety tips so that we don't injure our cat. I don't know if we have Bentonite at home but I'm I'm sure we can find some. ooh, it comes with a litter catchment mat and then under that we've got some robot L legs. Let's get the legs out and here are a bunch ofbags I'm guessing for all of the poop to go into and a user manual which hides an external power brick. Ooh, this feline latrine is not very power hungry as you can see there but you do need to be near an outlet unfortunately, it has a nicely braided cable. That kind of just looks like a plastic bin on a pivot but in here there's some Hightech ablution action going on with a like like a grate that I guess sifts the poops I don't know if that's a that's a technical term okay now I get to throw my back out unboxing it oh it's big now there is quite a lot going on on the base of this these holes are where you screw the feet in so that it elevates it a bit off the ground and then this I think is the poop catcher which this is quite rubberized and then I think it can pop out yes there we go so that it can accommodate a reasonable amount and then these have like little guide holes so that you put them in the correct way around I like that oh yeah okay so now that properly set up it looks even more like a bear or some animal on the front there's a bunch of controls for Neko to use I think it's going to be a bit of a learning curve for him to turn his toilet on and off every time he gets into it but he should be fine with all of the rest of the controls like the cleaning functions and stuff he's a smart guy I'm sure he'll figure it out and then in here I've just figured out how this works right so this is like a it's almost like a silicon pad down here which I think is where your cat craps onto but you have like cat litter in here and then when your cat's done just defiling this area then the kitty crapper rotates and dumps all of the desecration into the base of it but with that I'm going to take this home and we're going to introduce it to the neach Chan from the moment I got home Neko was anxious to see his upgrade toilet from the one he's been using for years which doesn't even have an app madness put on inside ni and then we're going to put the feet on initially he was real involved in the setup of his new ouse oh look at it move but the moment it started self articulating I was the one that was way more excited about it than Neko okay so that's what it looks like you do need to plug it in uh and then once you've plugged it in your cat completely loses interest and walks away from it which is kind of standard I think so we're going to have to put some litter in here before that stops flashing it is going to be quite difficult for him to get in he's got like a whole ledge to climb up I mean he is a cat they are very Nimble but still and after a quick snack and some coaxing Neel was reignited with new toilet lust oh there we go okay and now he's licking the plastic oh that is potentially concerning cuz he's like a plastic junk but Neko didn't spend too much time making out with his new friend before settling in nicely oh it's immediately gotten him all sleepy so I went to go get some cat litter and add a dash more context our cat neko is a pretty big boy he's not a little cat so I think he's a good example of a lot of girth of cat in the litter box although as I mentioned earlier there is quite a big step getting into the litter box so I think Neko is not a great test of how accessible this litter box is for a small cat having to clamor up into it now other than that I am curious to see how Neko handles this toilet cuz he has quite an interesting way of using his litter box he pretty much perches on the edge of it like Batman on the side of a building it's very precarious and I'm not sure how well it's going to work in the Neakasa because of the kind of angle that it's at I don't know if there's enough purchase for him on it let's connect it to the app and then see how we go about calibrating the cat lter which is something that is a little bit contentious cuz it doesn't accept the cat litter that we normally use which is like a a wood chip based one you have to use a different one which we've used in the past and didn't like sh we got to download an app yeah my favorite thing in the world I wonder I wonder how much personal data they're going to want now aside from the app just having a single onear review on the App Store always a great sign the app needs an email address for login which I guess makes sense but it also needs precise location data before it will Calibrate at the toilet for some reason now I'm no engineer but I don't understand why my cat's toilet needs to know where I am before it'll calibrate to the cat litter in it but maybe there's some very important reason for that so after connecting the app to the Wi-Fi and making a toilet Tinder profile fan I could finally dump some cat litter into the toilet which it could then calibrate too because it knew where I was but then I ran into a bit of a problem oh I forgot the bags I forgot the litter bags that came with the Neakasa at the office but I decided it was a great opportunity for me to test its compatibility with just bags you buy at a shop now these are mediumsized bags the problem with these is as the size goes up they just get kind of deeper as supposed to to bigger but I'm hoping this works oh that's not ideal and then once you half acidly pack the bag in you kind of slide it in and then it's in and once the toilet fully figured everything out the real battle started getting Neco to use his new water closet and so the cat poop waiting began with Neco staring down his new toilet for ages do we need to give you some laxatives Neko? (joke) Neko had other plans all the excitement had him tuckered out so he head to his hidey-hole, leaving me in a state of intense productivity. So after several hours of sleeping Neko-chan has finally woken up, although he doesn't seem to be into pooing at the moment. How are those bowels doing down there huh? Are they full? but the only thing on Neko's mind was tummy play action until the toilet started stirring. Oh! Neko. I think the toilet thinks you used it... but this wasn't enough to win over Neko's heart because when he eventually chose to go to the bathroom he used the wrong one. Neko-Chan... that's the wrong toilet. You need to do... You need to be using that one! Why are you perching there? ... Oh look at that face! o_o The thing that they suggested in the manual is that we move some of the old litter in there in into there so that he like recognizes the new smell but even with the used cat litter mixed into the new toilet Neko kept using his trusty old toilet so then we decided to block off his original toilet which Neko was not a big fan of but finally after an extended display of how displeased he was Neko gave in and with that great success let's give Neko a bit of much needed privacy and check back in in a couple days after the initial struggle Neko seemed to acclimatize to his new toilet real nicely he seems to quite like it sometimes even hanging out in it just for like General Recreation and the toilet works way better than I was expecting after every time Neko uses it it goes through a rotation cycle which filters out the defiled cat litter dumping it in the basement leaving just clean cat litter at the top for Neel to interact with and it does all of that with no interaction on your part the only time you need to do anything is either add more cat litter or empty out the poop dungeon once it gets full which the bag makes really easy to do although I am still looking for off the-shelf bags that'll fit in the tray and I do wish they had compostable options because as it stands it is quite plastic heavy but at the end of the day I accepted it because I thought would be funny but I actually like this toilet way more than I was expecting although there are a couple of issues with it the plastic bag one like I mentioned before I don't like that you have to use an app with it even if it does let you track your cat's bowel movements for some reason although it is nice that it tells you when the poop dungeon is full and when to change it out and another issue is that because it's got a bunch of moving Parts it's never going to be as reliable as just a bin on the ground and then there's the whole thing of it costing quite a bit of money I think it's worth what it costs but it's still a bunch of money to spend on just a thing your cat in however it is like having a poop Butler which is pretty cool which brings me to the end of me massively violating my cat's privacy so um yeah if you enjoyed it subscribe to the channel and until the next video [Music] bye-bye",
    "transcript_keywords": [
        "Cat Litter",
        "cat",
        "neko",
        "Litter",
        "toilet",
        "cat neko",
        "Litter Box",
        "Cat Litter Box",
        "Automatic Cat Litter",
        "app",
        "Box",
        "cat poop",
        "toilet Neko",
        "poop",
        "cat toilet",
        "Neakasa",
        "cat litter mixed",
        "defiled cat litter",
        "cat litter dumping",
        "clean cat litter"
    ],
    "transcript_entity_values": [
        "Neko",
        "the end of the day",
        "the App Store",
        "half",
        "Neko-chan",
        "Neko",
        "Chan",
        "General Recreation",
        "Neko",
        "Neco",
        "One",
        "several hours",
        "years",
        "a couple days",
        "today",
        "the Neakasa M1 Automatic Cat Litter Box",
        "Neel",
        "Batman",
        "Neakasa",
        "Neko-Chan",
        "14 days",
        "Butler",
        "Hightech",
        "Neco",
        "the Wi-Fi",
        "Neel"
    ],
    "transcript_entity_types": [
        "LOC",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "GPE",
        "PERSON",
        "CARDINAL",
        "TIME",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.0534733422100544,
        -0.0451028048992157,
        0.06537866592407227,
        -0.07289649546146393,
        -0.0576513335108757,
        -0.09069517999887466,
        0.07652922719717026,
        0.017361976206302643,
        -0.0157461054623127,
        0.031179586425423622,
        -0.03059401735663414,
        0.010755902156233788,
        -0.010841879062354565,
        0.041314706206321716,
        0.005421805195510387,
        -0.07797801494598389,
        0.09827481210231781,
        0.011378388851881027,
        -0.08201774209737778,
        -0.009161380119621754,
        -0.028415922075510025,
        0.0034625851549208164,
        0.08029818534851074,
        -0.06727506220340729,
        -0.007399515248835087,
        0.009777117520570755,
        -0.006840790156275034,
        -0.017479384317994118,
        -0.08162176609039307,
        -0.0584600493311882,
        -0.0767517015337944,
        0.03360601142048836,
        -0.05158300697803497,
        0.003910829313099384,
        -0.02839634381234646,
        -0.04126624017953873,
        0.015342267230153084,
        0.04267566651105881,
        -0.0593021921813488,
        -0.020500803366303444,
        -0.0027118835132569075,
        -0.08355889469385147,
        0.04678555577993393,
        0.0157783143222332,
        -0.076758973300457,
        0.07455388456583023,
        -0.04930455610156059,
        -0.07380793243646622,
        0.040190402418375015,
        -0.013429422862827778,
        -0.12014444172382355,
        -0.04558653384447098,
        0.16016295552253723,
        0.03496222943067551,
        -0.02874262072145939,
        -0.060299716889858246,
        0.04686369374394417,
        0.015202127397060394,
        -0.01439114660024643,
        0.0045065502636134624,
        0.035149019211530685,
        -0.06232473999261856,
        -0.01639454998075962,
        0.07874433696269989,
        0.00867411494255066,
        -0.04631149396300316,
        0.024901362136006355,
        -0.020702796056866646,
        -0.021318284794688225,
        -0.04210052639245987,
        -0.04005996510386467,
        0.035518866032361984,
        0.039522890001535416,
        0.0712624192237854,
        -0.07642830163240433,
        0.03663966804742813,
        0.09702053666114807,
        -0.004404918290674686,
        0.057228077203035355,
        0.06333544850349426,
        0.061381995677948,
        0.024402836337685585,
        0.002772662788629532,
        -0.004934718832373619,
        -0.0002795323671307415,
        0.028743864968419075,
        0.003971593454480171,
        0.05362846702337265,
        -0.033285874873399734,
        0.004870857577770948,
        0.025123152881860733,
        0.06452413648366928,
        0.08261623233556747,
        -0.045886263251304626,
        0.0033659394830465317,
        -0.0031400970183312893,
        -0.02286423183977604,
        0.006751157809048891,
        -0.07672770321369171,
        0.06200416386127472,
        0.014903070405125618,
        0.06748905777931213,
        -0.023081736639142036,
        -0.024242691695690155,
        0.05566612258553505,
        -0.04835723340511322,
        0.024037059396505356,
        0.0803852453827858,
        0.10180694609880447,
        0.05934179574251175,
        -0.0998016968369484,
        -0.0599835030734539,
        -0.004887434188276529,
        -0.029552124440670013,
        -0.035217344760894775,
        0.04374357685446739,
        -0.038795094937086105,
        0.017137374728918076,
        0.08151289820671082,
        -0.04702268913388252,
        0.06187519431114197,
        -0.08947446197271347,
        -0.04244009777903557,
        0.03067893721163273,
        0.07548433542251587,
        0.014017355628311634,
        -0.08693204075098038,
        2.747883165269189e-33,
        0.022433539852499962,
        0.02462526597082615,
        -0.06457819044589996,
        -0.010707644745707512,
        0.030887331813573837,
        -0.027840038761496544,
        0.00010248053149553016,
        0.025182196870446205,
        -0.049918707460165024,
        -0.07316436618566513,
        -0.055002909153699875,
        -0.020091552287340164,
        -0.09731646627187729,
        0.01622042991220951,
        -0.021191975101828575,
        -0.028034448623657227,
        -0.009247560054063797,
        -0.06893212348222733,
        0.021775998175144196,
        0.03545727580785751,
        0.0735686793923378,
        0.021206766366958618,
        0.058251868933439255,
        0.038142021745443344,
        0.0203093308955431,
        -0.043151650577783585,
        -0.05765952542424202,
        -0.035566914826631546,
        0.05728985741734505,
        0.0532011054456234,
        -0.040979038923978806,
        -0.12456826120615005,
        -0.044663507491350174,
        0.029283031821250916,
        -0.07872903347015381,
        -0.07075291126966476,
        -0.1057308167219162,
        -0.0960722267627716,
        -0.04124116152524948,
        -0.008566495962440968,
        -0.00938045047223568,
        -0.006179943215101957,
        -0.08091685175895691,
        -0.019001880660653114,
        -0.04668768122792244,
        -0.022229773923754692,
        -0.012437830679118633,
        0.019564667716622353,
        -0.02948344126343727,
        0.04913437366485596,
        0.04572119191288948,
        0.05243609473109245,
        -0.04861604794859886,
        -0.0013151513412594795,
        -0.0427202470600605,
        -0.09457157552242279,
        0.0070848893374204636,
        -0.034335725009441376,
        0.027041736990213394,
        0.06392765045166016,
        -0.05258214473724365,
        0.018063774332404137,
        0.06897523254156113,
        0.009913337416946888,
        0.00784610491245985,
        -0.002842911519110203,
        0.07527109235525131,
        0.05591228976845741,
        0.0528826080262661,
        0.06288059800863266,
        0.028470607474446297,
        0.03324057161808014,
        0.006644911598414183,
        -0.06793390214443207,
        -0.016247283667325974,
        -0.04364322870969772,
        0.007378004491329193,
        -0.07026357203722,
        0.0348118394613266,
        0.0058226813562214375,
        0.08712215721607208,
        0.006960909813642502,
        -0.05933324992656708,
        0.03575482219457626,
        0.001223067520186305,
        0.015601782128214836,
        0.0584319569170475,
        -0.007764055393636227,
        0.017494821920990944,
        0.004007864743471146,
        -0.026688722893595695,
        0.046777646988630295,
        -0.04228467866778374,
        -0.03785386309027672,
        0.04437035322189331,
        -2.85690420516521e-33,
        -0.0353439636528492,
        0.015332942828536034,
        -0.015188092365860939,
        0.060465045273303986,
        -0.07217038422822952,
        0.023171737790107727,
        0.0381527841091156,
        0.06350386887788773,
        -0.0018206741660833359,
        0.0183396153151989,
        -0.07126859575510025,
        0.047970253974199295,
        -0.047116585075855255,
        0.0012236390030011535,
        0.049178872257471085,
        -0.0752289667725563,
        -0.00990818440914154,
        -0.10617724806070328,
        0.04206706956028938,
        -0.02597845159471035,
        -0.050481852144002914,
        0.09380242973566055,
        -0.08311644196510315,
        0.0344729945063591,
        0.005832665599882603,
        0.020674770697951317,
        -0.0032365473452955484,
        0.06461357325315475,
        -0.008831165730953217,
        -0.01968781091272831,
        0.08561640232801437,
        0.021262068301439285,
        -0.06702972203493118,
        -0.044555652886629105,
        0.0580253079533577,
        0.013577300123870373,
        0.03371497988700867,
        0.014065062627196312,
        -0.07195907831192017,
        -0.04570119455456734,
        0.01898365095257759,
        -0.024727577343583107,
        -0.09347091615200043,
        0.019888456910848618,
        -0.03165769577026367,
        -0.06312225759029388,
        -0.08231335133314133,
        -0.00037288651219569147,
        0.02494209073483944,
        0.01683470420539379,
        0.027677487581968307,
        -0.026847124099731445,
        0.07838615030050278,
        -0.05285825952887535,
        -0.019553666934370995,
        0.04420599713921547,
        0.006634523160755634,
        0.05490667372941971,
        -0.05563117563724518,
        0.06265057623386383,
        0.01585417427122593,
        0.009802157990634441,
        -0.04060416296124458,
        0.04673532769083977,
        -0.03949176147580147,
        -0.0051124440506100655,
        0.04932115972042084,
        -0.010589228942990303,
        -0.03559255599975586,
        -0.012594389729201794,
        -0.024172745645046234,
        0.07308840751647949,
        -0.056824684143066406,
        -0.08109594881534576,
        0.02053634449839592,
        0.05263296142220497,
        0.09334772080183029,
        0.046803321689367294,
        0.0024670965503901243,
        0.008086438290774822,
        -0.010409177280962467,
        0.06449935585260391,
        0.038708582520484924,
        -0.012427689507603645,
        0.08755198866128922,
        -0.02475252002477646,
        0.027891939505934715,
        0.14441393315792084,
        -0.09653285145759583,
        0.011881321668624878,
        0.01042441837489605,
        0.08678904175758362,
        -0.043295420706272125,
        0.09654603898525238,
        0.07955814152956009,
        -5.2952760398738974e-08,
        -0.034383758902549744,
        0.0015490076038986444,
        0.0002323328808415681,
        0.047500696033239365,
        0.08291109651327133,
        0.032825030386447906,
        -0.028107810765504837,
        0.0006114720599725842,
        -0.009858197532594204,
        0.05300091952085495,
        0.08941900730133057,
        -0.02374999225139618,
        -0.04789280518889427,
        0.03937821835279465,
        0.06986209750175476,
        0.06825166940689087,
        0.0030650505796074867,
        -0.03726557269692421,
        -0.04647129401564598,
        0.09798131138086319,
        0.03432688117027283,
        -0.0033196439035236835,
        -0.07879012823104858,
        -0.006725153885781765,
        -0.06304281949996948,
        0.01692233979701996,
        0.02708970196545124,
        0.05072066932916641,
        -0.02334912307560444,
        -0.051769621670246124,
        -0.033424556255340576,
        -0.011440219357609749,
        0.018784107640385628,
        0.00992865115404129,
        0.03152536600828171,
        -0.04930632561445236,
        -0.024043787270784378,
        -0.07406792044639587,
        0.035749565809965134,
        0.02183285914361477,
        -0.002401655539870262,
        -0.033016856759786606,
        0.026267755776643753,
        0.0125406039878726,
        -0.08626154810190201,
        0.015475725755095482,
        -0.13295358419418335,
        -0.1147308275103569,
        -0.04558125510811806,
        0.05118894577026367,
        -0.03904265910387039,
        0.035483527928590775,
        0.017232751473784447,
        0.05003519728779793,
        0.10016535222530365,
        -0.024142883718013763,
        0.05501587316393852,
        -0.02051537297666073,
        -0.01604451984167099,
        0.12968701124191284,
        0.10315169394016266,
        -0.005921782460063696,
        -0.055731114000082016,
        0.02310085855424404
    ]
}