{
    "id": "CYM1L4FMORA",
    "title": "Buying EVERYTHING Amazon's AI Recommends",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2024-09-08T15:01:48Z",
    "video_url": "https://www.youtube.com/watch?v=CYM1L4FMORA",
    "category": "Science & Technology",
    "tags": [
        "Amazon Rufus",
        "AI shopping assistant",
        "tech gadgets",
        "product review",
        "unboxing",
        "digital microscope",
        "Razor Crazy Cart",
        "gaming peripherals",
        "stylophone",
        "hand warmers",
        "ice mag",
        "Pokemon cards",
        "go-kart for adults",
        "tech toys",
        "Amazon shopping",
        "AI recommendations",
        "tech review",
        "Austin Evans",
        "Rufus",
        "Austin",
        "Evans",
        "Amazon",
        "Redragon",
        "Sharge",
        "Shargeek",
        "ICEMAG"
    ],
    "views": 301090,
    "likes": 10603,
    "comments_count": 419,
    "description": "Check out Ridge!   Razor Crazy Cart on Amazon:  YouTuber Duck Suit on Amazon:  Stylophone on Amazon:  AI Hand Warmer on Amazon:  Shage Icemag Wireless Battery Bank on Amazon:  Redragon K552 Mechanical Gaming Keyboard on Amazon:  Redragon M602 Gaming Mouse on Amazon:  Andonstar HDMI Digital Microscope on Amazon:   I decided to put Amazon's new AI assistant Rufus to the test by having it pick out some cool tech gadgets for me. What started as a skeptical experiment quickly turned into a surprisingly fun unboxing adventure, with everything from a miniature go-kart to a powerful digital microscope. While not every item was a winner, Rufus managed to find some genuinely impressive and entertaining tech that I probably wouldn't have discovered on my own.  By using our Amazon affiliate links we may receive compensation for purchases through those links.  Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   Chapter Titles: 0:00 What is Amazon Rufus? 3:07 Ridge 4:34 Razor Crazy Cart 5:37 YouTuber Outfit 6:36 Stylophone 8:46 AI Hand Warmer 10:51 Icemag Battery 12:04 Gaming Keyboard and Mouse 14:54 Digital Microscope 18:03 Razor Cart Part 2",
    "description_links": [
        "https://ridge.com/AUSTINEVANS",
        "https://austin.tech/razorcart",
        "https://austin.tech/youtubeoutfit",
        "https://austin.tech/stylophone",
        "https://austin.tech/handwarmer",
        "https://austin.tech/icemag",
        "https://austin.tech/redragonk552",
        "https://austin.tech/m602",
        "https://austin.tech/microscope",
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- There's a new sheriff in town, and his name is Rufus. Yes, my friends. Amazon and their infinite dog wisdom have decided to name their brand-new AI assistant to help you make purchase decisions after a Dog of Wisdom. (Austin imitates Dog of Wisdom chattering) Buy Amazon products, brah. - [Alex] Is that what you think a dog sounds like? - No! The Dog of Wisdom. Joanna, tell him about the Dog of Wisdom. (Dog of Wisdom chattering) - (laughs) What is this? - The main thing I wanna do, so it's now in the actual Amazon apps. If you just tap a little button on the bottom right, it just says Rufus beta. What if I need to ask a question like, \"How do I build a gaming PC?\" Oh, this actually gave me text step-by-step instructions on how to build a gaming PC. Hmm, let me ask a more like specific question. What kind of camera does Marques Brownlee use? Dude, it is very confidently telling me the exact gear that Marques uses. I don't know that I believe this. All right, now that we've established the shaky underpinnings of our friend Rufus, let's actually find some tech. What's a good cheap gaming mouse and keyboard? Good, importantly good. Now this is exactly what Amazon should be good at. They have tons of data on what people love when it comes to mice and keyboards, and they're gonna gimme a Logitech G203 mouse and keyboard. Okay, tell me more. No results. (forehead slaps) How is it that when I'm searching for an item that is telling me like I just, \"Give me a good mouse keyboard,\" none of these are here? And that's it, that's the end of the search. Recommend me a good mechanical gaming keyboard under $60. The Reddragon K552, which does show up when I open it. It is significantly less, it's only $37. Is this keyboard suitable for gaming? Yes, please tell me. Is it suitable for gaming? \"It is designed for gaming!\" Our lucky day. So we're getting ourselves a little set up here. So we're gonna try the mouse and keyboard together. What's the next thing we need from Rufus? Give me the best deal on a gaming laptop. Ah, HP Stream! Ah, no! No, and a MacBook! No! If you have an AI assistant that recommends me an HP Stream, you've already failed, especially if I'm asking for a gaming laptop. Give me suggestions for more unusual, but helpful tech gadgets. \"Unusual but helpful gadgets.\" Rechargeable hand warmers, phone sanitizers, smart plugs, digital food scales, (chuckles) and key finders. You know, these are a little unusual. Wait a minute, wait a minute. I need a rechargeable hand warmer, I think. So, let me get a little bit more acquainted with our canine buddy Rufus to see if we can really find great deals on Amazon, or whether it is gonna be another AI-filled pile of dog doodoo. Why, hello there. This video is sponsored by Ridge. Do you wanna win this obnoxiously gold real Cybertruck? Well, have I got the news for you. If you win the contest, you actually get three choices. Not only can you choose to win this exact Tesla Cybertruck wrapped in real gold, but you could also opt for a Hennessey Velociraptor, or $100,000 in cash. That's a lot of money, enough to buy a lot of Ridge products. Probably all of them, I would expect. I've actually been using a Ridge wallet for several years, way before they ever sponsored the channel. I love it because it's an easy way to keep all your cards together, you've got a cash strap, but this kind of takes it to the next level. Do I look cooler with $100,000 in my hand, instead of a gold-plated Cybertruck? Probably, but the choice is yours, my friend. Now let's do some hardcore off-roading. Hell yeah, brother! (eagle screeches) All you gotta do is check out the link in the description. Not only are there free ways to enter, every dollar you spend on ridge.com between now and September 13th is one entry. But for every purchase of a Hennessey or Cyber-themed product from the Ridge store, you will get yourself an additional four entries per dollar. But don't wait, this giveaway ends on September 13th. And trust me, you don't wanna be stuck driving this thing around. Drive that one instead. Look at the size of that. The only thing better engineered than this is a Ridge wallet. And so I think we have a few items that are ready to go from Amazon. I think I know what's in the big box. (laughs) Should I just get that one out? I feel like what's in the big box is gonna need to be charged for a little bit. What did I ask Rufus? I said I wanted a fun toy, right? - [Alex] Yeah, it's like a crazy, interesting, fun toy for kids, basically. - Behold, my friends, Amazon's definition of fun. A little Razor go-kart. Wait. Alex, what's the weight limit on this particular go-kart? I- - 120 pounds. - 120? - Yes. - I could lay off the cheeseburgers and fit on that. It'd be okay. - Yeah. - It's a little smaller than I had initially thought. - [Alex] I mean, you specified for kids, so... - Did I say kids? No, think I said young adult. No, I think kids, you're right. Ah. \"For maximum battery life, charge the battery at least 12 hours after each use.\" 12 hours?! Bro, what the... (sighs) So while my crazy cart charges in the next 9 to 12 business days, let's see what else Rufus was able to provide. (Austin laughs) Well, as we all know, I am known as an icon of style, the pinnacle of fashion. (production beeping) (door latch clicks) Behold, my friends. - [Alex] Oh, my God. (laughs) - So you know what? I'm 100% about this. Not only do I have my very stylish hat, but I feel like I'm ready to go for a swim, go hop in the pool, get a little sunburnt perhaps. - [Alex] He definitely looks like a dad that's like purposely trying to embarrass his kids. - (laughs) Except it's just me all the time. Anyway, now that I've been properly attire, attirized? (crickets chirping) (dog barking) (alarm blares) Let's take a look at what else we've got. The stylophone. Okay, now what exactly did I get the stylophone? Like what did I ask Rufus? I forget what this one is. This was also I think a toy, right? - [Alex] Yes, this was surprising. So when I tried to move up in the age range, it's like, \"Oh, what would like a teenager,\" or something like that. - Yeah. So let's just see what my stylophone sounds like. While I unbox this, could you just refresh me? How much did I pay for this attire, and how much was the stylophone? - [Alex] The great fit that you have on was $43. - Boy, that's $43 worth of style right there. How about my stylophone? - [Alex] That would be $34. - Okay. You know, usually it's on \"Mystery Tech\" that I get to try these kind of goofy little like musicy boxes, but like they're actually usually a lot of fun. All right, let me see how to do this thing. So I'm gonna turn it on, and then do I just, no? Okay. - You use the pen. - I do need to use the pen. (stylophone buzzes) Oh, okay. We're in business. (stylophone buzzing) - [Alex] (laughs) Oh, my God. That really works with your outfit. - That 2012 club hit. (upbeat music) So okay, let me look right here. So you've got an audio out on one side, so you could plug it in and actually like record with it. Then you've got a, what is this now? Is this volume? Wait. (stylophone buzzing) So this is volume, but what's this bottom part? (stylophone buzzing) Oh, you can tune it on the bottom. Yo, this thing's sick. - Hey. - This thing is actually really, really cool. I mean limited, of course, but I mean it's an old-school thing that's been around for what, they said 50 years. I mean, I gotta say, I think maybe, just maybe I have slightly harshly judged my good little buddy Rufus. He's provided me with an incredible fit for a YouTuber, delightful toy, (stylophone buzzing) and importantly, future go-kart fun. We've got ourselves the AI hand warmer. (laughs) You know, I was just the middle of trying to say some very nice things about Amazon Rufus, and then AI recommended more AI. But weren't these weirdly popular? Like I feel like when I was looking for these, these had like a million reviews. Like way more than you would think for some AI hand warmers. - [Alex] Yes. It has a 4.8 star rating. Amazon's Choice with over 1,100 reviews over. - I just, okay, so we've got USB-C, which is nice, I will say that. Apparently, they're 3000mAh batteries each, and we do have ourselves a USB-A to dual USB-C cable. Okay, so is there, what did I do to search for these things? Or how did I get to this? - [Alex] We asked it for useful tech gadgets. - Hmm, well, I mean you could say that keeping your hands warm is useful. I don't think there's a lot to this. I think I just turn them on. So let me just turn them on. Okay. Oh, oh, it's immediately warm. Wow. Okay, I will say that is very, very quick. So I think if I tap the button, does it change? Yeah, so I can change the heat. So I'm gonna do a full blast on the heat. Wow, that's really hot. Okay. Wait, do you think I can guess the temperature by touch? - [Alex] Sure? I didn't realize that that's a skill you wanted. - [Austin] I'm gonna say that's 60, 67 degrees Celsius. - [Alex] No, wrong. - What is it? - [Alex] 50 degrees. - 50? (hands thud) Ow! Really? - Yes. - That's hot as hell, man. Your Amazon AI-powered hand warmers. I hate that I thought I was gonna just be able to make fun of everything in this video, but it's all actually been pretty good so far. - [Joanna] He didn't even say anything positive about it. He just complained about it was too hot. - But it's, okay, yes, I complained about it, but like it is a hand warmer. I think the AI part's dumb, but like these are good hand warmers. My hands are borderline burnt. Didn't say how warm they would be. This is the ICEMAG, which is a magnetic battery bank that has turbo cooling. How did I find this? What was my search term? - [Alex] I think we searched for like the coolest new tech. - I will say I've never seen this before. Okay, so the ICEMAG. \"Stay cool on the move.\" It is heavy, like that weighs about as much as the normal phone would, I think. So if you're unfamiliar, Sharge is a company who tend to do batteries in a more interesting way. I actually use one of their Sharge power banks on a regular basis, it lives in my bag all the time. Oh, here it's cranking though. You see the little fan? It actually vibrates when it's actually charging. So I'm gonna go ahead and slap it on the back of an iPhone. Oh my God, it doesn't even fit. What? It doesn't even fit. First of all, to attach it, it's literally over the bottom of my camera module. Like it's barely touching. It's locked in, but it's too big. What the? We paid 50 bucks for this? - On sale. - On sale? I don't know about this one. This seemed lot cooler when I thought it was an actual like battery bank that was wireless and a cooler for your phone, but it's not gonna keep your phone cool. It's only gonna try to keep itself cool, and it only works with giant phones. Next up, we've got a twofer because we've got ourselves our gaming peripherals, courtesy of Rufus. So for the keyboard, it picked one of the most popular mechanical keyboards on Amazon, which is the Redragon. This is specifically the Kumara. I'll say that a lot of the Redragon keyboards are kind of similar, but they do revise them quite often. All right. (keyboard clacking) I mean certainly a little hollow, but considering that we paid less than $40, honestly not bad. So for a mouse, we've got ourselves the Redragon Griffin. So I don't know a lot of these names because I feel like over the last year or so, Redragon have renamed. A lot of the products used to be just like K552 or whatever, but they've tried to rename them to, I don't know, more memorable names like this. So we've got ourselves actually... Does that seem like a really big mouse to you, or my hand's just shrinking? That seems large. I mean average size at best. (throat clears) Now this was actually a legitimately good deal, right? Wasn't this like 20-something dollars? - [Alex] It was $22, and if you buy it right now, there's a sale going on, so it's even cheaper than that. - Nice. So let me hop into a quick game of Zero Build \"Fortnite\", my favorite game. I play it all the time. So why is Wolverine a banana? - [Alex] That's Peelverine, I believe. - Oh, oh, oh, oh wow. Okay, we're just in it. - [Joanna] That frame rate is so good. - Yeah, something tells me that maybe this is not a great experience. \"Unreal Engine has failed. 'Fortnite' has crashed.\" Cool. Yeah, I feel pretty good about this keyboard. It's a little bit on the loud side, I will definitely say. If you want a keyboard that's gonna be a little bit under the radar and not wake up your next-door neighbor, maybe not the best move. I'll say I am not sure about this mouse. It feels nice. I don't like the gloss. I don't think gloss is the move. Like it looks cool, right? But it doesn't feel nice. Now they've got a little bit of like grippy sort of surfaces on the inside as well as on the outside where your sort of thumb and finger go, but I don't love it if I'm being honest with you, as far as like it feels too, like it's gonna get gross really quick. That being said though, the tracking feels fine. The RGB is very strong. You've got RGB stripes here, the logo, the wheel. I mean, I would almost argue that that's gonna be too bright. Like it's very, very in your face. But when you consider we're paying what, like 22 bucks or something for it, I don't think Amazon Rufus sort of sent us astray at all with this. Oh, watch me get, ah. (mouse clicking) Okay, I almost, you know what? Coming 96th in a match of \"Fortnite\" is about where I belong. So this is an item that I'm legitimately excited for. Can you refresh me? What exactly did we search for or ask Rufus for to get our digital microscope? - [Alex] We did actually end up searching for toys for adults, and that's what this is. - Now this was a little bit more on the pricey side, right? - [Alex] Yes, it was $140. - Not cheap, but it looks like it comes with not only the display, but it said somewhere that it can actually be connected to Windows. So I think it might show up as a webcam. It will apparently do 4K at 24 FPS, or 120 frames per second, wow. There's a lot of things to this. Oh no, oh no. I'll be right back after I figure out how to build this, or I give up and ask Alex to help me off camera. (box thuds) Alex, can you help me build this? Behold, my friends, we have ourselves a fully operational microscope. I gotta say actually, the setup process is really pretty easy. So the way this works is you've got two little lights on articulating arms so you can adjust it, then the display and microscope is all one unit. So you can actually just adjust the whole thing up and down if you want. So you can raise it, I can lower all the way down, and then you can adjust it here. So first thing I'm gonna do is I'm gonna take the motherboard for a PS3 Super Slim and put it under the microscope. That is really sharp, and actually if I want, I can lower the whole thing a little bit if I wanna get a little closer to it. Wow, that's a lot of detail, man. So for context, this is the size of my finger and that's the size of what we're looking at there. I mean that is incredibly, incredibly close. Now let's look at some Pokemon cards. Let's see here. So this is just a regular card. Oh dude, that looks so sick. You can see the individual like printing pattern of the Glaceon's face. Or maybe we actually put like a holo on here and see. Oh dude, that looks so cool, especially with the light. All right, so I'm gonna put on another lens. I don't actually know how this one's gonna be different, but let's find out, so... - [Alex] So D is 1800 to 2040 times zoom. - Oh, so this is basically like a ultra magnify. So if I wanna look at like the individual pixels or something like that. Dude, when you look that close, you can see that the individual tiny like microspecks of ink. That is insane. Wow, do you see how close I have to be to get that that sharp? That's wild. The fact that this thing was relatively affordable on Amazon, incredibly fun to play with, also legitimately useful. If I was actually doing something like soldering, which I don't have the hand-eye coordination to solder stuff that's that small. But being able to see that and importantly be able to get it on a nice display and to record it via the MicroSD card, like even just for content, like I feel like we can actually use this next time when we're like working on like, I don't know, a PS5 project or something where we really want to get not only a good look at something small, but importantly recording it. This is the biggest of thumbs, Amazon. Jeff, go buy yourself a new yacht. This one's great. All right, my friends. The time is here. (helmet visor taps) Let's go crazy kartin'. Wow, this is really small. You know, I did think this would be a little bit bigger, but let's see what we got, shall we? So I'm going to turn it on, and wish me luck. Oh. (go-kart motor whirring) Wow! Wait, this is awesome! This is awesome! You can teach the kids how to drift when they're young! (go-kart motor whirring) Wow, wow! Okay, I've got a little bit of a too high of a center of gravity here. When I really start to spin it, I'm really tempted to fall off. I will say that this is way more fun than I thought it was going to be. The thing is I clearly am way too big for this thing, but if you wanna have a great time and you want to teach little- (helmet visor taps) Ah, if you wanna teach little Timmy how to drift, this thing is fricking sweet. How much do we pay for this? - [Alex] $290. - [Austin] This is $290 well spent. Thanks, Rufus. If you enjoy this video, make sure to subscribe to the channel. Like, follow, subscribe, and let your buddy Jeff Bezos know that his billions of dollars are being well spent, helping grown men buy toys on amazon.com with your cool AI bot. (go-kart wheels screech) That could have been bad. Donut, donut, donut, donut!",
    "transcript_keywords": [
        "Rufus",
        "Amazon",
        "thing",
        "Amazon Rufus",
        "good",
        "gaming",
        "keyboard",
        "dog",
        "lot",
        "Wow",
        "Amazon Rufus sort",
        "hand",
        "bit",
        "Dog of Wisdom",
        "fun",
        "hand warmers",
        "infinite dog wisdom",
        "cool",
        "feel",
        "mouse"
    ],
    "transcript_entity_values": [
        "Jeff Bezos",
        "ICEMAG",
        "290",
        "September 13th",
        "120 pounds",
        "iPhone",
        "MacBook",
        "2040",
        "12 hours",
        "Redragon",
        "20-something dollars",
        "Sharge",
        "first",
        "the last year or so",
        "Redragon",
        "two",
        "a Dog of Wisdom",
        "120",
        "60",
        "one",
        "60",
        "Razor",
        "1,100",
        "43",
        "96th",
        "Amazon AI",
        "Amazon Rufus",
        "a minute",
        "MicroSD",
        "Timmy",
        "Jeff",
        "Mystery Tech",
        "less than $40",
        "Marques Brownlee",
        "the Dog of Wisdom",
        "Wolverine",
        "at least 12 hours",
        "22",
        "Austin",
        "Kumara",
        "Ridge",
        "Cyber",
        "Hennessey",
        "Tesla Cybertruck",
        "Joanna",
        "Logitech",
        "the next 9 to 12 business days",
        "67 degrees Celsius",
        "Fortnite",
        "Yo",
        "50 degrees",
        "PS5",
        "1800",
        "Marques",
        "million",
        "Amazon",
        "only $37",
        "140",
        "RGB",
        "Cybertruck",
        "billions of dollars",
        "100%",
        "a Hennessey Velociraptor",
        "AI",
        "Glaceon",
        "between now and September 13th",
        "The Dog of Wisdom",
        "G203",
        "HP Stream!",
        "First",
        "100,000",
        "Alex",
        "Rufus",
        "three",
        "Sharge",
        "50 bucks",
        "amazon.com",
        "the Redragon Griffin",
        "USB-C",
        "Rufus",
        "HP Stream",
        "Ridge",
        "4.8",
        "24 FPS",
        "Windows",
        "3000mAh",
        "4",
        "Pokemon",
        "second",
        "2012",
        "Fortnite'",
        "50 years",
        "YouTuber",
        "Zero Build",
        "Unreal Engine",
        "several years",
        "34",
        "22 bucks"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "MONEY",
        "DATE",
        "QUANTITY",
        "ORG",
        "FAC",
        "CARDINAL",
        "TIME",
        "PERSON",
        "MONEY",
        "LOC",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "MONEY",
        "PERSON",
        "ORG",
        "PERSON",
        "TIME",
        "MONEY",
        "PERSON",
        "PERSON",
        "GPE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "WORK_OF_ART",
        "PERSON",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "PERCENT",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "MONEY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "NORP",
        "PERSON",
        "ORG",
        "DATE",
        "MONEY",
        "MONEY"
    ],
    "vector": [
        -0.08394379913806915,
        -0.021278617903590202,
        -0.006482699885964394,
        -0.05961814895272255,
        -0.004311545751988888,
        -0.001245967228896916,
        0.02217230014503002,
        0.0006484563346020877,
        -0.04996609315276146,
        0.05557449907064438,
        0.06138698384165764,
        0.0017537212697789073,
        0.00023999916447792202,
        0.013637316413223743,
        -0.029810378327965736,
        -0.034727077931165695,
        0.05260932072997093,
        -0.038931380957365036,
        -0.05985960736870766,
        -0.052051886916160583,
        -0.020674534142017365,
        0.023944968357682228,
        0.059950802475214005,
        -0.03146345913410187,
        -0.06839413195848465,
        0.05742122232913971,
        -0.04645857214927673,
        -0.047013912349939346,
        0.006060912739485502,
        -0.10790948569774628,
        0.014447645284235477,
        0.02495064213871956,
        0.0064032794907689095,
        -0.04174411669373512,
        0.026366235688328743,
        -0.036919064819812775,
        0.018012627959251404,
        -0.03636856749653816,
        -0.048633527010679245,
        -0.08747560530900955,
        -0.051096443086862564,
        -0.024371562525629997,
        -0.010194347240030766,
        0.045040227472782135,
        -0.0034429689403623343,
        -4.021238783025183e-05,
        0.006451474502682686,
        -0.11591750383377075,
        0.022805145010352135,
        0.025668757036328316,
        -0.07586660236120224,
        -0.06401069462299347,
        0.07725684344768524,
        -0.06893113255500793,
        -0.026654640212655067,
        0.034096360206604004,
        0.05026824772357941,
        0.019655130803585052,
        0.07270922511816025,
        -0.042651109397411346,
        0.0613599456846714,
        -0.11696096509695053,
        0.004476584028452635,
        0.052180103957653046,
        -0.006231203675270081,
        -0.0384351871907711,
        -0.04802197217941284,
        -0.039478883147239685,
        0.012850267812609673,
        -0.08334130793809891,
        0.03363846242427826,
        -0.010639386251568794,
        0.03785305470228195,
        0.03702990338206291,
        0.06971761584281921,
        0.00510523421689868,
        0.041895538568496704,
        -0.017607692629098892,
        0.04921365901827812,
        0.05618589371442795,
        -0.015888342633843422,
        -0.05571405589580536,
        -0.017332710325717926,
        -0.003925961907953024,
        0.011132202111184597,
        0.024878714233636856,
        0.0038268323987722397,
        0.0038978252559900284,
        -0.03405210003256798,
        -0.0253398846834898,
        0.019548436626791954,
        0.003552085720002651,
        0.0191973764449358,
        -0.040878456085920334,
        -0.012777304276823997,
        -0.017979471012949944,
        -0.016279179602861404,
        -0.013674034737050533,
        -0.09884253144264221,
        0.03700866177678108,
        0.0343954935669899,
        -0.013872118666768074,
        0.032036468386650085,
        -0.014905886724591255,
        0.004695501644164324,
        -0.10129350423812866,
        -0.006930069997906685,
        -0.024654963985085487,
        0.10740832984447479,
        0.0011035135248675942,
        -0.023064322769641876,
        -0.00015840416017454118,
        -0.03324124589562416,
        0.05420207232236862,
        0.028023596853017807,
        -0.03966817259788513,
        -0.06422146409749985,
        0.04454949125647545,
        0.1000412181019783,
        -0.003422422567382455,
        0.08524921536445618,
        0.0006509494851343334,
        -0.010790973901748657,
        0.002648614114150405,
        0.009466099552810192,
        0.008791361935436726,
        -0.04699078947305679,
        9.762596663646241e-33,
        0.004974388051778078,
        0.08473026752471924,
        -0.0405321829020977,
        -0.04069789871573448,
        0.06283047795295715,
        -0.0040063862688839436,
        0.001064769458025694,
        0.038621824234724045,
        -0.020813843235373497,
        0.01475926861166954,
        -0.06886138021945953,
        0.11948225647211075,
        -0.10678623616695404,
        0.07986157387495041,
        -0.028566332533955574,
        -0.012620856985449791,
        -0.07161182165145874,
        0.05184322968125343,
        -0.020801648497581482,
        -0.06687451899051666,
        0.05209996551275253,
        0.037206411361694336,
        0.028901079669594765,
        0.006828952115029097,
        0.0724068433046341,
        0.013515421189367771,
        -0.014546740800142288,
        -0.07420367747545242,
        0.08845356851816177,
        0.06205223873257637,
        -0.11960210651159286,
        -0.013212651945650578,
        -0.060641296207904816,
        -0.010877905413508415,
        -0.039481937885284424,
        -0.030578233301639557,
        -0.10746781527996063,
        -0.12772934138774872,
        -0.030061224475502968,
        0.037762876600027084,
        0.02225126139819622,
        0.03916940093040466,
        -0.027896881103515625,
        0.027860598638653755,
        -0.07630126178264618,
        0.008716761134564877,
        0.05487917363643646,
        0.004514598753303289,
        0.06587810814380646,
        0.006019522901624441,
        -0.10643495619297028,
        -0.0012640452478080988,
        0.06787413358688354,
        -0.07271203398704529,
        -0.0002625171036925167,
        -0.0607847236096859,
        0.022364050149917603,
        0.02356596663594246,
        0.04264794662594795,
        -0.0165148563683033,
        0.017028626054525375,
        0.05821911245584488,
        0.052955832332372665,
        0.060781531035900116,
        -0.0033358396030962467,
        -0.01167588122189045,
        -0.0015137108275666833,
        0.020634014159440994,
        -0.02111779898405075,
        0.022874578833580017,
        -0.05899985134601593,
        0.022232914343476295,
        0.019639231264591217,
        -0.15972068905830383,
        -0.0069885291159152985,
        -0.01143772155046463,
        -0.039617881178855896,
        -0.007646393030881882,
        -0.04775674268603325,
        -0.06320089846849442,
        -0.06036786362528801,
        0.06285609304904938,
        -0.020573073998093605,
        0.02118428610265255,
        -0.09186501055955887,
        -0.0874791294336319,
        0.011320682242512703,
        -0.012610766105353832,
        -0.0012612618738785386,
        0.0024811543989926577,
        0.008958754129707813,
        -0.08040626347064972,
        -0.07528962939977646,
        0.02585671842098236,
        -0.025936240330338478,
        -1.1465257619142108e-32,
        -0.03355810418725014,
        -0.09331370890140533,
        0.03962775692343712,
        0.04773714765906334,
        0.06198986992239952,
        -0.004532416816800833,
        0.032288260757923126,
        0.014273393899202347,
        0.013411222957074642,
        -0.09089229255914688,
        0.009830883704125881,
        0.034919507801532745,
        -0.014608119614422321,
        -0.0012891783844679594,
        0.0062288036569952965,
        0.05790131539106369,
        -0.034465692937374115,
        -0.07080849260091782,
        0.09510713070631027,
        -0.010380297899246216,
        0.04951205849647522,
        0.06051855534315109,
        -0.06954530626535416,
        -0.0033172161784023046,
        -0.013479385524988174,
        0.03889567404985428,
        0.041023869067430496,
        -0.04183590039610863,
        0.013141687028110027,
        0.00882901344448328,
        -0.0019047748064622283,
        -0.009228580631315708,
        -0.006640766281634569,
        0.10476846247911453,
        -0.023931238800287247,
        0.03740061819553375,
        0.07449621707201004,
        -0.013758871704339981,
        -0.02763865888118744,
        -0.05697436258196831,
        0.10463342070579529,
        0.03579127788543701,
        -0.024445433169603348,
        0.029346590861678123,
        0.02241620421409607,
        -0.03316068276762962,
        -0.03834100440144539,
        0.010276345536112785,
        -0.049794696271419525,
        0.05037930980324745,
        -0.005702799651771784,
        0.033723559230566025,
        -0.06189464032649994,
        -0.05411611124873161,
        -0.08279677480459213,
        -0.035223621875047684,
        -0.046044304966926575,
        0.0397113598883152,
        -0.026753472164273262,
        0.04813767224550247,
        -0.048759493976831436,
        -0.02942662127315998,
        -0.0203176848590374,
        -0.010376781225204468,
        -0.09611062705516815,
        0.021198494359850883,
        0.08871735632419586,
        0.07386840879917145,
        -0.06779222190380096,
        -0.045954328030347824,
        -0.0003743365523405373,
        -0.004286060109734535,
        0.06831268221139908,
        -0.07608410716056824,
        0.025265764445066452,
        0.08016979694366455,
        0.042279042303562164,
        -0.06984145939350128,
        0.018761394545435905,
        -0.0762920007109642,
        -0.027133796364068985,
        -0.027320489287376404,
        0.05965982750058174,
        0.0928042083978653,
        0.08601127564907074,
        0.056221943348646164,
        -0.050120461732149124,
        0.017558708786964417,
        -0.048521336168050766,
        0.030271396040916443,
        0.01520624477416277,
        0.02109757624566555,
        -0.034421324729919434,
        0.12142344564199448,
        0.035955678671598434,
        -6.840812005748376e-08,
        0.036757711321115494,
        0.05313494801521301,
        0.06594577431678772,
        -0.011092799715697765,
        0.09025123715400696,
        -0.03912172093987465,
        -0.013821827247738838,
        0.07738801836967468,
        -0.06915193051099777,
        0.018670719116926193,
        0.01536580827087164,
        -0.08883429318666458,
        -0.022906223312020302,
        0.03389393165707588,
        0.0896441712975502,
        0.06556231528520584,
        -0.05816339701414108,
        0.06182685121893883,
        -0.010676734149456024,
        -0.03763826936483383,
        -0.035175733268260956,
        0.007023601792752743,
        0.13820871710777283,
        -0.09800568968057632,
        -0.06929594278335571,
        0.06649401038885117,
        -0.07844935357570648,
        -0.04579736664891243,
        0.08303624391555786,
        -0.008644369430840015,
        -0.01816840097308159,
        0.020518189296126366,
        -0.012138841673731804,
        -0.010197855532169342,
        0.04509684443473816,
        -0.1058749258518219,
        -0.08000960946083069,
        -0.0008614672115072608,
        0.03058556653559208,
        0.012129610404372215,
        -0.0007817687001079321,
        -0.029424123466014862,
        -0.09076756983995438,
        0.018991557881236076,
        -0.020745761692523956,
        -0.005769721698015928,
        -0.03563377633690834,
        -0.11018433421850204,
        0.0009800090920180082,
        0.1071854829788208,
        -0.03825119510293007,
        -0.05178644135594368,
        -0.003728636307641864,
        0.054136697202920914,
        0.09024528414011002,
        0.027168909087777138,
        0.01493566669523716,
        -0.04577413573861122,
        -0.00749191315844655,
        0.09728056192398071,
        0.0906645655632019,
        -0.09454792737960815,
        -0.017470983788371086,
        0.027241447940468788
    ]
}