{
    "id": "d-4JJbk3ZS0",
    "title": "I leveled up my house water cooling! - Whole Server Room Pool Watercooling Part 5",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-10-29T17:16:21Z",
    "video_url": "https://www.youtube.com/watch?v=d-4JJbk3ZS0",
    "category": "Science & Technology",
    "tags": [
        "Linus house",
        "Pool cooling",
        "PT Cruiser radiator"
    ],
    "views": 1895852,
    "likes": 62572,
    "comments_count": 3189,
    "description": "Your business deserves a website! Create one for free at   Using the pool to cool Linus' computers is working great... for the computers. For the humans though it is too dang hot.  Discuss on the forum:    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 - Intro 1:16 - Odoo! 1:27 - Thermal Camera Investigation 3:26 - The Plan 6:05 - Is it heating the pool? 6:54 - PT Cruiser rad mounting 11:49 - The RGB is glorious, final plumbing 14:01 - Turning it on 15:55 - Power adapter cooling 17:18 - Did it work? 19:29 - Odoo! 20:19 - Outro",
    "description_links": [
        "https://odoo.com/LTT",
        "https://linustechtips.com/topic/1538259-i-leveled-up-my-house-water-cooling/",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "The all-systems Fur Mark stress test passed. The water did heat up a little, but after 10 hours of dumping over 2000 watts of heat into the loop, we are running at a cool 50 degrees Celsius on the hottest GPU. Success! Or at least partial success. You see, cooling the computers was just one of the multiple goals we had for this project. And the other results are currently unknown and colossal failure. This room, where I do all my tinkering and computer maintenance is uninhabitable because you see, while the new setup does a great job pumping the heat from these gaming machines out of here, the old janky system with the car radiators from before did a way better job of cooling the room itself. So we asked ourselves, why not both? This time we're gonna be rolling not one, but two PT Cruiser radiators that we're gonna be cooling with pool water to hopefully chill this room back to a habitable temperature. Like this chill segue to our sponsor. Odoo, building a website for your business from scratch can be daunting, but Odoo makes it simple with their free, easy to use platform. Click the link down below or watch till the end of this video to learn more. First, a recap of how the system works now using the thermal camera to show you guys what's working well and what's working not as well. The pool loop is great. Those tubes that are embedded in the walls of the pool are cooling down the water here to about 30 degrees Celsius. We are then using that cool water, pumping it through this titanium heat exchanger to cool down over here the warm water that is coming out of the server rack. And you can actually see the temperature deltas in those lines. As expected, the water coming from the pool is exactly 30 degrees and the water coming out of the heat exchanger is wow, almost 34, that's working really well considering the delta between these loops is only about eight degrees. Then on the hot side, we're sending out 38 degree water and getting back 40 degree water, meaning we've still got plenty of cooling capacity in here. The problem is we can't use any of it to cool the room itself because 38 degrees is still pretty unpleasant for humans and for some of the air cooled equipment that is still in here. At the back of my networking gear, for example, I'm able to measure temperatures as high as 60 degrees and the exhaust coming out of the servers is as high as, ooh, 60 degrees as well. We got to deal with this. Where we do have some water that could cool our 37 degree room, however, is in our pool reservoir. Ah, I think you see where we're going with this. Now I know what you're thinking. Linus, if you want to cool this room, why do you have it insulated? Why do you have the door closed? And the answer is noise. You hear that on the mic? Yeah. Yeah, me too. The whole point of having the systems in another room is you don't have to feel the heat or hear the noise. So if I can't close the door, why did I even do any of this? In a typical water cooled PC, the order of the components in the loop doesn't really matter because the difference in temperature from the hottest point to the coldest point is a fraction of a degree. That's not the case here. We're looking at deltas of two or even four degrees between hot and cold sides. So the loop order suddenly matters a lot. I'm kind of thinking, well, the systems that are on the water cooling are running so cool that they could afford to be on the hotter side of things. So we take the cold pool water that comes in, we go straight to the car radiators and we actually dump that to the systems afterward. Okay, yeah. Yeah, they can tolerate two degrees. That's important because the bigger the temperature difference between the water in these radiators and the air in the room, the more effective these radiators are going to be. Which raises kind of an uncomfortable point. The best place for these would be in the 40, 41 degree air right at the back of the rack. We can do that. Oh, I know. But then we have four additional lines running over here and we got to deal with like some kind of hinge system or something, I don't know, man. Since we're in here reek-a-jiggering tubing today, there's a couple of other things I wanted to investigate and maybe change. First up, I just want to say these manifolds worked great. The cold water comes into this one, top and bottom, heats up in the system, and then the warm water comes out the top and the bottom of this one. But we noticed something when we were Fur Marking the systems. System number one up here runs significantly hotter, about five degrees than system number five. And this actually makes sense. Even though we have water coming in the top and the bottom, just because of gravity, you're going to have more pressure towards the bottom of the manifold so you get more flow. That top system, it's got the same temperature water. It's just not running as fast, which I don't consider to be a problem. 50 degree GPU, even if it was a little hotter, I wouldn't mind that if it meant that I could get rid of these tubes and have neater management. So I want to see just how much hotter that system gets if I block these completely restricting flow through the bottom of the manifolds. We should be able to check this right away. Nada. Yeah. That is not what I expected. I kind of figured that's about what would happen. Well, why did you tell me I had to have the dual inlets then? Well, because that should have worked, but it was already clear that it didn't. That is awesome news. But before we turn off our stress tests and drain the system, there's one more thing that I really, really need to know. Is it actually putting heat into the pool or is it just losing it all in the ground on the way out there? What's that for? Inside this access panel are the lines that are snaked through the concrete and the floor of the pool acting as a heat exchanger. If there is a delta between the in and the out, that means we won the game. It's about actually a little over half a degree, almost a full degree, which means a couple of things. One, we are actually dumping heat into the pool. And two, we have a lot more cooling capacity here. Well, yeah We did the math. While Dan gets the plumbing started, Alex and I are going to prep the radiators, which even with movie magic, ha ha, is going to be a ton of work. Alex, why RGB? What do you mean? Do you want this to not be RGB? Kind of, yeah. No, I forbid it. The other big do as we say, not as we do element here, is that the correct radiator to use for this project is a big one that takes the place of the door of the entire server rack. The issue is that the suppliers for those are not really that interested in selling one rad to one guy. They sell hundreds or thousands at a time to enterprises or educational institutions. The good news is that our system does work. It's tried and true. This one actually sat outside collecting outdoor shmoo and working very effectively for about, that was over six months, wasn't it? Yeah. Yeah. All we've got to do is get it prepped with the new fans. Alex, why didn't we just use the box fans again? RGB. The next thing we turn our attention to is how to attach the radiators to the piece of aluminum extrusion that is going to attach to the hinge that allows us to tuck them against the wall when I need to get back there. You 3D printed these. Yeah. Okay. Heck yeah. Come to think of it, why are we doing the RGB management now? We can do this on the wall and then we can just stick things to the wall. Oh, maybe. When were far later in the project and I can just convince him that we need to not bother hooking up the RGB to save time. What? That was incredibly unsubtle and we need the RGB. I'm just looking at these spacers wondering if I'm the only one who can't remember how we coped without 3D printing. Like this is awesome. Piece of wood. With one side of the liftoff hinges now installed. Oh, those are big, big old button head screws. It won't quite lay flush. You know what? That's fine. With what? With one half installed. It's time to take this into the server room. We were thinking of using right-handed hinges here but once we saw it in place, it didn't really work out. So we're just gonna use left-handed ones instead. So you got the ones we need and I got this so we can level up our installation. That was actually the whole reason I had you do this explanation so I could do this. I am so excited to be able to close the door to this room. I've been listening to these fans whine all out there for the last month. Yeah. I've been listening to him whine all the time and its just as bad. Go for it. Oh, wow. Anytime now. Okay. Not gonna lie. I'm feeling pretty good about this. Okay, so that's kind of my ideal spot for it right there. So it can just blow right over to my workbench. Yeah, this is gonna take a while and be really boring. So fast forward. This looks like absolute ass. I think mine's about to come together. Right now, over me. How was the whole thing powered? AC to Molex adapter. Are we worried at all about the power limits of this connector? A tiny bit, yes. We'll be doing two RGB controllers. Four hubs and. 24 fans. 24 fans. Yeah. Oh boy. These don't have power consumption on them, but in fans alone, that is 5.4 amps and the connector is rated for 4.5. Oh, it's fine. No two ways about it. Dang it. No two ways about it. Dan kicked our butts for productivity today. He's already got this plumbed up, including the new filter. If you guys recall from one of the previous videos, there's some gravel in these PVC lines out to the pool house. And I'd love for those to not end up in our radiators. So we have an inline filter now. This takes the cold water. It goes through there. It goes all the way up over here to where we now have. Da da da da da da. One set of inlet and outlet for our radiators and a separate set. Well, not set. It's just two now for the server rack itself. It all goes back over here. Back to the cold water reservoir where it goes into the heat exchanger. It's gonna cost us a couple of degrees, but that's a price I'm willing to pay. I'm not gonna pretend your side doesn't look a little bit better, but hey, mine has all reusable cable ties. So I can't do it, but yeah, that thing. Hey look, everything kind of, well, mine stayed in place. Hey, nice. That looks acceptable. Whoa, that's awesome. Still not worth it. Oh, a hundred percent worth it. I would spend three days on this. Oh, I think these are all RPM controlled. So we need to go into those and- Yeah, probably. These top ones are easy. They are just going to come out here now instead of where they were before. Couple little drips, not too bad. Now we just need to plug these. We had one plug and we made another one. Dan-genuity. Now it's time to ever so carefully thread this in. Yep, if you cross thread it, it's game over. Oh, so exciting. Final form, Alex. You know it's not. Final form for now, Alex. Oh, that's so clean now. Ah! So much room for activities. With the rack hooked up, we can actually fire this loop up, start Fur Marking the systems again, close the door, and then when we fire up the second cold water loop, we'll be able to see if it actually makes a difference. Are we ready to do it? Yeah. Okay, where are my shutoffs at? So this one is already, okay. So I can just fire up this pump then, right? And this is going to go here. Okay, let's go pump. Okay, what are the odds that it's just going to go? Oh yeah. Look at her go. Okay. Okay. So right there. Thank you kindly. We'll go this boy to this boy. These giant magnetic cable arches are so frigging strong. Ha ha. Okay, not the most elegant solution, but it's not going anywhere. Here we go. Boom. Okay, Glenn, go for it. Theoretically, the water will come rushing through these tubes. Hey, there it is, there it is. Nice. Oh, that's leaking a lot. It's leaking a lot. Okay, let's just try a slightly more different position for it. I'm so glad that I crossed that acrylic. Yeah, and- Sandblaster. Yeah, and we haven't even seen it in the dark yet. Oh, yeah. That's something. Let's have a look at the results. Whoo. She's chilly, Alex. Actually, that's cooler than I expected. Oh yeah, that is, that seems too cool. That doesn't make any sense. This is before the reservoir. This is pre-reservoir. Oh, the reservoir was being heated up by the room. So we are getting, oh, man. It's gonna be downright livable in here. Wow, we are really getting some effective heat transfer though. Oh yeah. We're going from 24 and a half on the supply side to 26 and a half on the return side. Then we take that 26 and a half degree water. Oh, that's my finger. There we go. 26 and a half degree water. Put it in the res and blast it through the heat exchanger. And then back to the pool where we will be dumping even more waste heat because the computer systems in here aren't the only things that dump waste heat into this room. Even though I've insulated all these lines, my in-floor heating contributes a significant amount of heat. We want this thing performing its best. So we got to hook those RGB controllers up to a system in order to, you know, get them running properly. For those wondering, the right way to do this is to just have an external USB to internal header adapter. My arm hurts so much right now. This is a really awkward angle. Any RGB that you want particularly? No. Nice. Hell yeah. Success. We got this. In all seriousness, we do need to do something about this power adapter. The surface temperature is over 60 degrees. Oh, that's a lot. We also have this. You know, some strategically positioned zip ties. Our new cable management stuff is so awesome. You basically just decide where you want it. These are not the real plates, by the way. They are less ugly than this. Then we've got this awesome one for hanging wall boards and power adapters and anything else like that. Then you just put the cable ties on, boop, and boom. Magnetic. But we're not quite done with this one yet. You know, in a way, this is really your fault. You're the ones who enable us. We went full shmoo town on this one. Now all we need is a mounting solution, and I think you guys knew where this was going. Now this will be a true test for our magnetic power adapter holder. Whoa, okay, yeah. Nope, she can't handle that much weight. There's also a plastic film here. If we can lose that, holy s***. Without the plastic film, she goes, Alex. Oh, it's RGB. Oh God, what are you doing? The more important thing, however, is that I think this might actually be working. Oh no, that's still pretty hot there. We're gonna need a better long-term solution. We're done. All that remains now is to see if it worked. Some stuff is pretty obvious. We've got that super chilly pool water heading out to the radiators and less chilly. About a degree and a half water coming back. That goes into the reservoir, into the heat exchanger, where it heats up and goes back out to the pool. So our total delta here, 28 degrees coming in, 33.3 going out. This is funny, you can see the temp spike when I turned off the pump to remount the power strip, but overall, we're sitting at 52 degrees, exactly within the range we'd expect, given that we're running the water through those radiators first. Two degrees higher. Here we go, here we go, here we go, here we go. 28.5 coming out of the pool. 29.4. About a degree. Is that what we had before? Yeah, roughly. Yeah, I was expecting more somehow, 29.6. Probably just ending up in the ground. So then the final question to answer is, did it make a difference to the room? Moment of truth, you ready? Yep, it's what, 36 and a half to beat, down to 31. Damn. 31 and a half. We just dropped five degrees, just like that. That is flipping awesome. And that's at a hot point in the room. Actually standing here, where I'm getting blown on a little bit more directly, I'm sitting at a frosty 31 degrees, which, okay, is still pretty hot. But this is with the door closed. I can finally actually run the other gear in here without worrying about it overheating and dying. I mean, it's still hot, but it is across the board, running cooler now. 58, under 60 now, all right. Just like this, all right, segue to our sponsor, Odoo. So you wanna start a business, that's cool and all, but where are you going to direct your potential customers? Right, you need a website. And with Odoo, you can create a beautiful website that's designed to help engage and convert your audience all for free. It's super simple to use with intuitive drag and drop elements and a user-friendly code-free approach that'll have your website up and running in a matter of clicks. And if you find yourself needing a few more features, Odoo is scalable with over 50 different apps, meaning you only have to install the ones that fit into your business needs, because your online t-shirt store probably doesn't need a rental management app. Plus with Odoo, you get unlimited hosting and support, and they even pay for your custom domain name for a whole year. Bottom line, here's some do's and don'ts. Odon't lose your customers. Odoo, start creating a website for free using the link down below. If you guys enjoyed this video, make sure to hit up the one where we actually hooked up the systems to the cooling loop. It's, well, it was an adventure.",
    "transcript_keywords": [
        "water",
        "Yeah",
        "allsystems Fur Mark",
        "degrees",
        "degree water",
        "heat",
        "degree",
        "half degree water",
        "room",
        "RGB",
        "pool",
        "system",
        "Fur Mark",
        "water coming",
        "pool water",
        "Fur Mark stress",
        "radiators",
        "heat exchanger",
        "cold water",
        "systems"
    ],
    "transcript_entity_values": [
        "40",
        "one",
        "two degrees",
        "One",
        "RGB",
        "41",
        "26",
        "38 degree",
        "GPU",
        "38 degrees",
        "40 degree",
        "28.5",
        "26 and a half",
        "under 60",
        "Linus",
        "24",
        "Four",
        "a little over half",
        "30 degrees",
        "Fur Marking",
        "29.6",
        "first",
        "31 degrees",
        "First",
        "28 degrees",
        "about five degrees",
        "Nada",
        "PT Cruiser",
        "Two degrees",
        "as high as 60 degrees",
        "one half",
        "37 degree",
        "52 degrees",
        "58",
        "29.4",
        "AC",
        "four",
        "Success",
        "three days",
        "almost 34",
        "Sandblaster",
        "four degrees",
        "Dan-genuity",
        "Alex",
        "five",
        "5.4",
        "Da da da da da da.",
        "Glenn",
        "a ton",
        "36 and a half",
        "33.3",
        "a hundred percent",
        "five degrees",
        "two",
        "Dan",
        "Molex",
        "a couple of degrees",
        "second",
        "31",
        "only about eight degrees",
        "10 hours",
        "50 degrees Celsius",
        "the last month",
        "50 degree GPU",
        "4.5",
        "today",
        "about 30 degrees Celsius",
        "six months",
        "No two",
        "24 and a half",
        "a whole year",
        "USB",
        "Odoo",
        "Fur Mark",
        "50",
        "60 degrees",
        "hundreds or thousands"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "FAC",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL"
    ],
    "vector": [
        -0.13652971386909485,
        -0.08811142295598984,
        0.05147108808159828,
        -0.026970909908413887,
        0.10570155829191208,
        -0.06627782434225082,
        0.04528319463133812,
        0.0027265672106295824,
        -0.04851958155632019,
        -0.047012705355882645,
        -0.008936697617173195,
        -0.04537452012300491,
        -0.0036843938287347555,
        -0.03422107920050621,
        0.010232836939394474,
        0.016578994691371918,
        0.029075218364596367,
        -0.00877111405134201,
        -0.07107675820589066,
        -0.08180634677410126,
        -0.014103762805461884,
        -0.05744333565235138,
        -0.030171869322657585,
        -0.018935689702630043,
        -0.0032190491911023855,
        0.06357011944055557,
        -0.013071591034531593,
        -0.006758003029972315,
        -0.007293454837054014,
        -0.029056299477815628,
        -0.034249674528837204,
        0.08570235222578049,
        -0.040249764919281006,
        -0.04666450247168541,
        0.033333610743284225,
        -0.020726105198264122,
        -0.013469032943248749,
        -0.06806766241788864,
        -0.05792934074997902,
        -0.04307129606604576,
        -0.006049794144928455,
        -0.08080419152975082,
        0.060558147728443146,
        -0.004744419362396002,
        -0.024085037410259247,
        0.002892411081120372,
        -0.023969391360878944,
        -0.08556175976991653,
        0.014885484240949154,
        0.016738343983888626,
        -0.035350896418094635,
        -0.11400408297777176,
        0.044983573257923126,
        -0.0002525708987377584,
        -0.09194561839103699,
        -0.0174587219953537,
        -0.021750250831246376,
        -0.0400344543159008,
        0.016686715185642242,
        -0.013876517303287983,
        0.06195960193872452,
        -0.01789306476712227,
        -0.08003199845552444,
        0.0359855554997921,
        0.09232164174318314,
        -0.02466810680925846,
        -0.07097158581018448,
        0.1729416698217392,
        0.0231391042470932,
        0.01216933224350214,
        -0.02162063494324684,
        0.05806737393140793,
        0.0030968524515628815,
        0.07640823721885681,
        -0.0038192621432244778,
        -0.08238891512155533,
        0.03728393465280533,
        -0.04107053205370903,
        0.029760537669062614,
        0.016182251274585724,
        0.04195566102862358,
        -0.06800950318574905,
        0.03407462313771248,
        -0.025053827092051506,
        -0.033240776509046555,
        -0.04578250274062157,
        0.07083840668201447,
        0.022394118830561638,
        -0.022932173684239388,
        -0.05933219939470291,
        -0.08140438050031662,
        0.11373397707939148,
        0.03734704479575157,
        -0.021394772455096245,
        -0.0146812554448843,
        0.07507409155368805,
        -0.03214067965745926,
        -0.08077315241098404,
        -0.01705550029873848,
        0.08205059170722961,
        0.014040063135325909,
        0.04122691974043846,
        0.004477816633880138,
        -0.0019547322299331427,
        -0.009869411587715149,
        -0.05421140417456627,
        0.014439295046031475,
        0.15239614248275757,
        0.10429052263498306,
        -0.053244516253471375,
        -0.11513397097587585,
        -0.001415077829733491,
        -0.06215059012174606,
        -0.050225745886564255,
        0.011889411136507988,
        -0.015109247528016567,
        -0.035230912268161774,
        0.008882200345396996,
        0.054311417043209076,
        -0.03381011262536049,
        0.015245559625327587,
        0.025846725329756737,
        -0.03121010586619377,
        0.030232984572649002,
        0.10503718256950378,
        0.055067479610443115,
        -0.00892111100256443,
        -3.0936278289276945e-33,
        0.06356728076934814,
        0.0037465449422597885,
        0.004763003904372454,
        -0.02127496711909771,
        0.11613097041845322,
        -0.03995921462774277,
        -0.03557559475302696,
        -0.015860171988606453,
        -0.0736231654882431,
        0.05440075695514679,
        0.03365476056933403,
        0.049238089472055435,
        -0.11822498589754105,
        0.050811268389225006,
        0.021032117307186127,
        -0.1433493047952652,
        0.0021279025822877884,
        0.009641444310545921,
        -0.01708739623427391,
        -0.02555215172469616,
        -0.0512220598757267,
        -0.03586243838071823,
        -0.020006466656923294,
        0.0067927599884569645,
        0.052495550364255905,
        -0.05402689054608345,
        -0.002540833316743374,
        0.011896645650267601,
        0.05385212600231171,
        0.032405540347099304,
        0.0005844884435646236,
        -0.03518056124448776,
        -0.013961146585643291,
        -0.03208000585436821,
        -0.0648292824625969,
        2.7866955861099996e-05,
        -0.08712425082921982,
        -0.07451523095369339,
        0.03454374894499779,
        -0.02447466552257538,
        0.0143567631021142,
        0.014527957886457443,
        -0.039409101009368896,
        -0.06275517493486404,
        -0.045840442180633545,
        -0.00015426050231326371,
        0.031292133033275604,
        0.03211653232574463,
        0.03915918990969658,
        0.00644364207983017,
        -0.0245093684643507,
        -0.009333835914731026,
        -0.12222253531217575,
        0.02192332223057747,
        -0.008270558901131153,
        0.03728049248456955,
        0.013875814154744148,
        -0.02561291493475437,
        0.03640250116586685,
        0.017487121745944023,
        -0.010163556784391403,
        0.05162505805492401,
        -0.04212925583124161,
        -0.10477384924888611,
        -0.04712256044149399,
        0.04225469008088112,
        0.07608319818973541,
        0.018864309415221214,
        4.910173447569832e-05,
        -0.028647316619753838,
        -0.12691272795200348,
        -0.03739925101399422,
        0.048820070922374725,
        -0.032049667090177536,
        0.0016051703132689,
        0.040262915194034576,
        -0.04586075618863106,
        -0.0797489732503891,
        -0.1086668148636818,
        0.0241539403796196,
        -0.05107596889138222,
        -0.0234933290630579,
        0.055385127663612366,
        0.022301489487290382,
        -0.022898022085428238,
        -0.04408833011984825,
        0.019329925999045372,
        -0.05087621137499809,
        -0.021101515740156174,
        0.020323200151324272,
        -0.07209622859954834,
        -0.00011475053906906396,
        0.0789293646812439,
        -0.027659926563501358,
        -0.06616118550300598,
        -2.4536291031030347e-34,
        -0.002339212689548731,
        0.018649309873580933,
        -0.0123658562079072,
        0.05578417330980301,
        0.11405766010284424,
        -0.005009276792407036,
        0.04763222858309746,
        0.004518453031778336,
        0.02316870354115963,
        0.010246173478662968,
        -0.015387304127216339,
        0.023937728255987167,
        -0.10484886169433594,
        -0.09669914841651917,
        0.015140472911298275,
        -0.03147244453430176,
        0.036734048277139664,
        -0.0339081734418869,
        -0.01840938813984394,
        0.037719663232564926,
        -0.00018587970407679677,
        0.07470200955867767,
        0.018491778522729874,
        0.07515743374824524,
        -0.017806097865104675,
        0.010428945533931255,
        0.054229509085416794,
        0.05463685840368271,
        0.020474150776863098,
        0.061707232147455215,
        -0.028789808973670006,
        0.01975330524146557,
        -0.010957879945635796,
        -0.035261183977127075,
        0.02381557784974575,
        -0.03507625311613083,
        0.10264761000871658,
        0.055251505225896835,
        -0.061853863298892975,
        -0.0192237738519907,
        0.03422464802861214,
        -0.04179529473185539,
        -0.009327815845608711,
        -0.01640963740646839,
        -0.032290637493133545,
        0.042742595076560974,
        -0.07345133274793625,
        -0.033024318516254425,
        -0.10491494834423065,
        0.009979666210711002,
        0.01564457267522812,
        -0.08466263115406036,
        -0.015399331226944923,
        -0.019841765984892845,
        0.023945337161421776,
        -0.020650548860430717,
        0.04326479136943817,
        0.03436604514718056,
        -0.0443439818918705,
        -0.007116952445358038,
        0.067331463098526,
        -0.037491727620363235,
        -0.08945969492197037,
        -0.02960381843149662,
        0.02906961180269718,
        0.0012881355360150337,
        0.022725963965058327,
        0.0827915295958519,
        -0.04992269352078438,
        0.02189681865274906,
        -0.023838646709918976,
        0.01387852244079113,
        0.0035355722066015005,
        -0.052816201001405716,
        -0.01741383969783783,
        -0.05237550660967827,
        0.02056632936000824,
        0.028906280174851418,
        -0.0009208539268001914,
        -0.03135790675878525,
        -0.061879925429821014,
        0.15219299495220184,
        -0.0003078939043916762,
        -0.010957198217511177,
        0.12268850952386856,
        0.00280937016941607,
        -0.0026976570952683687,
        -0.0068196021020412445,
        -0.018148839473724365,
        0.011124768294394016,
        -0.07181112468242645,
        -0.024686569347977638,
        -0.06332898139953613,
        0.08981963247060776,
        0.05822979286313057,
        -5.817389236995041e-08,
        -0.0488196425139904,
        0.03568506985902786,
        0.022481096908450127,
        0.06860589236021042,
        0.021797524765133858,
        -0.02751806378364563,
        0.040490198880434036,
        0.04080948978662491,
        0.054467711597681046,
        -0.010837899520993233,
        -0.014510096982121468,
        -0.05965511128306389,
        0.021028362214565277,
        0.0457199364900589,
        0.021618876606225967,
        -0.006102480925619602,
        -0.015280885621905327,
        0.036890242248773575,
        -0.0656716600060463,
        -0.07466425001621246,
        -0.020762449130415916,
        0.02390780858695507,
        0.06100383400917053,
        0.010820816271007061,
        0.04476293548941612,
        0.058607038110494614,
        0.05681244283914566,
        0.057570844888687134,
        0.11578292399644852,
        -0.051775012165308,
        -0.031563207507133484,
        0.0044638169929385185,
        -0.014685970731079578,
        -0.05491095036268234,
        0.07622816413640976,
        -0.004564751870930195,
        -0.049451857805252075,
        0.0143345408141613,
        -0.010746565647423267,
        0.04017223045229912,
        -0.041825421154499054,
        0.06972432136535645,
        0.040379155427217484,
        0.0318465381860733,
        0.060800567269325256,
        -0.03647750988602638,
        -0.009712238796055317,
        -0.048633262515068054,
        0.010842924937605858,
        0.04991062358021736,
        -0.005911419168114662,
        -0.04108250513672829,
        0.016768531873822212,
        0.07483193278312683,
        0.10497603565454483,
        0.010303288698196411,
        -0.06276658177375793,
        0.03997371345758438,
        -0.038840118795633316,
        0.10690254718065262,
        0.08307098597288132,
        -0.0039020066615194082,
        -0.09035356342792511,
        0.08372487127780914
    ]
}