{
    "id": "D-rLwzFXcko",
    "title": "In-Glass Fingerprint Reader SCRATCH Test! - Will it still work?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-02-26T14:30:00Z",
    "video_url": "https://www.youtube.com/watch?v=D-rLwzFXcko",
    "category": "Howto & Style",
    "tags": [
        "vivo x20 plus",
        "Vivo",
        "vivo x20 plus ud",
        "unboxing",
        "review",
        "In screen fingerprint scanner",
        "optical fingerprint scanner",
        "fingerprint sensor",
        "durability test",
        "scratch test",
        "fingerprint scanner scratch",
        "fingerprint reader",
        "under glass",
        "clear id",
        "face id",
        "under glass fingerprint",
        "smartphone",
        "android"
    ],
    "views": 2700259,
    "likes": 50127,
    "comments_count": 4792,
    "description": "The Vivo X20 Plus UD is the first phone ever with a fingerprint scanner UNDER the screen. Well what happens when that glass gets scratched? Will the fingerprint scanner still work under the damage? There is only one way to find out.  Scratching the fingerprint scanner of the newwest Vivo Flagship is just part of this full set of durability tests. Bending, burning, No surface of the Vivo X20 plus will be left un-tested.   Here is MKBHD's In-Glass Fingerprint Reader video:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/dRtqFjYYUY0",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRig..."
    ],
    "transcript": "The Vivo X20 Plus. You might have heard about this phone. It has the first in-screen fingerprint scanner on a smartphone. Yeah. A fingerprint scanner under the front glass. Let's, uh, do what we do. [Intro] Right out of the box this phone is big, solid, but still very thin. And it's time for a durability test. It's basically a right of passage for any new smartphone these days. Starting with the scratch test which is going to be pretty important during this video. Plastic scratches at a level 3, tempered glass at a level 6, and diamonds are a level 10. It's nice to see Vivo holding up so far against other flagships like LG and Samsung and the iPhone, scratching at a level 6 with a deeper groove at a level 7. Now let's take a look at that fingerprint scanner. If it's under the glass it's probably visible to the naked eye, and if you look closely you can see the rectangular shape of the fingerprint scanner at the bottom of the phone. It's pretty invisible with the screen off, and when the screen's on, it pretty much disappears. MKBHD made a video explaining a bit more about the software side of the sensor saying it only works in OLED displays, and has the potential on future phones to be any size it wants, which is pretty cool. I'll link his video for you in the description. I'm here for the hardware. And it'll be extremely interesting to see what the scanner looks like inside the phone if, you know, it survives my durability test. Setting up the in-screen fingerprint scanner is pretty straightforward, asking for a pass code and some backup questions in case the sensor stops working or your fingers get chopped off. You can still access your phone. A lit circle fingerprint icon pops up on the display and everything gets programmed in like normal. It's surprisingly quick at recognizing my finger and unlocking the phone, so we're off to a good start. But let's say you've owned your phone for about a year now, and naturally the glass is a little scratched up from normal wear and tear. Will the fingerprint scanner still work underneath that scratched glass? My level 7 pick is going to help us find out. I think that's sufficiently damaged, and luckily we still have unlocking success every time I touch the phone, even with the scratches. The in-screen fingerprint scanner will still function under heavily scuffed glass. If this Vivo X20 survives the bend test, I'll shatter the screen at the end of this video, just to see if the scanner works on a fully cracked display as well. There are no physical buttons at the bottom of the screen, and up here at the top of the phone, we have a 12 megapixel front facing camera underneath the screen glass. The earpiece slot is a tiny little guy, slightly recessed below the glass of the phone. It's made out of metal and it's permanent. So no falling out with time. The sides of the phone are made from metal, with a pretty slick looking gold accents. And there's even a plastic layer between the glass and the metal frame, softening the pinch point between the two surfaces of the phone if it ever does drop or get bent. It's a good design move from a durability perspective. The bottom of the phone has some useful features like a headphone jack, but then Vivo slams us with a blast from the past and slips a micro USB charging port in there. As well all know, thinness doesn't matter when it comes to cellphones, but I do want to point out that this Vivo X20 is .3 millimeters thinner than the iPhone 8 Plus, yet still has room for a headphone jack and a larger battery than the iPhone has. The power button is made from metal, along with the volume rocker. On the back of the phone, the flash is made from plastic, and then we get glass covering the dual camera lenses. Both of these are 12 megapixel and have the same focal length. It's doing that monochrome thing with the secondary lens if you're into that. Pretty similar camera bump to the newer iPhones, but that gold accent is still pretty sweet. The Vivo logo on the back is heavily embedded in the metal panel, and even with some aggressive persuasion from my razor blade, it would not come out. Thumbs up to Vivo for that level of commitment. So far this phone is solid. [Scratching sounds] There are two basic type of fingerprint scanners: optical and capacitive. The optical fingerprint scanner basically captures a picture of your fingerprint and turns it into a math equation based on the ridges of your fingers. Just like the ridges you see here on the finger I'm drawing. And then the sensor sees if your fingerprint matches the one stored inside of the phone. capacitive fingerprint scanners are more common in Samsung and LG phones. Instead of taking a picture, it reads the conductivity of the ridges on your fingertip, turns it into a math equation, and then unlocks your phone if the equation matches the one you set. Both sensors work equally great. The sensor inside of this phone is under the glass which makes it an optical sensor, taking a little picture of your fingerprint every time you set it on the scanner. Apple is probably going to invent this technology in a few years...just watch. The Vivo X20 has a 6 inch 1080p AMOLED display. Remember that AMOLED displays are self lit by each individual pixel, making the in-screen fingerprint scanner possible. A back-lit IPS LCD display would not function because that back light would need to shine through each pixel, and adding an in-screen fingerprint scanner would just end up being a dead spot right in the middle of the display. The AMOLED screen survived almost 30 seconds before the pixels went white and never completely recovered. And now the bend test. The ultimate indicator of structural build quality. With how large and thin this phone is, I was nervous for a second, especially with the first flex. There is definitely more give to the phone when pressing from the back than there is when I press from the screen side, which I why I wanted to wait to shatter the screen until after the bend test. The screen is sometimes structural. After flexing the phone a few times, I can safely say this phone passes the bend test, remaining intact and structurally sound. Now, to see if the fingerprint scanner still works after a crack. A level 9 pick is overkill when it comes to scratching. It actually scores the glass, making cracks appear along the fracture because it's so hard and causing so much damage. The problem is if you watch closely as I connect the lines over the sensor and the fractures in the glass start to appear, the whole display dies. You can see a vertical green line appear and then the screen goes off, never to come back on again. I'm going to assume this was my fault since we can see the first display line start at the point of crackage, but that's also right over the fingerprint scanner. And that fingerprint scanner could be a weak point in the display when it comes to cracks. Maybe we'll learn more when we see it from the inside during my teardown I'll do this week. But it's hard to say with 100% certainty with a sample size of one. Maybe if we ask nice enough, MKBHD will crack his Vivo X20 for, you know, science. Either way, Vivo does include a free case and screen protector in the box to help keep things damage free. Even though the phone cracked and died at the end, it does pass my normal durability test. We'll have to see if the in-screen fingerprint scanner compromises the display structure in future screens that it gets implemented on. Thanks a ton for watching and I'll see you around.",
    "transcript_keywords": [
        "fingerprint scanner",
        "inscreen fingerprint scanner",
        "phone",
        "fingerprint",
        "scanner",
        "Vivo",
        "glass",
        "inscreen fingerprint",
        "screen",
        "display",
        "pretty",
        "level",
        "test",
        "sensor",
        "inscreen",
        "optical fingerprint scanner",
        "bend test",
        "fingerprint scanner basically",
        "capacitive fingerprint scanners",
        "made"
    ],
    "transcript_entity_values": [
        "almost 30 seconds",
        "3",
        "Vivo",
        "iPhone",
        "9",
        "6",
        "MKBHD",
        "millimeters",
        "this week",
        "100%",
        "two",
        "jack",
        "6",
        "about a year",
        "12 megapixel",
        "6 inch 1080p",
        "a few years",
        "Apple",
        "first",
        "second",
        "Samsung",
        "these days",
        "Vivo X20",
        "USB",
        "iPhones",
        "AMOLED",
        "one",
        "7",
        "LG"
    ],
    "transcript_entity_types": [
        "TIME",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "FAC",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.11074420064687729,
        0.015554378740489483,
        0.05013338103890419,
        -0.11978138238191605,
        0.10598529130220413,
        -0.045946285128593445,
        0.06809550523757935,
        -0.01417316123843193,
        -0.10590687394142151,
        0.01259663701057434,
        0.12845943868160248,
        0.07161914557218552,
        0.02056645229458809,
        0.09452703595161438,
        -0.018670575693249702,
        -0.07906970381736755,
        0.004136684816330671,
        -0.04078707844018936,
        0.011933359317481518,
        0.09342829138040543,
        0.017758430913090706,
        -0.02707199938595295,
        0.02114524506032467,
        -0.13259680569171906,
        -0.05709153786301613,
        -0.011990569531917572,
        0.01847010664641857,
        -0.02750679850578308,
        -0.029248986393213272,
        -0.0046318103559315205,
        0.03541426360607147,
        0.09452749043703079,
        -0.0043879346922039986,
        0.016944414004683495,
        0.08720725774765015,
        -0.0827457532286644,
        -0.007204115390777588,
        0.046275876462459564,
        -0.045247919857501984,
        -0.070011205971241,
        -0.07136387377977371,
        -0.0667874813079834,
        -0.04023728892207146,
        0.0417337492108345,
        0.030892040580511093,
        -0.040365882217884064,
        0.1077955812215805,
        -0.025372877717018127,
        0.01749379001557827,
        0.031110730022192,
        -0.05576210841536522,
        -0.0010200062533840537,
        0.04645664989948273,
        -0.03574725612998009,
        0.008035281673073769,
        0.00031198750366456807,
        0.011559050530195236,
        0.013037776574492455,
        -0.027868472039699554,
        0.001514508156105876,
        0.04934222623705864,
        0.003100939327850938,
        -0.03490307554602623,
        0.04598413407802582,
        0.04818219691514969,
        0.014098539017140865,
        0.08243831247091293,
        -0.08780713379383087,
        0.03474753722548485,
        -0.00830021034926176,
        0.006220355164259672,
        -0.017050456255674362,
        0.05824177712202072,
        -0.030784716829657555,
        0.023649226874113083,
        0.057994093745946884,
        -0.07213717699050903,
        -0.018717696890234947,
        -0.018061695620417595,
        -0.02963334321975708,
        -0.0031623700633645058,
        -0.0370124876499176,
        0.019904958084225655,
        0.01837814785540104,
        -0.006383899599313736,
        0.045372191816568375,
        -0.05036190524697304,
        0.0507824681699276,
        -0.021347174420952797,
        -0.04980427771806717,
        0.007457922678440809,
        0.02921784482896328,
        -0.08303593844175339,
        -0.02912827581167221,
        0.03548259660601616,
        -0.06562929600477219,
        -0.04459081217646599,
        -0.019677402451634407,
        -0.05469551682472229,
        0.0008223498007282615,
        -0.01834549941122532,
        -0.05020534247159958,
        -0.06446041911840439,
        -0.03128405660390854,
        0.038477007299661636,
        -0.07705013453960419,
        -0.07662301510572433,
        -0.06501852720975876,
        -0.035722799599170685,
        -0.0005732151912525296,
        0.07572117447853088,
        0.06809121370315552,
        0.0158925149589777,
        0.07339069992303848,
        0.004753433633595705,
        -0.033023566007614136,
        0.017704108729958534,
        0.022473223507404327,
        0.0535881370306015,
        0.009398402646183968,
        0.02948976494371891,
        -0.008678292855620384,
        -0.0429469533264637,
        -0.02047496661543846,
        -0.016589706763625145,
        0.020800868049263954,
        0.013135946355760098,
        2.3110902193257588e-33,
        0.041427433490753174,
        0.13571719825267792,
        -0.02909846045076847,
        -0.05381501093506813,
        -0.028160549700260162,
        -0.005436555482447147,
        0.021533511579036713,
        0.0474683977663517,
        -0.02512219361960888,
        0.03582876920700073,
        -0.016640275716781616,
        0.00477505661547184,
        0.004149647895246744,
        0.02620197832584381,
        0.03156358003616333,
        0.11423202604055405,
        -0.047817010432481766,
        0.037167828530073166,
        -0.11326346546411514,
        0.0370597168803215,
        0.015368517488241196,
        -0.10982110351324081,
        -0.01674950122833252,
        0.05025729164481163,
        0.048765622079372406,
        0.07981661707162857,
        -0.027142062783241272,
        0.011267042718827724,
        0.03890864923596382,
        0.04514986276626587,
        -0.11871200054883957,
        0.0034869590308517218,
        -0.00243763392791152,
        0.08046234399080276,
        -0.03560939058661461,
        0.0790422111749649,
        0.004143338184803724,
        -0.034502238035202026,
        -0.05522626265883446,
        -0.030918603762984276,
        -0.006826369091868401,
        0.011219819076359272,
        0.07881350070238113,
        -0.05879686772823334,
        0.011094735935330391,
        -0.06893835961818695,
        -0.09024222195148468,
        0.04766776040196419,
        -0.010273013263940811,
        0.020718004554510117,
        -0.025638019666075706,
        -0.0815630778670311,
        -0.03201235830783844,
        -0.06260969489812851,
        -0.11691069602966309,
        0.00788554921746254,
        0.008205180987715721,
        -0.0257416982203722,
        -0.007219862658530474,
        0.04308021068572998,
        0.04239216446876526,
        -0.02730395831167698,
        -0.04114653915166855,
        0.029635971412062645,
        -0.013852120377123356,
        0.04289354383945465,
        9.187130490317941e-05,
        -0.057573944330215454,
        -0.05873755365610123,
        0.01738368533551693,
        0.025126870721578598,
        0.025790555402636528,
        -0.020169490948319435,
        -0.008653446100652218,
        0.034175340086221695,
        0.06033684313297272,
        -0.009624877944588661,
        0.043742045760154724,
        0.0027926068287342787,
        0.00825346540659666,
        -0.027357038110494614,
        0.017324166372418404,
        0.04892946779727936,
        -0.10801851749420166,
        -0.0038357763551175594,
        -0.030246494337916374,
        0.024758944287896156,
        -0.04737409949302673,
        0.026574375107884407,
        0.016892530024051666,
        0.028865495696663857,
        -0.04241988807916641,
        -0.0984606221318245,
        -0.04354802519083023,
        -0.06474799662828445,
        -4.094821346777992e-33,
        -0.10606464743614197,
        -0.04711786285042763,
        0.032679565250873566,
        -0.005991324782371521,
        -0.03827160596847534,
        -0.08168633282184601,
        0.06940753012895584,
        0.10916168987751007,
        0.027659785002470016,
        -0.11092929542064667,
        -0.012661559507250786,
        0.03252313286066055,
        -0.05984169617295265,
        0.04600316286087036,
        -0.050734709948301315,
        0.008309703320264816,
        -0.032400187104940414,
        -0.07660430669784546,
        -0.008126993663609028,
        0.030282169580459595,
        0.08815640956163406,
        0.014809396117925644,
        0.046028681099414825,
        0.13810808956623077,
        -0.020394587889313698,
        0.005243287887424231,
        0.05559331923723221,
        -0.04331054911017418,
        0.004043194465339184,
        0.011805382557213306,
        0.07311443984508514,
        -0.0162628423422575,
        -0.024520227685570717,
        0.105049267411232,
        0.0840839073061943,
        0.03450968116521835,
        0.05060536414384842,
        -0.04882122576236725,
        -0.014652850106358528,
        -0.038718316704034805,
        0.01575821079313755,
        0.06683151423931122,
        -0.039799679070711136,
        -0.01535188127309084,
        -0.01820174977183342,
        -0.06062972918152809,
        0.016075700521469116,
        0.05076941102743149,
        -0.0019926324021071196,
        0.0016049934783950448,
        0.03382810577750206,
        0.024234768003225327,
        0.0626017153263092,
        0.010905240662395954,
        -0.044090669602155685,
        0.06476916372776031,
        0.05437450483441353,
        -0.0311909019947052,
        -0.008086704649031162,
        -0.00343079655431211,
        0.05415184050798416,
        0.07179281860589981,
        -0.0487784743309021,
        -0.04447183385491371,
        -0.005737786181271076,
        -0.040998976677656174,
        0.11189257353544235,
        0.05872182175517082,
        -0.028795668855309486,
        0.054623398929834366,
        0.025802087038755417,
        0.018395598977804184,
        0.03549833968281746,
        -0.057489123195409775,
        0.006393895950168371,
        0.04702384024858475,
        -0.08266139775514603,
        0.010993477888405323,
        -0.04982198402285576,
        -0.035977378487586975,
        0.01647557131946087,
        -0.07000294327735901,
        0.010580242611467838,
        0.11567531526088715,
        0.13348433375358582,
        -0.016326893121004105,
        0.01404338888823986,
        0.002472707536071539,
        -0.04168315604329109,
        -0.03976213559508324,
        -0.07295196503400803,
        0.03205638378858566,
        -0.05462336912751198,
        0.004410379566252232,
        0.018131380900740623,
        -4.464358482891839e-08,
        0.02951936423778534,
        0.05447773635387421,
        -0.043923269957304,
        -0.08470859378576279,
        -0.027932243421673775,
        -0.029775233939290047,
        0.03662463650107384,
        -0.017588205635547638,
        0.03649813309311867,
        -0.06442330032587051,
        -0.05718769133090973,
        -0.0596378818154335,
        -0.018804917111992836,
        0.018144425004720688,
        -0.01986883394420147,
        0.06073375418782234,
        0.050973955541849136,
        0.004444951191544533,
        -0.04690491035580635,
        -0.04702471196651459,
        -0.051420167088508606,
        0.0005647492944262922,
        0.026092130690813065,
        -0.002797032706439495,
        -0.01543821394443512,
        0.04461335763335228,
        -0.03395668417215347,
        -0.007835079915821552,
        0.05920121446251869,
        0.013066492974758148,
        -0.05480021983385086,
        -0.004945492371916771,
        -0.007735144812613726,
        0.1180921345949173,
        -0.042067669332027435,
        -0.019280456006526947,
        -0.025219397619366646,
        0.018148843199014664,
        0.08653443306684494,
        0.0700434148311615,
        -0.03018525242805481,
        -0.045848771929740906,
        -0.04980197548866272,
        0.024641504511237144,
        -0.006213181186467409,
        -0.12883394956588745,
        0.07310252636671066,
        -0.14454755187034607,
        -0.09427697956562042,
        0.012316694483160973,
        0.03557856008410454,
        0.0237647145986557,
        -0.0294524896889925,
        0.0012768273008987308,
        -0.0010215939255431294,
        0.011552237905561924,
        0.07388298958539963,
        -0.048028364777565,
        0.07084186375141144,
        0.045686133205890656,
        0.024613156914711,
        -0.05074024572968483,
        0.032652005553245544,
        0.05782561004161835
    ]
}