{
    "id": "d1tlyAJRxnY",
    "title": "iPhone 15 Pro - No more USBC?",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-03-06T19:39:54Z",
    "video_url": "https://www.youtube.com/watch?v=d1tlyAJRxnY",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Unboxing",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 237095,
    "likes": 6952,
    "comments_count": 456,
    "description": "More rumors about the iPhone 15:   PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "https://youtu.be/Oy8kQgOLHjQ",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, it's Justine and the last time we chatted about iPhone rumors, we were talking specifically about the iPhone 15, but now I wanna kind of dive into the iPhone 15 Pro. I'm hyped about because that's usually the device that I get. So we're in here on MacRumors. I'll put a link in the description if you wanna check out this full article. But this is \"Every rumor about the iPhone 15 Pro and iPhone 15 Pro Max, which are expected in September 2023.\" Let's get into it. So at glance, they're saying the 2023 iPhone 15 Pro models are expected to feature USB-C. Now this is not just specific to the Prom this is also, of course, on the 15 line. There has been a mandate that legally most phone manufacturers are now going to have to shift to USB-C. I'm definitely excited about this so looking forward to the future. There's also rumors of solid-state volume and power buttons, which would mean it's not actually a physical button anymore. It's kind of like the Touch ID or the trackpad on the MacBooks. A new Periscope camera, A17 chips, and more. I like this little render. Very nice, very nice. Love to see it. \"So far, looks like iPhone 15 Pro models will have an updated design,\" and it looks like they're gonna have it be a little bit thinner with curved bezels and a new titanium chassis. And going off of the solid-state buttons, it says that it's gonna be using haptic feedback to mimic the press of a button, which kind of makes it feel like you're actually pressing a button. You also kinda get that haptic feedback when you're using the keyboard, so something very similar to that will carry over into the actual buttons. Looks like we've got an A17 chip which will be exclusive to the 15 Pro and Pro Max. All 15 models will have the Dynamic Island so this is not just something special to the Pros this year. It will be carrying over onto the lower-end models as well. We've got USB-C port that features a USB 3.2 or Thunderbolt 3 transfer speeds. My hair is blowing all over the place because the air is on and I don't feel like getting up to turn it off. \"More RAM expected alongside the A17 chip, but all iPhone 15 models will use the same 5G Qualcomm modem for connectivity. So for the most part, the iPhone 15 Pro and the Pro Max will have the same features with one major difference, that telephoto camera.\" This is not something new in the Apple territory to add a better telephoto camera on the higher-end models. They did this before, a couple phones ago, and it really does make a difference. But I did like this past year how the iPhone 14 Pro and the Pro Max were basically identical other than, of course, the battery life and the screen size. You're kind of getting the same exact phones so you don't have to pick and choose and lose features one over the other. It says, \"Both models will include the telephoto lens, but the iPhone 15 Pro will have a periscope lens that will enable 6x optical zoom with those notable performances over the 3x zoom on the 14 Pro.\" And here we have a photo of USB-C. Just another leak to show you that this is the direction that Apple is going into. And of course our lovely leaker really loves to let us know who leaked it. Another image from 9to5Mac. They've had some really great renders recently. Here we've got some more renders and you can see the camera bump is expected to be thicker with thicker lenses to accommodate the camera updates. Like it's so interesting just to kind of see where the the past couple of years, the evolution of the camera bump on these iPhones because it's pretty extensive. Here's some renders from a CAD drawing of the iPhone 15 Pro Max, showing it could be slightly thicker than the iPhone 14 Pro Max with small reductions in the width and height. So the iPhone 15 is expected to be 0.4 millimeters thicker than the iPhone 14 Pro. Didn't they just say that it was supposed to be thinner? I swear to you. Okay, no. Bezels. \"With Apple introducing thinner, curved bezels.\" Okay, so not the actual phone itself. I'm like, \"Hold on a second. Contradicting.\" Again, these are all rumors so nothing is really like actually set in stone. That's not true. Pretty sure a lot of the stuff is actually set in stone, we just don't publicly know it yet. I mean Apple's already producing these devices, getting them ready for us in September which is crazy to think about. So looks like we have a 6.1 and 6.7-inch OLED display with cutouts for the camera and Face ID. \"There have been rumors of tweaks to the chassis of the two Pro models. Leaker ShrimpApplePro is talking about the thinner, curved bezels,\" which I feel like they're even saying here is similar to the Apple Watch because it does have like the bezels that kind of curve into the design of the actual chassis itself, which I kind of think looks really good. \"Titanium is lighter and stronger, but it is also more expensive because it is harder to work with. Presuming no other major changes than internal components, an iPhone constructed with a titanium frame will be lighter than an iPhone with a stainless steel frame, so it's likely that the 15 Pro and Pro Max will be lighter than the iPhone 14.\" Oh, that's interesting. \"In addition to lighter weight, titanium has a different finish than stainless steel. So rather than it being shiny, it is a more of a matte texture so it won't attract fingerprints in the same way.\" Oh my god, please. The fingerprint magnet that is that stainless steel band, like it's really crazy. I mean I have a case on it so I really don't ever see it, but as soon as I take it out, instantly fingerprint central. Now it's time for some colors. They're suggesting the iPhone 15 Pro models could come in a dark red color. It's just upsets me sometimes that like Apple likes to make their Pro models like a darker kind of muted colors. Red is definitely not in my favorite color list, but what is in my favorite color list is pink. So it's kinda like, you know, a lighter red. It's rumored that the iPhone 15 will come in this pink and these blue colors like it's so, so pretty. Absolutely freaking love it. Why are you doing that on the 15 and not on the 15 Pro? Like you could do it. Just do it! Even though I'm not like a huge red fan, I think I'll probably do pretty well. More rumors about the solid-state buttons. Saying that Apple already uses the same technology for the Touch ID button on the iPhone SE and the trackpad on the MacBook Pro and the MacBook Air models. \"On these devices, you can use a press gesture and it feels like you've pressed a button, but in reality, it's a solid surface with haptic feedback.\" It really is kind of crazy because the trackpad press like at this point, I've kind of forgot that this isn't an actual button. So wild. Saying that \"Solid-state technology can improve protection against dust and water because it does not need a physical depressing mechanic, but it does require extra hardware inside of the iPhone. Apple is rumored to be adding two additional Taptic Engines to the iPhone 15 Pro models to power the solid-state buttons. In the current iPhone models, they have a single Taptic Engine for haptic feedback.\" So there it is. There's a little Taptic Engine. It was saying that \"There were some 2021 rumors indicating that Apple would adopt round volume buttons for the iPhone 14 and that didn't happen.\" That could be kind of cool, like actually just like round like little circular buttons. I mean I don't think there's really anything wrong with these. I feel like it's pretty decent placement. Although the amount of screenshots that I accidentally take on a daily basis, it's a lot. As for the display, it's saying it's gonna be \"equipped with a power-efficient OLED display driver chip. So that could lead to reduced power consumption, but ultimately could lead to better improved battery life,\" which we definitely hope. I know a lot of people have been having trouble with their iPhone 14 battery life and it hasn't been kind of living up to the hype. I have noticed though, sometimes I do get up at 5:00 AM and when I have those early start days, it does not make it through the day. But I am constantly always on my phone so I'm usually never too far from like a Mophie charger or a wall plug or I charge a lot in my car. Then of course we have the 15 Ultra, which I talked about in my iPhone 15 video. This could go both ways. Like there could be an entirely separate phone that is a 15 Ultra or just an iPhone Ultra. I don't really think they would break it out and do the 15, the 15 Pro, and then the Pro Max, and then an Ultra. I do feel like the Ultra would kind of be something that they may announce and then it's not coming until like later. Kind of like they've done in the past with some of the iPhones where they've held off. I don't know, I just feel like it could be something else on its own kind of like the Apple Watch Ultra is separate from the Apple Watch series. \"Apple is indeed working on a higher-end, higher-priced iPhone model that could be marked as 'Ultra,' but he expects this iPhone to launch as a part of 2024 in the iPhone 16 lineup.\" That makes sense. \"All 15 models are expected to feature USB-C port instead of Lightning. The European law requires all devices to use a universal charging port, so either Apple needs to design an iPhone just for Europe or make a worldwide change.\" I mean in typical Apple fashion, like it kind of wouldn't surprise me if they just made a European version that was USB-C. But then I feel like all of us over here would be like, \"Wait a minute, we want USB-C too\" and then would be trying to like import European phones. It could be a whole thing. So I feel like it's the smart decision to just give in. \"The iPhone 15 Pro models are expected to support higher-speed data transfers,\" which is great. Especially if you're shooting ProRes RAW footage, like that stuff eats up space and it takes forever to download and transfer. \"Thunderbolt 3 transfer speeds, so up to 20 gigs a second at a minimum or up to 40 gigs if Thunderbolt is sported. Standard 15 models will be limited to USB 2 transfer speeds, which is 480 megabytes a second. Wired transfer of photos, backups, and other information would be quicker with faster data speeds.\" I don't know how many of you really do a lot of that. I definitely import a lot of content to my computer when I'm editing. You could just Airdrop, but sometimes I just feel like that also takes a while and it's not always super reliable. So sometimes it works, sometimes it doesn't. So it's just better to plug it in, import it all, and we're done, ready to go. \"One rumor from a Chinese social networking site suggests that Apple could place some limitations on iPhone's USB-C port preventing them from working with Apple-unapproved accessories. They have done this with the Lightning port, but none of the USB-C ports in Apple's Macs or iPads have any kind of restriction. This rumor suggests that Apple could add an integrated circuit interface into the USB-C chips, encouraging customers to buy genuine iPhone accessories and protecting from counterfeit and potentially dangerous charging cables and adapters.\" We love to see it. This is great because even when I was working with Kondor Blue and we were creating the Lightning cables for my pink iJustine cable, we wanted to make sure that those were MFI certified which means they will work with Apple, it's genuine and we're using all of the specifications from Apple to make sure that it does work properly with your phone. Because a lot of these cables that you get like if you've ever used a weird Lightning cable and it pops up and says \"This accessory is not supported,\" that's when you know it is not meeting the specifications that Apple has set for their phones. Which is good because we want to have a higher quality cable. You don't wanna be using something that could be possibly damaging to your device. And my computer just switched into to dark mode. I have it switched to dark mode as soon as the sun sets so that must mean the sun has set. So this periscope lens system uses a primary lens to capture a photo with an angled mirror or prism reflecting light at 90 degrees towards a second lens that then sends it to the image sensor. The image sensor and secondary lens are positioned sideways inside the smartphone to extend the focal length. And like they're saying here that that takes up valuable surface area. So that is a kind of a cool little demo just to show how that all works. So \"Samsung has been using periscope lens technology for a few years and their lenses can support up to 10 optical. And paired with digital zoom, Samsung offers up to a 100x digital zoom,\" which is kind of incredible to really witness it. They call this the Space Zoom. As for RAM, \"the Pro and Pro Max are expected to feature eight gigs of RAM, up from six gigs in the current 14 Pro and Pro Max.\" Wi-Fi 6E and 5G. I just recently upgraded my Wi-Fi access points to Wi-Fi 6 and it has been so incredible. It's been so much faster. \"There's been some speculation that Apple could increase the price of the 15 Pro models because of the higher-end components.\" Love a good price hike. Beyond the iPhone 15 Pro. This is interesting. \"There have been rumors that Apple could implement an under-display Face ID technology as soon as 2024, increasing the usable display area.\" Getting rid of a Dynamic Island. Samsung has done a really great job of that under-screen technology. So basically like the front camera on a lot of their devices like you can't even see it. Like it just completely disappears and it just is so impressive to see in person. So I feel like when Apple has that perfected, then it's gonna be out and it'll kind of be more of a widespread thing where most other phone manufacturers will probably follow suit. So that looks like that's about all of the rumors that we have here on MacRumors. I'm obviously very excited for iPhone season. We still have a few months, so don't get too unsettled yet. We will have some more rumors coming out soon and, of course, I'll be keeping an eye on those as well. If there's anything else that you'd like to see me cover or if you have any rumors or leaks that you would like me to check out, feel free to leave them in the comments below or send me a tweet 'cause I'm always on Twitter. Thanks again for watching. If you haven't already, be sure to like, comment, and subscribe to my YouTube channel. I also have a full video on the iPhone 15 so if you wanna check that out, I'll put a link in the description and somewhere over here on the end screen. And with that friends, I'll see you in the next video, bye.",
    "transcript_keywords": [
        "Pro Max",
        "Pro",
        "Pro models",
        "iPhone",
        "Apple",
        "kind",
        "models",
        "Max",
        "Pro and Pro",
        "USBC",
        "Apple Watch",
        "Apple Watch Ultra",
        "feel",
        "rumors",
        "Ultra",
        "iPhone USBC port",
        "expected",
        "camera",
        "buttons",
        "USBC port"
    ],
    "transcript_entity_values": [
        "A17",
        "one",
        "USB-C",
        "up to 20",
        "USB 2",
        "5:00 AM",
        "those early start days",
        "Wi-Fi 6",
        "16",
        "Twitter",
        "5",
        "six",
        "Love",
        "MacBooks",
        "2023",
        "Taptic Engines",
        "2024",
        "Airdrop",
        "6x",
        "Macs",
        "15",
        "One",
        "the Space Zoom",
        "September",
        "the past couple of years",
        "YouTube",
        "Taptic Engine",
        "up to 40",
        "6.1",
        "RAM",
        "G Qualcomm",
        "eight",
        "Thunderbolt",
        "the Touch ID",
        "iPads",
        "A17",
        "Chinese",
        "a minute",
        "second",
        "Thunderbolt 3",
        "0.4 millimeters",
        "MFI",
        "the Dynamic Island",
        "Europe",
        "Justine",
        "iPhone",
        "the day",
        "Pro Max",
        "MacRumors",
        "Samsung",
        "9to5Mac",
        "this year",
        "10",
        "Ultra",
        "a few years",
        "480 megabytes",
        "ProRes",
        "USB",
        "Mophie",
        "USB-C.",
        "Pro and Pro Max",
        "3x",
        "Pros",
        "MacBook Air",
        "European",
        "Apple",
        "September 2023",
        "14",
        "2021",
        "Ultra",
        "Kondor Blue",
        "this past year",
        "Dynamic Island",
        "the MacBook Pro",
        "iPhones",
        "90 degrees",
        "daily",
        "3",
        "two",
        "iPhone Ultra",
        "2024",
        "a few months",
        "6.7-inch",
        "the Apple Watch"
    ],
    "transcript_entity_types": [
        "FAC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "DATE",
        "FAC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "TIME",
        "ORDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "LOC",
        "LOC",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "LAW",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "NORP",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "LOC",
        "FAC",
        "NORP",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG"
    ],
    "vector": [
        -0.06182945519685745,
        -0.08323530107736588,
        -0.008170075714588165,
        -0.07983992993831635,
        0.06423825025558472,
        0.0029142561834305525,
        -0.014170018956065178,
        0.028088893741369247,
        0.033884551376104355,
        0.07818043977022171,
        0.09990756958723068,
        -0.00887229386717081,
        -0.04713575541973114,
        0.06764347851276398,
        -0.0067194607108831406,
        0.05050709843635559,
        0.05351125821471214,
        -0.055640608072280884,
        0.006301750894635916,
        0.010974994860589504,
        -0.07279777526855469,
        -0.051052629947662354,
        0.068622887134552,
        0.038686685264110565,
        -0.017430271953344345,
        0.07239425182342529,
        -0.019303888082504272,
        -0.046013280749320984,
        -0.09524038434028625,
        -0.07194177806377411,
        -0.004169724881649017,
        -0.019985591992735863,
        0.06884969770908356,
        -0.032445549964904785,
        0.04031248390674591,
        -0.1035858690738678,
        0.03243950381875038,
        -0.0243789441883564,
        0.005214877426624298,
        -0.05043582618236542,
        0.014177839271724224,
        -0.028019869700074196,
        -0.0314735472202301,
        0.056825846433639526,
        -0.06506264954805374,
        -0.036523930728435516,
        -0.016738280653953552,
        -0.03697305917739868,
        -0.0056497445330023766,
        0.04072444885969162,
        -0.006305863615125418,
        -0.002125742379575968,
        -0.023459138348698616,
        0.07731588184833527,
        -0.08038218319416046,
        -0.022820159792900085,
        -0.05235958471894264,
        0.03131917864084244,
        0.09892110526561737,
        -0.01873893104493618,
        0.0258592888712883,
        0.010444993153214455,
        -0.053348470479249954,
        0.022412212565541267,
        -0.07108820229768753,
        -0.0514935739338398,
        -0.01923035830259323,
        0.006115826778113842,
        0.017868081107735634,
        0.04084321856498718,
        -0.07223249971866608,
        0.010974252596497536,
        0.0030393304768949747,
        0.012908466160297394,
        0.04544508084654808,
        0.05672124773263931,
        0.0028580985963344574,
        0.024005325511097908,
        -0.04454264044761658,
        0.027538470923900604,
        0.0034638913348317146,
        0.019440026953816414,
        -0.048938654363155365,
        -0.061796437948942184,
        0.056497763842344284,
        0.03596043959259987,
        -0.01434586476534605,
        0.03342456743121147,
        -0.031077850610017776,
        -0.07636168599128723,
        -0.0580139197409153,
        0.046500444412231445,
        -0.0044106957502663136,
        -0.013115992769598961,
        -0.042299576103687286,
        -0.022141719236969948,
        -0.015499018132686615,
        -0.0006432674708776176,
        -0.06821876764297485,
        0.007790769450366497,
        0.04762779548764229,
        -0.0662650614976883,
        -0.0028059110045433044,
        -0.0688713863492012,
        -0.06500614434480667,
        -0.11505267024040222,
        -0.059892017394304276,
        -0.03205173835158348,
        0.04264537990093231,
        0.06603193283081055,
        -0.005766102112829685,
        0.04140211269259453,
        -0.08132198452949524,
        -0.09806270897388458,
        0.003208314999938011,
        0.11062771826982498,
        -0.07400158047676086,
        0.046332620084285736,
        0.06878778338432312,
        0.0012908180942758918,
        -0.04877768084406853,
        -0.1012963280081749,
        -0.005575704388320446,
        0.013816216960549355,
        0.01426217332482338,
        -0.02899787575006485,
        -0.08591173589229584,
        1.0148218320117462e-32,
        -0.015118802897632122,
        0.038138967007398605,
        -0.0063001858070492744,
        0.038881707936525345,
        -0.04834405705332756,
        -0.03508711978793144,
        0.08499643206596375,
        0.08713312447071075,
        0.02258029580116272,
        -0.03697996214032173,
        -0.01043550856411457,
        -0.009594918228685856,
        -0.049065764993429184,
        0.00395621545612812,
        -0.01876181922852993,
        -0.018281444907188416,
        -0.03131170943379402,
        -0.06693337857723236,
        0.02434781938791275,
        0.013151095248758793,
        -0.0008554133237339556,
        0.00047245470341295004,
        0.015348566696047783,
        0.042076077312231064,
        0.07569272816181183,
        0.060081981122493744,
        0.03250206634402275,
        0.04015616327524185,
        0.11735286563634872,
        0.008076611906290054,
        -0.0851888433098793,
        -0.007958298549056053,
        0.019818810746073723,
        -0.08741127699613571,
        0.027425391599535942,
        0.061078544706106186,
        0.05544473975896835,
        -0.016103453934192657,
        0.04356623440980911,
        -0.02334664575755596,
        -0.026069849729537964,
        -0.020650699734687805,
        -0.05086731165647507,
        -0.0008284634095616639,
        0.10565876960754395,
        0.08127731829881668,
        -0.0222382303327322,
        0.039442047476768494,
        -0.05956020951271057,
        -0.01886121556162834,
        -0.015843074768781662,
        -0.043753061443567276,
        -0.058147281408309937,
        -0.003159133018925786,
        -0.02700089104473591,
        -0.046058740466833115,
        -0.051806773990392685,
        0.07281605899333954,
        -0.004246452357620001,
        0.048751626163721085,
        0.052754223346710205,
        -0.00821493286639452,
        -0.005989391356706619,
        0.020223848521709442,
        -0.0835506021976471,
        0.03498818725347519,
        0.03778652846813202,
        0.02060833014547825,
        0.038011156022548676,
        0.11485590785741806,
        -0.01570633240044117,
        0.02822048030793667,
        0.05775391310453415,
        0.008234820328652859,
        0.03294368088245392,
        0.045396238565444946,
        -0.04506269097328186,
        -0.04617863893508911,
        0.037499237805604935,
        0.014711614698171616,
        -0.1446731686592102,
        0.03775307536125183,
        0.0017054928466677666,
        0.08086133748292923,
        -0.0020651204977184534,
        -0.09176290780305862,
        0.0047002071514725685,
        0.0016675632214173675,
        3.5687484341906384e-05,
        0.04544839262962341,
        0.0035502114333212376,
        0.04618048667907715,
        -0.07530375570058823,
        0.035579927265644073,
        -0.03191457688808441,
        -1.0926235419256517e-32,
        0.028073638677597046,
        -0.008380104787647724,
        -0.008682982996106148,
        -0.036953456699848175,
        -0.01204811129719019,
        -0.04753322899341583,
        0.02328033372759819,
        0.061811413615942,
        0.07059423625469208,
        -0.06221596151590347,
        0.07841798663139343,
        -0.07972335070371628,
        -0.09975353628396988,
        0.06318287551403046,
        -0.048715054988861084,
        -0.06138814613223076,
        -0.12303270399570465,
        -0.07577969878911972,
        0.0827498510479927,
        0.03404064476490021,
        0.05755338445305824,
        0.0748085007071495,
        0.07833483070135117,
        0.02613050676882267,
        -0.0035509124863892794,
        -0.00631243409588933,
        0.02564806304872036,
        0.047940921038389206,
        0.0392916165292263,
        -0.006556371692568064,
        0.035543087869882584,
        -0.09457962214946747,
        -0.024403853341937065,
        -0.004594793077558279,
        0.04183978587388992,
        0.03479493781924248,
        -0.010000900365412235,
        0.007752246223390102,
        0.025285162031650543,
        -0.09799692034721375,
        0.07277624309062958,
        -0.0019200504757463932,
        -0.01014654990285635,
        -0.017675478011369705,
        0.017295747995376587,
        -0.06374002248048782,
        -0.0555884912610054,
        0.02784580923616886,
        0.0753941684961319,
        0.011216104961931705,
        -0.0011340270284563303,
        -0.052047595381736755,
        -0.06857199221849442,
        0.03121512196958065,
        -0.06646626442670822,
        0.015601868741214275,
        -0.012492459267377853,
        -0.013047469779849052,
        0.0532224141061306,
        0.03261988237500191,
        0.0634259507060051,
        0.012893706560134888,
        -0.03768420219421387,
        -0.1028662919998169,
        -0.00858038105070591,
        -0.039054788649082184,
        0.06766945868730545,
        -0.004763564560562372,
        0.01812874712049961,
        0.07270008325576782,
        -0.03469887375831604,
        -0.010020178742706776,
        0.005780842620879412,
        0.011938132345676422,
        0.033844295889139175,
        0.02446792647242546,
        -0.06223370507359505,
        -0.0026241836603730917,
        0.05860698223114014,
        -0.04254966974258423,
        -0.015449775382876396,
        0.05943585932254791,
        0.0274948813021183,
        0.015497665852308273,
        0.09812676906585693,
        0.12168703973293304,
        0.06893157213926315,
        -0.023047829046845436,
        0.052028704434633255,
        0.08624481409788132,
        0.02413458563387394,
        0.020128095522522926,
        0.029931537806987762,
        0.12164449691772461,
        -0.1154770478606224,
        -5.634617394889574e-08,
        0.04317965358495712,
        0.05153247341513634,
        -0.02866438962519169,
        -0.04094987362623215,
        0.0014557527611032128,
        -0.10020888596773148,
        -0.052328795194625854,
        0.029205769300460815,
        0.12952984869480133,
        -0.0030537203419953585,
        0.05623096972703934,
        -0.01825057342648506,
        -0.02347918599843979,
        0.08886930346488953,
        0.054712675511837006,
        0.018745042383670807,
        -0.03411324694752693,
        0.02963300049304962,
        0.011149264872074127,
        -0.11361035704612732,
        -0.04757487773895264,
        0.06901182234287262,
        0.014895671978592873,
        -0.03689367324113846,
        0.03927146643400192,
        -0.039738286286592484,
        -0.06559856981039047,
        0.0021815807558596134,
        0.01376179326325655,
        -0.03678968548774719,
        -0.04116341471672058,
        -0.035279422998428345,
        0.03770020604133606,
        -0.03261036425828934,
        -0.0009249618160538375,
        -0.01811208948493004,
        -0.03840416669845581,
        -0.06048228219151497,
        0.019762344658374786,
        -0.015136810019612312,
        -0.0049448576755821705,
        -0.11108673363924026,
        -0.05825958028435707,
        -0.0376860573887825,
        0.024648824706673622,
        -0.10641364008188248,
        0.0055479565635323524,
        -0.04099533334374428,
        -0.019995126873254776,
        0.067415751516819,
        -0.09872772544622421,
        -0.017472466453909874,
        0.03076423704624176,
        -0.09754946082830429,
        0.08728127926588058,
        -0.007112731691449881,
        0.005307291634380817,
        0.0310018602758646,
        -0.09227411448955536,
        -0.03865174949169159,
        0.03362393006682396,
        -0.04338424280285835,
        0.011810531839728355,
        0.07478029280900955
    ]
}