{
    "id": "D31MyxVcuag",
    "title": "The GPU Market Just Got Better",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-03-04T19:07:28Z",
    "video_url": "https://www.youtube.com/watch?v=D31MyxVcuag",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 49933,
    "likes": 2101,
    "comments_count": 141,
    "description": "Intel is releasing new GPU's later this year We Tried WISH for Rich People:  Kanye's $200 STEM Player - Donda 2:  Weirdest Amazon Reviews:  Steam Chromebook:  Steam Deck Doesn't Suck:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Do you know whats inside? 0:14 Intel GPU announcement 0:52 Intels Plans/Release Roadmap 1:14 I have doubts about that.. 1:53 Can Intel stand up to AMD/nVidia? 2:24 Should we switch to team blue? 2:58 Spec Speculation 3:20 This is great news for gamers 3:41 If they suck 4:12 Dont buy until Gen 2/3? 4:37 I want this to succeed. 5:06 Will this help GPU prices? 6:21 The story of 2022 for graphics cards 6:55 This is a long-term project 7:52 AMD memes 8:32 Beggars cant be choosers 8:52 These battles are not fought on shelves 9:33 I think they have a really good shot.. 10:05 What do you think?",
    "description_links": [
        "https://youtu.be/sPOu5YN7X94",
        "https://youtu.be/xBFEPJAZDy4",
        "https://youtu.be/i503_pf17R8",
        "https://youtu.be/7awtSj4OCeo",
        "https://youtu.be/zbNRbCtO-Cg",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- Hey, Matt? - What's up? - You know what's inside? - What's inside? - Intel. - God, dammit Hello and welcome to this is the GPU market has a ray of sunshine in front of it because we have a savior in the market and it's Intel. - So Intel has been making graphics for a very long time right? They've had their integrated graphics, which have been bad to mildly okay, to fairly decent these days. And the fruits of that labor are about to be upon us friends. So take your scalp 3090s and throw 'em in the trash. Take your RTX 9,000 series that's coming out soon and forget about it. - Or maybe don't do that because you guys all did that with your 20 series and then no one had GPU's for a while because they're like oh, I'm gonna sell my 20, I'm gonna sell my 2080 because I'm gonna get a 3090 - That was the way it was for so long Matt and then - Then no one had GPUs forever. - So what Intel is doing here is essentially at least from what we know, scaling up in a fairly big way their existing graphics architecture, right? So obviously it will be different. It's not like they're just taking the integrated graphics from a laptop and, you know doubling it and turning up clock speeds. They're working on the first generation of their arc GPU which will be launching this year. - I have doubts about that. - You don't think it's coming out this year? - Uh, if you, - Or, you think it's gonna be bad? - So originally what was supposed to be, the road map was what they announced in August was Q1 for notebook GPUs. - Yep. - Q2 for desktop - Yep. - Q3 for workstation. - Yes. - I don't think they're gonna hit that. And I think they're just gonna be delayed in general best case scenario. We maybe get Q4 cause we've seen nothing. The only thing we've seen is them showing it off with a game from 2018, they showed it off with Tomb Raider. So like, you know, the fact that we have no specs, we have no nothing. And I think it's more realistic that it's gonna be kind of next year that we start seats things really roll out. - This is a very difficult task to bring a brand new GPU to the market. I mean, this is difficult for AMD and Invidia and they've had decades of experience with this and mind you, Intel's not not coming into this completely blind. They have been creating graphics. So that has given them a huge leg up but going from integrated graphics on a laptop compared to dedicated GPU is a very big stretch. They started this work in artist a few years ago and we're really just starting to see what's coming out. So I think we have to have a little bit of a tempered expectation. First and foremost, they're going to take multiple generations to truly catch up. We're not gonna see an Intel GPU this year which is gonna go blow away the RTX 3090 and the RX 6950 XT. It's not going to happen. I think what we will see is laptop GPU shipping which will be mid-range and fine. There will almost certainly be some issues whether they are not super competitive on like power or performance or price, like I'm sure they're not gonna completely nail it right outta the box but I'm sure it will be okay this year. They also will have GPUs for desktops at some point probably later in the year. I agree. I think they're maybe not gonna hit that Q2 timeframe but I do think you'll be able to buy an Intel dedicated GPU slap it in your system. And based on a lot of the rumors you're gonna be getting mid range performance. So think something like maybe a 3060, or a a 66 hundred XT or something like that like it's hard to say exactly where it's gonna be but like decent mid range I think is what I expect for this year with this first generation of Intel - It's, it's tough because I want this to happen so bad because another, you know, competitor in the GPU market is just, is great for the consumer. - Yes. - You know, it's been Invidia and AMD for so long. - Yeah. - You know - It's gonna spice things up. - It's it's gonna spice things up. It's okay. If they're not amazing right out the gate. - Sure, sure. - But they have to be good enough for a handful of people to catch on because if they suck out the gate, it's gonna be it's gonna be impossible for them to get traction. - There's a few ways they can handle that though. Number one, they could have enough of these things to just put on store shelves at MSRP that by itself, even if they are sort of mid range issues - That is, would be a huge huge advantage for them. If they actually could say \"we can keep these in stock\". - Yeah. I'm a firm believer especially in the PC market, most products if they have a good price will make sense, right. A GPU, even if it's super power inefficient, if it's at the right price, it will make sense for some people. They also, I think what is an interesting things is they have a roadmap. So they pretty much already said in the roadmap that this first generation is not gonna be amazing. Right. They're targeting gen two and even gen three before they're able to go for, what do they call it? The ultra enthusiast segment. Which would be like 3090 and - Yeah. People are yeah. Comparing to 3090, 39 TI whatever. But I think it's actually gonna be compared to - The 5090 - 6090. Yeah. Like exactly. Like, I don't know, like it, I, I just, I want this to succeed. Because again I want there to be more options out there because just having the two companies right now it's worked, but it doesn't, - Well you've seen what happened. AMD recently just brought out that new GPU and everyone was just absolutely roasting it because it is by all intended purposes, weak and slow and terrible. But because there's no competition and no one can get cheap GPU on the market, get it's still worth it. It's still a product that is selling even though it shouldn't because it's - Agree. Here's the problem that they're gonna that Intel's gonna run into is everything still comes from TSMC - And that's one of the big differences with this project because Intel is actually not creating the GPU. They're designing it, but they're sending it to TSMC to be manufactured. - Do you think that they can leverage all of their Intel chips? - Yeah. - As a way to say like, oh we're gonna jump the line a little bit. - No, no - Cause the same way that cause like app that's what apple does. - Yeah, but Apple is years and they're paying way more. I think Intel is getting in line and they're gonna get just as many GPU off the line is AMD or anyone else can probably less because AMD has the track record and probably order way more. Even with this sort of early generation of Intel chips it will help these GPU will hit the market. But I mean, by some estimates, this could be maybe like an additional 10% GPU supply for the year which is not nothing it's gonna help but 10% we need way more than 10% more GPU to be able to catch up and to really sort of make sure that these things are on shelves that MSRP the way that they were back in you know, 2018, 2019. So I think this almost, I don't wanna say it's a drop in the bucket because it is an important first step and it will be, I think if they get the price right. A good product for a lot of people But this is not the cure to the GPU shortages that we're seeing in the market. I almost think that what is gonna tell the story of 2022 for graphics cards. And if you can actually get your hands on one for less than an arm and or a kidney is gonna be the fact of crypto prices staying low more so than Intel because you know that the first product is never gonna be great. But if it is okay, they can actually keep it on shelves. And the price is reasonable. This will be a success. And they already have generation two and generation three on the way, right? Like they are well into like, generation two is probably already done. Like they're probably working on generation three of kinda like finalizing the design and stuff which is gonna come out in 2024, 2025. But the thing is, this is a long term project. You can't judge Intel's GPU by the very first thing they come out. Obviously you can make the decision to buy or not. And of course we all will. I'm sure we'll talk more about it once we actually get our hands on it. But the thing is, this is the first step. It is an important step with the way that the market is right now, because it is every GPU that hits the market is only a good thing for gamers and for people who want to build PCs but you gotta to think the long game on this. And if this is okay, generation two will probably be pretty good generation three might be great. We'll have to see but there's no scenario in which this is going to be a bad thing for gamers because the more choice we have, The more competition when Intel and AMD actually have to fight not only just each other and going just, you know back and forth, but they actually have to consider, oh Intel's gonna come in and undercut or they're gonna have some crazy new thing or whatever the case is. - And that's why I think they have, this has to be at least okay. Like it cannot be trash. That's really? - Yes. - Like if it is trash - Game over. - Gamers, write it off. Consumers are very quick to judgment of like, if it's something's not amazing out the gate, it's it it hardly ever catches on when AMD bought ATI and the radiant cards. No one, no one wanted to buy those. They, they wanted to just get the Invidia cards cuz those were perceived better. And it's, we're just now seeing people being like okay, you know, the, the AMD cards are viable but it's still, there's still a, there's a - There's a Stigma. There's a stigma. It's hard to get around that. - No one's first choice is an AMD card. You know, we get in our DMS constantly, oh can I please have a free PC? And not only do you have saying, can I have a free free PC they will specify, they specify the specs of what they want. I have never once seen someone say can I get a free PC with an AMD card? - I guess that is a good, good point. - Look, if someone, if someone is picking you, I'm not saying AMD cards are bad, I have an AMD card. It's great. But most people, if given the choice prefer to go with an in Invidia card. - Yeah. - And it's, it's about perception. These battles are not fought on shelves. They're fought in like Reddit, sub Reddits and things like that. Or someone's like, oh yeah, I got the I got the new Intel card and you know maybe the specs on paper aren't as good as - 180 bucks. And I was able to find it on a store shelf. - Right. I was able to get it. I grabbed, you know, I took a chance on it and I was able to play my games at, you know on this first generation I was able to play at 60 FPS locked at medium, those types of Reddit posts and like and stuff like that. That's where these, these cards win these battles. But if it's like, oh yeah, I took a chance on this thing. I'm at low settings and barely getting 40 FPS, whatever. All takes is one of those posts for no one to ever wanna buy that again. So as long as Intel comes out with something that is decent - Yes. - I think they have a really good shot and I think that's really good for consumers - Decent and aggressively priced. I think those are my two benchmarks for what's gonna happen. Laptops are gonna be one thing. Obviously those get bundled, blah, blah, blah. Like, we'll see how that goes. But when they actually have the desktop GPU coming out at some point this year, I'm gonna be super interested to see the performance level versus the price level that they are targeting if they get it right. I think it could be a big, big win, but there's a lot of ways that they could get that wrong. But let us know what you think in the comments below make sure to like subscribe Ringling the dingling button. And pre-order our brand new, this is GPUs which are promised to be 17 times better and 45 times cheaper, just PayPal, Matt, your life savings. And I'm sure it'll be available - All $6 of it. - Can I say actually, you know what? I don't think I can say that. I think that's actually gonna get me in trouble. - Yeah. And especially, because I feel like that's something that leis would actually do is to make a aligns GPU - LTT store.com/gpu.",
    "transcript_keywords": [
        "GPU",
        "Intel",
        "Intel GPU",
        "AMD",
        "Intel dedicated GPU",
        "judge Intel GPU",
        "generation",
        "GPU market",
        "Yeah",
        "AMD card",
        "GPUs",
        "thing",
        "market",
        "year",
        "good",
        "things",
        "AMD cards",
        "graphics",
        "dedicated GPU",
        "cards"
    ],
    "transcript_entity_values": [
        "next year",
        "2080",
        "Q4",
        "ATI",
        "2022",
        "one",
        "AMD",
        "Tomb Raider",
        "Apple",
        "Ringling",
        "XT",
        "5090 - 6090",
        "GPU",
        "three",
        "AMD",
        "10%",
        "66 hundred",
        "Reddit",
        "39",
        "FPS",
        "an additional 10%",
        "XT",
        "later in the year",
        "60",
        "9,000",
        "Matt",
        "45",
        "3090",
        "a few years ago",
        "years",
        "6",
        "17",
        "Reddit",
        "20",
        "TI",
        "3060",
        "TSMC",
        "2024",
        "two",
        "Invidia",
        "DMS",
        "this year",
        "2019",
        "these days",
        "2018",
        "MSRP",
        "Q2",
        "RX",
        "2025",
        "decades",
        "first",
        "3090s",
        "Intel",
        "PayPal",
        "Invidia",
        "the year",
        "more than 10%",
        "August",
        "First"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "DATE",
        "ORDINAL"
    ],
    "vector": [
        -0.06967039406299591,
        -0.02852117270231247,
        0.03252463787794113,
        0.0051827700808644295,
        0.05167090520262718,
        -0.006631384138017893,
        -0.01355692371726036,
        0.047102101147174835,
        -0.030224166810512543,
        -0.02607138827443123,
        -0.053369246423244476,
        0.029223667457699776,
        -0.021323803812265396,
        -0.010175186209380627,
        0.005559266544878483,
        0.044434819370508194,
        0.07378514856100082,
        -0.10592900216579437,
        -0.08206506073474884,
        -0.032344311475753784,
        -0.049072615802288055,
        -0.041181787848472595,
        -0.024220943450927734,
        -0.010874161496758461,
        -0.01533977035433054,
        0.06269118934869766,
        0.05514323711395264,
        -0.0659399926662445,
        -0.02048574760556221,
        0.05193622037768364,
        -0.01044697966426611,
        0.049266230314970016,
        0.066319540143013,
        -0.0029851438011974096,
        0.001673780265264213,
        -0.08237561583518982,
        0.03561420366168022,
        -0.04747018963098526,
        -0.01856059581041336,
        -0.03377896174788475,
        -0.0452142134308815,
        -0.06302955001592636,
        -0.04305736720561981,
        0.1006728932261467,
        0.05173518508672714,
        -0.04419545829296112,
        0.034066297113895416,
        -0.08085764944553375,
        -0.0032294122502207756,
        0.012125737965106964,
        -0.06349131464958191,
        -0.07048527896404266,
        0.0019349929643794894,
        -0.048061300069093704,
        -0.07941889762878418,
        0.07118883728981018,
        -0.04762611165642738,
        -0.07204892486333847,
        0.07946620136499405,
        0.029614048078656197,
        0.04591722786426544,
        -0.11747930198907852,
        0.017698654904961586,
        0.029280705377459526,
        0.04700903221964836,
        -0.0465828962624073,
        0.04184872657060623,
        0.019889021292328835,
        -0.025045447051525116,
        -0.005408450495451689,
        0.08752378076314926,
        0.011625802144408226,
        0.021371496841311455,
        -0.08156760782003403,
        0.016571838408708572,
        0.04321527108550072,
        0.04491068795323372,
        -0.06408484280109406,
        0.07391050457954407,
        -0.04129597917199135,
        0.03044000267982483,
        -0.07589257508516312,
        0.04861602187156677,
        -0.070203997194767,
        -0.026221586391329765,
        0.009059777483344078,
        0.03413579240441322,
        0.006961056962609291,
        0.005101232789456844,
        -0.053720127791166306,
        -0.039716437458992004,
        -0.004759914707392454,
        0.05846872553229332,
        0.046466559171676636,
        0.07673045247793198,
        0.08380325138568878,
        -0.015220948494970798,
        -0.10840430855751038,
        0.0012414196971803904,
        0.06232508271932602,
        -0.017902392894029617,
        0.07263647019863129,
        0.031391993165016174,
        -0.015256905928254128,
        -0.0390545129776001,
        0.021824782714247704,
        -0.05260495841503143,
        0.12060397118330002,
        -0.020738014951348305,
        0.04413056746125221,
        0.049159448593854904,
        0.03360513597726822,
        -0.009279200807213783,
        -0.008678914047777653,
        0.0006417529075406492,
        0.01945595070719719,
        -0.030541256070137024,
        0.04107194393873215,
        0.05502931773662567,
        0.12381289154291153,
        -0.025789042934775352,
        0.0027653949800878763,
        -0.0013256476959213614,
        0.03613637387752533,
        0.0159212164580822,
        0.00513829430565238,
        -0.09985138475894928,
        3.869866625519146e-33,
        0.031300630420446396,
        -0.011188746429979801,
        -0.05482829734683037,
        0.005213117692619562,
        -0.014425874687731266,
        0.009308409877121449,
        0.0032264646142721176,
        0.0051383646205067635,
        -0.02370736561715603,
        -0.004729793407022953,
        -0.026368189603090286,
        0.006039186846464872,
        -0.03459750488400459,
        0.06723911315202713,
        0.06286945939064026,
        -0.10503143072128296,
        -0.012174337171018124,
        0.01092764176428318,
        -0.0112144248560071,
        0.07207322865724564,
        0.026613594964146614,
        0.07202117890119553,
        0.01849357783794403,
        -0.08362066745758057,
        -0.016372235491871834,
        0.004317883867770433,
        -0.048686519265174866,
        0.008399371057748795,
        0.05545895919203758,
        0.03074108622968197,
        -0.0013082841178402305,
        -0.06960354745388031,
        -0.10047246515750885,
        6.127009692136198e-05,
        -0.008371873758733273,
        0.0028010618407279253,
        -0.03565314784646034,
        -0.055139344185590744,
        -0.038284629583358765,
        0.009691393002867699,
        -0.0456712581217289,
        0.12130068987607956,
        -0.09661999344825745,
        -0.06212086230516434,
        0.015712974593043327,
        0.06719869375228882,
        0.027397749945521355,
        -0.097151018679142,
        -0.05820653587579727,
        -0.015687424689531326,
        -0.10641060769557953,
        0.07389132678508759,
        -0.017116526141762733,
        0.009197810664772987,
        0.023434406146407127,
        -0.08886794745922089,
        0.03318367525935173,
        -0.016422446817159653,
        0.09961340576410294,
        0.08415842056274414,
        -0.05272931233048439,
        0.020607231184840202,
        -0.04632006585597992,
        0.028148427605628967,
        -0.12367255240678787,
        0.07685317099094391,
        0.05370047315955162,
        0.09950132668018341,
        -0.10988439619541168,
        0.007914382964372635,
        0.003339508082717657,
        -0.027891185134649277,
        -0.0037553487345576286,
        -0.028485318645834923,
        0.03394706919789314,
        0.01721128262579441,
        -0.003163351910188794,
        -0.04339763894677162,
        0.00693551916629076,
        -0.021467765793204308,
        0.010033483617007732,
        0.016901498660445213,
        -0.005714633502066135,
        -0.005416492000222206,
        -0.0195612870156765,
        0.01815471611917019,
        -0.026802126318216324,
        0.007070187944918871,
        0.028577184304594994,
        -0.0649518221616745,
        -0.10910507291555405,
        0.01112802792340517,
        0.011719895526766777,
        0.06818672269582748,
        0.026394713670015335,
        -5.175517588336231e-33,
        -0.008900029584765434,
        -0.016921168193221092,
        -0.016172736883163452,
        0.11128287762403488,
        0.017264321446418762,
        -0.049601517617702484,
        0.04450196027755737,
        -0.026821140199899673,
        0.067889004945755,
        -0.0006394904921762645,
        -0.018666762858629227,
        0.12240862846374512,
        0.0007894934387877584,
        0.0516374446451664,
        -0.02553577721118927,
        -0.0738159716129303,
        -0.005397118162363768,
        -0.09348747879266739,
        -0.009196871891617775,
        0.000917369092348963,
        0.011122466996312141,
        0.07962948083877563,
        -0.1125560998916626,
        0.038082320243120193,
        0.054022710770368576,
        0.0736013725399971,
        -0.010692309588193893,
        -0.06273335963487625,
        0.04055939242243767,
        0.011524521745741367,
        0.027597326785326004,
        -0.04595146328210831,
        -0.0034377926494926214,
        0.041624780744314194,
        0.11232183873653412,
        0.008160550147294998,
        0.03049769625067711,
        -0.013847564347088337,
        -0.08958429843187332,
        0.056107375770807266,
        0.0852842703461647,
        0.010524285957217216,
        -0.004367408808320761,
        0.0049819340929389,
        0.006222894880920649,
        0.08671382814645767,
        0.02213538996875286,
        -0.0026854814495891333,
        0.06059427931904793,
        -0.011276879347860813,
        -0.030892467126250267,
        0.00159737141802907,
        0.010076083242893219,
        -0.0295417420566082,
        -0.012793762609362602,
        -0.13639725744724274,
        -0.022098975256085396,
        0.042150285094976425,
        -0.051355499774217606,
        0.029405886307358742,
        0.03656184300780296,
        0.018594222143292427,
        0.024370457977056503,
        -0.05247874930500984,
        -0.010317427106201649,
        -0.018086766824126244,
        0.006498075556010008,
        0.0007686626049689949,
        0.026423003524541855,
        -0.05241060629487038,
        -0.10374600440263748,
        -0.10473068058490753,
        -0.08364292234182358,
        -0.07601463794708252,
        -0.08450964093208313,
        0.07315114885568619,
        0.058737821877002716,
        -0.06207647547125816,
        0.02380499057471752,
        -0.015722205862402916,
        -0.006083235144615173,
        -0.013530283235013485,
        0.04992733150720596,
        -0.013030609115958214,
        0.06670188158750534,
        -0.009964683093130589,
        0.02450183592736721,
        -0.0026937469374388456,
        0.035021040588617325,
        -0.06474187225103378,
        -0.05800256505608559,
        0.0023750062100589275,
        -0.01964404433965683,
        0.01635918952524662,
        -0.06367196887731552,
        -5.637838640382142e-08,
        0.03760959208011627,
        -0.02445055916905403,
        0.06314858049154282,
        0.09699883311986923,
        0.02172488160431385,
        -0.06330396234989166,
        0.007939597591757774,
        -0.013314587995409966,
        0.07028598338365555,
        0.08357538282871246,
        0.06481991708278656,
        -0.03140772134065628,
        -0.05012495070695877,
        -0.02574065327644348,
        0.027225200086832047,
        0.06784620881080627,
        -0.04531395807862282,
        -0.02026543766260147,
        0.04051933437585831,
        -0.0365818552672863,
        -0.018619926646351814,
        0.02074122615158558,
        0.09118565917015076,
        -0.06459701061248779,
        -0.09059681743383408,
        -0.011958976276218891,
        -0.029901910573244095,
        -0.02251364476978779,
        0.0008156141266226768,
        0.05385861545801163,
        -0.008885836228728294,
        -0.028548773378133774,
        0.0017488988814875484,
        0.003402312519028783,
        0.07932879030704498,
        -0.13701480627059937,
        -0.009406398050487041,
        0.09586373716592789,
        0.09435522556304932,
        0.007523003499954939,
        -0.022794034332036972,
        -0.02315945364534855,
        -0.009445537813007832,
        0.016294678673148155,
        -0.0030470811761915684,
        -0.027573755010962486,
        -0.05900198593735695,
        -0.01919526234269142,
        -0.029198240488767624,
        -0.030703535303473473,
        -0.04691106826066971,
        -0.019144142046570778,
        -0.04006726294755936,
        0.06089502573013306,
        0.09097503125667572,
        0.055580608546733856,
        -0.05207276716828346,
        0.03125111386179924,
        -0.009784113615751266,
        -0.04476066678762436,
        0.0558660514652729,
        -0.11833225935697556,
        -0.06136023998260498,
        -0.004011074081063271
    ]
}