{
    "id": "D5Gc-avkJ2Q",
    "title": "DJI made some MAJOR improvements - Air 2S",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-04-15T13:04:00Z",
    "video_url": "https://www.youtube.com/watch?v=D5Gc-avkJ2Q",
    "category": "Science & Technology",
    "tags": [
        "DJI",
        "Mavic",
        "Air",
        "Air 2S",
        "5.6K",
        "4K",
        "1080p",
        "Drone",
        "Quad Copter",
        "Vehicle"
    ],
    "views": 214330,
    "likes": 11981,
    "comments_count": 601,
    "description": "Get 20% OFF + Free Shipping @Manscaped at    The DJI Mavic Air 2 was pretty impressive, but the new Air 2S, well this is a whole new ball game.   Check out the DJI Air 2S at   Buy DJI Mavic Air 2 On Amazon (PAID LINK):  On Newegg (PAID LINK):  On BHPhoto (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://manscaped.com/CIRCUIT",
        "https://lmg.gg/WJeu1",
        "https://geni.us/OY5vyWY",
        "https://geni.us/Mv0QL",
        "https://geni.us/cfxW",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Ha! This is the Air 2S. It dropped the Mavic naming, it's just the Air 2S now and this is the whole package. It comes with the batteries, the charger, it's got a bag now. I got to say, this is a huge improvement on the Air 2. Maybe not huge huge, but it's good. It takes all of the shortcomings of the Air 2 and it brings it up to a whole 'nother level but let's first show you what we got in the bag. There's some nice die cut foam pieces, and here she be. You can see some initial upgrades. It's got a much, much larger sensor and it's got upward facing cameras. We have battery number one, battery number two, and the charger. If I remember correctly, this is the handiest thing that I didn't get in the old package. It gives you USB ports by plugging in one of your spare batteries or if you're like me and you fly half a battery and then you can use it to charge your devices while you're doing other things. Like so. Neat. We have the DJI remote. It's very similar to the old remote and actually the FCC IDs on both of these are the same, which tells me they're the same remote. But the difference here is this one says Tripod and this one says Cine. And if that tells you anything, it means this is for making videos. Before I get into the heart of things here I got to tell you about my sponsor, Manscaped Manscaped's performance package kit has everything you need to stay groomed from head to toe. It features their new Lawn Mower 3.0 waterproof trimmer with skin safe technology, as well as their Weed Wacker ear and nose trimmer for those tricky areas. For a limited time, you can get the kit plus two free gifts. The Shed Travel Bag and the Manscaped Anti-Chafing Boxer Briefs. Go to manscaped.com/circuit for 20% off and free shipping. We're first going to look at the sensor which is the big change here. Look at the size, absolute units. So this has a 1/2-inch sensor and it does pretty well. It's a 48 megapixel sensor but it can only receive so much light on a little 1/2-inch size sensor. This guy is 20 megapixels but that's not the important part. This is a 1-inch sensor and the bigger the sensor on the camera is the more light it can receive. In lower light situations, say you're flying where there's a shadow on one side of a mountain and sun on the other side, you have more dynamic range meaning you can see everything without losing the highlights or the low lights. A quick start guide which, not that I haven't read it. I know you guys got cranky last time I threw away manuals so I did read it. Safety advice, follow safety regulations. That's a FAA Part 107, if you're in the U.S. We've got prompts and these appear to be the same prompts that came with the Air 2. I thought they were lower noise prompts but they're just really quiet prompts. There is a USB-C the USB-C if you're an Android user or USB-C to USB Micro but DJI really markets these devices towards iOS users. So it comes with a lightning cable in the controller. We have a USB-C to USB-A cable for charging your remote or you can read directly off the drone but you have to have it turned on. The best thing about this drone, this thing is so tiny for the quality of footage it gives you. And when we got the Air, it was just a drone, a charger, and one battery which was a little difficult to deal with. Because these are coming as full packages, this has a set of, look at this four lovely ND filters. It comes with ND filters. - [Brandon] That's amazing! - This killed Brandon when we were shooting the first DJI video that we, we couldn't find ND filters. DJI didn't have them in stock yet. We had to get 'em third party. It was a nightmare. Grab the gimbal gently, twist. Off that comes, and then you can check on any of the filters. In fact, if you're recording high FPS or high resolution stuff off of this drone, you can't use all of the features all the time. Things like ActiveTrack, or I think spotlight also. You can't use if you're recording and say 5.4K, which this one can do. The old drone was down to or the Air2 was down to 4K/60. This one would do 4K/60 and 5.4K/30 which is more cinematic in the sense that you can record a larger image. And then if you want to punch in digitally you're still above 4K and it makes your filming experience a little bit nicer on the editing side of things. Underneath, we have a spotlight. So at night or in twilight, you can land with your light and you can see what you're doing. We have two sensors at the bottom, two sensors at the back and then we have four sensors up front. So two front facing, two upwards facing where if I had those upwards facing sensors, it would have prevented this. (grumbles) The obstacle avoidance in-flight or APAS 4.0 with this drone indicates that there are four directions that is sensing. The higher spec drones will have more obstacle detection but four directions is more than enough. I actually had a couple instances where I came in really really close to some irrigation piping in a farm that I was on this weekend. And the drone stopped itself from crashing. And I'm grateful because I brought it back in one piece and it's not mine. I'm sure Linus is very happy with that. (laughs) Orange tips, very LTT. Approved. As far as flight time is concerned, it did decrease a little. There's a 3-minute decrease in flight time but that's still 31 minutes. 31 minutes is more than long enough to make like time-lapses, which is something I can't do with the drones that I make and fly. This thing is so stable in the air that I, I did some hyper lapses this weekend of cows moving across a field. It is inspiring how stable the footage is. And these batteries are fancy, they have a little computer board in them that if you keep a light bulb battery charged too high, it's kind of like filling up a balloon beyond its limit. It starts to stretch out after a while These batteries are intelligent meaning they will decharge themselves if they're just sitting in a bag for too long and they'll bring them back down to a safe capacity to save your battery time. Oh, hello? - [Jono] It's like a computer. Yeah, it is a computer, there's active cooling in here. Drone's set up is the same. You can pull the two sticks out of the bottom, screw them in, plug it in and power it on. Oh, they did improve some things. Oh, yes. I don't know if you can see that but they had a digital zoom right on here. If you tap and hold you can change where the gimbal is pointing. We can point it at our lovely Brandon or maybe Jono. Oh, wait, wait. We can, we can punch in more. So we're at 4K/30 right now, we can change to 1080p/30 and there, there's 8X. That is quite the zoom. It's wild. Like, it's truly incredible to fly this thing. And I, flying here in the city, doesn't do it any justice. We're going to throw up some clips of a, of a cattle ranch I was on this weekend and I'm very excited to show it off. And you'll see the dynamic performance when we're flying like in mountain, where there's shade on one side and sun on the other, this thing performs way better than the tiny little sensor on the Air2 does. Okay. So, just the drone, one battery and a charger is a thousand dollars. And then the combo kit which has three batteries, the bag, ND filters. I don't know why anyone wouldn't buy that for an extra $250. If I were you, I would buy the bag. So, some changes to the software include adding the Pro button in the bottom right corner. So you can adjust all your white balance, your resolution in FPS, check your storage and change storing from the on the SD card or storing on the drone. There is 8GB of storage on the drone, just in case you forget an SD card and you need the shot. And you can try. So, I usually leave it Auto. But if you're say coming out of a shaded area into a light area, it's good to lock that down and your EV and bop it up or down. This is where the DJI side of things really shows its worth, is good hardware is nothing without good software. The whole package here is, is what you're buying. You're buying into the software that works, even if it does update a lot. I mean, they're always adding new features and it's continually getting better. When I fly the drones that I build myself, they are bare-boned. It's like throwing a V8 in a tiny car and it's, it's a handful. Flying this is so easy. I could put this in the hands of anyone, I could put this in the hands of my mom and say, you know pull the sticks together and then put it up in the air and it will fly itself, it will land itself. It is so easy and that's where the DJI wins, for me. And there are a variety of other settings in here too. And one of them is Color so we can switch to filming in D-Log. So, if you're grading your footage down the line, D-Log provides a better dynamic range, better gradation in your highlights in the shadows. There's also HLG and MP4 or MOV for your formats. Oh, one other thing is this has OcuSync 4.0 or I think it's just called OC 4.0 now. It's a improvement on their OcuSync technology which is their digital transmission. So they've added two more antennas and they've extended the range to about 12 kilometers on this drone. And I took it out - (laughs) Yeah. I took it about 6K out and I was still getting like full frame rate, full resolution. And I also took it beyond the limit. I flew beyond line of sight, down a cliff and the GPS like, auto-returned to home, kicked in and it flew up to 120 meters and returned back to home, and it came back into GPS range. If that was on my drone, it would have fallen out of the sky and down into the Columbia river. This is neat. I haven't seen this before. So, it dynamically switches channels, radio channels. And you can see it's picking up all the RF interference that's around us and picking the best channel to broadcast on. So if you fly near a cell tower or power lines, you'll get RF interference, even big steel buildings. That is so neat. Down the bottom, we have ActiveTrack. Can't use it cause we're not flying. So, ActiveTrack will actively follow you. And if you run down a hill, it'll follow you down. Spotlight, I can grab onto a thing. And if I move the drone, it stays fixed on that thing. You can see the gimbal doing work right here. If you follow DJI on Twitter, you might've seen their April Fool's joke about MasterShots, where you could rent a DJI team with a camera and and they'd come out for 24 hours to 7 days. Well, that was a joke but there are MasterShots on this drone. So they're pre-built cinematic shots that you can just apply to your scene. You pick whichever one you want and it will automatically do the, do the flight whether you're waypoint to waypoint, or tracking an object. Essentially, MasterShots take the hard part of taking the video off the drone, does it all for you, plops it on your phone and you can throw it to whatever social media you want. And that is the sort of feature that could get my mom to fly drones. I should get my mom to fly this. It would be hilarious, but she could do it. And that I think is the key feature here. With all that said, if I took this drone and handed it to someone completely inexperienced, they would do fine. Maybe read the quick start guide. You know, it's all on the remote anyway, it'll guide you through the basics. You could go and make top quality, beautiful cinematic footage with this and add it to whatever you want to do with it. Whether it's post on social media or you want to make car reviews. I would recommend it to anyone who wants to go and make videos easily. This is the drone. Well, and that's, that's it on the ShortCircuit. Thanks for watching. And if you want to see more drone videos, let us know in the comments down below. Get subscribed and see you later. (orchestra music)",
    "transcript_keywords": [
        "drone",
        "Air",
        "DJI",
        "thing",
        "sensor",
        "fly",
        "battery",
        "things",
        "drones",
        "bag",
        "light",
        "sensors",
        "time",
        "USBC",
        "remote",
        "filters",
        "make",
        "side",
        "batteries",
        "back"
    ],
    "transcript_entity_values": [
        "half",
        "Weed Wacker",
        "ND",
        "FPS",
        "Cine",
        "EV",
        "1/2-inch",
        "ActiveTrack",
        "120 meters",
        "three",
        "this weekend",
        "4K/60",
        "one",
        "20%",
        "USB",
        "the Air 2",
        "U.S.",
        "4",
        "April",
        "an extra $250",
        "night",
        "APAS",
        "about 6",
        "Mavic",
        "LTT",
        "OcuSync",
        "24 hours to 7 days",
        "3-minute",
        "Tripod",
        "Air2",
        "Twitter",
        "HLG",
        "D-Log",
        "the Air 2",
        "Jono",
        "4K/30",
        "third",
        "DJI",
        "Brandon",
        "V8",
        "first",
        "3.0",
        "FCC",
        "Manscaped Manscaped's",
        "107",
        "two",
        "1-inch",
        "ND",
        "Columbia",
        "Android",
        "The Shed Travel Bag",
        "four",
        "about 12 kilometers",
        "20 megapixels",
        "USB Micro",
        "31 minutes",
        "a thousand dollars",
        "MOV",
        "FAA",
        "USB-C",
        "Air",
        "Linus",
        "ShortCircuit",
        "SD",
        "31 minutes.",
        "8GB",
        "48 megapixel",
        "MasterShots",
        "5.4",
        "Lawn Mower"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "EVENT",
        "GPE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "TIME",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "TIME",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "TIME",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.07379753142595291,
        -0.022330721840262413,
        0.006568597629666328,
        -0.06060606986284256,
        0.09281262755393982,
        0.03338462486863136,
        -0.021528827026486397,
        -0.02710571140050888,
        0.0131611879914999,
        0.06770085543394089,
        0.021499138325452805,
        0.030249452218413353,
        -0.007299396209418774,
        -0.05905713140964508,
        0.07667040824890137,
        -0.00759774399921298,
        0.06159084290266037,
        -0.07228852808475494,
        -0.03816269710659981,
        -0.03824782371520996,
        -0.027981800958514214,
        -0.045213788747787476,
        0.01623784378170967,
        -0.03733662888407707,
        -0.01563052274286747,
        -0.06020344793796539,
        -0.01597943902015686,
        0.053378794342279434,
        -0.002560144057497382,
        -0.0633339062333107,
        0.04646755009889603,
        0.09727403521537781,
        -0.006064288783818483,
        -0.013336080126464367,
        -0.012307358905673027,
        -0.03815535455942154,
        0.03568783029913902,
        -0.07807581126689911,
        -0.04822307825088501,
        -0.047316405922174454,
        0.021593725308775902,
        -0.0815836563706398,
        -0.04029122367501259,
        0.03638921305537224,
        -0.01770947501063347,
        -0.05284269526600838,
        0.05832792818546295,
        0.01517708320170641,
        0.0679909810423851,
        0.07559845596551895,
        -0.056696824729442596,
        -0.07542937994003296,
        0.08552573621273041,
        -0.057935308665037155,
        0.013299093581736088,
        0.002853481564670801,
        -0.04755445197224617,
        -0.006075656972825527,
        -0.022814754396677017,
        -0.11615528166294098,
        0.04290078580379486,
        -0.04684336483478546,
        -0.04061274975538254,
        0.04994083195924759,
        -0.016272542998194695,
        -0.06099866330623627,
        -0.0370960459113121,
        0.032666705548763275,
        -0.024758370593190193,
        -0.06248508766293526,
        -0.040798600763082504,
        0.000987008330412209,
        0.05823984742164612,
        0.04855605214834213,
        0.03009016439318657,
        0.04537789523601532,
        0.09090375155210495,
        -0.0512751005589962,
        0.04858200252056122,
        0.04614312946796417,
        0.04998791217803955,
        -0.05616293102502823,
        -0.08941780030727386,
        -0.012650535441935062,
        -0.039047904312610626,
        -0.053730130195617676,
        0.01772247441112995,
        0.03383590281009674,
        -0.016511721536517143,
        -0.06420321017503738,
        -0.004977541975677013,
        0.061172280460596085,
        0.08438857644796371,
        0.040538158267736435,
        0.00460820971056819,
        -0.0050333356484770775,
        -0.00014839469804428518,
        -0.008327730000019073,
        -0.001956186955794692,
        0.06817150861024857,
        0.020574169233441353,
        0.04102105274796486,
        0.024682143703103065,
        -0.05421251058578491,
        -0.06372731924057007,
        -0.06345579028129578,
        0.023773811757564545,
        0.047262322157621384,
        0.0814344510436058,
        0.021374385803937912,
        -0.09722602367401123,
        -0.00207670615054667,
        -0.0919954776763916,
        -0.04184212535619736,
        -0.02574079856276512,
        0.14917735755443573,
        -0.05596312880516052,
        0.03433046117424965,
        0.08710229396820068,
        -0.07434737682342529,
        0.00391147006303072,
        -0.0007017875323072076,
        0.03513094782829285,
        0.04417381063103676,
        0.0036334895994514227,
        0.04397745430469513,
        -0.11382964998483658,
        3.678026682148918e-33,
        -0.0615433044731617,
        0.09338179975748062,
        -0.022162189707159996,
        -0.028343185782432556,
        0.03721482679247856,
        -0.031661197543144226,
        -0.03562724590301514,
        -0.03581290319561958,
        -0.02130550891160965,
        0.03943660110235214,
        -0.11735742539167404,
        0.09364906698465347,
        -0.06655716150999069,
        0.042723916471004486,
        0.09046437591314316,
        -0.12558960914611816,
        -0.06031246483325958,
        -0.019747568294405937,
        0.050832539796829224,
        0.03627002611756325,
        -0.046075012534856796,
        -0.027200518175959587,
        0.016344301402568817,
        0.009300818666815758,
        0.1016925722360611,
        -0.015028970316052437,
        -0.0018682894296944141,
        -0.02937828190624714,
        0.13022840023040771,
        0.027873896062374115,
        0.0027085263282060623,
        -0.03197585791349411,
        -0.017179057002067566,
        -0.04803348705172539,
        -0.06952903419733047,
        -0.018584489822387695,
        -0.09482019394636154,
        -0.09742820262908936,
        -0.06634550541639328,
        0.0068709999322891235,
        -0.07179826498031616,
        0.05527133494615555,
        -0.09314310550689697,
        -0.044648200273513794,
        -0.07037952542304993,
        -0.05838393047451973,
        -0.05562273785471916,
        -0.047285325825214386,
        0.08532781153917313,
        0.005950616672635078,
        -0.05190081149339676,
        0.012734019197523594,
        -0.0980839803814888,
        -0.03527144715189934,
        0.015407619066536427,
        -0.05133936181664467,
        0.03198786452412605,
        -0.02007175236940384,
        0.03432183712720871,
        0.021657146513462067,
        -0.021087361499667168,
        -0.03490108996629715,
        0.03228529915213585,
        -0.02680804580450058,
        -0.0945996344089508,
        0.09831687062978745,
        0.09707050025463104,
        -0.002461556810885668,
        -0.041688818484544754,
        0.02504029870033264,
        -0.015688903629779816,
        0.028686394914984703,
        0.1134694367647171,
        -0.02375045232474804,
        0.02674604021012783,
        0.016235386952757835,
        -0.050207000225782394,
        -0.0566602498292923,
        0.0346076600253582,
        0.056634288281202316,
        -0.03775405511260033,
        0.06263832747936249,
        0.07063144445419312,
        0.04740561544895172,
        0.01757901720702648,
        -0.03638501837849617,
        -0.002326890593394637,
        0.05207948386669159,
        -0.0006975971045903862,
        -0.006826748605817556,
        -0.07907965779304504,
        7.1900090006238315e-06,
        -0.032945819199085236,
        0.0005493684438988566,
        0.024770833551883698,
        -6.251890214735353e-33,
        -0.12927024066448212,
        0.0016829784726724029,
        -0.06516415625810623,
        0.018036631867289543,
        -0.014755863696336746,
        -0.030409282073378563,
        0.024522513151168823,
        0.07703810185194016,
        0.07414717227220535,
        -0.05269186943769455,
        -0.047974493354558945,
        0.06923934817314148,
        0.0024674602318555117,
        0.036208730190992355,
        0.013017035089433193,
        -0.0948721170425415,
        -0.011927041225135326,
        -0.08571919053792953,
        0.07170705497264862,
        0.0018863732693716884,
        0.11477439105510712,
        0.02240702323615551,
        0.03406992554664612,
        0.0103811826556921,
        -0.0015213546575978398,
        0.002754140179604292,
        0.03316572681069374,
        0.061925772577524185,
        -0.02926212176680565,
        0.0184905007481575,
        0.017632780596613884,
        0.004712247755378485,
        -0.04773533716797829,
        0.0198972187936306,
        0.02026478946208954,
        0.008460485376417637,
        0.03127558156847954,
        0.09411420673131943,
        -0.04291930049657822,
        -0.03644545003771782,
        0.01796324923634529,
        -0.031876303255558014,
        0.027151286602020264,
        0.03667563945055008,
        -0.025316158309578896,
        -0.02741626650094986,
        -0.03849223628640175,
        -0.09253156185150146,
        -0.0010987980058416724,
        -0.0037592474836856127,
        -0.05219004303216934,
        -0.030145013704895973,
        0.01750744879245758,
        0.002638246864080429,
        -0.027567775920033455,
        0.024109382182359695,
        -0.041811805218458176,
        0.09154368191957474,
        0.03350137919187546,
        0.01741795800626278,
        0.02980867587029934,
        -0.01195718627423048,
        -0.10020948946475983,
        0.02454053796827793,
        0.0004017346946056932,
        0.04238390177488327,
        0.0454767681658268,
        0.0355316624045372,
        -0.021856864914298058,
        0.007535941898822784,
        -0.0628109872341156,
        -0.011767381802201271,
        -0.05292893573641777,
        0.027845140546560287,
        -0.07560303807258606,
        0.051417067646980286,
        -0.026845498010516167,
        0.07976041734218597,
        0.04519886523485184,
        -0.009575446136295795,
        -0.013686721213161945,
        0.023839818313717842,
        0.0028393161483108997,
        -0.021399281919002533,
        0.08740667998790741,
        0.05643218755722046,
        0.011458608321845531,
        -0.0745190978050232,
        -0.0433662086725235,
        -0.023427113890647888,
        -0.026578383520245552,
        0.04241146147251129,
        -0.049316298216581345,
        0.033729154616594315,
        -0.05241770297288895,
        -6.32582981552332e-08,
        -0.013239260762929916,
        -0.007843448780477047,
        0.1012900322675705,
        -0.011421979404985905,
        0.02472279779613018,
        -0.014797938987612724,
        -0.02777477353811264,
        0.04719816893339157,
        0.05536239221692085,
        0.030643152073025703,
        0.014880696311593056,
        -0.04604889824986458,
        -0.0331907719373703,
        -0.012177619151771069,
        0.01701708883047104,
        0.011780892498791218,
        -0.0680757388472557,
        0.07278362661600113,
        -0.03525158017873764,
        -0.08338271826505661,
        -0.05202668532729149,
        0.09963598847389221,
        0.035592496395111084,
        -0.05273745208978653,
        -0.008140221238136292,
        0.051195308566093445,
        -0.003821212099865079,
        -0.016514645889401436,
        0.07074124366044998,
        -0.08063040673732758,
        -0.022949935868382454,
        0.03860273212194443,
        0.034752313047647476,
        -0.06054595857858658,
        -0.015561092644929886,
        -0.051749322563409805,
        -0.022940771654248238,
        0.02787042409181595,
        0.03243597596883774,
        0.046917874366045,
        -0.016937704756855965,
        -5.797747235192219e-06,
        -0.000898473896086216,
        -0.019131803885102272,
        0.09083311259746552,
        0.026268823072314262,
        -0.048586878925561905,
        -0.07050575315952301,
        0.007713827770203352,
        -0.014714493416249752,
        0.04005948826670647,
        0.01560336071997881,
        -0.027940968051552773,
        0.0048994943499565125,
        0.05764683336019516,
        0.001742605702020228,
        -0.06724756211042404,
        0.04973728209733963,
        0.056093402206897736,
        0.08349017798900604,
        0.016871949657797813,
        -0.1249653622508049,
        -0.08901602029800415,
        0.10821708291769028
    ]
}