{
    "id": "d7ponUdlFLw",
    "title": "Building your own “Laptop” is Terrible and I LOVE it! - MaCase B21 Briefcase PC",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-12-16T18:13:06Z",
    "video_url": "https://www.youtube.com/watch?v=d7ponUdlFLw",
    "category": "Science & Technology",
    "tags": [
        "gaming pc",
        "gaming",
        "computer",
        "pc",
        "gpu",
        "rtx",
        "raytracing",
        "diy gaming",
        "build your own pc",
        "build a gaming pc",
        "nvidia",
        "amd",
        "gigabyte",
        "computer case",
        "pc case",
        "gaming case"
    ],
    "views": 1675020,
    "likes": 55803,
    "comments_count": 2074,
    "description": "Check out CableMods StealthSense cables at: Amazon: CableMod:  If youve ever thought about building your own laptop, luggable, or briefcase PC, you probably came to the conclusion pretty quickly that building a portable chassis from scratch is just not something an average person should have to do. But now, thanks to Alibabas constant stream of weird oddity computer parts, we can fit a full gaming PC, complete with a desktop GPU, 600W power supply, and ITX motherboard, in a case thats only slightly larger than a laptop thats too big to be useful, and only slightly heavier than what would cause an average person to slip a disc.  Discuss on the forum:   Buy a Macase B21 \"Briefcase\" Case:  Buy an AMD Ryzen 7 7800X3D CPU:  Buy a GIGABYTE B650I Aorus Ultra Motherboard:  Buy a GIGABYTE A620I AX Motherboard:  Buy a Samsung 970 Evo Plus NVMe M.2 SSD:  Buy a Samsung 980 Pro NVMe M.2 SSD:  Buy an Alphacool Isbaer Pro ES 80mm AIO Cooler:  Buy a Noctua NH-L12S CPU Cooler:  Buy G.SKILL Ripjaws S5 6000MHz CL36 2x16GB DDR5 RAM:  Buy a Noctua NF-A8 80mm Fan:  Buy a NVIDIA GeForce RTX 4070 FE Graphics Card:  Buy a SilverStone FX600 Platinum PSU:  Buy a CoolerMaster MASTERACCESSORY Riser Cable:  Buy a CableMod 12VHPWR 180 Degree Angled Adapter:    Purchases made through some store links may provide some compensation to Linus Media Group.  Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 2:30 CPU, Motherboard 4:25 Cooling and RAM 7:18 GPU and Power Supply 9:59 Putting it all together 12:05 Turning it on, testing it out 14:12 Heating up! 16:53 Is this for you? Conclusion",
    "description_links": [
        "https://www.amazon.com/stores/page/1321ADE8-222D-4BED-B258-C81EF5575B4F?ingress=0",
        "https://store.cablemod.com/stealthsense-technology/",
        "https://linustechtips.com/topic/1547502-building-your-own-%E2%80%9Claptop%E2%80%9D-is-terrible-and-i-love-it/",
        "https://lmg.gg/Ul7wB",
        "https://geni.us/PQZs",
        "https://geni.us/ZjlWN",
        "https://geni.us/DACVZC",
        "https://lmg.gg/NPuKl",
        "https://lmg.gg/zbYW8",
        "https://geni.us/lkKS9T",
        "https://geni.us/4Deyan",
        "https://geni.us/5q2Vb",
        "https://geni.us/cgNkf",
        "https://lmg.gg/7tblp",
        "https://geni.us/OZFn",
        "https://geni.us/0WUIT",
        "https://lmg.gg/nDVGQ",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "Do you think pre-built laptops are for cowards? Wha- Hey! Boy, have I got the solution for you. Meet the new design 16.1-inch LCD screen industrial server chassis computer case with three PCIe slots. On top of such groundbreaking features as monitor, keyboard, and handle, it's capable of housing a 260-millimeter GPU and a desktop CPU and motherboard. And I mean, sure. There have been briefcase computers for nearly as long as there have been forums to brag about them on, but this is the first time that I have seen a ready-made, mass-produced briefcase chassis. And if you're looking for a... ...somewhat... ...portable PC that can game at a LAN, handle heavy on-site video editing, or house specialized PCIe expansion cards that your weak friend's laptop just can't, this just might fill that void. Or, given its colossal size, fill just about any void, like this deep, dark, empty Segway to our sponsor. CableMod. Their new StealthSense cables eliminate the need for sense wires, which means no more fragile pins in your cables that will bend if you insult them one time. Learn more at the link in the description, or at the end of this video. Now, I have to confess to you guys, when we started the shoot here, I thought we kind of screwed something up, because I lifted this thing up and I went, Guys, the whole video is that I'm supposed to build the computer in it. You can't build it all re- No, it's just that heavy, without any of the actual hardware in it. To its credit, though, it seems pretty rugged, especially for the price. It's got these great rubber corner pieces that should protect it from incidental bumps and bruises. It's got this stamped reinforcing pattern to help protect the LCD on the other side, and it seems to be machined out of solid aluminum for the most part. That would explain the weight. Also, there's the fact that it's not entirely empty. We've got what appears to be an 80mm cooling fan, a cross brace, power supply mount, and... Okay, a scaler, some kind of driver board for the integrated monitor. That makes sense. There's your HDMI input. Or at least it makes more sense than the VGA cable that is hanging out the rear of it. Wait. Really? This? That's the- We're gonna have to find a better way. Kicking off the build with our CPU, we've gone with the Ryzen 7 7800X3D. And what's remarkable about this choice is how unremarkable it is. I recommend this thing all the time, and that's what makes a solution like this so appealing. This is a great CPU. And while it is technically a 120-watt chip going into a system where we might want to keep power consumption low due to cooling constraints, or in case we ever have to run off battery off-grid, AMD tends to baby these 3D V-cache chips pretty hard, and they keep voltages so low for better reliability that real-world power draw is rarely more than 80 watts, depending on the cooler. I think this is going to perform really well in here. Of course, it can't do anything on its own, and we needed to pair it with an appropriate motherboard. We've gone with the Gigabyte B650i Aorus Ultra. Now, I want to note that the A620i AX would almost certainly have been good enough and come with a significant discount. However, we preferred the more robust IO of the Ultra, especially given our limited PCIe expansion. The standout features on this one were the extra USB ports, Intel 2.5 Gig Ethernet, and the extra M.2 storage slots. It's worth noting that not everything about this board was an upgrade for us. V1.1 of this one uses Intel Wi-Fi, and V1.2 shares the same Realtek chip as the A620i. However, we rolled a natural one and got V1 from our local computer shop, which unfortunately uses an AMD RZ616 Wi-Fi chipset from MediaTek. For our SSD, we've gone with a Samsung 980 Pro. That's a lie. This is clearly a 970 Evo Plus, but we would have used a 980 Pro. It's just the labs borrowed them all. See, we wanted to use something like this Alphacool Ice Bear Pro ES. Look at it. It's an 80 millimeter AIO cooler. It's so small and cute. But even coolers like this one, designed for low-profile 2U chassis, are either too long or too thick to fit in our luggable here. So we'll have it linked down below with all the rest of the hardware that we're using, in case there's a cool project that you have in mind for it. But we had to settle for the next best thing, the Noctua NH-L12S. Or more specifically, an L12S with the fan mounted on the bottom. That wasn't a step we thought we'd have to take. In fact, the Alibaba listing says that it can fit an 85 millimeter tall cooler, while this is only 70 millimeters. It's just that, with the motherboard installed, this just barely fits as it is. So I guess they just, what, didn't account for that? Before we put it in there though, we'll need some mounting hardware, some thermal compound, and some figuring out what orientation is going to work for us here. Wow. That is extremely tight. We seem to be getting good contact, so I think we're good to go. Good to go and make sure we install our RAM first. With a CPU cooler like this, we need low-profile RAM, and the best options we could find are the Ripjaws S5 and Flarex 5, both from G.Skill. We ended up with the S5s, running in a 2x16 gig kit at 6,000 megatransfers per second, CL36. But none of those speeds and feeds are what really matter to us. What matters is... I think they fit. Oh wow, is that ever tight? No, no, I'm sure we're going to get it in there. We just got to remove this cross brace. There we go. See you later, cross brace. And oh, look at this! How perfect is that? This intake fan goes right into our little cavern of where air can go into this impenetrable fortress. Or at least it would if it was an intake fan. It's an exhaust right now. Let's get that turned around. Look at this. In there with the stubby screwdriver. Got that low ratchet back for us. We are going to get that screw out. Aw, yeah, strong magnet! Question for you, Tanner. Have we considered replacing this extremely generic fan with something a little better? This guy's way ahead of me. I did bring a Noctua. This guy's way ahead of me. All right. I am worried a little bit about this though. Noctua fans perform well for their sound profile, but they don't necessarily spin that fast. And you might just need to push more air into this thing than that fan will do. But I guess we'll have to see how it goes. There we go. And wow, that looks freaking awesome! And raises a lot of questions like, Is there enough room for a GPU in here? And the answer is yes. And not just any GPU. That's right. We found it. The one case, pun intended, where it makes sense to spend ransomous amounts of money on an RTX 4070. You see, you can hate on the 40 series all you want for good reasons, like their pricing, but you can't fault NVIDIA's style when it comes to performance per watt. And this is far and away the most performant GPU that we could find that is under 260 millimeters in length, that can run on a 600 watt power supply or less. Oh, speaking of which, we are going to be using this FX600 Platinum from Silverstone. Why? Because it's super cool. It's 600 watts, Cybernetics Platinum certified, Flex ATX, meaning it should fit in our system with no difficulty whatsoever. We ended up using this CableMod 180 degree adapter. By the way, it's the older one. I'd recommend getting the newer one that has fewer problems. And it'll go in a little something like so. But we still have a problem. Where is this GPU going to get any airflow from? These pass-through cards, where they suck air in the one side and blow it right out the back, are great for small form-factor builds, assuming that there's a natural airflow path through the card. In this case, there is not. All we've got is this passive, what is now an exhaust. Pain train's coming into the station, boys! Four hours later. And four little holes. Success! We've got a filtered intake. Now, we won't actually have a fan on it. Those holes are just there so we can put a little filter on it. But that should give our GPU much better access to fresh air from the outside. Oh, but I almost forgot. We need to replace that VGA cable with an HDMI cable. And before we put the motherboard in is the best time to do that. This is a very long HDMI cable. It is. So we have a shorter one with this yellow one here, but I think it might be a little too short. That's great. Much better. Here we go. Now we're talking. See you later, VGA. Oh, you hung it. Did I really? Yeah. I can't even see it. Oh, where? No. Where'd it go? It definitely didn't hit the ground. Oh, I see it. Where did it go? Oh, yeah. Oh! Now, I was about to put in the PCIe riser for our GPU. In fact, I will just put that in since that won't interfere with any of this. But then I realized, I got to deal with all the front IO, the trackpad, keyboard, and power button, and all that stuff. We just put the top panel here, and then, oh, man, jeez. This is a very kludgy build process. Then we just need to add a USB connection for the trackpad and the keyboard, and we're pretty much good to go. Let's throw this GPU in. Now, I know you guys are probably thinking, gee, Linus, that's a really long PCIe riser for such a short run. And you're right. But the issue was we wanted to run at Gen 4 speeds, and there's a distinct lack of 10-centimeter Gen 4 risers. So this is what we ended up with, and we're pretty sure it'll kind of, you know, right? This is the thing I love about new power supply standards. It's like, yeah, we've got this 12-pin high power. It does all this other stuff, and blah, blah, blah, blah. And at the end of the day, it's just one 8-pin with a daisy chain, and as long as you have the right adapter, everything's hunky-dory. Little trick, though, by the way, guys, it can be really hard to get in and plug these dual 4-pins in when they don't lock together. So you can just use a little piece of tape to hold them together while you get them aligned. And with all the cables tucked away, are we ready for first boot? It kind of seems like it. I just can't believe how easy this was. Like, we've started the conversation around doing a suitcase PC so many times, and every time it goes something like, oh, yeah, we should totally do one of those. Okay, what would make ours stand out? Oh, it would be like a three-month-long project because everyone's basically done every idea. Okay, fine, forget it. We'll kick it down the road. No, we don't have to! That's a good sign. That's a good sign. Delete, delete, delete, delete, delete, delete. Oh, no way! This is so cool! She's done done. Yes! Wow! That is pretty sleek. For a clunky desktop shaped like a laptop, but... Man, oh, wow! Oh, that's heavy! Wow! What is this weigh? Ah! Incredible! This trackpad, though. What is this, from 1998? I didn't even notice before. It's fantastic. How's the keyboard? Very awful. You know, considering how much total depth they have in this machine, you'd think they might have been able to keep the keyboard from having so much flex. And before you ask, no, that's not what that brace was for. This is almost certainly 60 hertz, 1080p. Yep, never mind that a few more hertz wouldn't have hurt them too much on the bottom line, but this is what we got. At least it's not TN, like it would have been in the old days, though. The viewing angles are fine, and the brightness is very usable. I mean, everything about this feels ridiculous. Like, I have no idea what I'm cleaning right now. It does look pretty cool, and it has... Okay, maybe not all the advantages of a laptop, you know, not having a battery and all that, but just the fact that it's just so packable, and it has all the advantages of a desktop, pretty much. If I didn't want to use this monitor because it wasn't suitable for whatever I was doing, I don't have to. I could plug into my ample desktop-class rear I.O. and just use a whole different set of peripherals. Whoa, what just happened? Everyone just flipped out. Anyway, the point is, clearly the game's running okay. I'm at the ultra preset at 1080p, and I'm running at 120 FPS, with 1% lows at 85. This is smooth. Is anyone chasing me? Oh, sorry, sorry. Oh my goodness, I'm so sorry. My hand, though, no lie, getting frickin' uncomfortable. Hey, look, we got a thermal camera. Let's quantify this. Wow! 48 degre- Shut up. 49- Can we reach 50? Over 50 degrees! On the keyboard. That is hot enough to hurt you. Meanwhile, the wrist rest is at a frigid 44 12. Since I've got it out, you can really see we are not exhausting much hot air over here. There's no real track on the desk pad next to it. Meanwhile, by the GPU- Yeah, yeah, yeah, yeah, yeah. That's where all the heat is leaving the system. I'm drawing cold air in over here. Oh, okay. Some exhaust is just being thrown out this side, too. Interesting. This vent's pulling double duty. The GPU is drawing air from the bottom of it, and then exhausting air out the top of it. I don't even know if this thing is peaked yet. Well, I was measuring the back. Yeah, the keyboard got up to 53, and the wrist rest has reached 46. This wouldn't be legal to release, at least in this configuration. As for why I'm still trying to do it, well, I couldn't explain that to you. Ow! Okay, how hot is the part of my arm that I had on there? 42. It's already cooling a little bit, but it's over 40, just from having my wrist on it. That's normal. You know what's not running hot, though? It's our CPU and GPU. We're sitting at around 80 degrees on both of them, which is okay. Not the best temperatures I've ever seen before, but far from the point of thermal throttling. That is flipping awesome, and it goes to show you, like, what have we got in here? One 80 millimeter fan, power supply fan, and then repurposing our GPU fan as an intake. That's it. It's not about how much airflow you've got. It's about how you use it. With that said, I think there's more we could do to stress this thing. Let's hit it with Furmark and Cinebench at the same time. Here we go. Oh, it's pretty loud, though. What? I think it's pretty okay. It is definitely getting louder now, but I think it's pretty reasonable. Whoa. I think it's gotten even hotter. Yup. The wrist rest has cracked 50. The keyboard has... Whoa, whoa, whoa. Did I see 60? Still, though, our GPU is just shy of 2.5 gigahertz, and our CPU hasn't thermal throttled yet. For the price, I'd be thrilled with this thing. 400 bucks for chassis, keyboard, trackpad, and monitor. I mean, yeah, it's not a real laptop, and if you wanted to run it off grid, you would have to bring along a portable battery bank or solar generator or whatever the case may be. But given that it's probably rugged enough to travel a little bit, some reasonable use cases for something like this could be, I mean, sure, gaming like we showed before, but that's not the intention. I'm thinking more along the lines of compute-intensive on-location work like you might encounter in filmmaking or scientific endeavors. Similar portable workstations are available as pre-builds to serve these industries, but if you have to ask how much they cost, you can't afford them. Like, seriously, guys, the ones we found from Next Computer start at $8,000, and that's without a professional GPU in them yet, and they go up past 25 grand. Our machine weighs in at around $2,000. It does have some drawbacks. I mean, one is that my case, the seller, doesn't include a jacket to protect it from the elements, so if you're carrying it around briefcase-style and it starts to rain, your system's gonna end up water-cooled in all the worst ways. But for the amount of money you'd have left over, you could probably track down a tailor to fashion a suit for it out of fine Italian leather and still have enough money left over to fly business class to Milan with your super-stylish luggable as your carry-on item. Now, with that wrapped up, if you'll just allow me to make a briefcase for our sponsor, CableMod. Their StealthSense cables eliminate the need for sense wires that run from your GPU to your power supply. Instead, the connector uses a hidden bridge to tell the GPU that up to 600 watts of delicious pulp-free juice is ready to be slurped. The juice is electricity. Using this hidden bridge instead of a sense wire means there's no tiny, fragile sense pins in the cables which can dislodge themselves at the slightest provocation. And that's good news, because dislodged pins can lead to issues like 100% fan utilization or black screens, which make it much harder to see what your PC is doing and make it sound like a Boeing 747 taking off. So stop compromising on your cables. Get peak performance, higher reliability, and cleaner aesthetics with CableMod's StealthSense cables. You can check them out on Amazon or at CableMod's own website linked down below. If you guys enjoyed this video, why not check out our build in the DanCase C4 SFX? It's kind of like this, but actually good for putting on your desk and using day-to-day. Hold on, actually, before you guys go, we'll do one more check-in and see if it's gotten any hotter. It just keeps going. It's at 55 on the trackpad now. Ooh!",
    "transcript_keywords": [
        "GPU",
        "yeah",
        "fan",
        "good",
        "pretty",
        "CPU",
        "power",
        "keyboard",
        "cables",
        "air",
        "thing",
        "guys",
        "power supply",
        "case",
        "sense",
        "Wow",
        "GPU Yeah",
        "GPU fan",
        "time",
        "Delete"
    ],
    "transcript_entity_values": [
        "40",
        "FX600 Platinum",
        "one",
        "hertz",
        "Alibaba",
        "Cybernetics Platinum",
        "LAN",
        "SSD",
        "Tanner",
        "40",
        "85 millimeter",
        "44 12",
        "VGA",
        "GPU",
        "2x16",
        "the end of the day",
        "120",
        "Ultra",
        "260 millimeters",
        "Cinebench",
        "Furmark",
        "FPS",
        "AMD",
        "Flarex 5",
        "600 watt",
        "180 degree",
        "G.Skill",
        "6,000",
        "three",
        "1998",
        "the Ripjaws S5",
        "Linus",
        "AIO",
        "this Alphacool Ice Bear Pro ES",
        "Milan",
        "RZ616",
        "Gen 4",
        "85",
        "first",
        "Four hours later",
        "46",
        "970",
        "the old days",
        "around $2,000",
        "Amazon",
        "120-watt",
        "Noctua NH",
        "60 hertz",
        "Silverstone",
        "4",
        "80mm",
        "CPU",
        "10-centimeter",
        "more than 80 watts",
        "LCD",
        "60",
        "I.O.",
        "Intel",
        "Flex ATX",
        "four",
        "S5s",
        "260-millimeter",
        "1080p",
        "Italian",
        "MediaTek",
        "42",
        "16.1-inch",
        "100%",
        "50 degrees",
        "CableMod",
        "TN",
        "48",
        "12",
        "HDMI",
        "PCIe",
        "second",
        "around 80 degrees",
        "2U",
        "8,000",
        "Next Computer",
        "Boeing",
        "NVIDIA",
        "Segway",
        "1%",
        "80 millimeter",
        "CableMod",
        "55",
        "Samsung 980 Pro",
        "RAM",
        "400 bucks",
        "8",
        "Intel Wi-Fi",
        "three-month-long",
        "Realtek",
        "600 watts",
        "53",
        "2.5 gigahertz",
        "USB",
        "only 70 millimeters",
        "DanCase C4",
        "747",
        "50",
        "One 80 millimeter",
        "Gen 4",
        "IO",
        "Noctua"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "NORP",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "NORP",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "FAC",
        "GPE",
        "ORG"
    ],
    "vector": [
        -0.051022183150053024,
        -0.02568904124200344,
        0.005615306552499533,
        -0.010289431549608707,
        0.013355209492146969,
        0.014271707274019718,
        0.0033981751184910536,
        0.10153397917747498,
        0.004523505922406912,
        0.029071563854813576,
        0.05810556188225746,
        0.030933057889342308,
        0.043499965220689774,
        0.051162272691726685,
        -0.010930914431810379,
        -0.0061751920729875565,
        0.07397986203432083,
        -0.04250720515847206,
        -0.042842552065849304,
        0.08588665723800659,
        -0.031851377338171005,
        -0.026464268565177917,
        0.014269426465034485,
        -0.0904938206076622,
        -0.04743349179625511,
        0.0030560605227947235,
        0.09106149524450302,
        -0.05742065608501434,
        0.005689485929906368,
        0.0036257090978324413,
        0.030450105667114258,
        -0.045596666634082794,
        -0.06413032859563828,
        0.05460987240076065,
        0.04754355922341347,
        -0.04211849346756935,
        0.14751198887825012,
        0.005316120572388172,
        -0.0660926029086113,
        -0.11791388690471649,
        -0.06041842699050903,
        -0.016121752560138702,
        0.05444571003317833,
        0.05011661723256111,
        0.0553058460354805,
        -0.04586319625377655,
        0.031171344220638275,
        -0.06856423616409302,
        0.04307900741696358,
        -0.04259173944592476,
        -0.014178966172039509,
        -0.07116581499576569,
        -0.024348219856619835,
        0.030413862317800522,
        -0.049113303422927856,
        0.04024037346243858,
        0.005479035433381796,
        -0.025647614151239395,
        -0.006274583283811808,
        -0.04653369262814522,
        0.09728506207466125,
        -0.10053212195634842,
        0.054009705781936646,
        -0.01651468500494957,
        0.040363188832998276,
        -0.09471697360277176,
        0.038119394332170486,
        0.02460746467113495,
        -0.007500447332859039,
        0.10001298040151596,
        0.03352336958050728,
        -0.05481529235839844,
        -0.060732319951057434,
        0.05893777310848236,
        0.009741120971739292,
        0.027054011821746826,
        0.019423412159085274,
        0.015283488668501377,
        0.0387808121740818,
        0.08939297497272491,
        -0.0536140613257885,
        0.06555873900651932,
        0.02421773038804531,
        0.015179748646914959,
        -0.01666373945772648,
        -0.03533476963639259,
        -0.0006153901922516525,
        0.062320563942193985,
        -0.06805466115474701,
        -0.10489464551210403,
        0.0960882231593132,
        -0.019778519868850708,
        -0.0012524565681815147,
        -0.009157312102615833,
        -0.06679590046405792,
        -0.042684368789196014,
        -0.008189769461750984,
        0.014159086160361767,
        -0.004224296193569899,
        -0.008609306067228317,
        0.02143600955605507,
        0.05653548240661621,
        0.1108715608716011,
        0.015712544322013855,
        -0.06919937580823898,
        0.0036215311847627163,
        -0.03213196247816086,
        -0.0330326110124588,
        -0.013013103976845741,
        -0.03438470512628555,
        -0.0656147450208664,
        0.02021831087768078,
        -0.052400920540094376,
        0.034349411725997925,
        0.014419474638998508,
        -0.0054123541340231895,
        -0.026391027495265007,
        0.08914905041456223,
        0.06641557067632675,
        0.06408314406871796,
        0.019549068063497543,
        0.0037748392205685377,
        0.06168769672513008,
        0.00029479098157025874,
        0.058999232947826385,
        0.03472239524126053,
        -0.04272478073835373,
        7.856139517864346e-33,
        0.04527120292186737,
        0.04413406923413277,
        -0.05324044078588486,
        0.021780116483569145,
        -0.008584631606936455,
        -0.060257792472839355,
        0.047525689005851746,
        0.019951043650507927,
        0.030070915818214417,
        0.0626053661108017,
        -0.05245816707611084,
        -0.01981586217880249,
        -0.03746076673269272,
        0.044392891228199005,
        0.06815821677446365,
        -0.018988585099577904,
        -0.01986573450267315,
        -0.07061529904603958,
        -0.019677508622407913,
        -0.05382212996482849,
        0.005371318198740482,
        -0.043410640209913254,
        0.07920420169830322,
        -0.051500607281923294,
        0.05127481371164322,
        -0.03138749673962593,
        0.018101293593645096,
        -0.02206645905971527,
        0.07519185543060303,
        0.014156551100313663,
        -0.08624959737062454,
        -0.09764976054430008,
        -0.0530034676194191,
        -0.002029786352068186,
        -0.027346108108758926,
        -0.008280309848487377,
        -0.08133680373430252,
        -0.04899352043867111,
        0.09258054196834564,
        0.010203140787780285,
        -0.08685360103845596,
        -0.019060324877500534,
        -0.023848095908761024,
        -0.0536389984190464,
        0.014874041080474854,
        0.0043424684554338455,
        0.04652520269155502,
        0.010556574910879135,
        -0.06557220220565796,
        0.008061866275966167,
        -0.07480470091104507,
        0.018381360918283463,
        0.08172530680894852,
        -0.03420383110642433,
        -0.06965865939855576,
        -0.03592785820364952,
        0.0488714762032032,
        -0.027809496968984604,
        0.12452202290296555,
        0.07501467317342758,
        -0.008838681504130363,
        0.01557192113250494,
        0.016332434490323067,
        0.047914981842041016,
        -0.06459254026412964,
        0.0414736345410347,
        0.08183351159095764,
        0.037918221205472946,
        -0.033967141062021255,
        -0.03448754549026489,
        0.005333681125193834,
        -0.026039764285087585,
        0.02468624897301197,
        -0.08444535732269287,
        0.060811884701251984,
        0.01703452691435814,
        -0.07921163737773895,
        -0.024105409160256386,
        -0.10879959911108017,
        -0.13028119504451752,
        -0.0854908674955368,
        -0.021285442635416985,
        0.003165023634210229,
        0.09559337794780731,
        -0.008576308377087116,
        0.09299733489751816,
        -0.041673675179481506,
        -0.04733438789844513,
        -0.03192586451768875,
        -0.038280732929706573,
        0.018782660365104675,
        -0.03562512993812561,
        -0.06894171237945557,
        -0.012150713242590427,
        -0.020920587703585625,
        -6.716839372787846e-33,
        0.059025995433330536,
        -0.047631893306970596,
        -0.0009206855902448297,
        -0.016504105180501938,
        0.03900966793298721,
        -0.01873811148107052,
        0.05037316679954529,
        -0.03571566939353943,
        -0.013264958746731281,
        -0.08241303265094757,
        -0.07296790182590485,
        -0.04243611916899681,
        0.04255916178226471,
        0.05189744010567665,
        0.025076450780034065,
        0.020840374752879143,
        -0.06285174936056137,
        -0.053010351955890656,
        0.03882836550474167,
        -0.04184611141681671,
        -0.0021918113343417645,
        -0.012682372704148293,
        0.025111692026257515,
        0.04556617885828018,
        0.0034357537515461445,
        0.002088288078084588,
        -0.049579549580812454,
        -0.10070145130157471,
        0.03584205359220505,
        0.1176380142569542,
        -0.057025689631700516,
        -0.03190966323018074,
        0.023199336603283882,
        0.018673313781619072,
        0.044365044683218,
        -0.04020843282341957,
        -0.004893998149782419,
        0.015137129463255405,
        0.044573333114385605,
        -0.03191886469721794,
        -0.010429131798446178,
        0.10363416373729706,
        -0.0353969968855381,
        0.006499546580016613,
        0.03830951452255249,
        -0.029014743864536285,
        -0.061623748391866684,
        -0.05049041286110878,
        0.08598513156175613,
        -0.04477561265230179,
        -0.02862883172929287,
        0.04613879323005676,
        0.061868149787187576,
        -0.008520985022187233,
        0.009788116440176964,
        -0.06274454295635223,
        -0.032415106892585754,
        0.015600469894707203,
        0.008705953136086464,
        -0.02435540035367012,
        0.02919667400419712,
        0.023769056424498558,
        0.0033877987880259752,
        -0.016447579488158226,
        -0.017451809719204903,
        -0.013565341010689735,
        -0.007030480541288853,
        0.05183616653084755,
        -0.03825526684522629,
        -0.04107469692826271,
        -0.05393495783209801,
        -0.023059740662574768,
        0.006482242606580257,
        0.004101664759218693,
        0.008552451618015766,
        0.024613507091999054,
        0.09036232531070709,
        -0.04207221418619156,
        0.10545434802770615,
        0.05230628699064255,
        -0.011234107427299023,
        -0.0028427415527403355,
        -0.007468511816114187,
        -0.022392066195607185,
        0.05064721778035164,
        -0.020515328273177147,
        0.027831314131617546,
        0.013742456212639809,
        -0.04217209666967392,
        -0.05063731223344803,
        0.059828080236911774,
        0.006535129155963659,
        -0.015469653531908989,
        0.05899641662836075,
        0.001375289517454803,
        -5.2425523477950264e-08,
        0.00040602372610010207,
        -0.02484849840402603,
        -0.0021404565777629614,
        0.06068146973848343,
        -0.04534843936562538,
        -0.08336019515991211,
        0.0458206944167614,
        0.0010578184155747294,
        0.07545838505029678,
        0.04765475168824196,
        0.013986551202833652,
        -0.1043315976858139,
        -0.009029561653733253,
        0.07813029736280441,
        -0.06687977910041809,
        0.11850140988826752,
        -0.05338217318058014,
        0.05997954308986664,
        -0.01165993046015501,
        -0.056251753121614456,
        0.04812527820467949,
        0.020862653851509094,
        0.07061795145273209,
        0.027047911658883095,
        0.042909327894449234,
        -0.006036807782948017,
        -0.09639748185873032,
        -0.015610535629093647,
        0.03402186557650566,
        0.011279536411166191,
        -0.0769730880856514,
        -0.0357966311275959,
        -0.015491877682507038,
        0.011796233244240284,
        0.05475782975554466,
        -0.0752934068441391,
        0.04550042003393173,
        0.08049672842025757,
        0.0964592695236206,
        0.02016649767756462,
        -0.0030044035520404577,
        -0.11304906755685806,
        -0.03180866315960884,
        -0.03249967843294144,
        0.05105232447385788,
        -0.022682681679725647,
        -0.10658854991197586,
        -0.06311306357383728,
        -0.06930659711360931,
        0.1552247554063797,
        0.08305317908525467,
        -0.06012599915266037,
        0.035700682550668716,
        0.0195605605840683,
        0.04268625006079674,
        0.061603907495737076,
        -0.037931036204099655,
        0.10039815306663513,
        -0.01690773107111454,
        0.028119822964072227,
        0.03203846886754036,
        -0.04808342456817627,
        -0.03989633545279503,
        0.03046080656349659
    ]
}