{
    "id": "D7WBAUa5Q_o",
    "title": "Microsoft Surface 2021 event: Pro 8, Duo 2, Laptop Studio, and more",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-09-22T16:21:04Z",
    "video_url": "https://www.youtube.com/watch?v=D7WBAUa5Q_o",
    "category": "Science & Technology",
    "tags": [
        "Microsoft Surface event",
        "Surface Pro 8",
        "Surface Duo 2",
        "Microsoft Surface event 2021",
        "Microsoft Surface event 2021 supercut",
        "Microsoft Surface event recap",
        "Surface Go 3",
        "Microsoft Ocean Plastic Mouse",
        "Surface Slim Pen 2",
        "Surface Pro X",
        "Surface Adaptive Kit",
        "Surface Laptop Studio",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 358438,
    "likes": 8419,
    "comments_count": 590,
    "description": "Microsoft has just wrapped up its latest Surface event, where the company announced the Surface Pro 8, Surface Duo 2, Surface Laptop Studio, and more. Heres everything from the event in 8 minutes.  Read more:    00:03 Surface Pro 8 1:55 Surface Go 3 2:03 Surface Adaptive Kit 3:00 Surface Duo 2 6:27 Surface Laptop Studio  Microsoft Surface Laptop Studio hands-on impressions:   Microsoft Surface Pro 8, Surface Go 3, and Surface Pro X hands-on impressions:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://bit.ly/2ZgsqOt",
        "https://www.youtube.com/watch?v=AqkCuKH76c4",
        "https://youtu.be/YwadPCebCQU",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hello everyone. Good morning, good afternoon, good evening. - I'd like to introduce the ultimate two-in-one: Surface Pro Eight. we're bringing the best of our Surface Pro heritage to life in a new design built on the Intel EVO Platform with Quad Core 11 Gen Intel processing and an innovative thermal design delivering over 43% more compute power and 75% faster graphics than Surface Pro Seven. And we're bringing up to 32 gigs of RAM and high-speed Thunderbolt for connectivity. All this with 16 hours of battery life with the iconic full range kickstand and detachable keyboard studio microphones and a front facing camera, not on the side but center right where it should be. Dolby Atmos creates an immersive sound that's nothing like you've heard from a two-in-one before. The super thin bezels and over five and a half million pixels, Dolby Vision, 120 Hertz refresh rate. And for the first time, we're bringing adaptive color technology which naturally adjusts to the color temperature and lighting of your environment. We're excited to announce Surface Slim Pen Two. Magnetic storage and charging, your pen is always with you and it's always ready when you have that instant thought or a moment of inspiration. And when you pick up your pen, Windows 11 brings up a customizable pen menu that gets you inking and into your flow quickly. Another big part of our product development includes custom silicon, a processor we call Microsoft G Six. When your pen hits the canvas, the G6 processor and Windows 11 come to life. And for the first time with digital ink, there's tiny mechanical vibrations that mimic the feel of pen on paper, sending tactile signals through the touch receptors in your fingertips. With our sharper pen tip, zero pressure force and ultra low latency, Surface Slim Pen Two and Pro Eight bring you exceptional accuracy, smoother flow and greater control. And for those of you who love Pro X, developers have been optimizing the app specifically for ARM 64 bit emulation is built in so the apps you need are ready for you. I want to introduce to Surface Go Three. And now with 10 gen Intel processing, Surface Go is 60% faster than before. - All right, so we're here to talk about the Surface Adaptive Kit. Okay, you can apply these stickers to your keyboard. It's raised so you can feel it, but also it's high contrast. - And the different shapes make them very distinguishable from one another. - So the key cap labels are really designed for someone who is blind. They fit perfectly on the Surface keyboards. The port labels are used for taking a label and applying it to a cable. - Yeah. - And then applying the corresponding port tab onto the device. This tab is a lanyard tab. We've attached it to the kickstand so that this can be easily pulled out with the lanyard and you're ready to go. - It really allows people to easily and quickly modify their device so they're spending more time using the device and less time trying to set it up. - Today, we are incredibly excited to introduce you to the next generation of Surface Duo. This is Surface Duo Two. - Our team of engineers have partnered closely with Qualcomm to build an incredibly fast and powerful dual screen device. All of this in a product that has been meticulously crafted to become the world's thinnest 5G device. We've enclosed all of this technology in beautifully nano coated 3D glass, and it's available in both glacier and obsidian tones. And when you unfold it, you'll find two beautiful pixel sans fusion displays that expand to an even larger 8.3 inch display with high refresh rate of 90 Hertz, perfectly synchronized across both displays. It's generating nearly half a billion pixels per second. The curve displays bring the two sides even closer together connected by the most precise and reliable hinge mechanism we've ever engineered at Surface. With the toughest glass from Corning, protecting the displays, you can write and draw on your Surface Duo with confidence. To make sure that your Surface Slim Pen is always with you and charged, we're introducing Microsoft Surface Duo Two pen cover. To help you stay in your moment and not worry about missing anything important, we've designed Surface Duo Glance Bar. You can glance to simply check time without opening your Duo and the color coded badges will show you how many calls and messages you have received, including Teams Check. Beautiful and subtle light glows show you incoming calls, incoming messages and even show you how much battery you have left. We've engineered truly exceptional cameras with dual optical image stabilization. The wide angle camera utilizes every pixel in the sensor. We've also added a time of flight sensor. The ultra wide camera uses intelligent lens distortion correction to help you capture the most natural pictures. The telephoto camera has a focal length that professional photographers use to capture beautiful portraits. And our custom built camera app will launch across both displays, giving you an instant preview of the shot that you just took. All editing controls on the left screen so that you can see the changes to the photo without covering it up. And you can write a personal note and send it to your teammates by dragging it right into your Teams Chat. - I can quickly swipe to access my Microsoft feed. I can also join my Teams Meeting with a single tap. Now I like to spend my Teams app which allows me to see both the video of the attendees and the content being presented. I can use my pen to contribute to our shared whiteboard session as well. And now, I can set Duo to Auto Span Outlook so I can take advantage of both these screens on my phone to triage my email faster. Game Pass delivers an amazing experience on Surface Duo Two with touch controls. In partnership with Game Laugh, We are today announcing three standalone games which are completely optimized for Surface Duo: Asphalt Legends Nine, Modern Combat Five and Dungeon Hunter Five. The newly redesigned Your Phone app puts my Surface duo notifications front and center. I can use all my Android apps from my phone directly on my PC. I can copy paste content from my phone into my apps on Windows 11. - The last product I wanna show you and it's the most powerful Surface we've ever made. It's just better if I'm showing you. I gotta show you the product Chase. Can you, kind a if you always said you can move with me, so how about you move with me. I love this stage but let me just grab a device. Brittany, do you mind if I use your Surface? - Okay. Just really I just want to show the audience. And then Bob, can I use your table? Because I'm just gonna step down here. Is the lighting okay if I come down here? When you get in, it's unbelievably fast. Instant on Windows Hello 2.0. Just logs you in 14.4 inch pixel sense display. And then the track pad itself is so precise, it is our first haptic track pad. I'm in stage mode here. This is a mode where you can now watch a movie, play a game, get on a call and then so quickly and so smooth, you just fold it down. When you're in studio mode, there is so much that can happen here. So this is when you wanna be creative, but look, the pen is underneath. I'll pull it out. It's charging, never gets lost, always available. When I draw, I can feel the haptic feedback so it feels like I'm drawing on paper. You basically bring it back up from studio mode, into laptop mode and you're back into the form that you're so familiar with every day. Our new high definition 1080P camera creates brighter sharper images. Our new studio mics are exactly what you need with advanced echo control and full duplex, ensuring your voice is perfectly crystal clear on every single call you make. All these products will be available along with Windows 11 starting on October 5th. I'm so pumped. I can't wait for you to get your hands on these. You can go ahead and pre-order today. We want to thank you. Nothing inspires us more than watching you use products like these to change the world.",
    "transcript_keywords": [
        "Surface Duo",
        "Surface Slim Pen",
        "Surface",
        "Surface Pro",
        "Microsoft Surface Duo",
        "Surface Slim",
        "Pen",
        "Duo",
        "Surface Duo Glance",
        "Slim Pen",
        "Surface Pro heritage",
        "designed Surface Duo",
        "Intel EVO Platform",
        "Surface duo notifications",
        "Pro",
        "Surface Adaptive Kit",
        "announce Surface Slim",
        "Windows",
        "Microsoft Surface",
        "Gen Intel processing"
    ],
    "transcript_entity_values": [
        "zero",
        "Surface",
        "the Surface Adaptive Kit",
        "Today",
        "90",
        "Android",
        "Surface Duo Glance Bar",
        "43%",
        "over five and a half million",
        "three",
        "60%",
        "today",
        "Surface Slim Pen Two",
        "8.3 inch",
        "Surface Pro Seven",
        "Windows 11",
        "G6",
        "Quad Core 11",
        "Chase",
        "October 5th",
        "120",
        "5",
        "Surface Go",
        "Teams Chat",
        "Three",
        "Qualcomm",
        "Hertz",
        "Pro X",
        "Surface Slim",
        "two",
        "Microsoft Surface Duo",
        "nearly half a billion",
        "Bob",
        "Teams Meeting",
        "Corning",
        "Two",
        "Six",
        "75%",
        "Gen Intel",
        "32",
        "64",
        "Brittany",
        "Surface Duo",
        "Windows Hello 2.0",
        "Dolby Atmos",
        "Surface Pro",
        "14.4 inch",
        "Microsoft",
        "first",
        "Intel",
        "Dolby Vision",
        "Game Laugh",
        "RAM",
        "16 hours",
        "10"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "WORK_OF_ART",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL"
    ],
    "vector": [
        -0.12107865512371063,
        -0.04837222024798393,
        0.0635717362165451,
        -0.060944315046072006,
        0.1068670004606247,
        -0.010950411669909954,
        -0.013722050935029984,
        0.05906236916780472,
        -0.04429727792739868,
        0.01324615627527237,
        0.027548525482416153,
        -0.028035692870616913,
        -0.018821442499756813,
        0.0542350672185421,
        0.05570850521326065,
        0.041620466858148575,
        0.04763752222061157,
        -0.0948970690369606,
        -0.024050991982221603,
        0.07319691777229309,
        0.004682761617004871,
        -0.05028238892555237,
        0.018211619928479195,
        -0.07800128310918808,
        -0.03899083286523819,
        0.005733719561249018,
        0.01643477752804756,
        0.0237280260771513,
        -0.0023426073603332043,
        -0.0034789214842021465,
        0.004478980787098408,
        0.06469881534576416,
        0.007011495530605316,
        0.017745796591043472,
        0.057193856686353683,
        -0.07356105744838715,
        -0.01431765966117382,
        -0.009813510812819004,
        -0.05338829383254051,
        -0.0947558805346489,
        -0.07203251868486404,
        -0.09819655865430832,
        -0.016262197867035866,
        0.011539818719029427,
        0.13111738860607147,
        -0.02737499214708805,
        0.05534018576145172,
        -0.09572384506464005,
        0.03651844337582588,
        0.05478120967745781,
        0.0110249612480402,
        -0.14227333664894104,
        0.026924118399620056,
        -0.07020846754312515,
        -0.0625864639878273,
        0.06825660914182663,
        0.03293227031826973,
        0.010205096565186977,
        0.02791493944823742,
        -0.021051153540611267,
        0.06261643767356873,
        -0.10150992125272751,
        -0.01858966425061226,
        0.05576515942811966,
        -0.004654938355088234,
        -0.007164437789469957,
        0.03636274114251137,
        0.008702266961336136,
        -0.03442273288965225,
        0.017474202439188957,
        -0.05026179924607277,
        0.030087783932685852,
        0.018852071836590767,
        -0.0109243867918849,
        0.0601637028157711,
        0.031759340316057205,
        0.03444061055779457,
        -0.04540188983082771,
        -0.04478064551949501,
        -0.09748517721891403,
        -0.0006385408923961222,
        0.013316827826201916,
        -0.02521616593003273,
        -0.003432578407227993,
        -0.027306631207466125,
        -0.04318111762404442,
        -0.021239228546619415,
        0.018808599561452866,
        -0.011491821147501469,
        -0.02170003391802311,
        -0.084818035364151,
        0.06575430184602737,
        -0.015912679955363274,
        0.009445357136428356,
        -0.013687935657799244,
        -0.022724712267518044,
        -0.02781437709927559,
        -0.09422890096902847,
        -0.005987297277897596,
        0.03132104501128197,
        -0.03007754497230053,
        0.001932163955643773,
        0.03181406110525131,
        -0.020077327266335487,
        -0.01428811252117157,
        -0.060814354568719864,
        -0.006613440811634064,
        0.023085692897439003,
        -0.04982975497841835,
        0.0005735160084441304,
        0.0349126011133194,
        0.018076268956065178,
        -0.063252292573452,
        -0.008196413516998291,
        0.005745602771639824,
        0.04885268211364746,
        0.014475255273282528,
        0.044954318553209305,
        0.12308503687381744,
        -0.012028167955577374,
        -0.017876289784908295,
        0.02423996850848198,
        -0.05621074140071869,
        -0.03762530907988548,
        -0.032430294901132584,
        0.039972081780433655,
        -0.011049969121813774,
        5.8892626971341543e-33,
        0.020755385980010033,
        0.08728422224521637,
        -0.08534426242113113,
        0.008497096598148346,
        0.06019807234406471,
        -0.014652930200099945,
        -0.002312249271199107,
        -0.008979675360023975,
        -0.0054526664316654205,
        0.010560883209109306,
        -0.09898535907268524,
        -0.00044683259329758584,
        0.002098333789035678,
        0.006326774135231972,
        0.05073562636971474,
        -0.08894255012273788,
        0.011333937756717205,
        0.045813463628292084,
        -0.11291167140007019,
        0.011790563352406025,
        0.040364447981119156,
        -0.00767164072021842,
        0.005753117147833109,
        -0.0728921890258789,
        0.0535607635974884,
        0.09307445585727692,
        0.045520711690187454,
        0.0037312344647943974,
        0.07173244655132294,
        0.00850505381822586,
        -0.0652506873011589,
        -0.0274570994079113,
        -0.03640373796224594,
        -0.020667649805545807,
        -0.011844273656606674,
        -0.01706947758793831,
        -0.030372152104973793,
        -0.10113657265901566,
        0.057182688266038895,
        -0.0022942889481782913,
        -0.0823139026761055,
        0.026697348803281784,
        -0.008211145177483559,
        -0.05795922502875328,
        0.04333800449967384,
        -0.052387867122888565,
        0.007557819131761789,
        0.01307002454996109,
        0.08304594457149506,
        -0.016359573230147362,
        0.002750223036855459,
        0.04640701785683632,
        -0.03411028906702995,
        -0.0004936723853461444,
        -0.02520805038511753,
        -0.06486379355192184,
        -0.006724201142787933,
        0.0032148673199117184,
        0.08343280851840973,
        0.050780680030584335,
        0.03359377756714821,
        0.04729583114385605,
        -0.06434372812509537,
        -0.013487005606293678,
        -0.06651153415441513,
        0.0679607093334198,
        0.09964056313037872,
        0.017852213233709335,
        -0.05320040136575699,
        -0.026620497927069664,
        -0.04218590259552002,
        -0.02168228290975094,
        0.031029602512717247,
        -0.00534566817805171,
        -0.013630704022943974,
        -0.030573731288313866,
        -0.04068700969219208,
        -0.048902008682489395,
        0.02255159430205822,
        0.05581057071685791,
        -0.09320042282342911,
        0.10514923930168152,
        -0.02964211069047451,
        -0.09360791742801666,
        -0.05714937672019005,
        -0.0055290330201387405,
        0.006691553629934788,
        -0.033276911824941635,
        -0.020918505266308784,
        0.007389259524643421,
        -0.03616243600845337,
        -0.044590067118406296,
        0.019141651690006256,
        0.03445412591099739,
        -0.059156633913517,
        -7.813074547638002e-33,
        -0.06445393711328506,
        -0.009721922688186169,
        -0.04148555546998978,
        0.01432369276881218,
        0.02586444467306137,
        0.004382618237286806,
        0.03935643285512924,
        -0.02886315993964672,
        -0.054079819470644,
        -0.017987744882702827,
        0.014200691133737564,
        0.05037650838494301,
        0.04891875013709068,
        0.02597055584192276,
        -0.004226583521813154,
        0.025753261521458626,
        -0.08243881911039352,
        -0.03663931414484978,
        0.06964217871427536,
        0.02167540043592453,
        0.11436724662780762,
        0.05476781353354454,
        -0.025330020114779472,
        0.042879369109869,
        -0.005749996285885572,
        -0.023222729563713074,
        0.058845534920692444,
        0.0012550870887935162,
        0.05211004987359047,
        0.040702641010284424,
        -0.046934764832258224,
        -0.006127962376922369,
        -0.021244175732135773,
        0.04199833422899246,
        0.09832744300365448,
        0.020672408863902092,
        0.024624429643154144,
        -0.14461302757263184,
        -0.028678048402071,
        0.006920427083969116,
        0.05644462630152702,
        -0.046236056834459305,
        -0.011656554415822029,
        0.03261925280094147,
        -0.020285192877054214,
        0.017993157729506493,
        -0.04300636798143387,
        -0.004966897424310446,
        -0.023778870701789856,
        -0.02134169638156891,
        -0.033580001443624496,
        0.02228357084095478,
        -0.04212367907166481,
        -0.08284174650907516,
        -0.008703610859811306,
        -0.04736985266208649,
        -0.01481154840439558,
        -0.04382508993148804,
        -0.031105119735002518,
        -0.007381840609014034,
        0.02517206035554409,
        0.005730076692998409,
        0.011601656675338745,
        -0.005664218682795763,
        0.03961711749434471,
        0.12227627635002136,
        0.05301913619041443,
        0.0024168079253286123,
        -0.07097628712654114,
        3.819620542344637e-05,
        -0.039186298847198486,
        0.022376274690032005,
        -0.11395812779664993,
        -0.12345034629106522,
        -0.01798790879547596,
        0.01627739891409874,
        0.06252084672451019,
        0.023078711703419685,
        0.00781483855098486,
        -0.03869229182600975,
        -0.0289604589343071,
        0.04320463538169861,
        0.10622113198041916,
        0.057131703943014145,
        0.0820620059967041,
        0.017352677881717682,
        -0.060026004910469055,
        0.044796478003263474,
        -0.016294414177536964,
        0.03375208005309105,
        -0.03190320357680321,
        -0.0113093052059412,
        0.0023200318682938814,
        0.12412507832050323,
        -0.0291085597127676,
        -5.503891742364431e-08,
        0.025012971833348274,
        0.06731736660003662,
        0.09233299642801285,
        -0.03299679979681969,
        -0.008421032689511776,
        -0.07330211997032166,
        0.039575621485710144,
        -0.020306650549173355,
        0.011841963976621628,
        -0.004262619651854038,
        -0.06673544645309448,
        -0.09637303650379181,
        -0.02866881713271141,
        0.04992441460490227,
        0.11110488325357437,
        0.1473425328731537,
        -0.05671406909823418,
        0.06891874223947525,
        -0.04744693636894226,
        -0.07277960330247879,
        0.06991386413574219,
        0.009521126747131348,
        0.09086300432682037,
        -0.042763955891132355,
        0.012231950648128986,
        0.007470808923244476,
        -0.03167635202407837,
        0.044693078845739365,
        0.008792494423687458,
        -0.0667402595281601,
        -0.052399639040231705,
        -0.00570882111787796,
        -0.033475518226623535,
        0.018808050081133842,
        0.05476139858365059,
        -0.005408564116805792,
        0.024431375786662102,
        0.03922754526138306,
        0.08863996714353561,
        0.07721813768148422,
        -0.04958571866154671,
        -0.042787108570337296,
        -0.06851773709058762,
        0.023870395496487617,
        0.06461331993341446,
        0.026959605515003204,
        -0.049773603677749634,
        -0.10656438022851944,
        -0.05990143492817879,
        0.015714362263679504,
        -0.07262787222862244,
        -0.08551609516143799,
        0.036033257842063904,
        0.10862463712692261,
        0.013729746453464031,
        0.0955515205860138,
        -0.04334335774183273,
        -0.055546462535858154,
        0.0537593774497509,
        0.10248517245054245,
        0.07471630722284317,
        -0.0391572080552578,
        -0.04788012430071831,
        0.034138262271881104
    ]
}