{
    "id": "DA7C9nhuO1o",
    "title": "M2 MacBook Air - Drama-Free First Impressions - Krazy Ken’s Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2022-07-18T15:59:20Z",
    "video_url": "https://www.youtube.com/watch?v=DA7C9nhuO1o",
    "category": "Science & Technology",
    "tags": [
        "M2 MacBook Air - Drama-Free First Impressions - Krazy Ken’s Tech Misadventures",
        "M2 MacBook Air",
        "MacBook SSD",
        "MacBook Air",
        "macOS",
        "Apple",
        "Apple silicon",
        "Mac",
        "Midnight MacBook Air",
        "Final Cut Pro",
        "Topaz Sharpen AI",
        "GPU",
        "CPU",
        "Machine Learning",
        "Geekbench",
        "Speed Test",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Comedy",
        "Humor",
        "Tech",
        "Funny",
        "Computer",
        "Computer Clan"
    ],
    "views": 44921,
    "likes": 2040,
    "comments_count": 215,
    "description": "Sign up with Linode today and get a 60-day $100 credit   You can support this channel on Patreon! Link below Some \"drama\" about the new M2 MacBook Air might have some merit to it, but let's set that aside and just have a good time with some raw reactions and first impressions!  See rare & retro tech   Watch our tech scam-busting episodes   Download our epic wallpapers   Patreon!    Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord    Support the Computer Clan on Patreon   Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    The Carina nebula wallpaper was captured with the James Webb Telescope and produced by NASA and the Space Telescope Science Institute (STScI).  Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  0:00 - Introduction 0:45 - Unboxing 2:39 - Color, Design, and Comparison 3:48 - Inside the Mac 5:19 - Temperature Test (Real-world Apps) 9:05 - AI Software Speed Test 10:42 - SSD Speed 11:48 - Geekbench (M2 vs. Original Intel Air) 12:25 - Final Cut Pro Speed Test (M2 vs. Original) 13:14 - A Little Teaser  Correction: 12:01 The metrics between Geekbench 3 and 5 are different so these numbers really don't count. However, newer versions of Geekbench do not run on Mac OS X 10.6, so I could not test properly. Feel free to ignore these numbers. But ultimately, it just further proves that benchmarking (in most contexts) means nothingespecially when it's overdone and out of context.  NOTE: The 2008 Air is trickier to test due to lack of Geekbench 5 compatibility, but here is a 2009 benchmark for now:   #KrazyKen #ComputerClan",
    "description_links": [
        "https://linode.com/computerclan",
        "https://youtube.com/playlist?list=PLFWeyvvxf1rj0b0ROShJvi0E60KAyiwbn",
        "https://bit.ly/clan3o1EdZ2",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL",
        "https://browser.geekbench.com/macs/macbook-air-mid-2009"
    ],
    "transcript": "- Apple's brand-new M2 MacBook Air is here, and I love you guys. So I didn't wanna unbox the thing without you. So now that you're here, let's do that. Let's open it up, take it for a test spin. Let's see how hot it gets. It doesn't have a fan in it. And then we'll also do some comparisons to the first gen MacBook Air from 2008. So let's give started, sponsored by Linode. (upbeat music) Hey guys, how are you all doin'? If you're new here, welcome. My name is Krazy Ken. And this is the M2 MacBook Air, still shrink-wrapped, with all of its China air inside of it. So let's pop the cherry on this thing, and see what's inside. It helps if I pull the right way. And a fun thing about comparing this to the first gen MacBook Air, is you know, obviously there's gonna be speed differences, but there's gonna be a lot of appearance differences too. The MacBook Air has had that iconic wedge shape, ever since the beginning. And this is the first time they're getting rid of it. Where's the wedge? I guess they don't need it anymore. So that'll be interesting to take a look at. All right. The condom unit has been successfully removed. And here we go. Look at that. It's a wrapper. Those are so cool. We'll take a look at the smaller things first. This is fun. It's cool to see Apple getting back to colors now. Each MacBook Air has color-matched, braided, MagSafe cables. I did go with the Midnight color, 'cause that's a brand new color, I'm pretty sure, to the Mac line holistically. So designed by Apple in California. There's a surprise. Oh, hang on. It's stuck. Hang on. I got this. I am a trained professional intern. Wow. They're really stuck there. Look at that, guys. Midnight color matched Apple stickers. And now, we will unwrap the M2 MacBook Air. Probably should do it from the bottom first. Boom. Oh man. The feet on this thing are huge. That sounded weird. But you, you know what I mean? The paddy things on the bottom. Cool. That is a sexy color. That just nice, shiny midnight blue. There's some smudgy marks on there from the wrapper. That's not good. We'll just take those off. I just made the smearing like much more worse. I was trying to wipe it off with my shirt! That is hella thin, comparing to the first here. Let's see. They're about the same weight. I think this one's technically like 0.3 pounds less. But yeah, if we're looking at the evolution over 14 years, we have come a long way. I feel like Steve Jobs during that one presentation, where he was balancing the laptops on his hands. Whew, glad he didn't drop any of those. Hang on a second. Did you guys notice something? What the heck? There's like super small text on the bottom that says, \"Designed by Apple in California,\" with the model number on there and stuff like that. But it doesn't actually say, \"MacBook Air,\" anywhere. It does not say, \"MacBook Air,\" on the bezel anywhere. It doesn't say it on the bottom anywhere. Correct me if I'm wrong. But I think up until now, at least in the modern Mac line, the only Mac that doesn't have the product name on itself is the iMac. Interesting move. So something Apple did with the MacBook Air is they designed it along with the MacBook Pro. If we look, they both have the rounded corners, and the you know, overall flat edge design. So it's pretty much the same shape and everything. But smaller and thinner. And then of course, consequently, less ports. Let's flip it over and remove the bottom panel, and see what's inside. Well, time to bust out ye old iFixit toolkit, and the handy dandy pentalobe P5 bit. There are four P5 pentalobe screws on here. I guess Apple's just too cool for Phillip screws. Let's carefully remove the bottom panel, without destroying the galaxy, like that one time. (bright music) I have it all detached, hooks, whatever was in here, all popped out. All the screws are out, but this back part will not budge. I've tried so many different things. I'm not a hundred percent sure. - [MacBook] ...English as the main language. Press the return key. - Okay. Anyway, I eventually figured it out all by myself, without any help. Anyway, we can take this off now, and et voila. There are the insides of the M2 MacBook Air. And just like I predicted, a lot of it is battery. This whole thing is battery. And it looks like there's little tabs of some sort, four here, and four here. Here's the trackpad. I believe these little copper looking bits are part of the haptic feedback, so when you click it simulates an actual click feeling. these look like speakers. Under here would be the main board with the system on a chip as well. So yeah, pretty clean, pretty beautiful insides. And as you can see, there's no fan in here. It is a fanless design, so it does run quiet, which is nice. But we'll see how it performs, and how hot it actually gets. So I put a series of applications on here, including Topaz, Final Cut Pro, Sensei, Blackmagic Disk Speed Test, and Geekbench. And we're gonna take a look at how this thing performs with real world applications. And of course, we're just gonna do Geekbench for fun. Those numbers don't mean a lot in real life. I have a blooper reel I'm working on, open inside a Final Cut Pro 4K ProRes, and we're gonna export it, and do a 4K H.264 movie file. While that's running in the background, I'm gonna take this QuickTime movie of my iPhone 4 prototypes episode, and I'm gonna convert it to HEVC. So two things are gonna be encoding at the same time. And while that stuff is running, we will use Sensei to check the temperatures of all of the sensors inside the MacBook Air. And we'll also use Activity Monitor to check the CPU history of every core, and the GPU history as well. So I've never done this test before. Let's see what happens. and we'll let them chug along. And it just bumped up to seven minutes. Oh, eight minutes now. Interesting. Oh yes. And there's a notch. I didn't mention that yet. There is a notch on the MacBook Air, but I'm cool with that. It's on my MacBook Pro I don't even notice it. I love the rounded corners and thin bezels. The display is awesome. Anyway, so that's now going. Let's swipe over to the activity here. GPU is definitely going up. The efficiency cores are kicking in more than the performance cores are, but it is leveraging the GPU, and Final Cut Pro does do that a lot. So that seems normal. Logic board is at 113 degrees. I'm just feeling around, and it barely feels warm at all. I am curious though, I want to plug it into power, to see if these performance cores kick in. I'll try that quick. And we'll plug it in here. See if it does anything. Just to sum it up here in a percentage, we have 80% of the CPU load, which is idle right now, which I still don't understand. We could be going probably three or four times faster with this encode. Maybe someone in the comments can explain to me why macOS is doing this? It's not leveraging much of the processing power to do this export. The logic board did go up a little bit. It's at 124 degrees Fahrenheit right now which still isn't that terrible. But at the same time, the GPU is really the only thing doing a lot of work. Anyway, while we wait for this, I might as well mention, I did another MacBook Air related episode, all about the first-gen. It was a very nice retrospective. Go ahead and check that out. It was a lot of fun to make, and I'm sure you'll love it. To push this thing to its limits a little bit more, I installed Cheetah3D. I know for a fact, from many years of using this program, that this thing just doesn't care about the system. It just like uses all of the CPU power. It doesn't lag the computer, but it really uses everything to it's full power on the CPU. But it's not a GPU accelerated app. And it's basically gonna use this cube as a light source, and generate all of this bouncing light. And I'm just gonna render it with 1000 samples. So it's gonna keep iteratively, rendering the image cleaner and cleaner, for however long it takes. It's only at three samples right now. So it's got 997 to go. And let's see if, you see what I'm talking about? Look at those performance cores. Those are kicking in now. So I guess it really depends on the software. And this is a Rosetta app. This is Intel native. It is not Apple silicon native. Look at the logic board. It just jumped 30 degrees. Now we're getting somewhere. We're seeing a lot more green on this graph now. The palm rests area is pretty cool. Keyboard is like, oh yeah, it's definitely a little bit warmer on top, kind of Luke warm down here, much warmer up here. This spot right here, though, is kind of toasty. But yeah, I'd say around 160 degrees for the logic board, is the highest I could get this by running all of these things at once. Let's test another application that would be used in the real world, to do a real world task, Topaz, specifically Topaz Sharpen AI. It is a program that can take out of focus, soft and blurry photos, and it tries to sharpen them up using AI models, machine learning. Oh yes, we have to install the model files. How could I forget? Awkward moment, waiting for the software update to happen. So here is a raw CR2 right off the Canon camera. I'm gonna drop it into here. So right now, it's calculating for motion blur. It's been running, it ran for about five seconds, and it came up with a result. But we're gonna try something different. I'm not concerned with motion blur. I'm more concerned with just lens blur. It's just out of focus. So what we can do is, we can change the sharpen model, and we can say it's out of focus, very blurry. And then we can also pan the image here, to look at the subject, and see what it does. So it's calculating. Wow. That looks significantly sharper already. It calculated that in about two seconds. My buddy was running these tests on older Intel Macs, and they would take minutes at a time. Let's zoom out all the way, so it has to render all the pixels. And then I'm gonna remove a lot more blur. I'm gonna triple that, two, three, four. It ran for about seven seconds. I cranked up the settings, showed all the pixels, and it only took about seven seconds to apply the sharpen. And this is significantly sharper and crisper than that. And keep in mind, M2 is only gonna get faster from here. This is the entry level, with no active cooling. So disk speed test. There has been some talk that the M2 has a slower SSD than the M1 chips, or at least it's slower, on the lower end M2 configuration. That is weird. You would think the newer chip would be faster, or at least the same, in terms of the speed. But apparently it's slower. So let's take a look. On my M1 Pro MacBook Pro, I get about 4.3 gigabytes per second, write, and about 5.2 gigabytes per second read. So now with the M2, let's test it for the first time. We'll bust out Blackmagic Disk Speed Test. And we'll go ahead and run it. Here we go. Eeeee, that is slower. Oh, that's like way slower. I thought it might be like a little bit slower. That's like a quarter of the speed. Oh my gosh. Holy cow. It, like really choked there for a sec. Okay. Don't get me wrong. This is still pretty fast. I mean, I edit 4K video from a RAID, which gets only 220 megabytes per second, and I'm doing just fine. Most end users won't notice the difference. Okay. So that's one benchmark. Now just for fun, because I think everyone just wants to do it, we'll run Geekbench. Although take those numbers with the grain of salt. The MacBook Air first gen scored an 876 single-core score, and 1403 multi-core score. So let's go ahead and run the CPU benchmark. And our benchmark scores are here: 1888, and 8849. So the single core score is a little more than double, compared to the first gen MacBook Air, but the multi core score is like six times as much. So of course, yeah. I don't know what else we expected. That's a nice improvement. It's just cool to see the numbers. So I'm not done yet. I have another test I want to run. And for fun, I'm gonna compare it against the first gen MacBook Air. So I use Final Cut Pro all the time. Video editing is what I do for most of my professions. So this is based off of stuff I would do in the real world. So I have a project here, we're gonna export as 1080p H.264. When I did this on the first gen MacBook Air, the export time was 21 minutes and 59 seconds. Let's see how fast it is on a 14-year-newer computer. So, three, two, one, go. And done. That took less than 12 and a half seconds, compared to 21 minutes, about a hundred times faster of an export time. That is quite an impressive speed bump. Now remember that 6,000 Google Chrome tabs challenge I did over two years ago? I think that might be a fun test for the MacBook Air. So in an upcoming episode, really soon, I'm gonna run those scripts, and see if Apple's latest and greatest laptop, can open 6,000 Google Chrome tabs. My last test subject got to about 4,000. We'll see if this one can do it. And with half of the amount of RAM, on paper, anyway. Also speaking of fast computers, Linode has a bunch of them. If you have a website or application that needs to be scaled and deployed, Linode has the infrastructure, and the 24/7 support that you need. Linode offers out-of-box apps, for game servers like TF2, CS-GO, and even Minecraft. You can run your own virtual private network with Open VPN, build an online application with Joomla's content management system, or build a video streaming site with a multitude of app choices. There's so much you can do with Linode's affordable Linux virtual machines. And to boot, they offer award-winning 24/7 technical support. To put it simply if it runs on Linux, it runs on Linode. Visit linode.com/computerclan, and click one of the signup buttons. And when you do that, I will give you a $100, 60-day credit, just for watching this episode. Pretty good deal. And when you do that, you're also supporting the Computer Clan, so it's a win-win. Thank you very much. So the M2 MacBook Air, it is a really slick and thin machine, and that new midnight color is so sexy. This isn't a full review, of course. I just unboxed the thing before your very eyes. So these are just my first impressions. But I might post some follow up observations on my Twitter. So feel free to follow me there. And keep in mind, I release more tech episodes every week. I like making episodes about rare and retro tech, new tech, and of course, scam tech. And Hey, if you like this episode, you know what to do. Thanks. And I'll see you next time. Catch the crazy and pass it on. (upbeat music)",
    "transcript_keywords": [
        "MacBook Air",
        "gen MacBook Air",
        "Air",
        "MacBook",
        "Final Cut Pro",
        "Pro MacBook Pro",
        "MacBook Pro",
        "Cut Pro",
        "Apple",
        "gen MacBook",
        "Pro",
        "time",
        "thing",
        "test",
        "Final Cut",
        "Disk Speed Test",
        "MacBook Air related",
        "China air inside",
        "lot",
        "Linode"
    ],
    "transcript_entity_values": [
        "Rosetta",
        "the MacBook Air",
        "two",
        "SSD",
        "six",
        "GPU",
        "0.3 pounds",
        "about seven seconds",
        "four",
        "one",
        "many years",
        "only 220 megabytes",
        "Final Cut Pro",
        "AI",
        "21 minutes and 59 seconds",
        "Twitter",
        "minutes",
        "MacBook Air",
        "6,000",
        "M2 MacBook Air",
        "eight minutes",
        "Blackmagic Disk Speed Test",
        "Apple",
        "Linux",
        "100",
        "around 160 degrees",
        "HEVC",
        "about five seconds",
        "8849",
        "Final Cut Pro 4K ProRes",
        "60-day",
        "Mac",
        "the MacBook Air",
        "Joomla",
        "first",
        "4",
        "21 minutes",
        "iPhone 4",
        "macOS",
        "14-year",
        "about 4,000",
        "about 4.3 gigabytes",
        "MacBook Air",
        "Linux",
        "Linode",
        "Geekbench",
        "sec",
        "three",
        "two years ago",
        "the MacBook Pro",
        "less than 12 and a half seconds",
        "876",
        "24/7",
        "about 5.2 gigabytes",
        "M2",
        "80%",
        "TF2",
        "Google Chrome",
        "midnight",
        "M1 Pro MacBook Pro",
        "1888",
        "Krazy Ken",
        "Final Cut Pro, Sensei",
        "CPU",
        "P5",
        "Steve Jobs",
        "124 degrees Fahrenheit",
        "Phillip",
        "CS-GO",
        "Topaz",
        "Geekbench",
        "Minecraft",
        "Topaz Sharpen AI",
        "the Computer Clan",
        "14 years",
        "Sensei",
        "Luke",
        "VPN",
        "half",
        "1000",
        "about two seconds",
        "every week",
        "a hundred percent",
        "up to seven minutes",
        "The MacBook Air",
        "China",
        "Midnight",
        "Mac",
        "M2",
        "113 degrees",
        "1403",
        "2008",
        "P5",
        "English",
        "California",
        "30 degrees",
        "iFixit",
        "Activity Monitor",
        "RAM",
        "M1",
        "iMac",
        "Canon",
        "three or four",
        "997",
        "Intel Macs",
        "about a hundred",
        "second",
        "Intel",
        "signup",
        "Linode",
        "Topaz"
    ],
    "transcript_entity_types": [
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "TIME",
        "ORG",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "QUANTITY",
        "ORG",
        "TIME",
        "DATE",
        "FAC",
        "DATE",
        "ORG",
        "FAC",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "PERSON",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "TIME",
        "PRODUCT",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "DATE",
        "PERCENT",
        "TIME",
        "ORG",
        "GPE",
        "TIME",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "LANGUAGE",
        "GPE",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT"
    ],
    "vector": [
        -0.08991287648677826,
        -0.10016544908285141,
        0.05172305926680565,
        -0.08109472692012787,
        0.06247948855161667,
        -0.07699338346719742,
        -0.03268377110362053,
        -0.05664622038602829,
        -0.03225512057542801,
        0.007349119056016207,
        0.017818666994571686,
        -0.035437073558568954,
        0.009203806519508362,
        -0.049817897379398346,
        0.010460861027240753,
        0.018876314163208008,
        0.07118668407201767,
        -0.09453681856393814,
        0.0015327052678912878,
        0.05441068485379219,
        -0.021091854199767113,
        -0.05213525518774986,
        -0.04939534515142441,
        -0.014767203480005264,
        0.06810985505580902,
        0.006952934432774782,
        0.020186996087431908,
        -0.003242510836571455,
        -0.016116183251142502,
        -0.05877308547496796,
        -0.021330377086997032,
        0.017708024010062218,
        -0.03536771237850189,
        0.028986692428588867,
        0.0428377166390419,
        -0.045638442039489746,
        0.04483453929424286,
        -0.0413690023124218,
        -0.09098038077354431,
        -0.07313016802072525,
        -0.07324011623859406,
        -0.06578176468610764,
        0.021695679053664207,
        0.04414697736501694,
        0.0432351790368557,
        -0.03522895276546478,
        0.03846173733472824,
        -0.07243844121694565,
        0.06028927117586136,
        0.0137312151491642,
        -0.08532964438199997,
        -0.1567482054233551,
        -0.01961844600737095,
        0.048432741314172745,
        0.03769576922059059,
        0.04150928929448128,
        -0.03708580508828163,
        -0.1300213783979416,
        0.10659721493721008,
        -0.0667293518781662,
        0.011529672890901566,
        -0.057117946445941925,
        -0.03995087370276451,
        0.008695825934410095,
        0.01157953031361103,
        0.00508597306907177,
        0.021801121532917023,
        -0.006210253108292818,
        0.07022564113140106,
        -0.069614477455616,
        0.020287130028009415,
        0.005145474802702665,
        0.0021704367827624083,
        0.07684791833162308,
        -0.014566886238753796,
        0.04668479785323143,
        0.049875933676958084,
        -0.017382372170686722,
        0.08205727487802505,
        -0.034473590552806854,
        0.05097072198987007,
        -0.009336077608168125,
        -0.06499147415161133,
        0.02484806999564171,
        -0.006671614944934845,
        -0.0575229674577713,
        -0.07923239469528198,
        0.01746056228876114,
        -0.02142687886953354,
        -0.005492071621119976,
        -0.00863130483776331,
        0.005573515314608812,
        0.03174050897359848,
        -0.03394040837883949,
        -0.05038323253393173,
        -0.0547589547932148,
        0.07443170994520187,
        -0.02218717522919178,
        0.044437918812036514,
        0.06897018849849701,
        -0.01503834780305624,
        0.014188703149557114,
        0.018668480217456818,
        -0.018304521217942238,
        -0.03360786661505699,
        -0.017028462141752243,
        0.04478960484266281,
        0.029399173334240913,
        0.0871182233095169,
        0.03510670363903046,
        -0.029146092012524605,
        0.04499208182096481,
        -0.07088509202003479,
        -0.02117079682648182,
        -0.02755405381321907,
        0.04867522418498993,
        -0.024390364065766335,
        0.03651995211839676,
        0.016767427325248718,
        -0.04897201806306839,
        0.050480104982852936,
        0.057898279279470444,
        0.02268194779753685,
        -0.0037462052423506975,
        0.0762353390455246,
        -0.0006216791807673872,
        -0.04998503625392914,
        5.5663977453174585e-33,
        0.08098212629556656,
        0.07438908517360687,
        0.002293284982442856,
        0.02697751298546791,
        0.09840238094329834,
        -0.02392788603901863,
        -0.04306473210453987,
        0.08064126968383789,
        -0.047949496656656265,
        -0.018924983218312263,
        -0.11139698326587677,
        0.004295234568417072,
        -0.09218594431877136,
        0.014517562463879585,
        0.021671000868082047,
        -0.010051548480987549,
        0.0013294307282194495,
        -0.09902086108922958,
        -0.05961626395583153,
        0.08387112617492676,
        -0.0279985424131155,
        0.011198109947144985,
        -0.01622522436082363,
        0.0020903076510876417,
        0.013389323838055134,
        0.06430621445178986,
        0.008722545579075813,
        0.011053074151277542,
        0.058491405099630356,
        0.07631316781044006,
        -0.04877886548638344,
        0.006652330979704857,
        0.009256746619939804,
        -0.04254629462957382,
        0.01989074796438217,
        -0.08436071127653122,
        -0.06932517141103745,
        -0.09776272624731064,
        0.03441929817199707,
        0.018638936802744865,
        -0.0365644134581089,
        0.026566755026578903,
        -0.09978347271680832,
        -0.02002554200589657,
        -0.04069117084145546,
        -0.007290629204362631,
        0.05329851433634758,
        0.02381254732608795,
        0.038816455751657486,
        0.043586209416389465,
        0.007966793142259121,
        8.714402065379545e-05,
        -0.03377217799425125,
        0.0067998734302818775,
        -0.017197662964463234,
        0.04823268577456474,
        0.046550534665584564,
        -0.07856446504592896,
        0.006719750817865133,
        0.038100484758615494,
        0.0774293765425682,
        0.07050054520368576,
        0.11961935460567474,
        0.09110889583826065,
        -0.09937336295843124,
        0.08155346661806107,
        0.038809966295957565,
        0.0565127469599247,
        -0.046265602111816406,
        0.017257163301110268,
        -0.0746714398264885,
        0.026948731392621994,
        0.05664575472474098,
        -0.0939897745847702,
        -0.013904498890042305,
        -0.023894095793366432,
        -0.07164911180734634,
        0.02604757994413376,
        -0.10186827182769775,
        0.03200168162584305,
        -0.0356055311858654,
        -0.06158680096268654,
        0.04059433192014694,
        -0.045954134315252304,
        -0.02734541706740856,
        0.027430469170212746,
        0.06230103224515915,
        0.025073157623410225,
        -0.0032125464640557766,
        -0.03647323325276375,
        0.009418617933988571,
        -1.6678019164828584e-05,
        0.03424106165766716,
        0.03507881239056587,
        -0.10341290384531021,
        -6.296406920484962e-33,
        0.031023330986499786,
        -0.077581487596035,
        -0.005886496510356665,
        -0.012118416838347912,
        -0.003276048693805933,
        0.052721887826919556,
        0.01740914024412632,
        -0.0007941178046166897,
        -0.07209932804107666,
        0.01383406762033701,
        -0.0005274622817523777,
        0.05570608377456665,
        -0.06389173865318298,
        -0.121016725897789,
        0.040236037224531174,
        -0.043271780014038086,
        0.0004070574068464339,
        -0.036477647721767426,
        -0.06218969449400902,
        -0.05286002531647682,
        0.09808951616287231,
        -0.005468886811286211,
        -0.01778356358408928,
        -0.010861730203032494,
        0.0237263273447752,
        0.0014511418994516134,
        0.07632118463516235,
        0.03463355079293251,
        0.004393148235976696,
        0.042231492698192596,
        -0.0005234766867943108,
        0.03676082566380501,
        -0.0008361021755263209,
        -0.03703989461064339,
        0.059329595416784286,
        0.04822196438908577,
        0.09519097208976746,
        -0.050563327968120575,
        -0.020334377884864807,
        -0.02297867462038994,
        0.04958721250295639,
        0.053738437592983246,
        -0.0993884801864624,
        0.016360685229301453,
        -0.025985432788729668,
        -0.008634310215711594,
        -0.021457819268107414,
        0.04570638760924339,
        0.029313836246728897,
        -0.030432624742388725,
        0.03986431285738945,
        -0.062029145658016205,
        0.06884205341339111,
        -0.014037230052053928,
        -0.032999396324157715,
        0.03592550382018089,
        -0.009561113081872463,
        0.12917354702949524,
        0.10837459564208984,
        0.013754598796367645,
        -0.031955424696207047,
        -0.08302712440490723,
        -0.05683983862400055,
        -0.07883260399103165,
        0.017019301652908325,
        0.005983238108456135,
        0.034966714680194855,
        0.07160833477973938,
        -0.019866684451699257,
        0.05737908184528351,
        -0.017780596390366554,
        0.030966565012931824,
        -0.013664067722856998,
        0.0011745006777346134,
        0.06035739183425903,
        0.07658958435058594,
        0.018950991332530975,
        -0.08085350692272186,
        -0.008071974851191044,
        -0.011424120515584946,
        -0.010397754609584808,
        0.03392094001173973,
        0.07604227215051651,
        0.07303055375814438,
        0.054448749870061874,
        0.03402424603700638,
        0.007631080225110054,
        0.05630230903625488,
        -0.07733610272407532,
        0.0034321940038353205,
        -0.03192005306482315,
        -0.016363246366381645,
        -0.013258296065032482,
        0.03762322664260864,
        0.022149721160531044,
        -6.48075868525666e-08,
        -0.01709313876926899,
        0.022212093695998192,
        -0.023280346766114235,
        -0.020662682130932808,
        0.010004780255258083,
        -0.08189857751131058,
        -0.03838330879807472,
        0.019222667440772057,
        0.08264907449483871,
        -0.01074363011866808,
        0.06777671724557877,
        -0.06453850865364075,
        -0.059578921645879745,
        0.0008800426148809493,
        -0.0006411509239114821,
        0.03725733608007431,
        -0.06516237556934357,
        0.04490695521235466,
        -0.03425237908959389,
        -0.018241215497255325,
        0.06122145429253578,
        0.018001683056354523,
        0.0894518718123436,
        -0.029666293412446976,
        0.00603311276063323,
        0.008585264906287193,
        -0.024628648534417152,
        0.12678132951259613,
        -0.008490180596709251,
        -0.02922423928976059,
        -0.10511550307273865,
        -0.037380024790763855,
        -0.062073443084955215,
        -0.009175600484013557,
        -0.028940580785274506,
        -0.05614003911614418,
        -0.07332342863082886,
        0.03296895697712898,
        0.09912687540054321,
        0.05099987983703613,
        0.014479120261967182,
        -0.08955402672290802,
        -0.03840074688196182,
        0.010990645736455917,
        -0.028365235775709152,
        0.07594075798988342,
        -0.051880642771720886,
        -0.050850462168455124,
        -0.026296868920326233,
        0.009337933734059334,
        0.05401664227247238,
        -0.04332209378480911,
        0.04108940064907074,
        0.040392953902482986,
        -0.0519467256963253,
        0.03243126720190048,
        0.03983774036169052,
        -0.009637795388698578,
        0.01304243877530098,
        0.05686565861105919,
        0.10410658270120621,
        -0.045616913586854935,
        -0.12880083918571472,
        0.02015550062060356
    ]
}