{
    "id": "dCkn0o3lrgQ",
    "title": "Fake Portable AC Scams: Blast Auxiliary, BreezeMaxx, Blaux - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2021-07-15T17:59:27Z",
    "video_url": "https://www.youtube.com/watch?v=dCkn0o3lrgQ",
    "category": "Science & Technology",
    "tags": [
        "Blast Auxiliary BreezeMaxx Blaux (ALL SCAMS) - Krazy Ken's Tech Talk",
        "Blast Auxiliary",
        "BreezeMaxx",
        "Blaux Portable AC",
        "Scam",
        "Air Conditioner",
        "Tech Scam",
        "Scam Ad",
        "Social Engineering",
        "Cyber Attack",
        "Swamp Cooler",
        "Tech",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "Computer Clan",
        "Scam-Busting",
        "Twitter",
        "ProPods",
        "AirPods Max",
        "AirPods Max Knock-Off",
        "Apple"
    ],
    "views": 750286,
    "likes": 29551,
    "comments_count": 2966,
    "description": "You can support this channel on Patreon! Link below The portable \"air conditioner\" ads just WON'T STOP! So let's dissect them! (Don't fall for them; they are a scam.) Watch the beginning of this insane Blaux scam-busting saga:   Watch more scam-busting episodes   Check out our rare tech playlist   Download our epic wallpapers    Read / Listen to \"Influence\"   Highly Recommended Support our channel and get cool stuff   Subscribe and listen to our podcast    Follow us on Twitter   Like us on Facebook     Patrons got to see this episode early. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://youtu.be/GQdtfRHJTHQ",
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1riKzQK3dHt6c9_6D2lVwr78",
        "https://bit.ly/clan3zlKXX9",
        "https://thecomputerclan.com/wallpapers",
        "https://amzn.to/3kzSTPZ",
        "https://Patreon.com/KrazyKen",
        "https://applekeynotechronicles.transistor.fm",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Man, it is just hot as BALLS down here. I know I'm 10 stories underground, but it's still hot. So, I thought I'd take this time to revisit one of my more popular scam busting sagas regarding these portable AC products. They're absolute (beep) by the way. So come on, let's take a look. (bright music) Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken and the Blaux ads just don't stop coming. Well, sometimes they do, but they're kind of under a different brand name now. I'll explain more about that later. Here's the plan for today? I want to recap my experience with Blaux. Then I want to explore a few Blaux imposters, if you will. And then I want to re debunk this whole product category on a technical level wholistically. So, if you're ready, let's dive in. Back in July, 2020, I released a Krazy Ken's tech talk episode about the Blaux portable AC. A product which claims it can cool a room from 95 degrees to 65 degrees in only six minutes. And it was invented by \"top Hong Kong engineers.\" And this person was just a model from a stack photo and an alternate version of their fake backstory claimed a 15-year-old genius created the product. But the kid's real name is Santiago and he's a computer programmer, not an AC maker. Yeah, the Blaux people made up a fake backstory, made fake claims and slapped an $89 price tag on this piece of garbage. Another problem with these products is they're advertised with the abbreviation AC which most people would assume means air conditioner in this context. But the advertisers are trying to be sneaky. It's really air cooler in this context because these things don't have any of the main components you need to be make an air conditioner like a condenser or a compressor or an evaporator or refrigerant. None of that stuff is in here. It can't do any real cooling. In short, it's just a miniature and very ineffective swamp cooler. It took months for me to receive my product after I ordered it and when I got it, it wasn't even the model I ordered. And when I tested it, it didn't do anything. Thankfully, the Blaux people refunded my money and let me keep the product. Oh yeah, they reached out to me. I didn't reach out to them. They're aware of what I'm doing. Their legal department got ahold of me. Now, when I make these scam busting episodes, it's not my goal to take down a brand or a company, not at all. But I have been able to successfully do that like what happened with Cardieo and Lit Mobile? Those things shut down relatively shortly after I released my episodes. With Blaux, it seems like the Blaux name itself is dying down, but the products are still spreading under different names such as Blast Auxiliary and BreezeMaxx. And also what the fudge is this thing? Did the Blue Man Group make an air conditioner? Truly, it wouldn't surprise me if most of these brands are controlled by a single parent company. But I can't confirm that yet. But if anybody has any insights, feel free to DM me on Twitter. And I kid you not, one of these portable AC brands took one of my episodes and ran it as a YouTube add. Why would you even do that? I'm not saying anything good about your product. Why would you do that? The world makes no sense. But Hey, thanks for the free views, I guess. So the ad led to an article on foxdoing.com and it was called \"the best portable air conditioners in 2021\" which is a huge problem because they're not saying air cooler or AC this time they are straight up saying air conditioner, which we've already shown these are not. So that's just a lot of misleading information there. But one of the brands I saw on that website was Blast Auxiliary. Hey wait a minute, Veo decipher that text for me. - [Veo] Sure thing, Ken. - Now yeah, that makes more sense. While we're on the topic, let's take a closer look at these Blast guys. This Blast Auxiliary ad claims the product can refrigerate a room in under five minutes. With a fan that's smaller than what I've seen in most PCs, that's not possible. The ad proceeds to talk about how the air conditioner industry has just a few name brands and that they can set whatever price they want. And it also talks about how temperatures are rising around the world, which yeah, I guess is really the only honest part of the ad but we'll come back to that in a minute. The most confusing part of this ad is what I've seen on that article before. These Blast Auxiliary brand logos are everywhere but you see the word Blaux on the product itself. My hypothesis is that Blast Auxiliary is just a rebrand of Blaux. I'm just guessing though. They're probably changing the name to try to make more sales but they already have inventory of branded products that they need to sell. But here's another interesting tidbit. According to Google Trends, the search interest for Blaux was increasing and it peaked around the time I made my episode last year. Then it started falling really quickly. But then a little while after maybe I don't know, six months or so, the search interest for Blast Auxiliary started increasing and they didn't intersect at any time. Coincidence? Maybe, but it's a noteworthy observation. So back to the rising temperatures thing. Yes, it's hot outside. And that's an easy trend for the advertisers to play off of to entice you to buy more product. But there's another thing they mentioned which has come up before in my other scam bustings. The greedy corporation trope. So the advertisers are positioning the corporations as the bad guy in this hero versus villain story, right? And the advertisers, the Blaux or Blast Auxiliary people they're positioning themselves as the hero, which to many consumers sounds pretty good, right? You get a cool tech product, it's at an affordable price and at the same time you get to stick it to the big wigs. Oh yeah, who wouldn't want that deal. But none of it's real. People learn most effectively through story. But they can also be manipulated through story. This is a form of social engineering in which advertisers really try to influence you to just buy their product and then stick around and buy more especially when they keep texting you and emailing you all the time, which does happen to me. But I put up with it because it's kind of my job. Con artists have used social engineering tricks for centuries but with the advent of the internet, these tactics have rapidly spread across the world and they are very common in cyber security attacks. There's other influential tactics that we've seen on the show before. Like those fake scarcity countdown timers, oh, no time is running out, I better buy something or limited supply. Hey, if there's something not available, that just makes us want it more, right? Or, \"hey, there's a discount. \"I don't know when the discount is gonna come back. \"I'd better buy now.\" Most of the time, those are just marketing tricks too. So honestly this is a mega rabbit hole and it's not really fitting for me to go down it. But I do encourage you to read the book \"Influence\" by Robert Cialdini. It will help you understand influence more so you can be more influential, hopefully in a good way. But it will also help you identify when you're being targeted by tricky marketers and these scam people. So I highly recommend that. Check it out, not a sponsor, just a happy customer link in the description. Nut in the words of the late Billy Mays, I'm not done yet. There's another brand that is reared its ugly head, BreezeMaxx. But before we jump into that, I just wanted to give you guys an update on my ProPod scam investigation. So their website disappeared and I messaged them on Twitter asking what happened and then they blocked me. So I think it's fair to say, I can move on to the next stages of the scam busting. So make sure you're subscribed and stay tuned for that followup episode. It's going to be a lot of fun. And if you haven't seen part one of that scam busting, feel free to check that out too. Okay. Let's take a look at BreezeMaxx, The BreezeMaxx video ad talks about a high school Physics teacher who built a cost-free air con solution. Well, you already failed at that because your device costs about $90. They claim he destroyed the billion dollar air con industry with the device that pumps out ice-cool air. And then they proceed to show footage of a liquid cooled PC. You know, just like we saw in the Blaux ad, suspicious. And then they claimed it cooled the room from 95 degrees to 65 degrees in just six minutes. Don't get ahead of yourself. Not even a 10,000 BTU real air conditioner can do that. Then they claim it can cool a room from 100 degrees to 65 degrees. Pick a number. More inconsistencies equals more red flags. Then they say, this is all possible thanks to patented IceReservoir technology while showing an animation of a scroll compressor, a common component in real air conditioning, nothing special. And remember the footage that was stolen for the Blaux ads, the scenes from the kid programmer documentary? These guys use some of the same clips for their phony ad. They're not even trying anymore. And I love this part where they say, get ready to experience an ultra refreshing atmosphere in every and the lady proceeds to walk outside. You know, a place where you don't use air conditioning. So there's at least three brands in this space. But there's zillions more, let's be honest. But some are better than others like these Arctic Air Units I saw at a home depot. They're 40 bucks as opposed to 90 bucks and at face value, the box isn't full of false advertising and false claims at least from what I can see. So that's a little bit better to give them credit. But I still wouldn't recommend them because fake advertising aside, there's a technological problem with these types of products, here's why. First off, these products have low power fans. The companies twist the truth to make it seem like your electric bill will be lower which is technically correct, but trade-off and the trade-off is the fan is so weak you can barely feel a breeze. Allow me to demonstrate. I have a top secret tool that measures wind power. It's called a piece of paper. So, I'm gonna put it in front of the unit and we're gonna turn it on full speed, here we go. (AC fan revs) Impressive, right? And again, these units don't use refrigerant or any standard components you'd find in a real air conditioner. The second issue is maintenance. With these types of products, you usually have to refill them with ice and/or water constantly. You'd have to do that with every unit you own and the ice will melt in about a half hour. So if you have four of these things, four times in a half hour, you're gonna have to run around and refreeze ice and refill water containers. It's just a huge mess. The third issue is moisture. Since they work like a swamp cooler, they emit humidity into the room. Which could potentially be good in drier climates but if you're in a humid environment, especially a hot humid environment, adding more humidity to the room, isn't gonna help you feel cool. In fact, it might make you feel hotter or stickier. So just straight up bad. And truthfully, not much humidity was produced by the Blaux Classic. Most of the melted ice didn't evaporate, it nearly dripped into the tank. And this unit doesn't have a pump. So unlike a traditional household swamp cooler, the water cannot be recirculated through the water curtain forcing you to empty it out each time the ice melts. Which brings us to the fourth issue, cost. They claim that these are cheaper than normal air conditioners. Yeah, okay, you're right. But there's a problem with that. They're not nearly as effective. Unfortunately, I've seen plenty of emails from people saying they regrettably bought these in bulk. Which again is another marketing trick these guys like the pull. By the time you buy four of them, you're gonna to be spending about 300 bucks, which the company values at in insane, almost $720 value. And honestly, with that $300 you could buy about I'd say almost a 10,000 BTU maybe an 8,000 BTU real air conditioner and have much better results. Or at least get to 5,000 BTU air conditioners. Feel free to tell me your own experiences with Blaux or similar brands and feel free to subscribe for more tech episodes all the time. I love making episodes about rare and retro tech, new tech and of course, scam tech. And make sure you stick around for that ProPods follow-up, it's gonna be awesome. But until next time, just do me a favor, stay cool until then, it's a hot world out there. And if you liked this episode, you know what to do. Thanks and I'll see you next time. Catch the crazy and pass it on. (bright upbeat music)",
    "transcript_keywords": [
        "Blast Auxiliary",
        "Blaux",
        "air",
        "air conditioner",
        "time",
        "product",
        "real air conditioner",
        "Blast",
        "Auxiliary",
        "Blast Auxiliary brand",
        "real air",
        "BTU real air",
        "products",
        "make",
        "conditioner",
        "Blast Auxiliary people",
        "Blaux people",
        "scam",
        "BTU air conditioners",
        "brands"
    ],
    "transcript_entity_values": [
        "Ken",
        "2020",
        "300",
        "Google Trends",
        "third",
        "ProPods",
        "Blaux",
        "the Blue Man Group",
        "a minute",
        "about 300 bucks",
        "about a half hour",
        "Blast",
        "5,000",
        "six months or so",
        "Blaux",
        "Billy Mays",
        "10,000",
        "Veo",
        "only six minutes",
        "40 bucks",
        "Impressive",
        "second",
        "at least three",
        "today",
        "DM",
        "Krazy Ken",
        "Krazy Ken's",
        "YouTube",
        "just six minutes",
        "IceReservoir",
        "zillions",
        "8,000",
        "months",
        "fourth",
        "under five minutes",
        "Influence",
        "AC",
        "15-year-old",
        "2021",
        "Santiago",
        "Blaux",
        "four",
        "one",
        "10",
        "Robert Cialdini",
        "Cardieo and Lit Mobile",
        "First",
        "Arctic Air Units",
        "almost $720",
        "the Blaux Classic",
        "90 bucks",
        "Blast Auxiliary",
        "centuries",
        "Twitter",
        "89",
        "BreezeMaxx",
        "95 degrees to 65 degrees",
        "about $90",
        "billion dollar",
        "Hong Kong",
        "July",
        "100 degrees to 65 degrees",
        "a half hour"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "MONEY",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "NORP",
        "ORG",
        "TIME",
        "MONEY",
        "TIME",
        "LOC",
        "CARDINAL",
        "DATE",
        "GPE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "TIME",
        "MONEY",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "PRODUCT",
        "MONEY",
        "FAC",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "GPE",
        "DATE",
        "QUANTITY",
        "TIME"
    ],
    "vector": [
        -0.13740113377571106,
        -0.04944830760359764,
        -0.0038300128653645515,
        -0.05139477550983429,
        0.06839162111282349,
        0.04932992160320282,
        0.08966176956892014,
        -0.02581591159105301,
        -0.04221835359930992,
        -0.06900321692228317,
        0.04429091140627861,
        0.06336591392755508,
        0.050130296498537064,
        -0.06180095672607422,
        0.014470212161540985,
        0.03890928626060486,
        0.0756106823682785,
        -0.08335810899734497,
        -0.05478470027446747,
        -0.028309840708971024,
        -0.058195728808641434,
        -0.08041039109230042,
        -0.021541202440857887,
        0.015962526202201843,
        0.04228007048368454,
        -0.023899121209979057,
        -0.009418695233762264,
        0.04324449226260185,
        -0.0012028086930513382,
        -0.056868113577365875,
        0.04511532187461853,
        0.03290760517120361,
        0.06244298815727234,
        -0.01697513274848461,
        0.0738348439335823,
        -0.06258796155452728,
        -0.013552755117416382,
        -0.017981937155127525,
        -0.05827219411730766,
        0.017609063535928726,
        0.0232306607067585,
        -0.047677118331193924,
        -0.057601895183324814,
        0.02051776647567749,
        -0.042973510921001434,
        -0.017700154334306717,
        0.013983013108372688,
        0.009095849469304085,
        0.09656531363725662,
        0.0669679045677185,
        0.006698310375213623,
        -0.05326598882675171,
        0.05763482674956322,
        0.024232586845755577,
        -0.07242479175329208,
        -0.014053796418011189,
        0.006612978409975767,
        0.0013746677432209253,
        0.06276129186153412,
        -0.02702813223004341,
        0.04650019109249115,
        -0.033590830862522125,
        -0.024761667475104332,
        0.005068704951554537,
        -0.02936938963830471,
        0.019695524126291275,
        -2.0639108697650954e-05,
        0.09693942219018936,
        0.014535456895828247,
        -0.07746618241071701,
        -0.057842008769512177,
        0.020116491243243217,
        0.03345165401697159,
        0.08666626363992691,
        0.05093860253691673,
        0.06530313193798065,
        -0.033772699534893036,
        -0.13266810774803162,
        0.014189735986292362,
        -0.07311399281024933,
        0.06161290779709816,
        -0.05900319665670395,
        -0.07446838915348053,
        -0.040550246834754944,
        0.025054695084691048,
        -0.01069308165460825,
        -0.026452092453837395,
        -0.024285370483994484,
        -0.014030680060386658,
        -0.04157618433237076,
        -0.05709360912442207,
        0.07100611180067062,
        0.07513199746608734,
        -0.03875377029180527,
        0.037129808217287064,
        0.005677695851773024,
        0.015750261023640633,
        -0.06575942784547806,
        -0.05872930586338043,
        0.07068059593439102,
        -0.02692185528576374,
        0.02870759926736355,
        0.03741217777132988,
        -0.06726709008216858,
        -0.044186461716890335,
        -0.10023879259824753,
        -0.013125850819051266,
        0.07039383053779602,
        0.1085372045636177,
        -0.01126900315284729,
        -0.009668165817856789,
        0.05969598516821861,
        -0.017644982784986496,
        -0.09084878116846085,
        0.05038700997829437,
        0.09197475016117096,
        -0.05251387879252434,
        0.04852277785539627,
        0.05073587968945503,
        -0.09537018090486526,
        0.05561908707022667,
        0.01738574542105198,
        0.01483047753572464,
        -0.00704408111050725,
        0.08711771667003632,
        -0.044727031141519547,
        -0.031412914395332336,
        6.77390741946836e-33,
        -0.021325809881091118,
        0.1352003812789917,
        -0.039127882570028305,
        0.04213609918951988,
        0.04407082870602608,
        -0.059988074004650116,
        -0.009730780497193336,
        0.05599956959486008,
        -0.045754529535770416,
        0.0673089325428009,
        -0.027897097170352936,
        0.07078942656517029,
        0.0038925684057176113,
        -0.014660341665148735,
        -0.004886031150817871,
        -0.11073243618011475,
        -0.06482060253620148,
        -0.025808729231357574,
        -0.0020659156143665314,
        0.016795910894870758,
        0.049197252839803696,
        -0.008766062557697296,
        -0.006297304295003414,
        0.02240101806819439,
        0.03429550305008888,
        -0.04433681070804596,
        -0.009190398268401623,
        0.024021966382861137,
        0.14974018931388855,
        0.028511174023151398,
        -0.04453946650028229,
        0.06285443156957626,
        -0.00303223030641675,
        -0.005456064362078905,
        -0.0007796972058713436,
        -0.01986684650182724,
        -0.0985674038529396,
        -0.11230621486902237,
        -0.02197396196424961,
        -0.056661248207092285,
        -0.04582909122109413,
        0.004728242289274931,
        -0.09290168434381485,
        0.0009628601837903261,
        -0.025402994826436043,
        -0.007273434661328793,
        -0.0050526829436421394,
        -0.005425944924354553,
        0.07725878059864044,
        -0.006568796932697296,
        -0.033979568630456924,
        0.06615564227104187,
        -0.05678953975439072,
        0.0064979298040270805,
        0.019664930179715157,
        -0.054504141211509705,
        0.00808132253587246,
        -0.03143167123198509,
        0.09136076271533966,
        -0.010462386533617973,
        0.1155700832605362,
        0.03955850005149841,
        0.03367049619555473,
        -0.01099331770092249,
        -0.15029826760292053,
        -0.038324374705553055,
        0.06418722867965698,
        0.012224995531141758,
        -0.014720548875629902,
        0.05237022414803505,
        0.016893140971660614,
        0.005757266189903021,
        0.043934695422649384,
        -0.06979651004076004,
        -0.0002353880845475942,
        -0.0012829108163714409,
        -0.05360933393239975,
        0.0060947248712182045,
        -0.08909928053617477,
        -0.037692368030548096,
        -0.012485078535974026,
        -0.05939202755689621,
        0.0885663777589798,
        0.07245253026485443,
        0.027759026736021042,
        -0.0049465070478618145,
        -0.005916830617934465,
        -0.02717498317360878,
        -0.04504894092679024,
        -0.06891617178916931,
        -0.016799695789813995,
        -0.009050166234374046,
        0.009392542764544487,
        0.07597166299819946,
        -0.03332675248384476,
        -6.1344568597202675e-33,
        -0.0236744936555624,
        0.0013958103954792023,
        -9.356978262076154e-05,
        -0.07975184917449951,
        0.009295502677559853,
        -0.007004565559327602,
        -0.004057730082422495,
        0.06476114690303802,
        0.029077548533678055,
        0.043442562222480774,
        0.000381563906557858,
        0.06199689581990242,
        -0.05367600917816162,
        -0.05124758556485176,
        0.05733379349112511,
        -0.07612795382738113,
        0.009009022265672684,
        -0.01804758794605732,
        -0.0139319384470582,
        0.011027376167476177,
        0.0400395430624485,
        0.048683736473321915,
        -0.013268272392451763,
        0.05408701300621033,
        -0.047728121280670166,
        0.04952629283070564,
        0.05387916788458824,
        0.10699202865362167,
        0.0703825056552887,
        0.07112419605255127,
        0.02671186439692974,
        0.03382229804992676,
        -0.06973080337047577,
        -0.05280058830976486,
        0.03251442313194275,
        0.006105210166424513,
        0.05127337947487831,
        0.013398556038737297,
        -0.10399702936410904,
        -0.08473299443721771,
        0.0674227774143219,
        -0.00591312674805522,
        -0.10013234615325928,
        -0.024376364424824715,
        -0.012390821240842342,
        -0.05635643005371094,
        -0.031238550320267677,
        -0.055921778082847595,
        -0.013082469813525677,
        -0.006355049088597298,
        0.059617120772600174,
        -0.06240863725543022,
        0.04965104162693024,
        0.0023390953429043293,
        -0.036612916737794876,
        0.011314235627651215,
        0.008060768246650696,
        0.055555108934640884,
        0.06210602447390556,
        -0.028482895344495773,
        0.008839519694447517,
        -0.02171524614095688,
        -0.020053008571267128,
        -0.0212924275547266,
        -0.0006874497048556805,
        -0.0052012791857123375,
        0.1240525171160698,
        0.07510296255350113,
        -0.017540546134114265,
        0.02500280551612377,
        0.011755308136343956,
        0.04335920885205269,
        -0.03238696977496147,
        -0.009641192853450775,
        -0.03669758513569832,
        0.044349368661642075,
        0.05159538984298706,
        -0.03351927548646927,
        -0.056122954934835434,
        0.005924167577177286,
        -0.011928361840546131,
        -0.008423915132880211,
        0.034152816981077194,
        0.03257846087217331,
        0.0615515299141407,
        0.020151523873209953,
        0.025528712198138237,
        -0.009248539805412292,
        -0.02454286441206932,
        0.043141718953847885,
        0.02326310984790325,
        -0.021683642640709877,
        0.03287500888109207,
        0.08835338801145554,
        0.049233049154281616,
        -6.167295651948734e-08,
        -0.021357513964176178,
        0.09238021075725555,
        0.007319406606256962,
        0.0037779384292662144,
        0.03671113774180412,
        -0.09840231388807297,
        -0.017664236947894096,
        -0.039517249912023544,
        -0.010320953093469143,
        -0.017681725323200226,
        0.04515994340181351,
        -0.07216408103704453,
        -0.02130458503961563,
        0.01647339202463627,
        0.03649885579943657,
        0.0017144947778433561,
        -0.1330636441707611,
        0.06721433252096176,
        -0.03840415179729462,
        -0.06807474792003632,
        -0.034542426466941833,
        0.026667961850762367,
        0.1034788191318512,
        -0.038276564329862595,
        -6.121737533248961e-05,
        0.030832691118121147,
        0.0369349829852581,
        0.02853395603597164,
        0.10902875661849976,
        0.03325950726866722,
        -0.09615050256252289,
        -0.02577119506895542,
        -0.03999772667884827,
        -0.08924773335456848,
        -0.0015806612791493535,
        0.016484059393405914,
        -0.02534298412501812,
        -0.0024878745898604393,
        -0.015074530616402626,
        0.053909704089164734,
        0.00137103081215173,
        -0.08508460968732834,
        0.004464845638722181,
        0.010130557231605053,
        -0.010626873932778835,
        -0.021231230348348618,
        -0.09914623945951462,
        -0.07968305051326752,
        0.11075697839260101,
        0.02883332595229149,
        0.022551830857992172,
        -0.06880505383014679,
        -0.011662837117910385,
        0.025563575327396393,
        0.01944362372159958,
        -0.048594214022159576,
        -0.05472341552376747,
        0.02766769751906395,
        0.05160414054989815,
        0.07530346512794495,
        0.01759093627333641,
        -0.011787689290940762,
        -0.05103432014584541,
        0.05006420984864235
    ]
}