{
    "id": "DEE0SGQRC4c",
    "title": "NEW 120TB SERVER UNBOXING 🐙 Jellyfish by Lumaforge",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-02-04T18:51:02Z",
    "video_url": "https://www.youtube.com/watch?v=DEE0SGQRC4c",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "jellyfish server",
        "how to set up a server",
        "lumaforge",
        "unboxing",
        "server unboxing"
    ],
    "views": 606441,
    "likes": 15379,
    "comments_count": 2053,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and today you may notice that I'm sort of in my office but not really in my office. I've got a lot of explaining to do. But first, we've got something very, very, very exciting in front of me. This is the Jellyfish by LumaForge. Hi, Matty. Do you know what we're doing today? Did mommy get a new server? I think she did! Okay, let's unbox. (knife scrapes) Did I cut something important? (box ripping) (knife slices) Oh, wow! Now this is the question that I have for myself. How do I get it out? So step two, find friends! (laughs) Okay, but Matty, you're not helping any. Okay, Matty, I gotta get this. I gotta get this out of here. (laughs) Okay, Matty, you gotta back up. Yay! I mean, that is so protected in there! This is so freaking cute. How many people call servers cute? So since this is sort of a temporary office set up, I will show you guys later down the line when I actually have everything finished, but I'm gonna temporarily place it in here. But the good thing is, it's actually not very loud at all, so it's really not gonna be a big deal. Oh, I've got a little note! Welcome to the family. Alright, so here it is. Next up, we've got a few hard drives. My goodness. Oh gosh, that's super heavy! Matthew, inside of here are hard drives. Can you move your face, please? (knife scrapes) I am definitely handling with extreme care. (knife scrape) (gasps) Oh, wow-ee! So here's all of our drives, and now, it's time to install. We've got our steps, one, two, three. Finish unpacking, done. Step two, set up instructions. And then I guess I probably won't have any other questions, so we're done at two. We're gonna put it over here for the time being 'til we find you your permanent home. I kinda like lookin' at you. You look good. So the reason that I'm moving it now is because once I put all these hard drives in, it's gonna be really heavy. Wow, it's like you were made for this spot. Okay, so we're gonna start, well what would Drake do? Would he start from the bottom? Hmm. I'll start from the top. So we have 120 terabytes and there'll 80 usable. (hard drive clicks) (lightheated music) (hard drives clicking) So great! Do you wanna put one in, Jen? It's really fun. - So I just go? - That's right! Yeah. - This is a lot of pressure. Oh, that is fun! - Look at that! Wasn't that great? - That was fun! - You wanna do another one? - Okay! Are you just putting me to work? (laughs) - That's what little sisters are for. You disguise it as a really fun task. (hard drive clicks) (both gasp) - Oh, wow. - Oh, I wanna do this one. - Okay. - So I think maybe next year at CES, you guys should do a race to see who can put the drives in the fastest. I used to participate in the computer building race. Do you remember that? - I remember that! - My only goal was to not come in last. I used to build PCs back in the day, guys. I know it's hard to believe, but... I had a whole other life in high school. Are you ready? (hard drives click) That was so incredible. They're like little fingers. (hard drives click) And that's it. We've got our two spare drives, so I'll put those somewhere safe. Oh wait, what's my next step? Plug it in? Yeah, I definitely wanna get a battery back-up. (music starts playing from Echo) Perfect Circle! - [Man] You listen to A Perfect Circle? - Ugh, Tool's my favorite band. - Really? - So I've just been getting my Tool fix. Oh, do you wanna come see this? Look at this, look what I'm doing back here. Super riveting. I'm about to plug in the power cable. Are you ready for this? I don't know if you guys are. I enjoyed it. On! We have lift-off! We're on to our next step. Super simple, we basically are plugging in this Cat7 cable into the back of the Jellyfish and then into my iMac Pro. So sit down if you're not sitting down already. (playful music) And now we're installing the Jellyfish app. (stutters in shock) It's installed! Alright, here we go, auto set-up. Configuring my connection. And that's it. That's absolutely--so that's it! We did it. We set it up. Can I change the name of it? It is booted up, we've got the iJellyfish, which is what I renamed it to, on the desktop. So I'm gonna show you guys how quick and easy this is. I'm gonna move in one of my project files and it is copying over. But while that's happening, we're going to set up my Macbook. So we've got this Thunderbolt ethernet adapter here. So we're gonna plug this in. Don't mind my cord management, this is temporary. I say that and then it's here three months later. It's mounted. Oh my goodness, this is so exciting! There is my $2,000 iPhone case project file. It's also over here. So here it is, this is running directly off the server. Hey it's Justine, and today we're checking out a very expensive iPhone case. Wow, wow, wow, this is so exciting! What's great about this is Jen and I both wanna be able to edit, and I also wanna expand my team, so being able to have something that multiple people can work off of is gonna be so amazing. So it has been a few days since I had my server installed, and I'm so excited about it because I've been editing the past few videos that I posted here on my channel directly off of that server, and it's been so fast. It's also been really great because Jenna now has sort of her own section of it. Jenna, we're gonna add a share here. JennaFish. It's for you! So we both are editing our videos at the same time off of the same server being able to transfer files easily. And sometimes, there'll be something where she's like hey, can you take a look at this? I have a question, and I'm able to actually just have her close her project file, I open it up with my computer. I can make the edits, close it, she can open it and basically just continue where I left off. I felt like I had to do kind of a wrap up to what you guys just saw because I was editing and I was like hold on a second, I kinda just was all over the place unboxing it. I wanted to give you guys some specs and answer a few questions that you guys might have. But I am so excited because this year is definitely the year that I need to build out my team because I'm still editing and shooting a lot of these videos myself, and it takes a lot of time. So for me to continually grow and actually keep myself sane and healthy, I think it's something that needs to be a priority and building out the team, having someone be able to help me edit, is gonna be a huge, huge help. So that's something that I'm super excited about, and that core part of that is being able to have a central place to store all of that footage and also be able to edit simultaneously off of. So this current configuration that I have right now that you saw me set up has eight 10 gigabyte ethernet ports and it has eight one-gigabyte ethernet ports. There's 120 terabytes total, and 79 of those are usable. So there's 20 total hard drives installed, and four of those drives can fail before you lose any data at all. It also has 256 gigs of RAM and two solid-state drives, and as I need more storage, which I mean, potentially maybe if I start shooting everything in 8k, that's gonna actually expand to 480 terabytes. They also have even larger towers that can be expanded up to one petabyte, which is a lot of storage. Also, a lot of you guys were asking what happened to the other server that I have and I still have it and I still use it. So with that, I have basically all of my old archived footage on, I have everything from when I first started making YouTube videos. What I'm excited about with the Jellyfish is that this is something that is going to be mostly worked directly off of for editing and it is basically made as a really great workflow for teams, and especially teams using Final Cut. As you guys know, I'm a huge Final Cut fan. So I guess my editing background, I guess, goes back to college, so I think I first started editing in Premiere in like 2004, which is a really long time ago. From Premiere, then I also did After Effects. I also was into 3D, so I did 3D Studio Max. I did Maya. After that, I got a graphic design job, and from the graphic design job, I went and got an editing job editing Avid. This guy was like hey, do you know how to edit Avid? I was like yeah, of course I do! Right out of college thinking I can figure out Avid! Ahh! So then I taught myself Final Cut in 2005, and then 2006, I started my YouTube channel, and then I've been Final Cut ever since. When Final Cut 10 all switched over, a lot of people kind of jumped ship, and I'm so happy that I didn't because I really love Final Cut, I love the interface, I love the work flow, and for what I do, I feel like it is honestly perfect. Anyway, I just wanted to wrap up this unboxing video. I'm so excited about the server. I'll be giving you guys another update on how I'm using it, and definitely, I would love to give you a look into my workflow. I'm trying to simplify it a little bit and kind of make it more work friendly for other people because when I'm editing myself, I kind of just throw everything in a folder and I'm like I'm done, I've got this. But when you're working with a team and other people, there needs to be some sort of standard work flow so that everyone is kinda working off of that same thing. So that is definitely something that I am working on and trying to figure out what the best, most efficient way is. So if you guys have any suggestions, I would absolutely love to hear those. Feel free to leave them in the comments below, or actually it's probably even easier if you just tweet it to me because that would also be super helpful. A lot of the times, most of the tips and tricks that I've learned in Final Cut is just word of mouth, like someone would see me doing something and they're like hey, here's a better way to do that. Well I'll see you guys in my next video and don't forget to subscribe so you'll see more videos and also hit that bell too so you'll be notified when I actually post. See you later. (relaxing music)",
    "transcript_keywords": [
        "Final Cut",
        "guys",
        "cut",
        "Final",
        "editing",
        "drives",
        "lot",
        "hard drives",
        "server",
        "kind",
        "Matty",
        "love Final Cut",
        "wow",
        "huge Final Cut",
        "Jellyfish",
        "videos",
        "hard",
        "time",
        "put",
        "excited"
    ],
    "transcript_entity_values": [
        "2,000",
        "one-gigabyte",
        "80",
        "Macbook",
        "Matty",
        "second",
        "eight 10 gigabyte",
        "one",
        "Drake",
        "Justine",
        "CES",
        "iMac Pro",
        "256",
        "iPhone",
        "iJellyfish",
        "20",
        "2004",
        "three",
        "the day",
        "2006",
        "JennaFish",
        "Maya",
        "Final Cut 10",
        "YouTube",
        "Avid",
        "A Perfect Circle",
        "the year",
        "2005",
        "four",
        "Matthew",
        "one petabyte",
        "120 terabytes",
        "Jen",
        "three months later",
        "RAM",
        "Premiere",
        "79",
        "Final Cut",
        "eight",
        "today",
        "this year",
        "next year",
        "two",
        "480 terabytes",
        "8k",
        "a few days",
        "Final Cut",
        "first",
        "LumaForge",
        "Max",
        "Jenna",
        "Jellyfish"
    ],
    "transcript_entity_types": [
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "NORP",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "DATE",
        "ORG",
        "FAC",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT"
    ],
    "vector": [
        -0.02295142412185669,
        -0.10171560198068619,
        -0.039020176976919174,
        -0.13484199345111847,
        0.002756564412266016,
        0.03868473693728447,
        0.03213558718562126,
        0.027892552316188812,
        -0.05087079852819443,
        0.0693608969449997,
        0.03242262080311775,
        0.009018740616738796,
        -0.015247619710862637,
        -0.03286093845963478,
        -0.001896619563922286,
        0.04678177461028099,
        0.028594044968485832,
        -0.03643827512860298,
        -0.004936139564961195,
        0.0341399721801281,
        -0.028761126101017,
        -0.07256010919809341,
        -0.00399952894076705,
        -0.024865878745913506,
        -0.0027195645961910486,
        0.08235042542219162,
        0.024847816675901413,
        0.04245205968618393,
        -0.11471986770629883,
        -0.09139031171798706,
        -0.015685303136706352,
        0.013532846234738827,
        0.07876034826040268,
        0.0013102521188557148,
        0.02405277080833912,
        -0.03588491678237915,
        0.02119727060198784,
        -0.016948426142334938,
        -0.018205268308520317,
        -0.01755383238196373,
        0.023511620238423347,
        -0.018344324082136154,
        0.0011411565355956554,
        0.016069984063506126,
        -0.08100014179944992,
        -0.07683360576629639,
        -0.03138170391321182,
        -0.09425757825374603,
        0.023076966404914856,
        0.0250876322388649,
        -0.05590752139687538,
        -0.029556918889284134,
        0.03282032161951065,
        0.04633782431483269,
        -0.08605058491230011,
        -0.012102773413062096,
        -0.11044202744960785,
        0.04390380159020424,
        0.02639041841030121,
        -0.08191768825054169,
        0.009009761735796928,
        -0.022387435659766197,
        0.011440795846283436,
        0.024778518825769424,
        -0.040838174521923065,
        -0.0390060693025589,
        0.023031337186694145,
        -0.006655463948845863,
        -0.016696909442543983,
        0.011378249153494835,
        -0.12011126428842545,
        0.061182986944913864,
        -0.06992056220769882,
        0.03432434797286987,
        -0.02286427654325962,
        0.048366397619247437,
        0.05713149905204773,
        -0.04292864352464676,
        -0.018530860543251038,
        0.05181816965341568,
        0.034345295280218124,
        -0.04525313898921013,
        -0.06411238014698029,
        -0.03150489553809166,
        0.009651645086705685,
        0.015410400927066803,
        -0.0011082460405305028,
        0.02874233014881611,
        -0.0561830960214138,
        -0.06758822500705719,
        -0.07444886118173599,
        0.003267700783908367,
        0.02187154069542885,
        0.017102232202887535,
        -0.007511277683079243,
        -0.05974360927939415,
        -0.0445079505443573,
        -0.028213270008563995,
        -0.06143376976251602,
        0.0731821060180664,
        0.0361541323363781,
        -0.07008685916662216,
        0.027190668508410454,
        -0.053159359842538834,
        -0.049284812062978745,
        -0.1212569922208786,
        -0.03983396664261818,
        0.03885113447904587,
        -0.002135129179805517,
        -0.010626042261719704,
        -0.0758446604013443,
        0.05244216322898865,
        -0.05329492315649986,
        -0.03968558460474014,
        -0.014168222434818745,
        0.10695075243711472,
        -0.038667529821395874,
        0.07139423489570618,
        0.011711833998560905,
        0.012351206503808498,
        0.023735549300909042,
        -0.09773726761341095,
        -0.004154569003731012,
        0.04554198309779167,
        -0.018611496314406395,
        0.02455952577292919,
        -0.06390290707349777,
        1.4145932813257994e-32,
        -0.005546506028622389,
        0.016237156465649605,
        -0.02748854272067547,
        0.07544318586587906,
        0.007442794740200043,
        0.02142091654241085,
        -0.006250110920518637,
        0.10308743268251419,
        -0.05502423644065857,
        0.00835069827735424,
        0.003560562850907445,
        0.06912686675786972,
        -0.03455160930752754,
        0.04181289300322533,
        0.009570248425006866,
        -0.044934213161468506,
        0.029531538486480713,
        -0.050407376140356064,
        -0.033062130212783813,
        -0.027183562517166138,
        -0.014156762510538101,
        -0.0024567688815295696,
        0.009241171181201935,
        0.07516422122716904,
        0.08329847455024719,
        0.07477495074272156,
        0.03552619367837906,
        -0.013094492256641388,
        0.07040321081876755,
        0.023398591205477715,
        -0.04642714187502861,
        -0.10215548425912857,
        0.0033840152900666,
        -0.03797180578112602,
        0.006288327742367983,
        0.027852293103933334,
        -0.054370444267988205,
        -0.008677106350660324,
        -0.012154638767242432,
        -0.04802672564983368,
        -0.0006453194655478001,
        -0.012433027848601341,
        -0.06885159760713577,
        -0.03658154979348183,
        0.08474497497081757,
        0.03788931667804718,
        0.012118225917220116,
        0.04395090788602829,
        -0.022063996642827988,
        0.023920705541968346,
        -0.011179386638104916,
        -0.010702714323997498,
        -0.0432715006172657,
        0.014540369622409344,
        -0.013453220017254353,
        -0.057074952870607376,
        -0.03966676443815231,
        0.08625897020101547,
        0.05161773040890694,
        0.060080770403146744,
        0.02465057373046875,
        0.004514182917773724,
        -0.020474163815379143,
        -0.03675961121916771,
        -0.04432970657944679,
        0.10655355453491211,
        0.04252305626869202,
        -0.0620410293340683,
        0.010715126059949398,
        0.05002446845173836,
        0.010824008844792843,
        -0.02311295084655285,
        0.09257432073354721,
        0.042234744876623154,
        0.026993196457624435,
        0.06215676665306091,
        -0.08742226660251617,
        -0.07424666732549667,
        0.010986550711095333,
        -0.02771075628697872,
        -0.0892186313867569,
        0.09326858818531036,
        -0.010483691468834877,
        0.10303761810064316,
        -0.022536978125572205,
        -0.05100106820464134,
        0.017932584509253502,
        -0.0053466749377548695,
        -0.045208465307950974,
        0.044314999133348465,
        -0.008515939116477966,
        0.08241618424654007,
        -0.07737316191196442,
        -0.02074972726404667,
        0.004143416881561279,
        -1.2920055305191525e-32,
        0.022111710160970688,
        0.04470358043909073,
        -0.030383795499801636,
        -0.0009217375190928578,
        0.06979746371507645,
        -0.012323588132858276,
        0.07028936594724655,
        0.10434523969888687,
        0.07977928966283798,
        -0.04473135620355606,
        0.050025008618831635,
        -0.10194215178489685,
        -0.140398308634758,
        -0.015165193937718868,
        -0.01996021345257759,
        -0.030940299853682518,
        -0.041542865335941315,
        -0.06900747120380402,
        0.06664027273654938,
        -0.023766392841935158,
        0.06445833295583725,
        0.15367598831653595,
        0.09624439477920532,
        0.03643836826086044,
        0.010202527046203613,
        0.01894228905439377,
        0.018084177747368813,
        0.08427309989929199,
        0.03611817955970764,
        0.05178159102797508,
        -0.022771034389734268,
        -0.041426025331020355,
        -0.006934706121683121,
        -0.014007629826664925,
        -0.0032689981162548065,
        0.05936932563781738,
        0.036765702068805695,
        0.060304176062345505,
        -0.014699134975671768,
        -0.07080730050802231,
        0.0071257189847528934,
        -0.02515297383069992,
        -0.043059661984443665,
        -0.012739398516714573,
        0.01608591340482235,
        -0.09421658515930176,
        -0.051255036145448685,
        0.0019137150375172496,
        0.025973021984100342,
        -0.0028292404022067785,
        -0.06640929728746414,
        -0.07457643002271652,
        -0.014040582813322544,
        -0.019528310745954514,
        -0.002899055602028966,
        0.011647013016045094,
        -0.06371552497148514,
        -0.015740742906928062,
        0.05784499645233154,
        0.016357243061065674,
        0.08042598515748978,
        -0.032205358147621155,
        -0.06088244542479515,
        -0.0574943870306015,
        0.012189757078886032,
        -0.044208113104104996,
        0.0953405499458313,
        0.03876110538840294,
        -0.012134058400988579,
        -0.002103343838825822,
        -0.04484013468027115,
        0.040003322064876556,
        0.02546342834830284,
        0.011406800709664822,
        0.059128355234861374,
        0.021705560386180878,
        -0.11489807069301605,
        0.01337068434804678,
        0.09848230332136154,
        -0.028012314811348915,
        -0.047516725957393646,
        -0.015401801094412804,
        -0.008725344203412533,
        0.09662364423274994,
        0.09873384237289429,
        0.052309129387140274,
        0.10622712224721909,
        -0.024489978328347206,
        -0.032995015382766724,
        0.02196032740175724,
        0.02198030985891819,
        0.04073302820324898,
        0.07173137366771698,
        0.13519200682640076,
        -0.05789661779999733,
        -6.257604923121107e-08,
        0.0394153892993927,
        0.011355699971318245,
        -0.046245962381362915,
        0.01392566878348589,
        0.02079654671251774,
        -0.09868399053812027,
        -0.010172086767852306,
        0.03985252231359482,
        0.08679956942796707,
        -0.06900790333747864,
        0.07368186116218567,
        -0.04498268663883209,
        -0.010013517923653126,
        0.12806066870689392,
        0.040866363793611526,
        0.03198901191353798,
        -0.0881580263376236,
        0.07665778696537018,
        -0.03966591879725456,
        -0.019558317959308624,
        -0.015976203605532646,
        0.0596955269575119,
        0.06303860247135162,
        0.0026741530746221542,
        0.04941176250576973,
        -0.007492830511182547,
        -0.02001679502427578,
        -0.023086238652467728,
        0.03727922961115837,
        0.02095971629023552,
        -0.07145155221223831,
        -0.016264669597148895,
        0.019587382674217224,
        0.006777109112590551,
        -0.07661949098110199,
        -0.023697592318058014,
        -0.07554436475038528,
        -0.04012567922472954,
        0.014682094566524029,
        0.026263903826475143,
        0.02071460895240307,
        -0.09932245314121246,
        -0.043104276061058044,
        0.0023195405956357718,
        0.022684818133711815,
        -0.07095114886760712,
        0.0354142040014267,
        -0.037171073257923126,
        -0.06088012084364891,
        -0.04400433599948883,
        -0.03376861289143562,
        0.046967409551143646,
        0.036116961389780045,
        -0.03779473900794983,
        0.0713767558336258,
        -0.017204197123646736,
        0.05625411495566368,
        0.07142649590969086,
        0.008917787112295628,
        0.013812113553285599,
        0.025266816839575768,
        0.01719905622303486,
        -0.07010447233915329,
        0.02197708562016487
    ]
}