{
    "id": "dgEvBkBdfRM",
    "title": "I'M VLOGGING AGAIN BUT ON THIS!!!!! 😂",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-08-19T23:09:56Z",
    "video_url": "https://www.youtube.com/watch?v=dgEvBkBdfRM",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "kando",
        "shotover",
        "drone"
    ],
    "views": 120793,
    "likes": 5304,
    "comments_count": 490,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and I'm at Kando 3.0. I'm actually filming this video at the end of the event but it is such an amazing, inspiring few days that I got a chance to spend with some really amazing creators and photographers. And behind me, the moon is rising over the mountains! It is absolutely beautiful. We're in Bend, Oregon and we're at this place called Sunriver and it has been such a fun few days. So I'm going to show you guys some vlog footage here that I filmed with the RX 100 Mark VII. And right now I've got my favorite setup. I've got the microphone just plugged in directly to the camera. We also got a chance to check out the Sony A7R IV and it is also absolutely incredible. We shot some really cool photos with that, so I will share some of those with you here as well. Do you wanna see Nori? Nori! Hi, Nori! Nori is the Queen of Kando. Nori! Nori, are you eating grass? I think she's eating some grass. (ambient violin music) We're about to get the best tracking shot ever of Jen and I riding these bikes. Curtis, you guys may remember, we did the moon livestream that one day. - We're getting weird out here in Oregon, you know. - [Justine] Yeah, this is crazy. - [Curtis] Like we're shooting with some great technology. - [Justine] Dude, this thing is insane. - Yeah, so it's basically a six axis stabilized gimbal. You can stabilize up to a 1000 millimeter lens. - [Justine] Yeah. - And you can track on the ground from a boat, from a helicopter, whatever. Just like, it makes in kind of unfair, it's like the lazy persons-- - But you drove this from LA, right? - Yeah. - It's great. Today, we are going to track some very quality content. Jen and I riding these bicycles, of course, compliments of B&H with the B&H flag. - Just focus right here, and then you have your zoom right there. Lots of time people operate, you kind of have your thumb resting on the zoom rocker. - [Justine] It's pretty cool. I'm going to be controlling the shot over, Jenna is going to be behind me and I'm going to be attempting to follow her and focus and zoom all at the same time. Do you think I can do it? - Mm-hmm - (mumbles) - She's got it. - Cool. All right. - [Curtis] Here, I'll be your filmer. - Okay. - (high pitch) Hello. - This is incredible. So, where did Jenna go? - [Curtis] There's a lot going on there, you got kinda, you know. - [Justine] Yeah. - [Curtis] Will you be the crash course and shot over? - [Justine] I already got it, I'm good, I'm ready. - [Curtis] All right, good, sweet. All right, send it! - Oh my gosh, this is the coolest thing. - Go! - [Justine] Ever. - Look at it. We got a big old gimbal there. Stable as it gets. Look at that talent . That's some talent, right there. Justine here on the sticks. - Yeah my focus though, I'm not really good at focusing. - [Curtis] You better get good at focusing. You better get good at tracking. (pop music) No one ever sees me, sees me, I'm losing every battle - Bonified pro operator here - [Justine] Oh yeah, this is great. - This is like pretty legit, actually. Can somebody save me, save me I'm losing every battle - Great content, great use of the shot over. - [Curtis] (chuckles) So what do you think? What happened? - Okay, number one, got a little motion sickness. But number two, this was so much fun, I mean, basically, it felt like I was playing a real life video game, like tracking Jenna. It was really fun. - So cool. - I can't wait to look at my footage. - How cool though? - My only problem was the focus. It's really hard to pull focus and, you know, you're moving around and there's a lot of stuff happening. - [Curtis] You did a pretty good job, though. - Thank you, thank you. - Well, let me tell you what, everyone was super impressed and like \"what is that?\" But they were not impressed with the subject matter of the tracking. They were like \"are they tracking her?\" (pop music) - [Justine] While in Bend, Oregon, you have to go to the last Blockbuster. This is the last one open. Ever. Anywhere. And we're here. I don't know what we are going to do, probably going to buy some water because I'm really thirsty. - We can't buy something to return because we- - We don't live here. - We won't return it. - We don't buy stuff here right? I don't know, we're gonna find out though. We're gonna go in. - [Jenna] No public restroom is available, that's for sure. - It is. Could you take my photograph, Jenna? - Yeah, man. - I would like to take a picture of me watching a YouTube video in front of Blockbuster. - All right. Excuse me, excuse me - [Justine] Okay. I'm losing every battle No one ever sees me, sees me, I'm losing every battle No one ever sees me, sees me, - [Justine] Hello. I used to come and rent movies with my family like all the time. Oh my God, it is my favorite movie ever. You guys are going to probably think that I'm weird but this is one of my favorite movies ever. If you haven't seen it, I don't know, would recommend it. - [Jenna] Do you feel like you are in the 90s, or? - I don't know, man. Another one of my favorite movies. See, I feel like we've time traveled. It looks like they have t-shirts and stuff for sale so like they probably sell more t-shirts then movies here. Definitely have time traveled. There it was. Blockbuster. And now we go. We're heading back, we're gonna get dinner and I think there is some other activities. Jenna wants to go to a night shoot. There is so much stuff that we can do. - There is so much stuff to do. - I'm over whelmed. (ambient music) So right now we are shooting a little behind the scenes video here of making huber animation. I'll put a link right here to the Instagram. This is our second try. Spoiler. (ambient music) Got the shot. - Hi. - It is so early but we are going on like a 4 mile hike, it's some Smiths rocks or something - [Jenna] State park - It's a state park and we're going super early so that we can be back for all of the Kando activities. I don't even think I slept last night. Like at all. - It's still nighttime. - We have to get coffee and waters, I've got my satphone, I've got my RX 100 Mark VII. I've got extra batteries, we do have to go. (soft ambient music) - [GPS] Turn right onto Smith Rock Way. (soft ambient music) - This is... We are not even a minute into this hike yet. We're not even out of the parking lot, it's so beautiful. I didn't bring the A7R IV because I didn't want to carry it so I said I'm only bringing what I can carry but like I could have left in the car. - I have mine. - But I had all the lenses - Oh, you did have all the lenses - I have messed up - That in a long lens would have looked really cool - [Justine] Shh, shut. This looks to me like we go Chute trail. (upbeat hopeful music) - [Jenna] 200 mil zoom. Pretty far. - We are not even a mile in yet, just so you know. - How many miles? - It's like four, four mile loop. The whole first part of this is around the river. He has a little smudgey. So we entered this hike, I got nervous because I saw a bunch of rock climbers, I was like crap, do we have to like climb? And the RX 100 Mark VII, what I love about it is it will automatically orientate your videos, so if you start shooting vertically, it'll know that you're shooting vertically and it prepares the video for you, to post on Instagram stories. - That's great - I know. Look how pretty this is. Look at that vertical video lifestyle. (fast uplifting music) Why does that say most difficult? - [Jenna] I've never seen that before. - Me either. This was rated moderate. We're on it know so here we go. What I've found from all trails is their definition of moderate, it's not the same definition that I have. It is called \"Misery\". - It's called, I mean, it's not called like \"Happy Trail\". (laughs) - Look at that! It looks like a face. We just passed the people who were rock climbing. They climbed up and over the mountain, now they are going down so they definitely made way better time then were making. In the beginning it was like We were good to each other, yes we were And then a room full of people - We made it to the top, I thought it was actually going to be way more difficult, I mean going up this part was pretty strenuous but I thought it went up for a lot further, now that we're here. There's the little face that we saw. We went all the way round the mountain, from over here, round here, up. Here's a 360 shot over the ledge. Yeah, I'm not getting any closer. Don't look down. Yeah as we dove in deep The water turned cold - I'm outta here! 'Cause we are different dreams So we can never grow old - Apparently, there's another ridge and we just made it there. We're on our way down now, and it is just like the coolest views, it is just really awesome. It's way cooler than I thought it would be. Strangers again It's sad to know, it's sad to know, it's sad to know - Complete, two hours, 18 minutes. I'll hit done. Yes, I'd like to save it. Strangers again Strangers again A part of me is living a lie I won't shoot -- - Behind the scenes. (machinery roaring) - Right now, we are shooting something super exciting. We are at this really cool location and we are shooting Carson doing some really crazy BMX tricks. We've got the drone, Curtis has his shot over which you guys saw me use previously, Jenna has the A7R IV. - Yo! - [Justine] You got that 400 on there? The 100, the 400. - The 100 to 400. There's a lot going on. - Okay, time to fly. (uplifting dance music) - [GPS] Take the first exit onto Abbot Circles. Turn left onto Manor Road. Take the first exit onto Abbot Circle. - Good morning. - [GPS] Turn left. - Good morning. It's early we are going to find the sunrise - [Jenna] Wait, that's it? - [Vivian] We are totally in the wrong lane. - Do not enter. - [Jason] That car messed up. - Don't do it, don't do it, don't do it! - [Justine] (laughs) No, it's super confusing. We have heard. Jason and Vivian are back there. - [Vivian] Its so dark. - It's really great back-lit. We'll see that in a second when the sun rises. Okay, so we made it here. We have to be quiet because there are people camping all around us. We're already getting some good shots. - [Jenna] It's beautiful. - It's so pretty. (soft mellow hip hop music) - I'm going to be the motor, you're going to be the navigator. - [Vivian] I'm in the front, though. (laughing) - [Jason] Okay, just lean forward for a second. - So should I put it on? - [Jason] No, you don't have-- It takes too long, I'll just make sure - But, like, should I? - [Jason] No, it's all flat water - Okay. - [Jason] There's no rapids. - But like, how deep is it? - [Jason] It is over your head. We'll lead you out and meet you back up here. - Good news, high chance of tippage. (upbeat music) I forgot my Apple watch so it doesn't count for activity today. - That's unfortunate. - [Jenna] I'm going so (mumbles) (upbeat dance music) (laughing) - 200 mil zoom, baby (chuckles) Oh my gosh, his face! This is so cute. Our friend Veruc, who you've seen in my videos before, he just hit 500,000 subscribers on YouTube here at Kando so we decided were gonna get him a cake. We asked them to write \"Congrats on 500K, iPhonedo\". Well, it's not quite how they interpreted it. It says \"Congrats on book\". But I'm going to fix it. I've been thinking about this for the past hour and a half, how I can do this. - [Jenna] Congrats on... - [Justine] Oh, that's great. Okay, here we go, okay. Push that in. - [Jenna] Oh my gosh, that's perfect. - [Justine] I know. - [Jenna] Does somebody need a ride? - Yes, I need a ride. - [Justine] Get in. - All right. - I have a problem. I travel a lot, I always buy bananas but I never end up finishing them. So this morning, I got a banana and then I left it in the truck (laughs) - [Jenna] Oh my gosh. - It has turned, it has baked. Its fermented. I mean this is rotten! - [Jenna] Its disgusting. - Should we do an unboxing? - [Jenna] Yeah, is it squishy? - Oh my god, it's so squishy. - [Jenna] You can't touch it, just put it back. - Disgusting. - It, like, blended in. - [Justine] I didn't even see it. I thought it was my sunglasses. Veruc's surprise! Okay you go this way, this way. - Oh my god. Thanks so much - You're welcome. - [Jenna] Okay, yeah. Hug it out, hug it out. - [Jason] Nah, it says iPhone. - [Jenna] Pretty even, good job. - Well thank you so much for watching, I hope you enjoyed this video. I had the best time and I hope you guys enjoyed some of the footage from the RX 100 Mark VII. And I will see you guys in my next video. Bye! Hi, Nori.",
    "transcript_keywords": [
        "good",
        "Yeah",
        "Mark VII",
        "Nori",
        "great",
        "shot",
        "video",
        "Jenna",
        "time",
        "pretty",
        "cool",
        "guys",
        "lot",
        "shooting",
        "Kando",
        "VII",
        "Mark",
        "zoom",
        "focus",
        "tracking"
    ],
    "transcript_entity_values": [
        "500",
        "Justine] Hello",
        "second",
        "four mile",
        "Veruc",
        "one",
        "500,000",
        "Justine] Shh",
        "Justine",
        "Smiths",
        "Apple",
        "Bend",
        "this morning",
        "Kando",
        "Curtis",
        "Instagram",
        "Today",
        "4 mile",
        "iPhone",
        "200 mil",
        "Kando",
        "100 to 400",
        "Nori",
        "YouTube",
        "100",
        "LA",
        "Smith Rock Way",
        "Carson",
        "a mile",
        "four",
        "huber",
        "18 minutes",
        "BMX",
        "number two",
        "Jason] Nah",
        "Kando 3.0",
        "Jen",
        "Vivian",
        "two hours",
        "the past hour",
        "six",
        "today",
        "Jenna",
        "Jason",
        "the moon livestream",
        "Oregon",
        "Manor Road",
        "Mark VII",
        "a fun few days",
        "1000 millimeter",
        "last night",
        "first",
        "400",
        "RX",
        "Sunriver",
        "Abbot Circle",
        "the 90s"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "GPE",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "GPE",
        "LOC",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "TIME",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "FAC",
        "PERSON",
        "PERSON",
        "TIME",
        "TIME",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "LOC",
        "GPE",
        "FAC",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "PERSON",
        "DATE"
    ],
    "vector": [
        -0.0034786590840667486,
        -0.09700292348861694,
        -0.053009409457445145,
        -0.1364206224679947,
        0.051152948290109634,
        0.02322198450565338,
        0.03954893723130226,
        0.018233267590403557,
        -0.0037507934030145407,
        0.07264898717403412,
        0.019073020666837692,
        -0.013691778294742107,
        -0.025309238582849503,
        0.029876988381147385,
        -0.03148476779460907,
        0.054891545325517654,
        -0.02480008639395237,
        -0.005217710509896278,
        -0.040153730660676956,
        0.037210613489151,
        -0.01622598245739937,
        -0.04976734146475792,
        0.032605722546577454,
        -0.0014360039494931698,
        -0.008618922904133797,
        0.07367616891860962,
        0.003221884137019515,
        0.0440279021859169,
        -0.07941165566444397,
        -0.09289223700761795,
        -0.04461755231022835,
        0.01436607725918293,
        0.10757450014352798,
        0.012273571453988552,
        0.029260627925395966,
        -0.04145055636763573,
        0.03248561546206474,
        -0.006539307069033384,
        -0.0352204255759716,
        -0.01568441092967987,
        0.019362730905413628,
        -0.04398573935031891,
        0.024984361603856087,
        -0.06392636895179749,
        -0.07730873674154282,
        -0.07005421817302704,
        0.001448745490051806,
        -0.07774171233177185,
        0.06884124875068665,
        0.06494369357824326,
        -0.08325706422328949,
        -0.01957225799560547,
        -0.0024132903199642897,
        0.010596933774650097,
        -0.09023785591125488,
        0.022042151540517807,
        -0.06902504712343216,
        0.013580861501395702,
        0.0513082779943943,
        -0.0775594711303711,
        0.01825554482638836,
        -0.03451133146882057,
        -0.012572705745697021,
        0.04128269478678703,
        -0.05988914519548416,
        -0.059342846274375916,
        0.03924872726202011,
        0.01913180574774742,
        -0.02156808413565159,
        0.030705444514751434,
        -0.12477274239063263,
        0.07724981755018234,
        -0.04068443924188614,
        0.028617994859814644,
        -0.014634649269282818,
        0.04443478584289551,
        0.030047329142689705,
        -0.06781190633773804,
        -0.008178235962986946,
        0.037160929292440414,
        0.030994614586234093,
        -0.030633123591542244,
        -0.08281587809324265,
        -0.002489959355443716,
        0.0010328046046197414,
        0.033306222409009933,
        0.021501431241631508,
        -0.015540625900030136,
        -0.007038062438368797,
        -0.0858076736330986,
        -0.11540251970291138,
        -0.01618451438844204,
        0.01879919320344925,
        0.005991642363369465,
        -0.01536010392010212,
        -0.03422559052705765,
        -0.025343867018818855,
        -0.05195075273513794,
        -0.03506083786487579,
        0.07949575781822205,
        0.03196759521961212,
        -0.08316225558519363,
        0.01570744812488556,
        -0.052961766719818115,
        -0.01580829545855522,
        -0.10112703591585159,
        -0.06250732392072678,
        0.04247087612748146,
        -0.007957431487739086,
        0.007691803388297558,
        -0.023698927834630013,
        0.0588373988866806,
        -0.059658195823431015,
        -0.049362048506736755,
        0.04373229295015335,
        0.1191079393029213,
        -0.04199720919132233,
        0.07478811591863632,
        -0.004667057655751705,
        0.027192674577236176,
        0.005097116343677044,
        -0.08323466032743454,
        -0.004373439121991396,
        0.03835003450512886,
        0.00515020452439785,
        -0.015147881582379341,
        -0.043891120702028275,
        1.2371571110465784e-32,
        0.005527051631361246,
        0.0362190343439579,
        0.02994985692203045,
        0.09301041066646576,
        0.006189547013491392,
        -0.0012696649646386504,
        -0.03443744778633118,
        0.1174139454960823,
        -0.06472153216600418,
        0.011033356189727783,
        -0.00042167160427197814,
        0.025074739009141922,
        -0.03166286274790764,
        0.06420688331127167,
        0.03242136910557747,
        -0.021661976352334023,
        0.0056739985011518,
        -0.057191647589206696,
        -0.08734656870365143,
        -0.021399715915322304,
        0.012295871041715145,
        -0.02580205909907818,
        0.037263158708810806,
        0.07495595514774323,
        0.08993404358625412,
        0.08644543588161469,
        0.07805109769105911,
        0.001049055135808885,
        0.04668387398123741,
        0.002668447094038129,
        -0.03623850271105766,
        -0.04754219204187393,
        -0.003439930034801364,
        -0.06236683204770088,
        -0.02213786356151104,
        0.03162996843457222,
        -0.059519387781620026,
        0.01729874312877655,
        -0.025818051770329475,
        -0.026353387162089348,
        -0.0066009825095534325,
        -0.0020672944374382496,
        -0.0869201049208641,
        -0.05989222601056099,
        0.08605669438838959,
        0.04276485741138458,
        0.059091225266456604,
        0.07967626303434372,
        -0.03959513083100319,
        0.030722517520189285,
        -0.016093315556645393,
        0.003716990351676941,
        -0.036801934242248535,
        0.004338632803410292,
        -0.028800712898373604,
        -0.07497089356184006,
        -0.021237771958112717,
        0.05990058183670044,
        0.05157226324081421,
        0.039885908365249634,
        0.03264753893017769,
        0.014504026621580124,
        -0.01914910227060318,
        -0.023011598736047745,
        -0.060051437467336655,
        0.10555170476436615,
        0.07213973999023438,
        -0.032627787441015244,
        0.056551720947027206,
        0.041063353419303894,
        -0.0184518750756979,
        -0.01816338486969471,
        0.05481050908565521,
        0.026792727410793304,
        0.03516656160354614,
        0.06636558473110199,
        -0.10150708258152008,
        -0.06298566609621048,
        0.02068142406642437,
        -0.0003585038357414305,
        -0.10589960217475891,
        0.06359653919935226,
        -0.03637392446398735,
        0.07005093991756439,
        -0.016720660030841827,
        -0.0699462890625,
        0.033470869064331055,
        -0.04490724951028824,
        -0.016720900312066078,
        0.0260317325592041,
        -0.029876092448830605,
        0.08139246702194214,
        -0.058723051100969315,
        -0.05261031538248062,
        -0.03834281489253044,
        -1.234904716933609e-32,
        0.027766410261392593,
        0.05208554491400719,
        -0.01341590192168951,
        -0.04420763999223709,
        0.06569378823041916,
        -0.02546907588839531,
        0.03424811363220215,
        0.06559575349092484,
        0.06523847579956055,
        -0.06599868834018707,
        0.05530441552400589,
        -0.07616425305604935,
        -0.11146031320095062,
        -0.008247852325439453,
        -0.027461351826786995,
        -0.025390315800905228,
        -0.03320659324526787,
        -0.05603897199034691,
        0.028785767033696175,
        -0.0331406407058239,
        0.048066169023513794,
        0.13028283417224884,
        0.08897595852613449,
        0.025947250425815582,
        0.019081469625234604,
        0.004008482210338116,
        0.04945404827594757,
        0.05239253118634224,
        0.07097826153039932,
        0.04433887079358101,
        0.0038520756643265486,
        -0.0429714135825634,
        -0.06660421192646027,
        -0.0056041027419269085,
        0.06055781990289688,
        0.05276356637477875,
        0.03974493592977524,
        0.055977288633584976,
        0.002787074539810419,
        -0.06739320605993271,
        0.008031856268644333,
        -0.003529803827404976,
        0.004569294862449169,
        -0.020596031099557877,
        -0.023779841139912605,
        -0.13149835169315338,
        -0.0566163994371891,
        0.025041867047548294,
        -0.01092132180929184,
        -0.009756826795637608,
        -0.05403025448322296,
        -0.06169195473194122,
        -0.0012096452992409468,
        -0.044743988662958145,
        -0.0005038092494942248,
        -0.006366149988025427,
        -0.060269795358181,
        -0.007800889201462269,
        0.05650382488965988,
        0.0034469407983124256,
        0.04585709795355797,
        -0.057203225791454315,
        -0.0819140300154686,
        -0.08519665151834488,
        0.0021516818087548018,
        -0.07547935843467712,
        0.08453304320573807,
        0.03289792314171791,
        -0.011218525469303131,
        0.01982482336461544,
        -0.015160304494202137,
        0.05588022992014885,
        0.043893687427043915,
        -0.005416030064225197,
        0.04897872731089592,
        -0.009002427570521832,
        -0.08339854329824448,
        0.0009879638673737645,
        0.07438243925571442,
        -0.027393901720643044,
        -0.027023127302527428,
        -0.016933836042881012,
        0.026403916999697685,
        0.07666940987110138,
        0.07812879979610443,
        0.10935313999652863,
        0.10345987975597382,
        0.01786176860332489,
        0.010398544371128082,
        0.05048861354589462,
        0.014825280755758286,
        0.0639098584651947,
        0.07170546054840088,
        0.14104512333869934,
        -0.09219317138195038,
        -5.946122527689113e-08,
        0.039695341140031815,
        0.011814653873443604,
        -0.029908636584877968,
        0.024263745173811913,
        0.03885912895202637,
        -0.06937235593795776,
        -0.0332866869866848,
        0.01325592864304781,
        0.04955986142158508,
        -0.0836290717124939,
        0.0776437371969223,
        -0.010605227202177048,
        0.0076034353114664555,
        0.13052138686180115,
        0.02135506272315979,
        -0.013181127607822418,
        -0.10177347809076309,
        0.08511945605278015,
        -0.034693438559770584,
        -0.0713459923863411,
        -0.056545790284872055,
        0.05108242854475975,
        0.016766220331192017,
        -0.00748717924579978,
        0.05432608351111412,
        -0.020254628732800484,
        0.019540593028068542,
        -0.03170029819011688,
        0.01029061246663332,
        0.022044267505407333,
        -0.04765300825238228,
        0.010267908684909344,
        -0.01884610764682293,
        -0.017774520441889763,
        -0.0712764784693718,
        -0.035705626010894775,
        -0.035470183938741684,
        -0.008762206882238388,
        0.01073876116424799,
        -0.017508387565612793,
        0.010540017858147621,
        -0.13132640719413757,
        -0.014393599703907967,
        0.011147510260343552,
        -0.009401124902069569,
        -0.06162532791495323,
        0.05221117287874222,
        -0.050819847732782364,
        -0.023409022018313408,
        -0.05620929226279259,
        -0.07561615109443665,
        0.05450689047574997,
        0.043838921934366226,
        -0.04033810272812843,
        0.06740054488182068,
        -0.018532482907176018,
        0.04899706318974495,
        0.05589159578084946,
        -0.01817682571709156,
        -0.020996736362576485,
        0.03925177827477455,
        0.009725017473101616,
        -0.049705423414707184,
        0.017003513872623444
    ]
}