{
    "id": "DgMDYpj52X0",
    "title": "Samsung, this is NOT Okay - Self Repair",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2024-07-05T15:02:02Z",
    "video_url": "https://www.youtube.com/watch?v=DgMDYpj52X0",
    "category": "Science & Technology",
    "tags": [
        "Samsung repair",
        "Galaxy S21 fix",
        "DIY phone repair",
        "Samsung Self-Repair",
        "smartphone repair",
        "broken screen fix",
        "iFixit",
        "right to repair",
        "phone disassembly",
        "Samsung parts",
        "tech repair",
        "phone battery replacement",
        "Samsung service",
        "smartphone maintenance",
        "Galaxy S21 screen replacement",
        "Austin",
        "Austin Evans"
    ],
    "views": 294649,
    "likes": 9465,
    "comments_count": 380,
    "description": "I decided to try Samsung's Self-Repair program on my broken Galaxy S21, and the experience was full of surprises. What started as a simple screen replacement turned into a deep dive into Samsung's repair policies and by the end, I uncovered some shocking truths about the real cost and complexity of DIY phone repairs.  Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   Chapter Titles: 0:00 Samsung Self Repair 2:16 Parts 3:57 Disassembly 9:45 Reassembly 12:20 Worth It?  Correction: 3:04 This is actually battery PERCENTAGE not health, that's my bad",
    "description_links": [
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- This is a broken Samsung Galaxy S21, and today I'm going to attempt to fix it using Samsung's Self-Repair program. Now, we did have video a few months ago taking a look at Apple's version of this program, which was incredibly expensive, but honestly, kind of cool. So let's see how Samsung stacks up. Now, they've been in the news a lot lately for having some very questionable support when it comes to their partnership with iFixit, who have, up until now, been one of the main places where you can actually buy the parts and fix your phone. So let's see exactly how bad this is and if I can actually fix this incredibly broken S21. My concern here is, first of all, how easy is it to fix a phone like this, which is still fully functional, even though absolutely shattered? And my second question is, how easy and affordable is it to get the parts and find the instruction manuals I need to do a authorized-by-Samsung repair of my own device? So Samsung give you the option of purchasing repair parts from iFixit or Encompass. I have a few options here. I can purchase the screen and battery, which are combined, for some reason. I can get a USB-C charge port, which is $67, okay. I'll be honest with you, if you've got this phone and you have to spend $200 to fix it, that's bordering on not really worth it anymore, which is really unfortunate. So Samsung would charge you about $200 to do this repair, whereas if I buy the parts to do it myself from my iFixit, it's $167. I'm going to pretend that I cannot ship this in at all. I wanna try to do it myself and see if it's remotely worth it, and if Samsung are doing everything they can to make my experience as easy as possible. Or if they're trying to offer right-to-repair because they have to, while in reality they're doing everything they can to push you to just giving them the phone, and they fix it themselves. iFixit will provide Samsung with my email and genuine parts history to provide integrated customer care support. One of the reasons why iFixit complained that they want to sort of break off the partnership with Samsung is that they have to share your information with them so they can keep it in their database. But I've even heard stories that if you take this to like a third-party repair shop, and maybe you would put like a third-party battery or screen in it, they're supposed to not only tell Samsung about it and tattle on you, they're supposed to actually take the part out. Like, is that necessary? Do we really need to do this? All right, my friends, let me place this order with iFixit, grab the components I need to fix this S21, and let's see exactly how easy, or not, the repair process really is. And so, my friends, it is time to see what iFixit have provided. So we've got ourselves the S21 screen and battery. And it is pink. We've got ourselves the back cover, which is violet. So the phone should look the same on the back. It's just a matter of the front may look very slightly different. So you see it's got the actual, like, Samsung, like, seals and whatnot on it. Samsung. Genuine part. And then we've also got this further repair tool, which is the iOpener. Now, I've actually never worked on a Samsung phone. And in fact, I'll just be honest with you, I am not a repair wizard when it comes to smartphones in general. I've opened a few. This, I'm gonna assume, is gonna be much, much more involved. So we do have two repair kits. So the reason they ship you the screen and the battery together. So the battery on this is actually not too bad. It's 89%. So normally I wouldn't replace it. But the screen and the battery are fused together. As far as I know, based on when you actually repair them, you have to replace the screen and battery together. - [Alex] They only do that to iFixit. They don't do that to anybody else. - Wait, really? I don't know what the politics are between Samsung and iFixit. Clearly it is a relationship that is completely dissolved at this point. But very, very strange. So I am going to be repairing this using the iFixit guide. Now, if you at home have never taken apart a phone before, theoretically, this is a tutorial that will show you exactly how to do it, so- - [Alex] It is a medium difficulty. - It's one thing to say medium, it's another thing to get three hours into the repair of your phone, and it still doesn't work. And then you're really sad, and then you have to ship it into Samsung anyway, and then you're really, really sad. - [Joanna] I have a feeling this will be like the recipes that say 10-minute prep time, but what it actually means is 2-hour prep time. - That's correct. That's correct. Now, I'm not gonna give you the absolute step-by-step. I mean, if you're fixing an S21, you should actually use the real instructions. What I am gonna do is go through the process as much as I can and kind of share with you my experience with it. Now, I know the first thing I need to do is pop out my SIM card. So I believe the way to get into the S21 is I need to take off the back glass first. Are you supposed to microwave this? - [Alex] Yeah. - Really? - Yeah, so it's over there. - Oh, you brought the- (laughs) - [Alex] Ding! - I like how normally Matt and Ken sit here. Instead, now it's just the microwave. I'm just gonna walk over to the microwave. That's fine. - [Alex] Yeah, equally as useful. - [Joanna] That microwave is just so dusty. - It is. - [Joanna] Can we just- - Nope. - [Joanna] But please. - That's authentic 2017 dust right there, Joanna. It was a good vintage. I'm helping it. - What's that do? - I'm just helping it to transfer the heat. Okay, so the next step is, theoretically, I'm going to apply a suction cup, pull on it, and then stick a pick in the middle. Also, just a small note, if you're ever repairing your device, if you have broken glass, be very careful, because I know if you're like really pulling at it with a suction cup, and you've got yourself broken glass, it could just shatter. So please be careful, maybe consider wearing gloves. So activate suck. I'm gonna put this on the top edge, just to warm that up, and I'm just gonna pull on it. I'm just peel it off. Look at that. I will say that was way easier than I thought it was gonna be. Almost too easy. There's no shot that that's glass. So if I was just doing the rear repair, all I would do I think at this point is probably put the new adhesive on and just slap it right on. Also, I'm just realizing, how much did I pay for this piece of plastic to repair this? It's like 60 bucks or something just for this. You can see the difference between the two. So they're, of course, identical in every way, except for the fact that one's all scratched. So I need to undo five screws on the motherboard. - [Alex] I will say, doing it this way also kind of teaches you a little bit more about phone repair in general. Obviously, way too early to judge, but this is actually, like, kind of fun so far. Like, the fact that the back cover came off that easy. Like, that always stresses me out, because you don't wanna get, like, either the adhesive to be too sticky, or snap something, or break something, or whatever. This I can definitely handle. Next step is unclip it, which is tweezers. And there's definitely something underneath it. Oh, it's the whole, oh, I see. So this is all your wireless charging coil. So with my bracket out of the way and the charging coil pulled back, we can see the battery. Unfortunately, the battery's gonna take a little bit more work to get through. There's a bunch of additional ribbon cables, and before I even take that off, I need to take off the speaker, which is down here. It's always a good idea to not get too excited when you do these kind of things, because it is so much easier to tear apart a phone than it is to put it back together. Almost always. You'll get it all apart and go, \"Cool!\" And then you realize you have 300 screws, and it's all spread all over the place, and you're suddenly in deep, deep trouble. So I'm gonna use my pick to disconnect the loudspeaker. So it should just pop out. So we've got ourselves the loudspeaker, the motherboard little shield, and our wireless charging coil all in one nice, neat, little piece. Because I'm doing a full screen replacement, I think I'm gonna have to just completely strip this down. So with some of our cables out of the way, I'm now going to take off the daughterboard, which is, I believe, if I was gonna have to replace my USB-C, this would be what I would be doing. You know what, man? I feel like we're putting some good karma out there. We're trying to take a phone that was probably gonna get tossed in the garbage, and we're breathing new life into it by spending more than it's worth to repair. So this is the earpiece/front speaker. Lovely. Boy, you really appreciate how much engineering goes into a phone like this. I mean, there's like, what? One, two, three layers worth of board, PCB, speaker, battery, top glass, like, it's very impressive what they're able to pull off. If this was like a Z Flip 6 or something, I'm sure it'd be even more elaborate. Okay, right edge cables. What right edge cable? - Oh yeah. - There's two. - Yep, got it. 12 different connectors to my count on the board right now. And I will say that also shout out, I have been able to use the exact same Phillips bit for every single screw inside here. This, my friends, this tiny little board is the entire motherboard assembly and importantly the entire camera set up. My question here is at this point, we've taken a lot of stuff out of this phone but it doesn't look like we've made that much progress in getting the screen out 'cause the screen is still gonna be like, (Alex laughs) a whole thing. So I think what we need to do now is pull that front facing camera out, which I believe I need to use my iOpener for yet again. So I think that should be warm enough. Oh! - Oh, a little too warm maybe. - A little too warm. Okay, you know what? I understand why they say heat that adhesive up. So the thing is, the way that they mount the front facing camera, this is actually probably the most difficult part yet, it is like absolutely glued inside of the front housing. There we go, yep. The extra heat definitely did it. That is our front facing camera. It is just a little guy. So you'll see that we actually have a number of other antennas and these screws that are designed just to hold in our millimeter wave antenna. I don't understand why, this is the second screw I found, which is weirdly like soft and does not wanna come out very well. Yeah, no kidding. That screw is borderline stuck. Every time I do this and I get really excited, I'm like \"Oh, this is going so well!\" And then I run into a problem and then I'm sad. Yeah, so what I'm finding here is that while the Phillips screws they've used are generally pretty good, a couple of them are very soft. So I will just mention don't try this at home using power tools right beside a battery that could cause damage is bad and don't do this. Hey, got it. Ta-da! I fixed it. Can you see that? That's all that's left for that little screw? Now that this phone has basically been torn down to just the screen and the battery, I think it's about time to start with the final removal, which is the display. How to take the display? - [Alex] Uh, this is where it ends. - Wait, are you trying to tell me that iFixit tutorial stops right before I take out the display, which is when... - [Alex] Yes. - Wait a minute, what does this look like? Hold on, hold on, hold on. Because it's not like, this goes in the garbage now, right? Is that why it's so expensive and it comes to the battery? Is because this whole thing comes together and I take all these components and put it back in? I don't think so, right? No. - [Alex] Well, let's open and find out that. (laughs) - That would be absurd. Oh! (Alex laughs) - Wait a minute! The reason why to screen the battery is because this thing goes in the trash now and you get an entirely new frame and everything. If you have placed your screen or your battery, you have to get an entirely new shell of the phone. So we've got ourselves new side rails, a brand new display, a brand new battery. This is the whole thing put together. I mean I guess it is a simpler approach for sure, like, this is gonna save me the hassle of tearing the battery out and everything. And I do kind of understand that the screen and the chassis are one. Like, that does look like it would be quite difficult to get out. Do I just now go all, through all the steps in reverse? They don't actually gimme like a specific guideline, I just do everything backwards. - [Alex] Yeah, to reassemble your device, follow instructions in reverse. - Okay. (upbeat music) Okay, so, after about 15 minutes or so of reassembly, which was very straightforward, I think I have pretty much everything ready. Now I'm not gonna put the back cover on 'cause I wanna make sure that this actually works first. But I'll tell you I was a little bit apprehensive about how it would go back together. Super simple. It looks pretty straightforward. So let's see if it'll fire up. Oh, nevermind it turns on. That is a very, very good sign. Screen, fully functional. Battery now shows 20%. So let's try the cameras first. So I'm gonna do the rear facing camera. So the rear facing camera works. Ultra wide works. Telephoto works. Selfie works. I have a lot of thoughts. Let me finish putting this back together and let's have a little chat about whether or not this is actually worth it and how Samsung have approached this right-to-repair stuff. 'cause honestly I was not expecting it to be this easy and this complicated going into it. So we are recording this today on June 17th, the day that Samsung sure enough has removed iFixit from their site. So while a lot of the things we talked about in this video are still relevant, now if you are looking for older components or newer components, you have to use Encompass. Now after looking at the options for repairing your Samsung phone, this story I will admit is a lot more complicated than I initially thought because the simplest option is really just to, surprise, surprise, send your phone directly into Samsung and have them repair it. So if you look on the Samsung site for repairs, they actually give you two options. Confusingly, there's screen repair and screen module. So the screen repair is what it sounds like, they will replace just your broken screen while the screen module replaces the entire setup, just like I did: screen, frame and battery. Now it seems very clear to me that this is the route that Samsung wants you to take. For our S21, the screen repair itself would cost $174 or it would cost $199 to do the entire module. For me, especially if my phone's more than a few months old, I would definitely take a brand new frame and battery for only $25 more if I'm already doing the repair. Although of course you should consider the wastefulness of sending a potentially perfectly good battery and frame to the e-waste pile. Now there are also more options when it comes to getting things replaced. So generally speaking, Samsung will allow you to do the same day repair on your phone if you do the entire module. Whereas if you want to just do the screen, typically that takes a little bit longer, it may actually have to be shipped out, so that's up to you. But it makes sense. The screen module setup is a much, much easier repair to do. Now these options aren't available for every phone, mind you. Now going through the list, it's a little complicated because some phones only allow you to swap out the screen and some require you to definitely do the entire module, but the pricing really is the main selling point. Now, if I ignore the back shell, which to be fair, I could have absolutely purchased from a third party for a whole lot less than $67 since it's literally a piece of plastic. The self repair part and the tools cost me $167. As much of a surprisingly easy experience as it was, I'd wager that most people would happily pay the $33 premium just to have Samsung do it for you. Especially because if you live near a service center, you could actually get this potentially done same day versus waiting for your parts to arrive, doing it yourself, having to pay for shipping. Like, it very much makes sense to have Samsung do the repair for you. And that's part of the reason why I'm tempted to just put Samsung in the exact same category as Apple here and say that while they offer self-repair, it's more so for regulatory reasons than actually trying to give you a good legitimate option. And of course right after I finished filming this video, Apple announced some changes to their own repair program. So the big thing is they've actually taken a lot of the feedback that they have gotten and made some real legitimate improvements. So you no longer have to register the actual serial numbers of your phone with the parts. And third-party parts such as batteries and screens no longer mean that you lose core functionality such as True Tone or the ability to check your battery health. I've gotta give it to them. This is actually a really nice upgrade and while I still think that there's certain parts of their program, like the fact that the tools are massive and heavy and all this kinda stuff, it's a little bit silly, but like repairing your own Apple devices actually is like a lot better now. Like almost worth me giving it a round two. As much as it is incredibly unfriendly to hear stories like Samsung forcing third-party repair shops to confiscate unauthorized parts, which just feels ridiculously unnecessary, I do actually have some good things to say. While it's more than a little wasteful to push you into replacing the entire frame and battery if you just need a screen replacement, if you do have a more modern phone, Encompass actually will sell you screens by themselves if you're willing to brave a much more elaborate repair. And you actually have to dig around the site a little bit. So if you come directly from the Samsung link on their site, they don't really wanna show you the screens. But if you dig around the Encompass site, they do sell you individual screens as well as a bunch of additional options. And the fact that you are kind of just meant to replace the entire chassis does mean that for certain other phones, like, so I don't know, a Z Flip or something, which would normally be incredibly scary to repair. It's actually pretty simple since all you really gotta do is take off the back panels, throw in the new motherboard and cameras and whatnot, like it's a much easier thing to do versus trying to do an entirely insane screen replacement. Look, I don't think that anyone would replace the screen on a Z Flip. They're just gonna swap out that entire chassis, no problem. So can I give Samsung a pass for their repairs? No, I can't. I mean it's still clearly meant to drive you to just having them do it for you. Maybe just give people a little bit more of a discount to repair the devices themselves and don't force repair centers to rat me out if I decide to get a back cover or something from AliExpress and save myself $57. So do you think that Samsung have done enough to make it worthwhile to fix your own phone? Let me know in the comments below. And if you enjoyed, definitely be sure to subscribe to the channel and a ringling that dingling button as well as check out our video we did when we tried Apple's absolutely wild self-service repair program. If you think this was crazy, you ain't seen nothing yet.",
    "transcript_keywords": [
        "Samsung",
        "broken Samsung Galaxy",
        "repair",
        "Samsung Galaxy",
        "screen",
        "phone",
        "battery",
        "Samsung phone",
        "back",
        "screen repair",
        "iFixit",
        "parts",
        "fix",
        "entire",
        "thing",
        "bit",
        "lot",
        "good",
        "easy",
        "Yeah"
    ],
    "transcript_entity_values": [
        "a few months ago",
        "Alex",
        "Self-Repair",
        "about $200",
        "2017",
        "millimeter",
        "third",
        "three",
        "more than a few months old",
        "Phillips",
        "33",
        "AliExpress",
        "USB-C",
        "less than $67",
        "first",
        "a Z Flip",
        "Telephoto",
        "Phillips",
        "the day",
        "Ken",
        "Samsung",
        "the same day",
        "iFixit",
        "two",
        "67",
        "Apple",
        "Matt",
        "199",
        "S21",
        "PCB",
        "only $25",
        "three hours",
        "12",
        "60 bucks",
        "2-hour",
        "300",
        "iOpener",
        "167",
        "one",
        "second",
        "about 15 minutes",
        "6",
        "89%",
        "200",
        "Selfie",
        "June 17th",
        "Joanna",
        "five",
        "S21",
        "Ta-da",
        "20%",
        "a minute",
        "10-minute",
        "One",
        "174",
        "Samsung Galaxy S21",
        "57",
        "today"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "ORDINAL",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "TIME",
        "CARDINAL",
        "MONEY",
        "TIME",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "PERCENT",
        "MONEY",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERCENT",
        "TIME",
        "TIME",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "MONEY",
        "DATE"
    ],
    "vector": [
        -0.1788487434387207,
        0.05320535972714424,
        0.108364999294281,
        -0.054769180715084076,
        0.010086662136018276,
        -0.08438234031200409,
        0.02552633173763752,
        0.08495382964611053,
        -0.045278504490852356,
        0.01924705319106579,
        0.03340347856283188,
        0.01570485718548298,
        0.032703086733818054,
        0.06031344085931778,
        -0.023413408547639847,
        -0.08424452692270279,
        0.016746409237384796,
        -0.05716416612267494,
        -0.13480745255947113,
        0.05436432361602783,
        -0.022516589611768723,
        0.022827982902526855,
        0.01749851182103157,
        -0.00948085356503725,
        0.07328900694847107,
        0.01791195757687092,
        -0.02546536736190319,
        -0.05095492675900459,
        -0.028868718072772026,
        -0.08410295099020004,
        0.02617614157497883,
        0.13730141520500183,
        0.0013763598399236798,
        0.01787426322698593,
        -0.018752027302980423,
        -0.016870835795998573,
        0.004251490347087383,
        -0.02024899236857891,
        -0.05691836029291153,
        -0.07605951279401779,
        -0.0743551179766655,
        0.04373893514275551,
        -0.03320245444774628,
        0.019696924835443497,
        0.04394376277923584,
        0.002365569584071636,
        0.0436621755361557,
        -0.012955051846802235,
        0.028637560084462166,
        -0.024697383865714073,
        -0.048450667411088943,
        0.03628672659397125,
        0.021143656224012375,
        0.01703726127743721,
        -0.0002757214242592454,
        0.09723398089408875,
        0.05400305241346359,
        -0.02630915679037571,
        0.09573657065629959,
        0.05200401321053505,
        0.14200136065483093,
        -0.027521397918462753,
        0.005557164084166288,
        0.053869206458330154,
        0.06069370359182358,
        0.0014873204054310918,
        0.06607329845428467,
        -0.06290362030267715,
        -0.014047089032828808,
        0.008915675804018974,
        -0.027702998369932175,
        -0.037198081612586975,
        0.03153199329972267,
        0.06715086847543716,
        0.01803969219326973,
        0.08992684632539749,
        0.03105206973850727,
        -0.02873261459171772,
        -0.03332706540822983,
        -0.0006172640714794397,
        0.011477668769657612,
        -0.03453517332673073,
        -0.005490673705935478,
        0.08723536133766174,
        0.11029976606369019,
        -0.009527748450636864,
        -0.01210242323577404,
        0.022096991539001465,
        0.02401401847600937,
        0.013502993620932102,
        0.00701274024322629,
        0.10183600336313248,
        0.05439906194806099,
        -0.02937077172100544,
        0.01974504068493843,
        0.06541520357131958,
        -0.07547284662723541,
        -0.045762643218040466,
        -0.053395356982946396,
        0.026485221460461617,
        0.005999838933348656,
        0.019544653594493866,
        0.06784171611070633,
        -0.054332636296749115,
        -0.012608922086656094,
        -0.06808709353208542,
        0.015998199582099915,
        0.05340952053666115,
        -0.008182979188859463,
        -0.016483154147863388,
        0.029920147731900215,
        -0.03403061255812645,
        0.004994539078325033,
        0.06547661125659943,
        0.016198186203837395,
        0.025184348225593567,
        -0.0316917784512043,
        0.004569045267999172,
        0.0867084413766861,
        -0.051587436348199844,
        0.0041958908550441265,
        -0.017636103555560112,
        -0.03929765895009041,
        -0.11954914033412933,
        -0.004585814196616411,
        0.032448627054691315,
        -0.035701144486665726,
        5.5048738403633585e-33,
        0.02402777597308159,
        0.10121353715658188,
        -0.033652301877737045,
        -0.0011687156511470675,
        -0.004488375037908554,
        -0.0056060138158500195,
        -0.008094596676528454,
        0.020306795835494995,
        0.031429097056388855,
        -0.007053539156913757,
        0.009644127450883389,
        0.03913780301809311,
        -0.013154233805835247,
        -0.01983320340514183,
        0.0052805026061832905,
        -0.060222990810871124,
        -0.031031034886837006,
        -0.028526127338409424,
        -0.09790664166212082,
        0.0005519574624486268,
        0.059645265340805054,
        -0.014120523817837238,
        -0.033879030495882034,
        -0.04387761279940605,
        0.07331493496894836,
        0.004139761906117201,
        0.05051044374704361,
        0.007152529899030924,
        0.07593410462141037,
        0.023977767676115036,
        -0.04001820087432861,
        0.02144790254533291,
        0.03589687496423721,
        0.0013056655880063772,
        -0.03821466490626335,
        -0.028513804078102112,
        -0.0005947161698713899,
        -0.03127230331301689,
        0.039167970418930054,
        -0.007689691614359617,
        -0.10622340440750122,
        0.1118190810084343,
        -0.055928245186805725,
        0.006054372061043978,
        0.007782595232129097,
        -0.027263876050710678,
        -0.018167229369282722,
        0.01872171275317669,
        -0.06726060807704926,
        -0.07311760634183884,
        -0.05491401255130768,
        -0.0007376588182523847,
        0.03809932991862297,
        -0.08400538563728333,
        -0.13487112522125244,
        0.06274741142988205,
        0.019244782626628876,
        -0.028730720281600952,
        0.034587062895298004,
        0.09765098989009857,
        0.04076148569583893,
        0.04182298108935356,
        -0.028417987748980522,
        0.05053562670946121,
        0.0076276627369225025,
        0.03440912067890167,
        0.04419365152716637,
        0.0022865054197609425,
        -0.09218353778123856,
        -0.02593480981886387,
        -0.01847531460225582,
        -0.03168027102947235,
        0.0067271338775753975,
        -0.06660754978656769,
        0.0003698104410432279,
        -0.018567483872175217,
        0.0026026382111012936,
        -0.01448105275630951,
        -0.06947892904281616,
        -0.08889942616224289,
        0.03294318914413452,
        -0.022925324738025665,
        0.06059768795967102,
        -0.005468054674565792,
        0.0012170304544270039,
        -0.07428715378046036,
        -0.009047441184520721,
        -0.08767615258693695,
        0.0034551213029772043,
        0.06670676171779633,
        0.003525803331285715,
        -0.05709525942802429,
        -0.031210625544190407,
        0.0018729799194261432,
        0.005525948479771614,
        -5.749237075380234e-33,
        -0.013679157942533493,
        -0.03903635963797569,
        0.051973726600408554,
        0.019928816705942154,
        0.007177027408033609,
        -0.019276823848485947,
        0.006074678152799606,
        0.044673267751932144,
        0.04307138919830322,
        -0.06804470717906952,
        -0.08757486194372177,
        0.04954161122441292,
        -0.0762932226061821,
        -0.09142782539129257,
        -0.06563867628574371,
        -0.02931012213230133,
        -0.001124767353758216,
        -0.10089769214391708,
        -0.03121659904718399,
        -0.0047468021512031555,
        0.05813726782798767,
        0.11142738163471222,
        0.028621671721339226,
        0.06619801372289658,
        -0.00044691041694022715,
        0.06713609397411346,
        -0.02026372216641903,
        0.038282010704278946,
        0.05515497922897339,
        0.03186770901083946,
        0.04994716867804527,
        -0.07289188355207443,
        -0.036238279193639755,
        0.02838543988764286,
        0.031748950481414795,
        0.034250084310770035,
        0.03172595798969269,
        -0.02749849483370781,
        0.027714762836694717,
        -0.1260576695203781,
        0.08965754508972168,
        0.03581441938877106,
        -0.050319500267505646,
        -0.014015750028192997,
        0.05011016130447388,
        -0.02743087336421013,
        -0.014554331079125404,
        0.020484166219830513,
        0.009659325703978539,
        -0.0425504595041275,
        0.004743944853544235,
        0.0005913088680244982,
        0.00214151362888515,
        0.07448674738407135,
        -0.0015372904017567635,
        0.010784510523080826,
        0.09400667995214462,
        -0.011138031259179115,
        -0.06286334246397018,
        -0.045035555958747864,
        0.042797211557626724,
        0.004616360180079937,
        0.04246911406517029,
        -0.0711212307214737,
        -0.0466180145740509,
        -0.032975077629089355,
        0.07886967808008194,
        -0.014905011281371117,
        0.055256437510252,
        -0.023348011076450348,
        -0.007123882882297039,
        -0.01879619061946869,
        -0.06525508314371109,
        -0.11344114691019058,
        0.0056814891286194324,
        0.12006989866495132,
        -0.086161769926548,
        -0.11468508094549179,
        -0.09802651405334473,
        -0.003756794845685363,
        0.03118407167494297,
        -0.009578268975019455,
        0.01954549551010132,
        -0.015813887119293213,
        0.06846559047698975,
        -0.026093535125255585,
        0.04019630700349808,
        0.06908401846885681,
        0.008319186046719551,
        0.017239883542060852,
        -0.1263006627559662,
        -0.03672109544277191,
        -0.0542529858648777,
        0.06171172484755516,
        -0.02133350446820259,
        -5.731792285246229e-08,
        0.06028077378869057,
        -0.027414850890636444,
        0.04139456897974014,
        0.02257544919848442,
        0.0028953836299479008,
        -0.07058824598789215,
        -0.027193836867809296,
        0.03238891065120697,
        0.10276259481906891,
        -0.007839052006602287,
        0.016742268577218056,
        -0.04541197419166565,
        -0.04978008195757866,
        0.006459944881498814,
        -0.025127997621893883,
        -0.001830235356464982,
        -0.029038822278380394,
        0.09920888394117355,
        -0.05493966117501259,
        0.027668967843055725,
        -0.03915350139141083,
        0.028970472514629364,
        0.05996522307395935,
        -0.048466626554727554,
        0.029738878831267357,
        0.06538784503936768,
        -0.06138240918517113,
        0.005421952344477177,
        0.014449055306613445,
        -0.07582806050777435,
        -0.04280982166528702,
        -0.05190950632095337,
        0.03982904925942421,
        0.05278285592794418,
        -0.013971438631415367,
        -0.09921615570783615,
        0.026153022423386574,
        0.0028534845914691687,
        0.07868212461471558,
        -0.048763517290353775,
        0.0023029015865176916,
        0.01969844475388527,
        -0.0041082208044826984,
        0.08207172155380249,
        -0.009616885334253311,
        -0.11090627312660217,
        -0.043727561831474304,
        -0.03297300264239311,
        -0.010503279976546764,
        -0.006529130041599274,
        -0.03403369337320328,
        -0.03796166181564331,
        -0.09075542539358139,
        -0.002746996935456991,
        0.024871958419680595,
        -0.007433752994984388,
        0.01594187319278717,
        0.03245846554636955,
        0.0011460093082860112,
        0.11614444106817245,
        0.055848799645900726,
        -0.08313925564289093,
        -0.004151882138103247,
        0.004304791335016489
    ]
}