{
    "id": "dho_g-146io",
    "title": "How To Waste $60 on Amazon...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2017-09-13T15:24:51Z",
    "video_url": "https://www.youtube.com/watch?v=dho_g-146io",
    "category": "Science & Technology",
    "tags": [
        "tech",
        "gadget",
        "2017",
        "technology",
        "headphones",
        "toys",
        "smartwatch",
        "camera",
        "iphone",
        "gadgets",
        "unboxing",
        "austin evans"
    ],
    "views": 2007269,
    "likes": 34863,
    "comments_count": 1637,
    "description": "Check out the UltraWide Festival!  Sub Quest 2 Giveaway:  LG UltraWide Monitor 34UC89 :  Klipsch K6i headphones on Amazon:  dB MAGIX Lightning headphone amp on Amazon:  Pebble Time smartwatch on Amazon:  USB Pet Rock on Amazon:  Yongnuo 50mm f/1.8 camera lens on Amazon:  POWERUP 3.0 smartphone paper airplane on Amazon:   Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "http://www.lgultrawidefestival.com",
        "https://goo.gl/8z9eHj",
        "http://www.lg.com/us/monitors/lg-34UC89G-B-ultrawide-monitor",
        "http://austin.tech/klipschk6i",
        "http://austin.tech/magix",
        "http://austin.tech/pebbletime",
        "http://austin.tech/petrock",
        "http://austin.tech/50mm",
        "http://austin.tech/powerup",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin, and today I'm back with another Tech Under video, this time taking a look at tech under $60. However, the catch is, as always, I have no idea what I'm looking at, thanks to good ol' savage Kenny. (item clangs) The Klipsch K6i Reference Headphones. (item thuds) Oh wait, what is this? A Lightining Audio Amp? - [Kenny] It's 60. - A 60 dollar amp? Klipsch typically makes pretty good in-ear monitors. That shouldn't be a huge surprise. You're paying $60 for a headphone amp for, essentially the iPhone 7. So, to give these a try, first, I'm going to use the standard lightning adapter that comes with the iPhone 7, and see how these headphones sound. Usually, I'm actually not a big fan of these in-ear style of headphones. Typically, it's actually kind of hard to get a comfortable fit for me, but let's give these guys a try. They're good! They sound really good for the most part. The only thing is there's just a little bit of a lack of bass, and, of course that's a subjective thing. I think some people prefer something that's a little bit more of a clearer sound with less bass. But, for me, I like that there's just a little bit more punch to the sounds. But, of course, the headphones are not alone in a vacuum. Now, I get to try this 60 dollar lightning adapter. So, it looks pretty much similar to the one that comes with the iPhone, although you can see there's definitely a lot more going on here with having, not only an amp, but also a dedicated DAC. This... this might be interesting. I don't know. I'm not so sold that it's going to be that great. That's kinda cool. So you can actually use this little keychain thing (mysterious music) There might be a little bit of a difference. I feel like there might be just a bit more separation, but, I don't know about this one. I don't know. So, essentially the app will actually allow you to get a little more amplification, and it does sound better. It's mostly just a little bit louder, but with that extra volume I can hear a hear a little more clarity. So listening to the same headphones hooked up to the LGB30, which has an amazing Quad DAC inside. It's actually a fairly similar sound. I feel like this adapter will kind of punch up the music just a little bit, which personally I actually kind of like. But, is it worth 60 bucks? I'm not so sure. (item thuds) Pebble Time? Wait, this is 60 dollars? So, if you guys are not familiar, Pebble actually went out of business, which makes it a little weird that they're still selling them. So, for me, I actually really do enjoy using a smartwatch, mostly for things like notifications, which keeps me from keeping my phone out of my pocket all the time. But, let's see how this Pebble Time stacks up. I will say, even though, yes, this is like 50 dollars, the hardware still feels kinda cheap. Like, I would not wanna rock this rubber band every day. Once you set up the Pebble Time, you'll see it's actually a pretty much functioning smartwatch. So, not only can we go and control our music here, so we can start playing it from the phone in my pocket. But you can also go through, get your notifications, alarms. One of the main reasons to use a Pebble though is the battery life. So, while most smartwatches measure it in hours, this guy can last days on a single charge. And though yes, it's not going to be the most functional thing, and going forward, who knows how well this is actually going to be supported. But, for 50 bucks, not bad. Alright, what is our fourth product? (box thuds) A mysterious cardboard box. Okay? (laughs) A USB Pet Rock. - [Austin Voiceover] Important: Open box carefully. Do not remove rock before reading instructions. (laughs) It's literally a rock with a hole cut into it and a USB cable. Ken, how much did this cost? - [Ken] (laughs) - You're laughing too much; how much did this cost? - [Ken] 40. - 40 dollars? (laughs) It's a rock! It's a rock with a hole in it! There's a USB cable. You know, just when you think that Ken's doing a great job. He's busting out these cool tech items left and right, and then you get a USB Pet Rock. Alright, let's just plug this thing in and get it over with. I'm like half expecting this to be full of malware or something. Alright, what happens when we plug our pet rock in? Absolutely nothing. Absolutely nothing happens. At least we can make sure that our USB Pet Rock feels, like it's part of the 21st century, and connected to all the other devices in our lives. Uh... Yeah. (box thuds) What is this? A 50mm 1.8 lens? Oh. Oh, actually something that's not terrible. After the rock I was expecting garbage town. - [Ken] 50 dollars. - 50 dollars? Alright. Wow, this is... this is identical looking to the Canon 50 1.8. So, if you guys have ever really got into DSLRs, you'll know that usually the first lens you get is a 50-mil lens. Not only does it give you a kind of interesting look, but it's also really cheap. However, 50 bucks is, uh, that's pretty cheap. This is like laughably lightweight. But, if we pop it on our camera here, let's see what we got. (camera noise) (laughs) Did you hear that noise? (camera noise) (laughs) Okay, okay, let's do this, let's do this. (camera clicks) It's actually not that bad looking. Let's see here, let's take a picture of our super cool Pet Rock. (camera clicks) Dude, this is actually pretty decent. So, know that the Canon version, the one that they're knocking off here, is usually around $100 or so, so to get what looks to be pretty similar for 50 bucks is not bad at all. What you're looking at right now is actually a camera using a much more expensive 50mm lens. So, if we put the 50 dollar option on, this is what things look like. Now, I can't really tell from all the way over here, but it actually probably isn't that far off. Ken, what do you think? - [Ken] Pretty good. - Pretty good! Alright. So, does that mean we get to save a bunch of money on lenses now? - [Ken] No. (laughs) - We've officially got a Pet Rock in this video, and now we've downgraded our camera equipment. What else could you ask for? Before we get to the final product of the video, you guys may remember that a few weeks ago, we did a video on the LG Ultrawide Festival, who were awesome enough to sponsor this video. After going through all the applicants, the top three finalists are: Zachary, from Hammers and Circuits; Taylor Reed; and last but not least, Physics Phil. The finalists are going to join Lionus and I at his studio in Vancouver, where they're going to get to build their ultimate dream setup. Stay tuned, because Lionus and I are going to be doing videos from the event, but you guys actually still have a chance to win a monitor. The first quest is to fill in the blanks guessing the LG Ultrawide's key features, and the second one is simply to guess who is the final winner. So, be sure to check out those links in the description, and now let us see what is the final item of the video. (item smacks) - [Austin] The Smartphone Controlled Paper Airplane Conversion Kit? Convert your paper airplane into a smartphone-controlled flying machine. I think this will be pretty cool. I actually used to really enjoy building paper airplanes when I was a kid, although I haven't done it in like, a while. This is a good idea. This is pretty legit. How much was this? - [Ken] 35. - 35? Look at this, Ken coming in with the budget options. So, once you download the app, I can immediately see that this was designed by nerds. Not only do we have the signal strength, but we have fuel, we have the actual control, which I'm actually not going to do because we need to build our paper airplane. I know my paper airplanes. I can make my own. I said that with way more confidence than I really should've. This is really bad, this is actually not a great paper airplane. This is like, not even close to being even. (engine starts) Okay, the app's a little bit aggressive. (plane whirs) Oh, it's trying to take off, ahhh, no! (laughs) (plane whirs) (laughs) Alright, full power! (gadget crashes) Ohhhh! Alright, cut it out. Cut it. Okay, so what did we learn today? We learned that when the paper airplane comes with specific instructions on how to build the plane, you should probably listen to these. So, what do you guys think about Ken's picks for this video? Let us know in the comments below, and as always, the links to all this stuff will be in the description of the video. Anyway guys, thank you so much for watching, and I will catch you in the next one.",
    "transcript_keywords": [
        "USB Pet Rock",
        "Pet Rock",
        "rock",
        "USB Pet",
        "pretty",
        "bit",
        "Pebble Time",
        "Pet",
        "Paper Airplane",
        "video",
        "guys",
        "Alright",
        "good",
        "USB",
        "Paper",
        "Lightining Audio Amp",
        "Austin",
        "Pebble",
        "time",
        "Headphones"
    ],
    "transcript_entity_values": [
        "Tech",
        "DAC",
        "hours",
        "Canon",
        "The Klipsch K6i Reference Headphones",
        "iPhone",
        "50 bucks",
        "three",
        "60 dollar",
        "Pet Rock",
        "first",
        "50 dollars",
        "USB",
        "Ken",
        "Klipsch",
        "Austin",
        "40",
        "a few weeks ago",
        "Hammers",
        "Taylor Reed",
        "Quad DAC",
        "50-mil",
        "50 dollar",
        "the 21st century",
        "LG",
        "50mm",
        "60",
        "fourth",
        "60 bucks",
        "Austin",
        "Pebble Time",
        "60",
        "second",
        "Zachary",
        "Canon 50 1.8",
        "USB Pet Rock",
        "60 dollars",
        "every day",
        "the iPhone 7",
        "USB Pet Rock",
        "Lionus",
        "Vancouver",
        "Pebble",
        "Kenny",
        "One",
        "Phil",
        "35",
        "around $100",
        "today",
        "Pebble",
        "50mm 1.8",
        "last days"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "TIME",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "GPE",
        "ORDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "MONEY",
        "DATE",
        "ORG",
        "QUANTITY",
        "MONEY",
        "ORDINAL",
        "MONEY",
        "GPE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "MONEY",
        "DATE",
        "EVENT",
        "LOC",
        "PERSON",
        "GPE",
        "FAC",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE"
    ],
    "vector": [
        -0.06347177177667618,
        0.03597887605428696,
        0.009901397861540318,
        -0.03952158987522125,
        -0.03173045068979263,
        -0.024486063048243523,
        0.05013611912727356,
        -0.020130036398768425,
        0.0008637004648335278,
        0.06607609987258911,
        0.05163410305976868,
        -0.03823460638523102,
        -0.01086588017642498,
        -0.012011696584522724,
        -0.032370563596487045,
        0.03895384073257446,
        0.08574561029672623,
        -0.05156905949115753,
        -0.05245993658900261,
        0.027820255607366562,
        -0.01923411339521408,
        -0.00575912045314908,
        0.046268705278635025,
        0.05840616673231125,
        0.05924607068300247,
        0.06039935350418091,
        -0.04284968599677086,
        0.0031969270203262568,
        -0.05677571892738342,
        -0.04571419209241867,
        -0.03896412253379822,
        0.05991937965154648,
        -0.011781096458435059,
        -0.049100250005722046,
        -0.040847048163414,
        -0.047570306807756424,
        -0.004881381988525391,
        -0.04325377941131592,
        -0.04973403736948967,
        -0.03044464811682701,
        -0.016277099028229713,
        -0.042286891490221024,
        -0.0041842227801680565,
        0.008048220537602901,
        -0.073698490858078,
        -0.03957979008555412,
        -0.011278843507170677,
        -0.029868293553590775,
        0.004721523728221655,
        -0.03976276144385338,
        0.021738504990935326,
        -0.14599817991256714,
        0.0661168172955513,
        -0.01253675576299429,
        -0.03123350813984871,
        0.019902154803276062,
        -0.04487909376621246,
        0.025671815499663353,
        0.06772272288799286,
        0.03387608379125595,
        0.004794650245457888,
        -0.03702669218182564,
        -0.0025515074376016855,
        -0.005373269785195589,
        -0.027039751410484314,
        -0.038502924144268036,
        -0.03176078945398331,
        0.0022262996062636375,
        -0.020995544269680977,
        0.00824606791138649,
        -0.07646378874778748,
        -0.030131304636597633,
        0.05222461745142937,
        0.0004739337891805917,
        0.09478593617677689,
        0.03382079303264618,
        0.07385004311800003,
        -0.08410244435071945,
        0.042103927582502365,
        0.016353977844119072,
        0.03027515485882759,
        -0.06278833001852036,
        -0.06239032372832298,
        -0.048112522810697556,
        0.03995354846119881,
        -0.024229006841778755,
        0.08123762905597687,
        -0.01729935221374035,
        -0.04247146472334862,
        -0.08529088646173477,
        -0.025080736726522446,
        0.02794571965932846,
        0.024842629209160805,
        -0.0503276102244854,
        0.0022116885520517826,
        0.029668623581528664,
        -0.07446441799402237,
        0.06774526089429855,
        0.04177328571677208,
        0.0319804809987545,
        0.11461915820837021,
        0.04937107115983963,
        0.043071091175079346,
        -0.06153525039553642,
        -0.019526183605194092,
        -0.11769513040781021,
        -0.07854920625686646,
        0.08728110045194626,
        0.009700813330709934,
        0.01689053140580654,
        -0.0449945330619812,
        0.02401743084192276,
        -0.06064315885305405,
        -0.021543625742197037,
        0.03624650463461876,
        0.05258948728442192,
        -0.05105040594935417,
        0.0490102581679821,
        0.09419123083353043,
        -0.001021448289975524,
        -0.006514707114547491,
        -0.03460972383618355,
        -0.025740517303347588,
        0.029510026797652245,
        0.0342477522790432,
        0.05654727295041084,
        -0.058359745889902115,
        5.2025962027333766e-33,
        0.04569287225604057,
        0.09819485247135162,
        -0.03829199820756912,
        -0.15991324186325073,
        -0.05061917379498482,
        -0.0956091657280922,
        -0.029757540673017502,
        0.09483162313699722,
        -0.050277091562747955,
        0.07327262312173843,
        -0.0674932450056076,
        0.09536964446306229,
        -0.02481236681342125,
        -0.004790617618709803,
        0.03723309934139252,
        -0.04492801055312157,
        -0.055936601012945175,
        0.0548451766371727,
        -0.003100607544183731,
        0.025258516892790794,
        -0.026491627097129822,
        -0.0415588803589344,
        -0.004264092072844505,
        0.051916323602199554,
        -0.0029781635385006666,
        0.002129652537405491,
        0.017301755025982857,
        0.03524408116936684,
        0.022520536556839943,
        0.015422958880662918,
        -0.06015953794121742,
        0.036249320954084396,
        0.05465923622250557,
        -0.06656643748283386,
        -0.07432210445404053,
        -0.021300489082932472,
        -0.01766929030418396,
        -0.027597911655902863,
        -0.038293614983558655,
        -0.005854522809386253,
        -0.03256826847791672,
        0.0844992846250534,
        -0.07419651746749878,
        0.01889871060848236,
        0.04663798213005066,
        0.05339466407895088,
        -0.0001433460129192099,
        0.012807575054466724,
        0.08632735908031464,
        0.023757204413414,
        -0.06434066593647003,
        -0.03134552016854286,
        0.0032967582810670137,
        0.0611216202378273,
        -0.009709743782877922,
        0.023013992235064507,
        0.03497691825032234,
        0.012704957276582718,
        0.07585586607456207,
        -0.01663394086062908,
        0.003693288890644908,
        0.06375356763601303,
        0.028618883341550827,
        0.03914957493543625,
        -0.12033717334270477,
        0.03202037140727043,
        0.07477406412363052,
        0.03827653080224991,
        -0.13775727152824402,
        0.004063833504915237,
        -0.007128357887268066,
        0.033641740679740906,
        0.03730899840593338,
        -0.07258449494838715,
        0.06591666489839554,
        0.006372969131916761,
        -0.059994760900735855,
        -0.022276997566223145,
        0.027995800599455833,
        -0.019408656284213066,
        -0.013142258860170841,
        0.027206597849726677,
        0.016850030049681664,
        0.014832032844424248,
        0.019727762788534164,
        -0.015428051352500916,
        -0.018285928294062614,
        -0.04815969616174698,
        -0.04775512218475342,
        -0.005820256657898426,
        -0.006830357015132904,
        0.029464557766914368,
        -0.08673643320798874,
        -0.03567376360297203,
        -0.00058459781575948,
        -6.593272875997346e-33,
        0.09235324710607529,
        -0.026797162368893623,
        0.021695930510759354,
        0.07572784274816513,
        0.10235204547643661,
        0.022294580936431885,
        0.07963055372238159,
        0.0018887572223320603,
        0.022853199392557144,
        -0.01957840472459793,
        0.03825154900550842,
        0.01980096474289894,
        -0.024132762104272842,
        0.025290025398135185,
        0.02533518150448799,
        -0.08646681904792786,
        -0.09012718498706818,
        -0.0634041354060173,
        0.08841299265623093,
        0.031047919765114784,
        0.0690077543258667,
        0.025225674733519554,
        0.024465177208185196,
        0.012124397791922092,
        -0.051977500319480896,
        -0.016570094972848892,
        -0.03549483045935631,
        -0.017273293808102608,
        0.002792421728372574,
        0.009205639362335205,
        -0.02782081812620163,
        -0.017869532108306885,
        0.01670883595943451,
        0.0007914556190371513,
        0.009856573306024075,
        -0.005713083315640688,
        0.027651479467749596,
        -0.004264666698873043,
        0.04918339475989342,
        -0.0543825738132,
        -0.04988173022866249,
        0.06509416550397873,
        0.050401028245687485,
        -0.03697032481431961,
        -0.0005175263504497707,
        -0.07604680955410004,
        -0.03224119916558266,
        0.01968310959637165,
        -0.009166792035102844,
        -0.03681628406047821,
        -0.0010811503743752837,
        0.0023582398425787687,
        0.018801620230078697,
        -0.017122261226177216,
        -0.16243207454681396,
        0.024074796587228775,
        -0.06866613775491714,
        0.028916990384459496,
        0.004261525347828865,
        0.05364370346069336,
        0.010078737512230873,
        -0.0263174157589674,
        -0.07717090100049973,
        0.019889043644070625,
        -0.07537395507097244,
        0.08681048452854156,
        0.07377469539642334,
        0.013472245074808598,
        0.05981406196951866,
        0.013426115736365318,
        0.0006494512781500816,
        -0.013177738524973392,
        -0.021937046200037003,
        -0.08352566510438919,
        -0.01142499502748251,
        0.06288718432188034,
        -0.015395916998386383,
        0.00304582086391747,
        0.108433797955513,
        -0.006928034592419863,
        0.03559650480747223,
        0.044673677533864975,
        0.046312473714351654,
        0.04419447109103203,
        0.08505941182374954,
        0.008137675933539867,
        -0.031069228425621986,
        -0.006032047793269157,
        -0.08009309321641922,
        0.038924410939216614,
        0.0021976816933602095,
        -0.0009740933892317116,
        -0.035397838801145554,
        0.05975644290447235,
        0.017904074862599373,
        -6.159925192150695e-08,
        0.07936622947454453,
        0.04768342897295952,
        -0.0187696423381567,
        -0.008309846743941307,
        0.049282245337963104,
        -0.08801107108592987,
        -0.0005146677140146494,
        0.03148519992828369,
        0.013455911539494991,
        0.02266952581703663,
        0.04914087429642677,
        -0.09441663324832916,
        -0.02764638140797615,
        0.08010829985141754,
        -0.002590717049315572,
        -0.03797740116715431,
        -0.020616142079234123,
        0.0806770771741867,
        -0.07009339332580566,
        0.017102709040045738,
        -0.034621767699718475,
        0.06735318154096603,
        0.0885547548532486,
        -0.0686553418636322,
        0.03299726918339729,
        0.06653297692537308,
        -0.012008528225123882,
        0.10146727412939072,
        0.04362887889146805,
        -0.03212396427989006,
        -0.08737528324127197,
        0.05030744895339012,
        -0.1158464178442955,
        -0.009221856482326984,
        0.06686489284038544,
        -0.08833585679531097,
        -0.09147243201732635,
        -0.04829089343547821,
        -0.022819245234131813,
        0.041022222489118576,
        -0.04724966734647751,
        -0.18634381890296936,
        -0.08510288596153259,
        0.006199161522090435,
        0.024138253182172775,
        -0.011671803891658783,
        -0.0027143119368702173,
        -0.05637636408209801,
        -0.07382222265005112,
        0.09289281815290451,
        0.00318537256680429,
        -0.014342203736305237,
        -0.064057357609272,
        -0.024695347994565964,
        0.034144945442676544,
        0.05464008450508118,
        0.03637312352657318,
        -0.018630359321832657,
        -0.10967187583446503,
        0.018504539504647255,
        0.03914070501923561,
        -0.0950869768857956,
        0.012052168138325214,
        0.05012005940079689
    ]
}