{
    "id": "DhWL7lgnLnE",
    "title": "What is Dolby Noise Reduction?  Dolby's Humble Beginning",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2017-02-07T20:50:42Z",
    "video_url": "https://www.youtube.com/watch?v=DhWL7lgnLnE",
    "category": "Science & Technology",
    "tags": [
        "Dolby",
        "Dolby Digital",
        "What is dolby",
        "history of dolby",
        "tape noise",
        "tape hiss",
        "noise reduction",
        "ray dolby",
        "dolby b",
        "dolby c",
        "dolby nr"
    ],
    "views": 431524,
    "likes": 21805,
    "comments_count": 994,
    "description": "You can support this channel on Patreon!  Link below In this video we discuss the Dolby Noise Reduction systems found in consumer cassettes decks and how they work.  Though technically very simple, Dolby B noise reduction provides a very effective means of reducing audible tape noise, and was ubiquitous throughout the cassette's life.  Dolby noise reduction was such an important part of their legacy that the company still pays homage to it in their logo.  The \"D\"s in the Dolby Double D logo are really the shape of audio tape heads.  If you like videos like this, be sure to subscribe!  And Thanks for watching!  You can support Technology Connections through Patreon!  Find me here:   Music credit:  Hypnothis by Kevin MacLeod is licensed under a Creative Commons Attribution license ( Source:  Artist:",
    "description_links": [
        "https://www.patreon.com/technologyconnections",
        "https://creativecommons.org/licenses/by/4.0/)",
        "http://incompetech.com/music/royalty-free/index.html?isrc=USUAN1100634",
        "http://incompetech.com/"
    ],
    "transcript": "If you were born some time after, oh, lets say 1988, then when you see this symbol, the Dolby logo, you probably think of a movie theater or DVD with Dolby Digital 7.1 surround sound, or perhaps Dolbys newer technologies such as Atmos or Dolby Vision HDR. So you might be a little surprised to see it on an old cassette tape. Whats it doing there? Well, Dolby didnt start out in the movie business. In fact, they started in the business of sound. I suppose thats not a surprise, after all thats pretty much exactly what they do today, but their first product had nothing to do with surround sound, movies, or anything high-tech like that. Their first product was Dolby Noise Reduction. Ray Dolby started the company in 1965, and their first product was the Dolby 301 unit, a machine designed to help eliminate tape noise. With magnetic tape, the random structure of the particles that make up the tape create an audible signal that we dont want, a quiet but still noticeable noise that sounds like a hiss. This noise is always there, again due to the structure of the tape itself. During loud sections of a recording, its not that noticeable because compared the the signal, its barely perceptible. But during quiet parts of a song, it becomes much more of a problem. Through the magic of video editing, Im going to take the audio from this video and slap it on a cassette so you hear what this noise sounds like. There. Thats, better? Well I suppose its actually worse, but there you go, thats the problem. This tape noise permeates all recordings, and particularly in quiet or silent portions, its quite noticeable. Ray Dolby wanted to figure out a way to get rid of it. His solution is quite elegant. First, let me turn on Dolby Noise Reduction so you can hear the difference. There, that is better. Now the noise is much less noticeable. Its still there, sure, but its definitely not as annoying. But whats most interesting is the fact that the actual signal we wanted is unaffected. I dont sound any different now that were using noise reduction, the only thing that happened is now you can hear me better because the noise has gone away. So how does this work? Well, the first thing Dolby did was to figure out what the tape noise was. By using spectral analysis of a blank tape, you can see what sound frequencies make up the noise. Therefore, you can get a noise profile. Once Dolby had figured out the particular frequencies that made up the sound, it was simply a matter of using an equalizer to tune out those frequencies. Youve probably used an equalizer before as they come built into many music playing applications such as iTunes and the like. The equalizer has a slider for particular ranges of sound frequencies, and you can either boost each band or suppress it. Dolby noise reduction is a lot like taking the frequencies that make up noise and tuning them down a lot to make the noise quieter. OK, so lets do that. (pause) Now the noise is a lot less noticeable, But we have a new problem. Now the sound we want is dull, and my voice sounds muffled. This isnt really any better, its just a different problem. So how come nothing changed when we used it the first time? Let me turn that back off. Nothing changed the first time because Dolby Noise Reduction is actually a two way process. In order for it to work, the recording also has to be processed with Dolby NR. During recording, the Dolby Chip inside the cassette deck actually does the opposite of what it does during playback. Instead of cutting the frequencies associated with noise, it boosts them. Now Ill turn on Dolby noise reduction at the time of recording, but Ill play the tape back without Dolby turned on. (pause) Now my voice sounds really harsh, with ess sounds being particularly annoying. The ess sound is so satisfactorily nasty such that some sadistic, senseless sad sack might succumb to the sickening task of overusing these sounds to facilitate the driving of a point home. (clears throat) Yes, but there is a reason for this. By over-boosting these frequencies during recording, we eliminate the problem of a dull recording when using noise reduction. Lets look at the equalizer again. This is what happens when we use dolby during playback. These frequencies are pulled down to kill the noise. But by doing this, we also pull down any components of the signal , that is the sounds that we want, that lie within that range. But if you boost the frequencies that lie in the spectrum with the noise while recording, you end up with a recording that has these particular frequencies recorded too loud. Then, when you pull those frequencies down during playback, you not only pull the noise down and make it quieter, but you also bring the boosted parts of the signal down back to where they should be. In essence, the boosting of sounds we want during recording is canceled out bringing them back to normal during playback. Because any components of the signal that lie within the noise profile are boosted to compensate for the noise reduction, the effect is that only the noise is reduced. The signal remains intact. This is a process known as companding. The dynamic range of the recording, that is the difference between loud and soft sounds, it compressed during recording because some frequencies are recorded louder than they should be. Then during playback, the dynamic range is expanded by lowering those frequencies, and thus the noise floor. There is a catch, though. Because some sounds are boosted by the dolby circuitry when recording, the record levels that you use must be reduced a little bit to ensure they dont get distorted. Thats why the Dolby symbol usually appears on the level meter of a tape deck--this is the point on the meter that should not be exceeded when using noise reduction. When setting the level for recording, youd want the meter to just barely touch it at the loudest sections. The Dolby system used on consumer machines like this wasnt the best Dolby had to offer. Dolby A noise reduction is what Ray Dolby first invented, and was what was found in the professional recording studio. But Dolby-B, whats used on the vast majority of cassettes, worked pretty well, and it was a lot simpler and thus cheaper to implement. Later consumer systems, such as Dolby C and Dolby S, further improved on the noise reduction process. Dolby C came about in 1980, and it worked very well, about 60 % better than B. The problem with Dolby C, however, was that on non-compatible equipment, the tape sounds really weird. Have a listen. Heres a clip of some music from the YouTube Audio Library. Now heres what it sounds like on a Dolby-C encoded tape, played back without Dolby circuitry. Thats messed up. Turning on Dolby B helped a little, but not much. Dolby C used a much more complicated process to reduce noise, and thats why recordings made with it are less compatible. It also meant that pre-recorded tapes didnt shift to Dolby C, since no one wants to buy music that doesnt sound any good, and even fewer people were willing to put down the money for a new cassette deck. The next consumer development, Dolby S, was supposedly so good that with a decent quality Chromium tape, you couldnt tell the difference between a cassette encoded with Dolby S and a CD. It also was more compatible with Dolby B equipment, not suffering from the distortion of dolby C. The problem with Dolby S, though, was that it came about far too late, in 1989, with the CD already having found a prominent place in the market. The best noise-reduction technologies, such as those used in the professional Dolby SR or the competing DBX system, used very aggressive companding. The idea is to keep the signal recorded on the tape loud relative to the noise at all times. Remember, in loud sections of the recording, the noise isnt noticeable compared to the signal. So the best possible system would make the recording loud all the time, and during playback could tell which parts were intended to be quiet and thus lower the volume of the whole signal back to normal, therefore making the noise practically imperceptible. Though this isnt quite how companding is accomplished in the best systems, the effect is similar. But the problem with using this technique is that listening to a DBX encoded tape without a DBX capable decoder is very unpleasant. The same goes for Dolby SR. And thats precisely why the better systems never took off in the consumer space. Dolby B was simple and still pretty effective, but best of all a Dolby-B encoded tape could be played back on a standard cassette deck with reasonable results, again with the only difference being an over-emphasis of the treble sounds. And with most stereos having a bass and treble adjustment, just slightly turning down the treble would bring the sound back to more or less normal while still providing some noise reduction, of course the noise reduction youd get would be less precise and effective. We dont use noise reduction any more because, well, noise isnt a problem any more. Now that we use digital sound in virtually all applications, theres no need to add this sort of complex circuitry. But Im still impressed by the elegant solution to the problem. Automatic pre-emphasis of sounds within the noise profile when recording and then de-emphasis when playing it back is so delightfully simple, effective, and logical, that I cant help but admire it. Thanks for watching. If you like this sort of video, be sure to give it a thumbs up and subscribe to Technology Connections. Im doing my best to keep videos like this coming your way. If you have ideas of what to explore next, leave them in the comments. Id love to hear them. Ill see you next time!",
    "transcript_keywords": [
        "Dolby Vision HDR",
        "Dolby Noise Reduction",
        "Dolby",
        "Vision HDR",
        "Noise",
        "Noise Reduction",
        "Dolby Noise",
        "Dolby Vision",
        "recording",
        "Reduction",
        "sounds",
        "tape",
        "theater or DVD",
        "sound",
        "Ray Dolby",
        "frequencies",
        "tape noise",
        "signal",
        "problem",
        "Dolby logo"
    ],
    "transcript_entity_values": [
        "1988",
        "Dolbys",
        "Dolby S",
        "the Dolby Chip",
        "Dolby 301",
        "two",
        "Dolby SR",
        "Dolby Noise Reduction",
        "1989",
        "1980",
        "Ray Dolby",
        "today",
        "Atmos",
        "Dolby",
        "Dolby C",
        "first",
        "Technology Connections",
        "the YouTube Audio Library",
        "DBX",
        "iTunes",
        "about 60 %",
        "Dolby Noise Reduction",
        "First",
        "Dolby Digital",
        "Dolby NR",
        "Dolby Vision",
        "1965"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "FAC",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.0144329983741045,
        -0.024674369022250175,
        0.06510493159294128,
        -0.08816032856702805,
        -0.046595845371484756,
        -0.0273207388818264,
        0.05437832325696945,
        -0.04212252050638199,
        0.011837783269584179,
        -0.07849421352148056,
        -0.06786154210567474,
        0.027117008343338966,
        -0.007964606396853924,
        -0.02154063619673252,
        -0.0827997550368309,
        0.0034317669924348593,
        0.0907398983836174,
        0.05651435628533363,
        0.028071042150259018,
        -0.042263053357601166,
        0.018916267901659012,
        0.03888877481222153,
        -0.02015008218586445,
        0.08955076336860657,
        0.00808739848434925,
        -0.021294858306646347,
        0.010848515667021275,
        0.011037000454962254,
        -0.06189240887761116,
        -0.03236669301986694,
        0.025485580787062645,
        0.0325322225689888,
        0.08345528692007065,
        -0.07948429137468338,
        -0.06923164427280426,
        -0.09644468128681183,
        0.11364489793777466,
        0.02867269143462181,
        -0.004990199115127325,
        0.019651902839541435,
        -0.02545730583369732,
        0.0036271046847105026,
        0.06012968719005585,
        -0.020922213792800903,
        -0.130812406539917,
        0.0102176358923316,
        -0.016018353402614594,
        -0.11401966214179993,
        -0.03197762370109558,
        -0.041635528206825256,
        -0.021948520094156265,
        -0.04728597030043602,
        -0.013039329089224339,
        0.018204757943749428,
        0.03660779446363449,
        -0.0018123096087947488,
        0.036273203790187836,
        0.03670213371515274,
        -0.03217828646302223,
        -0.022641098126769066,
        0.02888241782784462,
        0.010178632102906704,
        0.016107656061649323,
        0.014941038563847542,
        0.05429884046316147,
        0.024022899568080902,
        0.005216205958276987,
        0.08309639990329742,
        0.04613746330142021,
        -0.080099917948246,
        -0.08989650011062622,
        0.02000296674668789,
        0.046348102390766144,
        0.007150230463594198,
        0.07196976989507675,
        0.01489250361919403,
        0.004006597679108381,
        -0.022485705092549324,
        0.02210373803973198,
        -0.021743610501289368,
        0.03657057136297226,
        0.0076877158135175705,
        -0.02992692030966282,
        -0.06218209117650986,
        -0.09444452822208405,
        0.011800821870565414,
        0.01594267599284649,
        -0.08509544283151627,
        -0.07991890609264374,
        -0.09226999431848526,
        -0.05628938227891922,
        -0.012962417677044868,
        -0.08622220903635025,
        -0.015292337164282799,
        0.005829745903611183,
        -0.04752091318368912,
        -0.0374748557806015,
        -0.00565335201099515,
        0.06683627516031265,
        0.04385082796216011,
        0.05686841532588005,
        -0.05575963482260704,
        -0.02262127213180065,
        -0.0630018562078476,
        -0.06925050169229507,
        -0.11301148682832718,
        0.020876379683613777,
        0.01448007207363844,
        -0.05018513649702072,
        -0.03236893564462662,
        -0.036021582782268524,
        0.055020809173583984,
        -0.042855165898799896,
        0.016856536269187927,
        -0.052124954760074615,
        0.03742336109280586,
        0.023967666551470757,
        0.0597289577126503,
        0.023726271465420723,
        -0.06032445654273033,
        0.023015618324279785,
        -0.0676615759730339,
        -0.0013529366115108132,
        0.018283193930983543,
        0.06153750792145729,
        -0.0649222731590271,
        -0.07420724630355835,
        4.797708928536148e-33,
        -0.011469150893390179,
        0.0865144431591034,
        -0.02065468765795231,
        -0.022274678573012352,
        0.05586937814950943,
        -0.07446044683456421,
        -0.07343742996454239,
        -0.009896387346088886,
        -0.03554314374923706,
        0.06303374469280243,
        0.02242395281791687,
        -0.00534836808219552,
        -0.043410733342170715,
        -0.007820759899914265,
        0.0061447834596037865,
        -0.1252794712781906,
        -0.0640534833073616,
        0.05032242089509964,
        -0.04899192601442337,
        -0.049220677465200424,
        -0.05281674489378929,
        0.10901165753602982,
        0.01927119679749012,
        0.04234043136239052,
        0.09779006987810135,
        0.012446359731256962,
        -0.008067981339991093,
        -0.01643327996134758,
        0.09421390295028687,
        0.04268788546323776,
        -0.026560088619589806,
        0.04479530453681946,
        0.000781665847171098,
        -0.04333433508872986,
        -0.018812943249940872,
        0.029476968571543694,
        -0.1422290951013565,
        0.012837680988013744,
        -0.015401875600218773,
        -0.022183045744895935,
        -0.0018787547014653683,
        0.008669165894389153,
        -0.07644713670015335,
        -0.0021982770413160324,
        0.01686510629951954,
        0.030308980494737625,
        0.049603499472141266,
        0.022129405289888382,
        0.03679849952459335,
        0.035872239619493484,
        0.05818207561969757,
        -0.04886765778064728,
        -0.09388700872659683,
        -0.03774933144450188,
        0.02276054583489895,
        -0.059248004108667374,
        0.04560266435146332,
        -0.06180427223443985,
        0.03238078951835632,
        0.007002136670053005,
        0.07111334800720215,
        0.035872455686330795,
        0.03638449311256409,
        -0.09529897570610046,
        -0.07390421628952026,
        0.02906186878681183,
        0.07345199584960938,
        -0.03619350120425224,
        0.001066152355633676,
        -0.03722332790493965,
        -3.85710118280258e-05,
        0.016637438908219337,
        0.004568875301629305,
        -0.01706967130303383,
        -0.0057614147663116455,
        0.04094001278281212,
        -0.02648402936756611,
        -0.01851568929851055,
        0.021177971735596657,
        -0.035710886120796204,
        -0.11020538955926895,
        0.0373164601624012,
        -0.04496266320347786,
        -0.041194476187229156,
        0.008568724617362022,
        0.09511947631835938,
        0.0045002843253314495,
        -0.021487955003976822,
        -0.03998042643070221,
        -0.05111251771450043,
        -0.06565474718809128,
        -0.028734056279063225,
        -0.01717272214591503,
        0.013922563754022121,
        0.008546042256057262,
        -6.205694021432006e-33,
        -0.005905108526349068,
        -0.0010553651954978704,
        0.028954923152923584,
        0.010994935408234596,
        -0.0166196059435606,
        -0.007567993365228176,
        0.05942252650856972,
        0.05975141003727913,
        0.07192905992269516,
        -0.03225361928343773,
        0.03886735439300537,
        -0.0011825138935819268,
        -0.028901049867272377,
        0.04250149801373482,
        -0.04984993860125542,
        -0.10751425474882126,
        0.006401644553989172,
        -0.018625089898705482,
        -0.018658023327589035,
        0.001827366417273879,
        0.061509281396865845,
        0.019577888771891594,
        0.009562792256474495,
        0.008171916007995605,
        -0.05188221111893654,
        0.02180725522339344,
        0.0021254848688840866,
        0.0349125862121582,
        0.12633201479911804,
        -0.009416644461452961,
        -0.0572117455303669,
        0.008674416691064835,
        -0.0018983877962455153,
        -0.0625506192445755,
        0.03999464958906174,
        0.025943554937839508,
        0.07546704262495041,
        0.03099060244858265,
        -0.12018904089927673,
        -0.10422711074352264,
        -0.09777813404798508,
        0.07564933598041534,
        0.035535939037799835,
        -0.051606740802526474,
        -0.031356025487184525,
        0.06609174609184265,
        -0.008904303424060345,
        0.029415098950266838,
        0.0027292240411043167,
        -0.012982291169464588,
        0.09067246317863464,
        -0.0010718569392338395,
        0.1307266503572464,
        -0.01966537907719612,
        -0.02210528589785099,
        0.044548701494932175,
        -0.004499898757785559,
        0.061713892966508865,
        0.04894402623176575,
        0.09832850098609924,
        -0.019819656386971474,
        -0.008623889647424221,
        -0.03956671431660652,
        -0.053065378218889236,
        -0.036251094192266464,
        0.07560914754867554,
        0.04255659878253937,
        0.0166497603058815,
        -0.0344981774687767,
        0.01234156358987093,
        0.05533365160226822,
        0.047922853380441666,
        -0.024379516020417213,
        0.024845192208886147,
        -0.019824424758553505,
        -0.07606061547994614,
        -0.07963305711746216,
        -0.05784860625863075,
        -0.05102189630270004,
        0.10581990331411362,
        -0.07432838529348373,
        -0.03326413780450821,
        0.01693328283727169,
        0.08849114924669266,
        -0.00037085512303747237,
        -0.02635529637336731,
        0.02045302651822567,
        -0.016403822228312492,
        -0.018420984968543053,
        0.0664757490158081,
        0.03660000115633011,
        0.10876989364624023,
        0.02346411906182766,
        0.04988643899559975,
        0.0014530668267980218,
        -5.539575198554303e-08,
        0.018455790355801582,
        -0.03599384427070618,
        -0.004976489115506411,
        -0.07516612112522125,
        -0.03157861903309822,
        -0.111966572701931,
        0.044342175126075745,
        0.04102955758571625,
        -0.010994484648108482,
        -0.09751514345407486,
        -0.02804660052061081,
        0.01669464074075222,
        -0.023158742114901543,
        0.013492723926901817,
        0.04899502545595169,
        0.05760259926319122,
        -0.08516860753297806,
        0.06500601768493652,
        -0.037930265069007874,
        -0.05915089324116707,
        0.05589413642883301,
        -0.009192919358611107,
        0.08463198691606522,
        -0.035168442875146866,
        0.00203538010828197,
        0.01112376619130373,
        0.09318414330482483,
        0.06549516320228577,
        0.06198688969016075,
        -0.06664755940437317,
        0.02755925804376602,
        0.035276226699352264,
        -0.0059527261182665825,
        -0.02126223035156727,
        -0.012953645549714565,
        -0.013673756271600723,
        0.013036264106631279,
        0.023131877183914185,
        0.019925104454159737,
        0.05574451759457588,
        -0.04134365916252136,
        -0.09749813377857208,
        -0.022762726992368698,
        0.059406984597444534,
        0.038183338940143585,
        0.008780802600085735,
        -0.0049107689410448074,
        0.022161802276968956,
        -0.035017985850572586,
        0.09888561815023422,
        0.027008365839719772,
        0.15155179798603058,
        0.009762405417859554,
        0.012883419170975685,
        -0.013684319332242012,
        -0.01410333439707756,
        0.009590408764779568,
        0.0614650584757328,
        -0.06817705184221268,
        0.039992354810237885,
        0.03174709528684616,
        0.00652641337364912,
        0.08210098743438721,
        0.1078893393278122
    ]
}