{
    "id": "dhxvXiwE8rY",
    "title": "I can't believe they let us touch these",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-01-11T19:27:45Z",
    "video_url": "https://www.youtube.com/watch?v=dhxvXiwE8rY",
    "category": "Science & Technology",
    "tags": [
        "samsung",
        "lg",
        "oled",
        "displays",
        "qd",
        "review",
        "ces",
        "2023"
    ],
    "views": 1958270,
    "likes": 74227,
    "comments_count": 6867,
    "description": "Thanks to Samsung Display for sponsoring today's video! Learn more about Samsung Display's newest tech through the below links: Samsung Display website:  OLED microsite:  Newsroom:   YouTube:    Discuss on the forum:    GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:39 Flex G 1:03 Samsung Display 2:12 Flex G Tablet 2:52 Flex S Style 3:30 Motorized Displays 5:45 Flex In N Out 6:52 Flex Note 7:39 Digital Cockpit",
    "description_links": [
        "https://www.samsungdisplay.com/",
        "https://oledera.samsungdisplay.com/eng/",
        "https://global.samsungdisplay.com/",
        "https://www.youtube.com/c/samsungdisplay",
        "https://linustechtips.com/topic/1480663-i-cant-believe-they-let-us-touch-these/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "This phone is not normal. This tablet, not normal. But maybe we should change that. Because the fact that designs like this and this are normal doesn't mean that they're the best. That is why Samsung Display sponsored this video to show you how their latest folding and expanding screen designs could make your next device less normal, but better suited to how you want to use it. And we'll be giving you guys all the facts you need to tell which ones are gimmicky solutions looking for a problem, and which ones are so exciting that you are going to want them in your next device. We're starting with a design they call the Flex G, I think because of how it looks in profile view. Folded, it's about the girth of a late 2000s era flip phone. But, fold it open and it becomes a shockingly slim 7.2 inch AMOLED display with an accompanying stylus. At least on this prototype. That's what you got to remember guys. These are not early units of upcoming Samsung electronics products. These are concepts from Samsung Display, a completely different company. Now, some of these proofs of concept could appear in Samsung branded devices, but they're just as likely to show up in devices from companies that you might traditionally think of as Samsung's competitors. This one is impressively thin, which helps it remain nicely compact when it's folded. I'm not sure if I'm personally convinced of this form factor, but if one of Samsung's partners wants to go forward, who knows? And that's because as a Samsung Fold user, I know that the extra work of opening one of these devices nudges me towards using it closed, and I'm not exaggerating here, about 80% of the time. So for me to buy into a Flex G style phone, it would need to have an outer screen for me to shoot off text messages from. Since typing on any screen wider than a couple of inches means really long travel distances for your thumbs. What's cool though, is that when we brought up the possibility of adding an external display to it, the response was, and I kid you not, why not? I mean, leave it to a display company to say, oh, you want more displays? Well, no problem, sir. Next up is the Flex G tablet concept, and I think this design makes a lot of sense. I love how the screen is fully protected when it's not in use, and I love how small it packs up. This is like sci-fi, guys. A 12.4 inch tablet that can be folded up and packed into a purse. I mean, it's easy to forget how much our clothes and our accessories are impacted by our devices. Like we take for granted that we need a backpack, lttstore.com, or at the very least, a messenger bag to hold on to our laptops and our tablets. But if these go mainstream, maybe it'll be the catalyst we need to finally bring the fanny pack back. Next up, there's the Flex S style, where my opinions are actually kind of flipped. With this config, you always end up with an outer screen, which I think is probably not that useful on a tablet, though it could be good for typing or reading. But on a phone, well, now you've got a single screen doing everything, whether the device is open or not. I like this a lot, and check out how awesome it is to close with one hand. Like, how could you do this without thinking, later peasants, future man has places to be. Flip, flip, flip, see you later. And you'll definitely feel like you're in the future when you see Samsung displays expanding screens. These are exactly as trippy to look at in person as they are on camera. They have a couple of displays that are motorized, but the prototypes here are manual, requiring very little, but not too little force to manipulate them. The idea is simple, want a couple extra inches for some extra tools? Just pull the screen apart. Want to get rid of those pesky black bars and watch the content at its native aspect ratio? Push it back together. They even have concepts that can both expand and fold. As mind bending and sci-fi as this tech is, though, there are a couple of things to keep in mind. Number one, these demos are a little more slick than what I would imagine real software is going to look like, especially at first. I mean, yes, operating systems like, say, Android are designed to be responsive, but that doesn't mean that the developer of the app you're using has implemented a way to thoughtfully use extra real estate that you randomly stretch out the phone into. And even if they have, there's a good chance that the UI is going to bug out for a second before it adapts, similar to how our phones stutter when they're rotated between portrait and landscape, which has been a feature for over a decade and yet it still happens. Second, the expansion is made possible by a slide out mechanism that does make the device thicker. It's a thing. Not only that, but the expanded area of the screen is a bit warped and sloped compared to the more stable parts, at least for now. It should be noted that this was a non-issue when we were looking at it directly, but it is something that you have to consider. Say you're sitting on a plane, you want to prop it up in between the two of you and enjoy a movie together with your seatmate. I think the main reason these things are worth noting here is because I'm still trying to figure out if an expanding or a slide out display makes sense on principle. If the screen can be bigger, won't people just want that extra space all the time? And if you can fold the display, wouldn't it be better to just whip it out rather than stretch it out? Like, no, really. I'm actually just asking you guys. Let me and let Samsung Display know how you imagine using these displays in the future in the comments below. There's a good chance, pretty much a 100% chance, that someone at Samsung Display, or maybe more importantly, their partners, is going to see your ideas and they could make their way into your hands in the future. Back in Foldingland, here's one that's a bit confusing at first. The Flex In-N-Out is like my Galaxy Z Fold, except after it's open, you can just keep on opening it. Why, you may ask? That's exactly what we asked. And the answer was that there's no new thing that this really allows you to do. But you can do all of the regular stuff that you could do with something like a Z Fold with less. You see, unlike my daily driver, this concept has no second external screen, but you could still use it one-handed and fold it over. So maybe you have it fully open when it's in your pocket, like at a convenience mode, or fully closed when it's anywhere else and it could be in protected mode. It also only needs one camera instead of five like mine, but still easily allows you to take selfies or... um, elses by flipping the device around. So I am excited by how bendable this screen is because it could be the concept that brings folding phones like this to more mainstream prices. I can't say this one looks like it'll come in at a mainstream price though. The Flex Note is basically a ginormous 17-inch tablet that, in theory, you could prop up and use like a laptop. It's a head-turner for sure, but I gotta admit that on-screen keyboards are a bit of a turn-off for me. So I personally wouldn't be too interested in this concept as it is, but if it has inputs that allowed me to use it as a foldable portable monitor? Whoa, now it's getting cool. Maybe I'm just lacking in imagination though, so if you guys can think of another way that this form factor would change your life, you gotta let us know down below. Speaking of external monitors, they did actually have one monitor on display. It doesn't fold, but the OLED color performance and pencil-thin form factor still made it worth including here. Not everything Samsung Display showed was focused on mobile devices though. The digital cockpit showed off a concept for what a future car absolutely full of screens could look like. This one in the front is particularly cool because like the Xenion Flex monitor that we saw recently, it can be curved or flattened depending on the driver's preference. Finally, we have a gaming concept that I think is way more compelling than you might at first realize. We've seen dual-screen handhelds before, and while I can immediately imagine this being great for emulating said device, the more day-to-day useful thing about this one, for me, is the way it moves your eyeline. As I noted in my recent short circuit on the GPD Win 4, the display of which slides up to reveal a keyboard, having the screen higher than your hands does wonders for ergonomics. And as an added bonus, the Flip serves as a built-in screen protector. Now anyone who's been a fan of small phones over the years, but has had to upgrade recently can tell you that the market is moving towards bigger screens. And that's awesome, you know, from a certain perspective, except when it isn't awesome. Not everyone has deep-pocketed Costco jeans, and likewise, not everyone has giant MKBHD hands. So I think the best thing about what Samsung Display is creating here is the flexibility, pun intended, to build devices that can serve a broader range of users without compromise. Thanks again, Samsung Display, for sponsoring this video, and I think even more importantly, giving us real hands-on time with these concepts. I'm actually super jelly that James got to be the one up close and personal with them. Don't miss any of the rest of our CES coverage, by the way, from the Away team. They're coming very soon. Or maybe already came, I don't know when this video is going up.",
    "transcript_keywords": [
        "Samsung Display",
        "Samsung",
        "Display",
        "screen",
        "Flex",
        "fold",
        "Samsung displays expanding",
        "Samsung Display sponsored",
        "Samsung Display showed",
        "concept",
        "device",
        "devices",
        "displays",
        "Samsung Fold",
        "Samsung Fold user",
        "normal",
        "phone",
        "flip",
        "displays expanding screens",
        "tablet"
    ],
    "transcript_entity_values": [
        "17-inch",
        "the years",
        "one",
        "UI",
        "second",
        "Flip",
        "first",
        "7.2 inch",
        "Galaxy Z Fold",
        "a couple extra inches",
        "Second",
        "a Z Fold",
        "daily",
        "a couple of inches",
        "five",
        "the GPD Win 4",
        "Flex S",
        "James",
        "Flex G",
        "Samsung Display",
        "a late 2000s",
        "100%",
        "Xenion Flex",
        "Samsung Display",
        "about 80%",
        "Foldingland",
        "MKBHD",
        "Samsung Fold",
        "The Flex Note",
        "CES",
        "Costco",
        "two",
        "A 12.4 inch",
        "Samsung",
        "Android"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORDINAL",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.1666177362203598,
        -0.03787733614444733,
        0.024474171921610832,
        -0.071624256670475,
        0.09017089009284973,
        0.0367220975458622,
        0.03939410299062729,
        0.01668628677725792,
        0.0050539011135697365,
        -0.05152231827378273,
        0.010511214844882488,
        -0.027951769530773163,
        0.0023446977138519287,
        -0.05560893565416336,
        -0.0249297134578228,
        -0.032967180013656616,
        0.06018521264195442,
        -0.05850498750805855,
        -0.06397572159767151,
        0.01919763907790184,
        0.06741007417440414,
        -0.060933977365493774,
        0.00310128484852612,
        -0.012259219773113728,
        0.03545643389225006,
        0.023841865360736847,
        -0.0371098667383194,
        -0.023385686799883842,
        0.03989138826727867,
        -0.06095310300588608,
        -0.030120717361569405,
        0.07311418652534485,
        0.027246767655014992,
        0.02761312760412693,
        -0.07214756309986115,
        -0.051327306777238846,
        -0.010165768675506115,
        -0.07693638652563095,
        -0.07555258274078369,
        -0.032066259533166885,
        -0.030643068253993988,
        -0.026720277965068817,
        0.009276601485908031,
        -0.07358177751302719,
        0.006101897452026606,
        -0.07143703103065491,
        -0.01497966330498457,
        -0.11848697811365128,
        -0.009516935795545578,
        0.05327427387237549,
        -0.11992323398590088,
        -0.049724072217941284,
        0.015659736469388008,
        -0.046090759336948395,
        -0.023451577872037888,
        0.007824680767953396,
        0.030083442106842995,
        -0.019512630999088287,
        0.07813391834497452,
        -0.006360794883221388,
        0.08445901423692703,
        -0.06892956048250198,
        -0.016138363629579544,
        0.055718548595905304,
        0.03976744785904884,
        0.0040510729886591434,
        0.004282643087208271,
        0.04800090566277504,
        -0.03246511146426201,
        -0.029040835797786713,
        -0.04235688969492912,
        -0.01366571243852377,
        0.029180027544498444,
        0.02744188718497753,
        0.006549194920808077,
        -0.019115200266242027,
        -0.001464656786993146,
        -0.05030667036771774,
        -0.019567448645830154,
        -0.03433224931359291,
        0.031431250274181366,
        -0.06049623712897301,
        -0.045856885612010956,
        -0.00451313192024827,
        0.04105205461382866,
        0.009952910244464874,
        0.031891047954559326,
        0.01466180756688118,
        -0.02469242364168167,
        -0.03794893994927406,
        -0.047324325889348984,
        0.10205694288015366,
        -0.008663446642458439,
        -0.025200368836522102,
        -0.013306829147040844,
        -0.017288345843553543,
        -0.0446341298520565,
        -0.04669884219765663,
        0.034003451466560364,
        0.10088788717985153,
        0.030081618577241898,
        0.03242040425539017,
        0.04316254332661629,
        0.0011258749291300774,
        -0.061130303889513016,
        -0.09110476821660995,
        0.08320438861846924,
        0.12567515671253204,
        0.028517840430140495,
        -0.00027857671375386417,
        0.010670691728591919,
        0.029450364410877228,
        -0.05648770555853844,
        -0.04720110818743706,
        -0.05823444947600365,
        0.03681615740060806,
        -0.03182431310415268,
        -0.03238552808761597,
        0.08802560716867447,
        -0.03278044983744621,
        0.0027248752303421497,
        -0.023548297584056854,
        -0.1074228510260582,
        -0.07825037091970444,
        0.011624251492321491,
        0.039317402988672256,
        -0.031622715294361115,
        -2.9078646403382408e-33,
        0.04444608464837074,
        -0.005808660294860601,
        0.020753392949700356,
        -0.09942560642957687,
        0.07427000254392624,
        0.030980737879872322,
        -0.0755334347486496,
        -0.0024493616074323654,
        -0.030229445546865463,
        0.025660594925284386,
        -0.007926343008875847,
        0.037786733359098434,
        -0.030870020389556885,
        0.0021729145664721727,
        -0.013875543139874935,
        -0.12163688987493515,
        -0.007690861355513334,
        0.02579282782971859,
        -0.030820751562714577,
        -0.017333384603261948,
        0.03478662669658661,
        -0.01116784755140543,
        0.008858517743647099,
        -0.05625898018479347,
        0.05652489513158798,
        0.05242305248975754,
        0.013194611296057701,
        0.04174754023551941,
        0.05307481065392494,
        0.03442620486021042,
        -0.027199890464544296,
        -0.009731448255479336,
        0.010477077215909958,
        -0.08788558095693588,
        -0.022404372692108154,
        -0.05361445993185043,
        -0.03765559569001198,
        -0.0658678263425827,
        0.025862840935587883,
        -0.03645367920398712,
        0.011590871028602123,
        0.030194485560059547,
        -0.13286668062210083,
        0.004596055019646883,
        -0.06902475655078888,
        0.07708952575922012,
        0.06492525339126587,
        0.04140500724315643,
        0.0752907544374466,
        0.016057120636105537,
        -0.04988691955804825,
        -0.014608471654355526,
        -0.0676136314868927,
        -0.04665985703468323,
        0.0387343131005764,
        0.044836658984422684,
        -0.05685454234480858,
        -0.008389244787395,
        0.02969854325056076,
        0.036897458136081696,
        0.004010554403066635,
        0.03270258754491806,
        0.030187712982296944,
        -0.025739723816514015,
        -0.08676028251647949,
        0.036438554525375366,
        0.10652565211057663,
        0.08687146008014679,
        -0.0485643707215786,
        -0.018230002373456955,
        -0.0791112631559372,
        -0.03545361012220383,
        0.06387360394001007,
        -0.03313018009066582,
        -0.021661609411239624,
        -0.0015692630549892783,
        -0.040478575974702835,
        -0.05003545805811882,
        -0.014127600006759167,
        0.009152534417808056,
        -0.037282757461071014,
        -0.07715814560651779,
        0.06796514242887497,
        0.0007744645117782056,
        -0.03228536248207092,
        0.002336147241294384,
        -0.02242068573832512,
        -0.0581025630235672,
        -0.03947471082210541,
        -0.034891728311777115,
        -0.09858942031860352,
        0.018592286854982376,
        0.04656784608960152,
        -0.03463449701666832,
        -0.056650277227163315,
        -6.931818555112026e-34,
        0.020727653056383133,
        0.07646451145410538,
        -0.03289611265063286,
        -0.0137014826759696,
        0.052733875811100006,
        -0.02340908721089363,
        0.06549157947301865,
        0.053544994443655014,
        0.019589779898524284,
        -0.006973939947783947,
        0.028227904811501503,
        0.03526495769619942,
        -0.1201803982257843,
        -0.055255595594644547,
        -0.0696285218000412,
        -0.02666245400905609,
        0.05649099871516228,
        -0.01824837736785412,
        -0.03804819658398628,
        -0.01595916971564293,
        0.014114188961684704,
        0.015576977282762527,
        -0.021017827093601227,
        0.062273479998111725,
        0.01306528877466917,
        0.021752357482910156,
        0.1133369579911232,
        0.10229235887527466,
        0.010518746450543404,
        0.052336435765028,
        0.09462113678455353,
        -0.01342676766216755,
        -0.07989547401666641,
        0.02844620682299137,
        0.012324973940849304,
        -0.029625337570905685,
        0.07312576472759247,
        0.015514634549617767,
        -0.06686984747648239,
        -0.013227197341620922,
        0.011525215581059456,
        0.034114427864551544,
        -0.011293364688754082,
        0.031808920204639435,
        0.046939920634031296,
        0.04521559923887253,
        -0.04733862727880478,
        0.015215717256069183,
        -0.08236222714185715,
        -0.03815079107880592,
        0.05047554895281792,
        -0.029794683679938316,
        0.032145071774721146,
        -0.0849638357758522,
        -0.007419995032250881,
        -0.004345657303929329,
        -0.00879712961614132,
        0.05177415534853935,
        0.015596756711602211,
        -0.014859369955956936,
        0.0698571503162384,
        -0.06324785202741623,
        -0.056524574756622314,
        -0.0922369435429573,
        0.03740137442946434,
        0.04955950006842613,
        0.07102324813604355,
        0.04833044856786728,
        0.0011664405465126038,
        0.0355190746486187,
        -0.044940393418073654,
        -0.04389113560318947,
        -0.04850101098418236,
        -0.04923011735081673,
        -0.054282985627651215,
        0.09733691066503525,
        0.01888675056397915,
        -0.033248819410800934,
        -0.013773740269243717,
        -0.10219074040651321,
        0.0013339159777387977,
        0.011541923508048058,
        0.10055644065141678,
        -0.04451615735888481,
        0.0551912896335125,
        0.11260301619768143,
        -0.021825045347213745,
        0.008741311728954315,
        -0.028171038255095482,
        0.036691807210445404,
        -0.15240144729614258,
        0.004926380235701799,
        -0.06518151611089706,
        0.06322066485881805,
        0.02356242947280407,
        -6.122704121480638e-08,
        -0.013548146933317184,
        0.05822514742612839,
        -0.011166256852447987,
        -0.006158424075692892,
        0.02529764175415039,
        -0.03466825187206268,
        0.022417880594730377,
        -0.0339946523308754,
        0.10825781524181366,
        -0.0533057376742363,
        -0.03212377429008484,
        -0.07846742868423462,
        -0.03009984828531742,
        0.024809783324599266,
        0.08441770821809769,
        0.03606108948588371,
        -0.044365473091602325,
        0.0645127147436142,
        -0.056301362812519073,
        -0.018491415306925774,
        0.004498202353715897,
        0.011655007489025593,
        0.08684767037630081,
        -0.07490932196378708,
        0.00827005971223116,
        0.033871129155159,
        0.020697420462965965,
        0.09557357430458069,
        0.08587758988142014,
        -0.05427521467208862,
        0.012734915129840374,
        0.018695345148444176,
        -0.02517458237707615,
        -0.05756433308124542,
        0.07396898418664932,
        -0.02156410925090313,
        -0.03816455975174904,
        -0.022402627393603325,
        0.07868250459432602,
        0.012527483515441418,
        -0.022383997216820717,
        0.02446555532515049,
        0.0590241514146328,
        0.04616474732756615,
        -0.05921389162540436,
        -0.01192272175103426,
        0.054269835352897644,
        -0.0125157181173563,
        0.018563147634267807,
        0.04800069332122803,
        -0.028926895931363106,
        -0.07798305153846741,
        -0.06539050489664078,
        0.030942343175411224,
        0.09249026328325272,
        0.004115181975066662,
        0.0016763947205618024,
        0.06342699378728867,
        -0.04277512803673744,
        0.1094600260257721,
        0.10773205757141113,
        -0.04787541553378105,
        -0.012815502472221851,
        0.10172048956155777
    ]
}