{
    "id": "DiSuDhIxk88",
    "title": "Top iPhone Accessories For Making Videos!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-01-23T18:14:47Z",
    "video_url": "https://www.youtube.com/watch?v=DiSuDhIxk88",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "vlogging",
        "film making",
        "iPhone vlogging",
        "iPhone tips and tricks"
    ],
    "views": 608350,
    "likes": 22509,
    "comments_count": 725,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, it's Justine, and today we're gonna talk about vlogging with your phone. I feel like, honestly, if you are wanting to make videos, and you haven't made videos before, or you don't have a camera or even if you do have a camera, most of you guys have phones, and even if it isn't the newest model, I guarantee that you can get some incredible video and footage from it. This video was inspired by the upcoming conference. It's called \"Vlog University.\" So I have an entire session at Vlog University dedicated to mobile productions. So if you happen to be in Los Angeles on January 31st through February 1st, this is gonna be a really fun two day workshop. We're covering everything that goes into creating content. I'll put a link in the description to vloguniversity.com, and be sure to use this code at checkout for a discount. A lot of the rigs and accessories that I'm gonna show you guys can be used for any phone, but obviously I'm gonna be using my iPhone to demo these. I'm gonna show you the first setup, which is extremely easy. (pop music) Oh look, the setup is done. Holding your phone just like this to make sure that you're in frame is one of the easiest ways to start filming. And making videos with your phone, you don't need anything. You just need this, and you need to hold your phone or have somebody else hold it for you. The biggest tip, though, that I have, and I still make this mistake, when you're recording on the front facing of any phones, do not look at yourself on the screen. And this is the most difficult thing to do. So right now, I am looking at myself on the screen, and it's so obvious that I'm not looking at the lens. So you need to find the lens on whatever device that you're filming with and look at it. This next setup is adding a tripod to your phone, which makes it so much easier to hold. There's a few different options. These are just two of the ones that I use quite often. I like this one because it will clamp your iPhone very tightly, and you can also rotate it, and it'll be attached to a tripod already. So you can shoot in vertical or horizontal depending upon what shot you're trying to get. You can use any small tripod. This is great for time lapses or hyper lapses or just straight-up vlogging. Like I said, it's great because you can also shoot vertical. You can use this for livestreams, if you're doing like Instagram live, or YouTube, or whatever it is that you do. TikToks... I don't know. This obviously is a little bit bigger. So if you are looking for a smaller setup, that's where this little guy (springing sound) comes into play. These type of small metal clamps can sometimes scratch your phone so I like to make sure that I do have on a case on my phone. I like this one a lot just because it's very small, super compact, and also very light. So phones do shoot really incredible video and audio. Obviously, there is room for improvement. So there's this little rig that I found. It's a cage made by SmallRig. They make so many amazing cages for cameras. They also even make 'em for your iPhone. And what's great about this is it's not just for an iPhone. So they have enough room in here so you can fit any size phone. My recommendation is to put the volume buttons up and make sure that there's enough room at the bottom for the power button so it doesn't turn off and on. So I've done this just so that I have access to the volume buttons. Clamps on, just like so, this is metal, it's pretty high quality which is really nice. And it has two cold shoe mounts right here on the top. And every single one of these little holes, SmallRig has a ton of accessories. You could attach so many different things to this. I'm not gonna overwhelm you guys too much. We're gonna keep it simple. We're gonna add a light and a microphone and a tripod. For this, I'm gonna switch out to a Benro, small, little tripod here. I like this tripod a lot because you can loosen this little blue ring and tighten it. And that gives you quick access to be able to move around whatever you have on top of it. Now we need a microphone. I actually got this one, a Shore Booth this year at CES, and this thing is awesome. So this came in a little kit in this little roll-up pouch. It also came with a little phone mount. This one's also really great because it has another cold shoe attachment. So not only can you just pop your little phone in here, but you can also mount their microphone. I really like this phone mount holder as well, but since we already have this rig set up, we're gonna try it with this. This microphone will also work with Android. It does have a USBC cable, and it comes with a lightening cable. So since I'm gonna be filming myself on the front-facing camera, I'm gonna be putting the microphone over here, facing towards me. And we just plug this in. The phone will power the microphone. This is just a micro USB, just gonna weave this through here. There's an app on the phone that connects to the microphone. It gives you access to all kinds of settings. Right now, the microphone is set to 60 degrees, but you can go all the way up to 135. This will automatically be saved onto the microphone, so you don't have to open this app every time. So I think I'm pretty happy with how my microphone is set up. But hmmm, it's a little dark in here. (whispers) No, it's not, but let's just act like it is. I think I need a light for my set up. I also found these guys at CES. This is a company called Lightra. Look how small this little guy is. It's so incredibly cute. And it's the perfect size for this mobile rig. This thing puts out a lot of light, too. Right now, this is only on the low setting. Medium, high, strobe! This also has little, tiny filters. Look how many different colors. So you have like a little diffusion. This thing even has little, mini barn doors. I don't have that attachment, but it's really cute. This is a bigger version of this one, but I feel like a Mobile Rig, this is a little bit heavier, so this is something that I probably would use more on a bigger setup. But if you do want more power and more light, yep, these are awesome. What's cool about this microphone is it does have a headphone port so you can monitor the audio, and that will also give you access to the sound that's happening in your phone. (upbeat pop music) And this is the internal microphone on the iPhone. Obviously, I know what this sounds like cause I shoot a lot on my iPhone. And it sounds pretty good. So here's a little audio test using the Shore microphone. And obviously, we're kinda set up in a studio setting here, so the lighting is already awesome. But I am using the little Lightra light. Let me just show you guys around a little bit. Tyler's over there. And then we've got some stuff over there that I'm showing you guys. Look, lights back here. Secret stuff just hidden everywhere. (slow pop music) We decided to come out on a mini adventure so that I could show you guys some more of the things that I use mobile vlogging. This is the DJI Osmo Three. This thing is awesome, because it will basically turn your phone into a stabilizer. There's even an app. So inside inside of the app, you can do all kinds of things, like motion tracking, motion lapses. You can get some really incredible stable and super steady shots. Even if I'm running- Should I do a run test? (yells) Here I go, I'm running! Look how steady! It's so steady! So one of the things that I love about this is it does have the DJI software. So you can do things like tracking and- Jenna, draw a box around me. Now, I'm green. So, now if I move, it will track me. I like this because, if you don't have another person to be able to film for you, you're able to track yourself. Cool demo, Justine. Let's climb. (light slow pop music) Wow, trying to rock climb and film at the same time, not so great. - [Girl] I can see you. - [Justine] You can? Good! Good to know I'm in the shot. I just got confirmation from a five year-old that I'm in the shot. I hope this works out. (light slow pop music) So mobile film-making, I feel like is an art, because you don't really have that much to work with. You basically have a phone and whatever the phone can do. But there's all kinds of fun attachments, like Moment lenses. This is actually a Moment case. So these lenses will just screw in and mount directly in front of the iPhone's camera lens, and it'll give you all kinds of cool shots. I have a macro and I have an anamorphic lens, I have a fisheye and a telephoto lens. One of the big comments that I read online is, \"Why would you need to get some other lenses when you have telephoto and wide angle on the iPhone?\" Well having this extra glass will give you a much crisper look. Let me show you the lenses and I will try not to fall. I'm gonna get on a little more steady of ground. This is a little case. It's so great, because I can fit my Mavic Mini in here, two batteries, plus all of my Moment lenses. This is a 14 millimeter. Let's take a photo. (camera shutter sound) Let's do some video. Oh wow, cool, this looks incredible! Hi, Tyler. And this is what I look like. Now I'm gonna take a picture to show you the difference between the wide angle on the iPhone and the wide angle on the Moment lens. Now here's the Macro lens. Look at this little guy! It has this clear, little thing around it so we can show you how close you need to be to something to actually be in focus. That is something that you never would be able to do (camera shutter sound) on just a regular iPhone. (camera shutter sounds) And just to prove to you that this shot, it could not happen. Here's the picture that I'm taking (camera shutter sound) with the regular phone. Like it will not focus, not gonna happen. Macro is cool for photos, but unless you're doing some really close-up macro video, I probably won't be using that for video very often, unless I find some cool ants or something. Here's some video using the telephoto lens. Oh wow, I'm so close up to you. Look at that, Peter McCannon and V-filter! Looks so good! And here's me. Am I in focus? Is it close, is it really close? It's very close. So I'm gonna set a motion lapse using the DJI Osmo. And then I'm gonna pop on the anomorphic lens to get some really cool shots. (slow pop music) I have an injury, just disregard my bandage. This is the anamorphic lens. So because this distorts your lens, you have to use a separate program. So I've been using FiLMiC Pro. It will take the footage that this is filming and squeeze it into the right aspect ratio so that you can actually use it. So I love FiLMiC Pro because it gives you access to everything in the camera. You can change the color temperature, the focus, the ISO, the shutter speed. It's like a real camera. I wish that I could get a lens there. That sun needs to pop back out. (slow pop music) So the best part about anamorphic lenses are the incredible lens flares, so you can see the iPhone go a little slower. (whispers) Look at that; look at that flare. (slow pop music) So that's it for this video. I just wanted to show you guys that you don't need a lot of crazy accessories. Honestly, if you just have your phone and a creative mind to go out and make some videos, this is really all that you need. All these accessories do just help you enhance what you already have. So just go out, start creating, and I can't wait to see what you guys make. Bye! (light sprightly music) Are you asking if this is the best way to go down? - [Tyler] Ummmm. - 'Cause I don't know if it is. Jenna came to pick us up, but I don't see her now. Going down, going down, going down. Wow, my car looks good over here! Look at that! (light sprightly music) Oh my gosh! What's up? Did you see the po-po over there? - They were really, they waved at me. - [Justine] They're cute. - They wave to you? - [Justine] No. This is actually a Moment case. You can tell there's little screws right here inside the little-- Oh God, I stopped breathing. (laughs) I have several different lenses. I have a macro, I have an anamorphic, I have a telephoto, and... Now I freaking forgot the other one! A wide angle! (laughs) - [Tyler] Fisheye. - [Justine] Fisheye? Gee, oh God!",
    "transcript_keywords": [
        "phone",
        "microphone",
        "lens",
        "iPhone",
        "Vlog University",
        "make",
        "guys",
        "video",
        "show",
        "Moment",
        "thing",
        "cool",
        "lenses",
        "tripod",
        "things",
        "great",
        "camera",
        "light",
        "lot",
        "set"
    ],
    "transcript_entity_values": [
        "14 millimeter",
        "Mavic Mini",
        "one",
        "DJI",
        "SmallRig",
        "Justine",
        "Vlog University",
        "CES",
        "Shore",
        "135",
        "iPhone",
        "Instagram",
        "USBC",
        "just two",
        "two day",
        "YouTube",
        "Vlog University",
        "Los Angeles",
        "Benro",
        "Justine] Fisheye",
        "Peter McCannon",
        "today",
        "this year",
        "Macro",
        "two",
        "a Mobile Rig",
        "Three",
        "Jenna",
        "five year-old",
        "the DJI Osmo",
        "60 degrees",
        "Tyler",
        "ISO",
        "Android",
        "first",
        "USB",
        "a Shore Booth",
        "January 31st through February 1st",
        "One"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "GPE",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "FAC",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.0377846285700798,
        -0.07603858411312103,
        -0.014814828522503376,
        -0.10367994010448456,
        0.03101041354238987,
        0.05899322032928467,
        0.03515215590596199,
        0.07312437146902084,
        -0.006078279577195644,
        0.07045470178127289,
        0.011939186602830887,
        -0.02507193386554718,
        -0.007006361149251461,
        0.06474798917770386,
        -0.012749271467328072,
        0.03858062997460365,
        0.0495208203792572,
        0.005150800105184317,
        -0.013018411584198475,
        -0.02737855166196823,
        -0.022792933508753777,
        -0.010466639883816242,
        0.09595704823732376,
        0.02143777906894684,
        0.004483113531023264,
        0.09201609343290329,
        -0.044935550540685654,
        0.007717770989984274,
        -0.036966901272535324,
        -0.05615461245179176,
        -0.01538698747754097,
        -0.011879818513989449,
        0.09415990114212036,
        0.026464179158210754,
        0.012853286229074001,
        -0.08458289504051208,
        0.04131525754928589,
        0.005771853495389223,
        -0.001202805433422327,
        -0.05231970548629761,
        -0.020981844514608383,
        0.017399249598383904,
        0.021993914619088173,
        0.026829611510038376,
        -0.05883507430553436,
        -0.03409207612276077,
        0.04738696664571762,
        -0.04331405833363533,
        -0.01366188284009695,
        0.05191609635949135,
        -0.0513460710644722,
        -0.0005320170312188566,
        -0.007877004332840443,
        0.04645790159702301,
        -0.03887740522623062,
        -0.010219399817287922,
        -0.07680757343769073,
        -0.028333811089396477,
        0.0793083980679512,
        -0.0325409360229969,
        0.03166341781616211,
        -0.00493056932464242,
        0.019899895414710045,
        0.04840430989861488,
        -0.049918532371520996,
        -0.09756993502378464,
        -0.005359938833862543,
        0.038413114845752716,
        -0.012123381718993187,
        0.0029834695160388947,
        -0.10987045615911484,
        0.03680459037423134,
        -0.027891982346773148,
        0.018268240615725517,
        -0.018885552883148193,
        0.05278962850570679,
        0.04469906538724899,
        -0.05904288589954376,
        -0.09415504336357117,
        0.03152605891227722,
        0.062248338013887405,
        -0.01900104433298111,
        -0.034431204199790955,
        -0.03545254096388817,
        0.020126884803175926,
        0.02694646455347538,
        -0.0030339891090989113,
        0.049537379294633865,
        -0.06328771263360977,
        -0.08816660195589066,
        -0.09191638231277466,
        0.020575713366270065,
        -0.023912595584988594,
        -0.08181562274694443,
        0.004091427195817232,
        -0.027407130226492882,
        -0.033165059983730316,
        -0.06791538000106812,
        -0.06731496006250381,
        0.01136504765599966,
        0.02605830319225788,
        -0.08506225794553757,
        0.015224275179207325,
        -0.04040232673287392,
        0.008384655229747295,
        -0.09357205778360367,
        -0.05265675112605095,
        -0.003102304879575968,
        0.03285353630781174,
        0.09299858659505844,
        -0.035701218992471695,
        0.027540529146790504,
        -0.09053338319063187,
        -0.07443679869174957,
        0.06270480155944824,
        0.0669400542974472,
        -0.021958306431770325,
        0.09035959094762802,
        0.06647253781557083,
        -0.0092465840280056,
        -0.031004849821329117,
        -0.03348427265882492,
        -0.01125751156359911,
        0.02569417841732502,
        -0.018888184800744057,
        0.02458897791802883,
        -0.057265300303697586,
        1.1682558770151146e-32,
        -0.006445038598030806,
        0.08577219396829605,
        -0.007008521817624569,
        0.0737244114279747,
        -0.01548607088625431,
        -0.034092482179403305,
        0.049180835485458374,
        0.0930735394358635,
        0.0005025533027946949,
        0.02624662034213543,
        0.013371031731367111,
        0.016943909227848053,
        -0.06226075440645218,
        0.054110102355480194,
        0.054609742015600204,
        -0.023594805970788002,
        -0.037001192569732666,
        -0.06700226664543152,
        -0.045532457530498505,
        -0.03704642131924629,
        -0.04406922310590744,
        -0.040118489414453506,
        -0.001873903558589518,
        0.13659316301345825,
        0.056286729872226715,
        0.014550285413861275,
        0.08756981045007706,
        -0.015127971768379211,
        0.07796204090118408,
        -0.026284677907824516,
        -0.0753503069281578,
        -0.023163653910160065,
        0.02553764171898365,
        -0.11126957088708878,
        -0.024747153744101524,
        0.00030876684468239546,
        -0.06263793259859085,
        -0.0347147099673748,
        0.03158845752477646,
        -0.007458712439984083,
        -0.07059528678655624,
        0.04849382862448692,
        -0.06651537865400314,
        -0.043224137276411057,
        0.06594698876142502,
        0.07306746393442154,
        0.020448891445994377,
        0.056042853742837906,
        -0.02438017725944519,
        0.008259348571300507,
        -0.00532906549051404,
        -0.04335681349039078,
        -0.004263564944267273,
        -0.029821282252669334,
        -0.035020794719457626,
        -0.037122372537851334,
        0.008321703411638737,
        0.03162454813718796,
        0.04252065718173981,
        0.03775070980191231,
        -0.030534623190760612,
        -0.013633272610604763,
        -0.04238652437925339,
        0.00012270930164959282,
        -0.0915546789765358,
        0.054423920810222626,
        0.09573874622583389,
        -0.04785400256514549,
        0.014739899896085262,
        0.11803104728460312,
        -0.05145343020558357,
        0.03733734041452408,
        0.02369007095694542,
        0.012139729224145412,
        0.02884102240204811,
        0.040249213576316833,
        -0.03189209848642349,
        -0.099629245698452,
        0.00336461397819221,
        -0.007121667265892029,
        -0.08522705733776093,
        0.0484626404941082,
        0.05099288001656532,
        0.09278630465269089,
        0.0066439607180655,
        -0.1301237791776657,
        -0.01740128919482231,
        -0.02932419814169407,
        0.0037946091033518314,
        0.0423017293214798,
        -0.013492322526872158,
        0.048042960464954376,
        -0.07588280737400055,
        -0.0024128693621605635,
        -0.05087030306458473,
        -1.0908829286656716e-32,
        0.0018555042333900928,
        0.014502064324915409,
        0.009227879345417023,
        -0.03301851078867912,
        0.07205872982740402,
        -0.031168384477496147,
        0.014322173781692982,
        0.030247056856751442,
        0.05064977705478668,
        -0.11742912232875824,
        0.018392853438854218,
        -0.052191197872161865,
        -0.06733022630214691,
        0.06445968151092529,
        -0.06814125925302505,
        -0.03942156210541725,
        -0.08118978142738342,
        -0.08868963271379471,
        0.05716710165143013,
        -0.04783530533313751,
        0.04950599744915962,
        0.09822669625282288,
        0.10971985757350922,
        -0.010703974403440952,
        -0.026799466460943222,
        -0.007652377709746361,
        0.029248680919408798,
        0.032808635383844376,
        0.07341726124286652,
        -7.429977267747745e-05,
        0.03355304151773453,
        -0.1450296938419342,
        -0.010738877579569817,
        -0.021546367555856705,
        0.017425091937184334,
        0.03846767172217369,
        0.01869579590857029,
        0.04575507342815399,
        0.02029457315802574,
        -0.053521864116191864,
        0.02987806312739849,
        0.04580100625753403,
        0.03743983060121536,
        -0.005157357081770897,
        0.010843579657375813,
        -0.04847037419676781,
        -0.06193452700972557,
        0.058767169713974,
        0.01188668143004179,
        0.023655474185943604,
        -0.06355249881744385,
        -0.003552241949364543,
        -0.054208625108003616,
        0.0077658407390117645,
        -0.036122459918260574,
        -0.008227930404245853,
        -0.03923211619257927,
        -0.03944728896021843,
        0.06450718641281128,
        -0.015007048845291138,
        0.037697210907936096,
        0.013668958097696304,
        -0.06740782409906387,
        -0.0587000846862793,
        -0.029676837846636772,
        -0.056588806211948395,
        0.05085879936814308,
        0.008951201103627682,
        -0.03887438029050827,
        0.017206553369760513,
        0.004175691399723291,
        0.0008895031060092151,
        0.031009836122393608,
        0.008962184190750122,
        0.01740899868309498,
        0.02332504838705063,
        -0.06834564357995987,
        0.0009312277543358505,
        0.08580999821424484,
        -0.06909815222024918,
        -0.0285059604793787,
        0.08172482252120972,
        0.030352095142006874,
        0.04110880568623543,
        0.12186553329229355,
        0.12367463111877441,
        0.1164434626698494,
        -0.012657866813242435,
        -0.012493453919887543,
        0.07304468750953674,
        0.02607223577797413,
        0.06522604823112488,
        0.029289361089468002,
        0.11462819576263428,
        -0.08427286893129349,
        -5.890699839028457e-08,
        0.023008817806839943,
        -0.018283789977431297,
        -0.031178859993815422,
        -0.0407097227871418,
        -0.01843440905213356,
        -0.04943341761827469,
        -0.017393745481967926,
        0.04821876809000969,
        0.16141511499881744,
        -0.04521254822611809,
        0.049227435141801834,
        -0.03955166041851044,
        -0.04867757111787796,
        0.11714822053909302,
        0.031599365174770355,
        0.0044237165711820126,
        -0.0572274774312973,
        0.07726403325796127,
        0.00477159908041358,
        -0.07427608221769333,
        -0.03747583553195,
        0.0869561955332756,
        0.007577500771731138,
        -0.019165324047207832,
        0.018697252497076988,
        0.02389383129775524,
        -0.005591456778347492,
        -0.04258749634027481,
        0.04009771719574928,
        0.01773366518318653,
        -0.011601320467889309,
        -0.02098780684173107,
        0.035546042025089264,
        -0.04923418536782265,
        -0.019142145290970802,
        -0.044849105179309845,
        -0.06966870278120041,
        -0.058675579726696014,
        0.002708323299884796,
        -0.00578550947830081,
        0.03349952772259712,
        -0.08287754654884338,
        -0.0077531649731099606,
        -0.004982824437320232,
        0.028511177748441696,
        -0.05399303138256073,
        0.022656075656414032,
        -0.10353302210569382,
        -0.007002358790487051,
        -0.023243160918354988,
        -0.10570229589939117,
        -0.01962185837328434,
        0.03614263981580734,
        -0.05314170941710472,
        0.06101049855351448,
        -0.000989795895293355,
        0.07242272794246674,
        0.02558799833059311,
        0.007350638508796692,
        -0.04747164249420166,
        0.05985896661877632,
        -0.010247533209621906,
        0.006872773636132479,
        0.06404377520084381
    ]
}