{
    "id": "dKk7F9uEWJ8",
    "title": "LG V30 Teardown - Best Cell Phone Camera Hardware Ever?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-09-19T14:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=dKk7F9uEWJ8",
    "category": "Howto & Style",
    "tags": [
        "LGV30",
        "LG v30",
        "LG V30 Teardown",
        "LG v30 review",
        "LG V30 Hands on",
        "LG",
        "LGusaMobile",
        "smartphone",
        "tech",
        "android",
        "best phone",
        "mobile phone",
        "LG V30 take apart",
        "guide",
        "LG V30 Screen repair",
        "LG V30 Battery replacement",
        "broken",
        "How to fix",
        "Repair",
        "10 bit sensor",
        "Camera teardown",
        "LG V30 Camera Teardown"
    ],
    "views": 2987375,
    "likes": 43178,
    "comments_count": 3506,
    "description": "This video was sponsored by LG - All the opinions are my own.  Its time to check out the build quality of the new LG V30. With a super detailed look inside the 10-bit image sensor hardware. Wich could very well be the best smartphone camera hardware ever! The most recent flagship from LG, the LG V30. I will be doing my FULL exterior durability test on the LG V30 as soon as I get my hands on a retail version of the phone. (When it is released to the public.) This video is the FIRST LOOK inside the NEW LG V30 Smartphone, LGV30 teardown. If you wanted to see the Teardown of the LGV30, you are in the right spot. I will disassemble and Tear-down the LGV30 completely. And also show How to reassemble the LG V30  Watch me take apart the LG V30 before the phone is even released.   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2iZ67Ty",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "[Helicopter landing] LG brought me to New York City to tear down their brand new LG V30, the camera hardware in this thing could quit possibly be the best in the world at the moment. Before I take a look at the inside, let's see what the footage looks like from the outside. [Music] [Intro] The coolest thing about this phone, in my opinion, is the camera. The hardware underneath the little glass lens is pretty amazing, and I'll explain why. But first we have to get to it. This pre-production version of the LG V30 is a super sleek looking phone. It has the metal body, bezel-less OLED display, and the full curved Gorilla Glass 5 on the front and the back. One cool thing with the curve, though, is that the glass is curved but not so much the display. I find that when using my curved Galaxy S8 without a case, the palm of my hand causes phantom touches to the screen since it wraps around the edge of the phone. But the LG V30 screen is all in the front, not wrapping around the edge, so hopefully it won't have that same phantom touch issue. Getting inside the phone is pretty straight forward. The LG V30 is ip68 water-resistant. One step above the ip67 water-resistant rating of the iPhone 7. I always enjoy pointing that out. Heat is our best friend during the glass removal. Warming up the phone until it's just barely too hot to touch. And then using a large suction cup to lift up and decrease the tension on the surface of the glass so I can slip my thin metal pry tool between the edge and the metal frame of the phone, slicing through the adhesive all the way around the underside of that glass layer. This adhesive is the type that hardens again when it's cooled down. So about every 30 or 40 seconds I'll warm it back up with my heat gun and keep on cutting. It is glass so I'm being careful not to flex it too much or cut too deep inside. Once the glass gets pulled off, there are fragile ribbon cables underneath - mainly the wireless charging and the cable that goes to the fingerprint scanner/power button - which is conveniently located in the center of the back panel instead of up right next to the camera lens. These little golden circles right next to the power button just rest up against the motherboard to do all the communicating. From here we can see all the inside of the exterior camera lens. This is actually made from Gorilla Glass 4, which lowers it's potential for being scratched or damaged compared to just regular glass, so that's good. Our goal here though is to see the guts of the camera unit, so let's go deeper inside the phone. There are 7 non-proprietary Philips head screws on the top half of the phone. Glad LG doesn't try to complicate things. Then there are three more screws that hold down the loudspeaker to the bottom of the phone near the charging port. I'll lift off the wireless charging. It's got those same golden contact pads for the power transfer that we saw with the power button. With a lot of restaurants and vehicles adding more wireless charging stations lately, I'm glad that LG has included it in their design. Phones with useful features are the best kinds of phones. I'll disconnect the battery and then reach down and pull up the loudspeaker. This little guy has the same water-resistant screen that we saw with the recent iPhones and the water-resistant Samsung phones. There are a few more ribbon cables keeping us from accessing that camera. I'll just start unsnapping those like little Legos. The front facing selfie camera is up there at the top, and the regular camera wraps around through the back side of the motherboard. Then down here at the bottom we have the screen ribbon cable and the charging port ribbon. The motherboard will come away from the phone body at this point if you remember to remove the SIM card tray. I left mine in place as an example for what not to do, of course. The SIM and the expandable memory tray are out of the phone. I can finally lift away the motherboard from the aluminum mid-frame and look at all these golden contact pads. This is a repair guy's dream. A totally modular phone. Less plugs and connections mean a more simple and modular design to work with. I'm definitely a fan of that. We have a headphone jack up in the top left hand corner. That deserves a thumbs up all by itself. Then the circular vibration motor is right below that, with it's golden contact pads. And then we have the earpiece and one small microphone up here at the top. One super cool things about this phone is that the earpiece turns into a receiver or a microphone during loud events, like at a concert. I'll explain more about this after we find the third microphone in just a second. And then here's the front facing camera that's also at the top of the phone. Right below that we have the golden contact pads for the volume buttons. Also embedded in this solid slab of milled aluminum is the copper heat pipe. We took a thermal imaging camera to the heat pipe inside the LG G6, and it actually does a pretty good job of wicking away heat from the processor. And finally we get our first look at the two rear cameras on the back of the phone. The standard camera is 16 megapixels, and the wide angle camera is 13 megapixels. Both held in place by separate ribbon cables. The wide angle camera is pretty cool all by itself,but the standard camera could very well have the best cell phone camera hardware on the market right now. I'll show you why as we tear it down. First of all, it does have OIS, that optical image stabilization that not every camera has. It also has electronic image stabilization to keep photos and videos extra crisp. There is to optical stabilization on the wide angle camera lens, but that's a different ball game anyway. Popping off the metal housing for the camera reveals my favorite part the 10-bit image sensor. This means that the LG V30 can capture over 1 billion colors. And the special cine video mode can output videos with up to two hundred and eleven percent more colors than you can with the average smartphone. These colors help improve contrast and definition of the image. I'm a camera guy. I use my cellphone camera quite a bit, so I'm pretty excited about this big step up in extra camera power. Most computer screens these days can't even display 10-bits of color yet, so this camera is really leading the futuristic curve. But even if your computer monitor only displays 8-bits of color, all the different shading that 10-bits can pick up will still enhance the dynamic range on your 8-bit monitor, so it's still a good thing either way. In order to fully utilize this 10-bit sensor though, we need light. And the more light we have, the better the sensor can capture an image. To help facilitate the light entering onto this sensor, there is an F/1.6 aperture camera lens inside this plastic housing also a world's first on a cell phone. Due to the shape of the lens, there's more light hitting the sensor on the LG V30 than any other cellphone on the market. The hardware is pretty intriguing, and judging by my initial helicopter ride, the software looks like it's keeping up so far. It was around this point that I realized I was not going to be able to put this back together in one piece. Since I am at LG though, I hope they have the backup replacement around here somewhere. Now that I'm finally through the plastic, look at all these different lenses inside the housing. It's pretty incredible how much development goes into such a small component. LG has used glass instead of plastic for the main lens inside this module. Using glass instead of plastic improves image clarity and starts bridging the gap between DSLR and smartphone cameras. Before coming out to New York to see this phone, I chopped open a real Canon DSLR camera lens so I can see if the lenses were even remotely similar when placed side-by-side. And while the Canon lens is significantly larger, both camera lenses have the same basic construction with all the different layers inside stacked on top of each other pretty impressive. After looking around I did find a replacement camera lens that fits inside the LG V30. Hopefully nobody notices what I did to the first one. Down at the bottom of the phone we have pretty much the cutest little charging port that I've ever seen. There are 2 screws holding down the USB-C port, which is also connected to the third microphone inside this phone. Let's talk about that earpiece mic again real quick. So let's say you're one of those people at a concert with your phone up in the air. Instead of your tiny little microphones recording the loud audio, the LG V30 earpiece turns into a microphone with anything above 120 decibels, like a rock concert, which means you actually get decent audio recording because the diaphragm of the earpiece is so much larger than those tiny little microphones. It's a pretty sweet little trick, plus the integrated quad deck allows quality playback of the audio you just recorded. That's pretty cool all by itself. The charging port has a huge thick orange rubber ring around the tip to help keep liquid out. The non-removable 3300 milliamp hour battery is next on my removal list. There are no magic pull tabs below this battery, but the adhesive is not destructive like we saw on the BlackBerry Key One. With a little bit of force the battery pops up and out on it's own. Still no dogs allowed though. You might have noticed the extremely small bezels on the 6 inch OLED screen of the LG V30. This was mastered in part by having the display driver IC flip around under the display and wrap up inside the phone. You can kind of see it from this angle here. Removing the display from the metal mid frame would destroy it and I can only assume that LG wants their phone back in one piece. I only attempt screen replacements if the display is already totaled. Speaking of getting the phone back in one piece, cross your fingers that it turns back on after I reassemble it. The cute little charging port and bottom microphone go back into the frame making sure that the rubber ring is still surrounding the port to help keep the water out. Every bit of water-resistance helps. I'll make sure that the screen ribbon is folded down and out of the way before dropping the battery back in place. There's still plenty of sticky adhesive on the frame so I'm just going to reuse it. The motherboard gets tucked back into the phone, making sure none of the ribbon cables are caught underneath it. And after plugging in the screen ribbon and the charging port ribbon, I can set the loud speaker back on top of the motherboard and get those three Phillips head screws back in place. And the last thing to plug in is the battery. The wireless charging can go on top of the motherboard. It has little black plastic clasps that fit into the metal frame, and then of course, the additional 7 Philips head screws to hold it all down tight. And finally the aesthetically pleasing back glass panel gets re-adhered over all the components. I'll definitely be doing my durability test as soon as I get my hands on a retail version of this phone. And it looks like a clear back panel is also a real possibility. It'll be interesting to see how this phone handles during my durability test. If it's anything like the LG G6 though, it will probably do just fine. I'm pretty impressed with this phone. If the software matches the hardware, this might be the first time LG gets me to switch over from Samsung. Thanks again LG for letting me review your phone from the inside. The camera hardware is pretty impressive. Come hang out with me on Twitter and Instagram and I'll keep you updated when I get the retail version of the LG V30 for my durability test. Thanks for watching, and I'll see you around.",
    "transcript_keywords": [
        "phone",
        "camera",
        "camera lens",
        "glass",
        "back",
        "inside",
        "pretty",
        "York City",
        "phone camera hardware",
        "phone back",
        "charging",
        "charging port",
        "lens",
        "ribbon",
        "camera hardware",
        "camera lens inside",
        "phone camera",
        "top",
        "screen",
        "angle camera"
    ],
    "transcript_entity_values": [
        "120 decibels",
        "Canon",
        "ip68",
        "8",
        "ip67",
        "Instagram",
        "two",
        "up to two hundred and",
        "13 megapixels",
        "three",
        "F/1.6",
        "Philips",
        "V30",
        "Twitter",
        "Legos",
        "6 inch",
        "Galaxy S8",
        "half",
        "1 billion",
        "Phillips",
        "SIM",
        "10",
        "5",
        "iPhones",
        "3300 milliamp hour",
        "the BlackBerry Key One",
        "first",
        "second",
        "Samsung",
        "First",
        "2",
        "these days",
        "the iPhone 7",
        "third",
        "DSLR",
        "16 megapixels",
        "One",
        "G6",
        "one",
        "7",
        "New York City",
        "New York",
        "10-bits",
        "LG"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "QUANTITY",
        "LAW",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "GPE",
        "QUANTITY",
        "ORG"
    ],
    "vector": [
        -0.11238988488912582,
        0.05889742076396942,
        0.0804843008518219,
        -0.12381266802549362,
        0.092778280377388,
        -0.047332677990198135,
        -0.0028158125933259726,
        0.09296070784330368,
        -0.022497758269309998,
        0.04461377114057541,
        0.06091562658548355,
        -0.03222202882170677,
        -0.05065980181097984,
        0.01212452631443739,
        -0.004786332603543997,
        0.01592290587723255,
        0.05327408388257027,
        0.011364097706973553,
        -0.07494526356458664,
        0.04134242981672287,
        0.02444923296570778,
        -0.07277932018041611,
        0.033010538667440414,
        -0.0019639909733086824,
        0.06961677968502045,
        0.03179595619440079,
        0.009126648306846619,
        -0.020979920402169228,
        -0.06103434041142464,
        -0.07451711595058441,
        0.016027111560106277,
        0.013427344150841236,
        -0.06624197959899902,
        0.03826695680618286,
        0.015547092072665691,
        -0.07067137211561203,
        -0.03404144570231438,
        -0.08527375757694244,
        0.001761223073117435,
        0.019452273845672607,
        -0.06842167675495148,
        0.011087904684245586,
        -0.0005094644147902727,
        -0.04872036725282669,
        -0.005230396054685116,
        -0.009462614543735981,
        0.08236290514469147,
        -0.03813444450497627,
        0.0015991213731467724,
        -0.020068207755684853,
        -0.010055184364318848,
        -0.007302491459995508,
        -0.010721346363425255,
        0.016656359657645226,
        -0.12095065414905548,
        0.08161363005638123,
        -0.04118620231747627,
        -0.024459190666675568,
        0.06555379182100296,
        0.024876100942492485,
        0.061008427292108536,
        0.11100515723228455,
        -0.03432342782616615,
        0.1110231950879097,
        -0.015574793331325054,
        -0.039845824241638184,
        0.10931989550590515,
        -0.10386817157268524,
        0.04308203607797623,
        0.016034720465540886,
        -0.09141311794519424,
        -0.00443568779155612,
        -0.040388721972703934,
        -0.05158637836575508,
        -0.05481512472033501,
        0.041332852095365524,
        0.0014658805448561907,
        -0.04275844618678093,
        -0.027471289038658142,
        0.015416166745126247,
        0.09500756859779358,
        -0.026519954204559326,
        -0.062418997287750244,
        -0.020122308284044266,
        -0.005676820408552885,
        -0.04027411341667175,
        -0.0041492534801363945,
        0.07426667213439941,
        0.016653811559081078,
        -0.06408776342868805,
        -0.040769536048173904,
        0.05937114357948303,
        -0.09504859149456024,
        0.016557643190026283,
        0.039163485169410706,
        -0.005945682525634766,
        -0.013633279129862785,
        -0.09147919714450836,
        -0.0458487942814827,
        0.02432660013437271,
        0.01939082331955433,
        -0.05551180988550186,
        0.06234422326087952,
        0.02426544390618801,
        0.03424932435154915,
        -0.06492515653371811,
        -0.04926449805498123,
        0.0467599593102932,
        -0.04198415204882622,
        0.025369917973876,
        -0.028956357389688492,
        0.04771394282579422,
        -0.04861500859260559,
        -0.045961685478687286,
        -0.012872577644884586,
        0.05403539538383484,
        -0.049249447882175446,
        0.011021035723388195,
        0.07158468663692474,
        -0.010808128863573074,
        0.06066718325018883,
        -0.0906868577003479,
        -0.08235272765159607,
        -0.03281264752149582,
        0.045976344496011734,
        0.0001983727270271629,
        0.00931650772690773,
        4.5235347894404344e-33,
        0.04445122927427292,
        0.07144858688116074,
        -0.017534289509058,
        -0.023056166246533394,
        -0.04410639777779579,
        0.04839187487959862,
        0.06689669191837311,
        0.04174356907606125,
        -0.07157494872808456,
        0.027880650013685226,
        0.0013960100477561355,
        -0.04819156974554062,
        -0.04310382902622223,
        0.0042527783662080765,
        0.033761169761419296,
        0.0183683130890131,
        -0.053420793265104294,
        -0.01961362734436989,
        -0.08227681368589401,
        0.0832967683672905,
        -0.021404804661870003,
        -0.007667163386940956,
        0.06901993602514267,
        0.021317653357982635,
        0.03498140722513199,
        0.001768128713592887,
        0.06323742121458054,
        0.012980533763766289,
        -0.001784912426955998,
        0.0197983980178833,
        -0.07053425908088684,
        -0.03160877525806427,
        0.017626427114009857,
        -0.036414094269275665,
        0.0036706868559122086,
        0.026738537475466728,
        -0.00994591973721981,
        -0.08522634208202362,
        -0.03488752245903015,
        -0.056620676070451736,
        -0.012104484252631664,
        0.12873074412345886,
        -0.037362609058618546,
        -0.020531950518488884,
        0.051512353122234344,
        0.015950750559568405,
        -0.06640659272670746,
        0.041517917066812515,
        -0.055831510573625565,
        -0.0012727592838928103,
        0.08859685063362122,
        -0.08485352993011475,
        -0.062277913093566895,
        -0.020240813493728638,
        -0.04824105650186539,
        0.06049085780978203,
        0.017090370878577232,
        0.016002854332327843,
        -0.010588029399514198,
        0.08031181246042252,
        0.04952755942940712,
        0.012394108809530735,
        -0.0005327154067344964,
        0.05886761099100113,
        -0.02555929124355316,
        -0.04063532128930092,
        -0.015078594908118248,
        0.04133424535393715,
        -0.06301987916231155,
        0.059144310653209686,
        -0.03508686274290085,
        -0.07860774546861649,
        0.034448157995939255,
        -0.03573936969041824,
        0.09287774562835693,
        0.027791518718004227,
        -0.07130042463541031,
        -0.007054108660668135,
        -0.029004033654928207,
        -0.01590288244187832,
        -0.0024604792706668377,
        0.04871495068073273,
        0.07747907936573029,
        0.0070054675452411175,
        -0.02234106883406639,
        -0.07115285843610764,
        -0.04227809980511665,
        -0.08918265253305435,
        0.00048153966781683266,
        -0.006088615395128727,
        -0.02303433232009411,
        -0.033082474023103714,
        0.07523670792579651,
        0.001725433161482215,
        -0.009328647516667843,
        -4.144865814712343e-33,
        0.005969200283288956,
        0.014038858003914356,
        0.019262857735157013,
        0.006951397750526667,
        -0.009859099984169006,
        -0.07572202384471893,
        0.1467924267053604,
        0.06381438672542572,
        0.05730421096086502,
        -0.015783952549099922,
        0.030820056796073914,
        0.030956411734223366,
        -0.06028188765048981,
        -0.028051700443029404,
        -0.03653311729431152,
        -0.015629379078745842,
        0.03696141764521599,
        -0.09740486741065979,
        0.0002505982993170619,
        0.004041341599076986,
        0.11594770848751068,
        0.046181850135326385,
        0.0691186711192131,
        0.0056761931627988815,
        0.0014155349927023053,
        -0.006647385191172361,
        0.03195519745349884,
        -0.004710356704890728,
        0.04147682338953018,
        -0.1387239247560501,
        0.021555185317993164,
        -0.03350897133350372,
        0.05772696062922478,
        0.04721282422542572,
        0.03263859078288078,
        0.05488566309213638,
        0.03683959320187569,
        -0.07251928746700287,
        0.06464461237192154,
        -0.038047097623348236,
        0.03851591423153877,
        0.05649583041667938,
        -0.025286326184868813,
        -0.03575680032372475,
        0.016664767637848854,
        -0.06741919368505478,
        0.05860405042767525,
        -0.03512304276227951,
        -0.0006369789480231702,
        0.02095281518995762,
        -0.0753273069858551,
        -0.019737014546990395,
        -0.05211300402879715,
        0.0647643432021141,
        0.008112652227282524,
        -0.028054723516106606,
        0.010235372930765152,
        -0.056402385234832764,
        0.012055311352014542,
        0.0356152206659317,
        0.08105277270078659,
        0.10368726402521133,
        -0.030455609783530235,
        0.003062395378947258,
        -0.03750618174672127,
        -0.029338032007217407,
        0.038742706179618835,
        -0.00997945573180914,
        -0.0056098573841154575,
        0.0935816764831543,
        0.007246492430567741,
        0.03371068835258484,
        -0.03136616200208664,
        -0.04251110926270485,
        0.06949550658464432,
        0.01381269097328186,
        -0.05734299123287201,
        0.0484718382358551,
        0.08802847564220428,
        -0.03046637400984764,
        0.049206241965293884,
        -0.07622887194156647,
        0.015433501452207565,
        0.07271469384431839,
        0.12391316145658493,
        0.008539809845387936,
        -0.05181146040558815,
        0.012671208940446377,
        0.031009241938591003,
        0.05982034653425217,
        -0.029509076848626137,
        -0.03741680458188057,
        -0.01817379705607891,
        0.05370116978883743,
        0.05962710827589035,
        -4.600551051225921e-08,
        0.07435154169797897,
        0.04598500579595566,
        -0.0631009042263031,
        -0.004845804534852505,
        0.0031244729179888964,
        -0.10914101451635361,
        0.015798447653651237,
        0.03909048065543175,
        0.050801776349544525,
        -0.08508842438459396,
        0.026532424613833427,
        -0.06497073918581009,
        -0.057489991188049316,
        0.06778998672962189,
        -0.005006871651858091,
        0.05706688389182091,
        -0.006999033968895674,
        0.08467748016119003,
        -0.034239623695611954,
        0.053370051085948944,
        0.017170988023281097,
        -0.0027252391446381807,
        0.07532916963100433,
        -0.04299531504511833,
        0.01983344368636608,
        0.030629023909568787,
        -0.13334143161773682,
        -0.0023243725299835205,
        0.0460708886384964,
        -0.010645337402820587,
        0.011577683500945568,
        0.01339243445545435,
        -0.004055480007082224,
        -0.02492980659008026,
        -0.006179077550768852,
        -0.020969731733202934,
        -0.04664984717965126,
        0.017162170261144638,
        0.043858714401721954,
        0.025702420622110367,
        0.004962618928402662,
        -0.04855118691921234,
        0.00044237906695343554,
        0.02035376988351345,
        0.048200689256191254,
        -0.025351539254188538,
        0.0448756068944931,
        -0.10605664551258087,
        -0.08593866229057312,
        0.02435142919421196,
        -0.08003229647874832,
        -0.04056534171104431,
        -0.11245198547840118,
        -0.027644528076052666,
        0.03000827133655548,
        -0.05176674947142601,
        0.1119677796959877,
        -0.011779673397541046,
        -0.04267524182796478,
        -0.03415769338607788,
        0.010323746129870415,
        -0.004857481922954321,
        0.014985010027885437,
        0.07976352423429489
    ]
}