{
    "id": "DNQGoAzBOUQ",
    "title": "Exclusive Behind the Scenes Look at Forza Motorsport Cover Cars!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-06-11T17:36:11Z",
    "video_url": "https://www.youtube.com/watch?v=DNQGoAzBOUQ",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Unboxing",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 64426,
    "likes": 2688,
    "comments_count": 178,
    "description": "I got a chance to visit @xbox and check out the cover cars for the all-new Forza Motorsport, the Cadillac V-Series.R and Chevrolet Corvette E-Ray! Join a community fueled by competition in the all-new Forza Motorsport, coming this October 10 to Xbox Series X|S, Windows 10 and 11 PCs via the Microsoft Store and Steam, and Xbox Game Pass for PC and console. You can pre-order today be clicking here:  #XboxPartner   PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE:    GET YOUR OURA RING:    FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -",
    "description_links": [
        "https://www.xbox.com/en-US/games/forza-motorsport",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "https://oura.link/ijustine",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ"
    ],
    "transcript": "- Hey guys, it's Justine and it might look like I'm at a racetrack right now, but I'm not. I'm inside of a studio with the two new Forza Motorsport cover cars. We've got the Cadillac V-Series.R and the Corvette E-Ray. I'm so excited. (upbeat music) I partnered with Xbox to share something really special with you. The new Forza Motorsport is coming out on Tuesday, October 10th and I had the incredible opportunity to check out the cars that are on the cover. Yeah, those two cars that you see right there, here I am with them in real life. The first Forza Motorsport game was released back in 2005 and the last one was all the way back in 2017, so we haven't had an all new Forza Motorsport game in over six years. This game has been built from the ground up with an overhaul of the physics for more accuracy, the beauty of the cars and tracks, there's a new dynamic time of day, advanced car damage and real-time ray tracing on the track for even more realistic gameplay. This is the most technically advanced racing game ever made and I cannot wait to play it. Now before we get more into the new 2023 Forza Motorsport release, I feel like we should take a moment to look back at the history of Forza and the iconic cars that have defined this franchise. Forza Motorsport was first introduced in 2005 for the original Xbox, setting the stage for this groundbreaking racing series with the first cover car, the Acura NSX. This game featured over 200 cars and focused on realistic physics and handling, which set it apart from its arcade style competitors. The second installment we had \"Forza Motorsport 2.\" This expanded the roster to over 300 cars and improved the graphics and physics engine and on the cover was the Nissan 350Z. And I'm not gonna lie, back in the day the 350Z was the car of my dreams. \"Forza Motorsport 3\" brought the Audi R8 to the forefront. This mid engine supercar was a symbol of European engineering and it solidified Forza's status as a premier racing franchise. The game also introduced a new rewind function which would let you undo mistakes and perfect your driving skills. The fourth game came out in 2011 and it featured the Ferrari 458 Italia. The game included over 500 playable cars and added auto vista mode, allowing players to explore their favorite vehicles in stunning detail. \"Forza Motorsport 5\" graced us with the McLaren P1 on the cover. As a launch title for the Xbox One, this game showcased the console's improve graphics capabilities and introduce the drivatar system, which used cloud computing to create a more realistic AI opponent. All of this was based on players' driving styles and it was really fun because sometimes you would be driving and you would just see one of your friends cruising by you. I would always text them and be like, you're driving recklessly in Forza right now. I just wanted to let you know. You're unhinged. In 2015, \"Ford Motorsport 6\" took us back to America with the Ford GT, a legendary car with a rich racing heritage. This installment also introduced wet weather and night racing, adding new challenges and depth to the gameplay. The Porsche 911 GT2 RS was the last car on the \"Forza of Motorsport 7\" cover. This high performance machine represented the pinnacle of German engineering and was a fitting choice of the franchise most ambitious entry yet. And that my friends brings us to today. After six years of waiting, let's check out some gameplay of the new Forza Motorsport. (upbeat music) (engines roaring) Obviously with the power of Xbox Series X and Series S consoles, we'll be getting significant graphics improvements and taking full advantage of ray tracing technology for more realistic reflections, visual effects, 4K gameplay at 60 frames per second for a more immersive racing experience. They also rerecorded the sound library to be compatible with Windows Sonic and Dolby Atmos, so riding in a car with more turbo will give you a much more real life representation of what it's like in game. As for the tracks, we can expect the return of some fan favorite circuits alongside the introduction of new locations and challenges for us. I also love the new dynamic time of day weather systems and lighting tweaks to make everything even more realistic. One of the things that I'm so excited about with this game is this will be the most accessible Forza Motorsport game ever,featuring blind driving assist. This will let players who are blind or low vision use supplemental audio cues about their position on the track. Something that I have loved so much is the way that Microsoft really is putting accessibility in the forefront. They've done so much for accessibility in gaming to let more players be able to play than ever before. I cannot tell you guys how excited I am for this game. I will definitely be having a Forza party in my house when it comes out. I'm hoping that I'll be the champion or maybe not, it's okay, as long as I come in the first maybe top three, but I guess maybe that actually might not be completely fair because as you're about to see, I actually got to go and sit behind the wheel of the real life cars from the game and it was quite an experience. (upbeat music) Both of these cars are absolutely stunning and seeing them up close was so awesome. For any of you car enthusiasts out there, you might already know that the Cadillac V-Series.R is actually Cadillac's third generation prototype race car and boasts a powerful V8 engine. The design is striking and super aggressive. Even just parked here in the studio, this thing just looks fast. Also super exciting, this car won its first race back in May at Laguna. - I think one of the big things that drew us to this platform was the ability to really translate Cadillac's design language into a high performance vehicle. (engine roaring) We really wanted to bring something to the fans and to the racetrack that was gonna reflect Cadillac's brand. - Like they're racing this car, like right now, basically. - Oh yeah, this is a race winning platform right here and this is definitely a very busy car. This is the future of the platform. This is the future of the sport and so I'm excited for people to experience it. We worked really closely with Forza on making sure that they had an understanding of what the aero properties of our car are like, what the power and performance curves are like, as well as what the experience is gonna be like inside of the car providing them with math data and CAD information so that they could build a real authentic experience for the fans. - So now somebody hopping into the game, why would you tell them to choose this car over any of the others? - [Kalvin] Oh, just look at this car. It's clearly the most gorgeous car that you're ever gonna see and from a pure performance and driving experience perspective, this is the one to go with. - Do you think they can get in? Are they afraid I might take off? How do you get in here? - [Kalvin] This just raced, so it's a little dirt. - Okay. - There you go. - All right, it's official. We're gettin' in. I gotta take my shoes off first. - Snake down into it. - Okay. - And like I said, you're really gonna sit down there. - Whoa, yeah, we're really down there. It's like a perfect fit. - [Kalvin] There you go. - Okay, but how can they see anything? You can't see the road. Can you see the road? - [Kalvin] They can see a little bit of the road. - No, I don't believe it. - [Kalvin] Remember they have helmets on too and their neck movement is limited as well. - You can't see anything. I can't even imagine what it's like to be behind this wheel going nearly 200 miles an hour down the track. I could barely get in and out of this thing and I couldn't even see over the steering wheel to see the road, so it was pretty scary, but so freaking cool. There's no way anyone can see out of this windshield. There's no way. Is this conformed to the racer's butt. Okay, should we close me up? See ya later. Oh man, this is such a tight squeeze. So I'm inside the car. I don't know how anyone sees out of this vehicle. Oh my goodness. Get me an Xbox controller. This is too intense. (upbeat music) The Chevrolet Corvette E-Ray, on the other hand, is definitely a little more approachable. It's so beautiful and with the added electric boost, it's going to be so fun to drive virtually and in real life. The exterior is sort of a futuristic version of the classic Corvette aesthetic and the interior is just as cool. It feels luxurious but also super functional. So even someone like me who is definitely not a pro race car driver, I felt very comfortable behind the wheel parked, but I was behind the wheel. I felt great. So right now they're setting up for a wheel shot of the Corvette and my idea is I'm gonna be in the car when they do the reveal, so it's like, hi, I'm drivin' (upbeat music) So the interior in this one is so nice. I think that's one of the things that I was a huge fan of with Corvette is you can customize it with so many different colors. This is definitely the color that I think I would choose for myself. It's perfect. The E-Ray is an electrified sports car that combines raw power with state-of-the-art all-wheel drive technology. It's one of the only sports cars with two separate propulsion systems to provide naturally aspirated V8 power with the electrified responsiveness of electric all-wheel drive. It is the fastest production Corvette in history with 2.5 second zero to 60 miles per hour and a quarter mile in just 10.5 seconds. The E-Ray really is a perfect blend of style, performance, and sustainability, making it a truly remarkable addition to the world of electrified sports cars. - The Corvette has always been a staple on the racetrack and a monster to go lap after lap, but what this car brings is that all-wheel drive cloud of the corner immediacy of the all-wheel drive system and I think that's what we want people to get out of driving this car in the game. - Now for anyone who doesn't know, this is an electrified Corvette. So what's different between this and a traditional one? - So this is a performance electrified variant, so what we wanna do is give you both the legendary LT2 small block V8 experience with that complementing front axle performance. So really both systems work best in parallel, especially on a racetrack when you want 655 horsepower to get you down the straightaway. - So what can people expect and why should they choose this car when they first hop into the game? - [Cody] You really should choose this car because it's fast, it's fun to drive, and there's nothing more fun than getting to the throttle sooner and letting the all-wheel drive rocket you out the front. - That's awesome. I'm so excited. This is definitely gonna be one of the first cars that I try out for sure. After getting acquainted with how each car looks and feels and nearly getting stuck in the Cadillac, I'm so excited for this game. I'm such a huge Forza fan. It is just so fun because it really does let you experience these cars as close to real life as possible. Obviously we're standing in front of the two new cover cars this year, so how do you guys choose which cars are gonna make the cover? - Well, these two cars in particular are really meaningful to me and the team. There's two halves of Forza Motorsport. There's the production side, the production cars or sports cars, and then the race cars, right, so this is the first time that we're bringing a production car and a race car and really representing those two halves of Fortza Motorsport. This time around, we're really focusing on car building as part of the actual career mode. So you'll get into the game and it's not just about building your car, but it's about building your career over time and it's about building that deeper relationship with individual cars. - So I think one of the things that's most important for not only the car manufacturers but for gamers is we want these to be authentic to the actual experience because I know a lotta times, there's no way that any of us are actually ever gonna be behind the wheel of any of these cars, so how do you maintain that? - We've got so much information, CAD drawings, all of the data around the engine weight, how it's balanced and all of that, so it comes through faithfully in the game. It is a deep racing simulation at its core. Our physics have gone through a complete overhaul this time around, so it is an authentic racing simulator, but we have these amazing assists that allow anyone to jump in now regardless of skill and just enjoy the game. - With Forza's dedication to precision, unmatched gaming experiences, a vast array of vehicles, and state-of-the-art gaming development, I am so hyped for the 2023 edition of Forza Motorsport and I think this is gonna be the best yet and I cannot wait to play. This was so much fun and I can't wait for you guys to get your hands on this game to be able to test out these cars for yourself. Leave me some comments below and I will see you guys on the track.",
    "transcript_keywords": [
        "Forza Motorsport",
        "Forza Motorsport game",
        "Forza",
        "car",
        "cars",
        "Motorsport",
        "Forza Motorsport cover",
        "game",
        "Motorsport game",
        "Motorsport cover cars",
        "Forza Motorsport release",
        "accessible Forza Motorsport",
        "Corvette",
        "race car",
        "cover cars",
        "sports cars",
        "racing",
        "Cadillac",
        "experience",
        "cover"
    ],
    "transcript_entity_values": [
        "Forza Motorsport 3",
        "Forza",
        "the Audi R8",
        "second",
        "V8",
        "over 500",
        "one",
        "six years",
        "Fortza Motorsport",
        "nearly 200 miles an hour",
        "GT",
        "European",
        "Justine",
        "Windows Sonic",
        "Xbox Series X and",
        "2.5 second zero",
        "2017",
        "4",
        "Porsche",
        "60 miles per hour",
        "three",
        "Forza Motorsport 2",
        "2015",
        "Cody",
        "the day",
        "2023",
        "Forza of Motorsport 7",
        "Laguna",
        "Kalvin",
        "Xbox",
        "Chevrolet",
        "Corvette",
        "2011",
        "just 10.5 seconds",
        "Italia",
        "May",
        "over 300",
        "Forza Motorsport 5",
        "Dolby Atmos",
        "655",
        "this year",
        "200",
        "Nissan",
        "350Z",
        "today",
        "Cadillac",
        "over six years",
        "two",
        "the Acura NSX",
        "Ferrari",
        "Forza Motorsport",
        "2023",
        "911",
        "the \"",
        "vista",
        "German",
        "America",
        "60",
        "Microsoft",
        "Ford",
        "Tuesday, October 10th",
        "first",
        "fourth",
        "a quarter mile",
        "Ford Motorsport 6",
        "2005",
        "third",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "NORP",
        "PERSON",
        "PRODUCT",
        "EVENT",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "TIME",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "DATE",
        "ORDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.08856577426195145,
        -0.01357786264270544,
        -0.05182653293013573,
        -0.056145716458559036,
        0.08234313875436783,
        0.07447929680347443,
        0.013072924688458443,
        0.034037306904792786,
        -0.0312613844871521,
        -0.011025948449969292,
        -0.018851567059755325,
        0.016234606504440308,
        -0.04655560851097107,
        0.044032882899045944,
        0.024904616177082062,
        0.026838965713977814,
        0.0436849482357502,
        -0.03313528001308441,
        -0.05976785346865654,
        0.01996474713087082,
        -0.03151705488562584,
        -0.06997288763523102,
        0.061797164380550385,
        0.036340370774269104,
        -0.07839775085449219,
        0.03772735968232155,
        -0.03577052801847458,
        0.03463225066661835,
        -0.053827762603759766,
        -0.06491328030824661,
        -0.06239671632647514,
        0.03830808028578758,
        0.05604739487171173,
        0.01571805775165558,
        -0.0181440319865942,
        -0.10416422039270401,
        -0.008629552088677883,
        -0.032725974917411804,
        -0.13473744690418243,
        -0.07921745628118515,
        -0.024666452780365944,
        -0.0002719292533583939,
        0.007819273509085178,
        -0.02772016078233719,
        0.017648575827479362,
        -0.08216647058725357,
        0.015858357772231102,
        -0.0305034127086401,
        0.03376860171556473,
        0.023564502596855164,
        -0.04477393999695778,
        -0.05418450012803078,
        0.01846412569284439,
        -0.008020208217203617,
        -0.08257964998483658,
        0.009211507625877857,
        -0.09655915945768356,
        -0.0022053509019315243,
        -0.0019053613068535924,
        -0.04006453976035118,
        0.057067226618528366,
        -0.02692807838320732,
        -0.08516200631856918,
        0.06625605374574661,
        -0.0935172587633133,
        -0.014329107478260994,
        0.008009088225662708,
        0.030867500230669975,
        -0.01805873028934002,
        0.01567673496901989,
        -0.027971487492322922,
        -0.002576117403805256,
        -0.010997846722602844,
        0.0038960000965744257,
        0.008746519684791565,
        0.02314312756061554,
        0.07849479466676712,
        -0.032926492393016815,
        -0.05873560905456543,
        -0.038175810128450394,
        0.039008334279060364,
        -0.08406500518321991,
        -0.05595145747065544,
        -0.016465678811073303,
        0.019988948479294777,
        0.04206671193242073,
        -0.018255174160003662,
        0.03215010091662407,
        -0.017362046986818314,
        -0.020481795072555542,
        -0.10570468008518219,
        -0.004039001651108265,
        0.03137756139039993,
        0.008625071495771408,
        -0.07998059689998627,
        -0.006786771584302187,
        0.03161875158548355,
        -0.03538493439555168,
        0.004647741559892893,
        0.06662401556968689,
        0.03837687522172928,
        -0.06830162554979324,
        0.011691550724208355,
        0.005562016274780035,
        -0.029994867742061615,
        -0.016025260090827942,
        0.004339840263128281,
        0.07511179894208908,
        -0.02939947508275509,
        -0.02550944872200489,
        0.016201630234718323,
        0.0025139241479337215,
        -0.0206537377089262,
        -0.05052565783262253,
        -0.044665731489658356,
        0.05841558054089546,
        -0.010948332026600838,
        0.08207875490188599,
        0.07382817566394806,
        0.0032801846973598003,
        0.01679961197078228,
        -0.06951329112052917,
        -0.0007330352673307061,
        0.007776135113090277,
        0.048014137893915176,
        -0.05454903841018677,
        -0.11474572122097015,
        7.482356558873844e-33,
        -0.004007834009826183,
        0.035661354660987854,
        0.03937787935137749,
        0.07844243198633194,
        -0.0015047636115923524,
        0.014817222021520138,
        0.028543539345264435,
        0.08189450204372406,
        -0.11029502749443054,
        0.05707922205328941,
        -0.022360801696777344,
        0.04119541123509407,
        -0.029861517250537872,
        -0.02988499216735363,
        0.03998975455760956,
        -0.01400697510689497,
        -0.013877675868570805,
        -0.020445190370082855,
        -0.11600768566131592,
        0.0010849479585886002,
        -0.0145338773727417,
        0.010472692549228668,
        0.00266495393589139,
        -0.0019405829953029752,
        0.030173590406775475,
        0.12248855084180832,
        0.04553952068090439,
        -0.04639732092618942,
        0.07134419679641724,
        0.038114260882139206,
        -0.0769205316901207,
        0.027683913707733154,
        -0.03117988631129265,
        0.056349366903305054,
        0.011116521432995796,
        0.045739270746707916,
        -0.07339409738779068,
        -0.02270457148551941,
        -0.006788080092519522,
        0.07286686450242996,
        0.02328731119632721,
        -0.026358969509601593,
        -0.11650759726762772,
        -0.1050092801451683,
        0.03593531250953674,
        0.04336388036608696,
        0.07160374522209167,
        0.11432478576898575,
        0.00514763779938221,
        0.04567059874534607,
        0.028949175029993057,
        0.0032476973719894886,
        -0.09543897956609726,
        -0.0022204623091965914,
        -0.06044246628880501,
        -0.006052268203347921,
        -0.03158154711127281,
        0.06713172048330307,
        0.049514610320329666,
        -0.025028672069311142,
        0.02550821378827095,
        -0.003075119573622942,
        0.0017230984522029757,
        -0.02751651406288147,
        -0.05732578784227371,
        0.0690188854932785,
        0.08423997461795807,
        -0.02924835868179798,
        -0.032121263444423676,
        0.08499272167682648,
        -0.054085005074739456,
        -0.01971024088561535,
        -0.03653312847018242,
        0.03731292486190796,
        0.1189318597316742,
        0.004576649516820908,
        -0.09365423768758774,
        -0.020571626722812653,
        0.0660739317536354,
        0.06455481797456741,
        -0.10381913930177689,
        0.0403226800262928,
        -0.015024274587631226,
        0.05388473719358444,
        -0.0030476157553493977,
        -0.00601015891879797,
        0.03041660226881504,
        0.018033184111118317,
        0.015989601612091064,
        -0.02289309911429882,
        -0.03926996886730194,
        0.04630662500858307,
        -0.00682085333392024,
        -0.042648568749427795,
        0.013326417654752731,
        -7.573931976906716e-33,
        0.06831827014684677,
        -0.05662184953689575,
        0.0020191229414194822,
        -0.010052974335849285,
        0.0898052379488945,
        -0.009739103727042675,
        0.008363856002688408,
        0.027128256857395172,
        0.09881352633237839,
        0.0015711599262431264,
        0.05947388708591461,
        -0.023784857243299484,
        -0.07433770596981049,
        -0.004600234795361757,
        -0.02967033162713051,
        -0.02702108584344387,
        -0.012452705763280392,
        -0.07105850428342819,
        -0.015343478880822659,
        -0.061283621937036514,
        -0.004157313145697117,
        0.04287996143102646,
        0.045957788825035095,
        0.013130823150277138,
        -0.05677547678351402,
        -0.009114847518503666,
        0.05623544380068779,
        0.03841567412018776,
        0.12281736731529236,
        0.02902684174478054,
        -0.0571376271545887,
        -0.012190587818622589,
        -0.07510858029127121,
        -0.03795516490936279,
        0.04062911868095398,
        0.0987580418586731,
        0.02036774903535843,
        -0.010392508469522,
        -0.05777933448553085,
        0.02695503458380699,
        -0.04017016291618347,
        -0.013937748968601227,
        -0.0268825963139534,
        0.07792514562606812,
        0.03473537042737007,
        -0.07680170983076096,
        -0.04006577655673027,
        0.03912539407610893,
        0.004725628532469273,
        0.05411141365766525,
        0.019245751202106476,
        -0.045916322618722916,
        0.029080746695399284,
        -0.0026681902818381786,
        -0.046156544238328934,
        -0.03423907980322838,
        -0.013870199210941792,
        -0.02278740331530571,
        0.0027460334822535515,
        0.0401584692299366,
        0.07010733336210251,
        -0.02993113547563553,
        -0.09831608831882477,
        -0.09706603735685349,
        -0.02211918495595455,
        -0.05723084881901741,
        0.07088238000869751,
        0.019269557669758797,
        0.0005333941662684083,
        -0.008066417649388313,
        -0.018787438049912453,
        -0.03569061681628227,
        -0.04481935128569603,
        -0.0003503665211610496,
        0.0084907878190279,
        -0.026613321155309677,
        -0.029208954423666,
        -0.006855798419564962,
        0.1337270885705948,
        -0.0199748445302248,
        0.0030201703775674105,
        -0.02352219447493553,
        0.11452370882034302,
        0.11661669611930847,
        0.11181499809026718,
        0.06326021254062653,
        0.04956620931625366,
        0.06178862974047661,
        0.021447518840432167,
        0.07233283668756485,
        0.02686668559908867,
        0.10212989896535873,
        0.06733377277851105,
        0.13120868802070618,
        -0.06889073550701141,
        -5.874516872950153e-08,
        0.05380116403102875,
        0.03690030053257942,
        -0.037187449634075165,
        0.006982367020100355,
        -0.03758396580815315,
        -0.03189396485686302,
        -0.03836923465132713,
        -0.022306915372610092,
        -0.0011397124035283923,
        -0.007240725215524435,
        0.03832773119211197,
        -0.00026036417693831027,
        0.023426329717040062,
        0.08340141177177429,
        -0.044588275253772736,
        0.03147497773170471,
        -0.05303044244647026,
        0.08552029728889465,
        -0.05593160167336464,
        0.01924316957592964,
        -0.006196320988237858,
        0.04880484566092491,
        0.04486685246229172,
        -0.06405594944953918,
        0.030973991379141808,
        -0.023791108280420303,
        -0.08933726698160172,
        -0.03145484998822212,
        0.10046429187059402,
        -0.022376270964741707,
        -0.053335826843976974,
        -0.022533763200044632,
        0.06859859824180603,
        -0.002125364728271961,
        -0.035961464047431946,
        -0.052612751722335815,
        0.0006979692843742669,
        0.027299851179122925,
        0.09005825221538544,
        -0.06665509939193726,
        0.05516044795513153,
        -0.10566990077495575,
        -0.030531197786331177,
        0.02948429062962532,
        -0.02582359127700329,
        -0.018594175577163696,
        0.026124799624085426,
        -0.13766653835773468,
        -0.08055519312620163,
        -0.07775025069713593,
        -0.07093197852373123,
        -0.013072210364043713,
        -0.019789867103099823,
        0.02884598821401596,
        0.06713917851448059,
        0.03355115279555321,
        0.06093643233180046,
        0.034737616777420044,
        0.004600589629262686,
        -0.04742049425840378,
        0.008733807131648064,
        0.03830169886350632,
        -0.02531331591308117,
        0.05071211978793144
    ]
}