{
    "id": "dp4nWm59esI",
    "title": "The Blind Smartphone Camera Test 2021!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2021-12-17T20:10:08Z",
    "video_url": "https://www.youtube.com/watch?v=dp4nWm59esI",
    "category": "Science & Technology",
    "tags": [
        "blind camera test",
        "blind smartphone camera test",
        "smartphone camera test",
        "MKBHD",
        "smartphone cameras",
        "iPhone 13 camera",
        "iPhone 13 Pro camera",
        "iPhone 13 camera vs",
        "iPhone camera vs",
        "iPhone 14 camera",
        "Pixel 6 camera",
        "Pixel 6 camera vs",
        "Pixel 6 vs",
        "iPhone 13 Pro vs",
        "Samsung camera",
        "Galaxy S22 camera",
        "Galaxy S21 Ultra camera",
        "Samsung camera vs",
        "Samsung vs iPhone camera",
        "iPhone vs Samsung camera"
    ],
    "views": 2270678,
    "likes": 113801,
    "comments_count": 5253,
    "description": "16 smartphones. You chose a winner. This is what you picked! Sponsor: The first 1,000 people to click the link can get a 1 month free trial of Skillshare:   Studio Channel BTS:   MKBHD Merch:   Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "https://skl.sh/marquesbrownlee12211",
        "https://youtu.be/jyKLrSeYsoE",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat electronic music) - Hey, what's up? MKBHD here. All right, so we're back at it again. Those of you who are new here since the last one, this is a bit of a social experiment. So if I were to ask you, \"Which camera is better? The iPhone 13 Pro or ASUS Zenfone 8?\" I think I have a hunch as to which one would probably win. We all know what smartphone cameras we think we like and don't like, but that's heavily influenced by confirmation bias. So if I show you a photo that you know is an iPhone versus some other random phone you don't like as much, then your eye will automatically be drawn to every little thing that's better about just the iPhone photo. But what if we do a comparison where we remove the labels and you don't know which one is the iPhone and which one is the alternate, or better yet, bring in 16 phones so you don't know what any of them are? Any of them could be your favorite phone. Any of them could be something you thought you loved or you thought you hated. You put them in a bracket-style format, blind voting, winner moves on to the next round, and we narrow it all the way down to the people's choice best camera. This is the Blind Smartphone Camera Test 2021. So that's exactly what we just did over on Instagram for the past week, brought together 16 phones that all came out in the last year and set them up, seated them in a bracket style. You can find the behind the scenes of us setting it all up on The Studio channel. If you're not already subscribed over there by the way, you're really missing out. What are you doing? That's all the behind the scenes and all the fun projects you could ever wish for and more. But then we took all of the photos, ran the side by sides, and got our winners, and the winner was, well, I'll get to that in a second. But how did we get there? Well, here's the bracket of all the letters that we started with and here's what every single one of those smartphones was at the beginning. Now, you might have already voted over on Instagram. Either way, I saved that story on my profile, so if you go over there, you can see the blind smartphone camera tests and you can see each one and what you voted for. But let's go over how one of those rounds actually went. So the first round was a relatively simple picture of me in the corner of the room but there's actually a lot to the frame, as you can imagine. So there's a subject in the middle but, also, the window behind me was a huge indicator of dynamic range. There's a blue mat with a painted Android, a gold helmet, a red Subscribe pillow, lots of details to go from here. So in the first round, the Samsung Galaxy S21 Ultra took down its little Ultra brother, the Axon 30 Ultra. Then the battle of the gaming phones, the ROG Phone 5 dominated the Legion gaming phone. The Sony Xperia PRO-I somewhat surprisingly defeated the Oppo Find X3 Pro and the OnePlus 9 Pro takes out the flagship Mi 11 Ultra. Then the Pixel 5a took out the Pixel 6 Pro in the Pixel-on-Pixel crime. Then iPhone gets its first-ever win in the history of this test for four years with a first-round win over the Moto Edge. Then the Zenfone 8 crushed the Poco X3 GT and the Realme GT squeaks out a win over the Surface Duo 2. So that is a lot, and we definitely had some interesting match ups set up in the first round just to kind of see how they would go. Some of these results did not surprise me at all, like the Galaxy S21 Ultra, I think everything about that photo was better than the ZTE. It was brighter, it was crisper, it had better dynamic range, everything about it. Not surprised it won. But some of them were not as clearcut. Like for the gaming phone battle, for example, you know, the ROG phone, I think it took a better photo than the Legion phone, especially with dynamic range. You can see that in the background in the window behind me. But it did have some serious over HDR-y looking issues that the Legion didn't have, especially with this sort of halo effect around my face. And in the battle of the Pixels, Pixel 6 versus Pixel 5a, I actually expected the slightly brighter Pixel 6 photo to win given all other things basically equal and also the slightly blurrier background versus the subject thanks to the bigger sensor. But the Pixel 5a with the slightly more balanced photo actually did get the win. Also, just a small note, you can see me smirking slightly in this one as the photo gets taken with the Surface Duo 2. Anyway, second round, the ROG phone pulls off an upset and beats the Galaxy S21 Ultra, the OnePlus 9 Pro pretty soundly beat the Sony Xperia PRO-I, the Pixel 5a ends the iPhones run by beating the 13 Pro, and the Realme GT I think pulls off the biggest surprise here by beating a perennial contender in the Zenfone 8. And really almost all of these were closer battles here than the first round mainly because this photo just doesn't have that much to it, right? It's flatter, has less depth, almost no dynamic range challenge other than maybe the candle, and so this one just came down to exposure and color. I noticed the warmer photos would make the candle and the cookie appear a bit more saturated, but honestly, in this round, it was pretty simple. Basically what we learned the first time did win the test again. In all cases the brighter photo won. So then in the semifinals, we had OnePlus 9 Pro squeak out a victory over the ROG Phone 5 and then the Google Pixel 5a handily beat the Realme GT, and this was a really interesting one. So you might have already known or noticed this but reds are notoriously the hardest color for these digital sensors to reproduce well for a variety of reasons, but that makes a lot of differences in things like skin tones and red threads and accents like this but also when the whole photo is on a red pool table. And so this was a case where how well you handled reds really mattered and actually, in both cases, the brighter photo actually lost because they were too bright, they overexposed. And so the photos that were a little more neutral, that had more reasonable looking reds, ended up winning. So then the finals came down to the OnePlus 9 Pro and the Pixel 5a. Raise your hand if that's what you had written down at the beginning as what your last two standing would be. Doubt it. So this one had several skin tones, a sky behind, some subjects in front of a distant background, and some album art vibes for sure, and the winner of the Blind Smartphone Camera Test in 2021 is J, the $399 Google Pixel 5a. It definitely won this last photo from having more contrast and bringing in more color from the sky. I don't actually think there's a clear answer to which photo is better per se. Like the OnePlus saturated skin tones more and had much more deep shadows while the Pixel was pretty crunchy but didn't really let any shadows get totally dark and it was much more HDR-y looking, especially with the faces. But at the end of the day, 75% of you picked the Pixel as your champion, the people's choice blind camera test winner. So what did we learn from this? Well, first of all, we've done this test four years in a row now running and it's been wild every time. This might be the last time we do it or maybe we might shake it up and do it in a different format next time, we'll see. But with these tests, we've picked up a couple things and so have some of the smartphone companies too. Number one being that all other things held equal, in a side-by-side test, people typically pick the brighter photo as the winner. Now, that doesn't mean it's necessarily the better photo. You know, it's just a reflection of the format of the test, which is when you put two images side by side, typically people are just drawn almost always to the brighter one. Then number two, sharpness. So while I love a crispy photo, it isn't necessarily ever a factor in determining which one of these photos wins, and most of that is because we do this test on social media where compression kind of erases any advantage you might have in that sharpness department. Now, a lot of people always comment every year, \"Oh, why don't you put these on Google Drives somewhere so we can download them and zoom in and pixel peep?\" But that's kind of not the point. The point is just a gut reaction of seeing a photo someone posted online somewhere on social media, which is where you typically see them, so that's where we posted it. And then my latest theory, the one I think is most interesting, number three, is that it turns out most people just want the most finished photo out of their smartphone cameras. So there's a lot of data out there about how people actually shoot photos on their smartphones and it turns out most of the time most people just take the camera out of their pocket, open the camera app, hit the shutter button, they don't even tap to focus, and then that image is the one that they're done with. They're gonna share it, they're gonna put it online, they're gonna text it to their friends. That unedited phone, done. But that being said, I always look for patterns in these sort of things any time there's numbers and to me the most interesting thing about this year's test was that I looked at prices of the phones that we used and it turns out the price of the phone had almost nothing to do with whether or not you guys voted for it as the better or worse camera. So in the first round, the more expensive phone won five but lost three. Then in the second round, the more expensive phone won zero times and lost all four. Then in the semis, it was an even split, won one and lost one, and in the finals, yes, the cheaper phone did actually win it all. This is one of the hardest videos to make every year consistently. It's obviously the seeding and the planning and shooting all the photos and getting it exactly right and then posting them, editing, tallying all the three-million-plus votes, organizing everything into our thoughts and really finding out what we've learned each year. But it's always a lot of fun. Fun fact, I wanted to include Twitter again in the voting alongside Instagram but this time the backend beta feature that was enabled on my account for those previous years, thanks, Twitter, was actually deleted. It doesn't even exist anymore. It was allowing me to post images and polls in a single tweet. So I just did everything on Instagram this year. But at the end of the day, my question to you is, which one would you now pick as your best smartphone camera now that you've seen all the results and all the photos from every one? If you're curious on how we make these, you might wanna check out The Studio channel, but also, you'll probably be interested in my Skillshare class on how to make MKBHD videos, whether it's the explainers or the product reviews or the impressions, all of that in one place. So Skillshare is an online learning community for creatives with thousands of inspiring classes to learn something you don't already know, things like photography or video editing or motion graphics. One of my favorite things ever is the senior motion graphics designer from YouTube channel Kurzgesagt made a Skillshare class on motion graphics. I took a motion graphics class in college. It wasn't nearly as good as this one. So I was pumped to go through that and I highly recommend it as well and now I watch the In a Nutshell videos with yet another newfound level of respect for the incredible videos this team makes. And Skillshare is curated specifically for learning, so there's no ads, and they're always launching new premium classes, so you can stay focused and follow your creativity wherever it takes you. So if you wanna check this stuff out, definitely head to the link below, and the first thousand of you that do that use my code will get one free month of a Skillshare Premium membership, which is absolutely worth it. So I'll see you guys over there. Thanks for watching. Catch you later. Peace. (upbeat electronic music)",
    "transcript_keywords": [
        "photo",
        "Pixel",
        "phone",
        "Blind Smartphone Camera",
        "ROG Phone",
        "Smartphone Camera Test",
        "Pro",
        "Smartphone Camera",
        "camera",
        "Test",
        "photos",
        "Camera Test",
        "Google Pixel",
        "round",
        "Ultra",
        "brighter photo",
        "smartphone",
        "win",
        "Blind Smartphone",
        "blind camera test"
    ],
    "transcript_entity_values": [
        "four years",
        "Pixel",
        "every year",
        "5",
        "the Blind Smartphone Camera Test",
        "three",
        "5a",
        "the Galaxy S21 Ultra",
        "399",
        "ASUS Zenfone 8",
        "year",
        "thousands",
        "the Surface Duo 2",
        "one",
        "four",
        "those previous years",
        "One",
        "thousand",
        "the end of the day",
        "ROG",
        "13",
        "8",
        "Sony",
        "Skillshare",
        "one free month",
        "Nutshell",
        "this year",
        "YouTube channel Kurzgesagt",
        "Ultra",
        "Twitter",
        "Android",
        "five",
        "Subscribe",
        "Legion",
        "four years in a row",
        "first",
        "2021",
        "Pixels",
        "iPhone",
        "zero",
        "the Moto Edge",
        "Mi 11 Ultra",
        "OnePlus",
        "Skillshare Premium",
        "OnePlus 9 Pro",
        "three-million-plus",
        "ZTE",
        "second",
        "Twitter",
        "the past week",
        "75%",
        "number two",
        "6",
        "Instagram",
        "16",
        "two",
        "GT",
        "Google Pixel",
        "the last year",
        "iPhones",
        "Realme",
        "30"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "NORP",
        "DATE",
        "ORG",
        "NORP",
        "PERSON",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "NORP",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.10098511725664139,
        0.04400714114308357,
        0.04915570467710495,
        -0.034308601170778275,
        0.11405519396066666,
        0.022187966853380203,
        0.06858745962381363,
        0.0540161170065403,
        0.05633452907204628,
        0.027358466759324074,
        0.047247689217329025,
        -0.07980980724096298,
        0.022745100781321526,
        -0.00805510114878416,
        0.004476142581552267,
        -0.05393526330590248,
        0.09600754827260971,
        -0.09346038848161697,
        -0.07422548532485962,
        0.016494521871209145,
        -0.03292277082800865,
        -0.022879036143422127,
        0.11330738663673401,
        0.005873599089682102,
        0.027518197894096375,
        -0.01758667454123497,
        -0.02858211286365986,
        -0.06330829113721848,
        -0.05993243306875229,
        -0.03745584189891815,
        0.016300112009048462,
        0.06578922271728516,
        0.014081433415412903,
        0.034834396094083786,
        0.004587559960782528,
        -0.14878587424755096,
        -0.017391836270689964,
        -0.012708012945950031,
        -0.0420842282474041,
        -0.023397671058773994,
        -0.07909037172794342,
        0.04059895873069763,
        0.00782272033393383,
        -0.004097496159374714,
        -0.004528133664280176,
        -0.02784353867173195,
        0.0975317507982254,
        0.0014678849838674068,
        -0.05289802327752113,
        -0.04756324365735054,
        -0.031657278537750244,
        -0.0010447879321873188,
        -0.024312660098075867,
        0.02693653292953968,
        -0.10006201267242432,
        0.029022274538874626,
        -0.092559814453125,
        0.02142573706805706,
        0.036193594336509705,
        0.06002958491444588,
        0.0048730093985795975,
        -0.00031470891553908587,
        -0.03102615848183632,
        0.056780435144901276,
        0.0064373621717095375,
        0.02050859108567238,
        -0.024237656965851784,
        -0.02502451092004776,
        0.040816087275743484,
        0.0052634128369390965,
        -0.018479404971003532,
        0.07882491499185562,
        0.04514199495315552,
        0.029313476756215096,
        0.004978832323104143,
        0.05620020627975464,
        -0.0007165037095546722,
        -0.04669732600450516,
        -0.06099958345293999,
        -0.03374670818448067,
        0.10740721225738525,
        -0.06961363554000854,
        -0.04355384409427643,
        -0.036186572164297104,
        0.05527767166495323,
        -0.06865538656711578,
        -0.02352055162191391,
        0.039794258773326874,
        -0.05644312873482704,
        -0.08550714701414108,
        -0.10089109092950821,
        0.06075618043541908,
        -0.04618515074253082,
        -0.05398337170481682,
        0.0479172021150589,
        0.06945980340242386,
        0.010805354453623295,
        -0.08022575080394745,
        -0.005514963064342737,
        0.03521611541509628,
        0.07388625293970108,
        0.014717817306518555,
        -0.032791443169116974,
        0.020674778148531914,
        0.0844428688287735,
        -0.02730737067759037,
        -0.02825702168047428,
        -0.06603074818849564,
        0.06266845762729645,
        0.062394168227910995,
        0.06236647441983223,
        0.022135602310299873,
        -0.012768218293786049,
        0.021253904327750206,
        0.01106327772140503,
        0.007637880742549896,
        -0.020255431532859802,
        0.07007813453674316,
        0.10225598514080048,
        0.008269079960882664,
        -0.0030966000631451607,
        -0.022696364670991898,
        -0.03300395980477333,
        -0.03264321759343147,
        -0.018927400931715965,
        0.03145909309387207,
        -0.07518862187862396,
        4.3361352759804375e-33,
        0.011993157677352428,
        0.06348524987697601,
        0.01586233638226986,
        0.009400460869073868,
        0.027393987402319908,
        -0.06165359169244766,
        0.013161077164113522,
        0.06002199277281761,
        -0.03750643506646156,
        0.01222721952944994,
        -0.003081490518525243,
        -0.06876777112483978,
        -0.04452420771121979,
        0.058043159544467926,
        0.08564209192991257,
        0.02535322867333889,
        -0.08623149991035461,
        -0.027538316324353218,
        -0.054721441119909286,
        0.00043867595377378166,
        -0.031557194888591766,
        -0.017997970804572105,
        0.013020455837249756,
        0.04713758826255798,
        0.05193331837654114,
        -0.07724512368440628,
        0.07644564658403397,
        -0.03045838698744774,
        0.010390885174274445,
        -0.015092223882675171,
        -0.12678731977939606,
        0.04726818576455116,
        0.016674621030688286,
        -0.05487297847867012,
        0.0017748597310855985,
        -0.015217779204249382,
        0.011981803923845291,
        -0.07638567686080933,
        -0.0020241898018866777,
        -0.06381404399871826,
        -0.07544974237680435,
        0.08456789702177048,
        -0.0670495554804802,
        -0.002450226340442896,
        0.06434900313615799,
        0.06295467913150787,
        -0.045168276876211166,
        0.027711141854524612,
        -0.03937473148107529,
        0.018096424639225006,
        -0.0032578622922301292,
        -0.016352931037545204,
        0.0034118422772735357,
        -0.04625929147005081,
        -0.03652751073241234,
        0.032382864505052567,
        0.03288915380835533,
        5.420123852672987e-05,
        -0.001361992908641696,
        -0.001712628174573183,
        0.033664170652627945,
        0.006386073771864176,
        -0.02907041274011135,
        0.02369369938969612,
        -0.0710834488272667,
        0.05567128583788872,
        0.012441961094737053,
        -0.013987811282277107,
        -0.0753890872001648,
        0.03340962529182434,
        -9.04601693036966e-05,
        -0.017597084864974022,
        -0.025361420586705208,
        -0.050315942615270615,
        0.06799545139074326,
        0.0709124207496643,
        -0.03778074309229851,
        -0.030238404870033264,
        0.012438026256859303,
        0.005496490281075239,
        0.00110679364297539,
        0.07898727059364319,
        -0.018964990973472595,
        0.037344422191381454,
        -0.0447055846452713,
        -0.03173864260315895,
        0.012255985289812088,
        -0.09359172731637955,
        -0.00017531511548440903,
        0.05891604349017143,
        -0.0008911230834200978,
        0.026274176314473152,
        -0.017751198261976242,
        0.02599336951971054,
        -0.037827834486961365,
        -4.231254731264196e-33,
        -0.03567865863442421,
        0.01773066073656082,
        0.02821948751807213,
        -0.035826511681079865,
        0.04820777848362923,
        -0.0989215299487114,
        0.11135680228471756,
        -0.0035044278483837843,
        0.06485779583454132,
        -0.026730138808488846,
        0.03561070188879967,
        -0.010292035527527332,
        -0.07730204612016678,
        0.05148695781826973,
        -0.04324112460017204,
        -0.02801746129989624,
        0.0038010997232049704,
        -0.1375236213207245,
        -0.007158173248171806,
        0.0695418044924736,
        0.047008708119392395,
        0.049863725900650024,
        -0.0017483391566202044,
        0.052480150014162064,
        -0.06871364265680313,
        0.0053286137990653515,
        0.01698671095073223,
        0.02674124576151371,
        0.01697990670800209,
        -0.09198896586894989,
        0.096387580037117,
        -0.0659494400024414,
        0.007002523634582758,
        -0.04980325698852539,
        0.07968004792928696,
        0.09255658835172653,
        0.011929246596992016,
        -0.08129538595676422,
        -0.023285897448658943,
        0.011687248013913631,
        0.03261418268084526,
        0.05970071628689766,
        0.014982989057898521,
        -0.03364665433764458,
        0.03245408460497856,
        -0.056802354753017426,
        -0.02656225860118866,
        0.03912084922194481,
        0.029748931527137756,
        0.04613927751779556,
        0.008059190586209297,
        0.030558835715055466,
        -0.05776724964380264,
        0.029843511059880257,
        -0.06128719821572304,
        -0.018998149782419205,
        0.01742328703403473,
        -0.03575283661484718,
        -0.00038811395643278956,
        0.06595329940319061,
        0.06781918555498123,
        0.03473640978336334,
        -0.09273698925971985,
        -0.02885310724377632,
        -0.11645893007516861,
        -0.00605351896956563,
        0.01142805628478527,
        0.04675694927573204,
        0.010177547112107277,
        0.06890380382537842,
        -0.0022095399908721447,
        0.0012076995335519314,
        -0.01986292377114296,
        -0.03554045781493187,
        0.090390145778656,
        0.10863745212554932,
        -0.010836846195161343,
        0.06243760883808136,
        -0.03740612417459488,
        -0.016724489629268646,
        -0.007297984324395657,
        0.010018766857683659,
        -0.0017783351941034198,
        0.04271748661994934,
        0.07719412446022034,
        0.11513924598693848,
        0.046015143394470215,
        -0.11519107967615128,
        -0.013792228884994984,
        0.04933299869298935,
        0.019458655267953873,
        -0.046066343784332275,
        -0.061048250645399094,
        0.01912834495306015,
        -0.013822575099766254,
        -5.514549883400832e-08,
        0.033797189593315125,
        -0.046057771891355515,
        0.03312816843390465,
        -0.015423252247273922,
        -0.016236478462815285,
        -0.10004179924726486,
        -0.041443247348070145,
        -0.016133949160575867,
        0.023969944566488266,
        -0.05617423355579376,
        0.009211601689457893,
        -0.0721757784485817,
        -0.05273713916540146,
        0.09985377639532089,
        -0.0025480827316641808,
        0.05350523442029953,
        -0.027597878128290176,
        0.031764522194862366,
        -0.00036146494676359,
        0.0287870354950428,
        0.042660705745220184,
        0.06707758456468582,
        -0.025892311707139015,
        -0.0453309528529644,
        0.02989056147634983,
        -0.008435741998255253,
        -0.07660937309265137,
        -0.057404838502407074,
        0.04838843271136284,
        -0.020040642470121384,
        0.04418529197573662,
        -0.006893038284033537,
        -0.012358640320599079,
        0.04824468493461609,
        0.053050123155117035,
        -0.0792241021990776,
        -0.0008635966223664582,
        -0.046255987137556076,
        0.048783037811517715,
        0.050116125494241714,
        -0.032284002751111984,
        -0.02874111756682396,
        0.028407210484147072,
        0.023164747282862663,
        -0.022132351994514465,
        -0.06618380546569824,
        0.07499714195728302,
        -0.11722949147224426,
        -0.024414055049419403,
        0.03396115452051163,
        -0.11096246540546417,
        -0.10870107263326645,
        0.046363674104213715,
        0.023240650072693825,
        0.0958385169506073,
        -0.05553257092833519,
        0.0940563902258873,
        0.008239148184657097,
        -0.07268582284450531,
        0.04994964599609375,
        0.10395915061235428,
        -0.03616343438625336,
        -0.07068071514368057,
        0.0823441743850708
    ]
}