{
    "id": "DvwnuFhvlYA",
    "title": "Oppo Find X: Why You Probably Shouldn't Buy It (Yet)",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-07-31T23:22:47Z",
    "video_url": "https://www.youtube.com/watch?v=DvwnuFhvlYA",
    "category": "Science & Technology",
    "tags": [
        "oppo find x review",
        "oppo find x",
        "oppo find x unboxing",
        "oppo find x camera",
        "oppo find x software",
        "coloros",
        "mrmobile",
        "michael fisher",
        "android central"
    ],
    "views": 442422,
    "likes": 10248,
    "comments_count": 890,
    "description": "Brought to you by Bombfell. Get $25 off your first order now, at      The Oppo Find X is a smartphone you probably shouldn't buy yet  but not for the reasons you think. Yes, it's a more fragile phone than the competition, with a motorized camera module that seems fated to fail someday. To quote the great Montgomery Scott, \"The more they overtake the plumbing, the easier it is to stop up the drain.\"   But to me, carrying a phone as beautiful and unique as the Oppo Find X is worth the durability tradeoff. After all, not every device is meant to hold up to the rigors of carelessness, and you've got to expect some compromises in a device made to stand out in 2018. However well-founded they may be, those durability concerns obscure what I think is the more pressing problem with the Oppo Find X: ColorOS. Oppo's custom Android interface insists upon itself so aggressively that it actively prevents the user from installing a custom launcher. To be clear, I didn't expect a cakewalk when trying to adapt an overseas smartphone for North American use  but this is the first Android phone in memory that actively prevents the user from enjoying one of the key benefits of Android: the ability to customize the interface to suit their needs. Oppo tells me a software update is due to fix some of the bugs complained of in the above video ... but until this launcher lockdown policy is lifted, I won't be dropping this phone in my pocket. Join me for additional impressions after five days with the Oppo Find X!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S OPPO FIND X PREVIEW]  MrMobile's Oppo Find X Preview was produced following five days with an Oppo Find X review device (model PAFM00) purchased by Mobile Nations. The device was tested on Project Fi (T-Mobile US) in Greater Boston, MA, USA.    [PRODUCTS IN THIS VIDEO]:  Oppo Find X 128GB PAFM00 [Amazon]:    [LINKS]  Oppo Find X Bend Test Fail!! [JerryRigEverything]:    [MUSIC]  \"You Know U Iz\" by GG Riggs, available at Premium Beat:   True Persistence by Cymatix, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:    #oppofindx #findx #oppo #smartphone #technology",
    "description_links": [
        "http://bombfell.com/mrmobile",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/4sd",
        "https://www.youtube.com/watch?v=oGGe3Z6XmCg",
        "https://www.premiumbeat.com/royalty-free-tracks/you-know-u-iz",
        "https://www.premiumbeat.com/royalty-free-tracks/true-persistence",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Mr. Mobile] I'm just gonna say it. The Oppo Find X is the most interesting smartphone of 2018. Instead of blending in with everyone else, it negates the need for a notch in its display by placing all of its camera in a peek-a-boo module that pops up from the top of the phone. It's this peculiarity that has a lot of folks hesitating at the checkout button, but that's not what they should be worried about. I'm Mr. Mobile, and I've spent five days with this phone. Let me tell you why I'm not gonna make it six. (upbeat, cool music) Okay, it is impossible to discuss the Find X without talking about how it failed my friend Zach's durability testing over at JerryRigEverything, and Zach brings up some great points. This phone is necessarily more fragile than it's monoblock competitors. It's easier to break in half if you sit on it, or you know, try to break it in half. Further, I can confirm that it's not water or more importantly, dust proof. Yeah, stuff gets in there, and the introduction of moving parts does make it more likely to fail over time. But here's why I don't care about that stuff, you don't buy the Find X if you're looking for just another phone, folks. You buy it so you can have something special. This thing isn't something you'd expect to survive the job site. It's a work of art, it blends the curved lines of Samsung with the layered colors of Honor and the face scanner of an iPhone. There's a reason I had to pay nearly a thousand bucks on eBay just to get a hold of one. I agree that every mainstream phone should be able to be stuck in a back pocket and sat on, but it's pretty obvious that Oppo wasn't trying to cater to the mainstream here. As for the argument that more moving parts equals a higher failure rate, okay, but I've been around long enough to see this argument play out before. Back around 2004, the US market was switching from candy bar style phones like this to flip phones like this, and everyone was saying, \"OMG, moving parts, they're all gonna break!\" Well, I was in wireless retail at the time, and sure, some clamshell phones did indeed break in half. But I saw many, many, many more of them coming back intact years later as trade in devices on upgrade deals, and let's be real, it's not like you need a hinge or moving parts to break a modern smartphone either. Now, you might say, \"Sure, Mr. Mobile, \"but the Find X camera module using a motor. \"Motors can fail!\" Again, you're not wrong, but as some of you know, I work on another YouTube channel featuring scale models, and do you know what every single one of those scale models has in common? Electric motors, and despite operating constantly in sea water, they don't fail nearly as often as some other components on those boats. Turns out humans are pretty good at building motors in 2018. Just think about the tiny one driving the optical stabilization unit, or the haptic vibrators in the phone you might be watching this video on. All that's a long way of saying the durability thing is not a deal breaker for me. Matter fact, in one weird way, it's more durable than most. I can put this phone down on a table and not worry that a random grain of sand is scratching my camera lens 'cause the cameras are always protected unless you're using 'em. When you do use the cameras, they're pretty good. Beside from some occasional auto-focus issues, I was pleased with the primary and selfie shooters. Though, I will need a longer review period to really put it through its paces. Please subscribe to TheMrMobile on YouTube so you don't miss those follow ups, and the phone has some other fantastic high points. That humongous, beautiful, curved display. The two day battery life, the jam packed spec sheet. If it weren't for one huge failing, this phone would already be a contender for one of my two daily carries. (upbeat, entrancing music) That failing, and stop me if you've heard this before, is the software. See, the Oppo Find X isn't currently planned for US release, so would be American owners need to deal with software made for the China market. And that software is, in a word, terrible, why? Well, just pick one of these. (upbeat, entrancing music) Now, bugs in markets specific feature failings are one thing, okay, but the Oppo Find X makes a nearly unforgivable faux pas that I mean, if we weren't talking about something as frivolous as smartphones, I'd almost say it offends me. See, the main reason I carry Android phones instead of iPhones is because Android lets me do what I want. If I don't like the way a particular phone's software works, I can install another launcher to suit my taste. Now, I have used phones that do everything they can to talk me out of using my own launcher. Lookin' at you, Huawei. But after all their warnings and complaints, they eventually do let me use it. I had never used a phone that straight up disables the ability to use a custom launcher until today. The Find X does just that. Oppo tells me it's working to fix some of the bugs I mentioned before, and it's also promised me an European review device when those are available so I can give it a proper review. I'm looking forward to that, but I'll say right now, that if that phones keeps users locked into the color OS launcher, there's just no way I can recommend it, not without a good explanation. I have asked Oppo for just such an explanation, and if the company provides one, I will definitely drop it in the comments below. My preliminary conclusions, after a quick word from the company that made today's video possible. Look, I've got nothing against shopping at the mall, but it's an awful lot of work. Plus, I don't always trust my own eye when it comes to fashion. I look good. So I'm happy today's sponsor is Bombfell. Bombfell sends curated clothing right to your door, and not just any clothing. This is nice. Every piece is hand picked by your own personal stylist, and you keep total control. When my stylist, also named Michael, put together an order that I wanted to tweak, all it took was an e-mail within the first 48 hours to get an order that really resonated with me. As you might know, I'm kind of a vest guy, and I think I've found a new favorite with this one. You've got seven days to tell Bombfell what you'd like to keep from your order, and you send the rest back. But the more you keep, the more you save. Bombfell never charges above retail price, folks, but you still deserve a discount for helping support Mr. Mobile. You can get $25 off your first purchase right now by going to Bombfell.com/MrMobile. That's B-O-M-B-F-E-L-L.com/M-R-M-O-B-I-L-E. And thanks. (upbeat, entrancing music) For all the ways the Find X doesn't work for me, I'm really glad it exists. I mean, people like me are always calling for more innovation in mobile technology. Well, okay, here's a smartphone that hides its cameras inside a periscope so it can squeeze more display onto the face plate, and it's beautiful and feature packed to boot. That's innovation, that's boldness, and I respect it. On a hardware level, the Find X has all the markings of a truly great smartphone. I just hope that by the time it comes to Europe, Oppo will have awoken to the wisdom of offering that greatness to users without consigning them to decidedly not great software. (upbeat, entrancing music) Folks, we're kicking off the fall smartphone season with a bang, and we're barely into August. More fun stuff on the way from Motorola, Samsung, and others in the weeks ahead so at the risk of repeating myself, please hit that subscribe button and let me know what you're most looking forward to in the latter half of 2018. Until next time, thanks for watching and stay mobile, my friends. (upbeat, entrancing music)",
    "transcript_keywords": [
        "Oppo Find",
        "Find",
        "phone",
        "Oppo",
        "phones",
        "moving parts",
        "Mobile",
        "break",
        "smartphone",
        "software",
        "Bombfell",
        "moving",
        "parts",
        "half",
        "phone software works",
        "back",
        "work",
        "good",
        "folks",
        "time"
    ],
    "transcript_entity_values": [
        "Europe",
        "eBay",
        "Huawei",
        "seven days",
        "25",
        "the latter half of 2018",
        "half",
        "five days",
        "Samsung",
        "two day",
        "American",
        "2018",
        "YouTube",
        "European",
        "the weeks ahead",
        "China",
        "Oppo",
        "nearly a thousand bucks",
        "Mobile",
        "Motorola",
        "Bombfell",
        "today",
        "US",
        "daily",
        "iPhone",
        "first",
        "around 2004",
        "Zach",
        "Michael",
        "two",
        "Oppo",
        "August",
        "Bombfell",
        "years later",
        "six",
        "iPhones",
        "the fall smartphone season",
        "one",
        "Android",
        "the first 48 hours"
    ],
    "transcript_entity_types": [
        "LOC",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "NORP",
        "DATE",
        "ORG",
        "NORP",
        "DATE",
        "GPE",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "TIME"
    ],
    "vector": [
        -0.1137540340423584,
        0.0451095886528492,
        0.11095541715621948,
        -0.026956938207149506,
        0.015208824537694454,
        -0.07342416793107986,
        0.06101294979453087,
        0.14376559853553772,
        0.008595305494964123,
        0.02657201699912548,
        0.05100947991013527,
        0.048327915370464325,
        0.04522234573960304,
        0.028824886307120323,
        0.00788669753819704,
        0.01581190712749958,
        0.10388048738241196,
        -0.05780995637178421,
        0.02392389252781868,
        0.04483781382441521,
        -0.02841178886592388,
        -0.04671459645032883,
        0.04943285137414932,
        -0.07593165338039398,
        -0.03688112273812294,
        0.05469554290175438,
        -0.017006928101181984,
        -0.06341128051280975,
        0.0008472865447402,
        -0.01750420406460762,
        -0.006289918906986713,
        0.07155979424715042,
        0.05807751044631004,
        -0.02775668539106846,
        -0.023012856021523476,
        -0.10255704075098038,
        0.028938613831996918,
        -0.048504624515771866,
        -0.07369036227464676,
        -0.03489537164568901,
        -0.023046579211950302,
        -0.012149661779403687,
        0.004579188302159309,
        0.009191942401230335,
        0.06347572058439255,
        -0.06022149324417114,
        0.10191500931978226,
        -0.036883097141981125,
        0.002445777878165245,
        -0.08339788019657135,
        -0.007859433069825172,
        -0.07198771834373474,
        0.03413248807191849,
        -0.0018240720964968204,
        -0.059104692190885544,
        0.03556212782859802,
        -0.02825080044567585,
        -0.017429862171411514,
        0.013414489105343819,
        -0.0006839035777375102,
        -0.004327769856899977,
        0.03252128139138222,
        -0.02269771695137024,
        0.05103696510195732,
        0.04823266342282295,
        0.020337438210844994,
        0.038739532232284546,
        -0.08856012672185898,
        0.040056947618722916,
        0.03658492490649223,
        -0.01960458979010582,
        0.06861431896686554,
        0.08694084733724594,
        0.013782466761767864,
        -0.031384192407131195,
        0.08700316399335861,
        0.12098370492458344,
        -0.02523113787174225,
        -0.06304702162742615,
        -0.04476487636566162,
        0.046945974230766296,
        -0.01413253229111433,
        -0.061146482825279236,
        0.001376283005811274,
        0.06701702624559402,
        0.004972079303115606,
        -0.04690839722752571,
        0.020494434982538223,
        -0.022643666714429855,
        -0.017406124621629715,
        -0.04015504941344261,
        0.11357802897691727,
        -0.04109133780002594,
        -0.08181975781917572,
        0.02394297532737255,
        0.0003411042271181941,
        -0.004989821929484606,
        -0.041422244161367416,
        -0.06138743460178375,
        0.010908198542892933,
        0.04248287156224251,
        0.050175853073596954,
        0.035588592290878296,
        0.015702292323112488,
        -0.036536652594804764,
        -0.06303331255912781,
        -0.04470780864357948,
        -0.013913835398852825,
        0.0011526367161422968,
        0.03629670292139053,
        -0.010483437217772007,
        -0.09502192586660385,
        0.02558988146483898,
        0.003712998703122139,
        -0.015633028000593185,
        0.028821753337979317,
        -0.05950687825679779,
        0.04655572026968002,
        0.04670059308409691,
        0.0052836574614048,
        -0.01771417260169983,
        -0.1142992228269577,
        -0.1249452456831932,
        -0.06286963820457458,
        0.04615234211087227,
        -0.014149567112326622,
        -0.01776222325861454,
        2.770043437834097e-33,
        0.003058088943362236,
        0.10275503247976303,
        -0.03059850074350834,
        -0.0027954059187322855,
        -0.04569953680038452,
        0.013119078241288662,
        0.05990510433912277,
        0.0018309608567506075,
        -0.08784545212984085,
        0.02340034767985344,
        -0.017942344769835472,
        0.0066186003386974335,
        -0.1134791299700737,
        0.04888126254081726,
        0.1152740940451622,
        0.000414482579799369,
        -0.02330106869339943,
        0.020804205909371376,
        -0.04669314622879028,
        0.01025476772338152,
        0.020252639427781105,
        -0.10787046700716019,
        -0.042515143752098083,
        -0.05707748979330063,
        0.059633299708366394,
        0.06423691660165787,
        0.03982822224497795,
        -0.0434957854449749,
        -0.03453380987048149,
        0.022993439808487892,
        -0.12653543055057526,
        0.06552906334400177,
        0.025449000298976898,
        0.10158568620681763,
        -0.038846444338560104,
        -0.0029361601918935776,
        -0.0639515221118927,
        -0.12165860086679459,
        0.034810710698366165,
        -0.054891426116228104,
        -0.11950123310089111,
        0.0805065855383873,
        -0.05418765917420387,
        0.032643888145685196,
        0.07922622561454773,
        -0.01060578040778637,
        0.02655806392431259,
        -0.032046325504779816,
        -0.0248043742030859,
        0.008135381154716015,
        -0.033341437578201294,
        0.028981802985072136,
        -0.027892274782061577,
        -0.027762196958065033,
        0.009963742457330227,
        -0.028038188815116882,
        -0.038180865347385406,
        -0.005258804652839899,
        0.07562380284070969,
        0.03469112142920494,
        0.043063465505838394,
        0.04226372763514519,
        -0.09067196398973465,
        0.05130784586071968,
        -0.08565568178892136,
        0.11047843843698502,
        0.0026921320240944624,
        -0.07319547981023788,
        -0.005277047865092754,
        0.09155984967947006,
        0.05197151377797127,
        -0.07122814655303955,
        0.009681462310254574,
        -0.07272738963365555,
        0.11162085086107254,
        0.021202202886343002,
        0.03680921718478203,
        -0.02478952705860138,
        0.01943100057542324,
        -0.04004504159092903,
        -0.005014637019485235,
        -0.04764416813850403,
        -0.0035714316181838512,
        0.08228390663862228,
        0.026099223643541336,
        0.03809824958443642,
        0.07022623717784882,
        -0.05727166309952736,
        -0.036525972187519073,
        0.055671073496341705,
        0.026556510478258133,
        -0.04428686201572418,
        -0.09927793592214584,
        -0.02441983111202717,
        -0.007153023034334183,
        -2.5752237999555268e-33,
        -0.014667290262877941,
        -0.03982909768819809,
        -0.017463652417063713,
        -0.04574011638760567,
        -0.02570118010044098,
        -0.09209413826465607,
        0.007953757420182228,
        -0.012895986437797546,
        0.07545197010040283,
        -0.03862754628062248,
        -0.07523107528686523,
        0.07705522328615189,
        0.03980021923780441,
        0.014226843602955341,
        -0.01363375037908554,
        0.027803288772702217,
        0.02005709521472454,
        -0.08969468623399734,
        -0.008122344501316547,
        -0.03309914842247963,
        -0.012584849260747433,
        0.08861105144023895,
        0.017901090905070305,
        0.0684412345290184,
        -0.05786890536546707,
        0.01895914040505886,
        -0.01839546114206314,
        -0.033479828387498856,
        -0.01251090969890356,
        -0.07825981080532074,
        -0.0884619876742363,
        -0.005968636833131313,
        0.04804579168558121,
        -0.030977582558989525,
        0.08621298521757126,
        0.05236102640628815,
        0.0015101743629202247,
        0.013888176530599594,
        0.001691078650765121,
        0.040730591863393784,
        -0.01919981837272644,
        -0.015082609839737415,
        0.048075806349515915,
        -0.05002801492810249,
        0.033347927033901215,
        -0.036238618195056915,
        -0.010105922818183899,
        0.050799548625946045,
        0.05053334683179855,
        0.025139015167951584,
        0.05266709625720978,
        0.0885043665766716,
        -0.028865689411759377,
        0.0025135192554444075,
        0.010490259155631065,
        -0.030428271740674973,
        0.0034035472199320793,
        -0.03298265114426613,
        -0.06046423316001892,
        0.04247218742966652,
        0.08526111394166946,
        0.03642401471734047,
        -0.020052092149853706,
        0.05610969290137291,
        -0.03411433473229408,
        -0.03886450082063675,
        0.09165532141923904,
        -0.012747966684401035,
        -0.03350985422730446,
        0.01787523180246353,
        -0.04549170285463333,
        -0.04485807567834854,
        -0.01769084297120571,
        -0.056362804025411606,
        0.03999750688672066,
        0.05833956226706505,
        -0.06430885940790176,
        0.0009504677727818489,
        -0.024975748732686043,
        0.012592360377311707,
        0.0008540159906260669,
        0.04848790168762207,
        0.10549923032522202,
        -0.011277894489467144,
        0.02706608735024929,
        0.046096689999103546,
        -0.030727364122867584,
        0.012138975784182549,
        -0.03241308405995369,
        0.020150866359472275,
        -0.013216699473559856,
        0.014562377706170082,
        -0.07804841548204422,
        0.049020927399396896,
        0.027579564601182938,
        -5.6385879076970014e-08,
        0.02507188729941845,
        0.01944906637072563,
        0.08825875073671341,
        -0.010632210411131382,
        0.0474022701382637,
        -0.03719787299633026,
        -0.0008733339491300285,
        -0.007145208306610584,
        0.09121296554803848,
        0.06237040087580681,
        0.021759895607829094,
        -0.09762734919786453,
        -0.00020535026851575822,
        0.04515620693564415,
        -0.03305971622467041,
        0.12471825629472733,
        0.029976092278957367,
        -0.030514264479279518,
        -0.05905427038669586,
        0.0369872972369194,
        -0.019490374252200127,
        0.015095598995685577,
        -0.019003000110387802,
        -0.029736628755927086,
        0.00018820547848008573,
        -0.029489262029528618,
        -0.06983138620853424,
        -0.06527560949325562,
        0.08222140371799469,
        0.03815064579248428,
        -0.010780825279653072,
        -0.01191273145377636,
        0.05861770734190941,
        0.0604228638112545,
        -0.011016984470188618,
        -0.055526718497276306,
        -0.0308341346681118,
        -0.003405781928449869,
        -0.024565337225794792,
        -0.034455329179763794,
        0.022368112578988075,
        -0.034882090985774994,
        0.045813191682100296,
        0.0598418265581131,
        -0.015710683539509773,
        0.008209734223783016,
        0.021170418709516525,
        -0.11374520510435104,
        -0.07350094616413116,
        0.04983653873205185,
        -0.0368487685918808,
        -0.0035083710681647062,
        -0.05190269276499748,
        -0.010677570477128029,
        0.06615695357322693,
        -0.041597120463848114,
        0.0621270053088665,
        -0.0031211755704134703,
        -0.00042033611680381,
        0.02836848795413971,
        0.017483694478869438,
        -0.09436934441328049,
        0.0270492285490036,
        0.0621611513197422
    ]
}