{
    "id": "dx-gJeB-WCQ",
    "title": "NEW Sony Vlogging Camera ZV-1F  Unboxing and review",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-10-13T14:06:15Z",
    "video_url": "https://www.youtube.com/watch?v=dx-gJeB-WCQ",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 197871,
    "likes": 6069,
    "comments_count": 297,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine. Today I have a brand new Sony vlogging camera, that I was gonna unbox. But I already unboxed it, so here it is. This is the new ZV vlogging camera. Sony has been my go-to for all of my cameras. Pretty much everything that I use in my studio is all Sony. And when I used to do my daily vlogging, I would always vlog on one of the little tiny Sony vlogging cameras. This has a one inch sensor and that's way more than the average smartphone. So obviously if you are comparing phone to camera, you'll be able to get much better stills, much better low light. And with this ultra wide lens, it's fixed at a 20 millimeter wide angle lens. That for me is the ideal angle for vlogging. Audio is also something that is really important when you're making videos. And this has a built in directional microphone. It also comes with this wind screen, so that'll help you reduce wind when you're outside. And it even has a mic jack, if you want to add an external mic. It has built in image stabilization and the display is also touchscreen. So you're able to operate it directly from the LCD. You can also plug this into your camera to use it for live streaming or as a webcam. Another feature that I love that this has, is background de-focus. So this lets you get that beautiful bokeh, with just the press of a button. Product showcase is an awesome setting, especially someone who is always unboxing and showing products. When you turn on this mode, it'll quickly focus on the subject that you're showing. It has face priority auto exposure. I love this, because it'll keep your subjects face in constant brightness. Even if you're recording in various lighting conditions. It has a self-timer countdown for video recording. I love this, because sometimes I need to set myself up, get in the shot and make sure I'm actually in frame. It has a slow-mo function and a hyper-lapse function. So this will allow you to shoot super smooth speeds, at 5x slower or up to 60x faster. It also has a soft skin function, so when you turn this on, it'll help adjust your skin smoothness. So here's the camera. I kind of just wanted to give you a quick little overview. I just wanted to show it to you, because I used to be a daily blogger. I would log my entire life all the time and it was a lot. And now even for me, when I travel, I just like taking my phone. I don't really like to bring a lot of other items. But there are some advantages that this does give to you, over a phone. This is the little battery, which is similar to the RX100, and some of their previous vlogging cameras. It also has a mic input, so you'll be able to input a 3.5 millimeter microphone into that. It also has an HDMI port, and I think that you really like about this is, you can plug this in and use it as a webcam. So if you are a live streamer or you just wanna use this as a webcam to do conference calls or classes. Another thing that I like is product showcase. Now let me just give you a little demo of product showcase. So here it is. Everything is all turned on. Okay, I'm just gonna hit record so we can give this demo. Like, it'll focus so fast on the item. (dropping sound) Oops, I like that it has the flip screen like this. So here we go, okay. Hi, it's Justine here. I'm talking about this new camera and I'm gonna show you this item. Look at that. Focus on me, focus on item, focus on me, focus on item. This looks great. I'm so excited about this. (Justine gasps) So let's see what our zoom is like. Let's do all the way in. So this gives us a 1.5x zoom. Let's test out the audio. So right now I'm using my Lav microphone and now we're going to (snapping fingers), switch to the microphone on the camera. And a lot of people sometimes get a little confused. They're like, \"Why does this have a tuft of hair?\" Like, this actually, (Justine giggling), its so long on this one. Now here's the audio on the ZV-1 F. What does it sound like? I can just press right here and do zoom. Like, it can automatically zoom in like super fast. I like that. So I can go directly from the wide to the 1 to the 1.5. It was doing an eye auto focus, but I'm trying to show you in this top camera. Okay, look, look at that. We've got the eye auto focus, which is something that I think is very important, when you're filming. I love the eye auto focus, because this makes sure that your eyes are in focus and I feel like when you're filming, that is something that you really want to capture and make sure is in focus. I guess I'm looking at this 'cause it looks like a person. (Justine laughing) It's also has some creative looks, if you choose to add those on. I usually just do the standard 'cause I like to add my own looks when I'm editing in post. Oh my gosh, my battery's dead. I need to charge it. Another thing that I really like, is you can actually get an ND filter to put on top of this lens. And if you've never used an ND filter, you don't know what that is. Just picture yourself going out on a bright day. And when you put sunglasses on everything looks much clearer. You're able to actually see, that's basically what you're doing to your camera. You're putting a little sunglass on top of your camera lens and that gives the camera the ability, to get much clearer, crisper images, in that bright, harsh light. So that's something that I really love. My sister actually got a demo, so she has a video of this on her channel. So I'll put a link in the description if you wanna see hers. She actually shot an episode with this camera on her Sony show called, The Lowdown. Which is a really fun show. Her and Sydney both host it and it's so awesome. So I'm super excited to see that episode when it comes out. I'll put a link in the description to that show as well, if you wanna see it. Now, why I think this camera is so special, is the fact that it has a 20 millimeter focal length. Which is when you're holding this up, that's enough focal length, to actually get yourself in the frame. And that is something that I have always struggled with, because a lot of the cameras that I have, they're usually like bigger lenses. And you are able to actually get your full face in frame. When I'm watching a video or when I'm filming, like, I want to see the full person in frame. So right now I'm actually heading to San Diego, so I'm gonna take this and test it out, and get some shots for you guys. So you can see some of the video quality, see some of the picture quality. And I really do think that this is something that is super exciting especially for newer creators. If you've never had a camera before, this could be a good first step into that world. (upbeat music) Do you remember how in my video I said I was going to San Diego? Well I went to San Diego but I didn't film anything. (Justine giggling) Now I'm in Maryland. I don't know, I am so tired right now. Like, I don't know if you can see it on my face. I feel like an absolute train wreck. I took an overnight flight, I was filming all day yesterday. Didn't sleep on the overnight flight and now I'm here with my family. So, I'm gonna vlog a little bit of this trip using the new Sony Z. I keep, I'm so sorry, Sony. Like, I keep calling it the wrong thing. (Justine laughing) The ZV-1F. The thing that I like so much about it so far is the audio. It's very clear. I know I was making fun of the little wind wig that was on top of it, but it's working quite well. I also like that this is the 20 millimeter focal length, so I'm all in the frame. Like this is the perfect vlogging frame. Sometimes a little bit wider than this is almost too wide. This is pretty much perfect. So let's go enjoy the park. Show you guys Brin, that's our niece. She has grown up quite a lot probably, since the last time you've seen her, since I don't really vlog anymore. She is such a little rascal. (mischievous music) - Hey Brin, say hi to my camera. - Hi! - You're cute. Did you know that? - [Woman In Black Top] What is it? - A row! - [Justine] A row? - [Brin's Mom] Whoa! - [Woman With Black Top] Row! (woman laughing) - [Justine] Wow, Nice throw! - [Brin's Mom] Whoa! (upbeat classical music intensifies) (water splashing) (Brin mumbling) - [Justine] What are you eating? - Cheerios! - [Justine] Cheerios! Those, it look real good? You look like your mom when you do that face. There you go, that's your mom. When I said you look like mommy. No, not that one. There was another one, it was the mad face. It was like, that one there! That's Bree! That's a Bree face. (Bree giggling) - That's your mommy's face. There it is! (upbeat music) I've been having so much fun testing this out, 'cause I'm so used to making videos with large cameras and they're so heavy. So being able to just have this, it's super light and I just don't even feel like I'm holding anything. Basically feels like I'm holding my phone. I'm getting a B-roll shot here, of what it looks like to hold it. I'm walking so slow that my watch has asked me, if I want to end my workout. I don't. (upbeat music continues) Another cool thing about this camera, is it actually comes in a white version. Look at this. (Justine gasps) It's so pretty. So this is one that Jenna has. My sister actually did a review of this as well. I'll put a link in the description if you wanna check it out. But this one looks so awesome. What do you think, Brin? Which one do you like better? Do you like this black one or do you like the white one? - Whoa, black one and the white one! - Oh, you like both of 'em? Well, you heard it here first. She likes both of them. Anyway, I'm super excited about this camera and I'm excited to see what some other fellow content creators, create with it. It's a little windy. Is there any wind? Is there any wind blowing? Mm-hmm? Mm-hmm? She's stuck. Are you stuck? - No! - [Justine] No? - Monnie can't come in. - [Justine] He can. He's allowed out. Let him out. - [Brin] He can't! let him out. I'm gonna go back inside. It's cold out here. Come on. Go inside is cold. Okay, well that's it. My video's over. I'll see you guys in the next one. (Brin and Justine laughing) (Brin laughing) - [Brin] Can I do that! - [Justine] I think I might need to give it a little haircut. Just like a small trim. Maybe. (upbeat music)",
    "transcript_keywords": [
        "camera",
        "Sony vlogging camera",
        "Sony",
        "focus",
        "Sony vlogging",
        "vlogging",
        "vlogging camera",
        "cameras",
        "face",
        "San Diego",
        "show",
        "video",
        "tiny Sony vlogging",
        "frame",
        "super",
        "give",
        "auto focus",
        "eye auto focus",
        "love",
        "Sony show"
    ],
    "transcript_entity_values": [
        "all day",
        "Bree",
        "one",
        "Justine] Wow",
        "the next one",
        "Lowdown",
        "Justine",
        "Audio",
        "Sony",
        "5x",
        "20 millimeter",
        "LCD",
        "Maryland",
        "daily",
        "ND",
        "a bright day",
        "1.5",
        "1.5x",
        "Monnie",
        "3.5 millimeter",
        "Nice",
        "RX100",
        "first",
        "Brin",
        "Sydney",
        "ZV",
        "San Diego",
        "1",
        "Jenna",
        "yesterday",
        "up to 60x"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "GPE",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "GPE",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.014849205501377583,
        -0.07125815004110336,
        -0.0564587228000164,
        -0.10692756623029709,
        0.052292659878730774,
        0.032222479581832886,
        0.04413989558815956,
        0.01142183504998684,
        -0.04541653022170067,
        0.08796301484107971,
        0.011608827859163284,
        0.005175366066396236,
        -0.012508413754403591,
        0.021380074322223663,
        -0.013172653503715992,
        0.019859420135617256,
        0.011323624290525913,
        -0.032522134482860565,
        -0.009591786190867424,
        0.05284054949879646,
        -0.022022726014256477,
        -0.029741723090410233,
        0.04262511804699898,
        -0.004308478441089392,
        0.001448785769753158,
        0.049792446196079254,
        -0.02149544470012188,
        0.047773294150829315,
        -0.08053973317146301,
        -0.07316037267446518,
        -0.031819019466638565,
        0.031098030507564545,
        0.1041945144534111,
        0.024764619767665863,
        0.02161683700978756,
        -0.057944975793361664,
        0.040403854101896286,
        0.014969123527407646,
        -0.057241041213274,
        0.005194789730012417,
        -0.0026600309647619724,
        -0.016873212531208992,
        8.908320160117e-05,
        -0.043168142437934875,
        -0.07312337309122086,
        -0.02900703065097332,
        -0.00033176771830767393,
        -0.07486246526241302,
        0.037339769303798676,
        0.053099874407052994,
        -0.065823495388031,
        -0.012822439894080162,
        0.047804925590753555,
        0.03944001346826553,
        -0.08157315105199814,
        0.013085827231407166,
        -0.09890221059322357,
        -0.0019272571662440896,
        0.00792882964015007,
        -0.101599782705307,
        0.0067490218207240105,
        -0.01399179920554161,
        -0.005015800707042217,
        0.03382481262087822,
        -0.04080478101968765,
        -0.03441103920340538,
        0.017960062250494957,
        0.008983168751001358,
        -0.012457192875444889,
        0.003071998246014118,
        -0.13805420696735382,
        0.074552983045578,
        -0.05292990431189537,
        0.013765008188784122,
        -0.034009627997875214,
        0.058342281728982925,
        0.02635469287633896,
        -0.09139982610940933,
        -0.005421052221208811,
        0.028653929010033607,
        0.05176007002592087,
        -0.04041752591729164,
        -0.07773330062627792,
        -0.008913366124033928,
        0.0037182013038545847,
        0.045016635209321976,
        -0.008883633650839329,
        0.031259894371032715,
        -0.03831346705555916,
        -0.0624815970659256,
        -0.0774950459599495,
        0.0005726621020585299,
        0.03180934861302376,
        0.020160626620054245,
        -0.010524315759539604,
        -0.04060092568397522,
        -0.04090390354394913,
        -0.01730789802968502,
        -0.029940055683255196,
        0.06177058815956116,
        0.05182938650250435,
        -0.08547815680503845,
        0.02781311795115471,
        -0.06847317516803741,
        -0.0259705763310194,
        -0.07487856596708298,
        -0.029188716784119606,
        0.034831784665584564,
        -0.022141603752970695,
        0.03259414806962013,
        -0.06252297759056091,
        0.05844498798251152,
        -0.054820675402879715,
        -0.06800512224435806,
        0.0009449193603359163,
        0.12488432228565216,
        -0.03581523895263672,
        0.07365793734788895,
        -0.00012320035602897406,
        0.0001543610414955765,
        0.012887498363852501,
        -0.1080373004078865,
        -0.018168581649661064,
        0.03583433851599693,
        -0.012126676738262177,
        0.003299726638942957,
        -0.03372729942202568,
        1.2746640501086467e-32,
        -0.04840188845992088,
        0.08054835349321365,
        -0.01849876157939434,
        0.05804106593132019,
        -0.0026312677655369043,
        0.04052455350756645,
        0.004676912911236286,
        0.10579828917980194,
        -0.028655486181378365,
        0.032024916261434555,
        -0.021311860531568527,
        0.043859612196683884,
        -0.030296897515654564,
        0.019628465175628662,
        0.0016735399840399623,
        -0.04870697110891342,
        -0.001311726518906653,
        -0.027111567556858063,
        -0.07065273821353912,
        0.02497205324470997,
        0.021577389910817146,
        0.01916443184018135,
        0.015078019350767136,
        0.09822552651166916,
        0.11956717073917389,
        0.06597324460744858,
        0.03463471308350563,
        -0.014633853919804096,
        0.03724392130970955,
        -0.010826736688613892,
        -0.04014231264591217,
        -0.05484156310558319,
        -0.024091562256217003,
        -0.073936827480793,
        0.03380439430475235,
        0.013724132440984249,
        -0.05563851073384285,
        0.011748982593417168,
        -0.03449945151805878,
        -0.05390360951423645,
        -0.009048238396644592,
        0.0009239208302460611,
        -0.07966278493404388,
        -0.04539249837398529,
        0.10193238407373428,
        0.04512167349457741,
        0.0057098898105323315,
        0.088219553232193,
        -0.05079471692442894,
        -0.009913199581205845,
        0.012915010564029217,
        0.01058867760002613,
        -0.08396831899881363,
        -0.01223791018128395,
        -0.04189372435212135,
        -0.06189139187335968,
        -0.038656748831272125,
        0.04692508652806282,
        0.0367046594619751,
        0.03896638751029968,
        0.0338609404861927,
        -0.007870613597333431,
        -0.034948259592056274,
        -0.03242984041571617,
        -0.072169728577137,
        0.09296710789203644,
        0.03690948337316513,
        -0.052122049033641815,
        0.03057410567998886,
        0.04846378415822983,
        0.012602102942764759,
        0.003673632862046361,
        0.046294547617435455,
        0.021718937903642654,
        0.05960641801357269,
        0.08562357723712921,
        -0.09138337522745132,
        -0.05424670875072479,
        0.048693325370550156,
        -0.025500353425741196,
        -0.10817503929138184,
        0.0746772512793541,
        -0.015945283696055412,
        0.11232642829418182,
        -0.032020892947912216,
        -0.07048648595809937,
        0.014034342020750046,
        -0.010674703866243362,
        -0.045956168323755264,
        0.021829476580023766,
        0.0006123903440311551,
        0.061674702912569046,
        -0.06393986195325851,
        -0.05210261046886444,
        -0.008378730155527592,
        -1.2233132406085474e-32,
        0.031373582780361176,
        0.06910551339387894,
        0.00420652749016881,
        -0.02101387083530426,
        0.057603202760219574,
        -0.0014797744806855917,
        0.03540002182126045,
        0.07676980644464493,
        0.0697065219283104,
        -0.09107466787099838,
        0.061371613293886185,
        -0.08567455410957336,
        -0.11764733493328094,
        0.024426445364952087,
        -0.04070685803890228,
        -0.029768481850624084,
        -0.0404120497405529,
        -0.04343369975686073,
        0.052845727652311325,
        -0.017560334876179695,
        0.11713084578514099,
        0.13206440210342407,
        0.07451856881380081,
        0.02185060828924179,
        -0.0013527751434594393,
        -0.013871547766029835,
        0.04915556311607361,
        0.05499212071299553,
        0.05647501349449158,
        0.07658740878105164,
        -0.00034920545294880867,
        -0.03530317172408104,
        -0.01431470736861229,
        -0.0182905662804842,
        0.027170361950993538,
        0.06296376883983612,
        0.025319157168269157,
        0.018024053424596786,
        0.007889310829341412,
        -0.07285549491643906,
        -0.009145672433078289,
        0.006644668988883495,
        -0.02109394408762455,
        -0.03129154071211815,
        0.005210377275943756,
        -0.10273221135139465,
        -0.06926451623439789,
        0.03664359450340271,
        0.04828205704689026,
        0.0014365847455337644,
        -0.08344589173793793,
        -0.038105353713035583,
        -0.03707130253314972,
        -0.009854266420006752,
        -0.004191612359136343,
        0.03216320276260376,
        -0.07775890827178955,
        -0.029596203938126564,
        0.05434539169073105,
        -0.0032509572338312864,
        0.04021993279457092,
        -0.020156390964984894,
        -0.07496073096990585,
        -0.07166262716054916,
        0.002041900996118784,
        -0.10039537400007248,
        0.10356926172971725,
        0.025760741904377937,
        -0.001398476422764361,
        -0.014455020427703857,
        -0.025802111253142357,
        0.025325313210487366,
        0.05748972296714783,
        0.0028212175238877535,
        0.04009506106376648,
        0.009926561266183853,
        -0.0904373973608017,
        -0.006999335251748562,
        0.09853189438581467,
        -0.035659823566675186,
        -0.05572955310344696,
        -0.044236551970243454,
        0.019293563440442085,
        0.11039365082979202,
        0.10896065086126328,
        0.08693539351224899,
        0.0981893539428711,
        -0.06031658127903938,
        -0.01794317364692688,
        0.05143342539668083,
        0.011860431171953678,
        0.012514407746493816,
        0.059347737580537796,
        0.11872182041406631,
        -0.10304508358240128,
        -5.8818631742951766e-08,
        0.03776925429701805,
        -0.001165327848866582,
        -0.0323772057890892,
        -0.012922621332108974,
        0.02231646701693535,
        -0.08837635815143585,
        -0.043280575424432755,
        0.017750075086951256,
        0.058312155306339264,
        -0.0626336932182312,
        0.09757142513990402,
        0.0017176105175167322,
        -0.02086712047457695,
        0.10963372141122818,
        0.02430952712893486,
        0.01539013721048832,
        -0.09577018022537231,
        0.07852530479431152,
        -0.026810308918356895,
        -0.00992228090763092,
        -0.004163994919508696,
        0.04315931349992752,
        0.015889272093772888,
        0.004388329107314348,
        0.04180797562003136,
        -0.0015621720813214779,
        -0.03788696229457855,
        -0.03305306285619736,
        0.04488608241081238,
        0.0023566747549921274,
        -0.04987230896949768,
        0.00836292002350092,
        0.047299690544605255,
        -0.01435796543955803,
        -0.049004893749952316,
        -0.032207053154706955,
        -0.051486458629369736,
        -0.031124595552682877,
        0.017194226384162903,
        -0.02928084321320057,
        0.03978055715560913,
        -0.12120439112186432,
        -0.014337185770273209,
        -0.011891420930624008,
        0.0145042035728693,
        -0.07790837436914444,
        0.05205491557717323,
        -0.07087720930576324,
        -0.06645660102367401,
        -0.04017454385757446,
        -0.04145748168230057,
        0.07319676131010056,
        0.026893869042396545,
        -0.01993202231824398,
        0.1019655093550682,
        -0.000632191717159003,
        0.05522024631500244,
        0.048121050000190735,
        0.013964966870844364,
        0.0026401004288345575,
        0.016487976536154747,
        0.017125604674220085,
        -0.05505112558603287,
        0.032628413289785385
    ]
}