{
    "id": "dyqjODwsTmU",
    "title": "ChatGPT has a Scarlett Johansson problem | The Vergecast",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-05-24T12:39:58Z",
    "video_url": "https://www.youtube.com/watch?v=dyqjODwsTmU",
    "category": "Science & Technology",
    "tags": [
        "gadgets",
        "tech gadgets",
        "technology",
        "verge",
        "the verge",
        "tech",
        "tech news"
    ],
    "views": 27774,
    "likes": 586,
    "comments_count": 69,
    "description": "The Verge's Nilay Patel, Alex Cranz, and David Pierce discuss announcements from Microsoft Build, the OpenAI's trouble with Scarlett Johansson, new Sonos headphones, and more.  Further reading:   00:00 - Intro 03:50 - Microsoft Build & Surface events 41:20 - OpenAI pull its ScarJo-like voice 1:03:13 - Ticketmaster sued by DOJ 1:06:52 - Salt Spoon! 1:08:37 - Humane is looking for a buyer 1:18:19 - Apple has some explaining to do 1:20:57 - Sonos Ace headphones announced  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Tuesday and Friday:   If you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit:",
    "description_links": [
        "https://www.theverge.com/e/23927910",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz",
        "https://www.theverge.com/ethics-state..."
    ],
    "transcript": "(graphic buzzing) (lively music) - Hello and welcome to \"Vergecast,\" the flagship podcast of computers that remember everything about you, no matter what. It's gonna be great. This is the future. It's been the dream of every person in computing forever, to make sure that the computer never forgets every single thing you looked at ever. - What could possibly go wrong? - And then talks to you in a slightly sensual way. (group chuckling) Hi, I am Nilay. I'm your friend. David Pierce is here. - Hello. - Alex Cranz is here. - Hey. (chuckles) - A lot of just a weird week. Can I tell you what I think the theme of the week is? - Sure. - It's probably broken and I don't believe you. (Alex laughing) - Oh, that's good. - That's a good theme- - Great. That's kinda where we are in the tech landscape right now, is you can make your videos, you can tweet your tweets, and then we're gonna get your products and the truth is gonna come out, right? Like that's the cycle that we're in is it's great. It's a super great video. I'm glad you paid all the influencers. I'm gonna put your face computer on my face, man. And then we're gonna know. Yeah. I'm gonna hold your teenage engineering box and then we're gonna know. - I like it. 'cause it's one timeline darker than the is this anything timeline. And I feel like we were in the is this anything timeline for a while and now it's getting slightly bleaker. - Yeah, it's probably broken and I don't believe you. We're gonna put AI in Google Search and Google Search is gonna tell you to put glue in your pizza, which is a real headline, by the time you are listening to this, I think Kylie will have that headline up, which is, AI previews in Google search are overwhelmingly stupid, mostly 'cause they're reading Reddit and Reddit is full of jokes and people (chuckling) are now like willfully trying to, like Google bombing is back. - Yeah. - Because you ask Google like what mammal has the most bones, which is a real thing people are doing. And it goes and finds a Reddit joke from five years ago that's like, it's snakes. (Alex chuckles) - Yeah, and it makes you realize like the running joke on the internet is that sarcasm and jokes are very hard to understand. It turns out that like people still better at it than Google, which is real, real bad at it. - It's probably broken and I don't believe you. Again, the theme of the week, there's some exciting news this week, like legitimately cool news this week. David, you talked to Tom about everything that happened at Microsoft Build and the Surface event. Legitimately cool news. If that stuff works, the Mac versus PC race is fully back on. - Yep. - The processor wars are back on with a new metric, right? Like Microsoft has NPUs now with the Qualcomm chips doing AI. Apple has neural engines. That's all really exciting. Boy, do I want that stuff to work, (chuckling) right? Like it's just do you not feel, like open ad- - I mean, NPUs are real. - We're gonna talk about open ads, Scarlett Johansson. And it's like, yeah, I don't believe you. (Nilay laughing) (Alex laughing) What a weird place to be. - It is, and it also, you end up in this place of like questioning everybody's intentions all the time too. Like with Microsoft it's like, oh, Windows on Arm, you did it? That's so exciting. Do you remember all the other times that you told me that you did it? That's really interesting. And then with all this OpenAI stuff, the timelines are weird. Everybody is saying things that don't all make sense simultaneously and it's just, you get to the point where it's like, does anyone know what they're talking about? (David chuckling) (Nilay chuckling) And it's just very strange. But I agree with you, and the Microsoft stuff in particular, I thought was both substantially nerdier and substantially more exciting than I expected it to be. Like it was a wonky build in like the best way. - Yeah. Let's start there. We are gonna talk about OpenAI and Scarlett Johansson later. We're gonna have a lightning round unsponsored. (Alex chuckling) - For now. - We gotta start a shoe company that's called Unsponsored and then have the lightning round sponsored by Unsponsored. - That's pretty good. - If you're a shoe investor, call me. - Is it all the logos or is it no logos- - No logos - On the shoe? - I think it might be all the logos. - Oh. - Oh, right, you like bring it all the way back around. - Yeah, it's every shoe logo on it. And it's called Unsponsored. Please, like somebody at Mischief is building that right now. They just heard me. You can have that, Mischief, enjoy. - If you sponsor the lighting round. - If you sponsor the lightning round. (chuckling) Like I'm not saying we're a bunch of IP experts on this show. I'm just saying if you give us cash, we'll give you that idea. (David laughing) Okay, let's start with build, 'cause it was an already build and I think you guys only really scratched the surface with Tom, who was there. Great job covering it. The big news is obviously the Copilot PCs, right? Copilot+ PCs, which have the NPU, which are running on the new Snapdragon X processors. It should be noted that the team that built those processors at Qualcomm is from a company called NUVIA, which Qualcomm acquired. NUVIA is a bunch of ex-Apple chip designers. You can see how they caught up. - Yep. - It's a pretty straight line, right? You're losing to Apple. The Apple chip designers leave, you buy them, (chuckles) so that you're competitive with Apple again. We gotta run the benchmarks, we gotta get the things. But, Cranz, I mean you're a chip nerd. Do you buy it right now? - I mean, I think it's the NUVIA part of it that makes me kind of cautiously optimistic. And also the fact that laptop makers actually want us to try the laptops, generally speaking. - Oh yeah. That's a big one. - They do not, when it sucks, they're like, \"Are you sure you want this?\" And they slow roll you, right? Like they wait a while to get it to you and then you end up having to buy it and review it yourself. And this time they're like, \"When do you want it? We'll get it to you next week.\" They're really eager about it. And in a way that like surprised me. I took a few briefings on the laptops and I was like, \"Oh, you guys are like pumped. I'm not used to that.\" And it reminds me a lot of when AMD was like coming back, when it was making its big comeback, what, in like 2017? Where suddenly people were like, \"Do you care about AMD?\" Like get excited, and I was like, oh, oh, this is weird. But, yeah, the NPUs is the big deal here. I think like Microsoft said if you wanna take advantage of the most stuff that's gonna be on Windows now, you probably want an NPU in that computer. And NPUs have been around for a while. Like Intel's had them. They're called neural processing units. Everybody's been doing it. You know, Apple calls it a neural engine, whatever. But they've all been doing it and it's basically just another processor to offload those like tasks that generally you would've put on your GPU or like major CPU kind of brute force. And now it's like, okay, just for this. And it's like when Intel introduced it a couple of years ago, it was one of those things where you're like, okay, do I care about this? Like I'm not an AI researcher, why should I care about this? And that's still kinda the question, unless now I think the big change is that like Adobe's gonna be using it and a lot of these like film processing companies and stuff are doing it. So it's like, okay, I guess it makes a little more sense now than it did, you know, six years ago. What do you guys feel about that? - Well, I'm curious. I mean, a lot of what they announced in Windows is fairly interesting. Some of it, I think people have had really strong reactions to, like Recall. But some of it is just straightforwardly cool, right? Like you can draw stick figures in Microsoft Paint and it will generate more photorealistic images as you draw. That's cool. - Yeah. That's neat. - And that's one of the first examples of like a cool local AI workload beyond the Lightroom and Premieres of the world that I can think of because most of the other AI workloads like happen in the cloud. - Yeah. - Right? You like, you talk to a chatbot and they happen in the cloud or you're coding in GitHub and Copilot and GitHub is happening in the cloud and now you've got some cool stuff that's happening locally. We should talk about Recall, which is the other big thing that's happening on the NPU. But there are not more of those. I mean, like on, there are not more of those. There's the other stuff that's like, you're playing \"Minecraft\" and the computer's watching with you and talking you through how to play Minecraft, but I suspect there's a little bit of hybrid, local cloud happening there. I know it's happening with Paint because there are things Paint won't let you generate because Microsoft's commitment to AI safety, which is weird, 'cause if you turn off the AI, you can draw any kind of dongs you want in Paint. (group laughing) - Yeah. Yeah. - So there there is like a little bit of push and pull between the cloud and local, right? And just in terms of safety, which is really interesting to think about. Like Google Docs is a cloud application. You can type anything you want in Google Docs. Microsoft Word 365 can be expressed as a cloud application. You can type anything you want in Microsoft Word 365. You turn on AI features in Microsoft Paint, it's like you can't draw some stuff. Weird. That's just weird, you know? And like I suspect we're gonna have a long conversation about those kinds of lines for years to come. But that part, just the other part of it where it's like, where's the AI happening? Is it in the cloud or is it here on the machine? It's kind of interesting that Microsoft's answer is very much like both. - Yeah. - Well, and I think that's the right answer, right? Again, the where one ends and the other begins is, I think, forever going to be complicated, but everyone I talk to says that the place we have to get to is both, because the stuff that you do on device is private and fast in a way that anything that happens off device just can't be. And I think about like the translation stuff Microsoft is trying to do. Like there's a chunk of that that if you don't do it locally, it's going to suck because real-time translation that has to go to the cloud is by definition not real-time translation. It just breaks. And so the thing that they launched where like you can be in Edge and it can translate a YouTube video while you're watching the YouTube video, very cool in theory. Awful with a half second delay. - Yeah. - Like it's the sort of thing that I think is that tuning that they're gonna have to do to get those two pieces right is actually like the whole ball game. But I think it's very cool that Microsoft is deep in this idea of we're going to start on your device. And I think that's smart and right. - And I think the other interesting part there is obviously we're, you know, we're barreling towards WWDC where we expect Apple to announce many, many similar kinds of things, or at least a similar kind of focus on AI. Microsoft has the big AI part. They've got Azure and the big open AI relationship and they are integrating all this stuff and they have their own models that they're running at all sorts of scales. And so I think they're able to just like take more shots across Windows and devices and their suite of applications that runs everywhere. And that to me is like the interesting part. Like there isn't another company that kinda has all the pieces. Whether Microsoft can execute, whether it can deliver finished applications that people like to use. Whether it can make people interested in Windows, like consumers interested in Windows outside of a gaming context again, I think it's broken and I don't believe you. Like that's where I'm at, you know? It's like you gotta, we have to get the machines. It's interesting, Alex, that you're saying that the companies are excited, but there's a lot of investment in like Intel chips in the world, in x86 applications. And that transition's gonna be slow, not fast. I think they did say stuff about emulation, right? - Intel chips have had NPUs in them for a very long time. They introduced it a couple of years ago. So the big difference is now Copilot has like kind of a minimum amount of what your NPU should be able to process. So the deal is that before, you know, an NPU would do it like, what, 18 TOPS or something, which is like trillion operations per second. So it would do like 18 and now they're saying, okay, it has to be 40, it has to be 45. And that was one of the things like Apple was bringing up TOPS in their M4 presentation back with the iPad where they were like, \"We can do 38 TOPS.\" And you're like, \"Cool, what does that mean? - This is great. - And then Microsoft was just like, \"You gotta do 40.\" And we're like. - I love it. - Cool. - TOPS is the new megapixels in my favorite possible way/ This rules. - Yeah. - We're back to like the megahertz wars or. (David chuckling) (Nilay chuckling) - Yeah. It's gonna be super goofy. - Core wars are here. - But that like... They're really leaning on that, 'cause I guess you'd need, like they're saying, you know, a lot of the stuff that's coming to Windows will work okay on older Windows PCs, but like you're really gonna need the neural processors. - Well, and also- - And really good ones. - Importantly also your computer will be good, right? Like Which is not a small thing. Right? The idea of all of these things, like, Alex, you said this before, like if you're an AI researcher, it's a nice to have, but it is going to, in other ways, make your computer worse. And the promise that Microsoft came out with with the Copilot+ PCs is these computers are going to be fast, they're going to do AI stuff, they're going to have long battery life, and they're going to be good computers. And that is not a small thing in the Windows world right now in which you've kind of had to choose one or two of those three things for a really long time. And especially with this Qualcomm stuff, if they can get the battery life there to the point where AI is not like, you don't have to buy an AI computer the way you buy a gaming computer and you like make a bunch of sacrifices in exchange for this one thing you want to work really well. If they can actually have solved these three things together, that to me is where the stuff gets really powerful. And then you get the whole scale of Microsoft and the fact that it has the App Store and the browser and the OS and the models and the cloud service. Like that's when that becomes really powerful if and only if the devices don't suck (chuckles) and maybe possibly the devices don't suck. - Well, if they don't suck and they're affordable enough, right? Like most people are spending $700 on a laptop and most of these laptops are in the $1,200 range, which is intentional. They're meant to go after the MacBook Air because MacBook Airs sell a lot better than everybody else's laptops. - Right. - Right, and what's interesting is, you know, Satya Nadella, the CEO of Microsoft talked to Joanna Stern at the Wall Street Journal, notable for her Expat, Joanna Stern, I might add. (Alex chuckling) (Nilay chuckling) And basically was like, \"Yeah, we're gonna beat the MacBook Air.\" Yusuf Mehdi who's executive vice president of Microsoft basically is like, \"A MacBook Air with an M3, these computers will beat those by 50% on Cinebench.\" So they're making huge performance claims on these PCs. They're also thin and light. There's some question I think John Gruber raised about whether they have fans, as though people care. (chuckles) - They do have, some of 'em have fans- - Some of 'em are gonna have fans, fine. But MacBooks have thermal throttling issues, particularly the Air, right? They do slow down. So if you wanna run these computers really hard with AI workloads, which are essentially on a GPU-like piece of the processor, make it hot. But we're expecting good battery life. And then the list of, the list of manufacturers here is Dell, Lenovo, Samsung, HP, Acer, ASUS. - It's everybody. - Microsoft obviously has a Surface Pro and the Surface, that that's the suite, right? There isn't, Alex, you've taken the briefings. How are they differentiating? These is just like, are you a Dell fan boy or an ASUS fan boy? They're the same computer- - Yeah. Kind of, like everybody's bringing up their own thing. I took an HP briefing and they rebranded their whole thing, right? 'Cause you had like the HP Spectre and the HP Pavilion and the HP something you've never heard of. Like it was just a mess. And they redid their whole portfolio into the EliteBook and the ProBook for corporates, or corporate stuff. And then the OmniBook, which is for the rest of us. And the OmnBook is like, I got to play around with one. It was really nice. Didn't get to benchmark it or anything like that. So again, we're gonna have to wait and see. But it was like, it was a nice laptop. It felt like exciting and good in a way. It felt kinda like my iPad Pro with the thing on it, the Magic Keyboard, only lighter and better. - Oh, the Surface Keyboard looks awesome, right? 'Cause it's totally wireless. - Yeah, like that's always kinda the way, right? Like Microsoft has done this before where they go and they say, all your OEMs, you're gonna have to like swarm around this. It's gonna be the netbook or touch computers or whatever. You're gonna have to start making these. They were just like, yeah, you gotta touch the screen, right? And in this case, this is the swarm around the dumbest name alive. But they recognize Apple's coming for us, you know? Everybody, to your point, Nilay, you say this all the time, the computer is no longer about the rest of the computer. It's about the browser. And Microsoft has to compete with that. Like that is a very, that is an existential crisis for Microsoft, right? If everybody just says, okay, I just need a Chromebook or whatever, my phone, that's bad for them. So that's why they've put all this AI in. That's why they're really like glomming onto this trend at the moment. And I don't know, these things will be really interesting. I'm really curious to see how fast they are because Qualcomm's made these promises before, but this time they've got this whole new team behind it, which like HP was like, \"Well, you know,\" 'cause I was like, \"What's different this time? You guys have released some real dog shit.\" - It's probably broken and I don't believe you. - Yeah, and HP was like, \"Well, it's a new team over there, so like we're feeling confident.\" And I was like, \"Okay, well, that's different.\" I mean, but we'll see, right? You just kinda have to hold your breath and- - Yeah, look, this is the thing about tech coverage and I feel like we have said this many, many times, but this is like a new era and we just need to repeat ourselves. Eventually the products ship and then there's no hiding and there's only two kinds of coverage in the world where the truth just outs, it's sports where one team wins and another team loses and it's tech where you can hold the thing in your hand and it works or it doesn't. - Yep. - And like a lot of things have not worked recently. (chuckles) Like we're on an all time run of things not working and a lot of the reason that things don't work is the underlying AI models are not reliable, which is something, Alex, you have been pointing out now for a couple weeks. You were making these huge bets and like, it's like betting on a toddler. (chuckling) Like are you gonna stand up for a long time or are you just gonna tip over? Like let's build a business around you. - What was interesting was like some of the AI stuff that Microsoft was doing is stuff that we've already seen before, right? Like HP and a lot of these companies said, okay, you're gonna buy one of these AI PCs. What the hell does that actually mean practically? And in HP's case, they were like, we've slapped it, we've like thrown in the ChatGPT prompt window, so you can talk to ChatGPT 3.5 on an HP computer. And I was like, \"Cool, I don't care about that.\" - That's not the answer. - That's not the answer. - like it is so definitively not the answer. - But then the other thing they were doing was they were like, \"Okay, well you can also like, we can learn more about the computer to better optimize it.\" And that's something that we've seen from, NVIDIA's been doing that for years now with DLSS. And so it's like, okay, well that's actually useful and it's like a use of AI that I've seen in practice and seen at work. So I could almost get excited about that. - I also think that's where Recall comes in and is actually really important to this whole thing because what I think Microsoft did well, both at the Surface event on Monday and at Build on Tuesday, is give people examples of what AI can do on their computer. And the answer is not a chatbot that you could find at a website. Like that isn't, that's nothing. You have accomplished nothing if that's what you've done. But what Microsoft said is they, and it was a lot of little things in spots, right? Where they're like, AI copy and paste, copy in one language, paste in another. Like you kind of have to do a million of those in order to make this case. But I think Recall was the big swing where it was like, okay, here is one genuinely new thing you can do on an AI PC that you couldn't before that is better because of AI. - Yes. - And like in the whole AI world, we are severely lacking in that type of thing. - Yes. - And I feel like whether Recall is any good, whether people want it, what we do with the privacy implications, all that aside, just the fact that Microsoft is like, \"We found a new thing we can do now because of this\" felt really good to me. (chuckles) That I was like, okay, you understand what this is actually for, which is things, like, it's for doing things. It's not for talking to a chatbot I can talk to in a web browser. It's not for a bunch of random nonsense that doesn't help anybody. Like it's for things. - Yeah, I think Ryan Broderick, who writes the Garbage Day newsletter, has been consistently pointing out that the AI industry has to talk about AGI in destroying the world to make their extremely boring demos have stakes. (David laughing) (Alex laughing) - That's very true. - Like you have to be like, it can see an orange, this will lead to the end of the world. Like you just (chuckles) fine, you know? But you're right that Microsoft laid out a particular vision of computing, which is you're using a computer all day. What if you could then interact with a computer in a way that remembered all of the things you were doing and that became your companion? And we should get into the reaction and the reality of that and how it might work and the privacy implications. I think all those things are really important. I just wanna spend one second on Nadella saying this is one of the two dreams people have had for a long time in the keynote. Because he's not wrong, right? The idea that you live your life on the computer and all the things you do on your computer comprise your experiences and it would be cool if the computer could help you sort those out is in fact a dream. - Yeah. - Yes. - And it requires like one bit of a philosophical shift, which is I think most people think about that dream in terms of just like walking around the world. Like what if you had an ambient computer or the AR Glasses and you were just like asking questions and your sort of IRL experiences were that thing. And Microsoft has been like, \"All right, we're,\" like HoloLens aside, like actually you live your life on the screen. So we can just build a thing on the screen and then we'll get to your eyes later. (chuckling) You know, like we'll put the computer on your face at a later time. What about the computer that's in front of your face? What if we made that do the thing that everyone wants? And that is a leap. It's actually kind of an interesting leap that Microsoft took first in this way, whereas everyone else has been chasing these glasses. And I just like, it should be, I think noting that he called it one of the two dreams everyone had and I think people were like, \"Is that the dream?\" And it's like, oh, actually we've been talking about Air glasses for like a decade. And this is just that, but just digitally instead of- - Yeah, but once Microsoft is the company that actually like lives in the real world, unlike everybody else. - Yeah, they're not just showing some weird concept videos of like the Microsoft Kin, or like... - Exactly. (chuckling) - Whatever that is or the, what was it? The Papyrus, what was that thing called? The Courier. - Oh, the Co- - Oh, God, Courier. - RIP, the Courier. They probably made a thing called the Papyrus at one point. - (chuckles) I'm sure. (David chuckling) - They will soon if they haven't. - Can I tell you an early a story about Nilay Patel's experiences with copyright infringement? Nobody remembers the Kin. This is like a thing that happened to a small number of us on the internet. But Microsoft, in the early iPhone days, instead of releasing a smartphone, released a teen-focused feature phone called the Microsoft Kin. This is real. There was a Kin One and a Kin Two. They were banana, like, I dunno why they did this. And they were not smartphones. They were legitimately feature phones that could like send MSN Messages. And their marketing campaign was like beautiful young people in hip art districts of cities, like skateboarding, talking on their feature phones. And I remixed their ads to the song \"Too Drunk to Fuck\" by The Dead Kennedys (David laughing) (Alex laughing) and Microsoft immediately had YouTube take them down. (laughs) - Amazing. - (chuckles) And I'm like, I'm like, that would just be a great TikTok now. Like no one would even asked this question now. Anyway, if you're out there, do your thing, TikTok. (Alex chuckling) The Kin, by the way, we gave them horrible reviews before they even came out. Microsoft canceled them. This is a real victory of the Engadget days. Well, I dunno what we're talking about. Anyway, no, the products are real. That's what we're talking about. Not the Microsoft Kin. The products are real. You can like use it and then the reaction to them is I don't trust this at all. It's probably broken. I don't believe you. - Yeah, yeah, the reaction to Recall in particular was surprising to me because like I edited our story on it and I was like, \"This is cool. I'm really excited about this.\" Like didn't think of the privacy stuff at all, because I operate under the assumption if someone physically has your computer, then you're boned. Like you're screwed. If someone has your computer, you're done. - That's the same work. - Yeah. They're the same. Just in case people didn't understand what bone means. I wanna make sure our entire audience understands. (group chuckling) But I just didn't care. I was like, \"Okay, cool.\" This is really neat and I'm excited for my computer to be a better archive of things because that's what I use a computer for. - And then a friend was like, \"Have you heard about how pissed people are about Recall?\" And I was like, \"Why?\" And they're like, \"Because it records everything you do.\" And I was like, \"That's literally what a computer does.\" That's like The point of- - Have you ever looked at the history tab of your browser? - I was just about to say, this is one of my favorite things to do to people is like, people don't understand the extent to which this stuff is already being recorded. Like go look at the cache files on your computer for what happens in all the apps on your computer. Like they already know. But I think, Cranz, to your point, the thing about privacy, there are real interesting privacy implications here about like, what happens if somebody gets hold of this? What if, are there gonna be new kinds of malware that can get onto my computer and chase this stuff down? Like the stakes of that go up slightly. But I do think part of the reaction was just reminding people of how much these devices already know. And just the thing where it's like, I'm doing all of this stuff on here. Like this is in a very real way my life. And just the fact that that's being collected somewhere feels gross to be reminded of. Like even though sort of intellectually I understand that that's already the case, it's like when you realize that your ISP has access to every website that you go to on your phone, even if you're on like in incognito, like, no, like Verizon still knows, it's still there. Like it just, people hate being reminded of that. And it is just such an unavoidable fact of being alive right now that it is how it is that I think every time it comes up again, you're made to feel sort of powerless and helpless against this like incredible tide of all these electronics that know too much about me. - Well, I think it was also the fact that it's using AI, right? Like that's a big part of it. And people are having this weird moment, especially this week, and we're gonna talk about it more with like what's going on with Scarlett Johansson later. But people are just having this sudden visceral reaction to AI. And so this thing was, she was like, \"Yes, computers archive all your data. They have done that since the beginning of time. This is just more efficient at it.\" They were like, that might have gone over a little easier if they hadn't also said, \"And we're gonna use AI to do it all.\" Because even though the AI, everything is happening according to Microsoft, you know, security researchers will do their thing. Everything is happening on the computer. It is not going into the cloud. None of this is being shared anywhere. It's using the NPU to like process this stuff. All of it's happening there. So theoretically it is no different than just using your computer as normal. Only now if a bad person gets ahold of your computer, they're gonna have a little easier time recovering everything you do, that's it. But you put AI in there and people are like, burn it to the ground. - Well, the whole road of that is so fascinating to me, 'cause I was talking to Dan Siroker, the CEO of this company called Rewind, which has been doing a third-party version of this on Macs for the last, I think, year or so now. It's another one that it uses basically like screen recording and your device audio to pull out a lot of this same information. And they actually just launched a new version that sinks in the cloud because the overwhelming feedback from people was either hell no or hell yes, the hell no people you're never gonna get. And what the hell yes people wanted was for all of this to be available to them in more places. And so it's like we're actually in this bonkers divide where there's a set of people who like as soon as you present them the beginning of the road are like absolutely not and just like nope their way out of this whole technological transition. And then there are a bunch of people for whom the privacy stuff is actually going to be a hindrance more than anything else and there are gonna be people who are like, well, why can't I access everything that I did on my other computer from my work computer? And then Microsoft is gonna be in this horrible position of being like, well, we have to do the less private thing, because it's actually what our users want. And it is just, it just like exacerbates that divide further and further and it just, I don't know, it just feels crazy to me. Like the Rewind folks were like, \"I don't know what you want from us. We tried to do it as private as we could and the people who used it didn't want that anymore. (chuckles) - So there's two things about that that I think are fascinating. And they are expressed sort of in very tangible ways, then I think in very esoteric ways. So the very tangible way, I did the thing when I interviewed Sundar where I handed him my phone to look at Google Search results. And we ran that clip. That clip is like doing bonkers on TikTok. And in the clip, as a joke, I say to Sundar Pichai, \"Don't dig through my phone.\" (Alex chuckling) Like of all the things you were ever gonna say to a CEO, (chuckles) like a billionaire CEO of one of the largest- - You're just pullin' up pics of Macs- - Like don't dig through, literally like, who am I? Of course I said, like, I couldn't resist it, you know? But it was just a joke. It's just like a way to be human when you hand someone your phone. And the people in the comments are like, \"He already knows everything.\" (Alex laughing) (David laughing) Like why would you tell him not to dig through your phone? Like he's the CEO of Google. Like if you want, he can just, he can already dig through your phone. And I think that's nihilism, right? Like there's an element of nihilism there, which is like, it's already over. Like you might as well embrace it and be excited about it. And then there's an element of nihilism that's like, well, I can't stop it. I'm gonna live off the grid for the rest of my life. And that's one thing. The more esoteric thing that I think about all the time is as more and more of these companies get more and more into AI content generation, the thing that they are promising the people who pay them money, which is, in large part, advertisers, is that they will make autogenerated ads on their platforms. So like Google will make autogenerated AI-created ads on YouTube. Meta will do it on Instagram. TikTok will do it on TikTok. TikTok actually announced AI-generated ads this week and Mia Sato is writing with them. You're gonna get to a place where you get extremely well targeted custom content and the people who are like Facebook is listening to me are gonna lose their minds. - (chuckles) Yes. (Alex chuckling) Right, like the idea that you have privacy then is like out the window. Like right now, people think Facebook is listening to them, because it can target you based on your Wi-Fi networks, which is the simplest thing. It just like knows what IP address you're on. It knows that your friends have been on that IP address and it was like serve some ads across based on interest targeting. It's not smart, it's not stupid, it's like somewhere in the middle, you know? Like it's a pretty blunt instrument, but people are convinced that Facebook is listening to them. You're gonna get to a place where it knows a whole lot about you and then it knows that you're on the same Wi-Fi network as your friend that you talked to about vacations in Mexico and then it delivers you a video of you in Mexico? (Alex chuckling) What? - Yeah. - Like people are gonna lose their minds. And then I think that, well, I don't have any privacy anyway. I might as well just give the cloud provider of Recall or Rewind everything. I think that might actually change in a dramatic way very quickly at that point. - Maybe, like it really does seem like either the pendulum is going to swing aggressively at some point soon or the pendulum is just going to like burst through the side. - No, no, you know what's gonna happen- - Pendulum explodes. - Yeah, like \"Charlie and the Chocolate Factory\" style, just like launch through the ceiling and be gone. (Nilay laughing) (David laughing) - One thing like... (laughing) (group laughing) Like what's gonna happen to the privacy pendulum? They could go into space. - Zoom! - (chuckles) One thing I'll note you mentioned, that the ISPs can see everything. Like you would think that there would be a federal privacy bill, which there is not. One of the first things that the Republican Congress in Trump's first term did, literally one of the first things was they threw out a privacy bill that would've kept your data private from ISPs. - Yep. - It was just like one of, hey, we're here. What should we do? We should make it so AT&T can read all your shit. Like immediate, it was an outrage. And we have just not fixed that in years. - I tend to feel like that tension is only gonna be resolved when Congress actually knows what a computer is, how it works, how to like use it. Like when they finally- - Well, here's what a computer is. It's an AI powered device. But if you say the right words, we'll bang you. - Yeah. - And I think Congress will react to that idea very powerfully. (laughing) (Alex laughing) - But it will also, if you say the wrong words, share all the photos of you banging it to your- - Look, if you wanna get something done in this United States Congress - That'll get Congress. - It's blackmail and booty. Those are your choices. (chuckles) - That's real. (Alex chuckling) (Nilay chuckling) - So honestly, this is a great thing, right? Like I think this tension has been there for a very long time. And I think you're right that we are coming to a point where like something's gonna have to give. These companies like Microsoft are really pushing for stuff that is just completely counter to what we understand of privacy and security and what we want. And the only way that's gonna change is if someone else says, \"Hey, you can't do that. - Yeah, look, I think the Recall stuff is really interesting, I think it's, to your point, David, it can't see what you're doing on your phone, right? So this promise that you have this companion that is sort of living your digital life with you, except for what you do on your phone, that's weird, right? And then you get into, should this be a cloud service? Are you running a background app on an Android phone? Like Apple's not gonna let them do it, right? - No. Maybe Apple does it on its own, an iOS in a couple weeks. Like they're gonna have to bridge that gap, I think, for this to be truly successful. But then there's the piece where, yeah, we're gonna have to hold them accountable to this thing being totally local and a bunch of other AI stuff on this device is hybridized, right? Like the Paint example is hybridized. Like I don't know. And that's why I don't wanna seem overly skeptical. I really, I can see the jump that Microsoft made from AR glasses are too hard. We have a bunch of AI. We can basically do ar AR on windows. Like AR is not the right word, but like this sort of augmented experience in Windows for your digital life. - Multimodal you mean? - Yeah. - Yeah, there's something there. Copilot's like almost exactly the right word, right? Like you're just doing stuff on a computer and you're asking questions about the experiences you're having. A lot of people have thought that would happen first in glasses on your face and Microsoft is like, what if it happens on the screen in front of you? Like great. I love this. - I just wanna point out, you said Copilot is the right word. Where do you stand on Copilot+ PCs? - Awful. Awful, awful, awful. - I don't know what that is. - Even Microsoft has trouble saying the phrase Copilot+ PCs. Like if you go back and watch, there are a bunch of people who clearly practiced very hard who still occasionally struggle to say the phrase Copilot+ PCs. It's terrible. Cool product, bad name. - They were never gonna get it right. - Why didn't they just call 'em AI PCs? Like, did AI- - Just call them Copilot PCs. What the hell is the + doing there? It's not a streaming service. (Nilay laughing) What are we doing here? - Do any of these features on Windows have a monthly fee? - No, I don't think so yet. - Not as far as we know, I don't think. Some of it requires an OpenAI API key, which you have to pay for. Like some of the copy and paste stuff you can only do if you have the, I think, the like GPT-4 key or something, but. - Ah. - Most of this stuff seems like it's gonna come baked into Windows, which itself is rapidly becoming a subscription service. So I think that's where you end up getting charged for it is like as a Microsoft 365 thing rather than a specific AI thing over time. - I do love the mental image of like three to five years from now, the extremely cheap Acer PC in a Walmart with like the dented cardboard sign that's like copy and paste in multiple languages and it's just like sitting in Racine, Wisconsin, you know? (group chuckling) And everyone's like, why? And that costs a monthly fee. And they're like, \"Why aren't these computers selling?\" Like that's gonna be great for everybody. We should take a break. That's just Build. (energetic music) There's more, there's like yet more AI to use this week. We'll come back, we'll talk about Scarlett Johansson. It's really what we're gonna do here on \"Vergecast.\" We'll be right back. (drum beating) (piano music) (notification rings) Okay, we're back. There are two things I forgot to say about Build. One of which was the only reason I wanted to talk about Build. So I'll get to it. The second though, I should just point out, in the scheme of, it's probably broken I don't believe you, there was a Microsoft Services outage that took down Copilot, ChatGPT Search and DuckDuckGo. - Yeah. - Because they did realize the big index- - Did Bing survive? - Well, Bing and ChatGPT Search are the same- - Okay. - Yeah. - Right, there's like a Bing, there was like a Bing outage, like the Bing API went down and everything else next to it went down. - It's like when AWS goes down and all of a sudden all the apps that everyone uses just disappear off the internet. Like it's nice to be reminded that the internet basically only exists in like four places. - Yeah. - It's not, I mean, I'm sure the Bing team was like, people noticed Bing was down. (David laughing) - Just because DuckDuckGo was down. (David laughing) (Nilay laughing) - So that's good, the second thing I wanna note, and again, I think this is the most important news of the week, (laughs) is, yes, many of the traditional PC companies announced Copilot+ PCs, including Samsung. And if you have been tracking Samsung, you will know that Samsung recently instituted six-day work weeks for its executives to, quote, inject a sense of crisis into the company. Not into, they did not institute six-day work weeks for their engineers or products, for the executives. You get a bunch of executives working on Saturdays, you get crazy ideas. (David chuckling) Which I have taken the calling Saturday Samsung. (Alex chuckling) So Samsung's Copilot PC, this is a real thing. So if you buy the new Galaxy Book4 Edge, by the way, there's no space between Book and 4, but a space between 4 and Edge. (Alex chuckling) All right, marketing- - Do you realize that the name of that is the Samsung Galaxy Book4 Edge Copilot+ PC? - Yeah. - That makes me wanna throw things. - I'm saying you had the extra day on Saturday, you coulda gotten rid of a couple words. (David laughing) (Alex laughing) All right, but the people at Samsung, in their quest to inject a sense of crisis into the company, have decided that their single best idea is to just give away TVs. (laughs) - Yeah. - So the previous one of these we covered, the previous iteration of Saturday Samsung was that if you bought a Frame TV, you got another TV, which is perfect. If you buy a Galaxy Book4 Edge, again, there's no space between Book and 4, but a space between 4 and Edge, a Galaxy Book4 Edge Copilot+ PC, you do receive 50-inch Crystal UHD 4K TV. - (chuckles) Sick. - That's just the plan. I don't know what to say. - What's the MSRP on that? - It's $379, they're just throwing you a $380 TV. I'm sure it looks like absolute trash. I'm sure it's the same panel as a Frame TV. - I was gonna say - Just a single LED backlight just shining gray in the dark. But I just love that Samsung, they've got all the executives are there on Saturday. Just how are we gonna, it's a crisis, you guys, how are we gonna, how are we gonna bring the stock price back up? And they're like, \"Here's what we're gonna do. Everybody gets a 50-inch TV (chuckles). (Alex chuckling) - Well, you know that before that, somebody was like, \"What if we made them cheaper?\" Someone was like, \"No, no, no, no, no.\" - No, no, just get rid of 'em. - We're gonna go more, we're gonna go the other way, but you also get a television. - We're gonna find the $380 of margin in every other product and you know what everybody loves? Is a free garbage 50-inch TV. (laughs) If you buy a TV, you get another TV. You buy Chromebook, you get a TV. You buy our brand new state-of-the-art Copilot+ Laptop, free TV. That'll do it. So you're considering a Surface? Does a Surface come with a free TV? (David chuckling) This, it's great. I cannot, this year of Saturdays is gonna be amazing. Okay, sorry, I just, literally, I said to David and Alex before we started the show, the only thing I wanted to talk about was Saturday Samsung and we forgot. It's my fault. - Just excited. - I could keep going another hour on Saturday Samsung. All right, we should talk about OpenAI, who I would say did not have as successful of a week in AI as Microsoft. (Alex chuckling) That's fair. Right? I think that's fair. - Even Microsoft big partner, Sam Altman was on stage at Build. But I would characterize OpenAI's week as definite. - Yeah, a own goal was the phrase I heard used a lot. And it really is like a record week for don't tweet as advice to give on the internet. (group chuckling) Really one of the all-time what if you just didn't tweet moments from Sam Altman this week? - All right, let's run through it. It's not a complicated story. It is getting more and more complicated as more people talk, which is bad. That is a bad sign. If a seemingly simple story starts to get more and more complicated, lawyers are gonna get money. I will remind you what my contracts professor in law school used to say, Stewart Macaulay, why did this case get filed? And we'd all say some idealistic, first-year law school bullshit. And he would say, \"No, the lawyers wanted a BMW.\" A lot of lawyers are getting BMWs at the end of this rainbow. - Yeah. - Scarlett Johansson's lawyer is gonna be driving a really nice car- - He already bought. He's like, I'm good. - He bought it from Disney. - Yeah, he like pre-purchased the BMW. - He's getting a Rivian this time. - He's like, \"Just put a standing tab at the BMW dealership.\" (Alex chuckling) Just whatever M is coming out next, just gimme one of those. Although I've heard the XM is not great. Anyway. Okay, so here's the basic rundown. They announced GPT-4o, which in classic- I think it's broken, I don't believe you- appears to hallucinate more than GPT-4. Great, but the headline feature of 4.0 is it's multimodal. O is for omni. It can look at stuff. It can talk to you. You can talk to it. And it has these, because it's multimodal, a lot of the demos are people chatting to it. And then OpenAI had these voices, they already had them. One of them was called Sky, which was a woman. But because of these demos, which were very voice-heavy and very personality-driven, because that's the other big feature of 4o, a lot of people noticed that the Sky voice sounded a lot like Scarlett Johansson and that Sky in particular made a lot of people feel flirtatious. - Mm. - Right, Alex? I would say that's like- - I think that's an accurate assessment of things. People got a little horny for for Sky there. - Yeah, a lot of people thought they could bang an iPad last week. - Yeah, it was uncomfortable for everyone. - That's just, I mean, I don't know how else to characterize the way people feel about AI right now, except an awful lot of people wanna bang an iPad. It's fine, you know? It's like some people wanna give all their privacy away to a cloud. Other people, they have a particular dream. Okay, that's fine. - That was the other dream Satya Nadella was talking about. - (laughing) That's dream number two. - Yeah. (chuckles) - What if you could tag an iPad? (David chuckling) (Alex chuckling) All right, so there's a lot of conversation about this voice, whether it sounds like Scarlett Johansson or not. And there's like a reasonable debate. Some people are like absolutely not. Some people are like it does. People have asked OpenAI executives very directly. Our own Kylie Robison asked Mira Murati directly and she said, \"No, it was not our intention. No thought of this whatsoever.\" And then Sam Altman tweets the word \"Her,\" which is the movie from Spike Jonze that stars Scarlett Johansson. - Which he says is one of his favorite movies of all time in an inspiration. - Yeah, great, so now he's undone his poor executive who was saying this was not the point. And then a very strange thing happens. OpenAI sort of out of nowhere publishes a blog post that's like, \"Here's how we selected our voices.\" That's a weird time to do it. And it's just a very anodyne corporate blog post. It's like we had a process. We did casting directors, blah, blah, blah, blah. Then they had our Miya David, our AI reporter, Miya David, talk to one of their executives to go through it. They would not say that, no, they pulled it first. - They pulled it before they explained it. - Yeah, okay, so it's like a very normal corporate, anodyne blog post, then they pull the voice, like almost immediately after that. They pull the voice. - Sky. - Sky, and say, \"Based on concerns we've heard, we're pulling this voice. Which is interesting 'cause there's only one person's concern that matters. And she is a very powerful actress in Hollywood who is married to the head writer of \"Saturday Night Live,\" right? (chuckles) - So can I just pause you on that moment? I'm curious if you guys had the same reaction that I did in that moment, which is obviously Scarlett Johansson is mad. - Yep. - Yeah. - I just couldn't think of any other, 'cause this happened on Sunday night or like overnight into Monday morning. I could not imagine a world in which they pulled this voice and put up this long blog post, which essentially amounted to one of those like my, we didn't copy Scarlett Johansson T-shirt is raising a lot of questions answered by my we didn't copy Scarlett Johansson T-shirt. One of those moments. And we were covering this thing like, okay, they say they're just trying to allay confusion. Like I couldn't think of another plausible reason other than Scarlett is yelling - Yes. - Right? Like, was that your reaction to- - That's the only thing could be happening here. - Yeah. Okay. - Then they called me and David, one of our reporters. And so we have an interview with our executive. They would not tell Miya the timeline. The only question is, did Scarlett call you and then you pulled the voice? - Right. - Legitimately the only question here. And they're like, \"We heard these concerns. We wanted to get at it. We pulled the voice\" and they just like wouldn't say the timeline, weird. So we run the story, they sit, here's a headline. Our headline is like pretty anodyne, right? It's also just like more Ope AI talking. We pulled this voice out of concerns. Here's some more color on that, except they won't say what the timeline is. Hours later, Scarlett Johansson has a statement out, first to Bobby Allyn at NPR and then widely to everyone. It says basically like, \"Sam Altman called me to be the voice of ChatGPT and I said no and then, you know, several weeks later I'm listening to these demos and it sounds like my voice. I lawyered up and I wanna know exactly how this happened.\" - Well, he called her like two days before the launch. Like he called her initially, her timeline that she outlines is like, they chatted a while ago about it and she thought about it and then she said, \"No, I don't wanna do the voice.\" And he's like, \"Cool.\" Didn't hear from him for a while. Two days before the demo, Sam Altman calls her and is like, \"Hey, you reconsidered?\" And she's like, \"No, I don't wanna do it.\" And he's like, \"Cool.\" - And then she hears a voice that sounds like her. - Yep. - Right. That was a perfect Sam Altman impression, by the way, Alex. Like I know you were working on that for a while. It was really good. - Thank you. - It sounded like it was an all lowercase. (David laughing) (Alex laughing) Then there's just one last piece of reporting from Nitasha Tiku, another former Verge reporter at the Washington Post. She has talked to the agent of the voice actress that OpenAI cast for the Sky voice. Both the actress and the agent wished to remain anonymous. I have a lot of feelings about that, but they wished to remain anonymous. And she's seen some documents that lay out a version of the timeline that says opening actually recorded all this and never said to this actress, sound like Scarlett Johansson. So maybe there's some blurriness here. There's some old case law in the mix here. You know, we did a story where we talked to some lawyers. There's a very famous case with Tom Waits who has a very distinctive voice. By the way, Heath Ledger was basically doing Tom Waits impression in the \"Dark Knight,\" (chuckles) which is very funny, but that's the voice. Like if you think about Heath Ledger in the \"Dark Knight,\" like Tom Waits has this very distinctive voice. There's a very famous commercial where they asked the singer to sound like Tom Waits. Tom Waits sued, won. There are other cases like this where people's likeness get used without their permission? My favorite one of this is a Vanna White v. Samsung. Maybe the best of these cases that exists. Samsung ran a commercial that looked like \"Wheel of Fortune\" where a robot was turning the letters and Vanna White said, \"That robot is me\" (Alex laughing) and won. - Wow. - Yeah. She felt like a monopoly. - It's very good. - It is, of all of the cases I ever read in law school, I was like, \"This is why I came here.\" Vanna White v. Samsung Electronics. (chuckles) So there's like a lot of these weird cases, like you are not allowed to trade, in particular, in New York and California, which is where most of the celebrities are. The state law does not allow you to trade on the likeness of celebrities to sell your products. That's just a thing. We have not gotten to, we cloned a voice using another actress and everyone got confused. That's new, that's a new problem for our court system that I'm very much looking forward to seeing litigated, but we're in this place where we've expanded the boundary of what you can take. Right, and the AI companies are really just taking a lot of stuff without asking for a lot of permission. And I think this one with Scarlett Johansson and Sam Altman and this completely insane timeline that is getting complicated the more anyone talks is, I think, really, you know, we talked about it in the earlier segment, people have really, really, like, antagonistic feelings towards AI, because it feels like it's taking stuff from us. And a famous actress who was in a bunch of Marvel movies, she's not the right adversary for OpenAI. - Who sued Disney. - Who sued Disney, right? Like I don't know, man, - That's not the person you wanna like mess with. Yeah, I was just kind of gobsmacked by this, because, you know, I think, like Lake Bell plays, does a really good Scarlett Johansson impression on an animated show where she's playing Black Widow. And she sounds a lot like her. It's great. But also she's playing Black Widow and there's a whole, there's agreements in place, and that's why it's allowed. This is she, this person sounded a lot like Scarlett Johansson and then Sam Altman tweeted \"Her\" clearly referencing this. He's talked about how much affection he has for that voice, for that concept. It's just like, oh, you really just kept walking into rakes on this one, dude. Like just stop, stand still for a moment, because, yeah, they probably did hire this woman and she probably didn't know that she sounded a lot like Scarlett Johansson or that that's why they hired her, right, like. - There are so many weird twists and turns of all of this, right? 'Cause then there's the question of was this voice made to sound like Samantha from \"Her\" or does it sound like Scarlett Johansson? And is there a distinction between those two things? And is that meaningful? And how much do people associate the voice of Samantha and the role of Samantha with Scarlett Johansson? That's just like, all of this is unprecedented in such bizarre ways. But the thing that keeps jumping out to me is that the immediate response was that of course OpenAI is wrong, because of course OpenAI would have just gone and ingested the movie and used that. I mean, we've seen the technology now that you can use five minutes of somebody's voice and spit out a pretty passable version of that voice. Like just the immediate assumption that that's what OpenAI did was either find a person and tell them to do a Scarlett Johansson impression or screw all that. Just train your model on Samantha in \"Her\" and call it a day. That like this company has so aggressively lost the benefit of the doubt. It made me think of the iPad \"Crush!\" commercial in the same way. That it's just like, this is a company that people do not trust and people think the worst of now and believe that their intentions are bad. And I think the thing with the OpenAI thing is, I think the answer is probably some weird middle sketchy thing. And it seems like the OpenAI version of the story is that OpenAI ran a pretty normal process and then Sam Altman, who is the CEO of OpenAI, just like weird went rogue and started calling Scarlett Johansson. And now there are all these things out there about how Sam just desperately wants to be famous and it's making him make mistakes. And like we've gone in all of these weird directions. - Wait, hold on, can I just say I it when companies pretend their CEOs are idiots. (Alex chuckles) I hate it. - Totally fair. - Sam Altman is a billionaire. He is the founder of OpenAI. He is so much in charge of OpenAI that when the board of OpenAI fired him for being reckless and manipulative, the employees all staged a reverse coup and brought him back. - That's real. - And it's like, yeah, that's a real thing that happened just a little bit ago. - Couple months ago. - Was that the board of directors was like, \"We don't trust Sam Altman\" and fired him and he got his way back in the company. He has a new board of directors and now a bunch of employees are quitting, 'cause OpenAI is generally abandoning its like safety culture and he's doing this reckless stuff and I just don't buy it that the company is like, \"Yeah, we are running responsibly. There's just this hot head that we reverse couped back into the CEO role that we can't control, like- - You can't, like it's just a full like lie on their part to be like, \"We have no control over him.\" It's like, well, he runs the company, so like- - I agree with that and yet I also find it absolutely plausible that the billionaire CEO who is kind of feeling himself would call Scarlett Johansson on the side- - Oh, I think that's totally true. - If I had a billion dollars and I was like, my robot can plausibly make Kevin Roose think that it's in love with him, like I would call Scarlett Johansson. - Yeah, and you don't tell these people- - I would just see what would happen. - You don't tell these people who are doing the casting process who then you are happy to throw to the wolves after the fact. But like the bones of that version of the story do not seem implausible to me at all. But it also doesn't matter. He's the CEO of the company. It doesn't matter. - Right, the part where they ultimately shipped the voice that sounded like her in every sense of that word, and he knew about it, and those were the demos, and I'm confident that he watched every second of those demos, and then tweeted in the word \"Her,\" those are his choices. - Yeah, he tweeted the word \"Her.\" Like it's so hard to undo that fact. - By the way, your question about whether it's the movie \"Her\" or Scarlett Johansson, I will offer you the 1995 case Metro-Goldwyn-Mayer v. American Honda Company where Honda made an ad for the Civic Del Soul that looked a little bit too much like a James Bond movie and lost to MGM. - Yes. - Really? - It was not James Bond. - They made too good a commercial? - It was a guy in a suit jumping out the, you know, I don't remember the Civic Del Sol. That's (chuckles) not a high watermark in Civic design, but it was a Civic with a top that you could like take off. And so the ad was like, he's driving, a James Bond-like character is driving a Honda Civic, very plausible, and he blows the top off and jumps outta the car and does some James Bond stuff. And MGM said, \"That that is James Bond. You made James Bond.\" - Wow. - \"You can't have it,\" and they won. - Yes. That's so dumb. - I'm excited for us to go to court against OpenAI and say, you are a robot. The precedent by which we are suing you is MGM versus American, have you seen the Civic Del Sol, Judge? (David chuckling) (Alex chuckling) MGM, by the way, also now owned by Amazon. Just one of those things. Just a weird moment in time, because again, most of these cases took place in New York and California ages ago. Most of them are about pretty normal ads, right? Like that's why you appropriate a celebrity's likeness to try to sell something. Those days are over. Like TikTok is full of weird, deep fake celebrities and just like pure copyright infringement. The number of companies, right now if you run a regular company and you wanna buy a regular ad and you're like, I'd like to use Taylor Swift to sell my towels. You can't, but that's too expensive. If you're a super shady distributor of Alibaba towels and you're on TikTok, it's all Taylor Swift all day long. - Deep fakes baby. - It's crazy, and like there's a gap here that's happening where the law has absolutely not caught up to reality, 'cause most of these cases are about big ad agencies and big companies with big budgets running ads, right? I don't know that, we're just in for a moment of chaos, because the reality of what's happening on the ground is people do not care about the law, particularly IP law, and the big companies, Google, OpenAI, they are, the next generation of their technology is just founded on taking stuff, which is why OpenAI does not have the benefit of the doubt. Everyone believes they took whatever they want. And if they wanted to, they would just make a clone of Scarlett Johansson voice. Whether or not they cast an actress who sounded just like her, it doesn't matter, because the technology exists for them to just do it and no one thinks they have the control to not do it, weird. - Yeah. - A weird moment for them. - Yeah, and at least from what I've heard so far the last couple of days, I'm curious if y'all have heard anything different, is that there's no indication so far that Scarlett Johansson is actually going to like take real legal action here. She put out that one statement and we don't know what's gonna happen next. But that if she did, this would have a real chance of going somewhere and being pretty important and precedent-setting in terms of like, it just feels like in so many ways we're itching for like the one weird AI lawsuit and like maybe it's the New York Times one, but it would be frankly a lot like wilder and weirder and more fun if it was Scarlett Johansson. (chuckles) - Well, I think they're probably kinda different cases. Like they're targeting different things, but they get to the same thrust of things, which is can you just take shit? - Yeah, like what are you allowed to do in the name of AI? - Ultimately it's can you just do stuff? (David chuckles) - Yeah. - Right. I mean, like, if I do it with a computer, it's fine, right? It's like that's the answer. And there, look, there are very meaningful differences between what you can do with a computer And what you can do in real life. Like for example, Alex, if I came to your house and took one of your Blu-rays away, that would be a crime. For many reasons, one, just a crime against our friendship, you know? - Right, I'd be very upset. - But importantly, you would not have the Blu-ray anymore. Whereas if I came to your house and copied a file off your Plex server and left, I think you'd be like, one, our friendship has strengthened. - Yeah. - And (chuckles) you would also have the original copy, your very legal copy of whatever content. - I would have the Blu-ray still in my closet. Yes. That's correct. - This is like a meaningful thing in copyright law. Whereas, you know, it's all founded on physical scarcity. It has not translated to the world of like digital very well. On the other hand, I can just do whatever I want, 'cause its a computer is not a workable strategy either. - Right. - You know, like, there's some middle ground here that no one has ever really thought through and I think that AI conversations, you know, this is a conversation I had with Sundar, like, \"Do you feel great about OpenAI training on YouTube?\" Okay, the web doesn't feel that way about you. And he was like, that's weird. You know, like everyone has to wrestle with those two ideas at the same time while we're saying, hey, some of this technology is like really cool. Like you want some of this technology. Some of this stuff is really great for people who are differently abled, right? Like how are we gonna solve these problems? And, Alex, I think you're definitely right that like the training lawsuit is a copyright lawsuit. And this other stuff is like a likeness lawsuit, a right of publicity lawsuit. There are different bodies of law that are very hard to distinguish for normal people. Normal people can't tell you the difference between a copyright and a trademark and a patent, right? Like this is even more esoteric than that. And on top of it, sort of the inherent nature of it is that these are celebrities. Like you don't have a right of publicity. You don't have publicity. (chuckles) Right? And like all of the law is built around celebrity. And so you're just gonna get a sequence of people, of plaintiffs who are just the most sympathetic because they are gonna be celebrities. - Yep. - And at some point, you know, like we did an episode, Sarah, John and I did an episode of \"Decoder\" where we talked about the copyright law. And like that feels like a time bomb waiting to go off. Something's gonna happen with copyright law and training data. It is inevitable that one of those cases goes the wrong way, 'cause there's so many of them now. It feels inevitable that particularly, these companies wanna trade on famous voices, even if it's not this case. I don't know, man, like Kevin Hart is gonna be like, That sounds too much like me\" and just like sue Amazon. Like it's like one of those kinds of things is gonna happen. - I mean, it's the music thing, right? Like it's all of the, like copyright trolls coming after anyone who writes a song with power chords in guitars now. Like we're gonna do that again at a crazy scale. - I feel it's a little almost simpler than that because it's kind of straightforward that if Amazon had gone and released an Alexa voice that was Kevin Hart and it wasn't actually Kevin Hart, he would've sued, but Amazon went and said, \"Hey, Kevin Hart,\" or Samuel L. Jackson or whoever, \"Do you wanna be a voice?\" No. - But they have done that. - Do you wanna receive a bunch of money? - Samuel L. Jackson is a voice on Alexa. - Yeah, no, yeah. They paid him. And so like I think in this case, there's a lot of precedent of like everybody else knew how to do this business and OpenAI was like, YOLO. - Yeah, by the way, I don't know what's wrong with me that I had to immediately think of a, that I had to quickly think of a very distinctive voice and my mind went immediately to Kevin Hart. - I wasn't gonna comment on it, but- - That's just what I had- - I was gonna comment on it to you later in Slack. - It's a very distinctive voice. I just don't, I just don't know. - I often think of you as the Kevin Hart of the \"Vergecast\" so that.... - It's time to take a break, David. (Alex laughing) (David chuckling) (Nilay chuckling) And we'll see if you're back when we come back for the lightning round. (chuckles) Weird time, it's kinda broken and I dunno if I believe you. We'll be right back. (chuckles) (drum beating) (piano music) (notifications ringing) All right, we're back. It's time for the Lightning round, sponsored by Kevin Hart. (David laughing) (Alex laughing) Kevin, if you're listening, you can send your lawyers at us and we'll just ask you to sponsor the lightning round. That would be great content actually. I'm confident you can afford it, Kevin. Two people on totally different planets, me and Kevin Hart's lawyer. (David laughing) (Alex laughing) Sir, you've lying about Kevin Hart sponsoring your podcast. Me saying, \"Would you like to?\" - (chuckles) Let's make it true. (group laughing) These lies can be real between me and you. (Alex chuckling) - It's beautiful. - Dreams do come true. All right. Lightning round. We gotta start with this one. It's maybe the most important lightning round item. The United States government, the Department of Justice has sued Ticketmaster, Live Nation, which owns Ticketmaster. They wanna break it up. This has been a long time coming, I would say. This is Taylor Swift's lawsuit and feels fully like Taylor Swift's lawsuit. - Yeah. - Yeah. - Yeah. - It really is. And this has been, I think, kind of in the wind ever since the merger happened. I mean, in 2010, right? Was when the merger was, and even then, if I remember right, there was real, this should not be allowed energy. - Oh, this was fully, if you wanna ever make the case that Barack Obama was kinda like a bad president, his competition policy where he just like let this stuff slide, like his DOJ and his FTC just let this stuff slide all over the place. Like full Reagan. Like this is the core of that argument. Like when people make it like, Obama presided over the great recession and all this other stuff in the recovery, part of it was we are just gonna let these mergers slide to bring the economy back and now we're on the other side of it. You can also blame Ronald Reagan. I prefer to blame Ronald Reagan. We made an entire \"Decoder\" video blaming Ronald Reagan for Ticketmaster. You can watch that video. But basically the heart of the argument is Ticketmaster, Live Nation owns ticket sales, obviously promotion, artist management. They own all the venues. They own 60 of the top 100 venues in the United States. And so you just have this vertically integrated monopoly. And if an artist tries to screw with it, Ticketmaster crushes them, which means prices go up, 'cause there's no competition. - It's actually, in a very funny way, it is sort of perfect textbook monopoly stuff. Like the allegations are so simple to understand. I actually encourage people to go read the lawsuit because it really is like, if you wanna understand what a monopoly looks like, it is what these allegations say Live Nation and Ticketmaster does, which is own everything and just use that to beat the hell out of anybody who tries to own anything and come at you. And like the threats that they are alleged to make against artists and venues who don't work with them, the ways that they like raise fees to keep everybody out and like self-deal to each other. Like it is pure monopoly stuff if all of these allegations are true. - And at the end of it, at the very bottom of it, prices are high, but service quality is low, right? Like they don't have to invest in the ticketing platform or the app or the website because who cares, right? - Which is why Ticketmaster broke. - Yeah, which is why there's a crush of demand for Taylor Swift tickets even after she told them there will be a crush of demand, can you handle it? And it still crashed and they didn't have to do anything, 'cause there's, where are you gonna go, Taylor? - Right. - And I think once the United States Government is like, where are you gonna go, Taylor? She doesn't have choices? (David laughing) (Alex laughing) - If Taylor Swift doesn't have options, there's a monopoly happening here. - Yeah, then maybe we'll do something. But anyway, you can go read the lawsuit and like I said, we'll drop the link. We made a long \"Decoder\" about the whole buildup of this with a lot of great interviews in this. One of our, one of it was a, it was a pi, you know, we do two episodes now. It was a pilot of our \"Explainer\" episode. So it was a fun one. All right, that was my, we gotta say that one. Alex, what's your lightning around? - Salt Spoon. (Nilay chuckling) (David chuckling) - Totally different move. - Sorry. What? - Totally different. I actually have two. And I feel this one is almost more important that's not true. - Salt Spoon is the new \"Mad Max\" movie, right? - Yeah. - That's what that's called? - Okay. - It's exactly what it's called. But I know we, we've talked before on the \"Vergecast\" about how you can like use electricity to make people taste things a little differently. Andrew Marino did a really good \"Vergecast\" on it. Somebody else was like, \"What if we put those electrodes into a spoon and so we could take things that aren't salty and make them more salty? And as someone who grew up low sodium because of their mom, hell, yes. (David chuckling) - Yeah. - I am so excited for this. I didn't know what salt tasted like until I was like 16. Like this is incredible. I'm so excited. But they're only selling like 200 of 'em. And it doesn't work If you have like heart problems, which if you, most people on low sodium diets, that's why they're on them. It doesn't work if you're like pregnant. So a lot of the people who might wanna be on low sodium diets, this won't actually work for, but it's a Salt Spoon and that's cool. - Yeah, when I read this, I thought it was a spoon that just dumps salt. (Alex mimics salt shaking) - No, I've got one of those in my kitchen right now. - That's just called a spoon. - Yeah, no, but that's just a real CES local news gadget, you know? - Yeah. - Like, here's a spoon that precisely delivers the right, no, this one just shocks you into believing there's salt. A different approach. - I love that for them, and it's from the people who do like soy sauce, it's Keiran. - Oh, nice. - So they know salt. - They should make a sriracha spoon. - Oh my God. - They should just continue electrocuting my brain into flavor. (David chuckling) (Alex chuckling) - Just trick my brain constantly, please. - Yeah. All right, David, what you got? - We have to talk about Humane, right? - Oh gosh. - Everyone's favorite startup. - There was a Bloomberg report this week that Humane is now looking for a buyer and I believe the price it's looking for is somewhere between 750 million and a billion dollars. Also was in that story that the company has raised $230 million. - So it wants a four X valuation? - Yeah. - At the top end. Okay. - And I would remind you that it is, it's that Humane. It's the one we've talked about. It's not a different, like B2B Humane that is very successful. Truly bold strategy to come out and say, I'm not surprised this company's looking for a buyer, right? Like I think the thing you hope for with your first product is that it gets you money to get to the second product and then the second product is the one where you start to win and that's where you go. Like that's the strategy, but if you flop on the first one, and holy God, does it look like they flopped on the first one, it's very hard to get out of that. So I'm not shocked that Humane is looking for a way out. I think A, it's going to have a lot of trouble finding a buyer because this company is not full of people who are like beloved in the tech industry, I would say. And- - At the top. - Yeah, at the top. Like Imran Chaudhri in particular, I would say, left Apple not beloved by people still at Apple. That's about as much as I can report on that, but that I feel pretty good saying that. The rest of it is just, it is truly wild for this company to come out and say, we think we should get 4 X what we've raised and everyone who works here should get rich because of this terrible product that we've made. - Okay, so two things. One, it's probably broken and I don't believe you. (David chuckling) (Alex chuckling) Real theme, I'm just telling you. - Well, that one's definitely broken. - Yeah. - We know that. - It's super broken and I don't believe you, like, I'm just saying, we caught a lot of heat for being mean at the TED Talk. Here we are. Second, let's go through the list, right? So Apple is out. They're not gonna pay them the money. And I concur with your reporting and that is also about as much as I can say. - Yeah. - But like if you're out in the mix, it's just out there. That's just information. Apple's not gonna buy this company, especially 'cause their entire pitch was, we're gonna obsolete the iPhone. - Right. - Doesn't seem like the sort of thing Apple's gonna invest in. - No. - Apple has the Apple Watch. They're gonna be fine. They have Siri, which is a little shakier, but they got the Apple Watch. (chuckles) Google, no, right? That feels like a no. They're still struggling to integrate Fitbit and they don't need a laser projector. - More hardware, both like more hardware chops and more hardware issues than it can deal with already. - Google, for example, I'll just say this, they just merged Android, and the Pixel team under Rick Osterloh, who formerly ran the Pixel team and all of hardware. And now he runs all the platforms too. So Rick has to like keep Samsung happy, right? Like he now manages the whole ecosystem, which is really interesting, right? But can you, and he's gotta figure out the rest of Fitbit, which is still messy from what I understand from V. You can't just like throw a bunch of X Apple designers you thought they were gonna (chuckles) running not your AI platform. - Right, and a big part of what Humane, I suspect, is trying to sell is the operating system, right? Like they've always said, \"We are not just about the Ai Pin. Like they wanna be a platform. And this is a pitch you hear from everybody. But I suspect if you're gonna pay anything like the price that they want, you think you're buying what has the potential to be a winning platform. Not a bunch of hardware engineers. Like Google doesn't actually need more hardware engineers at this moment in time. - Is it not just them trying to be like, everybody's really hot for AI right now. We shipped an AI thing, buy our AI thing. - But their AI thing is OpenAI. - Yeah, but Samsung's got Saturdays. (Nilay chuckling) - If they wanted to do that, they should've sold four months ago, right? Like if you're just trying to capitalize, you sell before you ship and not after. - Well, unless you're greedy and you think you actually like. - Or they thought they were gonna win. - Yeah, they thought they were gonna win. - Which is fine. Companies are allowed to work harder. Like there's, how do I put this? There's no lack of sincerity in the Humane ecosystem, right? Like there might be some confusion, some delusion, but not- - But they're not kidding. - Not insincere, right? Yeah. - Right. - Okay. Google's out, right? I think Google's out just 'cause the stuff runs on OpenAI's stack and Google doesn't run that and they don't need more complication. Google, if anything, is trying to streamline, right? Microsoft's interesting, Microsoft runs a bunch of OpenAI stuff. They don't have mobile, right? There's lots of rumors. I think Satya Nadella is smarter than this. That's frankly just my belief there. I don't think he's like, yeah, we'll take a flyer in this nonsense. They're winning, he's like, \"I'm gonna take on the MacBook Air.\" - Yeah. - Yeah. - I would put, of all the possibles, Microsoft at the top. I just think Nadella is smarter than this distraction. Samsung loves bad unfocused ideas. - Yeah. (David chuckling) - They're in the mix. Love goofy hardware. A bunch of executives sitting around on Saturdays with nothing to do except do MA deals. - They're gonna see that story on Saturday and be like, got it. - Can you imagine the Humane team just being given Ballie? - Yeah, right, Ballie. - Go figure out Ballie. - Yeah, just this, now the laser projector rolls around. (David chuckling) (Alex chuckling) Huh? Is that something? (laughing) - I could actually see it. And Samsung, like SmartThings, is always an interesting version of that. Samsung actually is... - The Humane running SmartThings is like a pure nightmare. Just a pure absolute nightmare. - Yeah, agreed, but Samsung has a history of actually following through on pretty big acquisitions in a way that I think could be interesting. I suspect the Humane team would not be psyched about working for Samsung. - I don't think- - But that is maybe the funniest possible outcome. - Like they don't get laid off- - I'm just stuck on Samsung has a history of following through. Have you used SmartThings, sir? - It's still there. - That's true. It's there. - It's around. - I would say for as much as I talk about the Frame TV, the people who run the services are the Boxy people, 'cause Samsung bought them a while back. - Oh yeah. Oh, Boxy. RIP - RIP. - I'm not saying this is great. (laughing) I'm just saying it's true that Samsung buys things and then the people continue working there. - Yeah. - All right, LG I think is the same, right? If LG gets with- - But they're not doing Saturdays. - Right, but, yeah, Samsung's ahead, 'cause they're in the office on Saturday. But if LG gets a whiff that Samsung might do it, LG might buy it. LG famously bought webOS. So a history of betting on doomed platforms and then turning them into television operating systems. You could see the Humane. - Cosmos. - What if your TV had a laser projector in it that projected under your hand? (chuckling) (Alex chuckling) Pretty good, Amazon feels like a hard no, right? - Yeah. - That company is bringing, it's like getting smaller, not bigger. Panos is running all of hardware now. - Yeah. Oh yeah, yeah, Panos is there. - Yeah, Panos is there. - Panos Panay is now in charge of Amazon devices and services. - He's not gonna go and be like, \"Yeah, let's buy that and integrate that into Amazon's tech stack.\" - If your question was which of these companies is most likely to ship something that resembles the Ai Pin in the next three years, I think it might be Amazon. - I would agree. - But I don't think Amazon would get to that point by acquiring Humane. - No, my question is, who will spend a billion dollars on Humane? - The answer to that is like Steve Mnuchin or something, like it's some weird- - Truth social now runs the AI. - Exactly. - But I'm just saying my list is Samsung, LG if they get a whiff of Saturday Samsung and then like distant 5000th place, third, Microsoft. - Yeah. - I think that's probably right. - Who else has a billion dollars, Costco, Walmart. I'm just thinking about like the people that work at Oracle. Who thought about buying TikTok but would buy Humane instead? - It'll end up being like Verizon or Comcast who's just like really excited about a new, they're gonna be like, this is your TV remote. - Yeah, yeah. - On your Lapel. And everybody's gonna be like, no, thank you. - The idea of the Humane design team bringing that energy to launching like the next Fios Remote. (David laughing) (Alex laughing) - It's beautiful. - It's very good. - That's compelling. - Just like on stage at TED being like, you can turn the volume up and down. - Yeah, I do wanna know though, by the way, if you're listening and you have an idea of a company that either might or should buy Humane, tell us. - Exxon - Vergecast@theverge.com. Call the hotline, 866-VERGE11. I genuinely wanna know, 'cause I bet there is an interesting match or two that we're not thinking of, and I'd love to know what they are. - Ford. - Ford. There you go. (Nilay laughing) Drive your car with your, oh, no, it's gonna be Elon Musk and it's gonna be Grok and it's just gonna be the Grok hardware. - Don't summon that. - Rough, all right. - Grok wuss. - We'll see what happens. And again, it's just a Bloomberg report. Humane itself has not said anything, but I strongly suspect they need to get out the game. I also suspect Rabbit's gonna end up in the same spot very soon. - All right. I gotta do one more. I gotta do one more. - Okay. - Apple, sometimes you get photos on your phone and you're like, that's a terrible photo. You delete it or you're like, ooh, that's too spicy to keep here in case my mom sees my photos and you delete it. And there was an unfortunate bug where those photos just popped back up into people's things, into their phones and Apple said nothing. But they corrected it just with the latest OS update, so you should no longer have reappearing nudes or whatever else. And Apple has said nothing about that too. - Yeah, it's weird to confirm a bug like this by issuing an iOS update and then saying nothing else. - Yeah. - Yeah. - And they were like old. My understanding is it's like not just, oh, a photo you deleted last night. - So people are getting like years old photos, right? - Yeah, so that's, that's terrifying. But at the same time with Recall, I would've loved that. So I don't know where I stand on this, but I do stand on like, yeah, if I delete something, I generally want it deleted. - Do you believe it's deleted, right? - Yeah. - Is it actually gone- - I wanna believe it's deleted. I wanna know where that data goes when I make a choice about it. And I think that's the difference between Recall and this. Like, Recall, you will know where the, theoretically, where the data goes once the security researchers actually figure that out. This we don't know. - Big caveat. (chuckles) - Big caveat. - Yeah, this is weird. I think, you know, we are, part of our job is holding big companies accountable and it is truly irresponsible for Apple to not say why this happened and what they did to fix it. There's a bunch of people on Reddit who love to argue with me on Threads who are like, we figured it out and you're over-hyping this. And it doesn't matter because we didn't cause the bug. We didn't fix the bug. It's great that you have a theory about why it happened. The theory sounded wonderfully plausible. I love it. I don't know what happened. - Right. - There's one party that knows what happened and they should be accountable for their mistake, 'cause this is a big mistake. And it's weird that we give them a pass. Yep, and so, you know, we can't force them to, all we can do is send emails. (chuckles) That's the, Sheriff Nilay has got Mimestream and he pushes that button every day. - [David] Yep. - That's all we can do. And we just can tell you they have not responded to any of our emails or any of our phone calls about this. And I think that's fundamentally irresponsible, 'cause you're playing with people's, like some of the most personal thing that exists. Anyway, hopefully they say something soon and if not, I'll just keep sending emails. What else is there to do? - Yeah. (Alex chuckling) - In my administration, they would go straight to jail, vote Patel. (Alex chuckling) (Nilay chuckling) Last one, I'm actually excited about this. Sonos Ace headphones are out. A shout out to Chris Welch who covers every square inch of the Sonos beat to the point where I think Sonos, like the Sonos Reddit like waits for Chris to come around and then like Sonos itself is just like, oh no, Chris is here. It's great. He scooped the headphones, obviously. They look great. They're like a cross between like the Sony vibe and an AirPods Max vibe. The $450 is expensive. The headline feature is if you're watching TV on a Sonos soundbar, you can push a button and the audio will come to your headphones. I want this to be compelling to me and I just, it's not my use case for these things. - I think that's a really compelling if you are married and you live in a small home and you wanna stay up late playing video games, or you wanna stay up late watching TV. - Yeah, Nilay in his cavernous mansion wouldn't understand. - Yeah, Nilay, your house is just too big to fully appreciate. - But like how often- - Nilay's in his home theater - No, it's not. It's the real-time switching that... I understand that sometimes you wanna watch TV and listen to headphones, I got you. - Yeah. - But the part where you're like, well, I started with the soundbar. (David chuckling) - Because they walk out of the room. They say, \"I'm going to bed.\" And now you're just like, boop. Yeah. - Ah, yeah, I can see it. But that's headline feature. By the way, that feature oddly is iOS only right now, soon coming to Android, weird. Spatial audio, aptX if you have Android as well. No high-res anywhere else. It's Bluetooth everywhere except if you're doing the weird TV thing, probably for battery life. And then obviously this all comes on the heels of the disastrous app launch, which Sonos won't come out and say, but it feels very obvious that they set the timing of the headphone launch, they needed the app for the headphones. And so then the app came out before it was ready. If any other sequence of events occurred to make the app come out before it was ready, I would be shocked. I wish Sonos would just say it. Like Chris talked to Patrick Spence, CEO of Sonos, and he was like, \"Well, the app was just ready.\" And it's like, why don't you just say we put out the app because the headphones are coming out? That would be fine. Or give people a choice. Don't update the app yet. - Right, yeah, ship it as if you buy the headphones, here's the new version of our app. It's going to be rolled out to everybody before long. Like it's not a hard sequence of events to do, but instead Sonos was like, oh, this doesn't have queue management, which is what everyone wants. Let's ship it Anyway. - So I actually, I have no problems with this app. I'm the only person in America who has no problems with this app because we don't use the queue. We use playlists. Our playlists are in Spotify and Apple Music. And so like, whatever. - I just don't use the Sonos app. - Same. - Right, that's what I mean. Like Becky just uses AirPlay - Yeah. - For our Sonos. But it's fine, and it is a little bit faster. I know other people have wild problems. Like Casey Newton is like, \"I can't even set the volume on my speakers anymore.\" (Alex chuckling) - It's really bad if you have a local music collection that you care about a lot too. Which is like, and Chris and I talked about this a couple weeks ago that like, those are the core Sonos people and have been for two decades and Sonos just continues to try to drive them away in very strange ways. - Yeah. - The Headphones look sick though. - 'Cause there's six of 'em. - Yeah, right. This is the classic story. The company is chasing the bigger consumer market where the money is and the growth is. And then you've got these like very passionate users who are like, my entire life is one button in an app from 2004 and we are the people in the red. - Yeah. - Well, you know, like, there's a dynamic there that I'm, as a person who redesigned their website, I'm aware of the people who are mad. - Yeah. - They've released apps before concurrently. They had the two versions of the last Sonos. - No, that was a disaster. - It was horrible, but they had two. - No, that's a, like Sonos- - It's all bad. Sonos is just bad- - Patrick has been on this show a bunch of times. We've talked to him about a lot of things. Everything from spatial audio and like how they designed speakers all the way to like antitrust. Like he's been on the show. They have mismanaged in particular these apps and what the apps do and how the apps work. Like the S1 to S2 transition, disaster. The Sonos like, we're gonna trade in your old speakers and then like we're gonna break the old ones and they undid it, that was bad. Like there's this thing that they're, in particular, not good at. (chuckles) - Which is wild 'cause that's- - They should get better at it. - The magic of Sonos is how it works with all your stuff and it just talks to each other. It's supposed to be super smart and yet the app continues to be kinda dumb. - Yeah, and, again, I have not had, because I don't use some of these features, like, what was it? Timers and alarm clocks are broken in this app? And the idea that I would set my alarm clock using the Sonos app is just what? But like if you are the person who- - But a lot of people do, yeah. - If you're the person who's alarm clock broke, like you are mad. - Yeah. - Yeah. - That's a problem, right? Like you should find a way to be like, okay, these core features, there's some of these core features where people just like build their lives, like alarm clocks, or people build their lives around it. You have to respect it. And like in this case, I think Sonos says they've gotten more and more consumer. They've sort of like gotten away from it and they should just recalibrate that a little bit. That's said, I have like 9,000 Sonos speakers. Like I'm trapped in the ecosystem, like what are you gonna do? (chuckles) (Alex chuckling) It's fine, all right. I think that's it. That's it. David, do you have another one? - Nope, that's it. We're done. - All right. We gotta wrap this thing. - Spotify has a font. - Spotify has a font. - That's all that's I have, that's all the information I have for you. - Yeah, they might, Amazon might make you pay for Alexa once they add AI too. It's like that kinda stuff. - Yeah. - The big thing is that I'm gonna go try to call Scarlett Johansson now (David chuckling) and see if she will voice Verge's AI as revenge. - Do like AI Colin Jost to call her. - Yeah, I will say a friend of mine was like, Google should just take this voice. They should just pay her whatever amount of money she wants now. - Yeah. - If there's like an arms race for celebrity AI voices, that would be very entertaining. All right, that's it. Also my voice is available for cheaper than Scarlett Johansson's. In case you're wondering. It's hard to reproduce- - Is she the most expensive? - Like who do you, is it like, I feel like it's either like Scarlett Johansson or Ryan Reynolds. This is a whole other hour- - It's like James Earl Jones- - Of \"Vergecast\" we could do. - No way - In terms of like... No, James Earl Jones. - James Earl Jones, Mufasa, and Darth Vader- - It's important to everyone that I remind you that Alex Cranz is 66 years old. (Nilay laughing) (Alex laughing) And if you've never heard of any of those words that she just said, don't worry. - They all know who that is. - I mean, aren't there, there's like, hasn't Amazon set the market? I guess, the rates are gone higher, but this is a thing that exists. You can just buy other voices from Amazon, right? - Yep. You can. - All right, send us your notes with who you think the most expensive voice would be. I don't wanna I don't... We'll read your ideas. - Everyone's gonna agree with me, it's- - It's david@theverge.com, everybody- - Yes, please. - All right. That's it. That's the \"Vergecast,\" rock 'n roll. (energetic music) - [David] And that's it for the \"Vergecast\" this week. Hey, we'd love to hear from you. Give us a call at 866-VERGE11. The \"Vergecast\" is a production of The Verge and Vox Media: Podcast Network. Our show is produced by Andrew Marino and Liam James. That's it. We'll see you next week. (lively music)",
    "transcript_keywords": [
        "Scarlett Johansson",
        "Yeah",
        "people",
        "Microsoft",
        "thing",
        "things",
        "Scarlett",
        "Johansson",
        "stuff",
        "call Scarlett Johansson",
        "Samsung",
        "computer",
        "lot",
        "Apple",
        "Sam Altman",
        "Scarlett Johansson Tshirt",
        "voice",
        "Sonos",
        "Saturday Samsung",
        "Scarlett Johansson voice"
    ],
    "transcript_entity_values": [
        "American",
        "Android",
        "the App Store",
        "the Ai Pin",
        "three",
        "Reddit",
        "morning",
        "six-day",
        "Ope AI",
        "last night",
        "Sonos Ace",
        "XM",
        "a record week",
        "Crystal UHD 4",
        "50%",
        "Acer",
        "Two",
        "Fios Remote",
        "Explainer",
        "Spike Jonze",
        "every day",
        "Spotify",
        "379",
        "this week",
        "third",
        "Mimestream",
        "Kennedys",
        "Google Search",
        "Tom",
        "overnight",
        "NPR",
        "Google",
        "Panos Panay",
        "Rabbit",
        "Paint",
        "YouTube",
        "Saturdays",
        "Ryan Broderick",
        "700",
        "it's-",
        "the Department of Justice",
        "weeks",
        "Liam James",
        "Instagram",
        "the United States Government",
        "the Bing API",
        "Racine",
        "Courier",
        "Scarlett",
        "AT&T",
        "Comcast",
        "Ronald Reagan",
        "Windows",
        "AI",
        "45",
        "Samantha",
        "Hours",
        "Ticketmaster, Live Nation",
        "Marvel",
        "Couple months ago",
        "Vergecast",
        "Tuesday",
        "AirPods Max",
        "HP",
        "last week",
        "Lenovo",
        "OpenAI",
        "Plex",
        "one",
        "Sky",
        "the Garbage Day",
        "Alexa",
        "Decoder",
        "Spotify",
        "Rewind",
        "SmartThings",
        "six",
        "API",
        "monthly",
        "the United States",
        "Keiran",
        "Walmart",
        "Amazon",
        "AirPlay - Yeah",
        "Patel",
        "Kevin Roose",
        "American Honda Company",
        "Sony",
        "40",
        "like trillion",
        "Joanna Stern",
        "100",
        "16",
        "three to five years from now",
        "the last couple of days",
        "Sam",
        "Build",
        "Kevin Hart",
        "Andrew Marino",
        "Sunday night",
        "between 4 and Edge",
        "4 X",
        "Air",
        "A MacBook Air",
        "Colin Jost",
        "Metro-Goldwyn-Mayer",
        "4.0",
        "NUVIA",
        "Sundar",
        "first-year",
        "Edge",
        "Saturday Night Live",
        "18",
        "the Engadget days",
        "Galaxy Book4 Edge Copilot+",
        "Rick Osterloh",
        "ASUS",
        "YOLO",
        "John",
        "Civic",
        "GitHub",
        "Obama",
        "380",
        "Taylor Swift's",
        "Microsoft Services",
        "Kylie",
        "Sky",
        "Imran Chaudhri",
        "BMWs",
        "B2B Humane",
        "first",
        "IP",
        "the HP Pavilion",
        "DOJ",
        "Windows",
        "Patrick Spence",
        "Ticketmaster",
        "year or so now",
        "Sheriff Nilay",
        "the next three years",
        "Mischief",
        "AMD",
        "M4",
        "Lightroom",
        "Disney",
        "Frame TV",
        "Stewart Macaulay",
        "Windows on Arm",
        "MGM",
        "Scarlett Johansson T",
        "Nilay Patel's",
        "Fitbit",
        "the Apple Watch",
        "Vanna",
        "Costco",
        "Wi-Fi",
        "Kevin",
        "866-VERGE11",
        "Becky",
        "Panos",
        "the New York Times",
        "James Earl Jones",
        "Apple Music",
        "M3",
        "CES",
        "Papyrus",
        "450",
        "Apple",
        "Humane",
        "Wisconsin",
        "Oracle",
        "Wheel of Fortune",
        "Microsoft Paint",
        "Cranz",
        "Nadella",
        "years",
        "Trump",
        "66 years old",
        "five minutes",
        "IRL",
        "Satya Nadella",
        "DLSS",
        "all day",
        "David",
        "next week",
        "Live Nation",
        "Recall",
        "EliteBook",
        "Max",
        "iPhone",
        "Mia Sato",
        "the MacBook Air",
        "4o",
        "Two days",
        "New York",
        "Windows",
        "Taylor Swift",
        "Scarlett Johansson's",
        "Book and 4",
        "K TV",
        "CPU",
        "four months ago",
        "between 4",
        "the Kevin Hart",
        "Meta",
        "Kin One",
        "Scarlett Johansson",
        "a couple of years ago",
        "iPad Pro",
        "Microsoft Build",
        "One",
        "Alibaba",
        "Sam Altman",
        "Chris Welch",
        "Alex",
        "OmnBook",
        "a million",
        "YouTube",
        "the Wall Street Journal",
        "Mufasa",
        "David Pierce",
        "Second",
        "2010",
        "another hour",
        "TED",
        "Courier",
        "2017",
        "iPad",
        "Samsung",
        "NPU",
        "$230 million",
        "Darth Vader-",
        "Elon Musk",
        "ProBook",
        "megahertz",
        "this year of Saturdays",
        "Tom Waits",
        "the Samsung Galaxy Book4 Edge Copilot+",
        "BMW",
        "Expat",
        "1995",
        "40",
        "Yusuf Mehdi",
        "FTC",
        "Verizon",
        "Podcast Network",
        "Sarah",
        "Saturday",
        "Black Widow",
        "a week",
        "Lake Bell",
        "Congress",
        "Alexa",
        "Nilay",
        "Facebook",
        "the early iPhone days",
        "second",
        "Threads",
        "Intel",
        "Heath Ledger",
        "just a weird week",
        "HoloLens",
        "John Gruber",
        "four",
        "Cinebench",
        "between 750 million",
        "Miya",
        "five years ago",
        "Galaxy Book4 Edge",
        "Unsponsored",
        "60",
        "Hollywood",
        "AGI",
        "the AR Glasses",
        "Barack Obama",
        "38",
        "Miya David",
        "the Republican",
        "Sonos",
        "one second",
        "S1",
        "Rivian",
        "NVIDIA",
        "the week",
        "Slack",
        "Salt Spoon",
        "Azure",
        "Reagan",
        "Bing",
        "Chris",
        "Casey Newton",
        "Rewind",
        "six years ago",
        "the extra day",
        "several weeks later",
        "only two",
        "9,000",
        "50-inch",
        "Alex Cranz",
        "Taylor",
        "TikTok",
        "WWDC",
        "Microsoft",
        "ages ago",
        "Vox Media",
        "Honda",
        "the Civic Del Soul",
        "Ryan Reynolds",
        "MacBook Airs",
        "200",
        "the Apple Watch",
        "Alex chuckles",
        "Charlie and the Chocolate Factory",
        "GPU",
        "United States",
        "Chromebook",
        "Verge",
        "Mexico",
        "the Washington Post",
        "OpenAI",
        "the Magic Keyboard",
        "Bobby Allyn",
        "Qualcomm",
        "Vanna White",
        "Reddit",
        "Kin",
        "2004",
        "Rick",
        "two days",
        "Minecraft",
        "Surface",
        "only one",
        "Dell",
        "Kylie Robison",
        "MacBooks",
        "the MacBook Air",
        "James Bond",
        "LG",
        "a billion dollars",
        "Windows",
        "Sundar Pichai",
        "California",
        "Humane",
        "Kevin Hart's",
        "Verge's AI",
        "Adobe",
        "Humane",
        "ISP",
        "Copilot",
        "Macs",
        "Samuel L. Jackson",
        "Dan Siroker",
        "a couple weeks",
        "Monday",
        "Too Drunk to Fuck",
        "5000th",
        "The Verge",
        "Exxon",
        "AWS",
        "Mac",
        "two decades",
        "Nitasha Tiku",
        "3.5",
        "Steve Mnuchin",
        "- Sam Altman",
        "Snapdragon",
        "Mira Murati",
        "1,200",
        "America",
        "Siri",
        "two",
        "James Earl Jones-",
        "Bloomberg",
        "Google Docs",
        "United States",
        "Samsung Electronics",
        "Those days"
    ],
    "transcript_entity_types": [
        "NORP",
        "ORG",
        "ORG",
        "FAC",
        "CARDINAL",
        "GPE",
        "TIME",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "DATE",
        "GPE",
        "MONEY",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "FAC",
        "PERSON",
        "PERSON",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "EVENT",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "MONEY",
        "PERSON",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "NORP",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "NORP",
        "ORG",
        "LOC",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "GPE",
        "PERSON",
        "PERSON",
        "PERSON",
        "FAC",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "DATE",
        "TIME",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "NORP",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "NORP",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "EVENT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "LAW",
        "PERSON",
        "ORG",
        "CARDINAL",
        "FAC",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "GPE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "FAC",
        "PERSON",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "PERSON",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "LOC",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "MONEY",
        "GPE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.05979170650243759,
        -0.1169620156288147,
        0.016834966838359833,
        -0.057163212448358536,
        0.11010942608118057,
        0.026635760441422462,
        0.005065202713012695,
        -0.006674311589449644,
        0.029662195593118668,
        0.03428474813699722,
        0.037073589861392975,
        -0.0006647218251600862,
        -0.0742247998714447,
        0.0601034015417099,
        0.07189811021089554,
        0.011993749998509884,
        0.12327243387699127,
        -0.10276632755994797,
        -0.07015452533960342,
        0.05078720673918724,
        -0.01954563520848751,
        0.04122551158070564,
        0.04068000987172127,
        0.06431814283132553,
        -0.017011892050504684,
        -0.06986695528030396,
        -0.006255313754081726,
        -0.10112403333187103,
        -0.039794228971004486,
        -0.032979220151901245,
        -0.04610138013958931,
        0.04314626008272171,
        0.057135991752147675,
        0.021676234900951385,
        -0.0031417037826031446,
        -0.07781495898962021,
        0.05699959397315979,
        -0.017521629109978676,
        -0.10036841034889221,
        -0.005973224528133869,
        -0.042917318642139435,
        -0.06201988458633423,
        -0.05420525372028351,
        -0.005616679787635803,
        0.02461763098835945,
        -0.06900202482938766,
        -0.028557222336530685,
        -0.017948582768440247,
        0.030636435374617577,
        0.048843249678611755,
        -0.04220867156982422,
        -0.08402802795171738,
        0.08003850281238556,
        -0.04850257188081741,
        -0.03029584139585495,
        -0.015168174169957638,
        0.046784158796072006,
        0.09539175033569336,
        0.08894719928503036,
        0.003002878511324525,
        0.08605721592903137,
        -0.1296989470720291,
        -0.03801179304718971,
        0.00939344335347414,
        -0.010032450780272484,
        0.04465452954173088,
        -0.011054678820073605,
        0.05108754709362984,
        -0.0225770752876997,
        -0.010206915438175201,
        0.040620315819978714,
        0.005781577434390783,
        0.0022921510972082615,
        0.018198123201727867,
        0.06155049800872803,
        0.12167156487703323,
        0.07921605557203293,
        -0.027622045949101448,
        0.01549236848950386,
        -0.00674356147646904,
        0.014268847182393074,
        -0.021251855418086052,
        0.029013529419898987,
        -0.019172942265868187,
        0.04417550191283226,
        0.03221559152007103,
        0.014112102799117565,
        -0.012616417370736599,
        -0.04270514100790024,
        -0.001981275388970971,
        -0.14600205421447754,
        0.008411248214542866,
        0.044821541756391525,
        0.007579406723380089,
        0.042621154338121414,
        -0.038360923528671265,
        -0.08833777159452438,
        -0.03572019934654236,
        -0.008175876922905445,
        0.03118937835097313,
        -0.04748247191309929,
        -0.021730773150920868,
        -0.03376742824912071,
        -0.042656391859054565,
        -0.053528379648923874,
        -0.09004922956228256,
        0.007093999069184065,
        -0.012195536866784096,
        0.013803844340145588,
        0.051339585334062576,
        -0.0746859535574913,
        0.027055831626057625,
        0.015118727460503578,
        -0.01095048151910305,
        0.06967058032751083,
        0.0490863099694252,
        0.013628259301185608,
        0.03046282008290291,
        0.10247153788805008,
        -0.02246285416185856,
        0.05376483500003815,
        0.02113758586347103,
        -0.05466078221797943,
        -0.014720479026436806,
        0.034280795603990555,
        -0.03785683587193489,
        -0.028784681111574173,
        6.571965571520753e-33,
        -0.0132394814863801,
        0.08547715097665787,
        -0.01870661973953247,
        -0.0004154176567681134,
        0.06687824428081512,
        0.006334774661809206,
        -0.04910339415073395,
        -0.01151528675109148,
        -0.024772999808192253,
        0.018410397693514824,
        -0.07706578075885773,
        0.002316915662959218,
        -0.059532634913921356,
        -0.04934781789779663,
        -0.044596217572689056,
        -0.03963867947459221,
        0.027037523686885834,
        0.07169799506664276,
        -0.0782020166516304,
        -0.015545692294836044,
        0.046388763934373856,
        0.03850243613123894,
        -0.037920430302619934,
        0.008486335165798664,
        -0.02763526514172554,
        0.05563707277178764,
        0.018862193450331688,
        -0.033527906984090805,
        0.1197965145111084,
        0.033031027764081955,
        -0.10148290544748306,
        0.04570915922522545,
        0.03304107114672661,
        0.0035162947606295347,
        -0.02115582302212715,
        0.0424492247402668,
        -0.05743926763534546,
        -0.053338970988988876,
        0.0015537594445049763,
        -0.001564178615808487,
        -0.04469496011734009,
        0.002816911321133375,
        -0.11999427527189255,
        -0.05141935124993324,
        -0.01833707094192505,
        -0.018558479845523834,
        -0.05490466579794884,
        -0.04045592248439789,
        0.0653744488954544,
        0.02038794569671154,
        -0.037941910326480865,
        0.06628616899251938,
        -0.039166271686553955,
        0.024023091420531273,
        0.0685078427195549,
        -0.06995677947998047,
        0.029009265825152397,
        -0.05456356704235077,
        0.06789592653512955,
        -0.037551384419202805,
        0.10202037543058395,
        -0.009526357986032963,
        0.010880549438297749,
        -0.06164616718888283,
        -0.05358939990401268,
        0.018970657140016556,
        0.01933399587869644,
        -0.019217966124415398,
        -0.053776197135448456,
        -0.022557664662599564,
        -0.020875506103038788,
        0.023746982216835022,
        0.01603049598634243,
        0.008128907531499863,
        -0.08056560903787613,
        0.03758727386593819,
        -0.059600070118904114,
        0.057960011065006256,
        0.05395311862230301,
        -0.003353609936311841,
        -0.0220421701669693,
        0.038675457239151,
        0.062476444989442825,
        -0.037504687905311584,
        0.044427353888750076,
        -0.07211572676897049,
        -0.03565298020839691,
        -0.02817744016647339,
        -0.04051630198955536,
        0.10178298503160477,
        -0.049276240170001984,
        0.046644020825624466,
        -0.07849739491939545,
        0.07677209377288818,
        -0.039331018924713135,
        -6.982994803701028e-33,
        -0.0811132863163948,
        0.04407898336648941,
        -0.042615897953510284,
        -0.01573684625327587,
        -0.0429290272295475,
        -0.011155097745358944,
        0.015477338805794716,
        0.047122273594141006,
        0.09181676805019379,
        -0.030084555968642235,
        0.0010092983720824122,
        -0.10853756219148636,
        -0.02808845043182373,
        -0.010837633162736893,
        0.03473246470093727,
        -0.04432510584592819,
        0.06072278693318367,
        -0.056174494326114655,
        0.00879027508199215,
        0.01879379339516163,
        0.03628281503915787,
        0.014565207064151764,
        -0.06162412092089653,
        0.021476702764630318,
        -0.02394689992070198,
        0.029564525932073593,
        0.06063473969697952,
        0.06402002274990082,
        0.017597977072000504,
        -0.050877634435892105,
        -0.044801976531744,
        -0.020130697637796402,
        -0.13629412651062012,
        -0.0027792416512966156,
        0.11320104449987411,
        0.03999461606144905,
        0.03920948877930641,
        0.027475573122501373,
        0.0157596655189991,
        -0.07755350321531296,
        0.02805154211819172,
        -0.016059178858995438,
        -0.01764260232448578,
        -0.042415883392095566,
        -0.0031915020663291216,
        -0.06908372044563293,
        -0.04704033583402634,
        -0.001997813582420349,
        -0.0012630147393792868,
        -0.03030567616224289,
        0.06481701880693436,
        -0.018283294513821602,
        0.12235599011182785,
        0.022855302318930626,
        -0.12360554933547974,
        -0.001462999964132905,
        -0.017744723707437515,
        -0.004706964362412691,
        0.12003938108682632,
        0.04407802224159241,
        0.04747878760099411,
        -0.01934485323727131,
        -0.08732136338949203,
        -0.07567286491394043,
        -0.05104520171880722,
        0.04092658311128616,
        0.052259933203458786,
        -0.025309549644589424,
        0.010071305558085442,
        0.012662104330956936,
        -0.0027962636668235064,
        -0.015165571123361588,
        -0.01916104555130005,
        -0.05126087740063667,
        -0.023691603913903236,
        0.04627402871847153,
        -0.06767020374536514,
        -0.02034929394721985,
        -0.030821308493614197,
        0.010115309618413448,
        0.022114308550953865,
        0.03692276030778885,
        0.04995349049568176,
        0.034015581011772156,
        0.14623448252677917,
        0.04712716490030289,
        0.03167351335287094,
        0.019784633070230484,
        -0.032472316175699234,
        0.029217861592769623,
        -0.058678943663835526,
        -0.013112179934978485,
        -0.07470279932022095,
        0.11053825914859772,
        0.036448124796152115,
        -6.839793798008031e-08,
        -0.0148507384583354,
        -0.06477870047092438,
        0.03837466239929199,
        -0.06787388026714325,
        0.03466380387544632,
        -0.06899108737707138,
        -0.013109023682773113,
        -0.013274687342345715,
        -0.00031346658943220973,
        0.05129823833703995,
        0.03324593976140022,
        -0.03950780630111694,
        -0.06316882371902466,
        0.004416579846292734,
        0.047274231910705566,
        -0.008436824195086956,
        -0.016832074150443077,
        0.044105514883995056,
        -0.002518857829272747,
        -0.0704522505402565,
        0.020653579384088516,
        0.04261357709765434,
        0.10748523473739624,
        -0.0556860975921154,
        -0.01103610172867775,
        -0.017998745664954185,
        0.00917875487357378,
        0.08167354762554169,
        -0.01571621187031269,
        -0.017177917063236237,
        -0.05727842077612877,
        0.04306908696889877,
        -0.03603724390268326,
        -0.016801059246063232,
        -0.10157028585672379,
        -0.06011471897363663,
        0.01569061353802681,
        0.061027370393276215,
        0.025262298062443733,
        0.031083855777978897,
        0.061469923704862595,
        -0.03646045923233032,
        0.021060645580291748,
        0.03541594371199608,
        0.041432734578847885,
        -0.03158347308635712,
        0.026377446949481964,
        -0.113387331366539,
        -0.00022411679674405605,
        0.02030363120138645,
        -0.03032037802040577,
        -0.03439565747976303,
        0.04612068459391594,
        0.0449228435754776,
        0.008989864960312843,
        -0.04019337520003319,
        0.05174840986728668,
        0.018197624012827873,
        -0.07436151802539825,
        0.12090163677930832,
        0.0031415263656526804,
        -0.06016241014003754,
        0.037711936980485916,
        0.039612866938114166
    ]
}