{
    "id": "dYWa_vR3mho",
    "title": "AirPods Pro TEARDOWN vs Liberty 2 Pro! - Best 'Pro' Earbuds?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-11-14T14:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=dYWa_vR3mho",
    "category": "Howto & Style",
    "tags": [
        "airpod pro teardown",
        "airpod pro review",
        "airpod pro duraiblity",
        "airpod pro",
        "airpod pro 2",
        "Soundcore",
        "anker",
        "liberty 2 pro",
        "Astria coaxial acoustic architecture",
        "best headphones",
        "best wireless headphones",
        "airpods 2",
        "airpods review",
        "apple airpods pro",
        "anker soundcore liberty 2 pro review",
        "wireless earbuds"
    ],
    "views": 1515611,
    "likes": 43655,
    "comments_count": 3259,
    "description": "Today we are going to take apart the new Airpod Pro's and compare them with the Soundcore Liberty 2 Pro! Check them out HERE:  Not very often do we find new technology entering into wireless headphones. But today we are going to see what Soundcore's new Astria Coaxial Acoustic Architecture looks like from the insides. Yeah, thats alot of big words, but it boils down to two different types of speakers right on top of each other so the soundwaves from each dont conflict with eachother. Its pretty interesting.   We'll be comparing the Soundcoare Liberty 2 pro's to the new Apple Airpod Pros. Pro vs Pro. We'll take a look at the hardware inside the Airpod Pro earbuds themselves along with the Airpod pro charging case. Are these the best wireless headphones on the market? What do you think?    *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://bit.ly/Liberty2ProJRE",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "There are some pretty eye-catching interesting hardware designs on the box of these Liberty 2 Pro headphones from Soundcore. These drawings show an internal speaker construction that I've never seen before. This video is sponsored by Soundcore, and today I'll be taking apart their new in-ear studio performance headphones and see if the insides look as cool as the box says they are. I decided to compare the Soundcore hardware side-by-side with Apple's newest Airpod Pros, with that white q-tip stem design. The Airpod Pros probably have that traditional speaker inside so it should be an interesting video. Let's get started. [Intro] Let's start by taking apart the Liberty Pro 2's. Now it's not very often that headphone technology is shaken up by something new. But Soundcore's tech is definitely different. They call it the Astria coaxial acoustic architecture which sounds like a bit of marketing jargon. But I'll break down the naming while I break open the headphones. Astria is the Greek goddess of purity, which Soundcore believes is a reflection of the sound produced by the Liberty 2 Pro. Pure meaning it's true to life. So that's the first word. The coaxial acoustic architecture means that instead of one traditional speaker inside these wireless earbuds, we should find two. Coaxial means they are lined up on top of each other and pump out sound at the same time so that the sound isn't disrupting or competing with itself. The Liberty Pro 2's are ipx4 meaning they're sweat resistant, sealed shut, and very hard to get inside. That ipx4 rating is the same water resistance rating that the Airpod Pro's have. So both of these are going to be difficult to open and will also both probably be destroyed when I'm done. F in chat for the earbuds. After slicing through the glued shut plastic housing and prying out the speaker unit, we get our first loo at the coaxial drivers. It's definitely unique. That pointy niblet in the center is the knowles balanced armature. And hidden in that bottom circular coin looking thing is the normal speaker that's tuned specifically for bass. This is the world's first pair of symmetrically aligned coaxial drivers in wireless headphones, which means that all the sound is directly aligned with the listener's ears. The terminology of course isn't as important as seeing the hardware itself though. Since the rectangular pointy niblet armature thing in the center handles those mids and highs, that circular driver below it can focus on just handling the lows, sharing the workload. Which makes the sound cleaner and clearer than a normal headphone could with a single speaker trying to make all the noise by its lonesome. I'll pull apart that bass driver in just a second.10 Grammy Award-winning audio producers worked on these Soundcore headphones to create that in-ear studio performance. You know how movie theater sound systems and even home stereo systems come with different sized speakers to handle the different sounds. Now these Anker Soundcore Liberty 2 Pro's can do it all in a very tiny space. It's a little sound accurate theater for your ear. It has a super small 65 milliamp hour lithium battery in each bud which has 8 hours of play time. I'll come back to these in a second. Now let's talk about the Airpod Pro's. These guys cost $250 twice as expensive as the Liberty 2 Pros we just took apart. The Airpod Pro's have a pretty seamless water-resistant design. So getting inside will once again destroy the headphones, but it's the only way to see the hardware. Squeezing the headphones pops open the seam between the head and the shaft and then I can slice my way around the opening. Another difference between these and the Liberty 2's is that the Apple Airpod Pro's do have a noise canceling feature which is also pretty unique. But you'll have to decide for yourself whether it's worth that extra hundred dollars. Prying out the speaker inside the headphone once again is very difficult. Both companies are serious about their water resistance. Finally after physically slicing off the front grill we get our first glimpse inside. Apple has positioned a large rectangular microphone right inside the earpiece grill. The microphone blocks the speaker. The microphone is part of the noise cancellation. It listens to the inside of your ear for unwanted sounds and then cancels it out. The speaker is what we're here for though and that's this guy. Which I've kind of destroyed. It's got a large white diaphragm in the center with a clear rubber surround. It's a singular speaker meaning that it has to produce all of the mids, lows, and highs by itself. Don't get me wrong both of these headphones sound great. I've paired both of them up with my Android phone. This video is just comparing the internal hardware. The Airpod Pros have one single driver and the Liberty Pro 2's have that new-age dual symmetrical coaxial driver. And there are major physical differences between those two methods of delivering sound. I'll pop off the bottom of the stack drivers inside these Liberty Pro 2's so we can see that lower dynamic speaker. And there it is, with it's own copper coil and clear diaphragm. If you haven't been satisfied with the sound quality of wireless headphones in the past, maybe it's time to try something different. Normally these Liberty 2 Pros are about half the cost of the Airpod Pros, but with the link in the description of this video, you can get an extra $40 off the retail price. The Liberty Pro 2's are currently the only wireless headphones that exist with this astria coaxial acoustic architecture set up. Taking apart the Airpod Pro 2 charging case. This guy can hold 24 hours worth of charge and the buds themselves can last for 4 1/2 hours. The case is once again obviously not designed to come apart, but that's never stopped us before. The internals were actually pretty cool. Pulling off the top reveals the underside of the plastic molded earpiece slots and then a few long ribbon cables headed down to the dual internal batteries. It's a dual-cell 519 milliamp hour capacity, and all of it charges up with Apple's proprietary lightning port. The Soundcore case is also equally difficult to get inside. Pretty much no wireless headphones can ever be repaired easily which is a bummer. One good thing about the Liberty 2 Pro's though is that Soundcore has something called hearing ID which tests your hearing and adjusts each earbud so that they are acoustically matched to how your individual ear hears sounds. Every ear is different and these earbuds can adapt the audio accordingly. The Liberty 2 case does have USB-C charging and a pretty glamours charging pad on the bottom. Why manufacturers don't make transparent tech anymore is beyond me. This thing looks pretty awesome. The Airpod case also has wireless charging glued into the side panel. It's a bit smaller of a coil, but still, both would look amazing with a transparent case. Now that we are inside, there are 4 screws holding the wireless charging pad to the motherboard. I can unscrew that and then we can see the undersides where the case can transfer it's 24 hours of battery life into the 8 hour battery of the earbuds for a total of 32 hours. The internal case battery is 500 milliamp hours. I'm glad Soundcore sponsored this video. They're some pretty cool technology to be seen inside of the Liberty 2 Pro's. I have my own pair that I've been using for about a month now and both the lyrics and audio are super crisp with some solid base. They are a bit larger than the average pair of earbuds so be ready for that, especially if you run a lot. Personally, I'd be okay with them sacrificing a bit of that 8 hour battery life for a smaller and lighter casing. Turns out the box is advertising the exact hardware inside of their earbuds and that's pretty cool. Since you made it this far in the video, Soundcore has made 10 awesome looking JerryRigEverything Edition Liberty 2 Pro's and they're doing a world-wide giveaway. So if you want one of these, I'll put the details of the giveaway down in the video description alongside that limited time discount code for $40 off. Once again, huge thanks to Soundcore for sponsoring this video. Come hang out with me on Instagram and Twitter. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Liberty Pro",
        "Airpod Pro",
        "Pro",
        "Liberty",
        "Apple Airpod Pro",
        "Soundcore",
        "Airpod",
        "Anker Soundcore Liberty",
        "Pros",
        "newest Airpod Pros",
        "inside",
        "headphones",
        "speaker",
        "sound",
        "Soundcore Liberty",
        "speaker inside",
        "Pro headphones",
        "pretty",
        "wireless headphones",
        "video"
    ],
    "transcript_entity_values": [
        "the Airpod Pros",
        "24 hours",
        "32 hours",
        "Liberty 2 Pro's",
        "Grammy Award",
        "500 milliamp hours",
        "65 milliamp hour",
        "Greek",
        "519 milliamp hour",
        "Instagram",
        "the 8 hour",
        "two",
        "the Airpod Pro 2",
        "Airpod Pros",
        "Soundcore",
        "about half",
        "pointy niblet",
        "the Liberty Pro 2's",
        "8 hours",
        "4",
        "Astria",
        "about a month",
        "10",
        "Apple",
        "USB-C",
        "250",
        "the Airpod Pro's",
        "first",
        "second",
        "Liberty 2 Pro",
        "4 1/2 hours",
        "Airpod",
        "that extra hundred dollars",
        "The Liberty Pro 2's",
        "8 hour",
        "Astria",
        "these Anker Soundcore Liberty 2 Pro's",
        "The Airpod Pro's",
        "Android",
        "Soundcore",
        "The Liberty Pro 2's",
        "One",
        "40",
        "one",
        "Twitter",
        "JerryRigEverything Edition Liberty 2 Pro's",
        "2"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "TIME",
        "TIME",
        "ORG",
        "ORG",
        "QUANTITY",
        "TIME",
        "NORP",
        "QUANTITY",
        "ORG",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "LAW",
        "TIME",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "TIME",
        "ORG",
        "MONEY",
        "LAW",
        "TIME",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL"
    ],
    "vector": [
        -0.0941040888428688,
        -0.04496971145272255,
        0.02753460966050625,
        -0.025357242673635483,
        0.07894503325223923,
        -0.021762987598776817,
        0.054199814796447754,
        0.044320106506347656,
        -0.051033858209848404,
        0.06080477684736252,
        0.024361703544855118,
        0.04661709815263748,
        -0.03411673381924629,
        -0.03948121517896652,
        0.027623150497674942,
        0.034095216542482376,
        0.12735557556152344,
        -0.06896224617958069,
        0.0010116113116964698,
        0.0544082373380661,
        -0.05535888671875,
        -0.01080850325524807,
        0.06673461943864822,
        0.05185259133577347,
        0.05039052292704582,
        0.03182259947061539,
        -0.0032961119432002306,
        -0.024877293035387993,
        -0.0789150595664978,
        -0.022808628156781197,
        0.01881617307662964,
        0.008863715454936028,
        0.007156226318329573,
        -0.041456639766693115,
        0.022316496819257736,
        -0.08305658400058746,
        0.07251743227243423,
        -0.02156618796288967,
        -0.04457435384392738,
        -0.049094732850790024,
        -0.06532374024391174,
        -0.013115904293954372,
        -0.06588290631771088,
        0.007085514720529318,
        -0.06318072229623795,
        -0.039706818759441376,
        -0.029604872688651085,
        -0.05000532418489456,
        -0.021859705448150635,
        0.07199720293283463,
        0.034617215394973755,
        -0.09359994530677795,
        0.05917733162641525,
        0.02509152516722679,
        -0.04322056844830513,
        0.044277094304561615,
        -0.06940692663192749,
        -0.0011604382889345288,
        -0.005150941200554371,
        -0.0018063398310914636,
        0.06776861846446991,
        -0.024980811402201653,
        0.009331204928457737,
        -0.015750393271446228,
        0.024546176195144653,
        -0.012133440934121609,
        0.019694341346621513,
        0.05642547458410263,
        0.035404328256845474,
        -0.011708480305969715,
        -0.0634433701634407,
        0.06727103143930435,
        -0.008350441232323647,
        0.0032610706984996796,
        0.04649052023887634,
        0.055935584008693695,
        0.045449599623680115,
        -0.04885627329349518,
        -0.04663822427392006,
        0.07641277462244034,
        0.05293090268969536,
        0.006918547675013542,
        -0.044044870883226395,
        -0.12822435796260834,
        0.04426918551325798,
        -0.018206875771284103,
        -0.018982931971549988,
        -0.04596294090151787,
        -0.10719413310289383,
        -0.0046913111582398415,
        -0.029273077845573425,
        0.07813578844070435,
        0.05186073109507561,
        -0.05657527223229408,
        0.0863417237997055,
        0.0019771878141909838,
        -0.05666828528046608,
        -0.015351765789091587,
        0.05002151429653168,
        0.003364336909726262,
        0.007468798663467169,
        -0.00945408083498478,
        0.0054979161359369755,
        -0.11095085740089417,
        0.03778781369328499,
        -0.08110059797763824,
        -0.1047237366437912,
        -0.03707728162407875,
        0.04913957417011261,
        0.06950998306274414,
        0.017002969980239868,
        -0.05175214260816574,
        -0.027895022183656693,
        0.007886605337262154,
        -0.017705801874399185,
        0.05836246535181999,
        -0.1044558584690094,
        0.11750314384698868,
        0.12748980522155762,
        0.012121402658522129,
        -0.024504346773028374,
        -0.0016989292344078422,
        0.017122527584433556,
        -0.0010703196749091148,
        -0.01965820975601673,
        0.01860402524471283,
        -0.13362112641334534,
        5.419407319534916e-33,
        0.009127859957516193,
        0.07300253957509995,
        -0.03048696555197239,
        -0.010415873490273952,
        -0.04323193430900574,
        -0.054254595190286636,
        -0.03335076943039894,
        0.016477201133966446,
        -0.019317427650094032,
        0.04617033526301384,
        -0.1225719004869461,
        -0.010068406350910664,
        -0.024528944864869118,
        -0.048560284078121185,
        0.05759250372648239,
        -0.11378110945224762,
        -0.09374283254146576,
        0.03931768611073494,
        -0.07380455732345581,
        0.05807434767484665,
        -0.004537534900009632,
        0.0509306900203228,
        0.022958548739552498,
        0.12015239149332047,
        0.09450025111436844,
        -0.06080854311585426,
        0.038825735449790955,
        -0.005073338747024536,
        -0.05255917087197304,
        0.013295646756887436,
        -0.09623149037361145,
        -0.003901186166331172,
        0.02130897156894207,
        0.016234030947089195,
        0.008133847266435623,
        0.014693929813802242,
        -0.04313192889094353,
        -0.05821939557790756,
        -0.01684500090777874,
        -0.09392216056585312,
        -0.051522158086299896,
        0.02863864228129387,
        -0.02426852285861969,
        0.018640970811247826,
        0.0719280019402504,
        0.012862763367593288,
        -0.04435852915048599,
        0.015060828998684883,
        0.05872290953993797,
        -0.10390166193246841,
        -0.05699196085333824,
        0.011261421255767345,
        -0.078755222260952,
        0.08211194723844528,
        0.01743164286017418,
        -0.07141175121068954,
        0.005919300951063633,
        0.03306261822581291,
        0.08418916165828705,
        -0.0192718543112278,
        0.017831288278102875,
        0.0405026413500309,
        -0.015032190829515457,
        -0.08794188499450684,
        -0.06686867773532867,
        0.09399650990962982,
        0.035652972757816315,
        0.037874288856983185,
        -0.047787729650735855,
        0.03694701939821243,
        0.03801031783223152,
        0.05312442034482956,
        0.01695428043603897,
        0.008365293964743614,
        0.02200695313513279,
        0.009370007552206516,
        0.010941151529550552,
        0.010835457593202591,
        0.02787066251039505,
        -0.010770424269139767,
        -0.01022491604089737,
        0.10931851714849472,
        -0.030565230175852776,
        0.03963774815201759,
        -0.03712160885334015,
        -0.018625425174832344,
        0.0005848979344591498,
        -0.07428961247205734,
        -0.02079726755619049,
        0.028938086703419685,
        0.01782492734491825,
        0.04323650896549225,
        -0.055683281272649765,
        -0.03851441293954849,
        -0.032954469323158264,
        -6.173811675901828e-33,
        0.0327209047973156,
        -0.022433919832110405,
        0.05808194726705551,
        0.03251948580145836,
        -0.005551226902753115,
        -0.011177083477377892,
        0.034967631101608276,
        0.026319166645407677,
        0.016570137813687325,
        -0.016489850357174873,
        0.04838402569293976,
        0.03647664189338684,
        -0.041724659502506256,
        0.05044516175985336,
        0.006983043160289526,
        -0.05929197743535042,
        -0.028997676447033882,
        -0.12282953411340714,
        0.10995449870824814,
        -0.00385896023362875,
        0.09200116246938705,
        0.04968854784965515,
        0.0646427720785141,
        -0.020775815472006798,
        -0.05811217799782753,
        -0.06081930547952652,
        -0.02243157848715782,
        -0.010109926573932171,
        0.03858891874551773,
        0.005396147258579731,
        0.01343174371868372,
        0.02329760231077671,
        0.0004964706022292376,
        0.03747834637761116,
        0.09323805570602417,
        0.013646692968904972,
        -0.01909518986940384,
        -0.041267719119787216,
        0.006003159563988447,
        -0.055018749088048935,
        -0.023885296657681465,
        0.02459787018597126,
        0.03614175692200661,
        -0.10068423300981522,
        0.04930863156914711,
        -0.06160101294517517,
        -0.07552365958690643,
        0.045809827744960785,
        -0.02003828063607216,
        -0.06388256698846817,
        0.013801485300064087,
        0.038725487887859344,
        -0.04464014619588852,
        -0.037052836269140244,
        -0.07001186907291412,
        -0.033906977623701096,
        -0.01869206316769123,
        -0.058081332594156265,
        -0.0377831757068634,
        0.032347120344638824,
        0.049375541508197784,
        0.021153870970010757,
        0.028818802908062935,
        0.007954470813274384,
        -0.09293568134307861,
        0.0304134301841259,
        0.004540586844086647,
        0.03775743767619133,
        -0.008665261790156364,
        0.02989434078335762,
        0.0023023183457553387,
        -0.03177228569984436,
        0.023361368104815483,
        -0.044263701885938644,
        0.01855301670730114,
        -0.009689086116850376,
        -0.014080715365707874,
        0.023616479709744453,
        0.04125116765499115,
        0.040199462324380875,
        -0.06021035462617874,
        0.07474464923143387,
        0.034566354006528854,
        0.013688531704246998,
        0.025334432721138,
        0.098716601729393,
        0.01087270863354206,
        -0.022412767633795738,
        -0.07029504328966141,
        0.09466470032930374,
        0.0032417154870927334,
        -0.029147790744900703,
        0.016684506088495255,
        0.04831306263804436,
        0.012666412629187107,
        -4.9220815867556666e-08,
        0.07220473140478134,
        0.050661128014326096,
        0.059257011860609055,
        -0.007620764896273613,
        -0.02993820048868656,
        -0.0713530033826828,
        -0.042092885822057724,
        -0.014591876417398453,
        0.03783262148499489,
        -0.018966766074299812,
        -0.01968868263065815,
        -0.029792949557304382,
        -0.060364171862602234,
        0.03336756303906441,
        0.022786911576986313,
        0.08087082952260971,
        -0.09201813489198685,
        0.06637975573539734,
        -0.00882813148200512,
        -0.058848343789577484,
        0.011830542236566544,
        0.07535211741924286,
        0.05131799727678299,
        -0.04239235818386078,
        -0.053654976189136505,
        0.033559031784534454,
        -0.018343603238463402,
        -0.027456050738692284,
        0.020699666813015938,
        -0.002344906097277999,
        -0.13672536611557007,
        0.0037856283597648144,
        -0.04499020799994469,
        -0.02457910217344761,
        -0.005504598841071129,
        -0.031197696924209595,
        -0.0038646829780191183,
        0.009470563381910324,
        -0.06199946999549866,
        0.05985795333981514,
        0.012502256780862808,
        -0.08531896770000458,
        -0.04418594017624855,
        0.05026620253920555,
        0.039835408329963684,
        -0.08937323838472366,
        0.13030940294265747,
        -0.016638102009892464,
        -0.07948333024978638,
        0.03712790459394455,
        -0.050971660763025284,
        0.05906514823436737,
        -0.02633240818977356,
        -0.0042522200383245945,
        0.05754894018173218,
        0.05463516339659691,
        -0.011073061265051365,
        -0.02999500185251236,
        -0.07046689093112946,
        0.03170529380440712,
        -0.02308763936161995,
        -0.07649609446525574,
        0.09289264678955078,
        0.1100543886423111
    ]
}