{
    "id": "e15q1y6cxtw",
    "title": "Can you TRUST Gameranx?! ft. Jake Baldino",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-07-10T16:28:07Z",
    "video_url": "https://www.youtube.com/watch?v=e15q1y6cxtw",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "video games",
        "gameranx",
        "before you buy",
        "Jake baldino",
        "starcraft",
        "legend of zelda",
        "ocarina of time",
        "zelda",
        "crash bandicoot",
        "Aku aku",
        "unreal tournament",
        "unreal headshot",
        "doom",
        "goldeneye",
        "metal gear solid",
        "solid snake death",
        "gears of war",
        "resident evil",
        "Jill sandwich",
        "half life",
        "half-life",
        "headcrabs",
        "pc",
        "n64",
        "sony",
        "playstation",
        "games",
        "trivia",
        "quiz",
        "microsoft",
        "xbox",
        "ooga booga",
        "007",
        "link",
        "nintendo",
        "retro gaming",
        "consoles",
        "tech",
        "game"
    ],
    "views": 136010,
    "likes": 7861,
    "comments_count": 488,
    "description": "Does gaming mastermind @JakeBaldino REALLY know video games?   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    The IMPOSSIBLE Tech Challenge ft. Mrwhosetheboss:  Does MrMobile Know Phones?!  Does Vsauce3's Jake Roper Know Movies?  Does Sara Dietschy Know Tech?  Does JerryRigEverything Know Phones?   Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "https://youtu.be/wArC69nUF4I",
        "https://youtu.be/SPF8HXytAFs",
        "https://youtu.be/3phaEPn6fJU",
        "https://youtu.be/jNl04x5rmxo",
        "https://youtu.be/cXFmqapcP8Y",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome to This Is where we have a very special guest on the show today, Jake Baldino from Gameranx. Jake, how are you doing today? - I am terrified. - You're terrified? Well that is a great place to start because we have a brand new game just for you. So we have a list of 10 famous sound effects from video games throughout the years. So we're gonna look for the name of the game and then for your second point we're going to be looking for the year that that game came out. And we do have a handicap available of plus or minus one year. So if a game came out in 1995, 1994 or 1996 would be a correct answer. - I'm gonna need that, okay, good. (laughs) I'm bad at years. - Some of these I think you'll get pretty easily, obviously as someone who has an illustrious gaming knowledge to pull from. - I might be, you don't know that. - I'm definitely a fake gamer so sign me up. Jake, are you ready to play the This Is Video Game Trivia Show? TBD actual name. - Let's do it. - All right, let's start out with sound effect number one. - [Firebat] Need a light? - [Matt] Oh, you can't hear it? - I can hear it. - [Matt] Oh, okay, I don't hear it. - Oh, you just spoiled it, god. - I also, I was like, what the hell is that? But yeah, I definitely just saw what that was. (laughs) - Off to a riveting start. Jake, would you like to take a very wild guess at what that sound effect was that we accidentally just showed you the answer to? (laughs) - That might be Starcraft 2. - Well, you know what, actually, you know what, no, that's not true, Matt got that wrong. That is actually not from Starcraft 2, that's from Starcraft 1. - Ah! - Okay, you know what, hold on, hold on, hold on. Let's give you a shot here, do you know what year the original Starcraft game came out? - I would say... 1999. - You're gonna get a point for that, it is 1998. I'm gonna give you one of the two points for this one since the year was correct and the game was cheated and accidentally shown to be the wrong game, Matt. - Thanks a lot. Thanks a lot, Matt. - I should let you know that you actually do have one lifeline available which is Phone a Ken. So at any point if any of these sound effects are difficult you can opt to call the wonderfully helpful slash very unhelpful Ken Bolido. So just sort of something to keep in your back pocket there, you do have one bit of help available for you throughout the game. Well, actually maybe two, who knows if Matt accidentally presses the wrong button twice. (laughing) - I'm grateful for Ken's guidance, I'm so excited to call him, I know that might sound weird. - That does sound weird, why would you wanna call Ken? That usually is like a punishment, not like a feature. - Is that bad, is that the wrong answer? Am I not supposed to say that, sorry. - Now we have to deal with Ken all day now that you said that. - [Matt] His ego's going to be so big now. - All right, Jake Baldino, are you ready for question number two? - Let's do it, now I'm ready. (suspenseful music) - That is music to my ears, that is the Legend of Zelda franchise, that one's Ocarina of Time. - All right, that is 100% correct. However, do you know what year Ocarina of Time came out? - Uh, (humming) 1997? - [Austin] It is 1998, so you get full points on that one. You're off to a good start, my friend. - I really am a gamer, this is great. - All right, let's move on to question number three. - [Aku Aku] Hunamagah! - Ah, that is Crash Bandicoot, of course, one of my favorite series ever. - Okay, Crash Bandicoot. Do you know what year Crash Bandicoot came out. - 1996. - Nailed it, my friend. I'm afraid we are making this too easy for you. So as you can see, a lot of these games are sort of titles that we hoped that you had played and that obviously we had all sort of grew up playing so a lot of sort of stuff in the late 90s but what kind of games were you playing? - It was stuff exactly like Crash Bandicoot. Metal Gear Solid, I had come into my own doing this stuff, like playing games and stuff with the original PlayStation. I had grown up classically trained thankfully on a Nintendo but I really became a weirdo when I got my hands on a PlayStation as a kid. - Dude, I'm absolutely right there with you. The PlayStation was sort of my first real console and yeah, I played so, so much of that PS1. - I feel like when we were all kids we got our hands on less games so you spent so much time obsessing over one game. Now I can play a brand new game that I absolutely love and it's still not ingrained in my brain like 1998's Metal Gear Solid, like stuff like that. - Yeah, absolutely, man, it's crazy how time moves. Well, the good news is for the game you are doing very well, so you're currently at five of six potential points. All right, let's move on to sound effect number four. - [Announcer] Headshot. - I need a second, oh my god. So I know what that is but now I'm trying to, what game? I feel so foolish, oh boy, all right. I don't think this is right but I have to take a guess, I'm so upset I don't know this. Quake? Quake was 1996, 95? - So your final answer is 1995 Quake? - Lock it in, 95, Quake. - Jake Baldino, your gaming knowledge has been impeccable so far and yet for question number four you are incorrect. It is from Unreal Tournament in 1999. - Ho ho, that's what it was, of course, okay. - That's a little bit of a tougher one 'cause like it's one of those iconic sounds you know you've heard a million times and yet it's tough to place sometimes when you don't have any other context around it. - And the compressed voice line, that old school compression on those types of lines, I was like, okay, it's gotta be one of a couple of things, being Unreal, Quake, stuff like that, I chose poorly. - That's okay, it's okay, you are still very much in the game. So at this point you are at five of eight points so all you need to do is hit 50% so you're still absolutely in the green at the moment. - All right, I feel good. - Oh, well hold on to that warm fuzzy feeling inside because we are about to crush it with question number five. (groaning) - That is specifically the DOOM shotgun and that is the OG DOOM theme from the original DOOM. - Do you know what year this particular video game came out? - DOOM was 1994. - Jake Baldino you are 100% correct, it is 1993, but yes of course this is the DOOM, the monster groan shotgun. It's absolutely iconic. - Just powered me, now I'm like just hearing a snippet of it I'm like ready, I'm like, I'm gonna win, I'm gonna win. - Well don't get too cocky just yet my friend, we still have five more questions for you. But yeah, I mean, come on, you can't go wrong with DOOM, right, what a legendary game. - One of my first experiences playing on a PC, back when you had to go to a computer lab. I didn't have a computer growing up so I'd have to go to a place and pay a lady five dollars and use the computer and we all played DOOM and it was this big crazy thing. It was like, we are not allowed to play this, this is a bad game. But it was so awesome. - You're just blasting monsters and there's like the pixelated blood and you're like, don't tell my mom! All right, let's move on to sound effect number six. (dramatic music) - That is Goldeneye and that is specifically selecting things on the menu. - What year did this Goldeneye game you speak of come out? - Pierce Brosnan, Famke Janssen. 1997. - Jake Baldino, with your impeccable memory you are 100% correct, that is in fact the mission brief from Goldeneye of 1997. Do you remember when Goldeneye first came out? Was this a game that you actually played a lot? - Yeah, I had family members that had a Nintendo 64 and we went crazy with this game but the best thing was the cheats. It was one of the first games I really experienced that had like crazy cheats, it had paint ball mode, it had like big head gorilla mode, it was ridiculous. - The thing is, Goldeneye shouldn't have been as popular of a game as it is, right? I mean, this is peak sort of back when movie tie in games were sometimes decent but often times a little bit more like shovelware. It was one of those things where, yeah, Goldeneye was, yeah, I would say a decent James Bond movie but I think it wasn't really as popular as I think the game was I think most people when they think Goldeneye they think Nintendo 64 and they think 1997's best multiplayer console shooter, is that enough covalence? - Yeah, it was actually made by a small studio in the UK, it was Rare in rare form and they really knocked it out of the park and kind of paved the way for not only Nintendo 64 and doing more mainstream, more licensed style games, but just shooters on consoles in general. - Well, Jake, I'm happy to report you are actually almost ready to take the victory. Let's move on to question number seven. (shouting) - Snake, Snake, Snake! Yeah, Metal Gear Solid, baby, the original. - All right, do you know what year that game may have come out by chance? - That is 1998 for the original PlayStation. - Jake, you are 100% correct, yes, of course. I blame Jimmy for giving you so many easy questions. - Jimmy definitely threw me that one. - That was actually specifically Jimmy's idea. You are doing very, very well, my friend. All right, how about we move on to game number eight. (chainsaw revs) (shouting) - Ooh, baby! That is the Lancer chainsaw from Gears of War. - Do you have a year for that particularly game? - So it was the first big thing for Xbox 360, it wasn't a launch title but it was a big highlight for the Unreal Engine at the time so it was like gonna be this graphical powerhouse, it was really cool, it was creative, it was just like a new third-person shooter with cinematic elements, Cliff Blezinsky behind it, a lot of Microsoft marketing behind it. So that had to have been, I had to have been, 2007? Sorry, no, 2006, lock it in, 2006, Gears of War. - My friend, you have absolutely aced it, yes, it is Gears of War from 2006. It's kind of funny to think about sort of the way that you're looking at this because for a lot of the challenges we're bringing out sort of pieces of tech or movies of whatever the case is, but for you I feel like you're really sort of leaning in on obviously your wealth of knowledge that you developed but also really putting yourself in that place of like wherever you were when that game came out or sort of where it kind of came about in a console's life cycle or anything. It's super interesting the way you think about it. - Yeah, it's kind of how I've always contextualized things, like even when we write notes or scripts or ideas for videos, I can usually kind of place myself in one specific point. That's kind of why I started doing this type of stuff. - Yeah, no kidding, man. Well obviously, I mean, you guys make an incredible amount of videos and a lot of times you do cover older titles and kind of going back a little bit more on the retro side too. - Yeah, we definitely go all over the place. One of our favorite things is to just highlight those weird games that you'd see at Blockbuster, whether it was for like PS1, PS2, we love making videos on just those specific weird games. - All right, well you should feel very confident right now, you have clinched the tweet, still have the ability to take the double or nothing at the end. But let's move on to question number nine. (Murloc grumbles) - That is a, oh boy, a Mirelurk? Whatever the creature is, it's a low level creature from World of Warcraft. - And what year did that particular game come out? - Oh boy, this is a hard one because World of Warcraft had just released and then it's hard to pinpoint it because it just became like this big cultural thing that feels like it's just been an institution, it's been around forever like McDonald's or something. - Am I hearing 1970, was that what you said? 1970, McDonald's, yes, okay, go ahead. - I hung out with a girl in high school whose parents played it and I though that was really weird so it was out when I was in high school. I would say that came out in at least 2005. - Jake, your video game knowledge is impeccable, it is 2004 but yes, it is in World of Warcraft. Although, this actually was a two part question because originally the sound is actually from the original Warcraft in 1994. So we would've accepted either answer but of course World of Warcraft is correct and 2004 is within the handicap. - Thank god for that handicap, oh my goodness. - So congratulations, you have successfully broken the This Is game yet again. So why don't we play you the last sound effect and you can decide if you wanna do double or nothing. - [Barry] You were almost a Jill sandwich. - [Jill] You're right! - So that is Barry Burton and Jill Valentine from the original Resident Evil. - Do we even need to ask what year that came out? - Resident evil came out, 1996. - Absolutely 100% correct. Bonus points, even though I don't have any bonus points to give you for knowing the actual names of the characters as well. Jake, I am very happy to say that not only have you won the game but you have dominated this with your impeccable knowledge. Congratulations, you can absolutely at this point give us a tweet, we'll tweet out another photo of my nipples or whatever it is that you'd like and call it a day. Or if you'd like you can take your still available Phone a Ken and go into the final bonus round where you will have to get the question and the year 100% correct but if you do you will be able to trade your dusty old This Is tweet for a shiny new This Is ad spot. - You know, I think I'm going to take the original prize, there's nothing I really wanna put out there. Yeah, believe it or not, I just want that tweet, I value that tweet, man. - Wow, this is the first time someone hasn't taken the bonus round. Okay, you know what, Jake, I will absolutely give you that, you will get the tweet, we still have that bonus question, do you wanna take it for fun just to see if you would've potentially gotten the 30 second ad spot? - For funsies, yeah, sure, let's do it. - Let's do it, let's roll the bonus question. (gurgling) - All right, that is a Pokemon, I am embarrassed to say, I don't know what Pokemon off the top of my head but I'm pretty sure that's a Pokemon. - Jake Baldino, not only have you shown an incredible knowledge of video games throughout this series, but almost more importantly you have shown excellent judgment because that is incorrect, you walked away with the tweet, you have gotten that wrong, that the Head Crab from Half-Life 1. - Oh, stupid idiot, you moron, god. All right, I just lost the whole game because of that, it is all undone. - That was a bonus question, that meant nothing, you walk away with the tweet, congratulations, my friend, that was very impressively done. You made us look stupid. - But you made me look like a fake Half-Life fan so I think we're even. - Jake, would you like to tell everyone how they can find you on the interwebs? - Yeah, I am on Twitter and Instagram @JakeBaldino, I'm not verified but I am real. I'm also on YouTube.com/JakeBaldino, my name. But on the daily you can find me doing stuff either behind the scenes or on the forefront of YouTube.com/GameranxTV. - Right on, my friend. Well, the last question I really have, do you have a tweet ready for us? - I would love for you guys to tweet out that next time we're all together in person I want it on record that you are going to buy me pizza and you and your crew, we're all gonna eat it together. But you just have to go on record, it has to be locked in. - Jake, you know what, you have been a delightful guest, that is so wholesome and nice and wonderful, absolutely, all right, tweeted. Tweeted right now, Jake, right now it's live, it's real. Jake, thank you so much for being on This Is, thank you so much for completely destroying the game and thank you so much for being a very kind person 'cause I don't wanna tweet my nipples anymore. - I didn't wanna see them so, I love you but. Wait, can I still call Ken, like on the phone, I have his number now. Can I just call him, I don't mean to call him right now, but just in general. - Because you're such a graceful winner you can call Ken whenever. Day, night, whatever, I'm sure he won't mind. - Thanks, okay, good.",
    "transcript_keywords": [
        "game",
        "Jake",
        "Jake Baldino",
        "games",
        "yeah",
        "year",
        "Ken",
        "question",
        "Metal Gear Solid",
        "tweet",
        "Crash Bandicoot",
        "number",
        "question number",
        "sound",
        "DOOM",
        "Goldeneye",
        "sort",
        "Video Game",
        "absolutely",
        "Baldino"
    ],
    "transcript_entity_values": [
        "Ken Bolido",
        "the Legend of Zelda",
        "- Jake",
        "Gears of War",
        "three",
        "Gameranx",
        "- Jake Baldino",
        "Ocarina of Time",
        "Pokemon",
        "Mirelurk",
        "50%",
        "Nintendo",
        "One",
        "Jake Baldino",
        "the Head Crab",
        "Pierce Brosnan",
        "Xbox 360",
        "Half",
        "Microsoft",
        "Starcraft 2",
        "Rare",
        "Lancer",
        "third",
        "1994",
        "Jake",
        "Starcraft",
        "Matt",
        "Nintendo 64",
        "Austin",
        "McDonald's",
        "Goldeneye",
        "first",
        "1995",
        "2004",
        "Instagram",
        "Twitter",
        "10",
        "1996",
        "30",
        "James Bond",
        "Jimmy",
        "nine",
        "Jill",
        "1999",
        "1993",
        "Famke Janssen",
        "100%",
        "2006",
        "World of Warcraft",
        "Jill Valentine",
        "second",
        "five",
        "Unreal",
        "Starcraft 1",
        "PlayStation",
        "YouTube.com/JakeBaldino",
        "the year",
        "Cliff Blezinsky",
        "five dollars",
        "1998",
        "Warcraft",
        "Barry Burton",
        "one",
        "four",
        "McDonald",
        "at least 2005",
        "today",
        "World of Warcraft",
        "eight",
        "Gears of War",
        "six",
        "Half-Life",
        "UK",
        "years",
        "the years",
        "Metal Gear Solid",
        "95",
        "Ho ho",
        "two",
        "all day",
        "Goldeneye",
        "1970",
        "Pokemon",
        "1997",
        "Ken",
        "2007",
        "seven",
        "the late 90s"
    ],
    "transcript_entity_types": [
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "EVENT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "FAC",
        "PERSON",
        "ORG",
        "PERSON",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "PERSON",
        "PERCENT",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "DATE",
        "PERSON",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "GPE",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE"
    ],
    "vector": [
        -0.08182385563850403,
        -0.047013767063617706,
        0.03190044313669205,
        -0.16001474857330322,
        -0.01706172712147236,
        0.07592862844467163,
        0.08463424444198608,
        -0.0314905047416687,
        0.005324932746589184,
        0.0051969666965305805,
        -0.041441090404987335,
        -0.05738740414381027,
        0.01411531027406454,
        -0.060277700424194336,
        -0.020437631756067276,
        -0.03384271264076233,
        0.048405151814222336,
        -0.013467947021126747,
        -0.032377876341342926,
        -0.035547249019145966,
        0.07836123555898666,
        0.0237809419631958,
        -0.03131911903619766,
        -0.06948979198932648,
        0.0005274591385386884,
        -0.00042832453618757427,
        -0.05132392421364784,
        0.03359226509928703,
        -0.04147028923034668,
        0.03348616510629654,
        0.06000538542866707,
        0.10289061069488525,
        0.021137291565537453,
        -0.02529468573629856,
        0.013495604507625103,
        -0.13300246000289917,
        -0.07758667320013046,
        -0.0480327382683754,
        -0.058159906417131424,
        -0.06779049336910248,
        -0.11415880173444748,
        -0.024572249501943588,
        0.05253782123327255,
        -0.00860909465700388,
        -0.031884003430604935,
        -0.05851941555738449,
        -0.07184281945228577,
        -0.06833086162805557,
        0.0269949808716774,
        0.06876572966575623,
        -0.04555040970444679,
        -0.03516308590769768,
        0.11339224874973297,
        -0.015925943851470947,
        -0.02168501354753971,
        0.02351677045226097,
        -0.058486148715019226,
        0.07398723810911179,
        0.005276030395179987,
        0.03514128923416138,
        -0.0003831842332147062,
        -0.098928302526474,
        -0.06500011682510376,
        -0.02687372826039791,
        -0.006911385804414749,
        0.024146290495991707,
        -0.002405579201877117,
        -0.05697474256157875,
        0.03687432035803795,
        -0.046378083527088165,
        -0.04041168838739395,
        0.0637095496058464,
        0.029946308583021164,
        -0.059383489191532135,
        -0.0031934347935020924,
        0.07928730547428131,
        0.0481574684381485,
        0.011426755227148533,
        -0.018891356885433197,
        -0.04253975301980972,
        0.08644622564315796,
        -0.06159764155745506,
        -0.01268791500478983,
        -0.03191819041967392,
        -0.013938209973275661,
        0.023935995995998383,
        0.019258994609117508,
        0.07901635020971298,
        -0.03772687166929245,
        0.06479361653327942,
        -0.16020864248275757,
        0.021100779995322227,
        0.12468194216489792,
        0.05103234574198723,
        0.11218196898698807,
        0.0006282669492065907,
        -0.057072170078754425,
        -0.06287375837564468,
        0.05816357582807541,
        0.04854973033070564,
        -0.044501204043626785,
        -0.011427655816078186,
        0.05389896407723427,
        0.011656940914690495,
        0.04709499701857567,
        0.07538795471191406,
        -0.09152872115373611,
        0.014732887968420982,
        -0.014852220192551613,
        -0.0027494339738041162,
        -0.05849223583936691,
        0.0012370641343295574,
        0.041356686502695084,
        0.0008503655553795397,
        0.006566932890564203,
        0.029909895732998848,
        -0.02446342259645462,
        0.09100458025932312,
        0.04215114191174507,
        -0.006279242690652609,
        0.11419125646352768,
        0.013006544671952724,
        0.024973824620246887,
        0.008496910333633423,
        0.012599268928170204,
        0.021056072786450386,
        -0.02507704123854637,
        7.245825789653291e-33,
        0.04531212896108627,
        0.040974605828523636,
        0.018585754558444023,
        0.016864614561200142,
        -0.028393233194947243,
        -0.01177498884499073,
        -0.04585731402039528,
        0.02421366423368454,
        -0.1064964160323143,
        0.0087469182908535,
        -0.08326806128025055,
        0.002705021994188428,
        -0.06982389092445374,
        -0.03183005750179291,
        0.10483724623918533,
        0.03540860116481781,
        -0.028179101645946503,
        -0.0690765306353569,
        0.045205216854810715,
        -0.029284434393048286,
        0.08443231135606766,
        -0.05118265375494957,
        0.02819538302719593,
        -0.02679453231394291,
        0.04203985258936882,
        -0.0015835538506507874,
        -0.02638164721429348,
        -0.05039107799530029,
        0.07144920527935028,
        0.005419770255684853,
        -0.09535347670316696,
        -0.06737396121025085,
        -0.019593430683016777,
        -0.09485327452421188,
        0.10085659474134445,
        0.03436305746436119,
        0.047343384474515915,
        -0.060670405626297,
        0.005483218934386969,
        0.02694796770811081,
        0.016739729791879654,
        0.006636220961809158,
        -0.11031721532344818,
        -0.0371985137462616,
        -0.043217480182647705,
        -0.06129203364253044,
        0.030205029994249344,
        -0.09049374610185623,
        0.0008194367401301861,
        0.045460253953933716,
        -0.0897020548582077,
        0.029165072366595268,
        -0.017116732895374298,
        -0.07814949750900269,
        -0.0387863926589489,
        -0.007821437902748585,
        0.05434051901102066,
        0.0014751432463526726,
        0.04573167860507965,
        0.06098967790603638,
        0.04206763207912445,
        -0.010332861915230751,
        0.053601063787937164,
        -0.02538120001554489,
        -0.07427889853715897,
        0.0766039490699768,
        0.10623810440301895,
        -0.031712617725133896,
        -0.015786344185471535,
        0.0759335607290268,
        -0.00726062199100852,
        0.013456020504236221,
        0.032812949270009995,
        -0.14598429203033447,
        0.13579432666301727,
        0.037175361067056656,
        0.0053357225842773914,
        -0.007036542985588312,
        -0.03044978901743889,
        -0.042082514613866806,
        0.015315155498683453,
        -0.028198469430208206,
        -0.06064740940928459,
        0.03282516822218895,
        -0.020090976729989052,
        -0.0017836671322584152,
        0.03592447191476822,
        -0.01808524876832962,
        -0.0011784798698499799,
        -0.03201445937156677,
        -0.08575740456581116,
        -0.04349641501903534,
        -0.021828828379511833,
        0.06622018665075302,
        0.024290498346090317,
        -9.363874857319076e-33,
        -0.06233278289437294,
        -0.029283754527568817,
        0.016010133549571037,
        -0.0072236512787640095,
        0.04057537019252777,
        -0.035576049238443375,
        -0.033418815582990646,
        0.04241365194320679,
        0.060256317257881165,
        -0.09268007427453995,
        0.05980122461915016,
        0.07687127590179443,
        -0.015399834141135216,
        0.010393003933131695,
        -0.04512534663081169,
        0.0189491119235754,
        -0.07226306945085526,
        -0.0574893057346344,
        -0.040816500782966614,
        -0.007405459880828857,
        0.030206788331270218,
        -0.014717260375618935,
        -0.10560331493616104,
        -0.014435460790991783,
        0.018688149750232697,
        0.020718159154057503,
        0.03841102495789528,
        -0.04468459635972977,
        -0.033889174461364746,
        -0.017827345058321953,
        -0.06335137039422989,
        0.038078825920820236,
        0.015681933611631393,
        0.008849027566611767,
        0.011650455184280872,
        0.01723071187734604,
        0.10047265142202377,
        0.0007791070966050029,
        -0.058315180242061615,
        -0.011695190332829952,
        0.006451662164181471,
        0.02599671296775341,
        -0.04446600750088692,
        0.011952932924032211,
        0.0007011151174083352,
        0.009574607014656067,
        -0.03691381588578224,
        0.042454078793525696,
        0.06609012931585312,
        0.021462110802531242,
        0.1037604808807373,
        0.008985346183180809,
        0.02902323752641678,
        -0.03231678158044815,
        -0.022095343098044395,
        0.03371208906173706,
        0.015015391632914543,
        -0.009549976326525211,
        0.03171734884381294,
        0.00635839719325304,
        0.049403734505176544,
        -0.050354935228824615,
        -0.07841353863477707,
        -0.013788335025310516,
        0.02704133465886116,
        0.04435992240905762,
        0.030795685946941376,
        -0.061928603798151016,
        0.06419260054826736,
        -0.04977111145853996,
        -0.05059334635734558,
        0.04564357548952103,
        -0.044736362993717194,
        -0.07563207298517227,
        -0.042602263391017914,
        0.0684598758816719,
        -0.08810129761695862,
        -0.00576056307181716,
        -0.011212768033146858,
        -0.012593304738402367,
        -0.004017773550003767,
        0.08134160935878754,
        0.05401889607310295,
        0.025050058960914612,
        0.06897009164094925,
        0.0773838609457016,
        0.07292862236499786,
        0.030573928728699684,
        -0.019287167116999626,
        -0.04198232665657997,
        0.005000540055334568,
        0.06730835139751434,
        -0.015766484662890434,
        -0.05986635759472847,
        -0.01804071106016636,
        -7.212023689362468e-08,
        0.04883485659956932,
        0.05602627620100975,
        -0.06400202959775925,
        -0.03561089560389519,
        0.04853986203670502,
        0.046007826924324036,
        -0.019824424758553505,
        -0.0391685888171196,
        0.043683867901563644,
        0.0007578001823276281,
        0.05901850387454033,
        0.004865456372499466,
        6.383380241459236e-05,
        0.044550005346536636,
        0.018430620431900024,
        0.06631744652986526,
        -0.04077795147895813,
        0.03485695272684097,
        -0.052973031997680664,
        0.037697382271289825,
        0.02035658434033394,
        0.0817452222108841,
        0.023033658042550087,
        0.027390580624341965,
        -0.017952963709831238,
        -0.02063257247209549,
        -0.05641055852174759,
        0.01361409667879343,
        0.005724698770791292,
        0.0910956934094429,
        0.02918923832476139,
        -0.013353143818676472,
        -0.03357693925499916,
        -0.11246710270643234,
        0.0007964426185935736,
        -0.04627379775047302,
        0.01238130871206522,
        0.013991639949381351,
        0.05165566876530647,
        -0.0630640909075737,
        0.01853160746395588,
        -0.05099020525813103,
        -0.005193463992327452,
        0.02579943649470806,
        -0.00781821459531784,
        -0.018689608201384544,
        0.00024778812075965106,
        -0.12431134283542633,
        -0.015454025007784367,
        -0.05694406479597092,
        -0.01704687811434269,
        0.04279334098100662,
        -0.05549478158354759,
        0.04103592410683632,
        0.0842670351266861,
        0.023401008918881416,
        -0.019583050161600113,
        0.0340285450220108,
        -0.006767781917005777,
        -0.06861298531293869,
        0.06753452867269516,
        -0.011875372380018234,
        -0.05610131844878197,
        0.035565633326768875
    ]
}