{
    "id": "e3HFRlrQxH4",
    "title": "How to build a MASSIVE Raised Garden - For Wheelchair Users!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-04-24T13:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=e3HFRlrQxH4",
    "category": "Howto & Style",
    "tags": [
        "Raised garden",
        "accessible garden",
        "raised flowerbed",
        "railroad tie garden",
        "DIY Raised garden",
        "flower garden",
        "garden",
        "raised bed",
        "redwood planter box",
        "diy planter",
        "how to garden",
        "how to build a flower bed",
        "wheelchair accessible garden"
    ],
    "views": 1500557,
    "likes": 56911,
    "comments_count": 4859,
    "description": "Building a large raised garden was something Cambry and I have wanted to do for awhile. And what a better time to start gardening... than the present? Hopefully we can get something to grow out of our raised flower beds. We used 2x12 redwood boards for this project, each 12 feet long. The inner measurement of each finger is 4 feet exactly, and the 'pathway' between fingers is 3ft 9inches.  And the total length of the back side is 28 feet. We were able to build it in a weekend, but it took a LOT of dirt to fill up. Let us know what we should plant! We need tips!   Watch the first year update HERE:   Follow Cambry here for updates:  And thanks to the Cox Clan for the extra hands:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/etHEgZtjRWE",
        "https://www.instagram.com/cambrykay/",
        "https://www.youtube.com/channel/UCz3sZ60GvY7kfyUGejoCOCw",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "-[Zack] So one of our quarantine activities that we already had planned before this whole thing happened was to build a garden in our backyard. We have some chickens right here next to like a little barn that we're going to put some horses in later. But we have this little area where we want to build...what is it called? -[Cambry] An accessible garden. -An accessible garden...but with like raised platforms in it so that Cambry can reach all of the vegetation... -Beds... -...without having to like bend over toward the ground. -Or get out of my wheelchair. -Right. It just makes it a lot easier. So we have an idea and I hope it works. But first we have to make sure this whole place is level. Remember what we do next? -Let's get started. [Intro] -There used to be a bunch of weeds back here but we piled them all up and burned them which looked pretty cool. -Zack, should we control it?? -I don't know! [Music] [Zack] So we've been planning on making this garden for...ever since we got this house. And now is the time. And it's like the first really warm day of the year. And I think we've already missed a couple of the planting vegetable things. -Yeah, I think we're a little, yeah, delayed on when we were supposed to plant them but we'll still get some garden in. -As you can see we're not experts at this so we're just kind of hoping for the best. What we're really trying to accomplish though is build it in a way that Cambry can use every single inch of it. -Alright, so the plan is to raise the beds up so that I'm not having to get out of my wheelchair onto the ground to try and like weed and trim and whatever else you have to do for plant life. Anyways, so we're going to lift it up so that it's about my height. They're about 2 feet off the ground, so I can reach over and grab the plants and weed and take care of them and water them. And it'll be at a level that's not staining on my back. We're not going to put concrete down. I'm not sure what we're going to put down, but we're going to make... -Pavers. -...Yeah, pavers between the aisles and around the beds so it's totally accessible for my wheels and I'm not getting stuck in the dirt. -One cool thing is we chose to go with redwood for the outside of this because redwood apparently.. -...is pretty! -...Looks really good, but it's also a hardwood that bugs don't like to eat for some reason. -Something with the chemical makeup. -But it's also...it can last for 30 years out in the elements. Which, we know, it's a flower garden...it's going to be a vegetable garden...it's going to be outside in the elements for hopefully 30 years. Hopefully it stands up that long. -If you compare it to pine, it's not treated. Because you don't want it to be treated, it's not good for the soil. But if you were to do a pine flowerbed, it can only last like 5 years untreated. -And we don't want to use chemical wood. Remember I built my large table saw table thing out of treated wood. Some parts of it. And there's like chemicals and stuff in there that we just don't want around our vegetables. So we decided to go with 2x12's because we knew that Cambry's wheelchair wheels are about 2 feet tall and we don't want to have her leaning over a whole lot when she's working in the garden. And the less pieces of wood that we have to work with, the faster the project goes. So two by twelves by 12 feet long is what we decided to go with. So right now this is where the dirt's going to go. And this is going to be an aisle where we can walk and, you know, have wheelchair access. This board right here is going to be the start of the next dirt finger. Redwood is probably the most expensive kind of wood, but because it lasts for so long, we splurged a little bit and got it. Also, when you're working with wood it has a tendency to bow or, you know, flex in certain directions, so we're using these metal plates to hold the boards together lengthwise and at the joints where we but two of them together to keep them from separating. The metal plates hold them in place much better than a screw or a nail would. So right now we're getting closer to finishing these fingers. So once again, this is going to be where dirt goes. And right now we're just propping it up on spare boards that we have that we're going to use as braces in a minute. And that just keeps it level while we are getting the sides square. We're using a 4x4 at each of the joints that we can just screw into from either side to keep the joints solid. And then here we can put it on the inside of the flowerbed. So we are finished with the construction for the most part. We just need to add supports on the inside to keep it from bowing out when we add the dirt. We are putting this black cloth between the seems, so you know, a couple years down the road if the boards ever do warp a tiny bit, we won't have dirt seeping out through the sides. So that's where we're at. Almost done. So here's a quick little update. Right now we have these boards in the center to keep the sides from bowing out if there's too much dirt inside. -And then we put in our first layer of dirt and the rest is soon to come. -So the dirt we added up to this point has just been like dirt we scraped down from when we were building this uh...flower pot...large flower pot. -Veggie garden! -And my brother in law is going to take the camera and show how we get the manure for this project. Cambry works at a barn that has a lot of horses, and these horses have been generating... -A lot of compost! -A lot of compost. So you can't use fresh horse manure. It has to be marinating for a while...? I don't know, I'll let Riley explain a little bit more. He's my brother in law and he's going to be the one in charge of showing how the compost works. -[Riley] That's right. I'll go get the good stuff. Let's get started! So I'm here picking up the compost for the garden boxes and this behind me is a massive mountain of compost that has been sitting for over a year, just marinating and breaking down, making it the perfect compost for a garden. When you're planting a garden what you really want is, you want it to be really moist and you want to keep moisture down at the roots of what you're planting. And that's what this manure or compost is really for. It's better than just dirt that you'll find on the ground because dirt is really dry. This compost really holds in the moisture and makes it a lot better for planting stuff. We have probably enough for now. We got our trailer full and our truck bed full. I mean look how low that is to the ground. That's a ton of weight right there so we're just going to haul it off and start throwing it in the garden boxes. Here we go. Also make sure to subscribe to the Cox Clan. Those are the guys who have worked hard to give us the compost. All of it came from them. And those ones. [Music] -So we are done. The wood is laid and the dirt is in place. Now what? -Now I gotta plant something. -If you guys have any suggestions for us leave them down in the comments. We are new at this whole garden thing. -Any tricks of the trade. We don't have green thumbs yet. -We are going to add pavers down here eventually so it'll be a little bit smoother. But let's see if Cambry can reach all the way across, or halfway. Perfect! -Almost more than halfway. -So now we know Cambry can reach every square inch of the garden no matter where she's at. She can be in this aisle and reach these legs, or around the backside there's room for her back there as well. -Can't wait for it to grow. -So we will make an update video in the fall when we harvest...if we get any harvest. -Some of our things I think that we thought about planting, it takes like two years, so we'll see. -But we'll still get, I mean, we want to do corn and like the basics, and carrots, and those will all be this year. Anyway, cross your fingers for us. -Let us know what you think we should plant. We're open to suggestions, since we're new at this. -I think it's pretty impressive that the wood managed to stay in one shape. There's probably like 10-15,000 pounds worth of dirt in there. Which I do have an idea if it does start to bow out. I can use something called All Thread with brackets on either side. But I'll make a video about that if this does, you know, start to bow in the future. -But it looks like it's holding up pretty good. -So far. We'll see. Cambry will be doing updates on her Instagram throughout the year if you want to see our progress: @CambryKay. And thanks a ton for watching. We'll see you around.",
    "transcript_keywords": [
        "garden",
        "dirt",
        "Cambry",
        "compost",
        "wood",
        "quarantine activities",
        "lot",
        "years",
        "accessible garden",
        "make",
        "put",
        "ground",
        "reach",
        "year",
        "planting",
        "thing",
        "plant",
        "build",
        "boards",
        "Cambry can reach"
    ],
    "transcript_entity_values": [
        "4x4",
        "All Thread",
        "the Cox Clan",
        "every square inch",
        "the year",
        "Cambry",
        "Instagram",
        "two",
        "5 years",
        "12 feet",
        "two years",
        "a minute",
        "2x12",
        "a ton",
        "Redwood",
        "this year",
        "30 years",
        "first",
        "10-15,000 pounds",
        "Riley",
        "about 2 feet",
        "one",
        "a couple years"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "DATE",
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "DATE"
    ],
    "vector": [
        -0.012076832354068756,
        -0.05562308803200722,
        0.025893893092870712,
        -0.052330754697322845,
        -0.019179871305823326,
        -0.041052140295505524,
        -0.015393964946269989,
        0.02741863951086998,
        -0.05830001458525658,
        0.08142553269863129,
        0.02793673239648342,
        -0.014150036498904228,
        -0.059147898107767105,
        0.02737574838101864,
        0.0064620645716786385,
        0.1038668155670166,
        -0.028068192303180695,
        0.027569420635700226,
        -0.0651988536119461,
        0.09041056782007217,
        0.013183549977838993,
        -0.00732186296954751,
        0.053787700831890106,
        -0.0179972592741251,
        -0.07489573210477829,
        0.022053303197026253,
        -0.06154455244541168,
        0.00835800264030695,
        -0.009511289186775684,
        -0.014408488757908344,
        0.04749305173754692,
        0.07740697264671326,
        -0.048079684376716614,
        -0.03999866917729378,
        0.03530777990818024,
        0.0444500707089901,
        0.017041118815541267,
        -0.043790195137262344,
        -0.05702851712703705,
        0.016504773870110512,
        -0.055859796702861786,
        -0.00679166242480278,
        0.0684070959687233,
        0.027432499453425407,
        -0.012715265154838562,
        0.007646426558494568,
        0.04778607562184334,
        -0.016969917342066765,
        0.10148601979017258,
        -0.10558812320232391,
        0.017228897660970688,
        -0.058733005076646805,
        0.036661744117736816,
        -0.04165493696928024,
        -0.0371955968439579,
        0.00822148285806179,
        -0.0607747845351696,
        -0.03945471718907356,
        -0.013137312605977058,
        -0.05649379640817642,
        0.09765475243330002,
        0.027389883995056152,
        -0.03685145825147629,
        -0.056388240307569504,
        -0.043725792318582535,
        -0.0406055822968483,
        -0.06254807859659195,
        -0.07171344757080078,
        0.031494561582803726,
        -0.00994919054210186,
        -0.03480188176035881,
        0.0010915520833805203,
        -0.0026357320602983236,
        -0.0019977670162916183,
        -0.051517173647880554,
        -0.02280612103641033,
        0.004383297637104988,
        0.04981512576341629,
        0.05667450278997421,
        -0.008406342007219791,
        0.04766297712922096,
        0.0799160823225975,
        0.03351807966828346,
        0.07465751469135284,
        -0.013304178602993488,
        0.05110309273004532,
        -0.052677106112241745,
        0.15751054883003235,
        -0.06946688145399094,
        -0.04883969575166702,
        0.05891037359833717,
        -0.05774306878447533,
        -0.07734911143779755,
        0.02407558634877205,
        -0.05383620038628578,
        0.01856772042810917,
        -0.03788213059306145,
        -0.16769973933696747,
        -0.045454055070877075,
        0.004930341150611639,
        -0.01668698526918888,
        0.04113525524735451,
        0.06873872131109238,
        -0.06968188285827637,
        0.028663085773587227,
        0.030972959473729134,
        -0.06777270883321762,
        0.04311621934175491,
        0.026754001155495644,
        0.08302821964025497,
        0.02467622235417366,
        -0.0651412159204483,
        -0.07698778063058853,
        0.12152933329343796,
        -0.022964168339967728,
        0.0564894936978817,
        -0.032745733857154846,
        -0.06912101805210114,
        0.011717279441654682,
        0.017054632306098938,
        0.025654006749391556,
        -0.002262241207063198,
        -0.018285606056451797,
        0.009394487366080284,
        0.039391644299030304,
        0.047348812222480774,
        -0.010299918241798878,
        1.3216071506857959e-34,
        0.0070732356980443,
        0.12007477879524231,
        0.028241198509931564,
        0.05244087055325508,
        0.08544944226741791,
        -0.0342164970934391,
        0.040151726454496384,
        -0.03304089605808258,
        -0.04720127210021019,
        0.033099714666604996,
        0.021418321877717972,
        -0.03348736837506294,
        -0.010016778483986855,
        -0.02539963088929653,
        0.002631399082019925,
        -0.08974801003932953,
        -0.04935741424560547,
        -0.025040358304977417,
        -0.05690760165452957,
        -0.004975378978997469,
        0.03487221896648407,
        -0.06781252473592758,
        0.0027277199551463127,
        0.08579248934984207,
        0.1024506613612175,
        -0.05865975841879845,
        0.041107382625341415,
        0.015026068314909935,
        0.07916092127561569,
        -0.01852336712181568,
        -0.029114851728081703,
        -0.06942354142665863,
        -0.03204617276787758,
        -0.013140221126377583,
        -0.022485880181193352,
        -0.06262066960334778,
        0.03146529942750931,
        -0.09219148755073547,
        -0.0159969050437212,
        -0.029407672584056854,
        0.025623539462685585,
        0.03928109630942345,
        0.07224541157484055,
        -0.09504405409097672,
        0.01902714930474758,
        0.015424259938299656,
        0.050547562539577484,
        0.04269922897219658,
        -0.027458783239126205,
        -0.017614997923374176,
        0.01780688390135765,
        0.0753999799489975,
        0.019899887964129448,
        -0.04113228619098663,
        -0.055867958813905716,
        -0.010239189490675926,
        0.016959140077233315,
        0.00944015197455883,
        -0.004841914400458336,
        0.06102686747908592,
        0.030304253101348877,
        -0.04141060262918472,
        -0.016892530024051666,
        0.04221751168370247,
        -0.029040642082691193,
        -0.056093934923410416,
        -0.05560898408293724,
        0.03718966990709305,
        -0.014284949749708176,
        0.06376034021377563,
        0.06004094332456589,
        -0.054504867643117905,
        0.04977894574403763,
        0.014940178021788597,
        -0.00103049969766289,
        0.01645495742559433,
        -0.017805173993110657,
        0.024010201916098595,
        -0.05076463893055916,
        0.06783833354711533,
        -0.03678683564066887,
        0.07623537629842758,
        -0.050895798951387405,
        -0.0032173909712582827,
        0.06707035005092621,
        -0.07444722205400467,
        -0.06653023511171341,
        0.020359858870506287,
        -0.08517377078533173,
        -0.06342931091785431,
        -0.026007194072008133,
        -0.0004788716905750334,
        -0.017142433673143387,
        -0.0430520735681057,
        -0.07521458715200424,
        -2.1430263022398423e-33,
        0.0038497750647366047,
        0.08736886829137802,
        0.03202660009264946,
        -0.07349687814712524,
        0.04240257292985916,
        -0.02077101543545723,
        0.012989314272999763,
        -0.03219379857182503,
        0.05571771785616875,
        -0.055887024849653244,
        -0.11465292423963547,
        0.1420212686061859,
        0.06125826761126518,
        -0.020404193550348282,
        -0.03501579165458679,
        -0.03964994102716446,
        -0.013683918863534927,
        0.03332354873418808,
        0.02820914052426815,
        0.04630567133426666,
        0.04064013436436653,
        0.09171739220619202,
        0.0109631959348917,
        0.024798152968287468,
        -0.03311799839138985,
        -0.0028277081437408924,
        0.017184747382998466,
        0.018486401066184044,
        -0.031704287976026535,
        0.012929324992001057,
        -0.013012932613492012,
        -0.14210020005702972,
        0.06017057225108147,
        -0.015189174562692642,
        -0.05283952131867409,
        -0.04072647541761398,
        -0.05415771156549454,
        -0.06521307677030563,
        0.03846912086009979,
        -0.014620472677052021,
        0.10843726992607117,
        -0.064582459628582,
        0.0062166727147996426,
        -0.019481990486383438,
        0.001401324407197535,
        -0.11602665483951569,
        -0.09654504805803299,
        0.05661297217011452,
        -0.03249211236834526,
        -0.02185950241982937,
        -0.022733379155397415,
        0.046161945909261703,
        0.003449665615335107,
        -0.017422260716557503,
        0.0728030726313591,
        -0.04945441707968712,
        0.06431600451469421,
        -0.04579129070043564,
        0.011989077553153038,
        0.0223682951182127,
        -0.10529544949531555,
        0.006566198542714119,
        -0.04555541276931763,
        0.07802188396453857,
        -0.0033841682597994804,
        0.024026047438383102,
        0.01925700344145298,
        -0.009201169945299625,
        -0.08412497490644455,
        0.038031697273254395,
        -0.0854252353310585,
        0.017916154116392136,
        0.05796461179852486,
        0.0014931894838809967,
        0.02414652891457081,
        -0.02580655924975872,
        0.059319667518138885,
        0.04588383436203003,
        0.12187177687883377,
        -0.041678592562675476,
        -0.009085002355277538,
        -0.06936848908662796,
        0.035397063940763474,
        0.016087761148810387,
        0.09837992489337921,
        0.04097090661525726,
        0.00450409110635519,
        0.0372433140873909,
        -0.0287995096296072,
        0.07512583583593369,
        0.032184306532144547,
        0.036455798894166946,
        0.06392040103673935,
        0.043174002319574356,
        0.0888223946094513,
        -5.5051305736242284e-08,
        0.03221238777041435,
        0.09289224445819855,
        -0.032958488911390305,
        -0.04448974132537842,
        0.004913645330816507,
        -0.05274709314107895,
        0.04579135403037071,
        0.04307166114449501,
        -0.01721193455159664,
        -0.0064234682358801365,
        -0.036162156611680984,
        0.011578396894037724,
        0.017159799113869667,
        0.11086051911115646,
        -0.005461966153234243,
        0.018266592174768448,
        0.026051277294754982,
        0.029450707137584686,
        -0.07047536224126816,
        -0.01571684330701828,
        0.0032011824660003185,
        -0.033922597765922546,
        0.015208913013339043,
        0.06946875154972076,
        -0.01795644499361515,
        0.00197804206982255,
        -0.07312951236963272,
        -0.05409106984734535,
        -0.05261869728565216,
        0.009914809837937355,
        0.07657893002033234,
        0.0028899195604026318,
        -0.07620953023433685,
        0.07615552097558975,
        -0.0922476127743721,
        -0.04276829585433006,
        -0.09523247927427292,
        0.00873970054090023,
        0.010644323192536831,
        0.09809248894453049,
        -0.02971598319709301,
        -0.0019274808000773191,
        -0.03150723874568939,
        -0.03936631977558136,
        -0.06408736109733582,
        0.03575285151600838,
        -0.08843806385993958,
        0.010742658749222755,
        -0.0405048243701458,
        0.014503930695354939,
        0.006785974837839603,
        -0.03407718241214752,
        0.053515203297138214,
        -0.024312805384397507,
        0.055191680788993835,
        0.08831137418746948,
        -0.004328433889895678,
        0.026714032515883446,
        0.022131262347102165,
        0.06396252661943436,
        -0.01367472019046545,
        -0.0006859796121716499,
        -0.04397299513220787,
        0.0258045494556427
    ]
}