{
    "id": "E4qnrEXW5ls",
    "title": "The Phone With A Periscope: Huawei P30 Pro Hands-On",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-03-26T13:30:18Z",
    "video_url": "https://www.youtube.com/watch?v=E4qnrEXW5ls",
    "category": "Science & Technology",
    "tags": [
        "huawei p30 pro hands-on",
        "huawei p30 hands-on",
        "huawei p30 pro review",
        "huawei p30 review",
        "periscope phone",
        "best camera phone 2019",
        "best smartphone 2019",
        "best phone camera 2019",
        "mrmobile",
        "michael fisher",
        "android central",
        "technobuffalo",
        "smartphones"
    ],
    "views": 382693,
    "likes": 11122,
    "comments_count": 931,
    "description": "Sponsored by dbrand. Get your Huawei P30 Pro skins here:     [HUAWEI P30 PRO HANDS-ON]  It was three years ago that Huawei and its partner Leica Camera promised a renaissance in mobile photography  to which I remember reacting with a shrug and an eye-roll. But I had to eat crow when Huawei released last years P20 Pro and Mate 20 Pro, smartphones with cameras so good they stayed in my pocket long after my reviews went up. Today, Im in Paris to see the sequel to those smartphones officially announced  and if it lives up to its promises, it could be the best camera phone of 2019. Join me for a first look at the Huawei P30 Pro!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S HUAWEI P30 PRO HANDS-ON]  MrMobile's Huawei P30 Pro Hands-On was produced following two hours with Huawei P30 Pro review devices in New York City, NY and Paris, France. Preproduction devices running prerelease software.  DISCLOSURE: Huawei provided travel and lodging for the Paris segment of the P30 Pro launch to some members of the media, including MrMobile. No additional compensation was sought or furnished.   [LINKS]  Huawei P30 Pro Hands-On [Android Central]:   Huawei P30 Pro Hands-On [TechnoBuffalo]:   Bayer Filter [Wikipedia]:   Bayer Filter image credit [CC-Attribution ShareAlike 3.0 Unported License]:     [MUSIC]  Live Up by Cymatix, available at Premium Beat:   As Science Progresses by Aulx Studio, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   See additional disclosures above.  #huawei #p30pro #huaweip30pro #p30 #smartphones #tech",
    "description_links": [
        "https://dbrand.com/mrmobile-p30",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.androidcentral.com/huawei-p30-preview",
        "https://www.technobuffalo.com/huawei-p30-pro-review",
        "https://en.wikipedia.org/wiki/Bayer_filter",
        "https://commons.wikimedia.org/wiki/File:Bayer_pattern_on_sensor.svg",
        "https://www.premiumbeat.com/royalty_free_music/songs/live-up",
        "https://www.premiumbeat.com/royalty-free-tracks/as-science-progresses",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Narrator] It was three years ago that Huawei promised a renaissance in mobile photography, to which I think most of us reacted kinda like this. - Sure, Jan. - [Narrator] But I had to eat crow when Huawei released last year's P20 Pro and Mate 20 Pro, smartphones with cameras so good that they stayed in my pocket long after my reviews went up. Right now, I'm in Paris to see the sequel to those smartphones break cover and if it lives up to its promises, it could be the best camera phone of 2019. I'm Mr. Mobile and this is a first look at the Huawei P30 Pro, sponsored by dBrand. (upbeat music) There are actually two P30s launching today and if you're trying to tell the Pro apart from the amateur, look no further than the square view port for the number three camera. What you can't see is that this is actually just the facing side of a prism that reflects light 90 degrees through five lenses into a camera sensor mounted close to the center of the phone. I can't wait to see the JerryRigEverything tear down on this. The reason for all those internal acrobatics, zoom. See, where your typical iPhone or Galaxy only offers a 2X telephoto lens, the P30 Pro can magnify subjects up to five times. That's purely optical. Mix in a little digital magic and you can get up to 10X in hybrid zoom mode or if you wanna go full Huawei, you can crop all the way in to an insane 50X. As you can see, the optical stabilization won't help you much at this level and the quality nose dives, but just being able to get this much magnification to see the words New York on the New York Public Library, down the street from where we got our briefing, when, to the naked eye, you can barely make out there are any words there at all, it's incredible. The primary camera also gets a total redesign. See, most smartphone cameras create a color image using something called a Bayer Filter, where red, blue and green photo sensors replicate the physiology of the human eye. For the P30 Pro, Huawei and its partner, Leica, swapped out the green elements for yellow ones. Why? Because yellow lets a lot more light into the camera system, 40% more, to be precise. Huawei was already decimating almost everyone in low light photography before this. With this modification, the company could retake the lead from Google's Pixel 3. By the way, some of these photo samples came from my friends at TechnoBuffalo. If you wanna see more, I'll link you to them in the comments. Long time viewers will not be surprised to hear that the third camera is my favorite. It's an ultra wide angle shooter, similar to the one from the Mate 20 Pro, with a field of view greater than 120 degrees, so you can capture everything in front of you or push in to as close as two and a half centimeters for a macro shot of a tiny subject. Unlike the other two cameras, there's no optical stabilization on this one and the jury is still out about wide angle video. If you recall from the Mate 20 Pro, the frame rates suffered quite a bit when rolling with the wide angle camera. So, let's keep our optimism cautious. And while we're coming down from the spec high, I wanna say that Huawei calling this the first Leica quad camera requires a generous interpretation of the term camera. The fourth port on the back here is actually a time of flight sensor that Huawei says should help with AR applications and better portrait photos, but honestly, I have yet to see perfect portraits or even consistently good portraits from any phone, even though, every year, that's exactly what manufacturers promise. Also remaining to be tested in the full review, video Superzoom and AI HDR Plus. The latter, though, is promised to function on the new 32 megapixel selfie camera, as well, which after making a few stupid faces at it, I can say, appears to correct the softening problem of last year. I'll be taking pictures with this thing for a few days in Paris. Follow me on Instagram for live impressions, more stupid faces and even a peek behind the curtain at what it takes to record VO in a hotel room. It ain't pretty. Okay, by now, someone's already commented complaining about how there's more to a phone than a camera. So, let's hit up the rest of the P30 Pro. Plenty of features have come over from the Mate 20 Pro and, by and large, that's good news. The giant 4200 milliampere-hour battery, wireless charging and also, wireless reverse charging. Sadly, still peaked at 2.5 watts, though. There's still expandable storage in the form of Huawei's new nano memory format, an optical fingerprint sensor under the screen means the ugly chin of yesteryear is nowhere to be seen and on the other side of the display, up here, Huawei also shrank the notch by omitting the earpiece. That's right, there's no earpiece at all. We've seen this tech before from LG and Xiaomi. Usually it means the phone vibrates the display to stand in as a speaker. I'll have to reserve judgment until I'm able to make a phone call on it, but I've never heard an acoustic display sound as good as a dedicated earpiece, so, we'll see. I'm not gonna talk about these gorgeous casing colors because well, you've been looking at 'em this whole time anyway, right? So let me, instead, touch on display and software before we get outta here. The former is taller by 100 pixels and sticks to FHD+ instead of trying for more sharpness, which should help the phone keep up Huawei's reputation for excellent battery life. Also helping with that is the company's eyesore, I mean, custom interpretation of Android, EMUI 9.1. Look, I'm probably never gonna be into the look and feel of this software, but more important than the looks, Huawei has changed the file system underneath for the second time in three years. Why? Well, to achieve a claimed 20% faster read performance, which should help the P30 Pro respond to touches and launched apps faster. It should also help the P30 Pro live up to a pretty important promise. Huawei's been selling the motto, Born Fast, Stay Fast for a while now and it means the phone is guaranteed to feel just as fast 18 months after you buy it as the day you took it out of the box. Now that's a pretty lofty claim, but I've got some old Huaweis lying around and they haven't slowed down nearly as much as devices from other manufacturers. Pricing and availability deets are hitting the internet about the same time this video does, folks. I'll drop 'em below, but this being one of the two most important phones of the year from Huawei, you can count on two things. It won't be cheap and it won't be coming to the U.S. It will be the most important phone you'll hear about for a while that doesn't fold like a magazine, though, so make sure you're subscribed to the Mr. Mobile on YouTube and you won't miss my full review on it. Finally, I'm happy to be able to say that dBrand will be offering product for the P30 Pro. These are the premium vinyl skins that let you protect that glass back using patterns from camouflage to carbon fiber and everything in between. You know the drill. Hit the link in the description to order yours and thanks to dBrand for sponsoring this video. Drop your questions on the P30 Pro below, folks. I'll do my best to start answering them the second I pick up a device, which should be very soon indeed and be sure to keep an eye on the description and the comments. As soon as I have proper pricing and availability, I'll be dropping them there. Until next time, thanks for watching and stay mobile, my friends. (slow music)",
    "transcript_keywords": [
        "Pro",
        "Huawei",
        "camera",
        "phone",
        "reacted kind",
        "time",
        "Mate",
        "cameras",
        "Pro live",
        "mobile",
        "Huawei released",
        "York Public Library",
        "smartphone cameras",
        "camera phone",
        "years ago",
        "year",
        "full Huawei",
        "smartphone cameras create",
        "optical",
        "Huawei promised"
    ],
    "transcript_entity_values": [
        "the P30 Pro",
        "Huawei",
        "32 megapixel",
        "third",
        "Jan.",
        "last year's",
        "Instagram",
        "Superzoom",
        "Xiaomi",
        "2.5 watts",
        "20%",
        "18 months",
        "every year",
        "40%",
        "100",
        "120 degrees",
        "AI HDR Plus",
        "the P30 Pro below",
        "the year",
        "up to five",
        "last year",
        "a few days",
        "YouTube",
        "three years",
        "the Mate 20 Pro",
        "90 degrees",
        "Mobile",
        "Leica",
        "dBrand",
        "today",
        "20",
        "iPhone",
        "Leica",
        "first",
        "Born Fast, Stay",
        "five",
        "Google",
        "U.S.",
        "two",
        "the day",
        "Galaxy",
        "three years ago",
        "Huaweis",
        "Paris",
        "second",
        "2019",
        "the New York Public Library",
        "TechnoBuffalo",
        "fourth",
        "LG",
        "New York",
        "Bayer Filter",
        "2X",
        "4200",
        "three",
        "one",
        "Android",
        "P30s"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "PERCENT",
        "DATE",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "GPE",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT"
    ],
    "vector": [
        -0.08665585517883301,
        0.011061582714319229,
        0.044372256845235825,
        -0.1075548306107521,
        0.05508599430322647,
        -0.04239554703235626,
        0.006058212835341692,
        0.04301014542579651,
        -0.0075538731180131435,
        0.08816346526145935,
        0.11170145869255066,
        0.06373418867588043,
        0.02831406705081463,
        0.03018462285399437,
        0.06979399174451828,
        0.0225398987531662,
        0.042941443622112274,
        -0.12040291726589203,
        0.021229270845651627,
        0.029769370332360268,
        -0.019358661025762558,
        -0.08267658203840256,
        0.06670232117176056,
        0.007109937258064747,
        -0.021807877346873283,
        -0.016001911833882332,
        -0.05969560518860817,
        -0.002385238651186228,
        -0.035529766231775284,
        0.0007417896413244307,
        0.0037059863097965717,
        0.1263233721256256,
        -0.009811380878090858,
        0.013106729835271835,
        0.022149937227368355,
        -0.07179000973701477,
        0.030592402443289757,
        -0.039110925048589706,
        -0.0337340347468853,
        0.01599690690636635,
        0.015325784683227539,
        -0.09615841507911682,
        -0.021820886060595512,
        0.0045273141004145145,
        0.05510958284139633,
        -0.030288109555840492,
        0.04527623951435089,
        0.009455890394747257,
        -0.04074826464056969,
        -0.04497872292995453,
        0.02677937038242817,
        -0.03155539557337761,
        0.006205199286341667,
        -0.07790422439575195,
        -0.10826408118009567,
        0.06817210465669632,
        -0.015034100040793419,
        0.02021421119570732,
        0.047950346022844315,
        -0.014238332398235798,
        -0.03367535397410393,
        0.053430117666721344,
        -0.10348980873823166,
        0.06182192265987396,
        0.00035320050665177405,
        0.04252127557992935,
        0.048230256885290146,
        -0.05976107716560364,
        0.029204899445176125,
        0.014940742403268814,
        -0.05094026401638985,
        0.02855628915131092,
        0.037836648523807526,
        -0.024980109184980392,
        -0.03896863013505936,
        0.053422536700963974,
        0.04025676101446152,
        0.004586860537528992,
        -0.021269958466291428,
        -0.08193463087081909,
        0.04544200375676155,
        -0.04729800298810005,
        -0.048962466418743134,
        -0.03571636229753494,
        0.03572698310017586,
        -0.04816453903913498,
        -0.020293159410357475,
        0.07490570098161697,
        -0.033406179398298264,
        -0.0892094299197197,
        -0.12596216797828674,
        0.06519206613302231,
        -0.16333962976932526,
        0.02666584402322769,
        -0.06842870265245438,
        0.020606329664587975,
        0.0007725445902906358,
        -0.024518713355064392,
        -0.05072522535920143,
        -0.01650586724281311,
        0.005530790891498327,
        0.04641791805624962,
        0.006693280301988125,
        -0.009748158976435661,
        0.0495113767683506,
        -0.049887046217918396,
        -0.03254032880067825,
        -0.03865216299891472,
        -0.016157083213329315,
        0.063657246530056,
        -0.063913993537426,
        0.026247361674904823,
        -0.07804649323225021,
        -0.05419626459479332,
        -0.029998842626810074,
        0.049128711223602295,
        -0.07159855216741562,
        0.027315547689795494,
        0.1044834703207016,
        -0.10139638185501099,
        -0.0004098788776900619,
        -0.053022563457489014,
        -0.0692090094089508,
        -0.052330680191516876,
        0.0031280701514333487,
        -0.013499299995601177,
        0.022801335901021957,
        4.4215151041005066e-33,
        -0.0015757373766973615,
        0.11423375457525253,
        -0.0070020039565861225,
        0.011710981838405132,
        -0.00633135624229908,
        0.02929936908185482,
        0.03867689520120621,
        0.018409758806228638,
        -0.055976502597332,
        -0.021090764552354813,
        -0.04237091913819313,
        -0.038013577461242676,
        -0.06689581274986267,
        0.04083947837352753,
        0.11417722702026367,
        -0.014682821929454803,
        -0.007571783848106861,
        -0.020201601088047028,
        -0.017150647938251495,
        0.010290506295859814,
        0.018099412322044373,
        -0.021775230765342712,
        0.021797433495521545,
        -0.02113158255815506,
        0.038724713027477264,
        0.06065494567155838,
        0.0703120008111,
        0.02801370434463024,
        0.03777134791016579,
        0.0071080406196415424,
        -0.08615347743034363,
        0.021826963871717453,
        0.044673673808574677,
        -0.032180607318878174,
        -0.017628302797675133,
        0.027780866250395775,
        -0.037573281675577164,
        -0.09269320964813232,
        -0.04006936028599739,
        0.002394702285528183,
        0.02780519612133503,
        0.06248386949300766,
        -0.08318735659122467,
        -0.03868449106812477,
        0.030251910910010338,
        -0.021162593737244606,
        -0.05512344092130661,
        0.05156775936484337,
        -0.014457369223237038,
        0.011241697706282139,
        0.008498143404722214,
        0.005666032433509827,
        -0.11133546382188797,
        0.0003663529932964593,
        -0.06728728115558624,
        -0.002622511237859726,
        -0.02822633646428585,
        -0.019083520397543907,
        -0.0034885781351476908,
        0.013835486024618149,
        0.1005767285823822,
        -0.014927005395293236,
        -0.04504934698343277,
        0.044232532382011414,
        -0.01642429456114769,
        0.04699590057134628,
        0.02381782792508602,
        0.04614485800266266,
        -0.03902209922671318,
        0.09649185091257095,
        -0.027033638209104538,
        -0.05957510694861412,
        0.004572547972202301,
        -0.07520514726638794,
        0.12263830751180649,
        0.046562425792217255,
        -0.04965759068727493,
        -0.005797913763672113,
        -0.0026525696739554405,
        0.03603589907288551,
        -0.05938822403550148,
        0.08375407010316849,
        0.061598096042871475,
        0.030313750728964806,
        -0.027788490056991577,
        -0.011870178394019604,
        0.04397053271532059,
        -0.0008113372605293989,
        -0.04596739634871483,
        0.03683142736554146,
        -0.004581622779369354,
        -0.05395464971661568,
        0.07810867577791214,
        0.08951689302921295,
        -0.010662962682545185,
        -6.047681866742566e-33,
        -0.012886176817119122,
        0.012279095128178596,
        0.018596194684505463,
        -0.06797061115503311,
        -0.0036514410749077797,
        -0.10260839760303497,
        0.12082838267087936,
        0.07239118218421936,
        0.04154672473669052,
        -0.050616759806871414,
        -0.005528249777853489,
        -0.03136331960558891,
        0.04033087566494942,
        -0.029491407796740532,
        -0.010324569419026375,
        0.004526231437921524,
        -0.02659054845571518,
        -0.07779410481452942,
        0.019197529181838036,
        0.05826684087514877,
        0.06263507157564163,
        0.03326942399144173,
        0.012594442814588547,
        0.05127204954624176,
        -0.07823871821165085,
        0.0007574853370897472,
        0.0690048336982727,
        -0.0183669775724411,
        -0.017523616552352905,
        -0.1203632652759552,
        -0.006870246026664972,
        -0.057085514068603516,
        0.02748703956604004,
        0.02401159331202507,
        0.06417311728000641,
        0.0182317066937685,
        -0.020905235782265663,
        -0.02905699424445629,
        0.04033413901925087,
        0.05117030441761017,
        0.0207150187343359,
        0.03904864564538002,
        -0.015769414603710175,
        -0.011821356602013111,
        0.038299936801195145,
        -0.03182895854115486,
        -0.03782859072089195,
        -0.05456685647368431,
        -0.022983483970165253,
        0.005662433337420225,
        0.037906065583229065,
        0.05472462996840477,
        -0.06617619097232819,
        0.0469198115170002,
        -0.04092947766184807,
        -0.04854852333664894,
        -0.008509577251970768,
        -0.08570273965597153,
        0.004491541069000959,
        -0.01793360337615013,
        0.02207851968705654,
        0.04714369773864746,
        -0.047873299568891525,
        -0.004565591923892498,
        -0.07835111021995544,
        0.009965462610125542,
        0.05683271959424019,
        0.025412777438759804,
        0.004191431682556868,
        0.07867752760648727,
        -0.010768108069896698,
        0.038630567491054535,
        -0.1056913435459137,
        0.009118064306676388,
        0.04956559091806412,
        0.0011529292678460479,
        -0.07750474661588669,
        0.07055381685495377,
        0.0917990580201149,
        0.016935698688030243,
        0.008064339868724346,
        0.01432022638618946,
        -0.008774044923484325,
        0.04220784455537796,
        0.060405928641557693,
        -0.004700226243585348,
        -0.0030018731486052275,
        -0.06475839763879776,
        0.01457063015550375,
        0.03451038524508476,
        -0.011881453916430473,
        -0.02862202376127243,
        -0.10183135420084,
        0.07996191084384918,
        0.0319887213408947,
        -4.834332756331605e-08,
        0.07667198777198792,
        0.033472903072834015,
        -0.011804867535829544,
        0.019441921263933182,
        -0.005813614930957556,
        -0.12949921190738678,
        0.023074710741639137,
        0.03292097523808479,
        0.11782572418451309,
        -0.021340977400541306,
        0.009781529195606709,
        -0.08318199217319489,
        -0.03812938928604126,
        -0.008277595043182373,
        -0.021552274003624916,
        0.07010788470506668,
        0.03964455798268318,
        0.046059366315603256,
        -0.019131727516651154,
        0.01504037156701088,
        -0.011570910923182964,
        0.05802826210856438,
        0.024464638903737068,
        -0.07904569059610367,
        0.04857493191957474,
        -0.00812479667365551,
        -0.1094718798995018,
        -0.06653855741024017,
        0.008264580741524696,
        0.004633274395018816,
        -0.003231122624129057,
        -0.026319283992052078,
        -0.021428745239973068,
        -0.01896786130964756,
        0.039467744529247284,
        0.006963466294109821,
        0.03809092938899994,
        -0.015459741465747356,
        0.08527633547782898,
        0.02809327282011509,
        0.06898808479309082,
        -0.09373719245195389,
        -0.02852490544319153,
        0.025235779583454132,
        0.07581400126218796,
        -0.036879006773233414,
        -0.010036615654826164,
        -0.12866704165935516,
        -0.06441541761159897,
        0.06089746206998825,
        -0.06895925104618073,
        0.0016878382302820683,
        -0.007951418869197369,
        -0.05650728568434715,
        -0.003992022480815649,
        0.007001694291830063,
        0.029548443853855133,
        -0.07052894681692123,
        -0.08735083788633347,
        0.037515025585889816,
        0.09522803127765656,
        -0.06613662093877792,
        0.03895267844200134,
        0.0909561887383461
    ]
}