{
    "id": "E9-x3jRSQvQ",
    "title": "How to Build a Gaming PC in 2020",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-02-29T18:07:39Z",
    "video_url": "https://www.youtube.com/watch?v=E9-x3jRSQvQ",
    "category": "Science & Technology",
    "tags": [
        "how to build a gaming pc",
        "how to build a pc",
        "building a gaming pc",
        "how to build a computer",
        "gaming pc",
        "gaming computer",
        "pc",
        "computer",
        "gaming pc build",
        "building a pc",
        "pc build",
        "2020",
        "austin evans",
        "this is",
        "tutorial",
        "how to",
        "tech",
        "micro center",
        "gaming pc parts"
    ],
    "views": 7986726,
    "likes": 236533,
    "comments_count": 16107,
    "description": "Welcome to our 2020 tutorial on how to build a gaming PC!  Get a Free 32GB Flash Drive and 32GB Micro SD Card:  Micro Center:  AMD Ryzen 5 3600X:  ASUS B450M-PLUS TUF Gaming Motherboard:  PowerColor Radeon RX 5600 XT Graphics Card:  G.Skill Trident Z Neo 16GB (2 x 8GB) DDR4-3600 RAM:  Inland Premium 512GB NVMe SSD:  PowerSpec 650 Watt Power Supply:  NZXT H510 Tempered Glass Computer Case:   My new podcast The Test Drivers!  Our second channel @This Is!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://rebrand.ly/1d36n",
        "https://rebrand.ly/k2j6yqe",
        "https://rebrand.ly/ekh5jus",
        "https://rebrand.ly/1cecu7y",
        "https://rebrand.ly/xjkmvn0",
        "https://rebrand.ly/c9inyxn",
        "https://rebrand.ly/uojeoxf",
        "https://rebrand.ly/xuwz5ne",
        "https://rebrand.ly/ij8ymeb",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to my 2020 Gaming PC tutorial. Have you ever wanted to build a Gaming PC? Well, you clicked on the right video. So we're here in Tustin, California. At our wonderful sponsored Micro Centers location we're now going to pick out all our components for our build, but I'm also going to show you step-by-step how to actually built it. So, even if you maybe built a computer before, come along with us shall you, shall we, shall us, and shall we build a Gaming PC. When choosing components for a build, the place I always like to start with is the processor. Now this is going to dictate a lot of my other choices for picking different components for my build and really when it comes down to the processor, they're a couple of major choices. AMD and Intel. Now for this specific build, I'm going to be going with the Ryzen 5 3600X. So for this build, I'm going to be using the ASUS TUF B450-Plus. And not only is this a solid mid-range board which is microAT- oh this is microATX. The one I was looking for was right in front of me. (coughs) The thing I like about this, is it not only a solid mid-range board that will fit in our case, which I'll show you in a second, but on top of that, it will support our Ryzen processor, you have M.2 slots. Basically, all the things you would typically look for in a motherboard, this has it, and thanks to our wonderful sponsors at Micro Center, they have a combo deal, so I get like 20 bucks off when I buy this as well the Ryzen processor together. The next component I like to go for is the case. Now once you have your motherboard selected, which in our case, is a microATX board. Means you can pick what size case you want. So there a couple options with our specific build, we could go with a smaller microATX chassis. However, if this is your first time building a PC, actually do generally recommend going with a little bit larger chassis and because this is the H510, means that we have a nice clean aesthetic. It's all white, actually does a good job of kinda hiding your cable management, so it's a little cleaner. And you have tempered glass panel, not bad for 70 bucks. Now when it comes to building a Gaming PC, arguably, the most important component is your graphics card. This is really what powers all your gaming performance. It is a very crucial component, now for this build because we are aiming for something mid-range, I think AMD's brand new Radeon 5600 XT, which I very conveniently have right in front of me, is going to be perfect. At 280 dollars, this should be plenty for- well literally any 1080p gaming you can think of, and even 1440p if you really want to push it. Once you have your graphics card selected and you make sure it will fit in your case, which shouldn't be a problem unless you're working with a very very small case. The next choice to have pick is your power supply. So this is where something like this PowerSpec 650W unit is going to be perfect. Now it depends on you specific sort of system on what kind of wattage and there's actually a couple of features you should pay attention to with the power supply. So one of the which is the actual size. So there are a couple of different models, so there's SFX, which is generally again for very small systems, say smaller power supply, generally a little more expensive. Or you can go with something like a full size ATX supply, which is what 95 percent of people are probably going to want to do. Now this is a really solid option at only 60 dollars, you're not only get a 80 Plus bronze rating, you always want to look for 80 Plus on your power supply, if it's anything lower than that, you're likely getting something very low quality. And a nice little benefit with this, it is a semi-modular supply. Again, tell you a little bit of that later. But essentially, it means your cable management will be a lot cleaner because you'll only plug in the cables that you actually need. As oppose to, stuffing a giant pile of cables in some corner of your case when you're not needing them, this is much better. The next thing to look for it RAM. Now this is an area which is fairly straightforward. So first of all, unless you're building a very budget system, I would recommend at least going with 16 gigs of RAM and beyond that if you're using an Intel processor, the speed is not incredibly important, DDR4 is pretty much all you need. But if you are opt in to go with a AMD Ryzen system like we are, you do want to get something at least a little bit on the faster side of things. Not necessary, it will definitely work with lower speed memory, but if you can get something like this Trident Z Neo at 3600 mhz, it will significantly speed up your performance. And importantly, it also has RGB, so there's that. The next thing you'll need is your storage. Now this is totally up to you, if you want to use a old school mechanical hard drive, by all means go for it. You are going to get a lot of capacity, but they're really slow and at this point, I don't really recommend it unless you want it as a secondary drive. You should really pick up something kind of SSD for your main boot drive. Now you have a couple options here, there the older school status style, which is a bigger kind of SSD that you actually have to mount inside the case, they're generally going to be a little cheaper but they are going to be slower. However, if you're building a new PC today, pretty much every motherboard should support the M.2 NVMe Standard, you'll find that over here, notice that a much smaller SSD, but importantly is going to be significantly faster. Which is why we're going to be going with the Inland Premium SSD, the 512 gig model, which is only 67.99, is well, really fast and really good for 67.99. So that's all you need to build the gaming PC itself, however you're probably going to want a few extra things. So first of all, you're going to need peripherals, so I opted to go with HyperX stuff this time around. So I have the Plusefire Surge RGB mouse, I have the Alloy Orgins keyboard, as well the Cloud Stinger headset. Truly speaking, mousing and keyboard definitely needed. And so it is time to actually build our PC. So we're here at Micro Center, we're actually taking advantage of their workspace, although realistically all you need is a decent sized table and a very rigorous set of tools. Philips Screwdriver. - [Ken] That's it? - That's literally it. So the big reason why I chose to go with this case is because it's so wide open on the inside. So even though the motherboard won't even fill the entire thing up, it's really easy to run cables behind the back of the motherboard and specifically our power supply has a nice little basement to live inside. So the PC opened up, our next step is to work with the power supply. Now this is the semi-modular supply I was talking about earlier, and there was a good reason for that. You see all these extra cables it comes with? Now depending on your build, you may actually want to use some or all of these but odds are you're probably not going to want to plug all of them in. And if we don't have to say plug in five hard drives, we can easily not use that, it will make our cable run a lot cleaner. When you install a power supply, you need to pay attention to where the fan is. So with a case like this, we could actually theoretically put the fan up or down. However, because if you look on the bottom of our case, we have a dust filter, we should have the fan facing down. So all this might look complicated and confusing, however, it's actually not that bad. So let me walk you through a couple of the power connectors that we are going to be using for this build. So if you look for the really big fat guy, this is the 20 plus four pin, this goes into our motherboard, every single PC build is going to need one of these right. Next up, we have our CPU power, so this is a four plus four pin, most of the time you're going to want to put these together and this will also go into the motherboard but for some boards, you may only need four pin, and that's why it breaks apart. You can see it has a little clip on it so it only goes in one way. If you're building a gaming PC, then the next connector is something you're almost certainly going to need and that is the PCI power. Now this is a six plus two pin, so again, depending on your graphics card, it may need six, it may need the full eight and in many cases you're actually going to need multiple of these. Installing our power supply is very straightforward. So with our fan facing down, all we need to do is to slide it into place. If you look inside your power supply box, you should find four tiny little screws. Now this is all we need to use to actually mount the power supply. So if you come a little bit closer here, you can see, there are four different holes, so if I actually line it up (coughs) line it up correctly, there's a whole here, here, here, and here. And all you need to do is screw it in. Now one tip, this is good for PC building but it actually applies to a lot of things. Is to use a cross pattern on your screws, so don't do it super tight, and then instead of going around in a circle. Now that we've got our top left end, we're next going to screw the bottom right. The reason you want to use a cross pattern when you're installing power supplies or really any PC component, is that it applies even pressure. So if you do the left side first, the entire supply might actually be slightly misaligned. This actually just good general advice, if you're putting on like a car tire, you should use a cross pattern. You shouldn't just go around in a circle. Before we start building with the motherboard, let me give you a brief tour what's going on here because at first glance, well there's, a lot of stuff. So, number one thing to pay attention to is this, this is the CPU socket, it is slightly different between AMD and Intel but regardless, you essentially you just drop your CPU in here and I'll explain that in just a second. Now to the right of that, are our memory channels, so these are our dim slots as the kids call them these days. The ram dims, the dim... So it's really straightforward, open up the little slots, and this is where we'll be installing our memory. To the right of this, is our power connector, so this is that 20 plus four pin, that really big guy, that's why that gets plugged in. And if you look on top of the CPU socket, this is the eight pin power supply. So again, from the actual power supply, you're plugging two things in here, the 20 plus four pin, and the eight pin. That's it. This is our PCI slot, this is where you'll install your graphics card, now you actually have a couple of other slots and generally speaking you can use these for things such as, I mean if you're doing a really crazy build, multiple graphics cards, but usually you'll like you know a capture card or maybe like a wifi card or something in here. The next thing to pay attention to is our M.2 slot, now depending on the motherboard, you may have multiple of these, sometimes they're actually on back or underneath kind of cover, this one's thankfully right in the middle and this is where you will install your M.2 NVMe SSD. One thing to pay attention though are these little screws right here, so you'll see 2242, 2260, 2280, and 22110. Now based on what size your SSD is, its almost always a 2280, you'll want to plug in screw or screw in a screw into one of these holes and that screw will come with the motherboard. So that's the only thing that kind of gets confusing because you definitely need that screw to keep it in otherwise, it falls out and they you don't have an SSD. So the thing I want to focus on first is our processor. AMD as actually done a really good job recently of shipping pretty solid coolers in the box and specially considering that this entire setup is not particularly expensive, it actually makes a lot of sense for a semi-budget build, so you can see that it's a fairly beefy heat sink. Now one thing I will say, is on the bottom of any of these coolers, AMD, Intel, whatever the case is, they will have pre-applied thermal paste. This is great, we don't have to deal with any sort of tubes, we can just drop this right on. However, don't touch this. When it comes to a processor, this is actually one of the more fragile components of the build. So generally speaking, grab it by the sides and do not under any circumstances, touch these tiny little gold pins on the bottom. And because this an AMD processor, it has a lot of this pins and if you bend any of these, it can very easily kill the CPU. So all we do is lift up the little metal retention arm, you'll see the entire socket move back. So take our processor, there's a tiny, tiny, little gold arrow which has a corresponding little notch on the actual socket. All we do is line it up, again do not force it, just gently rest it down and look at that! Your CPU's installed, push the little arm down, done, simple right? I know it can be scary right? I may or may not have bent a pin or two on a CPU in my lifetime, however, as long as you're nice and gentle, do not push it into the slot, let it rest, if it's lined up, it will slide down and you'll be just fine. Now we just need to toss on our cooler, which should actually be just pretty straightforward. Now because this is an AMD board and we're using a little bit of a larger cooler, we actually do need to remove these four screws on either side to remove these little plastic pieces. The reason I bring that up is if you actually look on the back of the motherboard, we have this little metal retention plate. This actually needs to stay here, just going to remove these guys. Don't worry about that back plate too much, because it's not going to go anywhere if its- oh god that's really tight, ugh, holy what kind of robot was having a bad day with this man. Oh yeah, one little tip, so there's actually two ways this can go on, it doesn't matter at all except that you got this little AMD logo, I've accidentally done it wrong where its upside down, so just keep in mind which way you want to do it, but essentially, - [Camera Man] We have a window on our case. - We have a window on our case, so this is the point where you make bad decisions, people will judge you. This cooler is very easy to install, so all we need to do, again, try not to touch that thermal paste, is just line it up with the screw holes we have right here. It should just rest right into place. And with that, then we'll just start screwing it in. Now another reason why you want to make sure you're applying even pressure, is because we want to make sure that thermal paste on the actual CPU, is making a nice solid firm attachment. So this is starting to look like a thing right, we have a cooler and a CPU, very important components. So you'll see there's a little cable that will attach to the fan, so this is a four pin header. Now they're usual pretty close, ours is right here, a little CPU fan header. It's really easy to install, you'll see there's a couple of notches here's, so it means it only goes in one way. Now all you do it line it up and drop it right into place. Boom, we're ready to CPU. So when it comes to installing RAM, there are a couple things to keep in mind. So because this is DDR4, you'll see that there's a little notch in the middle and the entire thing is slightly curved, so that means you're only going to be able to put it in one way. Line that notch up with the corresponding notch on the motherboard, if you try to put it down and it's not going in, you're probably doing it backwards. Now the next thing to keep in mind is which slots to use. So it's actually a little bit complicated, on Intel it's fairly straightforward, on AMD it depends. So you'll see here that we have four demo slots, which is the standard. So we have these two black, so it's one and three, and then we have these two gray which are two and four. For AMD, you want to take advantage of these two, in fact, actually if you look really closely, you'll see these little asterisks behind, beside B2 and A2, these are the preferred memory slots. Drop it in the slot, and then 3, 2, 1, push! And there, is out RAM installed, look at that we're like half way, there! Don't worry about the other, look we're almost there, we're almost there. And the next one is even easier, it's our SSD. So, installing this SSD is very straightforward, so you can see that it's tiny, it's literally the size of a stick of gum. Now to install it's very straightforward but you do need to keep in mind that we need a little hardware from the motherboard box, which I don't, did I get out? Yes I did, Okay, so it's really easy to loose this, you see this tiny little screw and the little adapter, this is what we need to install our SSD. So for this, it does help if you have a little bit of a finer Philips head screw just because it's really small. But essentially, what we need to do is install the little, what would you call this, like the... I'd just call it the nub, like the little screw guy. So because this is a 2280 SSD, the vast majority of SSD of you'll be using will be 2280. We can just install this finger tight, so let me screw it in, there we go! And now to install this SSD, will take us like 3 seconds. So we line it up with fill slot, so I usually put it in by with a little bit of an angle, kind of work it in to make sure it slides, so there we go. The next step is to take our SSD screw out, and then just literally lean it down, use the little screw to screw it into place to make sure it doesn't pop out the socket. You know look, we installed our SSD in literally like 18 seconds, that's it. So now it is time to bring back our case and now we just have to install the motherboard. Now, something that will very much vary between your cases is how you actually do this, and specifically which standoffs you use. So I flip this guy over, what you'll see is there a series of little brass standoffs, so these are painted black sometimes they're actually gold, but you can see there's standoffs on the top, there's also some standoffs in the middle and especially this NZXT case has a little post here, this is really nice cause' it will help us line it up, and also some standoffs on the bottom. The important thing here to know is that it's actually pretty straightforward to install this, the only thing we need to do before installing the motherboard is installing our IO Shield. Now this came with the motherboard and essentially once you open it up here, it just slides into the back of the case, so you'll see here where your ports will surface and you just want to make sure this case or this little shield is here to make sure that I don't know, it looks nice. So this is actually is a little bit of annoying thing because essentially have to kind of push it until it clicks. So I usually just work the corners until I see it not want to jump out of my hands. Click for me, click for me, aye! So now, all we need to do is put our motherboard into our case, now again because I'm using the NZXT case, I've got that little post in the middle, so as long as we get it roughly lined up, perfect, love it. And then if we can get it on the peg here which we can, boom, look at that, motherboards' in place and now we need to screw it in with like 300 hundred screws that are hopefully labeled in our NZXT little baggy. And this will be very close to done. Surprise, surprise, the way to do this best, and I'm sure you can't see this at all on camera, is using the cross method, so just start with one corner, get it screwed it then go to the next corner, the next corner, and kind of work your way around to make sure that again you're applying even pressure. And with that, we have a motherboard installed into our case. So if you flip it upside down or right side up, it doesn't all come crashing out, and we're actually getting pretty close. The next step is to install the graphics card, which we so hopefully have right behind the case, it's almost like it planned it out like that, look at that. This is our PCI connector, so this is what will attach the graphics card to the motherboard, which will go into this slot right here and then if we look around to the back of the card, you'll see that we have a single eight pin power connector. So the help of our little video light, so you can actually see what's going on, the next thing we need to do is actually install that graphics card. So you'll see right here our PCI slot, the only thing we really need to do is take a look at that and you'll see it correspond to these little metal connectors here. So these PCI slot covers we just need to remove based on where the motherboard and the graphics card set. So what you do it remove this little cover on the back, so not all cases actually use this although it's becoming a more popular thing and wow, what jacked up robot cranked this screw in, holy balls, ok, so we remove this little piece. And the next step is to remove these top two screws which should be pretty easy. You know when it comes to installing a graphics card, this is a very difficult process which is going to require a lot of concentra- I'm just kidding. You just need to line it up and push it in, it's really easy, so just line it up with the slot, click it, boom, done, look at that. Now, I will use my giant screw driver to put this little PCI cover back in place and we're next going to jump into cable management, oh boy the least favorite part of any PC build. So one thing I am going to do is because this already has the cables sort of pre-run for the fans, I'm going to plug these in first just because if I don't do them first, I'm baring them and I won't be able to touch them again. So one of our fans is actually perfectly sized to fit into this channel fan right here. That's actually, either really good engineering, or really lucky. Now just like when we plugged in our CPU, these fans that are up top and on the back, they are notched so they're only going to go in one way, these are 3 pin as opposed to 4 pin but it doesn't make a difference, there's only one way to plug it in. So you see we have a little bit of extra slack, however, I'm just going to pull that around back right now and we will pretend that exists or deal with it later, whichever one I feel like. So, I just plugged in the 20 plus four pin, the really big guy, and ugh I'm so happy right now cause' look at this little cable channel, all I have to do is wrap it around here, go straight down, and that's it, once I'm done with everything I'll Velcro it in, this is, making my life easy. So you can see right back here I plugged in the four plus four pins CPU power connector, now it's a little bit of a tight fit, especially in this specific case, however I've run the cable up on the top, basically just keep in mind that as with most of these connectors there's a little notch on it so it's only going to go in one way. Next up we have our eight pin PCI power connector, now because this only needs the one, we have the extra lead we'll just deal with that later, we'll just cable tie it up but again we'll just line it up, looking at the place and that's it. Okay so we have a few different cables coming from the case itself so we have a USB 3.0 lead, this is annoying because it will get stuck and you can easily break it, so just be careful. We also have out audio, this is for our front panel audio, and what I'm really excited for are front panel connectors. So these are typically separate, so what you'll see you'll have a bunch of little tiny individual connectors which will go to things such as the power button, and the reset, and the LEDs. However, NZXT was kind enough to provide one all in a single brick. So first thing is we're going to install are HD Audio, so you'll see this little AAFP connector here and there's one little pin knocked out on the top, there's a corresponding pin missing here, which means only thing to do is light it up, and easily just plug it in like so. Next we have USB 3, which is this guy right here, it's the sort of larger connector and its got the notch at the bottom which corresponds here, again it's pretty easy to install but just if you ever have to uninstall it, it's a pain cause' it likes to get stuck. And the next thing is the front panel connector, again these are the ones usually suck, however because I have my little notched sort of input, I can just do this and live a happy, happy life. So with that, we have built ourselves, a Gaming PC. So before we do any proper cable management, before we start putting the sides back on or anything, let's first connect it to a monitor and make sure it works. All right, so we have setup our computer, we've plugged in our USB peripherals from HyperX as well as we have our headset here, we have our monitor connected, we remembered to flip the switch on the back of the power supply which, I don't see anything, oh yep, we see some RGB action, that's a good sign. Okay, we have power to our peripherals and we have a successful post and soon as you see this, the first you should do, double check everything is correct. So we have Horizon 5 3600X, 16 gigs of RAM, keyboards, mice, lets hit F1 and make sure everything is successfully showing up, but as soon as you see a post, that is a very very good sign. There we go, we see our two 8 gig Gscale Dens, which we'll have to change the speed up and everything later, all of our fans are showing up, 3600X. Now from here, you want to do a couple of minor things, so we do want and go ahead and actually setup DCP, so we have our 3666 mhz memory and beyond that, we're pretty much good to go. So we can start cable managing, get this thing all sort of buttoned up, install a copy of windows, and you've successfully built yourself a Gaming PC. Congratulations, if you found this tutorial helpful, definitely be sure to subscribe to the channel if you're interested in any of these parts definitely check them out in the link in the description and again, huge, huge thank you to Micro Center for sponsoring this video and allowing us to crash their space and give you guys a hands on tutorial, a real look to what it's like to build a PC.",
    "transcript_keywords": [
        "power supply",
        "thing",
        "case",
        "power",
        "SSD",
        "CPU",
        "build",
        "motherboard",
        "screw",
        "pin",
        "supply",
        "AMD",
        "install",
        "Gaming",
        "back",
        "things",
        "make",
        "graphics card",
        "pins CPU power",
        "card"
    ],
    "transcript_entity_values": [
        "USB 3",
        "3600X. Now",
        "half",
        "microATX",
        "AMD Ryzen",
        "first",
        "Philips Screwdriver",
        "our IO Shield",
        "2020",
        "two",
        "AMD",
        "80",
        "Trident Z Neo",
        "four",
        "one",
        "Radeon 5600 XT",
        "like 3 seconds",
        "ATX",
        "ASUS TUF B450-Plus",
        "only one",
        "only 60 dollars",
        "six",
        "2",
        "280 dollars",
        "PowerSpec",
        "1",
        "Horizon 5",
        "four plus four",
        "Ryzen",
        "USB",
        "22110",
        "300 hundred",
        "number one",
        "H510",
        "these days",
        "like 18 seconds",
        "2280",
        "16",
        "SSD",
        "1080p",
        "PCI",
        "Cloud Stinger",
        "67.99",
        "650W",
        "DCP",
        "today",
        "NZXT",
        "3600",
        "AMD",
        "the Ryzen 5 3600X.",
        "Tustin",
        "80 Plus",
        "Plusefire",
        "eight",
        "RGB",
        "F1",
        "20 plus four",
        "CPU",
        "Philips",
        "Ryzen",
        "3666 mhz",
        "20 plus",
        "One",
        "six plus",
        "AAFP",
        "only 67.99",
        "a bad day",
        "70 bucks",
        "three",
        "20 bucks",
        "HD Audio",
        "RAM",
        "2242",
        "a four plus four",
        "California",
        "512",
        "95 percent",
        "4",
        "second",
        "Micro Centers",
        "A2",
        "five",
        "Intel",
        "Micro Center",
        "2260",
        "3600X",
        "Gscale Dens",
        "the Inland Premium SSD",
        "3"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "LAW",
        "CARDINAL",
        "NORP",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "DATE",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        0.028377702459692955,
        0.013084341771900654,
        0.03899523615837097,
        0.025431012734770775,
        0.05364970490336418,
        -0.02997855842113495,
        -0.003408196149393916,
        -0.01111806184053421,
        -0.07827546447515488,
        0.015712063759565353,
        -0.056902434676885605,
        -0.03607137128710747,
        0.03532335162162781,
        -0.00466458685696125,
        -0.024128183722496033,
        0.059532810002565384,
        0.01400570385158062,
        -0.06383052468299866,
        -0.03880533203482628,
        0.017249083146452904,
        -0.0023384192027151585,
        -0.08522316068410873,
        -0.024989984929561615,
        -0.0856676995754242,
        -0.016775650903582573,
        0.06474154442548752,
        0.1088380441069603,
        0.03217702358961105,
        -0.004194125533103943,
        -0.027732161805033684,
        0.09713467955589294,
        0.03228990361094475,
        0.006886551156640053,
        -0.0005125995958223939,
        0.03645894303917885,
        -0.03519883379340172,
        0.06381522864103317,
        -0.08372773975133896,
        -0.05854179710149765,
        -0.11067378520965576,
        -0.042376864701509476,
        -0.012462745420634747,
        0.019154714420437813,
        0.13115869462490082,
        0.026331204921007156,
        0.05365181341767311,
        -0.005572917405515909,
        -0.0739419013261795,
        0.021053694188594818,
        -0.04064399003982544,
        -0.05464407801628113,
        -0.058663785457611084,
        0.00981970690190792,
        -0.06599152833223343,
        -0.11784699559211731,
        0.09073329716920853,
        0.012925121933221817,
        -0.09803785383701324,
        0.03267454728484154,
        -0.04871225357055664,
        0.056998420506715775,
        -0.14684239029884338,
        -0.018812477588653564,
        0.04130233824253082,
        -0.027720291167497635,
        -0.010934922844171524,
        0.025358228012919426,
        0.005572540685534477,
        0.021834729239344597,
        0.011956531554460526,
        0.03044414333999157,
        0.033453114330768585,
        -0.01458548940718174,
        -0.015491660684347153,
        0.0030598577577620745,
        0.021080631762742996,
        0.09117093682289124,
        -0.02827034518122673,
        0.019487643614411354,
        0.030561769381165504,
        0.002614659024402499,
        0.013901464641094208,
        0.019711600616574287,
        -0.03446315973997116,
        0.033631108701229095,
        0.05263190716505051,
        0.018280599266290665,
        0.03318049758672714,
        -0.0034146367106586695,
        -0.06903678178787231,
        -0.03260844945907593,
        0.059730082750320435,
        0.022491779178380966,
        0.011705306358635426,
        0.05833118408918381,
        0.013725951313972473,
        -0.0005231961840763688,
        -0.11053217947483063,
        -0.04479281231760979,
        0.023873331025242805,
        -0.051130201667547226,
        0.024396618828177452,
        0.12172918766736984,
        0.06675908714532852,
        -0.07519306242465973,
        -0.005660117603838444,
        -0.11415229737758636,
        0.048780396580696106,
        -0.0640229731798172,
        0.0033650442492216825,
        -0.017322994768619537,
        0.07205923646688461,
        -0.05512771010398865,
        0.03153263404965401,
        0.06967708468437195,
        -0.005224568769335747,
        -0.040517352521419525,
        0.037871215492486954,
        0.06621173769235611,
        -0.020237158983945847,
        0.029377784579992294,
        -0.023408476263284683,
        -0.06366190314292908,
        0.009638098999857903,
        0.03346559777855873,
        0.006518285721540451,
        -0.1001674234867096,
        9.59869748631109e-33,
        0.03105965070426464,
        0.08960463851690292,
        -0.029362473636865616,
        0.0896897166967392,
        0.05039050802588463,
        -0.007138035725802183,
        0.06717654317617416,
        0.004113230854272842,
        -0.0058193025179207325,
        0.0539231076836586,
        0.028533512726426125,
        -0.0019532381556928158,
        -0.03468889743089676,
        0.11630557477474213,
        0.059218280017375946,
        -0.09113606065511703,
        -0.015979718416929245,
        -0.04273517057299614,
        -0.034667037427425385,
        -0.005813346244394779,
        0.024761078879237175,
        0.007079217117279768,
        0.057153165340423584,
        -0.00919098686426878,
        0.05043428763747215,
        -0.042020443826913834,
        -0.019657041877508163,
        -0.02480330504477024,
        0.02337990142405033,
        -0.006457814481109381,
        -0.079157754778862,
        -0.08493346720933914,
        -0.0396137535572052,
        0.012889544479548931,
        0.05390283465385437,
        -0.02394460141658783,
        0.012163371779024601,
        -0.07870829105377197,
        -0.034241076558828354,
        0.010120104998350143,
        -0.018986407667398453,
        0.06647966057062149,
        -0.05927841365337372,
        -0.07244191318750381,
        -0.07716639339923859,
        0.0066275629214942455,
        0.0034055346623063087,
        -0.039752501994371414,
        0.04096651449799538,
        0.027511727064847946,
        -0.11004673689603806,
        0.062110092490911484,
        -0.010489551350474358,
        -0.034664005041122437,
        0.007774262689054012,
        -0.05799752101302147,
        0.002998191397637129,
        -0.04057680070400238,
        0.10632546246051788,
        0.06896259635686874,
        -0.02030181512236595,
        -0.0047254967503249645,
        -0.023176509886980057,
        0.02478594332933426,
        -0.11408370733261108,
        0.03009108081459999,
        0.05477670952677727,
        0.014133898541331291,
        0.02214832231402397,
        -0.017577525228261948,
        0.05337889492511749,
        -0.04655952379107475,
        0.04504716768860817,
        -0.0208779014647007,
        0.08830486983060837,
        0.03438926115632057,
        -0.06435113400220871,
        -0.035541992634534836,
        -0.05599512159824371,
        -0.0334247387945652,
        -0.02153307944536209,
        0.04024651274085045,
        -0.08404426276683807,
        0.06165493279695511,
        0.035689759999513626,
        -0.01177294086664915,
        0.013627742417156696,
        0.010832816362380981,
        0.03376214951276779,
        -0.0536680668592453,
        -0.049785904586315155,
        -0.08185537159442902,
        0.09463895112276077,
        -0.0008369183051399887,
        -0.030748791992664337,
        -9.366317681516878e-33,
        -0.04511364549398422,
        -0.04958874359726906,
        -0.0014140054117888212,
        0.05442732200026512,
        0.034084320068359375,
        -0.01062727253884077,
        0.04532438516616821,
        -0.016120368614792824,
        0.07007905840873718,
        -0.10047963261604309,
        -0.002415694994851947,
        0.07520437985658646,
        0.006734366528689861,
        0.010132507421076298,
        -0.06848099082708359,
        0.002164557110518217,
        0.03547092527151108,
        -0.04174666479229927,
        0.024575693532824516,
        -0.02684001252055168,
        0.003983030561357737,
        0.08596731722354889,
        -0.03530815243721008,
        -0.018354374915361404,
        0.005728995427489281,
        0.02348528988659382,
        0.06623546034097672,
        -0.035773538053035736,
        0.02467666193842888,
        0.05198559910058975,
        -0.013325636275112629,
        0.015292619355022907,
        0.04621969163417816,
        0.06376252323389053,
        0.02201812155544758,
        0.019484637305140495,
        0.08396442979574203,
        -0.01240706630051136,
        -0.00356301199644804,
        -0.03881005942821503,
        0.03712385520339012,
        0.028582587838172913,
        -0.0743417963385582,
        0.005382506176829338,
        -0.02469542995095253,
        0.0033328288700431585,
        0.012746267020702362,
        -0.04226325452327728,
        0.033839110285043716,
        0.0023017528001219034,
        0.00918013509362936,
        -0.021816423162817955,
        0.01383630558848381,
        -0.03453010693192482,
        -0.02602076530456543,
        -0.14361871778964996,
        0.02240021526813507,
        0.03503822162747383,
        0.03884745016694069,
        -0.0538785420358181,
        0.027424920350313187,
        0.01770029403269291,
        -0.0027082774322479963,
        -0.052895620465278625,
        -0.0011421013623476028,
        -0.0675864964723587,
        0.037767939269542694,
        0.05148531496524811,
        -0.04463844373822212,
        -0.02328007109463215,
        -0.20053274929523468,
        0.007714445702731609,
        -0.03270762413740158,
        -0.027536427602171898,
        -0.024656645953655243,
        0.013721230439841747,
        0.03011481836438179,
        -0.016030289232730865,
        0.08064519613981247,
        -0.014147177338600159,
        -0.04885641857981682,
        -0.024506986141204834,
        -0.015454117208719254,
        0.014908052049577236,
        0.0620175302028656,
        -0.0310481246560812,
        -0.021972201764583588,
        -0.01513885147869587,
        0.0001480023202020675,
        -0.07326200604438782,
        -0.026682978495955467,
        0.0661318451166153,
        -0.03214640915393829,
        0.07706940919160843,
        0.018630383536219597,
        -5.974062133873304e-08,
        0.06149594858288765,
        -0.04085652157664299,
        -0.07716933637857437,
        0.025162914767861366,
        0.045480359345674515,
        -0.05341557785868645,
        0.05443352833390236,
        -0.02855277620255947,
        0.04525487869977951,
        -0.031137369573116302,
        0.0704127699136734,
        -0.026984186843037605,
        0.028393656015396118,
        0.02148938924074173,
        -0.00650862418115139,
        0.06934989988803864,
        -0.03547138720750809,
        0.1251399666070938,
        -0.03535744175314903,
        -0.07006395608186722,
        0.006732264533638954,
        0.07621219009160995,
        0.07101304829120636,
        -0.0031175194308161736,
        -0.015241687186062336,
        -0.007419687230139971,
        0.0010142856044694781,
        -0.05072581395506859,
        0.0669495165348053,
        -0.0007539170328527689,
        -0.029855120927095413,
        -0.019864607602357864,
        0.02079167030751705,
        -0.0464971624314785,
        0.029323982074856758,
        -0.038870491087436676,
        0.037482693791389465,
        0.11759959906339645,
        0.13632160425186157,
        -0.006907211616635323,
        -0.07375459372997284,
        -0.055694688111543655,
        -0.02675907127559185,
        -0.013018271885812283,
        -0.024962292984128,
        -0.03442080691456795,
        -0.17325371503829956,
        -0.09854306280612946,
        -0.05364383012056351,
        0.03635130822658539,
        -0.057715531438589096,
        0.018376022577285767,
        -0.010105819441378117,
        0.053888626396656036,
        0.08387928456068039,
        -0.0017768850084394217,
        -0.05431068688631058,
        0.08381836861371994,
        0.078336700797081,
        0.002160479314625263,
        0.0172573272138834,
        -0.0168360136449337,
        -0.060013547539711,
        0.01575973443686962
    ]
}