{
    "id": "E9avjD9ugXc",
    "title": "Coffee Percolators: An Explanation and Roast",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2020-04-17T23:14:38Z",
    "video_url": "https://www.youtube.com/watch?v=E9avjD9ugXc",
    "category": "Science & Technology",
    "tags": [],
    "views": 2590042,
    "likes": 84570,
    "comments_count": 15872,
    "description": "Do you like your coffee to have a little kick? Then try a percolator! It's like tasting a shoe! Seriously. Why are these still a thing? I don't know but let's talk about them!  These links have been sitting on a hot plate all day. Hope they're not too stale Technology Connextras (the second channel that stuff goes on sometimes):  Technology Connections on Twitter:  The TC Subreddit   You can support this channel on Patreon! Thanks to contributions from viewers like you, Technology Connections can continue being as weird and unpredictable as it is. If youd like to join the so-cool-as-to-be-refrigerated people who bring these videos to you, you can find out how at the link below. Thank you for your consideration!   And thank you to the following patrons! Jeff Gunn, Liam , Jason Heckenlively, Andira Muttakim, Jesus Villafranca, huitz, Jace Fuse, Denis Phillips, Jon Adams, Eric Noriega, peter pan, lastsecondsave , Marcus Congdon, Loni Nix, Bernardo , Damnable Nook, Elijah Gould, Tyler Warren, Kevin Ingersoll, Jason Jenkins, C. A. Patrick Voigt, Andrew Hangsleben, Alex , Mike Jacob, Trent Lloyd, Prashant Sinha, reavisrk ., coudy , Matthew Stoldal, Kristi an Berry, Charles Gillanders, Gavin , Danielle Duarte, sheepish.alpaca , Juhani Saarinen, Ashley Hakker, M10360 , Zufalligeule , Adam Rose, Nuzzo Salvatore, Jake Austin, Alex K, Thibault Martin-Lagardette, Eric Hoppe, Rob Lion, Nikolaus , Ohad Lutzky, Marek Standio, John Julian, Karen Scarfone, Edward Harris, Ulises Vargas, Jean-Baptiste Dubois, Michael Young, Mirror, Rebecca Valentine, Consonant Analysis, Justin Howell, wingee , Cyle Lapread, Chris Miller, David Cawthon, Dolphinhats , Brian Taylor, Arnas , Jacob Kubacki, Steven West, Bob Meyers, BEAVIS, Scott White, Rabbits Watching, Chris Gibbons, Michael, Merton Hale, Nodar Rocko Davituri, Dawn Swain, JCRail , Bill Holland, James , Micah Catlin, AZbytes , Sebastian Schagerer, cody thompson, Francis O'Brien, Bryan Culver, John Goldhamer, Bob Holt, lxlumen , John-Paul Holt, Alex Nelson, Ruleryak",
    "description_links": [
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Nostalgia is weird. It sometimes makes us do things that dont make any sense. Now look, Im not immune from it either. I still like to make compilations of the music I like on cassette tapes. Rather than just make a playlist which takes two minutes, I like to listen to each song as I record it onto the tape, get good at pausing the deck at just the right time for small gaps, adjust the levels so that it doesnt peak too much, and Ooh! When you get to the end of a side, you gotta look for a song thats just the right length, or maybe go with one thats a little too short and then rewind the tape and re-record the last 4 with a bit of a longer gap in Anyway, nostalgia makes us do weird things. And it made me buy a percolator! But first, a word from our sponsor! This episode of Technology Connections has been brought to you by; Do you ever decide to make toast and find yourself limited to just that one toaster on your countertop? Well, Too Many Small Kitchen Appliances has you covered! Thanks to Too Many Small Kitchen Appliances, youll have your choice of not just toast, but toaster, too! Are you tired of not being able to slow cook seven meals at once? With Too Many Small Kitchen Appliances, youll be slow cooking in style! Dont delay, add a little Spice to your life with Too Many Small Kitchen Appliances Today! Thanks, Too Many Small Kitchen Appliances! Ya know Im glad they chose to pitch in because I was getting a little bored with my selection of coffee makers. Every morning I like to brew two nice cups of joe, and Ive grown weary of only having five coffee makers to choose from. So Ive bumped that up to seven with the addition of these two percolators. What is a percolator you ask? Why, what a great question! If only there were a piece of long-form internet content to answer that for you. Oh right! This is a percolator. For some reason you can still buy these! These stalwarts of coffees past used to be in nearly every home, but then we were introduced to the wonders of drip coffee and we decided these are awful! At least most of us did. And now of course weve been introduced to the wonders of plastic single-use coffee pods, because we cant be bothered to put a filter in a basket anymore I guess. And for those of us who like to work for our java, there are just so many ways to go about it these days, like pour-over, French press, cold brew, and whatever other fanciful techniques are making the rounds. Fun fact! Coffee gadgets make up 80% of Too Many Small Kitchen Appliances yearly portfolio. We interrupt this program with a public service announcement. Dear demographic, we would like to inform you that \"fresh\" and \"hot\" are two different concepts. Believe it or not, the freshness of a cup of coffee is largely independent from its hotness. Those of you who will accept nothing less than burns-your-tongue fire liquid are ruining it for the rest of us. For you see, many establishments which subscribe to this hot IS fresh philosophy (or else cater to those who subscribe) use carafes warmed by a hot plate. This burns the coffee in short order. For those of us who can taste things, burned coffee is bad. An alternative philosophy is to maximize the time a given quantity of coffee remains palatable. Some establishments use insulated coffee servers to keep brewed coffee hot as long as possible without introducing more heat and burning the coffee. While this may lead to coffee which is slightly less hot, I promise it actually tastes much better! And as a bonus, it reduces waste. Related pro-tip! If you use a drip-coffee maker, be sure not to start the brew too long before you intend to drink the coffee. Likewise, when brewing is complete, be sure to turn the unit off as soon as you can. This minimizes the time the hot plate burns the coffee, a side-effect of this style of coffee maker which your host feels gives them an unfairly poor reputation. After all, what is drip coffee, but slower, automated pour-over? Speaking of pour-over, how does one actually make coffee? Aha! At last, we are back on track. Well, it all starts with a plant with particularly particular preferences regarding where it would like to grow. Lets just skip over all of the in-between thorny things like exploitative labor practices and get to the part where we roast the seeds (which we call beans for.. reasons) of this plant. We burn them, but like, not too much (with some notable exceptions). After this rather heated ordeal and possibly a bit of grinding, Arabicadabra! it ends up on store shelves where you buy it because youre addicted to it but of course really you could stop whenever you please its just... it's just so good so why... why... why bother amirite? [slurps obnoxiously loudly] OK, well to turn coffee beans into delicious Hot Brown, we need to make hot water and ground coffee very close friends through some kind of introduction. This as you may recognize is a maintenance serv an ordinary coffee maker. To use it, you simply put a filter into the basket, endure the internet comments about how you should be using unbleached filters prompted by this shot, add some ground coffee, put the thing in the thing, the water in the other thing, and flip the switch. The water in the reservoir is heated and pumped (in a very clever fashion I might add) to a little drippy thing where it will land on and seep through the coffee grounds and end up in the pot below it, now infused with the sweet sweet caffeine that was in the beans. And flavors and other things probably, too. Before we were introduced to the wonders of Mr. Coffee, we had to deal with... these things. Now, dont get me wrong, the invention of the coffee percolator was itself a pretty neat thing, as it presented a good balance between convenience and quality. There had been other ways to get your Hot Brown before, but some were really finicky, others couldnt make larger quantities of coffee, so for a time here in the US we settled on these as fairly good catch-all solutions. I have here two kinds of percolators. A stove-top version, and an electric version. They both operate using the same exact principle, but the electric one has a distinct advantage which well see shortly. However, the glass one illustrates how they work much better, because its glass and we can see through it. Percolators use the fact that boiling water creates bubbles to force water up a tube. Percolators have three basic parts: A vessel for holding water to be heated. A vertical tube, sometimes called the perk tube but thats actually a misnomer. And the tube travels through a basket which holds ground coffee above the water level. On a stove top percolator, youll find that the base of the tube has a sort of upside-down funnel thing. When it's assembled, this funnel covers much of the bottom surface. The purpose of that is to catch bubbles that form as the water boils. See, when you fill the percolator with water and place the tube and basket inside, water will travel up the tube to the same level as the water in the pot. As the water is heated and approaches boiling point, bubbles of water vapor form on the bottom. Many of these bubbles simply float to the surface but some of them get caught by our little funnel thing. This forces them to travel up the tube, and as they bunch together, they force the water sitting in the tube to travel upwards as well. It then splashes against the inside of this glass knob thing (which allows you to see that the pumping action is occurring), and falls onto the spreader plate below it. After the spreader plate spreads it out, this very hot water now falls onto the grounds below it and seeps through them. Which, by the way, is where the name percolator comes from. Percolating just means filtering liquid through porous materials. Really, all coffee makers are percolators. Because percolating is how you make coffee (excluding of course things like a French press which use infusion, but thats not important right now). But, probably thanks to the lovely sounds these make as water splashes to the top, weve confused things a bit in the States at least and sometimes refer to this water splashy action itself as percolation. Thats probably how these tubes got called the perk tube, and anyway Im spending WAY too much time on this so lets continue. As the water percolates through the coffee, it picks up that caffeine (and flavors and colors I guess) and then it ends up right back where it started. This here is the fatal flaw of the percolator. For you see, there is no separation between the fresh water and the brewed coffee. Its just one big happy family! This of course means that the coffees concentration continually increases as the coffee is percolating. You eventually start running brewed coffee through the grounds again, and then again, and thats generally not a recipe for good coffee. Some people like the fact that the coffee recirculates as it does. We call these people \"masochists.\" To be fair, though, you can control how strong the coffee becomes using time. Just let it percolate for however long you like, then remove the heat and serve. This was after all how everybody did it before our savior Mr. Coffee appeared. But designs like this glass one have one more flaw up their sleeves! They dont start moving water up the tube until the water is boiling. And quite roaringly, I might add. Remember how I was saying in that PSA earlier that adding heat to brewed coffee will burn it? Well, this percolator burns the coffee while it brews! Hey, at least it kills two birds with one stone! This electric one works in a much more elegant fashion. [metallic clanging as the things are removed from the thing] Its water conveyance tube doesnt have a funnel thing at the bottom, and thats because it heats the water in a very small spot. Look in the bottom and youll see that the tube fits snugly into this little recess. This is the only part that actually gets hot, so when you plug it in it starts percolating almost immediately. Effectively the tube traps small quantities of water in the heat chamber, which causes it to boil rapidly, and so the bubbles formed shoot some of it up this tube where it will then percolate through the grounds. In this basket. That water then gets replaced by the colder water surrounding the heat chamber. This does still have the recirculation flaw of the stove-top percolator, but it means that its not constantly burning the coffee. Most of the water gets heated from the water that falls through the basket and back into the pot and this allows the device to have an automatic stop function. As it percolates, the bulk of water slowly gets warmer, and once it gets near boiling point, a thermostat cuts in and switches the device into a warming mode. In this mode it no longer gets hot enough to continue pumping water to the top, so the brewing action stops. And for the icing on the cake, a little neon indicator will light up to let you know that its done! So, want my impression on how... \"well\" these make coffee? Lets do a taste test shall we Im going to be using my everyday coffee, so Ill get a great sense of how badly these butcher it. Ive ground the coffee rather coarsely as you ideally should when using a percolator. This is, incidentally, another reason why these went out of favor, as coffee manufacturers stopped selling pre-ground percolator grind coffee. Anyway, lets cut to an unscripted segment! [ jazz piano plays softly ] Hi! Welcome to an unscripted segment! So, you may notice that one of the percolators is not here, and thats because while I tried to make it work with the little hot plate that Ive used in other videos, that does not produce enough heat to make it percolate so it needs to be on an honest-to-goodness stove. So that will be happening upstairs, and I will bring it back down here when, uh, it is ready. But first! Im going to start this. And show you how to do it! As I said in the scripted segment, I am using my everyday coffee. What is my everyday coffee you ask? Im not gonna tell ya because everybody judges everybody for that kinda of thing but I will tell you it is NOT from Starbucks and it is Fair Trade. That's all you need to know. I am definitely not a coffee snob and I refuse to let myself become a coffee snob, but I am pedantic enough that I measure my coffee out every morning by weight. And I have put the exact same amount of weight that I always do with a drip coffee maker inside this coffee thingy. Basket. And, the same exact amount of water that I would normally use to make this quantity of coffee is in the percolator. The only difference here is this is a percolator, and this was ground more coarsely so that it would work better with a percolator cause this does not have a filter in it. I could put a filter in it, but I did not. slow, rompy piano And, I will not be judging grounds that get in the water because I expect that to happen both on this one and the stovetop model. But, for this coffee maker, you start by filling it with water which I already did. You put the perk tube [a perfect little water bloop noise just happened] into the bottom and fit it in that little recess. Slide this over it [slidey noises] Cool. Now this is the spreader for this one, that goes on top. And then this whole thing gets shoved down with the lid. [more metallica] [THUD] Is that difficult? No, but I find it to be way more finicky than a regular old coffee maker. This has an old-school kitchen appliance plug, so I will plug it in. [pluggy sounds] And you will notice that this starts making noise quite quickly. Its already making making noises and its only been this long suspenseful music And now it is percolating. So, Im now gonna go upstairs and start the other one. You guys, uh keep watch of this. [ pew, pew pew pew, pew pew ] (it does sound weirdly like a laser blaster when sped up) Fascinating, innit? [now it sounds like a steam train] [I think I can, I think I can I think Ican ithinkican] [ithinkicanithinkicanithnkcaithcith] Oh god, ITS GONNA BLOW! [sound returns to normal as video resumes normal time] [click as the light turns on] [A throbbing gurgle/boiling sound slows and gradually stops] There were also beeps coming from upstairs - that was me setting a timer for the other percolator I just got back from upstairs because the one on the stove JUST started percolating and this is already done. So, uh, again the stovetop models I dont know why anyone would use them. Anyway, I have set a timer for five minutes; thats how long Im going to let that percolate. Umm... I just wanted to say that the one thing Im not quite sure of but it looks to be OK is some experimenting I was doing earlier indicated that the glass one needs to have a fair bit of water in it in order for it to percolate, if you only have enough water to, say, fill a mug like this it doesn't really percolate at all. Um, so the amount that I have in there seems to be percolating pretty well um, but if it is noticeably weaker than this I will assume that it just needs more water but Im not wasting ANY MORE of my good coffee on this experiment. Anyway, Ill be back in a bit. Im back! And I brought this! Now, this is, uh, not particularly dark but the coffee that I use doesnt make a very dark coffee anyway so Im not necessarily concerned about that. I have two mugs with some cream and sugar in there. Yes, I take my coffee with cream and sugar because I love myself! And yes, this one was in keep-warm for five or six minutes, but I dont think it will matter much. a rhythmic jazzy riff starts to play This is about the darkness that I would expect out of my, uh, out of my drip coffee maker. [some lovely pouring noises] Ehh, its a little lighter but not much. [man this is good Foley] This also pours really weirdly out of this. And Im sure its bunching up against the [clears throat] the grounds. I tried to put the same amount of cream in here and it is a very similar color. So, hey! We did uh we at least got that kinda right didnt we? I think this is a... is a tad lighter, but not much. OK. So, time to come clean I used this once before and it wasnt awful but it smelled horrible. Same exact thing, the smell it just smells not pleasant. You know, like I like the smell of a fresh cup of coffee. This is NOT. THAT. This is very pungent, like theres a sharpness to it and, uh, and also like a chemical smell? And I dont like it. At all! This one, which definitely has more grounds in it for what its worth. Oddly enough this one has less of a smell. Its still not good, its its not Oh no, that chemical, that... that weird, like, pungent smell is there so these both smell really bad. [laughs] Like if youre if youre someone who likes the smell of coffee and this is what youre used to ugh! Youve not smelled good coffee. Im kind of afraid to taste these. Plus they are probably quite hot. This one was boiling just a moment ago, this ones probably not quite that hot. And Ill start Ill start with this one. [grumble] Its not the.. I If I were served this at a restaurant I would consider it bad coffee, but I wouldnt not drink it. So Its not so bad that I would send it back but this is not... This is NOT the coffee that I have for breakfast. With breakfast. [lip smacking] Uh. No. No. Ugh! It tastes so bad! Theres a its like worse than vending machine coffee. At least I think so. It is not theres nothing it, it, it is coffee but it doesn't have any of the pleasant aspects of coffee. Shall we shall we try this one? Im a little afraid. [slurpy slurp] Oh this is worse. See, this one actually doesn't [clears throat] this one doesnt taste burned to me. Surprisingly enough. This one does. This tastes like coffee thats been, ya know, left in the coffee pot for two hours. And its I JUST made it. Yeah. Its got Its a different kind of burn from what Im used to but its there. Cause normally I describe the taste of burnt coffe as almost a, almost a carameley (or care-a-meley) um, obviously its not pleasant like that but I think its almost like a caramelization is what I get from it. This one is so much better. Like, if youre gonna use a percolator dont! Not on the stove. Get... get an electric one. And I should say, I dont know if all electric ones are created equal but Im assuming that since this is still available for purchase, this is the design that is, ya know, left. The one thats been refined to that. See, its so funny cause now this tastes pretty good [laughs] In comparison to this, this is MUCH better! This is and to know that it did this to coffee I like makes me wonder if I had, ya know, just like... had some random coffee and put it in there would I even tolerate it at all. I mmhmm could not tell ya. Since I dont know if you can see this at all I will take a picture of the tops. This is just so you can see that the, uh, darkness is pretty is pretty similar between the two. But, uh, yeah. This neither of these make what I would consider good coffee. This makes okay coffee but I still would not take this over drip coffee EVER. If I had no other option but this, I would definitely take it over this. Especially because it was faster! I'm surprised how long it took this to even start percolating. This, um, I mean it didnt start until this had finished so this is definitely faster. I mean this is kinda charming! Ill give it that. Thats it, though. The actual finished product gross! Gross. Gross. Do not use a percolator I mean like really? I just ugh. I just have to ask the people who say they like this have you had coffee thats been in a drip machine or anything better? Lots of people consider drip to be bad, I disagree with them. I think it as I said earlier I think it has to do with when people allow it to get burned, I think coffee fresh from a drip machine is perfectly fine; pretty good, even. But... If this is your idea of what good coffee is, I dun ehmmm. We are at an impasse cause I cant agree with you. But anyway, shall we get back to the scripted part? I think we should get back to the scripted part. So there you have it. Percolators. Why are they still made? Well I suppose these ones are good for camping or other places where you have fire but not electricity... But as far as electric ones? I have no idea. Its gotta be purely nostalgia at this point. Or else fears of plastic components maybe? I did read that in some reviews. Whatever the reason, I would not recommend purchasing one. I mean theyre not even easy to use. Its much more finicky than just a drip machine, and its a huge hassle. In general I just dont see the appeal of these at all. Now, in fairness, its coffee is nowhere near as bad as this guy's coffee so I could probably get used to it eventually. Still, though, it is much much worse than my plain ol drip machine. Then again, Im just a youngster whose only known drip coffee and the supposedly better options everyone tells me I need to embrace, and just as this coffee tastes weird and wrong to me, I suppose there are people out there to whom this style of coffee is just right. I mean, its smelly dirt water to my tastes but, different strokes and all that. Well, thanks for watching! I hope you liked this silly little video. It turns out that I bought these percolators almost a year ago! Now I bought them for making a video, certainly not to make coffee, and I I kinda forgot about them. Uh, this glass one was a vintage thing from eBay, but the electric one came right from the Amazon. And there are a startling number of options on there, including glass stovetop models. Reading the reviews makes me question my sanity quite a bit Then again, like I said, some people like different things. Cant account for taste. scaldingly smooth jazz A little too short and (chair creaks) and then rewind shoot. My loud chair strikes again! Then we were introduced to the wonders (crashing noise) (laughs) Boy this was supposed to take this was supposed to be quick. It is not quick! ...you see, many establissments whits.. Establissment establishments which! Oh, thats a tongue twister. And those of you who like to work for our java [stares confusedly] Those of us. Hoooh, that would explain why that sentence felt broken ...ench press, cold brew, and whatever other fanciful techniques we are mmm...that are fffforking the forking fork. It ends up on store shelves where you buy it! Bec oh shoot I need a coffee mug. How does one actually make coffee? Ah ha ha! Ah ha ha ha ha! (ehhh, what the was that?) ...the water in the pot. As the water heated and appro oops Now, Ive grounded the coffee. Grounded? Youre grounded! OH I'M SO CAFFEINATED RIGHT NOW Let me tell you a story real quick, you see when I was about to make this video there was a knock at the door but it turns out that was actually just in my imagination! I went to the door and nobody was there. Startled, I thought to myself \"is this a side-effect of all that coffee I've been having?\" but then the Coffee Fairy showed up to reassure me that no, I am totally fine, so on about my business I went. Really, I'm quite happy to have the Coffee Fairy always there for me when I need him or her or they not really sure on the gender there. So anyway, I went to go start recording the video after the Coffee Fairy had showed up and everything was going super smoothly! Except is wasn't at all, it was really quite a mess, lots of things were going poorly. Like for example the lights were all buzzy and flickery but really they weren't it was just something wrong with my vision, again I thought maybe I was having too much coffee but I thought back to what the Coffee fairy had said and they reassured me I was A-OK so I just kept on going But then my memory card was full so I needed to re-format it but what if there was stuff I needed on there ya know? Like, maybe I didn't actually finish my last video, maybe it's in some weird vide purgatory, I don't know these things, so I needed to check real quick that I had finished the video and it turns out I had! So I went ahead and reformatted the card, but that angered the lawn mower and so then I had to deal with that guy. He's really quite an ordeal. Pretty sharp but way too fast for my tastes one of these days he's really gonna damage somebody. Anyway, I hope this gag doesn't flag some sort of captions spam 'cause like I did it but anyway byeeeeeeeeeeeee- HOT BROWN",
    "transcript_keywords": [
        "coffee",
        "Small Kitchen Appliances",
        "water",
        "Small Kitchen",
        "Kitchen Appliances",
        "coffee maker",
        "make coffee",
        "make",
        "percolator",
        "tube",
        "Coffee Fairy",
        "small",
        "hot",
        "thing",
        "ground coffee",
        "Kitchen",
        "Kitchen Appliances Today",
        "drip coffee",
        "brewed coffee",
        "things"
    ],
    "transcript_entity_values": [
        "five minutes",
        "every morning",
        "Hot Brown",
        "rompy piano",
        "French",
        "two",
        "eBay",
        "Fair Trade",
        "Ican",
        "joe",
        "80%",
        "Foley",
        "two hours",
        "five or six minutes",
        "seven",
        "yearly",
        "Every morning",
        "US",
        "the Coffee Fairy",
        "first",
        "one",
        "Spice",
        "almost a year ago",
        "Starbucks",
        "these days",
        "Technology Connections",
        "Amazon",
        "States",
        "two minutes",
        "Hoooh",
        "the last 4",
        "up to seven",
        "five",
        "PSA",
        "Coffee",
        "three"
    ],
    "transcript_entity_types": [
        "TIME",
        "TIME",
        "ORG",
        "PERSON",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "PERSON",
        "PERCENT",
        "PERSON",
        "TIME",
        "TIME",
        "CARDINAL",
        "DATE",
        "TIME",
        "GPE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "TIME",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.12252765148878098,
        -0.09863560646772385,
        0.030546583235263824,
        0.028688663616776466,
        0.03362039849162102,
        -0.037848155945539474,
        0.054658424109220505,
        0.006620654370635748,
        0.036813121289014816,
        -0.024726571515202522,
        -0.04241616651415825,
        -0.001566464314237237,
        0.007251117378473282,
        3.882573582814075e-05,
        -0.061021436005830765,
        -0.10033746808767319,
        0.061207063496112823,
        -0.05687890574336052,
        0.006942746229469776,
        -0.049654170870780945,
        0.030633391812443733,
        -0.13881635665893555,
        0.006186649668961763,
        -0.0015847678296267986,
        -0.005295820068567991,
        0.09381038695573807,
        -0.016325872391462326,
        -0.04324806109070778,
        -0.03988101705908775,
        -0.037072181701660156,
        -0.03978943079710007,
        0.042699579149484634,
        -0.04340561851859093,
        -0.04820605739951134,
        -0.05139589309692383,
        -0.02597338892519474,
        0.0715755969285965,
        0.034793369472026825,
        -0.08114122599363327,
        0.012366188690066338,
        0.047558341175317764,
        -0.09229306131601334,
        0.07514785975217819,
        -0.0031124211382120848,
        0.03862174600362778,
        -0.04545912519097328,
        -0.012862073257565498,
        -0.1201460137963295,
        -0.04356248304247856,
        0.006696999538689852,
        -0.09819125384092331,
        -0.053403422236442566,
        0.07838747650384903,
        -0.011888803914189339,
        -0.02416818030178547,
        -0.043515894562006,
        -0.006165697705000639,
        -0.05018128827214241,
        0.032509416341781616,
        0.04042041674256325,
        0.03369338437914848,
        -0.06808353960514069,
        -0.08245578408241272,
        0.05716441199183464,
        0.01067606545984745,
        -0.04349314048886299,
        -0.06062355637550354,
        0.06784182041883469,
        0.046405017375946045,
        -0.06321941316127777,
        -0.04131161794066429,
        0.02461859956383705,
        0.04890576750040054,
        0.004003867506980896,
        0.06009054183959961,
        0.043789103627204895,
        0.07379887253046036,
        -0.011879106052219868,
        -0.00658806599676609,
        -0.012567409314215183,
        0.03955358639359474,
        0.01606266014277935,
        0.05010171979665756,
        0.031108159571886063,
        -0.058212753385305405,
        0.014209438115358353,
        0.08728838711977005,
        -0.036399852484464645,
        0.023528212681412697,
        -0.014435067772865295,
        -0.058754611760377884,
        0.10820985585451126,
        0.007200764026492834,
        0.025804756209254265,
        0.0037703870330005884,
        0.03242497518658638,
        -0.01757371425628662,
        0.008478180505335331,
        0.013083519414067268,
        0.027941739186644554,
        -0.016503917053341866,
        0.04954163730144501,
        -0.004291384015232325,
        -0.03253624215722084,
        0.0016734667588025331,
        -0.06903193145990372,
        -0.06014352664351463,
        0.024214845150709152,
        0.1602775901556015,
        0.012357466854155064,
        -0.05467858910560608,
        0.06393633782863617,
        -0.052254773676395416,
        -0.028254972770810127,
        -0.009054521098732948,
        -0.033759549260139465,
        0.007122389506548643,
        0.022058090195059776,
        0.09808509796857834,
        0.013415928930044174,
        -0.09574899822473526,
        0.02281844988465309,
        -0.046417005360126495,
        -0.04773100093007088,
        0.08332149684429169,
        0.006597566418349743,
        -0.006751601584255695,
        4.3981154196794504e-33,
        -0.03809880465269089,
        0.08787797391414642,
        0.028022892773151398,
        0.09422184526920319,
        0.11014965921640396,
        -0.01125212013721466,
        -0.03741002082824707,
        -0.01922706514596939,
        -0.05982378125190735,
        0.01711905188858509,
        -0.0027629216201603413,
        0.11565960198640823,
        -0.12708279490470886,
        0.06043623387813568,
        -0.02009517140686512,
        -0.09478882700204849,
        -0.04412638768553734,
        -0.04378293827176094,
        -0.010838284157216549,
        -0.05635056644678116,
        0.012725722044706345,
        0.040524233132600784,
        0.05799073725938797,
        0.07070213556289673,
        0.011943385936319828,
        0.05574348568916321,
        0.013453557156026363,
        0.0234824288636446,
        0.04212090000510216,
        0.02119218185544014,
        0.015583823435008526,
        0.05284326523542404,
        0.0031935456208884716,
        -0.023457413539290428,
        -0.040332406759262085,
        -0.011153345927596092,
        -0.022450853139162064,
        -0.08346501737833023,
        0.026611682027578354,
        0.009617326781153679,
        -0.06785360723733902,
        0.030891919508576393,
        0.008273163810372353,
        0.005635253619402647,
        -0.0724499449133873,
        -0.007972966879606247,
        0.027440818026661873,
        0.06774967908859253,
        -0.030957428738474846,
        0.032019004225730896,
        -0.05866207182407379,
        0.01033299695700407,
        0.02994968183338642,
        0.023019524291157722,
        -0.053200941532850266,
        -0.049410682171583176,
        -0.0013398929731920362,
        0.014245465397834778,
        0.0397799015045166,
        -0.054604675620794296,
        0.031379710882902145,
        0.10386304557323456,
        -0.061635822057724,
        0.0036268995609134436,
        -0.030886225402355194,
        0.009829874150454998,
        0.0003864577738568187,
        -0.004434595815837383,
        0.09759049117565155,
        0.0002840581291820854,
        -0.015295416116714478,
        0.01565016619861126,
        -0.03731819614768028,
        -0.07113460451364517,
        0.06312797218561172,
        -0.017265409231185913,
        -0.09937400370836258,
        0.03503734618425369,
        -0.004409487824887037,
        0.01663360372185707,
        0.0012323221890255809,
        -0.0980735719203949,
        -0.027726611122488976,
        -0.009470267221331596,
        -0.08179131895303726,
        -0.02895328216254711,
        -0.0058658672496676445,
        0.009719477966427803,
        0.05866263061761856,
        0.002388862194493413,
        -0.011530527845025063,
        -0.0021538587752729654,
        0.11548411846160889,
        0.08264507353305817,
        -0.030711855739355087,
        -3.9722349184024895e-33,
        0.04569675400853157,
        -0.04366829991340637,
        -0.01150056067854166,
        0.08420518785715103,
        0.06594625115394592,
        -0.06029708683490753,
        0.021657485514879227,
        -0.015160626731812954,
        0.09603232145309448,
        -0.0843091532588005,
        0.039858438074588776,
        0.017120148986577988,
        0.02526402845978737,
        -0.008750337176024914,
        -0.1015901118516922,
        0.01610649935901165,
        0.02009173296391964,
        0.023227527737617493,
        -0.043524812906980515,
        -0.06199856474995613,
        -0.014456238597631454,
        0.02813866175711155,
        -0.16745752096176147,
        0.03915577381849289,
        -0.029095403850078583,
        0.07503413408994675,
        0.09013108164072037,
        -0.013836096972227097,
        -0.10131362080574036,
        0.03558599203824997,
        -0.011947812512516975,
        0.052457619458436966,
        0.020556000992655754,
        0.025233259424567223,
        0.04422444850206375,
        0.03938315063714981,
        0.022176556289196014,
        0.057138070464134216,
        0.012042798101902008,
        -0.06490576267242432,
        0.04460849240422249,
        0.05449708551168442,
        -0.02130609005689621,
        0.016987306997179985,
        0.017302023246884346,
        0.06073084473609924,
        -0.08027565479278564,
        -0.06419362127780914,
        -0.042736396193504333,
        0.08986452966928482,
        0.012556381523609161,
        -0.06195788457989693,
        -0.03118192031979561,
        -0.05865147337317467,
        -0.03169367089867592,
        0.01639745756983757,
        0.012309172190725803,
        0.01964796893298626,
        -0.013714221306145191,
        -0.00791866797953844,
        0.0019523244118317962,
        0.014514720998704433,
        0.006063545122742653,
        0.018775714561343193,
        0.02384490892291069,
        -0.013558722101151943,
        -0.004461719188839197,
        0.030465371906757355,
        0.059165794402360916,
        -0.059069178998470306,
        0.11532964557409286,
        0.011567997746169567,
        -0.03653883561491966,
        -0.05341245234012604,
        0.0207746010273695,
        -0.007579960860311985,
        0.07551483809947968,
        -0.030090831220149994,
        -0.11193246394395828,
        -0.04006347805261612,
        -0.04805425927042961,
        0.024905286729335785,
        -0.017954539507627487,
        0.0022928521502763033,
        0.06123511493206024,
        0.08657870441675186,
        0.09265991300344467,
        -0.009097961708903313,
        -0.016412608325481415,
        0.07979028671979904,
        0.0024096607230603695,
        0.024518433958292007,
        0.001095432322472334,
        0.056561630219221115,
        0.06979059427976608,
        -5.8386799395293565e-08,
        -0.015922173857688904,
        -0.016899725422263145,
        -0.04967444762587547,
        0.0936954915523529,
        0.0030983351171016693,
        -0.032310713082551956,
        0.0036053282674402,
        0.015397235751152039,
        -0.01749192364513874,
        0.06063789501786232,
        0.020464733242988586,
        0.07528669387102127,
        0.0167913269251585,
        0.03477535769343376,
        0.0966673269867897,
        0.07647288590669632,
        0.010534077882766724,
        0.010358233004808426,
        -0.05497158691287041,
        -0.009312952868640423,
        -0.03726322948932648,
        -0.029322797432541847,
        0.08596698194742203,
        0.06236666068434715,
        -0.004750510212033987,
        -0.0025056248996406794,
        0.033895187079906464,
        -0.016077859327197075,
        0.04658517241477966,
        -0.030458200722932816,
        -0.11106805503368378,
        -0.002028189366683364,
        -0.012858979403972626,
        -0.017462249845266342,
        0.0027044794987887144,
        0.03814854472875595,
        -0.03244096785783768,
        -0.03915083780884743,
        0.03959224373102188,
        0.014868787489831448,
        -0.0419451929628849,
        -0.11255082488059998,
        -0.03309795260429382,
        0.010507800616323948,
        -0.0743120089173317,
        -0.0060257688164711,
        -0.11316338926553726,
        0.021511560305953026,
        -0.06159709766507149,
        0.12054043263196945,
        0.001906686113215983,
        -0.013904770836234093,
        0.0512559674680233,
        -0.04793652519583702,
        -0.03793897107243538,
        -0.03485175594687462,
        0.013679441064596176,
        0.06687526404857635,
        -0.00042819741065613925,
        -0.03651517629623413,
        0.07558128237724304,
        -0.02054486982524395,
        -0.0017325880471616983,
        -0.05166022479534149
    ]
}