{
    "id": "eAdfABoGZ8c",
    "title": "$399 iPhone SE Now or $649 iPhone 12 Later?",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2020-09-12T21:17:50Z",
    "video_url": "https://www.youtube.com/watch?v=eAdfABoGZ8c",
    "category": "Science & Technology",
    "tags": [
        "iPhone 12",
        "iPhone SE",
        "iPhone SE 2",
        "iPhone SE 2020",
        "iPhone SE review",
        "iPhone SE long term review",
        "iPhone SE vs iPhone 11",
        "iPhone SE vs iPhone 12",
        "iPhone SE vs iPhone 12 Pro"
    ],
    "views": 276396,
    "likes": 10532,
    "comments_count": 739,
    "description": "Long term review of the 2020 iPhone SE. Let's see how it's held up over 4 months and if it's still worth picking up or waiting for the iPhone 12!  20% Off Code: \"JONATHAN\" (valid for 48 hours!) RhinoShield 3D Impact Screen Protector:  SolidSuit Case:  All RhinoShield Cases:   Tim Apple Shirt!  The Best Mac of 2020 so far!   Shout out to everyone who cameo'd in the video!  Goober and Buddy:  Chris Drummer:  ParikV9906:  MarkSpurrell:  mtgproductions:  Jeorge Paolo:  StanJB!   14 inch MacBook Pro?   Giving the iPhone 11 to strangers  -   Follow me (if ya want) -",
    "description_links": [
        "http://bit.ly/JM-RS3D",
        "http://bit.ly/JM-SSA",
        "http://bit.ly/JM-ALL",
        "https://cottonbureau.com/products/tim-apple-lines-1#/2132949/tee-men-standard-tee-vintage-black-tri-blend-s",
        "https://youtu.be/o4bupcRIxFo",
        "https://www.youtube.com/channel/UCmXPorPK3j3Dkj1V9FL0tSw",
        "https://chrisdummer.com",
        "https://www.youtube.com/c/ParikV9906",
        "https://www.youtube.com/MarkSpurrell",
        "https://www.youtube.com/mtgproductions",
        "https://www.youtube.com/jeorgepaolo",
        "https://www.youtube.com/channel/UCp6y-PW1TqoSfSRtS73eE0A?app=desktop",
        "https://youtu.be/1VV8e3BOOzc",
        "https://www.youtube.com/watch?v=AbuDm0C4vt0",
        "http://www.twitter.com/tldtoday",
        "http://www.instagram.com/tldtoday"
    ],
    "transcript": "(upbeat urban music) - Yo, Jonathan here. The iPhone SE has been out for a little over four months now, so I wanted to cover a longer term review and talk about how I feel after the hype has died down, how it's held up and ultimately if it's still worth picking up, knowing that new iPhones are just around the corner. Now, if you're like, what, new iPhones, again, Tim Apple? We're really close to the launch of the iPhone 12 lineup. And if you want to get caught up, I'll drop a link to that down below. But the main takeaway is there's a good chance that we see a 5.4 inch iPhone 12 that starts out at potentially a price point of $649. So keep that in mind as you're watching this video. Real quickly before I continue, I wanna give a quick shout out to today's sponsor, Rhino Shield. They have coverage and protection on everything from the iPhone SE all the way up to the 11 Pro Max and while they are known for their sleek, minimal cases with insane protection on drops like this, they've expanded way beyond that, implementing modularity, customization and now this, their 3D impact screen protector, which is amazing. I feel like we've all seen our fair share of people walking around with broken glass screen protectors and this is the answer. On a simple level it's impact resistant. It's more flexible, it's more durable. It won't crack light glass. So I think that right there speaks more than words ever could. You're getting an edge to edge protection. And when you combine that with one of the cases, you're protecting your phone in every possible way. So definitely make sure to check out the 3D impact screen protector, as well as their entire lineup with a 20% discount linked down below. Now to quickly recap, the iPhone SE that launched this year is technically the second generation. It was a followup to the original four inch iPhone SE that was loved by so many people who enjoyed and preferred the smaller form factor and didn't want to move to a bigger iPhone. As awesome as it would have been for Apple to keep that design, that smaller form factor, that four inch screen, ultimately what they needed to pack inside would not work. So the end result essentially is an iPhone 8 body with the internals of an iPhone 11 and 11 Pro. So the same exact A13 Bionic chip, which is kind of insane even to this day, when you consider the starting price of $399. To this day, I still see the argument and the comment of, well, why do you need a processor that powerful to go inside a quote unquote budget phone like the iPhone SE? And I've talked about it. The power of something like an A13 Bionic was so far beyond loading apps or swiping through pages. Honestly, that's why the camera on the SE is as good as it is, because if it were just hardware, it really wouldn't be that special. You get a single 12 megapixels shooter on the back, seven megapixels on the front, both are portrait mode capable. I think this right here is an example of why that A13 Bionic is as impressive as it is, one, we're screen recording, no dropped frames, no lag. You can see how quickly, how responsive it's tracking me. And something that I think is super undervalued is the fact that you're previewing portrait mode in real time. It's one thing to snap a picture, wait for it to process and then see it afterwards, but see what's happening as it's happening is invaluable. There are some downsides, as far as the camera, in terms of one, no ultra wide angle lens, which might not be a deal breaker. But for me, I think what the bigger bummer is, is the lack of night mode, especially in 2020. If those two things don't really matter to you though, apart from those omissions, it is a really impressive camera. Now for this video, I wanted to collaborate with you guys who use an iPhone SE to see what you've captured on it. This is a brilliant example of that smart HDR putting in all kinds of work. And then here, come on. That looks like a studio photography shot, not a $399 smartphone. Here it would not be a smartphone camera showcase without a beautiful flower shot. And that's exactly what this is. Now as impressive as the camera is in terms of photography in stills, I think where the iPhone SE shines and we're nothing else really comes close for the price is video. - I love the video camera you get on this little guy for $400, probably the best camera you can get at that price. - [Jonathan] The fact that you can get this kind of video quality out of a $400 device is bananas. It'll shoot all the way up to 4K, 30 frames per second, with extended dynamic range or 4K 60 without. So here's what a crazy apocalyptic California sunset looks like right now with that extended dynamic range. Now, for contrast, if we hop over to the front facing camera, which does not have the extended dynamic range, you can see why it's so special. From there, I do still see questions of why would you even need to shoot 4K 60 frames per second video? And in my case, I use it all the time so I can slow it down in posts. (upbeat music) (blowing) The other big thing, and why I think the iPhone SE is still special to this day is when you combine that A13 Bionic with the fact that Apple continues to update their phones way beyond the original launch date. That means it's gonna be relevant for years to come. With that said, as good as this phone has been, the weakest part by far is definitely the battery life. It's just not great. - The only downside, I think, is the battery life. - Has gotta be the battery life. - It doesn't last the whole day most of the time. - It's meh, it's all right. - If you're just a light user and you spend your day scrolling Twitter or watching YouTube videos, you could get some decent amount of screen on time, but feed that hungry A13 Bionic a demanding game, or spend some time in the camera app. And you'll quickly find yourself running for the charger. - Is definitely one of those phones where you're going to absolutely be charging by the end of the day and not creeping into the next, which is an advantage of something like the iPhone 11 or 11 Pro, I guess it also does depend on how you use your phone. And really the point of the iPhone SE is to pack all the essentials at an affordable price. So you get great performance, a solid camera, software updates, you can jump into the Apple ecosystem with things like iMessage, FaceTime, AirDrop, and I love all those things, but I do want you to keep in mind if you use your phone a ton, the battery life is not amazing. I would say one surprising element with the iPhone SE, something that would normally be considered a downgrade to the flagship smartphones that actually turned into a positive or potentially an advantage is the fact that it packs touch ID and a physical home button. So with that of course, there is no face ID, but with 2020 and face mask being a thing, wear your mask, it's actually been really convenient and helpful not having to worry about that and just using the home button, not only unlocking your phone, but things like Apple Pay and it's kind of almost brought me back full circle where prior to 2020, I was content and super happy with just face ID. I didn't need or miss touch ID, but after this year, fast forward to now, I hope it makes its way back in some form or fashion. The bezels on this phone, they're there, they're in your face. And if you're coming from a modern looking phone, is probably going to be hard to adjust, but if you're coming from the original iPhone SE or an iPhone 8, it's probably not gonna be that big a deal. The screen itself though is solid. It's a typical high quality Apple LCD. It's bright, it's vibrant, it's accurate. You just have of course, giant bezels. - I upgraded from the iPhone 6 to the SE. So no complaints. - So to this day, I think the iPhone SE has held up. It's a great option, especially if you wanna jump into the Apple world without dropping a ton of cash. If battery life is a big deal to you, or you want a slightly larger screen, but didn't wanna jump into something like the iPhone 11, then I would probably wait until the iPhone 12 drops. But again, if you don't want to spend over 500 bucks, the iPhone SE is hard to argue with and with that money you'd save, you can throw it towards AirPods and Apple Watch, or just keep it in your pocket. So hopefully you guys enjoyed the video. Hopefully you found it helpful, if you did make sure you guys go Tim Apple on that like button. Thank you guys so much for watching. This is Jonathan and I will catch you guys later. (upbeat music)",
    "transcript_keywords": [
        "iPhone",
        "Apple",
        "camera",
        "screen",
        "phone",
        "Bionic",
        "video",
        "Tim Apple",
        "day",
        "battery life",
        "inch iPhone",
        "battery",
        "guys",
        "life",
        "price",
        "time",
        "iPhones",
        "Pro",
        "things",
        "impact screen protector"
    ],
    "transcript_entity_values": [
        "Pro Max",
        "two",
        "iPhone",
        "2020",
        "400",
        "Apple Watch",
        "an A13 Bionic",
        "this day",
        "12 megapixels",
        "Twitter",
        "4",
        "the iPhone SE",
        "Tim Apple",
        "A13 Bionic",
        "30",
        "iPhones",
        "Apple",
        "iPhones",
        "seven megapixels",
        "a ton",
        "AirPods",
        "The iPhone SE",
        "A13 Bionic",
        "California",
        "11",
        "20%",
        "5.4 inch",
        "SE",
        "second",
        "years",
        "FaceTime",
        "the end of the day",
        "one",
        "12",
        "Rhino Shield",
        "AirDrop",
        "today",
        "YouTube",
        "a little over four months",
        "649",
        "this year",
        "iMessage",
        "399",
        "over 500 bucks",
        "four inch",
        "iPhone SE",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "PERSON",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "PERSON",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "ORG",
        "PERSON"
    ],
    "vector": [
        -0.057813577353954315,
        -0.018939340487122536,
        0.12225078791379929,
        -0.02095647342503071,
        0.03382342308759689,
        0.010242599993944168,
        0.01703324168920517,
        0.09596528857946396,
        -0.009484915994107723,
        0.028585778549313545,
        0.059678975492715836,
        0.009810511954128742,
        -0.0007676567183807492,
        0.006894806865602732,
        0.02448190376162529,
        -0.012587008997797966,
        0.0865974873304367,
        -0.08259876072406769,
        -0.07580682635307312,
        0.015513073652982712,
        -0.056569356471300125,
        -0.02096535451710224,
        0.024295685812830925,
        0.0035746688954532146,
        0.030183689668774605,
        0.06502944976091385,
        -0.02807488664984703,
        -0.06601058691740036,
        -0.07121063768863678,
        -0.001312888227403164,
        -0.020802775397896767,
        0.06289905309677124,
        0.025793448090553284,
        0.03886009380221367,
        -0.019836340099573135,
        -0.11421892791986465,
        0.06391306221485138,
        -0.006922099273651838,
        -0.008913407102227211,
        -0.033007584512233734,
        -0.10045700520277023,
        -0.027981391176581383,
        -0.017466163262724876,
        0.08507417887449265,
        0.019463693723082542,
        -0.04524469003081322,
        0.09874961525201797,
        0.0068602729588747025,
        -0.0042375423945486546,
        0.020033584907650948,
        0.02308935485780239,
        -0.0657893642783165,
        -0.009646488353610039,
        0.0024561958853155375,
        -0.032817184925079346,
        0.056680407375097275,
        0.009932935237884521,
        -0.010056240484118462,
        0.058285560458898544,
        0.012672146782279015,
        0.021841447800397873,
        -0.07523344457149506,
        -0.010393788106739521,
        0.02431977167725563,
        0.06388480961322784,
        -0.07294280081987381,
        -0.008328345604240894,
        -0.04890524968504906,
        0.0016137766651809216,
        0.08469893783330917,
        0.021694274619221687,
        0.017543461173772812,
        0.04961000010371208,
        -0.0035632536746561527,
        -0.008017590269446373,
        0.027537046000361443,
        0.04324350506067276,
        -0.04634670168161392,
        -0.04722030833363533,
        0.0258037019520998,
        0.07789187878370285,
        -0.017667874693870544,
        -0.04038124531507492,
        -0.05833439156413078,
        -0.004989996086806059,
        -0.025631526485085487,
        0.027642030268907547,
        0.043700262904167175,
        -0.09085605293512344,
        -0.0702182725071907,
        0.03289200738072395,
        0.1087380051612854,
        0.0066582439467310905,
        -0.028312597423791885,
        0.029042504727840424,
        0.025761082768440247,
        -0.033873166888952255,
        -0.011954681016504765,
        -0.04608646407723427,
        0.028004368767142296,
        0.03431924432516098,
        0.016780652105808258,
        0.022440170869231224,
        -0.035852573812007904,
        0.02722703292965889,
        -0.05863996595144272,
        -0.04132501408457756,
        -0.006080879829823971,
        0.015917891636490822,
        0.07838677614927292,
        -0.005596568807959557,
        0.01808575913310051,
        -0.06618158519268036,
        0.01894833706319332,
        0.036286529153585434,
        0.003503357758745551,
        0.03128495439887047,
        0.09842914342880249,
        0.14576543867588043,
        0.03932897746562958,
        0.0049495087005198,
        0.04481971636414528,
        0.002190885366871953,
        -0.04723647981882095,
        -0.033192235976457596,
        0.00013044007937423885,
        -0.03351646289229393,
        5.1953658104498656e-33,
        -0.04243113845586777,
        0.06385336071252823,
        -0.06035343185067177,
        0.025720136240124702,
        0.013100537471473217,
        -0.08454100042581558,
        0.052793316543102264,
        0.07082047313451767,
        -0.035154953598976135,
        0.033116456121206284,
        -0.041543323546648026,
        0.008536819368600845,
        -0.05942550301551819,
        0.04887757450342178,
        0.0304995309561491,
        -0.032809894531965256,
        -0.10297085344791412,
        -0.06163772568106651,
        -0.038992177695035934,
        -0.0008808261482045054,
        0.00449565052986145,
        -0.07860099524259567,
        -0.0460200197994709,
        0.046760402619838715,
        -0.013997507281601429,
        -0.017012717202305794,
        0.06949173659086227,
        -0.009288162924349308,
        0.01015765592455864,
        -0.011209400370717049,
        -0.11390724778175354,
        0.04068559408187866,
        0.013835109770298004,
        -0.09051652252674103,
        -0.0648210421204567,
        0.010800310410559177,
        0.0143593093380332,
        -0.06718950718641281,
        0.06744682788848877,
        -0.04801289364695549,
        -0.11709517985582352,
        0.05162922665476799,
        -0.05117812752723694,
        -0.017222557216882706,
        0.06812436878681183,
        0.01596418023109436,
        -0.022776909172534943,
        0.012347698211669922,
        0.0026398918125778437,
        -0.02773883007466793,
        -0.022175593301653862,
        -0.07711925357580185,
        0.008150297217071056,
        -0.005891569424420595,
        -0.13210418820381165,
        -0.02858438342809677,
        0.008559021167457104,
        -0.07740699499845505,
        0.03676067665219307,
        0.06046893820166588,
        0.05472470819950104,
        0.031339943408966064,
        -0.013394697569310665,
        -0.014024393633008003,
        -0.09675000607967377,
        0.11288690567016602,
        0.016235128045082092,
        0.007551833055913448,
        -0.07410641759634018,
        0.08542431145906448,
        -0.034799207001924515,
        0.014333655126392841,
        -0.005378632806241512,
        -0.06425579637289047,
        0.05549190565943718,
        -0.021072842180728912,
        -0.02821902371942997,
        -0.053502365946769714,
        -0.00863516703248024,
        -0.007903472520411015,
        0.038019809871912,
        0.038588233292102814,
        0.02354525215923786,
        0.03246597573161125,
        0.07741940021514893,
        -0.02622019499540329,
        -0.01067381165921688,
        -0.08015881478786469,
        -0.00710633210837841,
        0.08010511845350266,
        -0.05038652941584587,
        -0.026993175968527794,
        -0.030665136873722076,
        0.024789651855826378,
        0.025660136714577675,
        -6.531976723073718e-33,
        0.024861732497811317,
        -0.07938148826360703,
        0.019488157704472542,
        0.012934956699609756,
        -0.01857122965157032,
        -0.040468163788318634,
        -0.04497457668185234,
        0.11321359127759933,
        -0.03226148337125778,
        -0.08032876998186111,
        -0.026216154918074608,
        0.0755142942070961,
        0.0030276679899543524,
        0.04314412549138069,
        -0.05754026398062706,
        -0.04025612026453018,
        -0.0979805439710617,
        -0.12716378271579742,
        0.07364566624164581,
        0.0103952307254076,
        0.0709369108080864,
        0.014427677728235722,
        -0.00845933798700571,
        0.04817948862910271,
        -0.08597707003355026,
        -0.021269701421260834,
        0.019687287509441376,
        0.013713882304728031,
        0.029855022206902504,
        -0.05119277164340019,
        -0.02173706330358982,
        -0.12858186662197113,
        -0.011675896123051643,
        0.012750356458127499,
        0.07968151569366455,
        0.039956990629434586,
        0.028704853728413582,
        -0.019672196358442307,
        0.0018375854706391692,
        -0.011869938112795353,
        0.04419731721282005,
        0.06946415454149246,
        -0.0011530537158250809,
        -0.020136011764407158,
        0.06838357448577881,
        -0.03080013021826744,
        0.010633735917508602,
        0.06912697851657867,
        0.02392573095858097,
        0.028363561257719994,
        0.007858977653086185,
        0.012196678668260574,
        -0.020432796329259872,
        0.04871172085404396,
        -0.09042119979858398,
        0.011286390945315361,
        0.006353938020765781,
        -0.0363045297563076,
        0.010327108204364777,
        0.015918122604489326,
        -0.03063960373401642,
        0.06157970800995827,
        -0.014316541142761707,
        -0.058069098740816116,
        -0.050047215074300766,
        -0.03632175549864769,
        0.028598938137292862,
        -0.02070796675980091,
        -0.009473739191889763,
        0.029267942532896996,
        -0.07650639861822128,
        -0.05396806076169014,
        -0.0696823000907898,
        -0.09527643769979477,
        0.0002514948137104511,
        0.04135006293654442,
        0.011888801120221615,
        -0.007900812663137913,
        -0.04854457825422287,
        0.002764320932328701,
        0.037915125489234924,
        0.10115952044725418,
        0.010470929555594921,
        -0.014381730929017067,
        0.10315676033496857,
        0.10669770836830139,
        0.054026179015636444,
        0.017240380868315697,
        -0.03950587287545204,
        0.0680321529507637,
        -0.023465821519494057,
        0.02913854829967022,
        -0.07135389745235443,
        0.006586230359971523,
        -0.018059642985463142,
        -5.721746276776685e-08,
        0.023466113954782486,
        0.04723426699638367,
        0.03583960235118866,
        -0.04635503888130188,
        0.03925781324505806,
        0.005685549695044756,
        -0.028217803686857224,
        -0.016483744606375694,
        0.10081128031015396,
        0.0036970817018300295,
        0.04469924420118332,
        -0.07573679834604263,
        -0.1386435329914093,
        0.07331148535013199,
        -0.039188697934150696,
        0.06189662590622902,
        -0.0367451086640358,
        0.04511489346623421,
        -0.006485980935394764,
        -0.0035340278409421444,
        -0.032762471586465836,
        0.08113288134336472,
        0.07700638473033905,
        -0.010336564853787422,
        0.008471551351249218,
        0.056020766496658325,
        0.00224559148773551,
        0.005238182842731476,
        -0.005938455928117037,
        0.017176426947116852,
        -0.027565548196434975,
        -0.0060198078863322735,
        -0.050300709903240204,
        -0.029630016535520554,
        -0.011854425072669983,
        -0.11817420274019241,
        -0.029871946200728416,
        -0.03691145405173302,
        0.08513699471950531,
        -0.012007337063550949,
        0.01365718338638544,
        -0.08053814619779587,
        -0.0041997553780674934,
        0.01486114040017128,
        0.03771587461233139,
        -0.1023401990532875,
        -0.03955267742276192,
        -0.09423995018005371,
        -0.021984053775668144,
        0.06057155132293701,
        -0.0066628833301365376,
        -0.11328927427530289,
        -0.04635779559612274,
        0.040465496480464935,
        0.050767846405506134,
        -0.019539812579751015,
        -0.020553281530737877,
        0.039698634296655655,
        -0.007483065593987703,
        0.07026362419128418,
        0.08745584636926651,
        -0.16720053553581238,
        -0.023795418441295624,
        0.09773018956184387
    ]
}