{
    "id": "eAIw4eE-OPg",
    "title": "Moto G5 Plus Review: The Best Android Phone Under $300",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-03-25T00:42:06Z",
    "video_url": "https://www.youtube.com/watch?v=eAIw4eE-OPg",
    "category": "People & Blogs",
    "tags": [
        "moto g5 plus review",
        "best phone under 300",
        "best 300 phone",
        "moto g5 review",
        "moto g review",
        "moto g review 2017",
        "mrmobile",
        "android central",
        "moto g 2017",
        "motorola",
        "lenovo"
    ],
    "views": 471101,
    "likes": 9490,
    "comments_count": 877,
    "description": "Each year, the title of \"best smartphone under $300\" gets harder to snag  and each year, Motorola nails it yet again. The Moto G5 Plus is a worthy successor to its affordable forerunners, with smart software, useful features, and a price tag impossible to ignore. Even in a world of Honor 6Xs and Axon 7 Minis, I still think it's the best phone under 300 smackers  but will that hold true for you? Find out in MrMobile's Moto G5 Plus review!   [SUBSCRIBE]     [SPONSOR] The Moto G5 Plus review is brought to you by MintSIM, the new choice for high-speed LTE in the US. Head to  and use discount code MRMOBILE20 for 20% off a 6- or 12-month plan!    [ABOUT THE MOTO G5 PLUS REVIEW]  MrMobile's Moto G5 Plus Review was produced following five days with a Moto G5 Plus review device on loan from Lenovo. The device was tested on T-Mobile US in Greater Boston and San Francisco, and paired with an LG Watch Sport for the duration of the review period.   [SPONSOR: ADDITIONAL INFO]  Visit  and use discount code MRMOBILE20 for 20% off on a 6-month or 12-month plan! You'll receive unlimited talk and text, with insanely low prices on ultra-fast, reliable 4G LTE data:   -2GB of high-speed data just $13.60 per month -5GB of high-speed data just $20.27 per month -10GB of high-speed data just $26.93 per month (!)  (Savings based on 12-month plan. Discount code does not work with 3-month plan. Includes regulatory recovery fee. Plan requires compatible phone. Please see mintsim.com for details.)  MintSIM: premium-quality service on a premium-quality network, for a fraction of the price.   [PRODUCTS IN THIS VIDEO]  Moto G5 Plus:   Samsung Galaxy S7:   Anker PowerLine II Dura:     [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  Lifetime Travels by Cymatix, available at Premium Beat:   New Media by Olive Musique, available at Premium Beat:    [SOCIALIZE]         [THUMBNAIL]  Custom thumbnail by Jose Negron, Mobile Nations   [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mintsim.com",
        "http://mintsim.com",
        "http://mrmobile.tech/1ga",
        "http://mrmobile.tech/1gd",
        "http://mrmobile.tech/1gb",
        "https://www.premiumbeat.com/royalty_free_music/songs/lifetime-travels",
        "https://www.premiumbeat.com/royalty_free_music/songs/new-media",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] These are three of the newest smartphones to hit the shelves. The difference between them? A few features, a few inches, and about 400 bucks. If you're looking to save a ton of money on your next Android, the Moto G5 Plus is your ride. I'm Michael Fisher, and this is the MrMobile Review. (energetic electronic music) Today's video is brought to you by Mint SIM, stick around to the end to learn how to get unlimited calls, texts and 10 gigs of LTE per month for prices starting at $20 per month. The Moto G5 Plus is not your typical budget smartphone, it carries the family name of a brand that blew the mobile world wide open, when it launched in 2013. The original Moto G delivered so much quality, at such a low price, that it became Motorola's best-selling phone ever. Each year since, the company has tweaked the formula, moving speakers around, dabbling in waterproofing, sneaking in some extra features, but still hewing to the original goal of shipping a solid phone, at an affordable price. You don't need to long a look to see what sets the new series apart from its forerunners. Where earlier Gs made due with rubberized soft-touch casings or snap-on plastic backs, this one wants you to marvel at its magnificence. And I don't really think it works. It doesn't feel cheap necessarily, but the minute you pick it up you realize that it's an affordable product trying too hard to look expensive. And that's fine, a lot of products do that, but what's unfortunate about it is that Motorola didn't need to do it with past Moto Gs. The older designs embraced and even amplified their utilitarian roots, and as a result, they stood out. The G5 Plus looks, well, an awful lot like other affordable phones coming out of Asia right now. To me, that's a missed opportunity to stand out from the pack. At least the Lunar Gray model is a bit more subdued. If you value function over form, the G5 Plus does its ancestors proud. This is Android 7.0 with the Motorola interface, which means it's close to stock Android, and where it does deviate, it's usually for the better. On the cosmetic side, the launcher brings in elements from the Google Pixel, while the Moto Display has been given a more colorful paint job, though, admittedly, that's hard to see on this rather dull LCD. It seems likely that this version of Moto Display is something we'll also see on the next Moto Z. And maybe that goes for the fingerprint scanner, too, which has been enlarged and given limited trackpad abilities. If you don't want the traditional soft keys down at the bottom, you can use gestures instead, left swipe for back, right for the app switcher, and taps of varying lengths to go home or activate Google Assistant. On the more practical front, Motorola's now classic gestures are back again, spend a week chopping on the flashlight, or twisting the camera to life, and you'll wonder how you ever lived without 'em. (light music) The camera hides more fun tricks in its viewfinder, it automatically reads QR codes and barcodes, saving you the trouble of downloading an app for that. As for the shooter itself, Motorola calls it a flagship-level camera sensor, and, to its credit, it does focus quickly. It's also got a wide aperture and a capable HDR mode, plus the option to shoot video in 4K. Mix all that together and you've got a phone that can deliver pretty, sometimes very pretty photos in daylight or bright indoor settings. Spend a few minutes messing with them in Instagram and no one will know you're using a budget device. But turns the lights down and the challenges that befall all smartphone cameras hit the G5 Plus even harder. The lack of optical stabilization and the tendency of both front and back cameras to overexpose, it means you're gonna be working a little harder to get good shots here than you would with a more expensive product. There is a full manual mode available for that, though. Much has been made of the phone's other shortcomings, like the use of the older micro USB port for charging, and the lack of NFC, meaning you can't use Android Pay in stores. But these are the sort of comprises I've come to expect in an affordable smartphone. When Lenovo told me its market research suggested that not a lot of budget phone buyers even care about Android Pay, I wasn't surprised, it's still trying to get traction on the high end. And while it's annoying to have to carry around an older charging cord, it's not that old. Last year's top of the line Android phones still used it, and you're more likely to find micro USB cables lying around than newer USB-C ones. Plus, with a good-sized battery and a very power-efficient processor, you won't often be worried about charging, at least not before bedtime. The G5 Plus gave me an average of 14 hours, moderate to heavy use and that includes some power-sucking games, like Asphalt 8, and Sky Gamblers: Air Supremacy, games which played with nary a hiccup, by the way. As usual, the more I streamed TuneIn Radio over Bluetooth, the sooner I needed to refuel. The in-box wall adapter is a TurboPower charger, though, so topping it up is a speedy process. Not likely to be a speedy process, software updates. Motorola has become far less prompt at delivering the latest Android versions since Lenovo bought it, and that's troubling. Back on the plus side, phone calls are unsurprisingly pretty good, and while the speaker phone may not be the loudest thing around, at least it's front-firing, which I really like. The Moto G5 Plus will be available unlocked starting March 31st in the US, at retailers from Amazon, to Best Buy, to Target, to Walmart and beyond. It's compatible with all four major US carriers, and it comes in two trims, based on how much storage and RAM you think you need. My review device was the higher end model, so I can only give my recommendation based on that one. What is that recommendation? Well, if I had to keep my smartphone spending under $300, and I wanted a new phone, instead of one of last year's discounted models, I wouldn't look anywhere else. And, for what it's worth, I'd probably buy from Amazon to get the discounted price for Prime members. The Moto G5 Plus marries excellent performance, great battery life and smart software, with an acceptable camera, for a price tag that's tough to beat, if you're shopping unlocked. Buy it and, if you want, spend some of the money you save on a case to take the edge off that look. If you wanna save money on your phone service, as well as your phone, check out today's sponsor, hit the link in the description to go to mintsim.com, pick a six or 12-month plan, and use discount code MRMOBILE20. You'll get unlimited talk and text and 10 gigs of LTE per month for between 20 and $27 per month. Mint SIM, premium quality service on a premium quality network, for a fraction of the price. Please subscribe if you enjoyed this video, folks. Until next time, thanks for watching and stay mobile, my friends.",
    "transcript_keywords": [
        "Moto",
        "phone",
        "Android",
        "Moto Display",
        "Motorola",
        "Android Pay",
        "Android phones",
        "price",
        "Motorola bestselling phone",
        "line Android phones",
        "newest smartphones",
        "camera",
        "original Moto",
        "back",
        "affordable",
        "hit the shelves",
        "smartphone",
        "LTE per month",
        "Mint SIM",
        "month"
    ],
    "transcript_entity_values": [
        "Moto Gs",
        "about 400 bucks",
        "Today",
        "Lenovo",
        "a ton",
        "TurboPower",
        "the G5 Plus",
        "Walmart",
        "LTE",
        "300",
        "last year's",
        "Instagram",
        "the Moto Display",
        "20",
        "At least the Lunar Gray",
        "12-month",
        "2013",
        "March 31st",
        "The Moto G5 Plus",
        "between 20 and $27",
        "four",
        "three",
        "10",
        "Moto Display",
        "USB",
        "Moto Z.",
        "Sky Gamblers",
        "Amazon",
        "Motorola",
        "the Google Pixel",
        "Target",
        "MRMOBILE20",
        "Last year's",
        "US",
        "a few minutes",
        "Best Buy",
        "today",
        "a few inches",
        "LCD",
        "the MrMobile Review",
        "7.0",
        "Google",
        "two",
        "Moto G",
        "The G5 Plus",
        "six",
        "The Moto G5",
        "Mint SIM",
        "Asphalt",
        "14 hours",
        "Mint",
        "G5 Plus",
        "NFC",
        "Asia",
        "Michael Fisher",
        "one",
        "Android",
        "8",
        "the G5 Plus"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "TIME",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG",
        "PRODUCT",
        "ORG",
        "LOC",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.1233215257525444,
        0.013984829187393188,
        0.08406263589859009,
        -0.026080399751663208,
        0.026850784197449684,
        -0.04513093829154968,
        -0.030873555690050125,
        0.03242887929081917,
        -0.07540623843669891,
        0.06077318266034126,
        0.017762640491127968,
        0.08656635880470276,
        0.008936883881688118,
        -0.00988419447094202,
        0.0362025648355484,
        -0.0005012447363696992,
        0.11869706213474274,
        -0.0918533205986023,
        -0.025135906413197517,
        0.004762076772749424,
        0.023364247754216194,
        -0.06591751426458359,
        0.03956412151455879,
        0.050514496862888336,
        0.05690593272447586,
        -0.04492335766553879,
        -0.07363215833902359,
        -0.0025002025067806244,
        -0.0337914377450943,
        -0.008419704623520374,
        -0.0029108216986060143,
        0.14808566868305206,
        0.0028369820211082697,
        -0.02667265199124813,
        -0.0807482898235321,
        -0.05243835970759392,
        0.029163911938667297,
        0.007944426499307156,
        -0.0006450646324083209,
        -0.0690821185708046,
        -0.07088050991296768,
        -0.07889650762081146,
        0.020326122641563416,
        0.01838443987071514,
        0.05784526467323303,
        -0.05502067133784294,
        0.03015076369047165,
        -0.02230730839073658,
        0.009463362395763397,
        -0.032951876521110535,
        0.044443100690841675,
        -0.09489119797945023,
        0.016535259783267975,
        -0.037452250719070435,
        -0.12707136571407318,
        0.0009386902675032616,
        -0.06105084344744682,
        0.017571695148944855,
        0.05808717757463455,
        -0.02900371514260769,
        -0.0074793198145926,
        -0.042101819068193436,
        -0.022459538653492928,
        0.060363203287124634,
        -0.02619713358581066,
        -0.017770174890756607,
        -0.00867010559886694,
        -0.062393561005592346,
        -0.013827579095959663,
        0.046869561076164246,
        -0.008304907009005547,
        0.006586482748389244,
        0.09714093059301376,
        0.030425935983657837,
        -0.06796688586473465,
        0.07815749198198318,
        0.058390919119119644,
        0.02118873782455921,
        0.024188976734876633,
        0.013088000006973743,
        0.0379757359623909,
        0.022646157070994377,
        -0.016399230808019638,
        -0.03692451864480972,
        0.0962141752243042,
        -0.034439850598573685,
        -0.007755183149129152,
        0.08844055235385895,
        -0.039369840174913406,
        -0.07328048348426819,
        0.014723805710673332,
        0.14102070033550262,
        -0.07874155044555664,
        0.005165053065866232,
        -0.08645984530448914,
        0.030116813257336617,
        -0.06337251514196396,
        -0.05596543475985527,
        -0.09819136559963226,
        0.02526629902422428,
        0.04803463816642761,
        0.03465643525123596,
        0.04381568729877472,
        0.034146878868341446,
        0.07627354562282562,
        -0.04325880855321884,
        -0.028993813320994377,
        0.026757871732115746,
        -0.004948929883539677,
        0.01670674979686737,
        -0.0554787814617157,
        0.0679568201303482,
        -0.04383406043052673,
        -0.017159296199679375,
        -0.056770049035549164,
        -0.00029451126465573907,
        -0.052035022526979446,
        0.08118332177400589,
        0.13662013411521912,
        0.015848839655518532,
        -0.008236147463321686,
        -0.007989685982465744,
        -0.04535538703203201,
        -0.12241461127996445,
        0.014893966726958752,
        -0.008077715523540974,
        -0.04160936549305916,
        7.351422651239565e-33,
        -0.011947480030357838,
        0.06338367611169815,
        0.006251583807170391,
        -0.06149451434612274,
        -0.07178126275539398,
        0.03301043435931206,
        0.001969540724530816,
        -0.003310862462967634,
        -0.009673054330050945,
        0.06822097301483154,
        -0.07989592850208282,
        -0.03970892354846001,
        -0.02945890463888645,
        0.03932785987854004,
        0.039971981197595596,
        -0.048816271126270294,
        -0.08809550106525421,
        -0.030497869476675987,
        -0.02802431397140026,
        -0.01473104115575552,
        -0.014828403480350971,
        -0.07845044881105423,
        -0.05011998489499092,
        -0.05246367305517197,
        0.009993919171392918,
        0.1315433382987976,
        0.08207492530345917,
        -0.06148029491305351,
        0.06823159754276276,
        0.038888461887836456,
        -0.10737571120262146,
        -0.02758117951452732,
        0.025319527834653854,
        0.016393283382058144,
        -0.014676319435238838,
        0.029533421620726585,
        -0.05813799053430557,
        -0.09780308604240417,
        0.02821415476500988,
        -0.038987208157777786,
        -0.03312449902296066,
        0.00273908581584692,
        -0.11589428782463074,
        -0.02268681675195694,
        0.040164753794670105,
        0.007404443807899952,
        0.027527030557394028,
        0.006955208256840706,
        0.011181961745023727,
        0.008144970051944256,
        -0.05763346701860428,
        -0.05929554998874664,
        -0.060537442564964294,
        0.016599804162979126,
        -0.07661090791225433,
        0.02740178070962429,
        0.020282965153455734,
        0.02946753427386284,
        0.036445192992687225,
        0.07037098705768585,
        -0.022991513833403587,
        -0.027062913402915,
        -0.005472796969115734,
        -0.02003343217074871,
        -0.07102499902248383,
        0.047164712101221085,
        -0.04001525044441223,
        -0.035856474190950394,
        -0.009053627029061317,
        0.106541708111763,
        0.0934867113828659,
        -0.014068289659917355,
        0.08552095293998718,
        0.036009687930345535,
        0.06483834981918335,
        0.0026707348879426718,
        0.09456126391887665,
        0.052716366946697235,
        -0.009402080439031124,
        -0.002693652641028166,
        -0.020891373977065086,
        -0.01565367542207241,
        0.04440649598836899,
        0.023191696032881737,
        0.038794130086898804,
        0.04782557114958763,
        -0.05576658248901367,
        -0.07654762268066406,
        0.0029299091547727585,
        0.09422225505113602,
        -0.034255221486091614,
        -0.04383208602666855,
        0.009873105213046074,
        0.049401745200157166,
        0.0007845436339266598,
        -6.038416767206179e-33,
        -0.0007909979904070497,
        -0.00928564090281725,
        0.12279767543077469,
        0.014280191622674465,
        -0.020725192502141,
        -0.08786719292402267,
        -0.014746892265975475,
        0.01822469010949135,
        -0.05704797804355621,
        -0.0280971247702837,
        -0.02195124700665474,
        0.03253321349620819,
        0.030458364635705948,
        0.037218254059553146,
        -8.389792492380366e-05,
        -0.049962885677814484,
        -0.026319747790694237,
        -0.11230538040399551,
        0.1337510198354721,
        -0.0060597131960093975,
        0.07311733067035675,
        0.06249305233359337,
        0.014720501378178596,
        0.04567834734916687,
        0.040383707731962204,
        -0.007705057971179485,
        -0.031274162232875824,
        0.03130636736750603,
        0.06064348295331001,
        -0.06569857150316238,
        0.01575850509107113,
        -0.031267669051885605,
        -0.008887256495654583,
        -0.0038876007311046124,
        0.10043428093194962,
        -0.009614107199013233,
        0.003906519617885351,
        0.04768791422247887,
        0.03542733192443848,
        0.03875596821308136,
        0.01820380426943302,
        0.019731983542442322,
        0.05957409739494324,
        -0.029676424339413643,
        0.059387724846601486,
        -0.04481508582830429,
        -0.01660901866853237,
        -0.02722027152776718,
        0.014356172643601894,
        0.019081998616456985,
        0.03863849490880966,
        0.01366416085511446,
        -0.06088102236390114,
        0.033157121390104294,
        -0.0625358298420906,
        -0.020421644672751427,
        0.012538354843854904,
        -0.0915495827794075,
        -0.029221555218100548,
        -0.03074287436902523,
        0.044825635850429535,
        0.016241131350398064,
        0.0021380321122705936,
        0.03332759067416191,
        -0.006682539824396372,
        0.06653667241334915,
        0.12154631316661835,
        0.04331251233816147,
        -0.016651492565870285,
        0.043500613421201706,
        -0.11937419325113297,
        -0.06524915993213654,
        0.03373602405190468,
        -0.04424918815493584,
        0.04867566376924515,
        0.046258557587862015,
        -0.06735240668058395,
        -0.00033325518597848713,
        0.013567201793193817,
        -0.05978197604417801,
        0.037228941917419434,
        0.024618050083518028,
        0.002980263205245137,
        0.00571014080196619,
        0.01959521882236004,
        -0.039749350398778915,
        -0.021603399887681007,
        0.018461527302861214,
        0.018660908564925194,
        0.0724131241440773,
        -0.055441781878471375,
        0.09260603040456772,
        -0.0854339748620987,
        0.0027198130264878273,
        -0.004679646342992783,
        -4.942561204757112e-08,
        0.07910708338022232,
        0.0017568450421094894,
        0.015689317137002945,
        -0.031601712107658386,
        0.06913504004478455,
        -0.0032393508590757847,
        -0.062294334173202515,
        -0.026712138205766678,
        0.1029837355017662,
        0.05233413726091385,
        0.009651565924286842,
        -0.04825364798307419,
        -0.045095883309841156,
        0.006744719576090574,
        -0.0692761018872261,
        0.007473473437130451,
        -0.006576853804290295,
        0.014394646510481834,
        0.012224692851305008,
        0.07195549458265305,
        0.026970189064741135,
        0.05342048779129982,
        0.016170872375369072,
        -0.03484431281685829,
        0.07582201808691025,
        0.0013834749115630984,
        0.0019358259160071611,
        0.05231594294309616,
        0.03792799636721611,
        -0.02940448187291622,
        -0.04888125881552696,
        0.044059816747903824,
        -0.0026608011685311794,
        -0.00793540757149458,
        -0.0017173559172078967,
        0.004758607130497694,
        -0.020302457734942436,
        -0.017559822648763657,
        0.034667499363422394,
        0.01495938841253519,
        0.020871024578809738,
        -0.0701063796877861,
        0.028505124151706696,
        -0.007292099762707949,
        -0.007582074496895075,
        -0.10522451251745224,
        -0.08013540506362915,
        -0.1017080619931221,
        0.0011304692598059773,
        0.035575974732637405,
        -0.01493945624679327,
        -0.022144339978694916,
        -0.008938306011259556,
        -0.03806683421134949,
        0.05517169460654259,
        -0.0398666150867939,
        0.05793151259422302,
        -0.009874898940324783,
        0.005745119880884886,
        0.052209194749593735,
        0.009023758582770824,
        -0.14043781161308289,
        0.027975110337138176,
        0.051048725843429565
    ]
}