{
    "id": "ecH3OU0R4ls",
    "title": "DVD-RAM: The Disc that Behaved like a Flash Drive",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2019-01-11T14:52:13Z",
    "video_url": "https://www.youtube.com/watch?v=ecH3OU0R4ls",
    "category": "Science & Technology",
    "tags": [
        "DVD-RAM",
        "DVD-R",
        "DVD+R",
        "DVD-RW",
        "DVD",
        "laserdisc",
        "CD",
        "optical media",
        "digital versatile disc",
        "PC",
        "windows",
        "optical disc",
        "optical drive",
        "floptical"
    ],
    "views": 1569084,
    "likes": 47516,
    "comments_count": 3026,
    "description": "You can support this channel on Patreon! Link below     DVD-R, DVD+R, DVD-RW, and DVD+RW aint got nothin on my man RAM. Oh yes, DVD-RAM, the format of mild obscurity which seems like it should have been friggin huge. Alas, it was but mildly useful.  Here are some links that you can click on and theyll take you places:  Technology Connections on Twitter:   The TC Subreddit (I promise I do go there sometimes)   The second channel video that I talked about   You can support this channel on Patreon! It has been amazing what Patreon has done for this channel, but also for me (your dorky host) personally. Through the support of people just like you, Technology Connections has become my job and I am so excited and thankful for it! If youd like to join the fine folks in a pledge to help the channel grow, please check out my Patreon page. Thank you for your consideration!    And thank you to the following patrons! Dane Peterson, Brent LaRowe, Kieran Cox, Hunter Schwisow, Logan Kriete, Rafa Wiosna, Adam D. Ruppe, Audin Malmin, Eric Hansen, Noah McCann, Jason R Scheuren, Rufo Sanchez, The War Academy, Yaniv, neko, Lee Wallbank, Grayson Lang, Neil Bronner, Carl Yazbek, Jeffrey Grajkowski, Christopher Splinter, Eric Merrill, Stefan Berndtsson, Seth Kneller, Clint Eisinger, Jesse G. Donat, Christopher Leidich, Mike Friedman, Svante, Andr Waage Srensen, Ed McCloskey, Jasper Thun, Camilo Rodrigues, Dusan Dzelebdzic, Sam Douglas, Sam Redfern, Sen, mark barratt, Tully, Violet Moon, Duncan Ward, Tobias Faller, Justin Smith, Corey A Hudson, EpicLPer, Luc Ritchie, Michael Dragone, Manfred Farris, Eric Romero, John Laur, Patric Bates, Sven Almgren, Lutz Broska, Jrgen Kieser, Nicholas, Ewen McNeill, thefanification, Nicolas, Albin Flyckt, Michael A Kalfas II, Michael Bernstein, Kevin Kostka, Shame Zamora, Brad Wilmot, John Bailey, Alex Ilyin, Miles H, Deovandski Skibinski Junior, Andrew \"FastLizard4\" Adams, Avi Drissman, Jens Bretschneider, Phil Taprogge, Sam, Rich Jeanes, Jonathan Skowronek, Tim Grov, Pieter van der Eems, Philip Kvist, Brian Condron, Peter Jerde, Torin Zaugg, James Watson, Vince Terranova, Jason Nevins, Andrew Montagne, David Scott, Mike Nichols, MrSonicOSG, Brandon Enright, James Fialho, Christian Torelli, Sunchild, Kim Rypstra, The Paul Allen, toasterking, Seth Robinson, Ralph, Pavel Soukharev, Forrest Miller, Patrick Quinn-Graham, Max Zelinski, Troy Kelly, Jason Brandy, Norman Tatlock, Jesper Jansen, Andrew Johnson, Goolashe, Rmy GRANDIN, ce keen, Jake Shep83, Nick Pollard, Drew Holm, David Grossman, Ben Auch, Jeff Puglisi, Andy S, Robert, Johan Greefkes, Jacob Dixon, Matt Luebbert, SonOfSofaman, Brent Higgins, Rob Kefford, Roger Baker, Alexander Schrder, Andreas Skagestad, Eric Butterfield, James Holmes, Tim Skloss, James-Ross Harrison, Sean OCallaghan, Lee Wallbank, Jonas, Colin Cogle, Kyle Matheis, Krzysztof Klimonda, Aaron Rennow, Gantradies, Ted Flores, Yota Ninja, Tee Jay, Jakob, Bee Jay (thats a fun coincidence, a Tee Jay and a Bee Jay), Francesco Lezi, Countzero, Ray Chang, Kodapan, L0j1k, Chris Connett, Guillaume Tremblay-Beaumont, Eduardo Kaftanski, Winfield Trail, Miles H, Eric Nelson, Sha Nasti, Charles Surett, Ed Green, Stephen B. Hinton, Daniel Bernard, thegeoffreak, annoying and reprehensible idiot, Piotor Kowalski, Bob Slovick, Aleksei Besogonov, Michael Sims, Recycled, Meetupvideo, Jason Burgett, Wayne Marsh  Dont see your name?  Dont worry!  To keep this little perk alive, the $5 patron shoutout is now on a rotating basis!  If youre not here, you should be here in one of the next two videos.  If youve slipped through the cracks, dont hesitate to send me a message via Patreon and Ill fix it!",
    "description_links": [
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://youtu.be/U9aZuFOTHtQ",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "In this video Im gonna ask that you step back in time to the days when optical media was still a thing everyone used. Pretend its 2005 or something. Great. Your Motorola Razr is the envy of the neighborhood, PT Cruisers are still on showroom floors, and your iPod--thats just the bees knees. So many songs in your pocket right now! And it even plays video! Ho boy is it a great time to be alive. But you know what kinda sucks? Even though youve got this awesome CD and DVD burner in your PC, its not exactly the most convenient thing to use. Every time you pop in a blank disc, Windows is all like What do you want to do with this disc? and now you have to make a decision. Curse these choices! I just want this to appear as a removable storage device like these new fangled thumb drive things. Or even my trusty floppy diskette! You can sort of use it like a flash drive, but its slow, requires formatting, and is just a bunch of poopy nonsense. But what if I were to tell you that there was a variant of DVD which actually was designed to function as removable storage? That my friends is DVD-RAM. RAM???? Thats right, DVD Random Access Memory. Just from a single glance of this disc, youll probably see theres something a little different about the format. Unlike your garden variety DVD-R, either dash or plus, this disc doesnt require special formatting, files can be added to it or erased from it on the fly, and aside from horridly slow read and write times compared to a contemporary drug store flash drive, it behaves exactly as if it were a 4.7 gigabyte USB storage device. Perhaps the weirdest thing about DVD-RAM is when it was released. Its way earlier than you might think. The first version of MacOS to support it natively was 8.6. 8.6! DVD-RAM was first standardized in 1996, pretty much at the dawn of DVD itself, and the first DVD-RAM discs and drives were available in 1998. So why the heck didnt it become, like, the gold standard of removable storage? 4.7 gigabytes of storage space in 1998 was akin to what many contemporary hard drives had on board. A rewritable disc, with completely random access, with that much storage capacity, seems like some sort of miracle product for 1998. And remember, this is DVD were talking about, so even 1X drives were way faster than a floppy disk, and slightly faster than an Iomega Zip drive (with dozens of times the storage space). Before we answer that question, lets look a little deeper into what makes DVD-RAM special, and why it has these little dashes all over it. DVD-RAM discs are structured as if they are a hard drive platter. Or a floppy disk. See, DVDs and CDs usually have their data written onto one continuous spiral of pits and lands. Think of it like a very long list of information, with little bits of code peppered in telling the drive where along the list its reading. This structure works great for things like audio and video data, but it begins to fall apart when you want to store many, smaller files. Every time you want to add files to a disc, a new session needs to be made with a new table of contents written after the end of the first. Its essentially like creating an entirely new list of information, and tacking it onto the old one. And each time you do it you have to also say where the older sessions are on the disc. And whenever you want to remove files, it becomes tricky to utilize that space again (assuming were talking about a rewritable format) without erasing the entire disc. Thats why Windows is asking you how you want to use the disc. If you choose like a flash drive it will format it as a multi-session disc, and it will do its best to present it to you as if it were a fully-featured removable drive. But DVD-RAM discs arent like that at all. Instead, the information on the disc is recorded in concentric rings. Like a hard disk or floppy disk, data is encoded on physical tracks and sectors. These little dashes are the boundaries between the hard sectors created at the time of the discs manufacture. These create a disc where each physical location has a defined value, and allows for formatting the disc with any file system you like. And thats why they appear to Windows as a removable storage device. Because they are! The operating system can natively write to and read from this disc (assuming it supports the file system) without any session writing nonsense. Windows XP natively supported FAT32 formatted discs, and starting with Windows Vista, UDF formatted discs were supported as well. MacOS could format them as HFS and HFS+, too. It really was an optical format that behaved as if it werent an optical format. DVD-RAM was very much the best of both worlds. And keeping with the best-of-both-worlds theme, DVD-RAM discs were made with incredibly stable phase-change alloys, meaning that the discs could withstand being re-written upwards of 100,000 times. Plus they were very stable in storage, with an estimated life of 30 years or more. And to allay concerns about disc damage, early versions were stored in caddies so the disc was never actually touched by grimy little hands. So then, why the fudge didnt DVD-RAM become THE storage format of the 2000s? If you guessed price, youre probably right. But not so fast, theres more to consider! First, lets acknowledge that this disc here is technically DVD-RAM Version 2. The earliest discs were only 2.58 gigabytes in capacity, however double-sided cartridges were common which could hold twice as much. Thats 5.16 gigabytes for those playing at home. And if you formatted these discs in the UDF format, they could be used as a single 5.16 gigabyte volume. DVD-RAM v2 bumped capacity up to the standard 4.7 gigabytes of a single-layer DVD, and of course double sided discs were still available which could hold twice as much. Thats 9.4 gigabytes for those playing at home. V2 also increased write speed to 2x. And this disc is actually DVD-RAM v2 revision 1, which supported write speeds of 3x. Fascinating. DVD-RAM discs did get faster, with revision 6 supporting 16x speed, but from what I can gather these discs are very rare, and along with a faster write speed came poorer longevity. These 2-3x discs arent that old, I think I bought them in 2010 or 2011, but that was by far the most common speed ever produced. Also, the cartridges were largely dropped in favor of some magical extra hard coating on the bottom of the discs, which to be honest seems to work pretty well considering Ive left this disc caseless in a junk box for who knows how long. But lets go back to 1998. What were prices like for DVD-RAM? Well, its not entirely clear, but according to the Handbook of Emerging Communications Technologies, Creative Labs had a DVD-RAM drive available for $500, and a single-sided 2.58 gigabyte disc would run you $30. A double sided disc went for $45. Other drives and discs varied in price, but lets stick with those price points for now. So, in January of 1999, Iomegas Zip drives cost just $100 for an internal drive, and the disks themselves were as cheap as $10 each. Assuming you bought 10 of them. Obviously the barrier to entry is much much lower, but how does this compare in cost per 100 megabytes? Lets do the math. A DVD-RAM drive with one double-sided cartridge would cost $545 and would net you 5.16 gigabytes of storage space. That works out to $10.56 per 100 megabytes. Now, a 100 megabyte Zip disk costs $10, so it looks to be barely more expensive than a Zip disk system, even accounting for the initial cost of the drive. If you include the cost of the Zip drive, that same amount of storage costs slightly more on Zip, with 52 disks plus a drive costing $11.90 per 100 megabytes. Of course, this assumes you actually need 52 zip disks worth of storage space, but lets suppose you do. As soon as you buy just one more DVD-RAM cartridge, the cost per 100 megabytes plummets to $5.71. A DVD-RAM drive did cost 5 times as much as a Zip drive, but the media cost per unit of data was less than a tenth that of Zip. 100 megabytes on Zip was $10. 100 megabytes of DVD-RAM works out to $0.87. One of the crazier things about this to me is that DVD-RAM was cheaper per gigabyte than a hard drive! It took until the end of 2000 for hard disk drives to drop below $9 per gigabyte, when DVD-RAM was available in 1998 at $8.70 per gigabyte. And of course, the cost of DVD-RAM media dropped, too. 2000 was the year that 4.7 gigabyte discs appeared, and the drives stayed at the $500 mark. The cost of these new discs in may of 2001 worked out to about $6.25 per gigabyte, and it was only then that hard drives began to dip below that price point. So then, and it seems like Im asking this question a lot, why didnt DVD-RAM become the new super floppy? It sure seems like it could have. A gigantic removable storage medium, almost as big as your entire hard drive, which works natively with your operating system with a true FAT32, HFS, or UDF file system, and was actually cheaper per gigabyte than virtually any hard drive for some years, seems like an absolutely tantalizing product. Why wasnt this, huge? Well, there appear to be three answers. Speed, compatibility, and simple confusion. Lets start with the first one. Although a 1x DVD drive reads data at a blazing fast 1.5 megabytes per second, that wasnt blazing fast for long. Sure, in 1998, it was amazing. Not as fast as your hard drive, but way way faster than a floppy, and a bit faster than a Zip disk. However, part of DVD-RAMs format specifications was data verification at the hardware level, which was great for data integrity, but effectively halved the write speed to 750 kilobytes per second because it double-checked everything it wrote. It does appear, though, that with newer media and by disabling the verification function, 4 megabyte per second write speeds were possible. Thats still not great, though, as a 32X compact disc burner can get to that speed. Another big hurdle with DVD-RAM was that virtually no DVD players knew what the heck to do with them. Much like CD-audio vs CD-ROM, DVD had this problem with distinguishing DVD-Video from DVD-Data applications. A lot of consumers just saw DVD and expected to be able to make DVD movies on any disc with this logo, but theyd find that DVD-RAM discs just wouldnt work with a DVD player. This wasnt necessarily a problem with the older cartridge-based discs because cartridges (and it should be noted that the early cartridge based DVD-RAM drives could generally read naked DVD-ROM and DVD-Video discs, too), but once the 4.7 gigabyte discs appeared without a cartridge, suddenly the potential for missed expectations comes into play. And this leads to the third problem: confusion. Although DVD-RAM was among the first writable standards created under the DVD umbrella, it shortly found itself competing with DVD-R, DVD+R, DVD-RW, and DVD+RW. Im not even going to get into the dash vs plus nonsense right now, but the significant thing here is that all of these formats were compatible with a standard DVD player, with some caveats. So even though they didnt work as well as a removable storage device on a PC, you would get just as much storage capacity for things like data backups, and you could make DVD movies with any of these disc formats to play on your TV. Another plus is that these formats quickly fell in price, with a DVD-R disc running for less than $10 in 2001. Adding to the woes of DVD-RAM, all of those formats quickly shot up in speed, with 12X and 16X write speeds becoming pretty normal for blank DVD media. With DVD-RAM limited to 3X on a good day, its native file system compatibility advantages came with a lot of speed downsides. And of course, theres a fourth problem I havent mentioned yet. Flash memory. While DVD-RAM and all its cousins were duking it out, flash media started to become a viable thing. Yeah, it took until around 2005 or 2006 for USB flash drives to even become available in sizes approaching that of DVDs, but it was way more convenient, and quickly became available in larger-than-DVD storage volumes, anyway. Plus it was generally faster than DVD-RAM, with 5 megabyte per second write speeds being common in 2004. So, DVD-RAM kinda just became an odd duck. If you wanted a storage volume that you could just throw a bunch of arbitrary small files onto, it probably didnt need to be nearly this big. A small flash drive was good enough. And before that, 100 megabyte Zip disks were still plenty useful. And if you needed to backup a large amount of data, a faster, cheaper DVD-R or RW would probably be fine. Really, CD-Rs were fine for most people. Somewhat ironically, where DVD-RAM came to flourish was in set-top DVD recorders. In fact, thats why I have these. Their nature as an agnostic storage volume with extremely versatile re-writability meant that they were excellent for recording TV. A DVD recorder with a DVD-RAM disc was essentially a DVR with removable storage volumes of 4.7 gigabytes. And since there was no need for speeds faster than 1x anyway, it was a perfect fit. So even though DVD-RAM never worked with DVD players, DVD-recorders liked them best. Kinda weird, but thats how it panned out. Of course this also kinda hurt DVD-RAM in the long run, because it likely stifled development of faster discs. Since their most prominent application didnt even need 2x discs, there was little incentive to market 4, 8, or 16 x media. Had 16X DVD-RAM become common, perhaps they would have become the new floppy. One area where I think DVD-RAM would have KILLED is in DVD camcorders. Remember those? Yeah, neither do I. I kid, but 8 cm DVD-RAM discs were available, and I think that in a camcorder they would have made a lot of sense. Seeing how much better the set-top DVD recorder experience was with DVD-RAM vs any other DVD format Id think it would be a perfect marriage for a camcorder. Easily delete individual clips. Import them into your computer natively. Etc, etc. And if they came with software for burning full-size DVD-Rs of your clips, you could just have a few DVD-RAM discs, and use them over and over and over again. Im pretty sure there are some DVD camcorders that work with DVD-RAM, but it doesnt appear to have been that common. Most DVD multi drives made from the mid 2000s onward can read and write to DVD-RAM discs, so although they are hard to find (especially these days) they are still at least marginally useful. If for nothing else, their incredible longevity may make them suitable for archiving data. But I really think its a shame that they didnt go very far. An optical disc that behaves like a hard drive seemed to me a sort of holy grail, and when I first learned about DVD-RAM, I was puzzled by its poor adoption. But having made this video, its not exactly surprising. Oh well, sometimes great ideas just dont get traction. Thanks for watching, and I hope you enjoyed this look into the life of DVD-RAM. These guys definitely fall into my thats a shame category of tech, but to be frank were well past optical media for everyday data storage anyway. When you can get a 4 terabyte portable hard drive for $100, buying 851 DVDs doesnt make a lotta sense. Ill be exploring some more details of the format, such as drive behavior when writing to a disc, and comparing large vs small file transfers in a video on my second channel, Technology Connections 2. Clever name, I know. You can check it out through the link in the description or through the card I hopefully remembered to add. As always, thank you to everyone who supports the channel through Patreon, especially the fine folks that are scrolling up your screen. With your generous support, Technology Connections has gone from side project to going concern, and Im ever so grateful for your pledges. If youd like to join these people in supporting the channel, check out the link below or you can hang around for the button on the endscreen. Thanks for your consideration, and Ill see you next time! terrifyingly smooth jazz DVD-RAM discs were made with incredibly stable phase-change alloys, meaning that the discs could be with [stares intensely with that face] And this disc is actually DVD-RAM v2 reversion 1. Reversion? Revision. If you choose like a flash drive it will format it as if it is a mul ple eh be de pe ditchi de. Eurrgh. Came with a gle be blertche buh.. Most D Most DV [laughs] Most D why am I laughing at the way Im saying most? A DVD-RAM drive with one double-sided cartridge would cost $545, and would net you five dollars five pffffff eugh.",
    "transcript_keywords": [
        "DVDRAM",
        "DVDRAM discs",
        "DVD",
        "disc",
        "discs",
        "drive",
        "DVDRAM drive",
        "storage",
        "Zip",
        "hard drive",
        "Zip drive",
        "hard",
        "drives",
        "removable storage",
        "gigabyte",
        "format",
        "cost",
        "data",
        "Zip disk",
        "flash drive"
    ],
    "transcript_entity_values": [
        "100 megabytes",
        "a good day",
        "dozens",
        "100 megabytes",
        "the 2000s",
        "8.70",
        "XP",
        "45",
        "32X",
        "4 megabyte",
        "5 megabyte",
        "2",
        "the end of the first",
        "1996",
        "30 years",
        "16x",
        "2006",
        "fourth",
        "DVD-RAM",
        "one",
        "Windows",
        "4.7 gigabytes",
        "5",
        "MacOS",
        "2-3x",
        "545",
        "may of 2001",
        "500",
        "100 megabyte",
        "the end of 2000",
        "just $100",
        "2004",
        "around 2005",
        "5.16 gigabytes",
        "8 cm",
        "4.7 gigabytes",
        "$500 mark",
        "5.71",
        "16X",
        "750 kilobytes",
        "100",
        "4 terabyte",
        "5.16 gigabyte",
        "HFS+",
        "52",
        "RAM",
        "about $6.25",
        "first",
        "4",
        "10.56",
        "Creative Labs",
        "2.58",
        "2000",
        "30",
        "these days",
        "9",
        "16",
        "some years",
        "1998",
        "1.5 megabytes",
        "Iomegas Zip",
        "three",
        "USB",
        "1x",
        "the year",
        "Windows Vista",
        "1",
        "100,000",
        "five dollars",
        "10",
        "less than $10",
        "3X",
        "iPod",
        "Iomega",
        "Patreon",
        "DVR",
        "DVD-RAM",
        "851",
        "Windows",
        "10",
        "2011",
        "January of 1999",
        "Ho",
        "2010",
        "less than a tenth",
        "third",
        "8",
        "2005",
        "only 2.58 gigabytes",
        "UDF",
        "2x",
        "6",
        "Technology Connections 2",
        "RW",
        "0.87",
        "9.4 gigabytes",
        "the mid 2000s",
        "5.16 gigabytes",
        "8.6",
        "Technology Connections",
        "4.7 gigabyte",
        "the Handbook of Emerging Communications Technologies",
        "4.7 gigabyte",
        "2001",
        "One",
        "First",
        "second",
        "3x",
        "11.90"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "MONEY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "MONEY",
        "QUANTITY",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "ORDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "MONEY"
    ],
    "vector": [
        -0.06720488518476486,
        -0.08188460767269135,
        0.0003824284649454057,
        -0.09576161950826645,
        0.036363814026117325,
        0.020126938819885254,
        0.01114722341299057,
        0.005377032794058323,
        0.015618128702044487,
        -0.03831631690263748,
        0.0038714504335075617,
        0.08234633505344391,
        -0.017274849116802216,
        0.002163404831662774,
        -0.007551352493464947,
        -0.026865888386964798,
        -0.012098295614123344,
        -0.09742370992898941,
        -0.04075929895043373,
        -0.027411818504333496,
        0.04023000970482826,
        -0.031570274382829666,
        0.0014694315614178777,
        -0.009292357601225376,
        -0.09023388475179672,
        -0.008741998113691807,
        -0.03269123658537865,
        0.00857868418097496,
        -0.0351201593875885,
        -0.08028515428304672,
        0.02340962365269661,
        0.09388420730829239,
        -0.009455445222556591,
        -0.01638338528573513,
        0.029437873512506485,
        -0.02346060983836651,
        -0.004004291258752346,
        -0.04508563131093979,
        -0.04447420686483383,
        0.04203663766384125,
        0.06092742830514908,
        -0.07476715743541718,
        0.03342774882912636,
        0.05446949973702431,
        -0.01932617835700512,
        0.029229216277599335,
        0.05524585396051407,
        -0.020948829129338264,
        0.016948256641626358,
        -0.057558052241802216,
        -0.03907960280776024,
        0.0077743916772305965,
        0.08347471058368683,
        0.030752135440707207,
        -0.007076214533299208,
        -0.026634490117430687,
        0.02202654629945755,
        0.018171172589063644,
        0.008592183701694012,
        -0.058242470026016235,
        0.07344362139701843,
        -0.04940018802881241,
        -0.06651805341243744,
        0.01866317354142666,
        -0.013286015950143337,
        -0.025290459394454956,
        0.05202028900384903,
        0.079047791659832,
        0.016886822879314423,
        -0.001764535903930664,
        -0.09709586948156357,
        0.047357961535453796,
        0.06471531838178635,
        0.0887015238404274,
        0.022758295759558678,
        -0.025191351771354675,
        0.01410468015819788,
        -0.05959519371390343,
        0.05616072192788124,
        -0.1002148762345314,
        0.03555816784501076,
        -0.030299780890345573,
        -0.05191262438893318,
        -0.06576313823461533,
        -0.04257228970527649,
        -0.01961407996714115,
        -0.0017604095628485084,
        0.0019913259893655777,
        0.02177242375910282,
        0.029614852741360664,
        -0.05915365368127823,
        0.0686318501830101,
        0.07540787011384964,
        -0.019030898809432983,
        -0.025861866772174835,
        0.014055764302611351,
        -0.00849989801645279,
        -0.1091051772236824,
        -0.10552936047315598,
        0.06287048012018204,
        0.0335313081741333,
        0.06639432162046432,
        -0.00448116660118103,
        -0.0829201191663742,
        -0.054045967757701874,
        -0.020598551258444786,
        -0.05457339808344841,
        0.15416239202022552,
        0.0457538366317749,
        0.012363636866211891,
        -0.05434001609683037,
        0.07709110528230667,
        -0.0314193069934845,
        -0.010800031013786793,
        -0.004843368194997311,
        0.04082871600985527,
        -0.040562134236097336,
        0.019923511892557144,
        0.03481929376721382,
        -0.08558513224124908,
        -0.006983058527112007,
        -0.02502448856830597,
        0.006324259098619223,
        -0.014685660600662231,
        0.061002060770988464,
        -0.08953775465488434,
        -0.002730797743424773,
        2.410523449751893e-33,
        0.021841509267687798,
        0.10094541311264038,
        -0.09756124764680862,
        -0.025920987129211426,
        0.015509451739490032,
        0.004330187104642391,
        -0.035197656601667404,
        0.057602208107709885,
        -0.12934118509292603,
        -0.01153959333896637,
        0.06575783342123032,
        -0.030751224607229233,
        -0.07178020477294922,
        -0.009167774580419064,
        0.004041454754769802,
        -0.04989836737513542,
        -0.12223097681999207,
        0.01752656139433384,
        -0.012669824063777924,
        -0.02288825437426567,
        0.018872106447815895,
        0.046451158821582794,
        0.00938800536096096,
        -0.014194624498486519,
        0.03530297055840492,
        -0.08239582180976868,
        -0.02438121847808361,
        -0.03344997391104698,
        0.09297142177820206,
        0.04325142502784729,
        -0.035712871700525284,
        0.028935248032212257,
        0.0017130033811554313,
        -0.06920570880174637,
        0.06397303193807602,
        -0.10279476642608643,
        -0.08254678547382355,
        -0.16950368881225586,
        0.0043106465600430965,
        -0.026291539892554283,
        0.0648004487156868,
        0.03112846240401268,
        -0.009253834374248981,
        0.021920442581176758,
        -0.06775166094303131,
        -0.010039330460131168,
        0.14569620788097382,
        0.00635558320209384,
        0.09542153775691986,
        0.03652200102806091,
        -0.03432625159621239,
        0.026985425502061844,
        -0.005493640899658203,
        -0.08339749276638031,
        0.013050585053861141,
        -0.02318274788558483,
        -0.012465309351682663,
        0.017451798543334007,
        0.06153374910354614,
        -0.07503800839185715,
        0.03977340832352638,
        -0.02686554566025734,
        0.0005402133101597428,
        -0.06549865752458572,
        -0.051966115832328796,
        -0.005510817281901836,
        0.054015059024095535,
        0.07823779433965683,
        -0.036804843693971634,
        0.016545815393328667,
        -0.02132425084710121,
        -0.03532428294420242,
        0.007555751129984856,
        -0.10034379363059998,
        -0.004801223985850811,
        0.05200668424367905,
        -0.0722436010837555,
        0.04178841412067413,
        -0.010067792609333992,
        -0.002319019054993987,
        -0.002074440475553274,
        -0.008493580855429173,
        -0.005439356900751591,
        0.045161597430706024,
        -0.0002764928503893316,
        0.053252000361680984,
        0.061443448066711426,
        -0.026289312168955803,
        0.0648154467344284,
        -0.014603902585804462,
        0.005536163225769997,
        -0.06383917480707169,
        0.017131894826889038,
        0.018300028517842293,
        0.026014788076281548,
        -3.362581671079803e-33,
        -0.014293408021330833,
        -0.010871799662709236,
        0.014334605075418949,
        -0.02157505974173546,
        0.005218916572630405,
        -0.08289620280265808,
        -0.022298108786344528,
        0.04917305335402489,
        0.02639167197048664,
        -0.08902230113744736,
        0.006032689940184355,
        0.030504174530506134,
        -0.08391735702753067,
        -0.08703219145536423,
        -0.053829483687877655,
        -0.08412822335958481,
        0.015606758184731007,
        -0.0031634287443012,
        0.04301505163311958,
        -0.027819661423563957,
        0.044936686754226685,
        0.04083549603819847,
        -0.03261559084057808,
        0.05172603577375412,
        0.038328856229782104,
        0.0504688061773777,
        0.05592167004942894,
        0.11972423642873764,
        0.029284603893756866,
        0.03354353830218315,
        0.049321044236421585,
        0.0003916463756468147,
        -0.03775139898061752,
        -0.0076691629365086555,
        -0.034826505929231644,
        0.026682352647185326,
        0.10177307575941086,
        0.009234919212758541,
        -0.10295566916465759,
        -0.060518890619277954,
        0.10450709611177444,
        0.044610679149627686,
        -0.07561547309160233,
        -0.09191074967384338,
        -0.024625251069664955,
        -0.04189537093043327,
        -0.02572534792125225,
        -0.04595360532402992,
        -0.015994494780898094,
        0.011162050068378448,
        0.031150592491030693,
        -0.0232844278216362,
        0.08530494570732117,
        -0.07370010763406754,
        0.017961783334612846,
        0.011594928801059723,
        0.018660807982087135,
        0.08761055022478104,
        0.07374819368124008,
        -0.04069020599126816,
        -0.06940935552120209,
        -0.0009573883144184947,
        -0.010154219344258308,
        -0.0031502426136285067,
        0.03341153636574745,
        -0.04417971149086952,
        0.08495181798934937,
        0.06726989150047302,
        -0.04639541730284691,
        0.05341041088104248,
        -0.0008078212267719209,
        0.004133670590817928,
        -0.003971395548433065,
        -0.033215150237083435,
        0.02947651781141758,
        0.02198372408747673,
        0.062085025012493134,
        -0.02824082225561142,
        -0.09662896394729614,
        0.06505577266216278,
        -0.053961992263793945,
        0.04883214458823204,
        0.02708330936729908,
        0.0505797378718853,
        0.09927285462617874,
        0.07075164467096329,
        0.01964360848069191,
        0.036469098180532455,
        -0.008193779736757278,
        0.020967382937669754,
        -0.02798096090555191,
        0.03776580095291138,
        0.02166575752198696,
        0.047401297837495804,
        0.06145522743463516,
        -4.8656861650897554e-08,
        -0.007235767785459757,
        0.03485473245382309,
        -0.026717690750956535,
        0.013836157508194447,
        0.03606399521231651,
        -0.11837947368621826,
        0.013210185803472996,
        0.0058089569211006165,
        -0.025219742208719254,
        -0.01427918765693903,
        0.07342450320720673,
        -0.023649919778108597,
        -0.024723203852772713,
        0.005772327072918415,
        0.0854334607720375,
        0.01901342160999775,
        -0.08030635118484497,
        0.018199654296040535,
        -0.05922464281320572,
        -0.0930284708738327,
        0.014775550924241543,
        -0.010349402204155922,
        0.12140431255102158,
        0.025234322994947433,
        0.0443514920771122,
        0.07030776143074036,
        0.043255649507045746,
        -0.012994730845093727,
        0.00728228222578764,
        -0.017933528870344162,
        -0.019154859706759453,
        -0.009613129310309887,
        -0.07364191114902496,
        -0.023559674620628357,
        0.03633177652955055,
        -0.04061531648039818,
        -0.04983656108379364,
        0.026146143674850464,
        0.0472281314432621,
        0.09188783168792725,
        0.03731757774949074,
        -0.018648885190486908,
        0.012905349023640156,
        0.07770927250385284,
        0.08887550234794617,
        0.06923098862171173,
        -0.07537589967250824,
        0.013376426883041859,
        0.030373428016901016,
        -0.06389646232128143,
        0.01143256202340126,
        -0.0077119069173932076,
        -0.022242214530706406,
        0.01916894130408764,
        0.04799462854862213,
        -0.03982970118522644,
        -0.0024531555827707052,
        0.05170561000704765,
        0.014068525284528732,
        0.054510679095983505,
        0.10873382538557053,
        -0.049581389874219894,
        -0.0303318053483963,
        0.011098996736109257
    ]
}