{
    "id": "ecvNsXGGq2M",
    "title": "Mac VS PC editing challenge BTS",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-12-24T20:00:21Z",
    "video_url": "https://www.youtube.com/watch?v=ecvNsXGGq2M",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "linus tech tips",
        "editing challenge",
        "Mac vs PC"
    ],
    "views": 472465,
    "likes": 15311,
    "comments_count": 701,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(gentle music) - Today is so exciting right now Linus' team is downstairs and we are gonna be doing a Mac versus PC editing challenge. So we're basically gonna be going up against each other and we're editing some of Austin Evans' footage. So they're gonna give us the footage, we have four hours, and I don't know what's gonna happen. But they basically have taken over my entire house. Come check it out and if you wanna see the full video I'll put a link in the description to Linus' video of this whole challenge. A lot of people here. - Are we gonna be able to hook up like a laptop device to hide that TV? - Yeah I don't even know if I recall the TV back there. (claps) - It's as good as it's gonna get What? I didn't know you were filming me. - Getting our extremely professional paper tape set up here. - Ooh I have access to all of Justine's videos. - Yeah but they're on the internet. - Yeah but I could like mess with them if I wanted to. - This is all held together by tape so hopefully it holds together. - [Taran] Hopefully there's not an earthquake. - Yeah. - That could happen, actually. - This is really gonna take the pressure off there's a giant scoreboard like-- - Well I feel like this is how I edit anyway 'cause I'm like if I'm posting this video in an hour, I have to be done a half hour before. - It kinda is. - Okay, let me see if I can remember how to do this. CD set, mode, mode, four, play, play. Yes! - This looks great. - You're a god. - Tech god! - Hey tech god, why won't this computer turn on? - Because I haven't touched it yet. It is blessed now, my son. - It's not the right way to do this but yeah. - Holy crap, that was really scary. My Final Cut just quit and said it couldn't open. I think it's 'cause I moved my motion template folder. - What are you doing? This was all working. Oh god, I see the (beep) talking has begun early. Oh look it's working now. - [Cameraman] Are you still having problems? You seem to have been having a lot of problems. This whole video is gonna be you having problems. - You know, I'm just making sure-- (claps) that the audio works on here. And OBS, it's like every time I open it there's some update where things move around and now I don't know how to get to the audio mixer. - Yeah OBS, it's tough I'll give him that. - Hey you know, in school, Justine in school we learned Final Cut Seven. - Really? - That's how I learned to edit. - You guys jaw later! These are great timers, these look like exactly like. - That's why I had to spend because-- - How much, spend, how much? - $180 each. - Whew! - [Taran] What? - I'm telling you man. They were the only ones that were large, every other model was like this big. - [Taran] I believe it. - [Linus] They look really good on camera. - It's really intense, honestly. - [Cameraman] Drama. It had to be this way. - She's ready to do the interview whenever you're ready. - Oh is she, okay let's do it. - [Cameraman] Yeah, I'll go with you. - No Copley hat, Matty, hat has been nixed. Aw, he's having butt problems. Matty, what is that? Is that something that you can play with? - [Linus] So how are you feeling? Are you into the competition? - I'm really excited, I mean I pretty much edit every single day so it's just another day. - Taran had some concerns about going up against you in that he thought that it was going to be a bloodbath. - [Justine] Oh bloodbath. - What do you have to say to that? - I mean I guess I've edited over a billion views on my YouTube channel using Final Cut so I think that I'm not really that worried about it. - Oh I love this. - How much time do we have? - We have four hours. - Oh four, that's plenty of time. Oh my goodness, I might have some extra time to eat snacks and go to the bathroom. - Cool. - All right, excellent. - Yeah, I feel great that was awesome. - Hmm. - [Cameraman] Oh they go the sim lens on here and everything. - [Justine] It looks really good. - [Cameraman] Why aren't they like professionals or something? - Honestly, you know what's really funny about that is that we shot one of our highest viewed ever videos on an iPhone and there is one comment out of, I should look it up 'cause it's worth having the exact number, 6.7 million views this video has. And it's got a lot of comments 'cause it was very, 26,000 comments. Out of 26,000 comments, one person was like hey this looks a little different was it shot on a phone? - This is too short of a chair for me, my legs. Hi dog. - I've edited like sitting in bathroom floors, parking garages. - You should bake it and you guys can have this banter in the next phase. - This is great. - We'll have this banter not when I'm editing 'cause it's a distraction, Justine. - [Justine] I love distractions. - Bye. - Bye. Matty this is what's gonna happen. So Taran is gonna be over here so he's gonna be editing over here trying to like, you know, do things so we're gonna bother him okay. So you're gonna try and distract him with your cuteness, okay? I'm used to editing with you on my lap so this is no problem for me. What do you want? You want your Matty replica? Matty replica sit. Aw, is that your friend? Are you biting your friends leg? Sit. Get it, get it, get him. - And you just go with (background noise drowns out sound). - I think it's unfair that he's editing this video. - [Cameraman] Don't worry-- - It's unfair. - Justine, you're distracting us from a thing that we're trying to figure out right now. - Oh somebody doesn't like distractions. This is what I like to edit with. I have my phone, I've got my yerba latte, I also like to have water. I have like two different chap sticks. And my dog. Go ahead, lie down. What a good boy. - Soft problems, can I revert? Preferences, okay. Uncheck, set activated recording. Edit preferences. Things are behind schedule as common with-- - It's okay I accounted for this. - Why don't you get outside, 'cause it's fine here. - Yeah, at least it's climate controlled in here I'm actually very comfortable. - Justine thank you so much for having air conditioning. - Your home is wonderful. - It's scorching it's like 32 degrees outside Celsius. - What's actually better for video editing Mac or PC? Which one will prevail? Only time will tell. To find out, we're gonna have both of you editing a real actual Austin Evans' video and then the final edit is going to be reviewed by our panel of celebrity judges. - Look at Matty. - [Linus] I got this. - Matty is so upset. What's going on? You're so upset, everybody's in your house. - My mommy doesn't talk loud like that. Oh yes she does. - Can we have this clock say zero? - Do you need a water, do you need some more snacks or anything? - I have all my snacks already, thank you. - Did you bring your own snacks? - Absolutely. - Well I brought some snacks-- - She's not gonna poison you. - I already have all my stuff here. I've got my dog's bed and my blankets, I don't like to be cold when I'm editing. I got my small mini version of my dog just in case. - A Turtle keyboard with-- - Just in case of what? - I don't know, I get like lonely. - Did you bring this box? - Yes I did. It was wooden before, at least I didn't bring the wooden one. - So do you want like maybe a, wait I can't help my opponent. - You can if you want. - Do I want what? - Nothing, you got your laptop with an extra screen as well and a keyboard, got your Stream Deck, totally necessary. And a mouse with a pad. You got a little rest. - Yes. - I mean, I was still used to editing on a MacBook, I mean I'm using a trackpad. It's like that's how I edit. - You can use a mouse. - You wanna have a look at her setup? - Oh yeah. - Come around this side. - So it's literally just the MacBook. - That's it, my trackpad. - So ladies and gentleman you're all set up? - I think I'm ready. - Green light, green light, all right. The last thing you need as you so helpfully pointed out is footage. So this for each of you is one, two tech-- yes you can have it. - Is somebody getting a little stressed over there already? - Is somebody (beep) talking instead of editing? - I don't swear so I don't know. - It's so funny 'cause when we edit this down, like it's gonna seem like really like intense and you know like a lot of stuff was happening but this is the true, you know, behind the scenes experience for a four hour challenge. - Got the load in, got some a-roll, this is definitely not how I normally lay things out which was something that I wasn't really thinking about. That has thrown me for a little loop. (intense upbeat music) - We're 80 minutes in and Justine has taken her first bathroom break. - Pee! - And Taran apparently needs a new chair. So I've only ever worked with Justine on camera, I've never seen her behind the scenes like this. She is intense. (intense upbeat music) - Oh I'm pretty sure-- - Oh my this is absolutely incredible! You could not have planned this. - I'm pretty sure, no, I could not have planned this. - Takes from 524, 23, 22, 21. - [?] 10, nine, eight, seven. - 18, 17, 16, 15, 14, 13, 12, 11, 10, nine, eight, seven, six, five, four, three, two, one. - Oh my god! You're a freaking maniac! - Did I make it? - I think that's too close to call it Taran copy your file over. - Wait he didn't copy the file! - No it's already on the thing. (laughs) - You exported it to the-- - Yeah. (laughs) - Update, we are done editing. This was honestly so incredibly stressful and I just had to sit here and watch this fricking clock just tick down. I also did not know that I had to have this completely done, exported, rendered, and onto a flash drive in that four hours. I had not idea so I'm still shaking. - [Cameraman] How do you feel about judging this contest? - I'm looking forward to judging this because I like to believe I'm fair but also harsh and critical in like a wise way. Like I'm like Master Splinter and Yoda combined but for like videos. That's what I like to think about myself, I don't know if it's true but you know that's the heir I'll be trying to give off in judgment here. - [Cameraman] So are you ready to judge this? - I mean I put the judge in judgemental so. (laughs) - [Cameraman] How about you? - My name means the judge literally and I judge all the time, I cannot help it. - This has been a really long drawn out process to find out who is the winner. Are they gonna critique us like right now? Are we gonna hear what they think? Is this now? - [Linus] It's now. - I'm not ready. It's one thing to just read it in YouTube comments but to be here in person and hear it. I can't be here. - So I don't wanna spoil anything but even the nicest people at that table straight brutal. - Really? - Yeah, well I said look you guy are brutal and the response was well we're here to criticize it right? - That's true. - Yeah, I guess so. - And they did know we only had four hours to do this right? - I don't think we ever actually mentioned that. - Oh really? Really? - [Taran] Dude, not cool. - My notes are not I lost the page that I wrote them on. (sighs) Breathe. (intense upbeat music) - We're not gonna tell you who won so I'm gonna put a link in the description so you guys can go and watch the full video. This was way more intense than I thought it was gonna be. - Yes, it was, it was exhausting. - I have to do this next to him too. - I know it's a problem. - She doesn't have any apple boxes. - I don't can you believe it? - She needs to get some. - I will. Okay. - Lttstore.com. (laughs) (tense upbeat music)",
    "transcript_keywords": [
        "Yeah",
        "editing",
        "video",
        "Justine",
        "Matty",
        "Linus' team",
        "edit",
        "Final Cut",
        "team is downstairs",
        "time",
        "Linus' video",
        "video editing Mac",
        "problems",
        "god",
        "Final",
        "Taran",
        "Linus'",
        "ready",
        "snacks",
        "things"
    ],
    "transcript_entity_values": [
        "zero",
        "Turtle",
        "every single day",
        "12",
        "nine",
        "Matty",
        "MacBook",
        "one",
        "17",
        "14",
        "four hour",
        "OBS",
        "Final Cut Seven",
        "an hour",
        "Taran",
        "Justine",
        "Stream Deck",
        "that four hours",
        "four hours",
        "a half hour",
        "iPhone",
        "Today",
        "Mac",
        "16",
        "three",
        "32 degrees",
        "Linus",
        "22",
        "13",
        "YouTube",
        "Yoda",
        "Austin Evans'",
        "four",
        "18",
        "My Final Cut",
        "Celsius",
        "23",
        "five",
        "26,000",
        "eight",
        "six",
        "two",
        "524",
        "seven",
        "10",
        "11",
        "10",
        "6.7 million",
        "Final Cut",
        "first",
        "180",
        "Splinter",
        "Mac",
        "15",
        "80 minutes",
        "21"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "FAC",
        "CARDINAL",
        "DATE",
        "DATE",
        "TIME",
        "ORG",
        "PRODUCT",
        "TIME",
        "PERSON",
        "PERSON",
        "PERSON",
        "TIME",
        "TIME",
        "TIME",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "TIME",
        "DATE"
    ],
    "vector": [
        -0.02029239386320114,
        -0.09196875989437103,
        -0.0017733320128172636,
        -0.10397674888372421,
        0.0621955431997776,
        0.03688022866845131,
        0.005949817132204771,
        0.027715278789401054,
        -0.019310273230075836,
        0.07154522091150284,
        0.015457063913345337,
        -0.042514555156230927,
        -0.017300328239798546,
        -0.017500795423984528,
        0.01342990342527628,
        0.056675028055906296,
        0.04355541616678238,
        -0.04367166757583618,
        0.01517679262906313,
        0.048048973083496094,
        -0.013214634731411934,
        -0.050156399607658386,
        0.02346169389784336,
        0.02498972788453102,
        -0.011264966800808907,
        0.10103396326303482,
        0.06145652383565903,
        0.03245352953672409,
        -0.06781233102083206,
        -0.016478100791573524,
        -0.05879497900605202,
        0.016524244099855423,
        0.11267030984163284,
        -0.011578469537198544,
        0.011417251080274582,
        -0.06978471577167511,
        0.06546039134263992,
        0.009561870247125626,
        -0.10056497156620026,
        -0.09211914986371994,
        -0.06874667853116989,
        -0.035709649324417114,
        0.019376279786229134,
        0.005123691167682409,
        -0.01968221738934517,
        -0.09277304261922836,
        0.0035065647680312395,
        -0.07387354969978333,
        0.07663533091545105,
        0.08067794889211655,
        -0.05226941034197807,
        -0.06178634613752365,
        -0.008129311725497246,
        0.04341529309749603,
        -0.08774102479219437,
        0.036684706807136536,
        -0.08501384407281876,
        -0.005367312114685774,
        0.09362571686506271,
        -0.0676075741648674,
        -0.002481127856299281,
        -0.043839167803525925,
        0.014594318345189095,
        0.06014425680041313,
        -0.05827933922410011,
        -0.061654239892959595,
        0.028543900698423386,
        0.015039064921438694,
        0.013627376407384872,
        -0.02095937542617321,
        -0.06329671293497086,
        0.004626717884093523,
        -0.03214452788233757,
        0.055291179567575455,
        -0.013970894739031792,
        0.01770538091659546,
        0.03486984968185425,
        -0.07574399560689926,
        -0.030398361384868622,
        0.03870286047458649,
        0.058815401047468185,
        -0.048088252544403076,
        -0.08871233463287354,
        -0.017735207453370094,
        0.020930496975779533,
        -0.01646721176803112,
        -0.02160680666565895,
        0.0212080255150795,
        -0.029583146795630455,
        0.0029941045213490725,
        -0.0811743512749672,
        0.019150853157043457,
        0.003822887083515525,
        -0.04541335627436638,
        -0.01669512502849102,
        -0.07370422780513763,
        0.01778392866253853,
        -0.0021647531539201736,
        -0.013446039520204067,
        0.07534907758235931,
        0.019082702696323395,
        -0.06356258690357208,
        -0.03615676239132881,
        -0.05832632631063461,
        -0.005244235508143902,
        -0.0970686748623848,
        -0.02283482626080513,
        -0.0010266955941915512,
        0.06308508664369583,
        0.003311281092464924,
        -0.005986108910292387,
        0.00030180165776982903,
        -0.07114772498607635,
        -0.04408429563045502,
        0.02735380083322525,
        0.11717333644628525,
        0.00787229835987091,
        0.05257466435432434,
        0.04073887690901756,
        -0.001994295744225383,
        -0.018921390175819397,
        -0.0771198645234108,
        -0.01384617667645216,
        0.06108688935637474,
        0.05049959942698479,
        0.004935462959110737,
        -0.06448982656002045,
        1.2794913645970923e-32,
        -0.014599314890801907,
        0.03131037577986717,
        0.005766317714005709,
        0.03231605887413025,
        0.014817789196968079,
        -0.07077962160110474,
        0.019774533808231354,
        0.10171756148338318,
        -0.03177864849567413,
        0.009297966957092285,
        0.020260555669665337,
        0.015445641241967678,
        -0.054788701236248016,
        0.04586033150553703,
        0.04160023108124733,
        -0.054797664284706116,
        -0.0224600937217474,
        -0.016727855429053307,
        -0.07108880579471588,
        0.027977067977190018,
        0.0016422005137428641,
        -0.0008209760417230427,
        0.04424389824271202,
        0.05905551835894585,
        0.07355742156505585,
        0.04456290975213051,
        0.06596418470144272,
        -0.005234712269157171,
        0.11859355866909027,
        -0.00757062342017889,
        -0.0623946450650692,
        -0.05028399080038071,
        -0.014542635530233383,
        -0.10492970049381256,
        -0.020301135256886482,
        -0.029592230916023254,
        -0.013479569926857948,
        -0.032275885343551636,
        -0.014194688759744167,
        -0.01315184123814106,
        -0.08754336833953857,
        0.015786387026309967,
        -0.04983316734433174,
        -0.10234357416629791,
        0.07874500006437302,
        0.004558054730296135,
        0.024907775223255157,
        0.08469586819410324,
        -0.0780659094452858,
        0.03142040967941284,
        0.004762187134474516,
        -0.013512440025806427,
        -0.016901571303606033,
        0.04160802438855171,
        -0.029376601800322533,
        -0.0626726746559143,
        0.006790751591324806,
        0.04493415355682373,
        0.014004865661263466,
        0.09170199930667877,
        0.06033054366707802,
        0.01240226998925209,
        0.01419215276837349,
        -0.00784396007657051,
        -0.042911726981401443,
        0.08944631367921829,
        0.11267542839050293,
        -0.032086800783872604,
        0.0009462657617405057,
        0.03914239630103111,
        -0.03471937030553818,
        -0.01135030947625637,
        0.04011949896812439,
        -0.017000816762447357,
        0.0676523819565773,
        0.010327795520424843,
        -0.12144587188959122,
        0.004023475106805563,
        -0.03625521808862686,
        0.019246403127908707,
        -0.11307055503129959,
        0.07386983931064606,
        -0.0048840902745723724,
        0.11209379881620407,
        -0.020444151014089584,
        0.003693358274176717,
        0.0234381090849638,
        -0.02181854285299778,
        -0.030189847573637962,
        0.009828245267271996,
        -0.01161885540932417,
        0.09899777919054031,
        -0.08897045254707336,
        -0.027892211452126503,
        -0.032283082604408264,
        -1.1689309046460743e-32,
        0.011976547539234161,
        0.00037792715011164546,
        -0.009013674221932888,
        0.009022311307489872,
        -0.001569679705426097,
        -0.04211123660206795,
        0.03413898125290871,
        0.032566942274570465,
        0.06580355763435364,
        -0.11809910088777542,
        0.058477528393268585,
        -0.08133690059185028,
        -0.11116985231637955,
        -0.02280823513865471,
        -0.04858385771512985,
        -0.049405328929424286,
        -0.09280403703451157,
        -0.0331156961619854,
        0.008062109351158142,
        -0.03387074917554855,
        0.08036581426858902,
        0.09088002145290375,
        0.1178913563489914,
        -0.0011107573518529534,
        0.0040823426097631454,
        -0.009370044805109501,
        0.022933440282940865,
        0.07510543614625931,
        0.06808056682348251,
        0.007279789075255394,
        -0.0671321451663971,
        0.020456917583942413,
        -0.010495973750948906,
        -0.037309758365154266,
        0.09063847362995148,
        0.06765669584274292,
        -0.0012723965337499976,
        0.024918843060731888,
        0.02281242236495018,
        0.012420126236975193,
        0.0465780608355999,
        0.008402654901146889,
        -0.02591528184711933,
        -0.023906948044896126,
        0.013160381466150284,
        -0.07335569709539413,
        -0.08074987679719925,
        0.049479544162750244,
        0.04978935047984123,
        -0.025311296805739403,
        -0.0500856377184391,
        -0.04539097845554352,
        -0.031751714646816254,
        -0.04191501438617706,
        0.0032315917778760195,
        -0.039885587990283966,
        -0.08843201398849487,
        -0.03643288090825081,
        0.08887084573507309,
        -0.02528182417154312,
        0.0020983945578336716,
        -0.03205891326069832,
        -0.031244764104485512,
        -0.06748086214065552,
        0.01669357530772686,
        0.00786260049790144,
        0.04094824939966202,
        0.016512984409928322,
        0.006256796419620514,
        0.04570077359676361,
        -0.022078724578022957,
        0.029941776767373085,
        0.06856075674295425,
        0.007949484512209892,
        0.06593748182058334,
        -0.021274028345942497,
        -0.03699379414319992,
        -0.018135102465748787,
        0.0789228230714798,
        -0.03536704182624817,
        -0.03619329631328583,
        0.045829810202121735,
        0.05643431842327118,
        0.07190155237913132,
        0.03090778738260269,
        0.14148887991905212,
        0.08486372977495193,
        -0.01568761095404625,
        -0.00777179142460227,
        0.04158797487616539,
        0.006113792769610882,
        0.0502665713429451,
        0.09566502273082733,
        0.0832342877984047,
        -0.1522282212972641,
        -6.316065537248505e-08,
        -0.008634527213871479,
        0.024906761944293976,
        -0.0492447204887867,
        0.0010887630051001906,
        0.009184049442410469,
        -0.033153582364320755,
        -0.035649724304676056,
        -0.003970570396631956,
        0.09421282261610031,
        0.0036388684529811144,
        0.08292727172374725,
        -0.011329242959618568,
        -0.03115379996597767,
        0.07350191473960876,
        -0.0397491492331028,
        0.03152364492416382,
        -0.061323292553424835,
        0.08670465648174286,
        -0.013661383651196957,
        -0.07942696660757065,
        -0.0036341005470603704,
        0.08321236819028854,
        -0.007412885781377554,
        0.0009129332611337304,
        0.03946128487586975,
        0.010475166141986847,
        -0.03077518194913864,
        0.007548547815531492,
        0.038682032376527786,
        0.01696310192346573,
        -0.07424195855855942,
        -0.0024388942401856184,
        -0.027994787320494652,
        0.055374160408973694,
        -0.007684171199798584,
        -0.08169381320476532,
        -0.06906403601169586,
        0.04231257364153862,
        0.014862868934869766,
        0.007793504744768143,
        -0.04951423034071922,
        -0.12459014356136322,
        -0.08374383300542831,
        -0.040446072816848755,
        -0.022338060662150383,
        -0.07938980311155319,
        0.007811580318957567,
        -0.04110785201191902,
        -0.06394004076719284,
        -0.04676549881696701,
        0.01847749948501587,
        0.02116147056221962,
        0.04680861532688141,
        -0.014489546418190002,
        0.06962656229734421,
        0.01030177716165781,
        0.07787314057350159,
        -0.012319877743721008,
        -0.017469841986894608,
        0.00023596126993652433,
        0.029138609766960144,
        0.002787252189591527,
        -0.03551209345459938,
        0.03563699498772621
    ]
}