{
    "id": "Ed4yThcSI88",
    "title": "Galaxy Fold Hands-On: The Folding Phone Is Back!",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-04-15T22:35:58Z",
    "video_url": "https://www.youtube.com/watch?v=Ed4yThcSI88",
    "category": "Science & Technology",
    "tags": [
        "samsung galaxy fold hands on",
        "samsung galaxy fold review",
        "galaxy fold review",
        "samsung fold",
        "foldable phone",
        "folding phone 2019",
        "folding phone review",
        "best folding phone",
        "best foldable phone",
        "mrmobile",
        "android central",
        "michael fisher"
    ],
    "views": 317561,
    "likes": 11816,
    "comments_count": 1068,
    "description": "There was a time when almost every phone was a folding phone, and you know what? I wish wed never left those days behind. A folding phone is petite when you pocket it, full-sized when you flip it out  and as a bonus, it protects those important interior bits when you close it back up. The trouble is, no ones been able to figure out how to give you the benefits of a big phone with the portability of a small one  until now. This is the Galaxy Fold from Samsung, and its about to flip the smartphone world inside-out.   [SPONSOR]  Sponsored by Qualcomm. To learn more about Snapdragon 855, visit:    [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S GALAXY FOLD HANDS-ON]  MrMobile's Samsung Galaxy Fold Hands-On was produced following two hours with a Samsung Galaxy Fold review device on loan from Samsung. The hands-on took place at a limited media briefing hosted by Samsung. The Galaxy Fold review devices featured in this video ar European models being tested in the USA, running pre-release software.    [LINKS]  Samsung Galaxy Fold Hands-On [Android Central]:   Foldable Phones Are The Future* [Vector]:    [MUSIC]  Triple Dose\" by Wolves, available at Premium Beat:   \"Tangerine Daydream\" by GG Riggs, available at Premium Beat:   \"Seeking Perfection\" by Vincent Tone, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #samsung #galaxyfold #samsunggalaxyfold #samsungfold #foldable #foldablephone #foldingphone",
    "description_links": [
        "https://www.qualcomm.com/products/snapdragon-855-mobile-platform",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.androidcentral.com/samsung-galaxy-fold-preview",
        "https://www.youtube.com/watch?v=WMBzeV2FtD0",
        "https://www.premiumbeat.com/royalty-free-tracks/triple-dose",
        "https://www.premiumbeat.com/royalty-free-tracks/tangerine-daydream",
        "https://www.premiumbeat.com/royalty-free-tracks/seeking-perfection",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- This video is sponsored by Qualcomm. My friends, back when I was slingin' phones at retail, almost every phone was a foldable, and you know what? I wish we'd never left them behind. A folding phone is just smart. It's petite when you pocket it, full-sized when you flip it out, and it protects its important bits when you close it back up. The trouble is, in the smartphone world, no one's been able to figure out how to give you the benefits of a big screen with the portability of a clamshell, until now. I've just spent two hours with the Galaxy Fold from Samsung and it's about to flip the smartphone world inside out. (upbeat music) You can probably hear it in my voice, getting to hold this phone was one of the most exciting moments of my career covering mobile tech, reminiscent of the thrill I got previewing the Huawei Mate X a couple months ago. But, as intoxicating as the Huawei phone was, it's Samsung's design that I think will ultimately win the coming foldable wars. That's because the Galaxy Fold in an innie instead of an outie. That means when closed, it protects its big display instead of exposing it to damage on the outside. That screen is one continuous, flexible OLED that dominates almost the entire interior surface with the exception of an offset notch in the upper right corner for the twin interior selfie cameras. Fold that big, flexible panel back over itself, and you'll find a much smaller touchscreen on the front outside cover. I've recently realized that versatility is one of the most important features to me in a phone and the most potent illustration of the Galaxy Fold's versatility is right here, that big 7.3 inch tablet on one side and the small 4.6 inch phone on the other, it's the same device. If you're sweating the big bezels on the smaller screen, I sympathize, it's kinda goofy looking, but as someone who's used a lot of clamshell phones back in the day, I gotta say that kinda misses the point. This screen is for the quick-hit tasks, when you've only got one hand free. You're not gonna spend a lot of time out here. When you have a second to sit down and unfold, you can take whatever you're doing up front and spread it out across that main canvas. In fact, there's so much screen area here, compared to a normal phone, that you can run three apps alongside one another, if you want to. Then, when you're done, you fold it back up and stick it in your pocket, like it's a much smaller phone because now it is. Samsung had to make sacrifices to fit everything into the Fold's form factor. The bezels I mentioned a moment ago, the thickness of the design when closed, the lack of a headphone jack or microSD card or waterproofing, all standard on recent Samsung flagships. But it's also noteworthy what Samsung didn't sacrifice. There are three main cameras on this phone, the same wide, ultra-wide, and telephoto array that I loved on the Galaxy S10+, that's in addition to those dual selfie shooters inside and a sixth camera for the cover, also for selfies. There's wireless charging on board, as well as reverse wireless charging to gas up your Galaxy Buds or Watch. And there's enough horse power under the hood to satisfy power users across everything, from phone mode to tablet mode, to yes, PC mode with Samsung DeX. I'm sure all three of you DeX users out there will appreciate that. Okay, so, ready to come back down to Earth? Yeah, the Galaxy Fold also costs a staggering amount of money, so let's take a step back and take stock of the shortcomings you'll have to live with if you smash the piggy bank. With a power pack barely bigger than what's in the Galaxy S10+ and a much larger display, battery life is a concern for me. You probably won't be able to charge it as quickly as you can some newer phones either, thanks to the older Quick Charge tech. The strange aspect ratio of the main screen isn't great for watching widescreen videos. Then, there's the mechanical reality of the display. Samsung rates it good for 200,000 open/closes, which it says should be good for five years of usage, but if you expect this to be the perfectly smooth glass of your current smartphone screen, think again. Just as I saw on the Huawei phone, there are imperfections and yeah, there's a crease here. And given the various foldable prototypes I've seen over the past few months, it seems clear those creases are something modern engineering just can't yet iron out. Most concerning of all is a kind of broader platform question, when was the last time you saw an Android tablet get rave reviews? They're almost universally regarded as not that great, and an Android tablet is kinda what you get when you open this thing. I mean, I'm gonna have to try hundreds of apps in my review to satisfy my concerns about scaling issues and compatibility with this screen shape and size. For most people, conventional smartphones will continue to be the more practical, less expensive choice for awhile yet. But I do think the Galaxy Fold is the future of smartphones, or at least the first example of what I think they'll become because look, it just makes so much more sense to have a phone that can be this or this on demand, instead of a phone that will always be this. Even more details in a moment, my friends, but first, price. The Galaxy Fold costs a Jackson short of $2000. It's on presale today for AT&T and T-Mobile with a shelf date of April 26th and a special offer of free Galaxy Buds and a free case. And well, I know I usually say that I can't wait to use a device in the real world, I have never meant it more than now. Please, subscribe theMrMobile on YouTube, so you don't miss my videos documenting life on foldable phones and stay tuned after the break for some off-the-cuff impressions that didn't make it into the script ahead of time. This video is sponsored by Qualcomm. The Qualcomm Snapdragon 855 mobile platform features a fourth generation AI engine with dedicated AI acceleration for echo cancellation and noise suppression. What's that mean? Well, it should make it much easier to talk to your smartphone's voice assistant, no matter what's going on around you. You'll also see accessories improve, wireless earbuds should work together better and last longer on a charge and you'll have less audio latency, so you can do things like play games or watch videos without a delay in your sound. As someone who's always wanted to edit videos without relying on a wired connection, I say bring it on. The absolute number one that everyone is gonna be asking about is the crease, of course. Yes, you can see it. Yes, you can feel it. As I said in the VO, it just seems like something we can't engineer out right now. As you're scrolling horizontally, say, yeah, you feel a little bit of a gutter there. Only time will tell whether that starts to annoy me or not. This caption just sorta runs off the edge of the screen here because in order to read that caption, it turns out we have to open the phone and then, once again, we have to go back down and find our spot. Now we understand what Dave was trying to say. Early software. See how that speaker is? Good call there, bud. (Star Trek episode playing on phone) Oh, man. We got audio here, we got audio here, nice. Alright P-Touch, you got a spoiler alert. Another thing that actually surprised me quite a bit was that the fingerprint sensor is integrated not into the power button, which is right up here on the side, but into the Bixby button, which is where your thumb rests. I don't have an objection to that, I'm going to ask why the power button is not the fingerprint sensor button. We've dealt with this before, we'll figure it out. You know what this reminds me of? The BL40 from LG mixed with the LG Envy. Both of those released before you were born, young man. (laughs) Haven't gotten enough? If you want another take on the Samsung Galaxy Fold, Android Central has a hands on going up alongside mine, so check it out at the link in the description and folks, I'm eager to talk about this phone. Hit me on Twitter, Instagram, Facebook, anywhere you can find theMrMobile handle and hit me with the questions I didn't get to in this hands on. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "Galaxy Fold",
        "Samsung Galaxy Fold",
        "Galaxy",
        "phone",
        "Fold",
        "Galaxy Fold versatility",
        "Samsung",
        "Galaxy Fold costs",
        "Huawei phone",
        "screen",
        "Galaxy Buds",
        "back",
        "Samsung Galaxy",
        "phones",
        "free Galaxy Buds",
        "clamshell phones back",
        "big",
        "Huawei",
        "phones back",
        "time"
    ],
    "transcript_entity_values": [
        "Huawei",
        "Dave",
        "the Galaxy Fold",
        "200,000",
        "Instagram",
        "Galaxy Fold",
        "the Galaxy Fold's",
        "Twitter",
        "Galaxy Buds or Watch",
        "Qualcomm",
        "sixth",
        "Samsung",
        "T-Mobile",
        "Galaxy Buds",
        "microSD",
        "AT&T",
        "the Galaxy S10+",
        "4.6 inch",
        "855",
        "YouTube",
        "Facebook",
        "a couple months ago",
        "hundreds",
        "2000",
        "April 26th",
        "Android Central",
        "DeX",
        "BL40",
        "today",
        "first",
        "Fold",
        "jack",
        "Star Trek",
        "the day",
        "Earth",
        "7.3 inch",
        "the Galaxy Fold",
        "Bixby",
        "five years",
        "second",
        "the past few months",
        "Huawei Mate X",
        "Jackson",
        "fourth",
        "LG",
        "two hours",
        "VO",
        "three",
        "one",
        "Android"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "FAC",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "LOC",
        "QUANTITY",
        "ORG",
        "PERSON",
        "DATE",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "GPE",
        "ORDINAL",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.18262727558612823,
        0.04748784750699997,
        0.04699774086475372,
        -0.0101348627358675,
        -0.008241276256740093,
        -0.04531387612223625,
        -0.003499964950606227,
        0.11943389475345612,
        0.0056764199398458,
        0.013790183700621128,
        0.07007439434528351,
        0.06608887761831284,
        0.00019931612769141793,
        0.017937466502189636,
        0.03839438781142235,
        -1.0408383559479262e-06,
        -0.03817535191774368,
        -0.0646325945854187,
        -0.07656776160001755,
        0.09307338297367096,
        0.09415590763092041,
        -0.053306616842746735,
        0.003995600156486034,
        -0.06096576899290085,
        0.04398654028773308,
        -0.01938585191965103,
        -0.02443581074476242,
        -0.0364302322268486,
        0.037877533584833145,
        -0.02116195298731327,
        0.027330346405506134,
        0.16676178574562073,
        -0.010504632256925106,
        0.013584521599113941,
        -0.054903410375118256,
        -0.07069888710975647,
        -0.002411634661257267,
        0.015946559607982635,
        -0.026089726015925407,
        -0.024677108973264694,
        -0.032622355967760086,
        -0.012622859328985214,
        0.03798579424619675,
        -0.0002391590242041275,
        0.018584223464131355,
        -0.03387711942195892,
        0.02341911382973194,
        0.025837492197752,
        -0.021569814532995224,
        -0.023657605051994324,
        0.03198157995939255,
        0.017453588545322418,
        0.0034808050841093063,
        0.04033280536532402,
        -0.08601222932338715,
        -0.0018115733982995152,
        -0.0072426870465278625,
        -0.0037598717026412487,
        0.0043866573832929134,
        0.06876730918884277,
        0.09897202998399734,
        -0.010047591291368008,
        -0.062345586717128754,
        0.02884303405880928,
        -0.017826568335294724,
        0.05032484233379364,
        0.012917323969304562,
        -0.09496460109949112,
        -0.003247978165745735,
        -0.04099218547344208,
        -0.019815001636743546,
        -0.04310722276568413,
        0.012819897383451462,
        0.040695708245038986,
        0.05439242348074913,
        -0.008130943402647972,
        0.07568109035491943,
        -0.043501898646354675,
        -0.0577392652630806,
        0.04379511997103691,
        -0.00485589262098074,
        -0.003158645238727331,
        -0.04789545014500618,
        0.03083365596830845,
        -0.010276609100401402,
        -0.021788405254483223,
        -0.0033773244358599186,
        0.07680610567331314,
        -0.0742330551147461,
        -0.06599965691566467,
        0.0021690514404326677,
        0.07208556681871414,
        -0.055460840463638306,
        -0.010784987360239029,
        -0.07007218152284622,
        -0.038760460913181305,
        -0.0607575848698616,
        -0.0007583597325719893,
        -0.04854171350598335,
        -0.004445286467671394,
        0.05026929825544357,
        0.06319382786750793,
        0.0992966815829277,
        0.028506018221378326,
        0.007659096736460924,
        -0.06427109986543655,
        0.016285518184304237,
        -0.07394915074110031,
        -0.03286213427782059,
        0.008717454969882965,
        -0.010923427529633045,
        0.015107073821127415,
        -0.0011786582181230187,
        -0.00437523378059268,
        -0.08081284165382385,
        -0.005169027950614691,
        -0.016046062111854553,
        0.05055928975343704,
        0.08185844123363495,
        0.058671899139881134,
        -0.06946267932653427,
        0.047494541853666306,
        -0.03807203099131584,
        -0.14804750680923462,
        0.021878432482481003,
        0.042297955602407455,
        -0.055003054440021515,
        3.911908180976305e-33,
        -0.009963514283299446,
        0.07527568191289902,
        -0.02311360090970993,
        0.049925796687603,
        0.020389491692185402,
        -0.013040524907410145,
        -0.07042669504880905,
        -0.045099496841430664,
        -0.037501703947782516,
        0.08870532363653183,
        0.035929419100284576,
        0.02014237456023693,
        0.0038427698891609907,
        0.008636855520308018,
        0.06162716820836067,
        -0.08230862021446228,
        -0.01544845663011074,
        -0.02199045941233635,
        -0.05840940773487091,
        -0.004958022851496935,
        -0.0021648318506777287,
        -0.036089133471250534,
        0.07276063412427902,
        0.01256305817514658,
        0.05377126485109329,
        0.025129711255431175,
        0.05622662231326103,
        -0.01842428743839264,
        0.08478601276874542,
        0.022836735472083092,
        -0.10616688430309296,
        0.006824669428169727,
        -0.01285899430513382,
        -0.04109594598412514,
        -0.014878486283123493,
        0.07325942069292068,
        -0.03894239291548729,
        -0.07204826921224594,
        0.01697671413421631,
        -0.00517538795247674,
        -0.044549018144607544,
        0.006630095187574625,
        -0.047819893807172775,
        -0.0015818666433915496,
        -0.0025629845913499594,
        -0.07685547322034836,
        0.0481240376830101,
        0.04002009332180023,
        -0.05874028429389,
        -0.01935075968503952,
        0.01999007910490036,
        -0.04408951476216316,
        -0.023503456264734268,
        -0.03539789095520973,
        -0.0458853654563427,
        -0.007149362470954657,
        0.037340160459280014,
        -0.06041443720459938,
        -0.002567209070548415,
        0.08371088653802872,
        -0.02499105967581272,
        0.05046546459197998,
        -0.06814492493867874,
        0.040161218494176865,
        -0.048643797636032104,
        0.06032399460673332,
        0.027067802846431732,
        -0.032072439789772034,
        -0.017164675518870354,
        0.035232383757829666,
        -0.012720167636871338,
        -4.3496544094523415e-05,
        -0.02591545321047306,
        0.0009134708670899272,
        0.03305673599243164,
        0.026684856042265892,
        0.04693695902824402,
        0.011637854389846325,
        -0.004049436189234257,
        -0.004671111237257719,
        0.026935230940580368,
        -0.04517630487680435,
        0.0873539000749588,
        -0.032728154212236404,
        0.00036744712269864976,
        -0.06959139555692673,
        -0.05819837003946304,
        -0.09958504885435104,
        -0.03611930087208748,
        0.006859234068542719,
        -0.08976007252931595,
        -0.005459303501993418,
        0.06883469969034195,
        -0.015039341524243355,
        0.005759276449680328,
        -3.515801849579719e-33,
        -0.0496586337685585,
        -0.06127176061272621,
        0.007905450649559498,
        -0.028627099469304085,
        0.015583360567688942,
        -0.028065547347068787,
        0.03961033374071121,
        0.04499487206339836,
        -0.11537324637174606,
        -0.06660403311252594,
        -0.04191628843545914,
        0.049858711659908295,
        0.0863477885723114,
        -0.010201141238212585,
        0.0008977792458608747,
        0.0017089846078306437,
        0.04577050358057022,
        -0.054975710809230804,
        -0.01808270439505577,
        0.06707527488470078,
        0.045245859771966934,
        0.010159634985029697,
        0.02608967199921608,
        0.1008930429816246,
        -0.02904181368649006,
        0.011918306350708008,
        0.010838320478796959,
        -0.01047798153012991,
        0.11044637858867645,
        -0.015729622915387154,
        -0.0023667882196605206,
        -0.10697486996650696,
        0.030165404081344604,
        0.05883382260799408,
        0.015349384397268295,
        -0.019108304753899574,
        -0.03839721158146858,
        -0.002549102297052741,
        0.10651492327451706,
        -0.04001663252711296,
        -0.012694427743554115,
        0.03991454094648361,
        0.020767997950315475,
        -0.018210725858807564,
        0.01099869329482317,
        -0.04535257816314697,
        -0.05114681273698807,
        0.03518599644303322,
        -0.09270339459180832,
        -0.06264683604240417,
        -0.014423574320971966,
        0.021052313968539238,
        0.009744638577103615,
        -0.01665981113910675,
        -0.0346471332013607,
        0.054904695600271225,
        0.04213469848036766,
        -0.053856197744607925,
        0.06605744361877441,
        0.013640383258461952,
        0.0860767662525177,
        -0.0023522241972386837,
        -0.010623193345963955,
        -0.05004805326461792,
        -0.00692415377125144,
        0.04231589660048485,
        0.10388872772455215,
        -0.01823223941028118,
        -0.042529020458459854,
        -0.014232723973691463,
        0.006141295190900564,
        -0.012763132341206074,
        0.04767119884490967,
        -0.10350769013166428,
        0.05628350004553795,
        0.14449769258499146,
        -0.05502361059188843,
        -0.06101640686392784,
        0.014539404772222042,
        -0.0658772811293602,
        0.04488971084356308,
        -0.07412996143102646,
        0.016325194388628006,
        0.02949657291173935,
        0.017371730878949165,
        -0.004709227941930294,
        -0.017020300030708313,
        0.050082728266716,
        0.020764093846082687,
        0.0841929093003273,
        -0.07874327898025513,
        0.032449789345264435,
        -0.018889598548412323,
        0.11122146248817444,
        0.05273249372839928,
        -5.075960274325553e-08,
        0.06851126998662949,
        0.042535725980997086,
        0.09157095104455948,
        -0.012408026494085789,
        -0.04426667094230652,
        -0.019044050946831703,
        0.048283059149980545,
        -0.07696959376335144,
        0.06430834531784058,
        -0.00555308535695076,
        -0.0595192052423954,
        -0.07712195813655853,
        -0.08101413398981094,
        0.06537735462188721,
        0.04161198064684868,
        0.03071518987417221,
        0.010894270613789558,
        0.08880287408828735,
        -0.006561479065567255,
        0.0870855450630188,
        0.02464424818754196,
        -0.022915121167898178,
        0.06537632644176483,
        0.008836819790303707,
        0.07652834057807922,
        -0.03458956256508827,
        -0.11822362244129181,
        0.04050121456384659,
        0.024609437212347984,
        -0.06477979570627213,
        -0.00839353445917368,
        0.027216516435146332,
        -0.012727843597531319,
        0.016858495771884918,
        -0.0791720300912857,
        -0.027046723291277885,
        0.0269022099673748,
        -0.025791559368371964,
        0.1104910671710968,
        0.04140017181634903,
        0.10601194202899933,
        -0.045576367527246475,
        -0.07268640398979187,
        0.054397910833358765,
        -0.058536794036626816,
        -0.0587894581258297,
        0.06242896988987923,
        -0.055001020431518555,
        -0.03877733647823334,
        0.09637642651796341,
        -0.03704134374856949,
        -0.08158648759126663,
        -0.02547406405210495,
        0.0056396727450191975,
        0.02510097250342369,
        0.05823485180735588,
        0.03610014170408249,
        0.02721046470105648,
        0.0378853976726532,
        0.02414984069764614,
        -0.03245524317026138,
        -0.051066361367702484,
        -0.0695134624838829,
        0.10063879191875458
    ]
}