{
    "id": "EeGjmTx2diM",
    "title": "Linux for Hackers Python pip, Git, Apt NEW Tools Install with OTW! (Episode 4)",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2023-11-12T14:30:06Z",
    "video_url": "https://www.youtube.com/watch?v=EeGjmTx2diM",
    "category": "Science & Technology",
    "tags": [
        "linux",
        "kali linux",
        "ubuntu",
        "apt",
        "apt-get",
        "apt install",
        "gem",
        "ruby",
        "git",
        "github",
        "git clone",
        "kali",
        "parrot os",
        "ethical hacking",
        "linux for hackers",
        "ethical hacker",
        "information security",
        "linux for hacking",
        "how to hack",
        "linux tutorial",
        "intro to linux",
        "linux introduction",
        "kali linux tutorial",
        "mr. robot",
        "hacking tools",
        "hack the box",
        "linux foundations",
        "linux course",
        "linux beginner",
        "linux hacking course",
        "hacker (interest)",
        "hacking linux",
        "kali linux android",
        "kali linux install",
        "less",
        "python"
    ],
    "views": 90076,
    "likes": 2695,
    "comments_count": 140,
    "description": "You need to learn Linux. I've said this for a very long time. Occupy The Web says the same thing - if you want to learn hacking, you need to lean Linux. This is a fundamental skill.   This is episode 4 of the series.  Episode 1:  Episode 2:  Episode 3:   // Occupy The Web Books // Linux Basics for Hackers:  Getting Started Becoming a Master Hacker:  Network Basics for hackers:  Top Hacking Books you need to read:   // OTW Discount // Use the code BOMBAL to get a 20% discount off anything from OTW's website:   Direct links to courses: Pro Subscriber:   // Occupy The Web SOCIAL // Twitter:   // Mr Robot Playlist //   // David's SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    // MY STUFF //   // SPONSORS // Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  // MENU // 00:00 - Coming up 00:19 - Intro 02:03 - Chapter 4 Adding and removing software 02:56 - Package Manager 03:33 - Red hat 04:35 - Downloading repository 05:48 - Installing snort 06:43 - Adding other repositories 08:29 - What happens when adding repositories 09:32 - Risk of putting any repositories 10:37 - Installing bluez 11:43 - Removing software 12:11 - Removing all traces of software  12:30 - How to update your packages 14:00 - VM WARE is little better than Virtual box 14:50 - A Gui based package to download new software 15:27 - Synaptic package manager 17:39 - Learning CLI 19:14 - Other ways to get software  20:54 - A python package manager  22:31 - Shodan searches  24:43 - Other tools not installed by default  25:55 - More tutorials in future 26:23 - Where to reach out to learn more 27:26 - Outro  // Detailed outline of topics // 00:00:00: Introduction to Cybersecurity and Hacking 00:00:04: Discussing New Tools and Repositories 00:00:31: Overview of Linux Basics for Hackers Book 00:00:39: Adding and Removing Software 00:02:50: Introduction to Package Managers in Linux 00:03:27: Understanding Debian, Ubuntu, and Kali Package Managers 00:04:29: Exploring Software Packages and Installation with apt 00:05:47: Installing and Managing Software like Snort 00:06:38: Adding Repositories and Managing Dependencies 00:07:05: Using Kali Repositories for Specific Tools 00:07:13: Accessing Administration Tools in Different Repositories 00:07:24: Editing Repository Configuration Files 00:07:55: Adding Debian, Kali, and Parrot Repositories 00:08:20: Repository Priority and Search Order 00:10:33: Installing and Managing Bluetooth Management Software (BlueEZ) 00:11:47: Removing and Purging Software Packages 00:12:32: Updating Package Lists with apt 00:13:43: Upgrading Packages and Managing System Space 00:13:56: Comparison Between VMware and VirtualBox 00:14:48: Introduction to GUI-Based Package Management (Synaptic) 00:15:01: Installing Synaptic for GUI-Based Software Installation 00:15:27: Demonstrating Synaptic Package Manager 00:15:45: Using Synaptic to Search and Install Bluetooth Packages 00:15:58: Exploring MySQL Packages in Synaptic 00:16:14: Discussion on MySQL and MariaDB 00:16:54: Using Synaptic for Selecting and Installing Software 00:17:49: Everyone starts from zero in Cybersecurity 00:19:28: Downloading Software from GitHub with Git Clone 00:19:53: Using GitHub to Access Bluetooth Hacking Tools 00:20:42: Explaining the Use of Perl Scripts in Bluetooth Hacking 00:20:55: Introducing PIP, the Python Package Manager 00:21:31: Installing Python 3 Package Manager with PIP 3 00:21:57: Using PIP 3 to Install Shodan for Command Line Operations 00:22:34: Demonstrating Shodan Command Line Interface 00:24:18: Exploring Shodan Search Commands for Specific Countries 00:24:51: Introduction to Ruby's Package Manager, Gem 00:25:13: Installing Tools with Gem 00:25:39: Overview of Different Software Installation Methods in Kali 00:25:59: Encouraging New Learners in Cybersecurity  linux kali linux ubuntu parrot os otw occupy the web internet of things hack hacking hacker cybersecurity  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   Disclaimer: This video is for educational purposes only.   #linux #kalilinux #ubuntu",
    "description_links": [
        "https://youtu.be/YJUVNlmIO6E",
        "https://youtu.be/8z-s5KQ9DbI",
        "https://youtu.be/t96iOUxC27M",
        "https://amzn.to/3JlAQXe",
        "https://amzn.to/3qCQbvh",
        "https://amzn.to/3W1iiCQ",
        "https://youtu.be/trPJaCGBbKU",
        "https://davidbombal.wiki/otw",
        "https://davidbombal.wiki/otwprosub",
        "https://twitter.com/three_cube",
        "https://www.youtube.com/playlist?list=PLhfrWIlLOoKNYR8uvEXSAzDfKGAPIDB8q",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "But invariably you know as you know a hacker cyber security expert there's going to be something new in the world that you're going to want right? But you'd only put in like well-known repositories right? I've got this new repository of all the best hacking software. VMware does a lot of things a little bit better than virtual box. Everyone it's David Bombal back with Occupy The Web. If you don't know who he is and you should know by now he's the author of this book Linux Basics for Hackers. We are continuing our series and if you haven't watched the previous videos then have a look at them below. Today we are doing chapter 4, covering chapter four, Adding and Removing Software, Occupy The Web welcome. Thanks David it's always an honor to be back on the best IT and cyber security channel on YouTube I appreciate that and you know you're a big reason or big contributor to the channel so thanks so much for sharing your knowledge. Just for once again people who haven't seen Occupy The Web's uh videos with me in the past he's also the the author of this book Network Basics for Hackers and Getting Started Becoming a Master Hacker and I always mention this because networking is very close to my heart, I love the way Occupy The Web that you approach all of these topics Linux, Networking whatever it is Android, Hacking, etc but from a hacker's mindset so really looking forward to the video today. Thanks you know it's one of the things that I always say is that if you want to be a hacker you need to have at least some fundamental understanding of Linux which is what we're doing and of that networking and that's why I wrote those two books. Both of those books are written to give the reader a foundation that they can build upon to become a hacker this the neither book is complete in terms of all Linux or all networking but the idea is to give the reader enough Foundation that they can build upon and how they can use their knowledge in the cyber security hacking world so today what we want to do is we want to look at Chapter 4 Linux Basics for Hackers and in this book we try to lay out some of the simple ways that um the user can be able to add new software you know Kali and Parrot you know both of them are really good Operating Systems they have lots of tools built into them but invariably you know as you know a hacker cyber security expert there's going to be something new in the world that you're going to want right they can't put all the tools into Kali there's a lot of them there's hundreds of tools in both of them but you're eventually going to come across the time oh there's a new tool out or a tool that's not included that I need for whatever I'm doing at this particular time so what we're going to talk about is how we can do that now the reader may or may not know but each of the distributions of Linux have their own what's called package manager. A package manager is simply a way to put software in a form that when you download it it's ready to run that means it has all the things that you need we call them dependencies all right and it's already built for your Operating System because each one of the Operating Systems are slightly different so in the case of Kali Kali's built on Debian so we use the Debian package manager which is called APT. Occupy The Web the question that often arise is so Debian is sort of one distribution what about like Red Hat?Many of the different distributions of Linux use different package managers in the case of Red Hat which is one of the most widely used Linux distributions for Linux Administration for Server Administration they they use both YUM and RPM. So what we're doing here is not really applicable to Red Hat but it is certainly applicable to all the Debian distributions like Ubuntu. Okay Ubuntu is built upon Debian, Kali is built upon Debian, Parrot is built upon Debian so that's kind of an important note because the packages that are in the repositories for those Debian Debian like distributions will generally work in and that's going to be an important point that I want to raise later on when we start talking about uh how to go ahead and get your software so each one of these distributions has their own repository, repositories where they store all the software and so you can go ahead and simply download the packages from the repository by simply using let's go sudo okay apt okay and it used to be apt get so you'll see in my book that I used apt get because that was commonly used you know before last few years things have changed a little bit but apt get still works like this with a hyphen between them it still works either one of them is going to work so it's going to be apt and then say we want to go ahead and look for a particular piece of software all right so we go search we can sudo apt search and then look for a particular keyword like go say Bluetooth all right and then it's going to ask me for my password and it'll show me all of the packages all right that have something to do with Bluetooth and you can see bluez right here is an important package for being able to manage Bluetooth allows you to do Bluetooth Recon what have you so if I wanted to go ahead and say install snort in the book I installed snort or actually it was used to be built in by default into Kali if I wanted to install snort I think we did this in an earlier video right I could go sudo apt okay install and then whatever the name of the package is okay say snort now if I do that so it goes ahead and comes back and tells me snort is already the newest version it comes back and tells me there's some other issues but those really don't apply to this right here so make sure that you know you see it's already installed the newest version. Now when you all people out there watching this video try to do this you're probably going to get an air that says snort is not available right and so earlier I think it was on maybe two in chapter two we uh we talked about ways that we can go ahead and add other repositories to the Kali repository because remember that if it's not in the Kali repository in this case snort is no longer in a Kali repository it might be in somebody else's repository like the Debian repository or the Ubuntu repository so often times what what I'll do is I'll just put those repositories on my list of repositories to check because the Kali repositories are defined for hacking tools and cyber security but sometimes I just want an Administration tool and that might very well be in Ubuntu or the Debian repository I showed you this earlier but I'll show it to you again. All right so we can go mousepad all right and then I can go to the /etc remember that configuration files are an /etc okay then apt okay this is the tool that we're using apt and then go sources list right in this file is where all of the uh repositories are listed let's go ahead and open that up all right and you can see that in my case here I've added I actually commented it out let take the comment out here's the Debian repository right and here here's the Kali repos oh here's the Kali repository right here right I've put in the Debian repository and I also have in they've all been commented out but the Parrot repositories as well and often times I'll put in the Ubuntu repositories too. So what this does is that when you try to to install a package it'll go first to the very first repository this one right here the Kali if it finds it it'll go get it if it doesn't find it it'll go to the next store then it'll go look in this case look in the Debian repository if it doesn't find it there then it'll go to the parent repository and then you know you can have a whole list and keep going through until it finds whatever you're looking for so this is one of those things that I think you newcomers to Linux should be familiar with because not all the tools that you want are necessarily going to be in the repository that your default setup for now you got to be careful in that some of the repositories like Red Hat and others you know those tools might not work in Debian right because Red Hat's a little bit different it's Linux but it's a little bit different so it might not have the proper dependencies that you need so what I recommend is that you add some of these repositories you can just go whatever repository you're looking for just Google say Hey you know what's the repository for Ubuntu come up and it'll tell you what the repository is for Ubuntu and you can go ahead and add it to your repository list. But you'd only put in like well-known repositories right because I mean there could be the risk of just adding some like dodgy software right?yeah if you put in if you put in any repository it might be that you know if I'm you know if I'm a malicious actor I might add a repository hey I've got this new repository of all the best hacking software and then and then everybody goes and uses that repository and you're installing software that may be malicious so only use those for the major distributions don't go ahead and and bringing in any of the outside or or yeah as you refer to them dodgy or just off the beaten path repositories you got to always be careful because you're basically giving permission for somebody to put software on your system and if you're giving them permission you have to trust them make sure you can trust them all right so that's how we go ahead and change our repository all right. So let go let's add another package let's go um I'm going to clear my screen all right so we're going to see if we can't get a package called BlueZ it's a Bluetooth management software it allows you to be able to uh scan for Bluetooth devices and manage your Bluetooth devices so we're going to go apt install bluez and let's see if we can get it here there we go beautiful okay and now we're going ahead and down downloading bluez and this would allow us now to be able to control manage and scan all of our Bluetooth devices it's if you're doing anything in Bluetooth and we'll do it in the wireless chapter in Linux Basics for Hackers okay which service would you want be restarted let's go ahead and just hit the space bar so we got network manager and go hit the tab go to okay and goes ahead and you see it's disconnected network, network connection has been disconnected it'll reconnect in a moment here should at least okay so now I've got BlueZ on my system this this is not built into Kali it's in the repository but it's not built in so we've gone ahead installed it on my system all right. If we wanted to remove software we can use the same we can go sudo apt all right remove let's remove our snort oh I'm going to have snort on this let's go remove BlueZ let's go ahead and remove it and yep say yes and it goes ahead and removes it. Now sometimes when you go ahead and remove it'll actually leave behind still configuration files and so if you want to get rid of everything what you want is not remove but purge all right so this gets rid of everything any type of residual of the software on your system and goes ahead and gets rid of all of that and it's going ahead and trying to get rid of all of that all right great and then one of the things you want to do periodically is to be able to update your packages. So what happens is that Kali keeps a list on your system of all the available packages so that if Kali puts in a new package all right into the repository it might be there but you're not going to be able to download it because your system doesn't know that it's there and so what you need to do then is go sudo apt update all right and what this will do is it'll go into the repository and update your list of all of the packages that are available to you you got to do this periodically or what'll happen is that you'll try to download a package that is actually there but your system will tell you that it's not. Such an important command to know right because people often forget that and then things just don't work. Yup notice that uh they're using now the Kali dark lab is the repository they changed the URL slightly and this is 20233 all right had 82 packages comes back say can be upgraded all right let's go ahead and do that right so this will give us the latest versions of these packages all right upgrade all right says you don't have enough free space okay uh on this system. So Occupy The Web you're using VMware here right so that just gives you the ability to expand the the size of the disc quite easily run right? VMware does a lot of things a little bit better than virtual box but it does there is a price for it I don't know it's about $200 I think there's an academic version it's about 150 or something if you're a student but it actually works significantly better enough so that it makes it worth you're spending the little bit of money for in some cases it might be a lot of money but um I find it saves me time and saves me headaches to be able to use VMware this is not an ad we're not sponsored by VMware but I'm just simply giving you the the real facts VMware is a little bit better than virtual box but it's not free okay. One of the things that people who are used to or comfortable using a GUI based system is that there's actually a GUI based package that we can install on our system that will allow us to download new software and this is called synaptic all right so let's go ahead and go pseudo app install synaptic and there's others as well this is this is one of them all right and we'll go ahead and install this and so if you're want to use a GUI based system to install software this will help you with that one of the beauties of it is that you can kind of see all of the software packages that are available to you and sometimes that can just spur thoughts okay and let's go sudo synaptic and here's the synaptic package manager all right and it's going to show you all of the packages that are available for your system with a little bit of description right and you can just kind of scroll through them you can also search remember that we had earlier done Bluetooth so let's go use Bluetooth and it'll come back and it'll show me all of the Bluetooth packages right that have Bluetooth anywhere in there or say you're looking for MySQL right and and you can go and search and it'll give you show you all the MySQL packages and sometimes these this can be a little confusing because there's a lot of them and most of them you see are libraries for MySQL and I'm going to kind of repeat what I uh I said earlier about MySQL and Maria they're both basically they're clones of each other so in my book I often make reference to mySQL but Kali now uses uh Maria they're basically the same thing so you can see right here for instance this is a CLI okay for MySQL MariaDB basically the same thing what's happened is that the people who developed MySQL sold it to to Oracle eventually to Oracle and then they came back and built a clone and there as an open source as well so but you basically the commands and the tools are going to work in both of them so that's going to make for some cases it's going to make it easier if you want to get something you simply go ahead and click on it and you can go ahead then and these that have the plus mark on are already installed I believe no the check is the okay so I want to go get this one and go ahead and then go ahead and mark the required I haven't used this in a while you can tell. Yeah I'd rather use a CLI right? yeah I'm so used to using a CLI but uh I want every I want other people to be able to now what uh how do I go ahead and... Did you click apply? Oh yeah and apply thank you all right so you want to make the following changes apply it'll go ahead and install those packages for you all right so it's downloading those packages. What's your opinion because you know I see a lot of hate where people say oh script kitties they don't know that you need to learn the CLI but my attitude is always all of us started at zero right and I mean that's what I love about what you're doing here you you got to start somewhere. All of us started at zero and the book is designed for people starting at zero who want to get into cyber security so I try to show multiple ways of doing the same thing you know I really object to people you know calling names at other people of script kitties what have you we've all started there we've all done that there's no point in being able to disparage other people who are just learning so we all started as script kitties and some people are more comfortable with GUI based um package managers or GUI based anything because they've grown up in a Windows or an Apple world where they don't use a a command line so that's why I put this into the book and you know I seldom quite honestly seldom have ever use this package management but it's important that everybody hav, everybody's different, everybody has different ways they feel comfortable with and um and so this way you know it it visually shows you all of the packages and sometimes as a beginner by seeing all the packages they're like oh wow look at all the packages that I can install on my system you know all this cool software for free yeah which you know you can do it with the command line as well but it's not quite as visually appealing so you can see it's still downloading my packages all right and while it's doing that all right I'm going to go ahead and open up another terminal. Okay let's talk about a couple more ways that we can go ahead and get software two or three more ways probably one of the most important ones once you've got an idea of how to be able to get from the package manager into your Kali the next thing you really need to do is how to get tools off GitHub and so GitHub there's lots of tools on GitHub some of them are good some of them are bad but sometimes you really need that tool that's on GitHub and there's a command that we can use called git clone and what this does is it download from a URL of a GitHub page the software that you need in the book I used uh one called Blue diving staying with the the whole Bluetooth theme I'm not sure that it's still there but we'll check okay and go it's at that it always begins with github.com all right and then this guy's name was uh or his his uh repository is balle and then bluediving.git and this is some Bluetooth hacking tools and you see it's going ahead and going in GitHub and it found the tools that I wanted notice that it says it's cloning into that means it's created a new directory called Blue diving so we can go there and and then go ls-l and there we have a number of tools that are available looks like they are Pearl scripts you see this here the pl means they Pearl scripts for doing Bluetooth hacking. So let's go ahead one of the tools that you might want to use is a tool called pip pip is the python package manager and so so remember we can use the sudo apt all right search all right let's go look search for pip. Pip is the Python package manager and allows us to go ahead and get Python packages from their repository this is not in the book by the way so we're adding something new and you see go through here we see a lot of a lot of stuff with Pip in it but what we're really looking for is the package manager Pip and the new version should be PIP 3 all right wow a lot of stuff what we're doing here is we're going to try to install the package manager for Python 3 it's python3- pip and we go hit enter and it says it's already running of course on my system because I use it all the time now Python 3 the the PIP package manager is great for installing you so many different packages one of them that I use a lot is um the one that allows me to use the Linux command line on Showdown so all of your viewers are familiar with shodan and so this is allows me to do that kind of work from the command line so we'll go sudo pip3 shodan and all right so it's already says requirement already satisfied Shodan is already there so you can install Shodan and now you can do Shodan searches from your command line so for instance let's just do a quick demonstration here so we can go let's go sudo shodan and remember if you know shodan syntax right you can search by Port so we can say okay shodan search by Port:502 which is a ICS Port it's used for mod bus first of all we've got a initialized shodan so we'll go shodan let's do shodan -h first all right now that we we have it installed and you can see here's the uh the commands that I can use here's the search command that's what we'll be using but before we can use it we have to init okay that's initialize Shodan with your API key so I'll go shodan okay init and then my API key all right so now I can use my shodan from the command line in my Kali and go shodan all right and then go search and then port or whatever the search you want to look for right so we know that the most basic type of Shodan search is we can search by Port this case this is a industrial control system Port we're going to go ahead and find all the systems in the world that have Port 502 open on them give it a moment to do there it is and you can see that it's going ahead and listing all the it IP addresses okay of and it's I'm just going ahead and hitting enter to go through the list the list is going to be thousands and thousands just like in Shodan I do a q because this is using more as a display I can also go country say France all right so I'll just go ahead and find all those in France in some cases this is a little bit easier to work with Okay than the the website so I can get them all and I can put them all into a file and then search those so I'm going to go Q out of those so that's one that we can use to be able to use shodan there's lots of other tools like this that we can install that are not installed by default in Kali that might be really useful. Finally there's another package manager that's used for Ruby scripts and that's called gem all right and so we can if you have a a a particular tool that's written in Ruby you you might want to use a gem install it's very similar to pip right in this case there's a tool that's written in Ruby called modbus -cli if I remember correctly because you don't have right permissions so let's go ahead and use sudo on it. This is another tool that is not in the Kali repository and so I've gone ahead and installed it using gem which is the Ruby package manager the gem being a reference to the Ruby right so that helps you remember that command. So those are kind of the the basic ways that we can go ahead and install new Tools in our system probably in a later tutorial later video here we'll actually show you how to make a tool from source it's not in the book Linux Basics for Hackers probably going to add it in a later version but uh right now it's not there but we'll do a tutorial on that later right now want to just keep it simple for those people who are just starting out and how to go ahead and take the packages off the repositories and get them into your system. So I think that's a good overview of all the ways that we can go ahead install new software into our Kali system. I love it I mean you've not just covered apt which is what a lot of people would assume you've covered others as well so really appreciate you doing that Occupy The Web as always um where can people get more information is it Twitter, is it on your website, just tell us how people can reach out to you if they want to learn more well they can always find me on Twitter three_cube they can go to hackersarise.com and you're welcome also to email me at occupytheweb one word protonmail.com which is that email address is actually in the chapter 13 of Linux Basics for Hackers so I welcome your emails your comments on Twitter or coming to Hackers Arise let us know what you think. I'll just have to say this because I know people will comment I know it's X now so on X right so I will probably I will probably always say Twitter right hard to change hard to change it's hard to change I mean it's I know that what Elon Musk is trying to do and I hope he successful but it's all you know it's been Twitter for 20 years and it's a I'm not going to immediately change over to saying Twitter but so you you're welcome to correct me if I say Twitter. Occupy The Web as always thanks so much and just for everyone who's interested I've put links uh to the books below those are affiliate links so I will get a commission but if you want to support the channel and support Occupy The Web then use those links below go to Occupy The Web's website if you want to learn far more I mean we can only cover so much on YouTube but if you want to really get into like what I would call insane really good courses and have a look at his website Occupy The Web as always thanks so much. You're welcome David it's always good being here thanks for having me on [Music] again.",
    "transcript_keywords": [
        "Occupy The Web",
        "ahead",
        "Kali",
        "Kali repository",
        "repository",
        "Debian repository",
        "package manager",
        "Linux Basics",
        "package",
        "Kali Kali built",
        "Debian",
        "Linux",
        "Bluetooth",
        "packages",
        "book Linux Basics",
        "System",
        "software",
        "shodan",
        "Web",
        "Occupy"
    ],
    "transcript_entity_values": [
        "first",
        "YouTube",
        "Bluetooth",
        "the Operating Systems",
        "Linux",
        "three",
        "Parrot",
        "hundreds",
        "Linux Administration",
        "shodan -h first",
        "20 years",
        "Apple",
        "Maria",
        "Pearl",
        "Oracle",
        "Chapter 4 Linux Basics for Hackers",
        "Occupy The Web",
        "API",
        "Operating Systems",
        "20233",
        "chapter four",
        "One",
        "two",
        "Showdown",
        "modbus",
        "Bluetooth Recon",
        "Red Hat",
        "Server Administration",
        "France",
        "Ruby",
        "Foundation",
        "Elon Musk",
        "zero",
        "Today",
        "chapter 4",
        "YouTube",
        "last few years",
        "3",
        "Networking",
        "bluez",
        "today",
        "David",
        "Google",
        "about $200",
        "chapter 13",
        "Linux Basics for Hackers",
        "Kali",
        "Python",
        "Linux",
        "Pip",
        "one",
        "Port",
        "Linux Basics for Hackers",
        "Linux",
        "Port 502",
        "VMware",
        "82",
        "Red Hat's",
        "Android, Hacking",
        "GitHub",
        "GUI",
        "Network Basics for Hackers and Getting Started Becoming a Master Hacker",
        "Debian",
        "your Operating System",
        "Red Hat",
        "thousands and thousands",
        "Ruby",
        "about 150",
        "Twitter",
        "Occupy The Web's",
        "Windows",
        "CLI",
        "David Bombal",
        "Kali Kali's",
        "Shodan",
        "chapter two"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "LAW",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "LAW",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "LAW",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "MONEY",
        "LAW",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "GPE",
        "FAC",
        "ORG",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "NORP",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "LAW"
    ],
    "vector": [
        -0.03579365834593773,
        -0.06799168884754181,
        -0.029000557959079742,
        -0.03177077695727348,
        0.018511127680540085,
        -0.08280502259731293,
        0.009147069416940212,
        0.07472391426563263,
        -0.05849668011069298,
        0.015083667822182178,
        0.05881703644990921,
        0.02554016374051571,
        0.04932820796966553,
        -0.06743205338716507,
        0.06798532605171204,
        0.008856439962983131,
        -0.04220939055085182,
        -0.00611638929694891,
        0.030857684090733528,
        -0.16002140939235687,
        -0.05895448476076126,
        -0.07960887998342514,
        0.09904623031616211,
        -0.045202672481536865,
        -0.04412250965833664,
        -0.003917239606380463,
        -0.007248052395880222,
        -0.007826724089682102,
        -0.029335549101233482,
        -0.07340861856937408,
        -0.017419973388314247,
        0.06429531425237656,
        0.01158502884209156,
        -0.018621889874339104,
        0.015266254544258118,
        0.04263952001929283,
        0.054614339023828506,
        -0.062255799770355225,
        -0.02053822949528694,
        0.024203317239880562,
        -0.051158271729946136,
        -0.05826575681567192,
        -0.057225894182920456,
        -0.050820376724004745,
        -0.019625646993517876,
        -0.008940537460148335,
        0.0006417892291210592,
        -0.02654542587697506,
        0.09245007485151291,
        0.002874493831768632,
        -0.0526430681347847,
        -0.020746592432260513,
        0.04427560791373253,
        -0.014443697407841682,
        -0.03438045457005501,
        -0.05762749910354614,
        0.05449972301721573,
        0.0066979979164898396,
        0.048691071569919586,
        -0.0836150124669075,
        0.03972599282860756,
        -0.018854588270187378,
        -0.07167529314756393,
        0.08191381394863129,
        -0.03767026960849762,
        0.019314821809530258,
        0.019096100702881813,
        0.07430077344179153,
        0.034229826182127,
        -0.05723811686038971,
        -0.08839389681816101,
        -0.0860351100564003,
        -0.047569066286087036,
        0.05804789438843727,
        0.031304363161325455,
        -0.03587903827428818,
        0.05016268417239189,
        -0.026241950690746307,
        0.01770850457251072,
        0.02643200196325779,
        0.001995278289541602,
        0.035531409084796906,
        -0.01699770614504814,
        0.050987403839826584,
        0.016261376440525055,
        0.03374653309583664,
        0.04710692912340164,
        0.058761369436979294,
        0.05282390117645264,
        -0.04020903259515762,
        0.05043724179267883,
        -0.005336282309144735,
        0.035112716257572174,
        0.0077162450179457664,
        -0.01348472572863102,
        0.037254489958286285,
        0.06076131761074066,
        -0.03364069387316704,
        -0.10446356236934662,
        0.07408932596445084,
        -0.045779913663864136,
        -0.06486254930496216,
        0.003842251608148217,
        -0.06693898141384125,
        0.013071511872112751,
        0.049299001693725586,
        0.07209755480289459,
        0.07284160703420639,
        0.09051807969808578,
        -0.031141726300120354,
        -0.03530306741595268,
        -0.032240111380815506,
        0.003171605756506324,
        -0.03290783241391182,
        0.05435972660779953,
        0.025099489837884903,
        0.005782165098935366,
        0.10057428479194641,
        0.07243170589208603,
        0.06675653904676437,
        0.12274463474750519,
        0.028271056711673737,
        0.0018938934663310647,
        -0.008627166040241718,
        0.03380781412124634,
        -0.01364878285676241,
        -0.023545416072010994,
        1.0030872576165712e-33,
        0.0776333138346672,
        0.1102813109755516,
        -0.09911414235830307,
        -0.012426994740962982,
        0.12391569465398788,
        -0.02905007265508175,
        0.09401078522205353,
        0.04701580852270126,
        -0.13842645287513733,
        0.06487885862588882,
        0.021905481815338135,
        0.0019917478784918785,
        -0.027072090655565262,
        0.027542462572455406,
        0.025932464748620987,
        -0.07697823643684387,
        -0.027943462133407593,
        -0.037475038319826126,
        0.014789368025958538,
        0.04060762748122215,
        0.00022389194054994732,
        -0.04057710990309715,
        0.03180649131536484,
        0.015109979547560215,
        0.052186060696840286,
        -0.04317621514201164,
        -0.012044597417116165,
        -0.026439180597662926,
        0.0686400756239891,
        0.011532952077686787,
        -0.08697738498449326,
        -0.029323933646082878,
        -0.08534972369670868,
        -0.011503581888973713,
        -0.016785496845841408,
        -0.0477730855345726,
        -0.06655450165271759,
        -0.1147785484790802,
        0.02030022069811821,
        -0.07190460711717606,
        -0.08288349211215973,
        0.061229974031448364,
        0.021899748593568802,
        -0.09336555749177933,
        0.03314046561717987,
        0.037280209362506866,
        0.050966762006282806,
        0.010271979495882988,
        0.04453285038471222,
        0.006432641763240099,
        -0.040944699198007584,
        -0.02339576557278633,
        -0.002134854206815362,
        -0.03551528975367546,
        -0.04703827574849129,
        -0.035545963793992996,
        0.038725078105926514,
        -0.02190185710787773,
        0.05340108647942543,
        0.06772357225418091,
        0.039503954350948334,
        0.030336342751979828,
        0.03779985383152962,
        -0.023256730288267136,
        -0.06143425777554512,
        -0.05475024878978729,
        0.016400424763560295,
        0.03858700767159462,
        -0.004265636671334505,
        0.05427585542201996,
        -0.07824666798114777,
        0.04335963726043701,
        -0.01703670807182789,
        0.0540630966424942,
        -0.045964911580085754,
        0.018712708726525307,
        0.07937417179346085,
        -0.052136119455099106,
        0.036123912781476974,
        0.003209768095985055,
        0.008075270801782608,
        -0.022558536380529404,
        0.07912614941596985,
        -0.011054669506847858,
        0.003022929187864065,
        0.0345824733376503,
        0.048096392303705215,
        -0.04317760840058327,
        -0.03684064373373985,
        0.028582902625203133,
        -0.05367782339453697,
        -0.042103465646505356,
        -0.016925539821386337,
        0.04369821771979332,
        -0.041102539747953415,
        -1.865186273808494e-33,
        0.0141702089458704,
        -0.012361547909677029,
        0.013306105509400368,
        -0.008598324842751026,
        0.01488533802330494,
        0.022061817348003387,
        -0.008264214731752872,
        -0.02194049395620823,
        0.08825572580099106,
        0.0014237011782824993,
        -0.06156317517161369,
        0.04726582020521164,
        0.008573795668780804,
        -0.06083567813038826,
        0.11089679598808289,
        -0.06081349030137062,
        -0.0072197993285954,
        -0.034697145223617554,
        -0.015594343654811382,
        -0.039193280041217804,
        -0.10161057114601135,
        0.13366077840328217,
        -0.06702972948551178,
        -0.05317747965455055,
        0.01358071155846119,
        0.039593055844306946,
        0.010980412364006042,
        0.08675742894411087,
        -0.03385207802057266,
        0.05546903982758522,
        0.043648626655340195,
        -0.012196931056678295,
        -0.04936937987804413,
        0.014607593417167664,
        0.024813992902636528,
        0.08068640530109406,
        0.044357456266880035,
        0.05322413146495819,
        -0.028984373435378075,
        0.011702220886945724,
        0.1200333684682846,
        0.03484451398253441,
        -0.08241511136293411,
        -0.04583297297358513,
        -0.04884331300854683,
        -0.03965584933757782,
        -0.08442201465368271,
        0.026052620261907578,
        -0.06380286812782288,
        0.01866593211889267,
        0.023103704676032066,
        0.012552852742373943,
        0.07244262099266052,
        -0.045928120613098145,
        -0.06649227440357208,
        0.030234472826123238,
        0.06093333289027214,
        0.036305222660303116,
        0.020672578364610672,
        -0.06783551722764969,
        -0.08691542595624924,
        -0.02614574506878853,
        0.008105953224003315,
        0.09086885303258896,
        -0.08045097440481186,
        -0.04680190607905388,
        -0.05242405831813812,
        0.030430996790528297,
        -0.03972581773996353,
        -0.041998546570539474,
        -0.05927480757236481,
        0.02595633827149868,
        0.03213489428162575,
        -0.0746605172753334,
        -0.03175943344831467,
        0.02619916945695877,
        -0.04603517800569534,
        0.007732666563242674,
        -0.035455022007226944,
        0.017744384706020355,
        0.0017990918131545186,
        0.01033580582588911,
        -0.029429635033011436,
        0.059520456939935684,
        -0.013500470668077469,
        0.0558563731610775,
        0.05888656899333,
        0.053629182279109955,
        0.07759687304496765,
        -0.042082011699676514,
        -0.006165245082229376,
        0.004753859248012304,
        0.014212748035788536,
        0.06553033739328384,
        0.08442899584770203,
        -5.5839382895328527e-08,
        0.029474858194589615,
        -0.003458719700574875,
        0.004621847998350859,
        0.09736363589763641,
        0.01803203858435154,
        0.06002906337380409,
        -0.0048758466728031635,
        -0.03490016981959343,
        -0.04153507947921753,
        0.04387393593788147,
        0.08173292875289917,
        0.0007346768979914486,
        -0.06711690872907639,
        -0.015189935453236103,
        -0.01717010885477066,
        0.12777571380138397,
        -0.011220327578485012,
        0.02422630786895752,
        -0.0747053399682045,
        -7.537373312516138e-05,
        0.02160795032978058,
        -0.050700049847364426,
        0.02761835977435112,
        0.06041214242577553,
        -0.04191301763057709,
        0.017966749146580696,
        0.06850071996450424,
        0.009193036705255508,
        0.00670983549207449,
        -0.015358886681497097,
        -0.04025978222489357,
        -0.0736430287361145,
        -0.043044038116931915,
        -0.05532537400722504,
        0.03453223034739494,
        -0.03856830671429634,
        -0.09276729822158813,
        -0.027683842927217484,
        0.016076674684882164,
        0.07962299883365631,
        -0.07543233782052994,
        -0.027855314314365387,
        0.05137677863240242,
        0.012379780411720276,
        -0.09435934573411942,
        -0.013186312280595303,
        -0.1361362189054489,
        -0.06330642104148865,
        0.04957539588212967,
        -0.0562627874314785,
        0.0695137232542038,
        -0.04974891617894173,
        -0.0005371410516090691,
        0.03206881880760193,
        0.059036895632743835,
        0.058875542134046555,
        -0.036280564963817596,
        -0.0050596692599356174,
        -0.02389471046626568,
        0.040926773101091385,
        0.005100760143250227,
        0.009417608380317688,
        0.034236010164022446,
        -0.012953692115843296
    ]
}