{
    "id": "EHhkW2Ezy-o",
    "title": "Apple doesn't want you to open the Mac Studio",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-03-23T19:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=EHhkW2Ezy-o",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "Mac Studio",
        "Desktop",
        "M1 Max",
        "M1 Ultra",
        "Processor",
        "Power",
        "Film Editing",
        "Creative",
        "Design",
        "Asthetics",
        "Small",
        "Compact",
        "SSF",
        "Small Form Factor",
        "What was Apple thinking?",
        "This is unacceptable",
        "We took Apple's Mac Studio apart",
        "I took Apple's Mac Studio apart"
    ],
    "views": 2657163,
    "likes": 75174,
    "comments_count": 4245,
    "description": "Get smartphone skins and cases at   Apple's Mac Studio was a long-awaited refresh to their desktop computer line-up other than the iMac. There are some fantastic improvements, but there are some serious flaws. We're not turning it on as that's for Linus Tech Tips, but we'll give you a glimpse of what's inside!  Buy the Apple Mac Studio with M1 Max:  Buy the Apple Magic Keyboard (Black):  Buy the Apple Magic Trackpad (Black):  Buy the Apple Magic Mouse (Black):  Buy the iFixit Pro Tech Toolkit:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 - It's not the Mac Mini 0:10 - Overview 1:24 - Unboxing 2:24 - Exterior impressions 3:08 - Apple Magic peripherals impressions 5:44 - Sponsor - dbrand! 6:49 - Mac Studio disassembly 7:28 - We found the screws 7:47 - Unacceptable 8:01 - Disassembly continued 8:17 - PSU impressions 9:00 - We found something interesting 9:46 - Cage removal 10:18 - Mainboard impressions 11:04 - Linus gives his thoughts 11:45 - Final thoughts",
    "description_links": [
        "https://dbrand.com/shortlinus",
        "https://geni.us/AXEOiBR",
        "https://geni.us/xBbYHTB",
        "https://geni.us/VhYO9z",
        "https://geni.us/lzEkI2",
        "https://geni.us/TKt8EQ",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "(bright upbeat music) - Mac Pro. Oh, sorry, sorry. Studio. Mini? No, Studio. Definitely Studio. That's what it says right there, Mac Studio. This is something that's been a long time coming. People have been anticipating a Mac Pro mini for quite some time now. And well, this is it. It's even got like this little pro style handle here like the Mac Pro and the Pro Display XDR do. What is-- Well, I've had a delivery. These are the peripherals that go with it. I'll talk about these later. - [Jono] They cost a lot. - They cost a lot of money but they're black and silver. The Mac Studio is the first Mac that I know of that has front panel like actually front panel IO. Like the Mac Pro had top IO that I guess technically would count. But like, this is the first like desktop Mac that's meant to sit on your desk. Honestly, it's amazing that Apple held out this long because the SD card slot is something that the Mac mini really should have had for so long. Like why didn't it have an SD card slot? Of course, we're still on the USB type C bandwagon. These are USB, are they four? No, they just say type C. So I think these are the USB three point, whatever. On the ultra version of this design, these are Thunderbolt ports. What is this packaging? Look at how there's like, Apple, what is this? Why does it have wings? Anyway, enough complaining about the packaging, let's continue. Oh, it's one of these things. So you just take this here. You take, get real good rip on it. You don't have to do that. - [Jono] Stop! (laughing) - All right, let's get it outta here. This box, okay. Props to Apple. This is like the most, one of the most complex cardboard boxes that I've seen in a while. I'm being asked to do this gracefully. Let's see if I can do that. Okay. So it doesn't come that way even though it's creased this way. See, look at this. It's creased in a really weird way. What is Apple's packaging up to? And it just falls away. (exhales deeply) That is chonky. It's actually... Wow, it actually is like a Mac mini but bigger. So we've got the Mac mini or... (laughing) Oh man, it's gonna take a while to get outta that habit. So we got the Mac Studio. We've already seen pretty much everything that there is to see. Yup, it's a big hunk of aluminum. It's heavy, it's got the SD card slots, it's got the front USB type C, got the rear Thunderbolt, Gigabit Ethernet, 10 Gigabit Ethernet sorry, Mickey mouse, USB type A, HDMI and the headphone port. I am led to believe that it is possible to get this off, I'm not quite sure how. Maybe I'll look into that later. First, we need a way to actually interact with this thing. Thankfully, we have the official peripherals. Hey, get in here. Magic Trackpad, Magic Keyboard. Do we have the magic mouse? Yeah, we do. So these are environmentally friendly packaged. This is not. It's got a plastic condom on it. Thought we were over this Apple. You'll be delighted to know, they give you actually a nice braided lightning cable, it's a type C. This is how you charge your mouse. How much does mouse cost Jono? A hundred bucks. So your hundred dollars mouse that is actually an ergonomic nightmare. Like I cramp up hard trying to use these things. That's how you charge it. Let's get the trackpad out next. - [Jono] The trackpad is expensive too. - Oh yeah, I know. $149 for the black trackpad. How much is the regular trackpad? Now to be clear, this does have the force touch feature. So like it's got the haptic feedback. So it's $20 more for a black trackpad. Like Apple, what are you doing? But yeah, like they could have made this more ergonomic with like a proper cable attachment point. They could have made this bigger or something to justify that extra price, you know, studio offer it, right. And I'm, I originally thought that this was unique to the new generation of peripherals as well. So I didn't think they had the full size keyboard but apparently they do. This is $200? - [Jono] Yeah. - I could break this over my knee. I wouldn't, actually I wouldn't even have to. Look how much this flexes. This is, it sucks because Apple has some cool technology in their keyboard, like touch ID right here. It's nice but it's not very rigid. And also, why do we have these? Can we have like an Apple keyboard please? Like an actual, like none of the magic, none of the magic. Just gimme the Apple. See, I have respect for the things that Apple has done in the past that I see them capitalizing on now with products that are honestly not very good. Now that being said, I'm sure there are people who love this especially the low profile design. I'm sure there are people who appreciate the fact that it feels the same as their MacBook or whatever but this is an ergonomic nightmare just like this is because it's so flat that basically in order to actually type on it, you have to basically be mashing your desk. Ugh, this wasn't supposed to be a review of this but I just hate this so much and it doesn't even have any tilt or anything. It's just the pads. It's just there you go. Yeah, so Mac Studio. Let's see if we can take this thing apart. But before that, this, that's the robots, they're watching me. Solve something for dbrand.. Okay, so like what? - [Jono] This. - Oh. So this is actually like... Is this supposed to be like an easy mode Rubik's cube and I'm supposed to fail at it or something? 'Cause that's kinda what's happening. Man, this, okay. This is making my brain hurt. Talking points while he's struggling. Real leather, available now for all your (beep) not just cables, cubes. Sorry, cubes. Wow, I am just fried. Thank you dbrand. Feels nice, sure is, sure does. Yeah, you're supposed to visit dbrand.com/shortlinus. He is short, I'm not. Enter the code \"5'1\", \"5'1\" to get 15% off. Unless the video has been up for more than 15 minutes in which case the deal is over. What? Maybe two people will ever get that discount code. dbrand basically (beep) you. Using me as the implement for the (beep). This is what I had to do today. All right Jono. What do you say we turn this on? - [Jono] Nah. - In the immortal words of Dave Jones from EEVBlog, \"Don't turn it on, take it apart\". This is the softest aluminum in the world. This thing, just like being pushed this way to pry it open has mashed the aluminum. Good God. I am assuming that this is in with clips. Perhaps it is all friction fit. In which case I need to go around and I don't wanna do that really, not with these. - [Jono] There's no screws is there or? - I don't think so. Unless there's screws under this. Oh, I hate this. Oh, I hate this. - [Horst] What happened? - Okay, okay. Enough of it's come off now I can just peel it. There is, there is no excuse for why these screws had to be hidden under this. - [Horst] Aesthetic. - No. - [Horst] Clean design. - No, this is unacceptable. And in order to get into this, this whole thing needs to be just destroyed. And in order to replace it, you need to just get another one of these basically. Well, there's the internals. I'm not gonna like completely disassemble this thing. I just wanna see how far we can go. Look, there's screws hidden under this little black tab as if anybody is ever going to see this. This is probably because they're live. These are the power supply screws. These are going right down into metal that is conducting electricity. Why would you do this? There's your power supply. That's I think 380 Watts if I'm not mistaken. It's pretty small. They glued the crap out of it. What's all this silicone crap? I guess it's to keep the capacitors from moving. But yeah, these here, these here are contacts, screws go through those and they touch these contacts down here. That's where the power goes. Have fun. All right, I don't know how much further I wanna go 'cause it doesn't look like it's trivial to get much further. They've built this thing in layers. Wait, why are there antenna points down there when this is the, is that the? Hang on, I need to get this out. That is storage. It has replaceable storage. I'm pretty sure that's storage. It's like not really marked what these chips are but I'm pretty sure they're NAND flash. It's possible if not likely that you'll be able to get replacement SSDs for this that are potentially bigger, faster, more reliable. Wait, there's a second storage slot. So there's one over here and there's one right here. They're both the same slot. - [Linus] Can I just point out how crap it is that we are expected to be impressed by that. - Yeah, it is pretty crap. Oh, you know what? I could probably take this frame off. I don't know how much further I wanna. I keep saying that. I don't know how much further I wanna go but I kinda do wanna keep going. I just wanna get this cage off so I can see underneath it. I'm not gonna pull the cooler off, I'm not gonna pull the main board out or anything like that. I just wanna see unobstructed the view of the board. - [Jake] Pull the cooler off, no balls. - Mostly what I wanted to do was have a look inside and see what the main board looks like. - [Jono] Yeah, let's just, let's not take it off cause... - Yeah, I'm not gonna go any further than this. I just wanted to get this plate out of the way, even though Jake's like, \"Ah, do it or no balls\". Yeah, I'll do it after we've done our thermal testing because this one actually has a different cooler, I think than the M1 Ultra version. It's aluminum versus copper. For today, it'll just have to end here. One thing I'm noticing as I'm kind of reassembling a little bit here is that the IO is actually very, very modular. Like all of these are in boards and they're in their solid. So it's actually pretty unlikely that you're going to ever act, like end up breaking anything here. And if you do, it is replaceable. So maybe another, a repairability score of zero. Like this was actually a little bit more trivial to get into than I expected. But it does require you to-- - That power supply is dangerous AF. - Oh yeah. - For the uninitiated. - Yeah, check this out. That's how it goes in and that's how it connects. You just, you just screw it down. Yep, that's that's exactly how the, the iMac Pro died. That's the reason 'cause they just-- - That's just-- - That's their connection. - line voltage. Oh no, that's no, that's-- - Not line voltage. - Probably 12 voltage. - Yeah. 12 volt. - Okay. - Still enough like current to really mess up your day. - Yeah. - I wasn't expecting to get interrupted. I was gonna close it out. So... Yeah, Linus just goes, \"This' real cool, huh?\" I don't know why that was Elvis, but you know. - [Jono] You're so salty right now. - I don't know why I'm... Okay, I know why I'm salty. This was way too. Like, I mean, I guess I should have, my very first instinct was that there were screws under this thing but I was like, no, they couldn't possibly because that would require them to actually, you know break it to get back in. But apparently that's what Apple does now. - [Jono] Did this kill you emotionally? - A little bit. But you know what doesn't kill me emotionally? ShortCircuit. You should get subscribed. We do all kinds of unboxings. Not all of them are like this, not all of them have rage. If you want another one of rage, the LG Gram that I reviewed a little while ago, that was pretty rage. That was a different kind of video for me.",
    "transcript_keywords": [
        "Mac Studio",
        "Mac Pro",
        "Mac",
        "Mac Pro mini",
        "Apple",
        "Yeah",
        "Mac mini",
        "Studio",
        "Pro",
        "thing",
        "USB type",
        "Pro Display XDR",
        "USB",
        "screws",
        "pretty",
        "Trackpad",
        "type",
        "Magic",
        "Mini",
        "Pro Display"
    ],
    "transcript_entity_values": [
        "hundred dollars",
        "Elvis",
        "5'1",
        "IO",
        "Thunderbolt",
        "Jake",
        "three",
        "hundred bucks",
        "380",
        "One",
        "AF",
        "one",
        "Thunderbolt",
        "USB",
        "20",
        "Mickey",
        "Mac",
        "the Mac Studio",
        "more than 15 minutes",
        "second",
        "the LG Gram",
        "Watts",
        "IO",
        "Gigabit Ethernet",
        "Definitely Studio",
        "Jono",
        "10",
        "Dave Jones",
        "first",
        "Mac Pro",
        "HDMI",
        "Rubik",
        "Magic Trackpad",
        "two",
        "dbrand",
        "149",
        "NAND",
        "200",
        "four",
        "The Mac Studio",
        "12 volt",
        "Mac",
        "12",
        "Magic Keyboard",
        "Linus",
        "the Mac Pro",
        "SD",
        "First",
        "15%",
        "MacBook",
        "Mac Studio",
        "that's--",
        "Apple",
        "today",
        "zero"
    ],
    "transcript_entity_types": [
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORG",
        "TIME",
        "ORDINAL",
        "PRODUCT",
        "LOC",
        "GPE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERCENT",
        "FAC",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.016690537333488464,
        -0.05147618427872658,
        0.09756917506456375,
        -0.08217243105173111,
        0.07413166761398315,
        0.049315910786390305,
        0.01560149621218443,
        0.002081898506730795,
        0.002189303981140256,
        0.05616087093949318,
        0.03983192890882492,
        -0.0022552332375198603,
        0.014483078382909298,
        -0.02530493773519993,
        0.09131069481372833,
        -0.04997345805168152,
        -0.007353734225034714,
        -0.09527123719453812,
        -0.022651663050055504,
        0.02066466212272644,
        -0.03845250979065895,
        -0.06940057873725891,
        0.022400498390197754,
        0.012300298549234867,
        -0.037442076951265335,
        -0.03654664382338524,
        0.009968810714781284,
        -0.10325317084789276,
        -0.013235239312052727,
        -0.02655445970594883,
        -0.057886622846126556,
        0.015308940783143044,
        0.025785725563764572,
        -0.054448481649160385,
        0.04788367077708244,
        -0.024485666304826736,
        0.031445086002349854,
        -0.04671359807252884,
        -0.13339923322200775,
        -0.09016525000333786,
        -0.0822424665093422,
        -0.0007391381659545004,
        0.059835150837898254,
        0.058635562658309937,
        0.054951950907707214,
        -0.07341168075799942,
        0.09482105821371078,
        -0.09624121338129044,
        0.0806971937417984,
        0.11944034695625305,
        0.018108094111084938,
        -0.07707090675830841,
        0.016223426908254623,
        -0.011850903742015362,
        -0.03253958001732826,
        0.07665800303220749,
        0.005128379445523024,
        -0.02945181168615818,
        0.07716891914606094,
        0.01686915010213852,
        0.026760056614875793,
        -0.10532760620117188,
        -0.011074481531977654,
        0.04338619112968445,
        -0.0471203587949276,
        0.003217163495719433,
        -0.013075899332761765,
        0.047118738293647766,
        -0.02012827806174755,
        -0.056040048599243164,
        0.08856405317783356,
        -0.08710017800331116,
        0.03609919175505638,
        0.08341661095619202,
        0.007321598473936319,
        -0.022884244099259377,
        0.007504921406507492,
        -0.05555832013487816,
        0.020458966493606567,
        0.01536640990525484,
        -0.005009648390114307,
        -0.024845125153660774,
        -0.034839581698179245,
        0.03557579591870308,
        0.022917700931429863,
        0.04560589790344238,
        0.03926829248666763,
        -0.052914295345544815,
        0.015565273351967335,
        0.03498172387480736,
        0.03053908795118332,
        0.06420954316854477,
        -0.015923088416457176,
        -0.03387279435992241,
        0.039355311542749405,
        -0.056584544479846954,
        0.05298033729195595,
        -0.009734537452459335,
        -0.0336906798183918,
        0.11361873894929886,
        -0.006055885460227728,
        -0.019827410578727722,
        0.05229872092604637,
        -0.06496585160493851,
        -0.05398769676685333,
        -0.09495677053928375,
        0.045844145119190216,
        -0.05262066051363945,
        -0.028110317885875702,
        0.03848644718527794,
        0.05626796558499336,
        -0.040157902985811234,
        -0.0621911957859993,
        0.03404466062784195,
        0.07128143310546875,
        0.021523088216781616,
        0.06285727024078369,
        0.014014428481459618,
        0.07801429182291031,
        -0.03137773647904396,
        0.02760312706232071,
        0.03535525128245354,
        0.002787146018818021,
        -0.04419873282313347,
        -0.07152587920427322,
        0.051490701735019684,
        -0.06984004378318787,
        3.9650985656670443e-33,
        -0.04003879055380821,
        -0.027487145736813545,
        -0.052496086806058884,
        -0.024852251634001732,
        0.06340762227773666,
        -0.11180632561445236,
        0.04989755153656006,
        0.0044099753722548485,
        -0.0663176029920578,
        -0.012929902411997318,
        -0.00023584772134199739,
        0.016996940597891808,
        -0.09497377276420593,
        0.05249447375535965,
        0.0031036969739943743,
        -0.007597232237458229,
        -0.005826271139085293,
        0.03003108687698841,
        -0.024996625259518623,
        -0.047038961201906204,
        0.00014617139822803438,
        -0.04514390975236893,
        0.01167636550962925,
        -0.02941500023007393,
        0.016139421612024307,
        0.02160073071718216,
        0.015986109152436256,
        0.0052890959195792675,
        0.10333158075809479,
        -0.002587981754913926,
        -0.11356409639120102,
        -0.030348382890224457,
        0.04243995621800423,
        -0.07148456573486328,
        -0.03063344955444336,
        0.008499654941260815,
        0.0026115530636161566,
        -0.058194275945425034,
        0.11661982536315918,
        -0.0012862873263657093,
        -0.09459605813026428,
        8.025181159609929e-05,
        -0.04345746338367462,
        -0.10182712227106094,
        0.054788749665021896,
        0.07082762569189072,
        0.01234123669564724,
        0.02964615449309349,
        0.022197069600224495,
        -0.0032301403116434813,
        -0.02773033268749714,
        -0.03342742100358009,
        -0.020326165482401848,
        0.008427375927567482,
        -0.07375504821538925,
        -0.054016709327697754,
        -0.029590893536806107,
        -0.011343952268362045,
        0.02973482944071293,
        0.058548085391521454,
        0.042103610932826996,
        0.07705556601285934,
        0.07194222509860992,
        0.03178432583808899,
        -0.04241934046149254,
        0.05276541784405708,
        0.05265135318040848,
        -0.0026596770621836185,
        -0.017786575481295586,
        -0.03852412477135658,
        -0.07897337526082993,
        -0.060388173907995224,
        0.009081084281206131,
        -0.06657270342111588,
        0.01355765201151371,
        -0.03838517144322395,
        -0.12917457520961761,
        -0.037500254809856415,
        -0.05828118324279785,
        0.057789284735918045,
        0.0022878891322761774,
        0.02172582782804966,
        0.01778753288090229,
        0.0855722725391388,
        0.008945850655436516,
        0.042246412485837936,
        0.020721949636936188,
        0.024325521662831306,
        -0.04583901911973953,
        0.00827689841389656,
        -0.020104441791772842,
        0.060551904141902924,
        -0.04017798602581024,
        0.03298060968518257,
        -0.10167849808931351,
        -4.964872306746739e-33,
        0.008928917348384857,
        -0.06502439826726913,
        -0.027540389448404312,
        -0.010379823856055737,
        0.017701217904686928,
        0.0045580132864415646,
        0.030444785952568054,
        -0.010919380933046341,
        0.02686660923063755,
        -0.030191339552402496,
        0.053621646016836166,
        0.010427037253975868,
        -0.043889984488487244,
        -0.03505048155784607,
        -0.02063162624835968,
        -0.03477320075035095,
        -0.010946734808385372,
        0.03332589194178581,
        0.0083807073533535,
        -0.06720634549856186,
        0.05642284080386162,
        -0.04926462098956108,
        0.01818077079951763,
        0.03345641493797302,
        -0.040856923907995224,
        -0.03886348009109497,
        0.01820564456284046,
        0.06389112025499344,
        0.015355994924902916,
        0.016229771077632904,
        0.026782933622598648,
        0.012267889454960823,
        -0.051957398653030396,
        -0.018972262740135193,
        0.11277304589748383,
        0.03572029992938042,
        0.008722183294594288,
        0.008577369153499603,
        -0.031096626073122025,
        -0.0074530853889882565,
        0.05784934014081955,
        -0.016739722341299057,
        0.0267797838896513,
        -0.022521549835801125,
        0.014864236116409302,
        0.019008370116353035,
        -0.04595514386892319,
        0.0026776662562042475,
        0.004806301556527615,
        -0.041921667754650116,
        0.03566844388842583,
        -0.09847573190927505,
        0.08102557808160782,
        -0.08099854737520218,
        -0.05273500084877014,
        -0.013989287428557873,
        0.015613668598234653,
        -0.02838481031358242,
        0.021246030926704407,
        0.03580930456519127,
        0.012710843235254288,
        -0.023775026202201843,
        -0.042336493730545044,
        -0.055607423186302185,
        -0.009380929172039032,
        -0.006652629002928734,
        0.04008535295724869,
        0.05204368382692337,
        -0.08226785808801651,
        0.05269516631960869,
        -0.0017550751799717546,
        0.05400250107049942,
        0.05140979588031769,
        -0.09297260642051697,
        -0.041743021458387375,
        0.09365566074848175,
        0.03707509487867355,
        -0.07054980099201202,
        0.023976020514965057,
        -0.07409347593784332,
        0.03730982169508934,
        0.061082109808921814,
        0.0665096864104271,
        -0.03862247243523598,
        0.0031880605965852737,
        0.11692006140947342,
        0.03429313004016876,
        0.036012884229421616,
        -0.0100789126008749,
        0.022537166252732277,
        -0.07499668002128601,
        -0.019927531480789185,
        0.06286603957414627,
        0.05160802975296974,
        -0.09099461883306503,
        -6.533232976835279e-08,
        -0.07871662825345993,
        0.03274478390812874,
        0.038542717695236206,
        0.006794200278818607,
        -4.182517295703292e-05,
        -0.011868633329868317,
        0.0037637432105839252,
        -0.004196786787360907,
        0.13492973148822784,
        0.009960092604160309,
        0.002649476984515786,
        -0.03913070261478424,
        -0.06206311658024788,
        0.06536413729190826,
        -0.03564930707216263,
        0.09832578152418137,
        -0.07570965588092804,
        0.12705373764038086,
        -0.0034439850132912397,
        -0.1312185674905777,
        -0.02174093946814537,
        0.0382959246635437,
        0.05394700914621353,
        -0.03536388278007507,
        0.016030622646212578,
        -0.004445114638656378,
        0.026146993041038513,
        0.07619135081768036,
        0.09054599702358246,
        0.03694871440529823,
        -0.11223103106021881,
        -0.037606898695230484,
        -0.01708192378282547,
        0.023900030180811882,
        0.020823419094085693,
        -0.0873352438211441,
        -0.09183948487043381,
        0.08137228339910507,
        -0.010499504394829273,
        0.015265981666743755,
        -0.052781205624341965,
        -0.02918020263314247,
        0.016114261001348495,
        -0.0556350015103817,
        -0.08439233899116516,
        -0.0518152117729187,
        -0.009566047228872776,
        0.029155181720852852,
        -0.03259284794330597,
        0.047602441161870956,
        0.04204929247498512,
        -0.05852038785815239,
        0.07432016730308533,
        0.009908515959978104,
        -0.00853423960506916,
        0.02254335768520832,
        -0.002568611642345786,
        0.0032449509017169476,
        -0.027924083173274994,
        0.06483574211597443,
        0.01156519539654255,
        -0.08808571845293045,
        -0.02672366239130497,
        0.10009988397359848
    ]
}