{
    "id": "EHJufNAefEE",
    "title": "Amazon Echo Speakers 2018 hands-on",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-09-20T23:23:15Z",
    "video_url": "https://www.youtube.com/watch?v=EHJufNAefEE",
    "category": "Science & Technology",
    "tags": [
        "amazon",
        "amazon echo",
        "amazon echo dot",
        "echo show",
        "amazon echo plus",
        "amazon echo plus review",
        "echo dot",
        "alexa",
        "echo",
        "amazon alexa",
        "alexa dot",
        "amazon dot",
        "smart home",
        "voice assistant",
        "alexa setup",
        "voice control",
        "amazon echo review",
        "set up echo dot",
        "echo show review",
        "echo spot",
        "virtual assistant",
        "google assistant",
        "speaker",
        "amazon prime",
        "google home",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "update",
        "first look",
        "hands on",
        "review",
        "latest updates",
        "how to",
        "apple",
        "google",
        "verge",
        "the verge"
    ],
    "views": 308874,
    "likes": 3206,
    "comments_count": 248,
    "description": "Amazon just announced the new versions of the Echo Show, Echo Dot, and Echo Plus. Dan Seifert spent some time using the new speakers  all of them are improvements on their predecessors with nicer designs, more features, and most noticeably, better sound.  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(gentle music) - Hey, this is Dan Seifert with The Verge and I am here in Seattle at Amazon's offices where they've just announced a ton of new products for the holiday season. There's so many products. They're all on theverge.com. I don't know if I can even remember them all. But one of the biggest new products is a new update to the Echo Show. Now, this is Amazon's screen product that kind of is like if you had an Echo, and had a screen at the same time, and all the different things that you could do with that. Now they released an Echo Show about a little over a year ago now, and so this is their second version. And some of the things that they've added to this are pretty important. The first, and most obvious, thing is it's got a way bigger screen. This is now a ten inch HD display, as opposed to the 7 inch screen before. It also has a new refined design. It's kind of still got that little wedge shape going on, but on the back here you can see it's got this nice fabric finish, as opposed to the plastic that was before. It's really quite nice looking. It comes in both white or black. And then what they've really done as well, is really upgraded the audio quality of this. You've got two side firing speakers in the back and then a passive radiator for bass. So when you're listening to music, or watching TV, or watching a video on this you can get a lot better quality of sound then you could with the original Echo Show. Now, you can also still do the same types of things with like video chat. You can drop in, and call other Echo Shows, or Echo products, or Echo... Or Amazon Alexa apps on mobile devices and things like that. And they've updated a ton of the user interactions and software on this, including things like adding a browser. So, now if I say \"Alexa, open Silk, and if my voice doesn't crack Alexa, open Silk. So, just like the Fire TV it's got Amazon Silk browser as well as Firefox browser available, and then you can browse things like Youtube. So, you can watch Youtube videos on your Echo Show which has been kind of a difficult thing to do in the past. You can also, of course, browse to any other website you want. You just type in the address of the website that you want, and hit go, and you're good to go. So, that's a really nice thing to add. It's one of the things that missing from the Echo Show is the ability to watch Youtube videos. Of course, you can also watch all of Amazon's fire, or excuse me, Amazon's Prime video content on here, as well as things like from Hulu, and other over the top video services. It also integrates to the bunch of other new products that Amazon announced, like a DVR that pulls in OTA signals from the air and allows you to record them, and then you can watch them on your Echo Show. Now, that's the Echo Show. This is going to be $229. It's the same price as the prior model. I believe it's available for order real soon. It's going to be shipping next month. But that's only one of the many things that you've got here. So, we've got a lot of other stuff to look at too. (gentle music) So, in addition to the new Echo show there's also a new Echo Dot, and it looks like this. And you can see that, compared to the old Echo Dot, which is Amazon's most popular Echo device you can see the new Echo Dot is quite a bit larger. It's got a little bit more rounded of a design. It's got a fabric finish. It's really nice looking. But the big difference here is sound quality. Amazon says that it's got a much larger speaker inside and it's got a more powerful output, and you can really hear the difference. If you ask it simple things like, \"Alexa what's the weather?\" - Currently, in Seattle, it's 57 degrees fahrenheit with cloudy skies. You can expect more of the same today, with a high of 63 degrees and a low of- - So, even like voice responses like that sound so much better on this Echo Dot than the prior one. And of course if you're listening to music it sounds even better than that. So, I can do something like... Alexa, play Drake. - Shuffling songs by Drake on Amazon music. (Drake song) - So, it sounds a lot better, that's obvious. Alexa, stop. But the other thing is that you're not losing anything from this Echo Dot to the- if you're upgrading from the old one. You still have the ability to output even larger speakers with a 3.5 millimeter headphone jack. You can still bluetooth pair this to a bigger speaker if you want. Now, it's got four microphones instead of the seven that the old model had. Which might make a difference in how well it's able to hear you from across the room. But we've seen a bunch of products that- like the Google home that only have two microphones- that are able to hear you pretty well. So, that's probably too much, not too much of a concern. And then of course, now if you really want to go nuts with your sound, you can pair two of these in a stereo set up, and you can have twice as much sound with left and right channels, and you can add the new Echo subwoofer to them, so you can have an actual 2.1 surround sound, or 2.1 sound system with just a couple of Echo Dots. Now, just like the Echo Show, this is going to be available for pre-order today, going to be shipping next month, it's $49.99 so it's the same price as before. This is looking pretty cool. So, and then the third new Echo product that Amazon is coming out with, is a new Echo Plus. Now, this is an update to the Echo Plus that was released last year. The most obvious thing different with it- it's got a new design, it's squatter, it's more rounded, it kind of looks like the standard Echo now, it's got this nice fabric cover. But, importantly it also has much improved sound. It's got a larger, more powerful speaker in there, so it provides better volume and base out of the unit itself. Just like the other Echo Dot and the other Echo devices, you can pair two of these together in stereo now, and you can add the Echo sub. Now, because this is an Echo Plus, it still has the smart home integration into it. So, it ships with a light bulb that you can instantly set up just with your voice, which is really easy and cool. And then it also has a temperature sensor inside of it, so you can read the temperature of an exact room. Alexa, what's the temperature in here? - Inside, it's 67.6. - And you can also set Alexa routines based on the temperature, so if it gets too cold you can kick on a space heater, or if it's too hot turn on an air conditioner- something like that. Now, the new Echo Plus is going to be available for $149.99. It's available to order today. Shipping next month, just like all the rest of the products. And it looks like a pretty decent upgrade to the existing Echo Plus. You've heard me talk a lot about the Echo Sub with these other products, and here it is. This is the Echo Sub, and you can pair this with any Echo device whether it's a Dot, or an Echo Plus, or an Echo Show, and you can add better, lower frequencies response. It's a pretty big device, obviously something you keep on the floor. It sells for $129.99. You can order it starting today. It will be shipping next month. That's not the only home audio products that Amazon is out. There's actually a bunch more, especially if you have existing home stereo equipment and speakers. And here we've got the Echo Link amp, the Echo Link, and the Echo Input. Now, the Echo Link Amp is ideal if you have non-powered passive speakers. You can plug them into the back here. And then it has a 60 watt, class D amplifier inside of it, so you can integrate those speakers with your whole home audio smart system. The Echo Link is pretty simple. It just is basically the same thing without the amplifier. This sells for $299. This sells for $199. And then the Echo Input, which is basically like very similar to the Chrome Cast Audio from Google. You plug it directly into your sound system. This does have microphones on it, so you can add voice control directly to that. It's kind of little big similar idea to how a lot of people use the Echo Dot now, but in a smaller package, and that's available for $34.99. (upbeat music) Did we get it? Alright. So, that was a ton of stuff, but it's really only the tip of the ice berg of what Amazon has announced today. There's a ton of other new products and services coming out all tied to Alexa, and all tied to the Echo brand. Be sure to check out the site, theverge.com for all the more information on that. And we're going to have more videos for you so stay tuned on Youtube.com",
    "transcript_keywords": [
        "Echo",
        "Echo Show",
        "Echo Dot",
        "Dan Seifert",
        "Echo Link",
        "Amazon",
        "Echo Link amp",
        "Show",
        "Echo Shows",
        "Echo Input",
        "original Echo Show",
        "Echo Dots",
        "Dot",
        "Alexa",
        "things",
        "Echo device",
        "products",
        "sound",
        "Echo products",
        "thing"
    ],
    "transcript_entity_values": [
        "your Echo Show",
        "the Echo Plus",
        "Firefox",
        "the holiday season",
        "last year",
        "an Echo Plus",
        "DVR",
        "2.1",
        "only one",
        "one",
        "third",
        "7 inch",
        "57 degrees fahrenheit",
        "Echo Dots",
        "Youtube.com",
        "four",
        "Echo",
        "the Echo Input",
        "67.6",
        "an Echo Show",
        "the Fire TV",
        "Silk",
        "today",
        "Alexa",
        "Youtube",
        "OTA",
        "the Echo Link",
        "63 degrees",
        "Google",
        "the Echo Show",
        "Echo Dot",
        "Hulu",
        "Echo",
        "your Echo Show",
        "49.99",
        "129.99",
        "Alexa",
        "Youtube",
        "next month",
        "Amazon Silk",
        "two",
        "jack",
        "Echo Dot",
        "Echo Show",
        "Amazon",
        "the Echo Dot",
        "an Echo Show",
        "199",
        "60 watt",
        "Seattle",
        "299",
        "this Echo Dot",
        "Echo Plus",
        "second",
        "Dan Seifert",
        "the Echo Link Amp",
        "Echo Plus",
        "Drake",
        "first",
        "Echo Shows",
        "3.5 millimeter",
        "the Echo Sub",
        "229",
        "a year ago",
        "seven",
        "34.99",
        "149.99",
        "a ton"
    ],
    "transcript_entity_types": [
        "EVENT",
        "EVENT",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "EVENT",
        "QUANTITY",
        "ORG",
        "EVENT",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "QUANTITY",
        "GPE",
        "MONEY",
        "EVENT",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "ORDINAL",
        "WORK_OF_ART",
        "QUANTITY",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "QUANTITY"
    ],
    "vector": [
        -0.04636656120419502,
        -0.05985086411237717,
        0.04345213249325752,
        -0.06895685195922852,
        0.05861835554242134,
        0.037516262382268906,
        -0.0072262645699083805,
        -0.07321528345346451,
        0.033958517014980316,
        -0.07601217925548553,
        -0.018930304795503616,
        0.028280433267354965,
        -0.053929802030324936,
        -0.04336141422390938,
        -0.02564040757715702,
        -0.018457187339663506,
        0.06048637256026268,
        -0.11906835436820984,
        -0.010254512540996075,
        -0.06372399628162384,
        -0.041770223528146744,
        0.033293962478637695,
        -0.022688433527946472,
        0.01944752410054207,
        0.012654836289584637,
        0.0788041427731514,
        -0.07057791203260422,
        -0.013612309470772743,
        -0.017632577568292618,
        -0.07998733967542648,
        0.019869279116392136,
        0.12475530803203583,
        0.07772257924079895,
        -0.0513642244040966,
        -0.04361807182431221,
        -0.09766043722629547,
        0.012159625068306923,
        0.014488248154520988,
        -0.027360789477825165,
        -0.04383733868598938,
        0.005136373918503523,
        -0.05387670919299126,
        -0.04260427504777908,
        -0.006303044036030769,
        -0.07160457223653793,
        -0.09709979593753815,
        -0.049502428621053696,
        -0.10389629751443863,
        0.04003480076789856,
        0.030178623273968697,
        -0.005886654835194349,
        -0.04141275957226753,
        0.06959860026836395,
        -0.01616920903325081,
        -0.05757205933332443,
        0.06884577125310898,
        0.05029724910855293,
        0.12149485945701599,
        0.035328660160303116,
        -0.009569169953465462,
        0.06897474825382233,
        -0.08293866366147995,
        0.003914932254701853,
        0.026935866102576256,
        0.004527748096734285,
        0.01482660323381424,
        -0.018771251663565636,
        0.030695799738168716,
        0.04419073835015297,
        -0.004256993066519499,
        -0.023861335590481758,
        0.021282244473695755,
        0.0771259143948555,
        -0.05831177532672882,
        0.06121079996228218,
        0.05655139684677124,
        0.07205000519752502,
        -0.11494078487157822,
        -0.044013332575559616,
        0.050823044031858444,
        -0.042657848447561264,
        0.010404787957668304,
        -0.07911654561758041,
        -0.06742967665195465,
        0.0032717185094952583,
        0.0412701740860939,
        -0.007524998392909765,
        -0.02430638112127781,
        -0.06736991554498672,
        -0.024610212072730064,
        -0.028932616114616394,
        -0.064161516726017,
        -0.010707800276577473,
        0.04431140795350075,
        -0.03619405999779701,
        -0.03548521548509598,
        -0.02513614483177662,
        -0.05043121799826622,
        0.04578983411192894,
        0.06753218173980713,
        -0.02219407819211483,
        -0.016377683728933334,
        0.011748629622161388,
        -0.038771290332078934,
        -0.05615849792957306,
        -0.12283795326948166,
        -0.02920611947774887,
        0.08965107053518295,
        0.0732589140534401,
        -0.014900237321853638,
        -0.02998494543135166,
        0.0216041449457407,
        0.0041478839702904224,
        0.028677742928266525,
        -0.023245738819241524,
        -0.061830442398786545,
        -0.059475336223840714,
        -0.007314497604966164,
        0.07049167901277542,
        0.01360338181257248,
        0.1672983467578888,
        -0.04535866528749466,
        -0.01883125491440296,
        -0.022055285051465034,
        0.03241774067282677,
        0.0015549686504527926,
        -0.08750545233488083,
        3.265803221176604e-33,
        -0.002997324336320162,
        0.0413205660879612,
        -0.004566659685224295,
        -0.06215963140130043,
        0.08629383891820908,
        0.011814108118414879,
        -0.06606420129537582,
        0.07843861728906631,
        -0.03881961479783058,
        0.0092692906036973,
        0.04104533791542053,
        0.061881132423877716,
        0.008185012266039848,
        -0.017264707013964653,
        -0.04830390214920044,
        -0.09543804824352264,
        -0.04144864156842232,
        0.05762573331594467,
        -0.050309982150793076,
        -0.05774005502462387,
        0.04428883269429207,
        0.023929579183459282,
        -0.005055615212768316,
        -0.038786470890045166,
        0.06040150299668312,
        0.03910508751869202,
        0.03906266391277313,
        0.017246976494789124,
        0.00795025285333395,
        0.036399997770786285,
        -0.039619456976652145,
        -0.013289342634379864,
        0.08168552815914154,
        -0.043168917298316956,
        -0.0006438973941840231,
        -0.002391562797129154,
        -0.01738429255783558,
        -0.05420321226119995,
        0.024649305269122124,
        0.024212302640080452,
        -0.08108222484588623,
        0.010600926354527473,
        -0.08311593532562256,
        0.03415115922689438,
        0.01613134890794754,
        -0.02005300484597683,
        -0.023637309670448303,
        0.0579814612865448,
        0.015539675019681454,
        0.0020724141504615545,
        -0.07728227227926254,
        -0.03007311373949051,
        0.04092039167881012,
        -0.025246035307645798,
        0.05327460169792175,
        -0.06102801114320755,
        0.004877780098468065,
        -0.09239912778139114,
        0.07891705632209778,
        -0.03130452707409859,
        0.059704460203647614,
        0.06805646419525146,
        0.012350873090326786,
        -0.08684027940034866,
        -0.06260467320680618,
        0.03442433103919029,
        -0.021926723420619965,
        -0.008461475372314453,
        -0.028476480394601822,
        0.06099225580692291,
        -0.005921077914535999,
        0.07784128934144974,
        0.004309401381760836,
        -0.039371222257614136,
        0.013831145130097866,
        0.008173570036888123,
        -0.061204470694065094,
        0.045031994581222534,
        0.05366120859980583,
        0.003932127263396978,
        0.012333142571151257,
        0.0011355457827448845,
        -0.04168416187167168,
        -0.00678118783980608,
        0.014659379608929157,
        -0.045428454875946045,
        -0.04811875894665718,
        0.0008460363023914397,
        -0.04930541664361954,
        0.008735344745218754,
        -0.028178749606013298,
        0.032804399728775024,
        -0.0019496975000947714,
        0.006123868748545647,
        0.00721028633415699,
        -3.247835422682301e-33,
        -0.02708970382809639,
        0.09933431446552277,
        -0.06552879512310028,
        0.007451770361512899,
        0.041166432201862335,
        0.0016979880165308714,
        0.10464804619550705,
        0.08360731601715088,
        -0.016181256622076035,
        -0.04779449477791786,
        -0.029893510043621063,
        0.06052173301577568,
        -0.06557444483041763,
        -0.005731653422117233,
        -0.042282454669475555,
        -0.00419603381305933,
        0.0918881893157959,
        -0.07908189296722412,
        0.033889468759298325,
        0.026732418686151505,
        0.05181054770946503,
        0.0017089988104999065,
        -0.04121880605816841,
        -0.009189214557409286,
        0.004930077586323023,
        -0.019802331924438477,
        0.07337349653244019,
        0.0371522530913353,
        0.005626027937978506,
        -0.01919480785727501,
        -0.044108979403972626,
        -0.008165378123521805,
        -0.022983867675065994,
        0.02133910357952118,
        0.030731434002518654,
        0.09312719106674194,
        0.0718950480222702,
        -0.0007755605620332062,
        -0.049410637468099594,
        -0.07682370394468307,
        0.020233966410160065,
        0.06937620043754578,
        0.030373504385352135,
        0.010474605485796928,
        -0.009494652040302753,
        0.005593884736299515,
        -0.05273009464144707,
        0.07353479415178299,
        0.011818335391581059,
        -0.0017677844734862447,
        0.030137227848172188,
        -0.04951025918126106,
        0.019671080633997917,
        -0.044185832142829895,
        -0.029646746814250946,
        -0.04911937192082405,
        -0.0225210003554821,
        0.04422543942928314,
        -0.005041510798037052,
        0.024021701887249947,
        0.05175287276506424,
        -0.007292531430721283,
        -0.007000663783401251,
        -0.09718232601881027,
        -0.005677828565239906,
        0.024193063378334045,
        0.0743955746293068,
        0.053670916706323624,
        0.04137500002980232,
        0.035968393087387085,
        0.06926557421684265,
        0.013842434622347355,
        -0.024475926533341408,
        -0.06709256768226624,
        -0.0076415869407355785,
        0.044931765645742416,
        -0.024905266240239143,
        -0.06937270611524582,
        -0.05202009901404381,
        0.03388845920562744,
        -0.00910893827676773,
        0.013769811019301414,
        0.08612386882305145,
        0.015995267778635025,
        0.11013288050889969,
        0.09799445420503616,
        -0.0541473850607872,
        -0.002956793177872896,
        -0.04558929428458214,
        0.07932185381650925,
        -0.05879085883498192,
        0.08778493106365204,
        -0.08447050303220749,
        0.07638651132583618,
        0.0602010115981102,
        -5.493470922601773e-08,
        0.0030335015617311,
        -0.11563494801521301,
        0.021535586565732956,
        -0.045790109783411026,
        0.08719278872013092,
        -0.0954718068242073,
        0.0804077684879303,
        -0.03546273708343506,
        0.003929486498236656,
        -0.03180994838476181,
        0.036824923008680344,
        -0.1309678852558136,
        0.016354158520698547,
        0.03237339109182358,
        0.10223332047462463,
        0.03634549304842949,
        -0.08177415281534195,
        0.013910622335970402,
        -0.06631512194871902,
        -0.0609777569770813,
        -0.009056839160621166,
        0.0946376696228981,
        0.09507609158754349,
        -0.039919428527355194,
        0.006654033437371254,
        -0.003793701296672225,
        0.010476549156010151,
        0.0015285274712368846,
        -0.018071437254548073,
        -0.036244094371795654,
        -0.026085522025823593,
        -0.014819733798503876,
        -0.022941067814826965,
        -0.003102452028542757,
        0.049005839973688126,
        -0.10773473978042603,
        -0.07533901184797287,
        0.038745541125535965,
        0.008749060332775116,
        0.027865808457136154,
        -0.013450858183205128,
        -0.06996241211891174,
        0.013364196754992008,
        0.06848851591348648,
        0.05275283753871918,
        -0.04346313327550888,
        0.052835747599601746,
        -0.11765238642692566,
        -0.0017271265387535095,
        -0.011279191821813583,
        0.07817401736974716,
        -0.015810547396540642,
        0.020854081958532333,
        0.04899575933814049,
        0.024711761623620987,
        0.02715354599058628,
        0.04734007269144058,
        0.019169172272086143,
        -0.0013799249427393079,
        0.08992519974708557,
        0.008750567212700844,
        -0.02206665277481079,
        0.07482204586267471,
        0.07006025314331055
    ]
}