{
    "id": "EI9dmj6eiVQ",
    "title": "Review: Moto Z Play + Hasselblad Moto Mod",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-08-31T18:31:06Z",
    "video_url": "https://www.youtube.com/watch?v=EI9dmj6eiVQ",
    "category": "People & Blogs",
    "tags": [
        "moto z play review",
        "true zoom review",
        "moto z play droid edition review",
        "hasselblad moto mod",
        "moto mod review",
        "moto z review",
        "moto z play"
    ],
    "views": 2659094,
    "likes": 16513,
    "comments_count": 924,
    "description": "Whatever your thoughts on the Moto Z and its line of Moto Mods, it's an interesting take on the smartphone  and Lenovo just made things even more interesting with the Moto Z Play and Hasselblad True Zoom. A more affordable Moto Z paired with an accessory from one of photography's biggest brands sounds like a win-win ... so, is it? Find out in the Moto Z Play review/Hasselblad True Zoom review from MrMobile!   [SUBSCRIBE]     [ADDITIONAL PRICING INFO]  In the US, the Moto Z Play will be available on Motorola.com and Verizon as the \"Moto Z Play Droid Edition\" for $408 ($17/month) starting on September 8.   From Lenovo:  \"The Hasselblad True Zoom will be available in the U.S. for pre-order starting September 8 and available beginning September 15 at Verizon.com and Verizon stores for $249.99 and on Motorola.com for $299. For a limited time, when you buy a Moto Mod, Verizon is offering 50% off another Mod. Discount applies to equal or lower-priced Mod.   \"Moto Z and Moto Z Play will be available in the US in GSM unlocked versions, with pre-sales beginning on September 15 and availability beginning in October. Moto Z will be available unlocked for $699.99 and Moto Z Play will be available unlocked for $449.99.\"   [ABOUT THIS VIDEO]  The Moto Z Play review / Hasselblad True Zoom review was published after six days with Moto Z Play and True Zoom demo units on loan from Lenovo. The Moto Z Play Droid Edition shown above is a Verizon Wireless exclusive in the United States. It spent the entire review period paired with a Moto 360v2.   [MUSIC]  \"The Ballad of MrMobile\" Mobile Nations, 2016  \"Beach\" by JAM Studio, available at Premium Beat:     [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://www.premiumbeat.com/royalty_free_music/songs/beach",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] If you're a fan of unconventional gadgets, then you already know about the Moto Z line from Lenovo, the super slim smartphones that sprout more features as quickly as you can say Moto Mod. The thing is, those phones are pretty expensive and they don't have the best cameras. The solution, a less expensive Moto Z and a brand new Moto Mod. I'm Michael Fisher, and this is the Mr. Mobile review of the Moto Z Play and the True Zoom Moto Mod from Hasselblad. (electronic music) The phone is easier to encapsulate, so let's hit it first. In short, thicken up a Moto Z, swap out the metal back for a glass one, and take all the specs down a notch. Now, that's par for the course when you make a mid-tier version of a flagship phone, but here's the twist. In everyday use, I could almost never tell I was using a mid-range device. While Lenovo may have hobbled some of the hardware, it left the features almost completely intact. Nearly the entire Moto suite has been left alone and the day-to-day responsiveness is just as zippy as the Z and Z Force. It sounds bogus, I know, but if there was ever a product that proves the folly of focusing too closely on specs, this is it. In fact, some of those spec sacrifices make for a better smartphone. That Snapdragon 625 is less powerful than the 820 in the Moto Z, but Qualcomm specifically calls out how power efficient it is, and this is one time that the reality absolutely matches the marketing. I can't get any current Android phone to last me more than a day, and some, like the original Moto Z, don't always get me that far. Now, the Z Play, with that huge battery working together with the power-saving processor usually has about half a charge left when I go to bed. For me, that kind of endurance is totally worth the hit in processing power, especially since I can't even notice a difference in performance. I should mention though that the lower amount of RAM does make shuffling apps a bit more pokey. Also, the screen res takes a downgrade; it's only full HD. On the flip side, the glass back on the plate is very soft. It's much more prone to scratches than the metal panel of the Z and weirdly, the style shells don't seem to fit as snugly either. Other mods lock on just fine though. As Lenovo promised, everything is interchangeable across the Z line. I've used the Tumi battery pack and JBL Sound Dock on the Play, and they work just as well as they do on the other Zs. Let's get to the newest of the mods, Hasselblad is a Swedish company that's been in the camera business long enough to have literally put cameras on the moon, and it pays homage to its 75th anniversary with a little Easter egg on the face of this, its first ever smartphone accessory. This is the True Zoom. You slap it on the back of a Moto Z and instantly, it looks more like a classic camera than any smartphone you've seen before. More importantly, it feels like one. You've got a big grip on the right side, stippled for traction and topped by a two-stage shutter button. Push the power key alongside and you see why it's called the True Zoom. The motor driven lens assembly is capable of 10X optical magnification, which you can control by the telephoto toggle under the shutter release. The Moto Viewfinder is almost completely unchanged, so there's basically no learning curve, and you can still launch the camera with Moto's quick gesture. There are a few custom modes thrown in for sports and night shooting, as well as the capability to record stills in raw format. And if you wanna use the True Zoom with another app like Snapchat or Instagram, that's no problem. Once again, Moto has completely delivered in terms of delivering a Mod with the stock smartphone experience. And maybe it's no surprise that the biggest advantage to the True Zoom is zooming. 10X is a crazy amount of magnification compared to the crappy digital cropping of the Z Play's regular camera, and the stabilization makes it possible to get a clear photo even at full mag in low light, though it does take a steady hand. You've got a xenon flash here if you want it and dual microphones for clearer audio recording when you switch to video mode. Oh, a note on that, while the phone can shoot in 4K, you'll be confined to HD when using the True Zoom. I took a bunch of shots with the Z Play's onboard camera followed immediately by the True Zoom. Having this kind of range in your pocket is really fun, and it's a very comfortable camera to shoot with too. But is it something I'd buy myself? Honestly, probably not. I tend to find the Z Play's onboard camera perfectly serviceable for everyday use because like most people, I'm throwing filters on my photos and uploading them through Facebook and Instagram's compression anyway. Also, the True Zoom is slow. First, you need to attach it. Then you wait for the optics to unfold, and then you wait for it to focus, which can take a very long time. Now, I used the True Zoom on pre-release software so it's likely some of this will get better as Lenovo pushes out updates. I did receive one about halfway through the review period but it didn't seem to make much difference. And the True Zoom suffers from the same convenience issues a lot of Moto Mods do. It's too cumbersome to leave on there all the time so you need to carry it separately, and so now, you're devoting two pockets to your phone instead of just one. Now, if you're the kind of person who carries a point and shoot camera anyway, you're already used to that. Maybe in that case, the True Zoom makes sense. It's really the only way I can see to justify the suggested retail price. Check the description for that, as it wasn't finalized by press time. And as a final quibble, I wish Hasselblad would have thrown in some extra storage or at least a small battery, like some other Moto Mods do. The upshot, while I think the True Zoom will appeal to the niche photographer, and I'm happy to see the Moto Mod ecosystem get something so cool, I don't see it as a must have. Maybe my opinion will change over time as software updates come in to clean up some of the rough edges. On the other side of the coin, the Moto Z Play itself is rock solid. In fact, if this one were the unlocked version, I would have taken it with me to Berlin this year to serve as my trade show sidekick for IFA, which is no small endorsement. It cuts corners where it needs to and it's certainly not the phone for the spec freak, but if you're budget sits around $400, I'd give it serious consideration. I say that despite the $400 tier being one of the most competitive segments this year. The Z Play has no trouble keeping up. Again, check the description for the suggested retail price, and for now, it is a Verizon Wireless exclusive in the States, but you can expect its unlocked counterpart to launch later this year. I mentioned IFA 2016 before, folks. Subscribe so you don't miss more Mr. Mobile videos out of one of the biggest tech shows of the year. Until next time, thanks for watching and stay mobile, my friends.",
    "transcript_keywords": [
        "True Zoom",
        "True Zoom Moto",
        "Zoom Moto Mod",
        "Moto Mod",
        "Moto",
        "Moto Mods",
        "True",
        "True Zoom makes",
        "Zoom",
        "Zoom Moto",
        "Play",
        "super slim smartphones",
        "Moto Mod ecosystem",
        "True Zoom suffers",
        "Play onboard camera",
        "Moto Z Play",
        "Mod",
        "camera",
        "unconventional gadgets",
        "expensive Moto"
    ],
    "transcript_entity_values": [
        "Lenovo",
        "the True Zoom",
        "First",
        "Instagram",
        "more than a day",
        "Qualcomm",
        "JBL Sound Dock",
        "Berlin",
        "400",
        "States",
        "2016",
        "Moto Z Play",
        "Snapchat",
        "the year",
        "Facebook",
        "Swedish",
        "Moto",
        "everyday",
        "the True Zoom",
        "around $400",
        "Mobile",
        "the True Zoom",
        "this year",
        "The Z Play",
        "Verizon Wireless",
        "the True Zoom Moto Mod",
        "Moto Z",
        "75th",
        "RAM",
        "first",
        "Tumi",
        "Moto Mod",
        "Michael",
        "IFA",
        "two",
        "4",
        "Moto Mods",
        "The Moto Viewfinder",
        "the Z Play",
        "820",
        "later this year",
        "Hasselblad",
        "about half",
        "Michael Fisher",
        "one",
        "Android",
        "the Z Play's"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "GPE",
        "MONEY",
        "GPE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "NORP",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "PERSON",
        "LOC",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT"
    ],
    "vector": [
        -0.12086579203605652,
        0.020909380167722702,
        0.02500326931476593,
        -0.05272386968135834,
        0.014514871872961521,
        -0.027042558416724205,
        0.04931502416729927,
        0.0954100713133812,
        -0.04188466817140579,
        0.04409665986895561,
        0.0009216692997142673,
        0.08194302022457123,
        0.028175249695777893,
        0.037312064319849014,
        0.05009713023900986,
        0.027431417256593704,
        0.11310526728630066,
        -0.008620359003543854,
        0.013558751903474331,
        0.03865497559309006,
        0.0012084395857527852,
        -0.022069746628403664,
        0.05444937199354172,
        0.017398720607161522,
        0.06068844720721245,
        -0.03823385760188103,
        -0.02992108277976513,
        0.017793018370866776,
        -0.022379495203495026,
        -0.015261933207511902,
        -0.03977034240961075,
        0.14390665292739868,
        0.041063226759433746,
        0.011653760448098183,
        -0.025488443672657013,
        -0.15235048532485962,
        0.05818894878029823,
        0.010068938136100769,
        -0.11097396165132523,
        -0.09753208607435226,
        -0.021398600190877914,
        0.02227589674293995,
        -0.008467248640954494,
        0.042895860970020294,
        -0.011936255730688572,
        -0.02540724165737629,
        0.05189984291791916,
        0.04186050593852997,
        0.010271744802594185,
        0.0651194378733635,
        -0.0618024542927742,
        -0.0890059843659401,
        -0.02050255425274372,
        -0.019117893651127815,
        -0.06406735628843307,
        0.09144958853721619,
        -0.0186036117374897,
        0.036552950739860535,
        0.023388342931866646,
        0.035143546760082245,
        -0.035556428134441376,
        -0.056224312633275986,
        -0.051466431468725204,
        0.06583014130592346,
        -0.0010805482743307948,
        -0.04766128584742546,
        0.01807229593396187,
        -0.10540491342544556,
        -0.05692541226744652,
        -0.08332767337560654,
        -0.02478591352701187,
        0.008611097931861877,
        0.09983529150485992,
        -0.012788726016879082,
        -0.13542728126049042,
        0.042805831879377365,
        0.12677450478076935,
        -0.0337144210934639,
        -0.013277627527713776,
        0.006841601803898811,
        0.030891336500644684,
        -0.026807250455021858,
        -0.03135743364691734,
        -0.029567424207925797,
        0.07853430509567261,
        0.00833206344395876,
        -0.05257163196802139,
        0.004589621908962727,
        -0.004015306476503611,
        -0.004939907230436802,
        -0.03450825437903404,
        0.09979484230279922,
        -0.09119487553834915,
        0.03996250033378601,
        -0.08670688420534134,
        0.027372820302844048,
        0.02394796349108219,
        -0.025375206023454666,
        0.005471748299896717,
        0.05531982332468033,
        0.051187582314014435,
        0.004855036269873381,
        0.08020222932100296,
        -0.03710076957941055,
        0.08390657603740692,
        -0.001989681739360094,
        0.03826509416103363,
        0.013719083741307259,
        -0.05821869894862175,
        0.067540742456913,
        -0.07802378386259079,
        -0.011630957946181297,
        0.019193243235349655,
        -0.030591314658522606,
        -0.0363517589867115,
        -0.030722742900252342,
        0.0005243715713731945,
        0.057696565985679626,
        0.12530438601970673,
        -0.03797692060470581,
        -0.07365988940000534,
        0.01093781366944313,
        -0.011637813411653042,
        -0.08192628622055054,
        0.011008727364242077,
        0.00920099951326847,
        -0.039376288652420044,
        5.614542687849278e-33,
        -0.017310481518507004,
        0.06820520013570786,
        -0.03837507963180542,
        0.015754256397485733,
        -0.05289851874113083,
        0.09587978571653366,
        0.032203685492277145,
        0.04477320984005928,
        -0.11048371344804764,
        -0.001245748484507203,
        -0.09177899360656738,
        -0.04313069209456444,
        -0.007121671922504902,
        -0.005558410193771124,
        0.04284590855240822,
        -0.09920720756053925,
        -0.03083469718694687,
        -0.03699231147766113,
        0.003471828531473875,
        0.003205070272088051,
        0.018893102183938026,
        -0.056749630719423294,
        -0.07592051476240158,
        -0.0067627220414578915,
        -0.054059356451034546,
        0.07535237818956375,
        0.04051000252366066,
        -0.048432789742946625,
        0.050195928663015366,
        0.030815280973911285,
        -0.0644465833902359,
        -0.008695236407220364,
        -0.02279093489050865,
        -0.04253873601555824,
        0.02336619794368744,
        0.057226940989494324,
        -0.05444130301475525,
        -0.09862703084945679,
        0.00233715632930398,
        -0.08755189180374146,
        -0.08592057228088379,
        -0.002963933628052473,
        -0.17172856628894806,
        -0.029094921424984932,
        0.00013121608935762197,
        -0.026104440912604332,
        -0.0008014427730813622,
        0.09931804984807968,
        0.034202538430690765,
        -0.034568168222904205,
        -0.02089354582130909,
        -0.04932857304811478,
        -0.04007700830698013,
        -0.003487313399091363,
        -0.0860394835472107,
        -0.03162732347846031,
        0.010748500004410744,
        0.006258118432015181,
        0.06557738780975342,
        -0.007479922380298376,
        -0.0004973168252035975,
        -0.021514451131224632,
        -0.06731786578893661,
        0.019328512251377106,
        -0.02821343205869198,
        0.0065556736662983894,
        -0.0077738375402987,
        -0.06654177606105804,
        -0.026809362694621086,
        0.037629254162311554,
        0.08241667598485947,
        -0.019014129415154457,
        0.07217353582382202,
        -0.010471218265593052,
        0.016503745689988136,
        -0.038197509944438934,
        0.023531528189778328,
        -0.0019688992761075497,
        0.10281115025281906,
        0.05523211508989334,
        -0.011228257790207863,
        0.03291156888008118,
        0.0402410626411438,
        0.03480328246951103,
        0.06019880250096321,
        0.009688409976661205,
        -0.039388880133628845,
        -0.029513906687498093,
        -0.004857159685343504,
        0.009332598187029362,
        -0.02994537726044655,
        -0.07220805436372757,
        -0.015634696930646896,
        -0.01014860812574625,
        0.07146348804235458,
        -4.333884204298613e-33,
        -0.034388113766908646,
        0.021887565031647682,
        0.04050018638372421,
        0.03873148187994957,
        0.07795565575361252,
        -0.047933004796504974,
        -0.030864516273140907,
        0.05212416872382164,
        0.007983091287314892,
        -0.11322447657585144,
        -0.023761572316288948,
        -0.020328275859355927,
        0.0659627616405487,
        0.02929353527724743,
        0.003166054142639041,
        -0.023711420595645905,
        -0.0669664517045021,
        -0.10222169011831284,
        0.1488499641418457,
        0.02326664701104164,
        -0.0153657803311944,
        -0.018668130040168762,
        0.016665304079651833,
        0.029726659879088402,
        0.0005502112908288836,
        -0.05043540894985199,
        -0.02159462682902813,
        0.026633616536855698,
        -0.01076339092105627,
        0.035149529576301575,
        0.028239546343684196,
        -0.038341421633958817,
        -0.04065742343664169,
        0.010122450068593025,
        0.05844101682305336,
        0.03655308485031128,
        -0.057996343821287155,
        0.005107271485030651,
        0.05304407328367233,
        0.0190734900534153,
        -0.00657268101349473,
        -0.030731966719031334,
        0.040401045233011246,
        -0.004299391992390156,
        0.062481291592121124,
        -0.012745430693030357,
        -0.024379344657063484,
        -0.061731308698654175,
        0.05114506930112839,
        0.03051465004682541,
        0.0033347150310873985,
        0.07518607378005981,
        -0.04530668631196022,
        0.010679702274501324,
        -0.047440771013498306,
        0.0005940819391980767,
        -0.006527014076709747,
        -0.03864104673266411,
        -0.017387250438332558,
        0.03644965961575508,
        0.08467832207679749,
        0.028384923934936523,
        -0.0835016593337059,
        0.031457480043172836,
        -0.0104381013661623,
        0.08908656984567642,
        0.08709707856178284,
        0.03819706663489342,
        0.0017674347618594766,
        -0.011542071588337421,
        -0.055000096559524536,
        -0.02670176327228546,
        0.017130190506577492,
        -0.0728982612490654,
        -0.011549222283065319,
        0.06458868831396103,
        -0.004133538343012333,
        0.08570218831300735,
        0.05558854341506958,
        -0.006654872093349695,
        0.10373548418283463,
        0.031505703926086426,
        0.06518660485744476,
        0.04641617462038994,
        0.022794025018811226,
        -0.021439556032419205,
        -0.010335656814277172,
        0.012202123180031776,
        -0.07963015884160995,
        0.06036163866519928,
        -0.06262364983558655,
        0.02303805947303772,
        -0.025137288495898247,
        0.04219473898410797,
        0.05558410659432411,
        -4.354546589979691e-08,
        0.04571954905986786,
        0.01098235510289669,
        0.013525214046239853,
        -0.010503975674510002,
        0.06816011667251587,
        -0.0064756725914776325,
        -0.03787578269839287,
        -0.03677269443869591,
        0.05683540925383568,
        0.04451769217848778,
        0.016674354672431946,
        -0.07733748108148575,
        -0.0633174404501915,
        0.039951857179403305,
        -0.006033732555806637,
        0.07271446287631989,
        0.0023316622246056795,
        0.024365907534956932,
        0.006843183655291796,
        0.07536610960960388,
        0.02187063731253147,
        0.057952091097831726,
        0.03785160928964615,
        0.02666863240301609,
        0.03272472321987152,
        0.06102841719985008,
        -0.12176325172185898,
        -0.015943080186843872,
        0.09612689912319183,
        -0.0041474346071481705,
        -0.012588411569595337,
        0.013336959294974804,
        0.05335857719182968,
        -0.028038449585437775,
        -0.0332639180123806,
        -0.04448409005999565,
        -0.09631457179784775,
        -0.03002750128507614,
        0.02246069349348545,
        0.010836710222065449,
        0.07111416012048721,
        -0.05043615773320198,
        0.03903490677475929,
        0.0014936687657609582,
        -0.022046584635972977,
        -0.021647607907652855,
        -0.05456745997071266,
        -0.11254400759935379,
        -0.027333250269293785,
        0.05571398138999939,
        -0.040986157953739166,
        -0.002900060499086976,
        -0.043707720935344696,
        -0.02365821599960327,
        0.07802009582519531,
        0.011726412922143936,
        0.061010584235191345,
        0.019585223868489265,
        0.004932883661240339,
        0.05708251893520355,
        -0.012414033524692059,
        -0.06113828718662262,
        -0.035480767488479614,
        0.03949781507253647
    ]
}