{
    "id": "ek9bmIlDens",
    "title": "Samsung Galaxy Z Fold 3 Impressions: 3 New Features!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2021-08-11T14:00:57Z",
    "video_url": "https://www.youtube.com/watch?v=ek9bmIlDens",
    "category": "Science & Technology",
    "tags": [
        "Galaxy Fold",
        "Gold 3",
        "Z Fold 3",
        "Galaxy Fold 3",
        "Fold 3 impressions",
        "MKBHD",
        "Galaxy fold impressions",
        "review",
        "Galaxy Fold review",
        "Samsung Fold review",
        "Samsung fold"
    ],
    "views": 3228573,
    "likes": 110145,
    "comments_count": 6798,
    "description": "Z Fold 3 adds S-Pen support, 120Hz cover display and a hidden under-display selfie camera   Z Flip 3 Impressions:   First-gen hidden selfie camera:   MKBHD Merch:   Tech I'm using right now:   Intro Track: Jordyn Edmonds  Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "https://youtu.be/SvMhWghZ_EE",
        "https://youtu.be/MXtbeSbf_xM",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://smarturl.it/jordynedmonds",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - Hey, what's up? MKBHD here. And I think it's safe to say we're about to be right back in the thick of it. Smartphone season is about to be upon us. And what better way to kick that off then with a folding phone? Well, it's a pair of folding phones, actually. We have this new Samsung Galaxy Z Fold 3 that I have a lot of thoughts about that I was really curious about after such a big improvement from the last Fold. But also, there's a new Z Flip announced alongside it that I also got to play with. And honestly, if I'm only able to recommend one of these to a regular person, it's probably the Flip and its much more pocketable design and really nice refinement with the outside cover screen. So check out that video. It's gonna drop at the same time as this one. I'll link it below the like button. But this is the one I'm more into. So this is the one I'm more likely to use. It's the Z Fold 3. And holding it for the first time, it does look and feel very similar to the Fold 2. We've seen this look before, but there's some pretty noteworthy improvements here with a bunch of small changes that kind of add up to being worth a new generation. So you've probably already seen the new camera bump. It's smaller than that huge square from last time. And we'll get to those cameras in a second, but everything, everything is just a little tighter and a little more well put together here. New Gorilla Glass Victus on the front. The whole phone is about two millimeters thinner, and it's slightly lighter than last year as well. And the hinge, the most important part, is even more tucked into the side of the phone. It doesn't stick out as much. So the whole phone, along with the weight of the hinge, has this feeling of being very firmly well put together. And it's just very satisfying feeling. It's so well put together, in fact, that it's actually, I was surprised to learn, it has an IPX8 water resistance rating, which is pretty intense. That means it can survive water from all directions and can actually be immersed in water, which I already know means someone's gonna do an underwater test with it and I'll probably watch. But that's a pretty big step for a folding phone, isn't it? Now, importantly, that's IPX8, not IP68. So the X means it wasn't tested for like fine, granular particles, solid particles. So it's not dust resistant. And that actually makes a lot of sense. That's been the nemesis of these hinges, just little tiny grains, little particles getting into the hinge and eventually ending up under the screen. But the fact that it's so watertight that they can actually certify it for water resistance is pretty impressive to me. I'm pretty sure that's the first folding phone that we've seen, the first new folding screen type phone that's water resistant. Then another great touch is the cover screen that's on the outside, which is almost exactly the same size and resolution, is now 120 hertz also to match the inside screen that I love. Last year on the Fold 2 I never really got over the fact that the 60 hertz outside screen felt worse than the 120 hertz inside screen. It made me want to use it less. But now it just kind of feels like a really tall, candy bar-shaped, normal phone with high refresh rate and everything. But let's talk about that big inside screen, shall we? Because this is where we have the most changes. Same size, same bezels and 120 hertz refresh rate, same dust caps at the top of the bottom. But, you notice anything missing from the inside screen? See, last year there was a hole-punch camera at the top in the middle of the right-hand side. And if you're looking up there, yeah, this year, that selfie camera has moved to behind the display. Oh yeah. So Fold 3 has an under-display selfie camera inside of a folding display. So I've made an entire video just all about this camera behind the display tech. Boom. I'll also link it below the like button if you wanna watch that video. But if you do check it out, it is a really curious new technology. It's a first-generation thing, and it definitely has some quirks and some weird things about it, which is why I was kind of surprised actually to see it in, you know, such a premium, high-end, expensive Samsung device, but it's here. Like it's definitely not invisible by any means. You can clearly see it whenever you look for it, and it exhibits this pixelation through the gaps in the pixels that I talked about in that full video. It's got like this octagon shape of pixels. And everything that passes through that octagon gets really pixelated, especially when it's bright colors and whites, and especially when it's off axis. And most interesting of all, the actual quality of these other first-generation selfie cameras I looked at are not great. It would look really hazy in the viewfinder. And then once you snap the photo, it literally runs a defogging algorithm to sharpen up and clean up the picture. And I could actually see that same thing happening here. When I took selfies on the Fold 3, it's a little hazy in the viewfinder, but then you snap the picture and then you look at the picture fast enough, you can literally see that processing snap the contrast in, get rid of that haze. But it's still not that great of a picture. So this, it's interesting that it is... I mean, I'm excited to get my hands on this phone longer-term for the full review, but also to see what kind of photo quality and video quality that this actually produces to see how much worse it actually is than the a hole-punch camera that came before it. But yeah, I think if you asked Samsung why they did this, I think their logic would be that this is the least important or least used selfie camera on the Fold. Like you already have on the new Fold, you'll have a selfie hole-punch camera on the cover display. And then if you really want a high-quality selfie, well, you can open it up and point those cameras at yourself and use the viewfinder as a nice selfie shot. So this inside selfie camera, it's not really used all that much. Maybe for video calls sometimes. They're just a very quick, convenient thing. So they figured this was Samsung's place to take a little bit of a risk with some bleeding edge tech to give us the full, corner-to-corner, expansive inside screen we've wanted since the beginning. Sure, you can still see the camera sometimes, and it's not perfect, but hey, it is better technically than a hole punch. But my favorite inside screen improvement here is that the foldable glass protective film is 80% more durable against scratch resistance, meaning they've finally made the Fold S Pen-compatible. Now, this is all great and we love the headlines. Obviously this is very exciting for people who wanted the bigger canvas for the note-taking and all that, but this definitely comes with an asterisk that I think we should consider, okay? Not to pour water on this fire or whatever, but think about it. Yes, the Fold is gonna be clearly great for note-taking, sketching. Maybe it's just straight up just as good as the Note at everything it did. It's got all the same S Pen features and it's a super responsive 120 hertz panel. All that is great. But this is like a special case of an S Pen for this phone, okay? First of all, you need literally a special S Pen. It's a new one called the \"S Pen Fold Edition.\" And it looks like a normal S Pen, but it has a softer, retractable tip, so you can't apply too much pressure that could still damage the screen. And it's, of course, still an optional accessory. So you also need to buy an optional case to carry it around with the Fold, unless you wanna have them both loose in your pocket. And other styluses generally aren't going to work. I mean, there are some big, soft-tip styluses if you just wanna replace your finger as an input device, but most pens for writing and sketching and all that good stuff are not soft-tipped. They're not retractable-tipped. So I even got a warning on the screen that says, \"Only use S Pens designed for your Galaxy Fold. Other S Pens,\" or other styluses, for that matter, \"may damage the screen.\" Which brings me to the only other option for this phone, which is a brand new, much bigger S Pen Pro that has to be set to Z Fold mode, which is literally a physical switch on top of the pen that makes the tip attract more easily and with less pressure. But that's it. Now, the S Pen Pro, it actually is pretty cool. And unlike the Fold Edition, it is active, it's got a battery, it charges via USB type C, but it also has onboard memory. So you can copy and paste stuff between different Samsung devices, like if you have a Samsung tablet or a laptop. That sounds super cool, but this is all specialized workarounds to loop in the Galaxy Fold into the S Pen world. So at the end of the day, if you've gotta go the extra mile to buy the S Pen and buy the case to carry it around in, well, then you can do all that and you can bring the S Pen into your life. But I guess what I'm trying to say is I think Samsung should keep around the Galaxy Note. Fold has a new set of triple cameras. Like I mentioned, an ultrawide, a standard, and a 2x telephoto and a flash, right in line with the tamed-down stuff we usually see here in the Fold. And I think they'll probably hold up in the full review, but we'll see. And there's a bunch of pretty sweet new software features that make this phone even more of a multitasking monster. I already always felt like super productive anytime I use the Fold, and now there's a new Labs section in the settings where you can like force every app to work in multitasking for custom aspect ratios. And my favorite tweak, those slide over apps from the side, you can now permanently pin over to the right-hand side of the phone like a dock. Like just straight up like a dock like a desktop operating system. And so then your shortcuts just live over there all the time. Kind of like the dock in macOS X or in Windows, it can shuffle around your most recent apps. It's really useful for copying and pasting between apps or moving back and forth between things. Hop in your app drawer anytime from over there. Unpin it anytime you want to. Very nice. Very nice. Wow, I just realized that I haven't told you guys the specs yet. Snapdragon 888 and 12 gigs of RAM in every module starts at 256 gigs. There's also a half terabyte version. And 4,400 milliamp hour battery, which is technically a little smaller than last year's 4,500, but the phone is just a little bit more compact, little thinner. And then three colors. There's the silver you just saw most of my hands-on time with, but there's also a black and a phantom green. And that is a nice green. I'm kind of into that more than I expected to be. But yeah, would you, this is my question to you, just from the first impressions, now that you've seen it's official, would you pick up this phone for $1,800? 'Cause that's how much it's gonna cost. It's a little less than before, but that's the starting price for the 256 gig Z Fold Three. And like I said, I still think, among these two new folding phones they've announced, the Flip, which starts at 999, still expensive, but that's like more of a reasonable phone to recommend to more people I think. So if you wanna check over on that video for my thoughts on it, definitely do that. But I'm curious if you guys would be into 1,800 bucks for the newest, highest end, most premium, well-built folding phone I've ever seen. Super interested. Either way, thanks for watching, subscribe if you haven't already, and I'll catch you guys in the next one. Peace. (funky electronic music)",
    "transcript_keywords": [
        "Fold",
        "phone",
        "Pen",
        "Pen Fold Edition",
        "screen",
        "inside screen",
        "Galaxy Fold",
        "camera",
        "folding phone",
        "Pen Fold",
        "Samsung",
        "Fold Edition",
        "selfie camera",
        "folding",
        "selfie",
        "inside",
        "Pen Pro",
        "pretty",
        "video",
        "pens"
    ],
    "transcript_entity_values": [
        "Z Fold",
        "three",
        "999",
        "the S Pen Pro",
        "1,800",
        "one",
        "4,500",
        "Unpin",
        "the Galaxy Note",
        "the \"S Pen Fold Edition",
        "Windows",
        "about two millimeters",
        "Last year",
        "the Galaxy Fold",
        "Labs",
        "Flip",
        "the S Pen",
        "2x",
        "256",
        "Fold",
        "this year",
        "S Pen Pro",
        "12",
        "an S Pen",
        "4,400 milliamp hour",
        "first",
        "Fold",
        "last year's",
        "Galaxy Fold",
        "First",
        "the S Pen",
        "Samsung Galaxy Z Fold 3",
        "1,800 bucks",
        "120 hertz",
        "S Pen",
        "second",
        "USB",
        "hertz",
        "RAM",
        "the Fold Edition",
        "60",
        "80%",
        "macOS X",
        "two",
        "the end of the day",
        "last year",
        "Samsung",
        "120",
        "Z Fold Three"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "EVENT",
        "WORK_OF_ART",
        "QUANTITY",
        "DATE",
        "FAC",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "FAC",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "WORK_OF_ART",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "EVENT",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERCENT",
        "FAC",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT"
    ],
    "vector": [
        -0.18058282136917114,
        0.027439139783382416,
        0.054397135972976685,
        -0.028168652206659317,
        0.02541622892022133,
        0.0093767661601305,
        0.04253072664141655,
        0.11675963550806046,
        -0.03629201650619507,
        0.007320751901715994,
        0.007188449613749981,
        0.04532995447516441,
        0.008365999907255173,
        0.006738182622939348,
        0.06333416700363159,
        -0.02536427602171898,
        0.028845570981502533,
        -0.04934927821159363,
        -0.04067534953355789,
        0.06385574489831924,
        0.07454823702573776,
        -0.07574385404586792,
        0.055561844259500504,
        -0.04082544520497322,
        0.004633090924471617,
        0.014165202155709267,
        -0.02641148678958416,
        -0.026773272082209587,
        -0.03134104982018471,
        0.016984524205327034,
        0.02987910993397236,
        0.15057410299777985,
        0.054472945630550385,
        -0.026679914444684982,
        0.0012000799179077148,
        -0.0922473669052124,
        0.02128196321427822,
        0.011231363750994205,
        -0.08599318563938141,
        0.00222695036791265,
        -0.032573241740465164,
        0.026843996718525887,
        0.026226457208395004,
        0.00789031945168972,
        0.025783492252230644,
        -0.016532225534319878,
        0.031159915030002594,
        -0.03198826313018799,
        -0.006656575482338667,
        0.0023427936248481274,
        0.07087858766317368,
        -0.02501767687499523,
        -0.017216982319951057,
        -0.013581315986812115,
        -0.052439503371715546,
        0.06581040471792221,
        -0.06773502379655838,
        -0.0022606956772506237,
        -0.0011979916598647833,
        0.02573157288134098,
        0.11231422424316406,
        -0.019355809316039085,
        -0.03788349777460098,
        0.007473619654774666,
        0.06423518061637878,
        0.0021031664218753576,
        0.00018593072309158742,
        -0.08619161695241928,
        -0.011470001190900803,
        0.018513185903429985,
        -0.06599967181682587,
        0.004976129159331322,
        -0.005293422844260931,
        0.00458536995574832,
        0.013455284759402275,
        -0.011119451373815536,
        0.07254190742969513,
        -0.09457709640264511,
        -0.08657873421907425,
        -0.02273314632475376,
        0.0454694963991642,
        -0.03987033665180206,
        -0.02102656289935112,
        0.04123392328619957,
        -0.012590736150741577,
        -0.044729091227054596,
        -0.03521249443292618,
        0.021989615634083748,
        -0.08863715827465057,
        -0.02894813008606434,
        -0.018067168071866035,
        0.06368889659643173,
        -0.037810638546943665,
        -0.027353297919034958,
        -0.04207489639520645,
        0.05790180712938309,
        -0.05422475188970566,
        -0.014021473005414009,
        -0.0005152227822691202,
        0.018444104120135307,
        0.04697290435433388,
        0.05013977736234665,
        0.13063223659992218,
        0.007914992049336433,
        0.048250891268253326,
        -0.053795237094163895,
        -0.00014759443001821637,
        -0.0001462859072489664,
        -0.06178383156657219,
        0.05281830579042435,
        -0.0014312058920040727,
        0.012804394587874413,
        0.007240925449877977,
        -0.009231085889041424,
        -0.054678771644830704,
        0.0397338904440403,
        0.014659387990832329,
        0.07780202478170395,
        0.09559901803731918,
        0.034005988389253616,
        -0.029319806024432182,
        0.019163593649864197,
        0.03589018061757088,
        -0.11649234592914581,
        -0.013294624164700508,
        0.053253449499607086,
        -0.07788196951150894,
        4.637566190335843e-33,
        -0.024293961003422737,
        0.17608653008937836,
        -0.05542552471160889,
        0.021789293736219406,
        0.0031562913209199905,
        0.0037810755893588066,
        -0.01763586886227131,
        0.014006719924509525,
        -0.05536659434437752,
        0.09264008700847626,
        0.006369041278958321,
        0.03231131657958031,
        0.019885318353772163,
        0.0012547593796625733,
        -0.001589515944942832,
        -0.01902240514755249,
        -0.0704900473356247,
        -0.02358812466263771,
        -0.07883983105421066,
        -0.04012220725417137,
        0.03544488549232483,
        -0.02206738293170929,
        0.04273369163274765,
        0.0013389656087383628,
        0.04774655029177666,
        -0.037785064429044724,
        0.09830192476511002,
        -0.05440137907862663,
        0.03938070684671402,
        -0.021899838000535965,
        -0.05606085807085037,
        -0.008821343071758747,
        0.03147022798657417,
        -0.09838787466287613,
        0.026053398847579956,
        0.05134647712111473,
        -0.007695849984884262,
        -0.09307234734296799,
        0.052798859775066376,
        -0.008409780450165272,
        -0.03803269937634468,
        0.0284352358430624,
        -0.054527051746845245,
        0.030708953738212585,
        0.01925492286682129,
        0.04067322984337807,
        0.05910990387201309,
        0.04260340705513954,
        -0.06436333060264587,
        -0.07273634523153305,
        0.03381786495447159,
        -0.04989222064614296,
        -0.0847664549946785,
        -0.0014438320649787784,
        -0.09515650570392609,
        -0.04881061613559723,
        0.03489382565021515,
        -0.017004469409585,
        0.05893230810761452,
        -0.010848961770534515,
        0.04272038862109184,
        0.03663301467895508,
        -0.07599999010562897,
        0.027656106278300285,
        -0.044498372822999954,
        0.0638374388217926,
        0.060395993292331696,
        -0.019532347097992897,
        -0.054968759417533875,
        -0.006987490691244602,
        -0.04363134130835533,
        0.011406089179217815,
        0.0027123834006488323,
        -0.015797482803463936,
        0.05216516926884651,
        0.016075050458312035,
        0.029872367158532143,
        -0.033414047211408615,
        0.040010541677474976,
        -0.03715011104941368,
        -0.011701948009431362,
        -0.02186528407037258,
        0.025910042226314545,
        0.04113110154867172,
        -0.018779300153255463,
        -0.08062554150819778,
        0.004214378073811531,
        -0.06317365169525146,
        -0.028166064992547035,
        0.001612661057151854,
        -0.06329706311225891,
        -0.004454703535884619,
        0.037451039999723434,
        -0.03846936672925949,
        -0.005033675581216812,
        -3.729669455058403e-33,
        -0.00013267513713799417,
        0.004789864644408226,
        -0.002691972069442272,
        -0.05169259384274483,
        0.07421644032001495,
        -0.038904741406440735,
        0.06876315921545029,
        0.033308226615190506,
        -0.055758558213710785,
        -0.07671085745096207,
        -0.005370686296373606,
        0.006982625462114811,
        0.046262338757514954,
        -0.019928790628910065,
        -0.03150434046983719,
        -0.04559307545423508,
        0.01374903880059719,
        -0.06180821731686592,
        0.02490902878344059,
        0.056307289749383926,
        0.04907651245594025,
        0.029759248718619347,
        0.0017407482955604792,
        0.07955866307020187,
        -0.07157379388809204,
        0.026255397126078606,
        0.045176390558481216,
        0.004738754592835903,
        0.06318051367998123,
        0.019437961280345917,
        0.010910414159297943,
        -0.10138661414384842,
        0.03448484465479851,
        -0.01992086134850979,
        0.016974885016679764,
        0.07586726546287537,
        -0.029802018776535988,
        -0.027115019038319588,
        0.005428418517112732,
        0.004926022607833147,
        -0.026910336688160896,
        0.0005743209621869028,
        -0.026301270350813866,
        -0.01973842643201351,
        0.05371035262942314,
        -0.06316841393709183,
        -0.0693117156624794,
        0.042136628180742264,
        -0.026525704190135002,
        -0.04610930383205414,
        -0.03336444869637489,
        0.01145408395677805,
        -0.053461164236068726,
        -0.042396631091833115,
        -0.06284142285585403,
        0.015046901069581509,
        0.011596054770052433,
        -0.06508511304855347,
        0.06559573113918304,
        0.011115476489067078,
        0.06168709695339203,
        0.042995840311050415,
        -0.020088866353034973,
        -0.0905221477150917,
        -0.02390229143202305,
        -0.00347274006344378,
        0.08302831649780273,
        -0.018652400001883507,
        0.0010186698054894805,
        0.010865439660847187,
        -0.05670677497982979,
        0.0017937836237251759,
        0.039539068937301636,
        -0.10954663902521133,
        0.03497162088751793,
        0.09647537767887115,
        -0.027446281164884567,
        0.005400781985372305,
        0.04710331931710243,
        -0.05024527758359909,
        0.0028575847391039133,
        -0.0037578558549284935,
        0.05120037868618965,
        0.05555924400687218,
        0.07551304250955582,
        0.03698558360338211,
        -0.029379157349467278,
        0.028254829347133636,
        -0.011683907359838486,
        0.019987700507044792,
        -0.030272966250777245,
        -0.0009519283776171505,
        -0.002771950326859951,
        0.1170300543308258,
        0.03158232942223549,
        -5.165314220789696e-08,
        0.060144100338220596,
        0.048636481165885925,
        0.06913958489894867,
        -0.0005252390983514488,
        -0.036108747124671936,
        -0.04374001920223236,
        0.008060281164944172,
        -0.09555551409721375,
        0.06141875311732292,
        -0.03478506952524185,
        0.026546252891421318,
        -0.08006072789430618,
        -0.07090181112289429,
        0.07344520092010498,
        0.06049162521958351,
        0.07543613761663437,
        -0.01129804365336895,
        0.07933438569307327,
        -0.03984304890036583,
        0.06679454445838928,
        0.012153597548604012,
        0.02717258781194687,
        0.027146508917212486,
        -0.03181387856602669,
        0.07501514256000519,
        0.019723976030945778,
        -0.05590664595365524,
        -0.020348384976387024,
        0.04486243054270744,
        -0.018771249800920486,
        -0.028182122856378555,
        -0.04242058843374252,
        0.03987601026892662,
        0.05168164521455765,
        -0.03295007720589638,
        -0.0758448913693428,
        -0.048643361777067184,
        -0.06202594190835953,
        0.07734187692403793,
        0.054349299520254135,
        0.0856422558426857,
        -0.00701914681121707,
        -0.04057636484503746,
        0.08169592916965485,
        -0.01956220157444477,
        -0.10977211594581604,
        0.09320680797100067,
        -0.10741975158452988,
        -0.038821253925561905,
        0.058731697499752045,
        -0.06665761023759842,
        -0.1448822319507599,
        -0.043418362736701965,
        0.059882596135139465,
        0.09564773738384247,
        0.07416415214538574,
        0.021998848766088486,
        0.08946602791547775,
        -0.011155755259096622,
        0.056018978357315063,
        -0.04409826174378395,
        -0.10662403702735901,
        -0.09309570491313934,
        0.10739043354988098
    ]
}