{
    "id": "EKLBpOeX97c",
    "title": "E Ink was the next big thing. Is it finally ready?",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-11-14T15:00:09Z",
    "video_url": "https://www.youtube.com/watch?v=EKLBpOeX97c",
    "category": "Science & Technology",
    "tags": [
        "e ink",
        "e ink technology",
        "e ink phone",
        "e ink display",
        "kindle",
        "e ink tablet",
        "e ink tablet review",
        "how e ink works",
        "best e ink tablet",
        "e ink explained",
        "e ink durability test",
        "e ink color",
        "what is e ink",
        "how does e ink work",
        "kindle scribe",
        "e ink technology kindle",
        "best e ink reader",
        "e ink android",
        "tablet",
        "e-ink tablet",
        "e ink explainer",
        "technology",
        "the verge",
        "verge"
    ],
    "views": 406382,
    "likes": 6135,
    "comments_count": 278,
    "description": "E Ink has owned its own little niche in the the e-reader ecosystem for more than fifteen years. Now, thanks to improved capability and reduced cost, the tech is finding its way into monitors, laptops, phones, watches, tablets, and more. So whats next for E Ink? Can it truly compete in all those different device categories? Andshould it? Presented by Meta for Work. #Technology   Read more:   0:00 Introduction 0:32 What is E Ink 1:17 Amazon Kindle breakthrough 2:22 Microscopic E Ink  3:29 Benefits and downsides 4:52 E Ink evolution 5:49 E Beyond the e-reader  The Verges sponsors play an important role in funding our journalism, but do not influence editorial content. For more information about our ethics policy, visit   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "https://bit.ly/3MIVRPg",
        "https://www.theverge.com/ethics-statement.",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "(upbeat music) - E Ink has come a long way. From the earliest e-readers of the aughts, to a huge array of devices in every major category. And soon maybe to cars, dresses, robot pets and more. There's never been a better time to nerd out over E Ink tech. But can it actually replace mainstream displays? And do we even want it to? (bright music) First, a PSA. E Ink is actually the name of the company that originated this tech and remains the dominant player. The generic term for it is electronic paper. It's like a Kleenex versus tissue kinda thing. Anyway, E Ink was born out of the MIT Media Lab, and spun out as a private company in 1997. - We were gonna take over the world. We were gonna do everything all by ourselves. And it was gonna be the biggest company in history. Then the dot-com crash happened and money was a little bit harder. - That's Tim O'Malley. He's responsible for overseeing E Ink's North American business, and has been with the company since 2000. He says that the first 10 years were slow going. E Ink tech first found its way into a Sony e-reader in 2004, but it was 2007 that put them on the map. (heavenly singing) - When the product was launched in the US, Sony and Amazon and Kindle, that sort of had the magic. And the next five years were 300% growth year over year over year. - [Victoria] It's easy to understand why the Kindle took off. Books take up a lot of space in your house. This doesn't. It's cheaper than your phone, and the battery lasts for weeks, maybe even months. And a lot of these benefits have to do with how these displays work. After the break, we go microscopic. - Thanks, Victoria. E Ink has the potential to completely change up how we work from anywhere in the world tomorrow. But Meta for Work is already creating new ways to connect and work today. Mixed and virtual reality helps your workers feel more connected, which in turn fosters better learning and creative experiences. For example, in an immersive environment, an architect can not only walk through a building they designed, but they can also bring colleagues along the way and take feedback, all without ever actually taking a step on site. Now, Meta doesn't influence our editorial videos, but they do help us make important videos like this possible. All right, back to the team. - An E Ink panel basically takes thousands of microcapsules and sticks them into a thin layer. Inside each microcapsule are a bunch of negatively charged white particles and positive black particles, all floating in a clear fluid. You produce an image by applying an electric field to each capsule. A positive electric field will move the black particles to the top of the capsule, the part you see. A negative field will do the opposite. Do that independently to thousands of capsules at once, and you can build whatever image you want on screen. The comparison that lots of folks use is this. A Magna Doodle. And that's apt. You can see the little hexes that contain magnet filings and they get pulled up to the surface when you use the stylus. E Ink screens are just a lot denser. Needless to say, this is a whole lot different from the way a grid of pixels lights up in a traditional display. - So in an electronic paper display, we are physically moving particles up and down. It's not a long distance, but it's physically moving something. And then the trick is when it gets to its destination, we want to be able to unplug the display and effectively keep that image forever. - There are a lot of benefits to this method. For starters, it's not pushing light into your eyes, like other displays. It's actually reflecting the light that's around you. That's part of why E Ink looks so different. It's easier on the eyes and looks good at any angle. And because you only need power to change the display, well, that's why you rarely need to charge a Kindle. But there are trade-offs. Physically moving particles around liquid makes refreshing the screen a slow and strange process compared to LEDs. Contrast was tricky to achieve too. For nice sharp blacks and whites, you need all the particles in these microcapsules to behave, otherwise you get muddy grays. You also need them to be densely packed together, though not too densely. - You can imagine if you filled up your container with a lot of pigment, it wouldn't move, it'd be stuck. It'd be like a rainstick that was completely full. You turn it over, it makes no sound. - So now you can see why E Ink first flourished with e-readers. It's the perfect device for this tech. It's also why you see E Ink in a lot of signage at grocery stores, bus stops, places where you need to consistently update information, but in a power-efficient way that's viewable from multiple angles. That's neat! E Ink's got its little niche. That's that, right? Maybe not. (gentle arpeggio music) Since the mid-aughts, E Ink has been charging ahead with improvements to its signature tech. Just look at how the Kindle alone has changed over 15 years. - The update time is about three to four times faster. The contrast ratio is about three to four times higher, and the cost is probably about five to seven times lower. So there's been a lot of a democratization of being able to bring that kind of access to everybody. - And beyond the Kindle, E Ink and other companies have made huge strides in adding color, a very tough nut to crack. - So we have got a cyan, magenta, yellow, white system. So that's four particles that are shuffled like a card deck in order to get the right color. And they used to teach classes. This cannot be done. It's not physically possible. And when we started demonstrating it, it was surprising to many people. Don't bet against the scientists, they're pretty good. (Tim chuckling) - All those advancements are sparking the imaginations of hardware companies. Suddenly, E Ink isn't confined to e-readers. We can explore how it works on different kinds of gadgets and it's not bad, really! There are E Ink monitors from Onyx Boox and Dasung. The Light Phone II is an E Ink phone. Pebble paved the way for an E Ink smartwatch and Fossil has since picked up that torch with its own hybrid. We've got the reMarkable for taking notes. BOOX is currently killing it with color E Ink tablets. There's also PocketBook Color and more Kindles than I can count on two hands. This is a CO-two monitor that uses E Ink. Cute! And if E Ink has their way, this could just be the tip of the iceberg when it comes to form, factors and surfaces. At CES 2023, BMW showed off an actual color-changing car using this exact tech. And E Ink has found its way into a bunch of other concepts, like clothing, furniture, and this robot dog. But as cool as all that stuff is, can an E Ink display ever really compete with your phone? Just take a look at scrolling on the Onyx Boox Tab Mini C. Sure, you can see a little ghosting, and the colors aren't as punchy as it would be on my phone. That's it. It reminds me of newspapers and that has a certain charm to it. Look at it. You could even watch a YouTube video on some E Ink displays. It's obviously not great, but then again, Tim says that's really setting E Ink up for failure. - We've shown 30 to 60 frames per second. It's not nearly as good as an OLED though. So while we can do some of the speeds, we can't do the quality that you're seeing with OLED at those speeds. And we don't have the low power advantage anymore either, 'cause we don't have it sitting still when it's not updating. If I was gonna watch YouTube, I would probably do it on my phone. - So maybe the point isn't to replace all screens and surfaces, just the ones that make sense. In the case of electronic signs, traditional screens guzzle up a lot of power, which ultimately isn't great for light pollution, electricity bills or the grid. Switching to E Ink might be a greener solution. Outside of that, E Ink can also be applied to surfaces in a way that foldable OLEDs are either just too fragile or just not suited for. Things like your kitchen appliances. Maybe you change the color scheme based on an event you're having. Not something you need, but we all have favorite colors, right? Mine's purple! Look, there's no doubt that smartphones have changed the way that we interact with screens, and not always in positive ways. Being online all the time can be distracting. Notification anxiety is real. And not to mention it's not doing any favors for your eyes. While most of us can't help but covet the latest and greatest, for some, there's a deep desire to bridge the intentionality of analog gadgets with the needs of the modern world. It's easy to think that we need one, maybe two gadgets, to do everything and to do everything well. But E Ink is a good counter argument and a pitch for alternative technologies, even when something better already exists. - The winning argument to me, or the winning discussion to me, has really been around this nine to 13 hours per day in front of a screen. There's zero chance that that's going to convert to all E Ink display. Like, we're not giving up our TVs, we're not giving up our computers, we're not giving up our phones. It's not happening. And so we need to recognize the world that we live in and understand the opportunities that we have in that world. - You know why they chose me to host this video? 'Cause I have real ink in my arms. Do you know how much this hurt? This hurt, this really hurt.",
    "transcript_keywords": [
        "Ink",
        "Ink display",
        "Ink tech",
        "lot",
        "Ink North American",
        "Kindle",
        "particles",
        "display",
        "Ink phone",
        "Ink North",
        "phone",
        "Ink screens",
        "tech",
        "color",
        "displays",
        "world",
        "work",
        "Ink monitors",
        "real ink",
        "light"
    ],
    "transcript_entity_values": [
        "about five to seven",
        "zero",
        "Magna Doodle",
        "the mid-aughts",
        "E Ink",
        "North American",
        "Kleenex",
        "four",
        "Victoria",
        "today",
        "2000",
        "Kindles",
        "30 to 60",
        "the MIT Media Lab",
        "PSA",
        "US",
        "year",
        "the first 10 years",
        "BOOX",
        "Tim O'Malley",
        "months",
        "Tim",
        "the next five years",
        "Meta",
        "thousands",
        "Fossil",
        "two",
        "15 years",
        "2023",
        "Amazon",
        "about three to four",
        "Pebble",
        "Sony",
        "weeks",
        "PocketBook Color",
        "second",
        "1997",
        "YouTube",
        "BMW",
        "first",
        "2004",
        "2007",
        "Onyx Boox",
        "Kindle",
        "E Ink's",
        "tomorrow",
        "First",
        "Kindle",
        "300%"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "NORP",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "EVENT",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "GPE",
        "ORG",
        "DATE",
        "ORDINAL",
        "PERSON",
        "PERCENT"
    ],
    "vector": [
        -0.038773782551288605,
        -0.04769156128168106,
        0.022596707567572594,
        -0.05762095749378204,
        0.09624279290437698,
        0.026152998208999634,
        -0.009546993300318718,
        0.0582038089632988,
        0.02424439787864685,
        0.01405780203640461,
        -0.03413143754005432,
        0.07862640172243118,
        -0.008633878082036972,
        0.0198823194950819,
        0.022309117019176483,
        -0.07790759950876236,
        0.06782612204551697,
        -0.12439794093370438,
        -0.02420632727444172,
        -0.019407520070672035,
        -0.025191443040966988,
        -0.036501694470644,
        0.08514400571584702,
        -0.048008210957050323,
        -0.07732056081295013,
        0.018021585419774055,
        -0.04721410199999809,
        -0.08998797088861465,
        -0.03069048561155796,
        -0.1002204641699791,
        0.007635403890162706,
        0.029588762670755386,
        0.033718690276145935,
        -0.019790057092905045,
        -0.03828686103224754,
        -0.09753203392028809,
        0.0714978575706482,
        -0.04237503930926323,
        -0.04056301712989807,
        -0.06860454380512238,
        0.015606452710926533,
        -0.09235209971666336,
        -0.0641871765255928,
        -0.009268157184123993,
        0.05125513672828674,
        -0.10118183493614197,
        -0.012083659879863262,
        -0.028732845559716225,
        -0.040652770549058914,
        0.02075212635099888,
        0.027104932814836502,
        -0.12410394102334976,
        -0.0007661880808882415,
        -0.026023969054222107,
        0.02743191458284855,
        -0.029008159413933754,
        -0.004438371397554874,
        0.02484491840004921,
        0.026373540982604027,
        -0.05448939651250839,
        0.045539770275354385,
        -0.1115458607673645,
        -0.03807950019836426,
        0.07529392093420029,
        0.002877045189961791,
        0.049375660717487335,
        0.046323511749506,
        0.006832289043813944,
        -0.014016288332641125,
        -0.039378028362989426,
        -0.06674060225486755,
        -0.01474832184612751,
        0.03771326690912247,
        0.029747823253273964,
        0.09641600400209427,
        0.03295936807990074,
        0.08111345767974854,
        0.01687866635620594,
        0.014355693943798542,
        -0.016905246302485466,
        0.020765049383044243,
        -0.013432259671390057,
        0.014668110758066177,
        0.04751038923859596,
        -0.010492408648133278,
        -0.027105553075671196,
        -0.02814389206469059,
        -0.030073851346969604,
        0.01266500074416399,
        -0.009656433947384357,
        0.009263860061764717,
        0.063934825360775,
        0.03517947345972061,
        0.04011981561779976,
        0.015681318938732147,
        0.0002646375505719334,
        -0.03884716331958771,
        -0.04812800511717796,
        -0.005369412712752819,
        0.003299491014331579,
        0.003957996144890785,
        0.07984932512044907,
        -0.002572394907474518,
        -0.09335548430681229,
        0.014973937533795834,
        -0.10689707100391388,
        0.03819502517580986,
        -0.02940790355205536,
        0.04546555131673813,
        0.00041062862146645784,
        -0.014694079756736755,
        -0.016558023169636726,
        -0.03818529471755028,
        -0.035294901579618454,
        0.03578880429267883,
        -0.04339545592665672,
        -0.0015980035532265902,
        0.048682671040296555,
        0.19029274582862854,
        0.05713075399398804,
        0.018437812104821205,
        0.07670839875936508,
        -0.07661032676696777,
        -0.07486972212791443,
        0.018119096755981445,
        -0.03233148902654648,
        -0.06765130162239075,
        3.999346960920236e-33,
        -0.05889524519443512,
        0.08539711683988571,
        -0.04530477523803711,
        -0.0016550173750147223,
        0.04674654081463814,
        0.08626987785100937,
        -0.034139081835746765,
        0.026601864024996758,
        -0.07114028930664062,
        -0.10801611840724945,
        -0.01649906113743782,
        0.10781729221343994,
        -0.029468253254890442,
        0.14094233512878418,
        0.03272288292646408,
        -0.06100503355264664,
        -0.03436046838760376,
        0.026791488751769066,
        -0.07078205049037933,
        -0.01904480531811714,
        0.012196912430226803,
        -0.0697978138923645,
        0.015377492643892765,
        -0.03848099336028099,
        -0.010889142751693726,
        -0.013329794630408287,
        -0.0682949423789978,
        0.007000006269663572,
        0.09318011999130249,
        0.02967599220573902,
        -0.10225251317024231,
        -0.0038771023973822594,
        0.00795671809464693,
        -0.046167511492967606,
        -0.05724814906716347,
        0.020541643723845482,
        -0.042333073914051056,
        -0.07698097825050354,
        0.06040346622467041,
        0.046394530683755875,
        -0.04530297592282295,
        0.0697912946343422,
        -0.03905021399259567,
        -0.0275336354970932,
        -0.016028327867388725,
        0.05158774182200432,
        0.038013722747564316,
        -0.024864928796887398,
        0.04631143808364868,
        -0.000803882023319602,
        -0.01217630971223116,
        -0.047785352915525436,
        -0.01492619700729847,
        -0.03999801725149155,
        0.022300008684396744,
        -0.020263010635972023,
        -0.01137206144630909,
        -0.02967473864555359,
        0.020217228680849075,
        -0.11126192659139633,
        0.023575371131300926,
        0.08330036699771881,
        0.02782994695007801,
        0.024565983563661575,
        -0.02281862497329712,
        0.10425785183906555,
        0.04094480350613594,
        -0.011392302811145782,
        -0.07995068281888962,
        0.03454824909567833,
        -0.04886506125330925,
        -0.014308769255876541,
        0.023328464478254318,
        -0.08279576897621155,
        -0.030076775699853897,
        0.08428233116865158,
        -0.07015548646450043,
        -0.025031834840774536,
        0.03557345271110535,
        0.07046569883823395,
        -0.07849223166704178,
        -0.009402027353644371,
        -0.016316277906298637,
        -0.07176005095243454,
        0.02885490469634533,
        -0.026015454903244972,
        0.024587709456682205,
        0.033556412905454636,
        0.03473762050271034,
        -0.0015484881587326527,
        0.020234975963830948,
        0.0028750027995556593,
        0.012359782122075558,
        0.04786604270339012,
        -0.020240269601345062,
        -4.6455165729092324e-33,
        -0.05848454311490059,
        0.006307859439402819,
        -0.06941667944192886,
        0.05084242671728134,
        -0.01071804016828537,
        -0.020560940727591515,
        0.050369784235954285,
        0.0035728078801184893,
        0.07131033390760422,
        -0.017739813774824142,
        -0.02207818441092968,
        -0.005429471377283335,
        0.016408683732151985,
        0.032276701182127,
        -0.01742769218981266,
        -0.041392162442207336,
        -0.00622296379879117,
        -0.021512644365429878,
        0.04880858212709427,
        -0.06518609076738358,
        0.035129670053720474,
        -0.027537919580936432,
        -0.043138083070516586,
        0.06881042569875717,
        0.10657805949449539,
        0.03692542389035225,
        0.04351270571351051,
        -0.009099825285375118,
        -0.031408995389938354,
        -0.03600495308637619,
        -0.05309624597430229,
        -0.08937850594520569,
        0.019254371523857117,
        0.0893082246184349,
        0.06320014595985413,
        0.044351451098918915,
        0.08750596642494202,
        -0.06795988231897354,
        0.003510305192321539,
        -0.07217773050069809,
        0.056277722120285034,
        0.00637088855728507,
        -0.012192707508802414,
        -0.03737803176045418,
        -0.029099300503730774,
        -0.015733223408460617,
        -0.03534714877605438,
        0.08159663528203964,
        -0.011737246066331863,
        -0.002028152346611023,
        0.02293311059474945,
        0.016299722716212273,
        0.031177261844277382,
        -0.026001442223787308,
        -0.0593864805996418,
        0.03067636303603649,
        -0.0052815754897892475,
        0.035907309502363205,
        -0.03714223951101303,
        0.0498184971511364,
        -0.031568415462970734,
        0.0711866170167923,
        -0.028485741466283798,
        -0.012700621038675308,
        -0.023845357820391655,
        -0.020505258813500404,
        0.08118133991956711,
        0.022652562707662582,
        -0.046164076775312424,
        -0.03951191157102585,
        0.04172088950872421,
        -0.02303440310060978,
        -0.011293734423816204,
        -0.10185302793979645,
        0.001530977780930698,
        0.08128438144922256,
        0.05925055593252182,
        -0.029145412147045135,
        -0.08324290066957474,
        -0.0009301209938712418,
        -0.037114161998033524,
        0.04106447473168373,
        0.015263117849826813,
        0.0206436850130558,
        0.05708622932434082,
        0.012620792724192142,
        -0.025536086410284042,
        -0.04140467941761017,
        -0.04360635578632355,
        0.041903335601091385,
        0.0024372509215027094,
        -0.02968919277191162,
        -0.020022593438625336,
        0.11063120514154434,
        0.07488948106765747,
        -4.8999691415474445e-08,
        -0.010361827909946442,
        -0.030961833894252777,
        0.024249060079455376,
        -0.005518442019820213,
        0.05416649952530861,
        -0.08349359780550003,
        0.08190861344337463,
        -0.021550089120864868,
        0.023405956104397774,
        0.06179870292544365,
        0.05691065266728401,
        -0.1143152266740799,
        -0.02748217061161995,
        0.057877231389284134,
        0.13078904151916504,
        0.05205773934721947,
        0.05512954667210579,
        -0.03672491014003754,
        -0.04536760225892067,
        -0.022957995533943176,
        0.031489256769418716,
        -0.028262754902243614,
        0.04848935082554817,
        -0.10508731752634048,
        0.005112051032483578,
        0.005586260464042425,
        0.03281056508421898,
        -0.010854334570467472,
        0.0031910580582916737,
        -0.037740956991910934,
        -0.08522231876850128,
        -0.005419353023171425,
        0.006083181593567133,
        0.05272521451115608,
        -0.06633421033620834,
        -0.09206162393093109,
        0.054088152945041656,
        0.02936643175780773,
        0.012467202730476856,
        0.13755013048648834,
        0.0018730282317847013,
        -0.04719547927379608,
        0.044190146028995514,
        0.005708120297640562,
        -0.010920707136392593,
        -0.07142341881990433,
        0.02111058495938778,
        -0.00936975423246622,
        -0.012645557522773743,
        0.0025530376005917788,
        -0.020951073616743088,
        -0.029846729710698128,
        0.09460671246051788,
        0.03897570073604584,
        -0.012590152211487293,
        -0.04154535382986069,
        0.008867692202329636,
        0.06473241001367569,
        -0.011854122392833233,
        0.09576483815908432,
        0.07114586979150772,
        -0.08516892790794373,
        0.0907861515879631,
        0.05661969631910324
    ]
}