{
    "id": "EL5Np88dDtA",
    "title": "I wish I'd heard about this sooner! - Infinix ZERO BOOK ULTRA",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-12-11T20:18:50Z",
    "video_url": "https://www.youtube.com/watch?v=EL5Np88dDtA",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy"
    ],
    "views": 838069,
    "likes": 26506,
    "comments_count": 1126,
    "description": "Thanks to Infinix for sponsoring today's video! The Infinix ZERO BOOK Series also comes with a standard version ZERO BOOK priced starting at $799. The series will be available at Christmas and New Year in some markets in Southeast Asia, South Asia and Europe. Check out more information at   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Who's Infixix? 0:28 Inside the box 2:28 I/O & Build Quality 5:50 Specs 7:01 Android App Store 7:54 Gaming 9:06 Speakers 10:13 Speed Tape Testbenching 13:05 Teardown Time",
    "description_links": [
        "https://www.infinixmobility.com/laptops/zero-book-ultra",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "(upbeat music) - Okay, start recording. Camera. (laughing) Have you guys heard of Infinix? Because until a couple days ago, I had not although we're gonna find out how good they are very soon. Infinix sponsored this video and if you're seeing it right now, it means they're either very chill or this laptop's very good, it's one of the two. Very plain. We have the Zero Book series which I think is just a standard laptop. We will see. Alright, what do we have in here? Oh, okay. I'm surprised how well that popped out. I am surprised at how nice this is. This thing's a more budget-ish laptop. I believe this is the top spec model and it's a thousand dollars. Okay, it starts at a thousand dollars. Ah, yeah, it's not really budget. Nevermind, nice box. Oh that's very not North American. 100 to 240 volts. So this will be fine in a North American outlet as long as you have an adapter. That's one of the unfortunate things about Infinix. They don't exist in North America, so. (blows raspberry) So anyway, nice very small charger that we have here. It's too bad that it won't plug into our outlet but it's a hundred watts max and all over type C. Very nice. Let's see what we have here. Oh that looks really cool. I don't even know what you call it. It's like a nice matte, almost like sandblasted or vapor blasted finish. But then they have these nice little shiny cutouts. It almost looks like it might be anodized and then they laser cut off the anodization in some spots like with a fiber laser. I'm not totally sure how they did it but it looks really cool. Like is that showing up on camera, Brandon? - [Brandon] Yeah. - Okay, so this is really cool, actually. On the side here, they have this switch. Now if you put it all the way over to the side to eco-mode, that gives you, what is this here? 30 to 35 watt TDP on the processor. I move it over to balanced. That gives us, what is that, 38 to 45 watts on the processor and all the way over into over boost, gives us 45 to 50 watts. Now that's really cool that they have it just on the side like that. I'm gonna put it in eco-mode 'cause I don't think we plan on doing anything too, too crazy. The IO here is really solid here. We have a USB-C port that does display port. This USB-C port though does your power input. Front one doesn't, back one does. We also have a DC in, which is strange 'cause they didn't include a barrel plug. Also HDMI and USB type A. Is that HDMI? Do we know what that is? HDMI 1.4. Okay, so that'll be great for... We also have a micro SD card slot, 3.5 millimeter jack, another USB type A and our little switchy switch for the modes here. Also, looks like we have some speakers that fire down. Nice old mesh grill for an intake. I'm guessing the exhaust is up here. Alright, let's open this thing up and have a little look. Oh, hinge weight's very nice, but do you know what's even better than this? This segue to our sponsor. - [Bell] It's sponsored, so... - Oh (beep), this is sponsored by them. Okay, so nevermind. Have a little press. The chassis is surprisingly well made. So up at the top here it is a little bit on the squishy side, it's nothing too too bad. Like you can see the whole chassis is flexing instead of there being soft spots. Yeah, it isn't really an issue until you push like above the function row which you're probably not gonna do all that much. So track pad, my first impression is not incredible. Now here we have quite a generous sized track pad and is glass topped and the tracking is really quite good, once I turn down the pointer speed and disabled acceleration and stuff. This works really quite well I would say. Now the problem that we have is that the click is not fantastic. You can just hear it here, I'll give you a little. (mousepad clicking) The problem is that it's really easy to click the right and left mouse buttons at the same time. Like you can hear it here like. (mousepad clicking) I'm hitting both of them right now. Once you get used to it, I think you're gonna get pretty good at just clicking off to the side with your thumb and going around. Also, I have lived with laptops that have worse track pads than this. Like the click feel at least and you just kind of get used to tapping everything and it's pretty all right. Okay, okay. I was really concerned for a second that we didn't have keyboard back lighting, but we do. You just press the space bar with function, all good. The keyboard itself is fine. The switches are nothing to write home about but at the same time the key stabilization and the overall consistency of the keyboard is really quite good. It has sort of at the top like a lot of resistance. Then it just sort of yields and goes pretty fast. I'm sure once you get used to it you'll be able to type quite quickly on this, like league's better than the LG Gram but not quite the same as like a Dell or an HP. I would give this like a solid B maybe a B plus if I'm feeling generous but I'm not feeling generous. It's a B. Yeah, I'm pretty confident that after an hour or two I could get full speed on this and it would be fine. Let's have a look at the specs though. Oh, this is a powerful boy, Jake. In here we have the Intel i9-12900H so that is 14 cores, 20 threads. For memory, we have 16 gigabytes of 4,800 megahertz RAM. I am guessing that is upgradable. It says eight of eight slots are used. Oh, maybe it is solder, that would be disappointing. For the SSD, we have a 4C one terabyte NVMe drive, I wonder what the heck that is. Well, I can find essentially nothing on this drive. It's probably made by Longsys but realistically we need to take this thing apart and find out if it's actually any good or not. What is good though is we have an Intel Wi-Fi 6E AX211, so that's basically the best wifi adapter you can buy, which is awesome. You won't have any issues with wifi troubles like I was just having on a MacBook. And finally we have Iris Xe graphics. So nothing special there, but ever since they did get Iris Xe graphics, it's pretty good, as long as you know the game that you want to play, the drivers play nicely. Okay, so I guess one of the talking points is that we have an Android app store. Yeah, it's just right here. Let's see what this is like. Oh yes, we can download MyBox. Also, FlashScore in Nigeria is on here. The King James Bible, free. Overall this monitor is quite good. So it's 1080p IPS, 400 nits peak brightness and it's a hundred percent sRGB which is realistically what you're going to be using most of the time. One thing I'm not a huge fan of is that it is 16 by 9 and a laptop like this I would much rather see that at 16 by 10, just extend it down a little bit more. That said, I'd be fine with this display especially given the price, this is what I would expect. All right, let's see what happens here, if I go into over boost mode, can we run Valheim? Oh, we have to create an, oh this is the shortcircuit account. We need to make someone, what should we name 'em? - [Bell] Paul. - Paul, sure. - [Bell] It's a good strong name. - Oh wait, you guys see this? We have RGB. Well at least we have R. Alright, 1080p medium, I'm currently getting 40 FPS which is actually not bad. In this game, that's like pretty playable. So at 900p I'm able to get 40 to 50 FPS which is really not all that bad. This is an excellent spawn, we spawn right beside the first boss. In our next couple of shortcircuit videos, we'll have to go and beat him. But anyway, this is running really quite well. The display looks fantastic when you're playing a video game. Like look at that tree, what a good tree. That's enough of that. I'm impressed with the graphics given that it's, you know, Intel integrated. Okay, let's see here though. Okay, confirmed right here we have a fingerprint reader so signing in's gonna be just a little boop boop or however you want to do it, nice, love to see that. Also see if these speakers are any good. Crab rave. (upbeat electronic music) Okay, treble's nice and clear. I'm suspicious that it's gonna get a bit distorted once the bass comes in. (upbeat electronic music continues) Okay, okay. So I was concerned that it was just going to turn into a distorted mess but instead there's not a lot of bass but I would much prefer clear over loud and bad. (upbeat electronic music continues) Okay, okay, not bad, not bad. Fine. That is about what I would expect. You can with more expensive laptops, get more sound but that is what I would expect. One thing that I do want to try though is Cinebench because realistically what you want this laptop for is, it's like fairly light, screen's decent, keyboard's okay. But the i9-12900H at this price is pretty fricking good. Now we need our speed puck, one second. Alright, we've got our speed tape here. I know it's not the best test ever, but at the same time we've done it for all of our laptops because you wanna see what they can really do. All right, let's give this a go. I'm expecting 13000 Cinebench R23, something like that. - [Bell] I don't know what those numbers mean. - Oh (beep) So we go to Cinebench score of 7,947. (record scratch) - [Brandon] What? - That's terrible. Okay, let's run that again. Start. Our CPU is currently at 56 degrees Celsius. Package power is 23 watt, something's wrong. This is just not right. I'm deeply suspicious that our problem is that this 160 watt adapter that Jake brought over is not actually 160 watts and I'm pretty sure that we like trip the over current protection in this and that's why we're having issues. - [Bell] Classic. - Okay. Hopefully this will solve it, grabbed a Dell power adapter that should have more than enough current for what we need. To be clear, this is a problem with the charger that we grabbed. I'm sure that the one that came with it would be fine but we cannot plug it into our outlets. Okay, plugged in. Start. Oh, okay and now we're getting 95 degrees Celsius, 65 watts, we're in business boys. That's one hell of an awkward conversation avoided right there. Thank balls. We are seeing some thermal throttling, it's drop down to about 45 watts, but that is still what I would expect. 2.5 gigahertz all core. That's exactly what I would expect for this processor. Fantastic. Oh man, I am so relieved. (laughs) 13,164 points in Cinebench. So this thing right here if you wanted to do CPU tasks is going to be excellent. Final thing before we rip this thing apart I wanna see if the webcam's any good camera. Camera. (laughing) So here it is. The beauty filter's on. As you can see, my face is very shiny. My eyebrows are also like half gone, kind of strange. We'll just turn that down, we'll just turn that off. There we go, now I look a little bit more normal like. Background, I am at Intel now, I guess. That's kind of weird, how do I adjust that? I want to change the background. You must be able to. Well, I can't quite figure out how to change this background around me. I'm sure that there is a way, although even without that this is a surprisingly good webcam for the device. Now let's just stop recording and take it apart. (upbeat music) Seven Phillips head screws and we are, oh, still attached. Oh, that must be our RGB light. No, it isn't. What even is this? Oh, that was our RGB light. Okay, so you do need to disconnect that, very easy. So here we can see our one watt subwoofers that are down facing. Here, we have, oh wow damn, we have a 71 hour battery, my speck said it was 50. They lied in the best way. So 71 hours is going to be enough for an i9-12900H. That's the sort of thing where that processor can drain anything that legally goes on a plane really fast if you try. But if you want it to sip I'm sure you can get like eight hours of battery life probably somewhere around there. You also have two fans. Nice whole bunch of fins on here. It's not the most heat sinkage I've ever seen but at the same time we saw that it's enough. You can do 45 watts continuous. One thing that is unfortunate is it does appear that we do not have access to the RAM, that all is soldered down. Although we can't add a second SSD, which is awesome. So our first one is right here, the 4C, who knows how good that is? But you can put whatever SSD you want right here as well. Awesome. Aside from that, oh, windows modern standby, it's still terrible. Just make sure that you turn on hibernate or if this supports S3 sleep then turn that on because otherwise you're gonna put this in your bag and it's gonna be dead. So the Infinix Zero Book Ultra, this thing is quite a competent little laptop. If you want something, I guess it really depends on the pricing and where you are. You're gonna have to look at what's around you to see if the price of this makes sense. If it existed here in North America for a thousand dollars, excellent. I would strongly recommend it, but depending on how much devices cost in your region I have no clue if that's competitive in India. I do not shop for laptops there very often but it is quite a well-built device. Screen is quite good, keyboard and track pad are at least acceptable for something of that price. And you have a nice little red light at the back, makes it so everyone knows you don't quite have a MacBook. That's a huge thanks to Infinix for sponsoring this video. It was cool to check out something that you just don't know what it's gonna be like. Really rolled the dice there, Jeff, on that sponsorship. It paid off. If you like this video hit like get subscribed and just have a fantastic ole day, see you later. We really dodged a bullet there, Jake. (laughing) - [Bell] Let's go. - Yeah.",
    "transcript_keywords": [
        "good",
        "nice",
        "thing",
        "pretty",
        "watts",
        "Infinix",
        "North American",
        "bad",
        "laptop",
        "pretty good",
        "North",
        "yeah",
        "fine",
        "turn",
        "Intel",
        "Cinebench",
        "watt",
        "side",
        "laptops",
        "time"
    ],
    "transcript_entity_values": [
        "13,164",
        "S3",
        "an hour",
        "1.4",
        "USB",
        "65 watts",
        "50 watts",
        "a couple days ago",
        "38",
        "160 watt",
        "10",
        "3.5 millimeter",
        "30",
        "MacBook",
        "Dell",
        "16 gigabytes",
        "Valheim",
        "R. Alright",
        "FPS",
        "HP",
        "9",
        "160 watts",
        "one second",
        "Longsys",
        "71 hour",
        "13000",
        "Jeff",
        "MyBox",
        "the LG Gram",
        "one watt",
        "first",
        "two",
        "4,800 megahertz",
        "1080p",
        "2.5 gigahertz",
        "a hundred percent",
        "James Bible",
        "Cinebench",
        "SD",
        "CPU",
        "35 watt TDP",
        "eight",
        "SSD",
        "Jake",
        "RAM",
        "one",
        "second",
        "North American",
        "eight hours",
        "45 watts",
        "North America",
        "Brandon",
        "95 degrees Celsius",
        "Android",
        "Seven",
        "50",
        "45",
        "half",
        "Phillips",
        "240 volts",
        "Intel",
        "One",
        "40",
        "a hundred watts max",
        "Nigeria",
        "7,947",
        "14",
        "20",
        "100",
        "about 45 watts",
        "71 hours",
        "Iris Xe",
        "23 watt",
        "IO",
        "IPS",
        "16",
        "400",
        "India",
        "a thousand dollars",
        "RGB",
        "56 degrees Celsius"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "FAC",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "PERSON",
        "TIME",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "LAW",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "NORP",
        "TIME",
        "QUANTITY",
        "LOC",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "PRODUCT",
        "QUANTITY",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "MONEY",
        "ORG",
        "QUANTITY"
    ],
    "vector": [
        -0.059859421104192734,
        -0.03971610590815544,
        -0.02957545779645443,
        -0.020384186878800392,
        0.038339585065841675,
        -0.008749774657189846,
        -0.07289902865886688,
        0.03777512535452843,
        0.044649507850408554,
        0.046251554042100906,
        -0.0004997178912162781,
        0.036540437489748,
        0.0034164178650826216,
        -0.010605718940496445,
        -0.04361535981297493,
        -0.05193714797496796,
        -0.024583939462900162,
        -0.09355296194553375,
        0.02145988680422306,
        0.0009238775819540024,
        0.010723874904215336,
        -0.027439847588539124,
        0.019184110686182976,
        0.011712818406522274,
        -0.0420021116733551,
        -0.09794479608535767,
        -0.04227331280708313,
        -0.08985681086778641,
        0.04264666512608528,
        -0.059414658695459366,
        0.009218204766511917,
        0.141750305891037,
        0.00039937999099493027,
        -0.03462338447570801,
        0.029333429411053658,
        0.016270942986011505,
        0.10368773341178894,
        -0.04006633535027504,
        -0.11586814373731613,
        0.00792788527905941,
        0.014768834225833416,
        -0.028455333784222603,
        -0.015262041240930557,
        -0.013874473050236702,
        0.007042868994176388,
        0.0150035060942173,
        -0.006948032416403294,
        -0.026171326637268066,
        0.04205213859677315,
        0.0561460442841053,
        -0.04330386221408844,
        -0.030781660228967667,
        0.019453734159469604,
        -0.0443219356238842,
        -0.0048864432610571384,
        0.037723589688539505,
        -0.07123702019453049,
        -0.052968572825193405,
        0.011770978569984436,
        -0.05613531544804573,
        0.05413196235895157,
        -0.0661102905869484,
        -0.07031194120645523,
        0.05222823843359947,
        0.026426192373037338,
        0.060916706919670105,
        -0.03887680172920227,
        0.08586546778678894,
        -0.04537530243396759,
        0.0029859065543860197,
        -0.017916567623615265,
        -0.03831636533141136,
        0.03729249909520149,
        0.09555362910032272,
        0.01679888367652893,
        -0.0025102950166910887,
        0.028855113312602043,
        -0.049479320645332336,
        0.0002305168891325593,
        0.027785329148173332,
        -0.017193801701068878,
        -0.1063668429851532,
        -0.003281350014731288,
        -0.056001197546720505,
        -0.018147215247154236,
        0.040523711591959,
        0.06801778823137283,
        0.004652954172343016,
        0.02798864059150219,
        -0.0740046501159668,
        -0.03676608204841614,
        0.07069319486618042,
        0.03626125305891037,
        0.04478065297007561,
        -0.08812116086483002,
        0.016396958380937576,
        -0.040218546986579895,
        0.014877425506711006,
        -0.04045746102929115,
        0.07175641506910324,
        0.05917758867144585,
        0.005168039817363024,
        0.008538121357560158,
        0.010193032212555408,
        -0.0898054912686348,
        -0.09629394114017487,
        0.06055318936705589,
        0.03913039714097977,
        0.023384252563118935,
        0.0045218742452561855,
        -0.038437388837337494,
        -0.0322384387254715,
        -0.010891451500356197,
        -0.05502142012119293,
        -0.0538453571498394,
        -0.004353276453912258,
        0.014853483997285366,
        0.002570604905486107,
        0.08508563041687012,
        0.003682383568957448,
        0.02417413890361786,
        0.0233672596514225,
        0.01357729360461235,
        0.08537191897630692,
        -0.009868784807622433,
        0.037040259689092636,
        0.009630699642002583,
        -2.7679558333354336e-34,
        -0.03742170333862305,
        0.03695675730705261,
        0.03076227195560932,
        -0.06649000197649002,
        0.09612452983856201,
        -0.045721206814050674,
        0.058747731149196625,
        0.030460018664598465,
        -0.08482453972101212,
        -0.0035933612380176783,
        -0.029925404116511345,
        0.07975070178508759,
        -0.061337314546108246,
        0.06263960897922516,
        -0.006570436526089907,
        -0.09203577041625977,
        0.048356592655181885,
        0.012952235527336597,
        -0.02147163823246956,
        -0.01415980514138937,
        -0.004662517458200455,
        0.003903638804331422,
        0.02064817026257515,
        -0.046722590923309326,
        0.1059471070766449,
        0.006276288069784641,
        -0.019768765196204185,
        -0.03005891665816307,
        0.06299684196710587,
        0.031430333852767944,
        -0.0639406070113182,
        0.023467350751161575,
        -0.02819277159869671,
        -0.12474088370800018,
        -0.05226145684719086,
        0.030065855011343956,
        -0.0965532511472702,
        -0.045015692710876465,
        0.018870128318667412,
        0.0597744956612587,
        -0.0431983582675457,
        0.00941547192633152,
        -0.0555158369243145,
        -0.12852250039577484,
        -0.06283456087112427,
        0.036984506994485855,
        0.1253562569618225,
        0.07359209656715393,
        0.0974871888756752,
        -0.04342023655772209,
        -0.03528973460197449,
        0.017530586570501328,
        -0.17729318141937256,
        -0.10465959459543228,
        -0.006379707250744104,
        0.005108760204166174,
        -0.031836867332458496,
        -0.028562031686306,
        0.021039461717009544,
        -0.016663815826177597,
        -0.016854479908943176,
        0.07415488362312317,
        0.0022651925683021545,
        -0.033123016357421875,
        -0.04168574884533882,
        0.022224992513656616,
        -0.0025271696504205465,
        -0.022123096510767937,
        -0.09234556555747986,
        -0.06400047242641449,
        -0.09164825081825256,
        -0.0105880256742239,
        0.07497578859329224,
        -0.05231815204024315,
        0.04970121383666992,
        0.044838447123765945,
        -0.07647429406642914,
        -0.1355130970478058,
        0.020692747086286545,
        0.02112121321260929,
        -0.05690431967377663,
        -0.0049402667209506035,
        0.07326219230890274,
        0.042484525591135025,
        -0.02611945942044258,
        -0.013778161257505417,
        0.07401121407747269,
        0.03853892907500267,
        -0.04260657727718353,
        -0.06877699494361877,
        -0.004601893946528435,
        -0.015989983454346657,
        -0.049846578389406204,
        -0.028827928006649017,
        -0.02444528602063656,
        -3.2530101692198114e-33,
        -0.02726314216852188,
        -0.002906715264543891,
        -0.07816623896360397,
        0.029128512367606163,
        0.05298333242535591,
        0.11182200908660889,
        0.005025412421673536,
        0.04901186004281044,
        0.055367689579725266,
        -0.02019600197672844,
        0.0033410307951271534,
        -0.016209237277507782,
        -0.0680527612566948,
        -0.00394971901550889,
        -0.05041513219475746,
        -0.1031922772526741,
        0.04246480390429497,
        0.011254806071519852,
        -0.01971159502863884,
        -0.047210149466991425,
        0.07067568600177765,
        0.04585922136902809,
        -0.05658402666449547,
        0.023846713826060295,
        0.053158052265644073,
        0.017128586769104004,
        0.13718463480472565,
        0.08815184235572815,
        -0.06234600767493248,
        0.04209653288125992,
        -0.01871170848608017,
        -0.010808562859892845,
        0.02084427699446678,
        -0.034129638224840164,
        -0.03068438358604908,
        -0.010753096081316471,
        0.030252186581492424,
        0.034468136727809906,
        -0.03894032910466194,
        -0.05992120876908302,
        0.013968967832624912,
        -0.010852696374058723,
        0.02024603635072708,
        -0.02677866816520691,
        -0.0003253562608733773,
        -0.12017185240983963,
        -0.042817309498786926,
        0.0068650273606181145,
        0.019472045823931694,
        -0.025053905323147774,
        -0.06006796658039093,
        -0.00895898137241602,
        0.12440378963947296,
        -0.028545163571834564,
        0.005326912738382816,
        0.0020207068882882595,
        -0.048734765499830246,
        0.04789338260889053,
        0.03242994472384453,
        -0.026174917817115784,
        -0.04101436212658882,
        -0.0137432049959898,
        -0.011384439654648304,
        0.009731707163155079,
        0.024576440453529358,
        -0.047426652163267136,
        0.053316470235586166,
        0.021765105426311493,
        -0.03725370764732361,
        -0.013514067977666855,
        -0.03946263715624809,
        0.024517685174942017,
        -0.017793985083699226,
        -0.054204728454351425,
        -0.026875844225287437,
        0.06418371945619583,
        0.023898018524050713,
        -0.015170677565038204,
        0.04599214717745781,
        -0.07160485535860062,
        -0.04325656592845917,
        0.02166753076016903,
        0.01937185786664486,
        0.06517282128334045,
        0.10483687371015549,
        0.006841989699751139,
        0.05379359424114227,
        -0.002868476090952754,
        0.01910163275897503,
        0.019362198188900948,
        -0.022943826392292976,
        0.02066386491060257,
        0.026791630312800407,
        0.01762610673904419,
        0.03415582329034805,
        -5.507536116056144e-08,
        -0.008954307064414024,
        0.009726710617542267,
        -0.012356902472674847,
        0.008297175168991089,
        0.002955748001113534,
        0.022036002948880196,
        0.06615669280290604,
        -0.024813681840896606,
        -0.025146454572677612,
        0.023578742519021034,
        -0.005420512054115534,
        -0.04722953587770462,
        0.008964436128735542,
        -0.01987842097878456,
        -0.019247742369771004,
        0.046242453157901764,
        0.0471072643995285,
        0.009682346135377884,
        -0.05174866318702698,
        0.004526866599917412,
        -0.04418894648551941,
        0.051010437309741974,
        0.06387702375650406,
        -0.11560814827680588,
        0.014560187235474586,
        0.01811385527253151,
        0.008168406784534454,
        0.025558587163686752,
        0.142448291182518,
        -0.06599457561969757,
        -0.09800325334072113,
        0.021425291895866394,
        0.0071042319759726524,
        0.020148249343037605,
        -0.01061189267784357,
        -0.017357857897877693,
        -0.05008307844400406,
        0.17385172843933105,
        -0.06972698122262955,
        0.01566261425614357,
        -0.019566545262932777,
        0.012677106074988842,
        0.02643071487545967,
        -0.013992680236697197,
        0.022292332723736763,
        -0.002149457111954689,
        -0.04016663506627083,
        -0.05323517322540283,
        0.055470939725637436,
        0.022768421098589897,
        -0.019271325320005417,
        0.007803410291671753,
        -0.0453946478664875,
        0.05044712871313095,
        0.021132027730345726,
        0.053715914487838745,
        -0.05694374814629555,
        0.0281809214502573,
        -0.06299363821744919,
        0.07627736777067184,
        0.05108555033802986,
        -0.12395128607749939,
        -0.06200934574007988,
        0.1190856471657753
    ]
}