{
    "id": "ELsYC-N7hgc",
    "title": "I Can’t Believe I Liked This… - Dell XPS 13 Plus Review",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-04-30T17:01:04Z",
    "video_url": "https://www.youtube.com/watch?v=ELsYC-N7hgc",
    "category": "Science & Technology",
    "tags": [
        "Dell XPS 13 Plus",
        "i7-1280P",
        "i7-1260P",
        "XPS 13",
        "Intel",
        "Apple",
        "M1"
    ],
    "views": 3025878,
    "likes": 83564,
    "comments_count": 3987,
    "description": "Purchase the Anycubic Photon M3 on their official store at  or on Amazon at   Join us in War Thunder for FREE at  Get an exclusive bonus using our link - thanks for supporting the channel!  The Dell XPS 13 Plus features a lot of bold design decisions... and I like it?  Discuss on the forum:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 - Dell stealing Apple's ideas... 0:36 - Warthunder 0:55 - Touchbar? 2:02 - Keyboard 2:56 - Keyboard modification 3:15 - Trackpad 4:14 - The IO is terrible. 7:02 - Performance 8:24 - Display and Battery Life 9:15 - Speakers 10:03 - Repairability 10:49 - Pricing 11:28 - AnyCubic! 12:26 - Outro",
    "description_links": [
        "https://bit.ly/3EeuyqA",
        "https://amzn.to/3uJxubt",
        "https://playwt.link/joinltt",
        "https://linustechtips.com/topic/1428304-i-can%E2%80%99t-believe-i-liked-this%E2%80%A6/",
        "https://lttstore.com",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- The XPS 13 Plus looks like Dell stole all of Apple's worst ideas five years later. But under the hood, every design decision here supports a single ambitious goal, to cram a 14-core processor into a 13-inch Ultrabook. Yes, this has a 14-core CPU in it that absolutely annihilates the M1 chip in the 13-inch MacBook Pro. Is that performance worth some of the interesting design decisions? It took a lot of work for us to answer that question. So first, you'll have to sit and listen to this message from our sponsor. - War Thunder. War Thunder is an online military vehicle combat game that's free to play and lots of fun. Try it for free down below today and get some special bonus items just for signing up. (upbeat music) - To accommodate an increased CPU TDP from 15 watts all the way to 28 watts without enlarging the chassis, the first thing to get the axe was the function row. And this might look like a Touch Bar rip off, but Dell's implementation is actually both, less functional and better. The typical media control keys are now capacitive touch buttons and by hitting function, you can bring up the function row or function + escape to lock it. We occasionally found ourselves wishing for tactile buttons, especially for escape and delete. But after a few short hours, the whole thing works pretty well and comes with a huge upside. The glass and capacitive touch button assembly is only 1.4 millimeters thick. That is less than half the space that traditional buttons would have occupied, which gives Dell way more space for cooling. An additional benefit is that this glass is transparent to RF which made the WiFi antennas work way better. They fire both up through the function keys and down through a little hole in the aluminum chassis. Now we're gonna go into more depth on the CPU performance later. Spoiler alert, it's absolutely unreal. But below the function row, there's a whole lot more weirdness that I wanna look at first. Starting with the keyboard, Dell has eliminated almost all of the space between the keys. It looks sick. But I was very concerned about the typing experience having tried out a handful of devices like this in the past. Fortunately, Dell has a lot of money to spend. Apparently, they built three production level prototypes of the keyboard just so that they could get the dish of the keys just right. And that effort and the many 1000s of monies that it cost to make three separate molds, in my opinion paid off. Each key has a point three millimeter dish that lets your fingers know exactly where they are and it only took me a few minutes to get darn near up to full speed. It's possibly one of the most pleasing keyboards on an Ultrabook right now and it's an easy A-plus in my book. - At least if you have smaller hands. Mine, they kind of hang off the edge and even though Dell have chamfered the aluminum here, I find it a little bit sharp. Fortunately, I have a fix and it will only take a couple seconds. (machine whirring) Oh yeah, I like that way more. Got a nice little radius here. So much better. - Anywho, below the keyboard is presumably a touchpad. Yeah, it is. The entire palm rest area is a seamless piece of Gorilla glass with a touchpad in the center spanning roughly this distance. Dell made prototypes with both physical and visual cues to show the user where the touchpad was, but found that it wasn't actually necessary. And I actually agree with them. The trackpad is large enough that I've never managed to wander outside of it during normal use. And to take care of clicking, Dell has 10 piezoelectric buzzers below the trackpad to simulate a click. The strength of this feedback out of the box was a little much for me, but it can be adjusted to your preference in Windows and feels really cool once you get it dialed in. A sneaky benefit of this design is that if one of the piezo buzzers fails, the others around it can actually increase their intensity and prolong the life of the trackpad, which is super cool. Now to address the elephant in the room, I/O. You get a single Thunderbolt four port on this side and a single Thunderbolt four port on this side. And that's it, there's no other sides. The biggest reason that Dell couldn't fit a headphone jack, that's right, no headphone jack, is that it's long. So it used to be up here, but that would force the hinge to be considerably wider like on the older model which would have cost us you guessed it, valuable heatsink space, no 28 Watt processor. According to Dell's research then, the majority of users now see the headphone jack as a nice-to-have instead of a must-have. But that minority who doesn't agree gets really mad about it. And here's why I think those people have a pretty good case. First, Windows. Microsoft's implementation of bluetooth pairing is arguably a full decade behind iOS and Android. So using bluetooth headphones on a Windows machine can sometimes mean three to 10 minutes of screwing around. I mean talk about an immersive audio experience. Over the years, I've grown accustomed to dongles and in a laptop this size you literally can't fit most connectors, but audio even now is a special case to me. USB, HDMI, ethernet, all of them are fully digital signals. But audio is analog, which is why out of every single dongle in our office, there are this many that have a headphone jack on them. Here's the thing, for your headphones to sound good, you need a quality DAC or digital to analog converter that takes the bits from Spotify or whatever and converts it into music in your earholes. And trust me a good DAC doesn't come cheap. So the vast majority of dongles out there completely omit the headphone jack as a cost-saving measure. Also, because everything has a headphone jack on it. Also, because the USB implementers forum is more about chill vibes man than acting like a serious standards organization, there are multiple, optional mind you, ways for audio to be implemented over USB Type-C. Audio accessory mode, for example, turns two of the digital data pins into analog audio pins. But that mode doesn't happen to be supported by the XPS 13 Plus. And surprisingly, pins and wires that were designed for high speed digital signals don't result in great audio anyway. But the important thing for you guys to know out of all of this is that because of all of this tomfoolery, many dongles made for phones simply will not work on the XPS 13 Plus. Graciously, Dell does include a dongle with a DAC unit in the box but because of the lack of availability more broadly, you better try not to lose it. At least until Apple also ditches the headphone jack and all of this becomes acceptable. And they might just do that based on these performance results. Because if your goal in buying the XPS 13 Plus is to tell your friend their MacBook is molasses slow, I've got great news. Compared to the MacBook Pro 13-inch with an 8-core M1, the XPS 13 Plus with a Core i7 14-core is 45% faster. It's even faster than last year's XPS 15, albeit only by a hair. And as for the 1260P model, it might only have a mere 12 cores, but it still managed to blow past Apple's best machine in this form factor. It is an Intel processor so when loaded the temps do get into the 90s very quickly, but the little XPS 13 that could here manage brief spells of over 50 watts and consistently manage to dissipate a bit over 30. All without sounding like a hairdryer. Even better, you get Iris Xe graphics with 96 execution units allowing you to play actual 3D games as long as you don't mind lowering the graphics or the resolution a bit or the occasional driver issue. Also, it is fast but I'm not ready to crown it king of the 13-inch laptops yet because the Asus Flow X13 which harnesses the power of AMD and liquid metal just arrived in our studio. Make sure you're subscribed for that review. The screen of the XPS 13 Plus is both excellent and annoying. The 4K OLED model is fantastic to look at. Not only do you get deep blacks, but 500 nits peak brightness means that it's useful in bright rooms as well. They even managed to cram a decent webcam with Windows Hello facial recognition into this tiny little bezel here. But the OLED screen has a big problem, battery life. With the OLED, the XPS 13 only managed six hours and eight minutes of battery life. Which is great for a full-size freaking gaming laptop with a GPU in it. With the LCD screen, we were able to get a much more Ultrabook-like nine hours and 43 minutes. That's certainly enough for all day use. But even some AMD Gaming laptops can last a bit longer and Apple will keep you away from an outlet for literally twice as long. Fortunately, the speakers are another area where Dell has vastly improved the XPS 13 Plus over the last generation. The speaker count was doubled to four with two down firing and to shooting up through the keyboard. (upbeat music) Don't expect to be feeling incredible bass notes but for a 13-inch laptop, they are much more than acceptable until you go past about 70% volume where things get a little weird. Between 500 and 100 hertz there's this rattle that shows up from the upward firing speakers exciting the keys. So in a future revision, and I hope that Dell adds some kind of damper to the keys to prevent this. But for now, it's loud enough at 70% and sounds good enough that you shouldn't need to pack a bluetooth speaker anyway. One major concern I had with the XPS 13 Plus though is repairability. Thankfully, Dell hasn't just glued the whole thing together though. Disclosure, by the way, as I discuss repairability here. I am invested in framework laptop. Opening up the bottom, you've got easy access to both battery and storage, neither of which are glued in, nice. The RAM is soldered on. But frankly, I think that that's actually justifiable in a machine like this, given how thin it is and with the removal of the motherboard and battery, surprisingly, the keyboard and the trackpad are also both replaceable. Unfortunately, the trackpad is glued in so it can be replaced, but I doubt any non-professionals are going to attempt it. They haven't released any specifics on the XPS lineup and what that's gonna look like going forward. But I think it's safe to assume that this won't be the only XPS 13 they're going to sell. For the last couple of years, they've been selling the old chassis along with the new one if you wanted a cheaper or a more expensive version. And I imagine that now they'll slap a 12 Gen processor into the old chassis for everyone that isn't sold on the radical design changes of the 13 Plus. As for us, it starts at $1,300 though the one you'll actually want will likely be a good bit more expensive than that. And it is a great little powerhouse of a machine unless you cannot accept the removal of the headphone jack. What you will accept though, is this message from our sponsor. - Anycubic. The Anycubic Photon M3 is a fantastic 3D printer for entry-level users. It's affordably priced, requires minimal assembly and offers great quality 3D resin printing. It can produce big miniatures with high dimensional accuracy and a smooth surface finish thanks to its over seven by six by four inch max print volume. With it's 7.6 inch monochrome screen, you can print large objects or several miniatures at once. The Photon M3 has a resolution of 4096 by 2560 pixels which combined with its 40 micron horizontal resolution and 400:1 high contrast ratio allows for high precision and sharp edges. The Anycubic LighTurbo matrix light source system LED beads help to provide strong light energy making high quality and high speed printing possible. Plus, the Photon M3 is larger than comparable printers within the $300 price range. If you're looking to get into 3D printing, this is a great printer to help you start. Learn more at the link below. That's where they go. - If you guys enjoyed this video, maybe you like laptop content, why not check out this weird water cooler we bought on AliExpress for laptops. That's a trip, cut video.",
    "transcript_keywords": [
        "Dell",
        "XPS",
        "headphone jack",
        "Apple worst ideas",
        "Dell stole",
        "headphone",
        "jack",
        "worst ideas",
        "audio",
        "function",
        "keys",
        "function row",
        "great",
        "high",
        "Apple worst",
        "laptop",
        "keyboard",
        "Windows",
        "Apple",
        "thing"
    ],
    "transcript_entity_values": [
        "the years",
        "500",
        "13",
        "Thunderbolt",
        "MacBook",
        "300",
        "One",
        "The Anycubic Photon M3",
        "Ultrabook",
        "GPU",
        "seven",
        "Dell",
        "only 1.4 millimeters",
        "Iris Xe",
        "Between 500 and 100",
        "three",
        "over 50 watts",
        "The Photon M3",
        "DAC",
        "the MacBook Pro",
        "28 watts",
        "1000s",
        "96",
        "Windows",
        "Microsoft",
        "the 90s",
        "1260P",
        "14",
        "4096",
        "Apple",
        "first",
        "M1",
        "last year's",
        "First",
        "45%",
        "a full decade",
        "28 Watt",
        "2560",
        "six hours and eight minutes",
        "AliExpress",
        "the last couple of years",
        "4",
        "7.6 inch",
        "MacBook Pro",
        "M3",
        "CPU",
        "max",
        "40 micron",
        "six",
        "LCD",
        "a couple seconds",
        "Spotify",
        "Intel",
        "about 70%",
        "Windows",
        "four",
        "USB Type-C. Audio",
        "less than half",
        "all day",
        "five years later",
        "AMD Gaming",
        "10",
        "13-inch",
        "jack",
        "15",
        "12",
        "HDMI",
        "1,300",
        "two",
        "30",
        "Core",
        "43 minutes",
        "the XPS 13 Plus",
        "Android",
        "Asus Flow X13",
        "XPS",
        "three to 10 minutes",
        "a few minutes",
        "today",
        "a few short hours",
        "RAM",
        "8",
        "a Touch Bar",
        "four inch",
        "Anycubic LighTurbo",
        "AMD",
        "USB",
        "XPS 13 Plus",
        "70%"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "FAC",
        "MONEY",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "PERCENT",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "TIME",
        "TIME",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PERCENT"
    ],
    "vector": [
        -0.1356000155210495,
        0.0022118831984698772,
        -0.031106535345315933,
        -0.04594165086746216,
        0.08511709421873093,
        0.04096551984548569,
        -0.0006443587481044233,
        -0.01313396543264389,
        -0.004319154191762209,
        -0.042335886508226395,
        0.043810561299324036,
        0.0056989495642483234,
        -0.025302860885858536,
        -0.055921681225299835,
        0.03351724520325661,
        0.03353229910135269,
        0.052194077521562576,
        -0.10447321087121964,
        0.03391363099217415,
        0.038055095821619034,
        -0.02261006273329258,
        -0.07740102708339691,
        0.029421605169773102,
        0.016674352809786797,
        0.03612133115530014,
        -0.011431989260017872,
        0.014185918495059013,
        0.006252618040889502,
        -0.029529111459851265,
        -0.06482211500406265,
        -0.014013133943080902,
        0.11217023432254791,
        -0.0024287812411785126,
        -0.03038945235311985,
        0.03370629996061325,
        -0.07937885075807571,
        0.04802336171269417,
        -0.09954681992530823,
        -0.10736169666051865,
        -0.08903826028108597,
        -0.09008929133415222,
        -0.021930888295173645,
        0.02174997329711914,
        0.023858778178691864,
        0.013137318193912506,
        -0.06897959113121033,
        0.014890915714204311,
        -0.10090524703264236,
        0.017151089385151863,
        0.0020042064134031534,
        -0.0025562881492078304,
        -0.10270015150308609,
        0.015584548935294151,
        0.04049929976463318,
        0.009461592882871628,
        0.06465412676334381,
        -0.03211796656250954,
        -0.027152622118592262,
        0.0360042080283165,
        -0.07692602276802063,
        0.03363039344549179,
        -0.06616611033678055,
        -0.03929517790675163,
        0.057574402540922165,
        0.02713336981832981,
        -0.02531435340642929,
        -0.08672039210796356,
        0.07112127542495728,
        -0.06527137011289597,
        -0.0012903291499242187,
        -0.022843508049845695,
        0.0010730888461694121,
        -0.01959140971302986,
        0.08294421434402466,
        0.030836857855319977,
        0.019489441066980362,
        0.059503935277462006,
        -0.05516427755355835,
        -0.034213293343782425,
        0.009603770449757576,
        -0.0070898025296628475,
        -0.02136937901377678,
        -0.04327110946178436,
        -0.012309993617236614,
        0.07705482840538025,
        -0.03136376291513443,
        -0.0010939995991066098,
        0.0035975943319499493,
        -0.047931473702192307,
        -0.08900822699069977,
        -0.04298405349254608,
        0.09590092301368713,
        0.02342270314693451,
        0.017271509394049644,
        -0.005224793218076229,
        0.021401317790150642,
        0.042275745421648026,
        -0.1207374557852745,
        -0.008343856781721115,
        0.0839967280626297,
        0.09329048544168472,
        0.02499197982251644,
        0.007684813346713781,
        -0.0006575385923497379,
        -0.037192847579717636,
        -0.06748698651790619,
        0.06331784278154373,
        0.12557540833950043,
        0.014622589573264122,
        -0.04290781915187836,
        -0.01331198401749134,
        -0.003787372959777713,
        -0.07918240875005722,
        -0.10493991523981094,
        -0.02367270179092884,
        0.04514947906136513,
        -0.025986630469560623,
        0.08199463039636612,
        0.1017792746424675,
        -0.031064068898558617,
        0.008323000743985176,
        -0.015926361083984375,
        -0.05484945699572563,
        0.06366667151451111,
        0.004597965162247419,
        0.03601748123764992,
        -0.07988917082548141,
        -2.7913929866389222e-33,
        -0.004861714318394661,
        0.028225556015968323,
        -0.08259375393390656,
        -0.016662733629345894,
        0.11615931242704391,
        0.004208237864077091,
        0.03630003333091736,
        -0.007558101322501898,
        -0.10261542350053787,
        0.012597446329891682,
        -0.053114715963602066,
        -0.004392777103930712,
        -0.05394388362765312,
        0.06264517456293106,
        0.022145122289657593,
        -0.13257522881031036,
        -0.025587938725948334,
        0.014604400843381882,
        -0.03983166068792343,
        -0.043297797441482544,
        -0.00641822163015604,
        -0.03674688562750816,
        0.023213690146803856,
        -0.0721685141324997,
        0.09449884295463562,
        0.009188925847411156,
        0.003820516634732485,
        0.04499973729252815,
        0.038421500474214554,
        0.04659607633948326,
        -0.044522855430841446,
        -0.008239369839429855,
        0.014565850608050823,
        -0.09888473153114319,
        -0.027769125998020172,
        0.0318305641412735,
        -0.08151080459356308,
        -0.07884535938501358,
        0.024805011227726936,
        -0.05080145224928856,
        -0.027055952697992325,
        0.05934169143438339,
        -0.08162011206150055,
        -0.05511728301644325,
        -0.0013895236188545823,
        0.059517648071050644,
        0.021457960829138756,
        0.01127701811492443,
        0.05566483363509178,
        -0.03551613539457321,
        -0.034332744777202606,
        -0.040170710533857346,
        -0.10156183689832687,
        -0.018141748383641243,
        0.004271496087312698,
        0.008667624555528164,
        0.013168872334063053,
        0.03707702457904816,
        0.04355399310588837,
        0.04504437372088432,
        0.06139754503965378,
        0.007824325934052467,
        0.050682373344898224,
        -0.06033538281917572,
        -0.046058930456638336,
        0.06637478619813919,
        0.08193439245223999,
        0.07371257245540619,
        -0.10296523571014404,
        0.017133982852101326,
        -0.11542528122663498,
        -0.021585939452052116,
        0.04296749830245972,
        -0.041065238416194916,
        0.008188129402697086,
        0.001901503186672926,
        -0.12822023034095764,
        -0.08103952556848526,
        -0.0069039929658174515,
        0.02343055233359337,
        -0.07730255275964737,
        -0.009682456962764263,
        0.02234134078025818,
        0.009047992527484894,
        0.008837323635816574,
        0.0069832224398851395,
        -0.01487769652158022,
        -0.05262485891580582,
        -0.031314387917518616,
        -0.005586206912994385,
        -0.028396179899573326,
        -0.020621735602617264,
        0.03933645784854889,
        -0.0012014112435281277,
        -0.08865158259868622,
        -1.2309299297230973e-33,
        -0.05212355777621269,
        0.03401762619614601,
        -0.023539600893855095,
        -0.013536268845200539,
        0.025825966149568558,
        0.005430786870419979,
        0.015564207918941975,
        -0.005661959294229746,
        0.017446137964725494,
        0.01867659017443657,
        0.05989188328385353,
        0.034767478704452515,
        -0.16106665134429932,
        -0.0466298833489418,
        -0.0019590328447520733,
        0.005785785615444183,
        -0.014895308762788773,
        -0.053333234041929245,
        0.046283237636089325,
        0.0059173451736569405,
        0.05718202516436577,
        0.006863647140562534,
        -0.057876646518707275,
        0.008691901341080666,
        -0.010785218328237534,
        0.02218376286327839,
        0.06004343926906586,
        0.04146621748805046,
        0.03937388211488724,
        0.004083604551851749,
        0.003971710801124573,
        -0.04119178652763367,
        -0.05689844861626625,
        -0.002584438305348158,
        0.07396817207336426,
        0.007333323359489441,
        0.043857187032699585,
        0.03383643925189972,
        -0.009250466711819172,
        -0.025508321821689606,
        0.015516731888055801,
        -0.011591048911213875,
        -0.016737814992666245,
        0.010609198361635208,
        0.030247751623392105,
        -0.030923351645469666,
        -0.0031143161468207836,
        -0.03828053921461105,
        -0.032152723520994186,
        0.024050412699580193,
        -0.05014101415872574,
        -0.04696010425686836,
        0.06278038769960403,
        0.05251672863960266,
        -0.012963167391717434,
        -0.07325771450996399,
        -0.021440371870994568,
        0.10965390503406525,
        0.031311217695474625,
        -0.06537080556154251,
        0.03251853585243225,
        0.005703416187316179,
        -0.03611687198281288,
        -0.022416776046156883,
        0.018704840913414955,
        -0.009280751459300518,
        0.02820380963385105,
        0.026882659643888474,
        -0.03447423875331879,
        0.003979840315878391,
        -0.030803190544247627,
        -0.03469320014119148,
        -0.07929584383964539,
        -0.06055556237697601,
        -0.0678628459572792,
        0.041761837899684906,
        0.06862287223339081,
        -0.013312040828168392,
        -0.008723645471036434,
        -0.03338170796632767,
        -0.056873369961977005,
        0.04768366366624832,
        0.04442298784852028,
        0.01773219183087349,
        0.061175666749477386,
        0.036016467958688736,
        0.029663780704140663,
        0.029101796448230743,
        -0.04531550779938698,
        0.02500673197209835,
        -0.02821262739598751,
        0.027115684002637863,
        -0.0025635790079832077,
        0.02296086959540844,
        -0.0070840646512806416,
        -6.413361575141607e-08,
        -0.05674279108643532,
        0.006609780713915825,
        -0.03915851190686226,
        0.021032074466347694,
        0.014570819213986397,
        -0.07142080366611481,
        0.025120161473751068,
        -0.00034013696131296456,
        0.02456464245915413,
        -0.00036980435834266245,
        0.04091108962893486,
        -0.12731269001960754,
        -0.011829790659248829,
        -0.019036665558815002,
        0.0005246665677987039,
        0.027427159249782562,
        -0.04732365906238556,
        0.06470184028148651,
        -0.03520399332046509,
        -0.037252891808748245,
        0.01206771656870842,
        0.09938228130340576,
        0.11522811651229858,
        -0.019665943458676338,
        0.019850393757224083,
        0.05109962448477745,
        -0.05210774019360542,
        0.05618848279118538,
        0.12364862114191055,
        -0.08237483352422714,
        -0.02801225334405899,
        0.016663117334246635,
        -0.023424070328474045,
        -0.025558602064847946,
        0.0022913513239473104,
        -0.008144933730363846,
        -0.014194611459970474,
        0.023745093494653702,
        0.13448065519332886,
        0.03266758471727371,
        -0.01948557049036026,
        -0.05280371010303497,
        0.030474090948700905,
        0.018335377797484398,
        0.013563885353505611,
        0.032378602772951126,
        0.01911361888051033,
        -0.0997590720653534,
        -0.0012836601817980409,
        0.10657999664545059,
        -0.02715548314154148,
        -0.07657478749752045,
        0.01167339738458395,
        0.0022598132491111755,
        0.07751890271902084,
        0.04115176945924759,
        -0.0344015434384346,
        0.10451852530241013,
        0.017168575897812843,
        0.1031964123249054,
        0.08233685046434402,
        -0.07213971763849258,
        -0.05590680241584778,
        0.11048128455877304
    ]
}