{
    "id": "EOFo-t4tmvI",
    "title": "1,000 photos with Hasselblad’s new 100MP camera",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-09-08T16:00:15Z",
    "video_url": "https://www.youtube.com/watch?v=EOFo-t4tmvI",
    "category": "Science & Technology",
    "tags": [
        "hasselblad",
        "hasselblad x2d 100c",
        "hasselblad x2d 100c specs",
        "hasselblad x2d 100c price",
        "hasselblad x2d 100c announcement",
        "hasselblad x1d",
        "medium format cameras 2022",
        "medium format versus full frame",
        "best medium format camera in 2022",
        "hasselblad x2d 100c medium format camera",
        "hasselblad x2d 100c leaked photos",
        "fuji gfx100 vs hasselblad x2d 100c",
        "camera rumors",
        "photography",
        "tech"
    ],
    "views": 339871,
    "likes": 8330,
    "comments_count": 450,
    "description": "Hasselblads $8,199 X2D 100c is utterly Hasselblad: an incredibly well-built camera that takes stunning photos pretty damn slowly. Its not a workhorse, its a luxury cruiser and has a digital medium format, 43.8 x 32.9mm back-side illuminated CMOS sensor that provides very high-quality, 16-bit color photos with 15 stops of dynamic range. In the mirrorless camera megapixel race the X2Ds 100 of them is only beaten by Fujifilms GFX 100 and 100s 102MPs. But even with that large price tag Hasselblad left out some key features that might deter even long-time fans away from this device.   Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/3TXbWmv",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- I've had Hasselblad's long rumored X2D 100C for two weeks now. I've taken over a thousand photos with it, and I can confidently say, that it is a great camera but it has one major downside and quite honestly a niche group of people that might actually be able to own it. I'm Becca Farsace, welcome back to Full Frame, bud. The $8,100 X2D 100C is utterly Hasselblad, which means that it's incredibly well built and it takes stunning photos, but it does it pretty damn slowly. And in the mirrorless camera megapixel race the X2D's 100 of them is only beaten by Fuji films GFX 100 and 100S's 102 megapixels. The X2D's digital medium format, 43.8 by 32.9 millimeter backside illuminated CMOS sensor, physically makes a full frame sensor look baby, and it provides very high quality, 16 bit photos with 15 stops of dynamic range. Many photographers will argue that more megapixels doesn't usually mean that much greater image quality and I would mostly agree, but what makes these photos stand out is Hasselblad's true life color science met with a robust sensor and high quality lenses that certainly makes for an image that you feel like you could just reach out and touch. For my testing, I had access to two new Hasselblad XCD lenses. The 350 gram XCD 38V and the 376 gram XCD 55V that both have an F 2.5 to F 32 aperture and both cost $3,699. Any XCD lens will be compatible with this camera. It's just that these new lenses have a better design and faster focusing systems. They are certainly not cheap but they are small and relatively lightweight for being all metal and made for a medium format camera. I also think these are the nicest lenses Hasselblad a has ever released for a digital camera. I love the Hs around the ring and this Hasselblad logo on the side is just, I don't know super nice not to mention these metal lens caps. I mean, come on, it's just so cool. Hasselblad will also be releasing a $4,299. XCD 90V lens that is a bit heavier at 551 grams. I digress, this is the type of camera that you take photos of like cracks in the sidewalk and you show them to your friends. And you're like, yo, bud look at this crack in the sidewalk. It's so crisp. It's like crisper than what I see, you know. Okay. On average, a 3FR raw file, which is the raw files from Hasselblad from the X2D are around 216 megabytes. They are big boys and all those can be conveniently stored on a one terabyte internal drive that has write speeds up to 2070 megabytes per second. And read speeds up to 2,850 megabytes per second. I have been perfectly happy shooting right onto the internal storage of this camera and then downloading it via the included braided USB C 3.1 gen two cable. Now these raw photos, they have a great deal of latitude. So let's pixel peep. When shooting with this system, I found it was better to underexposed than over. I had a much easier time pulling up the shadows than bringing down the highlights. But in low light situations, you have to nail the exposure because once you're shooting around ISO 3,200 or higher the photos will start to show grain in the shadows when pushing those low lights. The good news is, is that there's in-body image stabilization to help. Sensors of this size, they notoriously show every bit of shake but I was able to comfortably shoot at around like one 30th, even one 10th of a second sometimes, without noticing my handshake. All of that being said, I still found that this camera is far more fun to use when there is ample light and bright, bold colors. Also, this camera now goes down to ISO 64. Love that. The issue with the X2D is that it's slow. It feels like every camera manufacturer has turned focusing speeds, frames per second, focusing accuracy up to a hundred. And when you use Hasselblad's latest camera whoa, certainly does not feel that way. This is even with an improved phase detection auto focus system, as opposed to their previous contrast based system. They also have upgraded focus modules in the updated lens series but the camera often hunts for focus and in low light it can be hard to get it to focus on anything at all. In a later firmware release, Hasselblad is promising face detection auto focus but at the time of my review, it's not available. And it is 2022 and not having face detect on auto focus is really a miss. Another time you'll find this system oddly slow is when using the electronic shutter. (car horn beeps) Shut up. Which is a problem in this city. Hasselblad told me that because the sensor is so big, it takes longer for all of that information to read out when you use the electronic shutter, which leads to a rolling shutter problem in still photography because of this, I almost never used the electronic shutter while using this camera. And another thing I didn't use was video. That's because this camera is never going to be able to take a video. Hello, this is edit Becca. The embargo is tomorrow. And a few days ago, I learned that the X2D is never gonna get video capabilities. That is despite their likely being mics in this camera based on the holes for mics on this camera. I did sense the video might be a problem here based on how the electronic shutter was performing. But I didn't think that Hasselblad was gonna give up on it entirely. And now I know for sure. I've thought a lot about if this changes how I feel about this camera entirely and it doesn't because I've always viewed this camera as a photo first camera. I've been using it for weeks only with photo, and I do love using it, but ah, that's a huge feature to be missing in 2022. Regardless, the next section of this video talks all about his hardware and how great it is to hold. So let's get to that. The tops and the bottoms are milled from single pieces of aluminum alloy, and the front just has this massive Hasselblad logo that literally is screaming Hasselblad. I love it, I'd have it no other way. The side grip is curved to match the curve of your palm. And it honestly makes holding the 790 gram body super easy. Up on top, you have a one inch LCD screen that will show the battery percentage when you click the power button once and a hold will turn the camera on. A mode dial for switching modes. You have your ISO, you have your white balance. And of course your shutter button, which is much softer than most of its competitors shutter buttons. It's kind of mushy, and I do wish that when it was fully pressed it had more of a clunk feeling rather than it's click. (button clicks) In the front of the camera under the lens, you have a customizable button along with a dial. Along back, you have a dial as well that clicks in. This touch screen is super responsive LCD screen. And of course it can come out 40 or 70 degrees. The EVF really gets in the way of your screen when the screen is out at 70 degrees. And when looking through the EVF, there is definitely red and green splitting happening on the outer edges. Even when using the diopter, I couldn't get that to go away. Much like it's predecessor, there are only two ports on the side that both open with ease, like really nice springy doors. Woo, that just never gets old. Anyway, one is a CFexpress Type B slot and the other is just a single USB C port. And of course, on the bottom, is the battery compartment. Pop that, click down once, and out she comes. I have been pleasantly surprised with this camera's battery life. CIPA rates it at 420 photos from an a hundred percent charge, which is on the low end for high resolution mirrorless cameras but easily got me through a full day of casual shooting. You have to keep in mind that this camera will not shoot 420 photos quickly. In a day of casual shooting, I was shooting around, I don't know, around 150 photos. So of course one battery was perfectly fine. A new feature to the X2D though is PD 3.0 fast charging up to 30 Watts, which can take a dead battery to full in two hours. And when it's plugged in, it has just a really nice pictorial element on top that shows you how charged it is. The X2D 100 C really has improved upon so many of its predecessors pitfalls. And while there is still so much work to do in the focusing department, like there is so much work to do there. I really enjoyed this camera and that slow speed, it didn't ruin my experience. Taking photos with fast cameras, like the Nikon Z9. the Sony A1, Canon's R5, it truly is a rush and their technology is absolutely impressive, but there will always be a place for a camera that makes you feel like you're on vacation rather than a racetrack. Sadly though, that $8,100 price tag will keep most of us from being able to enjoy it. I mean, okay, the empty nesting orthodontist, the lifelong Hasselblad shooters, or maybe the commercial photographers they won't blink an eye at that price. For most enthusiasts looking to shoot digital medium format, the cheaper Fuji Film GFX 100S will likely be the system that they choose. But I soon think the medium format space is going to get more crowded. Camera companies are having to compete more so than ever with the cameras in our pockets. Case in point, point and shoots are dead, iPhones are everywhere. So the next way to beat phones is to make a large high quality sensor that would never fit no phone. And that offers a superior experience that will entice people to actually drag a whole entire device around with them. I really hope I'm right, 'cause it's about to get so fun if that is true. Let's go 200 megapixel Sony maybe. I've heard about curve sensors. I don't know, it's gonna get crazy. All right, buds. I'm Becca Farsace. Thanks for joining me on another Full Frame.",
    "transcript_keywords": [
        "camera",
        "Hasselblad",
        "Hasselblad long rumored",
        "Hasselblad XCD lenses",
        "photos",
        "Hasselblad XCD",
        "XCD",
        "Hasselblad long",
        "shutter",
        "Hasselblad latest camera",
        "gram XCD",
        "long rumored",
        "Full Frame",
        "Hasselblad logo",
        "shooting",
        "focus",
        "Full",
        "cameras",
        "electronic shutter",
        "sensor"
    ],
    "transcript_entity_values": [
        "551 grams",
        "a hundred",
        "420",
        "LCD",
        "F 2.5",
        "one",
        "55V",
        "ISO 3,200",
        "Becca Farsace",
        "up to 2,850 megabytes",
        "iPhones",
        "2070 megabytes",
        "two weeks",
        "a full day",
        "A1",
        "a hundred percent",
        "Watts",
        "43.8",
        "around 216 megabytes",
        "Hs",
        "200",
        "3.1",
        "Hasselblad",
        "F 32",
        "XCD",
        "EVF",
        "only two",
        "3,699",
        "Canon",
        "790 gram",
        "CMOS",
        "Becca",
        "350 gram",
        "15",
        "two",
        "thousand",
        "150",
        "another Full Frame",
        "376 gram",
        "32.9 millimeter",
        "two hours",
        "3FR",
        "second",
        "USB C",
        "weeks",
        "CFexpress",
        "a day",
        "up to 30",
        "8,100",
        "100S",
        "Sony",
        "first",
        "PD 3.0",
        "100",
        "100C",
        "ISO 64",
        "tomorrow",
        "102 megapixels",
        "16",
        "one 10th",
        "40",
        "70 degrees",
        "R5",
        "a few days ago",
        "2022",
        "4,299"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "NORP",
        "QUANTITY",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERCENT",
        "LOC",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "DATE",
        "MONEY"
    ],
    "vector": [
        -0.06043899059295654,
        0.006038502790033817,
        0.011154531501233578,
        -0.027854952961206436,
        0.10138921439647675,
        -0.09343692660331726,
        0.0009411938372068107,
        0.0922165960073471,
        -0.006866052746772766,
        0.031684909015893936,
        0.006525788921862841,
        -0.020379014313220978,
        0.02939736656844616,
        0.0005551836802624166,
        0.024638446047902107,
        0.014799711294472218,
        0.1552400290966034,
        -0.03337760642170906,
        -0.036903265863657,
        0.04000065103173256,
        -0.05407872423529625,
        -0.11095485091209412,
        0.053909242153167725,
        -0.03470331430435181,
        -0.0010688337497413158,
        0.04584985226392746,
        -0.036511048674583435,
        -0.08402245491743088,
        -0.002139528514817357,
        0.01515292190015316,
        0.02170753851532936,
        0.08052486181259155,
        0.015811091288924217,
        0.008680082857608795,
        -0.003119442379102111,
        -0.06324876844882965,
        0.08154477924108505,
        0.01909601129591465,
        -0.10969581454992294,
        -0.0625443160533905,
        -0.007224378176033497,
        0.0007281991420313716,
        0.003100114641711116,
        0.009409629739820957,
        0.040922217071056366,
        -0.042157359421253204,
        0.0722460225224495,
        -0.025678830221295357,
        0.0027643460780382156,
        -0.016705170273780823,
        -0.060841675847768784,
        -0.058693863451480865,
        0.041948966681957245,
        -0.019196297973394394,
        -0.00259358249604702,
        0.07161063700914383,
        -0.03636421635746956,
        -0.04329376295208931,
        -0.023531703278422356,
        -0.005918997339904308,
        0.02473142184317112,
        -0.06957626342773438,
        0.004187597427517176,
        0.02417069673538208,
        0.0051737395115196705,
        0.015203124843537807,
        -0.04041769728064537,
        -0.0724947527050972,
        0.051424238830804825,
        -0.012348071672022343,
        0.02971489168703556,
        0.06186731904745102,
        0.00010543803364271298,
        -0.01229248009622097,
        0.0020018531940877438,
        -0.010450849309563637,
        0.12335026264190674,
        -0.0009092952241189778,
        0.05968208238482475,
        -0.12691804766654968,
        0.04964633285999298,
        -0.08958929777145386,
        0.015031866729259491,
        -0.007634492125362158,
        0.03312142193317413,
        -0.07125174254179001,
        0.0311288945376873,
        0.05484401434659958,
        -0.06615769863128662,
        0.0023540204856544733,
        -0.06083399057388306,
        0.047377459704875946,
        -0.053463712334632874,
        -0.015336093492805958,
        -0.02164054475724697,
        0.04647140949964523,
        0.02164943516254425,
        -0.036096397787332535,
        -0.043938979506492615,
        -0.04020056873559952,
        0.015933573246002197,
        0.015528533607721329,
        -0.01598864234983921,
        -0.017943311482667923,
        -0.006249362602829933,
        -0.09201452136039734,
        0.01279355026781559,
        0.06732235103845596,
        -0.009149064309895039,
        0.00567895220592618,
        -0.004917090758681297,
        0.016502555459737778,
        0.000744542689062655,
        0.026403361931443214,
        -0.009414348751306534,
        -0.022834282368421555,
        0.041531406342983246,
        0.013848393224179745,
        0.07474880665540695,
        -0.0503079853951931,
        -0.012368221767246723,
        -0.014636916108429432,
        -0.05582578107714653,
        0.021060554310679436,
        0.03328387066721916,
        -0.02883906476199627,
        -0.029933305457234383,
        5.516320583946475e-33,
        -0.011479676701128483,
        0.09707261621952057,
        -0.06307639926671982,
        0.003578814910724759,
        -0.028147896751761436,
        0.06340974569320679,
        0.01932082697749138,
        0.06396752595901489,
        -0.05828537791967392,
        -0.006569677963852882,
        -0.044195353984832764,
        -0.060640089213848114,
        -0.04632851853966713,
        0.07841392606496811,
        0.06020026281476021,
        -0.061564624309539795,
        0.0247707050293684,
        -0.009316757321357727,
        -0.01283476036041975,
        0.004002598579972982,
        0.04581927880644798,
        -0.010433824732899666,
        -0.004573004320263863,
        0.06611860543489456,
        0.02350807748734951,
        0.061801593750715256,
        0.06438273191452026,
        0.011762270703911781,
        0.08575069159269333,
        0.034105073660612106,
        -0.06080179288983345,
        -0.0244457870721817,
        -0.014827546663582325,
        -0.007918698713183403,
        -0.04493239149451256,
        0.11492437869310379,
        -0.06542877107858658,
        -0.03799273446202278,
        -0.00745423324406147,
        -0.025516163557767868,
        -0.07209193706512451,
        0.07103712111711502,
        -0.10900590568780899,
        -0.09428038448095322,
        -0.011634777300059795,
        0.010461380705237389,
        -0.015774602070450783,
        0.04000048339366913,
        -0.06134263053536415,
        0.028347773477435112,
        0.024638479575514793,
        0.0028709121979773045,
        -0.11561300605535507,
        0.04951181262731552,
        -0.030193021520972252,
        0.0012968728551641107,
        0.04390740767121315,
        -0.0008823266252875328,
        0.061799127608537674,
        0.02952727861702442,
        0.013889645226299763,
        0.021494146436452866,
        -0.0939774140715599,
        0.038527220487594604,
        -0.06216464936733246,
        0.0804031640291214,
        0.07838037610054016,
        0.004740643780678511,
        -0.16964641213417053,
        0.11621185392141342,
        -0.01529589295387268,
        -0.014824890531599522,
        -0.007648380007594824,
        -0.09275525063276291,
        0.1136491522192955,
        -0.01340465061366558,
        -0.011786640621721745,
        -0.013241197913885117,
        0.05389488488435745,
        0.07784010469913483,
        -0.06884120404720306,
        0.05623066797852516,
        0.013044728897511959,
        -0.002257779473438859,
        0.07451450824737549,
        -0.012158972211182117,
        -0.023171257227659225,
        -0.025872699916362762,
        -0.0909094586968422,
        -0.017291409894824028,
        -0.0019784572068601847,
        -0.04368187114596367,
        -0.02527535893023014,
        -0.010541114956140518,
        -0.05735115334391594,
        -4.740776431047963e-33,
        -0.05799693241715431,
        0.001598504837602377,
        -0.034568075090646744,
        0.12697811424732208,
        -0.03133177012205124,
        -0.004956486634910107,
        0.013191859237849712,
        0.11215879023075104,
        0.05927107110619545,
        -0.08785154670476913,
        0.06392153352499008,
        -0.033451300114393234,
        -0.03972620889544487,
        0.002172341337427497,
        -0.016188686713576317,
        0.004155199509114027,
        0.03410511463880539,
        -0.10551689565181732,
        -0.019820792600512505,
        -0.0312194861471653,
        0.03290443494915962,
        0.06624949723482132,
        0.040935393422842026,
        0.04067905992269516,
        -0.03635003790259361,
        0.04874320700764656,
        0.035238102078437805,
        0.02190113626420498,
        -0.02028835192322731,
        -0.05992993712425232,
        -0.07283400744199753,
        0.01292429305613041,
        0.007757732179015875,
        0.002255997620522976,
        0.005263376981019974,
        0.045424483716487885,
        -0.050200626254081726,
        0.015665963292121887,
        -0.04715251550078392,
        0.09096755087375641,
        -0.03191790729761124,
        -0.0002603881002869457,
        0.008930932730436325,
        0.017443081364035606,
        -0.03536215052008629,
        -0.025751952081918716,
        -0.07192493230104446,
        -0.014198453165590763,
        0.05705876275897026,
        0.09588033705949783,
        0.007819924503564835,
        0.011655433103442192,
        -0.006173425819724798,
        0.13167396187782288,
        -0.023774774745106697,
        -0.04524296149611473,
        -0.06638632714748383,
        0.07509767264127731,
        0.02495504915714264,
        -0.01053832471370697,
        0.04152337461709976,
        0.004335248842835426,
        -0.04969070479273796,
        0.010457472875714302,
        0.014672097750008106,
        0.022214915603399277,
        0.021050333976745605,
        -0.013274400494992733,
        -0.07752997428178787,
        0.053330883383750916,
        0.07190970331430435,
        -0.02701801434159279,
        -0.03145604953169823,
        -0.02233871817588806,
        -0.04405004531145096,
        0.04626649618148804,
        -0.012515331618487835,
        -0.0017655554693192244,
        0.08298736065626144,
        -0.019977819174528122,
        0.01865624636411667,
        0.013535839505493641,
        0.1176605373620987,
        0.022243769839406013,
        0.12058304250240326,
        0.012210055254399776,
        -0.057903729379177094,
        0.04624393209815025,
        -0.01610487885773182,
        0.02576262503862381,
        -0.01602410152554512,
        0.01240392867475748,
        -0.008445141837000847,
        0.0028643303085118532,
        0.0640593096613884,
        -5.3278530032230265e-08,
        -0.10602148622274399,
        -0.00649371650069952,
        0.008224565535783768,
        -0.04235449805855751,
        0.05807465687394142,
        -0.0790717676281929,
        -0.02150348387658596,
        0.10049308836460114,
        0.04568685218691826,
        -0.008708002045750618,
        0.1073073223233223,
        -0.05627014860510826,
        -0.0997866690158844,
        0.02014254219830036,
        0.009058930911123753,
        0.024437153711915016,
        0.0025076253805309534,
        -0.05115800350904465,
        0.004565795883536339,
        0.0046485248021781445,
        -0.06649298965930939,
        0.014806848019361496,
        0.012247643433511257,
        -0.0864032432436943,
        0.043047674000263214,
        -0.01427270658314228,
        -0.042493343353271484,
        -0.09622067958116531,
        0.13736499845981598,
        -0.08581013977527618,
        -0.06512951105833054,
        -0.05929911881685257,
        0.06660278886556625,
        0.038933854550123215,
        0.014611972495913506,
        -0.03198547661304474,
        -0.06610295176506042,
        0.01820369064807892,
        0.048605211079120636,
        -0.03509583696722984,
        0.0075135608203709126,
        -0.024508057162165642,
        0.024539697915315628,
        0.04167191684246063,
        -0.0017104919534176588,
        -0.04555864632129669,
        0.004557903856039047,
        -0.049496691673994064,
        -0.07037749886512756,
        0.014850381761789322,
        -0.025523321703076363,
        -0.018527185544371605,
        0.027001768350601196,
        -0.0017016117926687002,
        -0.011813187040388584,
        0.04442451894283295,
        0.009774988517165184,
        -0.006267643067985773,
        -0.04693051427602768,
        0.08213670551776886,
        0.05625727027654648,
        -0.1037273108959198,
        -0.062102049589157104,
        0.09294043481349945
    ]
}