{
    "id": "eP6LtcH8724",
    "title": "Huawei P30 Pro Review: Telephoto Telephone",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-04-07T15:30:59Z",
    "video_url": "https://www.youtube.com/watch?v=eP6LtcH8724",
    "category": "Science & Technology",
    "tags": [
        "huawei p30 pro review",
        "huawei p30 review",
        "best camera phone 2019",
        "best phone camera 2019",
        "huawei p30 pro",
        "mrmobile",
        "michael fisher",
        "android central"
    ],
    "views": 494834,
    "likes": 14852,
    "comments_count": 1077,
    "description": "Sponsored by dbrand. Get your Huawei P30 Pro skins here:     [HUAWEI P30 PRO REVIEW]  The Huawei P30 Pro just stole the crown of world's most versatile camera. See how the rest of the smartphone stacks up in the MrMobile Huawei P30 Pro review!    [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S HUAWEI P30 PRO REVIEW]  MrMobile's Huawei P30 Pro Review was produced following eleven days with a Huawei P30 Pro review device on loan from Huawei. It was tested on Google Fi in Paris, France; Boston, MA, USA; and New York City, NY. The device received one software update during the review period.   DISCLOSURE: Huawei provided travel and lodging for the Paris segment of the P30 Pro launch to some members of the media, including MrMobile. No additional compensation was sought or furnished.   [MUSIC]  Home Organ by Zach Nicita, available at Premium Beat:   As Science Progresses by Aulx Studio, available at Premium Beat:   Much More by Eternity Bro, available at Premium Beat:   Burning Man\" by Zac Nelson, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   See additional disclosures above.  #huawei #p30pro #p30 #huaweip30pro #smartphone #tech",
    "description_links": [
        "https://dbrand.com/mrmobile-p30",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.premiumbeat.com/royalty_free_music/songs/home-organ",
        "https://www.premiumbeat.com/royalty-free-tracks/as-science-progresses",
        "https://www.premiumbeat.com/royalty-free-tracks/much-more",
        "https://www.premiumbeat.com/royalty-free-tracks/burning-man",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] There's a reason Huawei puts all its branding sideways on its P series devices, it wants you to think of them as cameras, just as much as their smartphones. And given the telescope crammed into this one, that makes sense. But the fact remains that when you're not using it like this, you're using it like this. So today, I'm tackling all the smartphone stuff first. (upbeat music) I wanna kick it off with a peek behind the curtain. Huawei actually gave me a different color review device than I asked for, and like Sheryl Crow might say, it's my favorite mistake. See, in photos and videos, the more striking color options are the aurora and amber sunrise, but in person, this breathing crystal finish is absolutely stunning. So much so that I think the Polar Seltzer company has a better name for it, I now call this Unicorn Kisses. And if you happen to get a boring color like poor Daniel Bader over at Android Central, pay a visit to my sponsor dbrand who hooked my up with this black Swarm Skin. Or if you get a fancy color you really don't like, you can always tone it down with options from bamboo to matte black. You've been watching these long enough folks, you know the deal, they're the best vinyl skins in the business and the link to dbrand is down in the description. Time for a salute to science. As you may recall from my hands on video, the P30 Pro does away with an earpiece. In it's place, an electro magnetic actuator that vibrates the display to produce sound. I was skeptical about the audio quality, I thought it was gonna be a mushy mess. So I made a ton of calls on this thing and it turns out, it's just like using a phone with a conventional earpiece. It's crisp and loud and callers said the same about my sound quality too. The only disadvantage is that we're now back to only one speaker at the bottom edge for media and speaker phone calls. It's fine, but it's still kind of a bummer. On the subject of bummers, the P30 Pro's software is it's weakest offering, but in the spirit of changing things up, I'm first gonna talk about it's successes. It's very useful for people like me to have a builtin screen recorder. In fact, Huawei is really good at screen capture in general. With it's custom knock knock gesture and scroll capture for those long lists of battery stats. I'll show you those in a second. It's also a very fast phone, even down to the optical fingerprint sensor. Typically a sluggish component. And I like the mechanic of pinning an app to the task switcher so you can prevent it from being closed in the background. But taken as a whole, the software is still bad. And I think I finally figured out a short way of saying why, it's a mishmash of ideas from elsewhere. Huawei has taken it's look and feel from IOS, so instead of a swipe down gesture giving you the notification shade, you get a ripoff of the iPhone Finder instead. It even triggers when you're scrolling in widgets, which is great. The consolation prize is this quick trigger down here copied from LG. Try to edit an image with pinch to zoom and you'll get Huawei's Amazon shopping clone instead. My phone won't remember my browser preference for some reason. And the legendary battery life I keep teasing has a price. The system militantly polices background processes. I've had Pocket Casts close while I was listening to a podcast. Now to be fair, that's happened on other android handsets as well, but typically not those with this much RAM. And while I'm listening to those podcasts, with the screen off, I still can't quickly open the camera because Huawei maps the quick launch for the camera to the volume key, not the power button like everyone else. But you know what? I'll put up with anything if it means I get to use these cameras. Call the new one a periscope, call it a telescope, what it is is a 5X optical zoom assembly that gets you much closer to a subject. Now this kind of thing is only good for peeping Toms and spies, right? I don't think so, Tim. Just look at the framing possibilities this gives you. A popular one I shared from Paris was putting my phone up against a shop window and punching in on these wristwatches. Or look at the fun you can have with depth with the Eiffel Tower just looming in the background here. Photos that would be dull were they framed wide become intentional and compelling with zoom. And because that zoom starts with a solid optical foundation at 5X, it's still crisp enough at 10X, at least for Instagram. Yes you can crank it up to 50, but that's just cropping further and further in, introducing more wobble and more noise, so I've taken to stopping at 10X in most settings. Now that telephoto camera is not built for low light, but fortunately the P30 Pro brings Huawei's Night Mode which helps substantially in this evening photo of the Schrafft's building here in Boston. Same with the phone's ultra wide angle camera. It's also not built to capture a lot of light, so Night Mode makes what would otherwise be a dull and dark washout into something usable. You'll never wanna do this, shoot in pitch darkness with any phone camera, but in this case, it's interesting to compare the P30 Pro with Google's Pixel 3, whose Night Sight feature was the king of low light photography. In less extreme settings, Night Mode helps bring out the details in the shadows. This photo wouldn't have gotten the fully creepy mood I was after without Night Mode bringing out the texture of the grass. Now even phones that take great stills can choke when it comes time to put those stills into motion. And the P30 Pro does stumble a bit on video. It's nice to see optical stabilization on two of the three cameras, even the electronic stabilization on the ultra wide is pretty good. But it's the color science that suffers. It's just so much saturation. Flesh tones red shifting so hard, it looks like every other person has a sunburn. Here you can see the color shift across cameras even more markedly, punch out to the ultra wide and everything gets a bit more muted, and therefore more accurate. But here again, the zoom kind of rescues it from those failings. I spent almost the entirety of an hour long layover at Dublin just filming inbound aircraft because I've never been able to zoom like this. Same goes for this chase shot out the window of an Amtrak train along side a highway. I've never played traffic helicopter before because I've never been able to. So how can it improve? Well my friend Danny Winget has been saying for a long time that Huawei phones tend to overexpose and he's right. It would be nice if I didn't have to manually bump it down with most shots. Also, while the selfie camera has been substantially improved, I'd have really enjoyed seeing a wide angle lens fitted. The Pixel 3 still wins here. As much as I love watching Night Sight work, it does tend to erase all the drama, 'cause it wipes out pretty much all the contrast. It would be cool to be able to tune it more precisely. And I'd like it if Huawei took a note from Samsung and moved the zoom controls to where you can actually use them with one hand. If we were to confine this discussion to just the primary camera, I'd probably still prefer my Pixel 3 for a lot of stills. And the iPhone 10S definitely wins in terms of video processing. But I tend to place the most value in phone cameras that let me shoot across a wide range of situations. And taken together, the ultra wide plus wide plus telephoto with 10X usable zoom plus the best night mode around and the ability to use that ultra wide as a macro close up shooter, to me it's not even a contest. The P30 Pro is now the most versatile camera phone of 2019. It's an absolute stunner! Let's bring it home with the battery. Bottom line, you can use this phone all day long and still bring it home with plenty of gas in the tank. It's not about screen on time folks, I listened to music or podcasts over Bluetooth all day long. And I fired up the camera every 15 minute, so my phones will never be SOT champs. If you ask me, the only metric that matters is charge left at the end of the day. And in my 11 days with the phone, I've never seen the low battery warning. Every 16 to 18 hour day, I finish up with more than 40% remaining. And the one time I did intentionally run it down to 9%, the 40 watt charger in the box shot it back up to 90% in 40 minutes! The P30 Pro is on sale now for 999 up to 1249. Euros of course, since it's not sold in the US. Whether that's a result of economic protectionism or pragmatic strategic caution, I'll leave to others to debate. I'm here to talk about mobile technology. And the Huawei P30 Pro is one of the most impressive pieces of mobile technology that you can buy today. Disclosure folks, portions of this review where filmed at the P30 Pro launch event in Paris for which Huawei provided travel and lodging to members of the media. The reviewed device you saw in this video is a loaner from Huawei. As always, I neither sought not accepted compensation for this review and I don't grant manufacturers copy review which Huawei is seeing this at the same time you are. If that's the kind of review you'd like to continue seeing, please subscribe to the Mr. Mobile on YouTube. See more photos from the phone at the same handle on Instagram and let me know what you think of the P30 Pro. Drop a comment below. Until next time, thanks for watching. And stay mobile my friends!",
    "transcript_keywords": [
        "Huawei",
        "Night Mode",
        "Pro",
        "Huawei Night Mode",
        "phone",
        "Pro brings Huawei",
        "camera",
        "Night",
        "wide",
        "brings Huawei Night",
        "ultra wide",
        "zoom",
        "branding sideways",
        "Huawei phones tend",
        "color",
        "Huawei Night",
        "cameras",
        "Time",
        "Mode",
        "Huawei phones"
    ],
    "transcript_entity_values": [
        "the P30 Pro",
        "Huawei",
        "Tim",
        "a ton",
        "amber sunrise",
        "Instagram",
        "the Eiffel Tower",
        "up to 90%",
        "The P30 Pro",
        "Samsung",
        "Polar Seltzer",
        "my 11 days",
        "999",
        "Android Central",
        "Pixel 3",
        "The P30 Pro",
        "50",
        "YouTube",
        "40 watt",
        "Mobile",
        "today",
        "Daniel Bader",
        "US",
        "Boston",
        "iPhone",
        "first",
        "9%",
        "1249",
        "the P30 Pro's",
        "Michael",
        "Schrafft",
        "Toms",
        "two",
        "Euros",
        "Sheryl Crow",
        "IOS",
        "Night Mode",
        "Amtrak",
        "evening",
        "Unicorn Kisses",
        "second",
        "Paris",
        "Dublin",
        "Pocket Casts",
        "2019",
        "Danny Winget",
        "every 15 minute",
        "LG",
        "16 to 18 hour day",
        "more than 40%",
        "Night Sight",
        "the P30 Pro with Google's Pixel 3",
        "only one",
        "the iPhone Finder",
        "10S",
        "three",
        "one",
        "Amazon",
        "the end of the day",
        "40 minutes"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "ORG",
        "FAC",
        "PERCENT",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "FAC",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "DATE",
        "PERSON",
        "GPE",
        "GPE",
        "ORG",
        "ORDINAL",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "ORDINAL",
        "GPE",
        "GPE",
        "PERSON",
        "DATE",
        "PERSON",
        "TIME",
        "ORG",
        "TIME",
        "PERCENT",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME"
    ],
    "vector": [
        -0.09275354444980621,
        0.020616916939616203,
        0.021065309643745422,
        -0.11529720574617386,
        0.04276517406105995,
        -0.05876411125063896,
        -0.013051707297563553,
        0.015016157180070877,
        -0.009870710782706738,
        0.07913000136613846,
        0.09170238673686981,
        0.045615267008543015,
        0.04478650167584419,
        -0.012008941732347012,
        0.06380046159029007,
        0.01844930276274681,
        0.05444980785250664,
        -0.09013360738754272,
        0.026788098737597466,
        0.03431101143360138,
        -0.010085687041282654,
        -0.06201322376728058,
        0.08772270381450653,
        -0.014236378483474255,
        0.02884446457028389,
        -0.0394015833735466,
        -0.06184074655175209,
        0.0830974131822586,
        -0.00290863960981369,
        -0.02019411511719227,
        -0.01795843616127968,
        0.09433067589998245,
        0.04545191302895546,
        -0.004170480649918318,
        0.00692919734865427,
        -0.054026082158088684,
        -0.01808459497988224,
        -0.01271246187388897,
        -0.05930096283555031,
        0.007827382534742355,
        0.010913079604506493,
        -0.0244663767516613,
        -0.031132139265537262,
        0.007635321002453566,
        0.0071847885847091675,
        -0.01649513654410839,
        -0.01715208776295185,
        -0.023581894114613533,
        -0.026832491159439087,
        -0.0004295846738386899,
        0.013091474771499634,
        -0.0017464206321164966,
        0.01898907497525215,
        -0.011406687088310719,
        -0.15799736976623535,
        0.0363515168428421,
        0.01623242162168026,
        0.06801745295524597,
        0.05674976110458374,
        0.003942255862057209,
        -0.05309062451124191,
        0.0360678993165493,
        -0.08879836648702621,
        0.03526425361633301,
        0.03131335973739624,
        0.03929607570171356,
        0.011312112212181091,
        -0.05694090574979782,
        0.03323398903012276,
        -0.017323164269328117,
        -0.030271044000983238,
        0.041524987667798996,
        0.04778274521231651,
        -0.011211629025638103,
        -0.05203491821885109,
        0.052923720329999924,
        0.01883397437632084,
        -0.015401833690702915,
        -0.07526596635580063,
        -0.01414569653570652,
        0.021914539858698845,
        -0.038223881274461746,
        -0.06501483917236328,
        -0.06287980079650879,
        0.07485372573137283,
        0.015552815981209278,
        -0.02551935240626335,
        0.08883056044578552,
        -0.08157006651163101,
        -0.04559333994984627,
        -0.08974809944629669,
        0.08072799444198608,
        -0.10861696302890778,
        -0.02758452668786049,
        -0.057514507323503494,
        0.017638318240642548,
        -0.01776033826172352,
        -0.05383582040667534,
        -0.058759987354278564,
        -0.005201473366469145,
        0.029516005888581276,
        0.009182414039969444,
        -0.005183682776987553,
        -0.010721804574131966,
        0.062004998326301575,
        -0.058376263827085495,
        -0.03055509552359581,
        -0.0056714448146522045,
        0.0099860904738307,
        0.03826340287923813,
        -0.07377471029758453,
        0.04003645479679108,
        -0.06309725344181061,
        -0.07675512880086899,
        -0.02670607529580593,
        0.06315881013870239,
        -0.07079857587814331,
        0.02643890120089054,
        0.07504700124263763,
        -0.06688902527093887,
        -0.019843336194753647,
        -0.06136062741279602,
        -0.062017008662223816,
        -0.09519340842962265,
        -0.01308654434978962,
        -0.015231410972774029,
        0.04228971153497696,
        6.680148520678836e-33,
        0.030083589255809784,
        0.10937938094139099,
        0.006427790969610214,
        -0.027638910338282585,
        0.007249457761645317,
        -0.0065963841043412685,
        0.06388107687234879,
        0.037195801734924316,
        -0.02314385585486889,
        -0.025668218731880188,
        -0.0526931993663311,
        -0.007376186084002256,
        -0.030505873262882233,
        0.004820207599550486,
        0.04817350208759308,
        -0.018650664016604424,
        -0.01601528376340866,
        -0.028001543134450912,
        -0.016243940219283104,
        0.004729977808892727,
        0.0012701397063210607,
        -0.0709291622042656,
        0.0302574560046196,
        -0.017077190801501274,
        -0.004184116143733263,
        0.06500258296728134,
        0.03935753554105759,
        0.01180355716496706,
        0.08072183281183243,
        0.01894749142229557,
        -0.1423778533935547,
        0.013276164419949055,
        0.046505335718393326,
        -0.03966899961233139,
        0.024917861446738243,
        0.0517994686961174,
        -0.04843709245324135,
        -0.08745881915092468,
        -0.06696607172489166,
        -0.016407987102866173,
        -0.011225932277739048,
        0.016327185556292534,
        -0.10872171074151993,
        -0.027496540918946266,
        -0.015163692645728588,
        -0.04110884666442871,
        -0.06505168229341507,
        0.026386238634586334,
        -0.030857842415571213,
        0.030844012275338173,
        0.010919518768787384,
        0.013800496235489845,
        -0.07429270446300507,
        0.023268086835741997,
        -0.06681597977876663,
        -0.013713561929762363,
        0.021167051047086716,
        -0.013232637196779251,
        0.004715000744909048,
        0.032691262662410736,
        0.13226285576820374,
        0.013583830557763577,
        0.007092750631272793,
        0.05932419002056122,
        -0.02964203804731369,
        0.02217879146337509,
        0.013227726332843304,
        -0.019095059484243393,
        -0.0027559150476008654,
        0.10761899501085281,
        -0.05723598226904869,
        -0.045860446989536285,
        0.008589151315391064,
        -0.03922617435455322,
        0.05551711469888687,
        0.038962412625551224,
        -0.07905420660972595,
        0.016611363738775253,
        -0.022192561998963356,
        0.031700968742370605,
        -0.04159213975071907,
        0.06917267292737961,
        0.017373938113451004,
        0.008161014877259731,
        -0.027427025139331818,
        -0.007607341278344393,
        0.03973354399204254,
        -0.0326077938079834,
        -0.041374027729034424,
        0.04728788509964943,
        -0.06022254750132561,
        -0.060418833047151566,
        0.05319303646683693,
        0.10858321934938431,
        0.011682742275297642,
        -7.909163129294062e-33,
        -0.06608772277832031,
        -0.021792467683553696,
        0.04237017035484314,
        -0.08161289989948273,
        -0.030129266902804375,
        -0.09881298243999481,
        0.07357751578092575,
        0.05078957974910736,
        0.01449526660144329,
        -0.029750991612672806,
        -0.03160308673977852,
        -0.015271591953933239,
        0.06371018290519714,
        -0.04148073494434357,
        -0.009032867848873138,
        -0.02545635774731636,
        -0.02899123728275299,
        -0.04264421388506889,
        0.04579692706465721,
        0.06739258021116257,
        0.08141355961561203,
        0.019056174904108047,
        0.04163496196269989,
        0.08558714389801025,
        -0.09024371951818466,
        -0.01630195416510105,
        0.05532575771212578,
        -0.003774122102186084,
        0.032531216740608215,
        -0.10350043326616287,
        0.049902718514204025,
        -0.020547501742839813,
        -0.05173911154270172,
        0.04656079038977623,
        0.040121451020240784,
        0.017264869064092636,
        -0.007656532805413008,
        0.03107643313705921,
        0.09917141497135162,
        0.05052201822400093,
        0.05768457427620888,
        0.024438099935650826,
        -0.0026721921749413013,
        -0.01968410238623619,
        0.011674663983285427,
        -0.04218597710132599,
        -0.03830757364630699,
        -0.09192456305027008,
        -0.04820270091295242,
        -0.005624877754598856,
        0.07147986441850662,
        0.03327210247516632,
        -0.06048290431499481,
        0.048398539423942566,
        -0.03815412148833275,
        -0.03230099380016327,
        0.0003484767221380025,
        -0.09505978971719742,
        0.02267087809741497,
        0.009341164492070675,
        0.0547618493437767,
        0.09008824825286865,
        -0.05900153890252113,
        0.017619766294956207,
        -0.10140950232744217,
        0.06851103156805038,
        0.14215651154518127,
        0.0017158705741167068,
        0.023971568793058395,
        0.0993100106716156,
        -0.05571902543306351,
        0.026207145303487778,
        -0.06871549785137177,
        0.021239858120679855,
        0.029858000576496124,
        0.03673398122191429,
        -0.12294439226388931,
        0.09284786880016327,
        0.023681998252868652,
        -0.04311443865299225,
        0.052355170249938965,
        -0.010674371384084225,
        0.005145260598510504,
        0.007450451143085957,
        0.03406423702836037,
        -0.0463971383869648,
        0.031039196997880936,
        -0.027828719466924667,
        0.014155687764286995,
        0.009977827779948711,
        -0.01099091861397028,
        -0.018556006252765656,
        -0.12460723519325256,
        0.07111983746290207,
        0.007409542798995972,
        -5.3745758066270355e-08,
        0.0625104233622551,
        0.007586812600493431,
        0.030690109357237816,
        0.03379666060209274,
        0.024335740134119987,
        -0.11762422323226929,
        0.034797895699739456,
        -0.019649073481559753,
        0.11793036013841629,
        -0.056556832045316696,
        0.025940433144569397,
        -0.11020070314407349,
        -0.027313634753227234,
        -0.0038679568096995354,
        0.008325394243001938,
        0.04569602385163307,
        0.01770773157477379,
        0.07018758356571198,
        0.0012541752075776458,
        0.02252953127026558,
        0.0058518098667263985,
        0.02472224086523056,
        0.041191212832927704,
        -0.06748791038990021,
        0.08155801892280579,
        0.0039748926647007465,
        -0.08567733317613602,
        -0.030667858198285103,
        -0.0006073584081605077,
        -0.02973800152540207,
        0.022017084062099457,
        0.020854465663433075,
        -0.024124901741743088,
        -0.037235185503959656,
        0.045027829706668854,
        0.029381971806287766,
        0.06804338097572327,
        -0.0307071004062891,
        0.025283627212047577,
        0.029448583722114563,
        0.05042652785778046,
        -0.06548459827899933,
        -0.03229989856481552,
        -0.0041673374362289906,
        0.044385503977537155,
        -0.0038007639814168215,
        -0.03330238163471222,
        -0.14072485268115997,
        -0.020221255719661713,
        0.0738493949174881,
        -0.03547215834259987,
        -0.016230233013629913,
        -0.01265152357518673,
        -0.069548599421978,
        0.006790488492697477,
        -0.012451201677322388,
        0.02549547515809536,
        -0.07022709399461746,
        -0.09884896874427795,
        -0.0011883097467944026,
        0.09904754906892776,
        -0.0673837810754776,
        0.08626246452331543,
        0.05370038002729416
    ]
}