{
    "id": "EP8BFkZfWIY",
    "title": "Is Nothing hiding Something under the Glass?! - Teardown!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-08-12T16:46:00Z",
    "video_url": "https://www.youtube.com/watch?v=EP8BFkZfWIY",
    "category": "Howto & Style",
    "tags": [
        "Nothing phone",
        "nothing phone teardown",
        "android",
        "iphone",
        "best smartphone",
        "nothing phone 1",
        "nothing phone repair",
        "take apart nothing phone",
        "nothing",
        "one plus",
        "oneplus",
        "jurassic world movie",
        "new jurassic movie",
        "jurassic world dominion",
        "jurassic world dominion movie",
        "jurassic world dominion buy",
        "new action movies",
        "new movies",
        "new digital movies",
        "new movies buy"
    ],
    "views": 1784495,
    "likes": 135474,
    "comments_count": 2693,
    "description": "Its time to take apart the Nothing Phone! Thank you to Jurassic World Dominion for sponsoring a portion of this video. Jurassic World Dominion Extended Edition is yours to own on 8/16.  You can find their YouTube here:  Thank you #JurrasicWorldDominion! Even though we can see some aspects of the Nothing Phone (1) from the outside... We cant truly see what's going on without analyzing it from the Inside. Today we find out how the Nothing Phone is put together and maybe even how many LED lights make up the glitch below the clear glass.   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://uni.pictures/JWD",
        "https://www.youtube.com/JurassicWorld",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today we are going to take apart the Nothing Phone. But first, and I can't believe I get to stay this, a portion of today's video is sponsored by Jurassic World Dominion. Yes. So I grew up watching the Jurassic Park movies and the very first time I ever remember seeing one was at a department store with a wall of TVs. And the scene that was playing on those TVs was towards the end of the movie with the Dilophosaurus. You know which scene I'm talking about. I did stop going outside after that one. I've seen all of the movies several times already so I was super excited to get special early access to Jurassic World Dominion extended edition, with an extra 14 minutes of never before seen footage. More dinosaurs, more action, and even an alternate opening. You know what's better than one version of a movie? Two versions of the movie. The Jurassic World Dominion extended edition is yours to own on August 16th, and I'll leave a link down in the description. Even though I have an early copy, they specifically said I was not allowed to give away any spoilers. But some of my favorite bonus features that come with the Jurassic World Dominion extended edition are the explanations of how they accomplish the special effects, especially scenes like this one with the feathered pyro-raptor bursting out of the water. Seeing behind the scenes details of how things are made has always been super fascinating for me. For me, these movies are more documentaries. The latest chapter in the Jurassic Era is here, and for the first time ever you can get the Jurassic World Dominion extended edition digitally, 4K, ultra high definition and on blu ray. It is yours to own with the link in the description. And huge thanks once again to Jurassic World Dominion. If you need someone to get eaten by a dinosaur at some point in the future, I'm sure I taste delicious and I am ready to go any time. Thank you Jurassic World Dominion for sponsoring that portion of the video. Now it's time to get back to Nothing. Let's get started. (Intro) I have a few questions as we analyze Nothing from the inside. I'm curious if the aesthetically layered internals are all connected under the glass, or if it's many different pieces all puzzled together. My LED exclamation point is still not illuminating to show my state of charge. But honestly, if that's the only thing not working after the disassembly, I'll consider us lucky. Like usual, first things first, we'll turn off the phone and pull out our heat gun. Heat helps soften the adhesive between the glass and the phone body. Things are made slightly more complicated by the recessed design where the glass is sitting flush inside of the metal rails. It just makes cutting the adhesive a bit more difficult. But luckily with enough heat, the glass lifts out with just a suction cup and we're able to keep it all in one piece. The back glass itself is totally transparent with only a white border around the edge to hide the black adhesive along the perimeter. With it removed we can get our first look at the internals, and by first look I mean we already saw them but now we see them more. All of the layers seem to be made up of their own individual pieces like a puzzle. And it's interesting that they are actually only held in place with adhesive. Like the small red video recording notification has no screws holding it down, just sticky adhesive, which is curious. Anyone who has ever taped something to the wall knows that adhesive on its own doesn't usually last forever. The silver screws under the glass are fully functional, all shiney and stuff. These are probably the 10 most aesthetically pleasing screws that we've ever seen in a smartphone. The screws, of course, hold down the larger plastic segments, but the smaller pieces are each still all held in place with adhesive, including the diffusing layer over the LED strands, which is surprising. These tiny little LEDs themselves have a bit more yellowish warmer tint to them. But if we turn the phone back on and light up the back panel, we can see that the diodes that have the diffusing sticker layer removed have more of a blueish color hue, which looks great when the LEDs are lit, but when the LEDs are off, the yellowness of the strand definitely distracts from the pristine white design. We can see why the diffusing layer is needed. Nothing says there are about 900 little LEDs doing the illumination back here. And I'm probably going to regret this, but if this video gets 50,000 likes I'll count each and every one of them so we can get the exact number, you know, for science. Underneath another piece of plastic held on with just adhesive is the top loudspeaker. The speaker does have a screw holding it in place though so that's not falling off. It'll be interesting to see in a few years if anyone has just pieces of plastic rattling around under their glass back because I don't personally trust adhesive all that much for long periods of time. It does look super cool at first glance though. The earpiece does have waterproof mesh over the opening. The exclamation point LED comes off next, also held in place with only adhesive. It has a ribbon cable leading us under to a little metal bracket. With the rubber stopper removed, the bracket slides over allowing us to pop off the ribbon just like a little Lego. There are quite a few more invisible screws hidden under flaps now that we're getting deeper. The first of which is at the corner of the bottom loudspeaker plastics. There are three more screws hidden underneath the wireless charging flap, and two additional screws hidden under the LEDs near the camera lenses. And it was right about here that I realized that we were doing all of this surgery while the patient is still awake. I would make a terrible doctor. The wireless charging pad and back panel come off in mostly once giant layered piece. At first glance it does seem like the white visible portion of the back panel is the actual 15 watt wireless charger, but upon further investigation, it turns out that the white portion is just a thin plastic veneer. The actual component doing all the heavy lifting is the black covered copper charger underneath the plastic. The white stuff on top just makes it look cool. Next off, removing the bottom plastics we find the lower loudspeaker. Kind of smaller than we normally see. This guy does have a black sticker on top which should be hiding all of the internal foam balls. And indeed these little guys give the soundwaves more surface area to reverberate off of. The balls make the speaker sound bigger than it actually is. The battery inside of the Nothing Phone looks to be held in with just a pull tab. Lifting up the tabs and pulling brings back memories of what the phone was sounding like during the bend test. So I do think we have found what that strange noise was. It was the battery adhesive flexing slightly when the phone was bending. Mystery solved. And also, thumbs up to Nothing for making their batteries removable. I do hope Samsung is watching. This guy is a 4500 milliamp hour capacity. Lithium batteries are recyclable, which is why it's important that they are easy to remove. For some reason, both ribbons underneath the battery say Pokemon, but I guess if you want to be the very best like no one ever was, you gotta look in some very unexpected places to catch them all. I'll pop up some signal wire connections off the daughterboard, which then allows it to come free, exposing the remaining components inside the lower half of the phone. We do have some waterproofing mesh over the loudspeaker vent, a red rubber ring around the charger, and some water mesh over the microphone hole which is nice to see. Even though the phone is only rated for an ip53, which is just a light sprinkling, it does seem to have the water protections in place for far more than that. There is a vapor chamber underneath the battery compartment, once again extending underneath the motherboard. To get that motherboard out there is one additional screw and a few wire cables. And then we can see the top half of the vapor chamber with some thermal paste which helps excess heat flow from the processor to the copper and then out through the front of the phone's display. The camera units are still attached to the motherboard with Lego-style ribbon cables. The top 50 megapixel ultrawide camera does not have the optical image stabilization, but the main 50 megapixel camera right below that does. And of course, we have the tiny 16 megapixel front camera as well. The only thing left inside of the phone now is just the screen. But removing that though would kill the phone. And while I might be mean to phones, I am no monster...usually. So we're going to leave the screen installed and instact for today so we can see if Nothing still turns back on after it's reassembled. Always exciting. Seeing all of the somethings that make up Nothing has been interesting. We found more water protection than anticipated. And found a whole lot of adhesive holding the dimensionally aesthetic rear components together. Time will tell if tht adhesive holds up or not. I mean, if worse comes to worse, a bit of plastic falls off and rattles around underneath the glass for a while, it definitely wouldn't compromise the functionality of the phone. And honestly, having a rattling piece of plastic under the glass would be kind of cool. Makes for a good conversation starter. But yeah, if this video gets over 50,000 likes I'll have to count all the internal LEDs. Rumor is there are over 900, so please think twice about making me count that high. That is a lot of numbers. But there we go. It looks like the phone does still turn on and is functional, minus the LEDs surrounding the cameras. I might have nicked a ribbon or something during the removal, but if you just don't look at that part, we were 100% successful. Hit that subscribe button if you haven't already. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Jurassic World Dominion",
        "Jurassic World",
        "World Dominion extended",
        "World Dominion",
        "Dominion extended edition",
        "Jurassic",
        "Phone",
        "Jurassic Park movies",
        "adhesive",
        "Dominion extended",
        "Dominion",
        "World",
        "back",
        "glass",
        "LEDs",
        "screws",
        "Jurassic Park",
        "plastic",
        "Underneath",
        "time"
    ],
    "transcript_entity_values": [
        "Jurassic Park",
        "about 900",
        "50 megapixel",
        "50,000",
        "Lego",
        "The Jurassic World Dominion",
        "Instagram",
        "100%",
        "two",
        "over 50,000",
        "August 16th",
        "4500 milliamp hour",
        "three",
        "blu ray",
        "Jurassic World Dominion",
        "Two",
        "ip53",
        "the Jurassic Era",
        "half",
        "4",
        "10",
        "Dilophosaurus",
        "a few years",
        "Pokemon",
        "the Nothing Phone",
        "first",
        "15 watt",
        "Time",
        "an extra 14 minutes",
        "today",
        "Samsung",
        "Today",
        "16 megapixel",
        "the Jurassic World Dominion",
        "one",
        "Twitter"
    ],
    "transcript_entity_types": [
        "FAC",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.10769287496805191,
        0.07753732055425644,
        0.06258293986320496,
        -0.052294641733169556,
        0.04981003329157829,
        -0.08138457685709,
        0.0816306322813034,
        -0.029097655788064003,
        0.011085853911936283,
        0.052712805569171906,
        0.06085020676255226,
        -0.013650359585881233,
        -0.0442688912153244,
        0.07328317314386368,
        -0.04061231017112732,
        -0.03624086454510689,
        0.006370920687913895,
        -0.09118957817554474,
        -0.03478406369686127,
        0.05248144268989563,
        0.0467313751578331,
        0.011728806421160698,
        0.0502164326608181,
        -0.09329568594694138,
        -0.00223310524597764,
        0.07408900558948517,
        -0.006827915087342262,
        -0.04598809778690338,
        -0.04764218255877495,
        -0.06346864998340607,
        0.015908589586615562,
        0.05100148543715477,
        -0.048242710530757904,
        -0.04633517190814018,
        0.07165302336215973,
        -0.03132862597703934,
        0.03698216751217842,
        0.056219663470983505,
        -0.038081150501966476,
        -0.012716634199023247,
        -0.04820080101490021,
        0.013912086375057697,
        -0.02744246833026409,
        0.00959454569965601,
        -0.04763663560152054,
        0.008081912063062191,
        0.08561790734529495,
        -0.05908821150660515,
        -0.002279555657878518,
        -0.07163627445697784,
        -0.02365916222333908,
        0.003497849451377988,
        0.014681398868560791,
        -0.03579530119895935,
        -0.07205979526042938,
        0.05808721482753754,
        -0.020229818299412727,
        0.008404811844229698,
        0.03169705718755722,
        -0.03280360996723175,
        0.07774877548217773,
        0.01819244958460331,
        -0.02307146228849888,
        0.06479274481534958,
        0.004295999649912119,
        0.019154107198119164,
        0.031474560499191284,
        -0.04997428506612778,
        -0.05076262727379799,
        -0.026541346684098244,
        0.014006316661834717,
        0.040994394570589066,
        0.03816695138812065,
        -0.05781205743551254,
        -0.01567189209163189,
        0.057677801698446274,
        0.05980249494314194,
        0.00482897600159049,
        -0.02040999010205269,
        0.07417111843824387,
        0.07160207629203796,
        -0.02569430135190487,
        -0.015419015660881996,
        0.021252676844596863,
        0.05902981758117676,
        0.07251138985157013,
        0.030553683638572693,
        0.08220458030700684,
        -0.05517936497926712,
        -0.06417696177959442,
        -0.06844456493854523,
        0.0256277434527874,
        -0.06215397268533707,
        -0.00535683473572135,
        -0.028767453506588936,
        -0.04000682011246681,
        -0.054907433688640594,
        -0.022017667070031166,
        -0.0914916843175888,
        0.07406223565340042,
        0.0205702967941761,
        -0.050867170095443726,
        0.09733306616544724,
        -0.022060943767428398,
        0.03909842669963837,
        0.019040843471884727,
        -0.04822235926985741,
        0.03403850272297859,
        0.04267564043402672,
        0.03831964731216431,
        -0.057981789112091064,
        0.03157128393650055,
        -0.010509327985346317,
        0.04203777760267258,
        -0.04298478364944458,
        -0.05559006333351135,
        -0.018438536673784256,
        0.027669329196214676,
        0.04349195212125778,
        0.005787118338048458,
        0.05109666660428047,
        -0.008422242477536201,
        -0.05564872547984123,
        0.02043890580534935,
        0.038465891033411026,
        0.08134035766124725,
        -0.023525210097432137,
        4.9642151319362325e-33,
        0.08749385923147202,
        0.07919353246688843,
        0.01248974446207285,
        -0.0015554986894130707,
        0.03731488063931465,
        0.05690709874033928,
        0.04613537713885307,
        0.04480240121483803,
        -0.059059664607048035,
        0.07436253130435944,
        -0.016502700746059418,
        0.005985012743622065,
        0.010122315026819706,
        -0.011220895685255527,
        -0.005785834975540638,
        -0.04193287342786789,
        0.004945633467286825,
        -0.02640065923333168,
        -0.0292214285582304,
        -0.046269599348306656,
        -0.04969409853219986,
        0.042095035314559937,
        -0.05300210416316986,
        0.024438969790935516,
        0.07303973287343979,
        0.08860897272825241,
        -0.003484610700979829,
        -0.05056385323405266,
        0.0032961342949420214,
        0.030187521129846573,
        -0.08271222561597824,
        0.04829110577702522,
        0.05021815747022629,
        0.04667903855443001,
        0.023247696459293365,
        0.013548141345381737,
        -0.03920304775238037,
        -0.12555880844593048,
        0.005750570446252823,
        -0.06142495572566986,
        -0.11128643155097961,
        0.019872471690177917,
        -0.02812095917761326,
        -0.012675994075834751,
        -0.0336495041847229,
        -0.011593016795814037,
        -0.006417137570679188,
        0.08326956629753113,
        -0.05227862298488617,
        0.05843687802553177,
        0.001040616538375616,
        -0.0786798745393753,
        -0.03727439418435097,
        -0.049971770495176315,
        -0.15413197875022888,
        -0.020244138315320015,
        -0.008390053175389767,
        -0.011312725022435188,
        0.014641799964010715,
        -0.05424633249640465,
        0.07715696841478348,
        -0.021787773817777634,
        -0.051075246185064316,
        0.02931910753250122,
        -0.031029075384140015,
        0.0028369806241244078,
        -0.06557732075452805,
        -0.0004477870534174144,
        -0.01183920819312334,
        -0.023454759269952774,
        -0.026639055460691452,
        0.030216041952371597,
        0.007829827256500721,
        0.01603979617357254,
        0.034038104116916656,
        0.026077650487422943,
        -0.0196771752089262,
        -0.04952951893210411,
        0.014759675599634647,
        0.0227899681776762,
        0.012679473496973515,
        -0.06437847763299942,
        0.07838661223649979,
        -0.07748766988515854,
        -0.009540395811200142,
        -0.03986126556992531,
        0.015117588452994823,
        -0.004451679065823555,
        0.03862306475639343,
        0.02748163416981697,
        0.05565503239631653,
        -0.06371856480836868,
        -0.09041303396224976,
        -0.06196525692939758,
        0.007208507042378187,
        -6.1540240652156584e-33,
        0.001844844315201044,
        -0.03981960937380791,
        0.005875147879123688,
        -0.04850326478481293,
        0.04134216904640198,
        -0.016836289316415787,
        0.08781243860721588,
        0.09419304132461548,
        0.024973709136247635,
        -0.09161645919084549,
        0.02433912456035614,
        0.07491782307624817,
        -0.059513334184885025,
        -0.050827618688344955,
        -0.007934425957500935,
        0.019855087623000145,
        0.0669485479593277,
        -0.05080409720540047,
        0.053671542555093765,
        0.09084498882293701,
        0.051149725914001465,
        0.030861271545290947,
        -0.04094594344496727,
        0.04834473133087158,
        0.0013931702123954892,
        0.019246762618422508,
        0.08379287272691727,
        0.0065607051365077496,
        0.028966378420591354,
        0.023001637309789658,
        -0.0006430147332139313,
        -0.0361345112323761,
        0.019150415435433388,
        0.008201990276575089,
        0.0017925361171364784,
        0.03901384025812149,
        0.011170824989676476,
        -0.06747698783874512,
        -0.03190792724490166,
        -0.14408205449581146,
        -0.010906754992902279,
        0.08390553295612335,
        -0.026457257568836212,
        0.0490613617002964,
        -0.05490058660507202,
        -0.016596399247646332,
        -0.041865307837724686,
        0.048101093620061874,
        -0.05270887538790703,
        -0.022334681823849678,
        -0.0611189641058445,
        -0.018841197714209557,
        0.016558820381760597,
        0.002684660954400897,
        -0.04651620239019394,
        0.04934373497962952,
        0.05618409439921379,
        -0.05406484007835388,
        0.010218193754553795,
        -0.0017631541704759002,
        0.10743929445743561,
        0.08661749958992004,
        -0.050919294357299805,
        -0.07033409923315048,
        0.013325025327503681,
        0.06237878277897835,
        0.07313425838947296,
        0.06871163100004196,
        0.017351754009723663,
        -0.0159984789788723,
        -0.0025732722133398056,
        -0.07184462994337082,
        -0.003934161271899939,
        -0.0818830132484436,
        0.05924917757511139,
        0.025759991258382797,
        -0.10177955776453018,
        -0.04520609974861145,
        -0.06831067055463791,
        -0.01451526116579771,
        0.05977727100253105,
        -0.03639151528477669,
        0.025337180122733116,
        0.01646529883146286,
        0.07809080183506012,
        -0.050730686634778976,
        0.08015710860490799,
        0.026103660464286804,
        -0.10842863470315933,
        -0.019641879945993423,
        -0.08088966459035873,
        0.057151589542627335,
        -0.02494388446211815,
        0.15069061517715454,
        0.0025204268749803305,
        -5.85498369787274e-08,
        0.08603952080011368,
        0.0241739209741354,
        -0.0010162689723074436,
        -0.10966387391090393,
        0.0043951538391411304,
        -0.06071418896317482,
        0.04595471918582916,
        0.005848344881087542,
        0.006084077525883913,
        -0.07143931090831757,
        0.0012171962298452854,
        -0.013403154909610748,
        -0.027065234258770943,
        0.04831556975841522,
        0.044322364032268524,
        0.10508165508508682,
        -0.0766107589006424,
        0.0053023844957351685,
        -0.051144566386938095,
        -0.035562511533498764,
        -0.10788241028785706,
        -0.0185881108045578,
        0.02245951071381569,
        -0.028299907222390175,
        0.05293036624789238,
        0.0794597640633583,
        -0.06616313755512238,
        0.02163850888609886,
        0.12729589641094208,
        0.02152884192764759,
        -0.016937002539634705,
        -0.001455196994356811,
        0.015050264075398445,
        0.06859783828258514,
        -0.09536993503570557,
        0.014031249098479748,
        -0.03828868269920349,
        0.020027492195367813,
        0.019738152623176575,
        -0.05853042006492615,
        -0.0003748362942133099,
        -0.08779434859752655,
        0.004647933412343264,
        0.06328172236680984,
        -0.03275425732135773,
        -0.05271902680397034,
        0.01274771150201559,
        -0.13011234998703003,
        -0.04553353041410446,
        -0.011939844116568565,
        0.011707275174558163,
        0.012407119385898113,
        -0.07431483268737793,
        0.014555944129824638,
        0.011804485693573952,
        -0.07635659724473953,
        0.08705976605415344,
        0.002039569430053234,
        -0.04594659060239792,
        -0.014689251780509949,
        -0.022544845938682556,
        -0.06309692561626434,
        0.00386453652754426,
        0.06759040802717209
    ]
}