{
    "id": "ERs9mjk-1Tg",
    "title": "The Best Fitness Apps For 2017",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-01-03T09:14:04Z",
    "video_url": "https://www.youtube.com/watch?v=ERs9mjk-1Tg",
    "category": "People & Blogs",
    "tags": [
        "best fitness apps 2017",
        "best fitness apps 2016",
        "best fitness tracker",
        "best fitness apps for android",
        "best fitness apps for iphone",
        "best fitness apps for apple watch",
        "fitness apps 2017",
        "health apps 201"
    ],
    "views": 401592,
    "likes": 6817,
    "comments_count": 480,
    "description": "You may have noticed that MrMobile doesnt cover a lot of fitness tech. Thats because that stuff reminds me of gym class, little league and all the other enforced sporting events I couldnt wait to grow out of. But look: fitness is important, especially when the most exercise you get during your workday happens between your wrists and fingertips. So to kick off 2017, I invited some of my favorite health-minded Internet people to help me round up the best fitness apps out there. Lets tune in to their top tips, and be sure to stick around to the end for MrMobile's own (typically weirdo) choice! It's the Best Fitness Apps to kickstart 2017 right here on MrMobile.   [SUBSCRIBE]     [GUESTS IN THIS VIDEO]  Jon Rettinger [TechnoBuffalo]     Serenity Caldwell [iMore]     Marques Brownlee [MKBHD]    Krystal Key    Joshua Vergara      Safwan Ahmedmia [SuperSaf]    Jaime Rivera [Pocketnow]      [APPS IN THIS VIDEO]  Sworkit Personalized Workouts by Nexercise Apps, Inc  Play Store:  iTunes:    FitStar Yoga by FitStar Inc  iTunes:    MyFitnessPal by MyFitnessPal, Inc  Google Play:  iTunes:    Lifesum - The Health Movement by Lifesum  Google Play:  iTunes:    Stop Breathe & Think by Tools for Peace  Google Play:  iTunes:    S Health by Samsung Electronics Co, Ltd.  Google Play:    Polar Flow by Polar Electro  Google Play:  iTunes:    Ingress by Niantic Labs  Play Store:  iTunes:    [AUDIO NOTE]  MrMobile is often ... well, mobile. So he can't always record video voiceover with his studio setup (an AKG C414XLS in a sound booth, if you were wondering). On the road, I record with a Zoom H2n Handy Recorder in the most acoustically sound environment I can find  usually a hotel room.   [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"You Like It,\" by Vibe Tracks, available in the YouTube music library:   \"Dubday\" by Cymatix, available at Premium Beat:    [SOCIALIZE]         [IMAGE CREDIT]  Custom thumbnail by Jose Negron, Mobile Nations   [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://technobuffalo.com",
        "https://twitter.com/jon4lakers",
        "https://www.youtube.com/user/jon4lakers",
        "https://imore.com",
        "https://twitter.com/settern",
        "https://www.youtube.com/user/iMoreVideo",
        "https://www.youtube.com/mkbhd",
        "https://twitter.com/MKBHD",
        "https://www.youtube.com/krystalkeyreviews",
        "https://twitter.com/lora_krystal",
        "https://androidauthority.com",
        "https://youtube.com/androidauthority",
        "https://twitter.com/jvtechtea",
        "https://www.youtube.com/channel/UCSy9Nf-NSaQbP4PyA5jnd2A",
        "https://youtube.com/supersaf",
        "https://twitter.com/SuperSaf",
        "https://pocketnow.com",
        "https://www.youtube.com/pocketnow",
        "https://twitter.com/Jaime_Rivera",
        "https://play.google.com/store/apps/details?id=sworkitapp.sworkit.com",
        "https://itunes.apple.com/us/app/sworkit-custom-workouts-for/id527219710?mt=8",
        "https://itunes.apple.com/us/app/fitstar-yoga/id936999508?mt=8",
        "https://play.google.com/store/apps/details?id=com.myfitnesspal.android",
        "https://itunes.apple.com/us/app/calorie-counter-diet-tracker/id341232718?mt=8",
        "https://play.google.com/store/apps/details?id=com.sillens.shapeupclub",
        "https://itunes.apple.com/us/app/lifesum-healthier-eating-better/id286906691?mt=8",
        "https://play.google.com/store/apps/details?id=org.stopbreathethink.app",
        "https://itunes.apple.com/us/app/stop-breathe-think-meditation/id778848692?mt=8",
        "https://play.google.com/store/apps/details?id=com.sec.android.app.shealth",
        "https://play.google.com/store/apps/details?id=fi.polar.polarflow",
        "https://itunes.apple.com/us/app/polar-flow-activity-sports/id717172678?mt=8",
        "https://play.google.com/store/apps/details?id=com.nianticproject.ingress",
        "https://itunes.apple.com/us/app/ingress/id576505181?mt=8",
        "https://www.youtube.com/audiolibrary/music",
        "https://www.premiumbeat.com/royalty_free_music/songs/dubday",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- I'm Michael Fisher, and as you may have noticed, I don't cover a lot of fitness tech. That's because that stuff reminds me of gym class, Little League and all the other enforced sporting events I couldn't wait to grow out of. This low budget stock footage doin' anything for you? This is what you have to do when you don't want to infringe on copyright. You get flaming soccer balls. That's pretty cool though. But let's get back to it. Look fitness is important. Especially when the most exercise you get during your work day happens between your wrists and fingertips. So to kick off 2017, I invited some of my favorite health-minded internet people to help me round up the best fitness apps out there. Let's tune in for their recommendations. And be sure to stick around to the end for my pick. It's Mr. Mobile. (fast synthesizer music) - I'm Jon Rettinger, and usually then only fitness that I cared about is tryin' to fit this whole pizza in my mouth. With the New Year comes new resolutions that I'm trying to get not be a shape of an oval. Be more of a line. And I'm using the app called Sworkit for iOS. It's free and you can buy more workouts. It'll walk you through beginners workouts. Including whether or not you wanna do core or arms, different body parts. And it'll give you videos to show you how to do it. Awesome app. You, like me, should get off your butt and download it and you know we could be into shape buddies together. - Hi, Mr. Mobile. My personal recommendation for helping people improve their fitness whether it's their flexibility or their core strength or just overall they wanna get a better start on their body in 2017, is Fitstar Yoga. Now if you're terrified by Yoga programs I completely understand. This app doesn't require you to buy into the spirituality of Yoga if that's not what you're into. But it provides some of the core mechanics to really help you not only get a good workout but improve your flexibility and your strength. I like it because it builds a customized skill program for you based on your level. It also offers on-the-go sessions that you can do no matter how much time you have. Whether you're in your hotel room, or even by a pool. - Hey, what is up guys? I'm KBHD here, and my favorite fitness related app for, not just this year but plenty of previous years as well is called My Fitness Pal. It's a really popular app. You've probably already have heard of it. And it has a ton of features. I specifically use it for the calorie counting. So you can put in the names of the foods you're eating and it'll tell you how many calories. Or you can just use the built in barcode scanner and scan the label of what you just ate. But even beyond that it has a ton of features for things like workouts and exercises and helping with meals and recipes, and even letting you track your progress with step counting. It can connect to a buncha different fitness devices. So, if you're anywhere from a professional athlete to a casual person with some New Year's resolutions this app is definitely gonna work for you. Good Luck. - Hey guys, I'm Krystal and my go-to fitness app has gotta be Lifesum. So when you open up Lifesum you can set up one of three goals. Like gaining weight and muscle, losing weight, or maybe just becoming a healthier person all around. And once you set that goal Lifesum will set many milestones on the path to your final goal. It'll then calculate how much carbs, calories, protein, and fat you need to consume each day to reach your milestones. And it couldn't be easier to log your meals into Lifesum, 'cause you can just search it up, or even add the foods that you eat often to your favorites for easy access. And the app will automatically know every piece of nutritional information for that meal. But my favorite part of the app though is how you can actually scan the barcode on the box of food you bought from the store. And Lifesum will know exactly what it is along with all it's nutritional information. Of course you can turn on notifications to make sure you're not slacking, easily log in your water intake, take weekly surveys to see how healthy you are, uses Android Wear or Apple Watch counterpart. And thankfully it's free. - Hey it's JVTechTea. What's going on everybody? And while I do partake in the physical tracking and the calorie counting that happens in the apps in this list, I do think that mental fitness is just as important and that's where Stop, Breathe & Think comes in. Meditation is considered a bicep curl for the mind. And even just as little as five minutes can actually help you gain that mental clarity if you are to have a regular practice every day. Now Stop, Breathe, and Think allows you to do that with guided meditations that are given to you based upon the mood that you tell the app you are in currently. That way you'll be able to keep the good vibes rolling or you'll be able to calm yourself after some stressful moments like for example, on a trade show floor at CPS. So, this application is a great way to start, and many of its features are free. So when you feel that stress coming on in your mind you can go ahead and do a mental exercise in Stop, Breathe, and Think. - Michael, I'm honored to be on your channel. This is Saf from SuperSaf TV, and my favorite fitness app is S Health. The reason for that is I'm a simple man and S Health is the fitness app that comes by default on my current daily driver which is the S7 Edge. And it does what I need it to do. Now I'm no fitness freak, but I do like keeping track of my daily activity, and I think S Health does a pretty decent job of that. It also lets me set daily goals and will alert me when I've reached those goals, when I'm coming close, or when I'm not close at all, which unfortunately has been the case over the past few weeks. But, hey, it's the holidays, so don't judge me. Thanks Mr. Mobile for having me once again. And if you wanna see some of my videos then do check out my channel. This is Saf from SuperSaf TV. I'll see you next time. - I know, right? A fitness video on Christmas (mumbles). Hey everyone, it's Jaime Rivera with Pocket Now. Michael, thank you for the invite. Favorite fitness application would be Polar Flow, which is tied to my favorite fitness watch the Polar M600. Why? Because these services are pretty much the only ones, they're probably the few that do a lot of things right. Number one, Platform Agnostic, doesn't really matter what phone I had or was using yesterday. I simply log on to Polar Flow with my account and it brings all my training information. Number two, it does a really good job at either syncing with Google Fit or with Apple Health Services. Number three, the fact that includes the most complete list of workouts that I've ever seen. But fourth and most important to the diet that I do requires me to know what training zone I was in because not all calorie burn is equal. Depending on how intense you were training you were either burning fat or improving your physical condition. And Polar services are the most complete in providing you how your workout was and what it did for you. So, for me, that would be it. Again Michael, thank you so much for the invite. - Hey folks, Mr. Mobile again. So, that's a pretty solid roundup. And I actually use a couple of those myself. But I'm the type of person who needs an app to distract him from the fact that he's getting any exercise at all. For that, I turn to Ingress. The augmented reality game from the same cats who brought us Pokemon Go. I like Ingress because it ties real life landmarks to virtual portals that you compete with other players to capture. And the underlying narrative of mysterious energy and mind-control fields is quite different from the creature capturing of Pokemon. How does it keep you fit? Well, because portals are tied to real world objects, you need to walk to play the game, a lot. I've racked up 10, 15, even 20,000 steps a day playing Ingress without even realizing it. And I've learned a few things about my neighborhood along the way. Links to download Ingress and all the apps mentioned in this video for that matter, are down in the description. And hey, let us know what apps are keeping you fit, physically or otherwise in the New Year. Drop a comment down below. Thanks to all my friends who pitched in on this one. Thanks to you for watching. And as always, Stay Mobile my friends. (upbeat synth music)",
    "transcript_keywords": [
        "fitness",
        "app",
        "Michael Fisher",
        "fitness app",
        "favorite fitness",
        "favorite fitness app",
        "Hey",
        "Lifesum",
        "Mobile",
        "Fisher",
        "favorite",
        "fitness tech",
        "apps",
        "Health",
        "Year",
        "Polar",
        "Ingress",
        "Polar Flow",
        "Michael",
        "workouts"
    ],
    "transcript_entity_values": [
        "Fitstar Yoga",
        "each day",
        "a ton",
        "Stop, Breathe & Think",
        "2017",
        "Christmas",
        "15",
        "Saf",
        "Michael Fisher",
        "S Health",
        "CPS",
        "SuperSaf TV",
        "the New Year",
        "My Fitness Pal",
        "the past few weeks",
        "Sworkit for iOS",
        "New Year's",
        "Ingress",
        "Pokemon",
        "Apple Watch",
        "20,000",
        "Android Wear",
        "Krystal",
        "Apple Health Services",
        "10",
        "Mobile",
        "this year",
        "Polar",
        "Jon Rettinger",
        "previous years",
        "daily",
        "Stay Mobile",
        "weekly",
        "Michael",
        "Google",
        "Stop, Breathe",
        "Little League",
        "yesterday",
        "fourth",
        "the New Year",
        "Lifesum",
        "the S7 Edge",
        "Jaime Rivera",
        "Polar Flow",
        "Number two",
        "Pokemon Go",
        "three",
        "one"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "EVENT",
        "PRODUCT",
        "DATE",
        "ORG",
        "EVENT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "GPE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.10054991394281387,
        0.0007988185971044004,
        0.002446420257911086,
        -0.0489766001701355,
        0.064562126994133,
        -0.008429058827459812,
        0.03324028477072716,
        -0.02804889902472496,
        -0.06196347624063492,
        0.02049298770725727,
        0.010811983607709408,
        0.028758559376001358,
        0.04199015721678734,
        0.035304583609104156,
        0.08566181361675262,
        0.011409999802708626,
        0.13023991882801056,
        0.0025646514259278774,
        0.015489364042878151,
        0.02767561934888363,
        -0.029404571279883385,
        -0.03270946443080902,
        0.020487656816840172,
        0.0417010672390461,
        0.002117706695571542,
        0.014901721850037575,
        -0.07309700548648834,
        0.015663888305425644,
        -0.04435006156563759,
        -0.010611221194267273,
        0.011079834774136543,
        0.056578513234853745,
        0.005596223287284374,
        -0.019032560288906097,
        -0.07423475384712219,
        -0.05121692270040512,
        -0.019737565889954567,
        0.00659831753000617,
        -0.12112558633089066,
        -0.06097457930445671,
        -0.057628825306892395,
        -0.0732295960187912,
        -0.00027777760988101363,
        0.049961723387241364,
        0.0413631871342659,
        -0.016230130568146706,
        0.021561885252594948,
        -0.01708707958459854,
        0.07109221816062927,
        0.0316111296415329,
        -0.06129557266831398,
        -0.09900025278329849,
        0.0807911604642868,
        0.024249397218227386,
        -0.025007301941514015,
        -0.04599173367023468,
        -0.062342725694179535,
        0.032606009393930435,
        0.031161664053797722,
        -0.023926669731736183,
        0.09704616665840149,
        -0.05529011785984039,
        -0.04322649538516998,
        -0.002115880837664008,
        -0.013269181363284588,
        -0.012593706138432026,
        -0.00701922457665205,
        0.0069306278601288795,
        0.08866620808839798,
        -0.07698383182287216,
        -0.033727727830410004,
        -0.057208891957998276,
        0.057589996606111526,
        -0.005252199713140726,
        0.003679146757349372,
        0.061554521322250366,
        0.012064507231116295,
        0.005796041339635849,
        -0.0038278107531368732,
        -0.019404279068112373,
        -0.026795372366905212,
        0.01898348703980446,
        -0.003478467930108309,
        0.019616467878222466,
        0.05003347247838974,
        0.05229439213871956,
        -0.014694438315927982,
        0.040013208985328674,
        0.02556113339960575,
        0.032980505377054214,
        -0.06353497505187988,
        0.1083703562617302,
        -0.07485594600439072,
        -0.012537227012217045,
        -0.013192848302423954,
        -0.042245954275131226,
        -0.07192006707191467,
        -0.07031340152025223,
        -0.1068929135799408,
        0.031407855451107025,
        0.022871628403663635,
        0.06809402257204056,
        0.04820958897471428,
        0.04686664417386055,
        0.009267952293157578,
        -0.11918918788433075,
        0.05795606970787048,
        -0.018028508871793747,
        0.06608030945062637,
        0.0492417998611927,
        0.0035767126828432083,
        0.009415685199201107,
        -0.0261844489723444,
        0.020765239372849464,
        -0.04097241535782814,
        0.04166313633322716,
        0.01806396245956421,
        0.11706572771072388,
        0.03195687383413315,
        0.06921930611133575,
        -0.01898542046546936,
        0.02114553190767765,
        -0.03082905150949955,
        -0.08328583836555481,
        0.035867657512426376,
        0.004736994858831167,
        -0.09289906919002533,
        5.295782048026875e-33,
        -0.023548673838377,
        0.06497424840927124,
        0.06316465139389038,
        0.04524558410048485,
        0.023751499131321907,
        -0.10567168891429901,
        -0.06265416741371155,
        -0.052269693464040756,
        0.04682205244898796,
        0.02893161028623581,
        -0.05634680762887001,
        0.05312734842300415,
        0.021319331601262093,
        0.034398410469293594,
        0.05520159378647804,
        -0.12808047235012054,
        -0.09342264384031296,
        -0.04289904609322548,
        -0.024936717003583908,
        0.032033149152994156,
        0.02818610891699791,
        -0.030146118253469467,
        -0.04836033284664154,
        -0.02807420678436756,
        -0.02054683305323124,
        0.07998713105916977,
        0.07890179753303528,
        0.012441161088645458,
        0.06894662231206894,
        0.03210882842540741,
        -0.10768141597509384,
        -0.00797283835709095,
        -0.02693234570324421,
        -0.04890395328402519,
        -0.01298207975924015,
        -0.04325994849205017,
        -0.06172097474336624,
        -0.1173785850405693,
        -0.03141649812459946,
        -0.01126503013074398,
        -0.05060698464512825,
        -0.0067169624380767345,
        -0.009800190106034279,
        -0.007311913650482893,
        -0.02664504200220108,
        0.0029277168214321136,
        0.0668325424194336,
        0.07473096996545792,
        0.11210546642541885,
        -0.06960122287273407,
        -0.05713304877281189,
        -0.028252802789211273,
        -0.027134930714964867,
        -0.09656163305044174,
        -0.10677902400493622,
        -0.004452431108802557,
        -0.023925527930259705,
        0.014902087859809399,
        0.04147496074438095,
        0.046257056295871735,
        -0.0297494288533926,
        -0.04452743008732796,
        -0.025483449921011925,
        -0.012122479267418385,
        -0.07783153653144836,
        -0.022462787106633186,
        -0.026168465614318848,
        -0.06694013625383377,
        -0.011074600741267204,
        0.07404455542564392,
        0.01312951184809208,
        0.050280943512916565,
        0.09220262616872787,
        0.004143761936575174,
        0.10175938159227371,
        0.054246675223112106,
        0.08497720956802368,
        0.022945115342736244,
        -0.09681349247694016,
        -0.04298414662480354,
        0.047103188931941986,
        0.031898193061351776,
        -0.03412085771560669,
        0.02992163598537445,
        0.013903755694627762,
        -0.0024394062347710133,
        -0.06636045128107071,
        -0.07900598645210266,
        -0.026246769353747368,
        0.056448809802532196,
        -0.084862120449543,
        0.010020606219768524,
        0.0673028901219368,
        0.1003141775727272,
        -0.027075543999671936,
        -5.120983466665708e-33,
        0.027787603437900543,
        -0.01019094418734312,
        0.053226910531520844,
        -0.03011956810951233,
        0.1219656690955162,
        -0.02674419805407524,
        0.021146135404706,
        0.06309395283460617,
        0.04168431833386421,
        -0.0515793077647686,
        0.0221769530326128,
        -0.06280602514743805,
        -0.023275556042790413,
        0.006834928411990404,
        0.014323809184134007,
        0.061473920941352844,
        -0.005784056149423122,
        -0.03631152957677841,
        -0.04586866870522499,
        0.035131003707647324,
        0.05222058668732643,
        0.07507648319005966,
        -0.01551116444170475,
        0.020051343366503716,
        0.05696197971701622,
        0.023881571367383003,
        0.008145129308104515,
        0.0906749814748764,
        -0.008095205761492252,
        -0.01849166490137577,
        -0.01894238218665123,
        -0.03898167610168457,
        -0.010357631370425224,
        -0.06244299188256264,
        -0.028554074466228485,
        0.06351315230131149,
        -0.046175986528396606,
        0.0610964410007,
        -0.011032088659703732,
        0.02986074425280094,
        0.08114919066429138,
        0.0024978488218039274,
        -0.033493828028440475,
        0.025291575118899345,
        0.019479095935821533,
        -0.06245383620262146,
        -0.06064614653587341,
        -0.04508320614695549,
        -0.041412435472011566,
        -0.012028265744447708,
        0.036021288484334946,
        -0.0033115204423666,
        -0.10023071616888046,
        -0.03234069049358368,
        0.0542486235499382,
        0.05508790537714958,
        0.09125197678804398,
        -0.022987285628914833,
        -0.052222758531570435,
        -0.06172427162528038,
        -0.06524507701396942,
        0.02149767428636551,
        -0.02055969089269638,
        0.04100507125258446,
        0.02511674165725708,
        0.012149115093052387,
        0.0697566419839859,
        -0.0129111148416996,
        -0.04582475870847702,
        0.03683476895093918,
        -0.12959395349025726,
        -0.011470583267509937,
        0.026784658432006836,
        -0.05319584906101227,
        -0.026764461770653725,
        -0.002380342921242118,
        0.07709623128175735,
        -0.047211654484272,
        -0.06532645225524902,
        -0.07486943155527115,
        0.07766421139240265,
        -0.017905861139297485,
        0.012702700681984425,
        0.015634268522262573,
        0.04351380467414856,
        0.13756510615348816,
        -0.023444702848792076,
        0.023744605481624603,
        -0.009905848652124405,
        0.07321140915155411,
        0.013940162025392056,
        0.04230170696973801,
        -0.033450692892074585,
        0.10435973852872849,
        -0.0018211734713986516,
        -5.1519883470518835e-08,
        0.043647781014442444,
        0.042369212955236435,
        -0.03514401614665985,
        -0.01981077343225479,
        -0.02218768186867237,
        0.018419288098812103,
        -0.056974347680807114,
        -0.012521461583673954,
        0.056594934314489365,
        0.037264660000801086,
        0.05311737209558487,
        0.017544908449053764,
        0.022930659353733063,
        -0.005508363246917725,
        -0.028224024921655655,
        0.03515244647860527,
        -0.030684946104884148,
        0.11005419492721558,
        -0.04900646582245827,
        0.03236374631524086,
        -0.011469128541648388,
        -0.015534828417003155,
        -0.01131798792630434,
        0.019062871113419533,
        0.06563955545425415,
        -0.05585234984755516,
        -0.07305467873811722,
        0.012227698229253292,
        0.07552209496498108,
        -0.019945360720157623,
        -0.005089274607598782,
        0.03947865590453148,
        0.08679991960525513,
        -0.045480795204639435,
        -0.08879361301660538,
        -0.011464727111160755,
        0.032889991998672485,
        0.0028099860064685345,
        0.009187612682580948,
        0.04670599475502968,
        -0.005853898357599974,
        -0.016882382333278656,
        0.03481461480259895,
        -0.013049143366515636,
        -0.03804967179894447,
        -0.10892196744680405,
        -0.04353633522987366,
        -0.11451441794633865,
        0.04503113403916359,
        -0.0022900565527379513,
        0.03288766369223595,
        -0.046945296227931976,
        0.0317864790558815,
        0.02251313626766205,
        0.10229341685771942,
        0.0604303702712059,
        -0.07850784808397293,
        -0.02854127436876297,
        0.003919458948075771,
        0.0019195761997252703,
        0.015298529528081417,
        -0.04098730534315109,
        -0.05352364480495453,
        0.024647627025842667
    ]
}