{
    "id": "esQLFQugzmI",
    "title": "I Can't Believe No One Bought These Crazy Game Controllers",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-06-16T16:57:38Z",
    "video_url": "https://www.youtube.com/watch?v=esQLFQugzmI",
    "category": "Science & Technology",
    "tags": [
        "gaming",
        "controllers",
        "playstation",
        "psone",
        "wii",
        "wii sports",
        "wii bowling",
        "ps1",
        "pc gaming",
        "retro gaming",
        "retro games",
        "namco negcon",
        "power of five",
        "train sim",
        "racing games",
        "sports games",
        "hitman",
        "choo choo"
    ],
    "views": 1071689,
    "likes": 37952,
    "comments_count": 1502,
    "description": "Save 10% and Free Shipping at Ridge by using offer code linustravel at   Its impossible to know just how many bizarre game controllers have come and gone over the years, and theyre DEFINTELY not all winners. Weve gotten our hands on a fresh batch to try out - will find a diamond in the rough?  Discuss on the forum:   Buy an Essential Reality P5 The Power of Five Glove Controller on eBay:  Buy a Nintendo Wii Bowling Ball on eBay:  Buy a Negcon Controller on eBay:  Buy a Densha de Go Controller on eBay:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   GET A VPN:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:54 High Five 6:36 There will be no turkey 10:52 I was analog BEFORE it was cool 14:21 All aboard! 21:21 Credits",
    "description_links": [
        "https://www.ridge.com/LinusTravel",
        "https://linustechtips.com/topic/1573825-i-bought-the-weirdest-gaming-controllers-ever/",
        "https://ebay.us/wMLfbp",
        "https://ebay.us/fWEYmA",
        "https://ebay.us/G1BQF9",
        "https://ebay.us/lcNicE",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "http://www.piavpn.com/linus",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "I've seen a lot of weird controllers But this really? Yeah, I have got to stop using eBay to treat my insomnia. Oh Oh, I look really dumb, but if I'm a dumb looking winner am I really dumb I can't believe I did that in front of my sponsor. Ridge claims that their luggage can keep your clothes dry in even the stormiest of situations. The only catch is, you kind of got to put them inside first. The future is at hand. Six degrees of motion control, what is this? This is the power of five controller from essential reality from 2002. Caution choking hazard. Six degrees of tracking ensures realistic movement. The first widely available virtual 3D controller that offers total intuitive interaction. This is the sensor. Yeah, well this, you really can use it anywhere. This thing was in almost brand new condition. How much should we pay for this? Well, you wanna guess? It came with two games plus a demo. I'm gonna say it was $90 when it was new and we paid 250. It was 149 new. We paid 30. Wow, comfortable. Who would want a regular mouse and keyboard if they can have this? I feel like an idiot. This is the power button for the glove. Careful, you're doing stuff on the screen here. Whoa, whoa, hey, whoa, hey, whoa, how you doing? You're mousing. Whoa! Go into here to calibrate. Move, Jordan, I'm interacting! Okay, sorry you want oh, oh, oh look at that. Oh Right click right click Why would you want to rest your hand on a flat surface comfortably when you can hold it out in front of you? Press A. Okay Eee. Make a fist. Press A again, holding your fist like this. Good. Now you're calibrated. My fingers have been saved. That's it. So now I'll pick a game over here. Uh-huh. I would suggest not Tiger Hunt Beach head or Hitman. Can't tell you what to do, dad. Well, we're on tiger hunt apparently. Okay, best of luck. Isn't this a great game? Oh my god, this is so tedious. And it actually interferes with the use of an actual mouse. Okay. You need a keyboard as well. Oh, I need a keyboard. Okay. The glove might only be view at this point. I'm not sure. I think it is. I didn't get very far in this game. I got mad. Is this game just a complete piece of S*** Yeah. Oh, okay. That's why I said don't use this one. How are you supposed to do any of this objective? I can't even get through the tutorial mission. What is happening right now? Use your intuition. B. B. C. Oh hey, change the view. Nice. I can't turn. You're turning. Look at the wheel. No, I'm trying to turn right. Oh, it doesn't do that. Try turning with your hand. What? Oh, oh, oh. Okay. So that's how I control the camera. And steer. And that's the wheels. Who the hell thought this was a good idea? I can only twist so far. Next game. Just turn it off with your hand. Turn my hand off? Yeah. This thing is absolutely rage inducing. All right, Hitman time. Oh my god. Come on! I'm so mad. Like, I just fucking punched the screen. The screen didn't do anything wrong. It's you. You're the problem. I can't, oh my god, I wanna throw it away. I wanna try a game. Okay, silent assassin time. Deep breaths. Cleansing breaths. You got this. Professional. This is gonna go well. Okay, it's a WASD. Yep. I can open door by tapping. Tapping what? What are you even talking about? I don't know. Couldn't figure it out. Look through the keyhole. Look through the keyhole. Where the hell's the keyhole? What keyhole? Wait, there's a trapdoor. Am I wearing an apron? You might be. You can open the door by tapping. Like is that is that with this somehow? Maybe. There's a dude out there. I did something. How'd you do that? Oh! Oh no, how do I do it? Oh my god, I'm so mad. Zoom? Double click? Double click? Double click? No. Okay, oh He did it. Oh my god. Oh my god. I'm out. Go get him Hit them. Boom. Boom. Boom. Boom. Boom. Nope. So tell me why didn't this interface take off? Because people didn't understand it. They didn't appreciate its genius Jordan. Oh my god. I have to look through the keyhole again Okay, is that how you open doors by looking in the keyhole? I don't know. Yeah, buddy index finger is shoot But don't think you have a gun. I'm gonna get a gun All right, so you should come back tomorrow when you've got that done Maybe it's time to go to confet. Maybe it's time to go to alt F4. All right nice controller. I really hope this is the worst one Bowling. No way. More realistic gameplay, better accuracy, everything you need to take bowling to the next level Good gravy. It's an entire Wii controller Look at that. It's got a stretched out round D-pad on it Or wait. You're gonna need this Oh no. What? You actually have to put the controller inside it? It's not even a controller? No So when they advertise it as having Wii Motion Plus They just mean... It supports it You can put a Wii Motion Plus Wii Mode inside it Yeah Even though holding and bowling the ball is so lifelike to the actual sport never ever release the ball Thanks CTA digital this is from 2009 MSRP was 25 bucks. What do you think we paid for it? 25 bucks, 20. yeah Oh my god, so you you really do just Put a Wii mode in it. That's it That's it That's all it's just so convenient. I'm gonna suggest you put the wrist strap on I Guess I look most like that one. I made that special for you. Oh, thank you best of five Overtaken on Matt with the skill level of 49. Okay, here we go Aw, yeah, buddy. Still got my skills. Oops. My wrist hates me right now. Like, absolutely hates me. It's still better than the glove though, come on. That's true. All right, let's bowl. Enough of this. I sincerely doubt that this is going to improve anything about the bowling experience. Wow. Nice throw. Maybe it works after all. That could have been a fluke. Try it again. Lobbing the ball. Shh. Oh! Crap. We're gonna curve this B*** Curve would have been that way. Fudge, fudge! Can I nail this 4-6 split? Nope. No? No. No? No chance. How dare you doubt my Wii bowling prowess? Balls! No, it's too much, it's too much. That was good. Yeah, yeah, yeah, yeah. All right, here we go. Turkey in the final frame. This is it. Mom, are you watching? Boom! One. Two! Come on, let's go! Here it is, Jordan. Oh! Oh, come on! Oh, denied. Okay. Legitimately, kind of cool accessory. For 25 bucks? All right, yeah. 20 bucks. Yeah, yeah, all right. I am surprised at how at least not damaging to the gameplay experience it was. That's a very generous way to put that. The warnings about this thing are for real no joke though, guys. With the controller in it, like... Like she's got some heft. You know? Like, boom, boom, boom, boom, boom, ba, ba, ba, ba, ba. You ready? Yes! Go. This is the Namco Negcon 1995. Is there a particular game that it's designed for? It is designed for racing games primarily as a steering mechanism. Interesting, patents pending. Wait, what is this button layout? Are we on a PlayStation? We are on a PlayStation. I don't understand. It's an alternate layout. One, two, A, B, start. Yep. This is a licensed PlayStation product. They got the logo on it. Yeah, man. Oh, wow. These are the longest travel face buttons I think I have ever seen. Look at that. Look at that travel. It even goes within the housing. Those are analog. Shut up. These are analog. Those are analog. Throttle and brake. These are analog. This is analog. This one's not for some reason. And then this obviously is. Oh, okay. This one I'm legitimately excited for. It might suck. I can't tell you how much it cost, unfortunately. You can't tell me how much it cost? Not MSRP. Oh. Couldn't find it. Interesting. If you know, leave a comment, let us know. It ended up, there's about 100 games that supported it, mostly racing games, obviously. So like your Gran Turismo, everybody supported it. And they even like have special art for it in the menus and everything. Like if you go into the config, go into your options here, key config. No way! It even animates it. Yeah. A little preview! How cool is that? Alright. Give her. Ridge Racer Revolution. Ooh, oh, hi, ooh. You're in. Do it. What does P have to do with anything? I don't know. We will actually have GameSense captured, you know. This is not very good. Try leaving one hand still and just moving the other one. Move less than you think you might need to. Okay, that's a little better. Now it reminds me of operating an RC car. Kinda, yeah. Yeah, with the little sideways steering wheel. You know what I'm talking about? Yep, I totally do. No, no, no, no, no, no. Okay, eighth, I'm an eighth, I'm an eighth. I got this, I got this. Two right behind you. Oh no, shoot. Ah, I keep going the opposite way. Yeah, that's fine. It's the same thing Glen had was doing. Also, this is a lot of strain to keep this accelerator pushed down. A little bit, yeah. Yeah, it's not good. It's bad. It's really bad. It's too analog. Yeah. Blue shell, blue shell! Wrong game. No, no, no, I'm gonna be top five. Breaking hard. Oh shoot, it broke too hard. Top seven. Wow, these breaks though. Incredible technology they had back in 2002 or whatever. I don't know, '95? It's older than Elijah. So was this launch year this thing came out? The launch year or the year after, it was really quick. Wow, all right. This seems like a late in the cycle accessory, you know? They made three versions of it, actually. This is the first one. Really? There's a second version which is a little bit more refined, a little bit less travel on the controls, and the third version only came out in Japan. Top five, baby! I don't see a top five anywhere. I mean, I was in fifth. Okay. What do you think of it? I can see if you kind of got used to it. Yeah. But the dead zone is pretty big. It's heavy. Think back to what your alternatives would have been back then. I mean, this would have absolutely crushed anything that didn't have. There was no dual shock. Yeah. No dual shock. There was no... You had a D-pad and buttons. Yeah. This would have crushed a D-pad and buttons at the time though. Like you actually have some fineness to the control. I think this one's pretty cool your final controller of the day sir. Yes You seem confused. I'm super confused it's something to do with is it a train Yeah, no it isn't don't lie. It's for operating a train. Yeah, no way What is this game the denta to go or denta to go sorry? This is train simulator before train simulator. Yep Oh wait, how much did we pay for that namco one? Uh, we paid what do you want to guess? Uh I'm gonna say that's somewhat collectible 100 bucks. 55 bucks. Okay, there's actually tons of them out there all between like 40 and 60 Uh, okay Taito Got start and select that's an improvement over the namco controller abc and we're missing a button here. So That's not very playstation of you This I assume is a throttle and this I assume is some kind of gear thing you're pretty close this is your throttle oh this is your brake is this mic upholder that is for your stopwatch oh no way it comes with an adorable no we made that oh but you're supposed to put a stopwatch that's what it's for it's for no way ah it's so cool wait do we have a props department where'd this come from I made it oh that's cute thanks okay start whoa just do the top thing yeah no I want to do material hall of train all right so basically each of these games does a series of these and each one will be three or four different train routes in Japan the most recent one came out in 2020. Really? And they've had special controllers for like every platform you can name basically. So do the first one I would say. No. You're gonna lose no matter what so like. Okay. So the goal is- Yes. You need to stop your train within 30 centimeters of the target line within a half a second to when you're supposed to get there. That's the easy mode. So your speed's here, you have your starting station, you're gonna pass through a station and it stops in station Okay, you want to pass through that station at 57:40 And once the green light comes on on the side here, you'll turn off your brake and put on the throttle. Okay Should we reload it? We should probably reload that. I mean this is pretty funny, but Hey, it's working. I think where we left off you were explaining the different levels of braking and calling out Today's LTT store shout-out classic shirts Back in stock lttstore.com you can release your brake knots. Okay all the way off and now you can go All right, so that guy i'm going i'm going i'm going so you have obviously 1.7 kilometers to your next station Yeah, you're not going to stop at that station though. Okay, you're gonna have to blow your horn when you go through it That's the c button. Okay. Sure. Uh, your speed limit is 55 right now. Oh, okay. You're good. You're 49 Yeah, but yeah Oh jeez, okay. I found like Going coast kind of yeah. Yeah, I got this. I got this but wait. I gotta go past it at 9:23:25 That's when you're trying to go past that station. Okay. Oh shoot down. Oh shoot. Shoot. Shoot. Shoot. Oh shoot I'm screwed. I'm not gonna make it. You'll be okay. You'll be no no full speed ahead. You got this Here we go kicking the nitrous. I got 15 seconds to get there Oh, we're going now boys. I think it'll be okay because this is a station. You're just gonna blow through So you should be okay. Isn't the scenery beautiful? Oh ball, so I'm late going through there. Yeah, you'll make up the time looks you're going real fast right now. Okay Okay, I gotta blow the horn. Hit the horn. Yeah Did I die? Oh, yeah, you died. You were too late. To blow the horn? No, to get through the station It looks like. Oh, you could be within like 15 seconds. 15 seconds late. I'm dead. Yeah, you've been fired Oh my god, continue. Okay. I don't know I can do this this time. And is there a benefit to gearing up? No, you know like being in first? No? No. Oh, just go for it. The tutorial even says just go to five 54 kilometers an hour It'll bump up to like 80. Yep. What's up? Crank it up. Oh, it's 80 now crank it up Oh, I didn't notice that before and then it'll go away entirely after that. That's why it took so long for me Yeah, okay. So now I can go wherever All right, now I've seen recommends like 80 to 90 is kind of your top. Okay, I got this Okay, we are totally gonna make it preparing you for your second career as a Japanese training conductor So we're gonna nail it. We're gonna nail it for speeding up a little bit beautiful. Oh, yeah Bum-bum-bum-bum, okay. All right. You got the kilometer to your next station. Oh, jeez. I gotta go pretty fast, dude Yeah, man. No 80 to 90 is not the right speed here. I don't mess around There's a speed limit 90 speed limit 90 balls break a little bit not crazy though, okay You're good. You're good. This is dude. This is really stressful. This is serious business, man They're not they're not kidding around. It's not a game brother. No. No, this is life. Holy shit. I've got ten seconds I'm not gonna make it. You got a couple hundred meters. It's right there. Oh, but I got a break. Hit the horn. Oh We're still going. Yeah. Yeah, horn horn horn until that becomes the symbol for stop. You don't have to stop. Jeepus Okay, I'll know when I see it. Okay, just keep going. Just keep going. We're flying boys. We're flying. Slow it down. Whoa Jeepers creepers. Okay level three breaking level three breaking. It's more slower more slower. I'm working on it. Oh, you lost dang it So what do you think? This is a really stressful game. This isn't fun. Is it better than the glove though? Well, yeah, it's way better than the glove. So if you had to pick one of these controllers to bring home What's it gonna be? Oh hands down? This guy right here. All right. This is cool That one's awesome. Super cool. And which one should be buried in the desert with ET? Oh, I think you all know the answer to that. In fact, I'm gonna give it a personal head start. Good riddance to bad rubbish See you later, buddy. Hey, Dennis! Where are you going? It's the middle of the day! Get back here so we can segue to our sponsor. I love traveling more than working. Like, who doesn't? Thanks to the Ridge for the new luggage. Because it has 30% thicker shell, I can sit on it, lay on it, or even do a trick shot. The door trap wheels let me walk fastly in Japan. Little does he know, Ridge also sent me to Japan. I'll find you, Dennis. And I made it easy with this air tag that I slipped into the handy dandy air tag pocket. Really, Linus? Good luck next time. I use this as an umbrella because it's weatherproof, and it comes with a laundry bag and a shoe tool. Also check out my matching backpack. It's also from the Ridge. Listen, I might not be a reliable man, but this is a reliable luggage. Check out Ridge at the link below. If you enjoyed this video, you might also enjoy the time we checked out some ridiculous 90s first-person shooter controllers. We're gonna have that linked down below.",
    "transcript_keywords": [
        "Yeah",
        "Boom",
        "game",
        "Good",
        "controller",
        "god",
        "station",
        "Wii",
        "time",
        "shoot",
        "put",
        "horn",
        "Ridge",
        "kind",
        "games",
        "thing",
        "Whoa",
        "train",
        "hand",
        "back"
    ],
    "transcript_entity_values": [
        "one",
        "ten seconds",
        "20",
        "eBay",
        "One",
        "Gran Turismo",
        "five 54 kilometers an hour",
        "2009",
        "seven",
        "a Wii Motion Plus",
        "Glen",
        "Turkey",
        "25 bucks",
        "2002",
        "like 15 seconds",
        "LTT",
        "three",
        "this launch year",
        "Linus",
        "CTA",
        "the day",
        "100 bucks",
        "57:40",
        "first",
        "Wii Motion",
        "about 100",
        "RC",
        "Japanese",
        "30 centimeters",
        "Wii",
        "eighth",
        "abc",
        "Today",
        "Taito",
        "Tiger Hunt Beach",
        "4-6",
        "80",
        "a half a second",
        "15 seconds",
        "third",
        "49",
        "60",
        "20 bucks",
        "namco",
        "GameSense",
        "The launch year or the year after",
        "four",
        "Ridge",
        "a couple hundred meters",
        "Dennis",
        "Jeepus",
        "Japan",
        "Ridge Racer Revolution",
        "five",
        "Deep breaths",
        "55 bucks",
        "the Namco Negcon",
        "Six degrees",
        "two",
        "30",
        "Jordan",
        "2020",
        "250",
        "second",
        "WASD",
        "55",
        "Two",
        "149",
        "90",
        "95",
        "Matt",
        "fifth",
        "30%",
        "1.7 kilometers",
        "Elijah",
        "90",
        "1995",
        "PlayStation",
        "80 to 90",
        "Jordan"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "MONEY",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "NORP",
        "QUANTITY",
        "PERSON",
        "ORDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "TIME",
        "TIME",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "GPE",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "PERCENT",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "GPE"
    ],
    "vector": [
        -0.11832576245069504,
        -0.09630614519119263,
        0.022424330934882164,
        -0.1038796454668045,
        0.0631396621465683,
        0.07499130070209503,
        0.037658147513866425,
        0.07464753836393356,
        -0.002259795553982258,
        0.10812275856733322,
        0.03627525642514229,
        0.035955946892499924,
        0.014719093218445778,
        -0.04468078911304474,
        0.02769412100315094,
        0.026236478239297867,
        0.05346056446433067,
        -0.05426410958170891,
        -0.030904261395335197,
        -0.02538871578872204,
        0.028993090614676476,
        0.028633929789066315,
        -0.014427589252591133,
        -0.02460077404975891,
        -0.039244331419467926,
        0.0014174155658110976,
        -0.022768383845686913,
        -0.0707443431019783,
        -0.03700413927435875,
        -0.07966028898954391,
        -0.036367449909448624,
        0.03845018148422241,
        -0.06179877743124962,
        -0.030234305188059807,
        0.019005320966243744,
        -0.12041320651769638,
        -0.015525699593126774,
        -0.07048582285642624,
        -0.07808971405029297,
        -0.0893448144197464,
        -0.019550643861293793,
        -0.026647962629795074,
        -0.023859677836298943,
        0.02300148829817772,
        0.03608580306172371,
        0.02023070864379406,
        0.009086054749786854,
        0.010932317934930325,
        0.07022066414356232,
        -0.003441908396780491,
        0.0460759699344635,
        -0.07603993266820908,
        0.12444741278886795,
        -0.11823531985282898,
        0.049544189125299454,
        -0.03707129880785942,
        -0.02697884663939476,
        -0.02297639660537243,
        0.06077314913272858,
        0.007744865957647562,
        0.03800529986619949,
        -0.04363338649272919,
        -0.07566209882497787,
        0.004515309352427721,
        -0.02910175733268261,
        -0.014680175110697746,
        0.040799692273139954,
        0.07540709525346756,
        -0.033761803060770035,
        -0.030464734882116318,
        0.010993142612278461,
        -0.003384801559150219,
        0.0887298434972763,
        0.07878214865922928,
        0.03633454069495201,
        -0.051740862429142,
        0.0322134904563427,
        -0.022991511970758438,
        0.013941272161900997,
        0.06270086765289307,
        -0.01141169760376215,
        -0.026019033044576645,
        -0.03836893290281296,
        -0.021632958203554153,
        0.005145917180925608,
        0.014348665252327919,
        0.0018904571188613772,
        0.0669238269329071,
        0.055239591747522354,
        -0.08399361371994019,
        -0.05222291126847267,
        0.013860364444553852,
        0.07060732692480087,
        0.01129117701202631,
        -0.053964171558618546,
        -0.02628360316157341,
        -0.010405812412500381,
        -0.04674079641699791,
        -0.07641986757516861,
        0.050571829080581665,
        -0.059897664934396744,
        0.045319508761167526,
        0.043098196387290955,
        -0.04369400069117546,
        -0.010063768364489079,
        0.013973714783787727,
        -0.010409286245703697,
        0.040104277431964874,
        0.04896945878863335,
        0.03156440705060959,
        -0.1293855756521225,
        -0.006396041251718998,
        -0.09018687158823013,
        0.03564022108912468,
        0.03537580743432045,
        -0.015050400979816914,
        -0.03940829262137413,
        0.04781489074230194,
        0.011485682800412178,
        -0.05123816058039665,
        0.03684977442026138,
        -0.00036814683699049056,
        0.025371002033352852,
        0.048010438680648804,
        -0.0119942557066679,
        0.02354179322719574,
        -0.016093457117676735,
        3.986845578499241e-33,
        -0.05075628310441971,
        0.09372793883085251,
        -0.00587104307487607,
        0.0246462170034647,
        -0.01611233502626419,
        0.057485222816467285,
        0.04688335955142975,
        0.0011487880256026983,
        0.011378183960914612,
        0.057324495166540146,
        -0.05503413453698158,
        0.04728216677904129,
        -0.1103401854634285,
        0.061307791620492935,
        0.06698872148990631,
        -0.026178600266575813,
        -0.06817640364170074,
        -0.0579141341149807,
        0.05339374020695686,
        -0.01711633987724781,
        -0.011437712237238884,
        0.0319126658141613,
        0.03896049037575722,
        -0.045686762779951096,
        0.03019404225051403,
        0.005440868902951479,
        0.0007270121714100242,
        0.023877091705799103,
        0.15161992609500885,
        0.021326985210180283,
        0.010032780468463898,
        -0.0435468815267086,
        -0.0009128751698881388,
        -0.005374139174818993,
        0.02191682904958725,
        0.03125079721212387,
        0.00532124750316143,
        -0.09368408471345901,
        0.007761862128973007,
        0.05002547428011894,
        -0.057787131518125534,
        -0.009448923170566559,
        -0.15271952748298645,
        -0.052616868168115616,
        -0.03613828495144844,
        0.00895642675459385,
        0.05176636204123497,
        -0.011345821432769299,
        -0.014229532331228256,
        0.0030087109189480543,
        -0.09600653499364853,
        0.04486102983355522,
        -0.0690382719039917,
        -0.028074050322175026,
        -0.015039398334920406,
        -0.14544077217578888,
        0.005055932328104973,
        -0.0328889936208725,
        0.03584279492497444,
        -0.008434014394879341,
        0.060029566287994385,
        -0.10014007985591888,
        0.02203313075006008,
        -0.048994626849889755,
        -0.06824269145727158,
        0.0688604786992073,
        0.07428932934999466,
        -0.03785162419080734,
        -0.01815699227154255,
        -0.04403911158442497,
        -0.03625987842679024,
        -0.02434176579117775,
        0.050373878329992294,
        -0.074217788875103,
        0.05787333846092224,
        -0.009223483502864838,
        -0.04956963658332825,
        0.034014567732810974,
        -0.043726395815610886,
        0.014683947898447514,
        0.02815626747906208,
        0.010935448110103607,
        0.010318774729967117,
        0.06981490552425385,
        0.09343624860048294,
        -0.02949671447277069,
        0.019612470641732216,
        -0.002145699691027403,
        -0.04815471172332764,
        -0.04197019338607788,
        -0.0378502681851387,
        -0.03742581233382225,
        0.045235518366098404,
        0.044874828308820724,
        0.027734313160181046,
        -5.068648254115192e-33,
        -0.07417236268520355,
        -0.006248111370950937,
        -0.017232630401849747,
        0.04207782819867134,
        0.07309360802173615,
        -0.05297110974788666,
        -0.012248469516634941,
        -0.0005295479204505682,
        0.01103108748793602,
        -0.025846382603049278,
        -0.012704800814390182,
        0.03884515166282654,
        -0.04445280879735947,
        0.017299536615610123,
        0.0448535718023777,
        -0.0710023045539856,
        -0.0005876354989595711,
        -0.020509328693151474,
        0.05162721499800682,
        -0.09022144973278046,
        0.1540757268667221,
        -0.011812233366072178,
        0.005587113089859486,
        -0.006372911389917135,
        -0.005380097310990095,
        0.05930894613265991,
        0.017427673563361168,
        0.03532838076353073,
        -0.04201357811689377,
        0.06537376344203949,
        -0.025617992505431175,
        -0.025756128132343292,
        0.052744992077350616,
        0.029343124479055405,
        -0.009007950313389301,
        0.0009434067760594189,
        0.08210711181163788,
        0.08930487185716629,
        -0.03566455841064453,
        -0.10464566946029663,
        -4.0968148823594674e-05,
        -0.018419494852423668,
        0.03808552399277687,
        -0.014318238943815231,
        -0.007461735513061285,
        -0.06203316152095795,
        -0.0334143303334713,
        -0.038403622806072235,
        0.03139667958021164,
        0.06755484640598297,
        0.011480608955025673,
        -0.002897767350077629,
        0.01924506202340126,
        -0.08091142773628235,
        -0.08160853385925293,
        -0.03328356891870499,
        0.05003519356250763,
        0.012406190857291222,
        0.0783015713095665,
        0.0736926794052124,
        0.0256027914583683,
        0.023462433367967606,
        -0.08908500522375107,
        0.06308849155902863,
        0.02621868997812271,
        0.0327349528670311,
        0.13945508003234863,
        0.07557615637779236,
        0.018660586327314377,
        -0.03352658078074455,
        -0.09003010392189026,
        0.022473393008112907,
        0.056768134236335754,
        -0.08044326305389404,
        -0.02085086703300476,
        0.053328391164541245,
        -0.022763511165976524,
        0.021206581965088844,
        0.05034950003027916,
        -0.050963688641786575,
        -0.03246530890464783,
        -0.0014769681729376316,
        0.08645813912153244,
        0.002177264541387558,
        0.04741494357585907,
        0.03988053277134895,
        0.03197014331817627,
        -0.03760513663291931,
        0.014663097448647022,
        0.001596015295945108,
        -0.011375345289707184,
        0.05607307329773903,
        0.06982101500034332,
        0.05799303203821182,
        0.06135721877217293,
        -6.196733437491275e-08,
        0.01242437306791544,
        0.10432642698287964,
        0.02876129373908043,
        -0.016285264864563942,
        0.04671315476298332,
        -0.021251976490020752,
        -0.006876306142657995,
        -0.007562275510281324,
        -0.018345989286899567,
        0.008092116564512253,
        0.03293253853917122,
        -0.03198012709617615,
        -0.08061424642801285,
        -0.005646240431815386,
        0.06550423055887222,
        -0.006155750714242458,
        -0.0632520243525505,
        0.05597788095474243,
        -0.02224855311214924,
        -0.027404434978961945,
        0.014206143096089363,
        0.025959806516766548,
        0.06344395130872726,
        -0.07086668908596039,
        -0.026618564501404762,
        0.019092421978712082,
        -0.04444247484207153,
        0.05232697352766991,
        0.07357385754585266,
        0.038057584315538406,
        -0.025596311315894127,
        -0.014756339602172375,
        0.008557925000786781,
        -0.025799009948968887,
        0.011337701231241226,
        -0.055017437785863876,
        -0.10344365239143372,
        0.002047204412519932,
        0.01055226381868124,
        0.032701607793569565,
        -0.06111710146069527,
        0.0036759800277650356,
        -0.02977282926440239,
        0.008408411405980587,
        0.047853849828243256,
        -0.026601623743772507,
        -0.034941915422677994,
        -0.12201254814863205,
        0.02880447916686535,
        0.009580048732459545,
        -0.02329603023827076,
        -0.0031624312978237867,
        -0.019775331020355225,
        -0.0030745775438845158,
        0.007570636458694935,
        0.002340949373319745,
        -0.02634258009493351,
        -0.0067603131756186485,
        0.013525642454624176,
        0.059239547699689865,
        -0.03691268712282181,
        -0.153859943151474,
        -0.09169190376996994,
        0.15427392721176147
    ]
}