{
    "id": "ESW3gXUo1QM",
    "title": "Don’t ask me the price - HP Z8 Fury G5",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-03-07T21:14:55Z",
    "video_url": "https://www.youtube.com/watch?v=ESW3gXUo1QM",
    "category": "Science & Technology",
    "tags": [
        "HP",
        "Workstation",
        "LTT",
        "Linus Tech Tips",
        "Linus",
        "HP Z8",
        "HP Z8 Fury G5",
        "HP Workstation",
        "Nvidia a6000",
        "Xeon",
        "Sapphire Rapids",
        "Gaming",
        "Computers",
        "Cool",
        "Fun",
        "Work PC",
        "Work",
        "Station",
        "Software",
        "Graphics Cad",
        "Processor"
    ],
    "views": 1731156,
    "likes": 67263,
    "comments_count": 2833,
    "description": "Thanks to HP for sponsoring this video! Learn more about the HP Z8 Fury G5 at:   HPs new Z8 Fury G5 is a monster! With the new Intel W9-3495X workstation CPU, four (FOUR!?) Nvidia A6000 GPUs, and up to 2 TERABYTES of RAM, this will make your puny best-of-class PCPartPicker dream machine look like a pi by comparison  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:00 Let's annihilate some benchmarks 4:30 It's drawing how many watts?! 5:40 Time to game 7:20 Taking a look at the Z8 Fury G5 10:30 What in the world is a personality slot 14:15 But what if we made it... louder 16:55 Outro",
    "description_links": [
        "https://bit.ly/3KMvOq0",
        "https://linustechtips.com/topic/1492638-don%E2%80%99t-ask-me-the-price-hp-z8-fury-g5-sponsored/",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- We've all done it. You go on your favorite store, PC Part Picker, select all the most expensive items in the drop downs, then you gaze at it, longingly for a bit, wipe the drool off your desk and go back to grinding fletching levels in RuneScape because fantasy time is officially over. Well, not for the engineers at HP. They took it one step further, and they actually built the dream machine and thanks to their co-sponsorship of this video with Intel, we get to see what happens when you actually press buy. Well the first thing that happens is your credit card spontaneously combusts because each of the four GPUs in this thing costs as much as a top of the line gaming PC. Alone. Then, the next thing that happens is you get to go faster than you've ever gone before. We're gonna crack it open in a little bit, but we're gonna start by absolutely annihilating every rendering benchmark we have ever done. Starting of course with the one and only Blender. Don't blink 'cause you might miss this. Start the render and it's done. That was a sub nine second classroom render and that was without the files cashed. Let's do it again. Do, do do, do 4.42 seconds. Are you kidding me? We're gonna start measuring in frames per second, not seconds per frame. That's not even long enough for me to see the usage show up on the GPUs. Is it not even kicking all of these on? We need to do a longer render. Oh hold on. This one's running on CPU. That's still really impressive. This is, it'll do gooseberry in under three minutes on this CPU. Wow That's what 56 cores will do for you. All that'll cost to you is measly. Ah yes. 350 watts of CPU power consumption. This is my first hands-on with Intel Zion Scalable 3,400 series chips. And I gotta say I am liking what I see so far. I was pretty thrown off when I found out that the 56 core has a base clock of just 1.9 gigahertz, but the all core boost in this HP machine is over 2.4, which means She fast. They are all working. Okay, that explains why it is so flipping fast. But see this, there's a delay in the time that it takes for the GPUs to actually start working and fans kick in and it's done. I realize you might not have a lot of context for these scores we're getting. So do yourself a favor, go to the Blender website download them and run them on your computer. That should give you some idea how absolutely wild this is. Alright, Blender man, let's go. Oh my god, this one's done already. 15 seconds. We barely even managed to load the GPUs. For those of you who are not that familiar with Blender what we're doing is we're rendering photorealistic images here and the problem is that these are industry standard benchmarks that everyone knows and this machine is running them so fast that it doesn't even really get a chance to start working. It just spools up the assets rips through the render and then it's immediately over. There's more overhead here than actual work being done. Of course, you might think, a few seconds here or there on your output is not gonna make that big of a difference. I mean you gotta run and get coffee or use the bathroom once in a while anyway. But the big difference here is that while you are working on a scene or working on a model you can just move it around and see it at basically full quality in just a few seconds. Look at it go, is that incredible or what? Okay, let's do RTX. Oh, here they all go. Man, just keeping these GPU's fed is quite the task for our poor CPU here. Once again, it's only reporting usage for GPU two. But once again I am pretty sure that all the GPUs are loaded here. Yes they are! Hot damn! This thing is drawing over 1200 watts on the GPUs alone. This thing does 1500 watts of power consumption and it's barely breaking a sweat like it's making noise. Don't get me wrong But Not a lot. But again, to give you guys some idea how impressive this is bone stock with only four GPUs. We are still in the top 50 here. Now the keen eye among you are probably thinking, \"I'm sorry 2 4090s is just as fast as your four A six thousands? What's up with that?\" RTX 4090s or gaming cards are designed to run as fast as possible. Driver certification and other features be damned. Whereas RTX A series cards, workstation cards are all about stability and they come with a lot more V RAM so that you can load them up with much larger scenes much larger workloads and they can operate on the whole thing while it's sitting in RAM. Which isn't to say that they can't game. Play some Halo infinite on a how much is this thing worth? Like 40 grand? We apparently don't even know the price. Well the GPUs are five grand each, so more than 20. Interesting. Even though there's no envy link connectors we can totally select all four of them. Whoa. Okay, we'll do that later though. Would you believe this machine is in the same family as the $69 gaming pc? So 10 years from now? No. For real. Think about it. When these are being offloaded by the baller businesses architectural firms or resource exploration companies when they're offloading these things, this could be your gaming pc, you would take out three of the GPUs or you would, you know, pick up a a cheap secondhand GPU to to throw into it for gaming. 'cause this is not the best for gaming. Woo. In summary, SLI hasn't been worked on in a long time by game developers or Nvidia so this isn't really a surprise, but, This was working? - [Tanner] Yeah. It it actually like made a difference with the SLI. - Oh. - it improved things. - Seriously? - [Tanner] Yeah. - Like were you getting like hundreds of FPS or like - [Tanner] Yeah, yeah there was. There was a noticeable difference in FPS. - Well I don't know what to tell you 'cause she is sure as shoot broken now. Enough about gaming though. Look at these spec view perf results. This machine is at or near the top of the charts in every possible category. CPU power, GPU power. This thing has got at all. Let's take a closer look at what's going on inside. Ooh no. First outside. Almost all mesh front two five and a quarter inch bays along with a slim line optical. These are deceptive. They are not for your CD writer. Okay, these are actually, so you can put up to eight hot swappable NVME drives in here. So like with the highest cap NVME drives these days that would be like 250 terabytes of NVME storage dual front USB-C's, dual front USB-A's, headphone microphone combo Jack and SD card reader. Let's turn this baby around and have a look from the, oh actually the back soon, but, oh, that makes sense. Nope, you are not allowed to open it up while it's on. I mean, if I had the kind of optimized airflow path that this thing has, I probably wouldn't like that either. We'll finish up with the outside, then we will open it up. Single 120 millimeter fan for exhaust. My goodness, this is hot. She's hot. Wow. Then we've got our three GPUs down here our rear motherboard IO over here. So a bunch more USB three, 10 gig ethernet. Absolutely love it. Is that a management port? That's awesome. You could totally remotely like upgrade the bios or whatever. That's great for your IT department. We've got dual power inputs. They can either operate in aggregate mode to a total of 2,250 watts or in redundant mode where they will do up to 1,450. So I guess we need aggregate mode for this configuration with the four a six thousands as this things freaking ridiculous. 16 monitors anyone? I have never seen anything like this before. Look at the freaking size of this power supply. It uses a blower cooler. Air intakes on both sides. There you go. Then exhausts out the back. Wow. Let's open this thing up. I want to see, I'm sorry, this is cool. Got a nice little map of where everything is inside including the order in which you need to populate your dim slots. It seems to be done yelling at me. Now all we need to do is figure out how, Ooh nice little pad to keep the GPU in place. Nice little shroud to make sure that the GPU is drawing air from the right place. Where that place is? Not entirely clear, but that's okay. We'll figure that out later. You can tell HP had so much PCIE connectivity they didn't know what to do with it All. The CPU supports up to 112 PCIE Gen five lanes and we're using 32 of them for these top two slots right here. These two down here are running at Gen four by 16 and then the motherboard is just littered in more PCIE connectivity. We've got two by four NVME connectors up here. So presumably those are to handle the optional hot swap bays that can, Hello? Somehow go over there and then we've got another one over here labeled network. That's either gonna be for, well, some kind of network interface you add at the back though I don't see where it goes. Or it could be for the optional Thunderbolt add in card. Oh, you know what? I bet the network one goes here. Whoa. Personality slot. I've met some people who could use one of those. Okay. Personality slot. I have no idea what's in these. Each of them is PCIE, gen four by eight. So there's another 16 lanes, but what they do is a mystery. Okay, hold on. So it looks like you, it's kind of a two-handed operation. Ooh, shut up. Dual M 0.2s loaded onto these carrier boards. Looks like they can do up to 110 millimeter M 0.2 drives but it's preloaded with your standard 80 millimeter drives. There's a couple one terabyte M 0.2s. Don't mind if I do. That one's a little bent. Oh, whoops. Is that 'cause of me? Did I do that? Oh, I did that. No, nevermind. It's flat. Okay. Well I can't say that I'm the biggest fan in general of proprietary carrier boards. From a technician standpoint, if Jeanette in accounting or Bob from shipping needs a new drive or they, you know need more storage or whatever else being in and out like that, instead of having to rip out a bunch of GPUs and get at M 0.2s that are under it. Yeah, I'm liking it. And cooling wise, what are we looking at here? Got a 92 millimeter intake here that's blowing across our top GPU, which has this back mounted Oh and front mounted intake that cools these. Then we've got another 120, no, that's a 92. And then we've got what appears to be another 120 down here in the bottom to take care of our CPU, our other GPU's. And then is this for, okay, what are you doing? What is with all these shrouds? Good gravy. Oh, that's some gravy. Well, that tall tower cooler explains how we were able to do a sustained 250 watts on the CPU. And then we've got a total of 128 gigs of RAM in here. But this CPU will support up to two terabytes two more 80 millimeter fans. Oh, these are blowing directly down on the RAM. They're blowing up from the RAM Oh the tray's interesting. Oh wow. The intake comes in here. Okay. Then this grabs it, then it goes through this shroud over to here and then this is grabbing air from over here or something and it's blowing it out and then this exhaust is taking it away. They do not want any hot air from anything else making its way into anything in this system. No screws required. Do I just pull it out? Surely there's a Oh, hello. Oh wow. Completely tool less GPU removal and that's secure enough for shipping? I guess that's what this rear support bracket and then these same pads that we saw on the top we're gonna do for you keep these babies secure in shipping. I mean it got here in one piece. Of course. Now that you've seen all the hardware, I'm sure you guys are wondering, well, can it go even faster? The answer is yes. All we need to do is go into performance options and instead of performance mode, we want rack mode. You ready for this? And Go And Go, go, go, go. You can tell there's performance in there. So much performance. Hold on. We're still adding more performance. Oh wow. Okay. Yep. I can see why this is rack mode and not sitting next to your desk in an office mode. Let's see if we can beat those scores from last time. The GPUs are absolutely pegged at 300 watts now and the CPUs sitting at 210. Only a marginal score increase. Looks like our GPUs weren't limited in any way by our system fans, but what I suspect is that our CPU is gonna be able to turbo a little bit higher. Whoa. That's a new, whoa, shut up. 375 watts. Did we touch 375 before? - [Tanner] That is definitely normal. - That's normal? - [Tanner] Yes. - Okay. No, this is working as intended. We're getting 2.6 2.7 gigahertz now instead of 2.4 and change. Alright then power consumption doesn't change. I guess it's just overcoming thermal limitations because look at this our CPU package isn't going above 55 degrees. We touched a hundred before. This difference in clock speed netted us about 4,000 more points in CI inch. Meaning the more cooling you can throw at the Zion 3,400 series processors the better off you're going to be. Especially if you've got a 56 core one. Unlike previous Z eight workstations the Z eight Fury G five only supports a single CPU. But when that CPU is the W 9 34 95 x, arguably the best workstation CPU on the market kind of makes sense. Eight channel DDR five memory support turbo boosts up to 4.7 gigahertz, 56 cores and the results speak for themselves. That's 62,000 points in Zion R 23 Can dance all day. It's no wonder Apple's only giving you like $800 for a Mac Pro trade in these days. Of course, we've only scratched the surface of what a machine like this can do. These are used for everything from game design to AI and data science research to 3D rendering which of course we've talked about but architectural design, engineering, video editing you name it, it can handle it. The one exception would be gaming. While you could spend 10 times as much as you did on your gaming pc, you really don't have to 'cause it's not for gaming until 10 years from now. Thanks again to Intel and HP for sponsoring this video. It was a genuine pleasure to get my hands on the absolute best of the best dream machine tier pc. And we have to send this back? - [Tanner] Yeah. - Yeah. Oh, all right. Well, I guess that's all the playing I get to do. I'm gonna run this one more time. This is like my favorite game. See boxes fill up very fast. Woo!",
    "transcript_keywords": [
        "CPU",
        "GPUs",
        "GPU",
        "thing",
        "gaming",
        "Part Picker",
        "CPU power",
        "working",
        "machine",
        "power",
        "watts",
        "RAM",
        "mode",
        "fast",
        "Yeah",
        "Blender",
        "top",
        "Wow",
        "Hot",
        "back"
    ],
    "transcript_entity_values": [
        "40",
        "one",
        "eight",
        "CI",
        "just 1.9 gigahertz",
        "fed",
        "GPU",
        "120",
        "AI",
        "Jack",
        "69",
        "three",
        "Picker",
        "SLI",
        "3,400",
        "Jeanette",
        "1200 watts",
        "4090s",
        "PCIE Gen",
        "two five and a",
        "Apple",
        "about 4,000",
        "first",
        "just a few seconds",
        "First",
        "32",
        "92 millimeter",
        "2,250 watts",
        "10 years from now",
        "USB-C's",
        "Blender",
        "all four",
        "up to eight",
        "4.42 seconds",
        "CPU",
        "375 watts",
        "15 seconds",
        "Intel",
        "more than 20",
        "hundreds",
        "four",
        "up to 112",
        "a hundred",
        "SD",
        "HP",
        "under three minutes",
        "92",
        "a few seconds",
        "Gen four by",
        "16",
        "five",
        "2.6 2.7 gigahertz",
        "10",
        "Single 120 millimeter",
        "Mac Pro",
        "2.4",
        "DDR",
        "two",
        "up to two terabytes two",
        "110 millimeter M 0.2",
        "these days",
        "Intel Zion Scalable",
        "Zion",
        "250",
        "56",
        "second",
        "2.4",
        "128",
        "1500 watts",
        "62,000",
        "PCIE",
        "55 degrees",
        "Thunderbolt",
        "Eight",
        "4.7 gigahertz",
        "1,450",
        "80 millimeter",
        "only four",
        "RuneScape",
        "375",
        "RAM",
        "210",
        "300 watts",
        "USB-A's",
        "Nvidia",
        "350 watts",
        "2 4090s",
        "a couple one terabyte",
        "50",
        "NVME",
        "IO",
        "Bob"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "QUANTITY",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "TIME",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "PERSON"
    ],
    "vector": [
        -0.09810923784971237,
        -0.013186614960432053,
        0.028326526284217834,
        -0.016742298379540443,
        0.04479151964187622,
        0.028150463476777077,
        -0.027247300371527672,
        0.02940753661096096,
        -0.02094401605427265,
        -0.03853301703929901,
        -0.039942264556884766,
        0.0743422731757164,
        0.022982006892561913,
        -0.04975195601582527,
        -0.0027381086256355047,
        -0.015080093406140804,
        0.09080767631530762,
        -0.15092597901821136,
        -0.04610307887196541,
        -0.025834299623966217,
        0.02573580853641033,
        -0.048535507172346115,
        0.005465991795063019,
        0.016971353441476822,
        0.025246378034353256,
        -0.015848549082875252,
        0.03524327278137207,
        -0.029121238738298416,
        0.025980083271861076,
        -0.016214750707149506,
        0.009953029453754425,
        0.04489905387163162,
        -0.05420869588851929,
        0.01944441720843315,
        0.021499212831258774,
        -0.05987735092639923,
        0.020246274769306183,
        -0.0760103240609169,
        -0.03479965031147003,
        -0.057371336966753006,
        0.06687844544649124,
        -0.020599938929080963,
        -0.04177170991897583,
        0.031193353235721588,
        0.06166151165962219,
        0.01662822626531124,
        -0.00019593318575061858,
        -0.08893101662397385,
        -0.009371302090585232,
        0.006805902346968651,
        -0.04902660846710205,
        -0.1274302750825882,
        0.023490944877266884,
        -0.047812946140766144,
        -0.0923922210931778,
        0.013209382072091103,
        0.012847622856497765,
        -0.06792877614498138,
        0.036634039133787155,
        -0.027977660298347473,
        -0.009081237949430943,
        -0.14955681562423706,
        -0.023617740720510483,
        0.06959977746009827,
        0.0005703379865735769,
        -0.06347361207008362,
        0.016140077263116837,
        0.01663833297789097,
        -0.02502060867846012,
        -0.019224923104047775,
        0.021111927926540375,
        0.07751928269863129,
        0.08404047042131424,
        0.052539099007844925,
        -0.056367743760347366,
        -0.0013391373213380575,
        0.06742483377456665,
        -0.05408544838428497,
        0.0949106514453888,
        0.006241976283490658,
        0.02038339339196682,
        -0.02686355449259281,
        0.019151680171489716,
        -0.02160012535750866,
        0.055784545838832855,
        -0.01822788454592228,
        0.02878083474934101,
        0.014098959974944592,
        -0.006404520478099585,
        -0.08566945791244507,
        -0.0071677095256745815,
        0.08548171073198318,
        0.0690755620598793,
        0.026223478838801384,
        -0.039408572018146515,
        0.0282930675894022,
        0.01460390817373991,
        -0.08127141743898392,
        -0.05467116832733154,
        0.06625521183013916,
        0.02071632631123066,
        0.03759237006306648,
        0.1007092148065567,
        -0.040610190480947495,
        -0.0859096422791481,
        -0.040903154760599136,
        -0.057310666888952255,
        0.1020670235157013,
        -0.07743223756551743,
        -0.03462189808487892,
        -0.11086981743574142,
        0.03782627359032631,
        -0.08746912330389023,
        -0.04042406752705574,
        0.028066975995898247,
        -0.04208594188094139,
        -0.08463652431964874,
        -0.030610142275691032,
        0.05014654994010925,
        -0.03990679234266281,
        -0.019416075199842453,
        -0.018809819594025612,
        -0.01280174683779478,
        0.031147053465247154,
        -0.043911512941122055,
        0.027102120220661163,
        -0.1345396339893341,
        5.900345404810501e-33,
        0.005664804019033909,
        0.06403383612632751,
        -0.08552917093038559,
        -0.05455663427710533,
        -0.008091555908322334,
        0.02068723738193512,
        0.011076347902417183,
        -0.02336338721215725,
        -0.033197205513715744,
        0.04714909940958023,
        -0.035037919878959656,
        0.014520830474793911,
        -0.02703820914030075,
        0.05152953043580055,
        0.02963501214981079,
        -0.0595397911965847,
        -0.025027524679899216,
        0.08788599073886871,
        -0.006877279374748468,
        -0.008134565316140652,
        0.07296706736087799,
        0.010654395446181297,
        0.035129934549331665,
        -0.05124123767018318,
        0.051332879811525345,
        0.03173033893108368,
        -0.0557805597782135,
        -0.09450113773345947,
        0.04629454016685486,
        0.009404781274497509,
        -0.010142599232494831,
        -0.06241849064826965,
        -0.029270529747009277,
        -0.0463944673538208,
        0.02318917214870453,
        0.0008680729661136866,
        -0.08605311065912247,
        -0.11629936099052429,
        0.05757928267121315,
        -0.03017834946513176,
        0.01051350124180317,
        0.04262012243270874,
        -0.05699319764971733,
        -0.10551774501800537,
        -0.045543499290943146,
        0.05332709848880768,
        -0.00990674365311861,
        -0.04157289117574692,
        0.03158697113394737,
        0.04099098592996597,
        -0.026501405984163284,
        0.024908754974603653,
        -0.06429526209831238,
        0.02542378194630146,
        -0.01981726661324501,
        -0.07849738746881485,
        0.08045496791601181,
        -0.018314426764845848,
        0.14216004312038422,
        0.01709827594459057,
        0.023627758026123047,
        -0.00028716039378196,
        0.021169388666749,
        -0.08134113997220993,
        -0.04789412394165993,
        0.03732997551560402,
        0.03852050378918648,
        0.008941839449107647,
        -0.07597599178552628,
        0.03004741109907627,
        -0.009202380664646626,
        -0.05267117917537689,
        0.03775160014629364,
        -0.03567637875676155,
        0.06844834238290787,
        -0.0031150339636951685,
        -0.12771059572696686,
        -0.047367699444293976,
        -0.05526697635650635,
        0.010174202732741833,
        -0.06749442219734192,
        0.024333270266652107,
        -0.002785260323435068,
        0.04492197558283806,
        0.04638666659593582,
        0.05131444334983826,
        0.03596815839409828,
        -0.039601296186447144,
        -0.016525454819202423,
        0.028970424085855484,
        -0.04205593466758728,
        -0.049113690853118896,
        0.05579042807221413,
        0.026843378320336342,
        -0.039069660007953644,
        -7.295342019813742e-33,
        -0.041128043085336685,
        0.03319862484931946,
        -0.0014686582144349813,
        0.08617676049470901,
        0.05103018507361412,
        -0.026249699294567108,
        0.04393135383725166,
        -0.0012230779975652695,
        0.005723095033317804,
        0.01399923861026764,
        0.02726311795413494,
        0.05581367760896683,
        0.035420726984739304,
        0.05329832062125206,
        0.013692233711481094,
        -0.07405617088079453,
        0.022862065583467484,
        -0.06787672638893127,
        0.0887143686413765,
        -0.07146484404802322,
        0.0894448459148407,
        0.04001612216234207,
        0.018621651455760002,
        0.03293794393539429,
        0.014593223109841347,
        0.004145144484937191,
        0.016223246231675148,
        -0.006475889123976231,
        0.04020495340228081,
        0.010435680858790874,
        -0.009195723570883274,
        -0.012519222684204578,
        -0.021458255127072334,
        0.02338416874408722,
        0.08674179017543793,
        -0.009368226863443851,
        0.08947204053401947,
        0.05952608212828636,
        0.0175943523645401,
        -0.013212901540100574,
        0.05909444019198418,
        -0.01823805645108223,
        0.03521345928311348,
        0.021501466631889343,
        0.003894288092851639,
        -0.03712553158402443,
        0.01696772314608097,
        -0.09544968605041504,
        0.04016225039958954,
        0.04421522095799446,
        -0.006487459409981966,
        -0.04240131005644798,
        0.06661669909954071,
        0.02677101641893387,
        -0.04405813291668892,
        -0.055483702570199966,
        -0.007865107618272305,
        0.020250065252184868,
        -0.011664803139865398,
        -0.034974005073308945,
        0.053688593208789825,
        0.02948712930083275,
        -0.05834081396460533,
        -0.00937038753181696,
        0.0004252184589859098,
        -0.012800394557416439,
        0.06030714139342308,
        0.03804804012179375,
        -0.07540853321552277,
        -0.012378664687275887,
        -0.038387931883335114,
        0.02182793989777565,
        0.025494873523712158,
        -0.053889866918325424,
        -0.02209223434329033,
        0.04851197078824043,
        0.02426411584019661,
        -0.02546127513051033,
        0.05420663580298424,
        -0.02887803129851818,
        -0.04429766163229942,
        0.03260615095496178,
        0.042395684868097305,
        -0.023273667320609093,
        0.03931976482272148,
        -0.07398249208927155,
        0.04418591782450676,
        -0.045844320207834244,
        -0.0010931891156360507,
        -0.08516179025173187,
        -0.05243609473109245,
        0.010621839202940464,
        0.029317427426576614,
        -0.0024270201101899147,
        -0.025108300149440765,
        -6.07483983117163e-08,
        -0.031523387879133224,
        0.003353036707267165,
        0.0110005559399724,
        0.05886025354266167,
        0.03530078008770943,
        -0.1213228851556778,
        -0.021475451067090034,
        -0.03524894639849663,
        0.058753617107868195,
        0.07026250660419464,
        0.14777809381484985,
        -0.12908536195755005,
        0.01180550642311573,
        -0.029182782396674156,
        0.014092796482145786,
        0.019784364849328995,
        -0.06375457346439362,
        0.06210969761013985,
        0.011813038028776646,
        -0.06442811340093613,
        -0.007094084285199642,
        0.030185798183083534,
        0.09427713602781296,
        -0.03872661292552948,
        0.028369445353746414,
        0.020502010360360146,
        0.025327274575829506,
        0.019965222105383873,
        0.06295279413461685,
        -0.05342099070549011,
        -0.07717862725257874,
        0.030750073492527008,
        0.04037385433912277,
        -0.023030690848827362,
        0.09118432551622391,
        -0.07362104207277298,
        -0.03376669064164162,
        0.0970771461725235,
        0.08036357909440994,
        0.04734228551387787,
        0.005439876113086939,
        -0.01823367178440094,
        0.015215427614748478,
        0.0057564242742955685,
        0.06521149724721909,
        -0.03126470744609833,
        -0.060027994215488434,
        -0.16284672915935516,
        0.025143392384052277,
        0.06988567113876343,
        -0.052961621433496475,
        0.02034602500498295,
        0.011094866320490837,
        0.03629748523235321,
        0.05144160985946655,
        -0.08068671077489853,
        -0.02985718846321106,
        0.03464868292212486,
        0.0005492046475410461,
        0.07026293128728867,
        0.022456998005509377,
        -0.11355971544981003,
        -0.010149482637643814,
        0.04713580384850502
    ]
}