{
    "id": "EUMsM2HZ5l4",
    "title": "Should You Buy a Switch in 2024?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2024-01-24T16:07:02Z",
    "video_url": "https://www.youtube.com/watch?v=EUMsM2HZ5l4",
    "category": "Science & Technology",
    "tags": [
        "nintendo switch",
        "switch",
        "2024",
        "switch 2",
        "nintendo",
        "rumors",
        "leaks",
        "switch lite",
        "switch oled",
        "games",
        "hogwarts",
        "hogwarts legacy",
        "tears of the kingdom",
        "zelda",
        "batman",
        "arkham knight",
        "pokemon",
        "scarlet",
        "violet",
        "gaming",
        "gameplay",
        "console",
        "game console",
        "austin evans",
        "austin",
        "evans"
    ],
    "views": 802142,
    "likes": 15282,
    "comments_count": 1394,
    "description": "Is the Nintendo Switch a dead console walking in 2024? Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   Chapter Titles: 0:00 Nintendo Switch in 2024 0:28 Switch vs Switch Lite vs Switch OLED 1:37 Buying a Switch Today? 3:16 Pokemon Scarlet and Violet 4:45 Red Dead Redemption 5:18 Zelda: Tears of the Kingdom 6:59 Batman: Arkham Knight 8:30 Hogwarts Legacy 10:10 The Switch 2",
    "description_links": [
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- It is 2024, my dudes. And the Nintendo Switch, believe it or not, is seven years old. Back in 2017, it was just another wacky, unproven Nintendo concept. But fast forward to today, and they have sold over 132 million Switches, making it not only a huge success, but one of the most popular game consoles of all time. But the question is, \"How well is it holding up in 2024? And should anyone buy a Switch today?\" Let's take a quick rundown of the current lineup of Switches. We have the cheapest Switch, which is the Switch Lite, retailing at $200. Now the Lite was released in 2018 as a dedicated portable console. It is smaller, lighter, and has better battery life compared to the original Switch at the cost of not being able to connect with a TV. But a lot of people would certainly prefer the regular Switch, which is actually a slightly revised Switch. So I call it the \"red box.\" But basically in 2019, they replaced the original model with this, which also retails for $300 and is very much focused on being a hybrid console. So you get all the goodies here, the removable Joy-Cons, the dock in the box. And it has almost doubled the battery life of the 2017 model, thanks to a much more efficient processor. Finally, we have the Switch OLED, which is the last version of the Switch that came out in 2021. Now the OLED is a little bit more expensive. It retails for $350, and there's not a huge difference between it and the red box, except for what the name implies, the beautiful OLED display. It is bigger, it is brighter, and honestly it's like a cheat code. Because while yes, games don't technically run any better, or any faster than the regular Switch, but literally every single game on the platform looks better because of that OLED screen. So you might be asking, \"Who is even considering buying a Switch in 2024?\" Right? Like isn't the new one right around the corner? Well, I got news for you. Everyone's buying Switches. Ask your cousin, and your cousin's cousin, and your little nephew. I mean, look, there are legitimate reasons if you wanna buy a seven-year-old system. But the question is, \"Should you?\" Before we go over the bad stuff, I wanna make something very clear. I love the Nintendo Switch. It is still the gaming device that I use most. One of the big reasons for that is the game library. There are over 4,500 Switch games to choose from and you just can't get away from the exclusives. Now, if you're willing to pay for Nintendo online, you also get access to a large number of older titles. Currently it's about a little over 200, and you're getting like NES games, Super Nintendo, Game Boy, Game Boy Advance, N64, SEGA Genesis, Mega Drive, Japanese game. I might not be a huge fan of the way that the online systems work on the Switch, but you do get a lot of games included with the online service. And again, I wanna emphasize that the Switch is very cheap. 200, 300, even $350 pales in comparison to pretty much every other console out there and especially every other handheld. As long as you're willing to get the Switch Lite, which again is my personal favorite, and it is my daily driver, you cannot get a cheaper new game console right now. It is a great way to get into gaming. However, it is not all sunshine and rainbows. Time to talk about the elephant in the room. Performance. So the gaming experience on many recent Switch games has been, how should we say, (duck quacking) To see just how bad things have gotten, I went out to my local Target and bought as many of the most ambitious Switch games I could get my hands on to see exactly how bad they truly are. When it comes to \"Pokemon,\" this is a game that has an infamous reputation on the Switch. Now, it is a really fun game and it is the reason why I've spent so many hours playing it. But the problem is that not only is it not well optimized, but it seems like it's a little too ambitious for this hardware. Which seems kind of silly because you consider that there are games that look a whole lot better than this that runs smoothly. With this open world, you do not get 30 FPS very often and it sucks, right? Especially when you start flying around, or driving quickly or stuff, you'll see that this thing drops frames like absolute no tomorrow. Now it's easy to make an excuse like, \"Oh, the Switch is old,\" or \"Oh, the Pokemon team, they're not really great at optimization or whatever.\" And that's all true and fair enough. But the fact that I'm just rolling around here, minding my own business and like I pop my wings out, trying to fly a little bit, and I can see it literally dropping frames right in front of me. Like it's just, I enjoy the ability to play games at high frame rates and high settings and stuff. And this is the like absolute opposite. Personally, I have gotten used to the performance issues, and I've kept playing. But I shouldn't have to. Not when other open world games like \"Zelda: Tears the Kingdom\" or \"Red Dead Redemption\" run surprisingly well on this hardware. And when you think about it, performance issues aren't unexpected. I mean, every variant of the Switch is running not some cutting-edge 2017 processor, but they're running the Tegra X1, a mobile chip that Nvidia released all the way back in 2015. And that's nearly 10 years old. If anything, it's a miracle that these play games as well as they do in 2024. But that is not an excuse. A game that shows off the strengths of the Switch, actually pretty well is \"Red Dead Redemption.\" So this is the original game that was re-released on the Switch in 2023. And then we'll say that for a very ambitious open world game originally designed for the PS3 and the 360, this holds up surprisingly well. I would say not only does it look better than it did on those consoles, but importantly, the performance is relatively stable and does go to show that while a game like Pokemon might feel like it's too strong for this hardware, when you actually have a game that is properly optimized, there is some performance here. \"Zelda: Tears of the Kingdom\" is certainly far from a perfect game on a technical front. But I will say that it has been clearly lovingly crafted for the Switch hardware. So yes, you will see some slight frame rate drops, you'll see some slight issues, but by and large, I actually would say that this acquits itself really quite nicely, especially given the age of this hardware. Now, yes, if you try hard enough, and you want to go for some crazy build and you wanna explode a bunch of stuff, you can get the frame rate to drop and there are certainly points in which you will see it to be a touch choppy. It does show you that when you have the actual time and the money and the resources to put into optimizing, you can get a very, very nice looking game off of this very old hardware, right? I don't think anyone's gonna look at this and like, yeah, sure, it's a little jaggy up on the lack of anti-aliasing. And there's certainly some pixel peeping you can do. But a game like \"Breath of the Wild,\" a game like \"Tears of the Kingdom\" is I think, still very well suited to this Switch hardware. Like I don't think anyone's gonna look at this and go, \"Oh my God, it's horrible and terrible.\" Like, I mean this is a very, very solid experience and it looks phenomenal. Ha, ha, ha, ha! Take this, AI overlords! I got a stick! Excellent. What I've always wanted. The games that work best on Switch are the games that are not trying to do too much. You can see stuff that was ported from like PS4, Xbox One, and that stuff typically struggles on the Switch. Whereas games that were designed with this hardware in mind and these limitations in mind, tend to perform far, far better. Some games like the \"Witcher 3\" are pretty rough. I mean I wouldn't say it's unplayable, but I don't know if I'd wanna sink hundreds of hours into finishing the game on the Switch. Then there are these straight up unplayable titles, such as \"Batman: Arkham Knight.\" Now this is a game that originally came out for the PS4 and the Xbox One. And as you might imagine, it has not been the most seamless of experiences when it comes to, oh, uh oh, I was not supposed to do that. So this is also my first time actually playing this. This game had absolutely atrocious performance when it was first brought out. The Digital Foundry video on this thing is brutal to watch. Now, thankfully, it has actually been improved. It is, I will say, impressive, that this is running at all on Switch, right? I will just give them that. There we go! So like look, the texture quality, like the actual settings of the game are clearly inferior to the PS4. Well, I mean, that's not a surprise. The Switch is nowhere near as powerful. And for sort of more basic, simple kind of things, I should probably run away. For basic simple kind of like stuff like traversal, it's not terrible. But as soon as you start to get that whole open world into view, it's clear that they sort of bit off more than they could chew with this game. But I don't think anyone is gonna buy this \"Arkham Trilogy\" and be impressed with the kind of graphical performance you're getting on the Switch. This just feels like it is a little bit too much for the console. No, no, no, no, no, no, no, no, no, no, no, no, no. I'm running away. Running away. Bye. See ya. Holy! Did you see that frame rate? Look at the frame rate! All right, you know what? Time to move on to the next game. Not that I bit off too much than I could chew or anything. It's just, I was trying to make a metaphor for how I got into a fight that I couldn't handle, much like the Switch got into a fight it couldn't handle by trying to play a PS4 game on 2015 mobile hardware. The number one game I wanna try on the Switch is \"Hogwarts Legacy.\" Now this is a game that came out for current generation consoles, so we're talking about something which is very graphically demanding. And somehow they squeezed it onto the Switch. So let's see how it is, shall we? I mean, I appreciate the fact that they have condensed the entire, very demanding game onto the Switch hardware. And I mean walking around the corridors, I actually say this looks pretty good for a Switch game. But pretty good and good enough, I think, are two different things. 'Cause what I am seeing is a pretty strong amount of jitter and sort of stutter in this. Now it's cutscene time. Oh, you look, you see how like stuff pops in? This is a game that I highly suspect would look a whole lot better playing on the Switch OLED's internal display, compared to here. 'Cause like yes, it's running a higher resolution, but I can see the pixel creep, I can see the sort of the very low resolution image that they're trying to upscale. A lot of that kind stuff I think, is going to be masked when you're playing in handheld mode. It just, the display helps a lot in just sort of shrinking everything down. This is a good example, right? So as I walk up here, it sort of halves the frame rate, and then there's a micro loading screen, right? And then it speeds back up when we're ready. So that is a pretty acceptable way of handling things. The problem is, as soon as I wanna actually go outside, and sort of experience the game in a little bit more of a meaningful way, you're not just seamlessly transitioning from place to place. You're waiting a minute plus for things to load. And to me, that's, I don't wanna say it's unacceptable, because again, we're playing on the Switch. Like I don't wanna be too mean to this thing, but it's not a great experience and it's significantly worse than every other platform. I think the problem in that, when you think about what the Switch 2 needs to be, in large part, it needs to be equivalent to a Steam Deck, really. Because I think a Steam Deck will play a game like this significantly better with far fewer compromises. Whereas the Switch, it's like, if you've ever tried to like juice a lemon and you're done, you don't have enough lemon juice. So you take it and you like really squeeze it and it's still not enough, and you get one of those little grinder things and you squeeze it even more and there's still not enough? Yeah, that's what they've done with the Switch. There's no more juice left in the console, and yet the grinding don't stop. It's easy to forget that when the Switch first launched, it was a bizarre new concept. I mean, there was no competition. But since then, handheld gaming has exploded. It's not just niche emulators anymore. We're talking about the Steam Deck, the ROG Ally, the Lenovo Legion Go, the MSI Claw, and way more on the horizon. And it's easy to make the argument that Nintendo sort of pioneered this handheld form factor. It's also easy to see why many companies are hopping on the trend. But despite the rise in popularity, to me, none of the gaming handhelds on the market are true Nintendo Switch competitors. None of them are as compact and light as the Switch, and the ones that do get close have abysmal battery life. It is clear that while these are underpowered, especially by today's standards, Nintendo did a lot of things right to begin with, and I think a lot of the competition are really just still trying to catch up. So how is the Switch holding up in 2024? I mean, unsurprisingly, it's really showing its age. Aren't we all? But Nintendo does an amazing job of creating gaming experiences that don't rely on the latest graphics. As far as I'm concerned, developers have pulled some damned miracles to optimize the amount of games they have for the Switch. I mean, yeah, there's some stinkers in there. But for the most part, it's been a very impressive run. It's clear though, that I think gamers are ready for the next chapter in Nintendo. And I, for one, am very excited for the Switch 2. And unless your Switch is actively on fire, that you should find a fire extinguisher for, it's probably a good idea to hang tight for that Switch 2. This hardware's probably not gonna go on sale, but I will tell you what, the Switch 2 does not need to do a lot, in my opinion, to be a very, very worthwhile upgrade.",
    "transcript_keywords": [
        "Switch",
        "game",
        "Switch games",
        "Nintendo Switch",
        "games",
        "Switch OLED",
        "Switch hardware",
        "Switch Lite",
        "ambitious Switch games",
        "Nintendo",
        "recent Switch games",
        "true Nintendo Switch",
        "Nintendo Switch competitors",
        "Switch OLED internal",
        "hardware",
        "regular Switch",
        "stuff",
        "lot",
        "Game Boy",
        "OLED"
    ],
    "transcript_entity_values": [
        "so many hours",
        "daily",
        "2017",
        "Batman",
        "Joy-Cons",
        "Switches",
        "2021",
        "Nintendo Switch",
        "2018",
        "over 132 million",
        "2019",
        "Tears of the Kingdom",
        "the Nintendo Switch",
        "first",
        "the Switch Lite",
        "Hogwarts Legacy",
        "2015",
        "4,500",
        "Nintendo",
        "the Lenovo Legion Go",
        "Red Dead Redemption",
        "Zelda",
        "300",
        "two",
        "30",
        "PS4",
        "Switch",
        "Xbox One",
        "2023",
        "hundreds of hours",
        "Arkham Trilogy",
        "Nintendo",
        "the ROG Ally",
        "seven years old",
        "Switch 2",
        "N64",
        "Pokemon",
        "nearly 10 years old",
        "Super Nintendo",
        "one",
        "300",
        "seven-year-old",
        "Pokemon",
        "Arkham Knight",
        "PS3",
        "Digital Foundry",
        "the Switch 2",
        "200",
        "Nvidia",
        "Lite",
        "SEGA Genesis",
        "tomorrow",
        "2024",
        "the Steam Deck",
        "200",
        "Target",
        "Zelda: Tears the Kingdom",
        "350",
        "halves",
        "Game Boy",
        "a minute",
        "FPS",
        "$350 pales",
        "Breath of the Wild",
        "One",
        "today",
        "Mega Drive",
        "Japanese",
        "3"
    ],
    "transcript_entity_types": [
        "TIME",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "WORK_OF_ART",
        "GPE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "TIME",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "ORG",
        "NORP",
        "CARDINAL"
    ],
    "vector": [
        -0.02375386841595173,
        -0.056371305137872696,
        0.06780737638473511,
        -0.06833592802286148,
        -0.06323517858982086,
        0.059510692954063416,
        -0.00571440951898694,
        0.11435417830944061,
        -0.09073108434677124,
        0.07613679021596909,
        -0.03963083028793335,
        0.05539742112159729,
        -0.045529112219810486,
        0.01992310956120491,
        0.049315959215164185,
        0.03979161009192467,
        -0.004544723313301802,
        -0.11607710272073746,
        0.004510223399847746,
        -0.024930039420723915,
        0.017187466844916344,
        -0.09269080311059952,
        -0.06636209785938263,
        -0.024654783308506012,
        -0.04565984010696411,
        0.019325390458106995,
        -0.009775661863386631,
        -0.0665934607386589,
        -0.08501027524471283,
        0.035254914313554764,
        -0.08229337632656097,
        0.06978201121091843,
        -0.08871646970510483,
        -0.040499668568372726,
        -0.07311609387397766,
        -0.08648969978094101,
        0.00424452917650342,
        -0.0816735327243805,
        0.048766642808914185,
        -0.03793315216898918,
        -0.019002098590135574,
        -0.03962266817688942,
        -0.0681886374950409,
        0.03919392079114914,
        -0.010551510378718376,
        -0.005381441675126553,
        0.023083072155714035,
        -0.03740768879652023,
        0.017618821933865547,
        0.008844621479511261,
        0.007327001541852951,
        -0.0027063917368650436,
        0.06778448075056076,
        -0.06950614601373672,
        0.06761697679758072,
        0.005790043622255325,
        0.00020268590014893562,
        -0.04320274293422699,
        0.10912298411130905,
        0.030800528824329376,
        0.012497845105826855,
        -0.08224500715732574,
        0.03886227309703827,
        -0.03943967819213867,
        0.04163988679647446,
        -0.03146526589989662,
        -0.012336842715740204,
        -0.028798284009099007,
        0.0077848429791629314,
        -0.027839049696922302,
        -0.011043640784919262,
        0.027243318036198616,
        0.10640253871679306,
        -0.0041101789101958275,
        -0.05187355354428291,
        -0.01389396283775568,
        0.10892610996961594,
        -0.017257077619433403,
        -0.009155777283012867,
        0.015223660506308079,
        0.04876264929771423,
        -0.008055834099650383,
        -0.019351737573742867,
        -0.05305206775665283,
        -0.011482372879981995,
        0.03297918289899826,
        0.062470342963933945,
        -0.04317134991288185,
        -0.04644384607672691,
        -0.012459282763302326,
        0.0014804889215156436,
        0.02051812782883644,
        0.05902019515633583,
        0.06556093692779541,
        -0.022404110059142113,
        0.05028940737247467,
        0.01868855208158493,
        -0.061703722923994064,
        0.017658285796642303,
        -0.00927212368696928,
        0.000650164729449898,
        0.04929809272289276,
        0.04391482099890709,
        -0.057485681027173996,
        0.006359490100294352,
        -0.06362388283014297,
        0.008325167000293732,
        0.03660562261939049,
        -0.06358060985803604,
        0.011310051195323467,
        0.01048007421195507,
        -0.0022120303474366665,
        -0.0446200892329216,
        0.02574591524899006,
        -0.03114944137632847,
        -0.020625228062272072,
        -0.028301319107413292,
        -0.03783135861158371,
        0.08094894886016846,
        0.05402437970042229,
        0.03934687376022339,
        0.08570361137390137,
        0.027036719024181366,
        0.05826803669333458,
        -0.0021077562123537064,
        0.06762607395648956,
        0.02315973863005638,
        6.0526273918816664e-33,
        -0.014184507541358471,
        0.06500094383955002,
        -0.07395047694444656,
        0.0017405754188075662,
        -0.07286589592695236,
        0.02997463569045067,
        0.07195944339036942,
        0.10787012428045273,
        -0.03536613658070564,
        -0.05543990805745125,
        -0.04264483600854874,
        0.007417968939989805,
        -0.10528114438056946,
        0.018504740670323372,
        0.07459145784378052,
        -0.05929717421531677,
        0.04628795012831688,
        -0.021646717563271523,
        0.034483201801776886,
        -0.018926357850432396,
        0.029328979551792145,
        0.027028946205973625,
        0.0519714318215847,
        0.01728234812617302,
        -0.041734665632247925,
        0.016528671607375145,
        -0.007031839340925217,
        -0.06304469704627991,
        0.03788996487855911,
        0.021191401407122612,
        -0.014878642745316029,
        0.00893083494156599,
        -0.039900846779346466,
        -0.014502699486911297,
        0.044068384915590286,
        -0.023115117102861404,
        0.01857748255133629,
        -0.05131508409976959,
        -0.002007714007049799,
        0.0072524952702224255,
        -0.07783011347055435,
        0.03779849410057068,
        -0.023820195347070694,
        -0.005685882642865181,
        0.09055143594741821,
        -0.021085230633616447,
        0.021385058760643005,
        -0.05959443002939224,
        -0.05338352546095848,
        0.06123338267207146,
        -0.08877384662628174,
        -0.009819336235523224,
        -0.05971044674515724,
        0.022613631561398506,
        0.0012694221222773194,
        -0.1404392272233963,
        0.025721818208694458,
        -0.06547482311725616,
        0.07284487038850784,
        0.03084966167807579,
        0.018642369657754898,
        0.03248894587159157,
        0.014019750989973545,
        -0.0010117562487721443,
        -0.045289237052202225,
        0.12162087112665176,
        0.052711568772792816,
        -0.049608178436756134,
        -0.100375697016716,
        -0.03761446848511696,
        0.05354313179850578,
        -0.058661218732595444,
        0.0027488963678479195,
        -0.07197440415620804,
        0.10122278332710266,
        0.007946508936583996,
        0.024586638435721397,
        -0.039820604026317596,
        0.025233840569853783,
        -0.007388733327388763,
        0.0459161251783371,
        0.05963344871997833,
        -0.015923520550131798,
        -0.01380736380815506,
        0.128074511885643,
        0.0036357431672513485,
        0.06115652620792389,
        -0.019512657076120377,
        -0.014325208030641079,
        -0.012896108441054821,
        -0.009764525108039379,
        -0.005671323277056217,
        -0.021354136988520622,
        0.05220293253660202,
        0.07263178378343582,
        -7.149265540888964e-33,
        0.05710671469569206,
        0.00893640611320734,
        0.030313048511743546,
        0.0680164024233818,
        -0.051877446472644806,
        -0.0527583472430706,
        -0.0487542450428009,
        0.022589053958654404,
        -0.020195255056023598,
        -0.006728081498295069,
        -0.030056454241275787,
        0.04484594613313675,
        0.02056756801903248,
        0.05111435428261757,
        -0.012035800144076347,
        -0.06939394026994705,
        -0.003438154235482216,
        -0.11854887008666992,
        0.051468104124069214,
        -0.05392872914671898,
        -0.021754691377282143,
        0.03384745866060257,
        -0.13720349967479706,
        0.07930619269609451,
        -0.04705321043729782,
        0.046396445482969284,
        0.000764584809076041,
        -0.05737902596592903,
        0.0009039294673129916,
        -0.041548699140548706,
        -0.03827602043747902,
        -0.01455176342278719,
        0.037008706480264664,
        0.08984334766864777,
        0.048597365617752075,
        0.0034430932719260454,
        0.08880053460597992,
        -0.0018442206783220172,
        -0.01892911083996296,
        0.008276557549834251,
        0.013134590350091457,
        0.010090735740959644,
        -0.023385874927043915,
        0.009760543704032898,
        0.0272978525608778,
        0.009646398946642876,
        0.02567341737449169,
        0.058665115386247635,
        0.10033416748046875,
        0.06789673864841461,
        0.07041581720113754,
        0.008484120480716228,
        0.0072908345609903336,
        -0.054336726665496826,
        -0.0687888041138649,
        -0.06567062437534332,
        -0.053801342844963074,
        0.016642529517412186,
        -0.054643720388412476,
        -0.02110818214714527,
        0.05609080567955971,
        -0.015054697170853615,
        0.023311851546168327,
        0.01620493270456791,
        0.029960857704281807,
        -0.04482407867908478,
        0.052376653999090195,
        -0.049223754554986954,
        0.03769685700535774,
        -0.10041660815477371,
        -0.013936266303062439,
        -0.1100941076874733,
        -0.08094316720962524,
        -0.1043822318315506,
        -0.012940534390509129,
        0.04717200994491577,
        -0.003422582522034645,
        0.006209633778780699,
        0.03661033883690834,
        0.01957414671778679,
        -0.05483807250857353,
        0.05505356937646866,
        0.03681771457195282,
        -0.029683420434594154,
        0.003295076312497258,
        0.02877873368561268,
        0.020575201138854027,
        -0.02150501310825348,
        -0.07335437089204788,
        -0.023520013317465782,
        -0.049468111246824265,
        0.014644003473222256,
        -0.02283693663775921,
        -0.03993178531527519,
        0.060290709137916565,
        -5.5784592944974065e-08,
        0.13593272864818573,
        0.11521553993225098,
        0.047377295792102814,
        0.01643737591803074,
        0.04503659904003143,
        -0.01793920248746872,
        0.01717413403093815,
        0.027100294828414917,
        0.025306712836027145,
        0.07849092781543732,
        0.01646525412797928,
        0.023582180961966515,
        -0.034603893756866455,
        0.04430865868926048,
        0.010431365109980106,
        0.10915511846542358,
        -0.0639360249042511,
        -0.02826167643070221,
        -0.019064608961343765,
        0.09659980982542038,
        -0.0007755612605251372,
        -0.021926220506429672,
        0.026164891198277473,
        -0.012242788448929787,
        -0.10783565044403076,
        0.00848123338073492,
        0.033168114721775055,
        0.04166475683450699,
        -0.01986088789999485,
        0.01411889772862196,
        0.02886396460235119,
        -0.061536677181720734,
        0.00762436306104064,
        -0.011002720333635807,
        0.0006688582361675799,
        -0.0861237645149231,
        -0.013352671638131142,
        0.040561091154813766,
        0.018109165132045746,
        -0.029222069308161736,
        0.012432663701474667,
        -0.1037062406539917,
        -0.1024574488401413,
        0.04341251030564308,
        -0.020783400163054466,
        -0.08673693239688873,
        -0.06246032193303108,
        -0.06722987443208694,
        -0.058420248329639435,
        0.012142912484705448,
        -0.04013597592711449,
        0.025570176541805267,
        -0.035141754895448685,
        0.02313893660902977,
        0.02475816383957863,
        0.03801886737346649,
        -0.01792347989976406,
        -0.005081332754343748,
        -0.07380860298871994,
        0.01239535491913557,
        0.0761902704834938,
        -0.13573911786079407,
        -0.11078318953514099,
        0.09529419243335724
    ]
}