{
    "id": "eVf7NLBj0y0",
    "title": "AliExpress Wouldn't Lie... Right? - Crelander Dual Screen Laptop",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-02-05T18:00:25Z",
    "video_url": "https://www.youtube.com/watch?v=eVf7NLBj0y0",
    "category": "Science & Technology",
    "tags": [
        "Crelander",
        "AliExpress",
        "Weird",
        "Laptop",
        "Gaming Laptop",
        "Zenbook Duo",
        "Cheap",
        "DubbedWithAloud"
    ],
    "views": 3988003,
    "likes": 99950,
    "comments_count": 3362,
    "description": "Visit  and use offer code LTT for 10% off  Create your build at   The Crelander Dual Screen laptop looks like an absolutely incredible deal at $750... if it actually is what they claim.  Discuss on the forum:   Buy an ASUS 14 UX481 ZenBook Duo:  Buy an Hp 13.5 Elite Dragonfly:  Check out the Crelander Dual Screen Laptop:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   COME TO LTX 2023:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 - Crelander wouldn't lie 0:38 - Build Redux! 0:54 - LTT Intro 1:02 - Linus has high expectations 3:20 - Screens (first reaction) 4:18 - Trackpad, keyboard 5:56 - Stated vs. real specs 8:01 - Cinebench 9:30 - Screens (labs report) 11:28 - Webcam 12:08 - Teardown 14:44 - Speakers 15:14 - Squarespace! 16:08 - Outro",
    "description_links": [
        "https://www.squarespace.com/LTT",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1486320-aliexpress-wouldnt-lie-right/",
        "https://geni.us/oYgx",
        "https://geni.us/oAxxlpJ",
        "https://lmg.gg/IYgRA",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- You could buy a ZenBook Duo, a super cool dual screen laptop, or for a third of the price, you could buy the Crelander. We found this gem on AliExpress, and for $750 it looks absolutely outstanding. I'm talking eight-core CPU, QHD screen, second screen, and, ah, quick shipping. I mean, with excellent reviews and specs like that, what could go wrong? Unless they lied. Crelander wouldn't lie. - [Alex] No. - I would never lie to you about our sponsor. - Build Redux takes the challenge and the hassle out of building your own PC, with configuration options, support guides to aid you, and competitive pricing versus building a PC yourself. Why not kick your feet up and let Build Redux handle it for you? Head to buildredux.com/linus and start your new build today. (upbeat music) (metal clinking) (computer beeps) (energetic upbeat music) - Between the intro Alex put together and my own first impressions, I've gotta say my expectations are actually really high. There are some weird things. Is this a Windows key, for example? (chuckles) I think it might be. And is that an upside down HDMI port? But the rest of the IO actually looks really good. We've got two USB 3.0 super speed over here. Headphone/microphone combo jack, RJ45 jack. And then over on this side more Type A, a Type C, and a DC barrel plug for charging. Then things get really interesting. At the back we've got an external PCI Express connection. The only devices I've seen this on are an MSI laptop from way back in the day that had a proprietary dock, and then Asus has a lineup, the G14, that has an external PCI-e thing but it's not quite like this. - I actually have no clue what this is at all. It mentions it nowhere in any of the documentation, and I never turned it around while I was testing it. - Even the website- - Yeah. - Does not have pictures of the back. - Nothing. Oh, they have pictures of the back. It's not there. - I guess it shouldn't surprise me that much, given that Crelander is probably best known for its LED backpacks, but given that this has no branding on it whatsoever, I guess they're just branching out into taking some other laptop from some OEM, and selling it, and hoping for the best. (chuckles) Ah man, this is really hard to peel. Ooh, interesting. It has a hinge that lifts the bottom display up to a more ergonomic viewing angle like the newer ZenBooks Duo. This is an older one from 2019. It also has a very similar keyboard and touchpad layout. I wouldn't describe the build quality as perfect or even as as good as the ASUS version of the ZenBook, but it's not bad. - [Alex] It's 750 bucks. - Yeah. I keep waiting for the other shoe to drop here but then I keep noticing more and more things that I love about this. Is this a 16 by 10 display? - [Alex] Yep - That is sick. Does it work? - Yeah. - Oh. Oh, it's on, it's on, it's on. Okay, Crelander. My bitter backpack competitor. I wouldn't say they've done a great job of matching the brightness of the top and bottom display. A big part of that is the kind of weak viewing angles on the bottom one. You can see it dims quite a lot. I mean, Asus's is hardly perfect either but that seems to be more due to, like, an anti-glare coating on the bottom one and less due to just poor viewing angles. But the touch pad works with no obvious issues. Gestures seem to do about what you'd expect them to do, and by golly, there's two displays. - Okay, well, while you're here, while you're here. - Oh, that resolution is not what they said it was though. - Yeah. On the product page they say it's a QHD panel that's 90Hz. What are you seeing here, Linus? - I'm seeing a 1900 by 1200 display, and if this is 90 hertz, I will throw up my breakfast and eat it again. (Alex laughs) It's not. - No. - And you cannot set it to 90Hz. - Oh. - But you can set it to exactly 60. Oh good. Definitely some rattle to the track pad. Mm. Oh. (Alex laughs) That's why you wanted me to check out the keyboard. This was not obvious to me when I first looked at it, but that's where the backspace goes. It's the power button. What a disastrous design decision. Who could possibly think that you should put the power button where the backspace is? Even if you owned this computer and built muscle memory around that, the second you went and used some other keyboard, because that happens from time to time, you would be so likely to come back to this thing and accidentally to put it to sleep. - [Alex] That's not even the best part. (laughs) - Oh no. - [Alex] an you give me an uppercase A? (playful music) (Alex cackles) - Those of you who spotted it before I did, you've had more time to think about it. Why would they make the right Shift a Delete key? There's no right Shift key. That's not even like, \"Oh, we had a Chinese layout,\" or a European layout. No layout is like that. It's a crying shame because that's a deal breaker. Why would you do that? This keyboard is a catastrophe And I just, just reviewed the Tommy Hilfiger keyboard. Why do you keep doing this to me, Alex? I think what I wanna know is, if this thing is full of fast computer or if it's full of lies. Why don't we dig into hardware info? What are we supposed to have? A 10th generation Core i7 processor with powerful performance, max turbo of 5 gigahertz, and eight cores. Wait, this is not an eight-core CPU at all, this is a completely different thing. Hold on a second. - They're half right, they're half right. - They've got the model number right but then they lie about the actual specs of that model. So unless you go on Intel Arc and make darn good and sure what the specs of this processor are. Well, what's the max turbo on this thing even? - It is five gigahertz, it is five gigahertz. - But it has two fewer cores. - (laughs) I take the two cores for sure. - That is fricking slow memory too. 2,400 megahertz? - [Alex] That's, like, fine for DDR4. Wait. - Except that they say it's supposed to be 2933. Oh no. And I'm supposed to have a terabyte of space, aren't I? - [Alex] 512. - 512. Hey, they managed to get that right but I had never heard of Heoraidy before. What kinda SSD is that? - [Alex] Oh, wait, so in this it shows up as one? - Yeah, the HX-001. Dual drives, wait. - Yeah, so there's- - No, this is only one drive. They partitioned it. What is with this? The other AliExpress computer we looked at recently also had a partitioned boot drive. Why? - (chuckles) I actually have no idea for that one. - The only explanation I can think of is you got people designing these things that are so old school that they remember the days when we used to short-stroke hard drives. So you would partition them smaller so that you would only use the outer edge of the disc which is faster. On an SSD it makes no difference. Oh man, this system is kinda stressing me out, Alex. (Alex chuckles) - Do you remember? You have a 10th-gen i7 in a $750 laptop. It's six cores, it's, like, actually not bad. - And 16 gigs of RAM for better or for worse, and 512 gigs of SSD, even if I don't recognize the brand. - One thing they did get really right though. 95W power adapter. This thing charges it super fast. - All right, let's Cinebench it. Nothing here stands out as particularly bad, though I wouldn't expect it to. I mean, this is only what? Like a 35W CPU and (puffs), it looks like it's got plenty of cooling in it. It's quiet too, actually. - They do say that they have their AAS+ wind tunnel technology. - Ah, yes, the ass plus wind. (both chuckle) That's wonderful. - But have you noticed anything kinda disappointing about this though? - Oh wait, no. CPU package power of 32 watts, that's about right for an H series, isn't it? - It is. - But it's not turboing. - It's not turboing. It's at 2.6 gigahertz, which is the base essentially all the time, when you hit it with any load. So, like, this guy right here. - This is probably also 10th-gen. - Ninth gen actually. - Oh. And it runs circles around it, doesn't it? - We'll see in a second here but this got 8,100 points in Cinebench R23. - I ended up with 5,100 points. - The bit that kills me is that it's so well cooled that they very easily, if they just programmed the BIOS better, could have had it boost for way longer and it would've been probably like- - Really good. - 30, 40% faster. I even took the time to, like, install XTU, and try and do some stuff, none of it took. - I don't have the testing tools here, they're all over at the lab right now. I give you my personal Linus Tech Tips guarantee that that is not 400 nits. - I went to the labs though. Do you wanna see the results of the screens? - I would love to see the results. Were they 100% coverage of the RGB color space? - (chuckles) Not sRGB, RGB. - 311 nits. All right, my eyes still work. Holy crap. 63% coverage of sRGB? I know that not everyone is an expert on all the DCI-P3s, and RGBs, and sRGBs. So let me just put it this way for you, guys. That is dog crap. I don't remember the last time I saw a display that bad. - I do. It was the Acer Nitro 5, their first gen. That was when I first started working here, like six years ago, with a TN panel. It gets better though, it gets better though. - Oh my god. It improves or it gets funnier? - Both. - The bottom screen manages to do 100% of sRGB. Okay. And actually Brandon from the lab seems to think it may be using the same bottom screen as Asus's ZenBook Duos, which might explain why they weren't able to cheap out on it. - Yeah, like, you can see the spectroscopy here. - Yeah, it's identical. - It's the same thing. So they use the exact same panel from ASUS for the bottom and then just completely cheap out on the top. - It's $750 though. - So what you can do, Linus. - Yes. - So you take your video that you're editing and you put it on the color-accurate display down on the bottom, and then you have the most room anyone's ever had for your timeline up on the other screen. - Ah man, everything is working against this thing. The slow RAM impedes the onboard GPU from performing its best, and then the crappy turbo frequencies on the CPU mean that you're gonna run into CPU bottlenecks, ironically. Are we done with the Windows experience? - Yeah. - Oh, no, I wanna try the webcam. Even on expensive laptops, the webcam tends to be where brands cheap out. And this is a potato and a half. What resolution does this claim to be? (playful music) - I don't know, they don't mention the webcam once. - They don't mention the webcam. If I were them, I wouldn't mention it either, but it has a nice bright indicator that it's working. - Just for comparison, here's the HP Dragonfly. - I mean, it's not great either. - This is one of the best webcams on a laptop, Linus. - Now it's time to open it up and see what makes it tick. - Yep. - All right, let's do it. You know what I'm kinda wondering right now is if this is on clearance on AliExpress, this should not be a $750 machine. Even with the shortcuts that we see. - It is on sale. So the normal price of this would be. Well, this is Canadian, so 1,600 Canadian, now it's 1,000 Canadian. - Here's yet another thing the hardware folks did right. Look at this. Two screws, no easily-breakable clips. Nice easy access, not just to the memory but to the storage as well. Love to see it. And it gets even better. There's another M.2 slot in here that appears to be NVMe, so they just cheaped out on the drive. How much cheaper is a SATA SSD these days? I mean, we are talking pennies. And on the subject of saving money, the 2,400 megahertz RAM is not because they were saving money, it's because they didn't program the BIOS properly. This is 2666 memory, which isn't as fast as they advertise, but is better than what it's running at. (calm playful music) All right. That is a heck of a lot of cooling for this CPU, they probably could have gotten away with just one of these. - I'm really surprised that they actually put in two, I was expecting to only see one of these. - Oh, just you thought the fan would just be- - I thought this was just like mesh or something over here to make it look like there's heat sink. (Linus laughs) - Yeah, heat pipes are expensive. That's not an insignificant cost for a budget machine like this, which, again, leads me to believe that this was not intended to be a budget machine. I think it's just ancient stock that they are desperately trying to get rid of. Yeah, even the battery would indicate this is not a budget machine, that's a 58 watt-hour battery. - Yeah. I got over four hours of battery life, which isn't incredible. - Yeah. - But also, like, I was expecting way worse. I thought it would be like a 25 watt-hour or something. Like, it's pretty decent. - At least that's what is written on it. Based on that, everything else about this thing has been a lie. It's possible that that is not, in fact, 58 watt-hours- - Beex says it's 51, and I tend to trust them 'cause they got everything else right. - Okay. - But either way, for something like this that's quite a bit of battery. - Okay, that's fair. - I was genuinely excited for this, Linus. I looked at the specs and the price, and I was like, \"That's legit.\" - You could even ignore that bottom screen, completely ignore it. - Yeah. - And this thing would be freaking amazing on paper. - Yeah. - Maybe it makes up for it in some other way. Let's try out the speakers. - I'm sure those are great. (bright music) They're not very loud, pretty quiet. (upbeat music) - I've heard way worse. - Yeah, like a lot of them will take speakers like this, make it twice as loud, and just distort the whole thing. (groovy upbeat music) Not bad, not bad. - They're fine. (groovy upbeat music) Yes, yes, yes, yes, yes. - Yeah. - It costs five times as much. It costs five times as much, Alex. Just like this message from our sponsor - Squarespace. In 2023, your brand or business needs an online presence, it needs it. Building your own website may seem daunting but Squarespace is there to make it easier than figuring out how the self-serve line works at your local grocery store. Squarespace is the easy-to-use platform to start building your online presence right away. With one click you're often ready to start selling or promoting anything and everything on the old interwebs. Local business, portfolio, blog? Squarespace has ready-to-use and easy-to-customize themes and templates for anything. They even look great on mobile devices. Heck, we use Squarespace here at LMG. If you already have a website, Squarespace makes it super simple to port your domain over and start using their customization and marketing tools to really stand out. And they offer 24/7 support. Wish I could say the same about the self-checkout line. So get started on your webpage today and head on over to squarespace.com/ltt for 10% off your first purchase. - If you guys enjoyed this video, you might enjoy the other recent AliExpress laptop video we did where we gave it a brown star for effort. I feel like this one gets at least a yellow star. - Yeah. - Not gold. - Yellow.",
    "transcript_keywords": [
        "Yeah",
        "thing",
        "CPU",
        "bottom",
        "linus",
        "time",
        "Squarespace",
        "screen",
        "buy",
        "Build Redux",
        "Asus",
        "display",
        "bottom screen",
        "laptop",
        "things",
        "bad",
        "Crelander",
        "put",
        "make",
        "Alex"
    ],
    "transcript_entity_values": [
        "webcam",
        "40%",
        "one",
        "1,000",
        "Brandon",
        "SSD",
        "eight",
        "a third",
        "One",
        "90Hz",
        "QHD",
        "RGB",
        "DC",
        "10%",
        "2,400 megahertz",
        "35W CPU",
        "GPU",
        "2933",
        "10th",
        "five gigahertz",
        "750",
        "2666",
        "Cinebench R23",
        "Canadian",
        "Linus",
        "the day",
        "8,100",
        "only one",
        "Type A",
        "half",
        "400",
        "512",
        "1200",
        "ASUS",
        "25 watt-hour",
        "DCI",
        "first",
        "Intel Arc",
        "2019",
        "750 bucks",
        "AliExpress",
        "MSI",
        "ZenBook Duos",
        "Linus Tech Tips",
        "Squarespace",
        "CPU",
        "2023",
        "max",
        "six",
        "60",
        "IO",
        "six years ago",
        "58 watt-hours- - Beex",
        "Windows",
        "32 watts",
        "G14",
        "ZenBooks Duo",
        "the HP Dragonfly",
        "Alex",
        "16",
        "five",
        "Crelander",
        "RJ45 jack",
        "European",
        "10",
        "Cinebench",
        "2.6 gigahertz",
        "100%",
        "LMG",
        "TN",
        "Build Redux",
        "HDMI",
        "1900",
        "311",
        "two",
        "30",
        "Heoraidy",
        "these days",
        "second",
        "PCI Express",
        "Two",
        "58 watt-hour",
        "Asus",
        "over four hours",
        "Chinese",
        "Hilfiger",
        "5 gigahertz",
        "today",
        "Tommy",
        "the days",
        "PCI",
        "RAM",
        "a ZenBook Duo",
        "1,600",
        "51",
        "63%",
        "90",
        "ZenBook",
        "5,100",
        "USB",
        "Alex cackles"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "PERCENT",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "MONEY",
        "DATE",
        "WORK_OF_ART",
        "NORP",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "NORP",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "GPE",
        "FAC",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "TIME",
        "NORP",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON"
    ],
    "vector": [
        -0.1349121630191803,
        -0.004412349779158831,
        -0.007738098036497831,
        -0.05242510512471199,
        0.034169621765613556,
        0.046976231038570404,
        -0.011021442711353302,
        0.051563456654548645,
        0.0012995441211387515,
        -0.024974843487143517,
        0.04855796694755554,
        0.009422682225704193,
        0.03068164549767971,
        -0.04247554764151573,
        0.015566200017929077,
        -0.015645083039999008,
        0.06441353261470795,
        -0.1697629988193512,
        -0.018592609092593193,
        -0.05620864778757095,
        -0.02242852747440338,
        -0.05681804567575455,
        0.016972873359918594,
        -0.03567824140191078,
        0.08589784055948257,
        -0.03976650908589363,
        0.021627258509397507,
        -0.06235286220908165,
        0.03342098370194435,
        -0.050667330622673035,
        0.0442638024687767,
        0.06443925201892853,
        -0.06390652805566788,
        0.02339952252805233,
        -0.007070582825690508,
        -0.08525635302066803,
        0.017173683270812035,
        -0.10915309935808182,
        -0.020262373611330986,
        -0.084864541888237,
        -0.03218795359134674,
        -0.03968968987464905,
        -0.048498716205358505,
        -0.021961525082588196,
        0.0241179671138525,
        -0.09469462931156158,
        0.010286322794854641,
        -0.005183377303183079,
        0.023678502067923546,
        0.05146519094705582,
        0.039922796189785004,
        -0.030664797872304916,
        -0.0026833205483853817,
        -0.041966553777456284,
        -0.04078887775540352,
        0.051760755479335785,
        -0.009652131237089634,
        -0.019008224830031395,
        0.001249588094651699,
        -0.04211036488413811,
        0.0664714053273201,
        -0.05324946343898773,
        -0.05416041612625122,
        0.09188392758369446,
        -0.022177455946803093,
        -0.07405173033475876,
        -0.02969227358698845,
        -0.016967857256531715,
        -0.031061766669154167,
        -0.013083899393677711,
        -0.002540305955335498,
        -0.018252812325954437,
        0.07365788519382477,
        0.02177363634109497,
        0.00038354526623152196,
        -0.0022966142278164625,
        0.06431175768375397,
        -0.06264366954565048,
        0.03341417759656906,
        0.033420126885175705,
        -0.006158107426017523,
        0.0032943806145340204,
        -0.03243400529026985,
        -0.05334903672337532,
        0.030136365443468094,
        -0.07756227999925613,
        0.04338240623474121,
        0.038432199507951736,
        0.04611659049987793,
        -0.06579993665218353,
        0.012073270976543427,
        0.04364829882979393,
        0.044868241995573044,
        0.0660557821393013,
        -0.06038963049650192,
        0.014422674663364887,
        0.04955239221453667,
        -0.03316735476255417,
        -0.01798015832901001,
        0.06838582456111908,
        0.026849305257201195,
        0.06250167638063431,
        0.11483209580183029,
        -0.058200955390930176,
        -0.06151464954018593,
        -0.10624752193689346,
        0.03370356187224388,
        0.03607425466179848,
        -0.0022402943577617407,
        -0.06489460915327072,
        -0.04043356701731682,
        0.025444060564041138,
        -0.05134696140885353,
        -0.0032592867501080036,
        0.030857136473059654,
        0.010459423996508121,
        -0.014007126912474632,
        -0.01270508673042059,
        0.10704727470874786,
        -0.05482733994722366,
        -0.05231337249279022,
        -0.038405001163482666,
        -0.01997489482164383,
        0.0027828046586364508,
        0.03764279559254646,
        -0.010112855583429337,
        -0.11347408592700958,
        4.566165561440943e-34,
        0.028221864253282547,
        0.024718215689063072,
        -0.0666697770357132,
        -0.10204914957284927,
        0.0010389649542048573,
        0.02824246697127819,
        0.003473622025921941,
        -0.005320731084793806,
        -0.009778955020010471,
        0.020892638713121414,
        -0.039991769939661026,
        0.003099648514762521,
        -0.046362727880477905,
        0.04495035484433174,
        0.02844502404332161,
        -0.03943159058690071,
        -0.03215300664305687,
        0.030443008989095688,
        -0.00696645537391305,
        -0.01569463312625885,
        0.038084227591753006,
        -0.047288548201322556,
        0.004008028190582991,
        -0.085382841527462,
        0.04287736862897873,
        -0.038452472537755966,
        -0.004579109139740467,
        0.020431434735655785,
        0.04507497325539589,
        0.037836916744709015,
        -0.044115129858255386,
        -0.0674741268157959,
        -0.017649132758378983,
        -0.07368737459182739,
        -0.05352542921900749,
        0.00943110790103674,
        -0.07196815311908722,
        -0.08979010581970215,
        0.056600697338581085,
        0.006683649029582739,
        -0.05284476652741432,
        0.05269565433263779,
        -0.04955050349235535,
        -0.13150709867477417,
        0.024535825476050377,
        0.02224765345454216,
        -0.011604583822190762,
        0.035821348428726196,
        0.051929835230112076,
        -0.002525787800550461,
        -0.11838742345571518,
        0.04586150124669075,
        -0.017094334587454796,
        -0.0203477144241333,
        -0.017554517835378647,
        -0.002012689597904682,
        0.02204274944961071,
        -0.0018048693891614676,
        0.1418588012456894,
        0.07961926609277725,
        -0.00184329051990062,
        -0.06996308267116547,
        -0.020769428461790085,
        -0.027868712320923805,
        -0.03466225787997246,
        0.06272900849580765,
        0.06268743425607681,
        0.00211471039801836,
        -0.07221870124340057,
        0.01984884962439537,
        -0.034008510410785675,
        -0.035223640501499176,
        0.08631645888090134,
        -0.08058233559131622,
        0.07248270511627197,
        -0.017821118235588074,
        -0.08760786801576614,
        -0.017866279929876328,
        0.018021972849965096,
        0.038774337619543076,
        -0.09610757976770401,
        0.07676912844181061,
        0.062324780970811844,
        0.024392975494265556,
        0.019982947036623955,
        0.030123179778456688,
        0.014687905088067055,
        0.005393400322645903,
        -0.01722750812768936,
        0.051294852048158646,
        -0.011106052435934544,
        -0.009267781861126423,
        -0.04699959233403206,
        -0.014740088023245335,
        0.012665913440287113,
        -2.762818188338371e-33,
        -0.07249638438224792,
        0.027310866862535477,
        -0.028043540194630623,
        0.010218547657132149,
        0.04347127303481102,
        -0.0005928187747485936,
        0.03178553283214569,
        0.04805823415517807,
        -0.018596747890114784,
        -0.002101177116855979,
        0.04243241995573044,
        0.07255177199840546,
        -0.05215414613485336,
        0.009144932962954044,
        0.03951886296272278,
        -0.08793815225362778,
        0.04158542677760124,
        -0.0660865381360054,
        0.08212071657180786,
        0.0054676346480846405,
        0.11016616225242615,
        0.04826818034052849,
        -0.009212623350322247,
        0.04574580118060112,
        0.04523725062608719,
        -0.03536970913410187,
        -0.02092939242720604,
        0.026999523863196373,
        -0.021679822355508804,
        0.06030534952878952,
        0.03070305660367012,
        -0.03897573798894882,
        0.01836620643734932,
        0.054763540625572205,
        0.07436145842075348,
        -0.06928466260433197,
        0.057420164346694946,
        0.03539810702204704,
        -0.03874492272734642,
        0.02985682152211666,
        0.09067831933498383,
        -0.008404992520809174,
        -0.004381971899420023,
        0.0010189739987254143,
        0.06780747324228287,
        -0.028323065489530563,
        -0.027776528149843216,
        -0.12933658063411713,
        7.3543315011193044e-06,
        -0.05395840108394623,
        -0.023155827075242996,
        -0.011498923413455486,
        0.07122312486171722,
        0.03484714776277542,
        -0.02160683646798134,
        -0.04375460371375084,
        -0.05196239426732063,
        0.07512899488210678,
        0.025044357404112816,
        -0.03439011797308922,
        0.04258293658494949,
        0.01627426967024803,
        -0.046709902584552765,
        -0.015321834944188595,
        0.026996353641152382,
        -0.04438984394073486,
        0.04980066418647766,
        0.04866427183151245,
        -0.027559231966733932,
        -0.024432344362139702,
        -0.05940813943743706,
        -0.049134477972984314,
        0.016267208382487297,
        -0.09520968794822693,
        -0.00992598570883274,
        0.05283283069729805,
        0.0382704958319664,
        -0.03037501499056816,
        0.036820001900196075,
        -0.025020446628332138,
        0.014117002487182617,
        -0.05679270252585411,
        0.06846989691257477,
        -0.02101818285882473,
        0.03394670411944389,
        -0.012357511557638645,
        -0.0011788004776462913,
        -0.0612168051302433,
        -0.04106103628873825,
        -0.01330997422337532,
        -0.0370941087603569,
        0.010746480897068977,
        -0.039126187562942505,
        0.0076966420747339725,
        0.03320742025971413,
        -5.687535775678043e-08,
        -0.07711096107959747,
        0.018046852201223373,
        0.051894526928663254,
        0.07352279871702194,
        0.004315175581723452,
        -0.0646350234746933,
        0.05217430740594864,
        -0.0218622125685215,
        0.05868158116936684,
        0.031193504109978676,
        0.02583368308842182,
        -0.18914830684661865,
        0.030769631266593933,
        0.008469846099615097,
        -0.047432392835617065,
        0.04252143204212189,
        -0.0611773319542408,
        0.09855607151985168,
        -0.005637830588966608,
        -0.05887305736541748,
        0.00408293679356575,
        0.06119487062096596,
        0.12980706989765167,
        -0.02744533121585846,
        0.031727857887744904,
        0.09368395805358887,
        -0.035414859652519226,
        0.04525402560830116,
        0.10110439360141754,
        -0.04435642436146736,
        -0.07920032739639282,
        0.0020115766674280167,
        0.05617920309305191,
        0.00983276218175888,
        0.015603735111653805,
        -0.08353575319051743,
        0.01167996134608984,
        0.08234083652496338,
        0.09381116181612015,
        0.040164414793252945,
        0.00024698086781427264,
        -0.03867015987634659,
        0.009817827492952347,
        -0.003179987659677863,
        0.09694717824459076,
        0.02740175649523735,
        -0.023616846650838852,
        -0.10460007190704346,
        0.029870497062802315,
        0.013337529264390469,
        0.020920002833008766,
        -0.020090308040380478,
        0.051516130566596985,
        -0.012002605944871902,
        0.037502970546483994,
        -0.03013107366859913,
        -0.05984434112906456,
        0.06504720449447632,
        -0.0022195419296622276,
        0.0780005156993866,
        0.06333551555871964,
        -0.12834680080413818,
        -0.05338615924119949,
        0.07806587964296341
    ]
}