{
    "id": "evFF2V05ntE",
    "title": "Did these AWFUL PC Setups get any better?",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-12-07T18:43:21Z",
    "video_url": "https://www.youtube.com/watch?v=evFF2V05ntE",
    "category": "Science & Technology",
    "tags": [
        "roast",
        "setups",
        "battlestations",
        "pc",
        "workstation",
        "making fun of",
        "react to",
        "computers",
        "PC Roast",
        "roasting PCs",
        "roast computers",
        "diy laptop",
        "box PC",
        "battlestation roasting",
        "roasting setups",
        "setups roasted"
    ],
    "views": 1450561,
    "likes": 48826,
    "comments_count": 1763,
    "description": "A big thank you to MSI for sponsoring this video! Check out the laptops featured in the video and more using the links below:  MSI laptop holiday deals:  MSI Raider GE68 HX:  MSI Summit E13 Flip EVO:  MSI Stealth 14:   Weve roasted a lot of setups, but what about your glow ups? Thank you to all of the community members who submitted their own big upgrades for us to admire or poke fun at.  Discuss on the forum:    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:13 Keyboard Room 2:13 The Gaming Den 3:06 No more manga 3:53 A bathroom?? 4:42 Cardboard monitor stand 5:30 Axe Man 7:47 Messy 8:51 Square setup 9:31 Wife Approval Factor 10:37 Ledge mounted monitor 11:44 Couple Setup 12:24 Vape Naysh 12:52 Concrete Case?? 13:31 Perpendicular Keyboard 14:23 GELO 15:11 Gaming from bed 16:31 Old ahh laptop 17:04 A scale?? 17:50 Costco Special 18:35 IS THAT A SUPRA? 18:55 Microwave 19:25 Union Jack Donut? 20:02 Bowl of chili 20:46 Sip Peel Win 21:21 Wall PC 22:02 A Bunk Bed 22:51 Ring Light Misuse 23:27 Mallet Man 23:50 Old ahh setup 24:32 They put pencil on keyboard 25:11 Vertical Closet 25:47 2002-2021 27:01 Outro",
    "description_links": [
        "https://msi.gm/S27694F8",
        "https://msi.gm/SB2E8991",
        "https://msi.gm/S62122C5",
        "https://www.bestbuy.com/site/msi-stealth-14-165hz-fhd-gaming-laptop-intel-core-i7-13620h-nvidia-geforce-rtx-4060-with-16gb-ram-and-1tb-ssd-blue/6534580.p?skuId=6534580",
        "https://linustechtips.com/topic/1545745-roasting-your-glow-ups/",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "He's got the computer in a microwave! That is sick. I'm not expecting you guys to be able to keep up with my recent glow up But MSI sponsored this video so that we could show a bit of appreciation To our community and take a look at your setup glow ups Whether you cable managed wired up a ton of RGB or went whole hog and completely redid your existing setup I want to see it Plouffe and James want to see it and most importantly All of you guys also want to see it before we get started though I just want to give a huge thanks and shout out to everyone who submitted pictures for today's video We wouldn't be here without you and also a big thanks to MSI and their new laptops the Raider GE68 and Summit E13 flip the Raider that I'm roasting you guys with today has got up to a 13th gen Intel core i9 processor, an RTX 4090 mobile absolute beast and they're cooling it with a brand new shared heat pipe design We'll get more into it and the E13 flip later. But for now, let's light them up Start with Ada Lundhe. Before! I do like this setup, but where is the actual computer? It's under the piano chair Hey, there it is Piano chair you say, that's pretty generous. That looks like an Ikea bar stool to me You know what considering how much gear is in here though? Not bad cable management You didn't have to use your old 0.3 megapixel Logitech webcam to take the picture though. Maybe it's a really old picture Maybe this is a really old setup. I mean that is a square monitor. Yeah. This is back from the days where all walls were yellow Whoa! Thats crazy. Person won the lottery in the interim years I think. Right? Holy cow. All of this audio equipment is tens of thousands of dollars This person is just one of those people who like setting things up Do you actually use this stuff? You cannot play that many keyboards at once I think we witnessed the transition from amateur to professional or from amateur to amateur with a big problem. Sounds like me Adri Dwitomo. Oh, I like the studio monitors or whatever speakers those are. You know, I don't even mind this setup I like these stands. I don't know what you put under them. Surely, those aren't your surround speakers. Oh! No, you didnt! Never took them off It's so much easier to take them off before you put the wheels on. Was that a UPS down there? Yeah, man or lady of culture. I will sacrifice my foot space. This is nice Now that's a gaming den. What do we got over here? We got the Witcher He's got a nice camera. Wow nice streaming setup. Yeah. Wireless dock. Yeah Also- This persons set up. What is with these cultured folks with the studio monitor speakers? Right? You know, I never got into it. But man, do they ever sound good? What's under that white cloth? Oh, that's a mystery cloth. Something we're not supposed to see Obviously. Covered it for the photo. Azura. This is the before? This is a nice before. This must glow a lot now if this is what we're looking at for before. This is before at my parents house Sure. Yeah, they got a bunch of manga. They buy every Call of Duty. Buy a lot of Call of Duty. They've got a Switch on the left there Okay, they added lighting. Is that same room? It kind of looks like, well go back go back to the crown molding Yeah, it is! In my humble opinion, the old setup was kind of cooler This is more mature. Yeah, this is way more tasteful Except you need a diffuser for those crown molding LEDs when you can just see the LEDs exposed, no good. It has character. I get it. You need to bring a girl over once in a while. That wasn't an issue at this point How do you know it's not a girl? How do you know they're into girls? If you were bringing a dude over this wouldn't be a problem. Well, okay fine. Oh my god, are you in a bathroom? Oh, no. No, I don't think this is a bathroom I think this is off to the side in the kitchen Oh, maybe. I think this is the old-school phone table. And really like Facebook? Right hand side start menu? You monster! How much you want to bet there's no deodorant? Anyone who would have a right side start panel would have no deodorant. Oh! Wow. This is great. I love it when they do the effort of making it all one thing. It looks really nice I like how the speakers nest underneath in that in the gaps there. That's cool. Tell me this blue. Yeah keyboard nerd Tell me this Plouffe? Yeah? Youre the keyboard nerd How cool is this keyboard, out of ten? It's it's pretty sweet. I really like that wrist rest. Yeah, I was gonna say I really like the like marbly wrist rest. This is perfectly parallel. Its a coiled cable. Perfectly parallel to the keyboard. Yep. Nice little 60% Oh that plywood. Or is that cardboard? Thats cardboard dude. Thats cardboard. First year engineering student. Also this side panel though. Yeah. There is a side panel on there I just think it is actually cellophane. Oh, I thought it was a plastic peel. Its totally wrapped. Oh my goodness, this OSD This interface though. The monitor, he took it right out of the shell. It can't get much worse The background got worse. Hey, but the desk pad. Oh yeah, new keyboard with the cable. Cool keyboard. Could be straightened. Couldnt be bothered to organize that Those are some weak headphones. Wait, combo breaker? We've had all stereo monitors up until now and then we end up with this Is this running off a MacBook or is there a PC somewhere? It's probably off of whatever they got at the dollar store with their headphones. This is classic, look at this Got the old desk. This is a laptop plugged into a TV This desk though I don't even think that's Ikea grade. Got the sick studio monitor. He's got like a hatchet or an axe though This guy an axe murderer? Why do you need this axe? This is the before picture of that other guys white cloth Yeah, you just got a laptop down there. Speaking of laptops, did I mention the Raider GE 68 has a bunch of cool aesthetic upgrades? there's a new customizable matrix light bar and they've infused the MSI logo into numerous spots on the chassis like into the bottom the hinge cover and concealed here in the speaker mesh. How cool is that? Not as cool as this setup Is that a playstation on the bottom shelf or another laptop? PS3 fat. PS3, yeah. Uh oh, it gets Linus-ified Are those just heat sinks sandwiched? With weights on them And I hate that I understand this immediately looking at it The weights are on them because there's no actual mount and they just need some pressure to ensure decent contact between the heat sink and the chip. You're disappointed because you see yourself in this build This is totally something you would have done. This is something I have done! Look at that nice mount though on the side. That's not a nice mount They've got double-sided tape with double-sided velcro on it. No, but it's awesome for convenience You don't have to bend over get your head in there you unvelcro it and dongle up velcro back on I fully agree, and this cabinet or whatever this desk they're using. It's not that expensive You know, they can deal with the tape ripping off later. That's a very tactful way of putting that. See the laptop protrudes out the front? Yeah. That's air flow. There's no door. Go to the after Oh That's crazy Racing, streaming. Okay. So what kind of job did you get? No, look at the desk. Oh, no! No, the desk is even worse That's practical. It might be the same desk is reconfigured. Yeah, that's what the axe was for. Look at this. Ooh They got the LTT sticker Yeah, at least they got their priorities straight spend all your money on LTT store.com Have no money left for a desk that doesn't look like your rodent chewed on it. Oh! I figured it out you guys. This is all chewed up from mounting and remounting the wheel. Oh my God. There it is. That's their old racing rig. Well, it looks better now. Look at that chair. You got that from someone's lawn Wow, thats messy but there's stuff there. Oh we got a creator here? Yep. Got the key-shaped USB, I like it. Hey, they got a command strip holding the headphones, you know, you can take that off without it damaging anything. Carefully peeling it. And its gone. You're not supposed to do that. Is that a fidget spinner or what is that? A disc holder? Is the fidget spinner really our concern when they're using a pull-out keyboard tray? They feel great when you don't want to keep your arms like up on the desk No, they don't! They are awful. Look at this mousing space. Yeah. Okay, that's pretty bad Also, this looks like the worst of the worst of gaming chairs when you have to put one of these dollar store butt pads on just to make it usable, you know, you've made a really poor decision This guy's driver's seat has the beads on it, you know Hey, that's some organization got that nice butcher block gonna make my own table out of just a big piece of wood vibe This is a studio now though. Yes Yeah. It looks good. Some treatment on the ceiling, maybe. Some acoustic treatment would be good. Wow. That's a clean under desk though. Your robot vacuum loves you. Oh classic. Wow, everything about this is square. The monitors, the aspect ratio, the photo. What's that tablet or whatever on the left? Oh my god, that's a Wii U with a sick Splatoon skin or something on it. They do exist It looks like from a scene in Alien where there was gonna be a soldier hung up in that We should just sell shrouds like the desk mats. Just hang them there Also, who do you think you're fooling? What you're gonna put all these in a nice little grid like you're not some kind of savage who just puts everything all over your desktop. No, if you have that many icons on your desktop, you and I can't be friends. Wow. Wife approval factor Well depends if this is in the bedroom, I dont think my wife would be impressed. Okay, let me rephrase that wife banished factor She gave him this space. Yeah Also, like the ergonomics of this do not look great. You're sitting here. Gaming from the floor. Here we go aquarium vibes I am far more into the minifigures vibe than the gigantic figures in my space vibe. I think it's cool clutter It's nice, especially on a floating shelf. Pull out keyboard tray. Really? Did you go out of your way to add that to this table? They probably don't have much space. Oh wait, holy crap Did you guys notice how low-profile this is? Yeah. That's not deep at all. These are mounted to the wall So your wife gave you even less space. But boy, did you ever make the most of it? I like it I really like that lamp on the left What, this? Yeah. Shining down on the screen? No, I refuse to accept that that is a valid place to put a lamp Andys got one! I like the lamp. I know what Andy has You have to try it! I'm not gonna try it. We go out of our way to not have light shining off of our monitors. This is pretty nice This is a pretty nice before, you sure you didn't get those confused? Oh a nice ledge by the window, the monitors on the ledge What? What? The tiny Acer monitor. Why? You have enough depth in your desk. You just put it on- No, no, I get it sometimes- Yeah, sometimes they want to put the arms down. That is not a big enough monitor to- Like a keyboard cat? Intentionally move it farther away. No, I'm sorry They moved or something. You are now above a garage. Cool loft space though It just would have been so much better if you had managed to measure the middle point before you started sticking it to the wall Oh yeah its just a little short Thats the kind of thing that you go is it worth redoing all of this no, no, no one else will ever know- The internet. We did. I love these right angle window cases though, that is sick. Got the printer. First printer. Yeah. They got a keyboard stand. Okay, that's not a keyboard stand That's just an Ikea pegboard that they happen to put a keyboard on. Ah, that is a thing he owns. A keyboard presentation stand, because you have more keyboards than you could possibly ever use Evan and Katelyn It's a couple. This is the before? This is awesome. What's up with these laptops? Why would you use laptops when you have this much space? And it looks like they have a desktop under the desk anyway Is that her hair extensions hanging out in the foreground? That looks like it or a wig yeah. Wow! Someone made some YouTube money. It looks great. Look at all that treatment. Looks awesome. Probably sounds amazing in there. I love this desk. That's the same desk. Oh, wow. It's very practical. It's cleaner now. Two keyboards is a better number than what you had going on there before. Some of the same mice Seven monitors, that's a lot of monitors. They got chat, other chat, other other chat Keep it simple. Yeah. Got a monitor arm. Is that a vape? It looks like it, yeah. Front and center baby. Got the vape Tasteful vape. Got the Xbox controller what else could you possibly need? Whoa got the father-son setup going on I love it. You can tell which one's the dad by the computers. Yeah by how much better it is See, I would never consider giving my son an inferior setup Is that white thing the vape still or did this guy quit? Nope Vapes right there baby. Made my case out of concrete? That's wild. Is that good for cooling like it's gonna suck in a lot of heat but then it's gonna keep it. What is this speaker doing? There's so many questions. Where are the fans on these holes? It just uses the Noctua fans to cool everything. I think there's a primitive technology video where he builds this case He's got the DVD. Look at this. You got the diamond plating side panel though. This looks pretty good though, they got the Kleenex on the desk. So they're always ready. Where's your VR headset? Where's your VR headset? This is like kind of garage vibes. That pair of scissors on the right I would angle that the other way more feng shui. Yeah. Wow. He's got his keyboard vertical so he could type like this He just pecks! Finger guns. Does some actual electronics stuff though. Those sunglasses were free These headphones were free. I hope so. What about the back there behind the keyboard this guy right here? Yeah. No idea. Clearly some kind of display cuz there's an HDMI cable Hooked into a RasPi or something It looks like it's made out of K'nex. Like is this a Lego monitor stand? Mad respect for the cardboard box monitor stand Almost as good as that other cardboard box monitor stand? I love the Yellowstone, Sequoia, and Yosemite posters. Okay, this is still here. What is this thing? It's got a use They got a nice keyboard, a glasses case Definitely a big headphone glow up. Also these Lego plant kits. Oh, yeah, they're great. A little bonsai It's super popular. Yvonne got into them. We have like all of them Gelo That bag of chips front and center? What the hell is Gelo? Theres several. I think there's two or three, theres two bags of chips right there. Oh, I haven't seen this in many a year Do you remember the music visualization in Windows Media Player? This is a pretty old picture. That was so cool. Whoa What is all that? Funko Pops. I can't say that I think it's a great investment, but if they make you happy Cool case. Oh yeah. Is it Gundam or what is it? It looks like it. I like the planning here. You got a calendar. Yeah, nothing on it They probably want four sticks of RAM just so that they've got the RGB going. Reminder: do nothing Wait till next January get motivated again. Oh, it is Gundam, this is awsesome. Theres a figurine in the computer. That's pretty cool. Oh no Wow Let's address the sheets first. Who were your celebrity crushes? You really should not charge your devices in your bed. If they catch fire you burn. I like that cute little clock Yeah, I like it. It's like old-school alarm clock. That thing gets loud Honestly, I consider this to be a better use of this pullout drawer than putting a keyboard on it I want to know why there's a microphone here. Recording farts They're gaming from bed and they're using that microphone because they don't want to use the crappy mic on the laptop. You know what? Respect. Yeah. Hey Well, they're a Magic fan. Another awesome case. Yeah, cool keyboard. Sick keyboard. Nice skin on the MacBook Yeah, white peripherals. Oh ergo mouse. Wow There must have been a lot of years in between these ones that would be kind of a fun game to play Oh, how long between? How many years in between? Should have asked. We're just gonna power through it boys Sounds good. Just like we're gonna power through this message from MSI. Don't you hate not having enough IO? Well with the Raider GE 68 You're always good to go No matter what needs plugging in. Two USB A 3.2 Gen 2 ports, two type C 3.2 Gen 2 ports, one with power delivery Both with DisplayPort, Thunderbolt 4 with DisplayPort, but wait, there's more. We've also got HDMI 2.1 for 4k 120 hertz an audio combo jack, full-size SD card, and when Wi-Fi 60 just isn't enough There's an Ethernet port so you can stay connected no matter what? Oh an old Alienware laptop Canada Dry, baby You got an upset stomach? You didn't even bother showing us the computer just the tissues Got the glass bottle coke and Pepsi though. Oh good job This is really nice. Maximizing the space. The only problem is where do you put your legs and your feet? Yeah, that's a problem You sit cross-legged. I mean I sit cross-legged and even then I like to be under the desk. All right, sure Yeah, got your booze got your gin up there. Oh, yeah, what like Malibu? Beer fridge. Got your guns Your pistols. Classic photo one. Wow. Wow, no bag in the garbage can Harley Quinn hanging around. A scale. Scale, come on. All you need is like a bag of baggies right there Corks in the bottles. I mean, I don't drink but I'm pretty sure that's not right Yeah, the double desk pad with the mic. I hate it so much. Me too. It's killing me. Is this pornographic? It's erotic Look hes got the boob mousepad! And these chesty figurines, oh, yeah, chesty is a way to put it sure. Okay, go to the figurines You gotta zoom in that much. No, I think some of these are NSFW Go to the figurines. They designed them to go on your monitor? Got the webcam pointed up. What are you doing in front of your computer buddy? Nice chair Wow that chair though. That's a Costco special. Thats comfy. No, it's not. I have personally owned that chair for 10 minutes. Comfy for a little while Yeah, the shiny parts where the body touches Oh, LTT deskpad. Not bad, they got the fancy headphone rack. Love to see the UPS, take care of your equipment ladies and gentlemen Look at that undermounted DAC. Yeah, and I don't see any cables down there either. Classy. Tasteful. Yeah, I really like this set up, got the PS5. Look at that That is the mark of someone who can Aesthetically manage a setup if you can have a ps5 that doesn't stand out like a disgusting ugly sore thumb It's because it's turned sideways. Yeah You can't see the collar thing. You're doing good. You're doing good. The Minecraft, got the VR, got this skittles What changed? What changed? You just cleaned up got a new PC that's what it's about. New PC, different desk Well, at least yeah, very metallic. Stainless steel cup is in the same spot It's very similar. Buddy knows what they like got that muscle memory. Hes got the computer in a microwave! That is sick. Why haven't we built a computer in a microwave? That is so cool. I don't know because it would be terrible for cooling. Yeah, but you got a clock on it and everything. Oh my god This shelf, you know what I would do too, I'd have the buttons functional and when you hit start it goes like zap, zap, zap As if it's blowing up your stuff Its still there. Still got the microwave. Yet another barely changed. They got a light bar in the back looks pretty cool All right, Lew. I like the Bulbasaur. Oh Interesting looking keyboard. Oh, yeah. I like how it's very flush. Little rounded. Yeah rounded What is that like a donut with a Union Jack? They got two phones. This is the after this is nice You got a new keyboard. Underutilized right? The whole plant vibe. Yeah, you see very little of it I recognize this mousepad. We just bought one on Wish. No It has typos on it. Oh, yeah, yeah Yeah, the two cities that are highlighted in Canada are like Edmonton and freaking something else. RIP Edmonton Nevermind, Toronto or Ottawa or like a city that matters. Victoria. Here comes moonfighter. Oh, I hope you won There's a bowl of chili. You're gonna beat it by farting on it. Oh, they playing WoW? What other game do you think someone eating chili with bread at their desk is playing? They've got the buttered bread Mom! Mom! They got that CRT got the JVC it's great. I hope there's chili in the glow up. Well, that's really nice though They definitely aged like 10 years. They found love. and it's a probably a partner setup. They found a partner yeah, the wife approval factor of this setup is a lot higher. A plant looks great on a on a riser stand. Oh, yeah, they really do. Yeah, those chairs are so cool. Yeah Yeah, look a little dog bed. Oh my god. I bet he just sleeps there. Yeah, underneath That's so cute. That's super cute. Oh, hey Terry. Oh, hey Just has the drink in there. Sip, peel, win! That tiny Razer mouse pad. Vertical Razer mouse pad They got the Logitech speakers though. I've got these exact same ones at home because I was cheap and broke I spent like 50 bucks. I got the whole kit. I like the wall-mounted networking. Yeah, I'm into it. Yeah, I think it's cool I love it. It's you know what? It's not the most aesthetically pleasing thing. But boy, is it ever practical. Some sound treatment they got the GOXLR. Rocing the GOXLR. Very nice cable management under the desk Yeah, nice glow up, good glow up. Whoa, this is the before? This is a good before They got the wall PC. Yeah with the Vader. Who's pointing the blaster at him? Is Han pointing a blaster at Vader's head? We'll never know. Whoa That sign I want that neon sign People have a lot of monitors Mr. Bean? Hilarious, cardboard cutout Thats the first thing I saw, its like someone's watching me right now. There's two computers now, two wall computers. Wow cable management, that CPU collection. Wow Stunting. 1600p he's got Why is it SLI? Why you have to GPUs? You're mining. It's not even SLI. Nah, nah they're mining This is the before or after? This is the after. What are you mining now? RedFox. A bunk bed, a chair They got a laptop there. Talk about the MSI one, yeah MSI laptops I almost forgot to mention the stunning summit E13 flip Evo being used by my co-host with up to a 13th gen Intel core i7 processor It's great for business meetings and comes with an MSI pen so you can take notes. However, you want you caveman Pull the sheet all the way down. I don't. That fourth corners tough man. Too lazy. Yeah, okay Okay, you still don't pull your sheet down. No, but they've made some upgrades here. What has changed? A PS5. What the hell is this desk? They got a ps5 It is impressive that you've managed to be in the running for worst desk. Also this arm Your poor arm. What shape is it now? You gotta do what you gotta do You guys have seen the head creases from headphones, right? What does your arm look like? Rednek Engineer. Whoa, this is the before That's the before that's not bad. It's not bad. That's not how you use a ring light but okay. Should be a little higher This went like very engineer-y. Yeah, very practical. Are those footrests? It looks like it. Theyre there to keep the computers off the floor, which is really important for dust management Got a couple multi tools here. Got a, I hope your kids gave you that. His best friend gave him that Wait, I shouldn't be mean they've got the LTT desk pad. Oh, I'm sorry. I'm sorry one of the long ones too. Yeah, is that a foot pedal? Kind of look like it. Yeah, maybe activating your mute or something like that. That's so cool Okay, we've seen hatchets, but this is the first hammer Thats a mallet. They're different, they're very different, they're very different theyre used for different things. Is there another monitor on the ground? Looks like it on the right there Yeah, old monitor. He upgraded and took this picture. Yo the computers got older. It's a remarkable. Oh, wow 9800 pro AGP. Let's go. This rug is old, but never is it dirty? Wow this is old. That fan definitely was supposed to be there exactly like that. Hey, it's better It's kind of like the same motherboard and fan. Wow, they've got a GPU now. Rotated it the other way. Okay Not bad, not bad. That seems to be vodka labels. Wow That's a look that's more vodka labels. Oh, okay. Blur that. Blur that one. Geez. I wonder what CPU is in there Well, I'm not gonna look any closer at it. Is that a vape? Are these 18-650s? There's definitely some vape action going on here Keeping it real. I mean why paint over the wall patches when you could just patch them They're just as patched whether you paint them or not. It's a whole aesthetic Just keep patching it Icons. This is uh, yeah that desktop hurts me. How old is this drink? I hope it started out pink Okay, Plouffe. The keyboard? The eMachines keyboard with the with the pencil on it. I don't like it I used to put pencils in the same spot though, I'm not gonna lie when I was a kid. I just stick them there. Yep Whoa. Still big schoolgirl energy. They've grown up, but they're the same person pink controller What does it call when you have that mini curtain at the top of the window? I don't know I hate them Valence. Valence is it? I think it's a valence f***ing got him. Nice. It is a valence. Nice Yo You've got to do what you got to do. Yeah I mean if you don't have room and the horizontal plane for your second monitor, I like the vertical closet Yeah, I love it. I love hanging stuff up instead of folding it, so much better. Just hang, hang Every console known to man. This is recent because that's like a ps5 controller. Dust blowers I mean why vacuum when you can just just blow it around. Yeah. This is before the promotion. After getting a job Well slightly better. Boom. Okay, so you've got a TV tray Table extension. No, it's better. Is it? It is better. Is it? Okay Zippo. Zippo. With the multiple setups 2002 Wow This is Linus house. I'm actually loving it got the Discman got the mini disc I always forget how deep CRTs are. I know right? Got the slinky. A slinky This is a high swag setup. Slept with the head on that side. Oh wow Oh, I wouldn't do that. No. So is this just two years later 2004? Zaser got the Zaser case They made some pretty big upgrades like they got a whole desk got the MX duo though Wow, I remember these little bubble LED things. They got the Zalman cooler They were cringe then and they're cringe now. I'm not saying I didn't like them. Hell yeah. Looks awesome though. Raid max. I remember the first time I saw a PC like that in someone's house I didn't even know that stuff was possible, right? Okay 2021 here we go. Not bad. All right. Whoa that's a lot of Kirbys. And there's a cat there Zoom in on the cat. That is a fat cat. Hes looking out the window. That's a big-ass kitty. Oh, he's so fluffy You know why the computer setup wasn't as impressive? They spent all their money on Kirbys and MSI spent all their money sponsoring this video. This was a ton of fun I like how positive it is seeing people make upgrades So we actually spent most of the time roasting them. Whatever that was scripted. The point is speaking of small We've got MSI's stealth 16 studio It's a thin and light portable laptop that can handle both gaming and creative tasks We even used them in the gaming minivan that we kitted out a few months ago Thanks again to MSI for sponsoring this video. If you want to check out any of the laptops we mentioned today We're gonna have them linked in the description below. If you guys enjoyed this video be sure to check out other roasting videos We've done we've got to do one in person at LTX and that was super fun getting to see the reactions firsthand",
    "transcript_keywords": [
        "Yeah",
        "Wow",
        "desk",
        "nice",
        "keyboard",
        "yeah Yeah",
        "cool",
        "monitor",
        "setup",
        "MSI",
        "yeah MSI laptops",
        "good",
        "put",
        "monitors",
        "pretty",
        "kind",
        "thing",
        "laptop",
        "yeah MSI",
        "love"
    ],
    "transcript_entity_values": [
        "Andys",
        "Valence",
        "one",
        "Bean",
        "Acer",
        "Raider",
        "Azura",
        "Zippo",
        "RGB",
        "Gen 2",
        "JVC",
        "Evo",
        "Noctua",
        "GPU",
        "0.3",
        "Andy",
        "Seven",
        "2002",
        "Logitech",
        "GOXLR",
        "Jack",
        "Xbox",
        "LTT",
        "Pepsi",
        "eMachines",
        "three",
        "Canada",
        "Wi-Fi 60",
        "K'nex",
        "YouTube",
        "SLI",
        "50 bucks",
        "Piano",
        "Linus",
        "years",
        "Han",
        "Rednek Engineer",
        "Edmonton",
        "Sequoia",
        "first",
        "Call of Duty",
        "CRT",
        "First",
        "ps5",
        "Racing",
        "Corks",
        "Gundam",
        "Zalman",
        "Nice Yo",
        "MSI",
        "Malibu",
        "Nice little 60%",
        "Evan",
        "Lew",
        "the MacBook Yeah",
        "Vader",
        "Lego",
        "4",
        "Discman",
        "Facebook",
        "CPU",
        "Vertical Razer",
        "Kirbys",
        "13th",
        "Minecraft",
        "Adri Dwitomo",
        "C 3.2 Gen 2",
        "Switch",
        "MX",
        "Intel",
        "3.2",
        "two years later 2004",
        "10 minutes",
        "Yosemite",
        "Raider GE 68",
        "Ethernet",
        "DisplayPort",
        "four",
        "2021",
        "Magic",
        "MacBook",
        "SD",
        "Canada Dry",
        "LTT store.com",
        "Classic",
        "Harley Quinn",
        "16",
        "Terry",
        "up to a",
        "Vader",
        "James",
        "9800",
        "a ton",
        "PS5",
        "10 years",
        "Zaser",
        "Razer mouse",
        "2.1",
        "tens of thousands of dollars",
        "Victoria",
        "HDMI",
        "Yellowstone",
        "Summit E13",
        "fourth",
        "two",
        "OSD",
        "Yo",
        "Witcher",
        "second",
        "Splatoon",
        "Windows Media Player",
        "Valence",
        "Two",
        "Funko Pops",
        "Toronto",
        "Kleenex",
        "Ada Lundhe",
        "Yvonne",
        "today",
        "4k",
        "the days",
        "Plouffe",
        "4090",
        "feng shui",
        "a few months ago",
        "RAM",
        "E13",
        "ten",
        "Gelo",
        "Ikea",
        "Alienware",
        "USB",
        "Katelyn",
        "Costco",
        "VR",
        "next January",
        "Ottawa",
        "IO",
        "RasPi"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "DATE",
        "NORP",
        "PERSON",
        "GPE",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "PERCENT",
        "PERSON",
        "PERSON",
        "EVENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "TIME",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "GPE",
        "ORG",
        "GPE",
        "EVENT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "GPE",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "GPE",
        "ORG"
    ],
    "vector": [
        -0.08780530095100403,
        0.01855270378291607,
        0.045583803206682205,
        -0.04876699298620224,
        0.09136299043893814,
        -0.05032626911997795,
        0.017117595300078392,
        0.012134920805692673,
        -0.06551148742437363,
        -0.05965256690979004,
        0.06580392271280289,
        0.04670311138033867,
        0.024896960705518723,
        -0.019825216382741928,
        0.06366375088691711,
        0.05185170844197273,
        0.08599751442670822,
        -0.1418507993221283,
        -0.04554058611392975,
        -0.02814021147787571,
        -0.0319855734705925,
        -0.08983093500137329,
        -0.026093242689967155,
        0.018735896795988083,
        0.0264172051101923,
        -0.018864255398511887,
        0.006204627919942141,
        -0.020436590537428856,
        -0.034340616315603256,
        -0.03361957147717476,
        -0.005587403662502766,
        0.06684829294681549,
        -0.023595701903104782,
        -0.017452087253332138,
        0.03638801351189613,
        -0.05672452971339226,
        0.08320821076631546,
        -0.06462245434522629,
        -0.03327740356326103,
        -0.0659017488360405,
        -0.012521504424512386,
        -0.07139362394809723,
        0.06004557013511658,
        -0.0432048924267292,
        0.06611935794353485,
        -0.09321718662977219,
        0.058396752923727036,
        -0.10277248173952103,
        0.038346998393535614,
        -0.03642783686518669,
        0.02909662388265133,
        -0.08627146482467651,
        0.037121839821338654,
        -0.05063076317310333,
        -0.0936432033777237,
        0.06315197795629501,
        -0.012325885705649853,
        -0.017107781022787094,
        0.051668643951416016,
        -0.06046188250184059,
        0.033772774040699005,
        -0.06660273671150208,
        0.014112276025116444,
        0.07417473942041397,
        0.051612772047519684,
        -0.055231623351573944,
        0.028423095121979713,
        -0.01721259206533432,
        -0.0025023934431374073,
        -0.0012389819603413343,
        -0.03806575387716293,
        0.018968116492033005,
        0.026983819901943207,
        0.02351691760122776,
        -0.02872931957244873,
        0.01617158018052578,
        0.045561399310827255,
        -0.02997356466948986,
        0.016919709742069244,
        0.009140420705080032,
        0.055626533925533295,
        -0.03909487649798393,
        -0.007022814825177193,
        -0.022517096251249313,
        0.004889172501862049,
        -0.05804702639579773,
        0.015514960512518883,
        -0.06599264591932297,
        -0.07327421754598618,
        -0.009060760959982872,
        -0.044308871030807495,
        0.05363522097468376,
        0.04727988317608833,
        0.05177482217550278,
        -0.013533818535506725,
        -0.0371711365878582,
        0.0011141967261210084,
        -0.08565066009759903,
        0.0072372048161923885,
        0.09940272569656372,
        0.003949203994125128,
        0.039580412209033966,
        0.03319037705659866,
        -0.031412843614816666,
        -0.0968368723988533,
        -0.07689613103866577,
        -0.012800357304513454,
        0.06391502916812897,
        0.02802187204360962,
        -0.05533973127603531,
        -0.047550465911626816,
        0.04377904161810875,
        -0.05301164463162422,
        -0.0785306915640831,
        0.018905475735664368,
        0.01908264495432377,
        -0.07313518971204758,
        0.04720902442932129,
        0.054477427154779434,
        -0.030322249978780746,
        -0.006588196847587824,
        0.00727829011157155,
        0.03783665969967842,
        0.016248051077127457,
        0.06508706510066986,
        -0.011520744301378727,
        -0.03752264007925987,
        -1.0930208406491304e-33,
        0.04608726501464844,
        0.028272081166505814,
        -0.04858793318271637,
        0.006822655908763409,
        0.08749070763587952,
        -0.003487079171463847,
        0.006213938817381859,
        -0.0411970391869545,
        -0.0027198358438909054,
        0.0032905254047363997,
        -0.02634406089782715,
        0.06862591207027435,
        -0.054364267736673355,
        0.0322454571723938,
        0.1040390282869339,
        -0.09818179905414581,
        0.0033279098570346832,
        0.051166001707315445,
        -0.06074761971831322,
        -0.019029278308153152,
        0.008852693252265453,
        -0.036139365285634995,
        0.04116920754313469,
        -0.08966947346925735,
        0.06897558271884918,
        0.03914136812090874,
        0.043324440717697144,
        0.03247229754924774,
        0.046491194516420364,
        0.04138577729463577,
        -0.06328406929969788,
        -0.015626555308699608,
        0.014367352239787579,
        -0.036628469824790955,
        -0.03970687836408615,
        0.020291749387979507,
        -0.0818571224808693,
        -0.12491147220134735,
        0.09694083034992218,
        -0.00971128698438406,
        -0.03850853443145752,
        0.05783764645457268,
        -0.05235060676932335,
        -0.06753481179475784,
        -0.05058295652270317,
        0.06579741835594177,
        -0.002352504525333643,
        -0.015614309348165989,
        0.033232562243938446,
        0.04707121476531029,
        -0.08851153403520584,
        0.0015231644501909614,
        -0.024699633941054344,
        -0.004184469114989042,
        -0.00021244832896627486,
        -0.011261151172220707,
        0.06994675099849701,
        -0.020061861723661423,
        0.10728485137224197,
        0.08653927594423294,
        0.04957064241170883,
        0.013089949265122414,
        -0.0543813519179821,
        -0.06103823706507683,
        -0.05094228684902191,
        0.09069965779781342,
        0.10689187049865723,
        0.0008031375473365188,
        -0.07855873554944992,
        0.005528517998754978,
        -0.05362346023321152,
        -0.003477418329566717,
        0.012932170182466507,
        -0.09478408098220825,
        0.061189111322164536,
        0.0114845409989357,
        -0.10922218859195709,
        0.015314562246203423,
        -0.05720488727092743,
        0.004671473056077957,
        -0.04249349609017372,
        0.0032911866437643766,
        0.037177301943302155,
        -0.03334365785121918,
        -0.018281450495123863,
        0.009860005229711533,
        -0.020543096587061882,
        -0.05320708453655243,
        -0.0018079844303429127,
        0.020001845434308052,
        -0.057060446590185165,
        0.00439365254715085,
        0.016324734315276146,
        0.013599725440144539,
        -0.0375722236931324,
        -2.097598221026361e-33,
        -0.025591280311346054,
        0.044362422078847885,
        -0.033835604786872864,
        0.022671377286314964,
        0.02181904949247837,
        0.020540272817015648,
        0.03715377673506737,
        0.030414702370762825,
        -0.009690394625067711,
        -0.004149203188717365,
        0.05117488652467728,
        0.039383258670568466,
        -0.11788126826286316,
        -0.03679591044783592,
        0.010113149881362915,
        -0.06084219366312027,
        0.0568142905831337,
        -0.025627637282013893,
        0.04208212345838547,
        -0.07275943458080292,
        0.133744016289711,
        0.05644049867987633,
        -0.023927411064505577,
        -0.027507932856678963,
        -0.025653334334492683,
        0.022440850734710693,
        -0.016039734706282616,
        0.048158057034015656,
        0.025385310873389244,
        -0.0062096090987324715,
        0.02550947293639183,
        0.013638942502439022,
        0.0011457145446911454,
        0.013982689939439297,
        0.08800817281007767,
        0.01146977674216032,
        0.04321625828742981,
        0.04419505596160889,
        -0.002592648845165968,
        -0.0672156885266304,
        0.02801077626645565,
        -0.0020791071001440287,
        -0.031149521470069885,
        0.02306809462606907,
        0.014143179170787334,
        -0.04900477081537247,
        -0.08195517957210541,
        -0.08185826987028122,
        0.03462940454483032,
        0.01530433353036642,
        -0.031401846557855606,
        -0.06845097243785858,
        0.019043639302253723,
        -0.022647419944405556,
        -0.04094652086496353,
        -0.07462144643068314,
        -0.01175192091614008,
        0.072067491710186,
        0.005990529898554087,
        -0.04134318232536316,
        0.03230934217572212,
        0.0211645495146513,
        -0.0808599516749382,
        -0.08470331132411957,
        -0.0340946763753891,
        -0.027221055701375008,
        0.08827362954616547,
        -0.015036682598292828,
        -0.017792610451579094,
        -0.015323419123888016,
        -0.02309809997677803,
        -0.06120738014578819,
        -0.03215104714035988,
        -0.09342978149652481,
        -0.05704436078667641,
        0.005290720611810684,
        0.014934848994016647,
        -0.02860422246158123,
        0.036261748522520065,
        -0.06532197445631027,
        -0.06767459958791733,
        0.011491810902953148,
        0.020835526287555695,
        0.005889042746275663,
        0.07702623307704926,
        0.04354828968644142,
        0.04220379516482353,
        -0.04554446414113045,
        -0.029187217354774475,
        0.034748610109090805,
        0.019099852070212364,
        0.03923408314585686,
        0.0012703349348157644,
        0.08258281648159027,
        0.027224289253354073,
        -5.339390085623563e-08,
        -0.022107349708676338,
        0.041317328810691833,
        -0.01568204164505005,
        0.056841522455215454,
        -0.00043828741763718426,
        -0.09251002222299576,
        0.019671877846121788,
        0.03920396789908409,
        0.047502461820840836,
        -0.061765510588884354,
        0.0292794369161129,
        -0.09444905817508698,
        -0.002876455895602703,
        0.0017713060369715095,
        0.017140410840511322,
        0.02898877114057541,
        -0.08932431787252426,
        0.07353579252958298,
        -0.04244907572865486,
        -0.09120627492666245,
        -0.004380335565656424,
        0.05180766060948372,
        0.1310550719499588,
        -0.015167093835771084,
        -0.0006062034517526627,
        0.06699393689632416,
        0.036173176020383835,
        0.06300251930952072,
        0.05943556874990463,
        -0.03690502047538757,
        -0.11534760892391205,
        0.016225764527916908,
        0.008431738242506981,
        -0.01547620352357626,
        0.0025926942471414804,
        -0.00486987829208374,
        -0.014816484414041042,
        0.04346676543354988,
        0.07615301758050919,
        0.03260233253240585,
        -0.07458506524562836,
        -0.10509692132472992,
        0.049815934151411057,
        0.018407326191663742,
        0.044558681547641754,
        0.027272989973425865,
        -0.07172656804323196,
        -0.0720973089337349,
        -0.040021710097789764,
        -0.04360656812787056,
        -0.0321616530418396,
        -0.02919338271021843,
        -0.028909755870699883,
        0.06988871842622757,
        0.04666571691632271,
        -0.04634515568614006,
        0.008352926932275295,
        0.04627397283911705,
        0.035889070481061935,
        0.12542061507701874,
        0.09855171293020248,
        -0.14760690927505493,
        -0.04509848728775978,
        0.07371187955141068
    ]
}