{
    "id": "eVIuRJ-2P-s",
    "title": "Samsung Galaxy Buds 2 review: more buds, less problems",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-08-19T14:00:12Z",
    "video_url": "https://www.youtube.com/watch?v=eVIuRJ-2P-s",
    "category": "Science & Technology",
    "tags": [
        "samsung galaxy buds 2 review",
        "galaxy buds",
        "buds 2",
        "samsung buds 2",
        "buds review",
        "earbuds",
        "headphones",
        "audio",
        "wireless",
        "bluetooth",
        "specs",
        "battery",
        "audio quality",
        "audio test",
        "test",
        "tech",
        "technology",
        "gadgets",
        "becca farsace",
        "becca",
        "verge",
        "the verge",
        "verge review",
        "Buds Live",
        "Galaxy Buds Pro",
        "active noise cancellation",
        "sony wf 1000xm4",
        "apple airpods pro",
        "mic test",
        "galaxy buds vs buds 2",
        "samsung",
        "samsung galaxy buds"
    ],
    "views": 444960,
    "likes": 14321,
    "comments_count": 744,
    "description": "Samsungs new $150 Galaxy Buds 2 are the latest addition to their wireless earbud lineup that also includes the Galaxy Buds Pro and the Galaxy Buds Live. The Buds 2 have active noise cancellation and are 15% smaller and 20% lighter than their predecessor, the Galaxy Buds+. In a growing market with great wireless earbuds like the Sony WF-1000XM4 and Apple Airpod Pros, do the Bud 2s new features and smaller design bring enough value to rival its competition? Becca Farsace has the full review (and mic test) to find out.  If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:   You can get Samsung's Galaxy Buds 2 here:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2TQsqjB",
        "https://shop-links.co/1749535040253363499",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- We got eggs. (bright music) These are actually the Galaxy Buds 2. (bright music) They're $150 wireless earbuds from Samsung that are the successor to the Buds Plus that launched in February of 2020. Now there are two stories to tell with these earbuds. First, it's important to compare them to their previous model, the Buds Plus to show just how far Samsung has come in a year and a half. But, second, I think it is just as important to look at them in the wireless buds lineup Samsung has created and explain how the Buds 2 inadvertently made one whole product in that lineup not so worth their pro price. Let's talk eggs. The Buds 2 are tiny ovals that sit perfectly in my ears. And in my coworker, Chris Welch's ears, you almost couldn't see them at all when looking at him head-on. They are 15% smaller and 20% lighter than the Buds Plus. Each bud weighs a mere five grams and with how comfortable they are, I'm often wearing them long enough to drain the battery before I'm even ready to take them out. Something that doesn't happen on most earbuds. Each bud has a 61 milliampere/hour battery that lasts for five hours with ANC on, 7.5 hours with ANC off, and 3.5 hours of continuous talk. The case can recharge the buds three times over with ANC on, but I was barely getting through two days without having to charge the case up again, which both shows just how much time I spend with earbuds in and the close eye you have to keep on their battery status. The battery is the one place the Buds 2 have not improved. Their predecessor, the Buds Plus, have a very long 11 hour battery life, which I love for long travel days or when I simply forget to charge a case for a while. And there's one other thing that I miss with the Buds Plus, this Silicon tip on the top, oh my gosh, it just makes for the most secure fit in your ear. Outside of that, the Buds 2 have improved in almost every other way. The biggest improvement being the addition of active noise cancellation. The ANC on the Buds 2, can be toggled on and off by long pressing on the left bud. I took a bus trip up to upstate New York this past weekend with the Buds 2, the Buds Pro and the AirPod Pros. There is very little difference in the ANC performance between the Buds 2 and the Buds Pro, both very easily canceled out the rumble of the bus and the talking of other passengers. And I was very easily able to hear my music in peace. Though the AirPod Pros still block out slightly more noise, especially in those higher frequencies. Either way, I'd feel very comfortable taking the Buds 2 on a short trip. Any trip longer than five hours though, would require headphones with a bigger battery or breaks to take them out to charge. There are three levels of ambient sound that can only be adjusted in the app, just like the Buds Plus. The highest setting amplifies sound around you and is a bit loud for my liking. Though, it may be helpful if you're trying to listen in on someone else's conversation, maybe. Overall, the sound they let in is mostly clear though. Again, the ambient sound mode is not as airy as the ambient sound mode on the AirPods Pro, but it is worlds better than this super robotic ambient sound mode on the Buds Plus. And although these buds do not pause your music, when you pull an earbud out, they do turn off ANC to ease discomfort. Y'all ready for my test? Let's start out with the original Samsung buds. When these came out, I was quite disappointed in their mic quality because nobody could hear me when I talked to them on the phone. Next we're moving on to the Galaxy Buds Plus. These came out in February of 2020, and with these Samsung improved the battery life, the mic quality and the sound quality. All right, next up is the Galaxy Buds Pro. These came out in January, 2021. They are the most expensive buds in the Samsung lineup. They have 360 audio, they have speech detection features, and Samsung claims when they came out that they had the best audio experience in a wireless bud in their lineup. And the headphone of the hour, the Galaxy Buds 2. Wow, when you put these in your ear, especially coming from the Buds Pro, woo, they feel so small and so light, and it wouldn't be a mic test without Apple's AirPod Pros. They usually still sound pretty damn good, even being released two years ago. Turn on the fans Turn on the fans Today we went back to the fans test that we did on the Galaxy Buds Pro. We're also doing the fan test because it's a bit gloomy today and there's almost no light in my kitchen. The Galaxy Buds Pro have windshield technology that is supposed to eliminate the sound of wind on the buds when you're using the mic. I found it to be pretty effective when we first test these buds in the original review. But how did the Buds 2 sound when there's wind blowing on them? Now, Samsung is not claiming any windshield technology here, so I'm very eager to hear how these sound. And last but not least we have Apple's Airplane Pros, they've taken on loads of wind right now, how do they sound? I just feel like it's a little bit better than those Buds 2. All right buds, you know the drill, sound off down below, who had the best mic quality? I think I can say for sure that I won't be taking the eggs into a wind tunnel and having a conversation on the phone. But how do they sound? (upbeat music) The Buds 2 have two way speakers, a woofer and a tweeter. And although Samsung wouldn't give me the exact size of either of those speakers, they make for a balanced sound. I turned on bass boost in the wearable apps EQ settings for a bit more oomph but overall found the sound very pleasing. Like many buds at this price point, the Buds 2 don't have standout audio quality. Instead, they sound really good for most things. And if you're looking for the absolute best audio quality, then you might wanna look at the Bose QuietComforts, or the Sony WX-1000XM, no Sony WF-1000 XM4s. Yeah. Both of those are a lot more money, but they have some of the best audio quality that we have found in wireless earbuds. And if you want to know more about that, theverge.com. In swapping between the Buds Pro and the Buds 2 the Pros have just a tad more bass that really shows when listening to pop or hip hop. However, I think most people would be plenty happy with how the Buds 2 sound. The touch controls on the Buds 2 are responsive, but leave a bit of room for improvements. Much like the Buds Pro you have to be intentional about your touch, and hit right in the center of the bud for the tap to be recognized. I would say about 75% of the time, my touches were recognized, but the other 25% of the time, I would just need to try again and make sure I was hitting right in the center. All settings for the Buds 2 are within Samsung's Galaxy Wearable app, a universal app for all Samsung earbuds and smartwatches. But unfortunately the latest models are only supported on Android. I'm very sorry iPhone users. This means that in order to change the tap controls, the EQ settings, the ambient sound modes, and even download firmware updates, an iOS user would need to pair the bu to an Android phone. It's all very Apple of them. For Android users though, the Wear app is easy to use, although only Samsung users will get the quick pairing pop-ups on their phones. So, with the Buds 2, Samsung has created a three earbud lineup that all look the same with the case closed and very different when you open it. You have the Buds Live that have that open ear design that's perfect for biking, or when you need to hear the outside world. And then the Buds Pro, they have better water resistance, more ANC levels, a bit more bass, 360 audio capabilities, and a voice detection mode. And then the Buds 2, they slide right in the middle of that lineup. And while their price and name may indicate they aren't as capable as the pros, I think most people can save a few bucks and be very happy with these tiny buds. And ultimately, even though their mic quality could absolutely be better, the Buds 2 small size makes them my favorite earbud in this lineup. I forgot to record and cut. So. here we are. Thank you so much for watching. We have been busting our tail feathers on this YouTube channel. There's so much up there for you to watch and enjoy. I appreciate you, bud. I hope that you're well and I hope that everyone you love is well. We'll be seeing you real soon. Bye.",
    "transcript_keywords": [
        "Galaxy Buds Pro",
        "Buds",
        "Buds Pro",
        "Galaxy Buds",
        "buds lineup Samsung",
        "Samsung",
        "pro",
        "bud",
        "sound",
        "Samsung buds",
        "original Samsung buds",
        "Pros",
        "ANC",
        "Galaxy",
        "AirPod Pros",
        "Samsung Galaxy Wearable",
        "ambient sound",
        "Apple Airplane Pros",
        "Buds Live",
        "Samsung Galaxy"
    ],
    "transcript_entity_values": [
        "New York",
        "Today",
        "ANC",
        "Android",
        "one",
        "Chris Welch's",
        "the Buds Plus",
        "the Buds Plus",
        "January, 2021",
        "Apple",
        "15%",
        "days",
        "20%",
        "the Buds Pro",
        "three",
        "the AirPods Pro",
        "this past weekend",
        "today",
        "Galaxy Wearable",
        "the Galaxy Buds 2",
        "the Galaxy Buds Plus",
        "2",
        "150",
        "Wear",
        "the Buds Pro",
        "a few bucks",
        "a very long 11 hour",
        "the Galaxy Buds Pro",
        "about 75%",
        "a year and a half",
        "the Buds Live",
        "Samsung",
        "3.5 hours",
        "a mere five grams",
        "the hour",
        "February of 2020",
        "five hours",
        "two",
        "Sony WF-1000 XM4s",
        "25%",
        "Silicon",
        "61",
        "Buds 2",
        "Buds",
        "Bose",
        "Pros",
        "second",
        "Sony",
        "two days",
        "EQ",
        "YouTube",
        "longer than five hours",
        "first",
        "iPhone",
        "the Buds Plus",
        "two years ago",
        "7.5 hours",
        "First",
        "The Galaxy Buds Pro"
    ],
    "transcript_entity_types": [
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "FAC",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "PERCENT",
        "DATE",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "FAC",
        "MONEY",
        "TIME",
        "ORG",
        "PERCENT",
        "DATE",
        "FAC",
        "ORG",
        "TIME",
        "QUANTITY",
        "TIME",
        "DATE",
        "TIME",
        "CARDINAL",
        "FAC",
        "PERCENT",
        "LOC",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "ORDINAL",
        "ORG"
    ],
    "vector": [
        -0.08180022984743118,
        -0.019410615786910057,
        0.049245670437812805,
        -0.00098694849293679,
        0.031860750168561935,
        -0.04249395802617073,
        0.00643078051507473,
        0.06836394220590591,
        0.002543398877605796,
        0.03158322721719742,
        0.016506822779774666,
        0.013850510120391846,
        0.02306343801319599,
        -0.02400968410074711,
        0.0633678138256073,
        -0.030413813889026642,
        0.09858293831348419,
        -0.060711201280355453,
        -0.0008238503942266107,
        0.002611024770885706,
        -0.06312666833400726,
        0.07237134128808975,
        0.08496582508087158,
        0.013222329318523407,
        0.028009874746203423,
        -0.04089675843715668,
        -0.05895532667636871,
        -0.0511581115424633,
        -0.025399304926395416,
        -0.03857174143195152,
        0.03376810997724533,
        0.11892883479595184,
        0.03289472684264183,
        -0.016885487362742424,
        -0.03106526844203472,
        -0.16817361116409302,
        0.07162261754274368,
        -0.052794091403484344,
        -0.00011472543701529503,
        0.014629802666604519,
        -0.0022030656691640615,
        0.021164149045944214,
        -0.022874336689710617,
        -0.021646060049533844,
        -0.026705985888838768,
        -0.057745207101106644,
        0.01880829781293869,
        -0.04582739621400833,
        -0.024945639073848724,
        0.03774799779057503,
        0.008806835860013962,
        -0.07291819900274277,
        0.06268903613090515,
        0.0584394596517086,
        0.0026391013525426388,
        -0.020925946533679962,
        -0.05993461236357689,
        0.04434700310230255,
        0.060075968503952026,
        0.0392799973487854,
        0.08334202319383621,
        -0.07471026480197906,
        0.003630403196439147,
        -0.01123081799596548,
        -0.04024035483598709,
        0.01853446289896965,
        -0.030682692304253578,
        0.04420304298400879,
        0.06892597675323486,
        -0.08477330952882767,
        -0.06407374143600464,
        0.08148754388093948,
        0.052876148372888565,
        0.02949298359453678,
        0.08720602840185165,
        0.043020326644182205,
        0.07738649845123291,
        0.020320044830441475,
        -0.03665999323129654,
        -0.011967197060585022,
        -0.034634705632925034,
        -0.09877517819404602,
        -0.07642984390258789,
        -0.08593133091926575,
        0.047950442880392075,
        -0.023680800572037697,
        -0.02481823042035103,
        0.04768455773591995,
        -0.12466232478618622,
        -0.00830077938735485,
        -0.02732090838253498,
        0.07714167982339859,
        -0.04017055034637451,
        -0.021343212574720383,
        0.015561876818537712,
        0.013620431534945965,
        -0.05593346431851387,
        -0.04116984084248543,
        0.016526564955711365,
        0.01884240284562111,
        0.024753255769610405,
        0.03163020685315132,
        0.06622155010700226,
        -0.0987858921289444,
        0.04523637145757675,
        -0.07179603725671768,
        -0.03589404746890068,
        -0.027802644297480583,
        0.06310804933309555,
        0.06649412959814072,
        0.03494908660650253,
        0.015800364315509796,
        -0.03341643884778023,
        0.02290341630578041,
        -0.014008604921400547,
        0.058705851435661316,
        0.03152518719434738,
        0.11673898994922638,
        0.05577193200588226,
        -0.048541806638240814,
        0.03591800481081009,
        -0.0030306170228868723,
        -0.026471402496099472,
        -0.15916983783245087,
        -0.06064777448773384,
        -0.014730935916304588,
        -0.15797878801822662,
        2.3334745705012922e-33,
        -0.009505655616521835,
        0.09730347990989685,
        -0.03303460776805878,
        0.020977327600121498,
        0.013766331598162651,
        -0.022948382422327995,
        -0.09382082521915436,
        0.01184481754899025,
        0.02208288013935089,
        -0.017239924520254135,
        -0.10098982602357864,
        0.038729168474674225,
        -0.0508364737033844,
        0.016411982476711273,
        0.05411175265908241,
        -0.14812201261520386,
        -0.06799110025167465,
        -0.01630089245736599,
        -0.03214750066399574,
        0.02912578359246254,
        0.005446623545140028,
        -0.04297410324215889,
        0.0007083740783855319,
        0.03108786791563034,
        0.10720279812812805,
        0.0025402617175132036,
        0.05561259388923645,
        -0.054612211883068085,
        0.06332704424858093,
        0.032918769866228104,
        -0.08295276015996933,
        -0.01783916912972927,
        0.06799483299255371,
        -0.045560482889413834,
        0.027010858058929443,
        0.04123556986451149,
        -0.021965842694044113,
        -0.010450474917888641,
        0.05018876865506172,
        -0.10115943104028702,
        0.0021107567008584738,
        0.029589012265205383,
        -0.06493166089057922,
        0.06261033564805984,
        0.0360332652926445,
        0.031026329845190048,
        -0.00375382206402719,
        -0.030001159757375717,
        0.04675842449069023,
        -0.016559816896915436,
        -0.008308539167046547,
        -0.027111511677503586,
        -0.051513660699129105,
        0.03444046154618263,
        0.027336757630109787,
        -0.026801597326993942,
        -0.0041824388317763805,
        -0.003388634417206049,
        -0.002742843935266137,
        -0.0027542058378458023,
        0.010985253378748894,
        0.08432253450155258,
        -0.06772589683532715,
        -0.018422843888401985,
        -0.0966116189956665,
        0.06416302174329758,
        0.025795213878154755,
        0.02959265559911728,
        -0.0858028307557106,
        0.01608368568122387,
        0.052721891552209854,
        0.010960407555103302,
        0.02775116078555584,
        -0.017439858987927437,
        0.010992661118507385,
        0.003140074433758855,
        0.003237846540287137,
        -0.009792782366275787,
        0.06620274484157562,
        -0.003791022812947631,
        -0.03624912351369858,
        0.026203174144029617,
        0.01674882136285305,
        0.020696697756648064,
        0.021461576223373413,
        -0.025516599416732788,
        -0.019488386809825897,
        -0.027702687308192253,
        0.007581960875540972,
        -0.0025363145396113396,
        -0.015760375186800957,
        0.08972141146659851,
        -0.009453197941184044,
        0.01364519540220499,
        -0.030091743916273117,
        -2.6478805547668754e-33,
        -0.019821688532829285,
        0.027768636122345924,
        0.027906332165002823,
        0.03836645185947418,
        -0.012721648439764977,
        0.005670591257512569,
        0.0649266242980957,
        0.0015538324369117618,
        -0.011310194618999958,
        -0.029238373041152954,
        -0.0024861167185008526,
        0.057544589042663574,
        -0.03752763569355011,
        0.023985421285033226,
        0.038980983197689056,
        -0.10932900011539459,
        0.0009698114008642733,
        -0.07205069065093994,
        0.05109648033976555,
        -0.05668249726295471,
        0.03595702722668648,
        0.032436154782772064,
        0.024379299953579903,
        0.01607084460556507,
        -0.09738299995660782,
        0.013781541027128696,
        0.006929557770490646,
        0.01852067932486534,
        0.012908382341265678,
        -0.0022371921222656965,
        0.034547217190265656,
        -0.026877641677856445,
        -0.086583711206913,
        -0.0037686771247535944,
        0.08114549517631531,
        0.026832319796085358,
        0.065823994576931,
        -0.02984619140625,
        -0.030755246058106422,
        -0.07615416496992111,
        -0.008736461400985718,
        0.04419935494661331,
        0.012626546435058117,
        -0.05882500112056732,
        0.014844907447695732,
        -0.017951566725969315,
        0.02838856913149357,
        0.0354556143283844,
        -0.05577348917722702,
        -0.03471549600362778,
        0.0880478248000145,
        0.025833558291196823,
        -0.022767527028918266,
        -0.040738221257925034,
        -0.07703560590744019,
        0.001316893962211907,
        -0.04177495464682579,
        -0.014721056446433067,
        0.04340440407395363,
        0.0041985646821558475,
        0.0376831516623497,
        0.006665754597634077,
        -0.0584234781563282,
        -0.022181471809744835,
        -0.09909564256668091,
        0.00767903309315443,
        0.09611991047859192,
        0.08040015399456024,
        0.028986092656850815,
        0.020373309031128883,
        0.026397177949547768,
        -0.024797270074486732,
        -0.019589507952332497,
        -0.025080835446715355,
        -0.031945306807756424,
        0.1266203373670578,
        -0.07322093844413757,
        -0.07095108181238174,
        0.03746512904763222,
        -0.016740594059228897,
        -0.002412552945315838,
        0.08062484115362167,
        0.06604208797216415,
        0.014661399647593498,
        0.056242384016513824,
        0.017741935327649117,
        -0.026823125779628754,
        -0.024069681763648987,
        -0.07402242720127106,
        0.062433551996946335,
        -0.047337859869003296,
        -0.013286137953400612,
        -0.05736113339662552,
        0.10811004042625427,
        0.04835240915417671,
        -4.83103725912315e-08,
        0.012593423016369343,
        0.0269240103662014,
        0.07384240627288818,
        -0.032047245651483536,
        -0.021899256855249405,
        -0.06580676138401031,
        -0.04757550731301308,
        0.04757789149880409,
        0.09433523565530777,
        0.002812705235555768,
        -0.004341735038906336,
        -0.06765835732221603,
        -0.08215350657701492,
        0.05107007175683975,
        0.05040716752409935,
        0.07897806167602539,
        -0.044945813715457916,
        0.0593300424516201,
        -0.007942314259707928,
        -0.040264833718538284,
        0.0318601131439209,
        0.10366761684417725,
        0.018183253705501556,
        -0.031142016872763634,
        0.04607512801885605,
        -0.02174796536564827,
        -0.02821740135550499,
        0.01985512115061283,
        0.015621399506926537,
        -0.010241693817079067,
        -0.02943260595202446,
        0.007163569331169128,
        -0.07909589260816574,
        -0.013731435872614384,
        -0.03405332565307617,
        -0.140778049826622,
        -0.02699189819395542,
        -0.0029123600106686354,
        0.03348932042717934,
        0.08053269237279892,
        -0.012881288304924965,
        -0.058648400008678436,
        0.010006630793213844,
        0.0645073875784874,
        -0.053826525807380676,
        -0.09213316440582275,
        0.06707917153835297,
        -0.03983438014984131,
        -0.060425788164138794,
        0.04385840520262718,
        -0.0050911372527480125,
        -0.0061729406006634235,
        0.00505854282528162,
        -0.029397571459412575,
        -0.06478887796401978,
        0.016291406005620956,
        -0.047491706907749176,
        0.04276244714856148,
        -0.10766320675611496,
        0.003145451657474041,
        -0.002665202599018812,
        -0.053764935582876205,
        0.02691255323588848,
        0.1412048190832138
    ]
}