{
    "id": "Ew06gLKou8s",
    "title": "Lenovo ThinkPad X1 Fold Review: More Is Less",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2021-02-05T18:55:20Z",
    "video_url": "https://www.youtube.com/watch?v=Ew06gLKou8s",
    "category": "Science & Technology",
    "tags": [
        "lenovo x1 fold review",
        "folding laptop",
        "folding screen pc",
        "foldable pc",
        "folding display",
        "lenovo foldable",
        "x1 review",
        "thinkpad x1 review",
        "thinkpad foldable",
        "folding thinkpad",
        "best foldable laptop",
        "best folding tablet",
        "thinkpad x1 fold 2021",
        "computer book",
        "x1 carbon"
    ],
    "views": 1313586,
    "likes": 22118,
    "comments_count": 1235,
    "description": "Ever since I was six years old and watching Inspector Gadget, Ive longed for a proper computer book  and the Lenovo X1 Fold gets closer to that dream than I ever thought possible. Its large folding display is the most rugged and crease-free Ive ever used, and it works together with a cleverly designed wireless keyboard companion and beautiful leather shell to deliver a laptop experience like no other. Fully deployed, the Lenovo X1 Fold rests on its built-in kickstand to serve as a 13.3 laptop; or, fold the screen in half and slap on the magnetic keyboard for a more compact 7 netbook. Use it in easel mode as a stylus-equipped tablet; and when its time to pack it in for the day, it collapses into a footprint no bigger than a hardback novel.  Its that versatile combination of form factors that gives a computer book like the X1 Fold so much potential for those of us who prefer our PCs portable. But leveraging that potential is the job of streamlined software  and the platform Lenovo apparently planned to use for the X1 Fold, Windows 10X, was delayed by Microsoft last year. As a result the X1 Fold ships with Windows 10 Home or Pro  and the apparently rushed implementation of that OS (plus a combination of driver issues, hardware failings and high price tag) ultimately makes this machine the first foldable I cant recommend  even to those with deep pockets.   Get the details in MrMobiles Lenovo X1 Fold review, and join me in crossing your fingers for an eventual Windows 10X release for this unique folding-screen PC.   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILES LENOVO X1 FOLD REVIEW]  MrMobile's Lenovo X1 Fold Review was produced after more than two months of X1 Fold testing  approximately one month with a Fold X1 retail unit purchased by MrMobile, and one month with a review sample sent by Lenovo as a replacement for the former unit.   MrMobile does not produce product reviews sponsored by the manufacturers of those products. Lenovo was given no editorial input, copy approval rights or an early preview of this content.   [PRODUCTS IN THIS VIDEO]  Lenovo X1 Fold 13\" Folding-Screen PC [Lenovo]:   Qwerkywriter S Mechanical Keyboard [Amazon affiliate]:   Star Trek TNG Mousepad [Amazon affiliate]:   Microsoft Precision Mouse [Amazon affiliate]:    [LINKS]  Windows 10X Walkthrough [Windows Central]:   Lenovo ThinkPad X1 Fold Review [PCMag]:   ThinkPad X1 Fold Review: Lenovos foldable PC is nowhere near ready [Engadget]:   Lenovo X1 Fold Review [MobileTechReview]:   Inspector Gadget Computer Book Artwork by GI-Joe09 [Deviantart]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford Future plc a commission should you make a purchase. This does not affect MrMobiles editorial content. See Future's disclosure policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #x1fold #lenovox1fold #foldable #foldingscreen #laptop #tablet #windows10 #windows #notebookPC #tech",
    "description_links": [
        "https://www.youtube.com/channel/UCSOp...",
        "http://mrmobile.tech/1VR",
        "http://mrmobile.tech/1VQ",
        "http://mrmobile.tech/1VS",
        "http://mrmobile.tech/1VT",
        "https://www.youtube.com/watch?v=EPirgHua2sE",
        "https://www.pcmag.com/reviews/lenovo-thinkpad-x1-fold",
        "https://www.engadget.com/lenovo-thinkpad-x1-fold-foldable-pc-review-specs-price-181519620.html",
        "https://youtu.be/xRqWYqGQgsc",
        "https://www.deviantart.com/gi-joe09/art/Penny-Book-Computer-197390351",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.futureplc.com/terms-conditions/",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "(upbeat music) - This is the coolest laptop I've ever used. Sadly, it's also one of the most disappointing. (upbeat music) Let's review. The last time you saw the Lenovo X1 Fold on this channel, I used it to explore all the ways a folding screen changed the way I used a laptop. Now that term, laptop, is important because some folks have called this a tablet, and sure, it can be used that way. But at 2.2 pounds, it's really too clunky for that label. Where this machine finds full expression is when you treat it like a PC. With a built in kickstand, it deploys to a 13.3 inch easel with detached keyboard on a desktop, collapses to a kind of cyber throwback Netbook for travel, and finally, folds into the footprint of a hardback novel when you need to pack it away. Now because of that novel nature of folding screens, you might think that the problems I'd found arise from that flexibility. But not at all. In fact, Lenovo's hardware is frankly inspired. In the almost two year run up to its release, the company was incredibly open to sharing how much work went into building a machine that earns its Thinkpad name. That's the company's business brand of laptops, generally held to a higher standard of reliability because they're aimed at the enterprise. One of my favorite things from CES 2020 was Lenovo having brought an exploded model of the X1 Fold for the press to poke and prod, which we certainly did. I've twisted the hinges, I've stabbed the screen and by now I've used the assembled device on and off for about two months. I wasn't sure anyone could realize the dream of a folding screen PC solid enough to stand up to everyday use, but the X1 Fold does it. The leather back evokes the premium feel of an old journal, while the stacked Netbook mode means you can still work under cramped conditions. And over the two months I've used it, there's been none of the loosening or creaking or creasing you might expect. The only hardware quibbles I do have are the Chassis being a little more reluctant to fold fully flat, resulting in a very slight angle when open, and an oil slick-like reflectivity of the screen under certain lighting when powered off. Incidentally I've seen both of those characteristics on the Motorola Razor as well, so maybe these are just typical attributes of whatever flexible screen LG display provided here. Those characteristics don't materially affect everyday use. I'm more annoyed by the thin, tinny speakers than I am anything to do with the folding screen. But while the foldable form factor may not be the root of the machine's problems, those problems do start with a byproduct of its foldable nature. See, in order to offer full functionality and its various postures, the X1 Fold needs a detachable keyboard. On paper, it's quite clever. Has a Bluetooth keyboard, it works whether it's attached or not. When it does attach, it does so magnetically and it even charges while it's on there, fitting perfectly inside the gap between the screens' halves. I even got used to the compromises that were made in the name of miniaturization. The enter key that I hit instead of the apostrophe a hundred times, the fact that typing a question mark means holding down not just the function key, but the function and the shift keys. But I never got used to every 30th word sprouting extra letters. A problem that, to be fair, I've experienced on other Bluetooth keyboards going all the way back to the Pixel C. Look at this, every double letter you see here is genuine. I didn't force any errors for effect. It's not a problem with the keyboard itself, since the doubling kept right on happening even when I paired this thing with the quirky writer I keep around for when I want no one to take me seriously at the coffee shop. And I did have better luck when I stuck to netbook mode with the keyboard resting right on the device. But that bundled keyboard has other problems. A terrible tiny track pad that's finicky and prone to cursor drift. There are no rubber feet on the keyboard so it wanders all over the place if you type on a slippery table top. Whatever material the keys are made of, it's so soft that it starts showing wear after just two days of use. And to top it all off, there's no back light, so if you're trying to type in a darkened plane or train cabin, good luck with that. When I put all these problems to Lenovo, the company sent me a replacement for the retail device I had purchased, which I really appreciated. Sadly though, that swap didn't fix any of my problems and in fact, it brought to light a whole new set of them. When I tried resetting the first machine, that reset failed, and without a physical keyboard I couldn't resolve the issue. Then a few weeks after I first set it up, I powered up the replacement X1 Fold to find that it had forgotten the date and time. Now, I was able to fix that in the bios, but then the device put itself into what looked like some kind of update loop which lasted until the battery ran out. Only after an overnight charge and an automated Windows repair did it start working again, kinda. Now if you're thinking, hey, you know, this just doesn't seem like a device that's a great match for Windows 10, you know I think you're onto something. This isn't a secret. From the very first time I saw the X1 Fold Prototype, it was clear that it was not built for any version of Windows that we had yet seen. The Windows 10 operating system is not planned for the final product. But rather for the sleeker, Chrome OS competitor that came to be called Windows 10X. 10X was intended to serve as the launch platform for Microsoft's new Surface Neo device, but when 10X got delayed, the Neo did too. Not so for Lenovo. The X1 Fold launched almost on time at the tail end of 2020 with Windows 10 Home and Pro, instead of X as options. And the result, well, (buzzer) That's what happens when the Spotify web player and X1 Fold decide to disagree about whether or not the device should go to sleep. And that's just the start of it. A few times a week I'll wake up the machine to find that it thinks it's in landscape or portrait mode when it's really just the opposite. That's part of why Lenovo made its own mode switcher to help you switch orientations, but it doesn't always work, so you need to restart sometimes to get it oriented right. At one point while \"wroting this revie the lay board just stopped wrpling because Bluetooth stopped wrpling.\" Which meant I had to switch over to the built-in Windows software lay board and its inconsistent autocorrect. The other limitations aren't really bugs, so much as symptoms of a system design that's very specific. While it's responsive enough for typical browsing and office tasks, this Lakefield Core i5 cpu doesn't pack any of the newer niceties Intel included with its Evo line. Like the rapid wakeup and better battery management I talked about on my Asus Zenbook Duo 14 review. That platform or maybe even Qualcomm's Always Connected PC Snapdragon would've been a perfect fit for a device like this. As it stands now, the X1 Fold is often slow to wake, and if I'm using it in easel mode with the full screen, I generally get fewer than four hours of constant use on a full charge. Judging from other reviews battery tests, it seems I would get better endurance if I didn't have to run the screen at max brightness almost all the time. But it's top line output of 300 nits just isn't bright enough for a machine that's supposed to come with me everywhere I go. And I want to take the X1 Fold everywhere I go. I was the kid who watched way too much Inspector Gadget and ruins scores of library books by sketching Penny's computer book into their back pages. So I've been waiting for that computer book for 30 years. Today, I like to think of myself as YouTube's biggest champion of folding screen technology. And seeing a panel this crisp and durable, one you can even use a pen on without damaging it, it's otherworldly. I know I glossed over tablet mode, but if you're an artist or a designer with a good use for this Wacom enabled stylus, this would be next level. Factor in the revival of cyber punks style that makes this kinda retro look cool again, this thing could be incredible. Unfortunately for a starting price this high and a bug list this long, the only thing incredible about it is how badly it's been hobbled by shipping with a half baked and badly implemented form of the wrong OS. Man, I'm sorry, but you can max out a Microsoft Surface Go 2, toss in a keyboard mouse and a pen and still save a thousand dollars. If it ever gets a build of Windows 10X, I'll be first in line to reevaluate, but until then, I can't recommend it. And given the caliber of this hardware and the potential of the concept, that's something I'm genuinely sad to say. If you wanna learn more about Windows 10x, check out the excellent reporting by comrades at Windows Central. Link below alongside some other reviews of the X1 Fold I think you'll find helpful. This review is produced following 60 days with a retail X1 Fold purchased by Mr. Mobile and a review sample sent by Lenovo. As always, and obviously in this case, Lenovo didn't pay for this coverage. The opinions herein are mine and mine alone. Until next time, thanks for watching. And if you can't stay home, remember to stay safe and mask up while you stay mobile, my friends.",
    "transcript_keywords": [
        "Fold",
        "Windows",
        "Lenovo",
        "folding screen",
        "screen",
        "keyboard",
        "device",
        "problems",
        "time",
        "machine",
        "mode",
        "coolest laptop",
        "folding",
        "Netbook mode",
        "Fold Prototype",
        "laptop",
        "review",
        "Surface Neo device",
        "folding screen changed",
        "Bluetooth"
    ],
    "transcript_entity_values": [
        "Lenovo",
        "2020",
        "Today",
        "the almost two year",
        "X1 Fold",
        "Windows 10X.",
        "Chassis",
        "30 years",
        "Qualcomm",
        "fewer than four hours",
        "just two days",
        "a thousand dollars",
        "Spotify",
        "the two months",
        "Microsoft",
        "a few weeks",
        "300",
        "YouTube",
        "2.2 pounds",
        "the X1 Fold",
        "10",
        "Wacom",
        "Bluetooth",
        "14",
        "Mobile",
        "Windows Central",
        "2",
        "One",
        "13.3 inch",
        "first",
        "Neo",
        "max",
        "Intel",
        "a hundred",
        "about two months",
        "Windows",
        "Thinkpad",
        "Windows 10",
        "LG",
        "Chrome",
        "60 days",
        "Lakefield Core",
        "the Pixel C. Look",
        "Evo",
        "Penny",
        "Windows",
        "Asus Zenbook Duo",
        "one",
        "a half",
        "Surface Neo"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "DATE",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.06768888235092163,
        -0.05737101659178734,
        -0.01864512450993061,
        -0.08756813406944275,
        0.05631472170352936,
        0.039625853300094604,
        0.03609095886349678,
        0.13063138723373413,
        -0.017904894426465034,
        0.01927984319627285,
        0.08505670726299286,
        0.08759685605764389,
        0.018034586682915688,
        0.01504642702639103,
        0.034936729818582535,
        0.07579132169485092,
        -0.005015863571316004,
        -0.0635751262307167,
        -0.0001300133008044213,
        0.027375396341085434,
        0.0806017741560936,
        -0.04741865396499634,
        0.016945479437708855,
        -0.05709837004542351,
        0.013615083880722523,
        0.017054028809070587,
        -0.035910725593566895,
        -0.08653309941291809,
        -0.005147263873368502,
        0.04831557348370552,
        -0.01583424024283886,
        0.04390937089920044,
        0.00940345972776413,
        -0.014973162673413754,
        -0.012994905933737755,
        -0.022560162469744682,
        0.0412839911878109,
        0.010883282870054245,
        -0.050550464540719986,
        -0.1149473637342453,
        -0.0657489076256752,
        -0.047038450837135315,
        0.03247435763478279,
        -0.005697542801499367,
        0.043666306883096695,
        -0.03286052495241165,
        0.04938552528619766,
        -0.010675243102014065,
        0.011973301880061626,
        0.035102155059576035,
        0.02012225240468979,
        -0.032644178718328476,
        -0.01649235002696514,
        -0.0340069942176342,
        0.0010057893814519048,
        0.0021914783865213394,
        0.005932377651333809,
        0.021319525316357613,
        -0.08807389438152313,
        0.001667710836045444,
        0.05049576237797737,
        -0.05599794536828995,
        -0.00020803649385925382,
        0.0075834267772734165,
        0.0019503176445141435,
        -0.006801495794206858,
        0.002095449948683381,
        -0.1108287051320076,
        0.0009736683568917215,
        -0.04598686471581459,
        -0.03997396305203438,
        -0.015898071229457855,
        -0.005613713059574366,
        -0.0986136868596077,
        -0.08486433327198029,
        -0.03533250465989113,
        0.07821891456842422,
        -0.025142136961221695,
        0.020295854657888412,
        0.022237231954932213,
        -0.04607405513525009,
        0.11662562191486359,
        0.04228987544775009,
        0.003022972261533141,
        -0.05882551521062851,
        -0.017589407041668892,
        -0.0028455150313675404,
        0.00773483095690608,
        -0.04696197435259819,
        0.0035307493526488543,
        0.07153993099927902,
        0.037123288959264755,
        -0.023957522585988045,
        0.03462008759379387,
        -0.03805631399154663,
        -0.07313870638608932,
        0.09811398386955261,
        -0.0016415289137512445,
        -0.01968555338680744,
        0.015601026825606823,
        0.004430090542882681,
        0.07033776491880417,
        0.14445288479328156,
        -0.05005704611539841,
        -0.01802530325949192,
        -0.12193801254034042,
        0.07868221402168274,
        -0.03342928737401962,
        -0.07574595510959625,
        -0.024593621492385864,
        -0.028027120977640152,
        -0.09370848536491394,
        -0.018959444016218185,
        0.04033506661653519,
        -0.026829615235328674,
        0.04620733857154846,
        0.042142096906900406,
        0.08756247162818909,
        0.0786328911781311,
        0.05791592597961426,
        -0.018987556919455528,
        -0.0028267300222069025,
        0.040598660707473755,
        -0.02727283164858818,
        -0.009128851816058159,
        0.012361500412225723,
        -0.06297767162322998,
        5.4116707299965825e-33,
        -0.01512924488633871,
        0.06375966221094131,
        -0.06767825037240982,
        0.008514301851391792,
        0.05070176348090172,
        -0.03898490220308304,
        0.011123612523078918,
        0.04229239746928215,
        -0.0021707324776798487,
        0.08076635748147964,
        -0.03326765447854996,
        0.02479276806116104,
        -0.04356473684310913,
        -0.02537688799202442,
        0.030085932463407516,
        -0.09455583989620209,
        -0.0968722254037857,
        0.09997754544019699,
        -0.0601092204451561,
        -0.017444029450416565,
        0.04328090324997902,
        -0.05103697255253792,
        0.04630879685282707,
        -0.08226468414068222,
        -0.01536651886999607,
        0.00646856939420104,
        -0.03762579709291458,
        0.052861910313367844,
        -0.007691161707043648,
        0.0036940649151802063,
        -0.1011509820818901,
        -0.0406702384352684,
        -0.12149162590503693,
        -0.08103322237730026,
        -0.046156078577041626,
        -0.018304968252778053,
        0.00723695894703269,
        -0.06323471665382385,
        0.08687971532344818,
        0.042483340948820114,
        -0.11582543700933456,
        0.00648410152643919,
        0.05366634950041771,
        -0.04568963125348091,
        0.07035267353057861,
        -0.015764405950903893,
        0.07459735870361328,
        0.0936613529920578,
        -0.03389529883861542,
        -0.043516606092453,
        -0.033547352999448776,
        -0.008241868577897549,
        0.022218724712729454,
        -0.029971688985824585,
        0.013007383793592453,
        -0.08494637906551361,
        0.03812875598669052,
        0.04283709451556206,
        0.041542086750268936,
        0.1415080577135086,
        -0.0024684411473572254,
        -0.03842197358608246,
        -0.005131125915795565,
        0.019358960911631584,
        -0.017307110130786896,
        0.0409063883125782,
        0.07030858099460602,
        -0.008756255730986595,
        0.006877889856696129,
        -0.02184782363474369,
        -0.0460137203335762,
        -0.008580895140767097,
        -0.018862033262848854,
        -0.06184518337249756,
        0.027673475444316864,
        -0.042312100529670715,
        0.04054036736488342,
        0.004093802999705076,
        -0.0228306632488966,
        -0.0450022891163826,
        0.010711067356169224,
        0.02587035298347473,
        0.0372907891869545,
        -0.035436321049928665,
        -0.07496459037065506,
        0.03837044909596443,
        -0.030199166387319565,
        -0.07594636082649231,
        -0.050286680459976196,
        -0.03614802286028862,
        -0.05407154560089111,
        -0.04778685420751572,
        -0.033723194152116776,
        -0.06053810566663742,
        0.029389765113592148,
        -3.715630379089738e-33,
        -0.02225649170577526,
        -0.07441577315330505,
        0.002199934097006917,
        -0.03819002956151962,
        -0.010959964245557785,
        0.03409904986619949,
        0.02297653816640377,
        0.014560568146407604,
        -0.08650456368923187,
        -0.05232217535376549,
        -0.04136485233902931,
        0.013555384241044521,
        0.051557108759880066,
        0.02777060866355896,
        -0.006500195246189833,
        0.016445213928818703,
        0.03604140132665634,
        -0.0367383137345314,
        -0.020487599074840546,
        -0.028112873435020447,
        -0.00961059145629406,
        0.038541264832019806,
        -0.05969786271452904,
        -0.016553422436118126,
        -0.023636972531676292,
        0.01383713074028492,
        -0.05244513601064682,
        0.00815484207123518,
        0.08200322836637497,
        0.03966690972447395,
        -0.025244873017072678,
        -0.06588418036699295,
        0.03881534934043884,
        0.06524988263845444,
        0.07198360562324524,
        -0.05883939191699028,
        -0.05110076814889908,
        -0.05455177277326584,
        0.059159137308597565,
        0.06045787036418915,
        0.07248874753713608,
        0.017873510718345642,
        0.013990253210067749,
        0.01731075905263424,
        0.032921984791755676,
        0.026858888566493988,
        -0.07264307886362076,
        -0.05847399681806564,
        -0.001043217722326517,
        -0.022451218217611313,
        -0.009175825864076614,
        0.0453718826174736,
        -0.030710961669683456,
        -0.017243310809135437,
        -0.06512462347745895,
        -0.010317704640328884,
        -0.009494733065366745,
        0.03132396191358566,
        -0.03267590329051018,
        0.01655152440071106,
        -0.0010930723510682583,
        0.022893026471138,
        0.02479122206568718,
        -0.002384438179433346,
        0.06522037833929062,
        0.051688797771930695,
        0.10726681351661682,
        0.020621640607714653,
        -0.04696466028690338,
        0.006191258784383535,
        -0.03754746541380882,
        -0.05025632679462433,
        0.061688318848609924,
        -0.08952024579048157,
        0.0551367923617363,
        0.09876380115747452,
        0.0420071966946125,
        -0.05006511136889458,
        -0.008581478148698807,
        -0.06077864021062851,
        0.06073874607682228,
        -0.08251464366912842,
        0.044150691479444504,
        -0.022435085847973824,
        0.026732804253697395,
        0.013875461183488369,
        0.04436077922582626,
        0.05191904306411743,
        -0.05159139260649681,
        0.02084903046488762,
        0.06029457971453667,
        0.005770608317106962,
        0.02871863730251789,
        0.1688835620880127,
        0.08865302801132202,
        -4.467960579290775e-08,
        0.0040689199231565,
        0.030635425820946693,
        0.0742429792881012,
        0.03263120725750923,
        -0.04834338650107384,
        0.008707579225301743,
        0.08263877779245377,
        -0.01859309710562229,
        0.013789515011012554,
        0.03157246857881546,
        -0.03553014248609543,
        -0.12798874080181122,
        -0.043361563235521317,
        0.06276750564575195,
        0.07620517164468765,
        0.08278430998325348,
        -0.03693235665559769,
        0.08769164979457855,
        -0.02146126516163349,
        -0.024339765310287476,
        0.012171325273811817,
        -0.042125385254621506,
        0.045125704258680344,
        -0.0768570527434349,
        0.040540359914302826,
        -0.014002958312630653,
        -0.06835583597421646,
        0.0634373351931572,
        0.0728817880153656,
        -0.03473920002579689,
        -0.05081547424197197,
        0.006641939282417297,
        0.03099839761853218,
        0.0635748878121376,
        -0.03225446492433548,
        -0.025865783914923668,
        0.0018378215609118342,
        0.04743117466568947,
        0.07751551270484924,
        0.06996028125286102,
        0.025318235158920288,
        -0.024902094155550003,
        -0.07454342395067215,
        0.0045234947465360165,
        0.030988523736596107,
        0.020533103495836258,
        -0.02405025064945221,
        -0.04092397168278694,
        -0.019710607826709747,
        0.08415628969669342,
        0.012172834947705269,
        0.024276548996567726,
        0.09241999685764313,
        -0.017259828746318817,
        0.0039862957783043385,
        0.12418413907289505,
        0.0006861454457975924,
        0.09032144397497177,
        0.01110217534005642,
        0.11371210962533951,
        -0.03957657143473625,
        -0.048122018575668335,
        -0.04665283486247063,
        0.024741165339946747
    ]
}