{
    "id": "eZSoeqVWdl0",
    "title": "Galaxy Note 7 Review: With Phones Like This, Who Needs Tablets?",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-08-16T13:00:40Z",
    "video_url": "https://www.youtube.com/watch?v=eZSoeqVWdl0",
    "category": "People & Blogs",
    "tags": [
        "galaxy note 7 review",
        "galaxy note 7 unboxing",
        "galaxy note 7 iris scanner",
        "galaxy note 6",
        "samsung galaxy note 7",
        "samsung galaxy note 7 review",
        "michael fisher",
        "mrmobile",
        "captain2phones",
        "pocketnow",
        "android authority",
        "android central",
        "samsung",
        "s pen",
        "galaxy note",
        "s pen note 7",
        "note 7 review"
    ],
    "views": 1642445,
    "likes": 25160,
    "comments_count": 3013,
    "description": "The first Galaxy Note was a remarkable smartphone when it hit store shelves in 2011. It was the first widely-adopted mobile to offer an oversized display, the first to give the stylus a proper resurrection, and the first to prove that marketing an overpowered \"phablet\" to hardcore users could also pay off in the mainstream. With the Galaxy Note 7, Samsung steers the Note family even further toward those everyday users: it boasts a gorgeous design, water resistance, a streamlined S Pen experience  and it brings back the MicroSD card whose absence on the Note 5 cost Samsung some consumer goodwill. But in an age of solid $399 flagships, does the Galaxy Note 7 bring enough to justify its $850 price tag? Watch MrMobile's Galaxy Note 7 review to find out!   [SUBSCRIBE]     [UPDATE]  The Samsung Galaxy Note 7 has been recalled due to safety issues related to its battery. For more details see Android Central's continuing coverage:    [PRODUCTS]  Galaxy Note 7 ATT:  T-Mobile:  Verizon:  Sprint:   US Cellular:   Microsoft Universal Foldable Keyboard    [ABOUT THIS VIDEO]  Michael Fisher's Galaxy Note 7 review was conducted on a demo SM-N930T Galaxy Note 7 on loan from Samsung. The device was tested in Greater Boston and Cape Cod, MA on T-Mobile US over a period of six days, during which it was continuously paired with a Gear Fit 2 and intermittently paired with a Bose QC35 Bluetooth headset.   [LINKS]  DisplayMate report on Galaxy Note 7 display:     [SOCIALIZE]         [MUSIC]  \"The Ballad of MrMobile\" (Mobile Nations, 2016)  \"Beach\" by JAM Studio, available at Premium Beat:   \"Smart Ideas\" by Julian Bell, available at Premium Beat:   \"e-Business\" by Olive Musique, available at Premium Beat:    [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://www.androidcentral.com/samsung-galaxy-note-7-recall",
        "http://mrmobile.tech/q",
        "http://mrmobile.tech/r",
        "http://mrmobile.tech/s",
        "http://mrmobile.tech/t",
        "http://mrmobile.tech/u",
        "http://mrmobile.tech/p",
        "http://www.displaymate.com/Galaxy_Note7_ShootOut_1.htm",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.premiumbeat.com/royalty_free_music/songs/beach",
        "http://www.premiumbeat.com/royalty_free_music/songs/smart-ideas",
        "http://www.premiumbeat.com/royalty_free_music/songs/e-business",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Narrator] This is no ordinary smart phone. It's the newest Galaxy Note and it's got a lot to prove to a fan-base disillusioned by the compromises of last year's model and to a mainstream audience that might want a smart phone that does more, but is slowly getting used to the idea of paying less. I'm Michael Fisher and this is the Mr. Mobile Review of the Samsung Galaxy Note 7. (techno music) The Note 7 blends two of Samsung's signature strengths, its long-standing affinity for overpowered specs and its new-found talent for industrial design. You notice the latter as soon as you pluck the phone from its packaging. It's made entirely of glass and metal and the resulting heft makes it feel every bit as expensive as it looks. There are four available colors and they all look great. In shaving just two millimeters from the width, Samsung has made this Note much more comfortable to use one-handed than the last one. The display is large, high-resolution, and it spills slightly over the edges to give the impression of a smart phone with almost no bezels. While Samsung makes a big deal of its HDR capability for videos, I'm more excited about the fundamentals. This is the brightest screen ever put into a mainstream phone. With ambient light sensors both front and back. On the flip-side, it also gets way dim for those times you don't want to keep a bed mate awake, with an automatic blue light filter that kicks in at sunset to go easy on your eyeballs. The Note 7 can see your eyeballs in any lighting conditions with its infared iris scanner, a trick it pulls off better than rival, Microsoft. The idea is to use this in conjunction with the fingerprint sensor to keep your sensitive files under lock and key, or just provide another way for your to scan into your phone. The Note is launching at the tail-end of beach season and having a fall-back sign in option when your thumb is wet or covered in sunblock is really quite nice. Speaking of swimming, the Note 7 is the first of its line to include IP68 water and dust resistance, and it also brings back micro SD support to expand the onboard storage. The design isn't without downsides. A mostly glass phone is always fertile ground for fingerprints and the Note 7 is no exception. Also, while the fully symmetrical design is beautiful to the eye, it's confusing to the hand with few physical cues to differentiate up from down and back from front, I routinely find myself pulling the phone from a pocket upside down or backwards or both. On the upside, that new Gorilla Glass 5 is sturdy. This particular unit has taken two bad spills on tile and concrete from between three and four feet. While it's a little scuffed, it's not shattered. As always, the new Note brings a new stylus. Doodling, writing and highlighting have all gotten improvements. The Note 7's digitizer is twice as sensitive to pressure as the note 5's, the stylus tip better replicates the feel of a pen on paper, and all of the various sketching tools have been condensed into a single app. From video editors to compulsive Snapchatters, to those who need to sign a lot of contracts, the S pen can come in handy to all sorts of folks. While it's cool you can take notes under water, I find the S pen more useful in a more routine sense. It's a mouse for your smart phone. Hover over a link in the browser and preview where it goes. Hold it over the top or bottom of a webpage to scroll. You can hit tiny tap targets much more easily with a pen than a thumb, and overall, it's a more comfortable, less obtrusive way to interact with the screen than blocking the view with your big meat paw. It's cool that you can use the pen to translate words or magnify the screen or make a JIF from a video, but much like the people who think there's only one right way to pronounce GIF, those features don't really matter to me. The S pen is at its best when it's being used for the simple stuff. Let's talk software. With the Note 7, Samsung reasserts its interface ideas with something called the Grace UX, an Android skin that you'll either love or loathe depending on how you feel about the Android platform. If you're a stock lover, of course, you won't like this and you won't like that it's based on Marshmallow instead of Nougat, and while Samsung has been pretty prompt with software updates of late, you'll still wait longer for the next version to drop than your Nexus toting friends. Then, there's the look and feel. There's a new paint job and such a depth of options that it took me longer than usual to settle into the Note 7. Look, if you want stock Android with fast updates, you should be shopping for a Nexus, and truly, running stock on a phone like this would be a waste. For all its changes over the years, the Note line is still Samsung's chance to play with excess, and there are options in this software for everything. The always on display now supports more notification types. You can run some apps side by side or in Windows if you want to do two things at once, and the theme store is back if you really can't stand that default interface and you want to spruce things up. Yes, there are a few toys for the curved screen. You get a really cool light show if you get a call or text while the phone is face down on a table and you also get edge panels. Basically widget docks that you can customize with all matter of news feeds and shortcuts. Personally, I don't find it too useful because it's kind of a pain to deploy, but if you've got a smoother touch than I do you might find it handy for single handed situations. If you don't dig it but still want a one handed shortcut, just triple click the home button to temporarily shrink the screen. Now, if you double click that button instead, you'll fire up the Note 7's camera. This is the same module from the Galaxy S7, and if you recall my review of that device, you'll know I consider it one of the best cameras you can find in a smart phone. The only really change here is in software. The view-finder now uses left and right swipes to access filters, settings and shooting modes and vertical swipes switch between primary and selfie cameras. Samsung has done shooters very well for over two years now, so the results are no surprise. I don't know about you, but I'm getting tired of the sound of my own voice so I'll let you see for yourself what the Note 7 can do. For a closer look at these photos, visit the Mr. Mobile Facebook page. (soft techno music) I've used the Note 7 on T-Mobile for six days between greater Boston and Cape Cod and fundamentals like voice calls have been strong. I love the extra volume option for loud environments and callers said I sounded crisp and clear on their end. Same goes for media. On my QC35s I can't tell a difference in audio quality between the Note 7 and any other device, but I do stream all my music and I'm not at all in audio files so I have no authority in this regard. If there's an obvious Achilles' heel here, it's the speaker phone. It's inconveniently located, and it's not as loud or as rich as the speakers on some much less expensive phones. (\"I Want It All\" by Warren G.) The Note 7 is well future-proofed for gaming. Logically, the phone supports the Vulkan API for next generation graphics and Samsung offers a ton of free software including the four games that can currently take advantage of that API. If you're really hardcore, you can spring for the new and improved Gear VR Visor that turns the Note 7 into a virtual reality headset. Games themselves run quite well, as does most of the software, but occasionally the Note does bog down. It's not a deal-breaker. The phone is still plenty fast today, but software doesn't usually age well. So it does make me worry about tomorrow. Finally, the battery life is fine. Like a lot of tech reviewers, I'm a very heavy user, so I've given up on the idea of great battery life from any smart phone. I have to admit, not being able to hit five hours of screen on time was a bit of a letdown. On the upside, the phone does support fast charging through USB-C and wireless charging in both PMA and Qi, which means if you're anywhere near a power outlet or a Starbucks you'll be good. Of course, Samsung offers a slew of battery packs, some of which are as water-resistant as the phone itself. There are also several battery-saving modes here too. You've got options. The modern Galaxy Note is no longer the envelope pusher it once was. It's now a mainstream product for mainstream buyers, albeit well heeled ones. Whether you think it's worth the price depends how you're gonna use it. If you're just in the market for a smart phone, a handheld companion for your tablet and computer, I'd say the Note isn't for you. You can get a phone that does almost everything the Note does for far less and the prices are coming down all the time. But we live in an era of ever increasing mobility. People aren't just moving away from desktops, they're starting to neglect their notebooks and tablets too, in favor of the device that's always in their pocket anyway. If you're one of those people and you're looking for the best possible blend of phone and tablet to be your primary computing device, the Galaxy Note 7 is the best option there is. There's a button below labeled subscribe, folks. Push it to be the first to know when Mr. Mobile drops a new video. It happens twice a week. Until next time, thanks for watching and stay mobile my friends.",
    "transcript_keywords": [
        "Note",
        "Samsung Galaxy Note",
        "Galaxy Note",
        "phone",
        "smart phone",
        "Samsung",
        "newest Galaxy Note",
        "ordinary smart phone",
        "modern Galaxy Note",
        "smart",
        "Galaxy",
        "software",
        "Samsung Galaxy",
        "pen",
        "screen",
        "Michael Fisher",
        "Samsung offers",
        "Note brings",
        "Note line",
        "Mobile"
    ],
    "transcript_entity_values": [
        "Warren G.",
        "Nougat",
        "a ton",
        "between three and four feet",
        "Marshmallow",
        "Galaxy Note",
        "last year's",
        "API",
        "six days",
        "PMA",
        "USB-C",
        "Samsung",
        "T-Mobile",
        "Microsoft",
        "over two years",
        "the years",
        "GIF",
        "four",
        "Nexus",
        "the Grace UX",
        "Mobile",
        "Gear VR Visor",
        "today",
        "Starbucks",
        "Boston",
        "the Samsung Galaxy Note 7",
        "first",
        "Mobile Facebook",
        "The S pen",
        "two",
        "five hours",
        "the S pen",
        "Qi",
        "5",
        "Achilles",
        "Snapchatters",
        "JIF",
        "the Galaxy S7",
        "Cape Cod",
        "the Galaxy Note 7",
        "micro SD",
        "only one",
        "Windows",
        "just two millimeters",
        "Michael Fisher",
        "one",
        "Android",
        "the Note 7's"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "FAC",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.11549647897481918,
        0.05051388591527939,
        0.07866205275058746,
        -0.0055433823727071285,
        -0.00036248815013095737,
        0.0393378846347332,
        -0.0010124524123966694,
        0.16835270822048187,
        0.00688097532838583,
        0.07854251563549042,
        -0.004888549447059631,
        0.05510992929339409,
        0.01451522670686245,
        0.03873355686664581,
        0.062480904161930084,
        -0.06949786841869354,
        0.04678069055080414,
        -0.10091721266508102,
        -0.0215215515345335,
        0.06313545256853104,
        0.03002960793673992,
        0.028529880568385124,
        0.08680069446563721,
        -0.016940344125032425,
        0.04866315424442291,
        0.024095401167869568,
        -0.06443842500448227,
        -0.06507114320993423,
        -0.013806170783936977,
        0.0006004587048664689,
        -0.08538530021905899,
        0.10957302898168564,
        0.009614385664463043,
        0.02041967771947384,
        -0.008562837727367878,
        -0.05623404309153557,
        0.018700148910284042,
        0.015304594300687313,
        -0.004215605556964874,
        -0.0031239688396453857,
        -0.046902067959308624,
        -0.044332459568977356,
        -0.030760381370782852,
        -0.05245417729020119,
        0.0031293139327317476,
        -0.055835623294115067,
        0.06053264066576958,
        0.015371523797512054,
        -0.013624239712953568,
        0.025924528017640114,
        -0.0012372969649732113,
        -0.011211149394512177,
        -0.008174515329301357,
        -0.01694519631564617,
        -0.047708604484796524,
        -0.06132092699408531,
        0.0013677506940439343,
        -0.052970197051763535,
        0.048389285802841187,
        0.011670822277665138,
        0.036363910883665085,
        -0.051246583461761475,
        0.00846240483224392,
        0.02412344329059124,
        -0.06652146577835083,
        0.01561069954186678,
        0.018932009115815163,
        -0.09160488098859787,
        0.03479267656803131,
        -0.0032473953906446695,
        0.019587937742471695,
        0.018403781577944756,
        0.06977038085460663,
        0.016428450122475624,
        0.007133444305509329,
        0.023821359500288963,
        0.07303375005722046,
        -0.022242529317736626,
        -0.05314427241683006,
        -0.012054874561727047,
        0.006949486676603556,
        -0.03860430791974068,
        -0.03163038566708565,
        -0.011690253391861916,
        0.08141639083623886,
        -0.03769528493285179,
        -0.04300861805677414,
        0.06375709921121597,
        -0.05579028278589249,
        -0.04568018764257431,
        0.06690344959497452,
        0.12222467362880707,
        -0.03493960574269295,
        -0.03096720203757286,
        -0.06498421728610992,
        0.004185373894870281,
        -0.034436117857694626,
        -0.04768240079283714,
        -0.06496611982584,
        0.016172176226973534,
        0.07583829760551453,
        0.10964573174715042,
        0.10444782674312592,
        0.03695898875594139,
        0.1001662015914917,
        -0.039913080632686615,
        0.00511585408821702,
        -0.01253668311983347,
        -0.00036910580820403993,
        -0.07839783281087875,
        0.04336982220411301,
        -0.016959698870778084,
        0.01425700169056654,
        0.04649653658270836,
        -0.07447388023138046,
        -0.0631108433008194,
        -0.014028103090822697,
        -0.0009056722046807408,
        0.13304927945137024,
        0.1385323852300644,
        0.01196658331900835,
        -0.027035633102059364,
        -0.04535651206970215,
        -0.029083097353577614,
        -0.06249682605266571,
        0.006437267176806927,
        -0.08022736012935638,
        2.1734587489566775e-33,
        -0.06313014030456543,
        0.09174315631389618,
        -0.01705661043524742,
        -0.08384338021278381,
        -0.03274105116724968,
        0.007312614005059004,
        -0.03425976634025574,
        0.00894911214709282,
        0.036201752722263336,
        -0.05336900055408478,
        -0.031347163021564484,
        -0.04189795255661011,
        0.00669105676934123,
        0.06212523952126503,
        0.046374768018722534,
        -0.05535559728741646,
        -0.036755647510290146,
        -0.012741952203214169,
        0.01961810328066349,
        -0.044878073036670685,
        -0.007031573448330164,
        -0.08396486192941666,
        -0.013506132178008556,
        0.008657188154757023,
        -0.0107736736536026,
        0.0796356126666069,
        0.038970351219177246,
        0.008604004979133606,
        0.07009874284267426,
        -0.013335153460502625,
        -0.09498653560876846,
        -0.006748066749423742,
        0.09241887181997299,
        -0.04516748711466789,
        -0.005529348738491535,
        -0.021689502522349358,
        -0.004273529164493084,
        -0.07568851113319397,
        0.05489630997180939,
        -0.04386836290359497,
        -0.05118558928370476,
        0.055123817175626755,
        -0.0020332171116024256,
        0.01926310546696186,
        0.05037436634302139,
        0.035755325108766556,
        -0.001471140654757619,
        0.035612884908914566,
        -0.021056871861219406,
        -0.011749549768865108,
        -0.04299715533852577,
        -0.05444730445742607,
        -0.039730701595544815,
        0.04494433104991913,
        -0.06291013211011887,
        -0.03685205057263374,
        0.010199066251516342,
        -0.05801871791481972,
        0.04628465324640274,
        0.060488782823085785,
        -0.04137585684657097,
        -0.004678994417190552,
        -0.05561764910817146,
        0.04800403490662575,
        -0.07226131856441498,
        0.04298727214336395,
        0.024446183815598488,
        0.030089350417256355,
        -0.10583862662315369,
        0.024921178817749023,
        0.03693021461367607,
        -0.024423541501164436,
        0.012080051004886627,
        -0.015297479927539825,
        -0.015002617612481117,
        0.02952759526669979,
        0.07373152673244476,
        -0.044683072715997696,
        0.009105028584599495,
        -0.05936342850327492,
        -0.050786904990673065,
        -0.03981640562415123,
        0.04556482285261154,
        0.03038843721151352,
        -0.037571847438812256,
        0.02561516873538494,
        -0.0035161753185093403,
        -0.16158132255077362,
        0.028883231803774834,
        -0.009760058484971523,
        -0.01257652509957552,
        -0.0037376664113253355,
        0.005764354486018419,
        -0.008210466243326664,
        -0.03000958450138569,
        -2.5648985514514915e-33,
        -0.04177762195467949,
        -0.009785491973161697,
        -0.03112957626581192,
        0.0022201621904969215,
        -0.06819967925548553,
        0.020560409873723984,
        -0.002693698275834322,
        0.050658389925956726,
        -0.046853285282850266,
        -0.05960850045084953,
        -0.07398726046085358,
        0.07897226512432098,
        0.006708949338644743,
        0.0001618556270841509,
        -0.007837698794901371,
        0.018125681206583977,
        0.014931530691683292,
        -0.06458316743373871,
        0.08397915959358215,
        -0.04261874035000801,
        0.011407990008592606,
        -0.004960352089256048,
        -0.008695745840668678,
        0.14555120468139648,
        0.050132233649492264,
        0.023394962772727013,
        -0.08133513480424881,
        -0.055484700947999954,
        0.03124643675982952,
        -0.0009034129907377064,
        0.013413917273283005,
        -0.11042340844869614,
        0.010238917544484138,
        0.08254151791334152,
        0.005791761912405491,
        0.012041408568620682,
        0.03575291112065315,
        -0.04075760394334793,
        0.03309519588947296,
        0.06437357515096664,
        0.048208121210336685,
        0.04108061641454697,
        0.012565291486680508,
        -0.023804493248462677,
        0.024799343198537827,
        -0.012342024594545364,
        0.05102148652076721,
        -0.0476774126291275,
        -0.023395992815494537,
        -0.007535838987678289,
        0.0074692522175610065,
        -0.009010945446789265,
        -0.027398884296417236,
        -0.05858587473630905,
        -0.14489540457725525,
        0.041329752653837204,
        0.07075000554323196,
        -0.003212032373994589,
        -0.013494607992470264,
        -0.08431426435709,
        0.08353729546070099,
        0.032642900943756104,
        -0.031683024019002914,
        -0.01746305450797081,
        -0.020152822136878967,
        0.004317423328757286,
        0.10342217236757278,
        0.020020581781864166,
        0.004029502626508474,
        -0.02223641239106655,
        -0.0487821027636528,
        -0.05077679827809334,
        -0.024192243814468384,
        -0.07336815446615219,
        0.02679763175547123,
        0.08255679160356522,
        -0.00796506181359291,
        -0.04464896023273468,
        -0.06979706138372421,
        -0.059942420572042465,
        0.040938183665275574,
        -0.007635877933353186,
        -0.011588450521230698,
        -0.06280406564474106,
        0.015153065323829651,
        -0.012031693011522293,
        0.035421695560216904,
        -0.011730335652828217,
        -0.05517018213868141,
        0.09541047364473343,
        -0.06257314234972,
        -0.027048664167523384,
        -0.0945061668753624,
        0.08450279384851456,
        0.009302863851189613,
        -4.513169216124879e-08,
        0.01326969638466835,
        0.02195468358695507,
        0.05223263055086136,
        -0.042899250984191895,
        0.04887174814939499,
        -0.07509613782167435,
        0.050859179347753525,
        -0.013667508959770203,
        0.060733456164598465,
        0.046019297093153,
        0.004107948392629623,
        -0.1336124688386917,
        -0.05084208771586418,
        0.005612787790596485,
        -0.021390900015830994,
        0.10509021580219269,
        0.026491738855838776,
        0.02733437344431877,
        -0.0107872374355793,
        0.02647460252046585,
        0.014417022466659546,
        0.03654520586133003,
        -0.03421148657798767,
        -0.02106555923819542,
        0.07793114334344864,
        -0.005147766787558794,
        -0.08895308524370193,
        0.10551225394010544,
        0.03283543884754181,
        -0.059682440012693405,
        -0.008600122295320034,
        -0.022117236629128456,
        0.05376027524471283,
        0.01222232822328806,
        0.032568734139204025,
        -0.06314540654420853,
        0.04276106134057045,
        -0.0242810919880867,
        0.05501003935933113,
        0.07298930734395981,
        -0.00029122750856913626,
        0.009602309204638004,
        -0.0885811522603035,
        0.039063461124897,
        0.009856492280960083,
        -0.10780415683984756,
        -0.01746877282857895,
        -0.04460357874631882,
        0.025648208335042,
        0.11442402750253677,
        0.006026589777320623,
        0.018798131495714188,
        -0.02418702095746994,
        0.005798676051199436,
        0.013370238244533539,
        0.0015639991033822298,
        0.04586390405893326,
        0.08398991823196411,
        -0.035485267639160156,
        0.013805994763970375,
        0.09916786104440689,
        -0.08492797613143921,
        0.018411625176668167,
        0.0878283679485321
    ]
}