{
    "id": "EZXu-Cpg7Kw",
    "title": "I got SCAMMED on Temu 🤦‍♂️",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2023-04-22T16:02:33Z",
    "video_url": "https://www.youtube.com/watch?v=EZXu-Cpg7Kw",
    "category": "Science & Technology",
    "tags": [
        "temu",
        "wish",
        "mystery tech",
        "wishtery tech",
        "amazon",
        "austin",
        "austin evans",
        "timu",
        "switch",
        "switch oled",
        "scam",
        "denki",
        "this is"
    ],
    "views": 987160,
    "likes": 27790,
    "comments_count": 1149,
    "description": "on @thisis   on @Denki   Subscribe for more!  TikTok:  Instagram:  Twitter:   Chapter Titles: 0:00 Mystery Tech from Temu 2:28 Hug the Dishes 3:23 Cleaning Goo 4:49 \"High Quality\" Drone 6:11 Temu Fashion Haul 7:04 Wireless Charging LED 8:37 Magnetic Astronaut 9:34 I Forking Love the Switch 10:24 Switch OLED Temu Edition 11:50 Big Ball 12:31 Esports Mouse 13:23 Kodak SSD 14:15 Tiny Crossbow 15:04 PS5 Cheese",
    "description_links": [
        "https://www.youtube.com/watch?v=beJ97So74UY",
        "https://www.youtube.com/watch?v=epc0tC_zl20",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hello there, friends, and welcome to TEMU Tech. Not Tee-moo Tech, TEMU Tech. Boy, I don't like saying it like that. Last time, I took a look at a wide variety of incredible items on TEMU.com, but today we're taking it up a notch. How are we taking it up a notch? By giving them more of my money, that's how. Spin to win. It's just like Wish. I can win money, I mean coupons. Boo, ah, ah, wow. Congrats, $100 coupon bundle. Do I just do this ordering scene from my phone? This is unchartered territory. I want my $100. This is not as much fun, I like being in front of the laptop. Also, there's a lot of (bleep), just (bleep), (bleep), left, right and center. I want toys. Oh, it's more (bleep), wow. How about an HD Shooting Drone? Because shooting's I guess the theme of this episode. But we have to hurry, 999 people have this in their carts right now. Oh, how about this one? In toys, a funny sign that says, (bleep) the dishes. (Austin laughs) Ew, what is this? Multifunction cleaning gel. Ew, it's literally a gel that you're supposed to put in the crevices in your car to clean it out. That's disgusting. I'm gonna add to the cart. - [Ken] That's normal. - You put goo in your car? - [Ken] Yes. - What are you talking about? - [Joanna] It's a thing. - Okay. - [Matt] Joanna knows about it? (crew chuckles) - Wait, what about men? (record scratches) I'm gonna, I want men. - [Narrator] It was at this moment that he knew, he (bleep) up. - The category on TEMU.com. Editors, if you clip that in a suspicious way, I'm gonna be very upset. I want men, I want men, I want men. I'm gonna look for tech now. Hey, Matt? - [Matt] Yeah? - Would you trust a Kodak SSD, an external USB SSD? - [Matt] No. - Okay, cool. I'll add it to the cart. Wait, wait. Nintendo Switch OLED, direct from Nintendo Switch, is the store. Do we buy a Switch OLED, direct from TEMU, via Hong Kong? - [Matt] Yes. - What could go wrong? Wait, hey. Hey, (bleep) you, TEMU. I've added all these things, I've only got $30 off. Where's my $100? No, I just realized what I did wrong. Each coupon is per order. I would have to put in like seven orders to get my discount. Okay guys, I'll be right back, after ordering seven more times from TEMU. Wish I didn't have to do this on my phone now. (truck swooshes) This is the kind of energy I'm gonna bring to today's TEMU tech. - [Matt] Slouching into a desk? (quirky music) - [Joanna] Ah. - Oh, you don't, hang on, there's a little preparation on this one. One moment. (upbeat music) My friends, TEMU.com is a lovely place to get a wide variety of different accoutrement, including some signage to spruce up any house, including (bleep) the dishes. If you too, would like to hang a little sign, and let everyone know how you feel about the dishes, TEMU has got your back. I'm gonna put this down now, because we're quickly running out of our censor budget for this episode, and I think we're gonna need it for some more items coming soon. Boy, I just don't know about this at all. - All right so, we know that you don't like doing the dishes, but apparently you still have to clean, so... - I caught that one. - [Matt] Oh, I underthrew that one. - That was a poor throw. - [Matt] That ones just fine. - Got it. This is Super Clean. The high tech cleaning compound that catches dirt and kills germs. It's like Jello. That should tell you the consistency. All right. Eurgh. - [Matt] We let our fans play with some keyboards, to get you in the right space for this. (crew member chuckles) That's so much bluer than I thought it was gonna be. - All right, let me actually get this in here. So, you know, I will say one thing. It actually is getting in between the key caps. It is getting some of that dust off. So this is a GameCube controller, that I would say is a little dusty. It's not too bad, but it's a little dusty. Now, normally I could take some compressed air or something, but I'm instead gonna goo it up. I mean, it actually is getting a lot of the little like bits and pieces. Boy, I just feel like, what a sensory experience this TEMU goo is. - [Matt] Do you think if we threw it on the wall, it would stick? (goo thuds) (Matt chuckles) - [Joanna] The answer is no. - You know what? TEMU, you're starting off right. My tech will never be less dirty in its crevices, and my balls of goo will never be the same again. - [Matt] I don't want to know about your gooey balls. (Austin chuckles) Oh. - Wow. - You kinda leaned in for it, I, you know. - This is a 4K camera UAV. Conyenient folding, with a real-time map app control and dual cameras. Now you might be familiar with a very well established company known as DJI, but I'm here to tell you, they're a scam. Yeah, you heard me right. The real winners are Cooeurins. Co, cooro, hmm, that sounds racist. - [Matt] So you continue trying it? - Coo- (Austin chuckles) It looks like a real drone. It look a little Mavic or something. We also have a controller, which I will say, while all of this looks fine on camera, I'm sure is made of the cheapest plastic known to man, but it's fine. 30 bucks. Do not fly in the extreme environment, such as hotness, coldness, strong wind or heavy rain. I always fly in hotness. (plane flutters) I would also wear the two. Okay, do I have to download the app? - [Matt] If you wanna see your amazing footage. - All right, so this is the test of what it looks like. Ah, oh no. (drone clatters) Hmm. All we got off the drone before it died, was a single wide boy photo. - [Matt] What? Well, why does it have to be a wide boy? - All right, so, TEMU, as I'm sure you're aware, is the fine purveyor of a wide variety of fashion and fashion oriented products. And while I could have bought some of those, I instead bought this stuff. I'll be right back. One moment please. (upbeat music) - [Joanna] Oh, gosh. - I'm here to steal your channel, steal your girl and slide out... with my TEMU fit. - [Joanna] Oh, no. - [Matt] I want to punch you so bad. - Well, anyway, why don't we continue right on, as soon as I remind you to please hit the subscribe button and ring-a-ling the ding-a-ling bell. TEMU Tech don't make itself, but we do, and if you enjoy this, please put me out of my misery, immediately. (upbeat music) (explosion rings) - [Joanna] Ooh, that-- - That was a great throw. I didn't wanna interrupt the majesty of this throw. This is the Smart Light Sound Machine. A health and intelligent life assistant. I'll say one thing, this is that 15 watt power adapter, which seems, uh, questionable if you're doing 15 watts via wireless charging, and pulling 10 watts via the LEDs. I'm not no math wizard or anything, but I don't think that pencil's out. I will say, due to the interesting shape, there's a little bit of-- - [Matt] Oh. - Wiggle. (Matt chuckles) - [Matt] That whole thing split open down the seam. - Let's do the easy thing. Let me see if it'll wirelessly charge first. - [AI Voice] Wireless charging. (Matt chuckles) - I'm, you know what? That's great. - [Ken] She learned words. - I need to know, that I have accurately placed my wireless charger, by it telling me verbally, every time I put my phone down and I hear the phrase... - [AI Voice] Wireless charging. - There we go. - [Matt] She's so excited about it. - I'm excited, too. (lo-fi music) - [Matt] It could be a lot worse. - I'm gonna get the app going. We're gonna evaluate this with the lighting, as well. The app also is incapable of making the RGB work. - [Matt] Well, let's try turning off the light and seeing if it's just really faint. Yes, see? See? - Oh my, are you serious? (Matt chuckles) TEMU, you may have given me $700 worth of promo codes, but that is not enough to stop me from being incredibly upset with this scam, that is this light. Did you just throw something, Matt? I didn't notice. Was there something across the table? This is the Y-598 Suspended light speaker. Okay, so, you might wonder what are we doing here? Hey. He is now magnetically floating. 18 bucks for this? I'm already kind of impressed. Like this is just a neat little lamp. Let's listen to some music, shall we? (lo-fi music) - [Matt] Yeah, are you listening to a soup can? Because that's a little tinny. - I hear something rattling. I'm not sure if it's my dude, but something in this is rattling. This little guy is cool. I don't think I would actually ever listen to the speaker, because it sounds hor-uh-bull. The way to pronounce it is like, hor-uh-bull, horrible. - [Matt] You realize we didn't have a problem with the second half of that pronunciation, right? - Yeah, but you gotta-- - [Matt] Really one key part of it that we had an issue with. (censor beeps) - You got me a gift? How lovely. What did I do to deserve this? Is this a special occasion? - Existing. - I don't wanna do that anymore. All right, let's see what we got. Oh, I forgot. This is our free gift. I forking love this. - [Matt] Fork the dishes. - I forked the dishes all the time. Look at that. Fork that dish, man. Fork it. Do you guys want to fork together? - Well, we'll need, we'll need the fork for one of these. - Oh, okay, cool. Yeah, that's fine. - Again, this is more of a gift to myself. - Okay, that's great. This is a card case for Switch. Yes, my friends. It is a little tiny toaster to store your Switch games in. Lets put a Switch game in, shall we? Oh my God, look at the time. It's Switch o'clock. - [Joanna] Oh, you have to be more gentle with the toaster-- - Oh my God, look at the time. - [Joanna] Okay. - [Matt] Speaking of Switch o'clock... - What the fork are you talking about? Oh, right. I forgot. This was only $300. Which sounds like a lot, when you consider that the Switch OLED is $350, but there's a slight downside. They listed this as a Hong Kong Switch. I don't know why that would make it cheaper. And, I don't care. I just wanna make sure that this is an authentic, legitimate Switch that works great and I saved myself 50 bucks. I could buy a whole bunch of forks for that money. Hey, was the Switch region locked? I don't think it was, right? Look at that. That's a Switch OLED right there. Did we just get a deal? This might be the beginning of a new era. Wish? I wish I never knew you. TEMU? To core moo I course. - [Matt] Someone check his face for drooping. - If this Switch OLED can play this US region game, I think we got ourselves a certified deal. Look at that, it works. Great success. I'm gonna say two thumbs up on my Switch OLED, even though you can now actually get these on sale for like 320 bucks, and this one doesn't have a warranty, and TEMU may or may not actually ever deliver your Switch OLED, but 50 bucks is 50 bucks. (package crashes) - [Joanna] Oh, not Monkey? - What, you might ask, is this big blue ball? Wait, I said what it was. - [Matt] Go ahead and give us the answer. (crew member chuckles) - I'll be right back after I do some things underneath the table. (quirky music) The circumference is increasing. - [Matt] I feel like this might just be a placebo effect, my friend. - No, no, no, no, no. I paid good money for this, on the internet. All right, my friends. Is everyone ready to gaze upon the glory of... - [Ken] Oh, my God. - My yoga peanut. (quirky music) (Joanna chuckles) I almost caught, I've caught almost nothing today. - [Matt] No, you've not almost, nothing. - So this is my Dazzle color eSports game mouse. The Guizhou G3OS. Oh yeah, that's what I ordered. Yeah, yeah boy, that's it. For the low, low price, of $7.50. Why don't we take a look at what this mouse is all about. Oh, green. It went green. RGB. Wait, is it gonna go blue? Blue. - [Matt] Blue. - Yes, I'm ready to own the noobs. It does have this sort of fake chrome. It's clearly just plastic. It's got, it's kinda like fake chrome on the side. You also do have selectable DPI's on it. Now, I will say that when it comes to buying a gaming mouse, you can get away with some pretty cheap stuff. So $7 is actually not like completely insane. I actually don't think it's that bad, though. The ergonomics are fine. Like, I thought this was gonna be a lot worse than it actually is. Okay, you just, you missed that one. All right. My Kodak portable SSD. As everyone knows, Kodak is a world renowned company from some shitty little town in New York that no one's ever heard of-- - Whoa, whoa, whoa, whoa, whoa, whoa, whoa. 585, Flower City. - How much did we pay for this 512 GB Kodak? - [Ken] $35.50. - 35 bucks for a 512 GB SSD. Let's just load up some files and see if it works, shall we? Ah, you know what? 270 megabytes per second. That's actually pretty fast. Now, would I trust it with important keepsakes? Memories? Things I really didn't wanna lose? Maybe not, but if you have a backup, and you wanted to have some relatively quick storage, I actually don't think this is terrible. This is... - [Matt] I'm gonna give you a hint. This is the whole reason you want to do this episode. - Oh, wait a minute. Is this my little, pew pew? - [Matt] Yes. - It's for ages 12 and up, what was I thinking? - [Matt] Yeah, we should definitely not give that to you. - Who wants to get (bleep)? Fixing the tail handle of the crossbow, oh, good lord. - Considering there's only like, four screws in that bag, I feel like this is not that complicated. - [Austin] You're not that complicated. - Yeah, I know. - All right, my friends, we're about to see, just how dangerous my TEMU crossbow is, in 3, 2, 1... (epic music builds) - [Ken] Whoa. - [Matt] Jeez. Oh, okay. - I broke my crossbow. All right, hit me, what we got? - [Ken] I did say. - I blinked, I blinked. So this I believe, from Paw Diary, is an amount of cheese which is gonna live in a place that I'm not sure it should. Welcome to the DualSense Cheese Edition. - [Ken] Oh my God, get the fork outta here. - One of these does not go on at all, so I'm gonna just do one, because that one really sucks. But if I just judge it based on one, it actually, it's grippy enough. I don't hate this. That's the beauty of TEMU. Sometimes you get scammed, sometimes you get ripped off, but sometimes, you discover a new sense of beauty and wonderment with the world. I want men.",
    "transcript_keywords": [
        "Switch OLED",
        "TEMU",
        "Switch",
        "TEMU Tech",
        "Tech",
        "Nintendo Switch OLED",
        "OLED",
        "Yeah",
        "today TEMU tech",
        "Whoa",
        "Nintendo Switch",
        "Hong Kong Switch",
        "put",
        "Fork",
        "Wait",
        "Teemoo Tech",
        "men",
        "dishes",
        "Boy",
        "fine"
    ],
    "transcript_entity_values": [
        "15",
        "270 megabytes",
        "35 bucks",
        "2",
        "Nintendo Switch",
        "50 bucks",
        "Dazzle",
        "DJI",
        "New York",
        "30 bucks",
        "USB SSD",
        "Kodak",
        "10",
        "first",
        "Matt] Blue",
        "35.50",
        "TEMU.com",
        "30",
        "Austin",
        "ages 12",
        "RGB",
        "GameCube",
        "1",
        "two",
        "AI Voice]",
        "512 GB SSD",
        "Eurgh",
        "Matt",
        "TEMU Tech",
        "Hong Kong",
        "15 watt",
        "Switch",
        "Monkey",
        "four",
        "Boo",
        "700",
        "512",
        "Super Clean",
        "4",
        "one",
        "Matt] Fork",
        "only $300",
        "Paw Diary",
        "Joanna",
        "the second half",
        "UAV",
        "Jello",
        "SSD",
        "7",
        "350",
        "Y-598 Suspended",
        "The Guizhou G3OS",
        "a minute",
        "Cooeurins",
        "Mavic",
        "18 bucks",
        "320 bucks",
        "One",
        "US",
        "eSports",
        "seven",
        "585",
        "100",
        "Flower City",
        "today",
        "999",
        "7.50",
        "3"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "GPE",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "MONEY",
        "PERSON",
        "MONEY",
        "PERSON",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORG",
        "GPE",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "PRODUCT",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "GPE",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL"
    ],
    "vector": [
        -0.1430339217185974,
        0.02455838769674301,
        0.017194611951708794,
        -0.08010026067495346,
        -0.0263618603348732,
        -0.07183270901441574,
        0.14338497817516327,
        0.043487247079610825,
        0.03826960176229477,
        0.05542057752609253,
        0.07383134216070175,
        -0.005729207769036293,
        0.06283311545848846,
        -0.03316836804151535,
        -0.020759284496307373,
        -0.0424840971827507,
        0.039662208408117294,
        -0.07861234247684479,
        -0.06632452458143234,
        -0.05688886716961861,
        -0.03532092273235321,
        -0.0646282285451889,
        0.009626003913581371,
        -0.03222335875034332,
        -0.025322318077087402,
        0.030416185036301613,
        -0.07287468016147614,
        -0.004826435819268227,
        -0.08358605951070786,
        -0.04427306726574898,
        -0.07725116610527039,
        0.09581033140420914,
        -0.08566136658191681,
        -0.05816752836108208,
        0.011835086159408092,
        0.00029180527781136334,
        -0.02555973455309868,
        -0.04234163090586662,
        0.025964729487895966,
        -0.06589032709598541,
        0.03705775737762451,
        -0.07284405827522278,
        -0.011510507203638554,
        0.009512744843959808,
        -0.03866906464099884,
        -0.03249291703104973,
        0.09069839119911194,
        0.01124764047563076,
        0.032509952783584595,
        0.01331473421305418,
        -0.06723567843437195,
        0.005949789192527533,
        -0.0031496593728661537,
        0.0021281184162944555,
        -0.05287545919418335,
        0.03618651255965233,
        0.09607045352458954,
        0.01857784017920494,
        0.01727866753935814,
        -0.0150137385353446,
        0.004109990317374468,
        -0.03253740072250366,
        -0.040375083684921265,
        0.04287339374423027,
        0.033529721200466156,
        -0.042278092354536057,
        -0.06681717187166214,
        0.11212027072906494,
        -0.05559026077389717,
        0.05736330896615982,
        0.13043995201587677,
        -0.00420578895136714,
        0.048391666263341904,
        0.06739886105060577,
        0.018711745738983154,
        -0.007043210789561272,
        0.10765206813812256,
        -0.08660347759723663,
        -0.011399566195905209,
        0.08483191579580307,
        -0.051704369485378265,
        -0.09587358683347702,
        -0.0255588311702013,
        -0.03394725173711777,
        -0.023955514654517174,
        -0.005732946563512087,
        -0.011595982126891613,
        -0.004767522681504488,
        0.09813158959150314,
        -0.04117199406027794,
        -0.0009238102938979864,
        0.0021521886810660362,
        -0.014910812489688396,
        -0.027743317186832428,
        0.08056587725877762,
        -0.04709799960255623,
        -0.0557401143014431,
        -0.014451584778726101,
        -0.018192194402217865,
        0.0320730060338974,
        -0.010859712958335876,
        0.04292725399136543,
        0.032043516635894775,
        -0.08223069459199905,
        0.0652371197938919,
        0.01830778643488884,
        -0.03754054754972458,
        0.09664308279752731,
        0.09947306662797928,
        0.034385595470666885,
        -0.06396216154098511,
        0.04690860956907272,
        0.017608631402254105,
        0.0019420748576521873,
        -0.04619230329990387,
        0.06070732697844505,
        -0.10309652239084244,
        0.025111420080065727,
        -0.014001092873513699,
        -0.0023885166738182306,
        0.10506065934896469,
        0.05515308678150177,
        -0.08165368437767029,
        -0.00847484078258276,
        -0.00038524993578903377,
        0.010715718381106853,
        0.0008017722284421325,
        8.119374579999704e-33,
        0.025101324543356895,
        0.12466593086719513,
        0.02221532166004181,
        0.04149366542696953,
        0.041741348803043365,
        0.052540913224220276,
        -0.015386625193059444,
        0.014864877797663212,
        -0.128122016787529,
        0.08447437733411789,
        -0.05588243901729584,
        0.0887504518032074,
        -0.025478212162852287,
        0.09424163401126862,
        0.05021362379193306,
        -0.13164886832237244,
        -0.08048558235168457,
        -0.05980194732546806,
        0.03588850423693657,
        -0.017848603427410126,
        0.013178309425711632,
        -0.0012732978211715817,
        0.003858160460367799,
        -0.014623288065195084,
        0.009629208594560623,
        0.023765452206134796,
        -0.07063287496566772,
        0.011636127717792988,
        0.07045077532529831,
        0.04361295327544212,
        -0.020093301311135292,
        0.03226562961935997,
        0.0015737393405288458,
        0.009041630662977695,
        0.03311355784535408,
        -0.029505960643291473,
        0.004087620414793491,
        -0.07631547749042511,
        0.05648510903120041,
        -0.007347957231104374,
        -0.004427084233611822,
        0.02993669919669628,
        -0.06289397925138474,
        0.03769851475954056,
        -0.06782052665948868,
        0.04013746604323387,
        0.07548340409994125,
        -0.050928957760334015,
        -0.019968487322330475,
        0.019293583929538727,
        0.007972551509737968,
        0.026602743193507195,
        -0.006146169267594814,
        0.02875089831650257,
        -0.0524083748459816,
        -0.11463437974452972,
        0.012052521109580994,
        0.0035156223457306623,
        0.06604865193367004,
        0.0007207337766885757,
        0.020892148837447166,
        -0.024755926802754402,
        0.010940504260361195,
        0.05948883667588234,
        -0.09919736534357071,
        0.013675736263394356,
        0.06773113459348679,
        0.01678588055074215,
        0.02120819315314293,
        0.031010719016194344,
        -0.0478198304772377,
        0.031555674970149994,
        -0.01112429704517126,
        -0.053816135972738266,
        0.04113565385341644,
        0.03323068469762802,
        0.02473200112581253,
        -0.02769451029598713,
        0.03445904701948166,
        -0.026751892641186714,
        0.01753653958439827,
        -0.05241500586271286,
        0.023106910288333893,
        -0.028875524178147316,
        0.03981246054172516,
        0.02045959234237671,
        -0.037458840757608414,
        -0.05482685938477516,
        0.06117189675569534,
        -0.030650295317173004,
        -0.06360085308551788,
        -0.0057194116525352,
        -0.019518554210662842,
        0.011072017252445221,
        -0.052655305713415146,
        -9.069860944975374e-33,
        -0.02818308025598526,
        -0.036797601729631424,
        0.002802936127409339,
        0.04368896037340164,
        0.005751094315201044,
        -0.06035808473825455,
        -0.025461476296186447,
        0.0016622195253148675,
        0.04412965476512909,
        -0.009207986295223236,
        -0.014240956865251064,
        0.024453485384583473,
        -0.006867240648716688,
        -0.033655475825071335,
        0.0315382219851017,
        -0.08168496936559677,
        0.05609695613384247,
        -0.010312364436686039,
        -0.020168906077742577,
        -0.1013554260134697,
        0.03756905719637871,
        0.016446024179458618,
        -0.05808689445257187,
        0.01857534795999527,
        -0.060215845704078674,
        0.0582127571105957,
        -0.037847213447093964,
        -0.013725991360843182,
        0.07811819016933441,
        0.02918018400669098,
        0.001166468602605164,
        -0.1011652797460556,
        -0.02577320858836174,
        0.08802582323551178,
        0.04044538363814354,
        0.07389206439256668,
        0.06572185456752777,
        -0.019376607611775398,
        0.017189186066389084,
        -0.04350477457046509,
        0.09734255820512772,
        -0.039154618978500366,
        -0.01649380847811699,
        -0.008780848234891891,
        -0.0645253136754036,
        -0.09319205582141876,
        -0.04094675928354263,
        -0.04718692973256111,
        -0.00997194554656744,
        0.04922958090901375,
        0.06665695458650589,
        0.004116428084671497,
        0.02944977395236492,
        -0.00990633200854063,
        -0.06569696217775345,
        -0.015995291993021965,
        0.02960730716586113,
        -0.035420991480350494,
        -0.04126421734690666,
        -0.001944341347552836,
        0.050803836435079575,
        0.024814385920763016,
        -0.04819503426551819,
        0.039124224334955215,
        0.004297005012631416,
        -0.005587567575275898,
        0.09639377146959305,
        0.019033389165997505,
        -0.008097229525446892,
        -0.0530807301402092,
        -0.029632579535245895,
        0.02203975059092045,
        -0.02625252678990364,
        -0.13004694879055023,
        -0.012364973314106464,
        0.05476149916648865,
        -0.042884841561317444,
        0.013631302863359451,
        0.03867257758975029,
        -0.022084210067987442,
        0.021466322243213654,
        -0.001391097903251648,
        0.09591780602931976,
        -0.0019570125732570887,
        0.020019587129354477,
        0.09767479449510574,
        -0.046804603189229965,
        0.012755220755934715,
        0.055111270397901535,
        -0.022586094215512276,
        -0.04217178001999855,
        -0.07274103164672852,
        0.08415339142084122,
        0.07070508599281311,
        0.027966806665062904,
        -6.568137678186758e-08,
        0.01821405626833439,
        0.007379147689789534,
        0.007882661186158657,
        0.07922982424497604,
        0.057325541973114014,
        -0.019163886085152626,
        0.0187855027616024,
        0.05117001757025719,
        -0.005339766386896372,
        0.010737769305706024,
        0.0779263824224472,
        0.036003805696964264,
        -0.10597692430019379,
        -0.016842292621731758,
        0.09108489751815796,
        0.026955511420965195,
        -0.08987660706043243,
        -0.031048595905303955,
        -0.022306064143776894,
        -0.052734505385160446,
        -0.012743396684527397,
        0.02936454303562641,
        0.06868194788694382,
        -0.050993263721466064,
        -0.12349321693181992,
        0.05325630307197571,
        0.010066661983728409,
        0.10811986029148102,
        0.029281988739967346,
        0.008643679320812225,
        -0.08014366030693054,
        -0.10243980586528778,
        -0.08977299928665161,
        0.013976956717669964,
        -0.02477297931909561,
        -0.08290784060955048,
        -0.03041767328977585,
        -0.02881884202361107,
        -0.0007897146278992295,
        0.05214579030871391,
        -0.02143506146967411,
        -0.0293283574283123,
        -0.009072157554328442,
        0.04731146618723869,
        -0.07787325978279114,
        0.007908912375569344,
        -0.07279068231582642,
        -0.024307701736688614,
        0.029728751629590988,
        -0.022164853289723396,
        -0.05223613232374191,
        -9.09343725652434e-06,
        -0.013893465511500835,
        0.031043238937854767,
        -0.014441726729273796,
        -0.0043988884426653385,
        -0.03138188645243645,
        0.007596127223223448,
        -0.022137057036161423,
        0.0130552276968956,
        0.028041167184710503,
        -0.08198162168264389,
        -0.08183208853006363,
        -0.0017033735057339072
    ]
}