{
    "id": "f1fgzBE2Ffk",
    "title": "The Not-So-Secret Secret Elevators of the Haunted Mansion",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2018-06-25T13:58:29Z",
    "video_url": "https://www.youtube.com/watch?v=f1fgzBE2Ffk",
    "category": "Science & Technology",
    "tags": [
        "haunted mansion",
        "disneyland",
        "imagineering",
        "stretching room",
        "portrair gallery",
        "illusions",
        "magic",
        "magic kingdom",
        "walt disney",
        "museum of the weird",
        "elevator"
    ],
    "views": 1737558,
    "likes": 41853,
    "comments_count": 1710,
    "description": "You can support this channel on Patreon!  Link below      Is this haunted room actually stretching?  The answer may surprise you!  (barf) The stretching rooms at the Haunted Mansion are perhaps my favorite piece of hidden engineering at the Disney Parks.  While only the Anaheim and Paris versions function in the fashion described in this video, it is still a neat effect regardless of how its done.  Technology Connections on Twitter:   This video of the ride, taken with an EXCELLENT low light camera, will give you a great sense of what the ride is like for those who have never been.  It's delightfully campy, which is part of its enduring charm.   Worlds Largest Elevator   A video where capacity is revealed:  (and this shows the stretching room reset)   A different video of the stretching room reset:   Two GREAT links about the Haunted Mansions history:   ^^^^That one has images of its construction (This website also provided the source for the blueprint in the thumbnail)  There are some diagrams in this source that might be helpful:     You can support this channel on Patreon!  Patrons of the channel are what keep these videos coming.  If youre interested in supporting that channel as well, please check out my Patreon page.  Thanks for your consideration!   And thank you to the following Patrons!  (continued from the last video) Richard Lindsey, Lars JJ, Patrick Musson, Matt Taylor, Johan Schoeman, Thomas Jew, Josef Citrine, Marcus Schwartz, Ryan Cozzubbo, Christopher Bassett, Julian Rapoport, Ed Hall, Jason Portwood, Jesse Cardone, Michael Snowden, Drew McClain, Boh00711, Jon-Andr Haraldstad, The8TrackKid, Daniel J Schless, Sebi Jecklin, Casey Kikendall, Craig Leverenz, Charlie Hankin, Andres Plaza, Revenge, Matthew Baron, Andr, Gerald Monaco, Tab Patterson, Jason Weathered, h.drew foy, Roger Beal, Gantradies, Chris Hartl, Steve Stone, Brian G. Shacklett, Colton Aubrey Hooke, Paul Mills, Christopher Luna, Kotanu, Brendan Terrett, Techmoan, Mike Mason, Elijah Reeds, Christopher Jett, Justin Talbot, Steven Metcalf, Verysofisticated, Lolucoca, John McLusky, Ashleigh R, Stephen Bell, Logan Beenken, Eric Wood, Stephen Pick, BlancoGrande, Matthew Giraitis, James Ryan, Robert Joscelyne, Ellis M. Eisen, Francis Fisher, Kedar Deshpande, Lukas Komischke, Dave Anderson, Felix Freiberger, Dane Peterson, Brent LaRowe, Aerospyke, Kieran Cox, Hunter Schwisow, Logan Kriete, Rafa Wiosna, Adam D. Ruppe, Audin Malmin, Eric Hansen, Noah McCann, Jason R Scheuren, Rufo Sanchez, The War Academy, Yaniv, neko, Daniel Ch, Lee Wallbank, Grayson Lang, Neil Bronner, Carl Yazbek, Jeffrey Grajkowski, Christopher Splinter, Eric Merrill, Stefan Berndtsson, Michael Sims, Seth Kneller, Clint Eisinger, Jesse G. Donat, Christopher Leidich, Mike Friedman, Svante, Andr Waage Srensen, Ed McCloskey, Philip Daniel, Jasper Thun, Camilo Rodrigues, Dusan Dzelebdzic, Sam Douglas, Sam Redfern, MagicMatteo, Sen, mark barratt, Tully, Violet Moon, Duncan Ward, Tobias Faller, Justin Smith, Corey A Hudson, EpicLPer, Luc Ritchie, Michael Dragone, Manfred Farris, Eric Romero, John Laur, Patric Bates, Sven Almgren, Lutz Broska, Jrgen Kieser, Luke ODell, Nicholas, Ewen McNeill, thefanification, Nicolas, Albin Flyckt, Michael A Kalfas II, Michael Bernstein, Kevin Kostka, Shame Zamora, Brad Wilmot, John Bailey, Alex Ilyin, Miles H, Deovandski Skibinski Junior, Andrew \"FastLizard4\" Adams, Avi Drissman",
    "description_links": [
        "https://twitter.com/TechConnectify",
        "https://www.youtube.com/watch?v=RXO8rt92BIA",
        "https://www.zdnet.com/article/mitsubishi-installs-worlds-largest-elevator-in-japan-80-passengers-per-car/",
        "https://www.youtube.com/watch?v=D6y4WIjw18Y",
        "https://www.youtube.com/watch?v=LPiiY1aRqH8",
        "https://longforgottenhauntedmansion.blogspot.com/2011/07/",
        "https://longforgottenhauntedmansion.blogspot.com/2013/01/does-size-matter.html",
        "http://stason.org/TULARC/entertainment/disney-haunted-mansion/6-Do-the-ceilings-go-up-or-do-the-floors-go-down-in-the-str.html",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "And now for something completely different When hinges creak in doorless chambers, and strange and frightening sounds echo through the halls. Whenever candle lights flicker where the air is deathly still. That is the time when ghosts are present. Practicing their terror with ghoulish delight. The Haunted Mansion is a beloved attraction found at Disney parks around the world. The original version of the attraction opened on August 9, 1969 at Disneyland in Anaheim, California. Now, lest you worry that Im getting all Disney-nerd on you here and am ignoring the channels focus on technology--well I assure you were talking about a very clever bit of engineering that seems somewhat of an open secret and yet no one really talks about. That, foolish mortals, is the stretching room. All versions of the Haunted Mansion, except for Mystic Manor in Hong Kong, begin with a pre-show in a portrait gallery. GHOST HOST: [Our tour begins here in this gallery, where you see paintings of some of our guests as they appeared in their corruptible, mortal state.] This large octagonal room is lit dimly on all sides, and features 4 portraits. After asking you to kindly step all the way in please to make room for everyone, our Ghost Host reminds us that-- [theres no turning back now.] As you look back towards the door you entered, you notice that it is closing. And as soon as its closed, our Ghost Host makes the following observation: [Your cadaverous pallor betrays an aura of foreboding, almost as though you sense a disquieting metamorphosis.] As you look around the room, you notice that the ceiling is getting farther and farther away from you, and the portraits themselves are growing taller, revealing the humorous downfalls of their subjects. GHOST HOST: [Is this haunted room actually stretching?] Yes. Yes it is. And for very good reason. The stretching room does not exist simply to serve as an intriguing pre-show to the ride. Its original purpose is actually quite a bit more functional. You see, the stretching rooms at Disneyland (there are actually 2 of them) arent just an illusion. In fact, they are perhaps the worlds most elaborate and unique elevators, or lifts. Once the doors have closed, you may notice a very slight movement. The stretching room floor is beginning to descend. It moves very slowly which makes it hard to notice. Id say it feels like little more than a tremble in the floor. The ceiling of the stretching room, on the other hand, does not move, instead you are descending farther away from it. But why does this need to happen? Well, Disney has always had an obsession with sightlines and illusion. When you are walking along the Rivers of America and see the Haunted Mansion, you see a quaint antebellum structure that cant possibly contain the attraction itself. If youre unfamiliar with the ride, its an omnimover system where you travel through many elaborate show scenes, including the massive graveyard scene. Theres no possible way that that attraction is in that little building, and its not. All of the ride takes place in a separate show building on the other side of the railroad tracks. The Disneyland Railroad sort of defines the boundaries of the park, at least the boundaries of what guests are supposed to see. Its built on a berm, and with the aid of trees and shrubbery, guests inside the park generally cannot see anything outside of the railroad perimeter. While great for immersion, the railroad sort of encapsulates the park and means that any expansion must be done outside its boundaries. If you look at satellite imagery of the park, you can see the mansion itself and the railroad immediately behind it. Its a little hard to see, but it is following this curved path through New Orleans Square, behind the mansion, through Splash Mountain, and then you can see the tracks again here in Critter Country. Youll notice that the railroad slips between the mansions facade and another building. That large warehouse-like building is where the actual ride of the Haunted Mansion takes place. Now when youre waiting in line, you have no idea that that building is even there. You can even see the area behind the mansion, and as far as you know theres no connection between the mansion facade and the show building out of view to the left. Somehow you as a guest need to get from this side of the railroad to the other, and yet theres no apparent path to take. Thats because the path you take is a tunnel heading under the railroad tracks and into the show building. Somehow guests need to be brought fairly far underground to the level of that tunnel. One fairly seamless way to do so is to use an elevator and lower guests into the ground, just like you would a casket. But that might ruin the illusion that youre in the mansion itself. And so the stretching room was born. Now for those that hate it when someone spoils the magic, the following is my best guess at how this effect is done in Anaheim. There are some blueprints you can find online and there are some other explanations, and what follows is my most complete amalgamation of these sources and my best understanding of whats going on. I may not be completely correct, and please chime in below if Ive gotten something wrong, but just know that Ill be spoiling this beloved scene. When you enter the stretching room, pay close attention to the gap in the floor. This is pretty much the only sign that you are boarding an elevator. Once inside, well thats when things get weird. The stretching room is simply a large, octagonal hydraulic elevator with a very elaborate cab. The floor sits atop the piston of a hydraulic cylinder, and when fluid is released the floor descends. The walls are stacked, sort of like a telescoping antenna, and are key to the illusion. The stretching rooms at the Haunted Mansion are perhaps the only elevators in regular passenger service that dont really have a ceiling. The wood paneled walls that lie below the portraits are able to slip behind the upper half of the stretching room. The cornice that the gargoyles sit atop is attached to the wallpapered portion and hides the gap between the two. As the stretching room stretches, only the false ceiling is stationary. Everything else is moving. You yourself, in the bottom half of the stretching room, are descending at full speed. The top half descends at only half speed, and as it does so it stretches the portraits. The tops of the portraits remain next to the stationary ceiling, but the bottom is being pulled down by the gargoyles. Only when the portraits are fully extended do their tops pull away from the ceiling. Having been transfixed by the illusion, you may not have noticed what our ghost host is about to tell us: [This chamber has no windows, and no doors. (sinister laughter) Which offers you this chilling challenge; to find a way out! (tormented cackling) ] In perhaps the most grim, un-Disney like fashion, our Ghost Host informs us that his way out of this chamber? Well, exit by hanging. [Of course, theres always my way.] (Thunderclap) The lights go out, and the ceiling (which is really a cloth scrim) disappears to reveal the skeleton of our host dangling by a noose. (Screaming, followed by a crashing noise) Thats right, its the happiest place on Earth. Anyway, that thunderclap is timed with the stopping of the elevator which again makes it very hard to notice, and once the lights come back on, a second door opens revealing the path to the ride. Its at this point that you are in a tunnel walking under the railroad tracks. What makes this illusion so disorienting and hard to nail down is the use of vertical stripes in both the wallpaper and the wood paneling. This is very effective at hiding the fact that the walls are moving. The only really obvious thing is that the paintings are being unrolled as you can clearly see the curve at the bottom. But everything else is really, really difficult to grasp. Unfortunately, the wallpaper tends to get damaged over time, but the upside is that it reveals whats happening. You can see that the walls are descending away from the ceiling because you have this point you can focus on. This also reveals that the portraits are on a separate piece thats not yet moving --otherwise they wouldnt stretch-- but once theyre extended, they too descend with the wall on either side. To hopefully help illustrate whats happening, I made this little mockup in tinkercad. The yellow octagon is representing the stationary ceiling scrim. Notice that the walls are both extended above the ceiling. Now, unfortunately I cant make this move smoothly like it should, but I can move it in steps. You stand in the brown portion, and both it and the upper tan portion descend together, but for every length you drop, the tan walls fall half as much. The combination of an enclosed space, the vertical design elements, and the dim lighting almost perfectly disguise the fact that youre only here because you need to descend into the basement. Now, its very hard to see on video because, well, its hard to convey scale this way, but the stretching rooms at Disneyland stretch a TON. The room becomes much, much taller, almost to a frightening degree. That is after all kind of the goal, it disorients you, makes you feel small, and in general is just sort of creepy. By the time the stretching is done, youve descended almost 2 stories into the ground. The blueprints I found, linked below, suggest the descent is a little over 18 feet. A somewhat humorous side-effect of the scale involved here is that the doors to the chamber are comically large. The low light makes them near impossible to see on video, but the doors themselves are probably around 15, maybe even 20 feet tall. After all, they got almost 10 feet longer during the stretch. Going back to our model, you can see that even the entry door must be as large as the exit, even though the actual opening from the foyer is no larger than your average door. What I love most about the stretching rooms is that they were born out of necessity. The imagineers could have chosen any number of ways to get guests under the railroad tracks, but they went with this. And that my friends, I think, is just beyond cool. The stretching room effect is so well liked that it was copied for future iterations of the attraction. However, except for the Phantom Manor at Disneyland Paris, the other versions of the stretching room are not elevators. Specifically at the Magic Kingdom in Orlando, the park was designed without space constraints and the entire attraction is within the boundaries of the railroad. There was no need to move guests underground, but the stretching room was still replicated. In these versions, the ceiling simply moves up and away from you. One unfortunate side-effect of going this route is that the scrim tends to visibly move when the ceiling stops, which somewhat ruins the illusion. And Im pretty sure it doesnt stretch quite so much as the Disneyland version. And now for some trivia. I had a hunch that the stretching rooms at Disneyland may very well be the worlds largest passenger elevators. To satisfy my curiosity, I googled worlds largest elevator, which is actually for boats at the Three Gorges Dam in China, but I sad Passenger Elevator, and found that to supposedly be in Japan. This elevator carries 80 passengers and its floorspace is 11.15 feet by 9.2 feet. That would give it an area of 102.58 square feet. That seemed a lot smaller than the stretching rooms, and to assure myself I wasnt wrong, I used my friend Google to find the area of an octagon with sides of 6 feet, which seemed about right. That would be 173 square feet! Thats much bigger. But I wanted to find out how many people could fit, and thanks to the wonders of YouTube, someone was able to ride the stretching room back up, and the cast member told them that the elevator is only strong enough to bring 12 people up, but it can handle bringing 90 people down. 90 is bigger than 80, so ladies and gentlemen I do declare that the worlds largest passenger elevator by both size and capacity is not in Japan, but rather is at Disneyland. At least when going down. Apparently riding the stretching room back up isnt that out of the ordinary--guests in wheelchairs often go this route to exit the attraction. Although the attraction didnt open until 1969, after Walt Disneys death, the mansion facade was built years earlier. One source, linked below, says that the mansion itself was completed by 1964, and that the stretching rooms were built with the facade. The attraction was originally conceived as a walk-through attraction, and although Walt Disney died in 1966, nearly three years before the attraction eventually opened, he may very well have seen the stretching rooms. However, other sources disagree, so well call that a firm maybe. The really awesome link down below has pictures from 1964, showing the backside of the mansion and the tunnels under the railroad. I highly encourage poking around down there if youre interested. And Id like to leave the video by giving credit where credit is due for the existence of this attraction. There are lots of great links down below if youd like to learn a little more about the history of the Haunted Mansion, but specifically for the stretching room, we have Rolly Crump to thank for its concept, Claude Coats for his woodworking skill, and Yale Gracey who made the mechanics. And the Ghost Host was voiced by the legendary Paul Frees. Thanks for watching, I hope you enjoyed this look into the fascinating stretching rooms of the Haunted Mansion. A few months ago I made a different theme park-related video about blocking systems in roller coasters, so if you havent seen that and are looking for something else to watch, look for it in the end screen. Of course, thank you to everyone who supports this channel on Patreon! Patrons of the channel have made a huge difference for the future of this channel, and starting this week its officially my full-time job. Thank you for making that possible. If youre interested in supporting the channel as well, please check out my Patreon page. Thanks for your consideration, and Ill see you next time! GHOST HOST: [Our tour begins here in this gallery, where you see paintings of some of our guests as they appeared in their corruptible, mortal state.] CAST MEMBER: [Ladies and Gentlemen please step away from the walls to the dead center of the room.] WOKE DUDE: Dead. Center.",
    "transcript_keywords": [
        "stretching room",
        "Haunted Mansion",
        "stretching",
        "GHOST HOST",
        "room",
        "Mansion",
        "stretching room back",
        "rooms",
        "railroad",
        "stretching room floor",
        "GHOST",
        "ceiling",
        "attraction",
        "HOST",
        "Disneyland",
        "Haunted",
        "elevator",
        "Ghost Host makes",
        "stretching room stretches",
        "stretching room effect"
    ],
    "transcript_entity_values": [
        "almost 2",
        "Disney",
        "Anaheim",
        "Mystic Manor",
        "the Rivers of America",
        "half",
        "Splash Mountain",
        "The Haunted Mansion",
        "New Orleans Square",
        "only half",
        "this week",
        "nearly three years",
        "two",
        "China",
        "Orlando",
        "9.2 feet",
        "102.58 square feet",
        "the Three Gorges Dam",
        "Walt Disney",
        "2",
        "Patreon",
        "Disneyland Railroad",
        "YouTube",
        "Japan",
        "80",
        "6 feet",
        "12",
        "Disneyland",
        "Walt Disneys",
        "Google",
        "California",
        "Disneyland Paris",
        "1964",
        "4",
        "the Magic Kingdom",
        "90",
        "almost 10 feet",
        "1966",
        "Paul Frees",
        "Earth",
        "Claude Coats",
        "Yale Gracey",
        "One",
        "the Haunted Mansion",
        "11.15 feet",
        "the Phantom Manor",
        "173 square feet",
        "Rolly Crump",
        "un-Disney",
        "second",
        "20 feet",
        "1969",
        "A few months ago",
        "Hong Kong",
        "August 9, 1969"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "GPE",
        "LOC",
        "LOC",
        "CARDINAL",
        "ORG",
        "ORG",
        "LOC",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "GPE",
        "GPE",
        "QUANTITY",
        "QUANTITY",
        "FAC",
        "PERSON",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "FAC",
        "PERSON",
        "ORG",
        "GPE",
        "FAC",
        "DATE",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "PERSON",
        "LOC",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "FAC",
        "QUANTITY",
        "FAC",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "GPE",
        "DATE"
    ],
    "vector": [
        -0.002038193866610527,
        -0.06129109114408493,
        0.0320204459130764,
        -0.02268671989440918,
        -0.004039007239043713,
        -0.03211762383580208,
        -0.046679187566041946,
        -0.0497623011469841,
        -0.038573842495679855,
        -0.03412443399429321,
        -0.004551047924906015,
        0.06425006687641144,
        0.014634230174124241,
        -0.04949843883514404,
        0.0016086467076092958,
        -0.011452224105596542,
        0.0083028394728899,
        0.05322132259607315,
        -0.049108054488897324,
        0.008334639482200146,
        0.050692733377218246,
        -0.08825957775115967,
        0.04081755876541138,
        0.02761090360581875,
        -0.0615285262465477,
        -0.04231098294258118,
        -0.03841947019100189,
        0.04085196927189827,
        0.013902843929827213,
        -0.10306158661842346,
        -0.005763274617493153,
        0.024400826543569565,
        -0.06822565197944641,
        -0.051451534032821655,
        0.029475942254066467,
        0.036045413464307785,
        0.03856630623340607,
        -0.030689332634210587,
        -0.056784968823194504,
        -0.018036624416708946,
        -0.016800859943032265,
        -0.0008750832639634609,
        0.08076612651348114,
        -0.0022088258992880583,
        -0.0926596000790596,
        0.02639726549386978,
        0.04151616990566254,
        -0.09038426727056503,
        -0.021398330107331276,
        -0.0765484943985939,
        0.01599418744444847,
        0.08057224750518799,
        0.08401476591825485,
        0.04131632298231125,
        -0.10805930197238922,
        0.07402204722166061,
        0.022914614528417587,
        -0.0272125955671072,
        0.035146258771419525,
        -0.020524024963378906,
        0.1251392513513565,
        0.0074204388074576855,
        -0.033973969519138336,
        0.014605865813791752,
        -0.009473987855017185,
        0.01625848188996315,
        0.006620950065553188,
        0.0045909034088253975,
        0.05164310336112976,
        -0.10667724907398224,
        -0.0660974383354187,
        -0.019981496036052704,
        0.044139157980680466,
        -0.005930866114795208,
        0.04826280102133751,
        -0.02232232317328453,
        0.024549689143896103,
        -0.030919911339879036,
        -0.016203099861741066,
        0.0358954556286335,
        0.056590501219034195,
        -0.08583439886569977,
        0.03990068659186363,
        0.0038975428324192762,
        0.002695927396416664,
        0.008489971980452538,
        -0.007521478459239006,
        -0.001363813760690391,
        -0.06531693041324615,
        0.0609065480530262,
        -0.036387596279382706,
        -0.03167669475078583,
        -0.11067842692136765,
        0.016141438856720924,
        0.026657486334443092,
        -0.02050543949007988,
        -0.13890117406845093,
        -0.03794486075639725,
        -0.049614861607551575,
        0.0179875660687685,
        -0.014684619382023811,
        0.07113736122846603,
        0.11211589723825455,
        -0.0498095341026783,
        -0.03426495939493179,
        -0.0508449524641037,
        -0.020811235532164574,
        0.07292154431343079,
        0.08200795948505402,
        0.0406590960919857,
        -0.06013960391283035,
        0.013775871135294437,
        0.014228325337171555,
        -0.006968228612095118,
        -0.007023583631962538,
        -0.0029602234717458487,
        0.03372250869870186,
        -0.023792177438735962,
        -0.003816499374806881,
        0.009731163270771503,
        0.1304272562265396,
        0.014695784077048302,
        0.08025320619344711,
        0.001648906385526061,
        0.018063945695757866,
        0.0028782773297280073,
        -0.01097707450389862,
        1.7906536871526224e-33,
        -0.02890206314623356,
        0.10425178706645966,
        -0.003471976611763239,
        0.030641252174973488,
        0.0817437693476677,
        0.011614528484642506,
        -0.09534762799739838,
        0.0485532246530056,
        -0.0003700263041537255,
        0.07688135653734207,
        0.025396186858415604,
        0.026171203702688217,
        -0.05735088884830475,
        -0.007253613322973251,
        0.045553527772426605,
        -0.00522078201174736,
        -0.07721002399921417,
        -0.019479965791106224,
        -0.015202534385025501,
        -0.027146831154823303,
        0.03176883980631828,
        0.08227909356355667,
        0.04649408906698227,
        0.027056004852056503,
        0.05506673455238342,
        -0.06654909998178482,
        -0.015260796993970871,
        0.022558800876140594,
        -0.023147210478782654,
        0.02918706089258194,
        -0.04289469122886658,
        -0.011497033759951591,
        -0.03824469447135925,
        -0.0012604983057826757,
        0.0031900457106530666,
        -0.03868518024682999,
        0.011586399748921394,
        -0.11270656436681747,
        -0.0435696542263031,
        -0.02171465940773487,
        0.03406192734837532,
        -0.025074221193790436,
        -0.008173661306500435,
        0.011352158151566982,
        -0.02635117992758751,
        0.03961591422557831,
        0.12009043991565704,
        0.004246782977133989,
        -0.014175180345773697,
        0.10257460176944733,
        0.03095737099647522,
        0.01109121460467577,
        -0.09381607174873352,
        -0.08185023814439774,
        0.014767324551939964,
        -0.04518626630306244,
        0.05519561097025871,
        -0.07235756516456604,
        0.06737478822469711,
        0.001834405935369432,
        -0.04172142595052719,
        -0.002444059122353792,
        0.03399236500263214,
        -0.006978627759963274,
        -0.03505561873316765,
        0.01732848957180977,
        0.02168562263250351,
        0.025940628722310066,
        0.04441303759813309,
        0.014616451226174831,
        -0.11917313188314438,
        -0.02842220664024353,
        -0.0021981261670589447,
        -0.04147442430257797,
        -0.020201610401272774,
        0.02511700615286827,
        -0.12259046733379364,
        0.04078102111816406,
        0.010804637335240841,
        0.03704456984996796,
        -0.020792627707123756,
        -0.0018606187077239156,
        0.08195119351148605,
        0.12679752707481384,
        0.10794658958911896,
        -0.02810528688132763,
        0.03743124008178711,
        -0.03135048225522041,
        -0.03709012642502785,
        -0.0044815437868237495,
        -0.008185016922652721,
        -0.012236613780260086,
        0.06277024000883102,
        0.029990876093506813,
        0.014874402433633804,
        -3.506899683924148e-33,
        -0.009769411757588387,
        -0.011636878363788128,
        -0.05707434192299843,
        -0.04817452281713486,
        0.07241992652416229,
        -0.08867054432630539,
        -0.06818579137325287,
        0.019640902057290077,
        0.04267759248614311,
        -0.060987312346696854,
        -0.03886169195175171,
        -0.02156538888812065,
        0.025791458785533905,
        0.0018256651237607002,
        -0.002668169792741537,
        -0.054534200578927994,
        0.10614539682865143,
        -0.04058248922228813,
        -0.03546488657593727,
        0.05345408618450165,
        0.09842006862163544,
        0.03600085526704788,
        -0.10017718374729156,
        0.024808628484606743,
        0.049020808190107346,
        0.02216772362589836,
        0.035745203495025635,
        0.04932508245110512,
        0.07464931905269623,
        0.024968253448605537,
        -0.07355446368455887,
        0.05009467154741287,
        0.04173992574214935,
        0.017463568598031998,
        -0.005917105823755264,
        0.022405141964554787,
        0.05648229271173477,
        0.02543562464416027,
        -0.05354303866624832,
        -0.10301490873098373,
        0.034090712666511536,
        0.07079068571329117,
        -0.010246475227177143,
        -0.028699081391096115,
        -0.012057111598551273,
        0.011143398471176624,
        -0.039211761206388474,
        -0.04415073245763779,
        -0.12469684332609177,
        0.01507214643061161,
        0.015054536052048206,
        0.04970218241214752,
        -0.016907328739762306,
        -0.05239217355847359,
        0.018470045179128647,
        -0.00877455249428749,
        -0.05358463153243065,
        -0.0075714425183832645,
        0.06161918491125107,
        0.040343597531318665,
        -0.014220171608030796,
        0.01934983767569065,
        -0.06930375099182129,
        -0.00933495257049799,
        0.001207605004310608,
        -0.013913382776081562,
        0.01220120582729578,
        -0.027680980041623116,
        -0.14392682909965515,
        0.011392631568014622,
        0.04030328243970871,
        -0.007802130188792944,
        0.01847410388290882,
        0.03984405845403671,
        -0.02726076729595661,
        -0.015594854019582272,
        0.10112664848566055,
        -0.04779278486967087,
        0.045194994658231735,
        -0.0358717106282711,
        -0.05780291184782982,
        -0.0748482495546341,
        0.02655874378979206,
        -0.05210484191775322,
        0.0506628192961216,
        0.10812140256166458,
        -0.01603843830525875,
        0.08715996891260147,
        -0.008586282841861248,
        0.025471210479736328,
        0.026873048394918442,
        0.08217891305685043,
        -0.06976626068353653,
        -0.02801886573433876,
        0.07420849800109863,
        -5.893567589509985e-08,
        -0.026285091415047646,
        0.017913687974214554,
        -0.011536169797182083,
        -0.09048957377672195,
        0.010121344588696957,
        -0.026421543210744858,
        0.11620407551527023,
        0.08399862051010132,
        -0.06151565909385681,
        -0.041803132742643356,
        0.06404490768909454,
        0.10830467939376831,
        0.04064489156007767,
        0.08163125067949295,
        -0.015810275450348854,
        0.01717260107398033,
        -0.1252267211675644,
        0.018084770068526268,
        -0.07429587095975876,
        0.044865790754556656,
        -0.016684064641594887,
        -0.029318423941731453,
        0.07122217863798141,
        0.0005246287328191102,
        0.006249150261282921,
        -0.035143930464982986,
        -0.05311611667275429,
        -0.041645586490631104,
        0.042247820645570755,
        -0.08387383818626404,
        -0.0017017934005707502,
        -0.04570133239030838,
        0.005378320813179016,
        -0.06728711724281311,
        -0.0895041897892952,
        0.03650137782096863,
        0.02412812039256096,
        -0.005800496321171522,
        -0.019948413595557213,
        -0.00010729674977483228,
        0.01447848230600357,
        -0.18232925236225128,
        0.021172044798731804,
        0.03867127001285553,
        0.034975674003362656,
        0.026552839204669,
        0.016225719824433327,
        0.00981796532869339,
        0.019318772479891777,
        -0.0007822862826287746,
        -0.05690736696124077,
        0.026836995035409927,
        -0.049890559166669846,
        0.035100363194942474,
        0.08923317492008209,
        -0.006563004106283188,
        -0.04401364177465439,
        0.055512480437755585,
        -0.012593163177371025,
        -0.0033943450544029474,
        0.02530756965279579,
        0.02763885259628296,
        -0.06707010418176651,
        0.012047738768160343
    ]
}