{
    "id": "f3DfJxvkN-8",
    "title": "AirPods Pro 2 Review: 1 Underrated Thing!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-09-27T16:31:09Z",
    "video_url": "https://www.youtube.com/watch?v=f3DfJxvkN-8",
    "category": "Science & Technology",
    "tags": [
        "AirPods Pro",
        "AirPods",
        "AirPods Pro 2",
        "AirPods 2",
        "AirPods Pro 2 review",
        "AirPods MKBHD",
        "MKBHD",
        "AirPods Pro MKBHD",
        "new AirPods",
        "adaptive transparency",
        "transparency mode",
        "AirPods Pro vs",
        "AirPods Pro 2 vs"
    ],
    "views": 7746811,
    "likes": 231293,
    "comments_count": 7692,
    "description": "AirPods Pro take computational audio to the limits, which makes them hard to review, but great to listen to  The water bottle:   Get a dbrand grip case for your Apple AirPods Pro at   Grab yourself an Apple AirPods Pro 2 at  Check out Bose's new QuietComfort II Earbuds at  Check out the Sony WF-1000XM4 at  Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   Headphones provided by Apple for review.  ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://dbrand.com/airpods",
        "https://geni.us/dCEfCC",
        "https://geni.us/R0ft",
        "https://geni.us/pQzAB",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(gentle electric music begins) - All right, I'll be honest. I wasn't even planning on reviewing these. You know? It's Tech-tember. There's a lotta stuff going on right now. There's other videos on other tech that we're actively working on. That's coming soon that you'll see. So we saw the new AirPods announcement in the keynote and a couple new features, and then Apple sent over a pair. It's got my Memoji on it and everything. I was like, \"That's cute,\" but I promise you I didn't even take it out the box for a few days, 'cause I was so busy working on some of the other stuff. But then, I did take it out the box, and I did try them. (case clicking) And I gotta say, I am now very convinced that these are really good, but not by what you think. So there's a lot of small new features here that AirPods people have been waiting for a long time. On the surface, it's still in a nearly identical design. You recognize 'em from a mile away. The only way you can tell them apart from the last AirPods Pro, visually, is by these dual vents at the top. But on the inside, there is an entirely new driver and amplifier, and these AirPods do sound dramatically better than the last ones. Easily, the best sounding earbuds Apple's ever made. There are way more lows and mids so if you listen to hip hop or just music with a lotta bass, it's very noticeable, it just way better. And there's also very little high volume distortion and the whole sound profile is very responsive and crisp. They sound good, like really good EarPods now. There still is no lossless audio with these, but it's still 16 bit/48 kilohertz audio and that is good, but that wasn't the thing that convinced me. It was a difference maker for sure. It's really nice, but that's not the thing. These do now have a 33% longer battery life. So it's six hours on a single charge now with noise cancellation on, and up to 30 total hours with the battery in the case. I promise you, I'll never have earbuds in for six hours straight. So this was more than enough for me, but it wasn't what impressed me either. There is also a new extra small ear tip. So now it comes with the mediums installed by default, and then there's two sizes smaller and one larger size. So if you have smaller ears that the previous AirPods didn't quite work with, these may make a difference for you, with the extra small ear tip. As you can imagine, that's not me, mediums all the way, but some maybe even tempted to say that the new case is the biggest upgrade. That's certainly what I thought when I watched the keynote. It's like Apple had a meeting about how, \"Wow, people are losing these things and getting them mixed up with other people's AirPods,\" and then they just decided to do something about it. So the case is the same size and shape, but there's this lanyard loop on the side now, in case you wanna attach it to something. It's kinda like the loop on the top of the water bottle at MKBHD.com, but just way smaller, and then you can use whatever lanyard you wanna attach it to. But if that's not good enough for you, there's a whole speaker at the bottom of the case now and it is surprisingly useful. So it can play a loud sound to help you find them, on top of the precision finding that already works really well, since it has a U1 chip inside. So it's just like an AirTag. If it's somewhere in your general vicinity, it can guide you to it. That is sweet. It also plays a sound when you get it on a charger, wired or wireless. And the MagSafe ring helps it stay in place on any MagSafe wireless charging puck. That's not new, but it also now works with Apple watch chargers too, which is a nice touch. On top of all that, It is still IPX4 water resistant, which is an extra layer of security if you work out and sweat around the case, or if you end up in the rain in these. And you can engrave it with your Memoji now, so your friends will never accidentally pick up your AirPods case by mistake. But not even that, is what was convincing me about the AirPods Pro 2. Not even the most requested feature apparently, this is something lots of other earbuds have had, but volume control on the earbud itself, it's on the stock now. So, of course, it is now much more convenient to just adjust the volume without having to reach for your phone. It's kinda like this pinch gesture, where you hold your finger on one side and then slide with the other on the flat spot on the stock. It's kinda awkward at first, but you do get used to it. But no, it was none of that. The thing that convinced me with these headphones that they're incredible, is the H2 chip. (case clicking) So previous years' generations of Apple headphones have had the H1 chip inside. And it's this little chip that's doing the audio processing, noise cancellation, et cetera. This is the second generation of that chip. And Apple was bragging on stage that it has a billion transistors or something ridiculous. Whatever! The point of the chip is that it enables everything that is special about these new AirPods. So first of all, there is much improved active noise cancellation. Apple said something like, up to two times more background noise is removed versus the last generation. I don't know about all that, but combining these new drivers and the sound profile with the improved noise cancellation is definitely noticeable. It's incredible with white noise, like air conditioners and transportation. You put the headphones on and it just erases them immediately. I'm not the type of person to wear earbuds for an entire flight. I still much prefer over-the-ear headphones for that, but I get it with these now. I understand why people would want to wear these airbuds on a plane because they cancel noise that well. I'm putting them on the same level of the Sony Mark 4 earbuds, and right below the new Bose QuietComfort Earbud IIs, and I put them above the AirPods Maxes, as far as how well it actually cancels sound. They still sound very different. I did the back-to-back test. Don't get me wrong. You can tell the much bigger driver makes a difference in the AirPods Max, but these get quieter. They remove more background noise. Now there is already a lot of computational audio happening in AirPods Pro Sound. They're literally adjusting the EQ with everything you listen to, and across every different volume level to make sure they sound a certain way, which is kinda funny. It actually makes them hard to review sometimes against other headphones, because every track hits a little bit different. But the one huge advantage AirPods have had for a long time now over the competition, over the Boses and the Samsungs and the Pixel Buds of the world, is the transparency mode. As someone who has used them all, the transparency mode from AirPods has for a while been on a level by itself above the rest. The real-time passthrough of outside sound is kind of amazing. And in these, with the H2 chip, it has leveled up again. So on stage, Apple introduced what they're calling, \"Adaptive transparency mode.\" It's actually not a separate mode, it's still the transparency mode, which is with a different name, but what's happening is it's still passing through all the outside sound. But anytime there's a loud or a harsh sound above 85 decibels, it cuts that sound down to not be loud and harsh. So let's say, you're walking or biking through the city. You need to keep transparency mode on so you can hear the cars and the people around you for safety, but you're still listening to music or a podcast or whatever. And then an ambulance drives past you, sirens blaring. (sirens blaring) You will still hear the sirens, but that super loud sound will be suppressed to a level that doesn't hurt your ears. It's just, it's super smart. And that ambulance could be anything, that could be someone honking, it could be a jackhammer, construction noise, it could be a dog barking. But it's keeping the same sound signature of whatever sound that is, and just bringing it down below a certain level. And it's doing it all in real-time with virtually no delay. So the crazy number is, it's sampling outside sound 48,000 times per second. Apparently, that's 240 times faster than the last generation. And so, it could even be like a really sharp, quick outside sound, (fingers snapping) like a dog barking. It will actually reduce a loud dog barking as fast as it's actually happening. So by the time it reaches your ears, it's a lower degree of sound; it's crazy. Now I've been trying it. I've been walking around with them and it's working really well. It's so good that this is a scenario that I've dreamt up that I believe could happen. I haven't tried this myself, but you know how you typically go to a super loud concert and front row, middle row, the speakers are are obviously too loud, they're damaging your ears, if you have an Apple watch, it's giving you warnings that if you're in this type of sound for too long, it'll be damaging to your hearing. Instead of wearing earplugs, you can actually, you can really do this, you can wear AirPods Pro 2 and put them in transparency mode and it will take the entire sound signature of that whole thing you're listening to, and it will drop it down to a reasonable level. You'll still feel the base in your chest of the speakers, but your hearing won't be damaged as much, because it's taking all of that and reducing it and you're still hearing the music. That's incredible. So all of this real-time processing is happening on the earbuds, not on your phone, and that is the H2 chip at work. Plus, there's also a few other features it enables too. It talks to the Noise app on the Apple watch in real-time to show you how much noise is being canceled out, in case you want a visual for that sort of thing. And also, if you accidentally ever put the wrong earbud in your case, like someone else's, the speaker will actually play a chime and you'll get a mismatched AirPods notification on your phone. Another nice touch for those people who have inevitably lost AirPods to their friends' cases and probably don't even know it. And then there's a new ear scan for personalized spatial audio. This was kind of a weird one. So it's using the Face ID depth sensors to measure your head and measure the depth of your ears, to give you a personalized spatial audio mix. Sony's been doing the same thing for a little bit with some of their headphones. They use the front-facing camera. I don't know if I was convinced at the usefulness of this. The spatial audio was already pretty good, but after I did the personalized audio, basically for me, it just sounded like the sound stage got a little bit whiter, maybe. There's just a bit more of a spread to how far apart the different sounds and instrumentals are. I don't know exactly how much of the ear scan data was being used for this, but that's even more computational audio, thanks to the H2 chip. Overall though, these AirPods are a significant upgrade and they're just flat out better than I expected. I wasn't expecting this much of a change, and they sound way better, they work way better. There is still lots of other competition in the earbuds world. Samsung's buds are really good. I also really like the Pixel Buds. I did a whole separate video review of those. If you wanna watch it, you can check it out with the card. But at the beginning of the video, I said a little phrase, (I don't know if you caught it), but I said, \"AirPods people.\" \"AirPods people.\" And this is something that you might see a lot if you live in a major city, or where there's a lotta mass transit or something like that. It's when people just wear AirPods everywhere they go. They walk around the streets with them, they bike around, they just live with AirPods in their ears. And these are gonna be amazing for those people. It's everything you'd care about. It's the better battery life. It's the better sound quality. It's the better noise cancellation and much better transparency mode. The better case, the volume control on the stocks, all in one package at the same price. I get it, I get it. (gentle electric music begins) It's really good. Air Pods Pro 2 are really, really good and now you know why. All right, that's it. Thanks for watchin'. Catch you on the next one. Peace.",
    "transcript_keywords": [
        "sound",
        "AirPods",
        "Apple",
        "AirPods Pro",
        "noise",
        "AirPods Pro Sound",
        "case",
        "good",
        "people",
        "transparency mode",
        "chip",
        "noise cancellation",
        "audio",
        "AirPods people",
        "earbuds",
        "mode",
        "Apple watch",
        "Pro",
        "transparency",
        "loud"
    ],
    "transcript_entity_values": [
        "kilohertz",
        "H2",
        "IPX4",
        "Air Pods Pro 2",
        "Apple",
        "AirTag",
        "the Pixel Buds",
        "one",
        "the AirPods Pro 2",
        "up to 30",
        "85 decibels",
        "U1",
        "Bose QuietComfort Earbud",
        "AirPods Pro 2",
        "six hours",
        "Noise",
        "MKBHD.com",
        "Sony",
        "a billion",
        "AirPods Max",
        "first",
        "previous years'",
        "AirPods",
        "Memoji",
        "EQ",
        "33%",
        "a few days",
        "a mile",
        "H1",
        "second",
        "16",
        "two",
        "the AirPods Maxes",
        "48,000",
        "Samsungs",
        "240",
        "Samsung",
        "Boses"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "LAW",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "TIME",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERCENT",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON"
    ],
    "vector": [
        -0.05067453533411026,
        -0.051850441843271255,
        0.03305796533823013,
        0.014278979040682316,
        0.09661594778299332,
        -0.006899604108184576,
        0.09234736859798431,
        0.023500779643654823,
        -0.0737585499882698,
        0.042576152831315994,
        -0.0002071558847092092,
        0.02457553707063198,
        -0.04008445888757706,
        -0.04280047491192818,
        -0.018538592383265495,
        0.06071286275982857,
        0.08695174753665924,
        -0.09249339997768402,
        -0.016791746020317078,
        0.021534815430641174,
        -0.03729155287146568,
        -0.03274006024003029,
        0.10621513426303864,
        0.04879014939069748,
        -0.002949827117845416,
        0.043307431042194366,
        -0.014137902297079563,
        -0.04340406507253647,
        -0.07709929347038269,
        -0.014976815320551395,
        -0.031665075570344925,
        0.057367321103811264,
        0.05086348205804825,
        -0.02909042499959469,
        0.01078071165829897,
        -0.06370175629854202,
        0.10016892850399017,
        -0.030205562710762024,
        0.010270727798342705,
        -0.05636035278439522,
        -0.00022437628649640828,
        -0.016158930957317352,
        -0.038556646555662155,
        0.04600776731967926,
        0.006586756557226181,
        -0.020461656153202057,
        0.039452504366636276,
        -0.09393825381994247,
        -0.044699907302856445,
        0.09623118489980698,
        -0.06001853570342064,
        -0.07693850994110107,
        0.09183723479509354,
        -0.0321028046309948,
        -0.04528823494911194,
        0.005107811652123928,
        0.005748001858592033,
        -0.012715596705675125,
        0.011410744860768318,
        -0.011076823808252811,
        0.09360858798027039,
        -0.13087916374206543,
        0.013811551965773106,
        -0.0610586516559124,
        0.01972051151096821,
        -0.025201937183737755,
        -0.04641379043459892,
        0.028368864208459854,
        0.04854399710893631,
        0.05810411646962166,
        -0.07468646764755249,
        0.08148529380559921,
        0.03335816040635109,
        0.049866933375597,
        0.031396571546792984,
        0.02036852203309536,
        0.011422624811530113,
        -0.05311177298426628,
        -0.031528741121292114,
        0.02238317020237446,
        0.00993849616497755,
        -0.048762161284685135,
        0.007771041709929705,
        -0.12834258377552032,
        -0.03479911759495735,
        -0.02324497140944004,
        0.026696670800447464,
        -0.07202746719121933,
        -0.13067831099033356,
        0.004739917349070311,
        -0.0134566780179739,
        0.03148531913757324,
        0.025362268090248108,
        -0.05862477421760559,
        0.09231174737215042,
        -0.011708867736160755,
        -0.03676089644432068,
        -0.03777172788977623,
        0.04047980532050133,
        0.02006051130592823,
        0.04126439988613129,
        0.09048612415790558,
        0.024515092372894287,
        -0.09932369738817215,
        0.02133217267692089,
        -0.09526848793029785,
        -0.09494874626398087,
        -0.047276388853788376,
        0.05290542542934418,
        0.042217593640089035,
        0.028760211542248726,
        -0.03083922527730465,
        -0.03126116096973419,
        0.012182887643575668,
        0.025091130286455154,
        0.09308774769306183,
        -0.03752691298723221,
        0.06180986762046814,
        0.0912005826830864,
        0.005307035520672798,
        -0.015356620773673058,
        0.01997893489897251,
        0.021368032321333885,
        -0.01880885660648346,
        -0.08672009408473969,
        0.00872906856238842,
        -0.06791318207979202,
        3.689312162600781e-33,
        0.060275133699178696,
        0.012603279203176498,
        -0.009342755191028118,
        0.054311204701662064,
        0.015616140328347683,
        -0.13056229054927826,
        -0.023297112435102463,
        -0.022236261516809464,
        -0.044179677963256836,
        0.0741046816110611,
        -0.07207846641540527,
        0.020080633461475372,
        0.0201826561242342,
        -0.003610594430938363,
        0.024987265467643738,
        -0.09193617105484009,
        -0.1353939175605774,
        -0.0037117446772754192,
        -0.01459245290607214,
        0.05461117625236511,
        0.0231169480830431,
        0.009516041725873947,
        -0.0055285184644162655,
        0.03234938532114029,
        0.07408958673477173,
        -0.059152718633413315,
        0.0009918685536831617,
        -0.011315420269966125,
        -0.010325890965759754,
        0.014973150566220284,
        -0.126046821475029,
        0.038003839552402496,
        0.02909223362803459,
        0.03624052181839943,
        0.004774945788085461,
        0.007616150192916393,
        -0.006680340971797705,
        -0.015766702592372894,
        0.0007749174837954342,
        -0.13145776093006134,
        -0.013450900092720985,
        0.04252924397587776,
        -0.017382986843585968,
        -0.030774615705013275,
        0.0391329862177372,
        0.028132446110248566,
        -0.02946496568620205,
        0.0007344564073719084,
        0.08949825167655945,
        -0.04305018484592438,
        -0.051340650767087936,
        0.039479270577430725,
        -0.012542336247861385,
        0.05393606424331665,
        -0.006695904303342104,
        -0.04583924263715744,
        0.02149159461259842,
        0.025885675102472305,
        0.05527445301413536,
        0.04107135534286499,
        0.02638849802315235,
        0.059800997376441956,
        -0.056267574429512024,
        -0.07188147306442261,
        -0.12034522742033005,
        0.09046227484941483,
        -0.01631024479866028,
        0.05711980164051056,
        0.009938417933881283,
        0.033233463764190674,
        -0.018068091943860054,
        0.06856588274240494,
        0.04958776757121086,
        -0.05872676149010658,
        0.029878342524170876,
        -0.01986592262983322,
        -0.015617167577147484,
        -0.04664582014083862,
        -0.041432302445173264,
        -0.012086236849427223,
        0.04576031491160393,
        0.07621626555919647,
        -0.015640312805771828,
        0.049809545278549194,
        -0.08806799352169037,
        -0.06686940044164658,
        0.01972850039601326,
        -0.023072531446814537,
        -0.031055133789777756,
        0.017472613602876663,
        -0.057667121291160583,
        0.09049204736948013,
        -0.012163667939603329,
        -0.023297568783164024,
        -0.008361086249351501,
        -4.883632790135457e-33,
        0.06690225005149841,
        -0.004128218162804842,
        0.007850379683077335,
        0.05007144436240196,
        -0.02299037203192711,
        0.024754708632826805,
        0.01730808988213539,
        0.023563766852021217,
        0.02870660088956356,
        -0.05637223273515701,
        0.04860402271151543,
        -0.018324829638004303,
        -0.046979304403066635,
        -0.0031617600470781326,
        -0.02206968143582344,
        -0.1091543510556221,
        -0.06784418225288391,
        -0.09900595247745514,
        0.09997915476560593,
        -0.005999612621963024,
        0.07309488207101822,
        0.010354878380894661,
        0.06996649503707886,
        -0.020778533071279526,
        -0.13293470442295074,
        0.01804337464272976,
        0.040208134800195694,
        -0.0397208109498024,
        0.02371521294116974,
        -0.030248140916228294,
        0.0313885398209095,
        0.04349616914987564,
        -0.022911379113793373,
        0.07156216353178024,
        0.08597345650196075,
        -0.05070983245968819,
        -0.017491571605205536,
        -0.016251342371106148,
        0.021515248343348503,
        -0.041471268981695175,
        0.003596368944272399,
        0.06089853495359421,
        0.017538180574774742,
        -0.07283778488636017,
        0.05546266585588455,
        -0.03459426760673523,
        -0.056628648191690445,
        0.07790128886699677,
        -0.04528782144188881,
        -0.04513847455382347,
        -0.01057735551148653,
        0.034016288816928864,
        -0.08591453731060028,
        -0.06316875666379929,
        -0.06981804966926575,
        -0.06124380603432655,
        -0.06312653422355652,
        -0.0024580068420618773,
        0.04292977601289749,
        0.052826087921857834,
        -0.009855293668806553,
        0.033001095056533813,
        0.020028021186590195,
        -0.03204270079731941,
        -0.1224440410733223,
        0.0033640549518167973,
        0.012811328284442425,
        0.046067703515291214,
        0.07491163164377213,
        0.04712488874793053,
        -0.049306612461805344,
        0.03132005035877228,
        -0.02770596742630005,
        0.0012552932603284717,
        0.04782436788082123,
        -0.01762828789651394,
        -0.01622181199491024,
        -0.020981326699256897,
        0.027636615559458733,
        0.043445125222206116,
        -0.0013176188804209232,
        0.09077712148427963,
        0.02902209758758545,
        0.03946523740887642,
        0.08679179847240448,
        0.1067221462726593,
        0.009170563891530037,
        -1.585666905157268e-05,
        -0.08430315554141998,
        0.09855202585458755,
        -0.00035135532380081713,
        -0.03478720411658287,
        -0.05924476683139801,
        0.06711836904287338,
        0.03630541265010834,
        -5.632996646909305e-08,
        0.05168215185403824,
        0.03280509263277054,
        0.07306604087352753,
        0.0029142480343580246,
        0.01250022929161787,
        -0.045796215534210205,
        -0.023251239210367203,
        0.07380349189043045,
        0.022255701944231987,
        -0.04239249601960182,
        0.030177241191267967,
        0.0017077812226489186,
        -0.08072260022163391,
        0.029012229293584824,
        0.02429090440273285,
        0.0395132377743721,
        -0.029046883806586266,
        0.05683254823088646,
        -0.034114740788936615,
        -0.08273870497941971,
        -0.03900979086756706,
        0.05040692910552025,
        0.055631380528211594,
        -0.03544289991259575,
        -0.013780072331428528,
        0.018908342346549034,
        0.031890831887722015,
        -0.005585875362157822,
        0.006073214113712311,
        -0.0034220200031995773,
        -0.0813835859298706,
        0.00025477533927187324,
        -0.07529793679714203,
        -0.03466685116291046,
        0.0053391060791909695,
        -0.06034889444708824,
        0.011126146651804447,
        0.002358796540647745,
        -0.008638042956590652,
        0.038929011672735214,
        -0.028883595019578934,
        -0.05797190219163895,
        -0.021827353164553642,
        0.014945654198527336,
        -0.008863301947712898,
        -0.05810650438070297,
        0.04402574896812439,
        -0.048771753907203674,
        -0.05605638027191162,
        0.024438228458166122,
        -0.016873903572559357,
        0.02979976311326027,
        -0.0022309529595077038,
        0.07895789295434952,
        0.023315122351050377,
        0.1079656258225441,
        -0.06721284985542297,
        0.008182731457054615,
        -0.0838538259267807,
        0.0353204719722271,
        0.023869739845395088,
        -0.02566653862595558,
        0.01801896095275879,
        0.09169352799654007
    ]
}