{
    "id": "F863BrJg4B0",
    "title": "MrMobile Stays Home",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-03-20T13:55:57Z",
    "video_url": "https://www.youtube.com/watch?v=F863BrJg4B0",
    "category": "Science & Technology",
    "tags": [
        "nintendo switch lite review",
        "surface headphones review",
        "ipad sidecar",
        "ipad second monitor",
        "coronavirus",
        "covid-19"
    ],
    "views": 173581,
    "likes": 10501,
    "comments_count": 634,
    "description": "Sponsored by dbrand. Get skins for your laptops, tablets and phones here:    [MRMOBILE STAYS HOME]  Like a lot of folks, thanks to COVID-19 Im not staying very mobile these days. Im not complaining about that: social distancing is the best weapon we have against the novel Coronavirus, and I also recognize how very lucky I am to have a job that allows me to work from home.   That job, even when Im sheltering in place in pseudo-quarantine, is all about introducing you to cool products. So I thought Id take the opportunity to share some of the stuff that makes staying at home more bearable for me, from working to playing  to safely getting back out into the world again.  Join me for a look at those products, from the Nintendo Switch Lite to the iPad Pro to Surface Headphones ... to the Starfleet Communicator, in MrMobile Stays Home!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE STAYS HOME]  \"MrMobile Stays Home\" was produced on MrMobile's first workweek of social isolation during the COVID-19 pandemic of 2020. Produced with a mix of owned retail and review samples, linked and listed below. No company paid a fee or otherwise offered compensation in exchange for this coverage.  Additional video by Michael Ezrachi.   Special thanks to Phil Nickinson / Modern Dad and David Imel.   [PRODUCTS IN THIS VIDEO]  Starfleet 2293 Jacket by Volante Design:   Microsoft Surface Headphones [01:15]:   Apple iPad Pro [02:18]:   Invisible Tablet/Phone/Laptop Stands by MOFT [03:13]:   Samsung Galaxy Z Flip [03:32]:   Courant CATCH:1 Wireless Charger [03:41]:   Twelvesouth HiRise Wireless Charger [03:53]:   Nintendo Switch Lite [04:13]:   Garmin MARQ Captain [08:11]:   Withings Smart Scale WiFi Body Analyzer [09:24]:   The Wand Company Star Trek Bluetooth Communicator [10:29]:    [LINKS]  How I Learned To Lose Weight With The Withings Body Scale [Modern Dad]:   3 Ways To Hold Your Phone [Joshua Vergara / JVTechTea]:    Duet Display:   Prepare to 'Shelter in Place' from Coronavirus, Mayor Warns [The New York Times]:   What Does it Mean to 'Shelter in Place'? [The New York Times]:     [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase. See our affiliate link policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #tech #nintendoswitchlite #ipadpro #sidecar #quarantine #hometech #garminmarqcaptain #wandcommunicator #startrek",
    "description_links": [
        "https://dbrand.com/stay-home",
        "https://www.youtube.com/channel/UCSOp...",
        "http://bit.ly/2W8swBA",
        "http://mrmobile.tech/1PB",
        "http://mrmobile.tech/1PC",
        "http://mrmobile.tech/1PD",
        "http://mrmobile.tech/1PE",
        "http://mrmobile.tech/1PF",
        "http://mrmobile.tech/1PG",
        "http://mrmobile.tech/1PH",
        "http://mrmobile.tech/1PI",
        "http://mrmobile.tech/1PJ",
        "http://mrmobile.tech/1PK",
        "https://youtu.be/nndnJw5o1HY",
        "https://www.youtube.com/watch?v=NB0REmQOI6s",
        "https://www.duetdisplay.com/",
        "https://www.nytimes.com/2020/03/17/nyregion/coronavirus-new-york-update.html",
        "https://www.nytimes.com/2020/03/17/us/shelter-in-place-order-bay-area.html",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "(upbeat music) - Hi friends, Mr. Mobile here. And, like a great many of you, thanks to COVID-19, I'm not staying all that mobile these days. Now, I'm not complaining about that. For now, social distancing is one of the best weapons we have against this virus. And I also recognize that I am very lucky to have a job that allows me to continue working, even while I'm home. Now, most of that job is about showing you cool new products, right? So I thought, why not show you the products that are making it easier for me to stay at home? From work to play to eventually getting out back into the real world again. Here we go now Here we go Here we go Here we go - Okay so this is the home office. And I really quite like it, but as you can see, it's halfway underground, and that means it gets gloomy in a hurry. A big part of staying sane during a shelter-in-place order for me, is bright warm light. Which, in every apartment I've ever lived in, has been the largest public space, AKA the dining room, or the kitchen. Of course if you have roommates, you need to be able to isolate yourself, and you need noise-canceling headphones for that, even when they're quiet. Right now, I'm trying out the Surface headphones, because Microsoft finally sent me a pair. But since they launched over a year ago, I'll only give you a little mini review. Here's why I love them: Cortana is the friendliest way to tell me which devices I'm connected to, and how much battery I have left. - [Cortana] Hi, you've got about five hours of battery left. - [Michael] And the giant knobs on the ear cups make it easy to change the volume, or switch from noise-canceling to noise-amplifying. - [Cortana] Ambient sound amplified. - These have absolutely the best interface I've used on headphones. Problem is, the noise canceling isn't quite as effective as on the other cans I've covered, and they develop a bit of a rattle when I really crank 'em up. If you want the Surface headphones, it's a good time to get a deal on them. Best Buy is offering them for $200 according to Thriftr. I'll link that down below. And then there's the dual screen thing. I know a lot of you are used to dual monitors at work, and it's not always easy to replicate that at home. What makes it easier is the iPad Pro. If you own one of these, you already have a second screen, thanks to Sidecar, which is built right into your Mac if you're running Catalina. And thanks to everyone on Twitter for letting me know that this works on Windows machines too, via an app called Duet Display. Here's how I use it: I stick Slack, Twitter, and Telegram over on the iPad so I can keep tabs on what's going on in the world over there, while I do the real work on the main screen. Or if I'm editing, I can use the iPad as my raw materials bucket, freeing up more space for the timeline and color tools on the main screen. When I bought the iPad Pro, this feature wasn't available yet, and now that it's here, it's basically doubled the value of the product. I've just ordered the new iPad Pro, and for the first time in five years, I went for the larger model, specifically because of Sidecar. Also, if you need a stand for that iPad that's a little lower profile than my Lamictal or salt shaker, Moft is sending me one of its invisible stands to try out for my tablet, laptop and phone. I first saw these when Joshua Vergara busted them out at CES. And they didn't get here in time for this video, but follow me on Instagram, and I'll let you know what I think when they do come in. Of course no Mr. Mobile video in 2020 would be complete without a folding phone reference. Yeah, before I remembered my iPad could be my second screen, I was doing this in miniature with the Galaxy Z Flip. Keeping it topped up was the Courant Catch:1, one of my favorites from that wireless charger round-up I did last year. If you have a non-folding phone, like most folks, and you still want a stand-up companion, my favorite charger for this is still the Twelve South HiRise, which can pull double duty as a travel puck, too. By the way, yes, all of these are linked below, and yes, they're all affiliate links. But I'm not trying to sell you anything. If I have any ulterior motive whatsoever, it's to show you some things I forgot to show you last year. So let's pretend I'm done with my workday, and I pick up my favorite surprise winner of 2019, the Nintendo Switch Lite. Hello Cat. I know, let me beat you to it. This is the wrong device to show in a staying-at-home video. A much better fit is the heavy version of the Switch, which lets you output to the TV so you can play on the big screen or play as a group. Should you call it a Switch if it doesn't, you know, switch? I get it, I hear yOu, but sometimes you just wanna do your own thing. And man, I tell ya, for gaming on your own, the Switch Lite is an absolute gem. Compared to its full-sized sibling, it's less clunky, it doesn't creak and pop in your hand as much, and it's obviously much lighter too. I've been using mine since it launched. I actually went down to the Rockefeller Center Nintendo Store to buy it. Remember when a bunch of humans could occupy the same space in time? (heavy sigh) Looking forward to seeing all you folks again. We'll get there. Anyway, yeah, I got this thing almost six months ago, and for most of that time, it's the only Switch I used. Because I was still traveling, and the Switch Lite's smaller footprint made it the better choice for my bag. You'll notice I've also wrapped it in a couple different skins from my sponsored Dbrand, which I've fallen even harder for since my Galaxy Fold took a hard fall of its own. More about Dbrand at the end of the video. For now, let me show you what I've been playing on the Switch Lite. First up, Doom. Nope, not the Doom that everyone's talkin' about. This is the port of the classic that I first installed via floppy disk on a Packard Bell in 1993. Younglings, I know you're gonna laugh about the graphics, but hear me out. This game is a masterpiece. The level design, the cheesy 90's gore, the maps with secrets you've gotta sniff out, and of course the music. (upbeat music) It's five bucks on the E-shop, so is the sequel, and each is worth every blood-soaked penny. Switch is actually great for old games. If you pony up 20 bucks a year for a Nintendo Switch online, you can play a ton of titles from the original NES, and Super Nintendo. But let's get out of the 90's so I can share some more modern games I've been playing. In Lifeless Planet, you play an astronaut who discovers a town on, what was thought to be, well, yeah, a lifeless planet. But there's a twist. The town is not only deserted, but it's soviet. It's kitschy and unsettling in a way that only a blend of cold war mystery and sci-fi futurism could be. And there's plenty of area to explore and mysteries to solve. So even at 20 bucks, I felt my money was well-spent. Or maybe you'll better enjoy my final reco. If I can't have Thai Fighter on the Nintendo Switch, well Everspace is the next best thing. You fly your spacecraft from system to system, mining asteroids for resources, and battling pirates crumpet security forces. There's a narrative woven in about trying to learn your true identity because you're a clone, but mainly I just use it as an escape to unwind by blowing things up in an environment that the designers admit was intended more as eye candy than realistic representation of space. To put a bow in the Switch Lite, if you've been on the fence about it, all you need to ask yourself is if you're sure you don't need to put your games on the big screen. If you do, the bigger Switch is by far the better option, and it's still a fantastic buy today. Just make sure you get the newer one with the better battery. And if you go for the Lite, well, keep in mind that all the old annoyances are still there. It's still stupid that you can't use Bluetooth headphones without an adapter, and I wish it didn't have to connect to the internet as often as it does. But it's bright, it's loud, it lasts between four and six hours per charge, and that D pad is way more comfortable for older games. The Switch Lite is a brilliant console for the road or for the home. And at 199 bucks, I think it's a no-brainer. Now, of course, gaming doesn't burn a ton of calories, but folks, the gym in my building is closed. Which actually isn't that big a deal since I never the combination even when it was open. I'm more of an exercise outside kind of guy. At press time, we don't know the details of New York City's shelter-in-place laws, should they be enacted, but if they're anything like San Francisco's, you'll probably still be allowed outside for things like exercise. That means I'll still be able to enjoy my favorite, read only form of exercise: walking for long, long periods of time. To help me with that, I'll be using a watch I covered extensively just a video or two ago; the Garmin MARQ Captain. Now, as I said in that video, no one should buy a $2000 smart watch, but a few helpful commenters pointed out to me that the Marq series shares most of its fitness-tracking features with Garmin's Phoenix line, which is much more affordable. Used to be I had a lot of watches I could point to for health-tracking, but with FitBit getting swallowed up by Google, and the latter's Wear OS doing a pretty job on the whole. Well, outside of the Apple Watch, Garmin has become my go-to reco for smart watches with a focus on health, but also a broad set of competencies. And when I'm done with those quarantine constitutionals, I use this to see how much sedentary weight I've gained anyway. It was Modern Dad who clued me in to how useful the Withings family of tech can be. While the company's hybrid watches aren't really my style, I bought one of its smart scales about six months ago, and it's been incredibly useful for tracking my weight, muscle and bone mass, body fat, etc. Using nothing more complicated than the electrical impedance centers built into the deck. It's been fun to track my weight fluctuation through the holidays, followed by CES, followed by getting pneumonia, followed by enforced inactivity. At less than $75 on sale, I'd call this scale a steal. Now, I was gonna end with what I'm watching, but if you follow me on Twitter, you already know that: West World, Longmire, re-watching the Newsroom for the third time, and of course every iteration of Star Trek. Yes I love Discovery, yes I love Picard, I think the Orville is derivative, but yes, I like that too. No, I don't feel the need to choose between them. The reason I bring up Star Trek is so I can re-bring up my favorite accessory: the Wand Bluetooth Communicator. Why throw it back to a product I first reviewed in 2016? Well, because, despite all its extra features, it was built mainly for phone calls. And with this social distancing this virus is forcing us to do in person, it's just the perfect excuse to reconnect with family and friends over the air. So whether you use a communicator from the 2260's, a Combadge from the 2360's, or just a plain old-fashioned voice call. Call an old school friend or a family member you've been putting off talking to. It really can help. Thanks once again to Dbrand for sponsoring this video. Whether you're looking to protect a rare and expensive phone, like the Galaxy Fold I slap dropped onto my coffee table hard enough to take the paint off, or just gussy up an otherwise boring laptop cover. Dbrand can help. With the best designs at a fair price. Hit the links in the description. Folks, let me know if you enjoyed this break from the usual, and if you'd like to see more like it. If the answer's yes, please subscribe. If the answer's no, well subscribe anyway because two more familiar format reviews are coming hot on the heels of this video. As always, Mr. Mobile doesn't do paid reviews. Nobody paid any consideration for inclusion in this video, it's just the stuff I've been using. Most importantly, please do remember to wash your hands often, try not to touch your face, and stay away from large gatherings. Until next time, thanks for watching. And until we can beat this thing, stay home, my friends.",
    "transcript_keywords": [
        "Switch Lite",
        "switch",
        "Nintendo Switch Lite",
        "Nintendo Switch",
        "Nintendo Switch Everspace",
        "Lite",
        "time",
        "video",
        "Switch Lite smaller",
        "iPad Pro",
        "screen",
        "iPad",
        "Nintendo Switch online",
        "Nintendo",
        "home",
        "thing",
        "Mobile",
        "headphones",
        "Surface headphones",
        "phone"
    ],
    "transcript_entity_values": [
        "less than $75",
        "the Apple Watch",
        "First",
        "Telegram",
        "Super Nintendo",
        "Picard",
        "Dbrand",
        "Packard Bell",
        "five bucks",
        "Catalina",
        "NES",
        "Microsoft",
        "Lamictal",
        "2360",
        "1993",
        "Dbrand",
        "2000",
        "the Courant Catch:1",
        "Michael",
        "Star Trek",
        "two",
        "the holidays",
        "Sidecar",
        "Lite",
        "CES",
        "the Rockefeller Center Nintendo Store",
        "Orville",
        "Nintendo Switch",
        "one",
        "the Galaxy Fold",
        "FitBit",
        "the iPad Pro",
        "Instagram",
        "Switch",
        "The Switch Lite",
        "Duet Display",
        "90",
        "San Francisco's",
        "Modern Dad",
        "Mac",
        "Google",
        "Thriftr",
        "the Galaxy Z Flip",
        "2019",
        "2260",
        "iPad",
        "Combadge",
        "the iPad Pro",
        "90",
        "Galaxy Fold",
        "about six months ago",
        "almost six months ago",
        "West World",
        "Thai",
        "the Switch Lite's",
        "Withings",
        "two ago",
        "these days",
        "five years",
        "second",
        "Longmire",
        "Wear OS",
        "Twitter",
        "a year ago",
        "Moft",
        "200",
        "2020",
        "a ton",
        "soviet",
        "Garmin",
        "third",
        "Twitter",
        "New York City's",
        "199 bucks",
        "the Switch Lite",
        "20 bucks",
        "2016",
        "last year",
        "Phoenix",
        "between four and six hours",
        "Everspace",
        "iPad Pro",
        "Newsroom",
        "Marq",
        "Mobile",
        "today",
        "first",
        "Discovery",
        "Joshua Vergara",
        "about five hours",
        "Surface",
        "Cortana",
        "COVID-19"
    ],
    "transcript_entity_types": [
        "MONEY",
        "FAC",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "NORP",
        "MONEY",
        "FAC",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "FAC",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "DATE",
        "LOC",
        "NORP",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "DATE",
        "QUANTITY",
        "NORP",
        "ORG",
        "ORDINAL",
        "PERSON",
        "GPE",
        "MONEY",
        "PRODUCT",
        "MONEY",
        "DATE",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "PERSON",
        "TIME",
        "ORG",
        "PERSON",
        "PERSON"
    ],
    "vector": [
        -0.08985251933336258,
        -0.0048559182323515415,
        0.1084258183836937,
        -0.04377136006951332,
        0.08145356178283691,
        0.014044977724552155,
        0.08872057497501373,
        0.034704018384218216,
        -0.08203248679637909,
        -0.012454293668270111,
        0.05902758985757828,
        0.07171562314033508,
        0.005705388728529215,
        0.06232824921607971,
        0.05392707884311676,
        0.020166123285889626,
        0.06473919749259949,
        -0.0782461017370224,
        -0.02241605892777443,
        0.06660213321447372,
        -0.04619690403342247,
        0.05486643686890602,
        -0.015686187893152237,
        0.013826576061546803,
        0.025730010122060776,
        0.04485325515270233,
        0.019371407106518745,
        0.01803564839065075,
        -0.00794114451855421,
        0.024954158812761307,
        0.007356925867497921,
        0.06167302280664444,
        -0.030783480033278465,
        -0.003935067914426327,
        -0.0459027998149395,
        -0.08057870715856552,
        0.018633613362908363,
        -0.01418369635939598,
        -0.02787530981004238,
        -0.07896681874990463,
        -0.014757261611521244,
        -0.07107032835483551,
        0.04248305410146713,
        0.0326719656586647,
        0.01133374497294426,
        0.0001527508720755577,
        -0.01681564934551716,
        -0.03731329366564751,
        0.02978837490081787,
        -0.03523552045226097,
        -0.02080618217587471,
        -0.0017389636486768723,
        0.022070636972784996,
        0.03209773823618889,
        -0.0337044857442379,
        0.05181683972477913,
        -0.005029616877436638,
        0.03922659531235695,
        0.0781264528632164,
        0.030969107523560524,
        0.07894831150770187,
        -0.028096402063965797,
        -0.0012480682926252484,
        0.01387371402233839,
        0.025193778797984123,
        -0.019464053213596344,
        -0.04636303707957268,
        0.04464520141482353,
        0.09765595942735672,
        0.060700319707393646,
        -0.07263245433568954,
        0.01418664027005434,
        0.012066095136106014,
        0.0005934234359301627,
        0.0077840108424425125,
        0.08231785148382187,
        0.04867285490036011,
        -0.09794798493385315,
        0.06791310012340546,
        0.035294078290462494,
        0.05452343821525574,
        -0.002973658964037895,
        0.0255538672208786,
        0.001602583797648549,
        -0.03351785987615585,
        -0.06302641332149506,
        -0.0077802203595638275,
        0.03666897863149643,
        -0.02702442929148674,
        -0.02993871457874775,
        -0.032318364828825,
        0.07956188172101974,
        0.027667326852679253,
        -0.013900654390454292,
        -0.0973212718963623,
        -0.07848124951124191,
        -0.042335521429777145,
        0.009822363965213299,
        -0.030474305152893066,
        0.06463474780321121,
        0.0228936355561018,
        0.015607938170433044,
        0.043156761676073074,
        0.05762183666229248,
        -0.008068172261118889,
        -0.04777834564447403,
        -0.02909112349152565,
        -0.04506758973002434,
        0.03845585137605667,
        0.05259722098708153,
        -0.08897552639245987,
        0.06465954333543777,
        -0.10819125175476074,
        -0.031035715714097023,
        -0.07964622229337692,
        -0.025330152362585068,
        -0.05802369490265846,
        0.10735247284173965,
        0.0832400992512703,
        -0.009841246530413628,
        0.034742970019578934,
        0.009789576753973961,
        0.02881810814142227,
        -0.11429961025714874,
        0.06917188316583633,
        0.015480829402804375,
        0.06438198685646057,
        5.155069496761693e-33,
        -0.006185026373714209,
        0.07045232504606247,
        -0.0260002501308918,
        0.05659768357872963,
        0.024631643667817116,
        -0.056836292147636414,
        -0.060259539633989334,
        0.05859765410423279,
        0.09028264880180359,
        0.07099906355142593,
        -0.009923878125846386,
        0.07684732973575592,
        -0.04783686622977257,
        0.016269177198410034,
        0.02904157154262066,
        -0.07954851537942886,
        -0.031238092109560966,
        -0.05452876538038254,
        0.01001922506839037,
        -0.0333571583032608,
        0.030944323167204857,
        -0.01851005293428898,
        0.026176730170845985,
        0.0027470693457871675,
        0.05564428120851517,
        -0.007862606085836887,
        0.05044000595808029,
        -0.03342803567647934,
        0.09158633649349213,
        0.023058632388710976,
        -0.0680902972817421,
        0.04945628345012665,
        -0.0011395569890737534,
        -0.06692564487457275,
        -0.05656363070011139,
        0.007547268643975258,
        -0.1296623945236206,
        -0.1565621942281723,
        0.037621065974235535,
        -0.05452248081564903,
        -0.030041398480534554,
        -0.0007077871705405414,
        -0.01660492643713951,
        0.01825028285384178,
        0.02332712709903717,
        -0.04802020266652107,
        0.012607603333890438,
        0.0031481788028031588,
        -0.03637361899018288,
        -0.01095879077911377,
        -0.06714866310358047,
        -0.02823992632329464,
        -0.09645631164312363,
        -0.0650119036436081,
        -0.0961977019906044,
        -0.0418170727789402,
        -0.009190508164465427,
        0.011603129096329212,
        0.08741387724876404,
        -0.039121199399232864,
        0.03376895189285278,
        -0.005929524544626474,
        -0.008390497416257858,
        -0.005348432343453169,
        -0.004919014405459166,
        0.013209197670221329,
        0.06730008125305176,
        -0.0380544550716877,
        -0.048921119421720505,
        0.04169364273548126,
        0.07924947887659073,
        -0.0006601913482882082,
        0.027175776660442352,
        -0.0976935476064682,
        -0.013480470515787601,
        0.030112242326140404,
        -0.02125372178852558,
        0.0018172375857830048,
        -0.12233919650316238,
        -0.07753279060125351,
        -0.009466339834034443,
        0.027252590283751488,
        0.020617008209228516,
        0.002212001010775566,
        0.06005187705159187,
        -0.01979953423142433,
        -0.051413651555776596,
        -0.11919993162155151,
        -0.036886122077703476,
        0.13240335881710052,
        -0.021644307300448418,
        -0.007626399863511324,
        0.06245006248354912,
        0.05924440547823906,
        -0.07107037305831909,
        -5.208731915902684e-33,
        -0.06279110908508301,
        -0.057269688695669174,
        0.011432723142206669,
        -0.08861362934112549,
        0.014492647722363472,
        -0.002381882630288601,
        0.01744735613465309,
        0.026602881029248238,
        -0.019198233261704445,
        0.0023658310528844595,
        -0.08153589814901352,
        0.051712583750486374,
        0.07972323149442673,
        -0.032428592443466187,
        -0.050944410264492035,
        -0.001726516173221171,
        0.02999514527618885,
        -0.018805434927344322,
        -0.022876925766468048,
        0.05276061221957207,
        0.02659892849624157,
        0.07073071599006653,
        -0.01431371085345745,
        0.08724621683359146,
        0.041612472385168076,
        0.03626003488898277,
        0.053718533366918564,
        0.024398723617196083,
        0.04323367401957512,
        -0.027808716520667076,
        0.005999195389449596,
        -0.026089120656251907,
        -0.022412043064832687,
        -0.023216793313622475,
        0.022861719131469727,
        0.04952940717339516,
        -0.008612025529146194,
        -0.001779033220373094,
        -0.0418076291680336,
        -0.020627586171030998,
        0.03921664133667946,
        -0.01671939715743065,
        -0.028329430148005486,
        -0.010213383473455906,
        0.024951955303549767,
        0.0008181789889931679,
        -0.05857381224632263,
        -0.014279115945100784,
        -0.03543250635266304,
        0.039579037576913834,
        0.10947713255882263,
        0.03155813738703728,
        -0.11161305755376816,
        -0.058595772832632065,
        -0.096461221575737,
        -0.0031681337859481573,
        0.06630559265613556,
        -0.12526749074459076,
        -0.06757983565330505,
        -0.01951528713107109,
        0.03849448636174202,
        -0.016038192436099052,
        -0.0659300684928894,
        0.004160124808549881,
        -0.03498401492834091,
        0.04203849658370018,
        0.04338547959923744,
        0.007672553416341543,
        0.04830126091837883,
        -0.0488022044301033,
        -0.015501382760703564,
        -0.009388182312250137,
        -0.02996099926531315,
        -0.11229845136404037,
        -0.02766011655330658,
        0.0403316505253315,
        -0.007437118794769049,
        -0.0709557831287384,
        -0.001454365556128323,
        -0.05292070284485817,
        0.005113951861858368,
        -0.012493363581597805,
        0.016781682148575783,
        0.010554629378020763,
        0.07110434025526047,
        -0.08825671672821045,
        -0.02372182346880436,
        -0.02231544442474842,
        -0.03030567802488804,
        0.08513408899307251,
        -0.040165334939956665,
        0.046003881841897964,
        -0.08710110187530518,
        0.03852766007184982,
        0.0264250747859478,
        -5.218304721665845e-08,
        0.13150376081466675,
        0.02682616375386715,
        0.09150989353656769,
        -0.01872600056231022,
        -0.0023374599404633045,
        -0.040793634951114655,
        -0.0141137158498168,
        -0.05234307050704956,
        0.09608572721481323,
        0.0961804911494255,
        -0.023297356441617012,
        -0.05165387690067291,
        -0.0029749658424407244,
        0.06911914795637131,
        0.02441144920885563,
        0.08545109629631042,
        0.024034228175878525,
        0.02189001813530922,
        -0.09336759895086288,
        0.033244017511606216,
        -0.007907066494226456,
        0.04038478806614876,
        0.0024448768235743046,
        0.020831353962421417,
        0.0381438285112381,
        0.03263700008392334,
        0.007014418486505747,
        0.0441010557115078,
        0.05741826444864273,
        0.033395662903785706,
        -0.050573598593473434,
        0.02165399119257927,
        -0.02441829815506935,
        -0.01522902213037014,
        -0.05560271814465523,
        -0.0536608025431633,
        0.14233900606632233,
        -0.06549454480409622,
        0.028468167409300804,
        -0.014839687384665012,
        0.01871984265744686,
        -0.08004647493362427,
        -0.09636761993169785,
        0.07660357654094696,
        -0.04554720222949982,
        -0.051104526966810226,
        -0.04502272233366966,
        -0.03313557431101799,
        -0.03969508409500122,
        0.025384388864040375,
        0.012253843247890472,
        -0.10525675117969513,
        -0.014469420537352562,
        -0.007022317964583635,
        0.031885549426078796,
        -0.023080596700310707,
        0.005807307083159685,
        0.014984935522079468,
        0.002912885043770075,
        -0.005450734402984381,
        0.009690521284937859,
        -0.0366804301738739,
        -0.04000804200768471,
        0.04870292916893959
    ]
}