{
    "id": "FdbvrqC6lOY",
    "title": "I Bought Off-Brand GPUs from NewEgg… How Bad Are They??",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-07-13T17:10:58Z",
    "video_url": "https://www.youtube.com/watch?v=FdbvrqC6lOY",
    "category": "Science & Technology",
    "tags": [
        "graphics cards",
        "gpu",
        "gtx 1660 super",
        "nvidia",
        "geforce",
        "gtx 1650",
        "gtx 1660",
        "gaming pc",
        "video card",
        "newegg",
        "refurbished",
        "scam",
        "strange brands"
    ],
    "views": 2409349,
    "likes": 77548,
    "comments_count": 2874,
    "description": "Remove your personal information from the web at  and use code LTT for 20% off.  Create your build at   Whats going on with all these brands we dont recognize showing up when were shopping for graphics cards online? The prices seem too good to be true! Are these GPUs a bargain, a scam, or something in between?  Discuss on the forum: **  Buy a CORN/Kinology GeForce GTX 1660 Super Graphics Card:  Buy a Mannajue GeForce GTX 1660 Graphics Card:  Buy a Mannajue GeForece GTX 1660 Super Graphics Card:  Buy a 51RISC GTX 1660 Graphics Card:  Buy an ELSA GeForce GTX 1660 Super Graphics Card:  Buy a SRhonyra GeForce GTX 1650 Graphics Card:  Buy a MLSSE GeForce GTX 1660 Super Graphics Card:  Buy a Yeston GeForce GTX 1660 Super Graphics Card:  Buy a MSI GeForce GTX 1660 Super Graphics Card:  Buy an ASUS ROG Strix GeForce GTX 1650 OC Graphics Card:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:37 Packaging 2:10 Marketplaces  4:00 How do they look? 8:49 What about Firmware? 9:38 Will they game? 13:14 Outro",
    "description_links": [
        "http://joindeleteme.com/LinusTechTips",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1519246-i-saved-40-on-off-brand-gpus%E2%80%A6-am-i-a-fool/**",
        "https://lmg.gg/1iWU9",
        "https://lmg.gg/ItD7c",
        "https://lmg.gg/2I8uj",
        "https://lmg.gg/Dlhbg",
        "https://lmg.gg/uqJLF",
        "https://lmg.gg/TBwPE",
        "https://lmg.gg/ZkUZm",
        "https://lmg.gg/g5q4K",
        "https://geni.us/jgBYMpL",
        "https://geni.us/tG9kYM",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "So I want to buy a GPU, let's say a GTX 1660. How is this the top page of results on newegg.com? I mean, seriously, who is Sir Honya, Miles C, Manajui, 51Risk, Kinology? I haven't even heard of half of these brands and Amazon is flooded with them too. I mean, the prices look great. We're talking as much as 40% off of a recognized brand and they're still shipped by Newegg. But the last time I checked, Nvidia isn't selling GPUs at a discount. So what are they, refurbished crypto GPUs? Are they outright scams like we've covered in the past where the company pops up, defrods a bunch of customers, then vanishes only to appear again under a new equally random name? In either case, with such prominent placement on reputable websites, shoppers could easily be enticed by the savings and choose one of these over a more established brand, which I don't know, might not be such a bad thing unless it's a scam. I was determined to get to the bottom of this. So I tasked our labs team with buying and testing as many of these rando GPUs as they were comfortable with and what they discovered, well, let's just say the answers aren't as straightforward as this segue to our sponsor. Build Redux, they'll put together and ship your customized fully decked out rig right to your doorstep because your PC can never be too fast or too furious. Insert family joke. Check out Build Redux at the link below. The script doesn't actually call for me to react to the packaging here, but some of these are too funny to ignore. This one is upside down if you turn it around. This is just a low resolution ripoff of Nvidia's old Founders Edition packaging. Along those same lines, Kynology's artwork is original, but these talking points are absolutely ancient. 3D vision? This GPU doesn't support SLI. And in spite of Elsa being one of the two brands I do recognize here, this isn't exactly confidence inspiring. I have so many questions right now, but one thing we know for sure is that based on the featured status of these GPUs, they must be as profitable for Newegg as selling a more expensive card from a premier brand. But how could that be? Well, here's the thing. Shipped by Newegg isn't the same thing as sold by Newegg. Like many other online retailers these days, Newegg.com is actually a marketplace now that allows other businesses to sell items through their platform. Newegg collects and distributes payments, manages communications between buyers and sellers, and perhaps most importantly, trades on their position as a known entity, effectively lending their credibility to little sellers that you've never heard of. Some marketplaces also offer warehousing, shipping, and even customer support so that sellers don't need to maintain their own facilities or staff. The fees that these marketplaces charge for these services quickly add up to more than the profit that they would earn by selling the same product themselves. Want proof? Look no further than our sample search. Here we go, sold by Newegg. Wow. We're literally three of the more than 150 results that are actually sold by Newegg themselves. And I'm not counting this same card, but with a game bundle. Stop, you don't wanna miss today's deals on lttstore.com. We've got the Swacket for just 39.99, a Mystery Flannel for 20 bucks, and Swim Trunks for only 9.99. Pick some up or you'll be sour-y. Get it? Cause it's lime day. Now obviously, Newegg still wants to move their own stock out of the warehouse before it gets too old. So those three listings do appear toward the start of the results, but this is nothing like the old days when they would stock loads of GPUs from all the major manufacturers to ensure a consistent customer experience. In total then, we ordered eight cards from these unfamiliar brands. As usual, we're gonna have them linked in the video description below, but I would watch the rest of the video before you run out and buy them. You see, in spite of our search being GTX 1660, we ended up with only one of those since Newegg mostly returned results for 1660 Supers, and also this low profile 1650. So we picked that up as well just to see what was going on with that. Of these cards, most of them arrived as quickly as you would expect, with the exception being this 1660 Super from Elsa that took so long to arrive that we actually opened a support case looking for a refund. It did get here, but not in time for the full test gauntlet since it was actually only a few hours ago. That might not matter though, as it turns out. More on that later. Our first stage was the physical inspection. The labs team checks the cards over for signs of wear with special attention paid to the PCIe connectors, the fan bearings, and the thermal pads, along with a quick evaluation of other factors like heat sink design and overall cleanliness. Based on that physical examination, we found that there were only three cards here that we can confidently say are new. Those are the 1660 Supers from Yeston and Milsi, along with our 1650 from Sirhonya. These all show no signs of previous use. They have good, strong fan bearings and nice new thermal pads. The 1660 Supers both included warranty cards and the 1650 even had a surprisingly good installation manual in the box. Now, I had a quick look at the Elsa before we started filming and I didn't see any obvious signs of wear, but it wasn't looked over by the labs team, so take that for what it is. As for the rest of them, it turns out that none of these are quite what they claim to be. First off, we've got the Kinology 1660 Super that appears to be a totally different design from the Korn brand one that we ordered, though we did spot the same Kinology stickers on the Korn product page. Make of that what you will. But maybe it doesn't matter because the labs believes that this card may have been refurbished due to wear on the PCIe pins, oily residue from the thermal pads and what seems to be some uneven wear in the fan bearings. Next, we've got a pair of cards from Manajui, a base model 1660 and a 1660 Super. The base 1660 in particular has some concerning indicators. This sticker here above the PCIe connector, for example, is yellowed and starting to fade compared to the other sticker that's on the back of the card. There's also wear to the PCIe pins and most importantly, it looks exactly like the iCafe GTX 1660 from Colorful, a brand that I have heard of before, except they've, what, maybe pulled off the back plate and put new stickers on the fans. Manajui's second attempt isn't much better either. This 1660 Super shows similar signs of wear and, wait a second, this looks exactly like the Elsa. These two cards are completely identical, even down to the positioning of the QC sticker on the back of the cards. They're even stamped for the same month. These may have come out of the exact same batch and even more incriminating, both of them happen to look an awful lot like a Galax GTX 1660 Super that we found over on Tech Power Up, though with a much lower cost heat sink design under the identical plastic shroud. Last up, we've got this 1660 Super from 51Risk. It too shows signs of light wear, but 51Risk, unlike the others, actually acknowledges this with a note about it in their manual stating that the wear on the card is due to their extensive testing processes. Seems a little sus, especially given that the cooling setup is almost identical to the base model Manajui 1660 that we looked at a moment ago, just with different coloring on the shroud, or rather, a lack of it. So I'm willing to bet that like the Manajui, Colorful is the actual manufacturer of this card. In summary then, three of our eight cards are almost certainly brand new, one is probably brand new, and of the other four, the sellers appear to have simply slapped their logos onto a possibly refurbished card made by someone else, and in some cases, didn't even manage to get the brand on the site consistent with the sticker on the card. Now it's time to pop these into a machine and see what software can tell us about their origin. And yeah, not a lot of these fields change as we scroll through our 1660 supers. They're all clocked at 1530 megahertz with 1785 megahertz boost, and other than the BIOS version, the variables seem to be pretty much the brand of the RAM and the sub-vendor, where we get MSI, which makes sense, that's our control card, along with a mix of Colorful, Galaxy, and generic Nvidia. This, combined with our mismatched BIOS versions, seems to confirm our refurb and rebrand hypothesis for the cards from Manajui, 51Risk, and Kinology. Now to be clear, a generic identifier isn't suspicious on its own. Elsa, for example, has been around for a long time and appears to contract their manufacturing out to other board makers, which might explain their non-unique designs. Of course, for many buyers anyway, this is all irrelevant, and the only thing that matters is performance. I mean, who cares what sticker's on it, right? So we tested every card, again, except the Elsa, along with two controls, an MSI 1660 Super, and this Asus 1650, with a careful eye for any observed anomalies. Surprisingly, in gaming, the 1660 Supers were very consistent across the board, with only the Mil-C lagging slightly behind the rest of the pack. The Manajui 1660, meanwhile, remember that's the rebadged Colorful, was also just about able to keep up with the Supers, a pretty good showing. But the Sihonriya 1650 ended up performing considerably worse than our Asus control, though that kind of makes sense if you consider how much less power it drew. Power consumption for our 1660 Supers, meanwhile, was quite consistent, which makes sense, given their performance. Moving on, the spec.org productivity tests we ran showed similar results, with the 1660 Supers being very consistent with each other and our control, and only the Mil-C lagging behind, while our Manajui 1660 does an admirable job trying to keep up with the Supers. And once again, the Serhoira 1650 is underwhelming in the tests that it managed to complete, and just straight up fails to complete the SolidWorks test. So wherever they're getting these GPUs from, they're legit. They're made by Nvidia, you can't counterfeit that. Which raises the question, well, why not buy them then? To answer, we devised a final test, where we reached out to each seller with a simple support request, and we were pleasantly surprised to get fast, helpful responses from each and every one of them. That's obviously not a guarantee that you're gonna get proper warranty support 11 and a half months down the road, but I'm a bit too honest to just pry capacitors off these things with my Noctua Edition LTT screwdriver to see how they deal with a dead card. By the way, sign up for a stock notification on this thing now at lttstore.com. With the average price of a 1660 Super, from brands like Asus, MSI, and Gigabyte, hovering around 250 US dollars then. Are these lesser known brands worth the risk? I mean, I'm not gonna give an outright thumbs up to any of the ones that appear to be just slapping a sticker on someone else's possibly used product. So that rules out, Manajui, 51Risk, and Korn slash Kinology, whoever you are, leaving us with Yeston, Sironia, and Milsi. Sironia's 1650 underperforms and is priced higher than some of the 1660 Supers. So unless you absolutely need a half height, single slot card, that's a big fat nope. And of the two that remained, Milsi did underperform a bit, but costs far less while Yeston performed as expected, includes cute stickers, but comes at a higher price. These guys have also been around for at least 20 years though, which gives us some confidence that they'll be around to support us if something goes wrong. However, all that said, with more transparency around the refurbished status of these other cards, almost everything we saw today was a pretty okay value at the prices that they're charging. You just have to decide how much or how little you want to gamble, but you know you're never gambling with our sponsor. Delete Me. Whether you like it or not, your personal information is out there and companies are constantly sharing it without your consent. This info can be used by robocallers and email spammers, and it could even lead to identity theft or fraud. It's a complicated problem. Thankfully, the solution is easier with Delete Me. Delete Me will help you find hundreds of online profiles sharing your personal data and remove it. This would be a huge task that could take many hours doing it yourself, but with Delete Me's advanced tools and team of experts, it can be done in minutes. On average, Delete Me finds and removes over 2,000 pieces of data for a customer in their first two years. So if you want to get your personal information removed from search results on the web, go to joindeleteme.com slash linustechtips and use code LTT for 20% off. If you guys liked this video, why not watch me and Alex try to take a 4090 to 1000 watts of power consumption. Didn't work, but we got it a lot higher than stock.",
    "transcript_keywords": [
        "Supers",
        "Super",
        "card",
        "cards",
        "Newegg",
        "Manajui",
        "brand",
        "GPUs",
        "Elsa",
        "wear",
        "Kinology",
        "brands",
        "sticker",
        "thing",
        "Delete",
        "Sir Honya",
        "results",
        "support",
        "Nvidia",
        "GTX"
    ],
    "transcript_entity_values": [
        "one",
        "Korn slash Kinology",
        "Yeston",
        "SolidWorks",
        "Serhoira 1650",
        "eight",
        "1660",
        "Manajui",
        "GPU",
        "Delete Me's",
        "11 and a half months",
        "Elsa",
        "Supers",
        "the Kinology 1660 Super",
        "LTT",
        "three",
        "SLI",
        "a Mystery Flannel",
        "only one",
        "half",
        "39.99",
        "first",
        "only 9.99",
        "First",
        "4090 to 1000 watts",
        "Amazon",
        "MSI",
        "only three",
        "over 2,000",
        "Kynology",
        "20 bucks",
        "the same month",
        "hundreds",
        "Galaxy",
        "Redux",
        "four",
        "1530 megahertz",
        "around 250 US dollars",
        "minutes",
        "Kinology",
        "Newegg.com",
        "Sironia",
        "Supers",
        "at least 20 years",
        "Swim Trunks",
        "Alex",
        "many hours",
        "Honya",
        "1785 megahertz",
        "51Risk",
        "Noctua Edition LTT",
        "Gigabyte",
        "20%",
        "Korn",
        "Build Redux",
        "slash linustechtips",
        "Tech Power",
        "their first two years",
        "Miles",
        "two",
        "1660",
        "QC",
        "51Risk",
        "these days",
        "second",
        "Yeston",
        "more than 150",
        "Asus",
        "Manajui",
        "today",
        "1650",
        "Milsi",
        "RAM",
        "Newegg",
        "GTX",
        "1650",
        "a second",
        "Manajui 1660",
        "Nvidia",
        "Galax GTX 1660",
        "as much as 40%",
        "only a few hours ago",
        "the PCIe connectors"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "GPE",
        "ORG",
        "FAC",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "NORP",
        "DATE",
        "PERSON",
        "PERSON",
        "TIME",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERCENT",
        "ORG",
        "FAC",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "DATE",
        "DATE",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "FAC",
        "ORG",
        "LAW",
        "PERCENT",
        "TIME",
        "ORG"
    ],
    "vector": [
        -0.07873141020536423,
        -0.06149107590317726,
        -0.012132234871387482,
        -0.01575038582086563,
        0.051577452570199966,
        -0.01819803938269615,
        -0.007711417973041534,
        0.05954965204000473,
        -0.006129829678684473,
        0.00011035656643798575,
        -0.017420276999473572,
        0.033127766102552414,
        0.0112789086997509,
        -0.030885683372616768,
        0.05715439096093178,
        -0.017062868922948837,
        0.06874267011880875,
        -0.06057615950703621,
        -0.014417572878301144,
        0.0063959634862840176,
        0.038775842636823654,
        -0.04636356607079506,
        -0.0170658677816391,
        0.024885600432753563,
        0.02666662633419037,
        -0.009470941498875618,
        0.049009498208761215,
        -0.07404439151287079,
        -0.0041514975018799305,
        0.005079143214970827,
        -0.029089193791151047,
        0.07211107015609741,
        0.02024293877184391,
        -0.01145335752516985,
        0.007199575658887625,
        -0.06860309839248657,
        0.06498602777719498,
        -0.07103298604488373,
        -0.03680943325161934,
        -0.05640884116292,
        -0.04777436703443527,
        -0.036644041538238525,
        -0.05994962528347969,
        0.0136677585542202,
        0.013466698117554188,
        -0.05437672883272171,
        0.015984250232577324,
        0.040283914655447006,
        0.0006597350002266467,
        0.02016327530145645,
        -0.0030340978410094976,
        -0.057820774614810944,
        -0.011840302497148514,
        -0.0934971421957016,
        -0.10814225673675537,
        0.07268805056810379,
        -0.08709906786680222,
        -0.13066686689853668,
        0.029945628717541695,
        -0.05497542396187782,
        0.017151689156889915,
        -0.09837934374809265,
        -0.01959468238055706,
        0.0603003203868866,
        -0.031105894595384598,
        -0.044574372470378876,
        -0.05817798152565956,
        -0.044889070093631744,
        -0.002225718228146434,
        0.015851933509111404,
        0.021938038989901543,
        -0.009449130855500698,
        0.02783442661166191,
        0.0842750295996666,
        -0.005981306079775095,
        0.05287914350628853,
        0.0809372067451477,
        -0.0413617342710495,
        0.028127694502472878,
        -0.0015458439011126757,
        0.04209299758076668,
        -0.00011417909990996122,
        0.08051685988903046,
        -0.05878674238920212,
        0.040882986038923264,
        0.01675872504711151,
        0.10358146578073502,
        0.04777595028281212,
        0.07503854483366013,
        -0.08850414305925369,
        0.04162841662764549,
        0.04101408272981644,
        0.0807323157787323,
        0.01829707622528076,
        0.03012234903872013,
        -0.010617085732519627,
        -0.02098279446363449,
        -0.0296857338398695,
        -0.008322521112859249,
        0.009077129885554314,
        0.04072803258895874,
        0.024167919531464577,
        0.05226433649659157,
        -0.02634551003575325,
        -0.05959175154566765,
        0.026149842888116837,
        -0.0911986380815506,
        0.04597620293498039,
        0.03395543619990349,
        0.07001591473817825,
        -0.0523814782500267,
        0.029122641310095787,
        -0.022970903664827347,
        -0.004404320847243071,
        -0.08038897067308426,
        0.05449705570936203,
        -0.046258699148893356,
        -0.0025833460967987776,
        0.07464942336082458,
        0.010446199215948582,
        -0.018618643283843994,
        -0.04813260957598686,
        -0.02127229981124401,
        0.02095339633524418,
        -0.021809067577123642,
        0.01636463962495327,
        -0.06972221285104752,
        9.255035100692471e-33,
        -0.06480728834867477,
        0.023809457197785378,
        -0.024178527295589447,
        -0.07291903346776962,
        -0.04775754734873772,
        0.05832052603363991,
        0.011585266329348087,
        -0.011416702531278133,
        0.051377151161432266,
        0.06316369771957397,
        -0.1017831489443779,
        0.0635162740945816,
        -0.049595773220062256,
        0.09838982671499252,
        -0.0016529819695279002,
        0.021539445966482162,
        -0.05327726900577545,
        -0.03580057993531227,
        0.02545449510216713,
        0.03924955055117607,
        -0.026095135137438774,
        0.1082344576716423,
        0.08054089546203613,
        0.006622361484915018,
        -0.017459126189351082,
        -0.014771494083106518,
        -0.07590626925230026,
        -0.003133051097393036,
        0.02490309812128544,
        0.00779040576890111,
        -0.028508203104138374,
        -0.13634365797042847,
        0.01933431625366211,
        -0.008940496481955051,
        -0.01121976412832737,
        0.06729670614004135,
        0.017332591116428375,
        -0.09144139289855957,
        0.013001753017306328,
        -0.005472454708069563,
        -0.061512790620326996,
        0.10358346998691559,
        -0.055447109043598175,
        -0.10983303189277649,
        -0.005584734492003918,
        0.054176148027181625,
        0.017970914021134377,
        -0.028815219178795815,
        -0.03691796958446503,
        0.04089901223778725,
        -0.1368888020515442,
        0.0484035350382328,
        -0.1053023487329483,
        0.08052553236484528,
        -0.058554694056510925,
        -0.021683048456907272,
        0.009507384151220322,
        -0.010524053126573563,
        0.08282079547643661,
        0.020843304693698883,
        -0.04540255665779114,
        -0.07483989745378494,
        0.024029480293393135,
        -0.04542660713195801,
        -0.10045652836561203,
        0.0243360698223114,
        0.013493837788701057,
        0.0451117679476738,
        -0.08983610570430756,
        0.05267607048153877,
        -0.022036276757717133,
        0.02984199859201908,
        -0.01446778979152441,
        0.006375710479915142,
        0.08194749057292938,
        -0.0303000807762146,
        -0.007975931279361248,
        0.06323964893817902,
        0.014701299369335175,
        0.010231558233499527,
        -0.0009106508223339915,
        0.05295075103640556,
        0.015261626802384853,
        0.05110836401581764,
        -0.01745482161641121,
        0.04082740098237991,
        -0.028809580951929092,
        0.05251159891486168,
        -0.0175639595836401,
        0.04064314067363739,
        -0.049823660403490067,
        -0.0058912490494549274,
        0.024253176525235176,
        0.014061030931770802,
        0.06995531171560287,
        -9.63921089911218e-33,
        -0.03958429768681526,
        -0.001222953898832202,
        0.03800336271524429,
        0.09052091091871262,
        -0.012503323145210743,
        -0.005809990223497152,
        0.013436135835945606,
        -0.024805035442113876,
        0.05026588216423988,
        -0.08637582510709763,
        0.012456730008125305,
        0.16030322015285492,
        -0.03664376959204674,
        0.041968077421188354,
        0.02833094261586666,
        -0.07708211988210678,
        0.0430133119225502,
        -0.06163230538368225,
        0.0632215216755867,
        -0.08423750847578049,
        0.04572654142975807,
        0.05945609509944916,
        -0.042544569820165634,
        -0.049669455736875534,
        0.031069375574588776,
        0.03273624926805496,
        0.023842083290219307,
        -0.0014575017848983407,
        0.00406142883002758,
        0.005318667273968458,
        0.04593294858932495,
        0.04975903406739235,
        0.024924293160438538,
        0.03937971964478493,
        0.07324958592653275,
        0.008142011240124702,
        0.07057052850723267,
        0.10613760352134705,
        0.006080145016312599,
        -0.0023161841090768576,
        -0.014911169186234474,
        0.06966035068035126,
        0.05963727831840515,
        -0.01277034543454647,
        0.036060698330402374,
        -0.035376787185668945,
        0.006134118884801865,
        -0.10370467603206635,
        0.03492259606719017,
        0.066497802734375,
        -0.061480335891246796,
        -0.04759383201599121,
        0.0562141016125679,
        -0.03553798422217369,
        -0.08947759866714478,
        -0.09889878332614899,
        -0.05007459595799446,
        0.07215508073568344,
        -0.027832750231027603,
        -0.026365669444203377,
        0.05526335537433624,
        0.0782577320933342,
        -0.07976080477237701,
        -0.0456332229077816,
        0.035272061824798584,
        -0.059436336159706116,
        -0.024834830313920975,
        0.001655310275964439,
        0.036528222262859344,
        -0.016486987471580505,
        -0.12958645820617676,
        -0.026890408247709274,
        -0.07717265188694,
        -0.07487727701663971,
        -0.05114184692502022,
        0.041296832263469696,
        0.004828272853046656,
        -0.029426168650388718,
        0.08120906352996826,
        -0.058952510356903076,
        -0.01689453050494194,
        -0.026757806539535522,
        0.03868705406785011,
        0.02236373908817768,
        0.036115989089012146,
        0.008379952982068062,
        -0.032521046698093414,
        -0.016686564311385155,
        0.04855301231145859,
        0.010068538598716259,
        -0.01816411316394806,
        0.02857891656458378,
        0.02186988852918148,
        0.015225224196910858,
        0.002234141808003187,
        -5.2165056274589006e-08,
        0.026293259114027023,
        -0.010067672468721867,
        0.026358313858509064,
        0.0875730887055397,
        0.0033984906040132046,
        -0.046138133853673935,
        -0.038633935153484344,
        0.012249937281012535,
        -0.0176241397857666,
        -0.009982115589082241,
        0.06875001639127731,
        -0.04069158434867859,
        -0.03932798653841019,
        -0.04582372307777405,
        -0.024517692625522614,
        -0.050567127764225006,
        -0.054625123739242554,
        0.07723201811313629,
        0.009438801556825638,
        -0.032387856394052505,
        -0.01869264245033264,
        0.0671292096376419,
        0.07384226471185684,
        0.014179742895066738,
        -0.03053191304206848,
        0.03415660932660103,
        0.05274936929345131,
        -0.05461996793746948,
        0.06276939064264297,
        0.030961977317929268,
        -0.019620176404714584,
        0.006856677588075399,
        0.10156232118606567,
        -0.016113590449094772,
        0.10229586809873581,
        -0.10356699675321579,
        -0.049441806972026825,
        0.07767363637685776,
        0.11454407870769501,
        -0.042402271181344986,
        0.02812940627336502,
        -0.07971717417240143,
        -0.014574573375284672,
        -0.05004967376589775,
        -0.010332038626074791,
        -0.007978680543601513,
        -0.003268113825470209,
        -0.06013096496462822,
        0.026052184402942657,
        0.0033523498568683863,
        -0.05294279381632805,
        0.04585052281618118,
        -0.041788309812545776,
        0.018176492303609848,
        -0.01869848370552063,
        -0.09489480406045914,
        -0.01593242771923542,
        0.02954738587141037,
        0.049698155373334885,
        -0.020550258457660675,
        -0.05618627369403839,
        -0.13430587947368622,
        -0.03959424048662186,
        0.04325495660305023
    ]
}