{
    "id": "fDDzkAQY7Zw",
    "title": "This phone costs less than AirPods! - POCO M5s",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-01-25T20:00:33Z",
    "video_url": "https://www.youtube.com/watch?v=fDDzkAQY7Zw",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "poco",
        "budget",
        "phone",
        "flagship",
        "mid-range",
        "m5s",
        "cool",
        "cheap",
        "sale"
    ],
    "views": 270710,
    "likes": 13453,
    "comments_count": 1113,
    "description": "Check out Secret Lab chairs at:   POCO has been making great budget phones for years now and their latest M5s looks to continue the trend of shaking up the flagship space. Bell's here to see if the M5  is worth checking out or if the price tag is too good to be true.  Buy a POCO M5s:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 But how?! 0:24 The loot box 0:56 Unboxing 1:34 Design, buttons, ports, and cameras 4:45 Sponsor - Secret Lab 5:06 Display, specs, fingerprint scanner, and bloatware 7:28 Speaker impressions  7:56 Camera testing 10:16 Gaming and battery life 11:20 Missing features, pricing, competitors, and overall thoughts 12:59 Outro",
    "description_links": [
        "https://lmg.gg/SecretlabSC",
        "https://geni.us/9TBIBIy",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "(box bangs) - This phone is cheaper than a pair of AirPods, and not even the Pros, regular AirPods. And that may sound crazy. Poco is known for making affordable phones while still having a lot of specs that can compete with a lot of flagships, and this one hopefully is no different. Today we have the Poco M5S, which is one of their newest phones here, along with their M5 that we're not gonna really spend much time on, because this is the interesting one. But what's really interesting is they sent free loot. - [Colleague] Show me. - Oh baby. (bag rustles) We got the Poco juice. (group laughs) Yeah, that's right, delicious Poco juice. - [David] Where's the juice? - There's nothing in it. There's nothing in it, boys. Someone's gotten here first. Oh. (bag rustles) They're trying to win me over, and I'm not gonna lie. It's working. Look at this. Wow, I can really represent. (group laughs) What else do we got? Alright, we got the Poco headband and a very, very nice bag. Don't worry, I promise not to let this bias me. Alright, let's take a look at what's inside the box here. It's a very simple box, by the way. No information about specs of the phone so I don't actually know what we have here, but there we go. The first little intro tell us a bit about the phone itself, but let's take a look at what's in the box here first. Wow, okay, so we got this phone carrier. There is something inside. It's very heavy, and, oh perfect. I don't think a lot of people make cases for these phones but that could just be pure ignorance on my part. But squishy, squishy case. Also in the box we have a charger, so it's a 33 watt quick charger. This is not gonna be everywhere, so this is a European standard thing, so since we have the European model. Whoa, cool orange tip. Now for the phone itself, obviously we've all been waiting for, very exciting. And y'all, it looks pretty cool. It is 6.43 inches, so it's pretty decently big but it doesn't feel heavy. So it is a plastic frame and a plastic back, but it doesn't feel cheap. So I did use the Samsung S21 FE before, and the back, I didn't like the texture. It kinda just made it feel really plasticky, but this, no, it doesn't feel bad at all. It still has a little bit of heft, so it's 178 grams. The point here is a good balance. It doesn't feel heavy on one side of the phone or the other. It doesn't feel like you're gonna be fatigued from holding it up to your face when you're on the bus FaceTiming your mom or whatever. So we have the white here, but it is also available in blue and black. And I wasn't able to find it on, like, AliExpress or anything like that, but on their website. they do show a yellow. Otherwise, on the right side of the phone here, we have our volume rocker and power button, and the power button is also the fingerprint scanner, which is pretty convenient. On the top here we have one of our dual speakers and an IR blaster. So this is not in a ton of phones, but I absolutely love having an IR blaster. It's super convenient for if you lose your remote or anything like that. It's becoming rare and rarer to see, but it is just, like, a nice to have. Why not throw it in? And then we have our mic hole. On the other side of the phone we have our SIM tray, and I believe if we open it up, it is also an SD card slot, which is again something exceedingly rare in phones these days, but a great way to save some money by being able to get a lower storage option and throwing in your own SD card. And a dual card slot, which is again super convenient. It's not super common here in North America. It's only just getting to that point. In Europe and other countries, I know it's a bit more common but it's super convenient while traveling, or like for myself, I actually rock two phones at the same time, one with my work phone number and one with my personal phone number, and being able to put that all in one device is super convenient. On the bottom of the phone we have our other dual speaker, as well as a USB C port and a headphone jack. It's checking all the boxes. I know people in the comments are already going crazy. You've got this in your cart, but slow down. We're gonna finish this video. On the back, pretty simple. I don't know if this is a hot take or something like that, but having the certifications so big on the back of the phone, ugly. I use my phone's caseless. I have a Pixel 7 Pro in one pocket and an iPhone 13 Pro in the other pocket, both naked. Nothing, no scratches, no cracks, anything like that. I just, don't drop your phone. If you don't wanna use a case, you wanna save some money, stop dropping your phone or AppleCare, I don't know. But I feel like if there was a huge certification on the back of this, I actually might get a case just because it doesn't look good. Other than the certifications, there is this big kind of Poco logo. I don't mind it as much. Like, I mean, I feel like I'd be a little bit of a hypocrite because Apple does have the giant Apple logo, the Pixel has the G logo on the back. It's just not like a super high end brand. It's not like this is gonna be like, yeah, I've got a Poco. So on the back we have four cameras. We have our 64 megapixel main shooter, our eight megapixel wide angle shooter, our two megapixel depth camera, and a two megapixel macro camera. And I say four cameras because yes, it does have the depth camera, but you're never gonna be taking a photo out of it. It's just as used for the portrait mode, so it's there. There's no telephoto, which some people might care about. I personally never use the telephoto lens on my cameras, and with a 64 megapixel sensor, if this actually takes decent photos, you'll just be able to crop in and get a zoom that way. So that's about everything on the outside of the phone, so all we need to do is turn it on. But first you need to hear from our sponsor, Secretlab. Thanks to Secretlab for sponsoring today's video. Secretlab chairs are engineered to keep you incredibly comfortable for long hours at work and play. Their TITAN Evo 2022 chair keeps you feeling uncomfortable for longer. It has a four-way lumbar support, an ultra comfortable line of different seat materials and more. All the chairs also come with a five-year extended warranty and a 49-day return policy. So head on down to the link in the description and learn more about Secretlab today. So turning it on, right away, first you notice it's got a pretty decent screen so it's 2400 by 1080P full HD+ AMOLED screen. Yeah, one disappointing thing about the screen though is it is only 60 hertz. A lot of modern phones or higher end phones or even just different kind of budget phones will have a 90 hertz screen or even greater, and this one being locked at 60, once you get used to something higher, it is rough going back. Again, it's not gonna really show on camera 'cause obviously your screen's gonna be a different refresh rate than what we're filming at or anything like that, but just trust me, it does feel a bit choppy. Another disappointing thing I forgot to mention is that this is Gorilla Glass 3, which is think around like the seventh or eighth gen. One saving grace about this phone though is that the screen does get bright, so its average brightness is about 450 nits, but it can go up to 700 nits in its auto brightness mode if it knows you're out in the sun, and it has a peak brightness of 1,100 nits, which is competing with a lot of flagship phones. That's really great to see. See, as we can see here, here we're on MIUI 13, and for specs we have the 128 gig of storage and six gig of RAM model. Though as you notice here, it does say it's six plus two, so it is a dynamic RAM system where it can allow you up to an additional two gigs of RAM when you need it, which is interesting. I don't know why you just wouldn't have eight. Like, maybe it's a battery saver thing. It's also powered by the MediaTek G95, which is again a couple years old and it was already a mid-ranger then, so we're gonna see if it affects performance at all, but battery savings, price savings, it could all still be worth it. One other thing I wanna check out is the fingerprint unlock speed. It does have AI face unlock, but it's just a regular camera, so I don't know if I'd really ever trust it. Even Windows Hello requires an IR camera to get a special scan of your face to make sure it's actually you and not just a picture of you. Well, it's got a nice little happy face though. It kinda makes me want to use it. When you see the little happy face, does that not make you wanna use that? I am not super used to a fingerprint reader anymore. I've been using the iPhone 13 Pro since it came out, which is all just face ID, and the Pixel 7 Pro has the under display fingerprint scanner, which I actually have learned to like a lot, 'cause when your phone is face up on the table , you can just put your finger on top to see your notifications or do whatever you'd like. So I'm not quite sure how I feel about the fingerprint scanner on the side. It just means you have to kind of pick it up and hold it if you want to use it. Let's see how fast this fingerprint scanner is. Ooh, that's fast, super satisfying. It gets you right into the phone, but as you unlock here, you can see there's a lot of apps that come default on the phone. There's a ton of bloatware. It's got Netflix, Poco community, Tile Fun, though. They usually they charge for that, so that's pretty impressive. I mean, it just creates a lot more work we have to go through and uninstall all the stuff that you're obviously never going to use, like the Mi Remote. I mean, I guess, no, it's got the IR blaster. I'm sold. Keep the bloatware. (upbeat music) That's not bad. It was a little dicey at the start. I feel like it was just the high ends weren't sounding super great. I'm not an audiophile. I use AirPods, but I did think it sounds pretty good. It sounds pretty wide. There wasn't a ton of stereo separation but it did sound pretty decent, and the screen looks good. I still think it's looks really good for the fact that again, this is cheaper than AirPods. You get all this. Nuts. Now that we've seen the screen, I heard the speakers, let's check out the camera, as that's obviously something that's really important to everybody? Most people? UI is very iPhone like. So you have the shutter button at the bottom, the gallery I'm assuming that's gonna be, the flip, as well as all of your different kind of shoot modes. So let's take a picture right off the bat and just see what it looks like if you were to take a picture standard, bog-standard. - There. - There it is. - The ultra wide is .6. This is looking a little rough. Wow. You know, for a 10X, just crop zoom, 'cause that's not optical. That actually looks pretty decent, I'm not gonna lie. This is just a kind of standard suggested 2X. Again, it looks pretty clear. It's not super bright over there, and I am in a brightened area and it still looks pretty decent. Like, you're not gonna be punching into these photos and posting just James's handsome face, and then this is the wide angle. Oh, colors look a bit better, or at least kind of warm and saturated so it just appears better. And then these standard 1X. Again, this looks pretty darn good. I took a photo just behind me just so you can see something that's a little bit more kind of consistently lit. Yeah, it looks pretty darn good. Again, this isn't gonna compare to the Pixel or the iPhone with their computational photography or anything like that. Now we're gonna try some video. So it can do up to 4K 30, and then it does 1080P 60 or 30. A lot of phones do 4K 60, but again, I don't think most people are shooting at 4K 60, and at this price point, I don't really think that's much of an issue. All right, we're taking a video. You can hear the microphone. I'm gonna jostle it a little bit. That does pretty well. It's a little blurry, but again, the colors are pretty consistent if maybe a bit muted. But I think for if you just need a quick video of something or when you're out with your kids and you just want to get that special moment, this will do it. It might not look absolutely amazing, but it does look pretty decent. Me in my Poco uniform, so great. Ooh. I gotta check for AI beautify, 'cause while my voice might be smooth, my face is not that smooth. Alright, you can see in the settings here, you have the AI, which actually was not on, but there is a beautify, a little star icon down here that shows you your smooth, and you can change that higher or lower. Slender didn't do a whole lot. I guess it can't work miracles, am I right? And then we got big eye mode. Wow. Kawaii desu. All right, let's take a picture without all those AI filters on. Yeah, it looks okay. I don't think there's anything where you're like, I wanna go on a hot date so I gotta spruce up the profile, but, I mean, that is somewhat what I look like, so. The last thing I wanna check out is gameplay as it does have a middle ground SoC, so I wanna see if you can still kind of hold up with games kids are playing like, I don't know, Genshin Impact. You ever play Genshin Impact? You wanna join my clan? It does run pretty smoothly, and I am screen recording at the same time. I say this runs pretty decent. It does feel like it's running at the full 60 hertz of the screen and there's minimal hitching that I probably would just chock up again to the screen recording. Though it seems like I've been kind of poo-pooing the fact that it's got mid-range hardware, I do think that it actually has a huge benefit because this has a 5,000 milliamp hour battery, which means that this thing should last you a long time. They actually quote as 37 hours of calling, 19 hours of video playback, or 11 hours of gaming, and that's a long time. My iPhone lasts the day. It doesn't make it into the second day. My Pixel does not make it into the second day and I'm not using these phones super, super intensely. So being able to say that this lasts that long shows that going for something that's maybe not the highest end but just sips away at battery means they can actually use this phone for probably a couple days, which is really hard-pressed to find. Another way to keep down cost is the fact that this doesn't have any 5G. There's no Wi-Fi 6, there's no wireless charger or anything like that, but I feel like a lot of those features aren't super necessary or anything that you're really gonna notice in a day-to-day scenario. 5G is barely available and if it is, you have to be outside standing by a tower. But it does have IP53 water resistance, so that means you can't submerge it but it will do fine the rain. Now, we haven't actually said the price, just that it's cheaper than AirPods. This thing starts at $169. - [Colleague] Nice. - Nice. It can go up from there when you get the higher storage or whatever like that, but if you think about it, the one terabyte SD card that this thing supports could cost more than the phone itself. It's a screaming deal, and there are quite a few players in the space, including Poco's own M5. This thing is $140, but you lose the water resistance, you get some slightly weaker cameras, slower charging. But interestingly enough it has a 90 hertz LCD screen. Another reason why I wish this one was more than 60 hertz, but there's a lot of great options in this price range, but I think this one has a really good balance. Again, that battery life is insane. The cameras were serviceable and the speed, it kept up with Genshin Impact and that's no slouch. Most people just use it for Instagram or emails and this thing should be able to tank through those with a breeze. Obviously this is just a quick unboxing, so I don't know how this is gonna last in the long-term. Again, some of that hardware is already starting to age. If you're in need of a phone or a mobile device just in general as a music player and camera, this seems like it could be a really solid choice. And as someone who's only really used premium phones, I don't think I would be that upset if I had to use this for work or broke my phone or was ready for a replacement and used this instead. It seems like a great stopover, and that price, unbelievable. Thanks so much for watching. Let us know if you want us to cover more budget phones. We haven't really been covering them a lot for some reason. And of course, make sure to like, comment, and subscribe. How the turntables. I like being the guy who yells at people, not the one being yelled at. AirPods third gen, $169.99. With charging case, $179. That counts. (group laughs) - [Colleague] Yeah, I'll allow it.",
    "transcript_keywords": [
        "phone",
        "phones",
        "pretty",
        "Poco",
        "feel",
        "lot",
        "super",
        "screen",
        "pretty decent",
        "kind",
        "thing",
        "bit",
        "camera",
        "face",
        "back",
        "good",
        "Pixel",
        "super convenient",
        "decent",
        "people"
    ],
    "transcript_entity_values": [
        "a couple days",
        "169",
        "long hours",
        "4",
        "90",
        "Pixel",
        "11 hours",
        "eighth",
        "MIUI 13",
        "Netflix",
        "MediaTek",
        "AliExpress",
        "169.99",
        "a couple years old",
        "37 hours",
        "eight megapixel",
        "today",
        "IR",
        "a ton",
        "140",
        "only 60",
        "Today",
        "60",
        "1080P 60 or 30",
        "33 watt",
        "Genshin Impact",
        "128",
        "seventh",
        "first",
        "five-year",
        "AppleCare",
        "two",
        "Pros",
        "SoC",
        "SD",
        "64 megapixel",
        "1080P",
        "eight",
        "UI",
        "the Pixel 7 Pro",
        "700",
        "more than 60",
        "49-day",
        "RAM",
        "Europe",
        "one",
        "USB C",
        "iPhone",
        "Tile Fun",
        "AirPods third",
        "European",
        "North America",
        "M5",
        "2400",
        "these days",
        "a Pixel 7 Pro",
        "Genshin Impact",
        "six",
        "Secretlab",
        "178 grams",
        "Samsung S21 FE",
        "Apple",
        "AirPods",
        "the day",
        "6.43 inches",
        "two megapixel",
        "One",
        "60",
        "64",
        "the second day",
        "Poco",
        "AI",
        "Evo 2022",
        "Instagram",
        "the Mi Remote",
        "179",
        "about 450",
        "four",
        "1,100",
        "James",
        "19 hours",
        "5"
    ],
    "transcript_entity_types": [
        "DATE",
        "MONEY",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "TIME",
        "QUANTITY",
        "DATE",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "LOC",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "NORP",
        "LOC",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "FAC",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "TIME",
        "CARDINAL"
    ],
    "vector": [
        -0.10671435296535492,
        -0.014223568141460419,
        0.07842802256345749,
        -0.03083803877234459,
        0.07919450104236603,
        -0.04487565532326698,
        0.034592073410749435,
        0.010386701673269272,
        -0.02089715003967285,
        0.043261658400297165,
        0.022856511175632477,
        0.015469935722649097,
        0.007467207964509726,
        -0.0599459707736969,
        0.019012371078133583,
        -0.007131942082196474,
        0.08937585353851318,
        -0.08477762341499329,
        -0.06174962595105171,
        0.03414451330900192,
        -0.045064277946949005,
        -0.025033334270119667,
        0.027948632836341858,
        0.039786696434020996,
        0.026980603113770485,
        -0.06717612594366074,
        -0.021617913618683815,
        -0.06509667634963989,
        -0.07454971224069595,
        -0.08926892280578613,
        -0.01676100306212902,
        0.12848931550979614,
        0.011578728444874287,
        -0.041754912585020065,
        0.019617754966020584,
        -0.015576610341668129,
        0.029018281027674675,
        -0.08520640432834625,
        -0.046108875423669815,
        -0.02630866877734661,
        -0.04869562387466431,
        -0.0957237184047699,
        -0.04345935583114624,
        0.028517477214336395,
        0.003360987873747945,
        -0.018401389941573143,
        0.009338687174022198,
        -0.02688184566795826,
        0.011154208332300186,
        0.049193765968084335,
        -0.020945077762007713,
        -0.054135825484991074,
        0.024847060441970825,
        -0.04596451297402382,
        -0.09877774119377136,
        0.005501306615769863,
        -0.07124579697847366,
        -0.008016159757971764,
        0.06705884635448456,
        -0.03601880371570587,
        0.044432707130908966,
        -0.01958407089114189,
        -0.042587779462337494,
        0.0543103851377964,
        -0.006509638391435146,
        0.00028810478397645056,
        -0.017942437902092934,
        0.02082809992134571,
        0.005308100022375584,
        0.02052844688296318,
        0.03201049566268921,
        0.010413219220936298,
        0.04593054577708244,
        0.05950485169887543,
        -0.03284063935279846,
        0.07290248572826385,
        0.07728737592697144,
        -0.0524793416261673,
        0.043904684484004974,
        0.10251357406377792,
        0.012179517187178135,
        -0.03253570944070816,
        -0.04064011946320534,
        -0.024990808218717575,
        0.049269020557403564,
        -0.02769286371767521,
        0.008809557184576988,
        -0.004108370281755924,
        -0.11802750080823898,
        -0.09356234222650528,
        -0.0014672591350972652,
        0.06390361487865448,
        -0.01754024252295494,
        -0.0013866610825061798,
        -0.07328851521015167,
        -0.029894191771745682,
        -0.0731525793671608,
        0.012924686074256897,
        -0.06810472905635834,
        0.060955312103033066,
        0.06049612909555435,
        0.0958624929189682,
        0.03330794721841812,
        -0.0035708933137357235,
        -0.020150601863861084,
        -0.11080624908208847,
        0.01647474430501461,
        -0.028490357100963593,
        0.08872736990451813,
        0.02253872901201248,
        -0.09038669615983963,
        -0.049613162875175476,
        -0.09797055274248123,
        -0.04596617445349693,
        -0.014987513422966003,
        0.029233744367957115,
        -0.06339238584041595,
        0.012501540593802929,
        0.1365717351436615,
        -0.07771168649196625,
        -0.03332093358039856,
        0.031231604516506195,
        -0.05085954815149307,
        -0.0007859985926188529,
        -0.06346584856510162,
        -0.014215330593287945,
        -0.09981878101825714,
        1.418220618120147e-33,
        -0.029381852596998215,
        0.024986635893583298,
        0.05861179903149605,
        -0.017690319567918777,
        0.0683654174208641,
        0.00862240232527256,
        -0.0073086051270365715,
        -0.013685474172234535,
        -0.0007083191303536296,
        -0.0009102249168790877,
        -0.1276349574327469,
        0.03405122086405754,
        -0.021531149744987488,
        0.029295725747942924,
        0.031030772253870964,
        -0.08096768707036972,
        -0.054535020142793655,
        0.005669677164405584,
        -0.0038859087508171797,
        -0.019735772162675858,
        -0.028087301179766655,
        -0.014774907380342484,
        -0.08142142742872238,
        -0.044370245188474655,
        0.12935800850391388,
        0.059479087591171265,
        0.03423416242003441,
        -0.06328072398900986,
        0.04505134001374245,
        0.05262250080704689,
        -0.09999360889196396,
        0.015450319275259972,
        0.06412674486637115,
        -0.07274383306503296,
        -0.05203724279999733,
        -0.002750233979895711,
        -0.045672088861465454,
        -0.04055101424455643,
        0.052400343120098114,
        -0.0712917372584343,
        0.008255577646195889,
        0.0042849332094192505,
        -0.08457639068365097,
        -0.046724431216716766,
        -0.018377838656306267,
        0.0750778391957283,
        -0.012823102995753288,
        0.023114429786801338,
        0.027543455362319946,
        -0.06290090829133987,
        -0.013120986521244049,
        -0.030376262962818146,
        -0.14936593174934387,
        -0.004316841717809439,
        0.00620769988745451,
        -0.11812887340784073,
        -0.01974463276565075,
        -0.0053856102749705315,
        0.050899431109428406,
        -0.0037493675481528044,
        0.011500870808959007,
        0.04122322425246239,
        0.04717465490102768,
        -0.0010207402519881725,
        -0.05172087624669075,
        0.09535112231969833,
        -0.06237969920039177,
        -0.008702630177140236,
        -0.04086682200431824,
        0.0499742291867733,
        0.012763339094817638,
        0.059268519282341,
        0.059296537190675735,
        -0.027597881853580475,
        0.01528258342295885,
        0.018096819519996643,
        -0.03593520447611809,
        -0.060763631016016006,
        -0.001193342381156981,
        0.05135379359126091,
        0.0010148214641958475,
        -0.009331995621323586,
        0.07677888125181198,
        0.025603458285331726,
        0.03655131161212921,
        0.008029212243855,
        0.05298033356666565,
        -0.06498624384403229,
        -0.05818632245063782,
        0.14243084192276,
        -0.033735036849975586,
        0.009438040666282177,
        -0.05776971951127052,
        0.001294841873459518,
        -0.0998910441994667,
        -4.937171415027627e-33,
        0.021981390193104744,
        0.029718728736042976,
        -0.018053267151117325,
        -0.006096351891756058,
        -0.006816069129854441,
        0.010891665704548359,
        0.042273782193660736,
        0.03098134510219097,
        -0.007447788957506418,
        -0.01426085364073515,
        -0.07470034807920456,
        0.0007045138045214117,
        -0.03879500553011894,
        0.018177328631281853,
        -0.0020543711725622416,
        -0.07530324906110764,
        0.00895391870290041,
        -0.07167135924100876,
        0.04011724516749382,
        -0.010201171971857548,
        0.017339540645480156,
        -0.019621919840574265,
        0.030014317482709885,
        0.10848715156316757,
        -0.029566284269094467,
        0.009539580903947353,
        0.05908956378698349,
        0.0002682648482732475,
        -0.017654044553637505,
        -0.028269607573747635,
        -0.05558433756232262,
        -0.07486957311630249,
        0.007061041425913572,
        0.06481277197599411,
        0.04164372757077217,
        0.015506804920732975,
        -0.010936319828033447,
        0.09067181497812271,
        0.006152601446956396,
        -0.03672163188457489,
        -0.010884799994528294,
        -0.04360239952802658,
        0.010323303751647472,
        -0.04647563397884369,
        -0.003150816075503826,
        -0.09763088077306747,
        -0.03636155650019646,
        0.017887551337480545,
        0.0013757465640082955,
        -0.06407159566879272,
        0.014256213791668415,
        -0.006085955537855625,
        -0.000804909854196012,
        0.007902931421995163,
        -0.11154051870107651,
        0.06487153470516205,
        -0.027569007128477097,
        0.005286708474159241,
        0.006686695851385593,
        0.008812732994556427,
        0.050073232501745224,
        0.012880065478384495,
        0.009268306195735931,
        -0.01369194034487009,
        -7.135752821341157e-05,
        0.025021767243742943,
        0.0858803540468216,
        0.05204002186655998,
        -0.04668072238564491,
        0.015666846185922623,
        -0.010451712645590305,
        -0.04222990199923515,
        0.024643398821353912,
        -0.03129436448216438,
        0.019061461091041565,
        0.04818229004740715,
        -0.0162185188382864,
        0.018426163122057915,
        0.08458637446165085,
        -0.04261677339673042,
        -0.05237419158220291,
        0.030294643715023994,
        0.01310731191188097,
        -0.0034373037051409483,
        0.034898146986961365,
        0.005490896292030811,
        0.02070317603647709,
        -0.026641974225640297,
        -0.010292168706655502,
        0.11392992734909058,
        -0.04216843098402023,
        0.04694940149784088,
        -0.03520737215876579,
        0.03398725017905235,
        0.0751243531703949,
        -6.170566280161438e-08,
        0.03311074525117874,
        -0.0039476053789258,
        0.051889363676309586,
        0.04512064903974533,
        -0.038465164601802826,
        -0.012118924409151077,
        -0.017390575259923935,
        -0.007563070859760046,
        0.11241663992404938,
        0.03180614113807678,
        0.060471370816230774,
        -0.0987367182970047,
        -0.09090150147676468,
        0.06323706358671188,
        -0.0283490177243948,
        0.03152307868003845,
        -0.0031681042164564133,
        0.035976678133010864,
        0.0014267219230532646,
        -0.002431100932881236,
        -0.08709677308797836,
        0.0844290480017662,
        0.06919050961732864,
        -0.024740947410464287,
        0.009211951866745949,
        0.02145526558160782,
        0.04330386593937874,
        0.07168545573949814,
        0.13416296243667603,
        -0.017986983060836792,
        -0.0839473158121109,
        -0.01007902529090643,
        -0.054516687989234924,
        0.02645009011030197,
        -0.005698393099009991,
        -0.037694502621889114,
        -0.08941280096769333,
        -0.009491503238677979,
        -0.035591237246990204,
        0.047096021473407745,
        -0.03778250887989998,
        -0.00839927326887846,
        0.025434618815779686,
        0.01282836589962244,
        0.03708117455244064,
        -0.07901575416326523,
        0.030714986845850945,
        -0.10649605095386505,
        0.02400706708431244,
        0.057448431849479675,
        -0.05684226006269455,
        0.02460520714521408,
        -0.01449620258063078,
        0.020627416670322418,
        0.03669731318950653,
        0.020250052213668823,
        -0.006451023276895285,
        0.01563243381679058,
        -0.0548507422208786,
        0.11454085260629654,
        0.00498124910518527,
        -0.11643599718809128,
        -0.02058880589902401,
        0.12938357889652252
    ]
}