{
    "id": "Fer3rT0viuo",
    "title": "App Connected Grill! Traeger Ironwood 885 Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-05-15T16:20:32Z",
    "video_url": "https://www.youtube.com/watch?v=Fer3rT0viuo",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Traeger Grill",
        "Best grill",
        "tech grill",
        "app connected grills",
        "smart grills",
        "what is the best grill",
        "what is the best traeger grill"
    ],
    "views": 146838,
    "likes": 5471,
    "comments_count": 412,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine. And today we are unboxing the Traeger 885 Grill. I am so excited about this. I've actually been looking into getting a grill. And this one is perfect because not only can you bake, grill and smoke in it. You can connect it to wifi and control it with an app. It's basically made for me! A huge thank you to Traeger for sponsoring this video and sending us a grill to check out. Jenna, the top of this says that two people will required for assembly. - [Jenna] All right! - All right, get those assembly fingers ready. This is a wood pellet grill. And what makes this also different, than a lot of normal grills, is you can take it down to a very low temperature. But also take it all the way up to 500 degrees and you can control all of this from your phone. You can also control it on the grill too, but come on. If you can control it with an app, why wouldn't you? There's a safety feature that won't let you turn it on with the phone. But you can control the temperatures and turn it off. So they have a variety of different \"flavors\" of wood pellets that you can get. So the ones that we have here, Signature, this is a maple cherry and an artisanal hardwood. And we've got a Hickory, which is a natural flavored hardwood. And on the back, it'll show you what type of things these are recommended for. So the Signature is pretty much all across the board. Good for basically cooking anything. So the capacity on this is, I can cook 10 chickens, seven rib racks, and nine pork butts. - [Jenna] We need more friends! - We are. Hello, (shouts) does anybody want to come over and have a pork butt? Uh, they also sent me a hat. Oh, that's actually nice because the sun's in my eyes. So they actually sent me three hats, (laughs) which is great. - [Jenna] I think the black looks nice. - You think? Time to unbox. - [Jenna] There's a tag on your hat. - Uh, yeah. This is fashion, Jenna. (upbeat country music) Look how nicely this is packaged! There's also a little secret surprise. This little box actually turns into a little cardboard cabin house. And our little niece loves cardboard boxes. So we're going to turn this into a little cabin for her afterwards. This is the first time I'm not going to recycle this. It's going to be recycled into a home. Is this in the shot? This box says start here. So we're going to, we're going to do that. Oh my gosh it's a note! From the CEO of Traeger Grills! Jeremy. - [Jenna] Does everybody get that note? - Yes. \"I just want to thank you for choosing Traeger and letting us into your backyard.\" You're here. You've infiltrated and I'm happy about it. So here's our assembly guide. They've given us all the tools like I don't have to go and hunt down some tools from my dad. (packaging rustles) They've even put little cup holders for you to put your beverage of choice in. This is it. I like that it comes pretty much put together. You basically only have to put the sides on and the legs. And then you're off to the grilling races. That's cool because Traeger even has a YouTube channel that they have a bunch of recipes on. So I'm definitely going to be checking that out to get some grilling inspiration. Oh my gosh. There's more stuff inside of it. Oh, (gasps) whoa! Everything is very nicely packaged. Um, is that English? And the lever? Oh, \"Remove before use\" okay. whoa! It's just like a never ending surprise. It's cool cause this is actually a convection grill too. So it will be able to circulate the air and the heat to get a nice even cook. And I love a good even cook. I think this is the point where I need to look at the directions. It's that time now. (upbeat guitar strumming) And setup is starting now! Should we high five before we start, or? We did, we did. We removed all the grill parts and stuff. Okay. Here's the legs. Let's flip this around and lay it down and assemble. (music continues) I'd say we lift this up and we tighten up the screws. This is great, I'm so hungry. The unfortunate reality is I still need to go to the grocery store to get the foods that I'm going to be grilling. So I think grilling is actually going to happen tomorrow. There's someone coming down the driveway. - Who? - I'm unsure. Do you think they want to help us? - Is that our mom? - Is that our mom? Oh it is. - That's our mom! - That's our mom, Mom's home! So maybe she's going to help us with the grill! Go for it! Just go for it! There's even wheels on this thing, look. This is like all terrain. So now, Jenna, we need to put this on. I'm going to need your assistance. It's in! Look at that! - Woo! - You guys can tell that the sun has now shifted slightly. We did a good job. Well look, no, this needs to go somewhere too. This is our little side table. Well, it looks like everything is all set up. I'm going to now sync this to the app and do the rest of the setup process. (smooth country music) Okay. It's time to name the grill. I've got it all connected. \"Sir-Ribs-A-Lot? Stoked on Smoke. Baby Got Brisket.\" Shall I come up with a custom name? - [Jenna] You can do custom? - Yeah. - [Jenna] What about iJust Grill? - Oh, iJust Grill. - (mumbles) (laughs) Okay. We're going to do that. All right. \"Welcome to the wood fried revolution, for true grilling for,\" oh man, this is great. Yeah, give me all the notifications. Send me everything. We have to season our grill. \"This is to be used on the initial firing only.\" We need to prime the auger. It's priming. Ignite. Oh my gosh, it's igniting. (grill hisses softly) This is our first ignition. We've got accessories. Look at this! Fancy, look how professional. Goodness. We've got Traeger barbecue sauces. We've got a grill cleaner, all natural. (surprised gasp) We need these. Oh my goodness, look. An internal temperature guide. Magnetic tool hooks. More barbecue sauce. Pork and Poultry Rub. Wow. This is so incredible. - [Jenna] Oh my god! - I smell it too. - [Jenna] Smells good. - Oh, it smells like a campfire. Oh, it's starting to get warm. It's happening. Here's our grill cover. Oh yeah. We're up 82, 83 degrees. (music continues) It is the next day. And we actually covered the grill last night. And good thing because currently I'm in the East Coast and there was a downpour. So the grill is protected. I have been inside preparing a feast. I've got steaks, I've got chickens. I've got cauliflower, broccoli, potatoes. I think I got something else as well. I'm also going to make chocolate chip cookies for dessert. There's a bunch of recipes that I've kind of followed but I've sort of mix and matched some things. And I'm gonna try to make all of these things at the same time on this grill. There's so much space in this thing. So that kind of gives us a real opportunity to make a bunch of different things. At the same time. I'm also can use this internal temperature for the chicken. Also gotta fill up my pellets. (pellets rattle) (music crescendos) Just got a notification from the Traeger app that my grill is pre-heated. Now we're going to put all of this stuff on the grill and I just want to be completely honest with you guys. I've never really done much grilling in my life. So I don't entirely, a hundred percent, know everything about grilling. So I'm not claiming to be an expert. But what's great is, with the app, I feel like it's giving me all of the knowledge that I need to know. And you know what? You live and you learn. So today, you guys are witnessing history. (grill hisses) Woo! Toasty! I've got some of the rub on this one. And then on this guy, I've got another one of the barbecue sauces. So this chicken, I have a nice little Italian seasoning marinade that my mom actually made. So this is, uh, this one's for my mom. Got the chicken marinading in some of the Traeger barbecue sauce. These are some potatoes with a little garlic seasoning and some random butter that I found in the fridge that looked kind of good. So I threw it on there. This is a Parmesan Broccoli Cauliflower recipe that I found on the Traeger recipes. I also threw some garlic in there because why not? Oh my gosh our kabobs too, I got so much food. Good luck, little buddies. Now we wait. (tense music) I just got a notification that my chicken has reached the internal temperature of 165. Grill probe 166. I was aiming for 165. So guess what guys, I'm going to take a little peek at it. Look at this. Look at those little grill marks! I think I should've put it this way. I feel like that's what you're supposed to. I put it the wrong way. I just learned something. And so did you guys. You guys aren't done yet either. Everything is still cooking. I'm gonna give the chicken a few more minutes, just cause I like mine kind of done a little extra. And then we'll take them out. And then we'll kind of monitor everything else that's happening in here. And then we eat! The chicken is ready. - [Jenna] It's probe-ably done. - It's, oh my gosh, ha! \"It's probe-ably done.\" This looks delicious. Okay. I'm going to put this into this chicken. They get that temp. (probe beeps) Chicky. Okay, these are marinated ones. I think these actually might be ready. - [Jenna] It's hot! - Oh my God, it's incredible. Oh, is that good! I think we're, like, fricking ready, actually. We're set. (grill hisses) I got a whole meal right here. Our potatoes are needing a little extra care. - [Jenna] Those look good. - Yeah, those are pretty much good to go. Look at that. - [Jenna] It's very nice. - I know, presentation is everything. My feast is complete. Now it's time for a taste test. Complete is a lie, because the potatoes are still cooking, but we can get to those after. Broccoli taste test. (muffled) Well, I like how these little, I shouldn't talk with my mouth full. (garbled) This is a taste test, for real. The broccoli was incredible. Let's taste this chicken. So this, I used the Traeger barbecue sauce on it. Oh, that's good! It has like a little hint of sweetness. Okay the steak. I also used the rub and the Traeger barbecue sauce on here. Oh, that's good. I can't believe is the first time I've ever grilled. I'm pretty impressed with the outcome, Jen. - [Jenna] Looks good. - Maddie is also excited. I'm gonna get a little of this vegetable to see how that cooked. Mm, this is good. I put a little butter, pepper, and sea salt flakes on the kabobs. I've been looking forward to this since yesterday when we un-boxed the thing. We're going to get a small taste of mommy's meal, okay? You ready? Lay down. All the way down, all the way down. Good boy. Is that Maddie approved? Good boy. The sun is going down. So we might be making some nighttime chocolate chip cookies. But we have to test out the baking in this thing. Super hyped about that. I'm going to finish my meal, then get ready for dessert. Mm, so good. I forgot about the potatoes! I was prepping my cookies, before the sun sets! - Whoa! - Oh, those look good! Look how nice this one is. Get over there. These actually look so good. We gotta get this to 350 degrees. I should've just left them on the baking sheet, but I, uh, I didn't because I got nervous. You can actually go into the cookie recipe and hit \"Make\" and it'll set the timer and do everything, basically, for me. There it goes, \"Begin Cook.\" It's happening. They're already cooking! Oh boy. Let's go have some potatoes and wait for our cookies. Oh, I'm hyped! Sun is going down. The moon is coming up and long ago somebody has left with the cup. Checking on the cookies. Oh wow! They're actually looking really good. I need to go get some sea salt to add to the top for a little extra flavor bang. Oh my God, these look incredible. Whoa. Some sea salt flakes. (shaker rattles) (sniffs) We'll let them cool off for a second. (smooth rhythmic music) And the taste test. (cookie crunches) I mean, I've never had a chocolate chip cookie that was made on a grill. It's interesting cause it has like slight little, like, smokey taste to it. But it tastes so awesome with these salt flakes. Oh, my goodness Jenna. - [Jenna] Oh yeah. I'll get in on that. - Get in on that. A huge thank you to Traeger for sponsoring this video. They have some incredible videos on their YouTube channel. I'll put a link in the description. If you want to check that out. And also a link to the grill that I have. If you guys want to check that out and all of the incredible accessories that they have to go with it. I'm going to finish up this cookie. And we'll see you guys in the next video. Peace. Here Jen, which one do you want? - [Jenna] Oh, I'll pick one. - Okay. There you go. - [Man] Good job guys. - Thanks dad. (smooth rhythmic music)",
    "transcript_keywords": [
        "Grill",
        "Good",
        "Traeger",
        "Traeger barbecue",
        "put",
        "Traeger barbecue sauce",
        "guys",
        "chicken",
        "Time",
        "mom",
        "Justine",
        "Traeger Grills",
        "taste",
        "grilling",
        "yeah",
        "barbecue",
        "nice",
        "potatoes",
        "control",
        "ready"
    ],
    "transcript_entity_values": [
        "83 degrees",
        "English",
        "Signature",
        "nine",
        "a hundred percent",
        "Italian",
        "166",
        "second",
        "one",
        "Hickory",
        "Broccoli Cauliflower",
        "Justine",
        "three",
        "165",
        "Begin Cook",
        "up to",
        "Signature",
        "Toasty",
        "iJust Grill",
        "the next day",
        "YouTube",
        "un",
        "iJust Grill",
        "Complete",
        "Maddie",
        "500 degrees",
        "Mm",
        "Jen",
        "the East Coast",
        "885",
        "a few more minutes",
        "Mom",
        "today",
        "two",
        "seven",
        "Jeremy",
        "350 degrees",
        "Sun",
        "Traeger",
        "10",
        "first",
        "tomorrow",
        "last night",
        "Grill",
        "Traeger Grills!",
        "82",
        "Jenna",
        "yesterday"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "LANGUAGE",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "NORP",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "GPE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "LOC",
        "CARDINAL",
        "TIME",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "TIME",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE"
    ],
    "vector": [
        -0.06224031373858452,
        -0.0758693516254425,
        -0.11937898397445679,
        -0.08571106195449829,
        0.007122351787984371,
        0.021730894222855568,
        0.06206562742590904,
        0.031634796410799026,
        -0.01855202205479145,
        0.03645884990692139,
        0.03462374210357666,
        0.006971272639930248,
        -0.02726156637072563,
        -0.026835046708583832,
        -0.00617445120587945,
        0.04441152513027191,
        0.0396122969686985,
        -0.07400065660476685,
        0.008984760381281376,
        0.010059324093163013,
        -0.03650260716676712,
        -0.020992092788219452,
        0.010393228381872177,
        -0.020488474518060684,
        -0.013814909383654594,
        0.03729567676782608,
        0.005936780478805304,
        0.07788896560668945,
        -0.08707231283187866,
        -0.07995230704545975,
        -0.026262186467647552,
        0.012208595871925354,
        0.05041506886482239,
        0.010156197473406792,
        -0.002437771297991276,
        -0.032190460711717606,
        0.034330662339925766,
        -0.008676555939018726,
        -0.058761488646268845,
        0.0046906075440347195,
        -0.0062839495949447155,
        -0.05404128506779671,
        0.01338876411318779,
        -0.03246362879872322,
        -0.10552003979682922,
        -0.10537313669919968,
        0.020452238619327545,
        -0.025742992758750916,
        0.059418871998786926,
        0.06660794466733932,
        -0.08196183294057846,
        -0.03763149306178093,
        0.07741176337003708,
        0.02840311825275421,
        -0.09169329702854156,
        0.01174529641866684,
        -0.08766365051269531,
        -0.002863109577447176,
        0.044734787195920944,
        -0.0896623358130455,
        0.053436629474163055,
        -0.03281846642494202,
        -0.004608906805515289,
        0.04448577016592026,
        -0.04807164520025253,
        -0.042819708585739136,
        -0.006573600694537163,
        -0.008674475364387035,
        0.010003863833844662,
        -0.01428964827209711,
        -0.09467117488384247,
        0.08384943753480911,
        -0.06914263218641281,
        -0.014267638325691223,
        -0.004600710701197386,
        0.07320824265480042,
        0.06320738047361374,
        -0.09524156153202057,
        0.01436268724501133,
        0.022684207186102867,
        0.013008438050746918,
        -0.03278065845370293,
        -0.10191141813993454,
        0.0020940827671438456,
        0.0018242031801491976,
        0.019744472578167915,
        0.00022574754257220775,
        0.030628306791186333,
        -0.03838259354233742,
        -0.03552762418985367,
        -0.06923210620880127,
        0.020938396453857422,
        -0.009459336288273335,
        -0.003486931324005127,
        -0.04989822953939438,
        -0.032747745513916016,
        -0.019209418445825577,
        -0.038909316062927246,
        -0.05339095741510391,
        0.0841677337884903,
        0.03545386716723442,
        -0.052310843020677567,
        -0.010683511383831501,
        -0.046864043921232224,
        -0.02673792466521263,
        -0.11564669013023376,
        -0.04523954167962074,
        0.09136571735143661,
        -0.0021313237957656384,
        -0.03211842104792595,
        -0.02467222325503826,
        0.0254947692155838,
        -0.03757396712899208,
        -0.0474541001021862,
        0.056951213628053665,
        0.08183303475379944,
        -0.012983203865587711,
        0.052593182772397995,
        0.022606071084737778,
        0.01830309070646763,
        0.01413464080542326,
        -0.01567506045103073,
        -0.010468564927577972,
        0.07714910805225372,
        0.03601302579045296,
        0.06178642436861992,
        -0.044439204037189484,
        1.3220157543588516e-32,
        -0.00022395742416847497,
        0.07925888150930405,
        0.010441790334880352,
        0.05030499026179314,
        0.027864394709467888,
        -0.02077587880194187,
        -0.08213219791650772,
        0.050578515976667404,
        -0.04713188484311104,
        0.08289635181427002,
        -0.016626138240098953,
        0.05667547136545181,
        -0.03408907353878021,
        -0.007318524643778801,
        0.04658244550228119,
        -0.053554635494947433,
        -0.009013206698000431,
        -0.029738059267401695,
        -0.0352729894220829,
        -0.008975299075245857,
        0.0020256866700947285,
        -0.004176328424364328,
        0.033486053347587585,
        0.07181426137685776,
        0.09704115241765976,
        0.14505639672279358,
        0.06852154433727264,
        0.0417279377579689,
        0.05913597345352173,
        0.012033049017190933,
        -0.00011088429164374247,
        -0.05402470380067825,
        -0.044364456087350845,
        -0.09990397840738297,
        0.024996047839522362,
        -0.023123107850551605,
        -0.09122475236654282,
        0.01952580362558365,
        -0.08016128838062286,
        -0.03337922692298889,
        0.004340604413300753,
        0.009379294700920582,
        -0.10770083963871002,
        -0.020543066784739494,
        0.062202613800764084,
        0.013768667355179787,
        0.027019331231713295,
        0.08712168782949448,
        -0.03333694115281105,
        0.018037162721157074,
        -0.04851251095533371,
        0.008596404455602169,
        -0.011177504435181618,
        0.0397588387131691,
        -0.030077647417783737,
        -0.06880021095275879,
        0.019878001883625984,
        0.06342806667089462,
        0.05081896856427193,
        0.03423980250954628,
        0.05413582921028137,
        0.003704825649037957,
        -0.02912845090031624,
        -0.042399801313877106,
        -0.07737263292074203,
        0.07990548014640808,
        0.10136252641677856,
        -0.039652060717344284,
        0.027764055877923965,
        0.04219233617186546,
        -0.006898270919919014,
        0.011800008825957775,
        0.09557940810918808,
        0.01610608398914337,
        0.036489345133304596,
        0.0403301939368248,
        -0.10550417006015778,
        -0.08806648850440979,
        -0.001607992104254663,
        -0.0036884595174342394,
        -0.11362510174512863,
        0.010813174769282341,
        0.005125410854816437,
        0.0778239369392395,
        -0.047027502208948135,
        -0.07264363765716553,
        0.03742281720042229,
        -0.02439480647444725,
        -0.010162231512367725,
        0.025842487812042236,
        -0.05192716047167778,
        0.09944649785757065,
        -0.06672102957963943,
        -0.016964174807071686,
        -0.021991657093167305,
        -1.2815590591601887e-32,
        -0.0004316765407565981,
        0.015999019145965576,
        0.019508110359311104,
        -0.043492186814546585,
        0.03747986629605293,
        -0.01909126155078411,
        0.018705332651734352,
        0.08376438915729523,
        0.03532985597848892,
        -0.07314027845859528,
        0.09864414483308792,
        -0.036820024251937866,
        -0.09385545551776886,
        -0.022293539717793465,
        -0.0016433654818683863,
        -0.026335816830396652,
        -0.05153950676321983,
        -0.06391523033380508,
        0.07217524200677872,
        -7.236973033286631e-05,
        0.05348784849047661,
        0.11103173345327377,
        0.07942236959934235,
        0.0325092077255249,
        -0.018327420577406883,
        -0.002491522114723921,
        0.028206950053572655,
        0.07386557757854462,
        0.03075774759054184,
        0.08062397688627243,
        0.032429035753011703,
        -0.01288783922791481,
        -0.013815883547067642,
        -0.007466080132871866,
        -0.00750197097659111,
        0.04253225773572922,
        0.0847264975309372,
        0.06120939925312996,
        0.030669335275888443,
        -0.08704491704702377,
        0.06240325793623924,
        -0.01572204753756523,
        0.0019068532856181264,
        0.02810855023562908,
        -0.06916123628616333,
        -0.0892120897769928,
        -0.054777998477220535,
        -0.013168958947062492,
        -0.06332146376371384,
        0.03742266073822975,
        -0.03215251490473747,
        -0.0837184339761734,
        -0.030278638005256653,
        0.012972488068044186,
        0.02574283443391323,
        0.00782329123467207,
        -0.029386406764388084,
        0.012280572205781937,
        0.02042708359658718,
        0.03455103561282158,
        0.04635845869779587,
        -0.043300651013851166,
        -0.042306557297706604,
        -0.05018322169780731,
        0.06203502044081688,
        -0.03458869457244873,
        0.059233684092760086,
        0.07454843819141388,
        0.010534239001572132,
        0.03281935304403305,
        -0.03425939008593559,
        0.05213117599487305,
        0.03028017096221447,
        -0.01518823578953743,
        0.05911199375987053,
        0.00048487616004422307,
        -0.07488705217838287,
        0.00010811834363266826,
        0.058261528611183167,
        -0.04186642915010452,
        -0.09565026313066483,
        -0.03511057049036026,
        -0.00030264336965046823,
        0.061619341373443604,
        0.10660295933485031,
        0.037568747997283936,
        0.07425983995199203,
        0.026580337435007095,
        0.007566654123365879,
        0.054440274834632874,
        0.003267499152570963,
        0.039543505758047104,
        0.06797179579734802,
        0.06510204076766968,
        -0.143087238073349,
        -6.280406239511649e-08,
        -0.022043056786060333,
        0.031019212678074837,
        -0.0651233047246933,
        -0.03307940810918808,
        0.0046262843534350395,
        -0.09026283770799637,
        -0.013856111094355583,
        0.0056693702936172485,
        0.024989131838083267,
        -0.031511519104242325,
        0.059454601258039474,
        -0.0040714624337852,
        0.005409575533121824,
        0.13791126012802124,
        0.029945895075798035,
        -0.0012942133471369743,
        -0.12160824239253998,
        0.07338018715381622,
        -0.014110306277871132,
        -0.04663768410682678,
        -0.03742620721459389,
        0.05158661678433418,
        0.04396752640604973,
        0.0017865386325865984,
        0.06616068631410599,
        -0.0249041635543108,
        -0.02761164866387844,
        -0.024314992129802704,
        0.047240644693374634,
        0.010075460188090801,
        -0.09061441570520401,
        0.034073445945978165,
        -0.0032882497180253267,
        -0.012281096540391445,
        -0.052978720515966415,
        0.012699189595878124,
        -0.0939873605966568,
        -0.007694896310567856,
        -0.01106944028288126,
        0.02471865713596344,
        0.008355371654033661,
        -0.1072283685207367,
        -0.09229301661252975,
        -0.02962491288781166,
        -0.008531291037797928,
        -0.04173782840371132,
        0.02192695625126362,
        -0.023982994258403778,
        -0.01539287157356739,
        -0.005138569977134466,
        -0.04124819487333298,
        0.03164764121174812,
        0.07658731937408447,
        -0.0661165788769722,
        0.05917390435934067,
        0.00045975332614034414,
        0.0477086640894413,
        0.03337329253554344,
        0.041402775794267654,
        0.017664778977632523,
        0.045396093279123306,
        -0.017671717330813408,
        -0.07862859219312668,
        -0.025024088099598885
    ]
}