{
    "id": "fGO0f1Krp4Y",
    "title": "The WILDEST Tech I’ve Ever Tried - Meta Orion",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2024-09-29T15:01:56Z",
    "video_url": "https://www.youtube.com/watch?v=fGO0f1Krp4Y",
    "category": "Science & Technology",
    "tags": [
        "Meta AR",
        "Orion project",
        "augmented reality",
        "future of computing",
        "smart glasses",
        "Meta Connect",
        "Reality Labs",
        "EMG technology",
        "VR alternative",
        "wearable tech",
        "next-gen computing",
        "AR glasses",
        "Meta CTO interview",
        "Meta Quest",
        "Ray-Ban Meta",
        "Orion",
        "Meta Orion",
        "Meta CTO",
        "Andrew Bosworth",
        "Boz",
        "Quest 3S",
        "Meta Quest 3S",
        "Austin",
        "Evans",
        "Austin Evans"
    ],
    "views": 298277,
    "likes": 6581,
    "comments_count": 549,
    "description": "Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   I got an exclusive look at Meta's revolutionary Orion AR glasses and it is WILD. This isn't your typical VR headset - they're lightweight true AR glasses that blend the digital and physical worlds seamlessly. While still in development, Orion feels like a genuine leap forward in computing. I also got  to interview the CTO of Meta, Andrew Bosworth AKA Boz about the development of the Meta Orion.  Chapter Titles: 0:00 What is Meta Orion? 2:54 Meta Quest 3S 3:38 Using Orion 5:31 Interview with Boz",
    "description_links": [
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- I just tried one of the coolest pieces of tech I have ever seen. So Meta were very kind and invited me out to their campus ahead of Meta Connect this year to try one of the most interesting pieces of tech that I have ever gotten my eyes on. Now you're likely familiar with VR, whether it be the Meta Quest or realistically even something like the Apple Vision Pro. It is a way to put yourself in a different environment. It's a very immersive experience, but there are a lot of downsides. It's big, it's heavy. Battery life isn't great. And the passthrough that you see, is entirely based on cameras, which let's be honest are never as good as the real world. Now, on the other side of the equation, you have something like the Meta Ray-Bans. So, I can easily capture a photo. But Orion is something different. So, the basic idea is that take something, like Meta Ray-Bans, and build an entire computer in them. First and foremost, you have actual displays in the lenses, but they're not just like fully passive sort of displays. You have two little projectors in silicon carbide lenses. And what that means is that those projectors can display an image over the top of the real world. And I will say that I used it in a room that was relatively well lit and it was good. Now, clearly not perfect. First of all, I need prescription lenses and I didn't- not have contacts or something, so everything was a little bit blurry. So, I can't really judge just how sharp it was, but it looked quite good. And importantly it was very bright, it was very saturated, but I still had pretty much full passthrough, right? Like the actual level of like tint for the lens was incredibly low. Like you really did feel like you're just wearing a regular pair of glasses just with a little bit of distortion from the fact that they do have two individual lenses to let all the light through. Now, on top of that, there was a bracelet. The bracelet was not a hand controller, but rather it picks up the electrical impulses of your fingers and sends that over to the headset. If you've tried something like the Apple Vision. It has cameras facing down, so you can like use like little pinch gestures, kind of like at your lap or something. It works really well. But with this, you can have your hands anywhere. You can have it behind your back. Essentially what it does is, paired with eye tracking, you can look at anything and just pinch your fingers. You know, you can swipe. And on top of that, it actually has haptic feedback. So as you're tapping stuff, you're feeling it, not only with the actual fact that your finger is touching your other finger, but you're actually feeling the bracelet give you a little bit of a vibration. Now, there is a separate little puck that has some of the computing in it, but it's entirely wireless. And honestly it's tiny, you could easily put it in a belt or in a pocket. It was actually quite high frame rate, as well. So, it was running at 90 hertz on the headset, it's being up sampled from 45 via the actual wireless link. It's obviously not a complete thing, right? Like this is very much sort of gen one. They are not selling this version. I've heard that if they were going to sell this thing it would be absurdly expensive, like maybe like 10 grand or something, right? But, they're clearly developing this technology and this is kind of like the end game for all of the VR and AR stuff that Meta have been building over the years. Now, they're still making headsets. In fact, they actually announced, at Meta Connect, a new version of the Meta Quest. So there is a brand new Meta Quest, which is, even though it may be not as quite exciting, is really a major step forward. So this is the Meta Quest 3S. This is a $300 version of the Meta Quest 3. Now, there are some minor sacrifices. It does use similar lenses and a display from the Quest 2, but it does have pretty much everything else that is going to be a match for the Quest 3, including the same processor, the same full color passthrough. It actually even has some additional upgrades including an IR camera. And while the Quest 3 has got a price cut to $500, the Quest 3S is available for $299. And I think that's a really strong value. But, the thing that's much more exciting, to me, really is Orion. Now, I was able to try a lot of demos, so I was able to jump on like a WhatsApp call. I was able to scroll Instagram. First and foremost, the displays are really good. But there's a lot of individual pieces layered on top of that. The tracking is really quite solid. So, much like if you've ever used a Meta Quest or an Apple Vision, you can put a window and it will stay there in space. On top of that, you can take advantage of looking around and tapping to actually navigate, versus something on the Quest today where you actually have to either use the controllers or use your hand. So, definitely feels more advanced on that standpoint. You also have Meta AI built in. So, one of the demos I got to try was that there was a list of ingredients and I can look at it and just tell me like, \"Hey, gimme a recipe.\" And not only did it take a look at everything and sort of create a recipe, but it actually have little tags floating over each item. It's a little bit transparent. So, like if I was talking to someone and I had a window over their face, I couldn't really see it too much. The fact that it felt like there was no compromise, I was just wearing a regular pair of glasses. They just happened to let me walk around and be like, scrolling Instagram by myself. Like that's a crazy idea. This is the first piece of tech I've seen in so long, where I tried it- I stepped outta the demo and the only thing I could say was, \"Holy (quack).\" And while, the demo I tried was certainly not perfect, this is a working version of it, right? This is a concept right now, but it seems very clear to me that this is going to be an actual shipping product at some point. Hopefully in the not too distant future. I- this is the first time I've ever tried a product that feels like it's a smartphone killer. It really does. And that sounds like a crazy thing to say. And maybe it won't fully replace a smartphone. It might not. And you do have to wear the bracelet, which is going to actually get that super high fidelity data when you're moving your fingers. Like, it's not a super seamless as just literally putting on glasses. But it's not far off. And I've come away with this thinking that all the billions and billions of dollars that Meta has poured into the Reality Labs project. All the years they've spent developing the Oculus and the Meta Quest and the Meta Ray-Bans. All these things are coming together in the product that we've all kind of hoped for. And I'm incredibly excited to try Orion when it actually comes out. Immediately after my Orion demo, I had the opportunity to interview Boz, who is the chief technology officer at Meta and essentially the guy who's made all of this possible. First of all, thank you so much for taking the time. I'm sure you're incredibly busy this week. If you look at what Reality Labs has done over the last, you know, several years, right? You look at how Quest has evolved. You look at the Meta Ray-Bans, which I think have been a really fascinating, at least from the outside. What's your sort of overall feeling on kind of where, what you've built is right now and how that looks like it's going into the future? - The- an investment horizon that we've taken on with the Reality Labs is pretty uncommon. And so you're looking at, okay, we knew when we started AR work, it was gonna be 10 years to the Orion that you just got to try. - Yeah. - You expect two things. First of all, along the way you're gonna discover a bunch of things that you thought would work, that don't work. But what's been nice is now you're also finding things that you didn't anticipate when you started, but because you've been making the investment, you're within striking distance when the time is right. And the same has been true for for, yeah, for the Ray-Ban Meta product. We've got this amazing product that we designed without even a thought to AI, at the time. - Really? - No! The first time we built it, in fact, it wasn't until months before launch that we were like, \"You know what? We should get our AI assistant in here and make these AI glasses.\" It's taken a little discipline to remind our industry what it takes to actually innovate in hardware. - Yeah. - And, and I think, you know, what's fun about the moment we're in now is you're starting to see where it's going - Really feels like it leads up to Orion, right? Like, so I tried it literally like five minutes ago. I literally stepped from the demo, oh hey, I'm late. Hey, what's up? So where- how long have you wanted to make that product and how- I'm sure the answer forever. - Yeah. - But like how, at what point did this start to come in focus, where you're like, oh, wait a minute, this is starting to come together. This is starting to come together. Where you actually think like this is a viable thing? - I have two answers to this question. One of which is we've wanted this forever. We've wanted this as kind of an industry as long as we can imagine it, right? Like, and it goes deep into the science fiction, you know, history. And also this product was, you know, 10 years from when the research started, five years from when officially the Orion program started, little over five years. And when we started it, we thought there was a 10- I have all these documents I was reviewing recently. We have a, we thought we had a 10% chance, less than 10% chance, of actually being able to build one. You know, as recently as two years ago, we were just like, really not sure we could do it. There was like a lot of- it was, it was challenges in the program. We needed some breakthroughs. And then a year ago, was the first time I put on just the display workings. There was no software stack running yet, so you couldn't see the operating system. And it was magic. You were like, oh my God. Like, we've at least done something here. (Austin laughing) But it wasn't until this summer that I got to try it with the system working that I kind of had that meaning- that feeling of like, holy (quack) (quack). It's from a consum- from a product standpoint, it's ready. It's absolutely ready. It's not the price point that I think is ready for consumers yet. (Austin laughing) So that's like, that's the next big piece of work to do. And this, what trade offs do you have to make to get there and how do you get there? This- there is a future beyond the smartphone. Like there is, I love the smartphone. Smartphone's amazing. But there is actually a future beyond it. There is even a set of better things that we can go do. - [Austin] I know people always like to go like, \"Oh, it was like the first time you did like a pinch-to-zoom,\" or something. But it kind of felt like that to me of like, wow. - [Boz] Actually it's funny that you used pinch-to-zoom as an example. I think the work that Apple pioneered on Multitouch and making that feel so natural to all of us is an analog we look to. I think we look back to Xerox Park and the work that were doing on mouse and keyboard interactions. And this is one thing, to your point earlier about how these things come together or they don't. There's a tremendous technological underpinning that they share, which we're very excited about. And I think with EMG, we're just at the very beginning of what it's capable of. But then there's also, like, how you use them is it can be described in similar terms, but it's different in the same way that the phone and the laptop are different. And so when you're out and about in the world, how you wanna interact with the digital world is just very different than how you do when you're, you know, on a plane, in your house, you know, someplace more stationary where you're gonna have a headset on. So, I think like they're both valuable. You can obviously do things in virtual and mixed reality that you can do no other way. Not even with augmented reality glasses. So we also like, are trying not to overly homogenize them and let them be what they naturally want to be on their own terms. There they are, yeah, here we go. - Oh my- that's what it looks like on the inside. - Yeah, we gotta do the wide shot for these ones, guys. (Boz chuckles) This is, these ones actually have a problem, which is the, the plastic that we had to use to make these clear is thermally not as conducive. - Yeah. - So these ones, they work in the sense that like you can turn them on, but they actually will power down pretty quickly because the thermals aren't right. This version doesn't have what's called disparity correction. So as your lenses flex relative to one another, we don't want the image, to like, go blurry on you. So we wanna keep them stacked. The next version that we're building does have disparity correction. And so, this stack right here gets much thinner, actually about half as thick. - Oh, wow. - 'Cause the protector comes in from the back at that point. What's crazy about this, is you see, this is the Steve Jobs test, right? Where he took the iPod and he threw it in the fish tank and was like, there's bubbles. That means there's air in there. There's no bubbles. Like you throw this thing in a fish tank, you're not gonna see anything. - You're doing a fair bit of processing? I know obviously you've got this which is where the majority of battery and processing is happening. - That's right. But you're still doing, my understanding, is some of the like actual detection when it comes to like the cameras with having to pass through. - [Boz] That's right and the reprojection - Reprojection. - Because we couldn't deal with the latency of your head moving is too great to send it to the puck and back. - [Austin] I was gonna say, I did not really detect a whole lot of latency. Like there's like the Pong game especially, or the game where you were shooting at the- - [Boz] Yeah, Stargazer. - Stargazer, yeah. I was just like playing that. It's like you're like diving and ducking your head around. It's like it felt really quick. It reminds me of did you ever play the Vectrex? - [Boz] Yeah, of course. - Yeah! That reminded me. I was being like, oh, this feels like the Vectrex. Or obviously, like you know, it's like an Atari 2600, or something. - Totally. - But in the best way, 'cause it's floating. It's like the whole thing is like fully 3D. - I always try to undersell and over deliver. I just think it's the most advanced consumer electronics we've ever tempted as a species. It's crazy. Like, it's like- - That's cool thing to say. - [Boz] How much stuff is in there? - What's the next step? Like what, what do you, what do you need to do to get this into people's hands? Whether it's developers or beta testers or me or you know. - Totally. Absolutely. Yeah, that's right. Next goal is to get it to be cost effective. We've gotta get it to a price point where people feel like, okay, this is something that I can, like, even though there- it's early and there's not a huge number of kind of software that for it yet. Not a big developer system for it yet. Like I'm getting value of it. So, there's a bunch of trade offs that we will have to consider as we look at the next generation. We are well on our way. We actually have, not just the one next generation, we have two next generation products that are already in development. Now, you know, with us, you've seen the rumors. Some of them will make it to production, some of them will not. But we have many, many prototypes that were stacked following this one. - Actually, are there cameras on- (Boz chuckles) Why are there cameras on the the puck? - This is where we're gonna get real exclusive content here. - Ooh, excellent. - In an earlier version of this, we were trying to play with, what else could we want this thing to do? And so, yeah, you know, using it as like a camera where it's like, hey, it's you put this on the table, but we've actually been finding out that the most important thing we can do with this, is we can not worry about it. - Yeah, yeah. (Austin laughs) - It's like the number one goal that we have for this one is like, yep, have it somewhere nearby and just don't worry about it. And then for the most part, focus on the interactions that you're having naturally with that. So, there's like one less fussy thing to deal with. - That's phenomenal. Thank you so much for taking the time. - Thanks for having me. - If you have an extra Orion floating around, I volunteer as a beta tester. - So kind of you, so generous. (Austin laughs) Yeah, absolutely. - I had some questions. The version that I tried certainly was not final, in any way, whatsoever. I think the price is probably gonna be the big one. The lenses, while they're incredibly impressive, are also probably not gonna be what they're going to ship. And there was a little bit, because there's two pieces of silicon carbide, you can see a little bit of like kind of reflections in between the two lenses. So, it is not a 100% match for just, you know, real glasses. And the holograms aren't like completely real, but like it's pretty close. And honestly, I am incredibly excited to see what this thing looks like when they finally ship it. (funky music)",
    "transcript_keywords": [
        "Meta Quest",
        "Meta",
        "Quest",
        "Yeah",
        "thing",
        "Meta RayBans",
        "Meta Connect",
        "Orion",
        "kind",
        "things",
        "Apple Vision Pro",
        "Apple Vision",
        "years",
        "lenses",
        "RayBan Meta product",
        "product",
        "time",
        "version",
        "bit",
        "Reality Labs"
    ],
    "transcript_entity_values": [
        "Pong",
        "little over five years",
        "Xerox Park",
        "Stargazer",
        "this year",
        "the Meta Quest",
        "EMG",
        "the Quest 2",
        "months",
        "Meta",
        "Multitouch",
        "Quest 3S",
        "Vectrex",
        "first",
        "Steve Jobs",
        "Atari 2600",
        "VR",
        "billions and billions of dollars",
        "Meta Quest",
        "WhatsApp",
        "Apple Vision",
        "Reality Labs",
        "Instagram",
        "less than",
        "two",
        "the Apple Vision",
        "300",
        "Austin",
        "Apple",
        "Meta AI",
        "this week",
        "100%",
        "Oculus",
        "the Apple Vision Pro",
        "five years",
        "the years",
        "the Reality Labs",
        "one",
        "500",
        "IR",
        "AI",
        "Orion",
        "Meta Ray-Bans",
        "Quest",
        "like five minutes ago",
        "this summer",
        "Meta Connect",
        "90",
        "10 years",
        "a year ago",
        "about half",
        "iPod",
        "299",
        "10%",
        "45",
        "a minute",
        "Orion",
        "several years",
        "two years ago",
        "One",
        "today",
        "Boz",
        "First",
        "the Ray-Ban Meta"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "FAC",
        "PERSON",
        "DATE",
        "EVENT",
        "ORG",
        "EVENT",
        "DATE",
        "ORG",
        "ORG",
        "LAW",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERCENT",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORG"
    ],
    "vector": [
        -0.0161586944013834,
        -0.03320883587002754,
        -0.0016838848823681474,
        -0.08868194371461868,
        -0.007449999451637268,
        -0.09990502148866653,
        0.058306626975536346,
        -0.0021147970110177994,
        -0.06160486489534378,
        0.03547901287674904,
        -0.11378776282072067,
        -0.007727228105068207,
        -0.07048843801021576,
        -0.03843395784497261,
        0.04277069494128227,
        -0.044921331107616425,
        0.043347299098968506,
        -0.0933895856142044,
        0.00981577392667532,
        0.034534744918346405,
        0.002864004811272025,
        0.006541963666677475,
        0.0353708416223526,
        0.01959819160401821,
        -0.03408520296216011,
        0.08134162425994873,
        -0.02779715694487095,
        -0.04474261775612831,
        -0.03624816983938217,
        -0.043514400720596313,
        -0.025374289602041245,
        0.09839601814746857,
        -0.09349654614925385,
        -0.033682648092508316,
        -0.018490368500351906,
        -0.0025825349148362875,
        0.041708990931510925,
        -0.04825007542967796,
        -0.14822140336036682,
        -0.04952612891793251,
        -0.0950300544500351,
        -0.017842207103967667,
        -0.013430271297693253,
        -0.011117381043732166,
        -0.03525455668568611,
        -0.004421244375407696,
        0.04170314967632294,
        -0.04559185355901718,
        0.02995249815285206,
        0.043491095304489136,
        -0.11162643879652023,
        -0.1385275274515152,
        -0.020807161927223206,
        -0.058287397027015686,
        0.04220312461256981,
        0.1593305766582489,
        -0.01729360595345497,
        -0.04087945818901062,
        0.0019774120301008224,
        0.010806739330291748,
        0.0628887191414833,
        -0.011784616857767105,
        -0.06073224917054176,
        0.05718238279223442,
        0.028912752866744995,
        0.027958068996667862,
        -0.006305519957095385,
        -0.04001675173640251,
        0.037202246487140656,
        -0.13519330322742462,
        -0.032615888863801956,
        -0.016750900074839592,
        -0.030129369348287582,
        0.018554920330643654,
        0.04989738017320633,
        0.06160722300410271,
        0.0718575194478035,
        -0.08700388669967651,
        0.07903172075748444,
        0.06464479118585587,
        0.1215275228023529,
        0.07315132766962051,
        -0.05705570429563522,
        0.03976737707853317,
        -0.029141966253519058,
        -0.03391391783952713,
        -0.061814889311790466,
        0.011801715940237045,
        0.00022387092758435756,
        -0.05734322592616081,
        0.03749949485063553,
        -0.020232640206813812,
        -0.03912113234400749,
        -0.010242759250104427,
        0.08361496031284332,
        -0.019827447831630707,
        0.014991204254329205,
        -0.0630931630730629,
        0.030195966362953186,
        0.11183784902095795,
        0.04851462319493294,
        -0.044638052582740784,
        -0.011655706912279129,
        0.05123359337449074,
        -0.01717677339911461,
        0.01921902596950531,
        0.02107062190771103,
        0.035696107894182205,
        -0.03857027739286423,
        0.07618223875761032,
        -0.0064035337418317795,
        -0.0021326050627976656,
        -0.012348493561148643,
        -0.06727848201990128,
        0.0027910068165510893,
        0.1133226603269577,
        -0.03937476873397827,
        0.07627586275339127,
        0.08862725645303726,
        -0.07194869220256805,
        -0.04093552008271217,
        0.04724607244133949,
        0.06465762108564377,
        0.06169401854276657,
        0.04112788289785385,
        -0.003668786259368062,
        -0.07198300212621689,
        2.5819801374078702e-33,
        -0.03640960156917572,
        0.08779366314411163,
        0.058597102761268616,
        0.06626490503549576,
        0.002463449025526643,
        -0.022133709862828255,
        0.015557870268821716,
        0.0476984940469265,
        -0.03602539375424385,
        -0.018188515678048134,
        0.024050962179899216,
        0.04785561189055443,
        -0.02078542858362198,
        0.031427983194589615,
        0.09366069734096527,
        -0.12316157668828964,
        -0.02145525813102722,
        0.00848468765616417,
        -0.10300245881080627,
        0.03178095445036888,
        0.021832667291164398,
        -0.011579131707549095,
        -0.001541815116070211,
        0.018800141289830208,
        0.004907540511339903,
        0.0841473639011383,
        -0.07804650068283081,
        0.02766885608434677,
        0.0018106895731762052,
        0.05352596938610077,
        -0.03158995136618614,
        0.04930588975548744,
        -0.0328032523393631,
        -0.032161783427000046,
        0.01244340930134058,
        -0.002929944545030594,
        -0.06726621836423874,
        -0.08866279572248459,
        -0.06851381808519363,
        0.007317887153476477,
        -0.03723622113466263,
        0.11855455487966537,
        -0.030277030542492867,
        -0.005165469367057085,
        -0.02340717799961567,
        0.015380089171230793,
        -0.007246321998536587,
        0.02374449372291565,
        -0.0317499116063118,
        0.03759876638650894,
        -0.055064693093299866,
        0.01625865325331688,
        -0.1119731143116951,
        -0.09559235721826553,
        0.004908588249236345,
        0.03122524730861187,
        0.020616667345166206,
        0.021408475935459137,
        0.0374525748193264,
        -0.02035972662270069,
        0.03617577254772186,
        -0.0260655265301466,
        -0.05929199233651161,
        0.05409712344408035,
        -0.09144388884305954,
        0.06772597879171371,
        0.07475026696920395,
        -0.03244302049279213,
        0.013203558512032032,
        0.035589613020420074,
        -0.04237639904022217,
        0.03623203933238983,
        -0.03162986412644386,
        -0.10751400142908096,
        0.03611700236797333,
        0.018664082512259483,
        -0.011711802333593369,
        0.014491667971014977,
        -0.09446550905704498,
        0.050067417323589325,
        -0.07749790698289871,
        0.03276515752077103,
        0.002880814718082547,
        0.0203988216817379,
        0.04126938432455063,
        -0.07860269397497177,
        0.02884574420750141,
        -0.029829271137714386,
        -0.006948951631784439,
        -0.044646210968494415,
        0.04057532921433449,
        -0.012256993912160397,
        0.0048492057248950005,
        -0.010963331907987595,
        -0.065494604408741,
        -4.039261238944392e-33,
        0.009541136212646961,
        -0.07802832126617432,
        0.012655512429773808,
        -0.01742330938577652,
        0.014604747295379639,
        -0.042102932929992676,
        0.039637982845306396,
        0.006979511585086584,
        0.008892002515494823,
        -0.039670996367931366,
        0.01024685800075531,
        0.09273665398359299,
        -0.022115319967269897,
        -0.03658411651849747,
        -0.011474961414933205,
        -0.05553546920418739,
        0.02528812177479267,
        -0.08793726563453674,
        0.0076997713185846806,
        0.06976960599422455,
        0.14619795978069305,
        0.07368814945220947,
        -0.02388441376388073,
        -0.061826325953006744,
        -0.05233902484178543,
        -0.028431208804249763,
        0.0506969653069973,
        -0.03381897881627083,
        -0.020076891407370567,
        0.00016813227557577193,
        0.02670758217573166,
        0.023006031289696693,
        -0.020211851224303246,
        0.007962565869092941,
        0.07086429744958878,
        0.09771300852298737,
        0.05734630301594734,
        -0.05697043612599373,
        -0.08198291063308716,
        -0.07082261890172958,
        -0.0005987582844682038,
        0.05632892623543739,
        0.008126488886773586,
        -0.07718179374933243,
        0.012181288562715054,
        -0.015390326268970966,
        -0.019409341737627983,
        0.0668896734714508,
        -0.0070786988362669945,
        -0.05571939796209335,
        -0.010739226825535297,
        -0.017495932057499886,
        0.011533606797456741,
        -0.08701752871274948,
        0.004490643739700317,
        -0.0835089311003685,
        -0.037531863898038864,
        0.052987176924943924,
        0.04318581894040108,
        0.04867683723568916,
        0.06146824732422829,
        -0.0002515665255486965,
        -0.051029834896326065,
        -0.03176503628492355,
        -0.0075360555201768875,
        0.04120277985930443,
        -0.00575659517198801,
        0.013972895219922066,
        -0.022494537755846977,
        0.034369878470897675,
        -0.026507023721933365,
        -0.00424130167812109,
        -0.025006067007780075,
        0.0018696170300245285,
        0.03876693919301033,
        0.030208073556423187,
        0.037911929190158844,
        -0.04717947542667389,
        0.013434771448373795,
        0.04931410402059555,
        -0.0034811110235750675,
        0.03974692523479462,
        0.08411253243684769,
        0.09059029817581177,
        0.06587207317352295,
        0.04429737851023674,
        -0.04318461939692497,
        -0.00969811249524355,
        -0.07110382616519928,
        0.07267038524150848,
        -0.017363375052809715,
        -0.03213195502758026,
        0.006840529851615429,
        0.04936804249882698,
        0.004431155975908041,
        -5.608133335499588e-08,
        -0.0006900926819071174,
        0.06813233345746994,
        -0.02142488956451416,
        0.023790495470166206,
        -0.013618651777505875,
        -0.015088042244315147,
        -0.07357734441757202,
        -0.045723579823970795,
        0.04768069088459015,
        -0.035388410091400146,
        -0.07273188978433609,
        0.011317026801407337,
        -0.00053040636703372,
        0.11393067985773087,
        0.03865205496549606,
        0.09132495522499084,
        -0.05430275946855545,
        0.0011108268518000841,
        -0.04203661158680916,
        -0.006868992932140827,
        -0.010109473951160908,
        0.06341059505939484,
        0.07500509917736053,
        -0.047409363090991974,
        0.007010627072304487,
        0.06668058782815933,
        -0.025178974494338036,
        0.022547056898474693,
        0.08674386143684387,
        0.040808942168951035,
        -0.065333291888237,
        0.021859092637896538,
        -0.02536894753575325,
        0.02060513012111187,
        -0.03991860896348953,
        -0.08140198141336441,
        -0.022495059296488762,
        0.023003045469522476,
        0.0031749082263559103,
        -0.029958948493003845,
        -0.0068722618743777275,
        -0.0840962678194046,
        0.06045709177851677,
        0.03672628849744797,
        -0.014167578890919685,
        0.0687704011797905,
        0.006666027940809727,
        -0.05700509622693062,
        -0.06016590818762779,
        0.013814507983624935,
        0.02037384919822216,
        0.025774573907256126,
        -0.002069975482299924,
        0.024072514846920967,
        -0.0356995090842247,
        0.024723907932639122,
        0.050252147018909454,
        -0.035381756722927094,
        -0.04275810718536377,
        0.00972751248627901,
        0.09724825620651245,
        0.026353463530540466,
        -0.022818801924586296,
        0.043223511427640915
    ]
}