{
    "id": "fIepyBqE-bo",
    "title": "Pixel 3A vs. OnePlus 7 Pro: let's talk cameras",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-05-24T13:00:14Z",
    "video_url": "https://www.youtube.com/watch?v=fIepyBqE-bo",
    "category": "Science & Technology",
    "tags": [
        "pixel 3a",
        "google pixel 3a",
        "oneplus 7",
        "oneplus 7 pro",
        "oneplus",
        "oneplus vs pixel",
        "pixel 3a xl",
        "google pixel 3a xl",
        "google",
        "google pixel",
        "pixel",
        "pixel 3 camera",
        "camera",
        "camera test",
        "comparison",
        "pixel camera",
        "smartphone",
        "smartphones",
        "phones",
        "review",
        "hands on",
        "oneplus 7 unboxing",
        "unboxing",
        "7 pro",
        "android",
        "test",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "mkbhd",
        "apple",
        "iphone",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 463894,
    "likes": 9285,
    "comments_count": 890,
    "description": "The Pixel 3A or the OnePlus 7 Pro  which phone has a better camera? OnePlus has always given us a high spec experience without the flagship price, but the camera always fell short. Googles Pixel phones started off expensive with amazing camera software, and are now trickling that technology down to less expensive models. So who does it better?   Learn more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2YO4Hj5",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- OnePlus has always been known to give you a high spec experience without those high price tags of other flagship phones. But they always kind of fell short with their cameras. Pixel, on the other hand, started off expensive, but they always maintained amazing photo quality. But now they're trickling that technology down to less expensive phones, while OnePlus is getting a little more expensive and souping up their camera technology. So who does it better? The souped-up OnePlus 7 Pro, or the pared down Pixel 3A? Let's put them to the test. Before we get into quality, you can't take a photo without opening the app. So who does it faster? To test this, I made a little rig. And I asked my friend Carrie to join me. We're gonna be closing the camera out, entirely, then opening the app and taking a photo as quickly as it allows us to. All right Carrie, let's do this. One, go. - [Together] Oooooh. - [Becca] Two, one, go. - Okay, there's something going on. - [Becca] Two, one, go. - Oooh! - Damn, okay. - [Becca] Go. - Fun. - That's it. OnePlus wins, thank you Carrie. - Good game. - Good game. And now we're gonna see whose shutter reacts faster when the app is already open. (clicks) Oh! One point Pixel. Two point Pixel. Three point Pixel. Okay, well that was fun. So the Pixel takes the photos faster when the app is already open, but from starting at nothing, the OnePlus will the open the app and take the photo just a bit faster. Now, I wanna look at the apps themselves just their interface, because although they look really the same much like all photo apps do, they act in different ways that makes one just a little bit better for me. The Pixel: my biggest qualm with this app is that every time you close it, whether you close out of it entirely or you just go to check a notification, it's gonna default back to the rear camera every time you reopen it. So, say I am taking a selfie. And I have it on the front facing camera. If I close the app, and say, check a notification, then open the app again, it's gonna go back to that rear camera, which is more annoying than you think, especially when it comes to shooting entirely in night mode. When it's night time and I wanna just be shooting in night mode, I have to navigate to the more tab, and then hit night sight every single time I wanna take a photo at night. It seems small but it's really annoying. So OnePlus's app looks pretty standard and what I really appreciate is that, say, I'm taking a selfie, every time I open the app, it's gonna reopen the selfie camera. Now the only exception to this is that when you are in photo mode using the rear camera, it's always gonna default back to the standard lens as opposed to the wide angle or the telephoto every time you reopen the app. I also appreciate that you can swipe up on any of the options on the bottom column and it'll bring you to all of your photo modes. But what about hardware? What are we working with just base level here? Well, on the OnePlus, you have three cameras on the back: an eight megapixel F2.4 telephoto lens, a 16 megapixel F2.2 wide angle lens, and a standard 48 megapixel lens that scales down to 12 megapixels when you're not using pro mode. And that's an F1.6. And then on the front, or located atop, you have that really cool pop-up 16 megapixel F2 camera. And then on the Pixel 3A, you have a 12.2 megapixel F1.8 lens on the back, and an eight megapixel F2 selfie camera on the front. Whoo, it's a hell of a lot of numbers. Anyway, for the last three days, I have taken these phones everywhere with me, and every photo I would have taken with one camera, I've taken with two, and yes, it is just as much of a pain in the ass as you think it would be. I still have friends that print photos, so for this review, I wanna go and I wanna print photos and then also compare them on my laptop. So we have a little bit of both worlds. I mean, when we're only taking photos with our phones, inevitably they will get printed or put on calendars, or if you're lucky, even a mug. So let's go to Walgreens. All right, let's do it. Took a really long time. Quick focus and audio test, here we go. Number one, how do you hear me? Is the sound better over here, or does it sound better over here? Now I'm back over here, is it better over here? Or is it better over here, you tell me? Now I'm gonna go away. You guys focus? Still focus? One more? How's the focus? All right. Oh yeah. Here we go. Alix, how did you beat me back here? Holy cow. Wow, okay, let's first talk about selfies. These are some things you might print, say it's you and a friend. So, right off the bat, I can notice the color difference between the two photos. On this side is OnePlus and this side is Pixel. OnePlus is definitely warmer, whereas Pixel as we know, is much cooler and there's more blue and green tones to the photos. I found that the OnePlus fills in shadows, brightens the photo, and smooths absolutely everything more than the Pixel, even with the beauty mode turned off. Anyways, both cameras have front-facing portrait mode, and although I like the Pixel's selfie camera for general use, I find that selfie portraits put way too much blur on the background. All right, enough fooling around. Let's talk about the main camera. Oh gosh, this portrait mode. The OnePlus takes smoothing a whole nother level. I mean, I absolutely have no idea what happened to Alex's freckles, they're even gone. Now, sure, the cutout is passable. OnePlus is cutting the contrast in detail level way too much. I took photos of Maria and printed them. The Pixel's just way over blurring the background. I do enjoy that it keeps details, especially in her forehead and her shirt, but in general, I just think that this blur is too much, and I think that on OnePlus, it's a little more natural. Where the OnePlus really surpasses the Pixel is its versatility. I mean, it simply has more cameras than the Pixel. And it's something that I ended up using a lot. I mean, in New York City, everything is so cramped and profound, so having a wide angle lens where you could be close to something yet show all of it, is really valuable. The wide angle lens is amazing. The details and the edges of the frame, they fall apart and they warp just a bit, but I didn't find it to be a deal breaker and it's better than no wide angle at all. The telephoto is really sharp too. There's certainly way more detail than digital zooming on a Pixel. Those extra lenses, they allow OnePlus to really shine when shooting landscapes. And without faces to smooth, the OnePlus does really well at keeping the whites white, as opposed to the blue-leaning Pixel. But when it comes to shooting at night, there's no denying that Pixel's night sight is a lot better than OnePlus's nightscape. The Pixel does a really nice job of keeping the details in, say, the bricks in this photo while smoothing the pixels in the sky, which overall produces a higher, brighter, more balanced photo. It does take a few seconds longer to take the photo, but for the clarity it provides, I think it's worth it. If we look at the main camera alone, putting aside the wide angle and the telephoto lenses on the OnePlus, I think the Pixel has the OnePlus beat in almost any lighting condition. It just comes down to the detail level. But if we're talking about life in the grand scheme of things, the versatility that the OnePlus provides is unmatched. I mean, having all those lenses in your pocket at any time is really helpful. So as it is with all cameras, it's gonna come down to what you value more. What I will say, though, is last night, I bought way too many plants at Home Depot and I wanted to send a picture to my mom. I had both phones on me, and I chose the Pixel to take the picture. Okay, so, the age-old question. Sound off: Pixel or OnePlus? What are you guys shooting with? Do you care about lenses? Do you care about image quality? What are you doing with your photos? Does anyone still print pictures? That's all I have to say. We'll see you next time.",
    "transcript_keywords": [
        "Pixel",
        "OnePlus",
        "high spec experience",
        "high price tags",
        "camera",
        "photo",
        "app",
        "photos",
        "point Pixel",
        "time",
        "Pixel selfie camera",
        "night",
        "high spec",
        "high price",
        "mode",
        "cameras",
        "back",
        "lens",
        "selfie camera",
        "wide angle"
    ],
    "transcript_entity_values": [
        "Pixel",
        "F2",
        "12.2 megapixel",
        "one",
        "Walgreens",
        "16 megapixel",
        "three",
        "Pixel",
        "12 megapixels",
        "last night",
        "Three",
        "16 megapixel F2",
        "night",
        "Carrie",
        "Home Depot",
        "two",
        "Two",
        "One",
        "New York City",
        "Alex",
        "OnePlus 7 Pro",
        "OnePlus",
        "the last three days",
        "first",
        "Maria",
        "Alix",
        "48 megapixel",
        "eight megapixel",
        "OnePlus",
        "a few seconds"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "TIME"
    ],
    "vector": [
        -0.09569904208183289,
        -0.028672728687524796,
        0.05153632536530495,
        -0.05989744886755943,
        0.0741272121667862,
        -0.08745845407247543,
        -0.014393212273716927,
        0.1080840528011322,
        0.033918458968400955,
        0.07898835837841034,
        -0.033074285835027695,
        0.022686127573251724,
        -0.0201948881149292,
        0.0015525686321780086,
        0.050257641822099686,
        -0.08071976155042648,
        0.1118609830737114,
        -0.07772379368543625,
        -0.015476664528250694,
        -0.019414760172367096,
        -0.017909707501530647,
        -0.1035543754696846,
        0.07569164782762527,
        0.01667596772313118,
        0.09335875511169434,
        -0.008280427195131779,
        -0.07909640669822693,
        -0.050967033952474594,
        0.007985083386301994,
        -0.052109383046627045,
        -0.0007466774550266564,
        0.10596497356891632,
        0.04994557425379753,
        0.029888631775975227,
        -0.05091782659292221,
        -0.05048345401883125,
        0.07615283876657486,
        -0.01908412203192711,
        -0.09404104948043823,
        0.020243650302290916,
        0.027768777683377266,
        0.02389850839972496,
        -0.003904653713107109,
        -0.05240233615040779,
        0.029716921970248222,
        -0.02576667256653309,
        0.036487068980932236,
        -0.0411042682826519,
        0.00410746643319726,
        -0.08024060726165771,
        -0.024633239954710007,
        -0.020298944786190987,
        0.0006713421898894012,
        -0.010356559418141842,
        -0.11127609759569168,
        0.0361841544508934,
        -0.0369093231856823,
        0.019112763926386833,
        0.032768357545137405,
        0.011209484189748764,
        -0.0054628197103738785,
        -0.033675603568553925,
        -0.01489153690636158,
        0.09003148972988129,
        0.020318422466516495,
        0.007425663061439991,
        -0.003892261767759919,
        -0.08198484033346176,
        -0.04465170204639435,
        0.0010484872618690133,
        -0.04941028356552124,
        0.05438155680894852,
        -0.009062843397259712,
        -0.003802091581746936,
        -0.031667560338974,
        0.03777579963207245,
        0.08098149299621582,
        0.013896184042096138,
        -0.024600425735116005,
        -0.07108127325773239,
        0.0661732628941536,
        -0.05510511249303818,
        -0.08146499842405319,
        0.006620468106120825,
        0.012514287605881691,
        -0.029599210247397423,
        -0.016195593401789665,
        0.062294915318489075,
        -0.015839973464608192,
        -0.11948232352733612,
        -0.03484001383185387,
        0.09357025474309921,
        -0.02235623635351658,
        0.06296437978744507,
        -0.02010299079120159,
        0.04706357419490814,
        -0.024682389572262764,
        -0.06849431246519089,
        -0.013633732683956623,
        -0.01626221276819706,
        0.007148821838200092,
        0.01868891716003418,
        0.034179721027612686,
        0.03976793214678764,
        0.039556197822093964,
        -0.0007533555617555976,
        -0.04450014606118202,
        -0.02011888474225998,
        0.12081404775381088,
        0.10341539978981018,
        -0.011926294304430485,
        0.020007861778140068,
        -0.03382216393947601,
        0.016774559393525124,
        -0.021156668663024902,
        -0.02042562887072563,
        -0.013462881557643414,
        0.05314943939447403,
        0.14376160502433777,
        -0.03709625080227852,
        -0.007557898759841919,
        -0.0527869388461113,
        -0.06799383461475372,
        -0.08871542662382126,
        -0.009138008579611778,
        -0.0505816675722599,
        -0.05919726938009262,
        4.127298051639304e-33,
        0.0026882807724177837,
        0.09358266741037369,
        -0.02739834040403366,
        -0.015108444727957249,
        -0.043804556131362915,
        0.07496087998151779,
        -0.008987617678940296,
        0.043657589703798294,
        0.0060735768638551235,
        -0.015836618840694427,
        -0.04330182820558548,
        -0.02519094944000244,
        -0.061967890709638596,
        0.05594273656606674,
        0.07436612248420715,
        -0.013046511448919773,
        -0.049173466861248016,
        -0.013436862267553806,
        -0.027551734820008278,
        0.01982300542294979,
        -0.0022311885841190815,
        -0.012394614517688751,
        -0.007383102085441351,
        0.06094600632786751,
        0.06538169831037521,
        -0.04215793311595917,
        0.07228892296552658,
        0.004888399038463831,
        0.005105357151478529,
        -0.02360287681221962,
        -0.03230944648385048,
        0.0009137092856690288,
        0.069120392203331,
        0.02302475832402706,
        -0.030825836583971977,
        0.01826842688024044,
        -0.003852973459288478,
        -0.07385433465242386,
        0.05055270344018936,
        -0.0099547253921628,
        -0.12286312133073807,
        0.07680819183588028,
        -0.04672321304678917,
        -0.06216687336564064,
        0.08212963491678238,
        0.027013877406716347,
        -0.03159550949931145,
        -0.04349880293011665,
        -0.0373665988445282,
        -0.014278927817940712,
        0.047389864921569824,
        -0.008153105154633522,
        -0.06795408576726913,
        -0.009934850968420506,
        -0.0561290979385376,
        -0.015720799565315247,
        0.02808348648250103,
        -0.031215710565447807,
        0.05174858495593071,
        0.027425294741988182,
        -0.025251328945159912,
        0.01702849194407463,
        -0.08090835064649582,
        0.03957151621580124,
        -0.07502586394548416,
        0.07197155803442001,
        0.10271764546632767,
        0.07872335612773895,
        -0.12546364963054657,
        0.08603834360837936,
        -0.03545982763171196,
        -0.0008102796273306012,
        -0.007777481805533171,
        -0.03114445134997368,
        0.04272462800145149,
        0.03545866906642914,
        -0.06621916592121124,
        -0.03271671384572983,
        0.017760690301656723,
        0.05342811718583107,
        -0.09726351499557495,
        0.02665979415178299,
        -0.015020512975752354,
        0.044694267213344574,
        -0.026528116315603256,
        0.011635752394795418,
        0.011321860365569592,
        0.01037541776895523,
        -0.006867335177958012,
        0.05100381374359131,
        0.01895206980407238,
        0.002131920075044036,
        -0.0213225819170475,
        0.05541097745299339,
        -0.0031369260977953672,
        -4.2098085715174126e-33,
        -0.0564131923019886,
        0.018490267917513847,
        -0.043697554618120193,
        0.04483683779835701,
        -0.010436519980430603,
        -0.07663647830486298,
        0.08406855165958405,
        0.0018133822595700622,
        0.04764438048005104,
        -0.05381036177277565,
        0.003503462066873908,
        -0.013550983741879463,
        -0.038358431309461594,
        0.021298574283719063,
        -0.02843167632818222,
        -0.06554176658391953,
        0.018848087638616562,
        -0.11860741674900055,
        -0.03607289493083954,
        -0.0061323195695877075,
        0.06077386811375618,
        0.019099578261375427,
        -0.061483174562454224,
        0.048062290996313095,
        -0.04900705814361572,
        0.025211460888385773,
        -0.011001911014318466,
        -0.010156137868762016,
        -0.0031875488348305225,
        -0.07291441410779953,
        0.00997713953256607,
        -0.032702669501304626,
        0.045057762414216995,
        0.0037372708320617676,
        0.1146785169839859,
        0.06351736187934875,
        -0.036010999232530594,
        -0.06736728549003601,
        0.04898541793227196,
        0.007630916777998209,
        0.0040437206625938416,
        0.03663167729973793,
        0.0612788163125515,
        -0.03396589681506157,
        0.07624983787536621,
        -0.0031993985176086426,
        -0.04229740798473358,
        0.01728125289082527,
        0.007690610829740763,
        0.12153364717960358,
        0.002673086244612932,
        0.09733064472675323,
        -0.004503082484006882,
        -0.027167975902557373,
        -0.029123300686478615,
        -0.1121918186545372,
        -0.009679529815912247,
        -0.0397614911198616,
        -0.058335669338703156,
        0.03291662409901619,
        0.07136652618646622,
        0.024190198630094528,
        -0.033307138830423355,
        0.03751381114125252,
        -0.1251332312822342,
        0.07216309010982513,
        0.04120860621333122,
        -0.01883443258702755,
        0.022278964519500732,
        0.036508191376924515,
        -0.015570169314742088,
        -0.008445286191999912,
        -0.0024915682151913643,
        -0.07555171102285385,
        -0.022741001099348068,
        0.055372923612594604,
        -0.10298022627830505,
        0.014113041572272778,
        0.02030329219996929,
        -0.015695175155997276,
        0.0020250200759619474,
        0.02911948226392269,
        0.04710178077220917,
        0.028608450666069984,
        0.04570774361491203,
        0.033861130475997925,
        0.015276012010872364,
        -0.010359322652220726,
        0.016009390354156494,
        -0.0054563237354159355,
        -0.016234563663601875,
        -0.026311535388231277,
        -0.07316651195287704,
        0.019233347848057747,
        -0.009022754617035389,
        -4.526802754867276e-08,
        0.013691507279872894,
        -0.04497554898262024,
        0.07699248194694519,
        -0.028449593111872673,
        0.0268983356654644,
        -0.06935054808855057,
        0.022520583122968674,
        0.06183674931526184,
        0.13045313954353333,
        -0.022218788042664528,
        0.006213564425706863,
        -0.0583256371319294,
        -0.06908959150314331,
        0.033420391380786896,
        0.06652258336544037,
        0.05363915488123894,
        -0.00836780946701765,
        -0.050625842064619064,
        0.04347163811326027,
        0.015449480153620243,
        -0.005326645448803902,
        -0.011929730884730816,
        -0.010026432573795319,
        -0.10895756632089615,
        0.03612172603607178,
        -0.0032085042912513018,
        -0.05669790133833885,
        -0.014931987039744854,
        0.08059163391590118,
        -0.00047999926027841866,
        -0.027277546003460884,
        -0.0452483668923378,
        0.043991465121507645,
        0.012099706567823887,
        0.0410679392516613,
        -0.09196678549051285,
        0.034924112260341644,
        -0.010849111713469028,
        0.13489732146263123,
        -0.004688898101449013,
        0.027295803651213646,
        -0.012045538052916527,
        0.054368164390325546,
        0.027799446135759354,
        -0.01498312409967184,
        -0.0339905247092247,
        0.02649603970348835,
        -0.04543637856841087,
        -0.01590251550078392,
        0.009072978980839252,
        -0.11247832328081131,
        -0.02815099060535431,
        0.02909427508711815,
        -0.020833777263760567,
        0.020640362054109573,
        -0.06085481122136116,
        0.027072902768850327,
        0.01727580465376377,
        -0.03819412365555763,
        0.08015397936105728,
        0.07258585095405579,
        -0.13016730546951294,
        0.012252943590283394,
        0.14634497463703156
    ]
}