{
    "id": "fItYkKFgips",
    "title": "Sony Kando Vlog!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-05-13T19:20:03Z",
    "video_url": "https://www.youtube.com/watch?v=fItYkKFgips",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "sony kando",
        "sony camera",
        "alpha collective"
    ],
    "views": 104340,
    "likes": 4276,
    "comments_count": 500,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(funky synth music) - Good morning from Camera Camp! Jen and I are in Monterrey, California right now. Monterrey is so beautiful. I was only here once before. This is my second time, and we're here for something very, very fun. Sony invited a bunch of, well, pretty much the most incredible photographers around the world here to what we're calling Camera Camp, but it's actually called Kando. They have a ton of activities planned for everyone. There's a few other YouTubers here, too, so we're kind of like the odd people out, because, I mean, I'm an okay photographer, but really, what I focus mostly on is video. Jenna's already taking pictures. Are you taking picture or video? - Video. There's a mountain lion here. - Right now, we're heading to breakfast. This is where Jenna shines. Okay. On the menu are all of our favorite things. - [Jenna] Oh my gosh, it's like they made it for me. They have yogurt? - The most important part about breakfast is coffee, and Jenna got four to-go cups. Are you coffee hoarding? - No I didn't! Well, I made a mistake, I thought the one was coffee and it was water, so I have a cup of hot water and creamer. I don't wanna talk about it. - [Justine] Squirrel! Squirrel! (electronic music) For scale. Do you know how many Sasquatches we could find with that? Morning. (gasps) Jenna! They have it here! I'm so excited! I'm so excited. I was like, I wonder if the store will have a yerba mate, and guess what, they do, and they have kombucha! Oh my goodness. I'm so happy. Let's go. - [Jenna] Back on the bus. - We are on the vlogger bus, and the difference between the vloggers and the photographers here is (laughs) you can spot us a mile away because we have huge microphones on top of our cameras. For example, hey Brett. (men talking) See, look. You see? I can't see it. - [Justine] Brett-- - What's up? - [Justine] Can you just show me your camera real quick? - Got the Sony a6500. - [Jenna] Oh! - [Justine] That's how you can tell a vlogger between a photographer. 'Cause we've got these massive microphones. - [Jenna] Also, a lot louder. - Oh. Hi! - Hello! - Hi! - Well, now I wanted to go around and do introductions of everybody's channel, but Brett already did it, so is that weird if we do it again? - My name is Faruk, and my channel is called iPhonedo. It is like Nintendo with an iPhone: iPhonedo. - The first video that I saw of his, I don't wanna bring it up 'cause it's kind of a sore subject, sorry GoPro, but it was his Karma video, and then I've been a huge fan ever since, 'cause we both were not big fans of the Karma. - It is true. It's the GoPro Karma. The worst drone I have ever flown. (heavy rock music) - Hey Jen! - Hi! I'm sure you probably have seen me in some of your videos. Are you having fun? Do you want me to handle this for you? - No, it's okay! - Okay. - [Justine] Hi, hello! - Hi, I'm Jason. I make videos on Sony Alpha, specifically on all their cameras and lenses, and teach people tips and tricks, yeah. - People know me as Mondobytes. I do tech videos, I do a lot of filmmaking stuff, how to color grade, pretty much anything I'm just interested in filming, but mostly tech and anything relating to film. - Well, I mean, that would be why we're all here, you know? Hi, how are you? - Hey, Kraig Adams, ex-CaseyNeistat ripoff artist, no. (laughs) I just do travel stuff. - So my name's Steve Ronin, and basically I'm an urban exploration photographer, and I kinda vlog that lifestyle on my YouTube channel, so go check it out. - We'll continue introductions after donuts. To be honest, I just wanna look at the donuts, I don't actually-- well, maybe I do wanna eat one. (indistinct conversations) - [Steve] It's like a bully getting stuck in a locker. - This is such an easy fit! - Oh, that was easy. - [Jenna] Alright, let's all get in a locker. (people laughing) - No, don't close it! - No, no, don't close it! - Okay, so I can fit. That was really dumb. I'm an adult. Don't try that at home. - If you would've closed it, what would've happened? - [Justine] I don't know. - Oh, you're fine. - I would've gotten claustrophobic after that. - [Justine] Who wants to get locked? - Dude, hell no. That's scary. (group laughing) (gentle piano music) - We're inside the aquarium, and I did intros of everybody, you're the only one that I haven't introduced yet, hi. - Oh, I thought you were talking to him. - No, you! - I was so zoned out, thinking about life really quick. My name's Josh from Exploring With Josh. I do abandoned places around the world, and I just travel and make vlogs. - I actually checked out your channel before we got here. - You did? - Yeah. 'Cause there was an email, I'm like \"who is here?\" No, and I thought it was really great, so I'm excited to meet you. - Thank you so much. - This is fun. - Yeah, we'll have to do some random stuff. - Yeah, where are you based out of? - Well, I'm based in Boston. - Oh, cool! - But I'm here for the whole month, well, LA. - Oh, awesome! Well, I'm here too. - [Josh] You live in LA? - Yes, I live in LA, yeah. This is great! - We were meant to do whatever we can do. - We're gonna do some cool stuff. Stay tuned. - Do you like to hike, or something crazy? - I love hiking. - Alright, we should do that. - Yes, let's do it! - Really. Yeah. (calm electronic music) - So sea bass is my favorite fish to eat, and now I don't think I'm ever gonna be able to eat it again because now I've looked him in the eye, and he looked back. (calm electronic music) - Jenna's been trying to touch it. - [Brett] I gave it a nice little pet. - Did you? - Yeah, it was nice. - [Justine] Touch it, Jen. Grab it. Go for it. Are you gonna touch it, or what's up? - Well, I can't put my arm in, or else I'll be taking a bath. I can't go! (laughs) - So right now it is sea otter feeding time, so we're gonna see if we can see them. We're gonna try to go upstairs and see. - [Trainer] Now, our three sea otters are doing what we call \"positive reinforcement training\". That means we ask them to do something, and then when they do that, we reinforce it, or thank them for doing the behavior and hope they do it again by doing something positive. So, in this case, (laughs) that's food. - We are in the deep ocean now, so-- What? Look how cool! (calm synth music) This is probably the coolest thing that I've ever seen. This entire little aquarium tank is full of jellyfish. I thought those jellyfish over there were cool when there was two of them. There's probably like 40, 50, I don't know. (energetic synth music) We've seen so many cool things here at the aquarium, but now I'm at the store and I wanna get Matty a toy, and I'm thinking that he probably would really love this little otter. He loves his piggy puppet. This actually looks like him. Oh my goodness, I think this-- there's beans in it, though. I wonder if he'd like this? This one's like a little finger puppet. \"Puppet Mini Baby Penguin\". Super cute. I think Matty'll like it. For those of you guys that don't know, Matty is my dog. This is Nicole. We had so much fun at the aquarium. This was so awesome. Did you like it? - This was the coolest thing ever. The jellyfish, favorite thing I've ever seen. - It was incredible. I mean, they were just so slow-moving, it was almost like it was slo-mo, but it wasn't. It was real-mo. - It was remarkable. I like jellyfish. (energetic techno music) - Back here at the resort, and now, guess what, it's time for lunch. So basically, we ate, went to the aquarium, now we're gonna eat again. - Human feeding time. - Human feeding time. - Well wait, that didn't sound good. Hello, welcome to my meal. So we have an Uncrustable. It's on wheat bread now. Uncrustables look like they did a little rebrand. Sunchips, I'm not done. Apple slices. - And the rest of the adults, we all have salads. - [Jenna] Well, you guys are weird. - [Josh] I got a fish sandwich. - [Justine] Oh okay, okay, yes, that's good. - I got a fish sandwich too. - Oh, there you go. That is a huge piece of fish. - The calories are so much though. 1,500. - [Justine] Well, you can remove the bun. (group laughs) Okay, I'm testing out this lens now. I'm super excited about this one. This is a wide angle lens, and we're heading to a class right now. It's called Unlock Alpha. If you have any questions about your camera, you can ask them and they will answer them. I'm preparing my questions mentally. But this lens is pretty cool. What's it look like? Is it wide angle? Nice wide angle? - [Jenna] Yeah, you're looking good. - Woo! What do you guys think? Do you like it? Do you not like it? This is the one I'm borrowing from the rental. Jenna's got the little guy on there. Pancake. - I brought the big boys. - Pancake. (energetic synth music) We just left our first class, and now we're heading over. They have these photosets where you can take pictures of things and they also have one that is puppies and kitties so guess where we're going. Puppy and kitty photoset. - Camera shy. - It's okay. - [Jenna] Friends. - [Brett] I didn't know there was like, real kittens. (kitten meows) - Mindy. - [Justine] She's trying to give kisses. - She is. Bat is like, \"I'm outta here.\" - [Justine] Hi. Aww. (electronic music) That may have been the highlight of my day. Yes, there are incredible cameras and so many lenses and amazing people here, but Mindy was the sweetest little dog and, well, her adopted brother Ted-- Please please please, if anybody wants Ted who happens to live near Monterrey, California, go get Ted, go get Mindy, and see what other dogs they have available. I love it. - [Jenna] No one else had helmets. - Time to ride bikes. None of our other friends have helmets, but I think I'm gonna be safe and I'm gonna wear one, because you should always wear a helmet, and I don't trust myself. - They had a feeling that you guys weren't as good at riding bikes as we are. - [Jenna] Did you just decline the helmet? - Yeah. But (laughs) I think you guys need them, so-- - What are you saying? - [Jenna] What are you saying? - What are you saying? - I heard about your skateboard incident. - Oh. Wow, yeah. - [Jason] Where are we? - [Justine] Monterrey, California, baby! - [Brett] Yo, watch this, watch this, ready? - Off we go, bike squad. Rolling! Goodness gracious. Here we go. - [Steve] Go on without me, guys. - We've made our first stop, it's only been four minutes, and I think I'm dying already. - Woo! I'm tired. - [Justine] Wow. - Just a quick little break we're all having. - [Justine] We need it. - Every block, we're gonna stop. - Let me say that vlogging and riding a bike is not a thing I'm good at. - We're doing a good job. (upbeat electronic music) - [Jenna] Oh, hi cutie. - Come to the show. - We're all trying to get a bike squad pic. We've got the timer-- 10 seconds. 10 seconds. - Run, Steve! - So unfortunately, we have to turn around, because we have a meeting at 3:00, but these guys are going, what, 17 miles? - 17 miles. It's gonna be a great 17 miles. We're all energetic, we're all ready. - And what is at the end of 17 miles? - I don't know. (laughs) - So, I'm gonna steal a clip from his video, and then you can go watch the rest of it to find where the 17 miles went. - I didn't vlog it today. - What? - Oh my God. - Yeah, I'm the only one, I know. I vlogged all yesterday, just not today. - So you can send them to my page. Youtube.com/BrettConti. - So, I'll be stealing a clip from Brett, and then you can see the rest of the video on his channel. - Still subscribe to Josh, though. - Exploring With Josh, it's okay. - His channel's pretty fun. Everybody's channels is fun. - I can't vlog and ride a bike, so. - My legs hurt already. - Well, we have to go uphill, little lady. I don't think bike riding is something that I'm good at, or into. (electronic music) - We're on our way back down, except we forgot which way we turned. Hopefully, these guys remember, 'cause I don't. (electronic music) - Alright guys, here's the Ronin-S. I've been talking about it nonstop since I saw it at CES. - Horizontal. - So hold the trigger here? - Yeah, hold the trigger 'til you're horizontal. Okay, now double tap. Alright, now just pan right there. - Wow. You guys are gonna see this in so many vlogs, and you'll be like \"Can you please stop?\" (men laughing) It's gonna be nonstop. - [Man] It suits you. - Yeah, this is great. It's really nice. - And if you ever want to start working with autofocus, I'm sure you do a little bit, but as you're walking, you can just tap as you move and change what's in focus, so it's really really free. - That's a really good idea, 'cause I actually have all the autofocus turned off on the touchscreen 'cause I'm always accidentally hitting it, but this is a really good use case for it. What lens is this? Is this 24? Oh, 50. Okay, I gotta hold it out here. Is it stable? Is it steady? - [Jenna] I'm not stable. - My arms are hurting! Okay, this is me holding it with one arm. Hello. - Hello. - Oh, this is cool. Oh yeah, that's great. How are we ever gonna pack all this stuff? 'Cause we have so much more stuff than we came with. - [Jenna] Justine's on fire duty today. Wait, you're not lighting the right thing. You have to light the end of the bag, the edges of the bag. - It's gonna light. - I guess it'll work. - This is gonna light. Look at the nice fire! I made that. - It's lit. - Can you believe it, Jenna? - This is crazy! I'm so happy! - So we're packing, and we were just joking, \"oh, we're never gonna win anything, that's crazy, that's not gonna happen\". Jenna just won an A7R III. We heard it over the loudspeaker. And then all of our vlog squad friends said \"Jenna just won an A7R III!\" I can't believe it! I'm so excited! So we're gonna run down and we're gonna get it. - I won a camera! - Vlog squad! Let's go, Jen! - I won at Camera Camp! - Wee! Man, if we had that Ronin-S, this would be so steady. There it is, Jen, go ahead, the presentation! - Jenna, here is your camera. - Thank you! I've never won anything before. And this is the best possible thing that I will ever win. I'd like to thank Sony, I haven't prepared a speech but I'm very thankful. - [Justine] Can you believe it, Jen? - No! I can't believe we also just ran into them, too. - [Justine] That's pretty crazy. - 'Cause we were on our way down. - [Justine] Well, congratulations. I'm so proud of you. - Thank you, thank you. Okay, we'll go back up now. - Okay, now we can go back and be warm. (electronic music)",
    "transcript_keywords": [
        "yeah",
        "Camera Camp",
        "Jenna",
        "Camera",
        "Good",
        "guys",
        "video",
        "Jen",
        "cool",
        "thing",
        "channel",
        "Camp",
        "stuff",
        "fun",
        "time",
        "Back",
        "Brett",
        "Sony",
        "calling Camera Camp",
        "Josh"
    ],
    "transcript_entity_values": [
        "10 seconds",
        "Bat",
        "Brett] Yo",
        "Sony Alpha",
        "second",
        "Matty",
        "Uncrustable",
        "one",
        "Camera Camp",
        "24",
        "Faruk",
        "Apple",
        "Justine",
        "Nintendo",
        "50",
        "CES",
        "Josh",
        "Kando",
        "Sony",
        "Steve Ronin",
        "Morning",
        "Brett",
        "three",
        "Justine] Squirrel",
        "a ton",
        "Unlock Alpha",
        "YouTube",
        "Justine]",
        "LA",
        "a mile",
        "four",
        "1,500",
        "the whole month",
        "17 miles",
        "Boston",
        "Mondobytes",
        "Steve",
        "Jen",
        "Ronin-S",
        "Justine] Brett-- - What",
        "3:00",
        "four minutes",
        "Justine] Monterrey",
        "Justine] Hi",
        "Kraig Adams",
        "today",
        "California",
        "two",
        "Sunchips",
        "Monterrey",
        "Nicole",
        "Mindy",
        "Jason",
        "slo-mo",
        "first",
        "YouTubers",
        "40",
        "GoPro",
        "Jenna",
        "yesterday",
        "Ted"
    ],
    "transcript_entity_types": [
        "TIME",
        "PERSON",
        "PERSON",
        "FAC",
        "ORDINAL",
        "PERSON",
        "FAC",
        "CARDINAL",
        "FAC",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "GPE",
        "LOC",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "TIME",
        "TIME",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "PERSON",
        "PERSON",
        "PERSON",
        "FAC",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON"
    ],
    "vector": [
        -0.003306946950033307,
        -0.08173700422048569,
        -0.03753418102860451,
        -0.13752439618110657,
        0.027793996036052704,
        0.05108296871185303,
        0.040823906660079956,
        0.04286777228116989,
        -0.023168092593550682,
        0.09840252250432968,
        0.04978334903717041,
        -0.024051686748862267,
        -0.0399654358625412,
        0.013866540975868702,
        -0.0003833188384305686,
        0.0371280163526535,
        0.008531434461474419,
        -0.016182992607355118,
        0.0028226254507899284,
        0.06973180174827576,
        0.0006936976569704711,
        -0.05779176577925682,
        0.018962686881422997,
        -0.01029155496507883,
        -0.00787863228470087,
        0.08131086826324463,
        0.01583954133093357,
        0.03288010507822037,
        -0.09215264767408371,
        -0.06982160359621048,
        -0.05815492197871208,
        0.013897227123379707,
        0.14243721961975098,
        0.02477065473794937,
        0.015811670571565628,
        -0.06074771657586098,
        0.05411798134446144,
        -0.017668602988123894,
        -0.036285560578107834,
        0.009847992099821568,
        -0.035535067319869995,
        -0.06471650302410126,
        -0.004406978376209736,
        -0.03765914961695671,
        -0.05739212408661842,
        -0.0788537859916687,
        -0.004311499651521444,
        -0.06328825652599335,
        0.06861568987369537,
        0.06169275939464569,
        -0.09342163056135178,
        -0.009823190979659557,
        0.07158991694450378,
        0.02117012068629265,
        -0.09515143185853958,
        0.004485178738832474,
        -0.08210158348083496,
        0.03203178197145462,
        0.06030702963471413,
        -0.09358806908130646,
        0.02290962263941765,
        -0.04213733971118927,
        0.015327981673181057,
        0.03667319566011429,
        -0.06068042293190956,
        -0.07703319936990738,
        0.04174940288066864,
        0.045149076730012894,
        0.01475792471319437,
        0.01173833105713129,
        -0.11643290519714355,
        0.09086345881223679,
        -0.016526363790035248,
        0.009906518273055553,
        -0.021956289187073708,
        0.06803448498249054,
        0.03333837166428566,
        -0.08435918390750885,
        0.017426587641239166,
        0.012839600443840027,
        0.031702663749456406,
        -0.021077362820506096,
        -0.08211913704872131,
        -0.031027337536215782,
        0.005633477587252855,
        0.049330342561006546,
        0.04412120208144188,
        -0.0001291298831347376,
        -0.02372521348297596,
        -0.059405311942100525,
        -0.08306733518838882,
        -0.013371565379202366,
        -0.012269299477338791,
        -0.025437405332922935,
        -0.040637221187353134,
        -0.05866432562470436,
        0.0059156459756195545,
        -0.04722718149423599,
        -0.02917504496872425,
        0.07705146074295044,
        0.051881592720746994,
        -0.03829916566610336,
        0.019122350960969925,
        -0.06987547129392624,
        -0.0433075875043869,
        -0.09054610133171082,
        -0.03265936300158501,
        0.021041570231318474,
        0.02700093202292919,
        -0.014883860014379025,
        -0.05663036182522774,
        0.05699758976697922,
        -0.05733712762594223,
        -0.07096312940120697,
        0.014698968268930912,
        0.12782111763954163,
        -0.024380238726735115,
        0.062370382249355316,
        0.01827407255768776,
        0.015481711365282536,
        0.011613939888775349,
        -0.11390124261379242,
        -0.03652575984597206,
        0.05718450993299484,
        0.003949176520109177,
        0.00044751266250386834,
        -0.028358526527881622,
        1.3540713383689815e-32,
        -0.011617901735007763,
        0.08646294474601746,
        0.0015310298185795546,
        0.051212720572948456,
        0.0073068770579993725,
        -0.021543696522712708,
        -0.02467627264559269,
        0.07733111083507538,
        -0.06880492717027664,
        0.010008900426328182,
        -0.004012716002762318,
        0.043434202671051025,
        -0.04315677657723427,
        0.0582176074385643,
        0.04191364347934723,
        -0.024212351068854332,
        -0.04224193096160889,
        -0.027960993349552155,
        -0.036450568586587906,
        -0.0035280645824968815,
        0.023106247186660767,
        -0.0306356530636549,
        0.01733659766614437,
        0.06604164838790894,
        0.09950213134288788,
        0.08159588277339935,
        0.06554163992404938,
        -0.014496410265564919,
        0.07243949174880981,
        0.01854846067726612,
        -0.02833140268921852,
        -0.04751583933830261,
        -0.004352133721113205,
        -0.08387764543294907,
        -0.01203172467648983,
        0.0015540855238214135,
        -0.06386179476976395,
        -0.009542868472635746,
        -0.04404294118285179,
        -0.0634106993675232,
        -0.008521705865859985,
        0.014977198094129562,
        -0.09827398508787155,
        -0.06155379116535187,
        0.06283950060606003,
        0.01155472919344902,
        0.01913761906325817,
        0.07061751186847687,
        -0.04001947492361069,
        0.0036228219978511333,
        -0.029648594558238983,
        0.005235890857875347,
        -0.04616894572973251,
        0.004962250590324402,
        0.01306419912725687,
        -0.08966193348169327,
        -0.02088445983827114,
        0.03919414430856705,
        0.03995243087410927,
        0.045592159032821655,
        0.027315877377986908,
        -0.033256858587265015,
        -0.00018291642481926829,
        -0.030488794669508934,
        -0.06101857125759125,
        0.08116104453802109,
        0.06322970986366272,
        -0.04591789096593857,
        0.0681207925081253,
        0.0245852991938591,
        -0.010685297660529613,
        -0.008315014652907848,
        0.05600610747933388,
        0.011331618763506413,
        -0.0032607715111225843,
        0.06965573132038116,
        -0.08140859007835388,
        -0.05082239210605621,
        -0.0019033495336771011,
        -0.007845521904528141,
        -0.13021381199359894,
        0.06277521699666977,
        -0.036771319806575775,
        0.07257065176963806,
        -0.0004807590739801526,
        -0.027007922530174255,
        0.027860291302204132,
        -0.03804920241236687,
        -0.0702805370092392,
        0.02647441253066063,
        -0.005335378926247358,
        0.08443456888198853,
        -0.0679849237203598,
        -0.05229169875383377,
        -0.017876936122775078,
        -1.2701529436005723e-32,
        0.019509946927428246,
        0.058693211525678635,
        -0.00877783540636301,
        -0.036812931299209595,
        0.03788822889328003,
        -0.03918144479393959,
        0.05138817057013512,
        0.07820143550634384,
        0.05745505169034004,
        -0.1091335192322731,
        0.046838827431201935,
        -0.10631749033927917,
        -0.10283362865447998,
        0.020652813836932182,
        -0.009515410289168358,
        -0.006301413755863905,
        -0.028965815901756287,
        -0.05931372940540314,
        0.05866722762584686,
        -0.015806294977664948,
        0.08533061295747757,
        0.13534022867679596,
        0.07649137824773788,
        0.035517796874046326,
        0.025225557386875153,
        0.005307355429977179,
        0.03164255991578102,
        0.0727882832288742,
        0.027545245364308357,
        0.037788741290569305,
        0.010850313119590282,
        -0.06723733991384506,
        -0.04110678657889366,
        0.01800731010735035,
        0.053313225507736206,
        0.03348177298903465,
        0.04131883382797241,
        0.05651998519897461,
        0.017174437642097473,
        -0.03040497750043869,
        0.04509036988019943,
        -0.003966744057834148,
        -0.021398011595010757,
        -0.024849865585565567,
        -0.04402616247534752,
        -0.11229206621646881,
        -0.0444241501390934,
        0.027526456862688065,
        0.02853548526763916,
        -0.04125535115599632,
        -0.04923262447118759,
        -0.07241640239953995,
        -0.03126022592186928,
        -0.017645785585045815,
        -0.007906535640358925,
        0.013632157817482948,
        -0.07615913450717926,
        -0.011963773518800735,
        0.020780915394425392,
        -0.007992384023964405,
        0.0067254225723445415,
        -0.041503436863422394,
        -0.0495484285056591,
        -0.054668448865413666,
        0.014105062931776047,
        -0.03765137866139412,
        0.09564594179391861,
        0.032637789845466614,
        -0.030600978061556816,
        -0.044887274503707886,
        0.0011935210786759853,
        0.03215603902935982,
        0.06665977835655212,
        0.0494234673678875,
        0.055324703454971313,
        -0.018659556284546852,
        -0.10388436913490295,
        0.0023177394177764654,
        0.06438525766134262,
        -0.048718929290771484,
        -0.06091918796300888,
        -0.036974791437387466,
        0.018389318138360977,
        0.07807765156030655,
        0.0801791101694107,
        0.12226614356040955,
        0.0895063504576683,
        -0.037302806973457336,
        -0.025254569947719574,
        0.037176717072725296,
        0.017768938094377518,
        0.06766336411237717,
        0.05007433891296387,
        0.13331124186515808,
        -0.0718286782503128,
        -6.428532373092821e-08,
        0.03811546787619591,
        -0.013386744074523449,
        -0.02323632873594761,
        -0.0071545992977917194,
        0.036657657474279404,
        -0.06159616634249687,
        0.0005293384892866015,
        0.013834507204592228,
        0.032705776393413544,
        -0.04703092202544212,
        0.08590109646320343,
        0.0029326248914003372,
        0.007627726066857576,
        0.11511299759149551,
        0.05574057996273041,
        -0.014050589874386787,
        -0.0827995017170906,
        0.09808032214641571,
        -0.05481314659118652,
        -0.07935521006584167,
        -0.047119684517383575,
        0.058085277676582336,
        0.040542762726545334,
        -0.01669350080192089,
        0.03921983763575554,
        0.02856779471039772,
        -0.018319059163331985,
        -0.03765221685171127,
        0.03019128367304802,
        -0.025621622800827026,
        -0.030371276661753654,
        0.02157331258058548,
        0.0005365146207623184,
        -0.019037576392292976,
        -0.03899377956986427,
        -0.014727250672876835,
        -0.07035345584154129,
        -0.007658438757061958,
        -0.014093040488660336,
        -0.006728320382535458,
        0.024711990728974342,
        -0.12054245918989182,
        -0.05030394718050957,
        -0.005467680748552084,
        0.023118605837225914,
        -0.049532581120729446,
        0.02916695736348629,
        -0.07576001435518265,
        -0.030655216425657272,
        -0.029270470142364502,
        -0.055007204413414,
        0.05081230401992798,
        0.04818294942378998,
        -0.0029171586502343416,
        0.03758036345243454,
        -0.0025886965449899435,
        0.040557119995355606,
        0.06556902825832367,
        -0.012823758646845818,
        -0.010541549883782864,
        0.04440879076719284,
        0.01971575990319252,
        -0.046161551028490067,
        0.03154734522104263
    ]
}