{
    "id": "fjQe1qDTOBw",
    "title": "I regret my purchase... - MSI MEG 342C",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-04-11T20:00:21Z",
    "video_url": "https://www.youtube.com/watch?v=fjQe1qDTOBw",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy"
    ],
    "views": 526075,
    "likes": 14133,
    "comments_count": 790,
    "description": "Thanks to Secretlab for sponsoring today's video! Check them out at   Plouffe loves his Alienware AW3423DW monitor. It's got a high refresh rate, QD-OLED panel, nicely curved screen, and a great design... but now there's competition! MSI's new MEG 342C has a tasteful black and gold colour scheme, a nice touch of RGB, and a high-powered USB-C port while still maintaining the excellent QD-OLED panel the Alienware does. Is Plouffe's favourite monitor about to change?  Buy a MSI 34\" 175Hz MEG 342C Curved Gaming Monitor:  Buy an Alienware 34\" 175Hz AW3423DW Curved Gaming Monitor:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Plouffe has a monitor 0:31 Unboxing 1:47 Installing the stand 3:06 Display specs, design, and ports/buttons 6:11 Sponsor - Secretlab 6:41Shoutout to the included cables 7:17 HDMI woes 7:53 HDR impressions 8:59 OSD settings 12:08 Stand adjustments and hot key 13:33 Gaming - Counter-Strike 14:11 Why ClearMR is important 15:09 Gaming - Resident Evil 4 Remake 17:11 Pricing and overall thoughts 18:13 Outro",
    "description_links": [
        "https://lmg.gg/secretlab",
        "https://geni.us/kAIIxs",
        "https://geni.us/qpmkqcv",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- God, this thing's sexy. My name is Plouffe, and I have an AW3423DW at home. It's a nice monitor, 34 inches, QD-OLED. Today, we've got MSI's version, the 342C QD-OLED. It's a 34 inch ultra-wide display, 21:9. It's got 175 hertz refresh rate, and it's got something really cool that I haven't seen yet, until today. VESA's new ClearMR motion rating, and it hits 9,000, which is the best rating. So I guess we'll see if that's any true or not. Let's open the box and take a look. (groans) Oh baby. (groans) MSI makes okay monitors, I've owned one before. It was a pretty decent display, it just didn't have the best HDR. And when I tried the Alienware, the AW3423DW, and I saw the HDR image that that thing can produce in games, I just couldn't go back. So, I bought one. Maybe I'll buy this thing after, maybe I switch back to MSI. I don't know. We got a stand here. We got screws for a wall, your monitor. It's probably screws for wall mounting your monitor. That's interesting. I haven't seen screws like this included before, but hey, that's cool. We got our base of our stand here. One thing about this that's very different from the Alienware, is just the case in general. There are a few other features that we'll get into that kind of differentiate it from it. But yeah, this gold is actually pretty sweet. We'll get a much better look once the whole thing's put together. But it's a really pretty monitor. The box, I've seen it on the box, and it looks really nice there. Here's the rest of the stand. They've really foamed it up. Keep it nice and fresh for you from the factory. (Plouffe sniffs) Ah yeah, off-gassing. Smells great. It actually doesn't smell that bad. It's not really off-gassing, I'm just joking. I don't wanna say MSI's monitor stinks. It doesn't stink, it smells like a monitor. Look at the rest of the stand, also super gold. A little bit on the inside here, super cool. It's got a good amount of plate. It's just, you know, it's a pretty stiff spring when there's nothing on there. And it's got, basically, the same kind of design that we've seen on most other more premium monitor stands where it's just kind of a column, or two columns in this case, inserting. And then you got a screw on the bottom. I do like the cool, kind of not-quite-triangular look that's on the back here, which is a little different from all of the hexagons that I've seen recently. I don't know why, it's like everyone's trying to be Cooler Master or something. Oh, the stand actually has to get screwed in. Okay, so that's why we got the bolts. I'm surprised, I didn't expect to be doing any of this today, because this is actually the first time I've seen like a non-clip in stand on a premium monitor in quite a while now. (Plouffe sings nonchalantly) So I guess that's one thing to note, is this isn't entirely tool less. You are going to want a little Phillips head screwdriver around to finish screwing this in. I'll be honest, it feels more secure too. As much as I love the ease of a tool less clip-in design, and I, I've never had a monitor fall. I'm an irrational, paranoid individual. (laughs) And so this makes me feel just a little safer. - [David] Ooh. - It's really pretty. 34 inches, 1800R curvature. So it's actually a pretty minor curve. I personally, wasn't super into curved displays at first, but I think for ultra-wide specifically, I actually don't want a flat ultra-wide. And in this case, 1800R was kinda just the right curvature to sort of like get me into being okay with a curved screen. Now that I've had it for a little while, I actually wish it was a little more curved. It doesn't need it, but I think it could use it just a little bit. I'm just gonna peel this off, but yeah, it's super color accurate from the factory. Delta E of less than two, 65 watt power delivery, it's got a KVM. Point- zero point one milliseconds gray-to-gray, 175 hertz. God, I know it's not 240 hertz. But honestly, 144 is pretty good. It's good enough for me, personally. So just being able to go to 175, just makes it a little bit more premium, but not quite, you know, that 240 hertz OLED experience that you're going to get from a couple other brands, specifically LG. Love it or hate it about MSI, I actually love the dragon logo that they have. Sorry, there's just a peel I'm trying to get off. They've got a really cool gold motif kind of going on with this one. And then, the navigation nipple, and then they've got a couple other buttons here. Probably power, and I don't know what this guy does, but yeah, also gold. You can fit so much IO in this bad boy. We've got two USB 3.2 Gen1 connectors up here, and then a microphone and headphone jack. And then on the bottom, one key difference from the Alienware monitor, is these are HDMI 2.1 connections, versus the 2.0 on the Alienware version. As well as DisplayPort, USB-C, I'll get to that in a second, and then USB-B upstream, as well as a couple more USB-A ports, and then an Audio Combo port at the very end. The reason this USB-C is so special, is because it can do not only DisplayPort, but it can also do 65 watts of power delivery. That's really impressive. That's basically fast charging on your phone, it's DisplayPort if you want to hook up a laptop or something to this thing. It's just really, really handy, and it's kind of one of the features that I am sorely missing from my monitor. This might be the upgrade I make. It won't be, but it might be. And then just, (David and Plouffe laugh) just over on the, (Plouffe chuckles) on very left here, we've got our nice C13 power delivery. So, it does seem to have the power brick inside the display, which I'm personally okay with. I don't need a... (Plouffe grunts) I don't need a laser thin monitor, personally. I like, and I don't like having my ground or desk space cluttered with a big power brick that I've got to cable manage later. But that's a personal preference kind of thing. And then, ooh, we've got our cable cover. Okay, I'm not gonna put this on, because we still have to plug stuff into it. But man, if I just leave it, I mean, you can see the seams a little bit, but man, this thing's gonna look good. This is the first time I think I'm actually going to put the cable cover on after I'm done, just 'cause of how good it looks. And we're gonna look at how good this display looks after we talk about our sponsor, Secret Lab. Thanks to Secret Lab for sponsoring this video. Secret Lab chairs are designed to keep you comfortable for those long nights of work and play. Their Titan EVO 2022 series chair offers four-way lumbar support, comes with a magnetic memory foam head pillow, and is offered in different upholsteries like hybrid leatherette, soft weave fabric, and NAPA leather. Best of all, a five year extended warranty is included, along with a 49 day return policy. So you're covered if anything goes wrong. Head to the link in the description, and check out Secret Lab today. - [David] HDMI, what? - HDMI, what? Yeah, there's cables that come with this thing. We got an HDMI 2.1 cable, a DisplayPort cable, but most importantly, aside from our power cable, was the handy dandy USB-C to C cable that you get. Which is nice, because a lot of the time something like this might have a nice like 65 watt power delivery on it, but it doesn't actually come with a cable. And the problem with finding USB-C cables, is a lot of them are rated for completely different things, because USB-C's been so, like around for so long, so it's not always easy to find one that has DisplayPort and fast charging on it. So thanks for including it MSI. That's nice. With HDMI two point... Oh that's weird as well. Why is, why'd it do this? Something's not right here. It, it says that it's trying to do 4K, but it's also trying to do 1440P. All I did was change this to 120 hertz. I'm going to drop it back down to 60, and see if it's suddenly full screens again. Yeah, it did. So, I don't know why. Something to do with HDMI. The reason why you might want to use HDMI 2.1 on this thing, is because if you have a console, then you can hook it up a lot easier, because they don't have DisplayPort on them. But, we have a 4090, so we're gonna use DisplayPort 'cause that just kind of always works. I gotta say, even with the black bars, one of the best things about OLED, is that once you're watching something, you don't notice them nearly as much as you do on an LCD panel, because it's like actually black here instead of being a weird like off gray kind of color. So this thing is only rated for HDR 400 but, you can do peak 1000, which will do a 1000 nits peak on whatever your brights are in the scene. It will probably wear your panel out faster. I'm not gonna lie. You're pushing it a lot harder when you put it up to peak 1000. But I mean personally I've used a similar display like this for, wow, almost a year now. And I've had it cranked to 1000 the whole time, and I've never, I- I don't have any issues so far myself. - [David] Yeah, the reds are crazy. - That's kind of partly just QD-OLED though, is, is like it makes red actually look red, instead of white OLED will- Reds still look red with white OLED. This is really kind of splitting hairs, but when you've got them side by side, QD-OLED red just looks actually red, instead of just like a really dark orange. It's hard to explain that without actually seeing it in person, but it handles yellows and reds particularly well. What else we got in our OSD? We got GI, which is like gaming intelligence, and then we've got a whole gaming mode here. So right now it's set to premium color. Changing the selective function may increase power consumption. Yes. See this looks bad. I think I like racing the most though. But what else can we change in here? We've got night vision, refresh rate, alarm clock. Oh, this is just stuff to show on screen, adapt to sync. Yeah it's got VRR, that's great. One nice thing actually is, you can put it into whatever color mode you want it to be in. Movie is probably relatively accurate. And then user, I have no idea what they're going to set it to, SRGB, Office, DolbyRGB, DisplayP3. Not only is this thing calibrated from the factory, so it is relatively color accurate out of the box, but it also has a pretty wide color gamut hitting 99.3% of DCI-P3 and 97.8% of Adobe RGB. So you can use it for quite a few things, and have, and have a lot of faith in how it's going to look here. So right now it's in P3. Image enhancement, I don't know what this does. Mostly just makes it brighter, hey, or like- - [David] Sharpening. - It's way sharper. - [David] Yeah. I think strongest looks awful, don't get me wrong. I would never put it to strongest. But weak, I think I do want just a little bit of sharpness, but I'm also one of those crazy people who like ups the sharpness on their TV just a little bit, just a little bit. I know. Let's see. So yeah, we'll keep all that, image, sharpness, screen size. Oh this is cool. You can change different aspect ratios. Put in a 4:3, 16:9, or the native 21:9. We're just gonna stick in 21:9 because that's what we're going with. And then yeah, you can change the HDR to either true black, 400, or peak 1000. I like peak 1000 personally, just 'cause I like having stuff crazy bright. It's just really fun. And that's about it, aside from our OLED care. So we've got pixel shift which you can set slow, normal and fast. This is actually really nice having this with three different options here instead of having it just turned to on or off. Pixel shift is where it takes the entire image and it just shifts at about three or four pixels over or like around or whatever. Panel protector is pretty cool. It looks like you can do either a short or long refresh. The short one only takes about 15 minutes to get rid of any image retention that you might spot on your display. And then for anything that's a bit harsher like say maybe you forget and you leave this thing on for two days straight with a game running and there's just like a little health bar or something on there try the longtime panel protect feature and see if that helps fix it. And then it's got static screen detection which what this does on a lot of panels is it turns it on and then it will find different static elements that are sitting there and it'll dim them a little bit to kind of make it so it doesn't wear out quite as quickly. And then, oh this is actually really cool too. It's got OLED panel info. I have been wanting something like this for panels and also other PC parts for the last couple years. This is great. It's got your short time and a long time. I don't know what the difference is there but it's telling you how long it's been running. And this thing, it looks like it has an hour and 46 minutes of run time so that's really cool actually. I can't wait to see that in more monitors and more peripherals like everything just give me some kind of internal clock that tells me how long something's been used for. Oh that- oh, this goes really low. Wow. I actually really dig it. I'm the kind of person who sits super low at their desk like this isn't even correct for me. My posture's not good and you know my shoulders are probably going to hate me in a couple years but it is what it is. I don't know, I don't know what to tell you. I like gaming really like low down and kind of like lean back like this. So I love that this thing gets this freaking low. That's crazy. Also gets pretty high too. Like stand's actually not bad. It's got a bunch of tilts that's, it's a pretty wide range. Can it not swivel? It can't. Okay so that's the one major disadvantage is it's fixed so you're gonna have to adjust the stand itself and not the monitor unless you want to buy an arm and then put it on a- on your wall mount or on an arm off your desk or something. It also can't pivot, which that's fine. I don't think anything that's doing like high refresh rate or is a QD-OLED panel needs to pivot so that you can watch it in portrait mode. Portrait mode usually caps out it like 60 hertz anyway on a lot of displays so it's kind of a waste. It's got about the same amount of wobble that most stands are going to have. If you want to eliminate wobble I highly recommend wall mounting. We figured out our mystery button back here. Apparently it's just a hot key so you can just assign it to whatever you want. Probably like a certain setting like oh I want to go into racing mode right now with like HDR 1000 whatever my current settings are. Boom, hit that one button. There you go. We got a game on this thing. Oh yeah, we're getting 370 plus FPS on Counter Strike GO because it's a 4090 on a 1440P screen. Not quite as demanding. 4K is about 8 million pixels and 1440P ultra wide is about 5 million. So there is a big performance difference there trying to run. Oh, oh I didn't get the 1D that's so bad. On top of the decent high refresh rate of 175 hertz we're also getting OLED pixel response time which is just massive. It's crazy how fast this thing is. They're advertising a 0.1 millisecond gray to gray response time. And then what's really cool is I mentioned earlier that this is ClearMR certified from VESA which is the new certification that we're going to be seeing a lot more throughout the next few years until someone else invents something different I guess. And what it does is it basically measures it takes some images, I don't know the exact testing procedure, but it takes some images and they'll count the blurry to non blurry pixel ratio and then they'll score it based on that. So for example, clear 5,000. This includes a range from 4,500 to 5,500 and it means that there should be 45 to 55 times more clear pixels than blurry ones. So with this monitor we're getting clear 9,000 which means we're getting at least 85 times more clear pixels to blurry ones and it's really just because the pixels refreshed so instantly on OLED in general compared to LCD technology. All right, let's see us go. Yeah, high refresh rate looks really good, does 175 hertz. I am never going to complain about that. We're playing for just a few seconds. These guys are like, oh the FOV, like I wanted to change the FOV because I know you can pull it back just a little bit more and they're like oh it's already so wide. I'm like, yeah it is because we're playing on this nice ultra wide display. Look at how much you can see around Leon. - [David] Is it Like an interlaced or some (beep) Why is it so shimmery? - Oh yeah, that fixes it like instantly. One thing you might want to use that hotkey for is the image enhancement. It's basically just kind of a sharpness slider although it does have an extra sharpness slider as well. I liked it for video but as soon as we started playing Resident Evil 4 it looked terrible. There was all this weird shimmer on everything where I was trying to sharpen the image or something. Not a fan, but yeah, you know, it looked good for videos it just did not look good for games. This game looks amazing. However, with the HDR experience that I'm getting with this display I'm getting about 180 FPS with our 4090 here with basically everything cranked on Resident Evil 4. You don't know how good HDR looks until you've seen a really good HDR experience as well. A lot of people look at HDR content on a monitor that doesn't really support HDR all that well. Like it, it has a box that says HDR but it's not good. It's like, you know, column- column brightness or like it's either like columns for the full array local dimming or it's a single edge lit kind of display and it just brightens basically the whole thing. When you can do every pixel as its own dimming zone it just, god it looks incredible. Aside from the black bars that we've got because all the cut scenes are only in 16 by nine. It just disappears. Everything else just looks like perfect. Like as we get to hold on- like all these shadows that are basically black they actually look black. So there's some sections of the game, especially near the end that have just got these huge floodlights on you and like I, my eyes were starting to hurt from using my own monitor at home. The impressive thing is having this really hot like spot right there and then having just this like perfect black kind of over here and in the corner here. Having that full range is what HDR is all about and it really is impressive once you see it in person. If that was even just a little bit more my eyes would be just seared from how bright it is. This monitor is great and even if you're worried about image retention on OLEDs in general I don't think it's that much of a problem if you do certain things like have your task bar hide away, don't show desktop icons maybe turn your monitor off when you're not using it. Stuff like that is gonna make it last quite a while. We can't find any information when it comes to how long the actual warranty is and whether or not it covers stuff like image retention. So that could be a pretty big sticking point for a lot of people when it comes to choosing between this and say the Alienware version or maybe one of the other panels that comes out because we're going to see a couple more of these before the year's over. This guy right here the MEG 342C is retailing for 1100 US dollars. That's a lot of money. It absolutely is. But for you to be able to get a 1440P ultra wide 175 hertz, peak 1000 nits HDR experience with a QD-OLED panel, especially now that it's got the 65 watt power delivery on the USB C, I don't know, I think you should just get it. It's just a fantastic monitor. This is short circuit. If you like other short circuits, then watch more of them. They're great. Thanks for watching.",
    "transcript_keywords": [
        "thing",
        "kind",
        "monitor",
        "HDR",
        "yeah",
        "good",
        "pretty",
        "OLED",
        "bit",
        "lot",
        "HDMI",
        "power",
        "MSI",
        "cool",
        "nice",
        "Secret Lab",
        "image",
        "display",
        "time",
        "good HDR"
    ],
    "transcript_entity_values": [
        "a nice like",
        "60 hertz",
        "Plouffe",
        "9,000",
        "4",
        "5,500",
        "USB",
        "65 watts",
        "21:9",
        "Secret Lab",
        "about three",
        "Adobe RGB",
        "QD",
        "DisplayPort",
        "LCD",
        "4:3",
        "1000",
        "VESA",
        "175",
        "Reds",
        "today",
        "2.0",
        "at least 85",
        "OSD",
        "Today",
        "five year",
        "NAPA",
        "1800R",
        "KVM",
        "David",
        "an hour and 46 minutes",
        "4,500",
        "240 hertz",
        "first",
        "Alienware",
        "two",
        "144",
        "55",
        "0.1 millisecond",
        "2.1",
        "zero",
        "65 watt",
        "one",
        "just a few seconds",
        "1440P",
        "FOV",
        "P3",
        "1100 US dollars",
        "nine",
        "second",
        "120 hertz",
        "Audio Combo",
        "LG",
        "less than two",
        "DCI-P3",
        "VRR",
        "HDMI",
        "a couple years",
        "David] Sharpening",
        "the last couple years",
        "about 8 million",
        "45",
        "about 15 minutes",
        "about 5 million",
        "16:9",
        "hertz",
        "34 inches",
        "jack",
        "SRGB",
        "34 inch",
        "Leon",
        "4090",
        "USB-C's",
        "Phillips",
        "97.8%",
        "DolbyRGB",
        "Gen1",
        "Delta E",
        "49 day",
        "year",
        "three",
        "One",
        "C13",
        "MEG",
        "60",
        "1800R",
        "Office",
        "almost a year",
        "Counter Strike",
        "IO",
        "99.3%",
        "240 hertz OLED",
        "370",
        "16",
        "MSI",
        "four",
        "400",
        "OLED",
        "the USB C",
        "the next few years",
        "USB-C",
        "Cooler",
        "two days",
        "5,000"
    ],
    "transcript_entity_types": [
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "GPE",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.03839300572872162,
        0.015916582196950912,
        0.019473088905215263,
        -0.06241798773407936,
        0.07122333347797394,
        -0.021699510514736176,
        -0.0560496523976326,
        0.036044713109731674,
        -0.024585096165537834,
        0.03112194687128067,
        -0.039421115070581436,
        -0.01613813452422619,
        0.05614349991083145,
        0.0024042241275310516,
        0.03721249848604202,
        -0.0050002834759652615,
        0.10612572729587555,
        -0.05575978010892868,
        0.05372495576739311,
        0.038186267018318176,
        0.0015623505460098386,
        -0.09840352088212967,
        0.00907182227820158,
        -0.08381982147693634,
        -0.015751341357827187,
        0.06374460458755493,
        0.03486853092908859,
        0.03445190563797951,
        -0.026204055175185204,
        -0.05664806813001633,
        -0.011104252189397812,
        0.057029031217098236,
        0.017392415553331375,
        -0.013797586783766747,
        -0.05847649276256561,
        -0.12514416873455048,
        0.07230038195848465,
        -0.12900525331497192,
        -0.06981871277093887,
        -0.03767397627234459,
        -0.06700919568538666,
        -0.013526548631489277,
        -0.018624668940901756,
        0.05874527618288994,
        -0.01970858871936798,
        -0.08970209956169128,
        0.04031553491950035,
        -0.06446512788534164,
        -0.08527775853872299,
        -0.045695796608924866,
        0.021634044125676155,
        -0.06878506392240524,
        -0.006322052795439959,
        0.011558902449905872,
        -0.016686655580997467,
        0.03675498813390732,
        -0.06368745118379593,
        -0.02516385354101658,
        0.009245455265045166,
        -0.04135553538799286,
        0.07794906198978424,
        -0.10031815618276596,
        0.010115248151123524,
        0.04087783023715019,
        -0.016750039532780647,
        -0.03322656825184822,
        -0.0555126778781414,
        -0.06906495243310928,
        0.005374957341700792,
        -0.014857254922389984,
        -0.020849574357271194,
        -0.0018493967363610864,
        0.01626327820122242,
        -0.04950414225459099,
        0.09797118604183197,
        0.031124062836170197,
        0.08010260760784149,
        -0.06048843264579773,
        0.032708339393138885,
        -0.021873680874705315,
        -0.0058438582345843315,
        0.03639775142073631,
        -0.06896628439426422,
        0.027211612090468407,
        0.05621704086661339,
        -0.05604349449276924,
        0.091633640229702,
        0.01887892372906208,
        -0.020294377580285072,
        -0.04944451525807381,
        0.047613222151994705,
        0.061506640166044235,
        -0.06136123836040497,
        0.025317728519439697,
        -0.040476176887750626,
        -0.029777411371469498,
        0.04464050009846687,
        -0.055136434733867645,
        -0.009221774525940418,
        0.0066543882712721825,
        0.020581169053912163,
        0.014792265370488167,
        0.06950908899307251,
        0.003855931106954813,
        -0.0458596907556057,
        -0.07338530570268631,
        0.03762954846024513,
        0.05150763317942619,
        -0.0530652180314064,
        -0.012307289987802505,
        -0.02468937635421753,
        0.04658609628677368,
        -0.08842828869819641,
        0.028766518458724022,
        -0.0016692064236849546,
        0.06920652836561203,
        -0.040736228227615356,
        0.021919747814536095,
        0.09456510096788406,
        -0.02439303509891033,
        0.008783008903265,
        -0.023586319759488106,
        -0.08442916721105576,
        -0.006559846457093954,
        0.0036013275384902954,
        0.036319684237241745,
        -0.1168820783495903,
        5.560503375832054e-33,
        -0.02329077757894993,
        0.09086205810308456,
        -0.09215700626373291,
        -0.05154312029480934,
        0.02987867221236229,
        0.1424206644296646,
        -0.0062704975716769695,
        0.08753594011068344,
        0.02818974480032921,
        0.01764390803873539,
        -0.05168607831001282,
        0.03551574796438217,
        -0.04950380697846413,
        0.010938355699181557,
        0.035562679171562195,
        -0.10336091369390488,
        -0.010306870564818382,
        0.04781794920563698,
        -0.026911940425634384,
        -0.013526305556297302,
        0.023463653400540352,
        -0.019917123019695282,
        -0.00924094207584858,
        -0.05751659721136093,
        0.06189848482608795,
        -0.00586768239736557,
        0.02816932275891304,
        0.03350139409303665,
        0.09160864353179932,
        0.023939115926623344,
        -0.05650309845805168,
        -0.06891433149576187,
        0.024358952417969704,
        -0.07204105705022812,
        -0.08056693524122238,
        -0.01749505288898945,
        -0.0878063514828682,
        -0.06397445499897003,
        -0.05992448702454567,
        0.03981247916817665,
        -0.05471602827310562,
        0.09238532930612564,
        -0.011278260499238968,
        -0.011258749291300774,
        -0.03526747226715088,
        0.013822942040860653,
        0.043981991708278656,
        0.009862706996500492,
        0.0772436261177063,
        0.008941327221691608,
        -0.06888267397880554,
        -0.018069736659526825,
        -0.05008101463317871,
        0.008160587400197983,
        -0.017594510689377785,
        -0.022191261872649193,
        0.021090056747198105,
        -0.010952579788863659,
        0.0187668614089489,
        0.005144394468516111,
        -0.01878499612212181,
        0.04168957844376564,
        0.03167004510760307,
        0.019011685624718666,
        -0.022835973650217056,
        0.09199836850166321,
        0.08398368954658508,
        0.05673414096236229,
        -0.1463216245174408,
        0.06372369080781937,
        -0.03454959765076637,
        0.02747897244989872,
        0.014537962153553963,
        -0.0944022387266159,
        0.04809524491429329,
        -0.041321225464344025,
        0.004818120039999485,
        0.0010249195620417595,
        0.08277217298746109,
        -0.08129514753818512,
        -0.019642634317278862,
        0.007281383499503136,
        0.00022323610028252006,
        -0.02735467627644539,
        -0.03165476769208908,
        0.028872201219201088,
        -0.02696879580616951,
        -0.035151269286870956,
        0.018537411466240883,
        -0.00364068616181612,
        0.015283964574337006,
        -0.06273151934146881,
        0.04210028797388077,
        0.028266865760087967,
        -0.04112524539232254,
        -4.7792951768725014e-33,
        0.020319843664765358,
        -0.09044874459505081,
        0.003515111282467842,
        0.018105050548911095,
        -0.003420352702960372,
        -0.011918808333575726,
        0.009601116180419922,
        0.07883038371801376,
        0.009083258919417858,
        -0.06280940771102905,
        0.06939844787120819,
        0.012636406347155571,
        -0.05844118073582649,
        0.02876497246325016,
        -0.00545898824930191,
        0.021707182750105858,
        0.004774271044880152,
        -0.07624084502458572,
        0.011560984887182713,
        -0.013728966936469078,
        0.05421413108706474,
        0.010140824131667614,
        -0.034134987741708755,
        0.0024047987535595894,
        -0.005018822383135557,
        0.029612770304083824,
        0.07826445996761322,
        -0.029188642278313637,
        -0.028157232329249382,
        0.003961390815675259,
        -0.03249024972319603,
        -0.056216828525066376,
        -0.07749618589878082,
        0.01652706041932106,
        0.10019470751285553,
        -0.04337283968925476,
        0.04217715561389923,
        0.006578401662409306,
        -0.0022099860943853855,
        0.06479143351316452,
        0.025714531540870667,
        0.09637460112571716,
        0.029525164514780045,
        0.09931422770023346,
        0.049876030534505844,
        0.011098997667431831,
        -0.044481825083494186,
        -0.03596390411257744,
        0.08191447705030441,
        0.011555607430636883,
        -0.08041781187057495,
        -0.03385477513074875,
        0.052579231560230255,
        -0.003028279636055231,
        -0.005157831124961376,
        -0.04557982459664345,
        -0.04308111220598221,
        0.11205640435218811,
        0.008092867210507393,
        -0.010968957096338272,
        0.03349138796329498,
        0.030541501939296722,
        -0.12455142289400101,
        -0.03446505591273308,
        0.05037282407283783,
        0.013473261147737503,
        0.06015542894601822,
        0.01643708162009716,
        0.06753670424222946,
        -0.003751808777451515,
        -0.013435005210340023,
        -0.09501412510871887,
        -0.12464912235736847,
        -0.039825670421123505,
        -0.013668647035956383,
        0.03714624419808388,
        0.09079504013061523,
        -0.018309211358428,
        0.05328937619924545,
        0.029502397403120995,
        0.04632153362035751,
        0.022034374997019768,
        0.07037283480167389,
        -0.06925240159034729,
        0.07184197008609772,
        0.030074406415224075,
        -0.03000127524137497,
        0.043176937848329544,
        0.02431388758122921,
        0.037353515625,
        -0.056063663214445114,
        0.052020102739334106,
        0.0016960997600108385,
        0.04831395298242569,
        0.04456990212202072,
        -4.834141620335686e-08,
        -0.018405407667160034,
        -0.03250419721007347,
        0.015986904501914978,
        0.05350422114133835,
        -0.053331341594457626,
        -0.09047559648752213,
        -0.024663766846060753,
        -0.012768981046974659,
        0.04985450953245163,
        -0.021791895851492882,
        0.04739044979214668,
        -0.09164722263813019,
        -0.01420469582080841,
        0.017620548605918884,
        0.05824505537748337,
        0.06618800759315491,
        0.030643928796052933,
        0.012452621944248676,
        0.012794402427971363,
        0.054486844688653946,
        -0.027079951018095016,
        0.026317818090319633,
        0.08044108003377914,
        -2.3857013729866594e-05,
        -0.033329010009765625,
        0.040744613856077194,
        0.01316982600837946,
        0.055972225964069366,
        0.010493773967027664,
        -0.05648805946111679,
        -0.023478753864765167,
        0.02857472561299801,
        0.059810470789670944,
        -0.010237911716103554,
        0.02095291018486023,
        -0.062435802072286606,
        -0.020791877061128616,
        0.08424956351518631,
        0.12737154960632324,
        0.09749948978424072,
        0.04171403869986534,
        -0.06516356766223907,
        -0.1172557845711708,
        -0.005786493420600891,
        0.030628440901637077,
        -0.05025764927268028,
        -0.03744801506400108,
        -0.07380977272987366,
        -0.04166196659207344,
        0.058581385761499405,
        -0.03197633847594261,
        -0.031818609684705734,
        -0.0015606085071340203,
        0.01927778124809265,
        0.011899634264409542,
        -0.0025440475437790155,
        -0.035484183579683304,
        0.11518799513578415,
        -0.03382616862654686,
        0.04165950044989586,
        0.051736731082201004,
        -0.1015537902712822,
        -0.01771627366542816,
        0.07698707282543182
    ]
}