{
    "id": "fJsOB4IrYwY",
    "title": "Best Meta Quest 2 accessories",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-05-05T14:00:31Z",
    "video_url": "https://www.youtube.com/watch?v=fJsOB4IrYwY",
    "category": "Science & Technology",
    "tags": [
        "meta quest 2",
        "quest 2",
        "quest 2 tips",
        "verge",
        "the verge",
        "meta",
        "oculus quest 2",
        "quest 2 accessories",
        "oculus quest 2 tips",
        "quest 2 tips and tricks",
        "oculus quest 2 games",
        "oculus quest 2 review",
        "virtual reality",
        "oculus quest",
        "vr",
        "ar",
        "vr headset",
        "vr headset videos",
        "quest 2 setup",
        "best vr headset",
        "best vr headset 2022",
        "tech"
    ],
    "views": 248998,
    "likes": 4992,
    "comments_count": 261,
    "description": "The Meta Quest 2 (previously known as the Oculus Quest 2) is a feature-packed VR headset thats gotten better with time. Whether you already own one, or plan to buy one at some point, here are some tips and accessory recommendations that should help you get more enjoyment out of the headset.   Read more:   If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:   Anker USB C Cable:   Quest 2 Elite Strap:  HTC Vive Deluxe Audio Strap:  Headset Adapter Deluxe Audio Strap Kit:  Anker Charging Dock:   Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  0:00 Intro 0:27 Meta Quest 2 improvements since launch 1:28 Quest 2 Elite Strap 2:16 Upgrade Quest 2 audio - HTC Vive Deluxe Audio strap 3:28 Anker Quest 2 charging cradle 4:07 Meta 2 passthrough viewing 4:44 Oculus Link 6:29 Meta 2 casting 7:10 SideQuest 8:38 Conclusion  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://bit.ly/3Fkw7Ur",
        "http://bit.ly/2TQsqjB",
        "https://amzn.to/387x9aa",
        "https://amzn.to/3KLKfHw",
        "https://amzn.to/3vV5uCB",
        "https://amzn.to/3KGtvBi",
        "https://amzn.to/37lXIYQ",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- The Meta Quest 2 is unique, (energetic techno music) not just because it's the only good standalone VR headset that you can buy, but because after almost a year and a half since it's release, it's still getting better. While most devices like phones, laptops and TVs rarely get better after their initial release, the Quest 2's list of features just keeps growing. Meta continually releases major updates, expanding the capabilities of both its hardware and software. The full list of improvements is too long to include here, but compared to at launch, the Quest 2 supports 120 Hertz refresh rate in some games, delivering smoother visuals than before. It can also natively connect to PC's wirelessly, making it possible to play games like \"Half-Life Alyx\" that aren't available on the Quest Store. And if you're on iOS, you'll soon be able to export your VR fitness stats from the Oculus Move app over to the Apple Health app. As an owner of one of these headsets, all of that change makes me happy that I bought one, and as someone who works for The Verge, that long-lasting support makes it easier for me to recommend to people, except for the part where you still need a Facebook account to set up one of these headsets. Mark Zuckerberg said in late 2021 that there may be some changes to that requirement at some point, but it's still murky on when or if it will arrive. The good news is that we don't expect this headset to be replaced anytime soon, so even though it's a year and a half old, it's still a worthwhile purchase. Whether you're interested in getting a Quest 2 or you already have one, but need a few pointers, I'm gonna highlight some of the headset's most useful features and some accessories that might make your VR experience a little better. While the soft strap (energetic music) that's included with the Quest 2 is fine for some on again, off again VR, it's a little flimsy and it doesn't support the headset's weight all that well. If you intend to invest a lot of time in VR, I suggest grabbing the Oculus Elite Strap, which costs $50 or sometimes less when there's a deal. To me, it's easily worth the cost. It distributes the weight of the headset more evenly, even around my large noggin. And I like that once it's secure, I don't need to keep readjusting it during intense gameplay, unlike the standard strap. And even if you play games that don't require movement, the elite Strap is just the more comfortable option. But if you buy one, just try to avoid yanking the headset off without first making strap adjustments. It's more fragile than it looks and from my own experience, it can develop cracks over time if you don't treat it nicely. And if you wanna give yourself a project, there's a way (upbeat music) to get both comfort and far better sounding audio from the Quest 2. It involves a couple of extra purchases and a little bit of disassembly, but you won't void your warranty. You can turn your Quest 2 into a FrankenQuest with HTC's Deluxe Audio Strap that usually costs around $90, but sometimes less. You'll also need these adapters that cost around $20 on Amazon. These snap onto the end of HTC's strap, allowing this Vive accessory to work with your Quest 2. Just be careful as you unclip the old strap and install one. Then, plug in the 3.5 millimeter cable into the Quest 2's headphone jack and you've got a completely transformed headset. Despite its similarities to the elite strap, I don't think the HTC strap is quite as comfortable. I mean, it is technically a hack job after all, but if good audio is slightly higher on your list than achieving ideal comfort, the headphones built into HTC's strap make it worth the purchase. They offer much more base and depth than those little speakers built into the side of the Quest 2 straps. They also offer a wide range of movement, allowing you to put them right up to your ear or let them hover a few inches away. Recharging the Quest 2 is easy, just plug in a USB C cable, (energetic music) but if you're recharging your headset in a busy space, it's somewhat likely that your headset might get yanked off the table and meet a disastrous fate. Or you may just forget to charge it, which to me can also be a disaster. Anker's charging cradle for the Quest 2 and it's two wireless controllers might be just what you need. It's kind of pricey at a hundred dollars, but it offers a simple way to secure your gear as it charges, and instead of having to align the USB C plug with the port, not that that's difficult, the cradle includes a clever magnetic mechanism that slots into the headsets charging. This way, you only need to align it with the cradle for it to secure and begin charging. This kit also includes two rechargeable battery packs, one for each controller, so they'll always be topped up. One of my favorite built-in features on the Quest 2 is its passthrough viewing mode, which lets you see through its external cameras. Their job is usually to make sure that you don't bump into anything while you're, say, doing the limbo to avoid being shot in \"Super Hot VR\". Passthrough mode is really handy to turn on when someone in the house is calling for you and you wanna be able to see them without having to take the headset off. Though I'll admit, it's also a great tool that makes it possible to see a drink or a snack without taking the headset off. Just note that what you'll see is a rather pixelated, black and white view of reality, but it's still useful if you need to quickly orient yourself in the real world. The Quest 2 has a lot (bright music) of great games like \"Beat Saber\", \"Resident Evil 4\", \"Tetris Effect Connected\" and more but it's true that there are some games that you should play that are still exclusive to the PC. But with the Oculus link feature built into the Quest, simply plugging the headset into your PC's USB 3 port will let experience them. Those can be purchased in varying lengths from Amazon for about $20. I'd recommend getting one that's at least 10 feet long. After you install the Oculus Desktop app for Windows, connecting your Quest will essentially turn it into a tethered Oculus Rift of sorts. You'll then be able to buy and play games made for tethered headsets that have better graphics than Quest 2 games, like \"Half-Life Alyx\", \"BONEWORKS\", \"Budget Cuts\" and more. Oculus Link is a great option for people who wanna remain seated while they play, but there's another built-in option, if you'd rather stand and have the freedom to move around. It's called Oculus Air Link and it connects you to a PC in a similar way, but without a cable holding you down. While it grants you more freedom to move around, both the visual fidelity and the latency can take a big hit without the wired connection, and to get playable results, you'll need to have a pretty capable wifi router on a network that isn't too congested with other devices. Even with its faults, I prefer Air Link to being tethered, but you should try both of them out to see for yourself. (energetic music) I love that both of those options are free but if you wanna spend a lot of time connecting wirelessly to a PC, I recommend buying the Virtual Desktop app on the Quest Store. It's $20, and while it's similar to Air Link in that it helps you connect wirelessly to a PC, it offers a much wider scope of customizable features and settings that will likely make for a better wireless experience. It's basically worth the price of admission to have your own virtual theater to watch movies in. When you're in virtual worlds, it's often so fun (upbeat music) that you wish other people could enjoy and observe it with you. Thankfully, that's very easy to do with the Quest. When you're in a game, hitting the Oculus button will bring up the quick actions menu and one of the buttons on screen will turn on casting. You'll then see a list of compatible devices, which will include TVs and streaming devices that support Google Cast, as well as phones or tablets that have the Oculus app running on them. Casting what you see in the headset onto another screen is a great way to make VR feel more like a group activity. So if you're having a party or if it's just you and another person, this is definitely a feature that you should try out. This feature is also great for showing VR newcomers the kind of fun that they can have in virtual worlds or helping to guide them when they're getting stuck in a game. The Oculus Store and the Quest has many great games and experiences but it might not have everything you're looking for. In addition to Oculus Link, (upbeat music) there's another avenue for checking out some interesting and sometimes free VR content but it's gonna require a little work on your end. Sidequest is an app for Windows, Mac OS and Linux that can help you sideload games and apps onto your Quest or Quest 2 headset. This is a great place to find interesting VR tech demos, early indie projects that could someday become big hits and more. One of my favorites is a fan-made mod for \"Doom III\". The team added good VR controls and movement to the PC game. Perhaps my favorite part of that mod is that it actually copies over the entire PC game onto the Quest storage and runs it off the headset's hardware, which is amazing. To give you another example, Sidequest is where you can find a mod that lets you import custom songs into the Quest version of \"Beat Saber\". You can use your own music or, like, use the audio from my voice and make a level out of it, like I'm doing right now. There are a couple ways to get started. You can connect your quest headset to a PC that has Sidequest on it, or if you're an Android user there's an official app that I recommend trying. Depending on your knowhow with sideloading apps and troubleshooting the setup process could take anywhere from five to 20 minutes. If you wanna try it out, visit the Sidequest's YouTube channel for a tutorial on setting it up with a PC and if you wanna go to Android route, the Cas and Chary VR YouTube channel has an easy to follow guide. I bought my Quest 2 close to launch in 2020 and each of these tips have expanded my enjoyment with it far beyond what I initially expected. So if you're just now buying one, hopefully these tips will help you out. (static crackling)",
    "transcript_keywords": [
        "Quest",
        "headset",
        "Oculus",
        "strap",
        "Oculus link",
        "Quest Store",
        "HTC strap",
        "Meta Quest",
        "Oculus Air Link",
        "Oculus Elite Strap",
        "quest headset",
        "games",
        "Oculus link feature",
        "Air Link",
        "Elite Strap",
        "HTC strap make",
        "link",
        "app",
        "Oculus Desktop app",
        "great"
    ],
    "transcript_entity_values": [
        "the Quest Store",
        "Chary VR YouTube",
        "almost a year and a half",
        "Android",
        "about $20",
        "one",
        "The Quest 2",
        "Quest",
        "the Apple Health",
        "Tetris Effect Connected",
        "Quest 2",
        "Windows",
        "20",
        "a few inches",
        "Linux",
        "Cas",
        "Super Hot VR",
        "VR",
        "late 2021",
        "a hundred dollars",
        "120",
        "2020",
        "five to 20 minutes",
        "50",
        "Vive",
        "Hertz",
        "Half-Life Alyx",
        "around $20",
        "BONEWORKS",
        "two",
        "jack",
        "Windows, Mac OS",
        "FrankenQuest",
        "Beat Saber",
        "Amazon",
        "Resident Evil 4",
        "at least 10 feet",
        "One",
        "Facebook",
        "HTC",
        "Sidequest",
        "the Quest 2",
        "USB C",
        "Mark Zuckerberg",
        "the Oculus Desktop",
        "Google Cast",
        "YouTube",
        "Anker",
        "first",
        "Oculus Air Link",
        "a year and a half old",
        "the Oculus Elite Strap",
        "3.5 millimeter",
        "Oculus Rift",
        "Quest 2",
        "around $90",
        "Quest",
        "Oculus",
        "The Verge",
        "The Oculus Store",
        "VR"
    ],
    "transcript_entity_types": [
        "LOC",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "TIME",
        "MONEY",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "EVENT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "WORK_OF_ART",
        "EVENT",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE"
    ],
    "vector": [
        -0.02524193935096264,
        -0.010485293343663216,
        -0.022534606978297234,
        -0.04230569303035736,
        0.038410235196352005,
        0.002599213272333145,
        -0.024009929969906807,
        0.07731371372938156,
        -0.020006245002150536,
        0.024577192962169647,
        -0.00887793768197298,
        -0.03721793368458748,
        -0.03846505656838417,
        -0.0184397604316473,
        0.0422094389796257,
        -0.018818708136677742,
        0.09860139340162277,
        -0.011625356040894985,
        0.055135976523160934,
        -0.0062360456213355064,
        -0.06774713844060898,
        0.017866121605038643,
        0.07484583556652069,
        0.03160349652171135,
        -0.08372803032398224,
        0.026777466759085655,
        -0.08160696923732758,
        -0.0332123264670372,
        -0.044667162001132965,
        -0.07307477295398712,
        0.013181904330849648,
        0.042446207255125046,
        0.003068918362259865,
        -0.029495954513549805,
        -0.07344993948936462,
        -0.060164693742990494,
        0.08928080648183823,
        -0.04567481204867363,
        -0.1315421313047409,
        -0.053214363753795624,
        -0.026751166209578514,
        -0.025476275011897087,
        -0.03944863751530647,
        -0.0018009013729169965,
        0.05347370728850365,
        -0.020084146410226822,
        -0.01745333895087242,
        -0.04664852097630501,
        0.04622207581996918,
        0.041443102061748505,
        0.03642056882381439,
        -0.10309820622205734,
        -0.007427964825183153,
        0.05050288513302803,
        -0.06608445197343826,
        0.10561281442642212,
        -0.09177950024604797,
        0.05672232434153557,
        0.03453730046749115,
        -0.024364443495869637,
        0.05231119692325592,
        -0.04264406859874725,
        -0.021780729293823242,
        0.04508444666862488,
        -0.07659468054771423,
        0.025591537356376648,
        0.022886546328663826,
        0.022845199331641197,
        0.01414862647652626,
        2.702145320654381e-05,
        -0.13230089843273163,
        0.02320561185479164,
        -0.015898557379841805,
        -0.08391298353672028,
        0.08262306451797485,
        0.09364194422960281,
        0.04561394080519676,
        -0.1106376200914383,
        -0.0031682983972132206,
        0.009071968495845795,
        0.003907481208443642,
        0.0017575720557942986,
        -0.040314681828022,
        0.004772299900650978,
        -0.019770558923482895,
        -0.010445920750498772,
        0.010445254854857922,
        -0.016258399933576584,
        -0.06709232926368713,
        -0.1145179346203804,
        -0.06527954339981079,
        0.03546697273850441,
        -0.026890356093645096,
        0.001743600587360561,
        0.06276029348373413,
        0.022101212292909622,
        -0.06954491883516312,
        -0.0354880765080452,
        -0.010018817149102688,
        0.033239707350730896,
        0.03329841047525406,
        -0.05320199579000473,
        -0.04328642413020134,
        -0.008488861843943596,
        -0.009882690384984016,
        -0.03709350898861885,
        -0.029980110004544258,
        -0.012853957712650299,
        0.042656976729631424,
        0.001779506099410355,
        -0.05430663377046585,
        0.016015633940696716,
        -0.011308162473142147,
        -0.07426250725984573,
        0.06637107580900192,
        0.10989861190319061,
        0.04409812018275261,
        0.11147778481245041,
        0.11433470994234085,
        -0.010298775508999825,
        0.02595255896449089,
        0.023289216682314873,
        -0.015221097506582737,
        -0.09683313965797424,
        0.028735177591443062,
        -0.07050324231386185,
        -0.052776165306568146,
        6.66073082337119e-33,
        -0.04047049209475517,
        0.13346970081329346,
        0.024572456255555153,
        -0.012929242104291916,
        0.04486842080950737,
        0.02692858874797821,
        0.015092779882252216,
        0.038328900933265686,
        -0.021053461357951164,
        0.030962800607085228,
        -0.02239411696791649,
        0.004082979168742895,
        -0.07278477400541306,
        0.01803007908165455,
        0.0481041818857193,
        -0.13474653661251068,
        -0.06428944319486618,
        0.028316820040345192,
        -0.12522083520889282,
        -0.053663380444049835,
        -0.022764557972550392,
        -0.04239627718925476,
        0.011273784562945366,
        0.04122529178857803,
        0.1319880485534668,
        0.029514377936720848,
        0.03106602281332016,
        -0.012031184509396553,
        0.05784821882843971,
        0.007334291003644466,
        -0.1048528254032135,
        -0.02818496711552143,
        0.019065236672759056,
        -0.04931764677166939,
        0.003020030679181218,
        0.06137370690703392,
        -0.03574534133076668,
        -0.05351797491312027,
        -0.017684081569314003,
        -0.033551137894392014,
        -0.05337889865040779,
        0.042837683111429214,
        -0.05666152015328407,
        -0.045698415488004684,
        0.001290597952902317,
        -0.026232438161969185,
        0.027265960350632668,
        -0.02705977112054825,
        0.019031763076782227,
        -0.0056115868501365185,
        -0.06672339886426926,
        -0.02945416234433651,
        -0.07554447650909424,
        -0.010370999574661255,
        -0.017576411366462708,
        -0.10816839337348938,
        0.0038617511745542288,
        0.04439450427889824,
        0.014288018457591534,
        -0.0218107420951128,
        0.04799916595220566,
        -0.07774677872657776,
        -0.01664469763636589,
        -0.0017542536370456219,
        -0.07888677716255188,
        0.0654091089963913,
        0.04619427025318146,
        -0.03646926209330559,
        -0.0437672883272171,
        0.037122417241334915,
        -0.034395731985569,
        0.09193384647369385,
        -0.015403954312205315,
        -0.040319085121154785,
        -0.0174846351146698,
        0.07187159359455109,
        -0.03959866240620613,
        -0.032209061086177826,
        0.022736208513379097,
        0.007998332381248474,
        -0.08160987496376038,
        -0.018159253522753716,
        0.02718130499124527,
        0.03786740452051163,
        0.08636616170406342,
        -0.08029263466596603,
        0.002928019966930151,
        -0.0911136120557785,
        0.00895918533205986,
        -0.029531214386224747,
        -0.024695880711078644,
        0.09336759895086288,
        -0.013128979131579399,
        -0.034008875489234924,
        0.007904584519565105,
        -6.799035815269095e-33,
        -0.015973452478647232,
        0.011490695178508759,
        0.000659629818983376,
        0.04480847343802452,
        0.035092081874608994,
        0.019278671592473984,
        0.030130673199892044,
        -0.058889880776405334,
        0.05209429934620857,
        -0.05806989595293999,
        -0.03799281641840935,
        0.017859043553471565,
        0.013960607349872589,
        0.04176535829901695,
        0.03322760388255119,
        -0.03412702679634094,
        0.01442487258464098,
        -0.03796811401844025,
        0.10411537438631058,
        0.042964160442352295,
        0.07837975025177002,
        0.07502500712871552,
        -0.024918319657444954,
        -0.06117844581604004,
        0.004171771928668022,
        0.00048014175263233483,
        0.016248753294348717,
        -0.005230279173702002,
        0.0401669405400753,
        0.008367692120373249,
        -0.04638531804084778,
        -0.03850117325782776,
        -0.030451567843556404,
        -0.03362560644745827,
        0.1037030816078186,
        0.11605674028396606,
        0.10880610346794128,
        0.0034103314392268658,
        -0.028347576037049294,
        -0.037528734654188156,
        -0.019462840631604195,
        -0.021064497530460358,
        0.0894676223397255,
        -0.044953107833862305,
        -0.0012174592120572925,
        -0.07562165707349777,
        -0.025198258459568024,
        0.05411312356591225,
        -0.03148178383708,
        0.022265249863266945,
        0.0019727149046957493,
        -0.00906566996127367,
        -0.001266814419068396,
        0.007673542480915785,
        -0.08978798240423203,
        -0.012798452749848366,
        -0.1064537838101387,
        -0.010740186087787151,
        0.06763102114200592,
        -0.04860960319638252,
        0.05482916533946991,
        0.03672412782907486,
        -0.14001885056495667,
        0.010150042362511158,
        0.018595663830637932,
        0.045590344816446304,
        0.08120130002498627,
        0.019277213141322136,
        -0.03196609392762184,
        0.013087855651974678,
        -0.06251681596040726,
        -0.022084269672632217,
        0.01975424960255623,
        -0.04193250089883804,
        -0.0011360057396814227,
        0.05460404232144356,
        -0.006903598550707102,
        -0.050972968339920044,
        0.025416241958737373,
        0.04209432005882263,
        0.007056561764329672,
        0.021380456164479256,
        0.09583787620067596,
        -0.024793269112706184,
        0.03849491849541664,
        0.04186397045850754,
        -0.006430041044950485,
        0.03789705038070679,
        -0.0819070115685463,
        0.048551294952631,
        -0.019091032445430756,
        0.026357362046837807,
        -0.060585521161556244,
        0.12236207723617554,
        0.015200525522232056,
        -5.18538527671808e-08,
        0.01687467470765114,
        -0.014369171112775803,
        -0.01789986900985241,
        -0.026634661480784416,
        0.02463380992412567,
        -0.056894998997449875,
        -0.043432530015707016,
        0.048167336732149124,
        -0.01655440591275692,
        0.026543620973825455,
        0.01897849328815937,
        -0.023810455575585365,
        0.007464746478945017,
        0.0810963436961174,
        0.0565120093524456,
        0.059172503650188446,
        -0.02943866327404976,
        0.09537278115749359,
        -0.032940857112407684,
        -0.08271072059869766,
        0.007425757125020027,
        0.06883812695741653,
        0.07957909256219864,
        -0.12722039222717285,
        0.020967109128832817,
        0.05873599648475647,
        0.025356946513056755,
        0.028535498306155205,
        0.08622609078884125,
        0.045587118715047836,
        0.04573295637965202,
        0.021605785936117172,
        -0.01298767700791359,
        -0.0788968876004219,
        -0.04719248041510582,
        -0.05493069067597389,
        -0.04970207065343857,
        0.04885771498084068,
        0.02892843633890152,
        0.028519928455352783,
        0.06368094682693481,
        -0.010911463759839535,
        0.02471362054347992,
        0.07803084701299667,
        -0.020370665937662125,
        -0.024685878306627274,
        0.02063903398811817,
        -0.10226990282535553,
        -0.019407130777835846,
        -0.034921761602163315,
        -0.008231773041188717,
        -0.02101949043571949,
        0.0715494379401207,
        -0.0040746727026999,
        0.012913301587104797,
        0.04321860894560814,
        0.0939207598567009,
        0.03402307257056236,
        -0.027506550773978233,
        -0.01421466376632452,
        -0.01926422491669655,
        -0.008739902637898922,
        0.0068481662310659885,
        0.0650804191827774
    ]
}