{
    "id": "fKaCnjPziWM",
    "title": "Mi 8 Explorer Edition Durability Test - Is it FAKE?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-09-30T07:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=fKaCnjPziWM",
    "category": "Howto & Style",
    "tags": [
        "Mi 8 Explorer Edition",
        "Mi 8 Durability test",
        "Mi 8 Teardown",
        "Mi 8",
        "Xiaomi Mi 8",
        "Xiaomi",
        "Mi 8 fake",
        "Clear teach",
        "Clear Mi 8",
        "Clear smartphone",
        "Smartphone",
        "Explorer Edition",
        "Mi 8 unboxing",
        "Mi 8 review",
        "Xiaomi Mi 8 review",
        "Mi 8 hands on"
    ],
    "views": 2500888,
    "likes": 57437,
    "comments_count": 4392,
    "description": "The Mi 8 Explorer edition is here! Go to  and use code JERRYRIG to save 66% on a 2-year plan. Start protecting yourself on the web today! Its time to take the Mi 8 Explorer Edition out for a durability test and a JerryRigEverything Teardown. The Mi 8 Explorer edition was released earlier this year with a transparent back, showing off some of the internal components. But... does the Mi 8 look too good to be true? The only way to find out for sure is to take the Mi 8 Explorer Edition apart and review it from the inside.   The durability test of the Xiaomi Mi 8 Explorer Edition starts with the scratch test, where we can easily see that whatever design Xiaomi has included on the Explorer edition is underneath the glass. If the Mi 8 Explorer Edition survives the bend test, we will have to remove the back glass covering the components, and see what it *really* looks like.   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   Get FREE Tesla super charging with my link:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:  Music is from HERE:    *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://NordVPN.com/jerryrig",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://ts.la/zack10701",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://share.epidemicsound.com/pcGGf",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "So I've been making clear phones for about 3 years now. It started back with the old Galaxy S7. Lately we've had a few manufacturers jump on the transparent bandwagon with me, which is totally awesome. I think it's super cool. HTC made one, and now Xiaomi's released the Mi 8 Explorer Edition. This one caught my eye because it's transparency might not be the real deal. It might all be a facade. The only way to find out for sure was to get one for myself. Huge thanks to NordVPN for sponsoring this video. Let's get started. [Intro] Xiaomi's circuits back here on the Mi 8 seem too perfectly aesthetic. Components don't match up to where they should be, and each circuit has it's own logo with quotes and specs. Don't get me wrong, it still looks super cool and I'd totally still rock this phone, but it might just be a sticker under the glass back and not the real components. We'll have to find out. Starting the durability test like I've done with the last 100 phones I've tested. We begin with the scratch test. Not all displays are made equally. Some phones have plastic screens that scratch at a level 3, which HTC has made a sapphire screen that scratches at a level 8. Xiaomi has been using the very much standardized Gorilla Glass 5 on this phone, so we'll see the normal hardness level of 6, with a deeper groove at a level 7. It'll resist keys, coins, and razor blades, but pocket sand and other minerals harder than a Mohs 6 can still cause damage. The Mi 8 top notch contains the face scanner and 20 megapixel selfie camera, along with a wire mesh earpiece grille that's very solidly attached to the frame. It won't be falling out. The bottom of the phone has no physical buttons which is also the norm these days. Let's get a closer look at that back panel. Seriously one of the coolest looking phones I've seen in a while, even if it does just end up being a sticker. None of the printed words or logos are on the exterior of the glass, and therefore can't be scratched off. Everything is underneath. The Xiaomi Mi 8 does have dual cameras and they are doing it right with both a normal lens, and a 2x optical zoom lens combo. The dual LED flash is plastic. The sides of the phone are made from aluminum, a tad bit softer than the stainless steel sides we saw in the iPhone Xs. They are covered in a thin layer of paint, so the silver will start showing through if it ever gets dropped or accidentally scratched. The power button is painted red and still made from metal. Nice little accent to an already good looking phone. The volume rocker is also metal. If we accidentally scratch the top of the phone, we get more metal. Xiaomi has had plastic end caps on their phones in the past for signal transfer, but it looks like they avoided that this time around with the glass backed design, allowing for the all-metal side rails. There is a dual SIM card tray, but no rubber waterproofing around the opening. This Mi 8 has no water resistance, so keep that in mind. Down here at the bottom we find a USB-C charging port, more metal, but no headphone jack. It's interesting that companies yelling innovation the loudest, usually have the least amount of features. Xiaomi has plopped a 6.2 inch 1080p HDR 10 notched AMOLED display on the Mi 8 meaning that if we add a little heat, it'll turn white. Now lately, with the Note 9 and the iPhone X, we have had AMOLED screens recover after the flame is removed. But after 15 seconds, this Mi 8 remains burned and the pixels do no recover even when the screen is turned off. One thing I forgot to mention is that this phone does have an in-screen fingerprint scanner, which is pretty awesome. So far, we've only seen this tech on Vivo phones so it's good to see the in-screen fingerprint hardware expanding to other manufacturers. Thumbs up for that. Apple's going to be pretty pumped when they invent this tech in a few years. Now for the bend test. Sometimes bending a smartphone is the quickest way inside, like with the Mi 5 back in the day, shattering completely in half. This time around though, even with a hefty amount of force applied from both the back and the front of the phone, the Explorer Edition remains solid and intact. It adds a slight flex to the frame, but nothing permanent remains when the pressure is released. We still need to get inside though. Lucky for us, with no IP rating, the glass should pop off relatively easily, which needs to happen if we're going to investigate those circuits. A little bit of heat to soften the adhesive and a slight bit of persuasion with my razor knife and metal pry tools, and the back glass starts coming off. The adhesive is only around the edge of the transparent glass, so whatever material lies underneath is not stuck to the glass directly. You can see the way the glass fades from transparent to black around the edges to kind of mask the adhesive holding the glass down. This looks awesome, and hopefully we see more of it in the future. Now for the guts. From the outside it looks like this Explorer Edition had a carbon fiber layer over the 3000 milliamp hour battery, but in reality, it's just a final sticker. Now I'm not going to say I invented putting stickers on batteries, but we kind of did do it first with the One Plus 6 before the Mi 8 was even announced. Either way, it still looks cool. Now let's dig into this motherboard thing. Whatever it is, it is held down with 9 pentalobe screws the same style we see holding iPhones closed. Kind of interesting. Then the whole decorative plastic top just pops off the actual motherboard underneath. The whole thing is a decoration all made from plastic. The quotes, the Qualcomm logo are all superficial garnish covering up the real circuits below. I'm definitely not complaining. I think it's pretty cool that Xiaomi is leaning towards a more techie design. But I do think that we shouldn't succumb to the unrealistic standards and expectations of what the world thinks circuit boards should look like. All circuit boards are beautiful just the way they are and we shouldn't have to cover them up. Huge thanks to NordVPN for sponsoring this video. Rated #1Virtual Private Network by PC Magazine. A Virtual Private Network, or VPN does a few different things. With over 5000 servers in 62 different countries, NordVPN encrypts your network traffic from one location to another, so your personal information is untrackable while using public Wi-Fi at hotels or airports. One subscription of NordVPN can secure 6 devices simultaneously, like your laptop, desktop, and cellphones all at the same time. For a 30 day risk free trial of NordVPN use the code jerryrig to get a 66% discount. That boils down to just $3.99 a month. NordVPN.com/jerryrig link is down in the description. Their 24/7 customer support will always be there to answer your questions. NordVPN keeps things real, just like my new jerry-rigged Mi 8 Explorer Edition. The back glass is intact, in place, and honestly looks almost better with the real components visible instead of the printed, slightly unrealistic bedazzlement that Xiaomi had in place. Hit that subscribe button if you haven't already, and come hang out with me on Twitter. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "making clear phones",
        "glass",
        "Explorer Edition",
        "phone",
        "Xiaomi",
        "phones",
        "back",
        "making clear",
        "clear phones",
        "back glass",
        "Xiaomi circuits back",
        "made",
        "NordVPN",
        "Explorer",
        "Edition",
        "metal",
        "plastic",
        "real",
        "Explorer Edition remains",
        "level"
    ],
    "transcript_entity_values": [
        "HTC",
        "3",
        "Qualcomm",
        "15 seconds",
        "9",
        "the Mi 8",
        "30 day",
        "6",
        "the Explorer Edition",
        "8",
        "this Mi 8",
        "3000 milliamp hour",
        "just $3.99",
        "Wi-Fi",
        "100",
        "Virtual Private Network",
        "the Mi 8 Explorer Edition",
        "NordVPN",
        "Twitter",
        "2x",
        "about 3 years",
        "half",
        "VPN",
        "Galaxy S7",
        "PC Magazine",
        "6.2 inch",
        "this Explorer Edition",
        "a few years",
        "Apple",
        "iPhones",
        "66%",
        "This Mi 8",
        "Xiaomi Mi 8",
        "Mi 8 Explorer Edition",
        "first",
        "5000",
        "Xiaomi",
        "the iPhone Xs",
        "the Mi 5",
        "these days",
        "62",
        "One",
        "20 megapixel",
        "one",
        "the day",
        "IP"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "FAC",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "EVENT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "NORP",
        "PERCENT",
        "PERSON",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "FAC",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.13263042271137238,
        0.024630358442664146,
        0.14037589728832245,
        0.06171385571360588,
        0.029175488278269768,
        -0.09681049734354019,
        0.03414882719516754,
        0.04595819115638733,
        -0.07756540179252625,
        -0.02092423103749752,
        0.04746303707361221,
        0.07215642929077148,
        0.05045538395643234,
        0.045900050550699234,
        -0.029334895312786102,
        -0.07392646372318268,
        0.0060884407721459866,
        -0.07884582877159119,
        -0.0393744632601738,
        0.06220311298966408,
        0.019372401759028435,
        -0.06722994148731232,
        -0.03195491060614586,
        -0.04006446525454521,
        0.002405512845143676,
        0.01829942874610424,
        0.01617945171892643,
        0.00279144081287086,
        -0.045216403901576996,
        -0.034546297043561935,
        0.010445032268762589,
        0.04470182582736015,
        -0.018605099990963936,
        -0.038475874811410904,
        0.10528888553380966,
        -0.0013721841387450695,
        0.08770591020584106,
        -0.01413625106215477,
        -0.05934949964284897,
        -0.03577272593975067,
        -0.15829236805438995,
        -0.03459184616804123,
        0.009453332982957363,
        0.0533648245036602,
        0.04700542613863945,
        -0.019819192588329315,
        0.12758369743824005,
        -0.0641399696469307,
        -0.012633901089429855,
        0.006453677546232939,
        -0.03478528931736946,
        -0.03153504058718681,
        0.024966375902295113,
        -0.04945456236600876,
        -0.013798079453408718,
        -0.02765508182346821,
        0.004763464443385601,
        0.007964755408465862,
        0.013259323313832283,
        0.04203682020306587,
        0.018778901547193527,
        -0.009016942232847214,
        0.008736821822822094,
        0.057772841304540634,
        0.047349367290735245,
        0.0034443759359419346,
        -0.02834918349981308,
        -0.07194013148546219,
        0.021752094849944115,
        -0.06004950404167175,
        0.021565735340118408,
        -0.0003156296443194151,
        -0.03298185393214226,
        -0.0035628685727715492,
        0.0394698902964592,
        0.05546395108103752,
        0.01375968661159277,
        0.014561246149241924,
        -0.04899200424551964,
        -0.040050435811281204,
        0.03889220580458641,
        -0.016714101657271385,
        -0.023101670667529106,
        -0.03057166375219822,
        0.021218419075012207,
        0.02389063872396946,
        -0.009628850035369396,
        0.01204437855631113,
        -0.0428042933344841,
        0.03931222856044769,
        0.09734978526830673,
        0.11853731423616409,
        -0.06335868686437607,
        0.03211798518896103,
        0.07224469631910324,
        -0.009277788922190666,
        -0.07174701988697052,
        -0.08487094193696976,
        0.03154028207063675,
        0.05507069081068039,
        -0.04192071035504341,
        -0.042221907526254654,
        0.0357590913772583,
        0.013266242109239101,
        0.026302970945835114,
        -0.06563519686460495,
        0.018046831712126732,
        -0.021062616258859634,
        0.0010188935557380319,
        -0.04702019318938255,
        0.06627572327852249,
        0.0021633761934936047,
        -0.012635431252419949,
        0.027970364317297935,
        -0.04168672114610672,
        -0.03892097249627113,
        -0.06115727499127388,
        0.07916361838579178,
        0.10953248292207718,
        0.015718886628746986,
        0.048090122640132904,
        0.026443377137184143,
        0.04738612100481987,
        -0.01968308351933956,
        0.01932576671242714,
        0.006312960293143988,
        -0.016243427991867065,
        4.4719199345217816e-33,
        -0.03370490297675133,
        0.07779833674430847,
        -0.03887753188610077,
        0.011165287345647812,
        -0.03841245919466019,
        -0.06792142987251282,
        0.08892345428466797,
        0.03540601581335068,
        -0.024866461753845215,
        0.02223692461848259,
        0.0037388342898339033,
        0.041741784662008286,
        -0.0742291510105133,
        -0.006460240576416254,
        0.06846034526824951,
        0.059657078236341476,
        -0.04245244339108467,
        -0.0007672464125789702,
        -0.0822875052690506,
        -0.002012992976233363,
        0.017352279275655746,
        -0.05407247319817543,
        0.02368246577680111,
        -0.09377510100603104,
        0.03593864664435387,
        0.10125105828046799,
        0.04300263896584511,
        0.014630665071308613,
        -0.012972272001206875,
        0.01373158860951662,
        -0.1389351487159729,
        -0.018638048321008682,
        -0.057387448847293854,
        0.05301952362060547,
        -0.031140508130192757,
        0.005878979805856943,
        -0.019237719476222992,
        -0.07490792870521545,
        -0.06919372826814651,
        0.021254878491163254,
        -0.08208448439836502,
        -0.013090723194181919,
        0.03442332521080971,
        0.003131323028355837,
        0.03137127310037613,
        -0.04480907320976257,
        -0.021005261689424515,
        -0.05706243962049484,
        -0.008648193441331387,
        0.05967782810330391,
        0.008079937659204006,
        0.02214406058192253,
        0.034854624420404434,
        -0.023709531873464584,
        -0.12921492755413055,
        -0.02354322373867035,
        0.11830658465623856,
        0.02621910348534584,
        0.1341465562582016,
        0.05810939148068428,
        0.06955768167972565,
        0.050220537930727005,
        0.010370372794568539,
        -0.007435376290231943,
        -0.02564561367034912,
        0.0681668072938919,
        -0.05312264338135719,
        0.008894736878573895,
        -0.03782053664326668,
        -0.0006671405863016844,
        -0.027882764115929604,
        0.0020349679980427027,
        -0.04724941402673721,
        -0.0015539132291451097,
        0.014698072336614132,
        -0.06887877732515335,
        -0.04019841179251671,
        0.01846146024763584,
        0.05364638566970825,
        0.002263962756842375,
        0.03957422822713852,
        0.05050548538565636,
        0.04090147837996483,
        -0.02222605049610138,
        -0.03817218542098999,
        -0.005492036230862141,
        0.06812869012355804,
        -0.04468551650643349,
        0.042424485087394714,
        -0.005572964437305927,
        0.022250095382332802,
        -0.05197563022375107,
        -0.03145506978034973,
        -0.0074969627894461155,
        -0.0024991617538034916,
        -4.405950089527681e-33,
        -0.043472032994031906,
        -0.03247380256652832,
        0.08396996557712555,
        -0.017612196505069733,
        -0.05059007182717323,
        -0.09073227643966675,
        -0.02433881163597107,
        0.026625454425811768,
        -0.03818797320127487,
        -0.034491583704948425,
        0.012195946648716927,
        0.036562975496053696,
        0.0016668506432324648,
        -0.0018646229291334748,
        -0.012529706582427025,
        -0.004754417110234499,
        0.01364810485392809,
        -0.0526525154709816,
        0.03866751492023468,
        0.01018886361271143,
        0.04261098802089691,
        0.04390022158622742,
        -0.019259920343756676,
        0.007864710874855518,
        -0.052988164126873016,
        -0.07618680596351624,
        0.03434908762574196,
        -0.033921390771865845,
        0.037107259035110474,
        -0.009252629242837429,
        0.06655468046665192,
        -0.03128734603524208,
        -0.0236701387912035,
        0.0297816414386034,
        0.08141472935676575,
        -0.022418048232793808,
        0.0258164145052433,
        -0.0635836273431778,
        0.019907860085368156,
        -0.03344631567597389,
        0.04197102412581444,
        0.0020087158773094416,
        0.009994721971452236,
        0.052330609411001205,
        -0.05874214693903923,
        0.020751571282744408,
        0.0667983740568161,
        -0.022594042122364044,
        -0.025212591513991356,
        0.10702972859144211,
        0.07426699250936508,
        0.024690929800271988,
        -0.035009048879146576,
        -0.07014235109090805,
        -0.012614167295396328,
        -0.020736820995807648,
        0.017167847603559494,
        -0.011758808046579361,
        -0.013080739416182041,
        0.040388572961091995,
        0.0928836464881897,
        0.01995539851486683,
        -0.029665673151612282,
        -0.015783049166202545,
        0.007556241471320391,
        0.03755522146821022,
        0.0696253851056099,
        0.08674915879964828,
        -0.08106867223978043,
        0.04686862975358963,
        0.02912701480090618,
        -0.07856228202581406,
        -0.07788918912410736,
        -0.09277482330799103,
        0.10637599974870682,
        0.019007248803973198,
        0.04589264094829559,
        0.047994084656238556,
        0.016515085473656654,
        0.03866976872086525,
        0.01810893602669239,
        -0.05030662193894386,
        0.05929939076304436,
        0.04175028204917908,
        0.08936700224876404,
        -0.03927657753229141,
        -0.0705614984035492,
        -0.010803960263729095,
        -0.025967083871364594,
        0.060706619173288345,
        -0.01543805468827486,
        0.017922185361385345,
        0.007792663760483265,
        0.049764953553676605,
        -0.003577295457944274,
        -4.849018608865663e-08,
        -0.04117346554994583,
        -0.045103538781404495,
        -0.006762840785086155,
        -0.00529772974550724,
        -0.028143659234046936,
        -0.06484955549240112,
        -0.0211354847997427,
        -0.02121885120868683,
        -0.07176356017589569,
        -0.06341718137264252,
        0.008692028932273388,
        -0.10810566693544388,
        -0.12117018550634384,
        0.03476816415786743,
        -0.07557081431150436,
        0.028912516310811043,
        -0.049604322761297226,
        0.12121367454528809,
        -0.023400824517011642,
        0.057091325521469116,
        -0.014374102465808392,
        0.030314264819025993,
        0.11307373642921448,
        -0.017393002286553383,
        -0.05458957329392433,
        0.1158548891544342,
        -0.10387960821390152,
        -0.0004836110456380993,
        0.07305068522691727,
        -0.039604511111974716,
        0.01503019966185093,
        0.027301818132400513,
        -0.008927812799811363,
        0.014145777560770512,
        -0.05554312840104103,
        -0.003109001787379384,
        -0.018182439729571342,
        0.13923504948616028,
        0.012058841995894909,
        0.005560717545449734,
        -0.017507892102003098,
        -0.12962159514427185,
        -0.025469623506069183,
        0.02423275075852871,
        0.0014430817682296038,
        -0.013664289377629757,
        -0.07582277804613113,
        -0.15558815002441406,
        -0.05717393010854721,
        0.02250024303793907,
        -0.002104139421135187,
        -0.048994772136211395,
        -0.03387768566608429,
        0.024916384369134903,
        -0.0031995761673897505,
        -0.012150014750659466,
        0.09126730263233185,
        0.016331488266587257,
        0.025866379961371422,
        0.05726084113121033,
        0.0023659199941903353,
        -0.015909681096673012,
        0.05823810398578644,
        0.06668495386838913
    ]
}