{
    "id": "fnQB6cN3UWo",
    "title": "Cisco Packet Tracer Download",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2019-10-15T19:58:35Z",
    "video_url": "https://www.youtube.com/watch?v=fnQB6cN3UWo",
    "category": "Science & Technology",
    "tags": [
        "Packet Tracer",
        "Cisco Packet Tracer",
        "Packet Tracer download",
        "CCNA",
        "Packet Tracer installation",
        "Packet Tracer 7.2",
        "Cisco Packet Tracer 7.2",
        "CCNA Packet Tracer Labs",
        "CCNA Labs",
        "GNS3",
        "Packet Tracer Labs",
        "Pass CCNA",
        "CCNA Exam",
        "CCNA practice",
        "cisco",
        "Python",
        "INE",
        "Cisco Certifications",
        "CCNA Training",
        "CCNP Training",
        "ICND1",
        "DevOps",
        "David Bombal",
        "CBT Nuggets",
        "ccna 2019",
        "MCSA",
        "MCSE",
        "comptia A+",
        "ccna 2020",
        "ccna 200-301",
        "200-301",
        "CCNA labs",
        "Free Packet Tracer Labs",
        "ccna",
        "cisco packet tracer"
    ],
    "views": 180571,
    "likes": 4774,
    "comments_count": 144,
    "description": "How do you download, install and configure CCNA labs with Cisco Packet Tracer? Well, this video shows you how to get started and get access to free CCNA Packet Tracer Labs!  ================================= Menu: ================================= Overview: 0:00 Is Packet Tracer enough to pass the CCNA Exam? 1:03 Free Packet Tracer labs: 1:40 How to download Cisco Packer Tracer: 2:08 How to install Cisco Packet Tracer: 5:22 Packet Tracer interface and options: 6:48 Configure and test Cisco devices in Packet Tracer: 10:20 Save device configurations and labs: 15:15  ================================= Free Packet Tracer Labs: ================================= Download Packet Tracer from here:  Free Packet Tracer labs:  Get the Packet Tracer course for only $10 by clicking here:   GNS3 EVE-NG VIRL Packet Tracer  10x Engineer CCNA Cisco Devnet Associate  CCNP Enterprise CCNP Security CCNP Data Center CCNP Service Provider CCNP Collaboration Cisco Certified Devnet Professional Cisco Certified Network Professional  LPIC 1  LPIC 2 Linux Professional Institute LX0-103 LX0-104  XK0-004   #CCNA #PacketTracer #CiscoPacketTracer",
    "description_links": [
        "https://www.netacad.com/courses/packet-tracer",
        "https://www.youtube.com/playlist?list=PLhfrWIlLOoKM3niunUBTLjOR4gMt_uR_a",
        "https://goo.gl/vikgKN"
    ],
    "transcript": "- [David Bombal] In this video, I'm gonna show you how to download, and install, Cisco Packet Tracer on a laptop. (upbeat electric music) - In this example, I've got a Windows 10 laptop which I'm controlling from my Mac. That just makes it easier to do the recordings, but I'm gonna show you how to download and install Cisco Packet Tracer on this laptop. Now, why would you want to use Cisco Packet Tracer? Cisco Packet Tracer is firstly free, you can download it by simply registering for a course on Cisco's website. You don't have to pay for the course, you don't actually have to take the course, you simply need to register on Cisco's website and then you'll be able to download Cisco Packet Tracer for free. So, it's free software that you can run on your laptop that allows you to simulate quite complex circuit topologies these days. So, you can run Cisco routers and switches, you can run servers, you can run PCs, you can create fairly complex topologies. If you studying for your CCNA, as an example, Cisco Packet Tracer is enough to pass the CCNA. It's not perfect, it's a simulator rather than an emulator, so it doesn't fully simulate Cisco IOS, but it has enough in it to give you a good foundation in networking and a good understanding of the topics for the CCNA exam. So, if you're new to networking, if you're new to Cisco, I'd recommend that you start with Cisco Packet Tracer and then later on you can look at technologies, or applications, such as GNS3, Cisco Viral, and EVE NG. Now, I've created a whole bunch of Packet Tracer labs. You can access some of those labs by using the link below. I wanna ask you a favor though, if you don't mind, please subscribe to my YouTube channel, please like this video if you've found it useful, and please click on the bell to get notifications when I post a new video. I'm gonna be adding Packet Tracer labs, Packet Tracer videos to YouTube so if you want to get access to those and be notified about them, make sure that you subscribe to my YouTube channel. Okay, without further adieu, let me show you how to bold a Packet Tracer Lab. So, the first thing I'm gonna do is simply search for Cisco Packet Tracer in google. First hit is the Cisco Networking Academy. Now, they've recently changed the login process on the Cisco Networking Academy website. In the past, you had a dedicated email address for this website, now it uses your Cisco.com login. And, we're told that here to login. If you have an existing Cisco.com account, use that email and password to login, if not, use your NetAcad email and password to login. Now, if you don't have an account, scroll down and click enroll to download Packet Tracer. This course is an introduction to Cisco Packet Tracer, it's a good course, but you don't have to go through it. It's 10-hours in length, it is free, but again, you don't have to go through it if you don't want to. Go to sign up today, and select English as your language and put in your details such as your first name, your last name, and your email address. This email address has to be valid because they will email you a link which you have to click on to complete the enrollment process. So, we told that we need to check our email and click on the \"get started\" link to access your account. Okay, so here's my email from the Cisco Networking Academy. I'm gonna click activate account. You now need to fill in your details. Now, one of the pieces of advice that I'll give you is if you don't work for a company, set the company name to \"self\". As in self employed. So, specify your country, specify your password, decide whether you want to get email notifications or not, put the capture information in and then click register. Now, you can sign in with your email address, Specify your password, and click sign in. Now, we're told that they're excited to have us join them, but we need to fill in some more details, so as an example, specify your gender, specify your state, specify how many years of experience you have in IT or Networking, specify if you have a disability, specify your birthdate. So, they ask for quite a bit of information here. Specify your race, if you want to. I'm gonna choose not to disclose that. Specify whether you've served in the military and click create account. Okay, so now that you've done that, you can launch the course if you want to. I'm not gonna do that, I'm gonna go to resources, download Packet Tracer. And what I'm gonna do is download the 64-bit version of Packet Tracer. This is version 7.2.2, they also have a Linux version and a Mac OS version, but I'm gonna download the 64-bit Windows version. As you can see here, it's downloading. Okay, so the file has downloaded. Here it is, Packet Tracer 7.2.2 win64 setup. To install it, it's a fairly simple process, I'm gonna double click on the application, click install anyway, click yes to allow this app to make changes to my device. You need to accept the license agreement, so read through the license agreement and accept it if you want to install the software and click next. I'm gonna mainly stay with the default to keep it as simple as possible. So, I'm gonna use the default installation directory. Click next, I'm gonna leave the startup menu folder at the default. Click next, I'm gonna allow the software to create a desktop shortcut and click next. And then I'm gonna click install. So, fairly basic installation. Similar to lots of other applications that you would install on a Windows computer. The software's installed and I'm now told that \"For Packet Tracer Skills Based Assessment to use this version of Packet Trace, please close all web browsers or restart your computer.\" I'm gonna click okay, shut my web browser, and click finish. I'm told that I'm running Packet Tracer for the first time, so files will be saved here. I can change that later, but I'm gonna click okay. Packet Tracer's now started, and now I can login with the same credentials that I used on Cisco's website, or on the NetAcad website. So, I'll specify my username, I'll specify my password, and click sign in. Now, the firewall is blocking some features, so I'm gonna click allow access for private networks. And there we go, Packet Tracer is now installed on my Windows computer. I downloaded it and installed it, but now lets build some topologies. Packet Tracer supports many devices such as routers, switches, hubs, wireless devices, and others. Here's a router, so I'll click on the router and then click on the workspace area. I'll select another router, add it to the topology, select a switch, lets take a modern switch, such as a 3650 and drop that into the topology. I'll select connections, there are various types of connections, such as straight through cables, crossover cables, fiber cables, and so forth. But I'm gonna select straight through, select the first ethernet connection on my router, select the first ethernet connection on my switch, I'll select straight through cable again. Select the second interface on the switch, select the first gigabyte interface on the router and I'll zoom in here to make it easier to see what's going on. There are a lot of option available in Packet Traces, so under options preferences, I can select this option, \"always show portal labels in logical workspace.\" So, I can now see the interface labels in my topology. What I also want to change is the font, because this is probably gonna be too small for me. So, I'm gonna set the CLI font to 18 and click apply. And then close this down. You can move devices around in your topology. You can rename them, so I'll rename this as \"router 1\", I'll rename this as \"router 2\", I'll rename this as \"switch 1\". Now, if you don't like the way these interface labels are set up, simply go to options, preferences once again, and then uncheck this option and then you can manually add your interface labels. You can also hide the router type by going to options, preferences, and un-selecting this option, show device model labels, but I wanna keep device name labels so I know the device names in my topology. I'll go back and display port labels for the moment. You can remove those and then manually add interface labels, so you may prefer doing it this way where you can control where the interface labels go. So, I'll do that just to make the topology nicer. So, something like that. There basically a lot of options here that you can use, depending on your preferences. So, there you go, there's my topology. What I'm gonna do on router 1 is go to CLI. Now, I've set the font quite big, but notice the router has booted and I can now access a router. Now, if you're not use to Cisco, this is known as user prompt, or user mode. When I use question mark here, various commands are displayed. Enable is how I get to privilege mode, or enable mode. I can type a few characters and then press tab. Question mark shows me other options, but I'm simply gonna type enable here. This gives me other commands that I can use in this mode. I'm gonna type \"conf t\" which is basically configure terminal for short. I used tab there to order complete commands. I can change the name of the router, and actually, this is router 2, so I'll set the host name to router 2. Back in my topology, this interface is connected to the switch, but to make it more logical lets start with router 1. So, router 1 CLI. Make that bigger, I don't wanna enter the initial configuration dialogue, so I'm gonna say no and press enter to get started. Type \"en\" tab enter; that takes me to privilege mode. CONF as in configure, tab, t, tab, enter. Takes me to global config mode on the router. I can now set a host name, so this is host, tab, R1. Changed the host name of the router. Other commands exist in this mode, so question mark will show me the commands available to me. Now, this router has this interface which connects it to the switch. So, on router 1, I can go onto interface gigabyte, and I'm pressing tab here to order complete, 000, no shutdown enables the interface. By default, router interface is a shutdown. IP address allows me to configure an IP address on the router and I'll configure it with this IP address. So, I've configured the router with an IP address of 10111 subnet mask: 255.255.255.0. End takes me back to privilege mode, or enable mode, and I should be able to ping myself on that interface. At the moment, it's not working because notice these interfaces are down the switch, by default, is powered off. So, in this case, I need to take a power module and add it to the switch to essentially power on the switch. And here you can see the switch is now booting up. So, once the switch is fully booted, the interfaces will go green. You can see this is green on this side, orange over here, this side is still red because I haven't no shut the interface on router 2. Switch interfaces, by default, come up. Router interfaces, by default, are shutdown so you have to enable them. So, on the router, CLI, on Router 1, I can see the interface came up, so the router can now ping itself. But lets go to router 2, and I know this is not gonna look great, but I'm going to make this smaller, so you can see what happens when I no shut the interface on the router. So, on router 2, make that a bit bigger, interface, so INT tab, gigabyte tab, g tab, so gigabyte 000. Notice, please, what happens when I type no shutdown. Interface went green, so I've enabled that interface. IP address that I'll configure here is 10112, mask 255.255.255.0. Hopefully, router 2 will be able to ping router 1 once the interfaces have all gone green, which they have. The reason why these interfaces were orange is because a spanning tree; spanning tree is a way to stop loops in a ethernet network, and in this case, it took a while for spanning tree to converge, in other words, make sure that everything was good. So, I've successfully built a topology, using Packet Tracer, and I've successfully sent traffic from one router to another router through a switch in Packet Tracer. Last thing to do is save the configuration and you can do that by typing \"copy running config startup config\" and saving it, or you can use an old command \"WR\" which is write, so basically writing the configuration. So, I've now built a topology in Packet Tracer. When I close Packet Tracer, I'm told that my changes will be lost, do I want to save them. And the answer is yes, so I'm gonna save this as my first Packet Tracer lab and click save. And there you go, start Packet Tracer up once again, go to file, open recent files, select my Packet Tracer lab, and I've been able to restore my Packet Tracer lab that I saved previously. If I look at the CLI of router 1, we should notice that it has an IP address as previously configured, show run allows me to see the running config of the router, and what you'll notice is that IP address is configured on gigabyte 000. And now that the links have gone green, I should be able to ping router 2, which I'm able to do. This first ping times out, because the router has to op for the MAC address of the other router. So, that's normal behavior. Okay, so there you go, I've shown you how to download, install, and use Cisco Packet Tracer. Great software, it's free, helps you a lot with labs, especially if you're studying for your CCNA exam. Now, if you've enjoyed this video, please would you subscribe to my YouTube channel, please would you like this video, and please click on the bell to get notifications when I upload a new video. I'm gonna be uploading lots of videos to my channel, I already have many, many videos on my YouTube channel including lots of Packet Tracer labs. So, have a look at the link below if you want to get access to a whole bunch of Packet Tracer labs. I'm David Bombal, and I wanna wish you all the very best.",
    "transcript_keywords": [
        "Cisco Packet Tracer",
        "Packet Tracer",
        "Cisco Packet",
        "Packet Tracer labs",
        "Packet",
        "Tracer",
        "download Packet Tracer",
        "Cisco",
        "Cisco Networking Academy",
        "router",
        "Packet Tracer videos",
        "download Cisco Packet",
        "Packet Tracer Skills",
        "install Cisco Packet",
        "click",
        "Cisco Networking",
        "close Packet Tracer",
        "start Packet Tracer",
        "running Packet Tracer",
        "adding Packet Tracer"
    ],
    "transcript_entity_values": [
        "first",
        "NetAcad",
        "EVE NG",
        "these days",
        "Linux",
        "Packet Traces",
        "3650",
        "Mac",
        "000",
        "10112",
        "Packet Tracer Skills Based Assessment",
        "Cisco",
        "Cisco Packet Tracer",
        "NetAcad",
        "GNS3",
        "64",
        "CCNA",
        "2",
        "second",
        "YouTube",
        "Networking",
        "today",
        "WR",
        "Packet Tracer",
        "IP",
        "Packet Tracer",
        "English",
        "Mac",
        "one",
        "win64",
        "10111",
        "10-hours",
        "MAC",
        "un",
        "firstly",
        "Cisco Packet Tracer",
        "Tracer",
        "Cisco",
        "CCNA",
        "Windows 10",
        "the Cisco Networking Academy",
        "INT",
        "First",
        "Windows",
        "Cisco.com",
        "1",
        "Cisco Viral",
        "CLI",
        "YouTube",
        "David Bombal",
        "Router 1",
        "CCNA",
        "Packet Trace",
        "Cisco IOS",
        "18"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "PERSON",
        "LANGUAGE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.060354914516210556,
        -0.011857666075229645,
        -0.015789492055773735,
        0.010442789644002914,
        -0.02754131704568863,
        -0.023899834603071213,
        -0.0318034403026104,
        0.031877826899290085,
        -0.1475134789943695,
        -0.03607816994190216,
        0.07543975114822388,
        -0.08031105250120163,
        -0.07206463813781738,
        -0.021790998056530952,
        -0.005925249774008989,
        0.0038951397873461246,
        -0.020935889333486557,
        -0.07415617257356644,
        0.01480884850025177,
        -0.03969765827059746,
        0.03080584481358528,
        -0.021898848935961723,
        -0.016862712800502777,
        -0.047871045768260956,
        -0.07463229447603226,
        -0.0317433662712574,
        0.062089864164590836,
        -0.04312850162386894,
        0.020884284749627113,
        0.01413995772600174,
        -0.05071093514561653,
        0.07161892205476761,
        0.006105797830969095,
        0.05096333101391792,
        0.008215154521167278,
        -0.12440887093544006,
        0.0460742749273777,
        0.06255191564559937,
        0.03289960324764252,
        -0.03013102523982525,
        -0.0009291954920627177,
        -0.042469870299100876,
        -0.02977095916867256,
        0.016395345330238342,
        -0.01914324052631855,
        -0.07933589816093445,
        0.023779451847076416,
        0.012616707943379879,
        0.05927448719739914,
        -0.04069902002811432,
        -0.016919007524847984,
        0.04264097288250923,
        -0.036459147930145264,
        -0.01005762629210949,
        0.053367920219898224,
        4.259607521817088e-05,
        -0.04399657994508743,
        -0.02992362342774868,
        0.031289152801036835,
        -0.03345875069499016,
        -0.05929132178425789,
        -0.02432248741388321,
        -0.014537419192492962,
        -0.01801239140331745,
        -0.005284022074192762,
        0.062429990619421005,
        0.009518158622086048,
        0.05726484954357147,
        0.04859777167439461,
        -0.08477123826742172,
        -0.1480976790189743,
        -0.001741789630614221,
        -0.02864408679306507,
        0.05191098526120186,
        -0.05686971917748451,
        0.05877656117081642,
        0.025419408455491066,
        -0.002048133872449398,
        0.004872465506196022,
        -0.08595669269561768,
        0.027599850669503212,
        -0.011451458558440208,
        0.012353109195828438,
        0.05843283236026764,
        0.029799148440361023,
        0.04967198893427849,
        -0.028704317286610603,
        0.04957876354455948,
        0.034103382378816605,
        -0.011103907600045204,
        0.032187916338443756,
        0.05428432300686836,
        -0.11579043418169022,
        -0.035592932254076004,
        0.026948221027851105,
        0.008997992612421513,
        0.07201983779668808,
        -0.0013304598396643996,
        -0.03397190943360329,
        0.008181095123291016,
        0.045038700103759766,
        -0.07879693061113358,
        -0.03187786042690277,
        -0.010173060931265354,
        -0.09499310702085495,
        0.014809303916990757,
        0.028080368414521217,
        -0.010837212204933167,
        0.04177592694759369,
        0.09002592414617538,
        -0.0016339874127879739,
        0.0850696936249733,
        -0.045079439878463745,
        -0.12438260018825531,
        0.08085346966981888,
        0.07778143882751465,
        -0.09850658476352692,
        0.07123138010501862,
        0.10338032990694046,
        -0.011611263267695904,
        -0.11437764018774033,
        -0.0024721608497202396,
        -0.008327791467308998,
        -0.04625476151704788,
        0.04504026845097542,
        -0.03641732782125473,
        0.015329182147979736,
        1.0368577960490547e-32,
        -0.07908406853675842,
        0.010202335193753242,
        -0.0999860018491745,
        0.02299046888947487,
        0.06905973702669144,
        -0.04166632145643234,
        0.05907285958528519,
        0.014078743755817413,
        -0.07893338054418564,
        -0.00377234467305243,
        0.014020510017871857,
        -0.028344623744487762,
        -0.14664232730865479,
        0.0024081936571747065,
        -0.021049119532108307,
        0.00037758713006041944,
        -0.028015367686748505,
        -0.04070881009101868,
        0.009523142129182816,
        -0.010887491516768932,
        -0.010110868141055107,
        -0.017671966925263405,
        0.024457190185785294,
        0.042017340660095215,
        0.11134373396635056,
        0.0675014927983284,
        -0.023389626294374466,
        -0.011410961858928204,
        0.0033088992349803448,
        0.010334360413253307,
        -0.03341149538755417,
        -0.01846063882112503,
        -0.004692239221185446,
        -0.005424076225608587,
        0.05728880688548088,
        -0.025356538593769073,
        -0.07760067284107208,
        0.02365615777671337,
        -0.09964261204004288,
        -0.05380303040146828,
        -0.013579403050243855,
        -0.06231747940182686,
        -0.016136465594172478,
        -0.05060553923249245,
        -0.04019336402416229,
        -0.05968426167964935,
        -0.05177649110555649,
        0.0024321398232132196,
        0.10108908265829086,
        -0.00404362753033638,
        -0.027285801246762276,
        -0.014810255728662014,
        -0.06526289135217667,
        -0.054437171667814255,
        0.07750718295574188,
        -0.062068961560726166,
        0.011455636471509933,
        -0.016874458640813828,
        0.012376893311738968,
        0.07872134447097778,
        0.010641788132488728,
        0.04457852616906166,
        -0.046058062463998795,
        0.03618522360920906,
        -0.0025701343547552824,
        -0.004616523627191782,
        -0.11329619586467743,
        -0.01019365806132555,
        0.02849198877811432,
        0.06242859363555908,
        -0.04448045417666435,
        0.004521130584180355,
        0.053001243621110916,
        0.041629817336797714,
        0.09357532113790512,
        0.05716194584965706,
        -0.08429936319589615,
        0.016728952527046204,
        -0.05472550541162491,
        -0.04834971949458122,
        -0.06308189779520035,
        0.011341562494635582,
        0.06856777518987656,
        0.015434777364134789,
        -0.027721308171749115,
        -0.044247835874557495,
        0.06175149977207184,
        0.01987835019826889,
        0.04595246911048889,
        0.05847841873764992,
        0.0401555560529232,
        -0.002143498742952943,
        0.017788292840123177,
        0.06046094372868538,
        -0.051215995103120804,
        -1.4116010604557813e-32,
        0.003110006684437394,
        0.03477415069937706,
        0.021347781643271446,
        -0.06122035160660744,
        -0.07542800903320312,
        -0.04749169573187828,
        0.08512812107801437,
        -0.004320054780691862,
        0.08721654117107391,
        -0.050652023404836655,
        0.03204340115189552,
        0.009019379504024982,
        0.0067224823869764805,
        -0.03203944116830826,
        0.028030790388584137,
        -0.023491140455007553,
        -0.09344065189361572,
        -0.015763139352202415,
        -0.03333641216158867,
        -0.05224168300628662,
        0.004749085754156113,
        0.05441463738679886,
        -0.007731493562459946,
        -0.023855796083807945,
        -0.07345375418663025,
        -0.061420317739248276,
        0.12505009770393372,
        0.06563753634691238,
        0.060858022421598434,
        -0.023860596120357513,
        -0.036097507923841476,
        0.03448841720819473,
        0.018046017736196518,
        0.05441679432988167,
        0.017095956951379776,
        -0.04310273751616478,
        0.08974217623472214,
        0.07930070906877518,
        0.0035236950498074293,
        -0.03621969744563103,
        0.017348947003483772,
        0.034000881016254425,
        -0.12394724786281586,
        -0.01542254164814949,
        -0.025097962468862534,
        0.03328573331236839,
        0.06154404208064079,
        -0.009913626126945019,
        -0.11417872458696365,
        -0.030598679557442665,
        0.09782962501049042,
        -0.03675754368305206,
        0.016292283311486244,
        -0.015029648318886757,
        0.03452032431960106,
        0.15030089020729065,
        0.08020863682031631,
        -0.04139665886759758,
        0.07286446541547775,
        -0.023070216178894043,
        0.009265557862818241,
        -0.10777278989553452,
        -0.06776776164770126,
        0.03607899695634842,
        0.005664779804646969,
        -0.06900506466627121,
        0.010248013772070408,
        -0.05418207123875618,
        -0.019851399585604668,
        0.02466622181236744,
        -0.10408596694469452,
        -0.037986043840646744,
        0.03750648349523544,
        -0.022313976660370827,
        0.07055144757032394,
        0.019104596227407455,
        -0.07015048712491989,
        -0.012173478491604328,
        -0.014323911629617214,
        -0.032594308257102966,
        -0.06409311294555664,
        -0.036636706441640854,
        -0.025176921859383583,
        0.053218990564346313,
        -0.026914427056908607,
        0.011784414760768414,
        0.042186811566352844,
        0.020777810364961624,
        0.06259515881538391,
        0.005107980687171221,
        -0.05237961187958717,
        -0.007881954312324524,
        -0.018045734614133835,
        0.046937618404626846,
        -0.0008959856349974871,
        -5.974393957330904e-08,
        -0.0327875129878521,
        -0.0033948554191738367,
        -0.10352304577827454,
        0.016869286075234413,
        0.03193860873579979,
        0.0861169621348381,
        0.006638170685619116,
        -0.007427334785461426,
        0.007820794358849525,
        0.06703320145606995,
        0.011379430070519447,
        -0.011434599757194519,
        -0.09968753904104233,
        0.07784213125705719,
        -0.0010029578115791082,
        0.007180751767009497,
        -0.06977413594722748,
        -0.03730565309524536,
        0.01969689503312111,
        -0.06854774802923203,
        -0.00047048431588336825,
        -0.025856254622340202,
        -0.02224857546389103,
        0.02531857043504715,
        -0.030177483335137367,
        -0.013036933727562428,
        -0.0421576164662838,
        0.0834580808877945,
        -0.03486012667417526,
        -0.04192202910780907,
        -0.018003681674599648,
        0.004721274133771658,
        0.015538152307271957,
        -0.006534464191645384,
        0.09466128796339035,
        0.05654725059866905,
        -0.042792078107595444,
        -0.02634710818529129,
        0.07272191345691681,
        0.05883748084306717,
        -0.03991348668932915,
        -0.10024882107973099,
        -0.05498316511511803,
        -0.02814367413520813,
        0.037675149738788605,
        -0.07303455471992493,
        -0.08712060749530792,
        -0.0023567932657897472,
        0.03311198204755783,
        0.0451052188873291,
        0.060029082000255585,
        -0.040353160351514816,
        0.022618671879172325,
        -0.0303658377379179,
        0.04626419395208359,
        0.05605234205722809,
        -0.02575235441327095,
        -0.03267322853207588,
        -0.052382875233888626,
        0.04419741779565811,
        0.05935098975896835,
        0.04648414999246597,
        0.005874390248209238,
        -0.03283412754535675
    ]
}