{
    "id": "FnwhYEUHw7k",
    "title": "The 6.9GHz CPU - LN2 Cooling",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-06-09T16:59:40Z",
    "video_url": "https://www.youtube.com/watch?v=FnwhYEUHw7k",
    "category": "Science & Technology",
    "tags": [
        "LN2",
        "Liquid Nitrogen",
        "Splave",
        "Overclocking",
        "NICE"
    ],
    "views": 3211648,
    "likes": 114212,
    "comments_count": 4312,
    "description": "Learn more about the MSI RTX 3070 Ti Ventus 3X 8G OC at   Get your UGREEN Nexode 65W charger with up to 26% off using code 15GAN65W at:   To celebrate the nicest day of the year, 6/9, we recruited overclocker Splave to help us get a CPU up to 6.9GHz.  A LOT of liquid nitrogen was used.  Make Splave famous:    Discuss on the forum:   Buy an Intel i9-12900KS:  Buy an ASROCK Z690 Taichi:  Buy a kit of G.Skill TridentZ DDR5:  Purchases made through some store links may provide some compensation to Linus Media Group.  Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 - Linus gets things thrown at him 0:35 - UGreen! 0:49 - Linus plays with LN2 1:49 - Why would you want LN2 for overclocking? 2:30 - How to prep for -193C 5:58 - How to hardcore overclock 8:05 - Alex attempts to overclock 11:25 - Splave does an overclock 13:29 - Linus comes back, is amaze 15:56 - MSI! 16:35 - Outro",
    "description_links": [
        "https://www.msi.com/Graphics-Card/GeForce-RTX-3070-Ti-VENTUS-3X-8G-OC",
        "https://amzn.to/3Q1RAq7",
        "https://twitter.com/SplaveOC",
        "https://www.instagram.com/splaveoc/?hl=en",
        "https://linustechtips.com/topic/1436194-the-69ghz-cpu/",
        "https://geni.us/5ZuT",
        "https://geni.us/elor8b",
        "https://geni.us/cr59",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Today is a good day, because I have everything I need. 230 liters of liquid nitrogen, this rotten apple, this giant hunk of copper, these tongs, the one and only Allen Splave Golibersuch, current world record holder for 12900K and 12900KS overclocking, and of course, this MAPP gas torch. What are we going to be doing with them? We are going to be overclocking. Why, you ask? I'm glad you did, because it's the day of our Lord, June the ninth, and we desire a 6.9 gigahertz CPU. Nice, like this message from our sponsor. UGREEN, make charging more convenient with UGREEN's new 65-watt charger. It's a three-in-one charger that has two USB-C ports and a USB-A port in a super compact form factor that fits in the palm of your hand. Get yours today using the link down below. Step one, get liquid nitrogen from this through the phase separator into this. Whoo! It's freaking me out, guys! How do we tell how full it is? We can't see a thing. Also, my hand's very cold. - [Man] (indistinct) Do you drive a Subaru (laughs)? - [Allen] Stranger things. - How you doing there, hosey boy? The next step is obviously to play with it for a bit. What is it, a minus 195 degrees? - Yeah. - The fact that it's still boiling around the apple means it's not quite frozen through yet, right? - You got it. - Drink your juice. (laughing) - All right, come on, banana buddy. Okay. (thuds) (screams) (laughing) - [Man] You should probably put on some safety glasses. (thuds) (laughing) - You'd hardly even believe that was a tangerine once. (thuds) I guess we should get to work now, huh? Whoo! - Oh, god, it's disgusting. - Watch out, watch out! - Oh god, oh god. - [Man] Oh, wait, it broke through. - Whoa, our bucket's leaking? Crap, this is where it was sitting on the floor (laughs). - [Man] Yeah, the epoxy that's there I guess froze. - With that outta the way, let's fill up a more reasonable sized container from LttStore.com and talk about why we want liquid nitrogen for overclocking at all. Whoo! See, the thing about microprocessors is the faster you run them, that is more gigahertz, the more heat they generate, and as they get hotter their internal resistance goes up, generating, you guessed it, even more heat. This creates a kind of hard barrier to how fast you can go. That's why we don't have 10-gigahertz CPUs today. But what if you could remove all of that heat as efficiently as possible, say, take it down to greater than 170 degrees Celsius? Well, that's where this buddy comes in, but it's not as simple as just taking your CPU, plunking it into the motherboard, and dumping liquid nitrogen on it for reasons that you might not necessarily think of. It's not the liquid nitrogen that I'm putting on this board that has a chance to kill it. It's actually the moisture in the air around us. You see, as that moisture contacts my cold board, it's going to condensate, or turn into liquid water, which as you guys can imagine, having sitting on a motherboard is a pretty bad time. Things like closed cell foam, dielectric grease, artist eraser, and shop towels are great tools to keep air and, therefore, moisture away from your sensitive electronics. However, this particular board, which was prepared by Splave is using a technique that I haven't seen before. It looks almost like a conformal coating. What is this? - [Allen] This is liquid electrical tape. - Oh. - I ruined too many clothes with Vaseline. - Okay, fair enough. Now, the keen-eyed among our viewers have probably noticed that you didn't just blanket the whole board in electrical tape. And in fact, it seems to be built up in thicker layers in certain areas. Obviously, you don't want any moisture in your VRMs with the kind of current you're gonna be running through there. It would arc much more easily, but can you explain the rationale behind why you might, say, coat the audio chipset but not coat the motherboard PCH? - The motherboard PCH is gonna be pretty warm as it is and when I don't run a cooler on it to let it get warm, so it kind of acts as a defroster in this area. - And then, would that be the same thing for the bottom of the board here? - Yeah, it won't really get this far. Put a backboard heater in the chipset, and the VRM we'll keep it pretty defrosted. - Printed circuit boards are made of copper, and copper as you guys know is an excellent conductor of heat and also cold. So if we put something really cold here, it's conceivable that if we didn't have other heat sources on the board, this entire thing would get really cold really fast. That's a heater. Oh, I see, how fun is this? This is a giant fricking centimeter-thick thermal pad. Om nom nom, mn, delicious. And under it is, what is this, an EHOT? Who makes this? - Elmor. - Elmor's another famous overclocker, and you guys are all bitter enemies. So basically, all I'm really looking at here is pretty much the same thing you'd find on your rear car window for defrosting. It's just high resistance wires on a PCB. So you just use a simple six-pin PCIE, and then it basically just goes, yep, heat this boy up. The next weapon in the extreme overclockers arsenal that I am familiar with is, of course, the pot. Now, these can be designed for various substances: dry ice, liquid nitrogen, liquid helium. I would imagine you use pretty much the same design for helium and nitrogen. - Sure. - And these are not just a hunk of copper. They are specifically engineered to optimize the transfer of heat from your CPU to the liquid that is boiling within it. Now, as you can imagine, mounting one of these is not as simple as just putting a normal mounting bracket on it, because if you've been paying very close attention, any brackets or metal pieces around the CPU are going to collect condensation. So we actually use a very specific way of mounting these with extremely long posts on our thermal-padded, heated back here and all of our hardware way up here so that we can wrap it all up in a shop towel and make sure that any condensation that does inevitably gather is going to be absorbed by that. And that's it, yee-haw! I'm a professional overclocker, right, ladies and gentlemen? Well, no, actually, isn't how it works. See this probe right here? This is a K-type probe. Plugs into one of these. You don't just want the CPU running as cold as possible. And managing the thermals of the chip are a huge part of the art slash science slash black magic that is extreme overclocking. You see, for example, some chips or even entire platforms might have a bug say for example where if they're too cold when you first try to boot them they won't turn on at all. You've gotta start them warm, then cool them down or vice versa. That means just as important as our application of cold (torch hissing) is our application of heat. We also need the knowledge. Any idiot could pour LN2 on a CPU and overclock higher than they would be able to on air or water cooling, but to reach the absolute limits, you've gotta invest in both your own knowledge and personal experience. Something that can only be gained through countless hours spent on this stuff and in building connections. None of those are things that you can buy for any amount of money, but that doesn't mean it's a cheap hobby. No one, even with years, decades of experience could hope to achieve a world record overclock without what we call a golden chip. As we also learned in our Intel Fab tour, every piece of silicon is a little bit different and not all have the same capabilities. The one that I'm holding in my hand is the result of buying 100 of Intel's 12900 KS and taking only the top 10 of those. With one of these, you might have a chance, but let me get this out of the way for you. There is absolutely no money in extreme overclocking whatsoever. - Very true. - And the folks who do dedicate their lives to it do it for the thrill of the hunt. So with that in mind, let's get the foreplay over with and overclock some CPUs. Is this one gonna do 6.9? - I know we can do it. - [Alex] That's what, a whole gigahertz lower than what you've done on these? - It's pretty up there still, but it should be okay. - Oh, he's changing his tune already. So now, when he doesn't do it, \"Well, I didn't say for sure actually.\" - You won that? - Yeah. - Oh, really? - Small world. - Hilarious. - What's a safe voltage that I can... Actually, I'll just guess. We'll just see what happens. - I'll just go eh. (laughing) - Got the defaults. - You have the RGB where you want it (laughs)? - Turbo performance. Yay, we did it. What I'm really curious about now is just how fast this will go with liquid nitrogen and just stalk settings like XMP, just enable the power limit to go as high as it wants. The highest that I've ever seen on an Intel CPU like this air-cooled is about 28, 29,000 in Cinebench. Show negative temperatures. - [Allen] Zero. - [Alex] Yep, zero degrees. - [Allen] Yes (laughs). - Oh, weird, but it only drew 160 watts even though it was 4.9 all cores. - So that could be due to our colder temperature. - Oh, like it's that big, 'cause I would normally expect that to be 300 and a bit watts. - Do you want to try to go colder and see if we can get even less wattage? - Well, I want to open up XTU first and see what we can get. - Sure. - It should be pretty happy at like four, two, there. We'll just take all of these to five, and we need some more voltage or voltage off offset. Let's do 0.12. - Sure. - I'm just guessing numbers. - That's all I do. (laughing) - [Alex] Didn't blue screen, wow. - You're a pro. (laughing) - So LN2's just like easy mode. We're drawing 230 watts, and I would expect this to normally be like 400. - Yeah. (laughing) - We broke 30,000 points in Cinebench right there. That's what, faster than a Threadripper 32-Core? - Yeah, and we're only at minus 90 (laughs). - Compared to that stupid chiller that we have, oh, my god. - All right, let's just try six gigahertz. There's no way this just did six gigahertz like that. Oh, my god, it's doing it. How? Six gigahertz on all the P-cores. It's only 260 Watts. This is insane. Below your typical wattage, it's six gigahertz. Holy crap! 32 hundred thousand points in Cinebench. Just did it. - It's like the black hole. - [Alex] Yeah, it's just completely black. This can't read below minus 40 degrees Celsius. - Is there any hotspots on the board? - [Alex] It's having a lot of trouble with a thing that's that cold around here. - It's confused. - Chipsets at 40 degrees, SSD's at 47. Well, let's apply 6.4 and see if it crashes. - If it's not fine, I have more CPUs we can use. (laughing) - [Alex] No way, it just did 6.4. Oh, it didn't. - You could do one thing. Turn off C-states and you could put it on fixed voltage. - Or saying fix the voltage. Normally, you have a VF curve. So the more frequency that you want, the more voltage it gives it. We don't care about that at all. We're just sticking one voltage, 'cause we're going for just the highest point on that VF curve, and that's the only one that we care about. You wouldn't want to run your system like that. The voltage kind of erodes away your silicon, and it won't be very happy in a while. But if you're just doing stuff like this, it's totally fine. So what, like 1.45? - Sure, 1.45, sure. - Let's try 6.3. 6.3 gigahertz and that's just with me not even trying in XTU. This is amazing. 3,500 points in Cinebench. Oh, my god, we just beat a Threadripper 3960X. If I don't even need your help to get 6.9, that would be amazing. I think I will. Will it do 6.5? This is going a lot better than I thought it would. - [Allen] Did we freeze? - Nope, nevermind. Well, do you wanna take over? - Sure. - You can go further (laughs). - I'm going to set a base core frequency of 55, like 42 on the E-cores. Just give us some voltage. So it's booting a little warmer, and I'm gonna turn C-states off so it's always at its highest level. - Okay, there's water on top of the memory. Is that good? - Yeah, not optimal, but I think it'll be all right. - Okay. So what we're doing right now is retraining the memory. Apparently, it isn't too happy when you're below, what, 140 degrees Celsius? - Yeah. - So he just changed one setting incredibly slightly, filled the pot, dumped it down to, what is this? 193 degrees Celsius. Then, you just restart it, and the memory retrains itself and apparently is fine afterwards. - It's fine. - All right. - 1.62, 1.62 volts. - You told me to stop at 1.5. - I didn't want you to beat me. (laughing) Do you wanna go for it? - Sure. - Yeah, go for it! It's a 69, boy! - Whoo! - 6.9, yep, we can see it in the thing. Let's open up task manager. I'll just, oh, task manager's dead. Windows doesn't know what to do with any of this. Oh, my god, it's doing it (laughs). - I think the beginning's usually the hardest part, so it should be all right. And we're getting as warm as 188. - Boom. - Holy crap, we did it! 6.9 gigaherz CPU, we did it! - Nice. - [Man] That wasn't even hard. - That was easy. - Sorry. (laughing) - Do you wanna do a base clock overclock. - Oh, sure, 69, 69. - Yeah, 69, 69. I'll go grab Linus. - And this is where it goes awry. You hear a little pop and the thermal pace is gone (laughs). (upbeat music) So we had a catastrophic failure there. So I have to torch it up to around 150. It should come back. (torch hissing) - [Alex] It's just a black hole still. - What if you go like this, ready? (pops) Watch my eyebrows (laughs). Do you see our IO is all? - Oh, geez, that can't be good. Why is it so wet? - [Allen] I don't know. - Have you used this stuff before, Linus? - No. - It's amazing. I got, what, 6.3 gigahertz no problem? It only drew like 240 watts, too. It's like within Intel's TDP. - Wow. - It's insane. What are we at right now? - [Allen] 6.9. - [Linus] 4.2 (laughs). - [Alex] Oh, it passed, beautiful. - 36,000, that is absolute madness. - I have the scores right here. - Hold on a second. So that's what you'd expect out of an epic server CPU with twice as many cores, literally double. Wow, does that ever boil fast? Boy, you must go through a crap ton of this stuff. - You wanna hear under a load? It gets even louder. - I do (laughs). We went through this much just to run that one benchmark. So what you're saying is that if I were to try and do this 24-7, it would cost an astronomical amount of money. - Half a liter a run maybe. - Now, it seems that 12900KS just handles cold really well, and you just freaking go for it. - If we could go colder, it would be even better. - Really, can we do more on this chip? - Yeah, we can bump it up and see where it fails. - Holy crap, did we ever boil away a lot on that one? Was there more power? - We hit 38.5K now. - Holy crap. - So the E-core has juiced the score quite a bit. - 1,500 off the world record for a 16 four-core I9. So give it more, I guess. - Let's go! Is pouring the LN2 considered a glamorous job, or is that like the monkey's job? - We call it the LN2 (beeps), but not when you're doing it. (laughing) - At least not to my face, right? It's boiling so hard it's slopping out of the thing here. Oh, we hit a blue screen! (torch hissing) - Why is it only the start that it doesn't like super cold? - I think it's kind of like when it's on, it's not as cold. - Oh, 'cause the actual CPU isn't getting down to- - Yeah, right. - 'Cause it's right running and making heat. - Got some wattage in it. - Whoo! When you find a golden chip, do you try and get as much juice out of it as soon as you can, knowing that what you're doing to it is going to degrade it significantly? - As long as you're careful. - Careful, yeah, this looks really careful. Whee! Whoo! You have until my dunked CPU hits room temperature to break a record, ready, go. Actually, it's worse than that. You have until my hand gets too cold to hold this. - All right, already failed. (laughing) - You know who never fails? Our sponsor MSI. Looking for a GPU for your next build? Guess what, you can actually buy them now, haha. Check out the MSI RTX 3070 Ti Ventus 3X 8G OC. It's powered by NVIDIAs Ampere Architecture and has eight gigs of GDDR6 memory with boost clocks up to 1800 megahertz. It's got three display port, 1.4 A ports and an HDMI 2.1 port, plus three of their Torx 3.0 fans coupled with a beefy heat sink to keep your temperatures low there. Their Zero Frozr technology turns your fans off while the system is not under load, and a custom brushed metal backplate helps provide a clean look. On top of all that, it has a three-year warranty. You can learn more at the link down below. If you guys wanna know if this still works, we're gonna have a floatplane.com exclusive where we find out. The answer could very well be no. I legitimately don't know. If you enjoyed this video, you guys can follow Splave and his exploits at the links down below. And if you're looking for something else to watch, maybe check out our most extreme air-cooled PC - Yeah. - where we hooked a computer tower up to the most powerful fan we could find and a wind tunnel. It was pretty dumb. - Yeah.",
    "transcript_keywords": [
        "Yeah",
        "Allen Splave Golibersuch",
        "CPU",
        "liquid nitrogen",
        "cold",
        "liquid",
        "thing",
        "heat",
        "gigahertz",
        "voltage",
        "nitrogen",
        "degrees Celsius",
        "pretty",
        "board",
        "god",
        "degrees",
        "CPUs",
        "Whoo",
        "guys",
        "Splave Golibersuch"
    ],
    "transcript_entity_values": [
        "69",
        "UGREEN",
        "160 watts",
        "3070",
        "one",
        "36,000",
        "GDDR6",
        "100",
        "SSD",
        "6.9 gigahertz CPU",
        "eight",
        "LN2",
        "USB-C",
        "6.3",
        "centimeter",
        "RGB",
        "1800 megahertz",
        "GPU",
        "1.62 volts",
        "a crap ton",
        "300",
        "0.12",
        "Cinebench",
        "230 liters",
        "three",
        "KS",
        "188",
        "1.45",
        "40 degrees",
        "Linus",
        "the day",
        "yee-haw",
        "CPU",
        "EHOT",
        "1,500",
        "400",
        "16 four",
        "years",
        "NVIDIAs Ampere Architecture",
        "countless hours",
        "first",
        "1.45",
        "TDP",
        "Allen Splave Golibersuch",
        "watts",
        "30,000",
        "69",
        "VRM",
        "minus 195 degrees",
        "12900KS",
        "a good day",
        "XMP",
        "Six gigahertz",
        "10-gigahertz",
        "six gigahertz",
        "230 watts",
        "CPU",
        "Elmor",
        "6.9",
        "1.62",
        "MAPP",
        "six",
        "minus 40 degrees Celsius",
        "Intel",
        "around 150",
        "Vaseline",
        "6.4",
        "38.5",
        "about 28",
        "mn",
        "decades",
        "only 260",
        "Subaru",
        "five",
        "42",
        "1.5",
        "32 hundred thousand",
        "29,000",
        "Watts",
        "10",
        "Torx 3.0",
        "minus 90",
        "6.5",
        "47",
        "Splave",
        "2.1",
        "193 degrees Celsius",
        "PCH",
        "two",
        "3,500",
        "6.3 gigahertz",
        "PCB",
        "June the ninth",
        "second",
        "55",
        "PCIE",
        "4.9",
        "65-watt",
        "12900",
        "1.4",
        "today",
        "VF",
        "zero degrees",
        "8",
        "three-year",
        "USB",
        "Intel Fab",
        "IO",
        "Zero",
        "140 degrees Celsius"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "TIME",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "PERSON",
        "LOC",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "QUANTITY"
    ],
    "vector": [
        -0.11512882262468338,
        -0.024759609252214432,
        -0.021426625549793243,
        0.046720970422029495,
        0.05584963411092758,
        -0.02889917977154255,
        0.008433178998529911,
        0.04611892253160477,
        -0.10290435701608658,
        -0.06129811331629753,
        0.003571129171177745,
        0.012989145703613758,
        -0.08245453238487244,
        -0.04765215143561363,
        0.015653274953365326,
        0.004847882781177759,
        0.06932351738214493,
        -0.06331177055835724,
        -0.0692887231707573,
        -0.11381608247756958,
        -0.004298008978366852,
        -0.021447205916047096,
        0.02194068767130375,
        -0.026155933737754822,
        0.0905199870467186,
        -0.06474436074495316,
        0.03673373907804489,
        -0.026106374338269234,
        0.04447160288691521,
        -0.02841288223862648,
        0.024765072390437126,
        0.010853304527699947,
        -0.02961389161646366,
        -0.007567535620182753,
        0.01821882836520672,
        -0.04788379371166229,
        0.08096850663423538,
        -0.06691498309373856,
        -0.02146168239414692,
        -0.017448458820581436,
        -0.017309632152318954,
        0.032151464372873306,
        0.06698846817016602,
        -0.03699098527431488,
        -0.009182876907289028,
        -0.006149138789623976,
        0.047867465764284134,
        -0.0002482640265952796,
        -0.016386112198233604,
        0.03751685097813606,
        -0.019828397780656815,
        -0.11952001601457596,
        0.02761901170015335,
        -0.04484741389751434,
        -0.07430367171764374,
        0.0320756621658802,
        -0.04868638515472412,
        -0.07396193593740463,
        0.011279097758233547,
        -0.027751436457037926,
        0.02688789553940296,
        -0.0786229595541954,
        -0.03129640221595764,
        0.051887594163417816,
        0.04287238046526909,
        0.024345366284251213,
        0.009517286904156208,
        -0.026987547054886818,
        -0.006697928998619318,
        0.011482554487884045,
        0.04699891433119774,
        -0.024938512593507767,
        0.0008664754568599164,
        0.05106140300631523,
        -0.014799972996115685,
        0.020503710955381393,
        0.024468889459967613,
        -0.08420570194721222,
        0.05452791228890419,
        -0.019994447007775307,
        -0.0048691206611692905,
        0.002344755921512842,
        0.00334376678802073,
        -0.034608758985996246,
        0.034342050552368164,
        -0.052022840827703476,
        0.08405860513448715,
        0.08010740578174591,
        0.014175230637192726,
        -0.0687522366642952,
        0.042358312755823135,
        0.09528658539056778,
        0.06011365354061127,
        -0.0211227647960186,
        0.042741939425468445,
        0.1029178649187088,
        0.0068973759189248085,
        -0.01876068115234375,
        -0.05105854943394661,
        0.04752490669488907,
        0.04242589697241783,
        -0.002227746183052659,
        0.018556641414761543,
        0.042312636971473694,
        -0.037134237587451935,
        0.022195126861333847,
        -0.04099901020526886,
        0.06443017721176147,
        -0.07314802706241608,
        -0.019689571112394333,
        -0.07487813383340836,
        0.11598315834999084,
        -0.04217929020524025,
        -0.013035179115831852,
        0.06506527960300446,
        -0.07553410530090332,
        -0.03265966847538948,
        -0.014361775480210781,
        0.032259952276945114,
        0.02046891115605831,
        -0.0028904832433909178,
        0.06009351462125778,
        -0.07939539849758148,
        0.02378533035516739,
        -0.018689434975385666,
        0.029544249176979065,
        -0.11122330278158188,
        6.127469647830583e-33,
        -0.04547090455889702,
        0.09345050901174545,
        -0.055465877056121826,
        -0.006862039677798748,
        -0.000380577112082392,
        -0.006838107481598854,
        -0.019449621438980103,
        -0.033365048468112946,
        0.0025577328633517027,
        0.11030041426420212,
        -0.033531684428453445,
        -0.02048596180975437,
        -0.08579816669225693,
        0.01729551889002323,
        0.04611968249082565,
        -0.10889385640621185,
        0.0072296843864023685,
        0.031201370060443878,
        0.044819146394729614,
        0.082286536693573,
        0.050499431788921356,
        -0.04979916289448738,
        -0.03013584017753601,
        0.018753917887806892,
        0.06689909100532532,
        0.015413559041917324,
        0.07136517018079758,
        -0.018106205388903618,
        -0.016537437215447426,
        -0.01928357034921646,
        0.05616696923971176,
        -0.09249267727136612,
        -0.009935319423675537,
        -0.02642020955681801,
        0.023490501567721367,
        -0.010387317277491093,
        -0.060922522097826004,
        -0.03489597886800766,
        0.0373457670211792,
        0.021110456436872482,
        0.0400066003203392,
        0.09153040498495102,
        -0.1003536581993103,
        -0.011376848444342613,
        -0.0038421121425926685,
        -0.00011093638022430241,
        -0.04237223416566849,
        -0.03365997225046158,
        0.037883907556533813,
        -0.0645623728632927,
        0.004931644070893526,
        -0.005830307025462389,
        -0.05092901363968849,
        0.03217412531375885,
        0.05145638436079025,
        -0.045815277844667435,
        0.08435507863759995,
        0.014669043943285942,
        0.12377147376537323,
        0.11605548858642578,
        0.013699185103178024,
        -0.07297300547361374,
        -0.00421625841408968,
        -0.05511583015322685,
        -0.06646986305713654,
        -0.013454800471663475,
        0.040840018540620804,
        -0.022923042997717857,
        -0.1216995045542717,
        -0.023304974660277367,
        -0.03335261717438698,
        -0.061893194913864136,
        0.07616390287876129,
        0.009054276160895824,
        0.03678898885846138,
        0.03726493567228317,
        -0.06951794773340225,
        -0.06639391928911209,
        -0.06740306317806244,
        -0.09295190870761871,
        -0.03123917616903782,
        0.04820127412676811,
        0.004369946196675301,
        0.003960618749260902,
        0.020899459719657898,
        -0.038906529545784,
        -0.07758191227912903,
        0.04506012052297592,
        0.02776465378701687,
        -0.006717968732118607,
        0.03596470132470131,
        -0.03646477684378624,
        -0.008404749445617199,
        -0.02599981613457203,
        -0.027675192803144455,
        -5.980046493190144e-33,
        -0.044295381754636765,
        -0.04373832792043686,
        0.0026657443959265947,
        0.05458619445562363,
        -0.010685491375625134,
        -0.0042808582074940205,
        0.054231058806180954,
        -0.025896256789565086,
        0.033719614148139954,
        -0.05301275849342346,
        0.00014048663433641195,
        -0.0025381927844136953,
        0.011164569295942783,
        -0.024012763053178787,
        0.0644950345158577,
        -0.03784782439470291,
        -0.0016633718041703105,
        -0.0495089590549469,
        0.13281790912151337,
        -0.042275238782167435,
        0.04558521881699562,
        0.030154822394251823,
        -0.0040611219592392445,
        -0.007152817212045193,
        -0.001520952326245606,
        0.036041855812072754,
        -0.04527158662676811,
        0.059781402349472046,
        0.07795124500989914,
        0.04085642099380493,
        -0.026616323739290237,
        -0.043487802147865295,
        0.042766619473695755,
        0.012418316677212715,
        0.10040564090013504,
        -0.0238200593739748,
        0.10301277041435242,
        0.05317814648151398,
        -0.021857934072613716,
        -0.02782618999481201,
        0.08293625712394714,
        0.011267304420471191,
        -0.024604855105280876,
        0.057581350207328796,
        0.025521408766508102,
        -0.0042461222037673,
        -0.03086436353623867,
        -0.15831437706947327,
        0.0024837518576532602,
        0.03601465001702309,
        0.05215180665254593,
        -0.12621259689331055,
        0.05407368019223213,
        0.04038764163851738,
        -0.0014466638676822186,
        -0.06953870505094528,
        0.02822105959057808,
        -0.012192980386316776,
        0.014073478057980537,
        -0.0657561793923378,
        0.11936496198177338,
        0.012876925989985466,
        -0.015959912911057472,
        -0.003498517442494631,
        -0.0037976850289851427,
        -0.022100767120718956,
        0.02637857384979725,
        0.049646925181150436,
        -0.0426618754863739,
        -0.03428910672664642,
        -0.05508442968130112,
        -0.01615322381258011,
        0.036429014056921005,
        -0.06799406558275223,
        -0.04703323915600777,
        0.026269279420375824,
        0.04714060202240944,
        0.05660027265548706,
        0.027838028967380524,
        -0.020371347665786743,
        -0.12247078120708466,
        0.04368005692958832,
        -0.03909514099359512,
        -0.024299366399645805,
        0.12197919189929962,
        -0.05493605136871338,
        0.07036423683166504,
        0.0030687630642205477,
        0.04191618412733078,
        -0.08054660260677338,
        -0.036870092153549194,
        -0.049698203802108765,
        -0.010325441136956215,
        -0.0014057890512049198,
        -0.026286020874977112,
        -5.482403508949574e-08,
        0.004996184725314379,
        -0.04907016083598137,
        0.015305443666875362,
        0.0465012788772583,
        0.05794398859143257,
        -0.050741396844387054,
        -0.013872679322957993,
        -0.02427169494330883,
        0.04914185404777527,
        0.011814320459961891,
        0.07494203746318817,
        -0.04779061675071716,
        0.036706890910863876,
        -0.04899240657687187,
        0.050262097269296646,
        0.014188673347234726,
        -0.08276797086000443,
        0.05875704810023308,
        0.039149653166532516,
        -0.06772560626268387,
        0.0029612560756504536,
        0.053385451436042786,
        0.05628911778330803,
        -0.025884028524160385,
        0.005339335184544325,
        0.04329545050859451,
        0.018586305901408195,
        0.05625699460506439,
        0.1383575052022934,
        -0.008351155556738377,
        -0.08890179544687271,
        -0.0035478605423122644,
        0.04835056886076927,
        -0.08648744970560074,
        0.0671597421169281,
        -0.03152040019631386,
        0.008242050185799599,
        0.04987585172057152,
        0.12408190965652466,
        -0.004486689809709787,
        -0.05793961137533188,
        -0.04644676297903061,
        -0.03128386661410332,
        0.0002783452218864113,
        0.008367964066565037,
        -0.021890848875045776,
        -0.10404542088508606,
        -0.050779446959495544,
        0.02684469148516655,
        0.08352087438106537,
        0.010498065501451492,
        0.011307550594210625,
        -0.00037096021696925163,
        0.022508619353175163,
        -0.022881045937538147,
        -0.04123970493674278,
        -0.06087242811918259,
        0.04208213463425636,
        -0.07367590814828873,
        0.019629644230008125,
        -0.006537283305078745,
        -0.09684786200523376,
        -0.04659218341112137,
        0.022645950317382812
    ]
}