{
    "id": "fovy570U3PE",
    "title": "It's beautiful...and I MADE IT! - InWin @ Computex 2023",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-05-31T17:33:34Z",
    "video_url": "https://www.youtube.com/watch?v=fovy570U3PE",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "inwin",
        "pc",
        "case",
        "build",
        "diy",
        "flatpack",
        "computex",
        "2023"
    ],
    "views": 344932,
    "likes": 12401,
    "comments_count": 467,
    "description": "Check out MotionGreys ergonomic workplace solutions at  and use code LINUS for 10% off!  InWin is showing off their new Dubili case at Computex and Alex is here to see if their flatpack shipped DIY PC case is a fun experiment that allows for more customization or if it's too much work for what you get.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 A DIY concept 1:08 Trying to speed build the case 6:09 Sponsor - MotionGrey 6:42 Back to the build 9:47 Overall thoughts and different options 10:10 Outro (Alex feels cheated)",
    "description_links": [
        "https://lmg.gg/motiongrey",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- We're here at the InWin booth, at Computex 2023, and we are checking out their Dubili Full Tower PC. But this is a little bit different, it comes flat-packed. (laughing) You might have noticed this is a full-size PC case, but this is a very small box. The main advantage of this is that the shipping costs are way less. They can fit double as many PC cases into a shipping container. But there are a couple more advantages, you can see it right here. It just comes packaged like that. (laughing) Because the computer case is completely modular, modifying it is very simple. So they have a bunch of different ways that you can configure it, including these really nice little leather handles and stuff. Also, if you want to modify it yourself, it would be really easy to do a sick paint job with it already all packed out just on a table, (laughing) like it is right now. The final version will come with a nice 3D user manual so that you can very easily put it together. You don't even have to worry about (laughing) dealin' with the big paper thing. This is gonna be very nice, but we don't have one for this case. It's a very early version, so we're just gonna have to ask the designers. (laughing) As I said, it might be possible to do it in about 20 minutes. Does that seem about right? - [Larry] Yes. - 20 minutes. Let's see how well I can do with no instructions, (laughing) starting now. Alright, so first we're going to build... Is this the base right here? - This is for the top panel. - This is the top panel holder. We've got the little... Slide it in, just like... Oh geez, I'm already fallin' behind. Just like that. I've got the LTT stubby screwdriver right here. It isn't on lttstore.com just yet, but it'll be really great because the TSA will not steal it from you with this short little handle. Nice, we've got that. Now, \"Dubili\" is anagram of \"I build.\" They've just sort of rearranged the letters into making it sound a little bit better. The bottom piece, we weren't able to fully take it apart because these adhesive things, not super happy about comin' off. Now, does this go up here? - Yes. - Something like that? Perfect. Ooh, that goes there first. Okay. These are some super nice screws. (laughing) Okay, so this gets held here. - Yup. - And now, we do these- - This one should be using a small screw. - Small screws. Oh, we're already up to a bad start, we've lost our screws. All of these panels here are made out of sheet metal steel, except for the beauty panels right here, which are aluminum. Is this just brushed aluminum? - Yes. - It looks fantastic. I really like it. Does that just go like that? - I would put this screw in here first 'cause... - Ooh, yeah. This is definitely the sort of thing where you need to read the manual because there will be order of operations problems. So if you look at this screw right here, if you forget about it, and then just start building it willy-nilly, you are going to end up where you cannot put this in once you have screwed this part down, and I'm sure there's lots of other things just like that. So, we're gonna hope that the reps right here remember everything like that before I screw it up. (Alexander laughing amusingly) I do you have to say, the powder coat that they have on this looks fantastic. There are a couple of different color options, and all of them look great. (laughing) It must be way easier to just do a really good paint job on these when you don't have to worry about actually assembling it and riveting it all together. Is it back panel time? - No. - Nope? - You can put this one on top first. - Oh, top first. So, they were just telling me that it's actually more expensive to do the powder coating on this flat-pack assembly. Because normally you just take the whole case, huck it in there, spray it, and you're good to go. Whereas this right here, every single individual piece needs to be powder coated. Does that mean this is more expensive? - So, that's what the quality's higher. - Oh, it's coming up on 10 minutes elapsed since I started. I don't know how good of an idea it was to do that without a manual, and needing to host a video at the same time, but we'll see. (screw clicking rapidly) Now this case will come with four 40 CFM fans, and they also have a nice big old fan hub right here to just make all of your RGB and fan problems a lot simpler. What do we do now, the back panel? - [Larry] Yes. - Now we're mostly done with our, you know, normal looking screws, and into these absolutely beautiful gold plated ones. They are fantastic lookin'. Dang it. Remember how I said that you have to make sure that you put the screws back in in the correct order? Well, I didn't right here. (laughing) So, we have to put the top panel on after I take this one out. It goes this way so that your IO lines up. For our IO, we get two USB type \"As,\" a USB type \"C,\" and a headphone/microphone combo jack. Pretty standard for a case like this. Oh geez, I don't think we're gonna do it. I could definitely save a little bit of time right here by you know, only putting two screws in each fan, but this is their floor model (laughing) and one of the only ones, so I should probably put it back together correctly? (screw clicking rapidly) There's no way, Oliver, we're not gonna make it. Two minute warning's gone, I've just wasted about four minutes putting fan screws in. Alright, final fan. All of them are 140 millimeter jobbies, and I imagine these are going to be pretty quiet given the fact that they aren't really moving all that much air. Ugh... Alright, onto the front panel. You do have a couple of options, although I think that you want the one that has the best airflow, which is this one right here. Is there an option to have a mesh grill for this? - Huh? - Oh, it's right there. - Oh, yeah. - (laughing) Perfect. Order of operations gets me just as the timer runs out. We didn't do it, Oliver. My family's ashamed, my mom's not gonna send me jam in the mail anymore. I think we're gonna be able to do it in 30 minutes though, that's still pretty good. (laughing) Well we weren't able to put this computer case together in 20 minutes, but what we were able to do was tell you about our sponsor. - Thanks to MotionGrey for sponsoring this video. Tired of back pain from prolonged sitting and staring at a screen all day? MotionGrey aims to provide ergonomic workplace solutions at affordable prices. Their sit-to-stand desks come in a wide variety of models and sizes. They're simple to assemble, and with a bunch of available accessories, you're sure to be able to pick out one to suit your needs. They also have a range of ergonomic chairs available, with each one focusing on adjustability, affordability, and providing maximum comfort. Check out MotionGrey at the link below, and use code \"Linus\" for 10% off your purchase. - Now for this little beauty piece right here, you have two options. We're going to be putting it on like this which turns it into a handle, but you can also do it the other way and use it as the feet instead of this guy right here. I can't believe that we're makin' the one with these handles, the leather ones are way nicer. Look at that, in here, you can actually see machining marks from where this would've been C and C machined. So what they must have done is had a flat piece of aluminum, C and C machined it, and then done these bends right here afterwards. One thing that I always recommend doing for building something like this is that you go ahead and you only sort of tighten everything down, until you have all of the screws in place for your piece. Then, you can go in and tighten it down and you're not going to have to worry about slightly misaligning something and having to go back and you know, loosen it, move it around, and then tighten it back down. It's way easier if you just do the final tighten all at once. Now for this piece, we have a couple of options. We have the mounting holes right here for two and a 1/2 inch SSDs, and we can either put it right here so that we can cover up some of our cables, or put it right here so we can cover up some of our cables but beside the power supply. I think I'm gonna put it right here, and it's actually gonna be kinda difficult to manage all the cable... Ah! I've changed my mind, we're putting it down here so that you can just sort of hide the rat's nest. (laughing) Their screwdriver, it's not magnetic. I could have saved a whole minute on the build time here if I had a good screwdriver with magnetic bits. Oliver, do you know where I could get one of those? - [Oliver] Lttstore.com. (Alexander laughing amusingly) - I can't handle this. It's going up here, (laughing) it's so much easier. There we go, this right here is starting to really look like a computer case. Now we just have to put on the side panels, I think. Yeah, that's all that's left. This does have really nice magnetic air filters, so if you wanna clean 'em off, you just go (blowing) and then slap it right back on. Excellent. If I'm honest, the cable management solutions back here are not the best that I've seen. But fortunately because we have these nice big screws and an Allen wrench, you're gonna at least be able to really wrench it down and just cram it in if you don't actually do a good job. How does this go on, like that? Did I get it right? It feels like it's hitting, oh, on a cable. Why do you not want to go in? They just told me that it's way easier to do this if you lay the case down like that, so then all of your cables don't try and fall out the bottom. Alright, final piece, a nice big tempered glass panel is gonna be goin' on. I am excited. There we go. Alright, final little bit of tightening here. And in total, this has taken me 35 minutes, which really is not all that bad (laughing) especially for a case that looks this good. There we go. Ugh, what a beauty. (laughing) I do have to say, that is a fantastic looking computer case. If you're looking for something that's a little bit smaller, they also have flat-packed ones that look a little bit more like this. You have to bend some of the stuff for yourself, but also very easy to put together. And I just think, \"Dang, that looks good, and it feels so great to have built it myself.\" Anyway, thanks for watching this video. Hit like, get subscribed, and just have a fantastic old day. See ya later. They just told me that the 20-minute build time was with an electric screwdriver, like a (imitating drilling noise). Come on, guys! (laughing) You're bustin' my ass with this. (screw driver thudding) (Oliver laughing amusingly)",
    "transcript_keywords": [
        "Dubili Full Tower",
        "Full Tower",
        "Dubili Full",
        "put",
        "case",
        "screws",
        "nice",
        "back",
        "panel",
        "good",
        "minutes",
        "InWin booth",
        "Computex",
        "Full",
        "Tower",
        "piece",
        "computer case",
        "bit",
        "screw",
        "top panel"
    ],
    "transcript_entity_values": [
        "10 minutes",
        "Linus",
        "all day",
        "One",
        "20 minutes",
        "one",
        "USB",
        "a whole minute",
        "Computex 2023",
        "Two minute",
        "140 millimeter",
        "MotionGrey",
        "LTT",
        "InWin",
        "IO",
        "35 minutes",
        "about four minutes",
        "Allen",
        "TSA",
        "first",
        "two",
        "Larry",
        "10%",
        "20-minute",
        "30 minutes",
        "about 20 minutes",
        "RGB",
        "Dubili Full Tower",
        "Alexander",
        "Oliver",
        "four 40 CFM"
    ],
    "transcript_entity_types": [
        "TIME",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "TIME",
        "FAC",
        "TIME",
        "QUANTITY",
        "ORG",
        "ORG",
        "FAC",
        "GPE",
        "TIME",
        "TIME",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "TIME",
        "TIME",
        "TIME",
        "ORG",
        "FAC",
        "PERSON",
        "PERSON",
        "QUANTITY"
    ],
    "vector": [
        -0.07775474339723587,
        0.09421037137508392,
        0.027350399643182755,
        -0.04784055054187775,
        0.09176599234342575,
        0.07531248033046722,
        -0.001086267177015543,
        -0.010871159844100475,
        -0.00896364450454712,
        -0.003650364698842168,
        0.006372539792209864,
        -0.0026931504253298044,
        0.061834171414375305,
        -0.031669411808252335,
        0.06927920877933502,
        -0.05744165927171707,
        0.04347885027527809,
        -0.026225736364722252,
        -0.07643692195415497,
        -0.0007727423217147589,
        -0.04333521053195,
        -0.09915889799594879,
        -0.026437407359480858,
        0.03959821164608002,
        -0.02107633836567402,
        -0.04168655350804329,
        0.028925715014338493,
        -0.000980264856480062,
        0.012270399369299412,
        -0.038434311747550964,
        0.02906211093068123,
        0.09983490407466888,
        0.012379278428852558,
        0.012683135457336903,
        0.0243351012468338,
        0.05104381963610649,
        -0.03428318351507187,
        -0.06762523204088211,
        -0.08515557646751404,
        -0.047205254435539246,
        -0.007424513343721628,
        -0.05797967687249184,
        0.0005140389548614621,
        0.07073409110307693,
        0.044872622936964035,
        -0.003266748273745179,
        0.010541749186813831,
        -0.017998535186052322,
        -0.0052171084098517895,
        0.02998216822743416,
        0.0168073121458292,
        -0.06184324622154236,
        0.0790158286690712,
        -0.007373392581939697,
        -0.054673708975315094,
        0.01187447365373373,
        -0.03637435659766197,
        -0.05712670087814331,
        0.0044041289947927,
        -0.04617330804467201,
        0.08038181066513062,
        -0.0649469643831253,
        -0.04670654237270355,
        0.05690757930278778,
        -0.002686614403501153,
        -0.00047032645670697093,
        -0.08886197954416275,
        0.11981929838657379,
        -0.06341573596000671,
        0.027666980400681496,
        0.02252972312271595,
        -0.008982231840491295,
        -0.006237382534891367,
        0.09515941143035889,
        0.034996822476387024,
        -0.043186988681554794,
        0.047570936381816864,
        -0.06187163293361664,
        -0.016483565792441368,
        -0.0552799254655838,
        -0.007748189382255077,
        -0.04590437561273575,
        -0.013826454058289528,
        0.06163377687335014,
        0.01748926006257534,
        -0.01909070648252964,
        0.04782446473836899,
        0.01473768800497055,
        -0.03474642336368561,
        -0.05705635994672775,
        -0.009813180193305016,
        0.05248597636818886,
        0.0981975570321083,
        0.0008618833380751312,
        -0.06744610518217087,
        -0.004928263369947672,
        -0.019444705918431282,
        -0.029580632224678993,
        -0.03433433175086975,
        0.07594706118106842,
        -0.019200272858142853,
        0.06144450977444649,
        0.08996190875768661,
        0.03516693413257599,
        -0.06343912333250046,
        -0.036485325545072556,
        -0.026436299085617065,
        0.04039342701435089,
        0.003202248364686966,
        -0.011594428680837154,
        -0.08299620449542999,
        0.023812344297766685,
        -0.034748610109090805,
        -0.030865181237459183,
        -0.10567557066679001,
        0.009549139998853207,
        -0.03685183823108673,
        0.026597218587994576,
        0.09137449413537979,
        -0.03737913444638252,
        0.04729074239730835,
        0.03090605139732361,
        -0.009030831977725029,
        0.039288684725761414,
        -0.006125864572823048,
        -0.01171761192381382,
        -0.006945556029677391,
        1.1636642858782074e-33,
        -0.056350480765104294,
        -0.009204800240695477,
        -0.044848646968603134,
        0.0008442534017376602,
        0.16012200713157654,
        -0.017375526949763298,
        -0.031179001554846764,
        0.008990502916276455,
        -0.06372728198766708,
        0.024661315605044365,
        -0.00938460510224104,
        0.031018445268273354,
        -0.007407540455460548,
        0.08835221827030182,
        -0.0017230421071872115,
        -0.11944109946489334,
        -0.01311406772583723,
        0.07931355386972427,
        -0.063791424036026,
        -0.012475633062422276,
        -0.029780428856611252,
        -0.059455353766679764,
        -0.007738623768091202,
        -0.0500643253326416,
        0.01948852837085724,
        0.036403462290763855,
        0.048539452254772186,
        -0.013059895485639572,
        0.0704399049282074,
        0.026762932538986206,
        -0.020764827728271484,
        -0.015495029278099537,
        0.009477358311414719,
        -0.04700193554162979,
        -0.05142806097865105,
        0.00796448066830635,
        -0.0764598697423935,
        -0.09578373283147812,
        0.06436917185783386,
        0.0695127472281456,
        -0.05441536009311676,
        -0.03906881436705589,
        -0.025588300079107285,
        -0.1275041699409485,
        -0.07722998410463333,
        0.05318034812808037,
        0.12074107676744461,
        0.015594546683132648,
        0.06514715403318405,
        -0.0055829850025475025,
        0.015644514933228493,
        0.03362993896007538,
        -0.10141031444072723,
        -0.1096348762512207,
        -0.02555062063038349,
        -0.1203119084239006,
        -0.005924508441239595,
        -0.020437275990843773,
        0.08520185947418213,
        0.035554781556129456,
        -0.02574274130165577,
        0.08651246130466461,
        0.0313229002058506,
        -0.0441647507250309,
        -0.051140714436769485,
        0.03767867386341095,
        -0.050742872059345245,
        -0.058211952447891235,
        -0.027161486446857452,
        -0.04021391272544861,
        -0.03705398365855217,
        0.02568506821990013,
        0.03044002875685692,
        -0.016892697662115097,
        0.07316611707210541,
        0.03658423200249672,
        -0.057158686220645905,
        -0.08716932684183121,
        0.002152903936803341,
        -0.0408652126789093,
        -0.0762518048286438,
        -0.008905518800020218,
        0.042112596333026886,
        0.032200541347265244,
        0.032920386642217636,
        -0.027915243059396744,
        0.02504676766693592,
        -0.07021327316761017,
        -0.07570233196020126,
        0.010093470104038715,
        -0.06480850279331207,
        -0.07667558640241623,
        0.0035262100864201784,
        0.00739222252741456,
        -0.013864003121852875,
        -2.9634892166901437e-33,
        2.9453845854732208e-05,
        0.033593256026506424,
        -0.050283659249544144,
        0.01482213195413351,
        0.09014236181974411,
        0.05486047640442848,
        0.06082272529602051,
        0.012981207109987736,
        0.03096012957394123,
        0.033608920872211456,
        -0.015162534080445766,
        0.011860753409564495,
        -0.09778963774442673,
        -0.02113940194249153,
        0.017924873158335686,
        -0.014645516872406006,
        0.08910669386386871,
        -0.05342566967010498,
        -0.0767069086432457,
        -0.057977646589279175,
        0.07941895723342896,
        0.05136073753237724,
        -0.10493583977222443,
        0.04434513673186302,
        0.024844055995345116,
        0.056626636534929276,
        0.08156077563762665,
        0.03926025703549385,
        0.009463772177696228,
        0.007998209446668625,
        -0.12268933653831482,
        -0.07730187475681305,
        -0.06126564368605614,
        -0.01123703084886074,
        0.04429786652326584,
        0.012693607248365879,
        -0.018302740529179573,
        0.07887404412031174,
        -0.028253814205527306,
        0.01885654591023922,
        -0.0028039771132171154,
        -0.09864778816699982,
        -0.03436438739299774,
        0.06596104055643082,
        -0.031848639249801636,
        -0.052022870630025864,
        -0.04233226925134659,
        -0.033641308546066284,
        0.0666935071349144,
        0.031438760459423065,
        -0.016234146431088448,
        0.001945615978911519,
        0.04411238431930542,
        0.00954056903719902,
        -0.0442035049200058,
        0.018574649468064308,
        -0.041335221379995346,
        -0.014999425038695335,
        1.5397910829051398e-05,
        -0.09345518052577972,
        -0.03959321230649948,
        0.001318964990787208,
        0.023910872638225555,
        0.015786156058311462,
        0.044387731701135635,
        -0.06795492768287659,
        -0.005101754330098629,
        0.00030292602605186403,
        -0.06557580828666687,
        -0.012229238636791706,
        -0.014635415747761726,
        0.02276611141860485,
        -0.030201628804206848,
        -0.08819155395030975,
        -0.0019159126095473766,
        -0.0010079203639179468,
        0.1310543566942215,
        0.029906252399086952,
        0.06485826522111893,
        -0.023650117218494415,
        -0.013571011833846569,
        0.02041478641331196,
        0.07657273858785629,
        0.002669421024620533,
        0.03967536240816116,
        0.02601291798055172,
        -0.05677352100610733,
        0.03819582238793373,
        0.01258521806448698,
        0.06594906747341156,
        -0.07411409169435501,
        0.09984994679689407,
        0.06769980490207672,
        0.10118822008371353,
        0.053869687020778656,
        -6.526209972435026e-08,
        -0.06397772580385208,
        -0.045053716748952866,
        -0.03322418034076691,
        -0.003268658183515072,
        -0.048683468252420425,
        -0.03431040793657303,
        0.03146350756287575,
        0.012077867984771729,
        -0.04199157655239105,
        -0.019207481294870377,
        0.014496476389467716,
        -0.02024158276617527,
        -0.038051437586545944,
        0.0241986270993948,
        -0.025702087208628654,
        0.02681126818060875,
        -0.0525740310549736,
        0.04408526420593262,
        -0.07152701169252396,
        -0.04039430245757103,
        -0.008805548772215843,
        0.09037338942289352,
        0.04726717621088028,
        -0.005410115234553814,
        -0.049990858882665634,
        0.04677766561508179,
        -0.030780507251620293,
        0.03795662149786949,
        0.11077766120433807,
        -0.03417409583926201,
        -0.005233538802713156,
        0.015710754320025444,
        0.008872204460203648,
        0.025630930438637733,
        -0.0036787507124245167,
        -0.04579641669988632,
        -0.05807017162442207,
        0.1186000257730484,
        0.008643959648907185,
        0.020852480083703995,
        -0.011437331326305866,
        -0.017648516222834587,
        -0.03374842181801796,
        0.04113098606467247,
        0.06102515012025833,
        -0.024304382503032684,
        -0.01851271092891693,
        -0.05770746245980263,
        0.012002400122582912,
        -0.009044192731380463,
        -0.053324028849601746,
        -0.08773066103458405,
        -0.026032766327261925,
        0.09085257351398468,
        0.06197747215628624,
        0.02175906114280224,
        -0.05282335728406906,
        0.00852965097874403,
        0.06164262071251869,
        0.10670552402734756,
        -0.03461980074644089,
        -0.06732698529958725,
        -0.05268850550055504,
        0.07963383942842484
    ]
}