{
    "id": "fQoSEU1nFZc",
    "title": "Galaxy Note 10 Plus review: the luxury phone",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-08-22T14:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=fQoSEU1nFZc",
    "category": "Science & Technology",
    "tags": [
        "note 10 plus",
        "10 plus",
        "note 10",
        "galaxy note 10 plus",
        "review",
        "samsung galaxy",
        "samsung note 10",
        "seen",
        "stylus",
        "samsung galaxy note 10",
        "galaxy note 10",
        "galaxy note10",
        "samsung",
        "samsung note",
        "samsung note 10 official video",
        "samsung event",
        "samsung keynote",
        "new note phone",
        "s pen",
        "battery life",
        "samsung phone",
        "smartphone",
        "smartphones",
        "phones",
        "new phone",
        "rumors",
        "hands on",
        "first look",
        "unboxing",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "mkbhd",
        "apple",
        "google",
        "iphone",
        "verge",
        "the verge"
    ],
    "views": 872029,
    "likes": 15905,
    "comments_count": 1343,
    "description": "Samsung Note 10 Plus  here's our review for the king of Android phones. Can it keep the crown, or have all the other, less expensive contenders made it just another phone? The answer to that question, Dieter Bohn says, is simply this: how much would you pay to have a stylus in your phone?   Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2ZjlRcj",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(slow music) This is the Samsung Galaxy Note 10 Plus. You know the Note, right? It was the first big phone, but now every phone is big. Then, it was the most powerful big phone. But nearly all big Android phones have really great specs now. So what's left for the Note? Samsung will tell you that there are a bunch of things. But really, there's just one thing: the S Pen, the stylus. See, the Note starts at $1,100, which is hundreds of dollars more than comparable phones, even phones that Samsung makes. So you have to ask yourself: how badly do you want this stylus? (upbeat music) Now, before we get too far into this review, I know that the Note is about more than just having a stylus. Is there something you want in a smartphone? Because this thing has it: a massive screen, top-flight specs, all-day battery, good cameras, DeX, beautiful looks, a depth sensor for AR. Except for the fact that it's missing a headphone jack, this really is the everything phone. It's even giving you a choice of two sizes. This larger Note 10 Plus and then a smaller, regular Note 10. Now, we haven't had time to fully review the smaller Note, but if you're not a spec hypebeast, I think it might be more interesting for you. It's not that much bigger than a Galaxy S10, and I bet most people wouldn't miss the extra RAM and battery life that you get on the big Note 10. Really, though, this Note 10 Plus is the true Note. It's about the same size as last year's Note 9, and that size is big. It has a 6.8-inch HD+ AMOLED screen, and it is beautiful. The Note's display might not have a high refresh rate that you can get on the OnePlus 7 Pro, but that's literally the only thing that's missing from it. It is bright and color-accurate, and it goes all the way to the edge of the phone. This thing looks like the future in the way that most phones do not. The screen will spoil you. It's also the true Note because it's the one with the best specs. But again, beefy specs don't set the Note apart anymore not the way they used to. So let's talk about the stylus. (upbeat music) Samsung added a gyroscope and an accelerometer to it so you can wave it around to control the camera and maybe other apps eventually. What you do is you hold the button down, and then you make these little gestures. And then the camera does stuff like zoom in or switch modes or take a photo. It's neat, I guess, but, you know, it's kind of a gimmick. The other thing that's pretty gimmicky but stupid fun, is AR Doodles. So in the first mode, you can draw on people's faces, and the mustaches and beards and horns or whatever stay pinned to their faces when you or they move around, and it works pretty well. But the one I really enjoy is doing it in the \"Everywhere\" mode. It lets you draw shapes in, like, arbitrary space, and they stay pinned to where you were drawing them pretty well. It's not quite as good as Tilt Brush, but it's way better than I expected. Now, I enjoyed both of these things quite a lot, but if anybody uses this more than three times, I would be completely shocked. Now, the real upgrade for the stylus is actually in the software on the phone itself in Samsung Notes. You can quickly take a note without turning the phone on, just like before, but now, those handwritten notes are searchable, and you can extract the text out of them via OCR. It works way better than I expected, even with my garbage handwriting. There are a million other things that this stylus does. It can magnify stuff on the screen. It can make an app into a weird little picture-in-picture box that you can hover over. It is also the best screenshot drawing thing that you can get on a phone. At this point, you're either giddy with excitement over this little stick, or you're shrugging. And that's fair. I mean, look. Here are the only important reasons to spend hundreds of dollars more for the Note 10 Plus over the Galaxy S10 Plus: slightly bigger screen, slightly bigger battery with slightly faster charging, and the stylus. That's it. Okay so, there are a bunch of other things that the Note can do, and I'm going to get into all of them. But before that, I have to admit, there's one other thing about the Note 10 Plus that I really like besides the stylus. It's just really nice. It's like a luxury object, like a Rolex or an Eames chair. You're paying more for the brand name and just for how well-made this object is. I mean, Samsung has poured everything that it has learned about making hardware into the Note 10 Plus. The glass curves and melts into the middle rail. The screen goes fully edge to edge, and the fingerprint sensor is underneath the screen. The stylus is unibody now, and, hell, Samsung even made the ports line up. Just as a physical object, there is no more beautiful or well-made phone. And if you care about having the nicest thing, this is it. Now, the cameras are essentially unchanged from the Galaxy S10, which means that they're really good. Now, this is the part where you expect me to say that the Pixel 3 is slightly better, and, well, it is and it isn't. In challenging or low-light situations, or if you really start pixel-peeping, yes, the Pixel 3 is better. But the Note 10 has a telephoto and an ultrawide lens, and the camera app actually launches faster. So as a whole package, I actually enjoy using this more, at least in good light. This wide angle is fun, right? The answer is yes. Yes, it is. Now, the Note 10 Plus also is probably the very best Android phone for taking video, but that doesn't mean that it holds up to an iPhone XS. So Samsung has added a few new features to make video better. The first is Live Focus, which blurs the background in video, and it's bad. Don't use it. They've also slightly improved video stabilization. I really like the other thing they put in, which is a bare-bones video editor. It's actually not bad. It's almost what I wish iMovie was on the iPhone. And using a stylus to edit video on a phone is way easier than using your big fat fingers. The last thing is a zoom mic option, which tries to make the audio from the thing that you're zoomed in on louder than the audio that's near the phone, and it works... sort of. I don't know. It's not magic. Here, check it out. Becca is speaking. H, I, J, K, L, M, N, O, P... And I'm speaking at the same time. Q, R, S, T, U, V... And now we're zooming in on her, and I'm continuing to speak. W, X, Y, and Z... While she continues to speak. A, B, C, D, E, F, G... And I'm also speaking. H, I, J, K, L, M, N, O, P... And then we zoom away from her. Q, R, S, T, U, V... She is speaking. W, X, Y and Z... And now we should hear my voice more than her voice. A, B, C, D, E, F, G... She's just getting really tired of saying the alphabet. Now we come to the part where I talk about a bunch of Samsung features because there are a lot of Samsung features. Let's start with DeX, which is that thing that you plug your phone into a monitor, and then it turns it into a mini computer. It works in a whole new way this year, exclusively on the Note 10. There is now a DeX app for both Windows and Mac that lets you have a window for doing all of your phone stuff right on your computer, which is the thing that you actually carry with you instead of a, you know, rando monitor. DeX is okay. It's not super fast, but it is a really convenient way to do texting directly from your computer, or drag and drop files between your phone and your computer. But it's much better in theory than it is in execution. You see, the thing is actually, you know what? I have a lot of things to say about DeX and this whole dream of making your phone into your computer, so I'm going to do another video on that next week. For this review, what you should know is that it could be useful in a pinch, but it's definitely not a reason to buy this phone. All right, what else has Samsung packed into this thing? Well, a ton actually. There is a depth camera in the back here that can measure the size of stuff and eventually is going to let you scan 3D objects and put them into your own AR. I didn't get to test that, but I wouldn't expect the quality is going to be great. There's also a new version of their game mode that makes it easier to tweak settings and also grab screenshots. There's just also a million other Samsung settings with a lock screen and the edge panel and all the rest. And then there's Bixby. Bixby's still here, but Samsung did get rid of the dedicated button for it. It's built into the power button, but actually understanding what's going to happen when you press the power button gets a little bit complicated, even with the new configuration settings. And also, you know, Bixby still isn't good, which means you're going to still end up using Google Assistant instead. Samsung has also partnered with Microsoft, and so there's a bunch of Microsoft stuff in here. It links up to the Your Phone app on Windows, and Microsoft smartphone apps are preinstalled. And by the way, that means that there are now three email apps on this thing out of the box: Gmail, Samsung mail, and Outlook. Cool. Samsung has gotten better at software with One UI, and I don't hate it anymore. But you do have to learn a bunch of Samsung ways of doing things and have to deal with choosing between Samsung apps or Google apps or, now, Microsoft apps. For experts, it's totally manageable. But for everybody else, it's a real hassle. And of course, Samsung takes way too long to get the full version upgrades of Android pushed out its devices. It's doing security updates faster now, and One UI does so much that you might not be sad about not getting Android Q right away, but it's still annoying. (upbeat music) There's so much stuff in the Note 10 Plus that it's dizzying, and Samsung software just barely manages to contain it all and keep it comprehensible. It really does have everything... except a headphone jack. And I really like some of it and I also hate some of it, but none of it is the reason to either buy or skip this phone. See, the Note 10 Plus is a smartphone that goes to 11 for $1,100. But again, there are Android phones and even Samsung phones that cost hundreds of dollars less and get you nearly all the way there. The OnePlus 7 Pro is still amazing, and the Pixel 4 is only a couple of months away. Plus, the Galaxy S10 Plus is not all that different from this thing. Look, some people just want the nicest thing, and this, very clearly, is the very nicest Android phone by far. I love how luxurious the hardware is. I mean, look at this color. But I can't say it's a great reason to buy this phone, so it really comes down to this little thing: the S Pen. The thing is, though, unless you really want a stylus, I don't think it's worth spending the extra money for the Note 10 Plus. Hey, everybody. Thank you so much for watching. I'm really excited I got to just review a phone instead of talk about the future of computers, but I'm going to talk about the future of computers next week because I'm making the DeX video. So let me know in the comments what you think of DeX and what your questions are about it, and we'll see you next week.",
    "transcript_keywords": [
        "Note",
        "Samsung",
        "Samsung Galaxy Note",
        "phone",
        "thing",
        "Samsung Notes",
        "stylus",
        "Galaxy Note",
        "things",
        "phones",
        "true Note",
        "Android phones",
        "Android",
        "big Note",
        "screen",
        "big",
        "Notes",
        "big Android phones",
        "video",
        "Samsung phones"
    ],
    "transcript_entity_values": [
        "DeX",
        "11",
        "Android",
        "one",
        "the Samsung Galaxy Note 10 Plus",
        "S10",
        "The OnePlus 7 Pro",
        "three",
        "Windows",
        "the Galaxy S10 Plus",
        "Bixby",
        "1,100",
        "Tilt Brush",
        "Google",
        "the S Pen",
        "the Note 10 Plus",
        "Gmail",
        "Windows and Mac",
        "Becca",
        "Outlook",
        "U",
        "6.8-inch",
        "3",
        "Samsung",
        "UI",
        "hundreds of dollars",
        "the Note 10 Plus",
        "two",
        "jack",
        "the Galaxy S10",
        "Live Focus",
        "One",
        "this year",
        "next week",
        "a million",
        "the Note 10 Plus",
        "Eames",
        "Microsoft",
        "first",
        "the OnePlus 7 Pro",
        "more than three",
        "iPhone",
        "OCR",
        "last year's",
        "Rolex",
        "a ton",
        "L, M"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "MONEY",
        "PERSON",
        "ORG",
        "EVENT",
        "EVENT",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "LAW",
        "ORG",
        "ORG",
        "ORDINAL",
        "LAW",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "ORG"
    ],
    "vector": [
        -0.08212613314390182,
        0.0012175649171695113,
        0.04451942816376686,
        -0.06405926495790482,
        0.03538832440972328,
        0.04733912646770477,
        0.021730124950408936,
        0.14760272204875946,
        0.06059230491518974,
        0.022004464641213417,
        0.03436983376741409,
        0.04002877324819565,
        -0.02272535301744938,
        0.012898008339107037,
        0.05662195384502411,
        -0.07860192656517029,
        0.038379911333322525,
        -0.08957762271165848,
        -0.030030865222215652,
        0.06157330423593521,
        0.06274709850549698,
        -0.009892281144857407,
        0.033422064036130905,
        -0.06120729818940163,
        0.017432136461138725,
        0.03281388059258461,
        -0.06323928385972977,
        -0.10603342205286026,
        -0.006969088688492775,
        0.009045085869729519,
        -0.037529222667217255,
        0.08802016824483871,
        0.05615699291229248,
        0.0038237981498241425,
        -0.034051429480314255,
        -0.10973228514194489,
        0.022765040397644043,
        0.01275612786412239,
        0.0027675018645823,
        -0.021051906049251556,
        -0.012803354300558567,
        -0.026772515848279,
        0.011830373667180538,
        -0.024637477472424507,
        0.025105880573391914,
        -0.07606825232505798,
        0.040726326406002045,
        0.017349552363157272,
        -0.06378009915351868,
        0.015919551253318787,
        0.06172199174761772,
        -0.041178006678819656,
        -0.06496351212263107,
        0.014167786575853825,
        -0.01779833622276783,
        -0.0047045317478477955,
        0.02782142534852028,
        -0.014907130040228367,
        0.041936296969652176,
        -0.04915449768304825,
        0.054844893515110016,
        -0.030938345938920975,
        0.012691386975347996,
        0.021521661430597305,
        -0.037237245589494705,
        0.020009169355034828,
        0.023874204605817795,
        -0.04003213346004486,
        0.011382589116692543,
        0.006504287477582693,
        0.03095434233546257,
        0.010577471926808357,
        0.01191048976033926,
        -0.007513516116887331,
        0.024144703522324562,
        0.019086821004748344,
        0.05063788220286369,
        0.02209869585931301,
        -0.09085699170827866,
        -0.017826039344072342,
        0.03436648100614548,
        -0.029948998242616653,
        -0.016783783212304115,
        0.004008016549050808,
        0.03596855327486992,
        0.0038264531176537275,
        -0.022578677162528038,
        0.026670455932617188,
        -0.08355612307786942,
        -0.028872624039649963,
        0.05043451488018036,
        0.0690612941980362,
        -0.0955459475517273,
        -0.05762317404150963,
        -0.04298592731356621,
        0.05050396919250488,
        -0.06810952723026276,
        -0.012925668619573116,
        -0.04053806513547897,
        -0.039008256047964096,
        0.09057046473026276,
        0.05174095183610916,
        0.11197953671216965,
        0.05390763282775879,
        0.09328966587781906,
        -0.04649584740400314,
        -0.018084494397044182,
        -0.06309399008750916,
        -0.015540211461484432,
        -0.06317238509654999,
        0.034999389201402664,
        0.009644486010074615,
        -0.02291770838201046,
        0.014081168919801712,
        -0.028050612658262253,
        -0.08377128094434738,
        -0.030088385567069054,
        0.035198625177145004,
        0.11855179816484451,
        0.06895355135202408,
        0.028197767212986946,
        0.012863250449299812,
        -0.14167751371860504,
        -0.08309606462717056,
        -0.043513424694538116,
        0.023395556956529617,
        -0.09556537866592407,
        2.046988230106669e-33,
        -0.014280830509960651,
        0.09594903886318207,
        -0.009255878627300262,
        -0.0634462758898735,
        -0.03443121910095215,
        0.021454935893416405,
        -0.03687193617224693,
        0.08777747303247452,
        -0.005820176564157009,
        -0.045030415058135986,
        -0.02867310307919979,
        -0.036105550825595856,
        -0.002850527409464121,
        0.10590589791536331,
        0.0430724062025547,
        -0.033647459000349045,
        -0.040324583649635315,
        -0.013971385546028614,
        0.039673417806625366,
        -0.045998264104127884,
        0.006704393774271011,
        -0.01998683623969555,
        -0.002931535942479968,
        0.0374194011092186,
        0.029051415622234344,
        0.03353936970233917,
        0.01802396960556507,
        0.004357262514531612,
        0.026156900450587273,
        -0.0035737198777496815,
        -0.11489317566156387,
        0.013149073347449303,
        0.06060456484556198,
        -0.04456501826643944,
        -0.0070634703151881695,
        0.004834258463233709,
        0.032882705330848694,
        -0.09351684153079987,
        0.09330327063798904,
        -0.1148359552025795,
        -0.03731084614992142,
        0.04130042344331741,
        -0.08517398685216904,
        0.04391937702894211,
        0.028245799243450165,
        0.03214266523718834,
        -0.028874462470412254,
        0.0006158212199807167,
        0.00451718270778656,
        -0.023850254714488983,
        -0.027431882917881012,
        -0.08147845417261124,
        -0.020430361852049828,
        0.08262140303850174,
        -0.05355419963598251,
        -0.0822523906826973,
        0.023822760209441185,
        -0.03879905492067337,
        -0.06761746108531952,
        0.024458887055516243,
        -0.001160392421297729,
        -0.011862242594361305,
        -0.046270281076431274,
        0.10481595993041992,
        -0.06686126440763474,
        0.09227681905031204,
        -0.005286278668791056,
        0.0036873803474009037,
        0.0016827058279886842,
        0.012193208560347557,
        -0.03765621781349182,
        0.006045595742762089,
        0.017625050619244576,
        0.027273651212453842,
        0.0246922317892313,
        -0.00875384733080864,
        0.03911726176738739,
        -0.037854745984077454,
        0.038600679486989975,
        0.035919271409511566,
        -0.0628761425614357,
        0.01341214869171381,
        0.020088713616132736,
        -0.020097296684980392,
        0.007942448370158672,
        -0.028370965272188187,
        0.02802462875843048,
        -0.13175158202648163,
        0.060240719467401505,
        -0.019301028922200203,
        -0.03464707359671593,
        -0.018877936527132988,
        -0.015399955213069916,
        0.0038284207694232464,
        -0.0534307025372982,
        -3.915579396770717e-33,
        -0.04937030375003815,
        -0.03762968257069588,
        -0.02815903350710869,
        0.0335342176258564,
        -0.059277456253767014,
        0.08451265096664429,
        0.0479930080473423,
        -0.03552934154868126,
        -0.020370515063405037,
        -0.015244098380208015,
        -0.02349405363202095,
        0.0466650016605854,
        0.019167404621839523,
        -0.026411324739456177,
        -0.04187608137726784,
        -0.0020954872015863657,
        -0.04568520188331604,
        -0.03941604122519493,
        0.054922837764024734,
        -0.03288712725043297,
        0.009296017698943615,
        -0.005785370245575905,
        0.03066125139594078,
        0.05586550757288933,
        0.0032632919028401375,
        0.00403949711471796,
        -0.06785024702548981,
        -0.08368606865406036,
        -0.024856828153133392,
        0.020277004688978195,
        0.021190647035837173,
        -0.1019894927740097,
        -0.017494777217507362,
        0.04950132220983505,
        0.003305843099951744,
        0.013547400943934917,
        0.09253595024347305,
        -0.06738471984863281,
        0.0360187329351902,
        0.044543780386447906,
        0.05246961861848831,
        0.0029961415566504,
        0.07603921741247177,
        -0.00808512419462204,
        0.012155076488852501,
        -0.005571207497268915,
        -0.026628527790308,
        0.053860392421483994,
        -0.05817647650837898,
        -0.038539428263902664,
        0.07614193856716156,
        -0.02650102600455284,
        0.0011097312672063708,
        -0.019935689866542816,
        -0.09233950823545456,
        0.011339500546455383,
        0.01735256239771843,
        -0.033777326345443726,
        -0.012894720770418644,
        -0.05347784236073494,
        0.050499457865953445,
        0.05160222575068474,
        -0.0641493871808052,
        -0.03770817071199417,
        -0.03643915802240372,
        -0.04160050302743912,
        0.12256111949682236,
        0.0017931110924109817,
        -0.008486739359796047,
        -0.008601387962698936,
        -0.05381081625819206,
        0.012233424931764603,
        -0.01469807792454958,
        -0.06261169165372849,
        -0.01375571545213461,
        0.11800973117351532,
        -0.06521730124950409,
        -0.11675570160150528,
        -0.014210916124284267,
        -0.03745982050895691,
        0.0015082386089488864,
        0.007865887135267258,
        0.06062866374850273,
        -0.025277791544795036,
        0.06616994738578796,
        -0.004589668940752745,
        -0.030314825475215912,
        0.03985333442687988,
        -0.055683426558971405,
        0.064513199031353,
        -0.0980299636721611,
        0.0330178402364254,
        -0.009122548624873161,
        0.06689445674419403,
        0.03146953508257866,
        -5.361223287536632e-08,
        0.023188037797808647,
        0.03619974106550217,
        0.03188550844788551,
        -0.10412924736738205,
        0.03641133010387421,
        -0.05641757696866989,
        0.034348998218774796,
        -0.02950482815504074,
        0.09378856420516968,
        0.07194724678993225,
        -0.020245717838406563,
        -0.14221937954425812,
        -0.10867413878440857,
        -0.03694374859333038,
        0.0013777052517980337,
        0.07723496109247208,
        -0.02172018401324749,
        -0.01772487163543701,
        0.0045884777791798115,
        -0.0175813976675272,
        0.03141098842024803,
        0.08608222752809525,
        -0.055443935096263885,
        -0.07887580245733261,
        0.07238779217004776,
        -0.02800103835761547,
        -0.01478660013526678,
        0.09453262388706207,
        0.014670322649180889,
        0.03431727737188339,
        0.06703358888626099,
        -0.0875614807009697,
        -0.020487818866968155,
        0.02628546580672264,
        0.036500319838523865,
        -0.043782349675893784,
        0.05374384671449661,
        -0.022227052599191666,
        0.1290186047554016,
        0.10080795735120773,
        0.022536763921380043,
        0.008009633049368858,
        -0.08582771569490433,
        0.04504077136516571,
        0.00454594474285841,
        -0.0880136713385582,
        -0.024085793644189835,
        -0.054667435586452484,
        -0.08346366137266159,
        0.06781094521284103,
        -0.035511039197444916,
        -0.02528323046863079,
        -0.04356520250439644,
        0.03215297311544418,
        -0.020935211330652237,
        -0.0017226985655725002,
        0.03280076012015343,
        0.07167083024978638,
        -0.012262489646673203,
        0.044971588999032974,
        0.07253358513116837,
        -0.01405282411724329,
        0.0505249910056591,
        0.11113639920949936
    ]
}