{
    "id": "fuiAJFf0EJI",
    "title": "This $500 Budget Gaming PC Is AWESOME",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-07-05T17:34:41Z",
    "video_url": "https://www.youtube.com/watch?v=fuiAJFf0EJI",
    "category": "Science & Technology",
    "tags": [
        "Budget",
        "PC",
        "Gaming Rig",
        "Gaming PC",
        "Graphics Card",
        "GPU",
        "Computer",
        "Budget Build",
        "Cheap",
        "Inexpensive",
        "Used Market",
        "Crypto Winter",
        "Gamer"
    ],
    "views": 3320074,
    "likes": 117908,
    "comments_count": 4706,
    "description": "Visit  and use offer code LTT for 10% off  Save 10% and Free Worldwide Shipping at Ridge Wallet by using offer code LINUS at   Budget builds are BACK now that crypto winter is here! New GPUs are in stock at MSRP, and used graphics cards are showing up on Ebay and Marketplace for some downright affordable prices.   Discuss on the forum:   Buy an Asus Prime H610M-E:   Buy a TeamGroup T-Force Vulcan 2x8GB 3200MHz:   Buy a Crucial P2 500GB NVMe SSD:   Buy a Rosewill FBM-X1 Case:   Buy a Corsair CV 650W 80+ Bronze:   Buy an RTX 2060 6GB:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:21 Motherboard 2:15 CPU 3:45 RAM 4:10 Storage 4:50 Case 7:20 Power Supply 8:30 GPU 11:00 Boot It Up 12:10 Performance 14:29 Thermals 16:00 Outro",
    "description_links": [
        "https://www.squarespace.com/LTT",
        "https://www.ridge.com/LINUS",
        "https://linustechtips.com/topic/1441297-this-budget-gaming-pc-is-awesome/",
        "https://geni.us/VNosnx7",
        "https://geni.us/pFTWsDv",
        "https://geni.us/OZLNqv",
        "https://geni.us/5K3d9",
        "https://geni.us/T3oqe",
        "https://geni.us/6KUyY",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Two years. It was two years ago, to the day. The last time we built a $500 gaming PC with an actual freaking GPU in it. That is how long gamers have waited for graphics card pricing to come back down to Earth, but it has hasn't it. The crypto bros may be crying but right now gamers are rejoicing at the tsunami of cards hitting the used market. RTX 3090's, a thousand dollars. 3070's, how about 500 bucks for a non LHR version? But wait, hold on. I hear you guys. $500. That's still a freaking ton of money for just a GPU. So today we're gonna build an entire budget gaming PC that was inspired by an eBay listing that I would've thought impossible just a few short weeks ago. An RTX 2060 for just 200 bucks, impossible. Like this segue to our sponsor. - Ridge. Ridge wallet has redefined the traditional wallet with its compact frame and RFID blocking plates. Keep your wallet bulge down and use our offer code 'Linus' to save 10% and get free worldwide shipping at the link down below. (techno music) - I'm just in such a good mood today, guys because the main premise of this channel that anyone can build a computer and that it doesn't have to be outlandishly expensive is finally true again. For our motherboard, we've gone with the H610M E-D4. Yeah, it doesn't have the greatest IO and there's no cooling on the VRMs, but this puppy can be had for a hundred dollars brand new or for around $65 on eBay. All with support for the latest 12th gen Intel processors. It's got two M.2 slots for SSD storage LP at gen three speeds, support for dual channel DDR form memory, and it's even got one of the older style 12 volt non-addressable RGB headers. (ding) But hold on a second, Linus what are you doing? Building a budget rig with current gen Intel. Ah, that is where my good friend the core I312-100 comes in. There is a lot to like about this chip, starting with the fact that it has four of the same golden cove P cores that you would find in the rest of Intel's 12th gen lineup. It also has support for up to PCI express gen five and DDR five, like the rest of the 12th gen lineup. Now there's only four of those cores, eight threads total. So you're not gonna be setting any cinebench world records but they will turbo to up to 4.3 gigahertz meaning that this chip is a low key gaming monster. And I haven't even mentioned the best parts yet. It's just over a hundred dollars and you can get it down to 105, if you go for the F version of the SKU which doesn't include onboard graphics, that's wild. And unlike AMD's closest competitor, LGA 1200, has a clear upgrade path. You can either go to an I5 or an I7 12th gen or you can move to the upcoming 13th gen Raptor Lake which is confirmed to be backwards compatible. And it gets even better. Unlike the rich people, K SKU's Intel's basic processors actually come with coolers in the box. They're nothing amazing. And our particular one seems to have received some touch ups at the factory, but they are super easy to install, look pretty decent and are perfectly capable of taming the 89 watt maximum boost TDP of a chip like this one. (techno music) Ram ended up being a pretty straightforward choice for us. This 16 gig kit of 3200 mega transfer per second CL 16 DDR4 is pretty much the sweet spot for price to performance. And it also happens to be the maximum transfer rate that this particular CPU and motherboard combo supports. As for why we chose a team group T force vulcan Z, frankly it just came down to price. It was about 50 bucks and you'll actually find plenty of comparables from other brands. And the budget hits keep coming. We've gone with a crucial P2 500 gig for our boot SSD. Why you might ask, because at $45, it is cheap as chips. It might be PCI express gen three and it might not have a DRAM cache but at this kind of price point your only other options are maybe a WD SN570, which is gonna be around the same price anyway, or a mechanical hard drive, which frankly is not what you wanna be booting off of in a modern system. Which isn't to say that mechanical hard drives don't have their place. For bulk storage, their cost per gigabyte is absolutely untouchable which is why we made sure to find a case that has support for at least one hard drive. This is the FBM-X1 from Rosewill. Is it the greatest case ever? No, but it can be had for as little as like 10 bucks on eBay and hopefully between the front 120 millimeter and rear 80 millimeter cooling fan we will have enough cooling. You know what else you can never get enough of? Fun exclusives and behind the scenes which are only available on floatplane.com. (yelling) And I took that personally. This is a budget build, so we won't find any fancy features like built in IO shields. We'll be popping our shield in the old fashioned way. Oh, so hard. Oh, I should have spent twice as much on my motherboard. It's fine, I'm kidding. Then, as long as we've got our standoffs in the right locations, please do make sure you double check that. We'll just go ahead, pop our board in. How you doing there, buddy? Oh yeah, look at that. Man, how cool is it that even budget components can be color coordinated now like this build looks awesome. Oh, oops. It's still not really worth the extra cost but this wouldn't have happened with the built in IO shield. I accidentally got the little tabs here for grounding inside the ports, rather than on top of them. So I'm going to need to take the board out and put it back in. - There's not much cable management room. - Yeah. Not much in the way of cable management in this case. That's okay. We'll make it work. That's a pretty cool hack to get some cable management room on the back. Just kind of pop out the panel a little bit. I like it. Linus approves. Oh, what the hell? Whoever disassembled this last time ripped the - Oh plastic housing for the USB three header off of the motherboard. You know how I talk about how fragile and horrible these connectors are all the time. This is what I'm talking about. Look at this. It ripped the female housing right off the last motherboard that it was in See that? Don't worry little H610M, that won't happen to you. Doesn't it just kind of feel like summer? Don't you just wanna wear a party shirt from LTTstore.com. - Yeah. (laughing) - We showed up wearing the exact same thing today. I swear we didn't coordinate this. Twins. - Twinsies. - Oh wow. This cable management is gonna be horrible. This is just gonna traverse the motherboard like this apparently. Boom, cable managed. You can call me the cable guy. Just kidding. - Cable guy - My career hasn't sunk that low. Our power supply was a pretty obvious choice. We went with the CV650 from Corsair. It's non modular and it's not gonna have bells and whistles like, you know silent zero decibel fan modes or anything like that. But it's 650 freaking watts. It's still 80 plus bronze. So it's reasonably efficient and it's got all black sleeved cables. So our finished rig is not gonna have any of that ketchup and mustard look like an older one would. Even when you're working with a non modular power supply it can be a useful little trick to plug in hard to access connectors, like the CPU eight pin connector, before you actually install the power supply. There's our 24 pin. For cable management, the only thing we're gonna leave accessible is our PCI express six plus two pin connectors. And the rest we can just cram in the five and a quarter inch space old school style. Now we paid $42 brand new for this bad boy but I would hazard a guess that in the coming months we are going to see, much like GPUs, a surplus of power supplies on the secondhand market. Probably not lower wattage ones like this, but I would expect to see wild deals on 850, 1000, and 1200 watt units as minors, try to divest themselves at this hardware. Finally, it's time to talk GPU. Now I gave a $200 price for an RTX 2060 but the truth is it's a little bit more complicated than that. You probably aren't getting a founder's edition for $200 but we've seen other RTX 2060's, which by the way will perform the same, sold for as low as $160. If you're more of a team red type of character you can also get a 5600 XT for about the same price, 160 at the low end and those top out around the $190 range. It's a ton of GPU for the money, especially in the context of the last two years. Uh oh, this is gonna be a little tight. Oh no, it seems fine. Nevermind. Nevermind. I lied. It's all good. Does take a bit of maneuvering to get it in there but, it's in. Now we just need our power connector. Oh, you know what? I bet I can look through here to see what I'm doing - Oh, no way you actually probably even have enough room, for sure. - Hi camera. I'm having so much fun right now, you know, like I can't believe we can finally build budget rigs again. This might not be the best gaming rig for $500 but that's kind of the fun of it. There's a lot of different ways to tackle a budget rig. Whereas with a high end one buy all the most expensive stuff and slap it together. Here, we've gotta make sacrifices. Are we more focused on CPU or are we more focused on GPU? What's our risk tolerance for used hardware? That is something to be aware of. If you're picking up these crypto mind GPUs. Yeah. They might not last as long as a brand new one and you're certainly not gonna get any warranty coverage on them. So it's a die. You gotta be tempted to roll. I mean, I certainly was back in the day. Don't take my word for it though. All we've gotta do now is close it up and show you guys the results. Obviously these peripherals are a bit of a mismatch for our system but I'm using them to emphasize the capability of this rig. And I dare say it actually looks pretty good too. - Oh geez. (laughing) - Uh oh - The case is in the way. - Does that fit - Of our ports, look. - Uh oh, that's stupid. Yeah. I think I remember that being a problem in this case it's got this little folded piece of metal here that makes it so that you - Can't plug it in. - You can't actually get this lay port cable in there. I think I made it worse. - Yeah. I think you did. - No. Why this, no Time for another power fist. (banging) - Oh that looks like it'll fit now. (laughing) - There you go. Fixed that for your Rosewill percussive maintenance. moment of truth time, here we go. 16 gigs Ram, CPU detected, M.2 detected. (clap) Boom! Everything good to go. That's a bit of a concern. The only front air intake is here - Is on the bottom - and these feet are super low profile. It's possible that we're going to need some speed holes. (drilling) - I ask you how you are and you just have to say that you're - I think it'll be okay. I think that I'm going get prepared to make speed holes. - Okay. But don't until we actually test. - Its a 12100 (drilling) - Yeah. And a third and a 2060, like I think it'll be fine. - You heard it here first, Plouffe says thermals will be fine with a solid front panel. - It's low end hardware. It'll be okay. It's not a 3070, or like a 12700K, I think it'll be okay. - Definitely some minor quality of life challenges. Can't get, can't get a plug into this. There it goes. Just give it a little bend there. - Can you get it out? - That should be better. I'm sure I can get it out. Yes, yes. I can get it out Now I can't get it back in though. In CS:GO, we're running at 1080P with everything basically cranked and something else to note as we're going through this exercise is that I am screen recording at the same time. That's right. This machine is not only capable of playing games. It is also capable of streaming. Something that you could not do for 500 bucks just a few short weeks ago. As always it won't actually make you a good gamer, but yeah just low key 250, 300 frames per second. Let's go. Oh, it feels good, doesn't it? - It's 12 year old game, but yeah - Doesn't it feel good? Wait, look, (laughing) Hey 300 FPS in anything for 500 bucks, I'll take it after this last fricking couple of years. It's worth noting that even though this is an older e-sport centric title, so not the most demanding game, a big part of why we're able to push these extremely high frame rates which actually have a benefit. Even if you don't have a high refresh rate monitor because they reduce input latency is due to those golden cove P cores. Now you could spend another 40 bucks and you could get six of them rather than four. But we were trying really hard to hit that 500ish dollar price point. Oh 100, man what a steal. Oh wait, what the where's my knife. Oh boy, went to, I went to press a melee button, forgot what game I was playing. (laughing) We're getting Halo Infinite. Where's the, - Because you set it to installed only. (yelling) - This is one area where this CPU's gonna hold us back. Downloading games, poor thing. We're only at 300 megabit. It's at 48% CPU usage. Oh we should have a look at what our temps were in game. Our CPU maxed out around 65 degrees and our GPU maxed out around 69 degrees. I'd say thats - That's nice. - I'd say that's pretty nice but I don't know if we had actually reached peak. - Sure. - Okay. - Sure. - And we're gonna run a more demanding game now. Obviously this is a little bit more impressive. We've got Halo Infinite running at medium at around 75 frames per second. That is more than smooth enough for actually a pretty, ah, no, crap. Well, that was a tactical error. (laughing) Ah, whoops. - Now you're in the lava. - Oh man, (smack) that was a bit of a fail, but what's not a fail. Is that we're sitting at 90% CPU utilization, 98% GPU utilization. The system is still freaking quiet and we've peaked at 76 degrees on our GPU and around 80 on our CPU. So we are nowhere near thermal throttling territory. - I told you - You were right. When you're right, you're right, Plouffe. - Thanks - And reminder, of course I'm still recording this game. Okay, I want one kill and then I'm - Okay. - And then I'm good to leave. - Get the guy on the ghost. (yelling) - Just got meleed It's embarrassing. That's it then. The $500 gaming PC, it's back, ladies and gentlemen. Great performance, damn near silent, adequate thermals. And you can go even cheaper, if you're willing to get more of the components used. We're gonna have all the ones that we bought by the way, linked in the video description Where we'll also have our sponsor - Squarespace. If you're building your brand online in 2022 you should absolutely have a website. And if you need a tool to help build that brand look no further than Squarespace. Squarespace is the all in one platform to help expand your brand online, make a beautiful website, engage with your audience, and sell anything and everything from products to content. We love Squarespace so much. We use it here at LMG. It's custom templates make it easy to stand out with a beautiful website that fits your needs. You can maximize your visibility, thanks to a suite of integrated SEO features and their analytic insights help you optimize your performance so you can see what's going on as well as what needs a little bit of work. So get started today. Head to squarespace.com/ltt to get 10% off your first purchase. - If you guys enjoyed this video why don't you check out the one from two years ago? And while you're at it, check out the comments. People got real mad about how impossible it was to buy a computer like this. \"What are you guys magic?\" No, we just made that video right before things went completely to shiz.",
    "transcript_keywords": [
        "CPU",
        "GPU",
        "Yeah",
        "gen",
        "cable",
        "good",
        "cable management",
        "bit",
        "pretty",
        "bucks",
        "time",
        "gen Intel",
        "budget",
        "make",
        "price",
        "low",
        "back",
        "PCI express gen",
        "Intel",
        "hard"
    ],
    "transcript_entity_values": [
        "3070",
        "500ish dollar",
        "one",
        "500",
        "Rosewill",
        "100",
        "eBay",
        "SSD",
        "two years ago",
        "eight",
        "K SKU's",
        "a third",
        "the coming months",
        "RGB",
        "1200 watt",
        "zero",
        "Rosewill",
        "Corsair",
        "CV650",
        "10%",
        "a hundred dollars",
        "couple of years",
        "just 200 bucks",
        "GPU",
        "300",
        "4.3 gigahertz",
        "AMD",
        "I7 12th",
        "three",
        "Linus",
        "the day",
        "1000",
        "24",
        "around $65",
        "650 freaking watts",
        "Earth",
        "12700",
        "about 50 bucks",
        "first",
        "2022",
        "89 watt",
        "around 65 degrees",
        "80",
        "LGA 1200",
        "gigs Ram",
        "12 volt",
        "300 megabit",
        "I312-100",
        "12 year old",
        "Squarespace",
        "CPU",
        "RFID",
        "13th",
        "six",
        "190",
        "45",
        "120 millimeter",
        "Intel",
        "another 40 bucks",
        "1080P",
        "four",
        "Ridge",
        "12th",
        "12100",
        "42",
        "around 80",
        "90%",
        "500 bucks",
        "76 degrees",
        "2060",
        "around 75",
        "a thousand dollars",
        "just over a hundred dollars",
        "XT",
        "16",
        "Ram",
        "five",
        "the last two years",
        "48%",
        "105",
        "as low as $160",
        "about 500 bucks",
        "a ton",
        "M.2",
        "5600",
        "LMG",
        "around 69 degrees",
        "DDR",
        "3200",
        "two",
        "the five and a quarter",
        "250",
        "F",
        "second",
        "160",
        "SKU",
        "the latest 12th",
        "98%",
        "LHR",
        "200",
        "today",
        "Plouffe",
        "80 millimeter",
        "little H610M",
        "850",
        "only four",
        "PCI",
        "at least one",
        "3090",
        "500",
        "USB",
        "300 FPS",
        "Halo Infinite",
        "IO"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERCENT",
        "MONEY",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "EVENT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "LOC",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PERCENT",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERCENT",
        "ORG",
        "MONEY",
        "DATE",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "GPE"
    ],
    "vector": [
        -0.06186703220009804,
        0.010749353095889091,
        -0.023092025890946388,
        0.0024849451147019863,
        0.05206076428294182,
        0.025593305006623268,
        -0.0077303447760641575,
        0.08140967041254044,
        -0.05477020516991615,
        0.01174094993621111,
        -0.051217611879110336,
        0.03810165077447891,
        -0.004994941875338554,
        -0.03879597783088684,
        0.052013806998729706,
        0.009103831835091114,
        0.06304623186588287,
        -0.07525590807199478,
        -0.02737335115671158,
        -0.0031853329855948687,
        -0.0014474603813141584,
        -0.08050470799207687,
        -0.03404911234974861,
        -0.03365783020853996,
        0.0030657975003123283,
        -0.03647806495428085,
        0.08466406911611557,
        -0.07540106028318405,
        -0.0052652801387012005,
        -0.0374477319419384,
        0.011136430315673351,
        0.018646182492375374,
        -0.019727103412151337,
        0.06152331084012985,
        -0.0016072256257757545,
        -0.038309868425130844,
        0.0773567259311676,
        -0.09390641748905182,
        -0.05915360525250435,
        -0.09641614556312561,
        -0.029373327270150185,
        -0.031475283205509186,
        -0.04956316202878952,
        0.038044288754463196,
        0.04968637973070145,
        -0.031519223004579544,
        0.01803276315331459,
        -0.014910377562046051,
        0.03795486316084862,
        -0.006922029424458742,
        0.026618489995598793,
        -0.05457337200641632,
        -0.012811609543859959,
        -0.06534558534622192,
        -0.1552700251340866,
        0.047015246003866196,
        -0.029805021360516548,
        -0.14192357659339905,
        0.05264060199260712,
        -0.09272823482751846,
        0.04367857798933983,
        -0.10674918442964554,
        0.01445969007909298,
        0.08367319405078888,
        -0.018689783290028572,
        -0.009374694898724556,
        0.023149099200963974,
        0.00688941590487957,
        -0.009042495861649513,
        0.0029345275834202766,
        0.03855031356215477,
        0.027174493297934532,
        0.001377589418552816,
        0.029500877484679222,
        -0.01265022810548544,
        0.04383164644241333,
        0.08211754262447357,
        -0.11079615354537964,
        0.03836615011096001,
        0.05408128723502159,
        -0.004146476276218891,
        0.018892835825681686,
        -0.03185658156871796,
        -0.03440310060977936,
        0.021184653043746948,
        -0.01196636538952589,
        0.023572910577058792,
        0.03687622770667076,
        0.023797115311026573,
        -0.11579997837543488,
        0.05577654764056206,
        0.04974961280822754,
        0.07330844551324844,
        0.025872860103845596,
        0.0020543013233691454,
        0.033903464674949646,
        0.014138302765786648,
        -0.1030508279800415,
        -0.05640402436256409,
        0.05694323405623436,
        0.006132372189313173,
        0.04657214134931564,
        0.06091618910431862,
        0.00614178366959095,
        -0.06752721965312958,
        -0.00012890920334029943,
        -0.04629435017704964,
        0.08487177640199661,
        -0.03157554939389229,
        -0.04077642410993576,
        -0.09429018944501877,
        0.04615876451134682,
        -0.07393942028284073,
        0.022889863699674606,
        0.005105341784656048,
        -0.030397305265069008,
        -0.055106278508901596,
        -0.01450751069933176,
        0.07711959630250931,
        0.0035903810057789087,
        0.027601374313235283,
        -0.04664214700460434,
        -0.037210613489151,
        0.03903844952583313,
        -0.01167782861739397,
        -0.006327684037387371,
        -0.04483848437666893,
        8.004586821957939e-33,
        -0.008095918223261833,
        0.06784863024950027,
        -0.05471300333738327,
        -0.06149452552199364,
        -0.026441659778356552,
        0.04147917777299881,
        0.056106697767972946,
        -0.035532984882593155,
        -0.006571585312485695,
        0.04471307247877121,
        -0.06991329789161682,
        -0.0010607747826725245,
        -0.0599319189786911,
        0.07886577397584915,
        0.02469290979206562,
        -0.08431270718574524,
        -0.0005189466755837202,
        0.05794230103492737,
        0.010052546858787537,
        0.0013135214103385806,
        0.0014027879806235433,
        0.03857344016432762,
        0.08012877404689789,
        -0.03564830869436264,
        0.03246534615755081,
        -0.03557319939136505,
        -0.023096522316336632,
        -0.026716046035289764,
        0.08151312917470932,
        0.03038109838962555,
        -0.02637612819671631,
        -0.08406563848257065,
        -0.0018560151802375913,
        0.01859661005437374,
        0.008702882565557957,
        0.035110000520944595,
        -0.053536273539066315,
        -0.07510495185852051,
        0.03000025264918804,
        -0.026808252558112144,
        -0.004638973623514175,
        0.10787220299243927,
        -0.08366389572620392,
        -0.12207773327827454,
        -0.01705748960375786,
        0.025818513706326485,
        0.027041016146540642,
        0.009143278002738953,
        -0.020276326686143875,
        -0.0018132003024220467,
        -0.10320639610290527,
        0.06085405498743057,
        -0.09280910342931747,
        0.02054925635457039,
        0.013116416521370411,
        -0.07567242532968521,
        0.027467673644423485,
        -0.012876874767243862,
        0.1113487035036087,
        0.08347264677286148,
        -0.02261795476078987,
        -0.05604887381196022,
        0.0006669206777587533,
        -0.032331425696611404,
        -0.09155242890119553,
        0.029107261449098587,
        0.04956965520977974,
        0.02653377875685692,
        -0.11754660308361053,
        0.008678574115037918,
        -0.004680985119193792,
        -0.04523833841085434,
        0.05487898364663124,
        0.0042842086404562,
        0.06709183752536774,
        0.008514904417097569,
        -0.02882843092083931,
        -0.013905365951359272,
        -0.0325932539999485,
        -0.030913541093468666,
        -0.03720475360751152,
        0.03564193472266197,
        -0.003597160102799535,
        0.08109735697507858,
        0.06054865941405296,
        0.04815732687711716,
        -0.009210750460624695,
        0.02793133072555065,
        -0.05592145025730133,
        -0.019762614741921425,
        -0.002085648011416197,
        -0.03460070490837097,
        0.029060419648885727,
        -0.006977393291890621,
        0.018432041630148888,
        -8.536194591225718e-33,
        -0.039030078798532486,
        -0.016546769067645073,
        0.011513598263263702,
        0.07311549782752991,
        0.03840333968400955,
        -0.040820617228746414,
        0.0373559333384037,
        0.018512776121497154,
        0.024143191054463387,
        -0.006166956387460232,
        0.0028522885404527187,
        0.020867174491286278,
        0.00047958697541616857,
        0.04671286791563034,
        0.009677855297923088,
        -0.08707000315189362,
        0.04643883556127548,
        -0.051885705441236496,
        0.08389786630868912,
        -0.04786713793873787,
        0.06613702327013016,
        0.04207964241504669,
        -0.02033301442861557,
        -0.004220504313707352,
        0.04372614249587059,
        0.035753652453422546,
        -0.03700242564082146,
        0.01600748486816883,
        -0.02918890118598938,
        0.036142341792583466,
        -0.02498093992471695,
        0.0042718383483588696,
        0.041626427322626114,
        0.0019851296674460173,
        0.06520424783229828,
        -0.04133916273713112,
        0.09654411673545837,
        0.01979120261967182,
        0.0098579665645957,
        0.010870249010622501,
        0.047750379890203476,
        0.010795919224619865,
        0.029442789033055305,
        -0.03695987910032272,
        0.058197326958179474,
        -0.0038433417212218046,
        -0.00513800885528326,
        -0.10283976048231125,
        0.0827721506357193,
        0.04650697484612465,
        -0.018359480425715446,
        -0.019948285073041916,
        0.07417638599872589,
        0.0053469715639948845,
        -0.018017206341028214,
        -0.11935485899448395,
        -0.022537127137184143,
        0.05971033498644829,
        -0.03838830813765526,
        -0.0714932382106781,
        0.04270587116479874,
        0.07488903403282166,
        -0.013945512473583221,
        -0.0416368693113327,
        0.03062187135219574,
        -0.060789816081523895,
        0.05186265707015991,
        0.017336221411824226,
        -0.03016282245516777,
        -0.00452046561986208,
        -0.0861373022198677,
        -0.05030827224254608,
        -0.00756047572940588,
        -0.0992484912276268,
        -0.020068800076842308,
        0.03289932385087013,
        0.035173363983631134,
        -0.02526632696390152,
        0.13468143343925476,
        -0.008629499934613705,
        -0.06864605844020844,
        4.113657269044779e-05,
        0.03389204293489456,
        -0.005563474725931883,
        0.043657924979925156,
        0.001800118014216423,
        0.010011439211666584,
        -0.031648822128772736,
        -0.022625386714935303,
        -0.03305743262171745,
        -0.06895436346530914,
        0.0038185648154467344,
        0.029823122546076775,
        0.015604989603161812,
        0.022406840696930885,
        -5.821837945063635e-08,
        0.014312517829239368,
        0.004985081031918526,
        0.009487577714025974,
        0.0441286563873291,
        0.03472604230046272,
        -0.10181313008069992,
        0.0038386185187846422,
        -0.02160022407770157,
        0.048766348510980606,
        -0.04775627329945564,
        0.07815328985452652,
        -0.11346051841974258,
        -0.00308823911473155,
        -0.06561144441366196,
        -0.040960244834423065,
        -0.008914455771446228,
        -0.09579772502183914,
        0.07435211539268494,
        -0.0043663266114890575,
        -0.09863124787807465,
        0.012200089171528816,
        0.058571502566337585,
        0.11295757442712784,
        -0.01530306413769722,
        0.001742017106153071,
        0.034882910549640656,
        0.04615214839577675,
        0.0003655721666291356,
        0.11420424282550812,
        -0.020711146295070648,
        -0.06976274400949478,
        -0.029255108907818794,
        0.06113751605153084,
        -0.053971774876117706,
        0.08903723210096359,
        -0.06534845381975174,
        -0.024299032986164093,
        0.12677346169948578,
        0.13839995861053467,
        0.04213476926088333,
        -0.00023972350754775107,
        -0.03463180363178253,
        -0.006972531788051128,
        -0.014602812938392162,
        0.048143330961465836,
        -0.004560159519314766,
        -0.06649124622344971,
        -0.063189797103405,
        -0.03449660912156105,
        0.00360690476372838,
        -0.07529806345701218,
        0.003495950950309634,
        -0.06269752234220505,
        0.03001410886645317,
        0.006983326282352209,
        -0.00870248582214117,
        -0.038274943828582764,
        0.061136774718761444,
        0.001547200488857925,
        0.022994033992290497,
        -0.007360504940152168,
        -0.14220431447029114,
        -0.09385395050048828,
        0.07609584182500839
    ]
}