{
    "id": "FwOp5NE7-H4",
    "title": "I'm returning my Samsung Galaxy Z Flip",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-02-27T02:12:13Z",
    "video_url": "https://www.youtube.com/watch?v=FwOp5NE7-H4",
    "category": "People & Blogs",
    "tags": [
        "Samsung",
        "Z Flip",
        "Smart Phone",
        "2020",
        "Galaxy",
        "Bend",
        "Glass",
        "Camera",
        "Selfie",
        "Best",
        "Tripod",
        "Holding",
        "Unique",
        "Half Screen",
        "Multi Tasking",
        "Notification",
        "Bixby"
    ],
    "views": 1584294,
    "likes": 54395,
    "comments_count": 3229,
    "description": "The Samsung Galaxy Z Flip finally arrived and it's time to take it for a little test flip.   Buy Samsung Galaxy Z Flip Smartphone On Amazon (Paid Link):  or On NewEgg (Paid Link):   Thanks to dbrand for sending us the phone and check them out at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://geni.us/sbBqF",
        "https://geni.us/nmiVTgv",
        "https://dbrand.com/ShortLinus",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- This is the Galaxy Z Flip, whereas I'll be calling it Z Flip. Has anybody else done that yet? - Z Flip. - Everyone has already done that, I dunno. I didn't watch anyone else's videos 'cause I didn't wanna color my impressions of the second foldable phone from Samsung or is it the third? Do we count the one that they recalled? So I'm getting it late. The reason is that Samsung didn't send me one and I had to wait for retail availability, but that doesn't change how excited I am about this device. As you guys might remember, I was a huge fan of the Galaxy Fold and the flip is just, well kind of an extension of the same concept. So the idea is that you've got a device that takes up very little space when it's folded up and then expands into something much larger. Oh wait, that's interesting. I just unfolded it and it actually has a bit of a curve to it. You know, I thought that that might be just a problem with my Galaxy Fold. So it doesn't fold all the way, but it might just be to do with Samsung's hinge design. Can you tell on camera that it's an open a little bit too far, man, that bugs me way more than it probably should. All right, let's go, indeed ladies and gentlemen. Really? Apple finally did away with this and now Samsung forces you to insert a SIM card in order to set up the phone the first time. No micro SD expansion, so we've just got a SIM slot here, all right. Let's restart this thing, I mean, I guess this is better than what Samsung used to do where when you put in your SIM card, it would reset the phone that you had already set up. That was really cute. Well, let's take a look at this thing. So it's got a USB type C port, it's got wireless charging on the right-hand side. They've got a side mounted fingerprint sensor, as well as a volume rocker up here. No IP rating of any sort on this thing, which kind of makes sense, it'd be really difficult to keep water out of the hinge. Dual 12 megapixel rear camera, so this is not gonna be a photography beast. And this is cool. So this is a small external display that'll tell you, you know, a notification that's coming in or whatever the case may be, and that'll allow you to flip open the phone and carry on where you left off. While we wait for this to boot up though, let's try the actual flipness of it. I was one of those people who's been using a cell phone long enough to have actually had a flip phone. And like half the reason you get one is for the satisfaction of being like, yeah, what's up, you know, hey, I'm just gonna talk on my phone and then closing it up. And I will say the sound isn't great. And the extra width actually makes it a little bit uncomfortable to do that. You know what? I'll give it a B. I wish it had a more satisfying sound on the close. It slows down a little bit as it approaches fully opening up. And part of that might be because they've designed it to be configurable in multiple spots. So that snap only happens from about here on, right? Other than that, you can kind of stick it wherever you want. It's a really cool design. I think it's still booting up. So there have already been some durability tests determining just how glass likes Samsung's flexible glasses, but can you see that? What the hell? And I wasn't even poking at it super hard though. What made me notice it was that I had just like touched it or something and I put it down and the reflection of the studio lights here made it really obvious that there's like some give to it. And then it's kind of like memory foam bouncing back up. Oh, it's super soft. All right, are we ready to set this thing up? Nice, this is a very tall display. And I don't know if part of why it seems so tall is because the hinges are on the side. It does, doesn't it? This is a really expensive phone that other than the foldness and the hinge doesn't feel that futuristic like when you're actually using it. Like, do you guys think I'm being unfair so far? Okay, 'cause I'm not trying to be unfair. Okay though, you know what? Holding these two phones in my hand while I was copying an authentication key over, the narrowness actually feels pretty good. Like it's more similar to the old candy bar style phones than I initially realized. Maybe I missed that a little bit, you know? Oh, okay, I was gonna say reaching across as quite easy, but then with how tall it is like with how top heavy it is, it's easy for it to fall out of your hand. Don't worry I got a dbrand skin on there for those incidental scars and scrapes, right? Wow, that is really high up to reach to go to like the URL bar. I can't think of anything I've ever used where I got to reach up, I have to shift my hands so much to reach that. One of the initial criticisms I heard of this thing is that scrolling over the hinge is really weird and uncomfortable. My take so far is I wouldn't normally be scrolling up that high, at least with the size of hands that I have. I wouldn't really go any higher than here. And I don't know if you can see this, but the hinge is right around here. This does feel weird in other ways though, like mobile internet was designed with 16 by nine devices in mind. And then we started getting these slightly wider ones. Just one result, just one Wikipedia article takes up. What is that? That is over a third of my display. One of the pictures on Samsung site is like multitasking on this thing. I can't even see this entire post because it contains some text and it's a retweet that also had some texts on it. Like that is not a usable experience. I go on the product page for this, and it's like, yeah, massive 6.7 inch display, it's like, you realize you're the same company that just launched the S20 Ultra at the same event. And it's a bit of a hack in the first place because measuring your screen diagonally instead of by the total screen area is sort of cheating. I mean, this is still really cool, and I'm never gonna get over this. Yeah, yeah, cool, right?. - [David] It's scrolling, wow. - Well, yeah, but it's scrolling around the bend. Look, I'm scrolling this way and they image is going that way. What, what. How much is this thing costs? Like $1500, something like that. You know what? Let's look up how much this thing costs. I actually don't know. No, okay, no, that's just like a horrible Canadian pricing. Okay, so it's 1,380. So it's a little less than 1,500 US. If nothing else, I'll say this about the price. Samsung's got a lot of guts asking more than iPhone pricing for something that doesn't even have top tier Android phone specs. So it Snapdragon 855 rather than 865, is got 8GB of RAM, 256GB of storage, just a 3300 mAh power battery. So you're gonna be using this for one day and one day only between charges. And then probably the biggest problem for me is the dual 12 megapixel cameras. Like on the one hand you're telling me this is a phone for people who are really image obsessed, because why else would it be important to you to whip out a foldable phone be like, yes, this is a hinge on the back of my phone, but I don't care about having a good camera. I mean, I shouldn't say it's not good without actually trying it. So let's go, we've got our double tap to open the camera and hey Andy, how you doing? Yeah, what does this, what is this? We got two guys doing the work and then two of them to watch. Wow, it's got this white balance way off, you notice that? Stay within three feet of the subject. These live bulkhead effects are still so bad. I gave it the best possible case scenario, a box. And it still manages to have this part of the table in focus for no apparent reason and manages to blur this line. Like, what is this? This is one of their pitches. Whether it's for video calling or for just like taking selfies, is being able to put your phone in front of you like this and just be like, oh, look at that. That would be pretty cool for video calling. The one problem I had is they've also got shots on their site of people holding it like this for video calling that is not ergonomic at all. This is way better, that was smooth though. That animation going from folded mode to full screen mode, me like it. Maybe we can get rid of some of that beauty smoothing. I don't need no more beauty. I am beautiful enough without the beauty smoothing. Thank you, sir. Let's give it another chance without any filters. Look at how much fun am having, that's what you're supposed to do for a selfie, right? Yeah, that's not great. It's not terrible, it's like fine. Look how much keyboard this is. And it's so narrow, my thumbs are almost too close sometimes it's the opposite problem you have compared to when you're like typing on a tablet or something. Wow, and when you're watching video vertically, I mean, I guess if you're super into the YouTube comments, I confess I am the kind of person who will occasionally watch a video in vertical mode, just because it's a little bit more ergonomic. That is so little video on the screen. I mean, this is good though. Lots and lots of YouTube comments to read. So this is 22 by nine which actually is very, very close to the standard cinema aspect ratio. So that's why it was really hard for me to tell if it was cutting anything off the top, it might be, but it would be ever so slightly as long as you can get over the whole punch, which I think for something this wide is much easier to forgive, that's pretty great. (upbeat music) No way, Okay, that is disappointing. The wide aspect ratio screen was giving me an argument for watching movies on the go on this thing until I realized that's not an amplified ear piece. So it's mono audio just from the bottom firing speaker on this side here. There's no question that the cool factor is there. My problem is that with the fold, I had this compelling argument to make, if you needed a bigger screen, but only had a pocket to keep it in, this was your solution. So it was kind of like the laptop that way, it took a computer and put it in your backpack. And then the fold took a tablet and it put it in your pocket. Well, this takes a phone and puts it in your pocket, but just instead of being long and thin, its shorter and thicker. This is a last gen device, is a Note9, so it's actually very similar in terms of spec, but I am getting more screen for my dollar and actually more features things like the S pen. Let me know in the comments, if you want it to get the full LTT experience. But for now I think the flip is just one of those milestones along the way, two devices that make a lot more sense than it does. Thanks for watching this episode of Short Circuit, make sure you are subscribed. This is a different channel in Linus Tech Tips. So you have to subscribe to it separately. It's hard, I know, but you can do it. It's like just move that mouse hand, get that sheet dust out of the way, click, you got this. By the way, I just wanna shout out dbrand they didn't sponsor the video or anything but they did get us the device with our LTT orange and black colors on it. I don't know if they knew we were not gonna do a video on the LTT channel with it, but it was good effort you guys, thank you, you can check them out at dbrand.com below",
    "transcript_keywords": [
        "phone",
        "Samsung",
        "Flip",
        "thing",
        "Galaxy Fold",
        "video",
        "yeah",
        "bit",
        "Fold",
        "screen",
        "hinge",
        "kind",
        "cool",
        "flip phone",
        "Galaxy",
        "put",
        "video calling",
        "scrolling",
        "Samsung hinge design",
        "Samsung hinge"
    ],
    "transcript_entity_values": [
        "1,380",
        "Linus Tech Tips",
        "22",
        "SIM",
        "One",
        "RAM",
        "1500",
        "one",
        "US",
        "USB",
        "8",
        "3300",
        "12 megapixel",
        "the S pen",
        "like half",
        "Andy",
        "nine",
        "second",
        "LTT",
        "Samsung",
        "third",
        "865",
        "256",
        "first",
        "Wikipedia",
        "16",
        "three feet",
        "two",
        "Canadian",
        "6.7 inch",
        "Android",
        "one day",
        "Short Circuit",
        "12",
        "Galaxy Fold",
        "the S20 Ultra",
        "the Galaxy Fold",
        "YouTube",
        "Apple"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "EVENT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "NORP",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.14604274928569794,
        -0.018198175355792046,
        0.05798754468560219,
        -0.026694947853684425,
        0.03941517323255539,
        -0.009665672667324543,
        0.019846031442284584,
        0.11616877466440201,
        0.007940088398754597,
        -0.007669528014957905,
        0.03775797784328461,
        0.06915108114480972,
        0.04772109538316727,
        -0.0048814937472343445,
        0.03666181489825249,
        -0.06159260496497154,
        0.02187049761414528,
        -0.02336329035460949,
        -0.08238925784826279,
        0.019409963861107826,
        0.03794294223189354,
        -0.03657251596450806,
        0.06050121411681175,
        -0.015708040446043015,
        -0.013872403651475906,
        -0.041461504995822906,
        -0.062025539577007294,
        0.018622277304530144,
        -0.003551082219928503,
        -0.022648775950074196,
        0.06639551371335983,
        0.14664846658706665,
        0.01817956380546093,
        0.0007133365143090487,
        -0.027225686237215996,
        -0.11365735530853271,
        -0.01579395681619644,
        -0.043742984533309937,
        -0.0026293203700333834,
        -0.024240681901574135,
        0.0275335181504488,
        -0.014594233594834805,
        -0.00820233765989542,
        -0.0014101442648097873,
        0.007478052284568548,
        -0.019153999164700508,
        0.04694492369890213,
        -0.004974483046680689,
        -0.04149264469742775,
        0.03008154220879078,
        0.03127700835466385,
        -0.0006635812460444868,
        -0.013580280356109142,
        -0.0040125795640051365,
        -0.060479965060949326,
        0.09841209650039673,
        0.018900683149695396,
        -0.03961428627371788,
        0.023827945813536644,
        0.04465745389461517,
        0.09021082520484924,
        -0.08409508317708969,
        -0.04562437906861305,
        0.048061616718769073,
        -0.00921742245554924,
        0.017279649153351784,
        -0.034402795135974884,
        -0.08449534326791763,
        0.0028923158533871174,
        -0.026887135580182076,
        -0.023683134466409683,
        0.002099644625559449,
        0.07356026768684387,
        0.1036578044295311,
        -0.023828670382499695,
        -0.007286072243005037,
        0.1364925652742386,
        -0.050352856516838074,
        -0.09319692105054855,
        0.011271697469055653,
        0.04839970916509628,
        -0.07456757873296738,
        -0.03795062005519867,
        0.02538267709314823,
        0.05915665999054909,
        -0.009364919736981392,
        -0.007942978292703629,
        0.10093323141336441,
        -0.0432010143995285,
        0.001856100163422525,
        2.1739806470577605e-06,
        0.11443350464105606,
        0.020240798592567444,
        -0.03806357458233833,
        -0.020540306344628334,
        -0.020424392074346542,
        -0.028513919562101364,
        -0.030183613300323486,
        0.014915469102561474,
        0.03175659850239754,
        0.04805374518036842,
        0.034891098737716675,
        0.12980659306049347,
        -0.034002795815467834,
        -0.009504229761660099,
        -0.06541517376899719,
        -0.0018721285741776228,
        0.042697079479694366,
        -0.05614166706800461,
        0.047742873430252075,
        -0.01780039817094803,
        0.01728249527513981,
        0.0780695304274559,
        -0.02647346258163452,
        -0.05657926946878433,
        -0.0022821221500635147,
        -0.035385530441999435,
        0.029648086056113243,
        0.02330911159515381,
        0.019045529887080193,
        0.019838660955429077,
        0.05818111449480057,
        0.0005277992459014058,
        -0.12007906287908554,
        -0.008890622295439243,
        0.04567303881049156,
        -0.015713678672909737,
        2.540461676936827e-33,
        -0.02690780907869339,
        0.14757338166236877,
        -0.072720967233181,
        -0.027648361399769783,
        -0.026727305725216866,
        0.06722795963287354,
        0.0029303235933184624,
        0.013786964118480682,
        -0.10566233098506927,
        0.05110573396086693,
        0.015957990661263466,
        0.05173132196068764,
        -0.009783339686691761,
        0.016301190480589867,
        -0.1020335704088211,
        -0.003805900225415826,
        -0.053751952946186066,
        -0.02491692639887333,
        -0.04900099337100983,
        0.005523461848497391,
        0.06935115158557892,
        -0.0028849192894995213,
        0.03381505236029625,
        -0.009614751674234867,
        0.011900720186531544,
        -0.022634973749518394,
        0.018688887357711792,
        -0.06585429608821869,
        0.058841604739427567,
        -0.0005760228959843516,
        -0.06327498704195023,
        -0.024454878643155098,
        0.027955634519457817,
        -0.07461877167224884,
        0.04089939966797829,
        0.021872572600841522,
        0.03854542225599289,
        -0.11999361962080002,
        0.0025025864597409964,
        -0.05064699798822403,
        -0.003809316549450159,
        0.04198399931192398,
        -0.11413112282752991,
        0.05904117226600647,
        -0.03825601562857628,
        0.051837753504514694,
        -0.0031178100034594536,
        -0.018431900069117546,
        -0.013235955499112606,
        -0.053365305066108704,
        0.029026754200458527,
        -0.027166040614247322,
        -0.09543377161026001,
        -0.009640860371291637,
        -0.09843305498361588,
        0.030449168756604195,
        0.01812371052801609,
        -0.06190222129225731,
        0.06417343020439148,
        0.028872814029455185,
        0.009605766274034977,
        0.05208474025130272,
        -0.08441483974456787,
        0.021458273753523827,
        -0.09225901961326599,
        0.020735060796141624,
        0.051737863570451736,
        -0.02704215608537197,
        -0.0775473490357399,
        0.01953754387795925,
        0.02499270811676979,
        -0.03537175804376602,
        -0.06248113512992859,
        -0.008782166987657547,
        0.061889197677373886,
        0.009343651123344898,
        0.002758041489869356,
        -0.011683182790875435,
        0.04927172139286995,
        -0.04604193568229675,
        0.045770615339279175,
        -0.05694092810153961,
        0.03594205901026726,
        0.03160635009407997,
        0.028581714257597923,
        -0.022502968087792397,
        0.0024139254819601774,
        -0.07023832947015762,
        -0.0025503700599074364,
        0.00826568715274334,
        -0.054819442331790924,
        0.0012701461091637611,
        0.04630807414650917,
        -0.007164002396166325,
        -0.023884374648332596,
        -2.8036039852210657e-33,
        -0.08441856503486633,
        0.012943582609295845,
        -0.025623463094234467,
        0.015122935175895691,
        0.014734538272023201,
        -0.05843484774231911,
        0.03236021101474762,
        0.03579682484269142,
        -0.08000779896974564,
        -0.09142635762691498,
        0.015721846371889114,
        0.018969062715768814,
        0.016661323606967926,
        -0.013577204197645187,
        -0.009959247894585133,
        -0.04439423233270645,
        0.07231390476226807,
        -0.06714727729558945,
        0.0187730323523283,
        0.039726145565509796,
        0.03440936654806137,
        -0.017446042969822884,
        -0.004399436060339212,
        0.029879320412874222,
        -0.06143924593925476,
        0.03654004633426666,
        0.09586219489574432,
        0.006644308567047119,
        0.08073336631059647,
        -0.01716158166527748,
        0.027168722823262215,
        -0.05629444867372513,
        0.005805369466543198,
        0.0014438956277444959,
        0.040789514780044556,
        0.09304729104042053,
        0.0045393346808850765,
        -0.026538623496890068,
        -0.03048308752477169,
        -0.05236007645726204,
        -0.01480991579592228,
        0.00013397340080700815,
        -0.024997040629386902,
        -0.02002217061817646,
        -0.019996292889118195,
        -0.08296208083629608,
        -0.02271241694688797,
        0.042000748217105865,
        0.0008579970453865826,
        -0.010172316804528236,
        -0.04270007088780403,
        0.030580006539821625,
        -0.00881868600845337,
        -0.003161917207762599,
        -0.015283253975212574,
        0.0278614591807127,
        0.051307763904333115,
        -0.0718526840209961,
        0.0823541209101677,
        0.013094192370772362,
        0.03697144240140915,
        0.007106949109584093,
        -0.030037779361009598,
        -0.13027706742286682,
        0.007438231725245714,
        -0.03306364640593529,
        0.11647529900074005,
        -0.06783313304185867,
        -0.022500839084386826,
        -0.0038623525761067867,
        -0.03402108699083328,
        0.043040093034505844,
        -0.04284864664077759,
        -0.14340047538280487,
        0.023922821506857872,
        0.1032615602016449,
        -0.08989237248897552,
        0.03315865248441696,
        -0.0385783389210701,
        -0.04348445311188698,
        -0.01728537678718567,
        0.0007520433864556253,
        0.07977300882339478,
        0.049677785485982895,
        0.06509927660226822,
        0.007370450999587774,
        -0.04449363425374031,
        0.00572422007098794,
        -0.008119205012917519,
        0.021291637793183327,
        -0.0548054501414299,
        -0.008834779262542725,
        -0.033435944467782974,
        0.07807768136262894,
        0.032185930758714676,
        -5.2677957995683755e-08,
        0.0008497607195749879,
        0.02540355548262596,
        0.10589632391929626,
        0.042516086250543594,
        0.01485343649983406,
        -0.004075076896697283,
        0.012986350804567337,
        -0.08136358857154846,
        0.047084320336580276,
        -0.03277166187763214,
        -0.0354234017431736,
        -0.048367779701948166,
        -0.06781412661075592,
        0.09505084156990051,
        0.049103908240795135,
        0.056508418172597885,
        0.023863743990659714,
        0.03858388587832451,
        0.013950425200164318,
        0.05675359070301056,
        -0.028503194451332092,
        0.04713349789381027,
        0.06446880847215652,
        -0.05123845860362053,
        0.04365555942058563,
        0.010467218235135078,
        -0.05086049064993858,
        0.04771508276462555,
        0.0616752915084362,
        -0.07535549253225327,
        -0.025875383988022804,
        -0.03773846849799156,
        0.018120290711522102,
        -0.022323766723275185,
        -0.01970369927585125,
        -0.08227202296257019,
        -0.026361605152487755,
        -0.03458262234926224,
        0.09734626114368439,
        -0.0026945811696350574,
        0.09107519686222076,
        0.006644207052886486,
        0.023094477131962776,
        0.09790556877851486,
        -0.04346615448594093,
        -0.047365497797727585,
        0.047527726739645004,
        -0.10054033994674683,
        0.0291452594101429,
        0.029927389696240425,
        -0.052059102803468704,
        -0.13906075060367584,
        -0.029885398223996162,
        0.08680132031440735,
        0.08538644760847092,
        0.043290432542562485,
        0.029792863875627518,
        0.03116695210337639,
        -0.010743971914052963,
        0.05571747571229935,
        0.030213408172130585,
        -0.09401950985193253,
        -0.09828248620033264,
        0.04387082904577255
    ]
}