{
    "id": "FwSNe2sQcg4",
    "title": "100 GbE network configuration // Aruba Networks Ep. 1",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2021-09-22T15:41:18Z",
    "video_url": "https://www.youtube.com/watch?v=FwSNe2sQcg4",
    "category": "Science & Technology",
    "tags": [
        "aruba",
        "aruba networks router setup",
        "aruba networks training",
        "aruba networks youtube",
        "aruba networks router how to connect",
        "aruba 6300M",
        "aruba 6300m",
        "aruba 6300m stacking",
        "aruba 8300",
        "hp",
        "hpe",
        "100gbe",
        "100g ethernet",
        "ethernet",
        "network switch",
        "networking",
        "aruba networks",
        "aruba 8360",
        "aruba networking",
        "ethernet switch",
        "arubaos-cx",
        "aruba switches",
        "hpe switches",
        "hp switches",
        "aruba switches configuration",
        "aruba switches review",
        "aruba switches commands",
        "aruba switches vs cisco"
    ],
    "views": 32732,
    "likes": 1184,
    "comments_count": 116,
    "description": "Learn how to configure Aruba switches. In this video I'll show you how to configure multiple switches using the Aruba CLI.  Big thanks to Aruba Networks for sponsoring this video!  Menu: 0:00  Welcome 0:21  Physical network setup 0:42  SPFs 1:34  Fiber break out cables 2:59  100Gbps DAC cable 3:28  Server connections (100Gbps) 4:31  Client connection options 6:10  Console connections 7:25  Putty setup 8:25  Login to switch console (8300) 9:50  Check switch interfaces 11:00  Name core switches 11:18  show lldp neighbors 12:42  Routed interfaces and OSPF 14:02  Split 100Gbps MPO interface 16:22  Configure access switches (6300M) 19:15  Issue with non Aruba SPFs 20:25  show lldp neighbors between all switches  Previous videos:   ========================= Free Aruba courses on Udemy: ========================= Security:  WiFi:  Networking:   ================================== Free Aruba courses on davidbombal.com ================================== Security:  WiFi:  Networking:   ====================== Aruba discounted courses: ====================== View Aruba CX Switching training options here:   To register with the 50% off discount enter DaBomb50 in the discount field at checkout.   The following terms & conditions apply: 50% off promo ends 10/31/21 Enter discount code at checkout, credit card payments only (PayPal) Cannot be combined with any other discount. Discount is for training with Aruba Education Services only and is not applicable with training partners.  ================ Connect with me: ================ Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    aruba aruba-cx aruba cx aruba app aruba-cx app aruba iphone aruba android aruba 8360 aruba 6300 aruba networks aruba networking abc networking aruba 6300m aruba instant one hpe hp hpe networking aruba mobility aruba security training free aruba training clearpass clearpass training hpe training free aruba clearpass training aruba networking  aruba networks abc networking  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #arubanetworks #aruba #arubacx",
    "description_links": [
        "https://davidbombal.wiki/arubanetworks",
        "https://davidbombal.wiki/arubasecurity",
        "https://davidbombal.wiki/arubamobility",
        "https://davidbombal.wiki/freearubacourse",
        "https://davidbombal.wiki/dbarubasecurity",
        "https://davidbombal.wiki/dbarubamobility",
        "https://davidbombal.wiki/dbarubanetworking",
        "https://davidbombal.wiki/arubatraining",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal"
    ],
    "transcript": "- This is one of multiple videos where I'm gonna show you how to build a network using Aruba switches. In a previous video, which I've linked here and below, I showed you physical cabling types. So I explained about QSFP such as this one that support 100 gig. In this video, I'm not gonna talk too much about the switches and the different types of SFPs that you get. I'm gonna simply build this network. So the first thing I'll do is take this QSFP28, plug it in there. We'll take another one for my second switch. This is a Aruba 8361, this is Aruba 8362, and I'll plug in the second QSFP, so there you go. Now in my topology, I'm connecting the two 8360s using a DAC cable, and then I'll use fiber to connect them to the 6300s. However, this is a different interface to this. This is QSFP28. This is SFP28. So what I'm gonna use is the breakout cable. So here's my first SFP28, plug one in there. I'll plug another one in there, and I'll do the same for the second switch. Basically, we need connections from these two core switches to these two access switches if you like. Now, this topology isn't following an exact design. I just wanna show you how to configure the Aruba switches. So I've got my two SFP28s in the two 6300s, and then I've got QSFP28s on the 8360s. So I'll plug this one in there, and then I'll use cable 1 and cable 2. This is a breakout cable. So you can see one cable breaks out into four cables. So I've got the option of using cable 1 and cable 2, so I'll take the covers off one and then take the covers off here. Two in there. So the other two cables I won't use. I could add extra redundancy in this topology, but once I've shown you the basic commands, it'll just be repeated. So I won't do that. So on this one, is an example, plug that in, can hear it clicks in, there's my breakout cable. So I just got to choose the right cable 1 and 2, and then we'll take one like that in, clicks in, take 2, plug that in and it clicks in. So I have now got two 8360s connected with 100 gig ethernet to two 25 gig ports on the 6300 M's. I could bond these together to get 50 gig, but in this case, it's two 25 gig, two 100 gig. Now for the connection between the two 8360s, I could use 100 gig DAC cable like this. So this is QSFP28, 100 gig, and I could connect them like this is an example. So there you go, 100 gig from one switch to the other, and then I've got a connection from the 8360s to the 6300s. Now I've got one server here with a Mellanox, ethernet card. And what I could do is connect the 8360 directly to the Mellanox ethernet card in the PC. I've also got another one over here. I won't run this in the room, because of the noise. So what I'll do is move these pieces out of this room, but hopefully, you can see there I've got my network card in the server and I've got something similar over here. So what I would do is do something similar with this DAC cable, and I will connect that to the second server. But again, I'm not gonna run this on my desk, it'll make too much noise. Be easier, if I move this out of the room. Now there's my server connections. I've got a connection between the two switches, switches connecting to the access switches. For the clients, multiple options. So as an example, I could use SFP such as these, this is a copper SFP. So I could connect that in here, connect another one here as an example. That gives me 10 gig, or I could use a fiber SFP such as this. Aruba switches will allow you to use third-party SFPs, as long as you upgrade the firmware to a later release and you are limited to 10 gig, but there you go. I'll probably just use copper for the PC connections. These ports support 1 gig, 2.5 and 5 gig. I'll use laptops for the client connections, but I could connect this to a client PC and give it 5 gig. These connections will give 1 gig for my PC connections. And then, I've got these SONET devices that gives me 10 gig two USB3 port. So as an example, I could run this on my Mac and get 10 gig. I've got those two 10 gig ports on the switches, and I've also got a whole bunch of connections here for clients. There's our physical topology. Now I can connect to the consoles of these switches and configure them. Notice I have multiple console ports here. What I'll probably do is just use my client PCs with console ports directly to the switches. So as an example, just use a USB cable on the PCs to configure the switches. Okay, so let's do that. I'll move the devices out of the room and then configure them remotely. (upbeat music) Okay, because of all the noise that those switches generate, I've moved them to another room. What I've done once again, is cable up the network as follows. What I've also done is take a Dell laptop and an ASIS laptop, and I've connected those laptops to the consoles of the switches. So the Dell laptop is connected to the console port of both of the core switches. The ASIS laptop has got a USB connection to the consoles of the 6300s. So basically, all I did was take a USB connection and connect it from the console to the laptops. Have a look at this video if you wanna see how to connect to a Aruba switch using a console port. Basically, all you need is a USB connection to the console. So I've done that. That means that I can connect remotely to these laptops and configure the switches. Okay, so here's my Dell remote connection. I'm controlling the Dell and the ASIS laptops from my Mac using screen-sharing. On the Dell computer, I'll go to Device Manager. What you'll notice is under Comports, we have two serial devices that have been discovered. What I can do now is download PuTTY. And all I need to do is download this executable. It's a very small file. 1.2 Meg in size. I've actually pre-downloaded that so I can simply run the software. I've also pinned it to my taskbar here. So if I click on that, it'll run it again. And all I need to do now is specify the comport that I'm gonna connect to. The speed here is 115,200, rather than 9,600, which you'll find perhaps on other vendor devices. COM3, click Open, and what you'll notice is I'm prompted to login. What I'll do is change the settings to make it easier to read. So I'll set this to 18 bold, and as you can see there, copyright is HP Enterprise Development. We can register products on the Aruba Network's website. Default login is admin. Password is blank. And what I've done now is connected to the console of the switch. You can see this as an 8360 switch, show version will give me version information. Once again, we can see the version of software. I'll show you in a separate video, how to upgrade the software. You probably wanna upgrade it to the latest release, but that's fine for what we're doing here. Show run shows me the running configuration. You can see it's using a ArubaOS-CX. We can see some very basic information such as the management port being shut down. I'm not connecting to the management port, I'm simply using the console. Back in Device Manager, I can see that I've got COM4 as another connection. So I'll right-click here and open up a new session. We're gonna go to COM4, speed will be 115,200, press Enter, and notice I'm prompted once again to log in. Now I haven't changed the default settings in PuTTY. You can do that if you want to, but that's fine for this lab. I've got two Aruba-CX switches. So again, login username is admin. Password is blank. I've now been able to log in to this device. Show run, shows me that it also has a very basic configuration. Show interface brief on the second device shows me that I've got some DAC cables connected to the device. I've also got the QSFP28SR4 interfaces are down at the moment. On this one show interface brief. This one has one DAC cable connected at the moment and a QSFP28. The reason I did that is so that I can make sure which device I'm connecting to. So in my stack of four switches, this is actually the top one in my topology. That will be this switch. So to make it easier for myself, I'm gonna close the connection to COM3 so that I have the first switch on the left and second switch on the right when I run PuTTY. So COM3 115,200. Now some of you might say, I should use a different product, like SecureCRT or Solar-PuTTY or something else to configure the devices. And that definitely makes it easier, but I don't need that for this demonstration. I wanna keep it as simple as possible. Okay, so one on the left on COM4. Conf t, host name 8360-1. One on the right. Host name 8360-2, end. Show LLDP neighbors. We don't see any neighbor information at the moment. And that's because the interfaces are currently shut down. So on interface, 1/1/5, this is the 100 gig DAC cable between the two switches. I'll type, no shut rather. So no shut the interface. Show interface brief again. You can see that the interface is now enabled, but status is down, it's waiting for a link. No speed at the moment, I got to configure the other side of the connection. So on the switch interface 1/1/5 with this DAC cable, no shut, end. Show interface brief. We can see that the interface is enabled and it's up. And we're running at 100 gig. Show LLDP neighbors. I should be able to see my neighboring switch, which I can. System name is 8362. Port description is this, port ID is this, chassis ID is that, local port number is this. Neighboring switch is using the same interface. What you'll notice is if you're used to Cisco, the commands are very, very similar to Cisco. So very similar configuration, as you may encounter on a Cisco switch, interface numbers vary slightly, but very similar to a Cisco switch. Now, one thing you'll notice if you type show interface brief, this interface is a routed interface. Show IP interface brief, will show me routed interfaces and you'll notice there are no IP addresses on the interfaces. These switches allow you to run OSPF, so rather than using Spanning Tree, which has its issues, you can make the infrastructure fully routed. So what you can do is put IP addresses on every interface rather than using switching. So as an example, if you had connections like this, and then having Spanning Tree forwarding on, say some ports and blocking another ports. Rather than doing that, what you can do is set up connections between all of these devices, make them routed ports, which means that you can put an IP address on every interface. So every link will be a separate sub-net. And that means that you can use the efficiency of OSPF in a topology like this, rather than relying on Spanning Tree, much better, especially in a data center. So you'd use a spine and leaf topology where the core devices are connected to the access devices, rather than having connections like this. Before I change the type to switched rather than routed, let's configure this interface. That interface is the single MPO, 100 gig interface that's connected to the SFPs on the 6,300 switches. And what I need to do here is go onto the interface and I need to use the word split, to split the cable. So we told that this command would disable the specified port, clear its configuration and split it into multiple interfaces. The split interfaces will not be available until this system or line reboots. So notice what we have. We have a single interface, 1/1/9. I'm gonna set that to yes, type do show interface brief, but notice now, I have 1/1/9:1. I have four interfaces now, because I'm splitting the single 100 gig interface into four using that breakout cable. If I try and configure that interface, so for instance, no shut the interface, do that for the second interface, show interface brief, notice the system requires a reboot. So what I'll do is write the configuration, so write mem rather than write meme, save the configuration, and then I will boot the system. Do I wanna to continue? Yes, I do. So the switch is now rebooting. Okay, on the second switch, I need to do something similar. Once again, show interface brief. We can see that this interface is routed, it's shut down. So what I'll do is go onto that interface, type split, so yes, do show interface brief. We can see the full routed interfaces now. So interface 1/1/9:1, no shut. Do the same on the second one. No shut, end. Show interface brief. You can see that once again, a reboot is pending. So write mem. Boot system. Yes, to reboot. Okay, so what I've done now is do some basic configuration on the two core switches. Let's configure the two 6300s. They are once again, connected via the console cables to PC2. Okay, so this is my ASIS laptop. Right-click Device Manager. I see two comports, COM4 and COM6 on this laptop. I've downloaded PuTTY, connect to COM4, 115,200 is the speed. Press Enter. And as you can see, I'm connecting to a 6300. I'll make this font slightly smaller. This is a bit too big. So I'll make that 16. Username is admin. Password is blank. Okay, so show run. Bunch of configuration on the switch. Show version. This one is running 10.06.0110. Show interface brief. Now you can see that port 1 has a gig connection that's actually the connection to this PC. So you can see that we connected at 1 gigabits per second. These switches support 1 gig, 2.5 and 5 gig, but it's negotiated to 1 gig there. And scrolling down, we can see that they are two SFP28 SRS in ports 49 and 51. And then we've got a 10 gig port. You can also see that the interfaces are currently up. So show LLDP neighbor. We've got a connection from this switch to 8362. So this is actually my second switch. So host name 6300-2. Show run, will show me the configuration of the switch. You can see that routing is not enabled on the ports of this switch and all ports on VLAN 1. So if I type show IP interface brief, no IP addresses are displayed, but show interface brief, shows me all the ports. Okay, so let's have a look at the second switch. So that's on COM6. I'll open up a new session. Connect to COM6 115,200. Press Enter. Okay, so that's a bit big. Change settings. Username is admin. Password is blank. So our host name will be 6,300-1. Show interface brief. We can see that the PC isn't connected yet. I ran out of connections on the Dell laptops. I still need to connect an ethernet connection to this port on this switch. So at the moment, this is not currently connected, but that one is connected. Scrolling down, we can see 25 gig interfaces, but notice this says unsupported SFP. You need to upgrade the operating system of this switch. So the reason why it worked on the other switch is show version on this switch, which accepts that SFP is 10.06.0110. Whereas on this one, show version, it's 10.0.4, older version of software. I need to upgrade this switch if I wanna use a non-Aruba SFP in the switch. So that's not working at the moment and we'll fix that later as we go through the topology. But what I'd like you to see is we have gig interfaces, so show LLDP neighbor. We have two connections in this example, to 8361. On the other switch show LLDP neighbor. We have two connections to 8362. It's once again, one fiber connection on the 8360s breakout cable, two of them are connected to each 6,300 as shown in this topology. So it's actually one cable over here, two over there, one cable there, two here. So this is taking a lot longer than I expected, but I'm trying to go slow and methodically so that you can see all the details. Not all of us get the opportunity to work on 100 gig and 50 gig and 25 gig. So I've got a 100 gig interface here, that's a DAC cable. We can see that once again by logging in to one of the 8360 switches. So show interface brief, 100 gig QSFP28 DAC. And then we've got 25 gig down to the 6300s. So in other words, this is two times 25 gig, and here we've got two times 25 gig. At the moment, those are separate connections, but we could bond them together to get 50 gig as an example. Okay, so I'm gonna end the video at this point, because it's getting very long. This is a series of videos. So I'm gonna show you a whole bunch of configuration. Let me know if you enjoy watching me build this network. (upbeat music)",
    "transcript_keywords": [
        "interface",
        "Show interface",
        "gig",
        "show",
        "switch",
        "switches",
        "cable",
        "DAC cable",
        "connection",
        "interfaces",
        "DAC",
        "connect",
        "Show LLDP",
        "gig DAC cable",
        "ports",
        "port",
        "connected",
        "gig interface",
        "Aruba",
        "Aruba switches"
    ],
    "transcript_entity_values": [
        "first",
        "COM4",
        "USB3",
        "Solar-PuTTY",
        "1/1/9",
        "6300-2",
        "USB",
        "1.2",
        "8360-1",
        "1/1/9:1",
        "1 gigabits",
        "SRS",
        "25",
        "two 8360s",
        "8360",
        "third",
        "Cisco",
        "QSFP28SR4",
        "One",
        "two",
        "four",
        "8362",
        "8360-2",
        "two 25",
        "Dell",
        "2",
        "8361",
        "second",
        "non-Aruba SFP",
        "ASIS",
        "COM4",
        "1/1/5",
        "Mellanox",
        "Conf",
        "IP",
        "PC2",
        "Mac",
        "Spanning Tree",
        "HP Enterprise Development",
        "Aruba",
        "one",
        "OSPF",
        "6,300",
        "DAC",
        "49",
        "8360s",
        "MPO",
        "115,200",
        "Cisco",
        "51",
        "Two",
        "100",
        "VLAN 1",
        "Spanning Tree",
        "ASIS",
        "COM3",
        "the 6300 M's",
        "1",
        "the Aruba Network's",
        "5",
        "9,600",
        "1/1/5",
        "SFP",
        "16",
        "2.5",
        "10",
        "18",
        "50"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "NORP",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "NORP",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        0.020253466442227364,
        -0.11718026548624039,
        -0.08984936773777008,
        -0.06122150644659996,
        -0.009881635196506977,
        0.016275353729724884,
        -0.019527703523635864,
        -0.018030621111392975,
        -0.16147065162658691,
        0.1073143407702446,
        0.026694145053625107,
        0.026256417855620384,
        -0.1703931838274002,
        -0.02821432054042816,
        -0.047761220484972,
        0.08230960369110107,
        0.04902761057019234,
        -0.133579820394516,
        0.03689507022500038,
        0.028031935915350914,
        0.06995437294244766,
        -0.13278214633464813,
        -0.035476744174957275,
        -0.042718008160591125,
        -0.020179947838187218,
        0.00595150887966156,
        0.027813490480184555,
        0.00040043459739536047,
        -0.08209921419620514,
        -0.05225874483585358,
        -0.015842735767364502,
        0.034270815551280975,
        3.5951704830949893e-06,
        -0.05530214682221413,
        -0.00699586933478713,
        -0.02812512405216694,
        0.00550618814304471,
        -0.010388772003352642,
        -0.0012352816993370652,
        -0.019585363566875458,
        0.08612415939569473,
        -0.03677656501531601,
        0.0012288227444514632,
        -0.0018239669734612107,
        0.034880928695201874,
        0.008990254253149033,
        -0.0331389494240284,
        -0.000689352978952229,
        0.047637563198804855,
        -0.05076222121715546,
        -0.016983475536108017,
        0.010002958588302135,
        -0.006155398674309254,
        -0.039668306708335876,
        0.06711681932210922,
        -0.006295326631516218,
        -0.006796183064579964,
        0.015306088142096996,
        0.04786764457821846,
        0.036563437432050705,
        0.005016729701310396,
        -0.011615898460149765,
        -0.07776768505573273,
        -0.0279844980686903,
        0.009368379600346088,
        -0.011427409015595913,
        0.07685993611812592,
        0.08068252354860306,
        -0.06158659607172012,
        -0.01437024399638176,
        -0.005592891946434975,
        0.02500186488032341,
        -0.008478661067783833,
        0.02855832129716873,
        0.0008330225246027112,
        0.08929082751274109,
        0.0928509533405304,
        0.019070642068982124,
        0.025810683146119118,
        -0.10144512355327606,
        0.01275406964123249,
        0.055802084505558014,
        -0.03188777342438698,
        -0.043135594576597214,
        -0.008266996592283249,
        -0.05861412361264229,
        -0.024317165836691856,
        -0.056233000010252,
        -0.002683802507817745,
        -0.057960182428359985,
        0.003782168962061405,
        0.029596954584121704,
        -0.024188661947846413,
        0.07123447209596634,
        0.07058083266019821,
        0.003224271582439542,
        -0.11154680699110031,
        -0.08580940216779709,
        -0.06642738729715347,
        -0.004986604675650597,
        -0.015751613304018974,
        -0.024977944791316986,
        0.05963972955942154,
        -0.02555595338344574,
        0.0029489665757864714,
        0.01460438221693039,
        0.05653880909085274,
        0.051908671855926514,
        -0.04370299354195595,
        0.07545975595712662,
        -0.030805565416812897,
        0.1139308512210846,
        -0.009873218834400177,
        -0.002225843258202076,
        0.016032947227358818,
        -0.011361339129507542,
        0.010864373296499252,
        0.00024005479644984007,
        0.024667056277394295,
        0.021834371611475945,
        -0.07694201171398163,
        0.005217652767896652,
        -0.031874045729637146,
        0.0032966164872050285,
        0.0075711701065301895,
        0.050891537219285965,
        0.032563403248786926,
        1.3702019126613465e-32,
        0.04512694478034973,
        0.005761047825217247,
        -0.08681180328130722,
        -0.01575545407831669,
        0.06124664098024368,
        0.018383298069238663,
        -0.006333967205137014,
        0.021090837195515633,
        -0.08896764367818832,
        0.04161214455962181,
        -0.0890793427824974,
        -0.005844439845532179,
        -0.03634252771735191,
        0.01634170301258564,
        -0.01822541654109955,
        -0.08186735957860947,
        0.09462742507457733,
        0.03929829224944115,
        0.004654249642044306,
        0.00663098506629467,
        -0.008039378561079502,
        0.001603007665835321,
        -0.012948980554938316,
        -0.023107634857296944,
        0.06451617926359177,
        0.020250657573342323,
        -0.009299371391534805,
        -0.11079569905996323,
        0.028769776225090027,
        0.0434800460934639,
        -0.00600119773298502,
        0.004343871958553791,
        -0.031156351789832115,
        0.003108836943283677,
        -0.011161571368575096,
        -0.037174567580223083,
        -0.009323730133473873,
        -0.022763298824429512,
        -0.06689795106649399,
        -0.027619516476988792,
        -0.045386072248220444,
        -0.059824272990226746,
        0.018601616844534874,
        -0.03666282445192337,
        -0.06287048757076263,
        -0.03549427166581154,
        0.03799618408083916,
        -0.02923181653022766,
        0.00252392515540123,
        0.12164729088544846,
        -0.07353074103593826,
        -0.0336931087076664,
        -0.061338454484939575,
        0.08462723344564438,
        0.039143066853284836,
        -0.06418143957853317,
        0.008664526976644993,
        0.0631420761346817,
        0.1318846493959427,
        0.10058696568012238,
        -0.009255632758140564,
        -0.006556163541972637,
        0.0023633090313524008,
        -0.026427125558257103,
        -0.011739394627511501,
        -0.029076553881168365,
        -0.005966901779174805,
        -0.05410439893603325,
        0.05043227970600128,
        -0.028546595945954323,
        -0.016346994787454605,
        -0.01613110490143299,
        0.053816258907318115,
        0.014032102189958096,
        0.011741063557565212,
        -0.044053081423044205,
        -0.06195135787129402,
        -0.00860205665230751,
        -0.04187352955341339,
        -0.0018455862300470471,
        -0.08745037764310837,
        0.0745341032743454,
        0.034775808453559875,
        0.02916528843343258,
        0.013103083707392216,
        0.02686578407883644,
        0.05188499763607979,
        0.037762463092803955,
        -0.10773985832929611,
        0.015945101156830788,
        0.0075859855860471725,
        0.021067406982183456,
        0.06906408071517944,
        -0.05331120267510414,
        0.02834559977054596,
        -1.3301842646027157e-32,
        0.017315015196800232,
        0.011760667897760868,
        -0.02900361642241478,
        -0.0007253963267430663,
        -0.04385491460561752,
        0.03540515527129173,
        0.0411757156252861,
        0.08563500642776489,
        -0.03805842623114586,
        -0.06646565347909927,
        0.01737610250711441,
        -0.08830492198467255,
        0.019508032128214836,
        -0.07805489003658295,
        -0.005949976854026318,
        -0.09081323444843292,
        0.004845305345952511,
        -0.0688432976603508,
        0.09530483186244965,
        -0.011721260845661163,
        0.006996707525104284,
        0.05628300458192825,
        -0.03635206073522568,
        0.007434474769979715,
        -0.03506830707192421,
        -0.00021629039838444442,
        0.006790853571146727,
        0.06682911515235901,
        -0.02256023697555065,
        0.04449434578418732,
        -0.04372423142194748,
        -0.025327911600470543,
        -0.057910989969968796,
        0.08745512366294861,
        0.02819523774087429,
        0.0448916032910347,
        0.11350252479314804,
        0.14388054609298706,
        -0.11058541387319565,
        0.0005533340736292303,
        0.047534842044115067,
        -0.026581773534417152,
        -0.10025256127119064,
        -0.01212040800601244,
        -0.005674381274729967,
        0.023479672148823738,
        -0.05570393428206444,
        -0.045190297067165375,
        -0.12043007463216782,
        -0.04725337401032448,
        0.03086303174495697,
        -0.04891494661569595,
        0.008078799583017826,
        0.020329467952251434,
        -0.007718362379819155,
        -0.027750302106142044,
        -0.022650692611932755,
        0.034665729850530624,
        -0.01314074732363224,
        0.02830745093524456,
        0.1356702446937561,
        -0.09640712291002274,
        -0.08265914767980576,
        0.03932736814022064,
        0.08114825189113617,
        0.008934857323765755,
        0.03787508234381676,
        -0.04017921909689903,
        -0.001267758896574378,
        -0.011992066167294979,
        -0.07300032675266266,
        0.02833484299480915,
        -0.017904961481690407,
        -0.038321275264024734,
        -0.011294449679553509,
        -0.000629823945928365,
        0.0017175512621179223,
        0.013580230996012688,
        0.10079634189605713,
        0.02340017259120941,
        -0.06343194842338562,
        0.03531369939446449,
        -0.055175118148326874,
        0.08528891950845718,
        -0.028018934652209282,
        0.0687594786286354,
        0.06483497470617294,
        0.03071010485291481,
        0.036796752363443375,
        0.010772240348160267,
        -0.08117076009511948,
        -0.02500242553651333,
        -0.02188364416360855,
        0.03988739848136902,
        -0.008572468534111977,
        -5.965692650988785e-08,
        0.0907372459769249,
        0.05974641069769859,
        0.006345079280436039,
        0.03181391954421997,
        -0.008881093002855778,
        0.0030844281427562237,
        0.0035602962598204613,
        0.04695584252476692,
        -0.028739335015416145,
        0.06773179024457932,
        0.038255248218774796,
        0.06635025888681412,
        -0.00734708271920681,
        0.04805656895041466,
        0.07259546220302582,
        -0.006186933722347021,
        0.0032272967509925365,
        0.021021904423832893,
        -0.034090034663677216,
        0.029305418953299522,
        0.00563059514388442,
        0.023615418002009392,
        -0.06601759791374207,
        0.03592168539762497,
        0.005945098586380482,
        -0.018134310841560364,
        0.0411594957113266,
        0.047260724008083344,
        -0.02857412025332451,
        0.0066946824081242085,
        0.018958261236548424,
        -0.05222846567630768,
        -0.0028603202663362026,
        0.010383493266999722,
        0.0034954294096678495,
        0.08741158246994019,
        -0.02609241008758545,
        0.03542975336313248,
        0.03832932561635971,
        -0.009905612096190453,
        -0.06012876704335213,
        -0.13579681515693665,
        -0.03179557994008064,
        -0.04155220836400986,
        0.004244429059326649,
        -0.0015107957879081368,
        -0.05938863754272461,
        -0.006862562615424395,
        0.0037238120567053556,
        -0.011095266789197922,
        -0.025520967319607735,
        0.07886218279600143,
        -0.0183043722063303,
        -0.0018539970042183995,
        0.051328711211681366,
        -0.031419627368450165,
        -0.0018285495461896062,
        -0.07046312838792801,
        0.07876145094633102,
        0.06413500010967255,
        0.033855319023132324,
        0.004970890004187822,
        -0.17960087954998016,
        0.043291423469781876
    ]
}