{
    "id": "fXItgjTjFP4",
    "title": "Is An All Intel Gaming PC Worth It?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2023-06-29T16:10:12Z",
    "video_url": "https://www.youtube.com/watch?v=fXItgjTjFP4",
    "category": "Science & Technology",
    "tags": [
        "intel",
        "intel arc",
        "arc",
        "gpu",
        "graphics",
        "graphics card",
        "core",
        "core i7",
        "micro center",
        "microcenter",
        "gaming pc",
        "pc",
        "austin",
        "austin evans"
    ],
    "views": 247861,
    "likes": 6355,
    "comments_count": 377,
    "description": "New Customer Exclusive  $25 Off ALL Processors:  Redeem a free 128GB Flash Drive when you sign up for Early Access to Micro Centers new Indianapolis store, opening summer 2023:  Save $200 on the ASUS ROG Strix SCAR Gaming Laptop:  Submit your build, receive a $25 off coupon when approved:   Shop Intel i7-12700K 12 Core Processor:  Shop ASUS Z690-P Prime DDR5 Motherboard:  Shop G.Skill Flare X5 16GB DDR5-5600 Dual Channel Memory:  Bundle the Intel i7-12700K, ASUS Z690-P, and G.Skill Flare X5 to save $150+ :  Shop Intel Arc A750 Limited Edition Dual Fan 8GB Graphics Card:  Shop WD Black SN770 1TB M.2 SSD:  Shop DeepCool AG400 ARGB Single Tower Cooler  White:  Shop PowerSpec 650 Watt 80 Plus Bronze Power Supply:  Shop Montech SKY TWO Tempered Glass Mid-Tower Case:   Subscribe for more!  TikTok:  Instagram:  Twitter:   Chapter Titles: 0:00 Intel Inside? 0:49 PC Parts 2:31 Unboxing  3:35 Build Montage 4:36 Is Arc Good for Video? 5:48 CS:GO 6:03 DOTA 2 6:24 Apex Legends 7:06 GTA 5 7:26 CoD Warzone 2.0 8:03 Cyberpunk 2077 10:33 Is All Intel Worth It?",
    "description_links": [
        "https://micro.center/3ew",
        "https://micro.center/9xe",
        "https://micro.center/dfe902",
        "https://micro.center/a8w",
        "https://micro.center/lmb",
        "https://micro.center/8vo",
        "https://micro.center/ioo",
        "https://micro.center/d05b21",
        "https://micro.center/s7g",
        "https://micro.center/upw",
        "https://micro.center/551",
        "https://micro.center/0zg",
        "https://micro.center/eb7800",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome to our wonderful sponsors Micro Center, where I have a simple question. Is it a good idea to build an all-Intel gaming PC? Starting out with, we have our CPU. Whoa, look at that, the Core i7-12700K. One of the nice things about doing this all-Intel PC build here at Micro Center, is that they have some really good bundles going on right now. So, pairing the i7-12700K CPU with this ASUS Prime Z690-P WiFi board, and 16 gigabytes of G.Skill Flare DDR5 memory is only 350 bucks, a smooth $420 discount over MSRP. I will however be adding onto the 16 gigabytes of RAM to come with the bundle, with one additional DIMM, which I think makes a lot of sense if you are going to be utilizing DDR5. What's the point of that extra speed if you don't got those dual DIMMs to take advantage of it? - Dims dale, dima, dima, dima, dima. - The real star of the show here though are these Intel Arc GPUs. Now, I will be honest with you, I have not built a gaming PC with an Arc GPU. I want to go with the reference A750 at 250 bucks. It's easy to forget that Intel only released this first generation of their consumer GPUs a little over a year ago. And in that time span, they have made huge strides, optimizing not only for new titles, but they've even made some pretty big steps on older games as well. Next up, let's choose our SSD. For this one, we're gonna keep it very straightforward. So we're gonna go with the WD BLACK SN770. For the power supply, we're gonna go with this, the 650 watt PowerSpec. We've used these in a ton of builds before, they're semi-modular, and importantly for this system, because we're going for a little bit of the white and blue, clean aesthetic, this will fit in nicely. So with our i7-12700K, it is a quite good gaming CPU, but it also is fairly power hungry, which is part of the reason why of course it does not come with a stock cooler in the box. There are some of the larger coolers, but I actually think we could save a little bit of money, and get a little bit of a smaller cooler, like the DeepCool AG400. For our case, we do have just enough budget to get something that's relatively nice. So this is the MONTECH SKY TWO. Part of the reason why I wanna try this, is because it comes in Morocco Blue, which if you're looking for an all-Intel build, there are not exactly an enormous amount of blue case options, which if you look at it on the site, it actually looks kind of cool. It's not like the super-traditional, very saturated blue, and for a 110 bucks, it's got the four ARGB fans. It should work pretty well. Last but not least, we're gonna pick up a copy of ESET Gamer edition, and we'll be ready to build ourselves an all Intel gaming pc. Now, unlike most builds, where I go into much more depth, I'm gonna fast forward to this, because honestly, you've probably seen me build a bunch of PCs. The main thing I wanna check out first and foremost, is the Arc A750, 'cause I'll be honest, I have actually never seen one of these in person. I have seen photos of them. These stock coolers actually look kind of neat, but I actually wanna see what this thing looks like. So we have Arc A750 Limited Edition. You don't buy a GPU for the looks, most of the time. Oh, we got a little sticker, Intel, you know what they love? They love stickers. Something else I wanna do, is take a look at our case. Okay, I think this was a good call. That's a nice shade of blue. Please lay the case down, when removing the glass side panel. What's the worst that could happen? Okay, not gonna lay it down, what happens? What, that's fine, they're... Okay mom, I'll put the side of the panel down. But the most important question we have, we have to use it as our north star for today's video. Should you build an all-Intel gaming pc? And if you do, what is that experience actually like? Cut to the building montage. (upbeat music) MOARC baby, that my friends, is an Intel Arc-powered gaming PC. So, we've done some cable management. I'll say it actually looks relatively good, just a couple of these white cables I don't really know what to do with, but for the most part, I actually think that this is a pretty solid-looking system. Oh wait, I've got a Core i7 badge too. Where should I put the Core i7 badge? MOARCCORE. There you have it my friends, MOARC, MOCORE, more power baby. - And more power baby. - Now I will admit, I'm slightly partial to the system now that it's actually built, and it looks all cool and everything, but let's put this all-Intel gaming PC build to the test. So while we're about to do some gaming, one thing I do wanna try, is the encoding on this Arc GPU, because for 250 bucks, this is a big deal if you are a streamer, or if you work with large video files like we do. So right now, I've loaded up a 50-gigabyte, 14-minute ProRes 4K file, and I am now compressing it with the AV1 encoding and HandBrake, specifically using our Arc GPU. So I'm currently doing this video at 60 FPS. I'm going to, just for the sake of comparison, do the exact same thing on my MacBook. My God, look at that. On the MacBook, I'm getting six FPS, on the Arc GPU, I'm getting 60. That is wild. And keep in mind, that while this is a laptop, this is a $3,000 MacBook. Mind you, if I was using a different codec, like H.265, it would be significantly faster. So for context, we start out with a 53-gigabyte file, and I was able to compress, (Austin blows raspberries) I was able to compress that 53-gig file down to 374 megabytes, in double real time. That is surprisingly good. Look at that quality. All right, enough of this video encoding. Why don't we play some games? So we have loaded up several of the most popular games on Steam. So let's start out with \"CS:GO\" which is the most popular game on Steam, and yeah 284, 304. This is nice. This is good. (Austin laughs) I'm gonna say, thumbs-up to \"CS:GO.\" Next up, we have \"Dota 2,\" the second most popular game on Steam. Now, this while not quite as old as \"CS:GO,\" I believe this is a DX11 game, I'm assuming that this has been well optimized. Rendering, how about I just do Best Looking, I want maximum look. Maxed out settings, we're currently looking at about 120 FPS. In fact, I actually, I think we're capped at 120 FPS. Next up, let's try \"Apex Legends,\" a little bit more of a modern title, which while not massively demanding, I think it's probably a pretty good match for this system. So video, yeah, 720P. How about 1080? Thank you. Even though, this is not the most powerful GPU in the world, we paid a $1000 for this gaming PC, I'd better be able to play games 1080P max. We're the CHAMPION SQUAD. Oh no, why am I always in the CHAMPION SQUAD? So, before we drop, we're looking at about a 100 FPS. I will say that if we can keep this performance up, as we actually jump around, I will be quite content. So, even here down on the ground, the lowest I'm seeing is it's dipping to about a 100 FPS. So next up, we're gonna do \"GTA V,\" which is admittedly quite an old game, but still a game that can be somewhat taxing when you crank everything up. All right, so \"GTA V,\" we've got DX11. I'm going to basically just crank this up, 'cause there's no reason why I wouldn't. Yeah, wow, look at that. We're dipping out 35, 34, 31. Let's take a look at our settings in \"Warzone.\" So I'm gonna try quality, full screen, yada yada, yada. So, \"Modern Warfare II\" and \"Warzone\" are new enough, that they should be really well optimized. Oh yeah, look at that. I mean, dropping in, we're above 60 FPS, which is definitely a good sign. First impressions. I think we actually might be good here. I'm looking at solid 70, 80 FPS on quality settings. So I'm gonna try from, oh no, no, no, don't fall, don't fall, no, he's above me. How do I get up? (gun popping) How did I look, how many times of, what? It was like seven shots in the back, man. Next, let's try \"Cyberpunk,\" which is going to be the most demanding game, well, one of the most demanding games, period, but certainly the most demanding game that I'm gonna try on this system. Now, the thing with \"Cyberpunk\" is, this is a game that should have been optimized for the Arc GPUs, but also it's a game that can actually take advantage of some of the Arc's specific features. So, technically while I wouldn't necessarily recommend it, this GPU does support ray tracing. So, oh my God, Quick Preset, Ray Tracing Ultra. Mm, I mean it did default to Ray Tracing Ultra. Look, I'm not gonna do that, right? Yeah okay, I'm gonna do it. All right. It thinks we can do Ray Tracing Ultra, um, no, no, you know what we could do? Let's do Ray Tracing Low. I think if we could do Ray Tracing Low, I'd be very happy. Texture Quality, High. We do have Intel XeSS, much like DLSS, and sort of like a FidelityFX, it's Intel's upscaling method, where it's going to work together at the game to run the at a lower resolution, and upscale it in a way that will keep the image quality clean. When it works well, it's a slight hit to your image quality, but a fairly substantial improvement to your performance. So, ON, ON, ON, High, ON. I am surprised, \"Cyberpunk,\" we're on High Ultra almost everything. There's a couple of settings we're not like on Extreme. And Ray Tracing again is on Low, which I think is probably the right move. I don't think this is gonna work. I think that this is too ambitious, but let's give it a try. With Ray tracing on, I think you're gonna be like 30 FPS. Oh, 70 FPS, yo, so even as we run through it, I'm not seeing anything below 60. And keep in mind 1080P, pretty much high in Ultra settings across the board, the defaults. The only thing I did, was I turned the Ray Tracing down to Low, which you get, a little bit of ray tracing can make a pretty big difference. That is impressive. And you look at this compared to something like \"GTA V,\" this is so much more visually impressive. This I think is probably the best example of the theoretical performance of this GPU, because let's not forget, this Intel GPU, it is a big physical chip, and if it has the proper optimization, you should expect some seriously solid performance, well above that $250 price point. That is terrific. I'm legitimately impressed. This is the best thing that we've done so far. If this is what these Arc GPUs are actually capable of, we're barely touching 60 FPS in some of the more demanding scenes, with ray tracing enabled, man, last time I tried ray tracing on a slightly lower end card, I was getting like six FPS. Mind you, it was a significantly lower card. But average FPS, 71, minimum, 50, that is freaking awesome. Buying an Intel GPU and going for an all-Intel system is a little bit of a gamble, right? 'Cause you are betting that Intel are going to continue to improve this tech. But, so far they've had a sterling track record of constantly making improvements, and where their technology is at right now, it's pretty good for 250 bucks, man, as is, the fine deals that our wonderful sponsor Micro Center. If you're a new customer to Micro Center, if you go in-store, you can get yourself $25 off of a processor, and on top of that, you can get yourself a free 128-gig flash drive, with the opening of the brand new Indianapolis Micro Center, which I may or may not be going to very shortly. It's the first time they've opened a Micro Center in eight years. Last but not least, they also have a ton of laptop deals going on this month, which of course you can find at the links in the description. Thank you very much to Micro Center for sponsoring this video. And until next time, my friends, (case thudding) I'm pretty happy with this one, not gonna lie, pretty happy.",
    "transcript_keywords": [
        "ray tracing",
        "Ray Tracing Ultra",
        "Arc GPU",
        "Micro Center",
        "Intel Arc GPUs",
        "FPS",
        "Ray Tracing Low",
        "Arc GPUs",
        "ray",
        "Arc",
        "tracing",
        "Intel",
        "GPU",
        "Intel GPU",
        "game",
        "Tracing Ultra",
        "good",
        "Micro",
        "Center",
        "gaming"
    ],
    "transcript_entity_values": [
        "HandBrake",
        "1080P",
        "MacBook",
        "120 FPS",
        "first",
        "25",
        "374 megabytes",
        "Arc A750 Limited Edition",
        "31",
        "Quick Preset",
        "four",
        "one",
        "six FPS",
        "60",
        "TWO",
        "a year ago",
        "a ton",
        "ProRes 4K",
        "34",
        "50-gigabyte",
        "1080P",
        "only 350 bucks",
        "GPU",
        "DDR5",
        "this month",
        "six",
        "80 FPS",
        "284",
        "ESET Gamer edition",
        "250",
        "about 1080",
        "Core",
        "the Arc GPU",
        "Austin",
        "Morocco Blue",
        "DIMM",
        "Best Looking",
        "MSRP",
        "110 bucks",
        "Apex Legends",
        "about a",
        "SSD",
        "this Arc GPU",
        "Cyberpunk",
        "1000",
        "60 FPS",
        "FPS",
        "seven",
        "53",
        "today",
        "the WD BLACK SN770",
        "the 16 gigabytes",
        "Ray",
        "GTA",
        "ASUS",
        "MOARC",
        "dima",
        "304",
        "420",
        "CPU",
        "G.Skill Flare DDR5",
        "71",
        "ARGB",
        "Ray Tracing",
        "max",
        "70",
        "First",
        "Ray Tracing Ultra",
        "35",
        "720P.",
        "250 bucks",
        "RAM",
        "about 120",
        "Ray Tracing Ultra.",
        "Intel Arc",
        "AG400",
        "50",
        "ON",
        "second",
        "650 watt PowerSpec",
        "128",
        "Z690",
        "eight years",
        "Intel",
        "14-minute",
        "53-gigabyte",
        "Arc",
        "3,000",
        "16 gigabytes",
        "Modern Warfare II",
        "Indianapolis Micro Center",
        "Micro Center"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "FAC",
        "MONEY",
        "ORDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "DATE",
        "MONEY",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "LAW",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "EVENT",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.02911023050546646,
        -0.012607121840119362,
        -0.02217346616089344,
        0.008539638482034206,
        0.054702650755643845,
        0.0010929895797744393,
        0.02865641564130783,
        0.019715746864676476,
        -0.037623368203639984,
        0.0033156918361783028,
        -0.044896893203258514,
        0.04072095453739166,
        -0.025001803413033485,
        -0.03061714582145214,
        0.040661539882421494,
        0.06333538889884949,
        0.13243411481380463,
        -0.10128521919250488,
        -0.02423970028758049,
        -0.06894786655902863,
        -0.051577601581811905,
        -0.0663364976644516,
        -0.04691413789987564,
        -0.05254678428173065,
        0.0540476068854332,
        0.04153716191649437,
        0.03748524188995361,
        -0.0008978968835435808,
        -0.04786909371614456,
        -0.006711594760417938,
        -0.001222733175382018,
        0.017807625234127045,
        -0.01162225753068924,
        0.01664031110703945,
        0.05140630155801773,
        -0.05769265443086624,
        0.05386718362569809,
        -0.04214761033654213,
        -0.0005902331322431564,
        -0.04352016746997833,
        -0.08858552575111389,
        -0.04757092893123627,
        -0.005922251846641302,
        0.06863132119178772,
        0.043135710060596466,
        0.012643732130527496,
        -0.033680401742458344,
        -0.046480465680360794,
        0.03261290118098259,
        0.022538019344210625,
        0.031241215765476227,
        -0.05987296253442764,
        0.0074889385141432285,
        -0.0757220908999443,
        -0.06340982764959335,
        0.05716736614704132,
        -0.016383599489927292,
        -0.08783206343650818,
        0.015172922983765602,
        -0.06256043165922165,
        0.029109105467796326,
        -0.15601326525211334,
        -0.024078739807009697,
        0.05208916217088699,
        0.0004285845789127052,
        -0.051201801747083664,
        0.01208498515188694,
        -0.07462667673826218,
        0.01080196350812912,
        -0.005629217717796564,
        0.0119293462485075,
        0.02234796993434429,
        0.00869717076420784,
        0.030014412477612495,
        0.0006155980518087745,
        0.05435294285416603,
        0.07596731930971146,
        -0.09174326807260513,
        0.049827370792627335,
        0.0439726784825325,
        0.0532306432723999,
        -0.024162689223885536,
        0.027963701635599136,
        -0.03460126742720604,
        0.030741434544324875,
        -0.003527834312990308,
        0.04127151891589165,
        0.005550741218030453,
        0.03000566177070141,
        -0.05105495825409889,
        0.046193499118089676,
        0.037224430590867996,
        0.025182124227285385,
        -0.003043170552700758,
        -0.007112721912562847,
        0.04711131006479263,
        -0.010964234359562397,
        -0.0722496509552002,
        -0.06720685213804245,
        0.035296592861413956,
        -0.03797140717506409,
        0.0021800401154905558,
        0.10208158195018768,
        -0.005992565304040909,
        -0.00016148877330124378,
        -0.03788089379668236,
        -0.03583166375756264,
        0.05780300125479698,
        -0.04654102399945259,
        -0.026852121576666832,
        -0.05755265802145004,
        0.031420521438121796,
        -0.028173338621854782,
        0.030110366642475128,
        0.08020678162574768,
        -0.05085602402687073,
        -0.03697846457362175,
        0.0358034148812294,
        0.11118992418050766,
        0.07467134296894073,
        0.05765865370631218,
        -0.006497017107903957,
        0.018444141373038292,
        0.1134406104683876,
        -0.012403006665408611,
        -0.025720695033669472,
        -0.09742379188537598,
        1.4415810153159467e-32,
        -0.017757948487997055,
        0.11928310245275497,
        -0.03291023150086403,
        -0.11198913305997849,
        -0.008306438103318214,
        -0.013253902085125446,
        0.08402207493782043,
        -0.024337848648428917,
        0.011300407350063324,
        0.05151613801717758,
        -0.06010453775525093,
        0.0005861181416548789,
        -0.03169667348265648,
        0.07343121618032455,
        0.06242949515581131,
        -0.039437513798475266,
        0.0494849793612957,
        -0.02859538421034813,
        -0.027347369119524956,
        -0.0060607632622122765,
        0.04876946657896042,
        0.006547688972204924,
        -0.017086854204535484,
        -0.044609036296606064,
        0.005813789088279009,
        -0.00143851013854146,
        -0.050246335566043854,
        -0.007094355765730143,
        0.03757190704345703,
        0.014151331968605518,
        -0.04925784841179848,
        -0.07311078906059265,
        -0.03319545462727547,
        -0.022919200360774994,
        0.03247486427426338,
        0.011200493201613426,
        -0.015816669911146164,
        -0.08306493610143661,
        0.011215044185519218,
        -0.016526883468031883,
        -0.08093851059675217,
        0.1150616854429245,
        -0.0751672014594078,
        -0.05524306371808052,
        0.015395124442875385,
        0.00280530983582139,
        -0.04826216399669647,
        -0.06596891582012177,
        -0.024031074717640877,
        -0.009555716067552567,
        -0.1093677505850792,
        0.03388882428407669,
        -0.018137210980057716,
        0.03955698758363724,
        -0.03972814604640007,
        -0.047567956149578094,
        0.04613698646426201,
        -0.030256332829594612,
        0.1197013407945633,
        0.07787906378507614,
        -0.029812278226017952,
        -0.07343577593564987,
        -0.02438785694539547,
        -0.00032366145751439035,
        -0.05121259763836861,
        0.09916974604129791,
        0.08178406953811646,
        0.06709402799606323,
        -0.072727270424366,
        0.05156537517905235,
        0.03937201201915741,
        -0.06369943916797638,
        0.050357405096292496,
        -0.02338714338839054,
        0.03482847660779953,
        0.05078822001814842,
        -0.030182775110006332,
        -0.058262743055820465,
        -0.04951903223991394,
        -0.03300163149833679,
        -0.07126934826374054,
        0.010984442196786404,
        -0.0024803802371025085,
        0.05972028523683548,
        0.048450008034706116,
        0.05915680155158043,
        -0.002650477224960923,
        -0.013484892435371876,
        0.03967757523059845,
        -0.008386651985347271,
        -0.02022954262793064,
        0.008259744383394718,
        0.010848560370504856,
        -0.011614333838224411,
        -0.021792147308588028,
        -1.3032792560275075e-32,
        -0.0647590309381485,
        -0.014508635737001896,
        -0.02223203144967556,
        0.09594449400901794,
        -0.008884933777153492,
        0.02234603464603424,
        -0.0028230075258761644,
        -0.01452952716499567,
        -0.00275428406894207,
        -0.007884451188147068,
        -0.01984218880534172,
        0.12013259530067444,
        -0.04969550296664238,
        0.03131480515003204,
        0.0229631457477808,
        -0.04113910347223282,
        -0.03202398493885994,
        -0.08632350713014603,
        0.12360740453004837,
        -0.01638960838317871,
        0.01283114030957222,
        0.043831150978803635,
        0.017310330644249916,
        -0.035633478313684464,
        0.0002584171015769243,
        0.013685626909136772,
        -0.05604090914130211,
        -0.049558840692043304,
        0.019588638097047806,
        0.056856509298086166,
        0.04274189844727516,
        -0.00798017531633377,
        0.05434940382838249,
        0.021842094138264656,
        0.08437996357679367,
        -0.030693136155605316,
        0.05156640335917473,
        0.011164631694555283,
        0.01334672886878252,
        0.04517414793372154,
        0.03612113744020462,
        0.028920914977788925,
        -0.000897975405678153,
        0.04271388053894043,
        0.08044679462909698,
        0.06308822333812714,
        0.007627915125340223,
        -0.08592909574508667,
        0.0978236049413681,
        -0.009415939450263977,
        -0.027931777760386467,
        0.012611348181962967,
        0.01571754179894924,
        0.001577430171892047,
        -0.060225825756788254,
        -0.09350597113370895,
        0.01593194156885147,
        0.045564327389001846,
        0.012995586730539799,
        -0.07007008790969849,
        0.04370207339525223,
        0.047266874462366104,
        -0.053190868347883224,
        -0.04598329961299896,
        0.08513116091489792,
        -0.018202519044280052,
        0.047803398221731186,
        0.024041946977376938,
        -0.0118576530367136,
        -0.08904197067022324,
        -0.14339619874954224,
        -0.090480737388134,
        -0.07367958128452301,
        -0.06620187312364578,
        -0.06114642694592476,
        0.05737194046378136,
        0.05066027119755745,
        0.029959583654999733,
        0.06322670727968216,
        0.054193660616874695,
        -0.09149161726236343,
        -0.022522825747728348,
        -0.00613831914961338,
        -0.04222964122891426,
        0.022513341158628464,
        -0.09384353458881378,
        0.005629024468362331,
        -0.014242976903915405,
        -0.0526636578142643,
        -0.027994293719530106,
        -0.026130495592951775,
        0.06611689925193787,
        0.022818049415946007,
        -0.04468326270580292,
        -0.03925734758377075,
        -6.141990382957374e-08,
        0.06382583826780319,
        -0.004413187969475985,
        0.03426630422472954,
        0.04292673245072365,
        0.04717930778861046,
        -0.06561748683452606,
        0.021611057221889496,
        -0.005390100181102753,
        0.03991600498557091,
        0.041548002511262894,
        0.06734072417020798,
        -0.07993236929178238,
        -0.019095057621598244,
        -0.03274402394890785,
        -0.017902588471770287,
        0.04133051261305809,
        0.006039811763912439,
        0.050141237676143646,
        0.013494969345629215,
        0.003327967133373022,
        0.048046957701444626,
        0.0644199401140213,
        0.035909902304410934,
        -0.06970240920782089,
        -0.05017548054456711,
        0.017583604902029037,
        0.011736668646335602,
        0.020767301321029663,
        0.044002532958984375,
        0.0017022867687046528,
        -0.03137683495879173,
        -0.017137033864855766,
        0.12301456183195114,
        -0.05304579809308052,
        0.07190228998661041,
        -0.08193715661764145,
        0.03547050803899765,
        0.06303348392248154,
        0.13406218588352203,
        0.028557082638144493,
        -0.04720861464738846,
        -0.12029433250427246,
        -0.011806061491370201,
        -0.025686627253890038,
        0.010042919777333736,
        0.012998485937714577,
        -0.06499592214822769,
        -0.14405563473701477,
        0.007539487909525633,
        0.018809158354997635,
        -0.030439766123890877,
        0.012348792515695095,
        -0.016519751399755478,
        0.021451091393828392,
        0.052351128309965134,
        -0.01083647832274437,
        -0.00891345739364624,
        0.052263058722019196,
        0.05449860543012619,
        -0.005228681955486536,
        0.02547045424580574,
        -0.13782574236392975,
        -0.09920550882816315,
        -0.0013782619498670101
    ]
}