{
    "id": "fYQSOYslMi8",
    "title": "Controlling all your entertainment from a single device",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-09-04T13:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=fYQSOYslMi8",
    "category": "Science & Technology",
    "tags": [
        "home tv",
        "future home",
        "future house",
        "future technology",
        "grant imahara",
        "home of the future",
        "future",
        "home",
        "tv room",
        "tv",
        "home theater",
        "home entertainment",
        "television",
        "streaming",
        "internal speakers",
        "big screen",
        "living room",
        "netflix",
        "hulu",
        "roku",
        "amazon video",
        "sling tv",
        "youtube tv",
        "internet tv",
        "prefab house",
        "prefab",
        "smart home",
        "smart house",
        "modular home",
        "construction",
        "the future",
        "real estate",
        "house",
        "smarthome",
        "new technology",
        "new tech",
        "technology",
        "gadgets",
        "tech",
        "how to",
        "verge",
        "the verge"
    ],
    "views": 276825,
    "likes": 4529,
    "comments_count": 310,
    "description": "Never before have we had so many options for entertainment at our fingertips, but all of this content is also spread across different devices, apps and streaming services. Grant Imahara will see if our Home of the Future can succeed in bringing all of those into one universal entertainment system.  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(upbeat music) - It would be easy to argue that we're in the golden age of entertainment. Never before have we had so many options at our fingertips. But with all these possibilities the modern home is faced with a number of problems. Contents spread across multiple devices. Different apps and various streaming services. Our home of the future should be able to bring all of these options together into one simple and intuitive interface. That should be fun to use as well. So. How do I turn the TV on? Alexa? (upbeat music) Look, there's a lot of components that go into modern entertainment systems. There's the TV speakers gaming consoles streaming devices even virtual reality headsets. That's a lot of power ethernet and HDMI cables to wrangle. The challenge for our technology intergrader Pete Sandford and his team is to make all of that disappear. - The goal when you have a system like this is to masquerade as much as possible. To make it real clean. So we've got everything hidden. All the speakers are in the ceiling. We've got a ROKU in here. A PlayStation 4. A Nintendo Switch. Our surround sound receiver powering all of our speakers and subwoofer. And Sonos for music management. - All of the wiring is connected inside this credenza. And runs straight to the back of the TV. When it's turned off the TV doesn't have to be a rectangular eyesore on the wall. We can program it to display a piece of art seamlessly folding into our interior design. (upbeat music) There is one thing that has disappeared though. Which to be honest threw me off the first time I sat down to use the TV. There's no remote. It's not just hidden. It's gone. At home I've got a draw, you know, in my... - We've all have that draw. - Yeah. (laughs) And it's got, like six remotes in there. - Yeah. - And then, you know, when you want to do something you have to open up the draw like, okay this plug and then this mode and... - Yeah, we remove all of the stock remotes cause it will force the clients to adapt to their new system. But it will also prevent them from hitting a button that might put them in the wrong mode. Or cause them to lose audio. Or lose video. And things just get out of sync. So you're really making the system more efficient. And forcing the client to just dive right in and learn how to use it the right way. (upbeat music) - This iPad is running a system called RTI. And besides controlling our entertainment system it's built to control all the functions of our home. - So here we are. This is your remote. - Okay. - So we'll be able to do everything. And operate all of those individual pieces of equipment just using this one interface. So since we're in the living room we'd go ahead and choose that icon. And then we have our list. Like choose Netflix and it will go right into Netflix. And we can then go in and chose the options that we have here for viewing. - There's a lot of button pushing here. And this is the home of the future. - Yeah. - I feel like I should be able to do something like voice control. - Oh yeah. - Can I interface that way? - Yeah. And there's a lot of options for voice control. We built a page here under the icon Amazon Alexa just to kind of give you a few examples. Alexa, tell Home Butler to set the living room to Hulu. - Okay. Living room to Hulu. - And now we're watching Hulu. - Since everything is connected though this one system it does allow for what's known as macro commands. So I can say hey Alexa tell Home Butler to set the living room to movie mode. Which will turn your TV to Netflix. While dimming your lights and kicking your AC on. And in our limited experience playing with it the controls work well. But currently the ROKU API doesn't allow you to simply say play the next episode of your favorite show. You end up still needing to poke though some sort of virtual remote control on the iPad. And to be honest using the system for the first time felt pretty clunky. The iPad is just a lot more cumbersome than traditional remotes. Now it is possible to install RTI on your phone. But the much smaller screen means you'd only have a few of the buttons easily accessible for your smart home. While it's important to bring all these controls into one system I think the next step for the future is designing a more seamless experience. One thing our universal remote does excel at is how we play music throughout the house. The best feature. Knowing where the limits are. - We've created a shortcut page here on our RTI app. So the left side we've got our different areas. We've got our bedroom. Our Atmos surround sound system in the living room. Our office play one. And then our Sonos connect. Which is feeding all our outdoor patio speakers. - I see a lot of what look like radio stations on here. But what if I have my own personal playlist? - So this is really just your shortcuts right? So if you were our client we would have that as a shortcut on here. Your favorite playlist. Your favorite stations. But we're not gonna try and rebuild what Sonos has already done. So over here we put this little Sonos button. Which if we press that it pulls us right into the Sonos app. And it's nice cause it's very intuitive. Very easy to use. And this is where you would get all of that additional detail that you're talking about. A specific playlist. Music stored physically on a device that's on the network. - Right. That's what I do. I download all of my music. I like to keep it with me. Sonos does for our music what's still missing for our video. It brings all of our media and streaming services into one intuitive and seamless interface. Partly thanks to its open API. That's a big reason why we chose it over other sound systems. It even has solid Alexa support. So using voice control feels like a complete experience. And it allows us to play different media in different rooms all at the same time. Including outside. (upbeat music) - Here in our outdoor patio zone we have music only. So there's no AV out here to worry about. But this is probably going to be the area where people entertain a lot. - Okay. - So we did a real nice outdoor audio system here. Full range speakers. I think you're really going to like it. - Alright. Play some of the royalty-free music. - Yeah. (laughing) (upbeat music) Sounds good right? - That sounds amazing. - Yeah. That's all full range. So you're getting a lot of bass. Whereas normally you would not get this much bass. - Look I know it's hard to get a sense of this from just watching the video. But having this bass sensation indoors is something I'm used to. Having it outdoors in a garden is a totally new experience. (upbeat music) That full range bass is thanks to this weird mushroom-shaped device sticking out of the landscape. It's just the tip of what's known as a subterranean subwoofer. - So this subwoofer is buried underground. So pre-construction when we were still working on the place we dug a real deep hole. About three feet wide. Three feet deep. - In order to cover a decent amount of space and really feel the base outside you'll need a pretty large speaker. Keeping the bulk of this buried underground hides what could be an eyesore. Cables run daisy chained underground to additional speaks placed in the landscape. And positioning those speakers is an art unto itself. Facing towards the house to create the optimal experience for us and for our neighbors. - We don't need as many speakers. And we're able to contain the sound better in the yard. You're creating a zone of audio this little patio. And the further out that you get you just hear the volume level drop. - Can you give me a demo? - Yeah. Yeah, I'll show you. - Let's try it out. (rock music) - And this is kinda like where our line is. - Yeah yeah. - And it's all facing this way. - Oh. (laughing) Yeah, it actually does get noticeably quieter. - Yeah, it's like leaving a dance club or whatever. You still hear it. - Yeah. - You've walked out. You've left the room. And it's not in your face. And it's not jamming out on you. - Now to be clear this definitely isn't any kind of soundproofing. And when we were blasting music I'm sure some of our neighbors weren't super pleased. But for me these speakers felt like a great example of technology working at its best. It actually feels a little like magic. Blending into the landscape while creating real sonic power beneath our feet. And while the iPad control feels less optimal for our visual setup using it to play audio with just the sound of my voice feels effortless. Which is what home entertainment is at its best. Effortless. The ideal entertainment experience of the present and the future is one where the apparatus truly falls away. The tech is intuitive and streamline. Headache and hassle-free. All that's left to focus on is the experience itself. The perfect end to a long day. (upbeat music) Thank you so much for watching. And while I'm living the dream here in this home of the future how are you bringing the future into your home? Let us know in the comments below. And we'll see you next week with a brand new episode.",
    "transcript_keywords": [
        "Yeah",
        "home",
        "system",
        "lot",
        "Sonos",
        "living room",
        "speakers",
        "music",
        "golden age",
        "experience",
        "control",
        "room",
        "Alexa",
        "living",
        "future",
        "play",
        "Home Butler",
        "sound",
        "entertainment",
        "remote"
    ],
    "transcript_entity_values": [
        "one",
        "About three feet",
        "Alexa",
        "ROKU",
        "AC",
        "six",
        "API",
        "Hulu",
        "iPad",
        "Alexa",
        "RTI",
        "Amazon",
        "PlayStation 4",
        "Hulu",
        "One",
        "Home Butler",
        "Three feet",
        "next week",
        "Sonos",
        "Netflix",
        "AV",
        "first",
        "Pete Sandford",
        "Nintendo Switch"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "ORG"
    ],
    "vector": [
        0.036237869411706924,
        -0.11751257628202438,
        -0.0054714614525437355,
        -0.0926913395524025,
        0.050805117934942245,
        0.03390682861208916,
        -0.05796888470649719,
        0.022468699142336845,
        0.02672531083226204,
        0.04308350756764412,
        -0.04613873362541199,
        -0.02257092483341694,
        -0.02127925120294094,
        0.025351570919156075,
        0.057423681020736694,
        -0.047570474445819855,
        0.08234921842813492,
        -0.14549966156482697,
        0.005405470263212919,
        0.013520767912268639,
        -0.0011468452867120504,
        -0.027394182980060577,
        -0.031201450154185295,
        -0.015657607465982437,
        -0.03395800665020943,
        0.04514872282743454,
        0.025777148082852364,
        -0.0006870588986203074,
        -0.018803751096129417,
        -0.07175666838884354,
        0.035934530198574066,
        0.0583481602370739,
        0.008283759467303753,
        0.0039222463965415955,
        -0.1480197161436081,
        -0.10728036612272263,
        0.00986552331596613,
        -0.09978523850440979,
        -0.04228503629565239,
        -0.051497332751750946,
        0.035399530082941055,
        -0.09383202344179153,
        -0.016907809302210808,
        0.0022638493683189154,
        0.0016970457509160042,
        -0.06884446740150452,
        -0.05733693763613701,
        -0.06699364632368088,
        0.04123521223664284,
        0.02003396674990654,
        -0.04998558387160301,
        -0.03155014291405678,
        0.0026602549478411674,
        0.018223507329821587,
        -0.001320164417847991,
        0.002168516628444195,
        0.009067302569746971,
        0.1070554181933403,
        0.07428576052188873,
        -0.0005629518418572843,
        0.04835902526974678,
        -0.05789739266037941,
        0.06741368025541306,
        0.046987131237983704,
        -0.04262104630470276,
        -0.03123019076883793,
        0.004798749461770058,
        0.06699246168136597,
        0.019595090299844742,
        -0.03848223760724068,
        -0.07481621950864792,
        0.0021865300368517637,
        0.10290361940860748,
        -0.03217480704188347,
        0.059230905026197433,
        -0.0461476594209671,
        0.05603541061282158,
        -0.07970520108938217,
        -0.056071970611810684,
        0.03666745871305466,
        0.046662431210279465,
        0.012395474128425121,
        -0.07476650178432465,
        -0.015092463232576847,
        -0.03423784300684929,
        -0.021056922152638435,
        -0.05384669080376625,
        -0.009141848422586918,
        -0.018648691475391388,
        -0.0473664365708828,
        -0.11138290911912918,
        -0.016472965478897095,
        0.06042369455099106,
        -0.0026887774001806974,
        0.06443487852811813,
        0.04939182847738266,
        -0.060724467039108276,
        -0.1389613300561905,
        0.01259570475667715,
        0.0037750951014459133,
        -0.02192837744951248,
        0.00139995152130723,
        0.057878099381923676,
        0.012435135431587696,
        -0.08093671500682831,
        -0.0941062867641449,
        0.014894766733050346,
        0.07113310694694519,
        0.04713420942425728,
        0.01177647802978754,
        -0.057209886610507965,
        0.013326515443623066,
        -0.01162639819085598,
        0.023695439100265503,
        0.026779960840940475,
        0.0026184041053056717,
        0.03634055703878403,
        0.04715622216463089,
        0.11504491418600082,
        -0.026375697925686836,
        -0.023533109575510025,
        -0.02263820357620716,
        0.0029752010013908148,
        -0.006213921122252941,
        0.0770251601934433,
        0.04215981066226959,
        -0.05166560411453247,
        6.69966760437424e-33,
        -0.042271893471479416,
        0.026698419824242592,
        0.00218892190605402,
        -0.02394343540072441,
        -0.005550341214984655,
        0.01734035648405552,
        0.03148669749498367,
        0.03957199305295944,
        -0.03355402871966362,
        -0.017708638682961464,
        0.12125224620103836,
        0.10612539947032928,
        -0.06040531396865845,
        0.00833044946193695,
        0.049551669508218765,
        -0.09216123819351196,
        -0.06318138539791107,
        -0.01351216807961464,
        -0.003219360951334238,
        -0.03750014677643776,
        0.04318774491548538,
        -0.018648600205779076,
        0.01307698618620634,
        -0.051381662487983704,
        0.020647060126066208,
        -0.002287964103743434,
        0.0018910318613052368,
        -0.015925589948892593,
        0.009416195563971996,
        -0.015110032632946968,
        -0.027246538549661636,
        0.0104893883690238,
        -0.010055516846477985,
        -0.014295822940766811,
        -0.0016162932151928544,
        -0.02934650331735611,
        -0.08433277159929276,
        -0.05042527988553047,
        0.003895557951182127,
        -0.0035474232863634825,
        -0.07271352410316467,
        0.042195528745651245,
        -0.12057457119226456,
        -0.019434861838817596,
        -0.04597918316721916,
        0.1098170354962349,
        0.0929558202624321,
        0.01437495555728674,
        -0.039293110370635986,
        -0.013616083189845085,
        -0.05019780248403549,
        -0.0016875260043889284,
        -0.0193178690969944,
        -0.04245598614215851,
        0.03324931114912033,
        -0.031749431043863297,
        -0.05932021886110306,
        -0.032994821667671204,
        0.07551968842744827,
        -0.09917906671762466,
        0.025774966925382614,
        -0.024919938296079636,
        -0.022196166217327118,
        -0.021646086126565933,
        -0.04267435893416405,
        0.020792389288544655,
        0.10595238953828812,
        -0.004569502081722021,
        0.027675582095980644,
        0.03876911476254463,
        -0.03494461625814438,
        0.027336018159985542,
        -0.02816762402653694,
        -0.0700494721531868,
        0.006106679793447256,
        0.09912975877523422,
        -0.04230029135942459,
        -0.00551163824275136,
        -0.025336014106869698,
        0.047097187489271164,
        0.0036809875164180994,
        0.019657999277114868,
        -0.0047675007954239845,
        0.04782821983098984,
        0.10019282251596451,
        -0.007909613661468029,
        -0.00043871431262232363,
        -0.05411948263645172,
        -0.0844721645116806,
        0.04550818353891373,
        -0.07718461751937866,
        0.027904223650693893,
        0.06326783448457718,
        0.048275213688611984,
        -0.0165687408298254,
        -6.576558815696591e-33,
        -0.018804440274834633,
        -0.003929388243705034,
        -0.07708565890789032,
        0.008245706558227539,
        0.04765436425805092,
        -0.0856207013130188,
        0.03628232702612877,
        -0.060136131942272186,
        0.0011850828304886818,
        -0.016514088958501816,
        -0.00942752230912447,
        -0.030947653576731682,
        -0.010014137253165245,
        -0.0371352918446064,
        -0.08424541354179382,
        -0.025307893753051758,
        0.022537067532539368,
        -0.051907017827034,
        0.007594536058604717,
        0.038864631205797195,
        -0.06073543801903725,
        0.04519343003630638,
        -0.06611518561840057,
        -0.0389990508556366,
        0.021565070375800133,
        0.04115263372659683,
        0.016244536265730858,
        0.06424169987440109,
        -0.05762292444705963,
        0.01096765510737896,
        -0.03790010139346123,
        -0.038427624851465225,
        0.03484013304114342,
        -0.05693820118904114,
        0.05313071981072426,
        0.06657078862190247,
        0.11631282418966293,
        -0.02156032994389534,
        -0.07726094126701355,
        -0.0749451220035553,
        0.0704888328909874,
        0.023696396499872208,
        -0.060781560838222504,
        0.01096339151263237,
        -0.01348150335252285,
        0.051473282277584076,
        -0.08553169667720795,
        0.10583360493183136,
        -0.07897210866212845,
        -0.018664568662643433,
        0.06771659106016159,
        0.0012621262576431036,
        0.028342504054307938,
        -0.1153099536895752,
        0.0321541465818882,
        -0.011459535919129848,
        0.06663160771131516,
        0.0617939829826355,
        -0.004983683116734028,
        0.05435673147439957,
        0.04509228467941284,
        -0.053620364516973495,
        -0.032578468322753906,
        -0.007333758287131786,
        -0.02173467166721821,
        0.03391018509864807,
        0.1157759502530098,
        0.08570285141468048,
        -0.016135573387145996,
        0.06112446263432503,
        -0.0013881271006539464,
        -0.013684749603271484,
        0.025964392349123955,
        -0.06536080688238144,
        0.02731233835220337,
        0.06465258449316025,
        0.016810502856969833,
        -0.06723369657993317,
        0.01999340020120144,
        -0.00452404236420989,
        -0.013161744922399521,
        0.027912432327866554,
        0.07631323486566544,
        -0.08089378476142883,
        0.09114887565374374,
        0.02642863243818283,
        0.020948223769664764,
        -0.01946062408387661,
        -0.01978648640215397,
        0.03735289350152016,
        -0.08678832650184631,
        0.010324180126190186,
        -0.055616460740566254,
        0.04784068465232849,
        0.05181143060326576,
        -5.814512960000684e-08,
        0.009589968249201775,
        -0.09147799015045166,
        0.03925877809524536,
        0.021592075005173683,
        -0.03862202167510986,
        -0.00917015876621008,
        0.0495527982711792,
        -0.04560493305325508,
        0.09050635993480682,
        0.01612352393567562,
        -0.026729125529527664,
        -0.044253379106521606,
        0.024583112448453903,
        0.11987869441509247,
        0.11326029151678085,
        0.051382873207330704,
        -0.01873171702027321,
        0.0022780192084610462,
        -0.02661794051527977,
        0.07127770036458969,
        0.026072576642036438,
        0.003582129254937172,
        0.011710824444890022,
        -0.027801550924777985,
        0.06603357940912247,
        0.020519930869340897,
        0.01222859974950552,
        -0.04559441655874252,
        0.022226663306355476,
        0.06999757140874863,
        -0.043881673365831375,
        -0.08340747654438019,
        -0.06115610897541046,
        -0.027841484174132347,
        -0.01577070541679859,
        -0.07802288979291916,
        0.013342047110199928,
        -0.025061314925551414,
        0.04770812392234802,
        0.02531070075929165,
        0.04859733209013939,
        -0.02153756283223629,
        -0.03161401301622391,
        0.026251353323459625,
        -0.039374303072690964,
        0.010507636703550816,
        -0.03943447023630142,
        -0.053647175431251526,
        0.016838740557432175,
        0.06187907233834267,
        -0.015392540022730827,
        -0.00011763710790546611,
        0.06396736949682236,
        -0.014368991367518902,
        0.1259976178407669,
        -0.015015335753560066,
        0.07428634911775589,
        0.015600795857608318,
        -0.027619903907179832,
        0.09298881143331528,
        0.06060240417718887,
        0.009905142709612846,
        0.0288709606975317,
        0.052814699709415436
    ]
}