{
    "id": "g1meziEMdsk",
    "title": "I Tried Gaming on a Soviet Hall-Effect Keyboard",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-07-07T17:01:02Z",
    "video_url": "https://www.youtube.com/watch?v=g1meziEMdsk",
    "category": "Science & Technology",
    "tags": [
        "keyboard",
        "soviet",
        "C.S.S.R.",
        "Czech",
        "slovak",
        "old keyboard",
        "old technology",
        "chernobyl",
        "peripherals",
        "old hardware",
        "soviet tech",
        "vintage tech",
        "pc gaming"
    ],
    "views": 1036825,
    "likes": 37020,
    "comments_count": 2115,
    "description": "Thanks to MANSCAPED for sponsoring today's video. Get 20% Off + Free International Shipping with promo code LINUSTECH or visit   Learn more about the HelloCam Pro at:   After our success with the Soviet mouse, we just HAD to try out this keyboard when we spotted it on eBay! Imagine our surprise when we spotted the same model in the ruins of Chernobyl!  Discuss on the forum:    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   GET A VPN:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:06 What is it? 2:45 That ain't right 4:15 What's going wrong? 6:44 How do we fix it? 7:24 Tetris 10:01 Doom 11:15 The Best? 13:04 Credits",
    "description_links": [
        "http://manscaped.com/linustech",
        "https://lmg.gg/HelloCamPro",
        "https://linustechtips.com/topic/1575893-gaming-on-the-keyboard-from-chernobyl/",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "http://www.piavpn.com/linus",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "This is the Consul 262.4, a Hall effect keyboard that was made all the way back in 1989 in the CSSR, the Czechoslovak Soviet Socialist Republic, using components from Tesla, and it was deployed in places like the Chernobyl nuclear power plant? This thing doesn't glow, does it? Not if we keep the lights on. That's reassuring. I've already got a lot of questions, but... The lab made that old Soviet mouse work, so I'm guessing the answer to \"Can I game on it?\" is yes. Yeah, you can, and it's one of the best keyboards we've ever tested, but also one of the worst. We'll unpack that in a bit. First, I need a word for what this thing feels like. Thwumpy? Here, listen for yourself. And listen to the segue. To our sponsor, Nexigo. Say bonjour to the Hello Cam Pro and give your setup an upgrade with its 1080p resolution, 60 FPS frame rate, and Windows Hello facial recognition. You can learn more at the link in the video description. Our specimen here is a product of Zbrojovka Brno or Brno Armory. First founded in 1918, they made. Everything from rifles to cars to farming equipment and they have a soccer team named after them now. Anyway, none of that matters for the moment. What matters is getting it working and I suspect our first problem is going to be this connector. They used a game port? Well, sort of. It's the same DA15 connector, but in this case, it's used for simple asynchronous serial communications. Simple-ish. This helpful post on desk authority keyboard forum gave us some good pointers. And as it turns out, we only need to hook up six of the pins, ground, serial input and output, both five and negative 12 volt power, and finally a clock pulse. Does asynchronous serial normally need a clock pulse? No. Ah, so there's your ish. A little more on that later. For now, according to forum post, we need to provide a square wave at 16 times the frequency or baud rate. Okay? Oh, but there's a recommended value. Wow. I can't believe how easy this is turning out to be. We just wire our connector up to a microcontroller like we did last time. In this case, a Raspberry Pi Pico that we've programmed to send the clock signal using timer interrupts, and then read the serial data and spit it out over USB. Okay, not super familiar with their alphabet, but hey, I know numbers. One. O, X, okay. V. It's pretty clear something's wrong because if this is how it worked, I'm surprised Chernobyl lasted as long as it did. Time to do some digging. We can see the different keys produce the same output, but to really understand what's at play here, we're gonna need to see the individual bits. Enhance. You weren't kidding, this is awesome. Rohde Schwarz has an ASCII mode that means that not only can we see the raw output, but it actually shows us up at the top exactly which ASCII character it's supposed to correspond to. Of course, as cool as this is, that doesn't really fix anything. So, in order to do that. We had to change the mode. What are we looking at now? So, once we showed it all in binary, we could very easily and visually see that the first half of our data was varying as he presses different keys. But the second half was not varying at all. We had to figure out why this was happening. Interesting. So that's how we can press two different keys and get exactly the same or a similar enough output that we get the same value. That, my friends, is why electronics need to come with schematics. It's like a breath of fresh air, you guys. If this keyboard was a tightly integrated modern device, we'd pretty much be throwing it in the garbage. But thanks to our comrades at Zbrojovka Brno, we've got this, a complete guide to the inner workings of our keyboard. So all we need to do is work our way back from the connector to see what's going wrong. This right here is our data output line, and it comes from this green thing right here. That is a UART chip, which is short for Universal Asynchronous Receiver Transmitter. In a nutshell, it serializes incoming parallel data, and then outputs it at a given frequency. Fun fact, by the way, there was a parallel version of this keyboard, the 242.3, that didn't have the UART at all, and would have saved us a lot of investigative work, because... we would have immediately noticed the problem when we read the raw data, that half of every byte was locked to one. But why? Well, the input to the UART comes from these two orange ICs right here. These are ROM chips that hold lookup tables. If we trace back one more step, we get to the keyboard controller, which takes its input from a pretty typical keyboard matrix. Now we're all the way back. Let's go forward. That matrix gets translated by the keyboard controller into a nine- bit parallel signal and a strobe signal that indicates a key has been pressed. The nine bits go to our ROMs here and get translated into two halves of a single byte, which the UART receives and then converts to serial once it sees the strobe signal. It then sends that to the output, or at least, that's how it's supposed to happen. As it turns out, one of our ROM chips is just broken. Also, wait a second, nine bits. Ah, I'm glad you asked. See, seven bits would give us 128 values, which is enough for a basic ASCII table or whatever kind of ASCII table we're dealing with here. Then there's two bits for the modifiers, which means four values, and that turns out to be no modifier, control, shift, and repeat. Wait, repeat? Repeat. Repeat? Repeat. Repeat. Yes, repeat. Okay guys, that's enough. Sorry, sorry. See, on most modern keyboards, repeating is built-in, so when you hold down a key, it registers multiple key presses. But on this one, it's press once, fire once, no matter how long you hold it, unless you also hold the repeat key. The repeat key. The repeat key. We can actually see this in action if I just hold down the key. It takes a second to spool up, but it kind of has some interesting implications for gaming, doesn't it? If only we could get it working. We can, we just need to ignore the parts that don't work. We just need to intercept these signals by wiring in our microcontroller before these broken ROM chips so they can't mess anything up. We program the microcontroller with our own lookup tables based on the documentation we found, and then the microcontroller just acts like a USB-HID device. Are we ready now? Of course, we just need the magnetic cable management arch from lttstore.com. Heck yeah, it helps if you actually put it on the cable. I did. The one that we need, this one's useless. Fair enough. Why do I have to use the Soviet mouse too? No, I want a real mouse. Maybe later, but right now we need to try it with this. Oh, it's so bad though. The arrow keys are your movement, not WASD. Well, where's anything? Gotta look around. Oh! There's the arrow keys up there. They don't work. They're in a line. They work slowly. What? It works, ever so slightly. No, that's not Z or X, that's Q. Well, where are Z and X? You gotta look around, Z. Oh, God. X. Nice. Oh! Oh, no. Oh, no! Come on! A little bit too much. So, um, because the keyboard only detects the pressing down, the amount of time that the computer reads that you press the key is set by us. So currently, it's not really reading it very well. Okay, well, why did you do that? I thought it would be funny. Come on! Okay, can we change it higher? Yes, we can change it. Thank you. Okay. New attempt. Here we go. Should be somewhat playable. This is gonna be way better, right? Yep. I changed the delay to 50 seconds instead of one. Oh. Well - Or 50 milliseconds. Okay, shoot, that was just user error. Okay, this is really unergonomic still, but this is totally usable. So this is just essentially the polling rate that it's set to. It's like how long. The computer thinks the key is like held down and then let go so the signals are only sent when you like press a key not when you let go like a modern keyboard. Right. So it's how long I tell the computer I'm pressing- you're pressing a key. I am- I don't think this is professional Tetris. Not very good at Tetris, so that's good. I thought I was doing bad. Okay look, I am old. Oh you can't like press multiple things at once. It's very- Aren't you excited to play an FPS? God no. It's changing the thing every time I rotate is driving me absolutely crazy. Okay. What? What is the- Oh god this mouse. I was like well I'm done with this game alt F4- There is no alt. There's no F keys. There's a few. How does this keyboard work? F? Space is F? Pay respects to this keyboard. Why is it not going up you could just use the like arrow keys I'm gonna have to play an FPS game Ariel gonna try Totally playable see You just got to press it a lot like oh and then it holds it down Wasn't doing this before C, where's C? C, out of fuel. W Okay, can I have a real mouse? Yeah, this one right here All right. Oh, glory killer. E? Yes. Yes, yes, yes, yes. Okay, it's still alive Close enough. Come on. E. Yes. Yes. Yes. Still alive. Oh no Wait, what can we do with teamwork? Okay, so I'm gonna hold the repeat key. Oh What is going on? Oh, right. Okay, so I can't hold the repeat key when you space otherwise you're gonna continue as the jump. Oh, we gotta like let go at the right time. Yeah. Okay, okay. Okay Get, get, get over there, get over there. I'm trying, I'm trying. Come on, come on, go brother! Go! Now you have got to be asking yourself how could we say at the beginning of this video that this is the best of anything? As it turns out, it is one of the most consistent keyboards that we have ever tested on our robot. That is to say that the actuation force and the travel distance is nearly identical from key to key thanks in no small part to its 80s style solid steel backplane. You've got to love it, of course, if you're not pushing the key straight down. Right in the center, you're gonna have a pretty bad time. Uh, let's just put it this way. Key stabilization has come a long way in the last, uh, 35 years? You know what else has come a long way? My segues. To our sponsor. Manscaped! Step into summer with confidence thanks to Manscaped and their Performance Package 5.0 Ultra. It includes the Lawn Mower 5.0 Ultra Groin and Body Hair Trimmer. Turn that overgrown forest into a serene garden. Just don't expect any flowers to start growing there. If they do, please seek help. Also included is the Weed Whacker 2.0 Electric Nose Hair Trimmer. So people will actually look you in the eyes when talking to you, rather than into the dark abyss, faintly outlined with the tentacles of some long-forgotten eldritch horror. Anyways, you'll also get their Crop Soother Aftershave Lotion and Crop Preserver Anti-Chafing Deodorant to keep you smelling fresh down in your nether regions. It even comes with two free gifts, a toiletry bag for your grooming essentials and a pair of their Boxers 2.0 to keep your family jewels all tucked in and cozy. Check out the Performance Package 5.0 Ultra at manscaped.com/linustech and use code LINUSTECH for 20% off and free shipping. If you guys liked this video, check out the time we got an old Soviet-era mouse working with a modern PC. Ariel was so much younger back then.",
    "transcript_keywords": [
        "Soviet Socialist Republic",
        "Czechoslovak Soviet Socialist",
        "Socialist Republic",
        "Hall effect keyboard",
        "key",
        "components from Tesla",
        "Hall effect",
        "Czechoslovak Soviet",
        "Soviet Socialist",
        "repeat key",
        "keyboard",
        "repeat",
        "keys",
        "nuclear power plant",
        "hold",
        "deployed in places",
        "work",
        "time",
        "Consul",
        "CSSR"
    ],
    "transcript_entity_values": [
        "nine",
        "Zbrojovka Brno",
        "one",
        "second",
        "1080p",
        "Tetris",
        "CSSR",
        "128",
        "242.3",
        "four",
        "first",
        "WASD",
        "Crop Soother Aftershave Lotion",
        "Ariel",
        "One",
        "First",
        "ASCII",
        "UART",
        "50 seconds",
        "Manscaped",
        "X. Nice",
        "summer",
        "1918",
        "seven",
        "1989",
        "Chernobyl",
        "16",
        "five",
        "Ultra Groin and Body",
        "the Weed Whacker",
        "the Lawn Mower",
        "LINUSTECH",
        "Tesla",
        "12 volt",
        "FPS",
        "Soviet",
        "50 milliseconds",
        "20%",
        "262.4",
        "a second",
        "5.0",
        "the Performance Package 5.0 Ultra",
        "Soviet-era",
        "six",
        "35 years",
        "USB",
        "Universal Asynchronous Receiver Transmitter",
        "the Hello Cam Pro",
        "Windows",
        "60",
        "Rohde Schwarz",
        "Tetris",
        "two",
        "Ariel gonna",
        "half",
        "Nexigo",
        "Brno Armory",
        "80s"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "NORP",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "LAW",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "FAC",
        "DATE"
    ],
    "vector": [
        -0.06695932894945145,
        -0.07055681943893433,
        -0.006245158147066832,
        -0.13351185619831085,
        0.04520295187830925,
        0.04002327099442482,
        0.05218615382909775,
        0.012812360189855099,
        0.008027526549994946,
        0.0525156706571579,
        0.037505101412534714,
        0.06480065733194351,
        0.023521684110164642,
        -0.0020275264978408813,
        0.026030516251921654,
        -0.032310813665390015,
        0.08117862790822983,
        -0.05384451150894165,
        -0.026699019595980644,
        -0.006324960850179195,
        -0.032041747123003006,
        -0.09746499359607697,
        0.08039898425340652,
        -0.0226394422352314,
        0.02389056235551834,
        -0.0651371031999588,
        0.0036220925394445658,
        0.012480884790420532,
        0.018653504550457,
        -0.017437662929296494,
        -0.03674110397696495,
        0.03981124982237816,
        -0.011105220764875412,
        0.0072858333587646484,
        -0.02675607241690159,
        -0.021611854434013367,
        0.043169744312763214,
        -0.08998485654592514,
        -0.1328117996454239,
        -0.02571101114153862,
        -0.05174725502729416,
        -0.06428059935569763,
        0.03809606656432152,
        0.05908380076289177,
        0.055239565670490265,
        -0.005688466597348452,
        -0.010038763284683228,
        -0.0272354818880558,
        -0.032806139439344406,
        0.01185959205031395,
        -0.03762313723564148,
        -0.04538768157362938,
        0.06866920739412308,
        -0.027410784736275673,
        -0.03063919022679329,
        0.016754543408751488,
        0.0005020606331527233,
        0.04306504502892494,
        0.04040314629673958,
        -0.02248094417154789,
        0.0016517253825441003,
        -0.04755450412631035,
        -0.0770396739244461,
        0.008954443037509918,
        0.00576535239815712,
        0.011036131531000137,
        0.01101154088973999,
        0.05310378968715668,
        -0.0028806254267692566,
        0.00043833989184349775,
        0.0003533113340381533,
        -0.008822164498269558,
        -0.027194427326321602,
        0.029605934396386147,
        -0.051922738552093506,
        -0.09710140526294708,
        0.012080852873623371,
        -0.0436708889901638,
        0.023968912661075592,
        -0.0033122829627245665,
        0.054571107029914856,
        -0.04187179356813431,
        -0.008233760483562946,
        -0.06298423558473587,
        0.014584813266992569,
        -0.008045828901231289,
        0.0013763591414317489,
        -0.009449081495404243,
        -0.008809291757643223,
        -0.012137332931160927,
        -0.11611634492874146,
        0.0679665058851242,
        0.07889631390571594,
        -0.009973583742976189,
        -0.0239204540848732,
        -0.008538119494915009,
        0.021975349634885788,
        -0.015772365033626556,
        -0.053622178733348846,
        0.10008642822504044,
        0.02594960294663906,
        0.015026780776679516,
        -0.03625207766890526,
        -0.0714346170425415,
        -0.042492594569921494,
        -0.008621245622634888,
        0.018062254413962364,
        0.07015438377857208,
        0.024554040282964706,
        -0.053128644824028015,
        -0.09771882742643356,
        0.02965911105275154,
        -0.04546366259455681,
        -0.017216239124536514,
        0.0006356610683724284,
        0.046426281332969666,
        -0.043981924653053284,
        0.02554262802004814,
        0.06701172143220901,
        -0.017375344410538673,
        -0.017842769622802734,
        -0.04868512600660324,
        -0.0564410425722599,
        0.06560860574245453,
        -0.020133506506681442,
        0.02927195280790329,
        -0.0019043658394366503,
        -3.503150591628994e-33,
        0.028430908918380737,
        0.041027601808309555,
        -0.05910244211554527,
        -0.050655290484428406,
        0.05125505477190018,
        0.06867657601833344,
        0.0061425757594406605,
        0.0015892772935330868,
        -0.057336121797561646,
        0.03089839033782482,
        -0.02748536318540573,
        -0.03048093430697918,
        -0.1201743334531784,
        0.0012541583273559809,
        0.03412437438964844,
        -0.04945875704288483,
        -0.05590865761041641,
        0.06758559495210648,
        -0.05295012518763542,
        0.0009830453200265765,
        0.05179426819086075,
        -0.003491553943604231,
        0.04121019318699837,
        -0.012806770391762257,
        0.08504751324653625,
        0.043046314269304276,
        -0.04823753237724304,
        -0.046279456466436386,
        0.15277805924415588,
        0.027304215356707573,
        -0.06110154092311859,
        -0.0027433184441179037,
        -0.08981779962778091,
        -0.09633293002843857,
        -0.03221888095140457,
        -0.02407398633658886,
        -0.05969439074397087,
        -0.09512081742286682,
        -0.011795644648373127,
        0.02894376963376999,
        0.051425471901893616,
        -0.008679274469614029,
        -0.09392685443162918,
        -0.1167733296751976,
        -0.009290443733334541,
        0.024482928216457367,
        0.0561441034078598,
        0.030966641381382942,
        0.005896463990211487,
        -0.029675668105483055,
        -0.0917295441031456,
        0.08515316992998123,
        -0.14111678302288055,
        -0.028870295733213425,
        0.0008202234166674316,
        -0.0840589702129364,
        0.01711135171353817,
        0.03343353420495987,
        0.08827519416809082,
        0.035964611917734146,
        -0.0054643359035253525,
        0.015668649226427078,
        0.0713091790676117,
        -0.015737561509013176,
        0.00010334634862374514,
        0.011129618622362614,
        0.02218286506831646,
        0.020656894892454147,
        -0.01733163557946682,
        -0.003979459870606661,
        0.00988884549587965,
        -0.05935726314783096,
        0.007988841272890568,
        -0.019678635522723198,
        0.010023512877523899,
        0.04657088965177536,
        -0.08952214568853378,
        -0.04096479341387749,
        0.01581823267042637,
        -0.0005802601808682084,
        -0.0912494882941246,
        0.07655595988035202,
        0.030992818996310234,
        0.026358753442764282,
        0.01544308103621006,
        0.01438883040100336,
        0.03665248677134514,
        -0.12063980102539062,
        -0.08850753307342529,
        0.03600914403796196,
        -0.1437118798494339,
        -0.014558665454387665,
        -0.043809693306684494,
        -0.04433468356728554,
        -0.06639479100704193,
        -7.46520554528237e-34,
        -0.06895403563976288,
        0.03445065766572952,
        -0.052242543548345566,
        0.02948809042572975,
        -0.001941312337294221,
        0.0072751352563500404,
        -0.0009340789401903749,
        0.015268404968082905,
        0.05356013774871826,
        0.024578161537647247,
        0.046829719096422195,
        -0.030457012355327606,
        -0.027332685887813568,
        -0.010627131909132004,
        0.03473878651857376,
        -0.08239202946424484,
        0.05671101063489914,
        0.012746160849928856,
        -0.014217297546565533,
        -0.015031945891678333,
        0.0811818465590477,
        0.010114139877259731,
        -0.043216951191425323,
        0.11689825356006622,
        0.011193124577403069,
        0.026405835524201393,
        0.0811515673995018,
        0.026396866887807846,
        -0.004303034860640764,
        0.03454184532165527,
        0.0372660830616951,
        0.01505698449909687,
        -0.01862756907939911,
        0.018766338005661964,
        0.05405087769031525,
        0.02952217124402523,
        0.08580626547336578,
        0.03306746482849121,
        -0.11176098883152008,
        -0.056807491928339005,
        0.06566549837589264,
        -0.025305792689323425,
        -0.02516510896384716,
        0.007831206545233727,
        -0.024050723761320114,
        -0.070104219019413,
        -0.0975058376789093,
        -0.03090912662446499,
        0.007792352698743343,
        -0.022561440244317055,
        0.05903344601392746,
        -0.04620615020394325,
        0.013221257366240025,
        -0.07635397464036942,
        -0.12307916581630707,
        0.009397520683705807,
        -0.02489355579018593,
        0.014276753179728985,
        0.05576566979289055,
        -0.02867582067847252,
        0.046827178448438644,
        -0.0035527676809579134,
        -0.04091978073120117,
        -0.04680618271231651,
        0.03278985992074013,
        -0.07129832357168198,
        0.12747442722320557,
        0.07318750023841858,
        0.03301304578781128,
        -0.019254006445407867,
        0.0570220984518528,
        0.02163049951195717,
        0.04526534676551819,
        0.03874821960926056,
        -0.01760397106409073,
        0.08707292377948761,
        0.042345039546489716,
        0.057600460946559906,
        0.05213204398751259,
        -0.07764851301908493,
        -0.034900568425655365,
        -0.03294305130839348,
        0.08729878067970276,
        -0.008918876759707928,
        0.1015457734465599,
        0.07749708741903305,
        0.006300192326307297,
        0.011386007070541382,
        0.0018655241001397371,
        0.011772941797971725,
        -0.01497691310942173,
        0.02097395434975624,
        -0.048189256340265274,
        0.0670936331152916,
        0.05104275792837143,
        -6.143001485270361e-08,
        0.02090364322066307,
        0.013702935539186,
        0.011817032471299171,
        0.06970676779747009,
        -0.10678113251924515,
        -0.08903935551643372,
        0.048304494470357895,
        -0.08961682766675949,
        -0.0489804744720459,
        -0.06366880238056183,
        -0.05053504556417465,
        -0.05144283547997475,
        -0.03255724161863327,
        0.026668952777981758,
        0.035374369472265244,
        0.055831070989370346,
        -0.005953184794634581,
        0.09008276462554932,
        -0.06126652657985687,
        0.009983962401747704,
        0.03216008469462395,
        0.03218376636505127,
        0.0733170211315155,
        -0.06743030250072479,
        -0.05977381393313408,
        0.033746372908353806,
        -0.04601357877254486,
        0.055145956575870514,
        0.0939953550696373,
        -0.07578032463788986,
        0.039855390787124634,
        -0.016011007130146027,
        0.002824322087690234,
        0.0008014124468900263,
        0.00971909612417221,
        -0.02600771002471447,
        -0.031652797013521194,
        0.0002552658843342215,
        0.0016678937245160341,
        0.028721611946821213,
        -0.0636523962020874,
        -0.07897690683603287,
        0.020420683547854424,
        0.007151027675718069,
        -0.03292373940348625,
        0.004635188728570938,
        0.00239352323114872,
        -0.0961756706237793,
        -0.019165385514497757,
        0.07917074114084244,
        -0.04104696586728096,
        0.023383289575576782,
        -0.020667031407356262,
        0.03466234356164932,
        0.0914425477385521,
        0.057996638119220734,
        0.05115576833486557,
        0.025724763050675392,
        -0.060284316539764404,
        0.031002163887023926,
        0.03515117987990379,
        -0.0714351236820221,
        -0.07622051984071732,
        0.09112304449081421
    ]
}