{
    "id": "g2mnVFl6CUg",
    "title": "We talked to the first chatbot ever. Here’s what it taught us about ChatGPT",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-02-28T15:00:41Z",
    "video_url": "https://www.youtube.com/watch?v=g2mnVFl6CUg",
    "category": "Science & Technology",
    "tags": [
        "ai",
        "chat gpt",
        "chatgpt",
        "ai technology",
        "artificial intelligence",
        "machine learning",
        "chatbots",
        "eliza",
        "Alice",
        "parry",
        "smarterchild",
        "openai",
        "open ai",
        "what is chatgpt",
        "chatgpt explained",
        "chatbot",
        "alexa",
        "siri",
        "chatgpt tutorial",
        "chat gpt explained",
        "ai chatbot",
        "open ai chat gpt",
        "ai news",
        "openai chat",
        "ai tools",
        "chat gpt examples",
        "ai art",
        "generative ai",
        "tech",
        "the verge"
    ],
    "views": 84805,
    "likes": 2076,
    "comments_count": 84,
    "description": "With how new and viral ChatGPT has been, its easy to forget chatbots have been here for decades. Weve seen them as friends, therapists, services; but why are we so attached to talking to computers? Editor-at-large, David Pierce, dives into the history of chatbots starting with the first one ever made known as ELIZA. He explores how interactions with these bots have evolved over time in both technology and personality. Presented by SAP. #Technology #AI   Read more:   00:00 Introduction 00:36 The first chatbot ever 01:08 How ELIZA worked and how well 03:23 The rise of the chatbots 04:32 Remembering SmarterChild 06:31 The voice generation 07:29 How transformers changed everything 08:33 ChatGPT hits our screens 10:21 Why do we like chatbots so much 11:30 Whats next?  The Verges sponsors play an important role in funding our journalism, but do not influence editorial content. For more information about our ethics policy, visit   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://trib.al/9uqkoEa",
        "https://www.theverge.com/ethics-statement.",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "(laptop bangs) (gentle music) (hands typing) - [David] This is not ChatGPT. It's also not Gemini and it's not Copilot and it's not any of the other bots that everybody has been talking about for the last year. What it is is a replica of the first conversational bot to ever exist, and it's the beginning of the story that leads to all those other ones, and that story starts all the way back in 1966. - [Narrator] Wherever man goes, computers surround changing the nature of our lives. - I know, I know. 1966 is a very long time ago, but stay with me here. We're going somewhere. So there's this guy, Joseph Weizenbaum who's a professor at MIT and in 1966 he publishes a paper in a journal called The Communications for The Association for Computing Machinery. In that paper, he describes this thing that he's made. A chat bot named ELIZA, \"Which,\" and I'm quoting here, \"makes certain kinds of natural language conversation between man and computer possible.\" ELIZA was set up to have the personality of a therapist, but it was really basic technology underneath. Basically you typed a sentence and it looked for keywords in those sentences and then applied those keywords to one of a bunch of pre-programmed responses it had ready. Sometimes if it didn't know what to say or didn't know what you were saying, it would just repeat your words back to you. Here's a bit of the back and forth Weizenbaum included in that original paper. - [Writer] Men are all alike. - [ELIZA] In what way? - [Writer] They're always bugging us about something or other. - [ELIZA] Can you think of a specific example? - [Writer] Well, my boyfriend made me come here. - [ELIZA] Your boyfriend made you come here. - It goes on like that for a while and it's super basic, but you know what's wild? It totally worked. A year later Weizenbaum wrote another article in the same journal in which he said it had been hard to convince some people who tested ELIZA that there wasn't a human on the other end, that includes his own secretary. In the paper Weizenbaum wrote that her reaction was proof of ELIZA's illusion of understanding, and he even recited the anecdote to camera. - After two or three interchanges with the machine, she turned to me and she said, \"Would you mind leaving the room please?\" - This is the thing about chatbots. There's just something about talking to a computer and the computer talking back that feels like magic. We give these bots human attributes even when they don't have any. We talk to them differently, we appreciate them more, we work with them more collaboratively. We just wanna use them more. And for decades people have believed that once the underlying tech gets good enough, it'll go from cool demo and fun thing to talk with, to changing everything about how we interact with technology. - What we really wanna do is just talk to our device. - And so for decades they really tried to get there and eventually it got to be kind of good. We'll get into how we got there right after this break. - More and more we're seeing AI tools be integrated into our daily lives. From generating quick inspiring art to capturing notes from important meetings. But with SAP Business AI, their tools are designed to deliver real world results, helping your business become stronger and helping you make decisions faster. This revolutionary AI technology allows you to be ready for anything that is thrown at you. Okay, that's it for me, but before we go, SAP doesn't influence the editorial of this video, but they do help make videos like this possible. - After ELIZA, there were a few other well-known early chatbots. There was Parry which tried to simulate a person with schizophrenia. There was Dr. Sbaitso which also tried to act like a psychologist. There was A.L.I.C.E who was just a chill, friendly bot that just kind of wanted to be your friend. The motivation behind these bots was to be immersive for lack of a better word. To give you a sense of talking to a therapist that felt, if not real, then real enough to actually be useful therapy. You can read about all that stuff, but this was designed to be much closer to experiencing it. Around the same time, there was also another branch of research being done in the chatbot world. Back in the '70s at the famous Xerox PARC research lab, there was a group working on this thing called GUS, the Genial Understander System, which was meant to be a way to get stuff done on your computer just by talking in a natural language to a chatbot. The team's example was a travel agent. What if you could buy plane tickets on a computer the same way you would over the phone with a human? This is a much clearer simpler use case for this kind of technology. And to a lot of people even then felt like something you could make money from too. There were lots of projects like this over the years, but I bet that at least for anyone over about 30, the first time you really used a chatbot, was when you used SmarterChild. (bright music) SmarterChild was a chat bot made for AOL Instant Messenger, which is an extremely 2004 sentence to say, but it was a huge deal. It was made by a company called ActiveBuddy and it was a mix of all of the things we'd seen before. It had access to lots of information about news and stocks and such. It could do math and help you with your homework, but most of all, it was also just really fun to talk to. - We were in the Buddy list. We were to people exactly what their friends were in the Buddy list. - [David] That's Peter Levitan, one of the founders of ActiveBuddy. He had a team of writers working on SmarterChild who were coming up with the bots responses. - SmarterChild had a great personality. If somebody cursed at it, it had a response. So we understood what people were saying and you know if it was an 11-year-old boy, he had his own particular approach to communication. We were surprised at how popular it got and how crazy the conversations became. - In the mid 2000s, ActiveBuddy licensed this tech out to lots of places. It eventually figured out that there was no money to be made from SmarterChild itself, but ultimately a lot of early bots from like your cable company and your wireless carrier were powered by this same tech. - SmarterChild was our demonstration of our skillset and technology, and that's what we showed commercial clients. Ultimately the goal was, believe it or not, to make money. - Eventually Microsoft bought it with even more corporate plans than that, and SmarterChild was gone. Now you basically can't find it anywhere on the internet. We found this site which is something of an homage to SmarterChild, and that was the closest thing we could get our hands on. (animation music) After SmarterChild taught a bunch of AM kids how to talk to chatbots, the next big phase was what I guess you'd call the voice generation. - It's a feature all about our voice. - [Lady] Okay Google, what do I have to do today? - Alexa, open Cortana. - This is when everyone got really excited about the idea that not only were chatbots the future, but we'd talk to them instead of typing to them. And if you apply the logic going all the way back to 1966, that makes perfect sense, right? The goal is to make interacting with technology feel like interacting with humans, which just makes everything better. But I mean, you've used Siri and Alexa, right? They're great for a few things and mostly terrible for everything else, and honestly God help you if you try to book a flight through Google Assistant. All these companies and developers work convinced for years that they were hitting on the right interface. But even as the technology got better, it became increasingly obvious just how far it still had to go. - Sorry, I don't understand. (instrumental music) - [David] And then in 2017, another academic paper came out. Sorry, we're talking about so many academic papers here, but it is important. This one was called \"Attention Is All You Need\" and it was written by a bunch of Google researchers. They laid out this idea of transformers, which are not robots in disguise, but instead a way of teaching computers to understand and process information that is just vastly more effective and efficient than anything we'd had before. This is going to be a way oversimplified explanation, but basically what transformers do is allow a computer to read and understand much more at a time. Instead of seeing one word and then predicting the next word, which is how it used to work, transformers let the computer see the whole sentence, the whole paragraph, even the whole book at the same time. That gives it vastly more data to work with and makes its predictions as a result much more accurate. In the history of AI and chatbots and maybe everything, there's the world before transformers and the world after, and a few years later we started to see that become real, particularly in late 2022 when ChatGPT came out and seemingly changed everything. - ChatGPT. - [Reporter] ChatGPT. - It's called ChatGPT which is just about the clunkiest name ever. - Do you remember the first time you used ChatGPT, how it felt like when you typed a question, the bot was actually thinking and processing, and it came back with an answer that wasn't just a formulaic keyword response, but actually felt like someone was answering your question. Remember how cool that felt and then how everyone immediately was like, \"Oh man, the movie \"Her\" is coming true. Scarlett Johansson is totally gonna be my girlfriend in my ear in like two years.\" That was in a lot of ways the same experience people were having with a ELIZA almost 60 years ago. Well, they didn't talk about Scarlett Johansson back then, but you know what I mean. The tech in ChatGPT is I mean wildly better than what was under ELIZA. Let's just rerun some of that first conversation from 1966 with ChatGPT and see where we get. - [Writer] Men are all alike. - [ChatGPT] It is important to recognize that making sweeping generalizations about any group of people, including men, can be inaccurate and unfair, individuals-- - Okay, that's a bad example. Or actually maybe that's a good example. ChatGPT probably handled that well, not as a therapist but as a chatbot. and honestly, that is a deep thoughtful answer to what I said. ChatGPT is mostly designed to be a get things done chatbot, not a companion. It can help you write code and write email and brainstorm ideas, find information, all that kind of stuff. And even when ChatGPT or any other AI bot gets stuff wrong or makes mistakes, which by the way they do all the time, people forgive them. After all this time, and as sophisticated as we are about technology, we still treat these bots like we would people. I mean, if you put numbers into a calculator and it gave you the wrong answer, that's a bad calculator, right? You'd return it. But because ChatGPT talks and appears to think like a person, we're willing to go back and forth, we're willing to give it the benefit of the doubt. Maybe the novelty of that will wear off eventually, but for many people it sure hasn't yet. Meanwhile, all the way on the other end of the bot spectrum, the bots that are purely meant for conversation are getting better all the time too. There are companies like Replika and Character AI that are deliberately building AI companions. Someone to talk to, someone who will listen, a best friend in the cloud. Even Meta is big on this idea now. More and more people are signing up for that too. People want and respond to this kind of relationship. And if you add in augmented reality, those bots are even able to have virtual bodies, and these robot companions are becoming more lifelike all the time. (bright music) Is this what we want from technology? Technology that tricks us into thinking we're talking to a human even when we're not? Do we even need to know the difference between human and bot anymore? Is there even a distinction? I don't know, but the whole history of chatbots has been based on this one theory, that we should be able to talk to computers like we talk to each other, and that that might make technology more accessible, more useful, and just more fun to use. There are a lot of smart people who have believed that for a really long time, and a lot of smart people who think that whole theory is dead wrong. But the thing is we've never had a chance to prove it either way, because it hasn't worked well enough. And to be clear, even now we're not at some magical AI moment where the tech is perfect and will change everything forever, but the chat bot has been the future of computers for just about as long as there have been computers. Now they're just here, they're pretty good, and now we get to see once and for all whether Joseph Weizenbaum really had it right all those years ago. (bright music) What's a good last minute gift to get my wife? A star map, a terrarium or indoor garden kit? Sure, oh, virtual reality headset. I don't think she's going to like a virtual reality headset.",
    "transcript_keywords": [
        "people",
        "ChatGPT",
        "ELIZA",
        "time",
        "bot",
        "technology",
        "talk",
        "bots",
        "back",
        "SmarterChild",
        "computer",
        "Weizenbaum",
        "talking",
        "make",
        "thing",
        "chatbots",
        "computers",
        "Joseph Weizenbaum",
        "years",
        "made"
    ],
    "transcript_entity_values": [
        "Joseph Weizenbaum",
        "about 30",
        "ELIZA",
        "the '70s",
        "one",
        "Peter Levitan",
        "the last year",
        "like two years",
        "1966",
        "three",
        "11-year-old",
        "AI",
        "today",
        "Alexa",
        "AOL",
        "Google",
        "SAP Business AI",
        "SmarterChild",
        "2017",
        "The Communications for The Association for Computing Machinery",
        "a few years later",
        "years",
        "the years",
        "late 2022",
        "Cortana",
        "Meta",
        "Scarlett Johansson",
        "two",
        "almost 60 years ago",
        "Buddy",
        "last minute",
        "GUS",
        "David",
        "SAP",
        "Sbaitso",
        "the Genial Understander System",
        "Xerox PARC",
        "Gemini",
        "Attention Is All You Need",
        "Siri",
        "Parry",
        "Replika",
        "decades",
        "Microsoft",
        "first",
        "the mid 2000s",
        "2004",
        "MIT",
        "A year later",
        "Weizenbaum",
        "ActiveBuddy"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.09703218936920166,
        -0.03958859294652939,
        0.005049105267971754,
        -0.02261899784207344,
        0.03304237127304077,
        -0.05691544711589813,
        -0.01859903335571289,
        0.053103089332580566,
        0.06656835228204727,
        0.02189893275499344,
        -0.040720079094171524,
        0.049479495733976364,
        -0.021943772211670876,
        0.03120904415845871,
        0.07985059916973114,
        0.016360944136977196,
        0.03661530837416649,
        -0.11754751205444336,
        -0.05866944044828415,
        0.00589486351236701,
        -0.019133325666189194,
        0.02702045626938343,
        0.09507982432842255,
        -0.04321455955505371,
        -0.02290922775864601,
        -0.00041787512600421906,
        -0.018195953220129013,
        -0.09778857976198196,
        0.0024743375834077597,
        -0.002224312862381339,
        -0.03591606765985489,
        0.07629504054784775,
        0.061929117888212204,
        0.08936702460050583,
        -0.05545911565423012,
        0.039766356348991394,
        0.03190036490559578,
        -0.0026529296301305294,
        0.01586609147489071,
        -0.030973056331276894,
        -0.07765722274780273,
        -0.09737666696310043,
        -0.008928598836064339,
        -0.053489625453948975,
        0.0025646428111940622,
        -0.048772912472486496,
        -0.028224553912878036,
        -0.005070080980658531,
        -0.04412468522787094,
        0.009684470482170582,
        -0.08584139496088028,
        -0.03084939531981945,
        0.108235664665699,
        0.04686916247010231,
        -0.055309463292360306,
        -0.020114479586482048,
        0.01853819563984871,
        0.08830998092889786,
        0.027929730713367462,
        -0.029749533161520958,
        -0.025810472667217255,
        -0.051614101976156235,
        0.010007580742239952,
        0.029421668499708176,
        -0.07921436429023743,
        0.022204043343663216,
        -0.07604064047336578,
        0.03353089466691017,
        -0.03162839636206627,
        -0.02406158298254013,
        -0.018228985369205475,
        -0.023626644164323807,
        0.026669252663850784,
        0.008917822502553463,
        0.02460893988609314,
        -0.026695631444454193,
        0.08636387437582016,
        -0.027650801464915276,
        0.0028831514064222574,
        -0.0082734739407897,
        0.039059560745954514,
        -0.03270633518695831,
        0.09544404596090317,
        0.0647890567779541,
        -0.12080260366201401,
        0.018623672425746918,
        -0.027321331202983856,
        -0.019858548417687416,
        -0.005789157934486866,
        0.03040362149477005,
        -0.0685800239443779,
        -0.005019503645598888,
        0.06868290901184082,
        0.025194071233272552,
        0.04298977181315422,
        -0.027872364968061447,
        -0.09011495113372803,
        -0.011185774579644203,
        -0.028875576332211494,
        0.025832464918494225,
        -0.045567139983177185,
        0.014319689013063908,
        -0.0323333814740181,
        -0.03779170662164688,
        0.02116645872592926,
        -0.007239168509840965,
        -0.005612840410321951,
        -0.04688679799437523,
        0.03958015888929367,
        0.05516156554222107,
        -0.06361252814531326,
        0.03026958927512169,
        0.029228059574961662,
        -0.017652232199907303,
        0.11510783433914185,
        -0.04335896298289299,
        -0.009009639732539654,
        0.04918919876217842,
        0.09320216625928879,
        0.007972314022481441,
        0.10788549482822418,
        0.06322862207889557,
        -0.010573097504675388,
        0.010047616437077522,
        0.06531186401844025,
        -0.015323522500693798,
        -0.02500777319073677,
        6.623854096217957e-33,
        0.019791442900896072,
        0.08400276303291321,
        -0.007871151901781559,
        0.08622851222753525,
        -0.008067639544606209,
        0.08993426710367203,
        -0.044731903821229935,
        0.002455637790262699,
        -0.027895815670490265,
        -0.06555303186178207,
        -0.009806692600250244,
        0.05319206416606903,
        -0.007854918949306011,
        0.06469786167144775,
        -0.06444749981164932,
        -0.019434118643403053,
        -0.003888655686751008,
        0.008654313161969185,
        -0.02197244204580784,
        -0.040956828743219376,
        0.06804073601961136,
        -0.005490112118422985,
        0.05213695019483566,
        0.07400862127542496,
        0.01907772198319435,
        0.027748703956604004,
        0.029357388615608215,
        -0.057142823934555054,
        0.10708246380090714,
        0.028263235464692116,
        -0.05596500635147095,
        0.040261175483465195,
        -0.04329284280538559,
        0.00010251057392451912,
        0.04851832985877991,
        0.03790174424648285,
        -0.009400730021297932,
        -0.09174875915050507,
        0.008152858354151249,
        0.05360884964466095,
        -0.051024485379457474,
        0.0566633976995945,
        -0.01837833784520626,
        -0.11466065049171448,
        -0.02353251539170742,
        -0.0010695018572732806,
        0.018476832658052444,
        -0.06073809042572975,
        0.03335937485098839,
        0.008656822144985199,
        -0.03903565928339958,
        0.050396502017974854,
        0.0012024686438962817,
        0.07458360493183136,
        0.014548791572451591,
        -0.08126887679100037,
        -0.013336004689335823,
        -0.03562619537115097,
        -0.04324755817651749,
        -0.11666534841060638,
        0.015338774770498276,
        -0.03469272702932358,
        0.004988589324057102,
        -0.012128950096666813,
        -0.003931703511625528,
        0.004443882033228874,
        0.020737167447805405,
        0.05332747846841812,
        -0.035643454641103745,
        0.023999322205781937,
        -0.023027444258332253,
        0.08293849229812622,
        -0.09121239185333252,
        -0.019166547805070877,
        -0.11131169646978378,
        0.07439252734184265,
        0.0005256012082099915,
        -0.030928349122405052,
        0.06044505909085274,
        0.06511781364679337,
        -0.0011594768147915602,
        -0.008236370980739594,
        -0.04142935574054718,
        -0.09036674350500107,
        0.014358018524944782,
        -0.06952039152383804,
        6.220583600224927e-05,
        -0.02697395347058773,
        0.030726151540875435,
        0.059173036366701126,
        -0.049287036061286926,
        -0.012550586834549904,
        -0.04457848519086838,
        0.11412111669778824,
        -0.09589852392673492,
        -8.664106009010445e-33,
        -0.08745584636926651,
        0.0218088086694479,
        -0.04601537436246872,
        0.03410641849040985,
        -0.00787421129643917,
        -0.06018674001097679,
        0.00950484536588192,
        -0.005484743509441614,
        0.08751264214515686,
        0.03888143599033356,
        -0.07736174017190933,
        -0.06752200424671173,
        0.03144948557019234,
        0.006064699962735176,
        0.09086965769529343,
        0.023410482332110405,
        0.005834235344082117,
        -0.06671810895204544,
        -0.059252530336380005,
        -0.06328365206718445,
        0.05268784984946251,
        0.05732593312859535,
        -0.15166862308979034,
        -0.025044066831469536,
        0.0575154647231102,
        0.02427636831998825,
        -0.005983911920338869,
        -0.032917894423007965,
        0.037991732358932495,
        0.007761672604829073,
        -0.03151465207338333,
        0.06165020912885666,
        -0.06816578656435013,
        0.00036068784538656473,
        0.06449497491121292,
        0.0864148885011673,
        0.03273877874016762,
        -0.03282371908426285,
        -0.022164905443787575,
        -0.11769211292266846,
        0.06686872988939285,
        0.03106559067964554,
        -0.08731082826852798,
        -0.07431575655937195,
        -0.026308706030249596,
        -0.03203947842121124,
        -0.08404026925563812,
        -0.010292548686265945,
        -0.043638333678245544,
        -0.007787999697029591,
        0.02411150187253952,
        -0.026849519461393356,
        0.0943816676735878,
        -0.08554846048355103,
        -0.0671907514333725,
        -0.08246802538633347,
        0.02595997229218483,
        0.026510562747716904,
        0.02325722575187683,
        -0.002440554788336158,
        -0.024573009461164474,
        -0.013606633059680462,
        -0.008238566108047962,
        0.003810115158557892,
        -0.05027495324611664,
        0.008702248334884644,
        0.04049161821603775,
        0.05420704185962677,
        -0.048647355288267136,
        -0.05759032815694809,
        0.13789524137973785,
        -0.0058443197049200535,
        -0.0498269647359848,
        -0.01138375885784626,
        -0.008803128264844418,
        0.07361944764852524,
        -0.02222183346748352,
        -0.07389794290065765,
        -0.06797304004430771,
        0.004903582390397787,
        8.148764754878357e-05,
        -0.004375732969492674,
        0.08847248554229736,
        0.015753529965877533,
        0.030231591314077377,
        0.011319508776068687,
        0.011081626638770103,
        0.05929121747612953,
        -0.08118600398302078,
        0.03091682679951191,
        -0.03896045684814453,
        -0.06629598885774612,
        -0.03211447224020958,
        0.08432428538799286,
        0.0029473253525793552,
        -5.7882335369185967e-08,
        -0.04170135408639908,
        -0.1008259654045105,
        -0.02501107193529606,
        0.04167450964450836,
        0.04364103823900223,
        -0.007343776524066925,
        -0.021419337019324303,
        0.016447775065898895,
        -0.01857137121260166,
        0.058499470353126526,
        0.03509717434644699,
        0.030615732073783875,
        -0.013814293779432774,
        0.014469546265900135,
        0.14879605174064636,
        0.01597505807876587,
        -0.02606142684817314,
        -0.08438005298376083,
        0.017708949744701385,
        -0.00031724091968499124,
        0.08814787119626999,
        -0.0741676613688469,
        -0.06441003829240799,
        -0.017835311591625214,
        -0.02757299318909645,
        -0.04052898660302162,
        -0.06596221774816513,
        0.027191167697310448,
        -0.084644615650177,
        0.05559895187616348,
        -0.07851621508598328,
        0.027801362797617912,
        0.03161966800689697,
        -0.03347840905189514,
        -0.01907862164080143,
        -0.047722265124320984,
        -0.03009572997689247,
        -0.08486703783273697,
        0.03604138270020485,
        0.0409475676715374,
        0.06057807058095932,
        0.008222157135605812,
        0.024031557142734528,
        -0.01586388796567917,
        0.02585909329354763,
        0.005799795966595411,
        -0.02678382396697998,
        -0.09045775234699249,
        -0.009058062918484211,
        -0.04580368474125862,
        -0.04083755984902382,
        -0.03703197091817856,
        0.08488007634878159,
        0.07711079716682434,
        0.043155487626791,
        -0.033296022564172745,
        0.03317826986312866,
        0.04623030126094818,
        0.007214052602648735,
        0.02634846605360508,
        -0.0037641434464603662,
        0.054742541164159775,
        0.03421283885836601,
        -0.04652852937579155
    ]
}