{
    "id": "g7eS1qMFENM",
    "title": "Vlog University - Day 1",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-02-14T18:48:51Z",
    "video_url": "https://www.youtube.com/watch?v=g7eS1qMFENM",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "vlog university"
    ],
    "views": 129092,
    "likes": 4804,
    "comments_count": 350,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Thank you all so much for being here. This is kind of crazy because I've told this story probably 45 million times at this point, but Vlog University was just a little YouTube show that I made over ten years ago. I bought the domain, I squatted on the Twitter, and the Instagram. I had it all for so long, and then when we were thinking about this conference we were like, \"What could we call it?\" I said, \"Well, I've had this domain for 10 years why don't we put it to use?\" And we were like this is so perfect! - [Announcer] Please welcome Josh Sundquist. (audience cheering) - [Justine] Give it up for Josh everybody! (audience cheering) - And this child saw me and she turned to her mom and she's like \"Mommy, mommy, mommy! That man's leg fell off! Ahhhh!\" (audience laughs) (audience claps) - Oh my goodness Vlog University is about to start let's go chat with Josh really quick. - [Justine] That was so good! - Oh thank you so much, thank you for having me. - It was amazing. - It was fun to be a part of your conference. - Oh my gosh. - It's really an honor to get to open it and with the keynotes. - No I mean it was an honor for me that you did this this is so cool, I am so excited. (upbeat music) So I know I'm heading to to Nicki's sum-session it has already started so we're going to kind of sneak in. She's going to be talking about the right camera for the job Wooo! Yay! - [Nicki] Well I was definitely... - I love her, she's amazing! - Whether you have shot videos and then you go on to pause and then you're like \"Oh the transition is too short!\" - She's so cool. (upbeat music) - We're setting up for my panel now it's going to be talking about mobile production. You guys have seen me post tons of videos about this but now I had to condense everything that I know into a one hour kind of presentation. I don't do this stuff that often so making a keynote presentation to try to teach people stuff was a whole 'nother experience. But I am really excited to share. I think I got too much stuff. - [Justine] I feel like there are people that you can reach on different platforms so it's never dismiss Snapchat just because you think 'Well my audience isn't there'. People are on pretty much everything which is my initial kind of entrance into this space. (upbeat music) (gasping in breath) I survived, I did it, everyone had great questions we had a little giveaway of the DGI Osmos so thank you DGI for giving me one of those to give away. But I think it went well. Do you want to be in my video? - OK. - He came all the way from Brazil! - Yes, all the way Brazil for Vlog University. - That is so cool like I want to cry. That is so cool. - Yeah. - Thank you so much, I just hope you can leave here inspired and learn some stuff to - Definitely. - To help your channel, what's your channel? - It's brunoalsvesenglish, thank you so much! - Yes, thank you. Okay so we're going to be doing some giveaways, this is the VIP lunch so I'm getting to go around and chat with everybody so it's been really cool to say \"Hi\", I want to go let you guys meet Emily. Emily I think, I know a lot of you guys watch my videos but I think she could quite possibly rival some of you for the biggest fan. Do you want to say high to my vlog? - Hi! - This is Emily, I was just saying that some people say that they're the biggest fan but I was like 'I think that Emily might be the winner' (laughing) Thank you so much for coming! - I love you so much! - Aw! - Thank you. I actually got something for you. - You did? - Yes, so me and some of my friends, we, I have a lot of Internet friends that I met because of you and so we sent me messages and stuff so we made a little scrapbook. - Oh my gosh this is so cool! Oh look at little baby Bren! Oh my gosh this is amazing! Oh wow! This is... - [Fan] You're going to have to do some reading! - Yeah I'm going to have to do some reading! This is so... Oh my gosh! (gasps) - [Fan] Yeah. - This is amazing oh my gosh I'm going to read all of this. - Okay! - Not tonight but tomorrow after Vlog University. - Yes. - I can reminisce, this is so amazing. - And I also got you the little pigs, I know you love pigs. - Oh! I do! - Thank you oh my gosh this means so much to me! Thank you. - [Background Woman] What about Maddie's gift? - Oh yeah, also one more thing. I got this from Maddie. - Maddie has a gift? - Yeah. (upbeat music) - So what's happening right now is we're doing a 4 person shoot using double take. You guys may have seen Jenna and I make this video about this. - So we're recording - This is so weird because (inaudible) - Are we recording? - Yeah we're recording right now. - It feels weird being this close. (laughs) - Yeah! - I don't know if I should be looking at the camera or you guys, like this is so crazy! Hi! This is the first double take four way interview here this is pretty impressive. I'm impressed. This is a good mobile gig. - Mark you impressed Justine it's so awesome. - I'm impressed. - Hi Francesca. - Hi Justine. - Oh my goodness we're at Vlog University right now if you haven't been able to tell from this entire video well we're about to do a session where Francesca does my make up. - I'm Francesca. - She's Francesca. We've been working together for a very long time. - I think a decade. We have fun doing it. - Francesca is going to be doing a session here I'm going to take my makeup off and then she's going to put some more makeup back on. And then we're going to carry on. - Carry on. Carry on. - I was going to try to think of a song but I couldn't. - Behind the scenes editing. Conner's on edit duty. I'm taking my makeup off for my next session. It's looking so good! - I don't know that changed but hopefully it didn't mess things up. - Here it is! So good, so good! Oh my gosh it's so perfect it's so good I love it. - [Conner] Its working? - Yes I love it! - I just like to just take this blush, I pinch it and then I just run it across the crease like that. Okay open, look at the camera. It makes you look like you got a little bit of eyeshadow. Just a little. (upbeat music) - Oh my goodness, where did all this stuff come from? We have a lot of amazing sponsors that made this expo night possible. But first we're going to stop by Joby. You guys know that I love Joby and they have a lot of awesome things. They gave all of our attendees a surprise in a gift. Jenna what are you getting? - Oh my gosh! - Hello! Thank you so much for being here! - Yes! - I mentioned you guys today, with this because I wanted to bring it but I could not find it in my office. - Oh you don't have one? - Yes! - You need another one! - I do! This is like the perfect starter kit. - [Joby] Can I get pictures? - [Justine] Of course! (boxes fumble) - [Collective] Oh gosh! - [Justine] I can't be trusted! I can't be trusted! Okay hold on. Hello? Hello? Hi, how's it going? So I just got one of these and I'm really excited to test it out. I love that it can work with iOS for my iPad, for my iPhone. Yeah we're definitely adding this to my mobile kit. Look it's my name! Hi, hi, hi, hi, hi! - Hi Justine! - Hello! - How are you? - I'm doing well. - I'm sorry I didn't mean to sneak up on you just getting (inaudible). - Ah, I'm shook. We got to say \"Hi\" to Black Magic, hello! Oh my gosh this is, this is a rig. Okay so I think this is probably something that we need to start vlogging with, what do yo think Tyler? How's the vlog? Oh yeah. No? Yes? I think so. I think so. And here's Saramonic as well. - These guys down here this is the new project that we just - [Justine] No way that looks so cool! - You get the bendable gimbal which also passes audio and this microphone. - [Justine] That's cool. - You get the bendable tripod, you get the V-mic mini, and you get a full on camera mount that you can use on your mobile device. - [Justine] I love this. - And the bag. - And the bag? - It comes with it as well. - Does this go? - [Male] That's the blink system. - [Justine] But I don't have this little guy does this go with my phone? - [Male] Absolutely. - This is what I needed this morning during my talk! I was talking about how I wanted, yes... - Plugs directly into your iOS inside here and then with the transmitters you already have you can stick the transmitters you already have right to this. - So much good stuff, yes, thank you! Thank you for being here! Oh okay! We've got Nanlight up next and these things we've been using non-stop, the tube lights, you guys saw me post about on Instagram. They're so cool. I'm just enjoying all the lights! - Ah, there's so much you can do with them, huh? - Ah, yes there really is. Giveaway time! (upbeat music) Day 1 I can't believe it. - Are you ready for day 2? - I, I am, I'm going to go home and go to bed, right now. - Well are you going to get some sleep though? - Yes I will, well as soon as I lay down I fall asleep. It's just game over. Thank you so much again. It was amazing, incredible incredible. - Perfect. - I'll see you tomorrow? - Yes if you're here. - Okay awesome. Hi, hi, hi! Hello, hello! I didn't actually get a chance to say \"Hi\" or talk to anybody, but it's so good. It's our Somi-squad! Camera Cam! Ooh ooh! What kind of gear did you guys bring today? - So we got (inaudible) there's a button, right? So you can shoot, shoot. Flip it around. - [Justine] Yeah. That's cool. - And it's Bluetooth. - [Justine] Nice, this is awesome. Oh my gosh. - Now if you push the side one, you can tort it. - I'm sold, I'm sold! (upbeat music) - And that is a wrap on day 1 of Vlog U I had so much fun and met so many amazing people. And one of the best pieces of feedback is that everyone had so much fun in the classes and they learned a lot, and they're inspired. And that is exactly what I want from this event and it happened. And we still have a whole 'nother day! So thank you guys for watching thank you to everyone who came here and that's, that's a wrap on day 1. Bye! (outro music)",
    "transcript_keywords": [
        "Vlog University",
        "gosh",
        "guys",
        "Vlog",
        "cool",
        "Yeah",
        "amazing",
        "love",
        "good",
        "University",
        "stuff",
        "Francesca",
        "goodness Vlog University",
        "Josh",
        "Emily",
        "kind",
        "people",
        "lot",
        "camera",
        "Day"
    ],
    "transcript_entity_values": [
        "one",
        "iPad",
        "DGI",
        "Conner",
        "Saramonic",
        "Justine",
        "tonight",
        "Vlog University",
        "Josh",
        "this morning",
        "Instagram",
        "4",
        "45 million",
        "10 years",
        "Brazil",
        "Twitter",
        "four",
        "Justine] Nice",
        "day 1",
        "Maddie",
        "Emily",
        "Nicki",
        "today",
        "Snapchat",
        "Francesca",
        "YouTube",
        "Nanlight",
        "Bren",
        "Tyler",
        "one hour",
        "ten years ago",
        "the DGI Osmos",
        "first",
        "tomorrow",
        "Black Magic",
        "day 2",
        "Somi",
        "Joby",
        "Jenna",
        "Josh Sundquist"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "NORP",
        "PERSON",
        "TIME",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "TIME",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON"
    ],
    "vector": [
        -0.005680910777300596,
        -0.06697259843349457,
        -0.05740997940301895,
        -0.14469541609287262,
        0.03091241605579853,
        0.02933328226208687,
        0.032394565641880035,
        0.0389695018529892,
        -0.02845977246761322,
        0.06519776582717896,
        0.029404664412140846,
        -0.00024107264471240342,
        -0.029010795056819916,
        0.01916847750544548,
        0.0026593164075165987,
        0.02460208348929882,
        0.02006266638636589,
        -0.04093710333108902,
        -0.022841373458504677,
        0.05745842307806015,
        -0.00868699885904789,
        -0.03977139666676521,
        0.029791612178087234,
        -0.004737942945212126,
        -0.023708660155534744,
        0.08902493864297867,
        -0.01564003713428974,
        0.041211050003767014,
        -0.06944720447063446,
        -0.08704443275928497,
        -0.057115957140922546,
        0.03531226888298988,
        0.1196388304233551,
        0.013338994234800339,
        0.028389763087034225,
        -0.04906685650348663,
        0.039119619876146317,
        -0.008752027526497841,
        -0.04009576514363289,
        0.004394021350890398,
        -0.02040368691086769,
        -0.051783788949251175,
        0.01603207364678383,
        -0.036194849759340286,
        -0.07406580448150635,
        -0.09571775048971176,
        -0.0019581723026931286,
        -0.05572593957185745,
        0.07072193175554276,
        0.07139800488948822,
        -0.09340746700763702,
        -0.018509389832615852,
        0.04390203207731247,
        -0.0024001868441700935,
        -0.10039477050304413,
        0.00596914766356349,
        -0.08723656088113785,
        0.028646603226661682,
        0.027981625869870186,
        -0.09475602209568024,
        0.012393893674015999,
        -0.032441314309835434,
        -0.011295121163129807,
        0.06645872443914413,
        -0.05929391831159592,
        -0.0792427808046341,
        0.036341313272714615,
        0.025945842266082764,
        0.011361770331859589,
        0.008841700851917267,
        -0.12749791145324707,
        0.06547847390174866,
        -0.04032889008522034,
        0.03745271638035774,
        -0.0015430261846631765,
        0.05465080216526985,
        0.029177051037549973,
        -0.05615312233567238,
        0.037809163331985474,
        0.03846798837184906,
        0.03711779788136482,
        -0.040055129677057266,
        -0.09072074294090271,
        -0.010683425702154636,
        -0.001366123673506081,
        0.025549449026584625,
        0.020962845534086227,
        0.012833869084715843,
        -0.02639155462384224,
        -0.08174951374530792,
        -0.09235598146915436,
        -0.028270764276385307,
        0.011972273699939251,
        0.010941877029836178,
        -0.002408874686807394,
        -0.04217258095741272,
        -0.04615417495369911,
        -0.06606100499629974,
        -0.013986245729029179,
        0.08868145197629929,
        0.023491578176617622,
        -0.04150170087814331,
        0.00928377453237772,
        -0.04033510759472847,
        -0.043440669775009155,
        -0.09301013499498367,
        -0.0434996597468853,
        0.05347086116671562,
        0.014127722010016441,
        -0.0017226389609277248,
        -0.040613994002342224,
        0.06904783099889755,
        -0.05930613726377487,
        -0.05953032895922661,
        0.03652295097708702,
        0.12397871166467667,
        -0.03182338923215866,
        0.05630579590797424,
        0.02354297786951065,
        -0.00029552436899393797,
        0.012363707646727562,
        -0.09301622211933136,
        -0.025425264611840248,
        0.04428378865122795,
        0.00020454051264096051,
        -0.011384977959096432,
        -0.06109107285737991,
        1.3517729530395363e-32,
        -0.010217543691396713,
        0.08533838391304016,
        0.021198567003011703,
        0.07018940895795822,
        0.0009304636041633785,
        -0.02090003341436386,
        -0.036489855498075485,
        0.11056332290172577,
        -0.05097958818078041,
        0.026686538010835648,
        -0.005153468810021877,
        0.06143711134791374,
        -0.01296981330960989,
        0.05904705077409744,
        0.0333111509680748,
        -0.04329948127269745,
        -0.026458080857992172,
        -0.03157779201865196,
        -0.06238993629813194,
        0.01631772145628929,
        0.018716983497142792,
        -0.03689635917544365,
        0.04608114808797836,
        0.07204049825668335,
        0.10294236242771149,
        0.08922682702541351,
        0.05541480705142021,
        0.00032731692772358656,
        0.09340451657772064,
        0.004944429267197847,
        -0.024576306343078613,
        -0.046352289617061615,
        -0.02637217938899994,
        -0.09905149787664413,
        0.007201673928648233,
        0.01421700045466423,
        -0.03527258709073067,
        -0.021909266710281372,
        -0.026586253196001053,
        -0.04461254924535751,
        -0.009369448758661747,
        0.030947532504796982,
        -0.07567960768938065,
        -0.06746814399957657,
        0.09406659007072449,
        0.038398854434490204,
        0.02783612534403801,
        0.08068105578422546,
        -0.03728814423084259,
        0.027309801429510117,
        -0.04106299579143524,
        0.0009439158602617681,
        -0.06584297865629196,
        -0.038566116243600845,
        -0.0060724541544914246,
        -0.07831186056137085,
        -0.007563647348433733,
        0.06663530319929123,
        0.028057727962732315,
        0.05239860713481903,
        -0.0018719377694651484,
        -0.006191133055835962,
        -0.01159946620464325,
        -0.016473745927214622,
        -0.06593336910009384,
        0.09259199351072311,
        0.04809889569878578,
        -0.06589063256978989,
        0.057304609566926956,
        0.04535875841975212,
        -0.012937238439917564,
        -0.017787715420126915,
        0.039377473294734955,
        -0.005257329437881708,
        0.06391943991184235,
        0.0743267759680748,
        -0.082831472158432,
        -0.057260431349277496,
        0.01964394561946392,
        -0.015530966222286224,
        -0.11318261176347733,
        0.052470847964286804,
        -0.034060824662446976,
        0.07723591476678848,
        -0.02805844135582447,
        -0.06911922246217728,
        0.03975537791848183,
        -0.030910130590200424,
        -0.02103952318429947,
        0.01623622141778469,
        -0.011675618588924408,
        0.0847487598657608,
        -0.06908678263425827,
        -0.031766459345817566,
        -0.03492933511734009,
        -1.3322159596513182e-32,
        0.013210305012762547,
        0.06016189977526665,
        -0.006426233798265457,
        -0.014362030662596226,
        0.06784886121749878,
        -0.01953287422657013,
        0.04107772931456566,
        0.06759662181138992,
        0.048103295266628265,
        -0.08799273520708084,
        0.05684756115078926,
        -0.08515558391809464,
        -0.11708702147006989,
        0.01836145855486393,
        -0.02948055788874626,
        -0.02191000059247017,
        -0.033893171697854996,
        -0.0652034729719162,
        0.02736588567495346,
        -0.012387736700475216,
        0.0726410448551178,
        0.1605488359928131,
        0.06753403693437576,
        0.016999030485749245,
        0.008863844908773899,
        0.005651748273521662,
        0.03324607387185097,
        0.03769788518548012,
        0.03796806558966637,
        0.042122066020965576,
        -0.01709740050137043,
        -0.07283025234937668,
        -0.061612509191036224,
        0.001335983513854444,
        0.06471384316682816,
        0.057198017835617065,
        0.06111784279346466,
        0.04544725641608238,
        -0.008208343759179115,
        -0.06022560968995094,
        0.03355451300740242,
        -0.003499674843624234,
        -0.01144882757216692,
        -0.01969772018492222,
        -0.008849786594510078,
        -0.11112073808908463,
        -0.06389657407999039,
        0.032487958669662476,
        0.01568647287786007,
        -0.011942208744585514,
        -0.06893652677536011,
        -0.07827957719564438,
        0.0024723876267671585,
        -0.01864766515791416,
        -0.009592519141733646,
        -0.004226697608828545,
        -0.06261412054300308,
        -0.01057364046573639,
        0.03752251714468002,
        0.005188168957829475,
        0.017932111397385597,
        -0.042907923460006714,
        -0.09501570463180542,
        -0.06795138865709305,
        0.0018662605434656143,
        -0.07513201981782913,
        0.08933839946985245,
        0.03505382314324379,
        -0.02894619293510914,
        -0.004515679553151131,
        -0.007033267989754677,
        0.022851908579468727,
        0.05919693410396576,
        -0.0011859068181365728,
        0.030374351888895035,
        0.003946565557271242,
        -0.08331409096717834,
        -0.0084297563880682,
        0.049942515790462494,
        -0.026146255433559418,
        -0.058863565325737,
        -0.034107863903045654,
        0.010258506052196026,
        0.09295236319303513,
        0.09243370592594147,
        0.11309175193309784,
        0.09703322499990463,
        -0.0359170138835907,
        -0.01514198537915945,
        0.04152705520391464,
        0.007691863924264908,
        0.06025516241788864,
        0.07017847150564194,
        0.11963490396738052,
        -0.08016101270914078,
        -6.780363293046321e-08,
        0.02426934987306595,
        0.0252057034522295,
        -0.03783046081662178,
        0.0024005300365388393,
        0.03594174608588219,
        -0.057433925569057465,
        -0.01843620091676712,
        0.013275046832859516,
        0.05456143617630005,
        -0.030696187168359756,
        0.06964705884456635,
        0.002805576892569661,
        0.0072259618900716305,
        0.11006205528974533,
        0.060773253440856934,
        0.011181771755218506,
        -0.09336487948894501,
        0.08266885578632355,
        -0.04341600462794304,
        -0.06878992915153503,
        -0.03564624860882759,
        0.04016955941915512,
        0.03580296039581299,
        -0.009589983150362968,
        0.0264542568475008,
        -0.004393325187265873,
        0.00994088500738144,
        -0.034258656203746796,
        0.03164298087358475,
        0.011889933608472347,
        -0.0441388301551342,
        0.03232569247484207,
        -0.002136171329766512,
        -0.04527554661035538,
        -0.05606190487742424,
        -0.04975961521267891,
        -0.03969928249716759,
        -0.018771354109048843,
        0.033817220479249954,
        0.009521295316517353,
        0.0019791750237345695,
        -0.12909796833992004,
        -0.04710220918059349,
        0.005078144837170839,
        0.030825791880488396,
        -0.052736930549144745,
        0.017149776220321655,
        -0.07929939031600952,
        -0.04574846848845482,
        -0.02638205513358116,
        -0.05242709070444107,
        0.05365573614835739,
        0.01898893155157566,
        -0.034537412226200104,
        0.05057143419981003,
        -0.0032010586000978947,
        0.032579392194747925,
        0.04374343901872635,
        -0.007872723042964935,
        -0.031743213534355164,
        0.04980548471212387,
        0.02233516052365303,
        -0.05549192428588867,
        0.019124431535601616
    ]
}