{
    "id": "gape0TpU3I4",
    "title": "Intel Core Ultra Explained",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-02-12T22:36:30Z",
    "video_url": "https://www.youtube.com/watch?v=gape0TpU3I4",
    "category": "Science & Technology",
    "tags": [
        "Intel",
        "AMD",
        "Apple",
        "AI",
        "NPU",
        "SOC",
        "NOC",
        "Tile Architecture",
        "TSMC",
        "Modular CPU",
        "Machine Learning",
        "Procyon"
    ],
    "views": 1244226,
    "likes": 41745,
    "comments_count": 1968,
    "description": "Sign upfor an account at If you want to get access to extra features, get 20% off Grammarly Premium.  Save 10% and Free Shipping at Ridge by using offer code LINUS at   Intel's Meteor Lake Core Ultra mobile chips are here, and they're exciting! Nearly DOUBLE the iGPU performance but... at what cost? And what is an NPU? And why are they changing the name? And when will this video description be over?  Discuss on the forum:   Buy an ASUS Zenbook 14 OLED:  Buy a Framework 13:  Buy an Acer Swift Edge:  Buy an Apple 14\" M3 MacBook Pro:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:17 Gaming Performance 4:15 Productivity Performance 8:20 NPU 9:30 Tile Architecture 11:30 NPU Benchmark 12:11 New Naming Scheme 14:20 Conclusion 16:31 Outro",
    "description_links": [
        "https://grammarly.com/LTT02.",
        "https://www.ridge.com/LINUS",
        "https://linustechtips.com/topic/1557762-i-wanna-invest-in-intel-not-advice-%E2%80%93-core-ultra-explained/",
        "https://lmg.gg/RoCSq",
        "https://lmg.gg/tB7s7",
        "https://geni.us/CLdXbcB",
        "https://geni.us/1wfGZsf",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "One of our top videos of all time is explaining what the heck i7, i5, and i3 mean. So, Intel fixed it by making it worse. What exactly is a Core Ultra 7 155H? I can't blame you for having no idea because even Intel doesn't seem to know how this is gonna work when the entry-level mobile and the desktop chips launch. I mean, how can one be Ultra, but also mid? And what is this? Just two high-performance cores? What is ultra about that? The good news is that Intel's new Meteor Lake chips are legitimately exciting and Naming aside, if they are an indication of where Pat Gelsinger's Intel is headed I think we are seeing the first signs of a reestablishment of Intel's old dominance. Exhibit A, the Asus ZenBook 14 OLED. It packs a Core Ultra 7 155H, which means something. Here's a quick message from our sponsor first. The Ridge! Looking for a stylish and practical wallet? Well, look at this thing. It's the Ridge wallet. It's got a minimalist design and allows you to carry all your essential cards and cash without the bulk. Check out the link below and use code LINUS to save 10% off your purchase and get free shipping. To compare against our Core Ultra ZenBook, we chose a Framework 13, investment disclosure, with Intel's last generation 1370p, an Acer Swifty, sorry, Swift Edge with AMD 7840U, and a 14-inch M3 MacBook. More on that one later. First, let's talk results. Straight out of the gate, our Meteor Lake Core Ultra 7 155H annihilates Intel's last-gen Core i7 1370p in nearly every game we tested. Hopefully Framework is working on a Core Ultra upgrade because, dang, Cyberpunk at 1080p on integrated graphics? It is now playable at 30 FPS average instead of just 16. Not only that, it's nipping at AMD's heels. Rocket League? That is almost 69% nicer than last year's model. And wait a minute. What's this? A clear win over AMD? Well, not quite. If we look closely at the all-important 1% lows, the gains aren't quite as impressive, especially in Rocket League, where we can't even hear AMD's victory speech because they already dropped their mic so many times they broke it. But, with that said, I love the trajectory that I'm seeing here. In one generation, we are still on first-generation Intel Arc. Intel has gone from basically unusable to, hey, this thing's kind of viable. Let's bolt it onto our CPUs so all of a sudden they can AAA game. Dota 2 running on DirectX 11? Big win for Arc. Shadow of the Tomb Raider? Another one. Total War Pharaoh? Another one. Grid Legends? Not so much, but Intel is adamant that they are seeing better results on their system for this one, so hopefully that's just a bug that needs to be squashed. Now, you may have noticed Apple's M3 MacBook Pro sneaking into our gaming slides there. And if you consider Apple's push toward the gaming crowd with their Metal API, it makes sense. We thought it would only be fair to choose the most price-appropriate model and see what it can do in comparison. As it turns out, even though we're going through a Rosetta or Vulcan translation layer on both Tomb Raider and Dota, the answer is surprisingly well. Take a look at Dota 2 using Vulcan. Okay, yes, running all the systems on Vulcan does harm our Windows machines results a little bit, but Apple is beating AMD's results both on Vulcan and on DX11. Like Intel, Apple is still struggling with frame time consistency, and you can see that in the 1% low results. But again, this is all about trajectory, and Apple has also gone from gaming loser to gaming varsity jock practically overnight. Speaking of post-secondary, the dropout sweater, lttstore.com? Anyway, there's still a giant blue elephant in the room, and that is non-gaming performance for Core Ultra. It's a kind of a mixed bag. Let's start with handbrake. Encoding Big Buck Bunny at 1080p with h.264. In performance mode, we get almost 63 frames per second. That keeps up with both Apple and AMD while beating our framework with the last-gen 1370p. All right, but step that up to our 4k footage of Red Dead Redemption 2, and Intel's Core Ultra looks more like a Core... Somehow, it even fell behind the last-gen 1370p. I mean, it's okay, it's not like they lose by a lot, but regression from one generation to the next, and look what happens when we encode with AV1. Yikes. Apple rockets into its own performance class entirely in our Big Buck Bunny 1080p test, with Core Ultra falling into last place again, and 4k Red Dead is a similar story with Apple in lead, and Intel's latest in dead last. One notable X factor here, though, is that AMD pulls off a clear win not in speed, but in file size. So, they might be going slower than Apple, but you're gonna end up with near-identical quality in files that are up to 15% smaller than the competition. Encoding isn't our Core Ultra 7's only weak point either. In our Chrome benchmark, which is admittedly not the best showcase of Apple's typical browser capabilities, Sorry, Safari. Intel's new hotness loses again in Jetstream 2 and in MotionMark. It does beat AMD in speedometer, but it loses handily to both its own predecessor and to Apple. Oh, speaking of Jetstream, we've also got Ludwig's bidets in stock on lttstore.com, the Swype and Swype Plus. That stream is sure to leave you nice and clean every time you do your business. Do your business? Can we just say poop? We'll say poop. Moving on to Cinebench. Multicore looking pretty good, thanks to those two extra low power efficiency cores. More on those and the NPU later. But the reduced clock speed really seems to hurt our single core performance and Puget Bench's Photoshop benchmark reveals a similar story where the new chip is actually slower than last gen. Intel, what have you done in search of better onboard gaming performance? You've given us so much. But at what cost? Not as much as you might think. It's not all doom and gloom on the productivity side. When it comes to 7-zip compression, for example, wow, the 155H smokes the competition in both standard and performance mode. And while Photoshop wasn't great in the Premiere Pro benchmark, it manages a very confident looking win. But wait a second. What happened with Apple? Well, here's the thing. You can find all of these laptops at the links down below. But to save you a bit of trouble, the Asus costs about $1,300 with 32 gigs of RAM. The Acer, also $1,300, 16 gigs of RAM. And our price competitive MacBook Pro? Well, it's only sort of price competitive to start with at $1,600. But more importantly comes with only 8 gigabytes of memory, which was not enough to complete this test without the program crashing. Now we could spend yet another $200 and have 16 gigs of RAM in it. But then we'd be pitting our Windows machines against something that costs over 30% more money, which seemed a little silly when the rest of the results do a pretty good job of showcasing the M3's potential. And this allows me to make a point to Apple. Guys, you've done this to yourself. Please stop selling 8 gig professional machines. You saved like 15 to 20 dollars on your bill of materials, but on any workload that goes to a swap file, you are embarrassing yourselves. You're not the only one. Intel didn't do too well in Blender either. And, you know, overall, mediocre improvements or even worse performance can be super disappointing when you're testing the new hotness. But it's kind of hard to stay mad because while one window might have narrowed, it's like an entirely new door has been flung open. Because aside from gaming performance, Meteor Lake has another really cool trick up its sleeve. Let's talk about the new neural processing unit or NPU. Your current CPU and GPU combo can already handle AI workloads like stable diffusion or using generative fill in Adobe Photoshop. So I don't blame you for asking. Why exactly do we need an NPU? Well, let me tell you. An NPU is an integrated AI accelerator designed to enable new and enhanced experiences with the power efficiency required for mobile platforms. We're gonna do a full explainer over on Techquickie, but in a nutshell what this corporate marketing jargon means is that it helps to alleviate the strain on your CPU and GPU using processors that are more optimized for these loads. It's kind of like when PPUs or physics processing units came out almost 20 years ago, except that this time we just skipped the part where it's a dedicated card and went straight to adding a tile to the CPU that lights up when you're doing speech-to-text or background audio removal or whatever. Okay, wait. Tile? This is where Meteor Lake gives us an exciting glimpse into Intel's future. It's their first tile-based CPU, packaging together several pieces of silicon on one chip rather than using a traditional monolithic die. You've got your main CPU tile, which is built on the Intel 4 process with Redwood Cove P-Cores and Crestmont E-Cores, an I-O tile for connectivity features like Thunderbolt and additional PCIe lanes, a TSMC manufactured GPU tile for your ARC graphics, and then there's the really interesting TSMC manufactured SOC tile. This bad boy has actually got two LP or Low Power Island E-Cores that'll handle light tasks, allowing the main P and E-Cores to be powered off completely to extend battery life. It's got Wi-Fi 6E, which is supposedly upgradable to Wi-Fi 7 later, and Bluetooth 5.4, a NOC or network-on-chip to interconnect all the different parts of the SOC, and they've even managed to pack the Xe media and display engine here, rather than using the GPU tile for your display out and simple video decoding tasks. It's got some other stuff, like USB 3 and 4, Ethernet, audio security, etc. And it's got that shiny new NPU block. The reason that I'm so excited about this is that suddenly Intel can take a more modular approach to CPU design. I mean, look at how AMD can turn a single core complex die design and then repackage it into anything from a basic desktop processor to a beastly server or workstation chip. Well, that is similar to what we're looking at here. New Wi-Fi? Plonk. New CPU core architecture? Plonk that in. New ARC battle-mage graphics? Plonk that too. TSMC's got a new node that you haven't figured out yet? Go ahead and plonk that as well. I see this modular design approach making Intel far more agile and improving their competitiveness in a big way. Coming back to the NPU, we don't really have a great benchmark for testing these things yet, and we don't even have another NPU to drag race it against. But in the Procyon machine learning inference benchmark, we got 241 points, which is heads and tails above everything except for the ARC graphics that Intel included on the very same chip. However, that doesn't mean it's a dud. What's impressive about this result is that our power consumption drops considerably when we push these workloads onto the NPU. So it might not be long before this is the part of your computer that's doing the lifting instead of your graphics cards, at least when it comes to light, everyday machine learning tasks. Which leads us finally into our discussion about the new naming conventions, because I'm starting to think they used machine learning to come up with these. All we've got right now is high-end mobile, and the first thing is that after 15 years of begging, Apple finally convinced Intel to stop calling things i-something. Instead, we're gonna have Intel Core and Intel Core Ultra, followed by what Intel calls the brand level. These are somewhat familiar and denote what sort of power level you can expect. 3, 5, and 7 for the more mainstream core processors, and then 5, 7, and 9 for the more premium core ultra chips. And yes, that's a lot of overlap. Bigger numbers will generally indicate more cores, faster ones, and bigger caches though, with smaller ones being the opposite. You guys still with me? Great. Next, we've got the processor number, which is broken down into series, skew number, and suffix. You can think of it almost like a hard reset of the product stack. So Meteor Lake, that's what we've got now. That's the first in the series, hence the 1 in our Core Ultra 7 155H. Converting back to the old system for a moment, this is nth gen, and a nth gen replacement of this should be a Core Ultra 7 255H, and then so on and so forth, until they change it, because who knows? Model numbers are arbitrary anyway. The skew number is where it gets a bit more complicated. I know, right? More complicated anyway. This is where the numbers get a little more different from what we're used to. The big curveball is that the skew number can be reused across different chips within the same generation. More on that later. Anyway, these denote multiple tiers within a stack. So for example, the Intel Core Ultra 5 135H and the 125H are similar, but the 135H has a 100 megahertz clock bump. Finally, there's the suffix. I assume that K and T will be back on the desktop to denote overclockable and low power chips, but so far we only have mobile and we only have two letters, H or U. H chips are typically more power hungry, while U chips are meant for ultra slim devices that use less power. This also has some precedent, but the problem with this is that combined with the possibility for skew number reuse, which I mentioned before, it means that you can have no idea how performant a processor is until you get to the suffix. So Intel claims that they were trying to simplify things, but in my opinion, they have just made them more confusing. No, mom. Sorry, but that Core Ultra 7 165U sucks. I need the Core Ultra 7 165H because not only does it have more GPU cores, it has three times the performance cores and double the cache. There's a lot to like about Meteor Lake and I love Intel's push to reinvest in process node leadership and build out a competitive foundry business. I'm not an analyst and this is not financial advice, but I'm excited about where they're going. What I'm not excited about is explaining this new naming scheme to friends and family that are looking to purchase a new laptop over the next few years. I am also excited, though, to tell you about our sponsor. Thanks to Grammarly for sponsoring this video. Here at Linus Media Group, we're committed to constantly improving our writing. That's where Grammarly steps in. Grammarly's secure AI writing partner helps our business team write better so they can get their work done faster. You can give your writing greater impact by asking Grammarly to help paraphrase. It can make your sentences sound more persuasive or sympathetic. Really, anything you want. But that's not all. Grammarly helps you save time with their reply feature. It can summarize emails and suggest responses so you can spend seconds in your inbox instead of hours. It's not fun in there. And Grammarly is committed to keeping your data private and secure. They'll never sell your data, so it won't be used to bombard you with ads, and third parties can't use it to train their AI. Sign up for an account and download the desktop app, mobile app, and browser extension for free using our link Grammarly.com slash LTTO2. And if you want to get access to extra features, get 20% off Grammarly Premium. If you guys enjoyed this video, make sure to check out the last time we explained Intel's naming scheme. It was a simpler time back then. Back then. Back then.",
    "transcript_keywords": [
        "Intel Core Ultra",
        "Core Ultra",
        "Intel",
        "Core",
        "Intel Core",
        "Ultra",
        "Lake Core Ultra",
        "Apple",
        "core ultra chips",
        "Meteor Lake",
        "Meteor Lake Core",
        "premium core ultra",
        "Intel lastgen Core",
        "AMD",
        "Core Ultra ZenBook",
        "cores",
        "Core Ultra upgrade",
        "NPU",
        "Core Ultra falling",
        "Pat Gelsinger Intel"
    ],
    "transcript_entity_values": [
        "one",
        "100 megahertz",
        "Acer",
        "the next few years",
        "MacBook",
        "9",
        "One",
        "Meteor Lake Core Ultra 7",
        "M3",
        "10%",
        "Tomb Raider",
        "125H",
        "GPU",
        "Core Ultra 7 155H.",
        "241",
        "AI",
        "1",
        "USB 3 and",
        "Cinebench",
        "FPS",
        "AMD",
        "Meteor Lake",
        "E-Cores",
        "three",
        "7",
        "Chrome",
        "MacBook Pro",
        "Intel Core",
        "almost 69%",
        "7",
        "LINUS",
        "Dota",
        "Apple",
        "first",
        "Intel Arc",
        "Intel Core Ultra",
        "Premiere Pro",
        "last year's",
        "First",
        "32",
        "Core Ultra 7 165U",
        "seconds",
        "Red Dead Redemption 2",
        "Blender",
        "Core Ultra",
        "Dota 2",
        "4",
        "135H",
        "Jetstream 2",
        "almost 20 years ago",
        "Core Ultra 7's",
        "MacBook Pro",
        "M3",
        "hours",
        "CPU",
        "Grammarly Premium",
        "Wi-Fi 6E",
        "New Wi-Fi",
        "NOC",
        "third",
        "Core Ultra ZenBook",
        "TSMC",
        "Rocket League",
        "Puget Bench's",
        "Intel",
        "Ethernet",
        "Xe",
        "Ridge",
        "Swype",
        "Linus Media Group",
        "Big Buck Bunny",
        "Redwood Cove P-Cores",
        "Swift Edge",
        "Pat Gelsinger's",
        "16",
        "DirectX 11",
        "Techquickie",
        "Crestmont E-Cores",
        "Meteor",
        "Vulcan",
        "Meteor Lake",
        "30",
        "3",
        "15 years",
        "20%",
        "Safari",
        "14-inch",
        "15%",
        "only 8 gigabytes",
        "Framework 13",
        "1,300",
        "two",
        "almost 63",
        "Ludwig",
        "second",
        "SOC",
        "about $1,300",
        "the Intel Core Ultra 5",
        "K",
        "Asus",
        "Thunderbolt",
        "1,600",
        "Adobe Photoshop",
        "Arc",
        "200",
        "4k",
        "1%",
        "over 30%",
        "AAA",
        "the Core Ultra 7",
        "Grammarly",
        "RAM",
        "8",
        "Procyon",
        "5",
        "Low Power Island",
        "last generation 1370p",
        "AMD",
        "a second",
        "5",
        "MotionMark",
        "overnight",
        "Dota 2",
        "Rosetta",
        "15 to 20 dollars",
        "a minute",
        "Jetstream",
        "U. H",
        "Acer Swifty",
        "Buck Bunny",
        "NPU",
        "Wi-Fi 7 later",
        "Naming"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "LOC",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "LAW",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "FAC",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "QUANTITY",
        "EVENT",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PERCENT",
        "PERCENT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "LOC",
        "DATE",
        "PRODUCT",
        "TIME",
        "DATE",
        "GPE",
        "TIME",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "TIME",
        "LOC",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "FAC",
        "WORK_OF_ART"
    ],
    "vector": [
        -0.12365832179784775,
        -0.06531144678592682,
        -0.016622496768832207,
        -0.00934872217476368,
        0.1285458654165268,
        -0.00916590541601181,
        -0.04663556069135666,
        0.05983873829245567,
        -0.008483147248625755,
        0.02339080721139908,
        0.022955164313316345,
        0.012557550333440304,
        -0.06682991981506348,
        -0.037994399666786194,
        0.02198486588895321,
        -0.005168834235519171,
        0.08646617829799652,
        -0.14944884181022644,
        -0.034019552171230316,
        -0.010167174972593784,
        0.021733969449996948,
        0.0013765597250312567,
        -0.009363471530377865,
        -0.04546259343624115,
        0.057294927537441254,
        -0.007911508902907372,
        0.03690575063228607,
        -0.09753771871328354,
        0.053830839693546295,
        -0.0063620675355196,
        0.0019032955169677734,
        0.06460506469011307,
        0.029047194868326187,
        0.013960800133645535,
        0.028636565431952477,
        -0.09959712624549866,
        0.02269580401480198,
        -0.09336128830909729,
        -0.09302607923746109,
        -0.10878759622573853,
        -0.0023891357704997063,
        -0.07007376104593277,
        -0.031018486246466637,
        -0.021721618250012398,
        0.027568701654672623,
        -0.03288940340280533,
        0.008416579104959965,
        -0.05746220424771309,
        0.047351472079753876,
        0.002565832808613777,
        0.02835806831717491,
        -0.0803302526473999,
        -0.044633373618125916,
        -0.06757012009620667,
        -0.04537835717201233,
        0.039306752383708954,
        0.0163524579256773,
        -0.03705768659710884,
        0.024257276207208633,
        0.05599530041217804,
        0.04666009172797203,
        -0.10789315402507782,
        -0.004667074419558048,
        0.12605710327625275,
        0.029688023030757904,
        -0.03774336352944374,
        0.029394714161753654,
        -0.018841033801436424,
        -0.0344943031668663,
        -0.06986064463853836,
        0.07767422497272491,
        -0.04186972603201866,
        0.05922901630401611,
        0.0557977631688118,
        -0.00025337268016301095,
        -0.02332090027630329,
        0.10606584697961807,
        -0.01295023038983345,
        0.0383501760661602,
        0.01813574880361557,
        -0.010076391510665417,
        0.006881470326334238,
        0.033514875918626785,
        -0.012619519606232643,
        0.05826107785105705,
        0.01431620679795742,
        0.05506787449121475,
        -0.017115842550992966,
        -0.022857340052723885,
        -0.08629783987998962,
        0.01717766560614109,
        0.006223535630851984,
        0.029843827709555626,
        0.04604540765285492,
        0.03701527789235115,
        0.005359326954931021,
        0.01080163661390543,
        -0.053323227912187576,
        -0.018890636041760445,
        0.056607868522405624,
        -0.017131643369793892,
        0.04458056017756462,
        0.07594769448041916,
        -0.03026401810348034,
        -0.09490332752466202,
        0.025605250149965286,
        0.0401429645717144,
        0.04160274937748909,
        0.01051174197345972,
        0.07280264049768448,
        -0.0034768315963447094,
        0.04923182353377342,
        -0.04611623287200928,
        -0.022645508870482445,
        0.0002581335138529539,
        -0.05128628388047218,
        -0.008945389650762081,
        0.016937056556344032,
        0.09866943210363388,
        0.05812936648726463,
        -0.05550088733434677,
        -0.017525026574730873,
        -0.03600062429904938,
        0.03007047437131405,
        -0.05849645659327507,
        0.04817676916718483,
        -0.060660455375909805,
        1.2872127829114608e-33,
        0.013870357535779476,
        0.05692155286669731,
        -0.098316989839077,
        -0.10955467820167542,
        -0.03071637451648712,
        -0.0273758452385664,
        0.009687377139925957,
        0.007927505299448967,
        0.031973354518413544,
        0.03373432531952858,
        -0.04331005737185478,
        0.01689482480287552,
        -0.04252103716135025,
        0.09702557325363159,
        0.03602622076869011,
        -0.12196405231952667,
        -0.05168531835079193,
        0.01691390946507454,
        0.08144433796405792,
        0.04804075136780739,
        0.011112392880022526,
        0.05999112129211426,
        0.014621705748140812,
        -0.040120624005794525,
        0.03864029422402382,
        0.00030001363484188914,
        0.0016042664647102356,
        0.008671927265822887,
        0.04221728444099426,
        0.04015463590621948,
        0.0070084454491734505,
        -0.04550030827522278,
        -0.09040487557649612,
        -0.04587745666503906,
        0.011368174105882645,
        0.0166321974247694,
        -0.018687784671783447,
        -0.13693086802959442,
        -0.009771107695996761,
        -0.04632614180445671,
        -0.04825133830308914,
        0.09567424654960632,
        -0.10870449244976044,
        -0.05306079238653183,
        -0.01595020666718483,
        0.018023433163762093,
        0.048877645283937454,
        -0.020547974854707718,
        0.028555503115057945,
        -0.0454716756939888,
        -0.12633417546749115,
        0.03289223834872246,
        -0.08141814172267914,
        -0.009338434785604477,
        0.010097882710397243,
        -0.0353015661239624,
        0.057035382837057114,
        -0.05414232611656189,
        0.07333331555128098,
        0.07614096999168396,
        -0.013428611680865288,
        -0.05210058018565178,
        -0.013964897952973843,
        0.05880765989422798,
        -0.08404528349637985,
        0.07677403837442398,
        0.04424970969557762,
        0.02311367727816105,
        -0.05263570323586464,
        -0.029147539287805557,
        -0.06875713169574738,
        -0.019053921103477478,
        0.053002312779426575,
        -0.02898871712386608,
        0.05117063969373703,
        -0.024557294324040413,
        -0.041874226182699203,
        -0.011175907216966152,
        0.005534055642783642,
        -0.001598874805495143,
        -0.061539001762866974,
        0.05903548747301102,
        0.031091419979929924,
        0.009486719965934753,
        -0.007636175025254488,
        0.03541475534439087,
        -0.01614842750132084,
        0.04660762846469879,
        -0.018540436401963234,
        -0.02432543784379959,
        0.0357278473675251,
        0.01624564826488495,
        0.009133775718510151,
        0.019441094249486923,
        -0.052818238735198975,
        -3.6898088089640036e-33,
        -0.06610635668039322,
        0.014048592187464237,
        -0.07070613652467728,
        0.039072923362255096,
        0.011867486871778965,
        -0.04278009757399559,
        0.015264392830431461,
        0.03503113612532616,
        -0.013073014095425606,
        -0.052247002720832825,
        -0.007404633332043886,
        0.025597693398594856,
        -0.04163876175880432,
        -0.03460840880870819,
        0.027404990047216415,
        -0.03393460437655449,
        -0.04670313745737076,
        -0.11786558479070663,
        0.03381356969475746,
        -0.02067507617175579,
        0.07974071055650711,
        0.009927014820277691,
        -0.012108789756894112,
        -0.08281292766332626,
        0.004646591376513243,
        -0.0035424737725406885,
        -0.04393300041556358,
        0.0019225130090489984,
        0.0069544194266200066,
        0.03381223976612091,
        0.008961915038526058,
        -0.013031172566115856,
        -0.07813425362110138,
        0.028401272371411324,
        0.07207979261875153,
        0.020416779443621635,
        0.06469863653182983,
        0.03411172330379486,
        -0.04589638113975525,
        -0.014655392616987228,
        0.050207894295454025,
        0.04485763609409332,
        0.026434345170855522,
        -0.028895877301692963,
        0.04131085053086281,
        0.028149623423814774,
        -0.057013221085071564,
        -0.011323302052915096,
        -0.004455565009266138,
        -0.06892797350883484,
        -0.020818345248699188,
        -0.03469248116016388,
        0.0917716696858406,
        -0.013948393985629082,
        -0.03153710812330246,
        -0.0763612911105156,
        0.024630116298794746,
        0.03581161051988602,
        0.005327703431248665,
        -0.019464503973722458,
        0.08384107053279877,
        0.001963282935321331,
        -0.01608460769057274,
        0.0037441772874444723,
        0.015213597565889359,
        0.0025090258568525314,
        0.003690456971526146,
        -0.02496996708214283,
        -0.029834847897291183,
        0.006251493003219366,
        -0.0731164813041687,
        -0.053661048412323,
        -0.02007153630256653,
        -0.08519657701253891,
        -0.10107983648777008,
        0.01781020686030388,
        0.06467744708061218,
        -0.10012103617191315,
        -0.0005152432131581008,
        -0.05511120706796646,
        0.002913170726969838,
        0.049325354397296906,
        0.05490564554929733,
        0.017323032021522522,
        0.055423952639102936,
        0.04916459694504738,
        0.06106254830956459,
        -0.041004545986652374,
        0.012189189903438091,
        0.047003187239170074,
        -0.08524741232395172,
        0.033096637576818466,
        -0.06865932792425156,
        0.04681682959198952,
        -0.08615000545978546,
        -5.7434629496810885e-08,
        0.015063438564538956,
        0.017302118241786957,
        0.03181130439043045,
        0.03866178169846535,
        0.059323735535144806,
        -0.0785984992980957,
        0.00843469612300396,
        -0.013336006551980972,
        0.07225841283798218,
        0.03743235394358635,
        0.06408331543207169,
        -0.05342354252934456,
        -0.05167554318904877,
        -0.0030066652689129114,
        0.07765457779169083,
        0.07824355363845825,
        -0.04359109327197075,
        0.06314078718423843,
        0.025482816621661186,
        -0.0711512640118599,
        -0.0034258973319083452,
        0.044908635318279266,
        0.060008320957422256,
        -0.03563382849097252,
        -0.02394142746925354,
        0.08067122101783752,
        0.03184511139988899,
        0.08957025408744812,
        0.07952611148357391,
        0.03309889882802963,
        -0.1334419995546341,
        0.06603261828422546,
        0.028653942048549652,
        -0.01246147695928812,
        0.05442733317613602,
        -0.04110325127840042,
        -0.015971163287758827,
        0.05565670505166054,
        0.11340028792619705,
        0.0644301250576973,
        -0.05695703998208046,
        0.02590150572359562,
        0.0022658405359834433,
        0.003841985948383808,
        0.10379371792078018,
        0.02147972770035267,
        -0.07811297476291656,
        -0.03563797473907471,
        -0.0019645497668534517,
        0.05246129631996155,
        -0.013019886799156666,
        -0.05105474963784218,
        -0.04371975362300873,
        0.07114763557910919,
        0.03644020855426788,
        -0.013372120447456837,
        -0.05629277601838112,
        -0.05007607862353325,
        -0.015153517946600914,
        0.06326545029878616,
        0.008607120253145695,
        -0.13391786813735962,
        -0.02564539946615696,
        0.07656104117631912
    ]
}