{
    "id": "GC27vw-Cwd0",
    "title": "I’ve never seen anything like this before… - eero Max 7",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-12-22T21:27:07Z",
    "video_url": "https://www.youtube.com/watch?v=GC27vw-Cwd0",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "amazon",
        "eero",
        "max 7",
        "wifi",
        "wifi 7",
        "office",
        "wfh",
        "fast",
        "speedtest",
        "ethernet",
        "networking",
        "mesh"
    ],
    "views": 600096,
    "likes": 17637,
    "comments_count": 1011,
    "description": "Check out PowerColors Red Devil RX 7900 Series GPUs and Devil Skin GPU Backplates at:   WiFi 7 is HERE, and though there aren't many devices that support it, those that do are promised crazy speeds and more reliability. We got our hands on the new eero Max 7 routers, and Linus is here to see if our wifi future is bright or if subscription features could ruin everything.  Buy an eero Max 7 Tri-Band Mesh WiFi Router:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 WiFi 7 could be big 1:45 What was in the box? 2:24 Ports and a hot take(?) 3:14 Initial setup and a shot at Apple 4:02 Sponsor - PowerColor 4:38 Finishing setup  5:13 The eero Plus subscription... 7:10 Configuring the network 7:54 eero Plus breaks Linus 9:26 Speed testing on multiple devices 10:47 Outro",
    "description_links": [
        "https://lmg.gg/RedDevilSC",
        "https://geni.us/gCMA3",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "This thing is legitimately kind of exciting. The Eero Max 7 is the first Wi-Fi 7 router we've been able to get our hands on. And Wi-Fi 7 has some clear benefits for consumers. I mean, not most consumers, since the odds of you having a Wi-Fi 7 device to connect to it is pretty slim right now. But in the future, it will be up to, and this is Wi-Fi specs, so you can take it for the horse that it is, 4.8 times faster than Wi-Fi 6E. In order to reach the 48 gigabit per second advertised peak throughput of Wi-Fi 7, you would have to have 16 spatial streams running. That is essentially 16 parallel connections between the two devices. For context, most mobile phones have one or two because of the power requirements of running more spatial streams. That doesn't mean that in somewhere like, oh, I don't know, say a stadium, for example, that you might never see numbers at least approaching that, but at home to a single device, not even close. But that doesn't mean you won't see numbers greater than you're used to seeing with this thing, especially if you're upgrading from Wi-Fi 6. Because like Wi-Fi 6E, Wi-Fi 7 has support for the six gigahertz band, which means you are less likely to run into interference with your neighbors if you're somewhere like in a high rise or a multiplex. And because most of your devices aren't going to be using Wi-Fi 6 gigahertz yet, it's really useful to act as a wireless backhaul between mesh access points like these ones. Nice and fast, no interference. Let's have a look at what's included. We've got a couple of USB-C power bricks. We've got, I don't know, kind of cheap feeling braided, probably cat 5E cable. These are 45 watt power bricks. You know, I was reading a ruckus article talking about how one of the concerns about all these spatial streams and Wi-Fi 7 in general is power consumption at the access points. No kidding. There anything else in here? Nope, just the access points. They're that big. That's another major concern that's been flagged about Wi-Fi 7, whether it's to handle the cooling or all the flipping antennas in them. These access points are getting quite large. Let's take a look at some cool features here though. We've got dual 10 gig ports, dual two and a half gig ports. That gives you a lot of flexibility and means that your network connection is not going to limit your internet speeds anytime soon. In fact, I have made the argument before, and I'm gonna make it again at extreme risk to myself, that consumers do not need faster than gigabit or at most two and a half gigabit networking for a very, very long time. And the reason is that most outside services, so the actual websites and services that you're connecting to are not going to be fast enough to take advantage of more than that across their entire client base. And number two is that for raw downloads, even downloading games from Steam, you're likely to end up CPU limited before you saturate even a two and a half gig internet connection. Wow, how un-Amazon-like. Right there under start setup, delete my account and data. Huh, the hell's a fiber ONT? To be clear, I know what they're talking about. This would be the fiber box that's provided by your ISP. I just mean, why would they, why would they jargon this up? Meet my ONT. This is truly remarkable. Okay, you've got the closeup cam there, right? I just opened this. It already looks disgusting. I mean, this has been out of the box for like six minutes, but can you see the layer of it? Like it has fur, the dust. Why are things white? Apple, I blame you. I blame you. These go in your ears. I guess now's a good time to tell you about our sponsor. It's Power Color, featuring their Red Devil RX 7900 series plus devil skin. They're optimized for 4K gaming. They're quiet and cool during long gaming sessions and can be customized with Power Color's devil skin swappable backplates. Oh, that's super cool. You can choose between two designs for your 7900 Red Devil. There's the mesh patterned generative devil skin or the sleek and smooth intrusive devil skin. Due to the hassle-free magnetic design, these bad boys are super easy to install and they're available worldwide. So check out Power Color's devil skin GPU backplates using the link down below. This is super convenient. There's no uplink port. You just kind of connect whatever to whatever. If you only need two and a half gig for your internet, then great. If you have faster internet, connect to 10 gig. And then you're left with whichever ports are left over to connect your devices to each other. So say, for example, I had two and a half gig internet. I'd go into there. And then if I had say my, you know, editing workstation and a NAS, I'd plug those both into 10 gigs so that I'd get nice, fast timeline performance. Super cool. Okay, immediately found it. Wow, built-in ZigBee and Matter and Thread. Oh, that's kind of cool. Amazon's frustration-free setup. I mean, yeah, okay. Okay. Now this is where we get into trouble. One of the worst trends in enterprise networking has been the move towards everything being as a service. And on the one hand, there are definitely parts of Eero Plus that do make sense to have a subscription fee for. Like for example, they've partnered with Guardian for VPN service. It actually does cost money to run VPN servers on an ongoing basis. You can't just buy hardware once and then have VPN service forever. Some of these things make less sense to me. There's the historical data that I mentioned earlier. So network data usage, monitoring network activity. Why is that not just included? That's just basic. That runs locally. I don't even understand what internet backup means. Add alternate wireless connections, like a personal hotspot, to keep your Wi-Fi up and running even when your wired connection goes down. So what, like failover? Why can't I just have failover? You can even block ads. I can't believe how expensive this is, $130 a year. Oh, wait, I get a month. Oh, but I could get 30 days free. Do I want a month free or 30 days? I guess it depends what month it is. Get the best deal. Didn't I, did I not just subscribe to, oh my God. Oh, the last couple of things that Eero Plus includes is the ability to block apps. So like Facebook or YouTube for your kids. See that, that's one that really shouldn't be on a subscription. VIP support. Okay, that I understand. And dynamic DNS, which, I mean, I guess if you can afford the Eero Max 7, you can afford the subscription. Holy, it's two pack is $1,100. You're all set. How many times are you gonna tell me I'm all set? Am I all set? What is happening right now? I just subscribed. This is a Wi-Fi 7 device, by the way. This is the OnePlus Open. Interesting, it automatically configured a 2.4 slash 5 gigahertz network and a 6 gigahertz network. Well, hmm, interesting. Why would it do that? Cause you will almost never end up connected to the 6 gigahertz network in that configuration. It'll just grab onto the 5 gigahertz, 2.4 gigahertz one and it'll end up being really sticky because 6 gigahertz, by definition, is not going to have as good range as even 5 gigahertz. So I've found from my own experience, you don't wanna just have them separate if you can avoid it. You know what, fine, sure. No, we're gonna use it like it would be at the bottom. I took this selfie earlier cause I was like, oh look, it makes my head look really small. You can block apps like Roblox. No. Really? You know what, fine. I'm subscribing again. Try and stop me. Oh, I already own this item. Got it. Okay, well then why are you prompting me for it? Oh, look at this. It's now 2.4, 5 and 6 gigahertz all on the same SSID. Okay, so what I said before then, now we have a device. Add a device. That one. Save. Maybe now I can enable ad blocking. Are you kidding me? Okay, how about content? Full restart. Try turning it off and turning it back on. Yeah, yeah I have. Come on, Jeffy. Just take my hard earned money. Use, oh, internet backup with an Eero Plus subscription. It wasn't the trust me bro scandal. It wasn't the ad block scandal. And it wasn't even this year's summer scandal. This is what pushed me over the edge. Thanks Eero. Oh, oh, I assume that was a WPS button. I guess WPS is just, oh no. Wow, it factory, wow. Okay, that's pretty cool. It factory resetted on its own. Okay, you know what? Forget it. For the life of me, I cannot subscribe to their service. So we won't be trying their ad blocking. We won't be trying their content filtering. Maybe it's decent. I have no idea. Not for lack of trying. What I wanna know is how fast this Wi-Fi 7 connection is on a real device. Not a hypothetical device that can do like a 320 megahertz wide channel or 16 spatial streams or whatever the case may be. So we're connected to it. We're going on speed test, which to be clear is gonna be limited by the server on the other side potentially, but it has gotten a lot faster lately. Yes, yes, yes, yes, yes. What the actual, I mean, it's well shy of the 46 gigabit per second that they advertise or whatever, but like I have never seen anything like this on Wi-Fi. That is incredible. And again, caveats. This is not the kind of thing that you're gonna notice when you're just browsing the web because realistically the DNS lookup is gonna take longer than the actual data download. What kind of performance do I get out of it with a legacy device? Yep. That's about all Wi-Fi 5 can do. Here we go. Woo! Not nearly as fast. I wouldn't mind it on a device that doesn't have a subscription, but I mean, people seem super happy with these things. So I guess, you know, to each their own, but man, I am way more stoked for Wi-Fi 7 than I was before. Holy crap. Look at it go. That's it. We've seen it. Wi-Fi 7. It's crazy. It's lunchtime. See you later, guys. Watch ShortCircuit, subscribe. Three gigabit per second upload.",
    "transcript_keywords": [
        "WiFi",
        "Power Color devil",
        "power",
        "gigahertz",
        "Power Color",
        "device",
        "devil skin",
        "Eero",
        "Devil",
        "Color devil skin",
        "internet",
        "half gig",
        "gig",
        "spatial streams",
        "kind",
        "Eero Max",
        "cool",
        "network",
        "Color devil",
        "access points"
    ],
    "transcript_entity_values": [
        "Wi-Fi 6",
        "half",
        "the OnePlus Open",
        "Wi-Fi 6E",
        "5 gigahertz",
        "Wi-Fi 7",
        "Wi-Fi 5",
        "6 gigahertz",
        "1,100",
        "year",
        "30 days",
        "Three",
        "One",
        "WPS",
        "six gigahertz",
        "Wi-Fi 7",
        "one",
        "4",
        "USB",
        "ZigBee",
        "SSID",
        "48 gigabit",
        "NAS",
        "ISP",
        "two and a",
        "six minutes",
        "Amazon",
        "130",
        "Red Devil RX 7900",
        "second",
        "Eero Plus",
        "YouTube",
        "2.4 gigahertz",
        "DNS",
        "summer",
        "2.4",
        "Eero",
        "Wi-Fi 7",
        "number two",
        "Power Color's",
        "Power Color",
        "Jeffy",
        "46",
        "45 watt",
        "Wi-Fi",
        "10",
        "first",
        "Wi-Fi",
        "16",
        "Facebook",
        "two",
        "two and a half",
        "between two",
        "GPU",
        "5 gigahertz",
        "Eero Plus",
        "320 megahertz",
        "Guardian",
        "CPU",
        "VPN",
        "Apple",
        "5",
        "4.8",
        "Roblox"
    ],
    "transcript_entity_types": [
        "FAC",
        "CARDINAL",
        "EVENT",
        "LOC",
        "CARDINAL",
        "FAC",
        "LOC",
        "QUANTITY",
        "MONEY",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "GPE",
        "DATE",
        "TIME",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORDINAL",
        "FAC",
        "PERSON",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "LOC",
        "CARDINAL",
        "ORDINAL",
        "FAC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON"
    ],
    "vector": [
        -0.07640897482633591,
        -0.005193862598389387,
        0.0038256978150457144,
        -0.006810902617871761,
        0.1035328283905983,
        0.012360001914203167,
        -0.009676962159574032,
        0.017593909054994583,
        -0.07810161262750626,
        0.01002268586307764,
        0.010369406081736088,
        0.06268595159053802,
        -0.018033020198345184,
        -0.05438258871436119,
        0.09229935705661774,
        -0.011553610675036907,
        0.04759645462036133,
        -0.08072635531425476,
        -0.07766898721456528,
        -0.05242240056395531,
        -0.005250064190477133,
        -0.022885575890541077,
        0.012870517559349537,
        0.001699920860119164,
        0.048800721764564514,
        0.0041114455088973045,
        0.08245063573122025,
        -0.0135958231985569,
        0.031095240265130997,
        -0.08917374908924103,
        0.039737120270729065,
        0.02787749655544758,
        -0.001981467241421342,
        0.011879079043865204,
        -0.007778584491461515,
        -0.1193939670920372,
        -0.042581960558891296,
        -0.044599130749702454,
        -0.08288057148456573,
        0.007363618817180395,
        -0.023141058161854744,
        -0.041225288063287735,
        -0.05865899845957756,
        0.03409629687666893,
        -0.08731800317764282,
        -0.025558272376656532,
        0.0011285236105322838,
        -0.0016991870943456888,
        0.020732317119836807,
        -0.05227099731564522,
        0.08525890856981277,
        -0.04775024577975273,
        0.037536051124334335,
        0.041391436010599136,
        -0.04515376314520836,
        -0.0300051998347044,
        -0.07681398838758469,
        -0.08233711123466492,
        0.03824482858181,
        -0.005329469218850136,
        0.07008492201566696,
        -0.10098772495985031,
        0.0036040807608515024,
        0.04941493272781372,
        -0.014651584438979626,
        -0.022920632734894753,
        0.010746504180133343,
        0.03893652185797691,
        -0.10209836065769196,
        0.033307917416095734,
        0.03861504793167114,
        0.018598666414618492,
        0.038454584777355194,
        0.12873055040836334,
        0.09495657682418823,
        0.07767466455698013,
        0.07737851142883301,
        0.0005259467288851738,
        -0.011301539838314056,
        -0.0323902927339077,
        0.03447510674595833,
        0.00826616957783699,
        0.052000101655721664,
        0.003055539447814226,
        0.11522876471281052,
        -0.039492759853601456,
        -0.021087689325213432,
        0.018128879368305206,
        -0.027545662596821785,
        -0.09318453073501587,
        0.0024514030665159225,
        0.08404679596424103,
        0.10727620869874954,
        0.002031422220170498,
        -0.06879932433366776,
        0.03106316737830639,
        -0.02786719612777233,
        -0.0918906033039093,
        -0.08255326747894287,
        0.09001819789409637,
        -0.030655035749077797,
        0.04982384666800499,
        0.04049624502658844,
        0.01649077609181404,
        -0.06723994016647339,
        -0.060440678149461746,
        -0.012232692912220955,
        0.11681517958641052,
        0.00990094430744648,
        0.025129076093435287,
        -0.0465020090341568,
        0.038051195442676544,
        -0.009316539391875267,
        0.03720204904675484,
        -0.039876971393823624,
        -0.04484061524271965,
        -0.006990524940192699,
        0.05352131277322769,
        0.07142940908670425,
        -0.002270192839205265,
        -0.004926119931042194,
        -0.033296797424554825,
        0.01236148551106453,
        0.050598274916410446,
        0.009230314753949642,
        -0.0004102328384760767,
        -0.00608133664354682,
        6.377344114642892e-33,
        -0.006160973105579615,
        0.08107225596904755,
        -0.11265670508146286,
        -0.09798581153154373,
        0.03805755451321602,
        0.012963320128619671,
        -0.01787874847650528,
        0.014228405430912971,
        -0.003466449212282896,
        0.02918863296508789,
        -0.1269131302833557,
        0.04662938788533211,
        -0.0521424300968647,
        0.05476181209087372,
        0.0479922778904438,
        -0.12228576838970184,
        -0.03316893056035042,
        0.055325526744127274,
        0.02294054627418518,
        -0.0028318562544882298,
        0.006810484919697046,
        -0.07414276897907257,
        0.003435315564274788,
        -0.059806834906339645,
        0.09584448486566544,
        0.0368158333003521,
        0.010033272206783295,
        -0.015143435448408127,
        0.013209354132413864,
        -0.0001894238084787503,
        -0.03135167434811592,
        -0.02424163557589054,
        0.08192192018032074,
        0.018810776993632317,
        -0.07019821554422379,
        -0.002675524912774563,
        -0.09719386696815491,
        -0.07590527832508087,
        0.02966427616775036,
        0.0359371192753315,
        -0.014473787508904934,
        0.00037813049857504666,
        -0.11123838275671005,
        0.0032582045532763004,
        0.008036168292164803,
        -0.030688202008605003,
        0.0516112744808197,
        0.02457766979932785,
        0.004921208135783672,
        0.0007124667754396796,
        -0.05639233440160751,
        0.0037611951120197773,
        -0.11657100170850754,
        -0.028361869975924492,
        0.040950387716293335,
        -0.038924869149923325,
        -0.02870943769812584,
        0.005402418319135904,
        0.14585617184638977,
        -0.045756205916404724,
        0.03531312569975853,
        -0.016485176980495453,
        0.010455824434757233,
        -0.03915860131382942,
        -0.04493320360779762,
        0.027208032086491585,
        0.04600066691637039,
        0.003906290978193283,
        -0.0919870063662529,
        -0.046089667826890945,
        -0.020816711708903313,
        -0.005329709965735674,
        0.05979587882757187,
        -0.00914786197245121,
        0.044548243284225464,
        -0.03406112641096115,
        -0.05172345042228699,
        -0.012196719646453857,
        0.009090987034142017,
        -0.03459828346967697,
        -0.04341252148151398,
        -0.027175093069672585,
        0.018527094274759293,
        0.08385349065065384,
        0.04208894073963165,
        0.0014789947308599949,
        0.020716410130262375,
        -0.09471030533313751,
        -0.16192378103733063,
        0.0016714200610294938,
        0.01155020110309124,
        0.01342842634767294,
        -0.057557906955480576,
        0.04578278213739395,
        -0.029932741075754166,
        -5.189885802723126e-33,
        -0.016803106293082237,
        0.007484664209187031,
        0.004836065694689751,
        0.024346638470888138,
        0.02526557259261608,
        -0.030589813366532326,
        0.044834889471530914,
        0.05855093523859978,
        -0.006701819598674774,
        -0.02891978621482849,
        0.08775973320007324,
        -0.008433195762336254,
        -0.01730637438595295,
        -0.041834354400634766,
        0.015060057863593102,
        -0.09539011865854263,
        0.028343068435788155,
        -0.0671401172876358,
        0.025252537801861763,
        -0.03274092450737953,
        0.03592410683631897,
        -0.017390940338373184,
        -0.05428116023540497,
        0.009178567677736282,
        0.009337750263512135,
        0.018998825922608376,
        0.05140874162316322,
        0.012563814409077168,
        -0.046448688954114914,
        0.07724430412054062,
        -0.04308420792222023,
        -0.0497545562684536,
        0.014380862936377525,
        -0.017660116776823997,
        0.1095411479473114,
        0.01098631415516138,
        -0.0017601849976927042,
        0.11640874296426773,
        -0.043181151151657104,
        -0.043182872235774994,
        0.08880466967821121,
        -0.022237448021769524,
        -0.0002665378269739449,
        -0.04164000600576401,
        0.030887123197317123,
        -0.10920371115207672,
        0.0046130078844726086,
        -0.10293403267860413,
        -0.03847035765647888,
        -0.008385191671550274,
        0.06304323673248291,
        0.008402105420827866,
        0.060896605253219604,
        0.06840445846319199,
        -0.028906024992465973,
        0.011551444418728352,
        -0.012334275990724564,
        -0.01548528391867876,
        0.017239505425095558,
        0.01710398681461811,
        0.08091151714324951,
        -0.004524813964962959,
        -0.013638487085700035,
        0.07582484185695648,
        0.06922648102045059,
        -0.02330668643116951,
        0.01318990159779787,
        0.014560376293957233,
        -0.022894522175192833,
        0.04256993532180786,
        -0.022083157673478127,
        -0.07893527299165726,
        -0.03448790684342384,
        -0.0058962334878742695,
        0.018637193366885185,
        -0.05427093803882599,
        0.09047489613294601,
        0.002052305731922388,
        -0.04056702181696892,
        -0.012065373361110687,
        -0.06981869041919708,
        0.05353313684463501,
        -0.022123951464891434,
        -0.03096182644367218,
        0.08607801049947739,
        -0.01533560361713171,
        0.03003019653260708,
        -0.028842546045780182,
        0.0656810775399208,
        0.03162016347050667,
        -0.015088068321347237,
        0.01068397518247366,
        -0.008519287221133709,
        0.03219930827617645,
        -0.010943408124148846,
        -5.9269101626568954e-08,
        -0.054019272327423096,
        0.008534763008356094,
        0.030665306374430656,
        0.029149649664759636,
        0.12233482301235199,
        -0.08075477182865143,
        0.040735114365816116,
        -0.10031109303236008,
        -0.0363631546497345,
        -0.020566321909427643,
        0.04898974671959877,
        0.012211684137582779,
        -0.060869645327329636,
        0.01955181360244751,
        0.0469222366809845,
        0.015731249004602432,
        -0.0241434033960104,
        -0.015251174569129944,
        0.006657720543444157,
        -0.007242942228913307,
        -0.034652311354875565,
        0.039196331053972244,
        0.07444707304239273,
        -0.014089694246649742,
        0.0576610341668129,
        0.067579485476017,
        0.020204132422804832,
        0.04581618309020996,
        0.10401447862386703,
        -0.03860003873705864,
        -0.13577459752559662,
        0.006217416375875473,
        0.056550756096839905,
        0.02249104715883732,
        -0.010092184878885746,
        0.018775440752506256,
        -0.0795232355594635,
        0.042787663638591766,
        -0.010090687312185764,
        0.033977068960666656,
        -0.03290292248129845,
        0.014190424233675003,
        0.054607849568128586,
        0.019107390195131302,
        0.05546983331441879,
        0.0034919059835374355,
        -0.043507762253284454,
        0.004484665114432573,
        0.0815838873386383,
        0.000687951862346381,
        0.00464485352858901,
        -0.014116906560957432,
        0.02404671534895897,
        -0.015085478313267231,
        -0.0020306971855461597,
        -0.0947064682841301,
        0.0017702355980873108,
        -0.0039975703693926334,
        0.011953586712479591,
        0.062078963965177536,
        0.003051867475733161,
        -0.13000229001045227,
        -0.05059873312711716,
        0.09508559852838516
    ]
}