{
    "id": "gewjb78G91w",
    "title": "My Hummingbird Nest Story 💕🙏🏻",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-04-01T18:37:57Z",
    "video_url": "https://www.youtube.com/watch?v=gewjb78G91w",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 81004,
    "likes": 4473,
    "comments_count": 503,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(somber music) - This video was going to be one of my most favorite videos that I've ever posted. It is something that made me so happy, but it also has brought me so much sadness that I can't even really put it into words. It's been a few days. And so this video is basically showing you guys, a kind of the story of this hummingbird nest that I found in my backyard. And then fortunately, something happened and just the babies didn't survive and they, my God. I don't even like, I hate talking about it. But, I really wanted to share this video with you guys because it is something that made me so happy. And so many of you were like sharing this journey with me. We were live streaming on Twitch. I think we almost hit like 300 hours. I kind of just like left you guys hanging with this whole Twitch stream. It was really traumatic, because we had all had invested so much time, and so much heart, and so much love into these little birds. And then, you know, for this tragedy to happen, a lot of you may have never had to deal with grief or loss of a loved one, or a friend, or pets or anything. So grieving for some of you, maybe something that is new. So anything that you're feeling it's totally normal. It's confusing. Don't be afraid to cry. Don't be afraid to ask for help or talk to someone and being able to do that. And for us here to just kind of connect and grieve together is something that I think is very important. And I just want you all to know, that I love you guys so much, and for just sharing this beautiful journey with all of us here online, and I just want you to know that Kiwi is still out there and it just, is the most heartbreaking, but also like the most beautiful thing to just kind of still go outside my backyard. And she's still there. (upbeat music) So a little over a week ago, I discovered a hummingbird nest in my backyard, and I can't even tell you how I felt when I found out, like I actually started getting emotional. I almost cried because I've never seen a hummingbird sit still before. Not only that, there were two eggs in there. I was out of town for about three weeks on a road trip with my sister. And when I came back, this was here waiting for me. And I started doing a live stream over on Twitch. And like at this point it's been going for over a week. We witnessed both of the eggs hatching live. When the first one hatched the first day, we were all losing our minds. And with a little bit of research, the chat was like, Hey, there's a really good chance that this other egg is going to hatch tomorrow. So once the eggs are laid, there's about a 13 to 17 day period before they hatch. So we found this nest at people's perfect time ever. Here she is behind me. This is Kiwi and her two babies which currently have not been named at this point. And what's really weird is, I don't have any like hummingbird food or on a feeder. Like there's nothing that I've ever done to bring them here. Now, after finding this nest, I also found three others in my trees. I feel like I have some sort of weird wildlife sanctuary that I didn't even know existed back here. Wait, is that something else? What's that right there? That also looks like a potential other one that has fallen off. This is, so that's five! How in the world do I have five freaking hummingbird nests? Like they must've been nesting here for a very long time and I didn't even know it. Kiwi could have actually been born in one of these nests, and now she's back having her babies. Oh my God, I'm gonna cry. So the crazy thing is anytime I come out here and she flies away, like I can spot her up here just watching. So it's like, she know... Oh there she is! She's over there. She's over there. She's over there. She's over there. (mumbles) She's over here. Some may say, just either you've losing your mind and I'd say, maybe. She's going to zip over here real soon. There she is. There she goes. There she goes. And that's, what's so crazy about this. It's so hard to capture a hummingbird on camera, and the fact that she just sits here and hangs out and feeds her babies. And we've been watching her for almost 200 hours live on Twitch. That's fascinating. It's absolutely fascinating. So here's the stream setup. I'm streaming everything off the Surface Book 3. And this thing has been on for over 200 plus hours at this point. I haven't even turned the screen off. Like I've been pushing this little laptop to its absolute limits. It's connected with an Elgato capture card which is going outside to my Sony A7S III, with a 70 to 300 millimeter lens on. Now, when I started this I was using the A7 III and it kept overheating. And I didn't really want to put my brand new A7S III out there but I had to do it for the nest cam. I'm also working on a couple of upgrades for this. I'm going to add a webcam here, so I can do some live streaming and live commentary over top of the baby bird stream. I'm going to be getting a 600 millimeter lens that I'm borrowing from Sony to be able to really get in that nest. Like I want it to feel like we're inside of it. And what's so weird is watching this stream, you can't really see how small these birds actually are. These birds weigh absolutely nothing like the eggs for almost like the size of tic-tacs. It's crazy! This bird has brought me so much joy. Like I can't even explain it. And it's so cool to be able to share this with you, and seeing all of the comments in the chat has been so fun. And I love that you guys are also invested in this as well. And I think today in this video we're going to officially name the babies. So stay tuned. Let's open up that webcam, and get this setup. So here it is, it's USB, and it has adaptive light sensor 1080p 60 frames a second. It's also HDR enabled, and nice wide angled lens with an adjustable field of view, USB 3, and flexible mounting options, which is very important for, you know, commentating overtop of baby birds. I love this flexible Mount cause you can Mount this to a tripod or you can even just kind of set it on the back of like your monitor or your laptop. Oh, this unscrews too. So do you want to add this just to a tripod stand alone? You can do that, or you can add the flexible Mount back on. And there's also a little tripod attachment here as well. So many options. Oh, it's got a little lens cap too. That's nice. Bird stream is about to evolve yet, again. Let's go set it up. (upbeat music) About to (mumbles) the webcam for the first time. And this is so quick, I plugged it in and it auto- installed, auto-recognized. And then I downloaded the Razer Synapse app, which will let me get some more in-depth controls with this camera, but really I don't need it. I just added it into Streamlabs, and we're ready to go. We're now going to name the babies live. I have a few duo names right now, but we need two more duo names. Web cam here test. Oh my God. (mumbles) And they're getting fed. They're feeding, they're feeding, they're feeding, they're feeding. Oh, feed the back one. The back one needs fed. Yeah, yeah, yeah, yeah, yeah, yeah. You're getting your meal. Have your meal. Hi, guys welcome to the stream. So, I'm actually recording a YouTube video right now. We need two more duo names. You guys keep saying Yerba and Matte, but that's like, so... It's so obvious. You know Kahlua and Cream, that's cute. Egg and other egg. (laughs loudly) That's it, egg and other egg. (laughs loudly) You got to get the pool all set up. So guys, this is a very big moment. The babies are going to get their name. What do we name the babies? Frappe and Chino, Mochi and Macha, Coffee bean, (laughs loudly) Dude, that's my vote. Lemon and lime, and (laughs loudly) and egg and other egg. Here we go. I'm voting Coffee bean and Tea leaf. Not to like sway your votes. (sad piano music) Coffee bean and Tea leaf is very close to my heart. Oh my gosh, Emily is here! She has just raided the channel with 12 viewers. Hi, Emily. I think lemon and lime are winning right now. Shoot. I've only got a few more minutes left. (mumbles) voter fraud. (laughs loudly) The bill and ballots here. It's just, you know, suggestions. Stop the count. Someone is suing for defamation of the lemon and lime name. History repeats again. Oh, my gosh. We stole the voting. (laughs loudly) I'm losing my mind. Oh, this is, the suspense is, is actually killing me. I am going to go to Coffee Bean and Tea Leaf after this event wins. And we have ourselves a winner! Ladies and Gentlemen, Coffee bean and Tea leaf, has won! (laughs loudly) Kiwi, named your babies Coffee bean and Tea leaf. Well, I guess I'm going to go to Coffee Bean Tea Leaf now. How do you guys feel? (somber piano music) It's closed. I used to drink my latte's here. I sit by the fire and enjoy it. But now, there's no enjoying. So, it looks like my favorite Coffee Bean and Tea Leaf is closed. Guess the baby names are now a tribute. Let's go find another one that might actually be open. (upbeat music) So we're going to be approaching a Coffee Bean and Tea Leaf, that appears to be open. There's a sign that says we're open. (upbeat music) This one's for you Kiwi, and Coffee bean and Tea leaf babies. It's here, It's here, It's here, It's here, It's here, It's here, It's here, It's here. (unboxing suitcase) Oh, what have we here? Hey Justine, is this necessary? Absolutely. This is my life. All right, little guys. We have got something for you. Had to shut the stream down. It's quite tragic. So we're, we're dark for a minute. This might be the biggest lens I've had on this camera, because in what world do I ever need, A 600 millimeter? Which world is that? Is it this one? (upbeat music) Oh my gosh, we are so freaking close to this nest. You guys, you all lose your minds. So look at the difference between the 300 to the 600. Unbelievable. (upbeat music) The quality of this lens is unbelievable. Like I can actually see the feathers on these babies. Like I can, the detail. It's just, overwhelming. (upbeat music) There's apparently like hummingbird hats that you can wear when they will like feast out of your hat. This is new information to me. I made this little note. It's a little bit weathered at this point, but I made this for the gardener because I didn't want them to do any sort of gardening on my fake grass that may potentially disturb the babes. Cheers. (melancholy orchestral music) I'm so sad. I have to end this video this way. (cries loudly) This is (mumbles) that I was so afraid of happening, and it did. I can't even walk outside. Something not (mumbles) last night. And unfortunately the babies, they didn't make it. There's a clip of it on Twitch. Yes. I think something just cut up either chopped down the branch, and knocked it down. God, I hate it. (crying continues) (melancholy orchestral music) (melancholy piano music) It's been like such a traumatizing week, but coming out here and still seeing Kiwi fly around and, we might've spotted her with a boy. Hi, Kiwi. Oh my baby, oh I'm so happy to see her. It warms my heart. Like just seeing her still here. She hasn't left. She hasn't given up and just kind of seeing her move on, has sort of helped me move on. Like I know, that some people apparently like, This is crazy. How are you so invested in these birds? I don't know, honestly, like they, they captured my heart. They captured all of your guys' hearts here on the internet. And I just love to show you guys Kiwi, and show you that she's doing well and she's still here. And we've seen her flying around with a boy, and I think she might be looking for a new place to nest. So Kiwi, I think has moved on. I'm sure she's grieving as all of us have. It's definitely has been a very tough week. I'm not going to lie. It's just like trying to process it and not sure if I should share it with you guys or anything but this video was so beautiful and it was so special to me. So I'm so glad that you guys were able to come along for this journey and share Kiwi and her babies. And maybe, just maybe, we'll have another nest. And I will protect that nest with my own life. (melancholy piano music)",
    "transcript_keywords": [
        "Coffee bean",
        "Tea leaf",
        "bean and Tea",
        "Coffee Bean Tea",
        "Coffee",
        "guys",
        "Tea",
        "Kiwi",
        "babies",
        "bean",
        "Bean Tea Leaf",
        "leaf",
        "nest",
        "babies Coffee bean",
        "Tea leaf babies",
        "egg",
        "Twitch",
        "stream",
        "hummingbird",
        "video"
    ],
    "transcript_entity_values": [
        "a minute",
        "a very tough week",
        "600",
        "second",
        "12",
        "one",
        "70 to 300 millimeter",
        "600 millimeter",
        "Mochi",
        "fed",
        "Justine",
        "Sony",
        "300 hours",
        "Kiwi",
        "300",
        "over 200 plus hours",
        "three",
        "Elgato",
        "USB 3",
        "Macha",
        "YouTube",
        "Mount",
        "Emily",
        "Twitch",
        "almost 200 hours",
        "five",
        "Coffee Bean Tea Leaf",
        "a few more minutes",
        "Chino",
        "Ladies and Gentlemen, Coffee",
        "Kahlua",
        "today",
        "webcam",
        "Matte",
        "two",
        "Coffee Bean and Tea Leaf",
        "the Surface Book 3",
        "a few days",
        "about three weeks",
        "first",
        "Yerba",
        "tomorrow",
        "last night",
        "a week ago",
        "the first day",
        "USB",
        "1080p 60",
        "Kiwi",
        "Streamlabs"
    ],
    "transcript_entity_types": [
        "TIME",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "TIME",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "LOC",
        "PERSON",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORG",
        "TIME",
        "GPE",
        "WORK_OF_ART",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "EVENT",
        "DATE",
        "DATE",
        "ORDINAL",
        "PERSON",
        "DATE",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON"
    ],
    "vector": [
        -0.018713515251874924,
        -0.07680122554302216,
        -0.0458909273147583,
        -0.1297970563173294,
        -0.0003775772056542337,
        0.03151046112179756,
        0.025785526260733604,
        0.010864026844501495,
        -0.0005828142748214304,
        0.07317572832107544,
        0.021850667893886566,
        -0.005285458639264107,
        -0.03732995316386223,
        -0.00608044071123004,
        -0.0036081322468817234,
        0.07283435761928558,
        0.00017032815958373249,
        -0.046551838517189026,
        -0.00516272708773613,
        0.018754910677671432,
        -0.0359153151512146,
        -0.03779293969273567,
        0.061925001442432404,
        0.00613219290971756,
        -0.058311909437179565,
        0.09377226233482361,
        -0.01583985425531864,
        0.06621900945901871,
        -0.08799722045660019,
        -0.08120337873697281,
        -0.010979740880429745,
        0.05070646479725838,
        0.1387692540884018,
        -0.015869837254285812,
        0.004502605646848679,
        -0.02287045493721962,
        0.057355839759111404,
        -0.013586841523647308,
        -0.01395045593380928,
        -0.03303343057632446,
        0.04678869619965553,
        -0.04667219519615173,
        0.012628884054720402,
        -0.05327428877353668,
        -0.09522240608930588,
        -0.1004665344953537,
        -0.021156005561351776,
        -0.027216516435146332,
        0.07900544255971909,
        0.038796938955783844,
        -0.10087732970714569,
        -0.0413658507168293,
        0.03178320452570915,
        0.02363981306552887,
        -0.06360220909118652,
        0.05091460794210434,
        -0.0781170129776001,
        0.008111869916319847,
        0.03791753575205803,
        -0.10048823058605194,
        0.011842251755297184,
        -0.030568132176995277,
        -0.005955662112683058,
        0.0364798977971077,
        -0.026645511388778687,
        -0.06683569401502609,
        -0.02067939005792141,
        0.0046885646879673,
        0.01521244551986456,
        0.02116047590970993,
        -0.0788126289844513,
        0.026424570009112358,
        -0.05127141624689102,
        0.014905250631272793,
        -0.005803442094475031,
        0.06967214494943619,
        0.059904180467128754,
        -0.07735088467597961,
        0.016157979145646095,
        0.04189431667327881,
        -0.021768923848867416,
        -0.046661484986543655,
        -0.08496405184268951,
        -0.05090058967471123,
        3.417976813580026e-06,
        0.01015329547226429,
        0.01724732480943203,
        0.00902517419308424,
        -0.06286955624818802,
        -0.096103236079216,
        -0.06411375105381012,
        -0.05622235685586929,
        -0.013292869552969933,
        0.005775394383817911,
        -0.012853479012846947,
        -0.04600374773144722,
        -0.04247906804084778,
        -0.07714885473251343,
        -0.03277887776494026,
        0.07102756947278976,
        0.048549674451351166,
        -0.06632780283689499,
        -0.010102652944624424,
        -0.06517680734395981,
        -0.01917300932109356,
        -0.11809354275465012,
        -0.0261179618537426,
        0.03200201690196991,
        0.010773603804409504,
        0.0028598022181540728,
        -0.07005631178617477,
        0.047789521515369415,
        -0.05859573185443878,
        -0.024203496053814888,
        -0.005630670581012964,
        0.09108354151248932,
        -0.06247001886367798,
        0.06682523339986801,
        0.03423945978283882,
        0.02950991876423359,
        0.017063317820429802,
        -0.07976029813289642,
        -0.011944788508117199,
        0.05803745612502098,
        0.018691685050725937,
        0.013010796159505844,
        -0.10541118681430817,
        1.3351892256749293e-32,
        -0.00945307593792677,
        0.042245253920555115,
        0.04575473070144653,
        0.06970831751823425,
        0.027033725753426552,
        -0.011660031974315643,
        -0.028661681339144707,
        0.09457118064165115,
        -0.020897140726447105,
        0.01254471205174923,
        0.03316521644592285,
        0.04557311534881592,
        -0.0390610508620739,
        0.02677915059030056,
        0.035213764756917953,
        -0.038496024906635284,
        -0.031231602653861046,
        -0.0508565790951252,
        -0.040390774607658386,
        -0.02369844727218151,
        -0.001104856259189546,
        -0.010198921896517277,
        0.014461081475019455,
        0.05581297725439072,
        0.1487477868795395,
        0.0948287844657898,
        0.08835413306951523,
        -0.015263461507856846,
        0.06326141208410263,
        0.030536077916622162,
        0.014907957054674625,
        -0.07457733899354935,
        -0.007290093693882227,
        -0.10504899173974991,
        -0.01506133284419775,
        0.02216922678053379,
        -0.0471438430249691,
        -0.012156306765973568,
        -0.047877050936222076,
        -0.021313956007361412,
        -0.0197073332965374,
        -0.03625032678246498,
        -0.06348834186792374,
        -0.04641479253768921,
        0.06535428762435913,
        0.01592392660677433,
        0.04660346359014511,
        0.05812843143939972,
        -0.05695141851902008,
        0.054616522043943405,
        -0.002860904671251774,
        -0.03059813566505909,
        -0.03464606776833534,
        -0.01094038039445877,
        -0.023650584742426872,
        -0.06113341823220253,
        -0.014746278524398804,
        0.035996973514556885,
        0.047748930752277374,
        0.02095491997897625,
        0.019698677584528923,
        -0.03767318278551102,
        -0.0024118139408528805,
        -0.05292313173413277,
        -0.0032914369367063046,
        0.09011033922433853,
        0.05855130776762962,
        -0.049080587923526764,
        0.01937900111079216,
        0.04805254191160202,
        0.007475126534700394,
        -0.006910021882504225,
        0.050974711775779724,
        0.0017648970242589712,
        -0.0024515052791684866,
        0.08081188797950745,
        -0.08553658425807953,
        -0.022019028663635254,
        0.01493249461054802,
        -0.032900478690862656,
        -0.09572512656450272,
        0.0924171581864357,
        -0.01927940733730793,
        0.11453738063573837,
        -0.03390055149793625,
        -0.06627672165632248,
        0.042397335171699524,
        -0.027546625584363937,
        -0.04375406354665756,
        0.031345564872026443,
        -0.013159752823412418,
        0.0948772206902504,
        -0.07767686247825623,
        -0.051955413073301315,
        -0.017570065334439278,
        -1.3037371110771528e-32,
        0.013948356732726097,
        0.05893832817673683,
        -0.0037469088565558195,
        -0.030784135684370995,
        0.0754523053765297,
        -0.05030769109725952,
        0.07025765627622604,
        0.06998579204082489,
        0.06277287006378174,
        -0.06879222393035889,
        -6.610663695028052e-05,
        -0.051649391651153564,
        -0.10827510058879852,
        -0.034149687737226486,
        -0.046437349170446396,
        -0.005355014931410551,
        -0.03744351491332054,
        -0.038328059017658234,
        0.07207553088665009,
        -0.008163091726601124,
        0.04918726906180382,
        0.17210663855075836,
        0.10275214165449142,
        0.03795884922146797,
        0.0123054888099432,
        -0.0015561762265861034,
        0.03343099355697632,
        0.05694035813212395,
        0.05855432525277138,
        0.024006854742765427,
        -0.0007352114771492779,
        -0.04046759381890297,
        -0.022480374202132225,
        -0.010642480105161667,
        0.015064198523759842,
        0.01400183979421854,
        0.02378099039196968,
        0.043184973299503326,
        0.02142607420682907,
        -0.06320889294147491,
        0.033258628100156784,
        0.015973279252648354,
        -0.011206637136638165,
        -0.04152696207165718,
        -0.004872117657214403,
        -0.11204543709754944,
        -0.01864747889339924,
        0.023318404331803322,
        -0.015413756482303143,
        0.007634253241121769,
        -0.06121934950351715,
        -0.09030365943908691,
        0.0030930268112570047,
        -0.0018244542879983783,
        0.01810343936085701,
        -0.0038268782664090395,
        -0.03987821936607361,
        -0.017800480127334595,
        0.0707806944847107,
        -0.010926050134003162,
        0.020051099359989166,
        -0.028760502114892006,
        -0.07085157185792923,
        -0.05683375149965286,
        0.018548952415585518,
        -0.06742604076862335,
        0.08109863102436066,
        0.02120266668498516,
        0.014448163099586964,
        -0.005058777518570423,
        -0.013847492635250092,
        0.05752631276845932,
        0.057984113693237305,
        0.004322143271565437,
        0.04353753849864006,
        0.04298442229628563,
        -0.10533056408166885,
        -0.017041292041540146,
        0.0865926668047905,
        -0.048846181482076645,
        -0.06772087514400482,
        -0.027654599398374557,
        -0.004942020401358604,
        0.08855501562356949,
        0.1191437616944313,
        0.06928685307502747,
        0.11172069609165192,
        -0.008955753408372402,
        -0.009111986495554447,
        0.044182468205690384,
        0.012211060151457787,
        0.07539884746074677,
        0.07012933492660522,
        0.10853954404592514,
        -0.08043741434812546,
        -6.453492318314602e-08,
        0.02880127541720867,
        0.009286252781748772,
        -0.033551231026649475,
        0.015982190147042274,
        0.05629304423928261,
        -0.06770142912864685,
        -0.030912455171346664,
        -0.00505455257371068,
        0.058563657104969025,
        -0.03358155116438866,
        0.0734056681394577,
        -0.047817643731832504,
        0.017681622877717018,
        0.09086225181818008,
        0.019875595346093178,
        -0.024699250236153603,
        -0.0734759196639061,
        0.05387392267584801,
        -0.04463601112365723,
        -0.049750376492738724,
        -0.06742347031831741,
        0.09824332594871521,
        0.017277035862207413,
        0.001891211373731494,
        0.044388964772224426,
        0.007183380890637636,
        -0.0007446526433341205,
        -0.05176566168665886,
        0.008418840356171131,
        0.0036921072751283646,
        -0.05536310002207756,
        0.0423184409737587,
        0.012550403364002705,
        0.003870084648951888,
        -0.07225852459669113,
        -0.04909440129995346,
        -0.05148584768176079,
        0.009680158458650112,
        0.01789308898150921,
        0.0199851393699646,
        0.01418707799166441,
        -0.1034577265381813,
        -0.04405343532562256,
        -0.01747903786599636,
        0.008708597160875797,
        -0.057451605796813965,
        0.0522838719189167,
        -0.07138329744338989,
        -0.04501523822546005,
        -0.015671178698539734,
        -0.029379885643720627,
        0.04457525536417961,
        0.03754657879471779,
        -0.06486665457487106,
        0.0497000515460968,
        -0.000661769590806216,
        0.021100517362356186,
        0.05759629234671593,
        0.008030470460653305,
        -0.013076022267341614,
        0.07032036036252975,
        0.007078859489411116,
        -0.0569443441927433,
        0.025121048092842102
    ]
}