{
    "id": "GFgJgGV4d28",
    "title": "Windows Terminal and WSL 2 tips",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2020-06-25T14:00:07Z",
    "video_url": "https://www.youtube.com/watch?v=GFgJgGV4d28",
    "category": "Science & Technology",
    "tags": [
        "wsl 2",
        "wsl",
        "windows subsystem for linux",
        "windows terminal",
        "linux",
        "wsl2",
        "ubuntu",
        "windows 10",
        "windows",
        "microsoft",
        "terminal",
        "vscode",
        "command line",
        "ubuntu 20.04",
        "linux on windows",
        "how to install wsl 2",
        "windows subsystem for linux 2",
        "wsl1",
        "microsoft windows",
        "wsl 1",
        "ubuntu on windows",
        "linux subsystem",
        "linux kernel",
        "windows bash",
        "windows update",
        "tutorial",
        "windows 10 wsl 2",
        "#wsl2",
        "windows subsystem",
        "ubuntu linux",
        "how to install wsl2",
        "windows 10 linux",
        "subsystem for linux",
        "wsl 2 windows 10"
    ],
    "views": 73186,
    "likes": 2101,
    "comments_count": 120,
    "description": "The Microsoft Windows Terminal is here! Fantastic development. In this video I show you both WSL 2 tips and tricks and show you how you can use the Microsoft Windows Terminal to interact with WSL 2 Virtual Machines (Ubuntu 20.04) and others. It's so easy now to have a tabbed application that supports Powershell, Command Prompt, Azure, WSL 2, SSH, Telnet and other applications.  Windows Terminal supports a lot of customization - you can change fonts, colors, background images and a whole bunch of other options.  wsl2 is a fantastic Microsoft Windows 10 development: You can run Linux directly on Windows using the windows subsystem for linux. In this video I demonstrate ubuntu 20.04 and 18.04 using wsl2.  Menu: Overview: 0:00 Windows Terminal Install: 0:51 Windows Terminal Overview: 1:27 Docker Integration: 2:46 Settings: 4:46 Access Windows files from Linux: 5:26 Access Linux files from Windows Explorer: 7:31 Use VSCode to open Linux Subsystem Files: 9:34  Previous videos: WSL 2 getting started:  WSL2 and Docker getting started:   Documentation:  Windows Terminal:  Window Terminal Introduction:  Windows Terminal GitHub:  What is WSL?  WSL documentation:  WSL 2 Announcement:   Windows Terminal Microsoft Windows Terminal Microsoft WSL2 Ubuntu 20.04 WSL 2 WSL 1 Ubuntu 18.04 windows subsystem for linux  #windowsterminal #wsl2 #linux",
    "description_links": [
        "https://youtu.be/_fntjriRe48",
        "https://youtu.be/5RQbdMn04Oc",
        "https://docs.microsoft.com/en-us/windows/terminal/",
        "https://devblogs.microsoft.com/commandline/introducing-windows-terminal/",
        "https://github.com/microsoft/terminal",
        "https://docs.microsoft.com/en-us/windows/wsl/about",
        "https://docs.microsoft.com/en-us/windows/wsl/",
        "https://devblogs.microsoft.com/commandline/announcing-wsl-2/"
    ],
    "transcript": "- This is one of multiple videos in my WSL version two series. In this video, I'm gonna show you some tips and tricks. I'm gonna show you, as an example, how to use the Microsoft Windows Terminal. You can open up multiple shells to various Linux operating systems running within WSL version two. I'll also show you some additional tips and tricks in this video. So as an example, how to open Linux files from within Windows, or how to access Windows files from within Linux. Use the menu below this video if you want to jump to a specific topic. So if you're not interested in the Windows Terminal, but you just want to see how to open Linux files within Windows, then use the menu to jump to that topic. Okay, so let's get started. (upbeat dance music) Yeah, let's go (upbeat dance music continues) - Microsoft have released a Windows Terminal that makes it a lot easier to work with multiple consoles. So I'm gonna go to the Microsoft store, and I'm gonna search for the Windows Terminal. And here it is, so I'm gonna click on that, and I'm gonna click get, and then I'm gonna click install, to install the Windows Terminal on my computer. It's not a very big installation. You can see it's about six meg. So quite a small installation. And I'm gonna click launch to launch the Windows Terminal. What I've got here is a Windows PowerShell. So if I type wsl-l-v, as an example, I can see that I've got an Ubuntu 20.04 virtual machine running. I can see that the Docker Desktop is running. I can see that 18.04 is stopped, as an example, and Ubuntu has stopped. But notice here, I can click on this little down arrow, and I can open a command prompt. This is the classic command prompt that's been around for many, many years. So as an example, IP config shows me the IP address of my computer. So I've got PowerShell running here, I've got a command prompt running here, but what I can now do is start an Ubuntu 20.04 prompt. So, lsb_release -a shows me that I've got Ubuntu 20.04 in this tab. Drop this down, let's start an 18.04 tab. So, lsb_release -a. I've got PowerShell. I've got a command prompt. I've got an Ubuntu virtual machine, in this case, 20.04, running, and I've got 18.04 running. And what I could do now, as an example, is go into my Docker WSL Integration, and I could enable Docker on various virtual machines, including the 18.04 virtual machine. Click apply and restart, to apply those changes. Go back into my Windows Terminal. In my 18.04 virtual machine, I could type, docker run hello-world. I'm told, \"Hello from Docker!\" Everything seems to be working right. What I can do now is use this command to run an Ubuntu shell. So, lsb_release -a. And that command doesn't work. So let's install this app update to update my references. What I'm doing now is running, hopefully, a 20.04 Ubuntu within 18.04. So I'll install that software quickly. Clear the screen. So, lsb_release -a. Notice I'm running Ubuntu 20.04 within Docker. When I type exit, and use that command again, notice I'm running Ubuntu 18.04. So in this example, I'm running Ubuntu 20.04 in a Docker container, within an 18.04 virtual machine, which is running within Windows. This is fantastic. I can even open an Azure Cloud Shell here, and log into Azure, log into my various virtual machines running within WSL version two, open up a command prompt, open up PowerShell, et cetera. This is a fantastic development from Microsoft. You can run a whole bunch of terminals, but you can also change the settings. So, if you click on the little down arrow and go to settings, you can change the fonts, you can change a whole bunch of options within Windows Terminal. If you're interested, I'll create a separate video on Windows Terminal. Let me know if you're interested in me doing that. I'll show you how to change a lot of the schema settings and a lot of the options here. But notice you can have different profiles. One for Windows PowerShell, as an example, one for cmd, or the command prompt. One for the different virtual machines that we're running within WSL version two, et cetera. So Windows Terminal is fantastic, great application. But what I want to show you now are some tips and tricks with regards to WSL version two. So this is not a Windows Terminal option. This is just part of WSL version two. So one of the options, and let me go back to home, in this 20.04 LTS virtual machine, is I can access files in Windows from within Linux. So at the moment, pwd once again shows me that I'm in my home directory, but if I go cd root, notice I'm in the root directory. If I go to mnt, ls, I can see the C drive. This is the C drive on my Windows computer. So as an example, if I go to C drive, there are the files on my C drive in Windows. So, back in my Ubuntu shell, I'll go, cd c, and type ls, and what you'll notice is I have these files listed. Those are the files on my C drive. I'll use sudo here so that I can use root privileges. So, sudo ls. Put my password in. Now, after I've put in my password, notice I can see all the directories on my C drive. So those are the directories on my C drive. And I could also do something like, find grep, and let's just grep for temp as an example. And notice I'm able to use Linux commands on Windows. So I'll just stop that for a second. I'm getting permission denied, 'cause I need to use sudo. And let's simply search for devlist.txt. So, devlist.txt, to make it simpler. And, as you can see, it's trying to find the files, but it has found the one file here. So scrolling up, notice it did find devlist.txt in the root directory. Now in the same way that you can use Linux to look at the C drive, or other drives on a Windows computer, you can use Explorer to explore the Linux directory. So I'll type explorer ., and I need to type exe . to run the Windows application. And what it's done now is opened up Windows Explorer, and I'm looking at the WSL hard drive for Ubuntu 20.04. And what I can see here are the files on my Linux virtual machine. So, ls, as an example, shows me those two files, xe.py and xe2.py. And I can see something similar here in Explorer. And what I could do, as an example, is open these files in Visual Studio Code, as an example. So I've opened xe.py in Visual Studio Code. What I'll do is cat that file here, so that you can see what's in the file. Notice there are two print statements at the end. So what I'll do is delete the extra print statement, and go file, save, to save the file. And back in Linux, if I read that file, notice the second print statement has been removed. I could say something here like, print hello from Windows, and go file, save, to save the file. And if I cat that again, in Linux, notice, there's the changed file. So, basically, Explorer allows me to explore files on the Linux subsystem using a familiar Windows application. What you can also do is use VS Code to open files directly. So I can say, code.exe xe.py, to open that file. In this case, it's actually just code. So, code, and I'm gonna open xe.py. And what that does is start VS Code in Windows, and it opens that file directly from within Windows. So I'm opening a file on the Linux subsystem from within Windows. And I did that directly, or you could just use Explorer to do that. So you might prefer using Explorer to view the Linux virtual machine hard drive. So as you can see, there's very tight integration between Linux and Windows, using the Windows subsystem for Linux, so WSL version two. Fantastic options available now, if you use Windows as your primary operating system, to develop on Linux, use Linux commands, learn Linux, et cetera. The Windows Terminal is also a fantastic application. I'm really glad to see how Microsoft have changed their ways and are using a lot of Linux technologies as part of Windows. Okay, so, very long video, but hopefully you've learned something. I'm David Bombal, and I want to wish you all the very best. (upbeat dance music) Yeah, let's go (upbeat dance music continues)",
    "transcript_keywords": [
        "Windows Terminal",
        "Windows",
        "Linux",
        "Microsoft Windows Terminal",
        "Terminal",
        "Ubuntu",
        "WSL version",
        "WSL",
        "files",
        "running",
        "file",
        "Windows Terminal option",
        "open Linux files",
        "running Ubuntu",
        "notice",
        "virtual",
        "virtual machine",
        "Docker",
        "open",
        "Microsoft Windows"
    ],
    "transcript_entity_values": [
        "Microsoft",
        "Linux",
        "Docker",
        "Ubuntu 18.04",
        "20.04 LTS",
        "a Windows Terminal",
        "the Docker Desktop",
        "WSL",
        "One",
        "two",
        "20.04",
        "Windows Explorer",
        "Windows",
        "the Windows Terminal",
        "wsl-l-v",
        "second",
        "the Windows Terminal",
        "Windows Terminal",
        "Docker WSL Integration",
        "IP",
        "Windows",
        "The Windows Terminal",
        "Linux",
        "Docker",
        "Explorer",
        "one",
        "VS Code",
        "Linux",
        "xe2.py",
        "Ubuntu 20.04",
        "WSL",
        "xe.py",
        "Windows PowerShell",
        "PowerShell",
        "Windows",
        "Azure",
        "Windows Terminal",
        "David Bombal",
        "Windows Terminal",
        "18.04"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "FAC",
        "FAC",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "ORG",
        "PRODUCT",
        "FAC",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "FAC",
        "PERSON",
        "PRODUCT",
        "CARDINAL"
    ],
    "vector": [
        0.059584103524684906,
        0.003099733032286167,
        -0.03739252686500549,
        0.014254027046263218,
        0.04278554767370224,
        0.031777869910001755,
        -0.023831702768802643,
        0.07696925103664398,
        -0.012177764438092709,
        0.04228521138429642,
        0.007517750840634108,
        -0.016019897535443306,
        0.013687396422028542,
        0.014489160850644112,
        0.05853888764977455,
        0.027168625965714455,
        -0.0024398877285420895,
        -0.01558170560747385,
        -0.03634878247976303,
        -0.04641975089907646,
        -0.03790940344333649,
        -0.042902473360300064,
        0.004759185016155243,
        -0.08626477420330048,
        -0.025745440274477005,
        0.022541016340255737,
        -0.08764822036027908,
        0.031221255660057068,
        0.029307544231414795,
        -0.01517721451818943,
        -0.03226296976208687,
        -0.0040375483222305775,
        -0.045854516327381134,
        0.029097996652126312,
        -0.03581446781754494,
        -0.006434302311390638,
        0.1508459895849228,
        0.034595832228660583,
        -0.1151265799999237,
        -0.024186786264181137,
        0.01871340349316597,
        -0.031586114317178726,
        -0.049160923808813095,
        0.0009303763508796692,
        -0.03566586226224899,
        -0.046253737062215805,
        0.0069688656367361546,
        -0.04467689245939255,
        -0.04033171385526657,
        0.08815698325634003,
        -0.046078551560640335,
        -0.07038530707359314,
        0.07567235082387924,
        0.0224288497120142,
        -0.054413631558418274,
        -0.004385508596897125,
        -0.008656678721308708,
        0.024951638653874397,
        0.0539015457034111,
        -0.10689757764339447,
        -0.031845979392528534,
        -0.013089144602417946,
        -0.06960353255271912,
        0.03218609094619751,
        -0.035329557955265045,
        0.030555538833141327,
        -0.014772117137908936,
        0.034195009618997574,
        0.060948409140110016,
        -0.06694766134023666,
        -0.1352458894252777,
        -0.04851097613573074,
        -0.016527779400348663,
        -0.002532681915909052,
        -0.10911864042282104,
        -0.014413232915103436,
        0.0351959727704525,
        -0.05067189037799835,
        -0.033412158489227295,
        0.018529465422034264,
        0.04526589810848236,
        0.07898729294538498,
        -0.09375574439764023,
        0.008961949497461319,
        -0.04228341579437256,
        0.06393947452306747,
        -0.0833907350897789,
        0.050379350781440735,
        -0.035175468772649765,
        -0.058296434581279755,
        0.0370962992310524,
        -0.08917167782783508,
        0.007582653313875198,
        0.022781163454055786,
        0.03570236638188362,
        0.03269990533590317,
        0.04941504821181297,
        -0.06281380355358124,
        0.022044319659471512,
        -0.0016516655450686812,
        -0.07358627021312714,
        -0.019810875877738,
        0.00960678979754448,
        0.022128520533442497,
        0.007814843207597733,
        -0.017571572214365005,
        0.053807333111763,
        0.0448271818459034,
        0.0018997093429788947,
        -0.07220183312892914,
        -0.005808305460959673,
        -0.004495913628488779,
        -0.066803939640522,
        -0.0603678934276104,
        0.08692510426044464,
        0.009110363200306892,
        0.03865567967295647,
        0.02303527109324932,
        -0.03265249729156494,
        -0.008992435410618782,
        0.08984830975532532,
        -0.05496315285563469,
        -0.05874339118599892,
        -0.01825893484055996,
        0.0126852011308074,
        -0.0013736370019614697,
        0.005656529683619738,
        4.819568715357627e-33,
        0.0726378783583641,
        0.061728306114673615,
        -0.020417828112840652,
        0.08013227581977844,
        0.15819895267486572,
        -0.03535119444131851,
        0.06199222430586815,
        -0.07720321416854858,
        -0.03839770704507828,
        0.027884462848305702,
        0.0159959327429533,
        -0.009368345141410828,
        -0.030083198100328445,
        0.034256462007761,
        0.12201609462499619,
        -0.07596757262945175,
        -0.005212839227169752,
        0.06571877747774124,
        -0.0014736918965354562,
        0.061802756041288376,
        0.033999476581811905,
        0.020191682502627373,
        0.04347936436533928,
        -0.029668759554624557,
        0.0971706435084343,
        -0.08170010894536972,
        0.043618351221084595,
        0.020646831020712852,
        0.13061365485191345,
        -0.02889513038098812,
        -0.025984980165958405,
        0.05355878919363022,
        -0.007999280467629433,
        0.018258851021528244,
        -0.029763665050268173,
        -0.06222634017467499,
        -0.06855504959821701,
        0.0018908315105363727,
        0.05442608520388603,
        0.045133575797080994,
        -0.006752649322152138,
        0.028118858113884926,
        0.061346374452114105,
        0.03172268345952034,
        0.06476347893476486,
        -0.03339122235774994,
        0.06749340146780014,
        -0.0568733811378479,
        0.02036936581134796,
        -0.04906727001070976,
        0.026617925614118576,
        0.10382881760597229,
        -0.05559605360031128,
        0.10505516827106476,
        0.01273352187126875,
        -0.04681666940450668,
        0.03568973392248154,
        -0.037992700934410095,
        -0.07275458425283432,
        0.06952491402626038,
        -0.085135318338871,
        0.034030549228191376,
        -0.003359811147674918,
        0.012160384096205235,
        -0.020278455689549446,
        -0.08674079179763794,
        -0.03220001980662346,
        -0.011994811706244946,
        -0.06829294562339783,
        0.1090194582939148,
        -0.026339974254369736,
        0.01853170618414879,
        0.004495065659284592,
        0.015451247803866863,
        0.016824299469590187,
        0.012879288755357265,
        0.10903389751911163,
        -0.05121335759758949,
        0.05002043396234512,
        0.005657723639160395,
        -0.020093878731131554,
        0.1124894991517067,
        -0.030670952051877975,
        -0.022499263286590576,
        0.03904840350151062,
        -0.07534410804510117,
        -0.028008803725242615,
        -0.0768459290266037,
        -0.03924495726823807,
        -0.05355486273765564,
        -0.055051811039447784,
        0.021191898733377457,
        0.023493526503443718,
        0.016830991953611374,
        -0.019552040845155716,
        -5.930028841220671e-33,
        -0.00238606589846313,
        -0.0008302044006995857,
        0.000491900893393904,
        0.036967236548662186,
        -0.036114953458309174,
        0.04701435938477516,
        -0.06643830239772797,
        -0.004857989493757486,
        -0.008395470678806305,
        -0.06183258816599846,
        0.028650376945734024,
        0.10901808738708496,
        0.04189515486359596,
        0.10989875346422195,
        -0.003965185489505529,
        0.017303775995969772,
        0.07549761235713959,
        0.0026162583380937576,
        0.037720561027526855,
        -0.0815313458442688,
        0.021708808839321136,
        0.0934770479798317,
        -0.0029296730645000935,
        -0.07129592448472977,
        0.0065488689579069614,
        -0.019170669838786125,
        0.06653331220149994,
        -0.026565734297037125,
        0.02519133873283863,
        -0.01683463715016842,
        0.013264856301248074,
        0.008508739061653614,
        0.04723053798079491,
        -0.053235672414302826,
        0.09659513831138611,
        0.06471353769302368,
        0.02024669013917446,
        -0.03076891414821148,
        -0.06720935553312302,
        0.0022033294662833214,
        0.039067141711711884,
        -0.08085016161203384,
        -0.0011201221495866776,
        -0.03418635576963425,
        -0.04154852032661438,
        0.02852102369070053,
        -0.055543676018714905,
        0.015398175455629826,
        -0.058378465473651886,
        0.03140702471137047,
        -0.008447377011179924,
        -0.0283152274787426,
        -0.05538828670978546,
        -0.002279287902638316,
        0.01268093939870596,
        -0.11837943643331528,
        -0.09388662129640579,
        0.05327476188540459,
        -0.05538789555430412,
        -0.08348780125379562,
        -0.008134844712913036,
        0.04206189885735512,
        -0.02515433169901371,
        0.013994267210364342,
        -0.02253061532974243,
        0.03135356679558754,
        -0.04767946898937225,
        -0.045234452933073044,
        -0.043904732912778854,
        -0.013988252729177475,
        -0.004119510762393475,
        -0.012295718304812908,
        -0.007913323119282722,
        -0.03450880944728851,
        0.0758131742477417,
        -0.0002022642584051937,
        0.04607362300157547,
        -0.05647231265902519,
        -0.019464273005723953,
        0.055511970072984695,
        -0.005173721816390753,
        0.07569421827793121,
        -0.004748394712805748,
        -0.03988366946578026,
        -0.04525471478700638,
        0.0895153358578682,
        -0.07694869488477707,
        0.04806401580572128,
        -0.039991606026887894,
        -0.0027664273511618376,
        -0.017458852380514145,
        -0.006946953944861889,
        0.07495613396167755,
        0.042793285101652145,
        0.019072869792580605,
        -4.472641279562595e-08,
        0.01218494214117527,
        -0.03039729595184326,
        -0.06529076397418976,
        -0.03183714672923088,
        -0.13716848194599152,
        -0.03356858715415001,
        0.04788897559046745,
        -0.07315836101770401,
        -0.049159787595272064,
        0.019709108397364616,
        -0.04390586167573929,
        -0.01767832599580288,
        -0.03774367272853851,
        -0.030813708901405334,
        0.004636989440768957,
        0.10227584093809128,
        -0.03213757649064064,
        0.002515366766601801,
        0.031648796051740646,
        -0.00809499155730009,
        0.03874929994344711,
        0.06107303872704506,
        0.07810806483030319,
        0.0895955041050911,
        -0.07430136203765869,
        0.06778310984373093,
        0.07820697873830795,
        -0.04330911859869957,
        -0.02380921132862568,
        0.005315873306244612,
        0.08236134797334671,
        -0.04456550255417824,
        -0.04526257514953613,
        0.07115208357572556,
        0.06259207427501678,
        -0.059484630823135376,
        -0.09978684782981873,
        -0.007248298730701208,
        -0.008844046853482723,
        0.005095274653285742,
        0.05917568504810333,
        -0.016420813277363777,
        -0.006408601999282837,
        0.048577532172203064,
        -0.06284774839878082,
        -0.04048578813672066,
        -0.03872498497366905,
        -0.004430585075169802,
        -0.028495319187641144,
        -0.08392202854156494,
        -0.06177002564072609,
        -0.008865884505212307,
        0.021970316767692566,
        0.02161446586251259,
        -0.0024077908601611853,
        0.06799360364675522,
        0.020106753334403038,
        -0.030561165884137154,
        0.1040271744132042,
        0.07337584346532822,
        -0.03162739798426628,
        -0.002849373035132885,
        -0.013482049107551575,
        0.05531410127878189
    ]
}