{
    "id": "gH2QUDukjzI",
    "title": "Amazon is DONE.",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-08-26T18:11:41Z",
    "video_url": "https://www.youtube.com/watch?v=gH2QUDukjzI",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 154850,
    "likes": 5693,
    "comments_count": 220,
    "description": "RIP Amazon Basics PS5 Pro Controller - DualSense Edge:  The Weirdest BANNED Tech:  I'm Stealing This - ASUS ROG Extreme PC Build:  The WEIRDEST Japanese Dollar Store Tech:  The WEIRDEST Products at Costco:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Sorry Everyone 0:23 Amazon is DEAD (Basically) 1:16 Amazon is going TOO FAR 2:20 Matts House Brand 2:51 Dropshipping is ACTUALLY Killing AmazonBasics 3:40 Amazons Legal Battles 4:39 AmazonBasics DIDNT Sell Enough.. 5:53 It Still LOOKS Bad.. 7:02 Its Just Like Facebook and Apple.. 8:08 Apple Does This Too.. 9:03 Amazon Prices Arent Even Better.. 10:18 Amazons Gamble Didnt Pay Off 11:03 What Do You Think?",
    "description_links": [
        "https://youtu.be/JrkhC9GFyt0",
        "https://youtu.be/dRe97Cs8W1Q",
        "https://youtu.be/j-lOYlIX5YY",
        "https://youtu.be/ldg1XtSnVFM",
        "https://youtu.be/Uw6OsPUbR7I",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- Hello. Hello and welcome to this is Amazon is dead. - Wait, what? - Basically. So. - Oh my. - (Laughs) got 'EM. This is the whole reason I wanted to do this episode just so I could make that joke. Amazon basics the brand. You probably don't care about it all is going away. - Well, no, not quite going away. - So to give you the TLDR Amazon is under numerous investigations for antitrust which is totally reasonable. They've gotten their little grubby little fingers into everything on the planet and even some other planets with blue origin. So one of the big things is I love Amazon basics. They generally have some pretty decent things. They're not amazing. - It's white label plus because pretty much every brand whether it be Walmart or target whatever they have their house brands, their white label where they, you know, they'll take the batteries. You know, maybe the $8 batteries, the Energizer cells, well they'll get the almost exact same thing slap their label on it and sell it for $6 or whatever. And this is the common practice because if you're a big chain and you know that this kind of item is gonna be popular I can get the exact same thing from the retailer from the manufacturer, sell it at a discount and still make profit and I can kind of compete. And they have this sales data knowing that how many people buy batteries or whatever. But it seems like the issue here is that Amazon took it too far as they have with many, many things lately - They flew too close to the sun. As far as like how much we can get away with of just like we sell every brand. It's one thing. If they're making generic again, like white labeling kind of thing, see toilet paper cables. One of the problems is though it wasn't necessarily even just the products. It was, they, the way that they were marketing them I would look for, I don't know, bounty paper towels. Instead. I see Jeff Bezos big face saying buy Amazon basics for better - Where I think that they've actually overstepped and where I think that Amazon basics is gonna scale back so heavily. I don't wanna say it has nothing to do with the the antitrust things, because it definitely does. Yeah. I think the thing that no one is really talking about is that it's not worth it for them anymore. You see the massive headache they're getting with the antitrust. Yeah. But let's take a look at like who they're competing with massive amounts of people who are drop shipping. Amazon basics is the same products that a lot of people are buying off of. Like Ali express, you know, they're buying - One factory makes all of 'EM. It's just a matter of right. Do you get 'EM from a drop ship or do you get 'EM from Amazon with an Amazon label on it? - And I think it's a branding issue. Yeah. So like you get some of the weirdest brand names for some of these things, you know like, \"Canavanine\" but like this - Shouldn't say U I thought you were gonna say U - No. I said \"Oovanavava\" - for the record. Can you spell that? Aaron's gonna be very upset if you cannot spell that for him. - Cause he U Y U w H a V a N a. What's that? A lot of people who are buying Amazon basics are not I would say educated consumers - No, you just Google the or you Amazon search the thing and that's what pops up and go sure. I need diapers. - How much are they actually making on Amazon basics? Just being the warehouse space. - Of course. for all these drop shippers. Yeah. Who are selling the exact same product because they're they are paying for a license to, in order to make their Amazon basics version of this. And I think that they're what they're ultimately gonna say is like either we rebrand into a sexier house brand, which is like what Target's done which is like, what? I don't remember. Radio shack used to be gig aware, but they need to either reinvent Amazon basics to a sexier brand. Yeah. That sounds like it's more premium basics is just like, oh, I don't want the basics. I want to be a little nicer. - Well, I mean like, so some news reports have come out. It sort of detailing kind of what happened here. But a few years ago, Jeff Bezos was like, look we're we have 2% market share whatever it is this is not acceptable. And he told the team, Hey, go and make Amazon basics bigger. If it's being sold Amazon, not literally, but figuratively we should have an Amazon's basics version of it. So the team went out and started making a million versions of things. But here's where all the antitrust and a lot of the legal issues that Amazon are running into are coming from. So on one side, Amazon being the retailer has all the data not like a target or a Walmart who can just see how many people buy this or that. But look, they have the data on the searches. They have the data on the consumers. They also have all the sales data from the competitors because that's what they are, who are selling on Amazon. So if I'm anchor and I'm selling chargers Amazon knows every single thing about how many people are buying it. Yep. The demographics and Amazon has the power. When someone searches for anchor to slap a label on the page saying, you shouldn't buy this come buy the Amazon basics version. Right. Right. Which is clearly a major problem. If you're watching a, this is video and in the middle of it, I'm like, Hey, you should go subscribe to the Austin NES YouTube channel, which is way better. That would be a huge issue if stuff like that were to happen. And especially if someone at this table was looking at this is analytics and specifically targeting you, Jim who has not subscribed to the Austin NES channel yet. Oh no, he's doing it. - Looking at you, Rick. I would not be shocked if after all this effort they said to like, let's pump Amazon basics. That 2% became like three, four, 5% tops. And I think at the end of the day, they're gonna find they can just make more money by not selling Amazon basics and taking a larger cut of like drop shippers. Yeah. They save warehouse base. - They're not paying for the inventory. - Yeah. They're housing the drop shippers are paying the one up front. They take a larger percentage of that. There's no antitrust about that, but it's still, and like that's kind of what happens when you have a company as big as Amazon. - The other thing is the reviews, right? So a lot of brands do again, competitors because pretty much everyone who made something that was in the same wheelhouse as Amazon basics S vice versa. We're obviously Amazon competitors, Amazon we're taking a lot of sort of companies down. Now, mind you I will give them the benefit of the doubt here. That a lot of the brands that were taken down were taken down for clearly violating the terms of Amazon service which was like, Hey, you know like when you buy an Amazon product and it comes to the little thing in the PA the thing saying either, Hey please buy this on our website. Don't buy on an Amazon or leave us a five star review. And we'll give you a $20 gift card or whatever which is clearly not okay to pay people for fake reviews on the thing. Like I understand I think Amazon's right to shut that kind of stuff down. But when you're competing with these companies and you're taking them off for something reason like that but if you take that whole store and all their products down and you instead bump all those Amazon basics chargers and cables, one step up, it looks, it's a bad look. It's a really, really bad look. - I have more philosophical, like ethical question for you. What if they bought out one of the brands? - Oh, so like, and so like they're buying the competition instead of just knocking them off, right? - Because on paper, it's still, it's still at the end of the day for the consumer, doesn't, it's the same result. There's less and less choices. You're still having to go through Amazon, buy it through - Them. I think that would be a problem, regardless because the issues and the antitrust that the EU specifically, or I think are sort of targeting Amazon most aggressively right now or saying is like, Hey, if you are the marketplace, you need to have some level of fairness in your marketplace. Right. And if you are also making competing products and then promoting those competing products and taking people's data, because you have all the the information, which is a huge part of products not even just the products, but knowing how to market them who's buying them, all that kind of stuff. Then that's a big no-no. So I don't think, and that might be a little bit better, but I don't necessarily think that - Helps it's. I mean, it's Facebook, like they're under the issues for the same type of thing because we have all the data and how we're using it and targeting new ads and stuff like that. - There's a philosophical question. I think a lot of governments are asking of when companies start to get too big. Right? Yeah. And that's a nebulous kind of thing. Cause I don't think there's a clear answer to it. Right. I think it's a little bit of a subjective sort of opinion thing but a good example of this, I think would be looking at Google and apple with their app stores. Right. Which is going under similar kind of scrutiny right now. There's a lot of talk that, you know the app store and the services for apple may have to be like split up with both of those. Although Google's a little bit better because you at least you've always been able to side load but specifically say, well, it's like the iPhone, the iPad. Yeah. If you want to purchase an app you have to do it through the app store which means you have to give apple 30% or at least the developer to give 30% of the sale. On top of that, apple has all the information all the analytics, all the data for the apps. And so say they want to make a new version of IMO or whatever. They might be looking at Luna fusion or whatever and go, oh, you know, here, we can see all the people we have all the information we're gonna give this away for free. - And they already do that though. Don't like, if you go in the app store and look like video editing or like, whatever of course they're at the top of the, the thing, but - It's even more than that. Like how many apps have been developed? Third parties have pulled it up and either they've been denied or they went up and then got taken down later for breaking rules. And then six months later, a year later apple comes up with their own version of that app. It's a bigger sort of thing of how aggressive governments are. And again, I single out the EU because they're being a little bit more proactive with these things but how big is too big and how much can these companies kind of stretch while still obviously interacting with their wider ecosystems, whether it's app developers whether it's sellers on Amazon. Yeah. I think it's a big question, but Amazon basics really does seem like one of those very clear cut kind of things of, it was a smaller thing. No one had a problem with it. They got super aggressive with massive amounts of products. They were very clearly taking data and information supposedly, hypothetically, whatever, and then competing with them and then directing people who were looking for a logic tech mouse to go buy an Amazon basics mouse. Look to me, that's a pretty clear cut one. Whereas stuff like the apple and the Google aren't quite is obvious. The thing - That though is adding insult to injury across all this is Amazon keeps raising their prices. I think when I started Amazon prime is like $80. - Was it now 120, 130 bucks a month? A - Year? If you start now, it's I think it's up to like 1 30, 1 40, but that's the thing is like you are paying for these extra, you're paying for those, those things that they they're trying to develop that way. Cause I'm on the fence because I personally am super against algorithmic content but unfortunately that's what most - Social media, I mean, that's what our business - Is really. Right. But like it's literally the, the epitome of, you know preaching to the choir of just like, I'm only seeing things that like, we, we think you'll like this but then you don't broaden your horizons ever. Yeah. All go to deals on Amazon. What's the first like 10 things that are always there. It's Alexa, you know, like my echo show all these Amazon products that are just like kind of sprinkled in to all the different sales and like look at all these great deals we have on, on tablets. There's - There a certain level of that. That's okay. I mean, if I walk into a Walmart or there's gonna be a lot of Walmart house brands that might be front and center whatever the case is. Yeah. But it just, I think for Amazon basics it just to me, if the the rumors and the news and all the things that sort of that I understand to be true are actually true. It seems like a thing where Amazon basics was under heavy promotion for Mr. Bezos and the Amazon team say, Hey get bigger, sell more, be bigger. And they did that probably too fast. They broke a lot of things. They maybe were a little fast and loose with some data and maybe some anti competitiveness. And now they're gonna get either a slap on the hand - They're like an $800,000 fine. Which is what, what he wipes his effort with. - I don't know. I feel this. One's probably gonna be a lot more than a little baby. Fine. - Well, it's still but like no, no fine is gonna actually deter them - Well, but no, but that actually might not be true. I was reading an article that was basically saying that the number of Amazon basics products has already dramatically dropped because a lot of products were just not restocking. So as they sell out, they just, just - But that's, that's like, that's kind of what I'm saying. Like, I don't think any dollar amount is gonna deter them. If they get broken up. That's a whole, that's a different story. Well, but where I think that I think all those Amazon basics are scaling back is they're looking and seeing, yeah this is a failed experiment. Yeah. We could do all this but like the needle didn't move nearly enough. - They're not selling enough. They're also also potential huge legal and financial ramifications. - Right? Like the risk is not worth the board. I think that's the reason it's not coming back. Yeah. Not because we think we're gonna get, you know massive fine or whatever. Yeah. It it's, it's an interesting it's an interesting development. I'll give the one credit to Amazon is I like the way they handle most of their marketplaces. We have found plenty of scams in Amazon, but we tend to have to really look for those. If you look like on like best buy marketplace Walmart marketplace, where they, they allow third parties to, to go up on sell. A lot of those are, it's just like, it's a lawless land where like, oh, this is $12, but it's, you know $900 shipping. Amazon does clean up and a lot. I'll give them credit for that. I think Amazon, Amazon generally does a good - Job, but I also think that Amazon has basically - Overstep. Okay. You just took Mike. I did. I did just know the comments. If Austin stole my joke from the beginning let us know if you think that Jeff Bezos should be launched into his rocket and never returned, like subscribe follow check in the next one. And we're basically Jeffrey, the Jeffrey Bezos.",
    "transcript_keywords": [
        "Amazon basics",
        "Amazon",
        "Amazon basics version",
        "basics",
        "thing",
        "things",
        "Amazon basics products",
        "Yeah",
        "buy Amazon basics",
        "lot",
        "make Amazon basics",
        "buying Amazon basics",
        "kind",
        "selling Amazon basics",
        "products",
        "Amazon basics bigger",
        "buy",
        "people",
        "data",
        "Amazon basics chargers"
    ],
    "transcript_entity_values": [
        "Target",
        "A - Year",
        "one",
        "third",
        "8",
        "Aaron",
        "Energizer",
        "six months later",
        "the next one",
        "Luna",
        "three",
        "U - No",
        "20",
        "Alexa",
        "Google",
        "Jim",
        "30%",
        "EU",
        "130 bucks",
        "120",
        "the end of the day",
        "12",
        "2%",
        "Jeff Bezos",
        "Canavanine",
        "a few years ago",
        "6",
        "5%",
        "iPad",
        "Third",
        "Bezos",
        "Austin NES YouTube",
        "Austin",
        "800,000",
        "Walmart",
        "Amazon",
        "One",
        "Facebook",
        "Jeffrey Bezos",
        "Austin NES",
        "Ali",
        "a million",
        "a year later",
        "Jeffrey",
        "five",
        "first",
        "iPhone",
        "80",
        "1 30",
        "Mike",
        "Rick",
        "1 40",
        "10"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "PERSON",
        "PERCENT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PERCENT",
        "PERSON",
        "PERSON",
        "DATE",
        "MONEY",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.030545644462108612,
        -0.021806422621011734,
        0.0464966855943203,
        -0.0626269280910492,
        0.12898601591587067,
        -0.03564102575182915,
        0.017455890774726868,
        -0.04889491945505142,
        0.052813999354839325,
        0.08169142156839371,
        0.055430591106414795,
        0.06787983328104019,
        0.04169631376862526,
        -0.06135479733347893,
        0.022420493885874748,
        -0.026964688673615456,
        0.031115446239709854,
        -0.08723606169223785,
        -0.14447754621505737,
        0.023075051605701447,
        -0.0570734404027462,
        0.03904985636472702,
        -0.06484560668468475,
        0.04307188093662262,
        -0.058186646550893784,
        0.08090543746948242,
        -0.05369279533624649,
        0.020810171961784363,
        -0.03776166960597038,
        -0.09103856235742569,
        -0.03234182298183441,
        0.007928389124572277,
        0.005971755366772413,
        0.028798986226320267,
        0.016561632975935936,
        -0.06986074894666672,
        0.014444165863096714,
        -0.07708751410245895,
        -0.030921515077352524,
        -0.04736565053462982,
        0.04223397374153137,
        -0.006289205048233271,
        -0.0593576654791832,
        0.039423856884241104,
        0.011814069002866745,
        -0.027530672028660774,
        0.006706091575324535,
        -0.031288992613554,
        0.088077113032341,
        -0.028825988993048668,
        0.007186979055404663,
        -0.006516201421618462,
        0.04414588212966919,
        -0.005265604704618454,
        -0.05304722860455513,
        -0.013862065970897675,
        0.02746371179819107,
        0.002123528625816107,
        0.11207851767539978,
        -0.0047688777558505535,
        0.04591739550232887,
        -0.1102411150932312,
        0.017625676468014717,
        -0.0007440953049808741,
        -0.018010536208748817,
        -0.01171830017119646,
        -0.018918776884675026,
        0.01947999931871891,
        -0.02577368915081024,
        0.06072921305894852,
        -0.0028033999260514975,
        -0.0378665067255497,
        0.06639615446329117,
        0.11797697097063065,
        0.0012714674230664968,
        0.04812413454055786,
        0.07072240859270096,
        -0.0536370575428009,
        -0.04324854165315628,
        0.010345708578824997,
        -0.027356188744306564,
        -0.10461162030696869,
        -0.1251920461654663,
        -0.026327887549996376,
        -0.019740430638194084,
        0.001103873597458005,
        0.04165304824709892,
        0.0004480131610762328,
        0.04477401822805405,
        -0.013472734950482845,
        -0.04464171081781387,
        0.013791036792099476,
        0.13538311421871185,
        0.04566466063261032,
        -0.03884211555123329,
        -0.05760794132947922,
        0.002629463095217943,
        -0.011033651418983936,
        -0.061061978340148926,
        0.041608747094869614,
        0.031178750097751617,
        0.07984102517366409,
        0.05341985821723938,
        -0.10235818475484848,
        0.028806719928979874,
        -0.048253368586301804,
        -0.08146491646766663,
        0.08015629649162292,
        0.042913906276226044,
        -0.010620895773172379,
        -0.06881295889616013,
        -0.03088328428566456,
        -0.04139711335301399,
        0.006462735589593649,
        0.03332652151584625,
        0.04480692371726036,
        -0.07948075234889984,
        0.0006772384513169527,
        0.023932775482535362,
        0.004979634657502174,
        0.05053026229143143,
        0.03537692502140999,
        0.014732218347489834,
        -0.04236576706171036,
        0.04323461279273033,
        0.03397849574685097,
        -0.03120286390185356,
        4.8741729993472145e-33,
        0.02090090699493885,
        0.05215466767549515,
        -0.054185643792152405,
        -0.037224508821964264,
        0.024971473962068558,
        -0.002719766227528453,
        -0.020762475207448006,
        0.13114309310913086,
        -0.04336697608232498,
        0.031118225306272507,
        -0.021170491352677345,
        -0.028747782111167908,
        -0.07221721857786179,
        -0.036226723343133926,
        0.010913670994341373,
        -0.03409108892083168,
        -0.022437412291765213,
        -0.0408979095518589,
        -0.009061969816684723,
        0.040825679898262024,
        0.03652099892497063,
        0.007791430689394474,
        -0.0016794054536148906,
        -0.006627300288528204,
        -0.007170411758124828,
        -0.018789660185575485,
        -0.04843219742178917,
        -0.02642710693180561,
        0.14922119677066803,
        0.02770509198307991,
        -0.09086861461400986,
        0.023217277601361275,
        0.031084366142749786,
        -0.011665161699056625,
        -0.05403074994683266,
        -0.012053611688315868,
        -0.03648862987756729,
        -0.0275417547672987,
        0.0035052660387009382,
        0.020360786467790604,
        -0.06973645836114883,
        0.05027303472161293,
        -0.10016842931509018,
        0.025201287120580673,
        0.03901723772287369,
        0.04351012408733368,
        -0.011908498592674732,
        -0.06305945664644241,
        0.026494784280657768,
        0.08253724128007889,
        -0.13105465471744537,
        -0.0026536190416663885,
        0.13232673704624176,
        0.03186434879899025,
        0.023562490940093994,
        -0.05649881809949875,
        -0.013697288930416107,
        -0.02151656337082386,
        0.04368684068322182,
        0.01808761991560459,
        0.06971412152051926,
        0.029358601197600365,
        0.007970771752297878,
        0.03321712464094162,
        -0.06643861532211304,
        0.04225487634539604,
        0.13255493342876434,
        0.03861553966999054,
        -0.08397234231233597,
        0.011855189688503742,
        -0.034313421696424484,
        0.0204075425863266,
        0.03842801973223686,
        -0.006641976535320282,
        -0.022103920578956604,
        -0.01604839228093624,
        -0.04689229652285576,
        -0.025577671825885773,
        0.0312650091946125,
        -0.019404275342822075,
        0.032138314098119736,
        -0.014385743997991085,
        0.0200335793197155,
        0.050689198076725006,
        -0.032402507960796356,
        0.01894453354179859,
        0.04368804022669792,
        0.010907536372542381,
        0.0018339839298278093,
        0.003932070918381214,
        -0.0809076651930809,
        -0.013118088245391846,
        0.006596655584871769,
        0.01787547953426838,
        -0.003110176883637905,
        -4.9712229149770565e-33,
        -0.00919631589204073,
        -0.06515424698591232,
        -0.07211056351661682,
        0.0949423611164093,
        -0.051278237253427505,
        -0.07732508331537247,
        -0.018120333552360535,
        0.06813957542181015,
        -0.036119550466537476,
        -0.04163474217057228,
        -0.012827098369598389,
        0.05631064251065254,
        -0.006428886204957962,
        -0.030576089397072792,
        0.012393629178404808,
        -0.11122297495603561,
        0.058793775737285614,
        -0.05681043490767479,
        0.028039228171110153,
        0.011403452605009079,
        0.04019348695874214,
        0.022100385278463364,
        -0.06661540269851685,
        0.00238301744684577,
        -0.004070519935339689,
        0.03715477138757706,
        0.05941439047455788,
        0.027186010032892227,
        -0.020978249609470367,
        -0.022003060206770897,
        0.03213014081120491,
        0.00464479299262166,
        0.007286599837243557,
        0.10052037239074707,
        -0.0033478080295026302,
        0.013176864013075829,
        -0.022166134789586067,
        0.06059183180332184,
        -0.05709930136799812,
        -0.1330515444278717,
        0.02768690325319767,
        0.056067731231451035,
        -0.028071558102965355,
        0.02767546847462654,
        -0.02824333868920803,
        -0.005818224977701902,
        -0.045999009162187576,
        0.022358180955052376,
        0.02279830165207386,
        0.03084961511194706,
        0.015566831454634666,
        -0.016127338632941246,
        0.02064155787229538,
        -0.020289327949285507,
        -0.07494885474443436,
        -0.04068572074174881,
        -0.02507147192955017,
        0.08950190246105194,
        0.011162614449858665,
        0.0063371057622134686,
        -0.014967679977416992,
        -0.03452591598033905,
        -0.00916929729282856,
        -0.04644939675927162,
        -0.05595347657799721,
        0.01587080955505371,
        0.11632461845874786,
        0.045697081834077835,
        0.038501810282468796,
        0.02657492086291313,
        0.009755951352417469,
        0.0069100335240364075,
        -0.09332851320505142,
        -0.06216815859079361,
        0.00022617322974838316,
        0.10143787413835526,
        -0.010224412195384502,
        -0.040114760398864746,
        -0.040856316685676575,
        2.2435966457123868e-05,
        0.002044713357463479,
        0.04138948768377304,
        0.04278811439871788,
        0.04532463848590851,
        0.06432046741247177,
        0.06899186223745346,
        -0.03104362078011036,
        0.04894283786416054,
        -0.0012219289783388376,
        0.005581806879490614,
        -0.08585043251514435,
        -0.048821307718753815,
        -0.056378912180662155,
        0.08681727945804596,
        -0.07832276076078415,
        -6.484416559260353e-08,
        0.03084779530763626,
        -0.04934002831578255,
        0.0623677559196949,
        0.04468879476189613,
        0.1248551681637764,
        -0.011667618528008461,
        -0.011694353073835373,
        0.05512941628694534,
        0.04221193864941597,
        0.061414871364831924,
        0.03815390542149544,
        -0.056419964879751205,
        -0.11316005140542984,
        0.022658539935946465,
        0.004199360962957144,
        0.009153962135314941,
        -0.00783435720950365,
        0.05942990258336067,
        0.003944056574255228,
        -0.06471136212348938,
        -0.10065025091171265,
        0.045436300337314606,
        0.05046875402331352,
        -0.10177092254161835,
        0.052734844386577606,
        0.01315577793866396,
        -0.01086738146841526,
        0.017587237060070038,
        0.04626837000250816,
        0.004283260554075241,
        -0.040089745074510574,
        -0.09556139260530472,
        -0.044443871825933456,
        0.014550791122019291,
        -0.002175132976844907,
        -0.09217295795679092,
        -0.06363248080015182,
        0.019374486058950424,
        -0.003192285541445017,
        -0.02598585933446884,
        -0.004011965822428465,
        0.004556150641292334,
        -0.00941065140068531,
        -0.021757973358035088,
        0.012513911351561546,
        -0.017759306356310844,
        -0.07959398627281189,
        -0.026005884632468224,
        0.047435201704502106,
        -0.054962653666734695,
        0.008271245285868645,
        -0.09783297032117844,
        -0.0010889382101595402,
        0.06305955350399017,
        0.06453454494476318,
        -0.014884354546666145,
        0.013583661988377571,
        -0.04014012590050697,
        -0.02435476891696453,
        0.09701478481292725,
        0.09309755265712738,
        -0.12286090105772018,
        -0.0425933375954628,
        0.08622173964977264
    ]
}