{
    "id": "ghNMcG28rmM",
    "title": "macOS Mojave Beta Installation Complication - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2018-06-14T20:09:28Z",
    "video_url": "https://www.youtube.com/watch?v=ghNMcG28rmM",
    "category": "Science & Technology",
    "tags": [
        "macOS Mojave Beta Installation Complication",
        "macOS Mojave Beta Installation",
        "macOS Mojave Beta Installation Complication - Krazy Ken's Tech Misadventures",
        "Apple",
        "WWDC",
        "Macintosh",
        "Mac",
        "MacBook Pro",
        "G4 Cube",
        "Vintage",
        "Tech",
        "Apple Studio Display",
        "Demo",
        "macOS",
        "Beta",
        "macOS Mojave",
        "Dark Mode",
        "Funny",
        "Comedy",
        "Humor",
        "KKTM",
        "Krazy Ken",
        "Krazy Ken's Tech Misadventures"
    ],
    "views": 77692,
    "likes": 1493,
    "comments_count": 237,
    "description": "It's time for Krazy Ken to install macOS Mojave Beta, but he chooses to overcomplicate it. And through this journey of tangents, over complications, and tech issues, who's to blame? You! It's all your fault . . . so he says.  Want more videos like this?   Check out Software Showcase   Subscribe for new content!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures #56 - macOS Mojave Installation Complication  Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?   Amazon links are powered by the Amazon Associates Program.  #KrazyKen",
    "description_links": [
        "http://krazyken.thecomputerclan.com",
        "http://ss.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- [Krazy Ken] Yep, somewhere in the procedure, we (beeping) up. All right, so we know that feature doesn't work. There is absolutely nothing unprofessional for this setup, I don't know what you're talking about, it looks perfectly normal. Let's just go back and forth a few times, just to make sure we've got it down. (beeping) (upbeat music) Hey guys, how you all doing? Really? That's just great. You know what, I'm kind of actually good today, too, because today I get to play with macOS Mojave. We're gonna have a nice little beta installation sensation on this headless Mac Mini. Now you may be wondering, Ken, it's headless, how the heck are you gonna see, like, what you wanna do? We don't need to see the operating system to enjoy it, right? I'm just kidding. We're gonna be hooking up something a little special today. We're gonna do something a little different, and as you can see, we're also in Jony Ives's white room because it's a special day for Apple software beta testing stuff. And we're gonna be using, ooh, that was anticlimactic, let me try that again. We're gonna be use-- that's the wrong manual, hang on a second, we're gonna be using conversion technology to do this episode. That is right, I'm gonna hook up (grunting) this old thing, which you will be seeing, actually, in the upcoming flagship show The Computer Clan is working on, hint hint wink wink, this is an Apple Studio Display, and I figured it'd be kind of fun to install the new stuff with an older monitor. Look at that beaut, flat screen LCD 15-inch pinstripe beauty. So I'm gonna hook this up and see if it works, and it better work, because I spent 20 minutes trying to uncover the cord to power the conversion technology. It's one of those mickey cords. I don't remember the industry term for these, but I call them mickey cords. So yes, this is a DVI to ADC converter and it's still in the shrink wrap. I don't think it was ever taken out. And for those wondering what ADC is, well, if you're under the age of zero, you may not know what this is but this is Apple Display Connector. It is a single port that drives video, USB data, and power all in a single cord. Pretty cool technology. So that's what we're gonna convert to get it working on our new test system. And I just realized I don't have anything to prop this up against because the leg broke off in shipping. Great. Now we all know that one level of conversion technology is never enough, so what's the solution to anything on this show? More conversion technology. Because this Mac Mini does not have DVI on it, but it has HDMI. We can do that, screw it in. HDMI goes into the HDMI port as one would guess, it's like a little puzzle. And we also have USB. Two stages of conversion technology. We're going from HDMI to DVI to ADC. This can't possibly fail. I found a solution. (grunting) (coughing) Excuse me. (grunting) Yeah, G4 Cube, one of the classic Apple computers that sold for about a year and that was it. You're actually going to be seeing more of this on Krazy Ken soon and on the new flagship show I was talking about earlier, so stick around for more cube. As for now, though, don't get too excited. We're not gonna be installing Mojave (laughing) on this G4 Cube, that would be insane. We're just gonna use the G4 Cube to prop up the monitor. Sorry, G4 Cube, you've been demoted from personal computer to door stop, which actually makes you more useful than you were when you sold as a computer. Anyway, we're gonna prop you up. Bleh, yeah, uh, there, perfection-- oh, (beeping) piece of (beeping). Why did the eBay guy rip my leg of this thing, like uh? Okay, don't fall. So is there like a Guinness Book of World Records category for like most complicated beta software hardware configuration? I mean, this maybe would be runner up. But yeah, I love how we're overcomplicating this. We'll get to the installation eventually. I just wanted to make sure the moment is presented you know, on a nice Apple display 'cause I don't have any other Apple display. I really don't. My cinema display got destroyed by fricking FedEx when I tried to sell it. All right, now, let's hook up our conversion technology. The box is on the floor. Right, so I'm on the floor now. We got this, this thing goes into here. I think I got it. Here we go, it's on fire, is that normal? I will now hook up the Apple keyboard. The non-magical version. And on the back of this display is actually a USB. And for our mouse (laughing) yes, the old mighty mouse, which is now the Apple mouse due to trademark issues with the scroller, which was kind of cool but always got like clogged up and stopped working. We'll see if this one works, place your bets now to see if it works or not. It was in dusty storage for like five years. We are just about ready to go. But wait, there's more. This Mac Mini currently doesn't have any Mac operating systems on it. That is where the SSD will come in handy. There is a Sierra volume on here, and there is a blank partition to install beta software, so let's hook that up. Tada, I give you the most overcomplicated macOS Mohave beta installation sensation in the world. Let's boot it up. Can I boot it up from here? No, that would have been impressive. (Apple gong) Bong. Okay, moment of truth, will the display work? We're going through multiple levels of conversion technology. Holy balls, it worked. 10-10-5? That can't be right. And I installed High Sierra, whatever, I legitimately do not care at this point. This is cool, just the modern like boot screen on this old, beautiful, pinstripe polycarbonate, I think it's polycarbonate, Apple display with the touch glowy buttons. Oh my gosh, dude, this is like nostalgia right here. I am digging this. I am really digging this. We're really overcomplicating things, but it is so worth it, dude. Wait a minute, wait, shit, no, wait. Something is not right, hang on. Oh no no no, I have a High Sierra start up disc, this is not, what the hell? Something's not right. We're gonna need disc utility, I just installed High Sierra on that SSD. I know I did; I just checked it earlier before making the tech video log, like the file system is there and everything. So why are you being a douche-nozzle? Oh dear. Disc 1 as 5? That's not good. It's supposed to say OS Reserve 1, oh and these must be, oh these volumes are probably all fricking corrupted and shit. I can't even mount these. What the hell happened? Oh no, this is bullshit. This was supposed to be easy. Now what am I talking about? Nothing's ever easy, no no, that'd be too easy. That's what they want you to think, that's what you would expect. Going by the boot picker, I'm guessing there are no bootable systems on this computer. (Apple gong) we're gonna get the blinking question mark of doom. Yep. Somewhere in the procedure, we (beep) up. And by we, I mean you. It's all your fault. Well, I officially don't know what to say. I mean, the partitions show up on this MacBook Pro but not on the Mac Mini. Hang on a second. I think I know what's wrong. I'm guessing, you can back me up on this. This Mac Mini, oh man, I think the last system it had on here was El Capitan, maybe Sierra. Bottom line, it had a system on here that was not based on APFS. So I wonder if the firmware has no idea how to interpret the APFS volume. I bet you a million bucks that's what it is because check this out. No name is a FAT32 volume, that's normal. It can read and write to that. OS Reserve is macOS extended, which is HFS+ and then it's journaled, so it's HFS+J. Sacama is also HFS+J. This though, is running High Sierra, which automatically formats for APFS. This recovery mode is based on Yosemite, which came out years before that file system was introduced, it has no idea how to interpret it. And the firmware on this computer, if I had to guess, it might be a firmware update or something that's missing, but the computer doesn't understand what APFS is. It can't find it in the boot picker and the recovery partition certainly doesn't know how to mount it. So I'm thinking we're just gonna have to use a different computer. There is absolutely nothing unprofessional or completely over-the-top for this setup, I don't know what you're talking about. It looks perfectly normal. All right, so, with a lot of fidgeting around, I think we finally have a solution. Let's maybe make this look a little neater. Well, the cables are just gonna dangle. Bon appa-bugle. All right, clamshell mode is now fully functioning. And we have the OS Reserve partition now with High Sierra, great, we are almost to the point (laughing) where we can start installing Mojave. I am so sorry about this tangent. Log in, and there we are. High Sierra on this nice Studio Display here. And this is my main drive it's picking up. That's encrypted in separate, I am not gonna unlock that. I don't want any beta stuff touching my shit. It is now time to open up the macOS 10.14 beta installer. The scrolling pea like half works, so I guess people half win and half lose the bet as to whether or not it was gonna work or not. All right, basically the first part of this agreement is saying don't be an idiot and install this on a daily driver. That would be dumb. All right, show all discs. We are going to install this on OS Reserve 2, we are gonna preserve everything else. And here we go. Prepare to restart. Well, here's something I didn't take into consideration. Nothing serious, but we are get a bit of a moire pattern on graphics because, well, the resolution of the screen is quite a bit lower than current displays we use, so you're gonna be seeing a little bit of that. Now it just adds to the oldness, the nostalgia, oh and that flickering, that's good too. We're at about nine minutes remaining. It's going pretty fast, but, again, we are on this beautiful, glossy SSD. You know, I've heard so many people pronounce that different ways. I know it's French for the company, but apparently people say, and I'm still wrong, I don't know, I'm not French, I'm sorry. So there's quite a few things I do wanna try in Mojave and actually, if you have not seen me freak out and commentate the WWDC keynote address, I highly recommend checking that out, but you know, one thing that I really lost it over was dark mode because that was one of my predictions and I love dark modes, I like dark things, I don't know why. (laughing) I just do, so I cannot wait to fiddle with that. And I have a feeling it's gonna be more powerful than any of us ever thought possible. Here we go, progress bar, no estimated time remaining, so I think it rebooted while I was stepping away to get a healthy, sober beverage. Can a beverage be sober? I actually don't know, I might have made that up. Oh, look at that moire pattern. I'm so sorry to put you through this. I might just say screw the retro technology. (laughing) Oh gosh, that's really moire-y, oof. Well, I wanna use it a little bit longer, then I'll probably just switch to my retina display. Well, this has really turned from macOS Mojave installation sensation to an installation overcomplication. I do apologize. You're just gonna have to suck it up with the moire pattern for now. The software installation itself was pretty effortless, I like how effortless Apple makes major software installations, even betas. They're just so easy to install. All the other stuff is just me overcomplicating stuff because I wanted to. (laughing) The installation itself, piece of cake. Good job, Apple, I like ya. Let's do the kissy lips 'cause that's absolutely horrible. (laughing) Cupertino, no thank you. I do not want to live there. Chicago, that sounds good, that's a word that has something to do with onions, I think. Hmm, prerelease betas automatically send diagnostic usage information, I mean, that makes sense. It wouldn't really make sense to opt out of it for a prerelease. You know, I think it's kinda funny 'cause pretty much everyone, including me, bitches at Apple for their bad quality assurance as of late, but I bet when we get to that screen, we always turn off the \"send useful information to Apple,\" so it's like, Apple, make better quality assurance, and they're asking us to send diagnostic information to help them, and we always turn it off, so it's like ah. (laughing) We're not helping anybody. Oh, you can choose the look right from, oh, that's hot. Oh, that's beautiful. We're gonna change that later, though, yeah, let's enjoy the light mode a little bit and then choose the dark mode. Cross over to the dark side. Oh and yet it still put the, oh, 'cause it's a dynamic wallpaper, that's right. It's nine o'clock at night, so the wallpaper shows up as it being dark, well, let's take a look at that. Mojave dynamic, but yeah, so here's like the daytime, here's the nighttime. And here's the dynamic one, ooh. That's kinda freaking cool. So it'll change based on the time of day and the location. I don't have location services on right now, though, so boo fricking hoo, all right. So now, something I've been waiting a long time for. Let's go here and holy balls, accent color? Whoa. You can change the accent color? What? (gasping) Oh, but holy crap dude, you can change the accent color. I'm freaking out about this, I mean, this is probably something you could do on Windows since like Windows 3, but, I mean, you could actually do this on the old macOS. Now that I think about it, the old Platinum interface. And you could actually do this shit in OS 10 if you knew how to hack up the system properly, but now it's built in. Oh, that is swanky. That was probably not a thing I should have said, but oh my gosh, you can change the fricking accent color. Dude, I am overly happy with this, I don't know why. I'm probably going to stick with blue because I just like blue, I'm used to it. But yeah, if you wanna go green, go green. Oh my gosh, I just, I'm gonna cry. I'm gonna cry. This is beautiful, okay. Now the moment I have all been waiting for. Let us initialize the dark mode. (clicking) Oh, holy crap, not only did it adjust the interface, it automatically adjusted the lighting in my lair. Shit, I didn't know those things were hooked up with HomeKit, all right. So how does dark mode look with red? Ooh, that just looks evil. Ooh, diabolical, orange? Dark mode with green, dark mode with gray, ooh, that's really pro-looking. Dark mode with that pink, I actually kind of like that pink. Huh, all right, well, I need the lights back on. Huh, there you go. Huh, that's a pretty cool feature. I don't remember granting the Home application permission to do that, but cool. Now it would have been really cool if it turned on the dark mode for my mouse. I already turned on the dark mode for this mouse. The old Pro mouse, good stuff, huh? Right, so I switched to a retina display so there's no more moire pattern, but for the sake of nostalgia because I want it still and to complement the dark mode, I will be using a black Pro mouse. No side buttons, no right click, no middle click, no scrolling, just, you know, mouse. All right. Let us enjoy, oh man, there's things to explore. I wanna look at those fricking, oh, I should probably get a mouse pad. (grunting) Hang on a second there's gotta be something back here, nope. (rustling) Oh boy. Ah, here we go. All right, well I made this thing a long time ago. Edit like a pro, found like a pro, all right. Here we go, that's horrible still. I don't know if you can adjust the click thing with the thing in the, oh my gosh, nothing is freaking working, you know, just screw this shit. I'm just gonna use the touch pad, okay. And I love how even the trash icon changes. That's awesome. And we have these cool accent colors, man, I'm tempted to use pink. So it looks like, yeah, software update is now inside of system preferences, but you still have the App Store separately, but for like system software updates, I'm guessing, that's done inside of here now, all right? Let's take a look at our applications. I know we got the News app now. IBooks just got renamed Books. We have Facetime, with group Facetime now, I believe. And oh, there we go, I was trying to swipe to that other page, I was like, where's the other apps? So yeah, we got home now integrated, the News app, Stocks and Voice Memos, apps that are famous on iOS, they are now on macOS and Apple's also actually also gonna be making it easier, so I hear, for people to port iOS apps to macOS, so that's gonna be cool. Let's just open up all these here. Now, I can't afford any of the nice home devices because I'm poor, but there, home, well that's that. I'm just kinda looking at the dark mode across all these things, so you've got Voice Memos here, News here, Kanye West making a claim about Deadpool music, I don't know if I want to get into that. About News, News. Well, thanks for clearing that up, I appreciate it. Well, yes, about Voice Memos, Voice Memos. Yep, well that's cool, let's do a little test. Call me Ishmael, I don't know the rest of the words to this book because I haven't read it yet. For those keeping score at home, I think I quoted Moby Dick, but I'm not sure. And I'm guessing at least 10% of our audience is now laughing at the word dick, well that's their fault. Tune in next time for more dick. Pause, resume. Oh, replace, you can replace with another recording. - [Recording] Call me Ishmael, I don't know. - Okay, that is pretty awesome now that, okay, I hit done, where'd it go? Did I not save it? All right, take two, take two. Okay and done. And done. Oh, now it's saved. What the shit. - [Recording] All right, take two, take two. - What is this, a beta program or something? (laughing) Funny, oh and I just deleted it by doing a big swipe, okay, so that works. This part of the interface is a little bugged out, but yeah, okay. I used to track the stock market more. I don't really anymore. But it's cool that it's now built into here as well. We got News as well, sparklines, graph things. Let's take that full screen, that looks pretty cool in full screen, huh? Now, I'm kinda getting like a Windows 8 vibe, because I think it was on Windows 8 where Microsoft started putting all these types of apps inside of the system and that's also when they were doing the whole thing where it's like oh, you can develop for this one device so you can develop for this device, you know, make it easier to cross the software from one device to the other, so I think that's what Apple's trying to do now. 'Cause I feel like Microsoft's been doing that for like years already, but you know, it's good to see you know, Apple do it. They're doing it in their own way, but you know. So I'm noticing a new area on the dock here. So here's where we can put like documents and folders, here's where we can pin apps, but it looks like open apps, or like currently running apps that aren't on this side and suggested apps show up on this side. I'm sorry, this tech video log is kind of full of tangents, but while I was, you know, fiddling around with Mojave, a fan actually messaged me that my Bring Back the Bong video got linked on Reddit. That's pretty cool. Hey, that was a fun video, that was a fun video, man. I like watching that one. What else shall we look at? Well, I know that Safari got kind of beefed up. Now the main things with Safari were like more like security things, like, you know, the fingerprint blocking and all that stuff. Man, dark mode looks sexy with our website. Oh, oh goodness, yes, that is pretty. Oh yes, oh gosh, the gallery view, okay, let's just enjoy this for a second, so. So it looks like cover flow got the shaft and now there's this gallery view where you've got like a thumbnail strip on the bottom with larger previews up here. Which kind of reminds me of you know, Windows XP and how they did that with the filmstrip view, I forget what they actually called it. Add password? What? Create a password for the archive. For the archive, what archive? But yeah, there's also contextual items down here, also kind of like on Windows XP, but hey, we won't nitpick. Let's get some content on here. Right, so I spent some time in the Computer Clan wallpapers gallery and downloaded some images. So yes, here is that view, looks like we have our little filmstrip thumbnails along the bottom and the larger previews there. And we have some contextual, ooh, that actually looks kinda cool that way, actions here, markup, more, rotate, create PDF, add password? That is interesting, add password. I wanna see what this is, okay, so does it like zip it up into like an encrypted zip file? Let's find out. So then here's the original item. Here's the zip, so if I open it, it does nothing. All right, so we know that feature doesn't work. (laughing) Um, yeah, so I'm gonna stay away from that for now. Let's move you to the trash. I'm just looking at all these new menu items and shit. I just duplicated that, no, go away. Get the shit out of here. We're gonna, oh, iCloud Drive is now under locations. I don't think they did that before. Oh, you can, oh hey, you can even zoom in on here. That's pretty cool, oh, smart zoom as well. Can you rotate in here? No, you can't rotate in here, but you can zoom and pan around, that's cool. Yeah, these were some cool shots I got in Chicago. Look at that, that's beautiful. All right, so yeah, there's also markup in here. And QuickLook also has markup in it as well, so QuickLook has a few additional expanded features, which is pretty nice, so, you know, if you need to mark something off here, you can do it right inside QuickLook there. That's a beautiful circle I drew, I'm just gonna, there I drew a circle. Just to highlight the moon in case you forgot where the moon is. Let's try something a little more exciting, okay, let's make this red. Let's make this big. And let's draw a big star. There you go, so there you go, now there's the moon and a star, hit done. So basically, without even opening an application, we previewed and edited an image with a little bit of markup right there. Yes, there are more practical uses for this stuff, I've done markup before, I really just literally have no idea what else to add to this. Yeah, if you were expecting a professional demo on Krazy Ken's Tech Misadventures, no. That's what the Tidbytes show is for. You can tune into that as well if you'd like. Anyhoozle, so let's group a bunch of these together. You get a nice little stack, that's pretty cool. And now we get more actions over here. So let's say I create PDF, it now made a PDF with all the images in, and you can actually scroll through the PDF right inside this preview here, so that is pretty nice. All right, so, let's take a look at that screenshot feature just because we can. Now, I happen to know that people have pointed out this bug and I've noticed it before and I have yet to fix it, but the music button on our website actually goes to the wallpaper section, which is very dumb. So, I'm gonna do shift-command-4, make a note to myself. (camera snapping) Pops it down here, I'm gonna go edit that. And I'm gonna say, I'm gonna draw a big circle fix this, make it nice and big, eventually. Bear with me, it's getting bigger. Hang on, we're almost there, almost there, there we go. There's my screenshot I took right there. Now I know I need to fix that shit. And just for shits and giggles, I turned on the Favicons in the tabs. Those look kinda cool. That's actually a feature I might keep on 'cause I like seeing the little website icons up there. I heard the App Store got a bit of a facelift. Let's go hop into our little App Store friend. Oh, he doesn't want to open, he's shy. (clicking) Open, there we go, welcome to the App Store. New design. Well that's cool, nice sidebar here. This is nice, the App Store was getting a little out of date. Well let's see how, let's see how Final Cut Pro's doing. My daily driver of choice. Video previews, were video previews in the last App Store? Well, like iOS has, oh, oh, the dark notifications, oh my gosh, I'm so happy. Oh, and the notification center is dark again, yes, we got that back 'cause they took that away from us in (laughing) was it in Sierra or High Sierra? It was in one of the Sierras, I think, where they stole that from us, it was one of those. I gotta fan on Twitter that said, \"Oh please show us the new login screen and if there's a battery widget.\" well, first of all, I didn't hear anything about a login screen, so I'm gonna go check that out, but no, there's definitely no battery widget, I can tell you that much. Sorry to disappoint you, I mean, there's still this little thing but stupid fricking archive utility is being a cock weasel and won't let me (groaning) Hey, get the, what the shit? Okay, hang on, I got this. I can't show the login screen if I can't there we go, get that to quit, all right. Log out. I don't remember hearing anything about a login screen. Oh, oh, oh. (gasping) It is new. Oh, I think there's a snowstorm in my pants. That's pretty, oh. Oh, oh my gosh. I am so glad you suggested that there, Edward, I think that's the nickname you said I should call you, oh, I'm so sorry if I butchered that. I'm gonna tweet you, and you just got a mini cameo. (laughing) Yeah, it is new. Okay, so it looks like the login or like the account pictures are a little bigger. It doesn't do the blur thing with the wallpaper. And the buttons now have like little fills to them, they have like little circular fills to them. So word on the street is the DVD player got updated. Well, that's something I don't think I've used in years. (laughing) but it's nice that it's still in there, I just gotta find where it is. DVD player, where's the DVD player? There's the DVD player. Huh, so where's it located? Oh, oh, it's in core services, all right. Oh yeah, this does look new. Sweet. Yeah, they haven't updated this app, like the appearance of it, in like approximately ten thousand years. So I'm glad they did that. I just kinda wanna be an idiot and like open all of this stuff and just watch the modes change all at once because it's a free country and I have that power. Light, ah, that looks really bright now after looking at this. Let's just go back and forth a few times just to make sure we got it down. There we go, okay, well, I hope that didn't hurt anybody's eyes. Now when you wanna open it, nice. You can drag, right-click. Aw, that's cool, can you do it in slow motion? Yes, oh, yeah, those desktop stacks are kinda cool. I can dig it. I'm digging this. Yeah, I might do a more professional demo on Tidbytes later, it's a maybe, we'll see. I wanna know what you guys are gonna do. Are you guys gonna wait a little while, oh what the, oh that's glitched out, too. Are you guys gonna wait a while 'cause the last time, I really should have waited for the dot updates of High Sierra and I didn't and it caused problems. And if you haven't seen me rant about that, you can. So I'm probably gonna wait until like 10.14.2 or something to upgrade. 'Cause I don't wanna deal with that crap again. (laughing) but as for today's installation sensation overcomplication frustration menstruation commemoration, I am calling this a win. And that Apple Studio Display was also fun to use. Awesome guys, well let me know what you think of macOS Mojave (upbeat music) and I got more Krazy Ken on the way, maybe with a little Linux stuff, hmm? You betcha, catch the Krazy and pass it on.",
    "transcript_keywords": [
        "High Sierra",
        "Apple",
        "dark mode",
        "Apple Display",
        "Apple Studio Display",
        "App Store",
        "dark",
        "cool",
        "Sierra",
        "kind",
        "Mac Mini",
        "mode",
        "Display",
        "Yeah",
        "thing",
        "App",
        "Apple Display Connector",
        "conversion technology",
        "apps",
        "nice Apple display"
    ],
    "transcript_entity_values": [
        "Yosemite",
        "about a year",
        "macOS Mohave",
        "a minute",
        "the Mac Mini",
        "Windows XP",
        "two",
        "SSD",
        "Mojave",
        "OS Reserve 2",
        "Krazy Ken's",
        "Facetime",
        "a High Sierra",
        "mighty mouse",
        "one",
        "OS Reserve 1",
        "Two",
        "Twitter",
        "El Capitan",
        "High Sierra",
        "this MacBook Pro",
        "Edward",
        "Bong",
        "Krazy Ken]",
        "years",
        "Apple",
        "like five years",
        "20 minutes",
        "Final Cut Pro's",
        "mickey",
        "Tech Misadventures",
        "ADC",
        "Mac",
        "HFS+",
        "about nine minutes",
        "Mojave",
        "Sierras",
        "iCloud Drive",
        "Mojave",
        "first",
        "Microsoft",
        "at least 10%",
        "oof",
        "Linux",
        "APFS",
        "HomeKit",
        "Favicons",
        "Apple Display Connector",
        "WWDC",
        "USB",
        "Deadpool",
        "Ken",
        "DVI",
        "Home",
        "Kanye West",
        "Krazy",
        "App Store",
        "French",
        "the App Store",
        "Jony Ives's",
        "Chicago",
        "Tidbytes later",
        "Sierra",
        "today",
        "a Guinness Book of World Records",
        "Krazy Ken",
        "Safari",
        "Windows",
        "QuickLook",
        "OS Reserve",
        "Bleh",
        "a million bucks",
        "Reddit",
        "Anyhoozle",
        "Sacama",
        "10-10-5",
        "half",
        "daily",
        "the time of day",
        "Moby Dick",
        "Tada",
        "nine o'clock at night",
        "eBay",
        "Tidbytes",
        "This Mac Mini",
        "10.14",
        "Windows 8",
        "the age of zero",
        "15-inch",
        "The Computer Clan",
        "Windows 3",
        "FedEx",
        "the App Store",
        "Ishmael",
        "PDF",
        "second",
        "This Mac Mini",
        "OS 10",
        "Cupertino",
        "HDMI"
    ],
    "transcript_entity_types": [
        "GPE",
        "DATE",
        "ORG",
        "TIME",
        "FAC",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "LOC",
        "EVENT",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "TIME",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "TIME",
        "NORP",
        "LOC",
        "FAC",
        "GPE",
        "ORDINAL",
        "ORG",
        "PERCENT",
        "PERSON",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "EVENT",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "NORP",
        "FAC",
        "PERSON",
        "GPE",
        "LOC",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG",
        "LOC",
        "EVENT",
        "CARDINAL",
        "LAW",
        "DATE",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "EVENT",
        "GPE",
        "ORG"
    ],
    "vector": [
        -0.061968039721250534,
        -0.061443544924259186,
        0.05134802311658859,
        -0.09050004929304123,
        0.04438861459493637,
        -0.0476728118956089,
        0.0464845672249794,
        -0.062151744961738586,
        -0.006660137791186571,
        -0.014876751229166985,
        0.05707357078790665,
        0.058443497866392136,
        0.0369240939617157,
        0.027174364775419235,
        0.01745249517261982,
        0.031973715871572495,
        0.08876224607229233,
        -0.04674607887864113,
        0.003837489988654852,
        0.03139018639922142,
        0.000706333143170923,
        -0.1339755654335022,
        0.05475292354822159,
        0.04998185485601425,
        -0.04512419179081917,
        0.059792254120111465,
        0.029910128563642502,
        0.01977657526731491,
        -0.0675872266292572,
        -0.024804899469017982,
        -0.009169673547148705,
        0.02818177454173565,
        -0.0044457376934587955,
        -0.07385572791099548,
        0.07921776175498962,
        -0.06421372294425964,
        0.015168460085988045,
        -0.003739583073183894,
        -0.14207866787910461,
        -0.005941339768469334,
        -0.05732565373182297,
        -0.008818662725389004,
        -0.003621123731136322,
        0.0462045855820179,
        -0.007654682267457247,
        -0.036565206944942474,
        0.04740593209862709,
        -0.07357636839151382,
        0.07356451451778412,
        -0.06408669799566269,
        -0.0516820065677166,
        -0.0697811022400856,
        0.05733850598335266,
        -0.005169798620045185,
        0.01611384004354477,
        0.0028637435752898455,
        -0.0208123829215765,
        0.06022636964917183,
        0.12848646938800812,
        -0.01831047795712948,
        0.026863254606723785,
        -0.0516127310693264,
        -0.0016956988256424665,
        0.09305274486541748,
        0.04998725280165672,
        -0.03583915904164314,
        0.015961792320013046,
        0.022992191836237907,
        0.006800242234021425,
        -0.027976760640740395,
        -0.006766521837562323,
        -0.01321739237755537,
        0.03136785700917244,
        0.1136716827750206,
        -0.03138893097639084,
        0.028554445132613182,
        0.03272739425301552,
        -0.044394634664058685,
        0.011280531994998455,
        -0.05797796696424484,
        0.02767854370176792,
        -0.043803870677948,
        -0.05312914028763771,
        -0.07584573328495026,
        0.06416924297809601,
        0.019649872556328773,
        -0.030942901968955994,
        -0.025507550686597824,
        0.007092462386935949,
        0.042018260806798935,
        -0.00029910681769251823,
        -0.025571733713150024,
        0.07323819398880005,
        -0.0342123806476593,
        0.00029117133817635477,
        -0.059659287333488464,
        0.03627150133252144,
        -0.016542743891477585,
        -0.08215810358524323,
        0.08218397945165634,
        -0.014658668078482151,
        -0.031590089201927185,
        0.07663874328136444,
        -0.027004508301615715,
        0.00631579477339983,
        -0.07398022711277008,
        0.009785618633031845,
        0.08002413809299469,
        0.023957036435604095,
        0.025813499465584755,
        -0.02490793541073799,
        0.01629791222512722,
        0.035144153982400894,
        0.006056858692318201,
        0.024847041815519333,
        0.08232665807008743,
        -0.08241413533687592,
        0.05053272470831871,
        0.04252395033836365,
        -0.017480194568634033,
        0.04890889674425125,
        -0.05022797733545303,
        -0.039749179035425186,
        0.031458981335163116,
        0.08278701454401016,
        0.059479665011167526,
        0.013726086355745792,
        4.1251873045956085e-33,
        0.02410273812711239,
        0.03728378564119339,
        -0.021289439871907234,
        -0.011890729889273643,
        0.027663417160511017,
        -0.10765531659126282,
        -0.06831126660108566,
        0.05722678825259209,
        -0.1026456281542778,
        -0.0175237488001585,
        0.008678676560521126,
        -0.02641546167433262,
        -0.05056396871805191,
        -0.01184138748794794,
        0.01955031231045723,
        -0.01628948748111725,
        -0.03928276151418686,
        0.016989070922136307,
        -0.008520683273673058,
        0.028182106092572212,
        0.0735938623547554,
        -0.03497335687279701,
        -0.011241124011576176,
        0.003568478161469102,
        -0.049974314868450165,
        0.06451766937971115,
        -0.023245373740792274,
        -0.01793164387345314,
        0.06014345586299896,
        0.05721532180905342,
        -0.11735620349645615,
        -0.023593589663505554,
        0.054020512849092484,
        0.0075224582105875015,
        -0.060215841978788376,
        -0.05631288141012192,
        -0.0778021514415741,
        -0.060612477362155914,
        -0.030609220266342163,
        -0.04807226359844208,
        -0.07471896708011627,
        -0.0426066517829895,
        -0.09739580750465393,
        -0.03152069076895714,
        0.026426270604133606,
        -0.02946426346898079,
        0.07070887833833694,
        0.055609364062547684,
        0.04120871052145958,
        0.0735410749912262,
        -0.018570395186543465,
        0.002967730164527893,
        0.039174340665340424,
        0.027567952871322632,
        -0.042727380990982056,
        0.06308125704526901,
        0.07764744013547897,
        -0.11038734018802643,
        0.0690164715051651,
        0.0008006948046386242,
        0.048402685672044754,
        0.06591606885194778,
        0.047331441193819046,
        -0.06556853652000427,
        -0.02232256345450878,
        -0.03954637795686722,
        0.030780809000134468,
        0.05818196013569832,
        0.0037463605403900146,
        0.026488156989216805,
        -0.07228494435548782,
        0.050680793821811676,
        0.04416782781481743,
        -0.031608182936906815,
        0.044202499091625214,
        -0.03408116474747658,
        -0.08534621447324753,
        -0.019954850897192955,
        -0.04095110297203064,
        0.0257656779140234,
        -0.014690025709569454,
        -0.037883177399635315,
        0.009262185543775558,
        0.06926155090332031,
        0.012210560962557793,
        0.06651420146226883,
        0.019863059744238853,
        0.0482010543346405,
        -0.040040310472249985,
        0.10408622026443481,
        0.003379017813131213,
        -0.011369312182068825,
        -0.028887134045362473,
        0.025193428620696068,
        0.007731663063168526,
        -4.313015138809686e-33,
        0.0291306022554636,
        -0.04204511269927025,
        0.02616042271256447,
        -0.034154973924160004,
        -0.008247879333794117,
        0.012188167311251163,
        -0.02483142539858818,
        -0.04350103437900543,
        -0.005517645739018917,
        -0.09949344396591187,
        -0.010647719725966454,
        -0.03330085799098015,
        -0.07832026481628418,
        -0.04733532667160034,
        -0.04162903130054474,
        -0.006654493045061827,
        -0.08364559710025787,
        -0.0008181704324670136,
        0.010312153026461601,
        -0.01264152955263853,
        0.08071393519639969,
        0.016166532412171364,
        -0.004451062064617872,
        -0.013292239047586918,
        -0.018945159390568733,
        -0.012830347754061222,
        0.017084838822484016,
        0.11564338207244873,
        0.06342891603708267,
        0.054534267634153366,
        0.004256805405020714,
        -0.0036868934985250235,
        -0.12954674661159515,
        -0.04533998295664787,
        0.07478182762861252,
        0.03496161103248596,
        0.01706394925713539,
        0.08034749329090118,
        -0.05577623471617699,
        -0.01295239757746458,
        0.05507820472121239,
        0.08060280233621597,
        -0.14969371259212494,
        -0.05976678803563118,
        0.01626724749803543,
        0.040024735033512115,
        -0.019755128771066666,
        0.01895616017282009,
        0.010180817916989326,
        -0.08683935552835464,
        0.023688796907663345,
        -0.020346689969301224,
        0.018483716994524002,
        -0.0003317107621114701,
        -0.03925304114818573,
        0.04287194460630417,
        -0.02549547702074051,
        0.12834598124027252,
        0.022115588188171387,
        0.041383158415555954,
        -0.004314627964049578,
        -0.07894638180732727,
        -0.0216874610632658,
        -0.11409589648246765,
        0.015376731753349304,
        0.038865815848112106,
        0.06497211009263992,
        0.11452586203813553,
        0.03499341383576393,
        0.0013461130438372493,
        -0.03168420121073723,
        0.007251727394759655,
        0.03906654193997383,
        -0.12353844195604324,
        0.08005426824092865,
        0.05002763494849205,
        -0.08789920806884766,
        -0.07113595306873322,
        -0.046871431171894073,
        -0.03325999528169632,
        -0.007061926182359457,
        0.0099025908857584,
        0.033353593200445175,
        0.06711570173501968,
        0.0012444346211850643,
        0.09640224277973175,
        0.030406136065721512,
        0.04370828717947006,
        -0.005353335756808519,
        -0.0002716410090215504,
        -0.02092268504202366,
        0.033457882702350616,
        0.004748685285449028,
        0.10392613708972931,
        -0.02264484204351902,
        -5.4932062454327024e-08,
        -0.034861501306295395,
        -0.005499227438122034,
        0.00033554682158865035,
        -0.006496768444776535,
        0.08838184922933578,
        -0.04932648316025734,
        -0.008607652969658375,
        0.02861485630273819,
        0.020984873175621033,
        -0.0707617774605751,
        0.06097880005836487,
        -0.034957051277160645,
        -0.007847338914871216,
        0.09605839103460312,
        0.00368838245049119,
        0.0007853316492401063,
        -0.07974521815776825,
        0.1403438001871109,
        -0.051548849791288376,
        -0.06539643555879593,
        -0.001230921014212072,
        0.006071732845157385,
        0.04039815440773964,
        -0.010081208311021328,
        -0.011948325671255589,
        0.030726304277777672,
        0.03162919357419014,
        0.07662312686443329,
        0.03563670814037323,
        -0.0272351261228323,
        -0.11070194840431213,
        -0.017611682415008545,
        -0.07591328024864197,
        -0.013088665902614594,
        0.008959898725152016,
        -0.06979686766862869,
        -0.0752401351928711,
        0.07510238885879517,
        0.016642699018120766,
        -0.03207714110612869,
        -0.04147457331418991,
        -0.08354037255048752,
        0.007047751918435097,
        0.03182078152894974,
        -0.01687300018966198,
        0.047871869057416916,
        -0.02904646098613739,
        0.03111288696527481,
        -0.0034335812088102102,
        0.00826969463378191,
        0.02169296331703663,
        -0.018367504701018333,
        -0.04174773022532463,
        0.045275215059518814,
        0.07748057693243027,
        -0.028112083673477173,
        0.050425104796886444,
        -0.0603136382997036,
        -0.035117603838443756,
        0.03571580350399017,
        0.052072860300540924,
        -0.07326485216617584,
        0.01795135624706745,
        -0.01262704562395811
    ]
}