{
    "id": "GhWsEQK6pQ4",
    "title": "I took a 3080 eGPU apart!!! - Aorus Gaming Box",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-04-11T19:41:27Z",
    "video_url": "https://www.youtube.com/watch?v=GhWsEQK6pQ4",
    "category": "Science & Technology",
    "tags": [
        "NVIDIA",
        "Gaming",
        "PC",
        "AORUS",
        "eGPU",
        "3080",
        "Liquid Cooled",
        "Performance",
        "Took apart",
        "Custom"
    ],
    "views": 436666,
    "likes": 17439,
    "comments_count": 1788,
    "description": "Save 10% and Free Worldwide Shipping at Ridge Wallets by using offer code CIRCUIT at   eGPUs, they're nothing new, and we've checked out a water-cooled one before, but Aorus did something interesting with this one that has a 3080 in it. Alex decided that we should take it apart and check it out!  Buy the Gigabyte Aorus 3080 Gaming Box on Newegg (PAID LINK) at    Buy AORUS FI27Q-P 27\" 1440p Gaming Monitor On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):   Buy Logitech G915 TKL Wireless Keyboard On Amazon (PAID LINK):  On Newegg (PAID LINK):   Check out the Glorious Model O Wireless at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.ridge.com/CIRCUIT",
        "https://geni.us/7VtzdQ5",
        "https://geni.us/hBYPYZ",
        "https://geni.us/l97inm",
        "https://geni.us/k7S2",
        "https://geni.us/KOJlJUs",
        "https://geni.us/VhO5",
        "https://lmg.gg/zULpw",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- B-cam, how is this? Do I look cool? They're kind of two camps of things that are really dumb. Things that are only dumb, and things that are dumb but in an exceptionally cool way. And I think that this lands in the second camp right here. So, 'cause the AORUS RTX 3080 gaming box, and it is, well, it says the world's first water-cooled external graphics card, but they kind of already made one and we looked at it. But this is a new one with 3080 unit. We're going to look at it again. I'm pretty interested to see how well this performs because in the past, eGPUs were honestly kind of terrible for a lot of reasons. And I haven't looked at them in quite a long time. And maybe this has gotten better. Maybe it hasn't. We'll know in a couple of minutes. This is really heavy. I feel like eGPUs shouldn't be super heavy because like, you know, you kind of want to be able to take it places, but this one, I would not. So, here we go. It comes with-it says on the side of the box- a \"free\" carrying bag. Given this thing is super expensive, I would not call it free at all, but it is nice. - I would not call this travel size. Not so much because of the size. More so, because of the weight like if you're flying on a plane, you're not taking this. It's just, it's a no-go. Big no-go. Do they have strap for the bag? Okay. Pete, how is this? Do I look cool? Yeah, I would not. Well, anyway. Okay. Power adapter that we can't use. Another power adapter that we can't use. Hey, Jono. Can you get a power adapter that we're able to use? It came with ones for Europe and Asia. I would assume that this is, you know, pre-production and it will come with the correct power adapters. Anyway. Here it is. Comes a little Thunderbolt cable. And here's the star of the show. Okay, yeah. It's a black box. It actually does feel quite nice. Like the materials are really good here. All aluminum, I think. Anodized black. We have one USB in the front that looks really lonely. All right, around back, it's basically your normal GPU IO. I'm actually pretty disappointed by the IO back here. Normally, you got a pretty good, like, basically, Thunderbolt dock along with your eGPU. Whereas here you get two USB type As, ethernet, and that's it aside from your display hubs. So, you have three display boards, two HDMIs. What's this? Oh, that's smart. Okay. So, very easy to clean dust filter on the side. Slides in and out just like that. Let's see if this have like two. Yes. Perfect. Oh, okay. Nevermind, nevermind. I thought for a second there that the holes on top weren't actually holes but they are. Okay. - There you go. Wait. - Oh, thank you. - Nice. - Here we go. So let's test this out. This is just running off of the XPS 15. It has a 1650 Ti. And I think it's a pretty reasonable situation that you would want to try and game on this. You have something like this little Thunderbolt dock right here that has everything you need to connect it to. A big whole display. And I don't think it's going to be a great time. Start game. We're playing Valheim because I am addicted to Valheim. That's, that's whole thing. Yeah, we're getting a solid 20 frames per second. I would say for this game it's like borderline. Oh. Yeah, no. - Those look chunky. - Yeah, we dropped to like 15 there. It's-this is not great. All right but yeah, either way we're looking at about under 30 FPS for sure right now, but yeah. All right. Let's quit here and attach our eGPU. Now, we're hopping back into Valheim with the good ol' 3080 attached. It is probably better. It's going to be way better. There's no way it's not way better. So, yes. I'm going to not look at that for a second. I just want to look something up. Let's just get a rough idea of what the FPS should be looking like. Okay. My math said 92 and we're looking at 80, oh, we just dropped to 40. Yeah, we're looking at more like 60 FPS, but it's- it's not very stable. I don't know if that's a problem with, like, the CPU not being super happy or the GPU. It's definitely, it's a way better experience. This is beyond playable. Like this is quite a great time, I do have to say, but yeah, the frames keep on dropping to like the 40s. I don't know why. Let me unplug this, I hope it doesn't spark. That's cool. You can't see it because I just unplugged your capture device. But now I'm looking at 35 FPS. So if you plan on buying, it's stupid. This is so stupid. If you just want to get eGPU and plug it into your laptop and use your laptop's display, this is really dumb. I gained like 10 FPS for $1,400. It's going to be way better. There's no way it's not way better. So what do we even do from here, Jono? Actually before that, I want to see just how dumb this is or if it's not dumb. So, here I have, I just thought-it's kind of heavy- this also has a 3080 in it. And this whole thing will cost you $2,300. This laptop plus this eGPU costs you about $3,400. So, you could pretty easily buy this desktop and a really good laptop, like an XPS 13 or an HP Spectre x360 13 like one of those. And you know, an awesome desktop, awesome laptop instead of good laptop, eGPU that makes for a kind of bad desktop experience. So, let's see how this thing goes. Okay. Yeah. All right, we're getting like easy 100 DPS to a 100 FPS, but it's going up to like 140. Yeah. This is pretty consistent 110, 120. So, that's a massive performance hit for having a little eGPU here where it was what, like 40 to 80 FPS. Whereas now, we're running like 90 to 120. I just don't know why you would want this but I am excited to take it apart in a couple seconds. If you want eGPU, you should just buy a cheaper laptop and buy a full-blown desktop. That's my advice. So, that's that test done. Let's take it apart. I'm actually pretty stoked to do this. Thanks to Ridge Wallet for sponsoring this video. They have a compact wallet to keep your pant bulge down, has an RFID blocking place to keep people from stealing your info. There are over 30 colors and styles including carbon fiber and burnt titanium. Save 10% and get free worldwide shipping at Ridge Wallet by using offer code CIRCUIT at ridge.com/CIRCUIT. All right, let's get into this thing. Oh, yeah. Well, at the top we have a radiator. It looks like a nice ole 120-feels really hot actually. I have no clue how this comes apart. I'm just taking off screws until it pops out. There we go. Oh, this is your lodging for PCIe Thunderbolt that kind of stuff. It looks like power comes in here. It goes through some filtering. It's also a really cramped airflow design. Like you, I don't know if you can tell but like on this side, you're only going to be sucking in air right here. Would I recommend water-cooling your 3080? - Yeah. - If you have a 3080 in a desktop, I might recommend water-cooling it. If you have, like, a not super great cooler like installed but pretty much all of them are really, really good. So, I personally don't think you need to water-cool them most of the time. So, yeah. Other side here, again. Not much airflow to these fans. We have this nice little fan here that- oh, that's probably cooling the power supply a bit. Yeah. Let's keep on going deeper. This is the fun part, Jono. I want to get a good look at the actual GPU. (upbeat music) - Okay. Power supply is totally closed. That's great 'cause I won't kill myself if I accidentally touch it. (upbeat music) This is the GPU. This is the power supply. And over here, we have the-what's it called- the PCIe Thunderbolt dock chummy. They have super non-standard power connectors on the GPU. I as-wait, this is so weird. I assumed that they just had like a normal everyday GPU in here, but it's some weird custom board. Yeah. And it looks like from the power supply, they have a normal 8-pin. Yeah. Two normal 8-pins that go to these super weird ass connectors attached to the GPU. So like you could take this adapter and I guess toss it in your desktop, but it will be a pretty difficult time. Oh, have we freed it? Aha! There's the GPU. So, if you wanted to put this in your desktop, I guess you could. The cooling solution actually looks pretty good. So, what we've got here is your good old pump and then, some heat pipes that go across your VRMs, and that attaches to the same pole plate that your pump is on. So, you know, you get nice- I'm guessing these are fairly well cool. We also have what is probably one of the gnarliest-looking heat pipe bends that I've ever seen. Like I'm sure it's fine. These are massive heat pipes and it's not going to really affect performance but like, it has- I don't know what to call this but it looks kind of gross. Yeah. For a radiator, we have just a standard 240 with two of these kind of funky looking fans. I'm sure that they work great. I just feel the power supply-it's 550 Watts- that's more than enough for this current. I think 3080s, if you really push them hard, might consume like 300 watts. But that's like pretty extreme. As for this little board thingy, it's really weird. Yeah, I don't know if you can see but there are only pins up to right here. The rest of this slot has just nothing in it. I'm really surprised that it isn't just a standard gigabyte card that they chucked in here and worked around it. But instead it's like totally custom. But anyway, this thing is super weird and super cool and super not something that you should buy. So, yeah. I hope you guys liked this video, and now know, if you didn't before, why buying an eGPU is super-duper dumb. Sorry, Gigabyte, but that's how she goes. eGPUs, you can't really win. So, yeah. Hope you guys have a great ol' day. And, so long.",
    "transcript_keywords": [
        "Yeah",
        "GPU",
        "Power",
        "pretty",
        "FPS",
        "kind",
        "good",
        "super",
        "eGPU",
        "Thunderbolt",
        "dumb",
        "thing",
        "laptop",
        "great",
        "desktop",
        "cool",
        "nice",
        "Thunderbolt dock",
        "power supply",
        "Power adapter"
    ],
    "transcript_entity_values": [
        "a couple of minutes",
        "RFID",
        "Valheim",
        "3080s",
        "FPS",
        "Ridge Wallet",
        "92",
        "Thunderbolt",
        "15",
        "three",
        "40",
        "8",
        "Thunderbolt",
        "USB",
        "about $3,400",
        "1,400",
        "90",
        "Gigabyte",
        "110",
        "240",
        "100",
        "10 FPS",
        "1650",
        "second",
        "3080",
        "IO",
        "13",
        "a couple seconds",
        "3080",
        "35",
        "Ridge Wallet",
        "PCIe Thunderbolt",
        "Asia",
        "Jono",
        "HP Spectre",
        "Valheim",
        "300 watts",
        "Pete",
        "80",
        "first",
        "DPS",
        "AORUS",
        "two",
        "120",
        "10%",
        "GPU",
        "about under 30",
        "40s",
        "more like 60",
        "Two",
        "CPU",
        "140",
        "550",
        "20",
        "Europe",
        "2,300",
        "over 30"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "LOC",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "MONEY",
        "CARDINAL"
    ],
    "vector": [
        -0.07273996621370316,
        0.009896807372570038,
        -0.010274453088641167,
        -0.02317873015999794,
        0.02176794409751892,
        -0.040033143013715744,
        -0.0016407346120104194,
        -0.004979990888386965,
        -0.02138129621744156,
        0.0821334719657898,
        -0.012414732947945595,
        0.061051830649375916,
        0.010254287160933018,
        -0.042180489748716354,
        0.000910161470528692,
        -0.006254882551729679,
        0.030803360044956207,
        -0.10108133405447006,
        0.014465171843767166,
        -0.04480551928281784,
        -0.037543248385190964,
        -0.017695825546979904,
        -0.03173116594552994,
        0.0008683359483256936,
        0.041234180331230164,
        0.006159044802188873,
        0.09808985143899918,
        0.032123785465955734,
        -0.04270591586828232,
        -0.07075367867946625,
        -0.02414725534617901,
        -0.04926881939172745,
        0.07157354056835175,
        -0.000527384749148041,
        -0.016382256522774696,
        -0.0537143349647522,
        0.015403807163238525,
        -0.0996682420372963,
        -0.07506527006626129,
        -0.11153098195791245,
        -0.043731801211833954,
        -0.030281011015176773,
        0.027388036251068115,
        0.10856159776449203,
        0.025053996592760086,
        -0.0332278273999691,
        -0.039805810898542404,
        -0.007542487699538469,
        -0.035642024129629135,
        -0.010516336187720299,
        0.07197512686252594,
        -0.07142775505781174,
        0.01385329756885767,
        -0.002224471652880311,
        -0.12336939573287964,
        -0.0017326570814475417,
        -0.034701183438301086,
        0.03466936573386192,
        0.04294893890619278,
        0.01290637906640768,
        0.09091820567846298,
        -0.0595141164958477,
        -0.029761020094156265,
        0.03622999042272568,
        -0.002836267463862896,
        -0.06443586200475693,
        0.05802474543452263,
        -0.014312459155917168,
        -0.03175926208496094,
        0.01711020991206169,
        0.005911485757678747,
        0.003152082674205303,
        0.034802407026290894,
        -0.011665120720863342,
        0.03605560585856438,
        0.02081632986664772,
        0.051382340490818024,
        -0.07949390262365341,
        0.12520678341388702,
        0.09999804943799973,
        -0.02291218191385269,
        -0.02871827408671379,
        -0.0076191783882677555,
        -0.024886062368750572,
        0.10687536001205444,
        -0.035938143730163574,
        0.04012066498398781,
        0.0380023792386055,
        0.008793415501713753,
        -0.141175776720047,
        0.011198429390788078,
        0.03127235546708107,
        0.030552513897418976,
        0.058482665568590164,
        0.03810195252299309,
        0.00696633430197835,
        -0.024322738870978355,
        -0.04913265258073807,
        -0.04976404830813408,
        0.034336552023887634,
        0.019424432888627052,
        0.052516721189022064,
        0.05221492424607277,
        0.0593239851295948,
        -0.048900336027145386,
        -0.00406700698658824,
        -0.03798022121191025,
        0.10126080363988876,
        -0.005233549512922764,
        -0.05449957028031349,
        -0.08682120591402054,
        0.05057206749916077,
        -0.05436208099126816,
        0.05534069985151291,
        -0.010502340272068977,
        0.03758297860622406,
        -0.08070926368236542,
        0.016647256910800934,
        0.14107847213745117,
        -0.0053078546188771725,
        -0.052205201238393784,
        -0.03850385546684265,
        -0.002539978828281164,
        0.06514269858598709,
        -0.03232807666063309,
        0.06979086995124817,
        -0.04203703999519348,
        6.054775607807794e-33,
        0.059435851871967316,
        0.1054622232913971,
        -0.12391448020935059,
        -0.05888688936829567,
        -0.00766309117898345,
        0.10103064030408859,
        0.037270814180374146,
        0.050387151539325714,
        -0.021763363853096962,
        0.08254576474428177,
        -0.06843714416027069,
        0.0687234103679657,
        -0.024651624262332916,
        0.05831869691610336,
        0.020497683435678482,
        -0.1208951324224472,
        -0.032817382365465164,
        0.0478985570371151,
        -0.024458421394228935,
        0.05621730536222458,
        -0.017512448132038116,
        -0.0007347551872953773,
        -0.0036823973059654236,
        -0.008704247884452343,
        0.0876733586192131,
        0.04125433415174484,
        -0.0320463590323925,
        0.030915843322873116,
        0.02007455751299858,
        0.050404179841279984,
        0.033519815653562546,
        -0.121620312333107,
        -0.044091954827308655,
        0.006015796214342117,
        -0.019996151328086853,
        -0.06289789825677872,
        -0.05472765117883682,
        -0.04080851003527641,
        0.014324191957712173,
        0.00019390592933632433,
        -0.009806366637349129,
        0.07272288203239441,
        -0.05628926679491997,
        -0.08095429092645645,
        -0.026546664535999298,
        -0.01310381293296814,
        0.03643178567290306,
        0.02419479563832283,
        0.04750828817486763,
        0.01261491421610117,
        -0.02016635611653328,
        0.005581319332122803,
        -0.08610693365335464,
        -0.019739706069231033,
        0.007606472820043564,
        -0.11673321574926376,
        -0.023792216554284096,
        0.06071760132908821,
        0.13613465428352356,
        0.03185755014419556,
        0.0347752645611763,
        0.01499730534851551,
        0.060802385210990906,
        -0.05513867363333702,
        -0.0528905875980854,
        0.030198998749256134,
        0.07570201903581619,
        -0.0007229030015878379,
        -0.12845438718795776,
        -0.020959919318556786,
        0.0029205107130110264,
        -0.008461588993668556,
        0.027401046827435493,
        -0.04636670649051666,
        0.02461433596909046,
        -0.0051013268530368805,
        -0.026889057829976082,
        0.032503969967365265,
        -0.06620422005653381,
        -0.09542391449213028,
        -0.015065106563270092,
        -0.0005981152644380927,
        0.04927710443735123,
        0.04914898797869682,
        -0.06284328550100327,
        0.012043610215187073,
        -0.032998185604810715,
        -0.004099307581782341,
        0.0030484781600534916,
        0.03297736868262291,
        0.004425302613526583,
        -0.009571738541126251,
        -0.029271289706230164,
        -0.005967576056718826,
        0.05975865572690964,
        -5.5826801787862704e-33,
        -0.024742471054196358,
        -0.02197195217013359,
        0.010904815047979355,
        -0.01484337355941534,
        -0.007447117939591408,
        -0.06335902959108353,
        0.09186238795518875,
        0.009656094945967197,
        0.07278837263584137,
        -0.0638984888792038,
        0.07558014243841171,
        0.03878919780254364,
        0.004574568942189217,
        -0.01844963990151882,
        0.03798682242631912,
        -0.10654200613498688,
        -0.01528558786958456,
        -0.05562523007392883,
        0.04220583289861679,
        -0.01294676773250103,
        0.09638755023479462,
        0.0011764166411012411,
        -0.004758157767355442,
        -0.0077286106534302235,
        -0.026756182312965393,
        -0.0031829921063035727,
        0.04190779849886894,
        -0.044057056307792664,
        -0.004041015170514584,
        0.01689895987510681,
        -0.018018044531345367,
        0.03739228844642639,
        0.07759551703929901,
        0.1012960895895958,
        0.037314191460609436,
        0.008793426677584648,
        0.10425185412168503,
        -0.0016389613738283515,
        -0.03502431511878967,
        -0.031348250806331635,
        0.07287151366472244,
        0.06075386330485344,
        0.020228935405611992,
        0.04884596914052963,
        0.05201593413949013,
        0.003026589984074235,
        0.08268366754055023,
        -0.07436291873455048,
        0.021868081763386726,
        -0.02616783045232296,
        -0.015903962776064873,
        -0.07843412458896637,
        0.06611357629299164,
        0.041690222918987274,
        -0.013409813866019249,
        -0.06587167829275131,
        -0.010725606232881546,
        -0.002233491512015462,
        -0.09256037324666977,
        -0.02886279672384262,
        0.14307186007499695,
        0.05047694966197014,
        0.002786076394841075,
        0.00940199475735426,
        0.012163749895989895,
        -0.02492590621113777,
        0.021820681169629097,
        0.047870684415102005,
        0.03065151907503605,
        0.045299455523490906,
        -0.08389180153608322,
        -0.07588216662406921,
        -0.03040292300283909,
        -0.047307174652814865,
        0.032215751707553864,
        0.05044425651431084,
        0.00827080849558115,
        -0.020385170355439186,
        -0.015582759864628315,
        -0.058621011674404144,
        -0.03138076514005661,
        0.03435510769486427,
        0.028684338554739952,
        -0.043820854276418686,
        0.10768404603004456,
        -0.0368059016764164,
        0.020319871604442596,
        -0.026714138686656952,
        0.008566980250179768,
        0.01908312551677227,
        -0.11317508667707443,
        0.004747031256556511,
        -0.053690746426582336,
        0.027051208540797234,
        0.021743642166256905,
        -5.644127654136355e-08,
        0.011869260109961033,
        0.04816688224673271,
        0.017187494784593582,
        0.08368638902902603,
        0.0010693792719393969,
        -0.07270710915327072,
        0.04975029453635216,
        -0.003898625960573554,
        0.02295552007853985,
        -0.029905259609222412,
        -0.04645444080233574,
        -0.03644494339823723,
        -0.030766364187002182,
        -0.016677068546414375,
        0.02841123938560486,
        -0.014349939301609993,
        -0.03602749481797218,
        -0.005250929854810238,
        -0.003820823272690177,
        0.02654903568327427,
        0.00377533957362175,
        0.003644566284492612,
        0.11088971793651581,
        -0.04938468337059021,
        0.008687261492013931,
        0.058106642216444016,
        -0.043942391872406006,
        0.03932340443134308,
        0.08939594030380249,
        -0.062678761780262,
        -0.030465256422758102,
        0.02264348603785038,
        0.03776559233665466,
        -0.0803636834025383,
        0.016106603667140007,
        -0.05006001517176628,
        0.016627542674541473,
        0.09287410974502563,
        0.06564781814813614,
        0.020072640851140022,
        -0.029773149639368057,
        -0.0746517926454544,
        -0.05778023600578308,
        -0.013959032483398914,
        0.03889276832342148,
        -0.004732051864266396,
        -0.08220725506544113,
        -0.05793989077210426,
        -0.04181286692619324,
        0.06073758006095886,
        -0.03638067841529846,
        -0.005001814570277929,
        -0.05622377246618271,
        -0.022576384246349335,
        -0.017547298222780228,
        -0.07764454931020737,
        -0.013566792011260986,
        0.014572011306881905,
        0.03980360925197601,
        0.001910501392558217,
        0.02501661330461502,
        -0.12174075096845627,
        -0.0670662373304367,
        0.018707841634750366
    ]
}