{
    "id": "GLWj39P-f4Q",
    "title": "My first experience using a GAMING phone!! - Red Magic 6 Pro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-04-09T08:01:08Z",
    "video_url": "https://www.youtube.com/watch?v=GLWj39P-f4Q",
    "category": "Science & Technology",
    "tags": [
        "Red Magic 6",
        "Red Magic 6 Pro",
        "Gaming",
        "Mobile",
        "Smartphone",
        "Snapdragon 888",
        "Performance",
        "Call of Duty",
        "Mobile Gaming"
    ],
    "views": 227552,
    "likes": 12045,
    "comments_count": 868,
    "description": "Get $25 off all pairs of footwear using offer code shortcircuit at   Gaming phones are getting more common these days, so I guess they're here to stay. The RedMagic 6 pro is fairly impressive, and I think it's time to finally check it out with my first impressions. Also, it's under $700 with a Snapdragon 888!  Check out the Red Magic 6 pro at  Check out the Red Magic 6 at   Buy Red Magic Smartphones On Amazon (PAID LINK):  On Newegg (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.vessi.com/shortcircuit",
        "https://lmg.gg/nXQQV",
        "https://lmg.gg/FcVZX",
        "https://geni.us/HT2FKJB",
        "https://geni.us/asYLe",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Gaming PCs? (blows raspberry) No, thank you. I'll take the latest and greatest gaming phone, if you please. Which today is the Redmi RedMagic 6. That's what we're taking a look at today. I'm not super acquainted with gaming phones. I've heard a lot about gaming phones, but I've never actually gotten a chance to really take one for a spin myself, take a look at it. There's two boxes here that seem identical. (box clatters) What's that about? (exhales) There is a RedMagic 6 and then there's a RedMagic 6 Pro. Which one is which? I think they might be physically identical, other than the storage and RAM that's inside. So for the most part, I shouldn't have to look at both of them. I'm just gonna look at one, okay guys? Whoa! Look at that. That's fancy. That's all metal, smooth. This looks like a super car. This looks like one of Tony Stark's gadgets that he would pop out of his shoe or something and it would turn into a transforming drone. It's even got two dramatic modes. It's like, \"Flashy! Dramatic.\" (imitates angelic singing) (imitates metal music) (imitates angelic singing) We got speaker grills? They must be. Or, you know what, they're not speaker girls probably, they're probably cooling vents. Because one thing that I do know about this phone is that it has seven different ways of cooling the processor, which seems a little crazy. At least two of those are in an eternal turbo fan and a VC liquid cooling. Oh, vapor chamber. But then there's a bunch of other ways as well that we're gonna take a look at. Headphone jack! Volume rocker, maybe, on this side and a lock some kind of button. I'll figure out what it does when I turn on the phone on I guess. Power button, ah, and gaming triggers. That's something you want on a gaming phone. 'Cause you're gonna hold it like this. That's how you get the headshots. You can't get headshots like this. I've tried. You need. (imitates lasers) USB-C for charging on the bottom and I guess that that must be a speaker. Unless all the speakers are also cooling vents. Ooh, they give you a protector for it. Documentation, game time, anytime. A red USB-C, two C cable, which I'm guessing works with what is probably in this box, which is the power adapter, USB-C power adapter. Nice. I think it's a 30 watt adapter. And let me just say, unequivocally, at this point, that I know that the difference between the RedMagic 6 and the RedMagic 6 Pro is that one has 12 gigs of Ram and 128 gigabytes of storage and the other one has 16 gigabytes and 256 gigabytes of storage. I think they are largely identical other than the fact that there's a different color scheme. There's other boxes! RedMagic Dual Core Cooler. Oh my goodness. So that's the thing with gaming phones, they get really hot. You think normal phones get hot when you're trying to just scroll Twitter and that's it? These boys, these bad boys get hot when they're trying to give you all the frames that you need in PUBG mobile. And even despite the fact that there's, it's got seven different forms of cooling, I guess you can also get one of these and slap it on there. Powered by USB-C, okay. So you can power it from the phone? If you're just like, \"I don't care if my phone lasts, you know, 30 minutes, I need this match.\" The ear buds, okay, this I actually do wanna take a quick peek at because what is this, that box looks crazy. Whoa. Whoa. (laughs) That's angular. This is like if a dragon made. Well, it's even got little horns. It's got like little devil horns. (laughs) What are the lights? (imitates lasers) In a world where an evil authoritarian regime keeps gamers down, only one pair of ear buds can give them the RGB power. Now time to turn the phone on. But before I do that, this video is sponsored by Vessi Footwear. Thanks for sponsoring this video, guys. I love you. As you can see, I wear their shoes all the time. It's dirty on the bottom because it's worn. It's lived in. Vessi Footwear is known for being lightweight, comfortable, and most importantly, waterproof. The shoes are made with a material called Dynamax, which keeps your feet cool in summer and warm in winter. If that sounds good to you, keep your feet dry for the future wet months and save $25 off with our offer code shortcircuit at vessey.com/shortcircuit. What have we got here? Okay, so as usual, gaming phones usually have 1080p screens, full HD, which is the case with this one. I believe it has a 165hz refresh rate, which I can already see doing that, whoa! A 6.8 inch screen, I guess on both. As I was saying, the Pro and the non-Pro version are largely identical other than the RAM and the storage inside. It's an AMOLED screen and, as I said, there's 165hz refresh rate. But there's a 360hz? Is that right? Yes, it is. 360 Hertz multi-sampling touch refresh rate. So I guess that helps with games. This is my number one least favorite thing that some Android manufacturers do. They try to make the Android more like the iPhone and don't give it an app drawer. So all your apps just have to be on the home screen somewhere. But the thing is that even the iPhone has added an app drawer basically now, so. They have multiple models of external coolers that you can slap onto this thing. I don't know, I'll check it out on your face. (camera shutter clicks) John-o, I don't know if this phone has beauty face, it almost certainly does, but you look beautiful to me. There was also a watermark for our convenience. (both laugh) We got 64 megapixel main camera, an eight megapixel ultra wide camera, and a two megapixel bokeh camera. So I guess the camera will be pretty good with all of those lenses after all. The main thing that I'm interested in is this thing's performance as a gaming machine and how much those seven different types of cooling come into play. I've already said the internal turbo fan, the vapor chamber liquid cooling, but there's also a graphite sheet, a thermal gel, copper foil, air ducts, which I think I identified earlier, aviation grade aluminum heat sink somewhere in there, aircraft aluminum rear housing. Okay, so that's what I was talking about. This is aircraft-grade aluminum, dude. And then you got the Dual Core Ice Dock. Okay, so I guess this thing counts as one of the seven. But that's okay. There's six that comes with the phone already. I'm online with people, people, oh, select load out? But I need to, I need to map the triggers. The phone actually has a manual. What the heck? Why doesn't it talk about the triggers? This is so weird. I expected to see more software on the actual phone pertaining to gaming. Well, there doesn't appear to be any way to get the triggers working. Yeah, I'm gonna give you the straight up as a gaming phone. 'Cause you know, I'm assuming that at some point you can get the triggers working, which would, oh, a bad guy! Oh, you're fricking dead. I'm so good at shooting on a phone. Headshot, bro. - [John] (laughs) That's so easy, though. - I don't hear the fan going, so it must not be that demanding of a game. Okay, this is intelligent regulation. (fan whirs) We're gonna go to the high power mode. Fast cooling. (fan whirs) Ooh. Now, will I get more frames with this? That's what I wanna know. Well, oh, is it getting a bit warm? I can feel it getting a bit warm, even though the fan's going at full blast. But I did just turn it on. And now I'm standing in the middle of the battlefield and not dying. Well, safe to say this is a gaming phone, John. I don't know if you know. You know, I'm disappointed by the fact that I can't, I couldn't figure out how to map the triggers onto the buttons because I know that that is something you can do for sure. I just, I mean, that's something that I'm gonna say as a point against the phone is the fact that that's hard to find because we couldn't find it. Where is it? Send us an email, Redmi. So we got the RedMagic 6 Pro and the RedMagic 6 vanilla. The vanilla, which is not it's called, but that's what I'm calling it, is 599 us and the RedMagic 6 Pro is 699 US. Anyways, that's it. Thanks for watching, guys. Don't forget to subscribe to Short Circuit for more videos that are probably better than this one. And you know what, hey, you know what, hey, you know some other channels that make really good videos? TechLink. There's a lot of critics on this channel as well. Not as good tech reviews.",
    "transcript_keywords": [
        "phone",
        "Gaming",
        "gaming phone",
        "RedMagic",
        "cooling",
        "thing",
        "phones",
        "Pro",
        "guess",
        "Power",
        "triggers",
        "USBC",
        "Gaming PCs",
        "greatest gaming phone",
        "give",
        "good",
        "Whoa",
        "identical",
        "Dual Core",
        "storage"
    ],
    "transcript_entity_values": [
        "16 gigabytes",
        "seven",
        "360hz",
        "At least two",
        "eight megapixel",
        "599",
        "699",
        "Hertz",
        "RAM",
        "one",
        "US",
        "USB",
        "Ram",
        "iPhone",
        "the Redmi RedMagic 6",
        "Vessi Footwear",
        "25",
        "RedMagic Dual Core Cooler",
        "256 gigabytes",
        "128 gigabytes",
        "John-o",
        "John",
        "summer",
        "Redmi",
        "30 watt",
        "Twitter",
        "Tony Stark's",
        "360",
        "winter",
        "two",
        "1080p",
        "Android",
        "Dynamax",
        "the Dual Core Ice Dock",
        "AMOLED",
        "30 minutes",
        "Short Circuit",
        "USB-C",
        "12",
        "only one",
        "RGB",
        "six",
        "64 megapixel",
        "VC",
        "165hz",
        "today",
        "6.8 inch"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORG",
        "FAC",
        "PERSON",
        "MONEY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "DATE",
        "QUANTITY"
    ],
    "vector": [
        -0.10248824208974838,
        -0.025921590626239777,
        0.045813094824552536,
        -0.07635033875703812,
        0.014546421356499195,
        0.05601617321372032,
        0.038704924285411835,
        0.06272649765014648,
        -0.00524895591661334,
        0.02813437394797802,
        -0.02103324979543686,
        0.056362081319093704,
        0.0196245014667511,
        -0.10808538645505905,
        0.09801412373781204,
        -0.02493779920041561,
        0.007224645931273699,
        -0.04248080402612686,
        -0.08396515995264053,
        0.002655673073604703,
        -0.01584700681269169,
        -0.09150267392396927,
        0.017576349899172783,
        0.0018601170741021633,
        0.07907376438379288,
        -0.09256317466497421,
        -0.009592040441930294,
        0.0016907156677916646,
        -0.024252763018012047,
        -0.03402118384838104,
        0.025473687797784805,
        0.11049915105104446,
        0.023888181895017624,
        0.02573583275079727,
        -0.023897498846054077,
        -0.055979032069444656,
        -0.004224699456244707,
        -0.04358361288905144,
        -0.12293841689825058,
        -0.0012269204016774893,
        -0.03293737769126892,
        -0.017015930265188217,
        -0.0004797720175702125,
        0.04718851298093796,
        0.025236114859580994,
        -0.05089984089136124,
        0.025912974029779434,
        0.0599210225045681,
        -0.010756798088550568,
        0.05599575117230415,
        0.04360983148217201,
        0.024162789806723595,
        0.04270930588245392,
        0.03482580929994583,
        -0.09366053342819214,
        0.01825546659529209,
        -0.0655720978975296,
        -0.02628207951784134,
        0.09621015936136246,
        0.000322908628731966,
        0.08283157646656036,
        -0.021263064816594124,
        -0.04745081439614296,
        0.07428397983312607,
        -0.07252617180347443,
        0.007480075117200613,
        0.020096968859434128,
        0.008945316076278687,
        -0.01873927377164364,
        -0.05134701728820801,
        -0.016666699200868607,
        -0.013460083864629269,
        0.059043943881988525,
        0.08105900883674622,
        -0.003064237767830491,
        0.0465412400662899,
        0.10579793155193329,
        -0.033195871859788895,
        -0.022836755961179733,
        0.022377297282218933,
        0.02509087510406971,
        -0.0162704735994339,
        0.01054287888109684,
        0.04048085957765579,
        0.060487765818834305,
        -0.051259953528642654,
        0.041174255311489105,
        0.07754164189100266,
        -0.01040614489465952,
        -0.1124635860323906,
        0.03617078438401222,
        0.11243416368961334,
        0.040876153856515884,
        -0.00040240222006104887,
        -0.06253504008054733,
        0.010635021142661572,
        -0.06290663778781891,
        -0.08486922085285187,
        -0.07384882867336273,
        0.07643143087625504,
        0.028358004987239838,
        0.045204248279333115,
        0.0650544986128807,
        0.004887086804956198,
        -0.009244871325790882,
        -0.06086047738790512,
        -0.02623218111693859,
        0.05006544291973114,
        0.029980197548866272,
        0.049027204513549805,
        -0.032163821160793304,
        -0.030557921156287193,
        -0.06547766178846359,
        -0.04631015285849571,
        -0.03159084916114807,
        0.05761367082595825,
        -0.07695954293012619,
        0.03554151952266693,
        0.13126786053180695,
        -0.003524082712829113,
        -0.012961063534021378,
        0.023001207038760185,
        -0.06494424492120743,
        -0.05048332363367081,
        0.018680917099118233,
        0.009173016995191574,
        -0.08310110121965408,
        3.896959566253692e-33,
        -0.04437334090471268,
        0.09116964787244797,
        -0.01211104542016983,
        -0.0576137937605381,
        -0.03502574563026428,
        0.00038518820656463504,
        0.05530855804681778,
        -0.02158494107425213,
        -0.0700567439198494,
        0.020888734608888626,
        -0.013209342956542969,
        0.10065837949514389,
        -0.06986094266176224,
        0.08098550885915756,
        0.05557341128587723,
        -0.017191478982567787,
        -0.02371407300233841,
        -0.040091197937726974,
        0.0015615534503012896,
        0.040275998413562775,
        -0.03174811601638794,
        -0.031587664037942886,
        0.04610733315348625,
        0.024995196610689163,
        0.030022701248526573,
        0.044950198382139206,
        -0.006606844253838062,
        -0.0012669524876400828,
        0.1108631119132042,
        0.0035431506112217903,
        -0.08243793994188309,
        -0.051009032875299454,
        0.08039356023073196,
        -0.020151223987340927,
        -0.0292774997651577,
        -0.008294887840747833,
        -0.05191809684038162,
        -0.10568246990442276,
        0.03127659484744072,
        0.011705280281603336,
        -0.062448807060718536,
        0.07252220809459686,
        -0.12699174880981445,
        -0.05627917870879173,
        0.0149455601349473,
        -0.041074831038713455,
        -0.029846150428056717,
        -0.04699375852942467,
        0.015091299079358578,
        0.06948766857385635,
        -0.10658993571996689,
        0.004198613576591015,
        -0.034053735435009,
        -0.00624456349760294,
        -0.07034331560134888,
        -0.09981286525726318,
        -0.027117813006043434,
        -0.02132130041718483,
        0.07472417503595352,
        -0.001867788378149271,
        0.000729553634300828,
        -0.017886944115161896,
        0.001994288759306073,
        -0.0032925987616181374,
        -0.08155407756567001,
        0.0232795812189579,
        0.04738912358880043,
        -0.028561925515532494,
        -0.10083334892988205,
        -0.0018992144614458084,
        -0.017581531777977943,
        0.03337559103965759,
        0.07061035186052322,
        -0.02834361419081688,
        0.02241506613790989,
        0.00784301944077015,
        -0.05769588425755501,
        -0.04574873670935631,
        -0.04223214089870453,
        0.010410794056952,
        -0.02212846651673317,
        -0.010292235761880875,
        0.03416980430483818,
        0.10814741998910904,
        0.019324924796819687,
        0.009128953330218792,
        -0.02518904022872448,
        -0.07475825399160385,
        -0.04918147251009941,
        0.03921392932534218,
        -0.02900705859065056,
        -0.023083550855517387,
        -0.06474196910858154,
        -0.00486135995015502,
        0.024188941344618797,
        -5.146251819762587e-33,
        -0.06104977801442146,
        0.0052131847478449345,
        -0.007110791280865669,
        0.058050431311130524,
        0.05699554830789566,
        -0.06682748347520828,
        0.11874128133058548,
        0.07803753763437271,
        -0.017777401953935623,
        -0.06205131486058235,
        -0.028239194303750992,
        0.1158003881573677,
        0.002720607677474618,
        0.01739608496427536,
        0.010172058828175068,
        -0.07457790523767471,
        0.04089308902621269,
        -0.06254558265209198,
        0.1144709438085556,
        -0.04203391820192337,
        0.05228574201464653,
        -0.011876938864588737,
        -0.032597992569208145,
        0.06969857215881348,
        -0.023937126621603966,
        -0.008342291228473186,
        0.007262645289301872,
        -0.021856794133782387,
        -0.05225146561861038,
        -0.02810034155845642,
        0.04958610236644745,
        0.0032217432744801044,
        0.005807013250887394,
        -0.001265975646674633,
        0.03579463064670563,
        0.023812128230929375,
        0.01028619334101677,
        0.0927276611328125,
        0.018200116232037544,
        -0.0627315491437912,
        0.0515192411839962,
        -0.031272511929273605,
        0.0974467322230339,
        -0.053303901106119156,
        0.059778254479169846,
        -0.08084310591220856,
        -0.03781652823090553,
        -0.023540271446108818,
        -0.02326270006597042,
        0.013420714065432549,
        0.04654804989695549,
        0.0029931231401860714,
        0.0006525082280859351,
        -0.01812419667840004,
        -0.08595139533281326,
        -0.03401624411344528,
        -0.07366519421339035,
        -0.027430888265371323,
        -0.03958263620734215,
        0.030902905389666557,
        0.043430741876363754,
        0.03157481551170349,
        -0.07096444815397263,
        0.022893674671649933,
        -0.009317127987742424,
        0.03949204087257385,
        0.09283404797315598,
        0.06525147706270218,
        -0.03833756223320961,
        -0.013916371390223503,
        -0.029041748493909836,
        0.014740640297532082,
        -0.011016962118446827,
        -0.052688516676425934,
        -0.04949760437011719,
        0.06258220970630646,
        -0.018323665484786034,
        0.02682448737323284,
        0.04106586053967476,
        -0.008366825990378857,
        0.03869505226612091,
        0.012445521540939808,
        0.0833473801612854,
        -0.04292188957333565,
        0.0266422089189291,
        0.01859847828745842,
        0.05031292140483856,
        -0.04301123321056366,
        -0.09018736332654953,
        -0.00869564525783062,
        -0.04712877422571182,
        0.009833674877882004,
        -0.024228716269135475,
        0.01965903490781784,
        0.040987517684698105,
        -5.8719564322018414e-08,
        0.11082817614078522,
        0.025067420676350594,
        0.04227984696626663,
        -0.03678535670042038,
        0.020542079582810402,
        -0.07671590149402618,
        0.040077291429042816,
        -0.01088093314319849,
        0.0525839738547802,
        0.016589349135756493,
        0.030055731534957886,
        -0.08562520891427994,
        -0.03395908325910568,
        0.03380986675620079,
        0.027276789769530296,
        0.042632024735212326,
        0.0374981053173542,
        0.05155583471059799,
        -0.056785739958286285,
        -0.002899100538343191,
        -0.0038737193681299686,
        0.08744737505912781,
        0.017282862216234207,
        -0.04552947357296944,
        0.020466389134526253,
        0.013176577165722847,
        0.015467790886759758,
        0.013292662799358368,
        0.089921735227108,
        -0.027229493483901024,
        -0.020030302926898003,
        -0.0008096727542579174,
        0.02994687855243683,
        -0.02593090571463108,
        -0.014315898530185223,
        -0.10639439523220062,
        -0.013752159662544727,
        -0.0001995112979784608,
        0.07374286651611328,
        -0.00824815034866333,
        0.011782826855778694,
        -0.06520313769578934,
        0.00421796552836895,
        -0.04798752814531326,
        -0.011671682819724083,
        -0.050697218626737595,
        -0.07725534588098526,
        -0.11638832837343216,
        0.03785357251763344,
        0.07132355123758316,
        -0.03573911637067795,
        0.011234942823648453,
        -0.047182053327560425,
        -0.058482564985752106,
        0.03106059692800045,
        -0.0638965517282486,
        0.0248951967805624,
        0.04956190288066864,
        -0.011590438894927502,
        0.051235705614089966,
        0.013427281752228737,
        -0.13912425935268402,
        -0.04103199392557144,
        0.10489902645349503
    ]
}