{
    "id": "gn6zRTF0i7Q",
    "title": "iPad Pro Unboxing and Review",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-03-24T12:35:33Z",
    "video_url": "https://www.youtube.com/watch?v=gn6zRTF0i7Q",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "ipad pro",
        "unboxing",
        "review"
    ],
    "views": 2079722,
    "likes": 54552,
    "comments_count": 4368,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Today we are about to check out the new iPad Pro. This was just announced last week. And now we have one right here and we're going to check it out. This is the one terabyte edition, the 12.9, inch Wi-Fi and cellular version. This does come in two different configurations. There's the Wi-Fi and the cellular version. And there's two different sizes. There's the 11 inch and the 12.9, which we have right here. (upbeat music) Here we go. (upbeat music) So the first thing that you're going to notice, which is an upgrade from the previous gen is the fact that it has two cameras now. So there's now a wide angle lens on this and a lot of people are like, \"Why do I need a wide angle lens on my iPad?\" You do? I think everyone does. And now it's a possibility, it is here. So I think if people do take a lot of photos on their iPad, this is going to be a huge upgrade because having that wide angle integration is awesome. So I think this is something that we're not really very surprised by that is now on the iPad. The thing that was a surprise was the fact that they have now added a LIDAR scanner into the iPad. And this is something that is used in NASA technology. It's used in surveying. So this really allows your iPad to get a full sense of the area that you're in. And why this is important is augmented reality. I am such a huge fan of augmented reality. I think it's just such a fun concept to be able to take the world around you and make it cooler. But it's also such a mind trip the other day when I was making a video just about this iPad, and I put the AR version of the iPad on my desk. It's still is just so wild, because it really for a moment tricked my brain into thinking that the iPad was sitting on my desk and then I realized it wasn't but now it is. Or is it? So let's turn this thing on. And I'm going to see what else is in the box. The stickers. They gave us a nice little SIM card ejector and like always we've got our fast charging brick and USB C. So to go with our iPad, we have our Smart Keyboard folio and one of the big highlights now of this iPad is the fact that it can use a trackpad support. It's a cursor, but it's not really a cursor because it's kind of a cursor that mimics the touch on your iPad. And this is actually a feature that has already been used in the accessibility settings in iOS, so now they've actually made it a full fledged feature on the iPad so that you'll be able to use a trackpad. You will be able to use also a Magic Mouse. One of the Magic Trackpads or you can wait until May, because they do have another magic keyboard that is coming out that has USBC pass through charging. It also has an integrated trackpad in it, it does have a magnetic little mount on it. So it's a case but you can also just put your iPad on it and you can move it 130 degrees so unfortunately we have to wait until May, but for the time being we do have this one. This is just their standard issue Smart Keyboard Folio, It still has a keyboard and what's great though is you can still use the Magic Trackpad in the meantime, I feel like if you do have an iMac or something like that, one of these has probably come with your computer. Yeah, that feels nice. I'm going to be writing so many tweets on this thing. Oh, man, the iPad is just cool. Okay, we're going to connect the trackpad, Everything's all set up. I'm pretty excited to test this out. Do you see it! I don't know why I'm so surprised. It's doing exactly what it's supposed to be doing. So I guess I can make my own little computer that's not a computer. This feels exactly like I have a MacBook in front of me, but I can touch it. So now I'm going to be trying to touch my MacBook and when I don't have my trackpad with my iPad, I'm going to be trying to use a trackpad. You can tell like the little cursor is there to simulate, like you're touching the screen. Now this is all set up. I'm gonna go through and download some apps. I'm gonna do an AR test. I'm going to do an editing test, take some photos with it and we'll just see where else this review takes us. (calm music) I've been working on this iPad for the past several days now and I've been editing a vlog entirely shot on my iPhone and edited on the new iPad Pro in LumaFusion. It's been really interesting, because I am a really fast editor when it comes to editing in Final Cut. But when I was editing in LumaFusion, it's kind of a whole nother process because I have to kind of think differently about how I'm editing, everything is touched. So being able to touch my screen and use the Apple Pencil to edit. So that was my challenge to myself. How do I do absolutely everything on this iPad, but I'd like to say I think that the project was successful. I just uploaded the video and I think people are going to be kind of surprised to realize that I shot this entire video on my iPhone and entirely edited on the iPad, even doing the voiceovers. So here I wanted to show you guys my LumaFusion workflow that I've been doing. So there's five different ways that I've been interacting. I'm using the Apple Pencil. You can touch the screen, you can use keyboard shortcut keys and you can use the trackpad and also the Magic Mouse. I haven't used the Magic Mouse as much. But as an example, just see that it does work. Like I'm opening up LumaFusion and you can use it, just like you normally would. You can click on things. I love the Magic Mouse, especially for editing because you can just use the touch on the top of it to scroll through your timeline. This has been something that I do a lot with editing. You can also do that, of course with the trackpad, two finger swipe, swipe through the timeline, and I can hit play. And this plays through and you can use the Apple Pencil to scroll. I'm also ambidextrous, I mostly write with my left hand, I use my mouse with the right hand and when I'm editing on a MacBook, I use the trackpad with my left hand and do most of my shortcut keys with my right hand. So this has been a really confusing time for me because I will sometimes switch the Apple Pencil over to my right hand and I'm using that to scroll. I am extremely efficient in Final Cut, so kind of trying to develop those same skills and shortcut keys here with LumaFusion. One of the coolest things though, is the fact that I shot this whole video on my iPhone. But with iCloud, I had all of the videos, all of the photos, all of the content automatically uploaded to the cloud. So it was all synced to my iPad when I opened it up. So everything that I was shooting, it was already here, I didn't have to do anything else. Something that was also really interesting because I'm so used to editing on a MacBook or at an actual sit down desk, but to be able to get like super comfy and just edit like this was really strange and I kind of really liked it. I just want to give you guys a look at the timeline of this video that I edited for my quarantine vlog. If you guys haven't seen it, make sure you go check it out. I'll put a link in the description and an annotation. But this is the whole timeline. So you guys can see up here. That's all the edits that I've made where the music is. And this was really challenging, mostly because using this program in this in depth way, was very new to me. So I had to kind of learn all of this over again, you can see all over the multiple tracks. We've got some very precise edits here that are happening to the beat of the music. This is the whole timeline. (calm music) Yeah, look at that. That looks nice. I also even recorded the VO in this video with the iPad. This is a mic that I actually got a vlog University, Apogee was there and they showed me a demo of this. And it's incredible. So it just has a USB cable that goes right into your iPad. And there's also an app that connects with it as well, but right now I'm just using LumaFusion. So it has a VO setting, you can just go to Add Insert Voiceover and a little dialog pops up. This is automatically detected. And when I hit record, Three, two, one, hello. It's Justine, talking about social distancing, staying six feet away from your friend or no one. Let's test that out. I'm going to click OK. These headphones plugged into the microphone, so that's monitoring the audio and here's where we recorded our VO right there. And that's it. This is also great for podcasting and maybe I can start a pandemic podcast I don't know if that's something that you guys would be into, I could be iJustQuarantine. I guess let's start it, so here we go I'm gonna hit record and this is gonna be coming to you not live. Hey everyone its iJustine from iQuarantine headquarters. Today we're going to be talking about some stuff that I've been doing and I've been doing a lot of things, I've been putting eyebrows on my dog. I've been learning to edit on my iPad and now a word from our sponsors. I don't have any yet but we can get some so I unplugged this microphone and then I'll let you guys hear. These speakers are pretty incredible. And I was also very surprised about the battery life, since I did spend almost a solid day editing that vlog. The battery life was really impressive. - [Recording] Today we're going to be talking about some stuff that I've. I'm using the lead vocals, let's maybe change this to, let's see if some vocals to a narrator. - [Recording] I've been doing and I've been doing a lot of things. I have been putting eyebrows on my dog. - Should I start a podcast on my iPad? - [Tyler] Yes. - Tyler Whispered yes. This is fun, oh my goodness, I have a podcast now. All it took was for me to get a new iPad and new microphones. Now it's time to test out some AR apps. I just kind of went through and searched augmented reality. I wanted to try some of these new ones that I've never actually tried before and the first thing that I saw, there was a crime investigation app. - [Narrator] 11:55 Last night the bloody body of Trent Park, professional musician was found lying in his Nashville apartment. Closer to evidence within the scene to access forensic tools that will help you tie the evidence to one or more samples. - Nanny, I'm trying to solve a crime right now. Okay, inspect, I'm going to inspect the casings. - [Narrator] Scanning bullet casings to identify what type of gun was used. - We've analyzed this now let's check out the body. Let's get some more. Some more info. There's our suspects on the wall. I don't think I'm ready to accuse yet. We have a fingerprint. Okay so that was pretty intense. Fun fact, my sister went to school for forensic science. I'm gonna have to show her this app, because I think this is something that she probably would be pretty good at. I like augmented reality for interior decorating. Clearly this room needs some help. This I was originally going to set up as a little studio space to shoot in. And right now, I mean, we've definitely shot some things in here. But with the IKEA place app, I'm gonna see if there's some stuff here that we might be able to add. I'll see what it looks like here. So I think I need some storage. Let's see what this little storage space would look like here. Well, that's actually pretty big. So we're gonna need to put that down here. Oh, yeah wow, look at that. Actually, that could work. Hey, Jenna. What do you think of my new shelf? - [Jenna] I don't see a shelf? - We got to see it on here because it's AR Whoa, wait a minute. Go back over there. Walk in front of it. - Am I in the shelf? Oh my gosh walk across it. Just like walk across the, okay come back over here. Now Walk that way. Walk that, walk that way. - [Jenna] What's it look like? What's it doing? - Here hold it. You can see me walk past it. I walked in front of it. I'm walking in front of the shelf. Wow. Okay, so now I think I need to buy the shelf. - [Jenna] What are you gonna put in it? - Whatever I want. (upbeat music) So this app is called Froggipedia and it has this AR anatomy of a frog. So I can pick parts of him. I think this is his eye. What's that? A lateral fold. Man, I'm going to be so knowledgeable coming out of quarantine. What have you been doing with your time? Well, I've been learning about the anatomy of a frog in AR, what about you? Now we're looking at his muscular system. What! This is something that I never thought that I would be doing today and it is that's okay. There's your stomach. Here's the dissection portion. Oh, okay. Well, alright, so we are virtually dissecting this frog right now. Great job, I'm doing well, the coil tube is apart. Okay, here's your small intestine. I don't think I want to do that anymore. Well, that's a new way to educate yourself about dissecting a frog without actually having to dissect it. I also love that augmented reality is doing educational things like this. It's not just necessarily for gaming or trying to decorate your house. So I think this is really changing the way that people learn. And I'm here for it. I think that I learned a little too much today. (upbeat music) I love all the creative ways that AR is kind of able to bring life into your home and I think now more than ever, I think this is something that we need. I'm shooting a front facing video on the iPad. Look how massive this looks. - This is incredible. - It's crazy. Look at that. Look how big my face is - [Jenna] It's so crazy. It looks like you have a big iPhone. - I mean essentially this really is a big iPhone. But the new thing about this is the fact that it has the new Pro Camera set up, so it has the wide angle and the ultra wide. So there's Jenna with the regular. There's Jenna wide angle. Look at that. I can see your feet. - They're not inside enough. - Could you take a few photos for me? - Yes. - Hey, put the holes in it but make it fashion. - [Voice Over] Ready! - Do I look weird? - [Jenna] Yes. - I feel weird I'm gonna stand up. Okay. - I'm so scared I'm gonna drop this. - Well, don't quarantine fashion. I put jeans on for this. - I know, I'm shocked. There's a stick behind you. - But make it fashion. Get Maddy. Get Maddy. Maddy. - Maddy, who's gonna get a photoshoot? - [Justine] He looks really bad. - [Jenna] He's a little hairy, he needs a haircut. - Do you want to be a good boy? You can do all the things you normally could do, time lapse, slow mo, you can shoot videos, photos. Portrait mode only works on the front, and you can do panos. Well that's just a first look at the new iPad Pro. I just wanted to show you kind of a real life scenario of how I would use this. There is so much more that you can do on this, especially with Procreate. I've talked about Procreate before. I have some free time on my hands, as many of us do. So if there's anything else that you guys would like to see here on this channel, whether it's tech related or non tech related, let me know in the comments below. I will see you guys later and I'm gonna get back to testing out this iPad so I can do a fun follow up video for you. See you later. (calm music)",
    "transcript_keywords": [
        "iPad",
        "Magic Mouse",
        "iPad Pro",
        "trackpad",
        "Apple Pencil",
        "Magic",
        "kind",
        "editing",
        "video",
        "things",
        "guys",
        "thing",
        "Walk",
        "Mouse",
        "put",
        "Keyboard",
        "fact",
        "touch",
        "LumaFusion",
        "wide angle"
    ],
    "transcript_entity_values": [
        "Magic Mouse",
        "a minute",
        "the past several days",
        "MacBook",
        "iPad",
        "one",
        "the Magic Trackpad",
        "12.9",
        "the Wi-Fi",
        "VO",
        "iJustine",
        "Justine",
        "Froggipedia",
        "LIDAR",
        "11 inch",
        "Maddy",
        "LumaFusion",
        "last week",
        "iPad Pro",
        "iPhone",
        "130 degrees",
        "USBC",
        "NASA",
        "Today",
        "Procreate",
        "the Apple Pencil",
        "six feet",
        "Nashville",
        "the other day",
        "May",
        "the Magic Mouse",
        "Smart Keyboard Folio",
        "AR",
        "five",
        "the Magic Mouse",
        "Final Cut",
        "LumaFusion",
        "Apple Pencil",
        "11:55 Last night",
        "IKEA",
        "iCloud",
        "the Magic Mouse",
        "iMac",
        "two",
        "Three",
        "Walk",
        "today",
        "Pro Camera",
        "Wi-Fi",
        "iPad Pro",
        "first",
        "Trent Park",
        "USB",
        "iQuarantine",
        "Jenna",
        "VO",
        "Apogee",
        "One"
    ],
    "transcript_entity_types": [
        "PERSON",
        "TIME",
        "DATE",
        "FAC",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "GPE",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "NORP",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "GPE",
        "ORG",
        "GPE",
        "PERSON",
        "GPE",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.030390337109565735,
        -0.08262291550636292,
        -0.06274319440126419,
        -0.11221449822187424,
        0.05718199908733368,
        0.046042848378419876,
        0.01011574175208807,
        0.0017407280392944813,
        -0.0036390742752701044,
        0.06769682466983795,
        0.046125683933496475,
        0.019271904602646828,
        -0.06181950494647026,
        -0.026750072836875916,
        0.0003753833589144051,
        0.051030393689870834,
        0.021921152248978615,
        -0.02159932255744934,
        -0.02714925818145275,
        0.02171109989285469,
        -0.050946999341249466,
        -0.03496866300702095,
        0.0586259625852108,
        -0.008789097890257835,
        0.0017628486966714263,
        0.046590741723775864,
        0.02959449775516987,
        0.03469964489340782,
        -0.08536044508218765,
        -0.06135772168636322,
        -0.007079643197357655,
        0.0025461437180638313,
        0.06133231148123741,
        0.05124761536717415,
        -0.02227504551410675,
        -0.049524933099746704,
        0.005989169701933861,
        0.006192799657583237,
        -0.04206155985593796,
        -0.05080607905983925,
        -0.002162127522751689,
        -0.04160216078162193,
        -0.03508065640926361,
        -0.009988485835492611,
        -0.05211479216814041,
        -0.03829130530357361,
        -0.051705460995435715,
        -0.06793525815010071,
        0.055408917367458344,
        0.035739317536354065,
        -0.02730509638786316,
        0.0033391581382602453,
        0.024712642654776573,
        0.03762093558907509,
        -0.07072673738002777,
        -0.02499072626233101,
        -0.03707115724682808,
        0.02244885452091694,
        0.06202282756567001,
        -0.03814912214875221,
        0.0245163943618536,
        -0.010221268981695175,
        0.0406479686498642,
        0.03447297215461731,
        -0.01573026366531849,
        -0.039778050035238266,
        0.018944885581731796,
        0.015376964583992958,
        0.012115462683141232,
        -0.0007348260842263699,
        -0.11563045531511307,
        0.05694185569882393,
        -0.01025759894400835,
        0.01824469305574894,
        0.007178771309554577,
        0.05415704473853111,
        -0.019910365343093872,
        -0.05092566832900047,
        -0.01198859978467226,
        0.06178318336606026,
        0.050029389560222626,
        -0.004386003594845533,
        -0.04106377810239792,
        0.00016005797078832984,
        0.013212491758167744,
        0.011142853647470474,
        -0.028857223689556122,
        0.035533592104911804,
        -0.05383593589067459,
        -0.05638730898499489,
        -0.058855053037405014,
        0.023548899218440056,
        0.028704578056931496,
        0.028856582939624786,
        0.016855861991643906,
        -0.062256865203380585,
        -0.030691470950841904,
        -0.04513813555240631,
        -0.09782786667346954,
        0.04914993792772293,
        0.030310697853565216,
        -0.028490906581282616,
        -0.016147281974554062,
        -0.06489774584770203,
        -0.030765293166041374,
        -0.11298549175262451,
        -0.04878590255975723,
        -0.009737901389598846,
        0.015063313767313957,
        0.057139649987220764,
        -0.015851706266403198,
        0.022268082946538925,
        -0.08721872419118881,
        -0.030490854755043983,
        0.03188253566622734,
        0.11169177293777466,
        -0.036308128386735916,
        0.10004021227359772,
        0.04027421027421951,
        0.01657048612833023,
        -0.04725230485200882,
        -0.04327334091067314,
        -0.025520415976643562,
        -0.009407153353095055,
        -0.051464639604091644,
        0.022787244990468025,
        -0.02977984957396984,
        1.26546801086537e-32,
        -0.06507159769535065,
        0.053287066519260406,
        -0.03648893162608147,
        0.06372226029634476,
        0.0217539481818676,
        -0.07453102618455887,
        -0.023261774331331253,
        0.1300388127565384,
        0.013528582639992237,
        0.017450882121920586,
        0.008963520638644695,
        0.03169895336031914,
        -0.07358598709106445,
        0.007985852658748627,
        0.019776498898863792,
        -0.08486075699329376,
        -0.0011230211239308119,
        -0.01927396096289158,
        -0.03700622543692589,
        0.0051148924976587296,
        -0.004645075649023056,
        -0.023155577480793,
        0.0021338763181120157,
        0.08922673016786575,
        0.07842819392681122,
        0.06576871126890182,
        0.05115000903606415,
        -0.001577584887854755,
        0.0654272511601448,
        -0.004097119439393282,
        -0.07474318146705627,
        -0.04843572527170181,
        -0.019415833055973053,
        -0.09616699069738388,
        0.006188306026160717,
        -0.012331077829003334,
        -0.04267207533121109,
        0.012513918802142143,
        0.015392553061246872,
        0.0032454661559313536,
        -0.0441012941300869,
        -0.03615398705005646,
        -0.052626825869083405,
        -0.06616536527872086,
        0.1145455539226532,
        0.028270728886127472,
        0.036122772842645645,
        0.07652470469474792,
        -0.04812450334429741,
        -0.013574018143117428,
        -0.015416190959513187,
        -0.018218496814370155,
        -0.0352059081196785,
        -0.032432761043310165,
        -0.04675748199224472,
        -0.09245642274618149,
        -0.046867433935403824,
        0.03831946849822998,
        0.061656247824430466,
        0.04475337266921997,
        0.029307184740900993,
        -0.015475626103579998,
        -0.0176322590559721,
        -0.056114453822374344,
        -0.09762725234031677,
        0.11754757910966873,
        0.01566453091800213,
        -0.04194469377398491,
        0.001820042496547103,
        0.02573448233306408,
        0.013685384765267372,
        0.0564798042178154,
        0.04211129620671272,
        0.002476253779605031,
        -0.003093117382377386,
        0.08905114233493805,
        -0.06261788308620453,
        -0.039707113057374954,
        -0.0010094635654240847,
        -0.03623248636722565,
        -0.0724555179476738,
        0.11196326464414597,
        -0.009445357136428356,
        0.11469601839780807,
        -0.04740425944328308,
        -0.07513224333524704,
        0.004442782606929541,
        -0.03584441542625427,
        -0.0566570907831192,
        0.030670136213302612,
        0.035001251846551895,
        0.10188576579093933,
        -0.07519608736038208,
        -0.046032000333070755,
        0.020642893388867378,
        -1.2077039245923752e-32,
        0.03951549157500267,
        0.04376416280865669,
        -0.038993220776319504,
        -0.050777237862348557,
        0.047335706651210785,
        -0.023142432793974876,
        0.0427515022456646,
        0.08615666627883911,
        0.08322026580572128,
        -0.08519696444272995,
        0.04071249067783356,
        -0.08952111750841141,
        -0.10160166770219803,
        -0.010112497955560684,
        -0.04182974249124527,
        -0.023058149963617325,
        -0.10848359763622284,
        -0.03651021793484688,
        0.061241477727890015,
        0.001434612786397338,
        0.12036022543907166,
        0.14591248333454132,
        0.11986026167869568,
        -0.0014380615903064609,
        -0.007900617085397243,
        -0.008819257840514183,
        0.03917764499783516,
        0.06432586908340454,
        0.06863636523485184,
        0.05781561881303787,
        0.06918850541114807,
        -0.06773588806390762,
        -0.019323667511343956,
        -0.0038602326530963182,
        0.028804022818803787,
        0.04759901389479637,
        0.0284944549202919,
        0.04565970599651337,
        -0.0038368897512555122,
        -0.07042178511619568,
        0.032221294939517975,
        0.04109193757176399,
        -0.051453668624162674,
        -0.03931402042508125,
        0.024940932169556618,
        -0.08600588142871857,
        -0.04501999169588089,
        0.0540677011013031,
        0.05556534603238106,
        -0.03321003168821335,
        -0.0828741118311882,
        0.0025219195522367954,
        -0.05190348997712135,
        -0.03022095561027527,
        -0.05763554200530052,
        0.03683926537632942,
        -0.04365628957748413,
        -0.04062708094716072,
        0.030460689216852188,
        0.007308776490390301,
        0.03418906778097153,
        -0.007640504743903875,
        -0.06491940468549728,
        -0.08690303564071655,
        -0.0025986230466514826,
        -0.07573317736387253,
        0.08290604501962662,
        0.01819625496864319,
        0.03430281579494476,
        -0.013159379363059998,
        -0.03368440642952919,
        0.0035235208924859762,
        0.04357970505952835,
        -0.016268987208604813,
        0.06682101637125015,
        0.053406596183776855,
        -0.04063398391008377,
        -0.016777412965893745,
        0.08768700808286667,
        -0.046032801270484924,
        -0.05650898441672325,
        0.003478868631646037,
        0.00373116135597229,
        0.061618030071258545,
        0.09484729170799255,
        0.06609710305929184,
        0.1121317446231842,
        -0.0663691908121109,
        -0.038529638200998306,
        0.07554317265748978,
        0.021379908546805382,
        0.021593768149614334,
        0.06211608648300171,
        0.1128108948469162,
        -0.07713856548070908,
        -6.348763292862714e-08,
        0.03436891362071037,
        0.03545963391661644,
        0.008063766174018383,
        -0.009192337282001972,
        0.00680279778316617,
        -0.12325859814882278,
        -0.021333927288651466,
        0.051471516489982605,
        0.09402485191822052,
        -0.07605331391096115,
        0.024859420955181122,
        -0.029461635276675224,
        -0.07360417395830154,
        0.11305996030569077,
        0.029102539643645287,
        0.028163015842437744,
        -0.079559326171875,
        0.10736177861690521,
        -0.019272547215223312,
        -0.05531366541981697,
        -0.006944003980606794,
        0.022419525310397148,
        0.002740046475082636,
        -0.018934518098831177,
        0.01555471308529377,
        0.017985567450523376,
        -0.009979238733649254,
        -0.01882299967110157,
        0.016043977811932564,
        0.03507965803146362,
        -0.08018527925014496,
        -0.00794450007379055,
        0.05652887374162674,
        -0.0315997377038002,
        -0.02337343990802765,
        -0.03285123407840729,
        -0.026006318628787994,
        -0.023392945528030396,
        0.0004740388540085405,
        -0.0008952617063187063,
        0.023646190762519836,
        -0.14058446884155273,
        -0.04978470504283905,
        -0.019954130053520203,
        0.02065412513911724,
        -0.065308578312397,
        0.07003186643123627,
        -0.043588053435087204,
        -0.034963928163051605,
        0.019591661170125008,
        0.0031458220910280943,
        0.042890600860118866,
        0.057002246379852295,
        -0.005745014175772667,
        0.08516234159469604,
        -0.013209070079028606,
        0.01836235821247101,
        0.03865789622068405,
        -0.007037408649921417,
        0.018649635836482048,
        0.0499444305896759,
        0.031895264983177185,
        -0.036710336804389954,
        0.03593873232603073
    ]
}