{
    "id": "Gr14EuEHp8Y",
    "title": "Oh Come On, Apple!",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-03-10T01:47:20Z",
    "video_url": "https://www.youtube.com/watch?v=Gr14EuEHp8Y",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Apple",
        "Peek Performance",
        "iPad Air 2022",
        "iPhone SE 2022",
        "iPad Air 5",
        "iPad Air 5th gen",
        "Mac",
        "Mac Studio",
        "Studio Display",
        "M1",
        "Apple Silicon",
        "M1 Ultra",
        "M1 Max",
        "M1 Pro",
        "new Mac",
        "2022 Mac"
    ],
    "views": 389295,
    "likes": 23444,
    "comments_count": 761,
    "description": "Thank you to Wealthfront for sponsoring this video! Use my link  to open a Wealthfront investment account and get $5K managed for free.  TechLinked receives cash compensation from Wealthfront Advisers LLC (Wealthfront Advisers) for sponsored advertising materials. TechLinked is not a client and this is a paid endorsement. TechLinked and Wealthfront Advisers are not associated with one another and have no formal relationship outside of this arrangement. Nothing in this communication should be construed as a solicitation, offer, or recommendation, to buy or sell any security. Any links provided by TechLinked are not intended to imply that Wealthfront Advisers or its affiliates endorses, sponsors, promotes and/or is affiliated with the owners of or participants in those sites, or endorses any information contained on those sites, unless expressly stated otherwise. Investment management and advisory services are provided by Wealthfront, an SEC registered investment adviser. All investing involves risk, including the possible loss of money you invest, and past performance does not guarantee future performance.   LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 wait what channel is this 0:14 Mac Studio, iPhone SE, etc 1:53 AMD to fix TPM issues 2:52 Amazon accused of using forced labor 3:49 Wealthfront 4:37 QUICK BITS 4:47 Volkswagen ID Buzz 5:26 Intel Alchemist GPUs delayed 5:58 Android app archive feature 6:32 HBO sued for giving data to FB 6:59 Limewire is NFTs now   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://www.wealthfront.com/techlinked",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/MwO1x",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- Riley, I just covered the Peek Performance event on Mac Address. - [Riley] Yeah, yeah. This is TechLinked. - Yeah, but people could just go to Mac Address. - [Riley] No, no. They could do that too, but this is a different channel. TechLinked. - I have to say all this stuff again? - [Riley] You love iPhones. - That wasn't the most exciting thing at the event. At Apple's Peek Performance event yesterday, the company announced a refreshed $429 iPhone SE with the same A15 Bionic chip found in the iPhone 13 lineup and a new iPad Air powered by the same M1 chip in the iPad Pro. But if you think that's exciting, well, you probably didn't watch the rest of the stream. Surprising everyone who thought that the M1 Max represented the maximum performance the M1 chip could offer- - [Riley] Makes sense. - Yep. Apple announced the M1 Ultra, which is essentially a pair of M1 Max chips squished together and not Apple's version of the CIA's psionic abilities program. - [Riley] Or that's what they told you. - The M1 Ultra or Max will power the new Mac Studio, a Mac mini with a big air cooler in its giant forehead, which starts at $2,000 because with the Ultra, it may give Apple's current Mac Pro a run for its money. - [Riley] Is that true? - I didn't write this. - [Riley] I mean, I wrote that, but I don't know whether it's true. - Yes, well, they did have bars that showed it faster than the Mac Pro, so that means something. What the scale of those bars is, is a great question. What the bars represent is another great question. But don't forget the matching 5K Studio Display, which is 1,600 bucks, and another 400 for an adjustment arm. Modifying monitor height is a privilege. Rotation? Apple won't even let you pay for that. It's too dangerous. - [Riley] You could beam yourself, and if you rotated it, whoa! - Actually, they said if you want rotation you have to get the VESA mount. That was the whole pitch for the VESA mount. All right, enough about Apple. Many (indistinct)-based PC's have been experiencing intermittent stuttering on recent builds of Windows 10 and 11, which is exactly what you don't wanna have happen in the middle of an electronic supply shortage. But Team Red has finally given us some insight as to the probably cause, a flaw in some motherboards' built-in trusted platform module or TPM. - [Riley] The Phantom Menace. - Eh. I guess it wasn't trustworthy after all. AMD is currently working to fix the issue but until then, you can also pick up a discrete TPM module, which mercifully, aren't usually very expensive, plug it into your motherboard and switch over to it in your (indistinct) settings. Just make sure to turn off BitLocker and Windows first. As for when we can expect a fix, look for it through your motherboard or PC manufacturer during the first half of May. But if it's not here by then... That'll be a good time to head outside anyway. - [Riley] May flowers, et cetera. - Mm. Amazon is facing backlash today after a report from the non-profit Tech Transparency Project indicating that some of their suppliers in China have been using forced labor. Although low pay and poor working conditions in Chinese manufacturing plants have long been the focus of concern, these allegations are more serious, as the suppliers in question have been linked to so-called \"reeducation camps\" where ethnic minorities are detained and put to work by the Communist Party of China. Amazon, of course, has denied working with any suppliers that use forced labor, and stated that they take action when suppliers are found to violate their standards. Actions which may or may not include helping executives escape to Mars on a Blue Origin rocket. - [Riley] And we know that they work now, so that's good. - And I think Amazon just announced a stock buyback today, so all the money they could invest in the factories is just going to buy back their stock. - [Riley] I'm glad they succeeded. - So great to see them invest in something so useful. Oh no, I feel a Riley coming on. - Now it's time for Quick Bits, brought to you by Wealthfront, the automated investment platform that builds a portfolio based on your risk tolerance to help grow your money long-term. If you've kept putting off investing because you thought it had to take a ton of time and research, great news, it doesn't have to. Wealthfront makes it super easy to get started. You can simply set up your account and let Wealthfront take care of the rest while you put your feet up and drink daiquiri's or you can build your own portfolio, with hundreds of investment options across tech, healthcare, real estate and more and they're always adding new ETF's over time, each and every one hand selected and vetted by experts. You can explore all these investments right on their website. Whatever your investment goals are, Wealthfront gives you the tools to build a portfolio you're excited about. So check them out at the link below and get a special sign-up bonus. - Quick Bits are information, and information is massless. But they can still smart if they hit you fast enough so keep your head down. - [Riley] Whoa! - Remember those old Volkswagen hippy buses? They're fittingly getting an eco-friendly makeover as VW is releasing the ID Buzz later this year or more like ID Buzz-bus. Buzz bus, bus buzz? (Riley laughs) Essentially a modern full electric version of the iconic vehicle from the 1960's. Europe will get it first, but the American version, due out in 2023, will have an extra row of seating and VW even says it's planning a self-driving pilot program for 2025, powered by an AI that's just a little high, to stay true to its roots. - [Riley] Yeah, dude. - And like every other self-driving car, just drives a little high. Have you seen Teslas? I know some of you have been waiting patiently for Intel's new Arc Alchemist graphics cards but be prepared to wait a little longer. According to a report from Igor's Lab, we won't be seeing the cards until either May or June. It's a little disappointing to get news of another delay, especially with the tight GPU market, but Intel appears to be doing some extra quality and stability testing. Think of it as waiting for the pie to cool a bit before you bite into it. You wanna taste those frames, baby. - [Riley] Mm, what kinda pie are we talkin' here? - Uh. - [Riley] Rhubarb? - Google announced that Android will soon have the ability to archive apps, which will shrink the app size by 60% by removing certain parts of it. If you need to use it again, your phone will quickly restore the code that it needs. Sounds like great option for phones with not a lot of storage, or as a way for users to punish apps that have misbehaved. I said no tracking, you're going in the hole. - [Riley] Not the hole! - Also, Apple instituted this like, in iOS 8 or 9. - [Riley] I don't care about that. I don't care. - Another reason why to watch Mac Address. - [Riley] Stop. - HBO is the latest company to face accusations of mishandling user data, with a class action lawsuit claiming that the network has been sharing users viewing history with FaceBook without user permission. No word on how much the suit is seeking, but hopefully everyone will get at least enough money to pay for a subscription of HBO Max, or all the other services that are almost certainly doing the same thing. - [Riley] Everything sucks! (laughs) - And LimeWire of all things is back from the dead. We all remember it as a not particularly legal way to download music, but it's being relaunched this May as a digital collectables marketplace. So yeah, they're gonna sell NFT's. Part of the appeal, if you can call it that, is that they'll take regular credit card payments so you don't have to know anything about crypto to pretend that you're getting into art when you're actually getting into gambling. - [Riley] That's all the fun! Larping! - It's crypto that takes money from a credit card... - [Riley] What kind of an ape are you? - I'd wager it's a safe bet that this episode is over, thank goodness. But if you just can't stay away, come back on Friday for more tech news. It'll cure what ails ya, depending on what ails ya. - [Riley] What do you mean \"Thank goodness?\" - This isn't a Mac Pro.",
    "transcript_keywords": [
        "Mac Address",
        "Mac Pro",
        "Mac",
        "Peek Performance event",
        "Apple Peek Performance",
        "watch Mac Address",
        "Apple",
        "Peek Performance",
        "Apple current Mac",
        "current Mac Pro",
        "Address",
        "Max",
        "Pro",
        "Apple Peek",
        "Mac Studio",
        "Yeah",
        "Performance event",
        "great",
        "Wealthfront",
        "money"
    ],
    "transcript_entity_values": [
        "Wealthfront",
        "yesterday",
        "Windows 10 and 11",
        "Arc Alchemist",
        "2023",
        "Intel",
        "a ton",
        "Igor's Lab",
        "Volkswagen",
        "VW",
        "Riley",
        "Europe",
        "June",
        "8",
        "CIA",
        "iPhone",
        "NFT",
        "Mac Address",
        "later this year",
        "Max",
        "the first half of May",
        "the M1 Ultra",
        "60%",
        "Amazon",
        "9",
        "the Communist Party of China",
        "AI",
        "hundreds",
        "M1 Max",
        "13",
        "today",
        "Blue Origin",
        "American",
        "FaceBook",
        "Quick Bits",
        "Friday",
        "iPad Air",
        "5",
        "TPM",
        "China",
        "1,600 bucks",
        "2025",
        "429",
        "Riley] Mm",
        "AMD",
        "first",
        "M1",
        "iPhones",
        "A15 Bionic",
        "Mac Pro",
        "Chinese",
        "ETF",
        "Android",
        "Riley",
        "TechLinked",
        "400",
        "Mars",
        "GPU",
        "HBO Max",
        "Mac",
        "1960",
        "Team Red",
        "2,000",
        "Teslas",
        "VESA",
        "HBO",
        "healthcare",
        "Mac Studio",
        "May",
        "BitLocker",
        "Apple",
        "the Mac Pro",
        "the iPad Pro"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "LOC",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "NORP",
        "ORG",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "GPE",
        "MONEY",
        "DATE",
        "MONEY",
        "PERSON",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "LOC",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART"
    ],
    "vector": [
        -0.00744593795388937,
        -0.04753538593649864,
        0.01102431956678629,
        -0.0053948345594108105,
        0.1305459886789322,
        -0.022199951112270355,
        0.08893529325723648,
        0.01577691175043583,
        0.004352842923253775,
        -0.014593270607292652,
        0.004439851734787226,
        0.04154924675822258,
        0.0757497176527977,
        -0.008926276117563248,
        -0.01582159660756588,
        0.02400706335902214,
        0.04132728651165962,
        -0.08062072098255157,
        -0.02653944306075573,
        0.04577590152621269,
        0.020391471683979034,
        -0.06297724694013596,
        0.04505394771695137,
        -0.008413099683821201,
        0.015204286202788353,
        -0.07696541398763657,
        -0.003831435926258564,
        0.05104363337159157,
        -0.04713074490427971,
        0.020258311182260513,
        -0.027753759175539017,
        0.013998931273818016,
        -0.047405585646629333,
        -0.01597573608160019,
        -0.0023724727798253298,
        -0.013846288435161114,
        -0.027443766593933105,
        -0.013230115175247192,
        -0.0763232558965683,
        -0.03581160306930542,
        0.023770572617650032,
        -0.09540960192680359,
        -0.015157419256865978,
        0.014684157446026802,
        0.026965415105223656,
        -0.012948252260684967,
        0.07686686515808105,
        0.004619481507688761,
        0.00804274994879961,
        0.03997092694044113,
        -0.09592879563570023,
        -0.0657973363995552,
        0.03152775391936302,
        -0.06207183748483658,
        -0.06580973416566849,
        0.06113971024751663,
        0.03821474313735962,
        -0.0264825951308012,
        0.013811261393129826,
        0.02649201638996601,
        0.0782473161816597,
        -0.0843111053109169,
        -0.02167479880154133,
        -0.021641770377755165,
        0.07704750448465347,
        0.0029537256341427565,
        -0.0831395760178566,
        0.09461741149425507,
        -0.061511702835559845,
        -0.10473194718360901,
        0.0462595671415329,
        -0.1037622019648552,
        -0.028843220323324203,
        0.06961950659751892,
        0.006659327074885368,
        0.05903466418385506,
        0.0789959728717804,
        0.0004991899477317929,
        0.05844917148351669,
        -0.056929826736450195,
        0.03400510549545288,
        -0.012288878671824932,
        -0.005662449635565281,
        -0.02730136550962925,
        -0.023825569078326225,
        0.011057297699153423,
        -0.015264558605849743,
        0.03015301376581192,
        0.08269061148166656,
        0.026841305196285248,
        0.03533005341887474,
        0.021654805168509483,
        0.011302430182695389,
        -0.02379794977605343,
        0.028387848287820816,
        -0.03990070894360542,
        -0.07869058847427368,
        -0.056537337601184845,
        -0.08678435534238815,
        0.03970010578632355,
        -0.0032350618857890368,
        0.02073238603770733,
        0.031869277358055115,
        -0.030991939827799797,
        -0.04334944114089012,
        -0.007733655162155628,
        -0.02116459235548973,
        0.1331312358379364,
        0.06938263028860092,
        0.04040393978357315,
        -0.059269070625305176,
        0.060495272278785706,
        -0.03210148215293884,
        0.03509403392672539,
        -0.012536442838609219,
        0.047038231045007706,
        -0.13504411280155182,
        0.02511628158390522,
        0.14230331778526306,
        -0.08632012456655502,
        0.07862770557403564,
        0.07670559734106064,
        0.07997680455446243,
        -0.03898237645626068,
        0.01090238243341446,
        -0.11439069360494614,
        -0.06468960642814636,
        6.900006371900913e-33,
        -0.03552539646625519,
        0.11130177229642868,
        0.04873979836702347,
        0.020516876131296158,
        -0.009912464767694473,
        -0.019826160743832588,
        -0.008795805275440216,
        -0.056196700781583786,
        -0.028580594807863235,
        0.035202257335186005,
        -0.034212272614240646,
        0.13478301465511322,
        0.012140569277107716,
        0.014463821426033974,
        -0.014586926437914371,
        -0.026158230379223824,
        0.005457745399326086,
        0.04255908727645874,
        0.018659934401512146,
        -0.0349775105714798,
        0.06521580368280411,
        0.021454541012644768,
        -0.01805170439183712,
        -0.04817952588200569,
        0.017726438120007515,
        -0.05523572862148285,
        -0.06099851056933403,
        0.027368130162358284,
        0.09482818841934204,
        0.048429008573293686,
        -0.07705715298652649,
        -0.0021295391488820314,
        0.008867349475622177,
        -0.09592226892709732,
        0.04446018859744072,
        -0.010717351920902729,
        -0.06263907998800278,
        -0.12686344981193542,
        -0.004770771134644747,
        0.021787719801068306,
        -0.0702439472079277,
        0.027555672451853752,
        0.055124182254076004,
        0.016518205404281616,
        -0.08447499573230743,
        0.002238734159618616,
        0.03646891936659813,
        0.006536425091326237,
        -0.0112463952973485,
        0.053307197988033295,
        -0.10035191476345062,
        -0.04965916648507118,
        -0.02344236709177494,
        -0.038008756935596466,
        -0.02237618714570999,
        -0.0032030916772782803,
        -0.002521253190934658,
        -0.017653264105319977,
        -0.014145547524094582,
        -0.06081147491931915,
        0.03323020040988922,
        -0.02596854232251644,
        -0.07136055827140808,
        0.012528200633823872,
        -0.16582340002059937,
        0.054470039904117584,
        0.05621377378702164,
        0.014073165133595467,
        -0.00999352615326643,
        0.0422692596912384,
        -0.0244766715914011,
        0.048704955726861954,
        0.08242013305425644,
        0.03957424685359001,
        -0.04308988153934479,
        -0.08324825018644333,
        -0.09202493727207184,
        0.12118332833051682,
        -0.01388300396502018,
        0.039771754294633865,
        0.009395143948495388,
        -0.022793442010879517,
        0.04802834987640381,
        0.09027891606092453,
        0.010327942669391632,
        0.06828372180461884,
        0.020036550238728523,
        -0.03724728152155876,
        -0.024144940078258514,
        -0.02554832212626934,
        -0.027279449626803398,
        0.015721438452601433,
        -0.0352187305688858,
        0.07422135770320892,
        -0.1082933321595192,
        -8.433501200685975e-33,
        -0.08991127461194992,
        -0.02542237378656864,
        0.06852882355451584,
        -0.0139905521646142,
        0.011063280515372753,
        0.022479940205812454,
        0.046899568289518356,
        -0.00691500399261713,
        -0.0019238473614677787,
        -0.024701867252588272,
        0.040382154285907745,
        0.02166326344013214,
        -0.06164069473743439,
        -0.10605211555957794,
        -0.03672017157077789,
        -0.08529041707515717,
        0.034175798296928406,
        -0.05707729235291481,
        -0.023259589448571205,
        -0.06510160118341446,
        0.08775828778743744,
        -0.01412489265203476,
        0.05291835963726044,
        0.04126204550266266,
        0.045699626207351685,
        -0.0468255840241909,
        0.06474717706441879,
        0.07732925564050674,
        0.012902162969112396,
        0.028023075312376022,
        0.04737260565161705,
        0.04811505600810051,
        -0.03760450333356857,
        0.01878180354833603,
        -0.017141392454504967,
        0.04407127946615219,
        0.04988626390695572,
        -0.04805753007531166,
        -0.03672544285655022,
        -0.018631460145115852,
        0.05003220587968826,
        -0.008924603462219238,
        0.053748633712530136,
        0.004619859624654055,
        -0.029460320249199867,
        -0.014432616531848907,
        -0.056558553129434586,
        -0.032673854380846024,
        0.06934984028339386,
        0.02205159328877926,
        0.019435934722423553,
        -0.013955622911453247,
        0.06361123919487,
        -0.02536470629274845,
        -0.09276863932609558,
        0.0197446346282959,
        0.0850730612874031,
        0.05328328534960747,
        -0.039787519723176956,
        0.003906451165676117,
        0.01799606904387474,
        0.03809450566768646,
        0.0037264435086399317,
        0.016136828809976578,
        -0.011349225416779518,
        -0.06345394253730774,
        0.035599369555711746,
        0.06067163124680519,
        -0.036504361778497696,
        0.002004440641030669,
        0.02515861764550209,
        -0.01951143518090248,
        0.002248535631224513,
        -0.11827255040407181,
        -0.044322166591882706,
        0.05801866576075554,
        0.04088832810521126,
        -0.009003333747386932,
        -0.02741267904639244,
        -0.01271415688097477,
        0.004368581809103489,
        0.07165461033582687,
        0.0786275714635849,
        -0.015478539280593395,
        0.044723138213157654,
        0.032621078193187714,
        -4.868108590017073e-05,
        -0.013725854456424713,
        -0.053889449685811996,
        -0.015332937240600586,
        -0.05205344408750534,
        -0.11529392749071121,
        -0.01186948362737894,
        0.07084999233484268,
        -0.06286254525184631,
        -5.859038054722987e-08,
        -0.011999010108411312,
        0.04242204874753952,
        0.05930265039205551,
        -0.03157661855220795,
        -0.047222983092069626,
        0.006419715005904436,
        -0.0430840365588665,
        -0.00552329421043396,
        0.050134360790252686,
        -0.012991619296371937,
        -0.005063588265329599,
        -0.009252043440937996,
        -0.09888515621423721,
        0.04566766321659088,
        -0.04984128102660179,
        -0.06807979196310043,
        -0.04959089681506157,
        0.023301657289266586,
        -0.030248751863837242,
        -0.023181691765785217,
        -0.003118187887594104,
        0.009315607137978077,
        0.03705364093184471,
        -0.036249611526727676,
        0.055587925016880035,
        0.01658390648663044,
        -0.045456767082214355,
        0.04756493866443634,
        -0.00082788011059165,
        0.006515717599540949,
        -0.08627017587423325,
        -0.04464482143521309,
        -0.019378652796149254,
        0.0068801771849393845,
        -0.037611521780490875,
        -0.017391785979270935,
        -0.04396112635731697,
        0.005822396837174892,
        0.014078489504754543,
        0.1013050377368927,
        0.011046011000871658,
        -0.012080485001206398,
        0.06760712713003159,
        0.02244662679731846,
        0.052982475608587265,
        0.04667561501264572,
        -0.05843367055058479,
        -0.016383294016122818,
        0.07554503530263901,
        -0.04319904372096062,
        0.0014135316014289856,
        -0.029752030968666077,
        -0.013498684391379356,
        -0.04764518886804581,
        -0.0249618086963892,
        -0.023395124822854996,
        0.016629423946142197,
        0.0225859172642231,
        -0.0025727066677063704,
        0.08472628146409988,
        0.06378494948148727,
        -0.15938140451908112,
        -0.03580006584525108,
        0.03235345706343651
    ]
}