{
    "id": "gs4mVr6C6p8",
    "title": "Motorola Razr 2019: Is This $1500 Folding Phone From The Future Or The Past?",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-11-14T04:15:07Z",
    "video_url": "https://www.youtube.com/watch?v=gs4mVr6C6p8",
    "category": "Science & Technology",
    "tags": [
        "motorola razr",
        "moto razr",
        "folding phone 2019",
        "motorola razr 2019",
        "best folding phone",
        "razr 2020",
        "motorola razr 2020",
        "folding phone 2020",
        "mrmobile",
        "michael fisher",
        "android central",
        "motorola",
        "flexible display",
        "folding screen",
        "galaxy fold",
        "motorola razr review"
    ],
    "views": 787381,
    "likes": 19501,
    "comments_count": 2176,
    "description": "Sponsored by iFixit. Got a cracked screen or bad battery? iFixit makes it easy to repair it yourself with an all-in-one Fix Kit!  Go to  to repair your phone and get $10 off your next $50 fix!   [MOTOROLA RAZR 2019 HANDS-ON / MOTOROLA RAZR 2020 HANDS-ON]  The re-imagined Motorola Razr is part flashy technological feat and part practical portability perk, sold at a premium price despite some forgettable specs. If youre thinking that sounds familiar, then you much have been around for the first Motorola RAZR launch back in 2004! Despite its high price, that RAZR product family would go on to sell 130 million units over the next four years, going down in the history books as the most successful flip phone of all time. Can Motorola capture lightning in a bottle again? I recently got a sneak peek at the company's flexible-display flagship branded simply \"razr\"  and while my enthusiasm for the foldable category doubtless colors my impression, I came away hopeful for the Motorola brand name for the first time in four years.     [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S MOTOROLA RAZR 2019 HANDS-ON]  MrMobile's Motorola Razr 2019 Hands-On / Motorola Razr 2020 Hands-On was produced following three hours with a Motorola Razr review sample at a Motorola press event in Los Angeles. Preproduction device running pre-release software. MrMobile does not produce paid or sponsored reviews; Motorola was not offered copy approval and no compensation was requested or provided in exchange for this coverage.    [LINKS]  Motorola Razr Hands-On [Android Central]:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links, which afford Mobile Nations a commission if you make a purchase. See Mobile Nations' disclosure policy for more details:   #motorola #razr #motorolarazr #foldingphone #motorazr #flexibledisplay",
    "description_links": [
        "http://iFixit.com/mrmobile",
        "https://www.youtube.com/channel/UCSOp...",
        "https://www.androidcentral.com/motorola-razr-preview",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links"
    ],
    "transcript": "- Sponsored by iFixit. (gentle music) Motorola says it didn't set out to recreate a legend when it started designing this phone four years ago, it's just that sometimes the best ways are the old ways. This is the Motorola razr from 2004, and this is the new razr for 2020. (gentle upbeat music) Now Samsung's Galaxy Fold might have been the first with a flexible display in the U.S., but there's more than one way to fold a phone. While the Galaxy Fold is more like a tablet that collapses to a chunky candy bar, the razr is a new take on the clamshell phone. When it's open you get a tall 6.2 inch plastic OLED display, that reminds me a lot of Sony's latest Xperia's. It's 21:9 aspect ratio is ideal for cinematic video and reading long documents with a minimum of scrolling, and it's easier to use one-handed than a wider display would be. It's bordered on the top by a notched, five megapixel selfie camera, which is meant mainly for video calls, and on the bottom by the razor's signature chin. The chin is also functional, it's where you'll find the speedy fingerprint sensor, as well as the 4G LTE antennas. No 5G this time around. Also in the chin, a big resonator for the new speakerphone. Motorola is known for great audio quality, but the hands-on venue was pretty noisy and it couldn't quite overcome it. I look forward to giving it a proper listen during the review. I was able to make a couple test calls though, and the feeling of talking on a razr hasn't changed. It's weirdly flat and thin, in point of fact, exactly as then as the first model from 14 years ago. Now, hanging up on robocallers doesn't pack quite the satisfying clack as the clam shells of old, but that's because there's a lot more going on inside this hinge. Motorola worked with Lenovo's laptop team on this design, which lets the screen curl, in a sort of teardrop, when you shut the phone. You see how it flexes here? And and how it slides downward into the chin by a millimeter or so? What that does is let the stainless steel casing close completely around the screen, which makes it tougher for dust to get it in there. And it, also, avoids a sharp, tight kink that might cause a crease to form in the screen. On that subject, it's not the uniform perfection of a glass display but the razor's is much flatter and less variegated than the Galaxy Fold's. Motorola also applied its usual nano-coating to the panel, so it's water-resistant. With these big gaps in the sides when you open and close it I still wouldn't take it anywhere near the beach, but I was struck by how confident and nonchalant the company's engineers were about durability. They really don't seem worried about it, which, to me, says a lot. While that primary display is the main attraction, you've got one on the front too, and Motorola calls this 2.7 inch OLED touchscreen a Quick View display because it's here just for the basics. It's kinda like a smartwatch, you can preview notifications, make and take calls, use Google Pay and Assistant or control your music, all using the same Moto Display actions that I've been praising for years. And, yes, the useful and addictive Motorola gesture shortcuts are here too. Chop it to turn on the flashlight, twist it to launch the camera. So far no bop it, but we'll see how it goes. And that camera is where you start to see that Motorola locked in the razr components a long time ago. You have to make do with a single shooter, no ultra wide or telephoto and the sensor is the same one found in the OnePlus 6, which was fine but certainly nothing special, even for the spring of 2018. And the spec sheet is full of similar compromises. The processor will be almost two-years-old when this phone launches. And while 128 gigs of storage is a fair amount of space there's no microSD expansion, nor is there a SIM slot. If you wanna use this on any carrier other than the exclusive launch partner, Verizon, you'll need to take it to a competitor with the compatible eSIM format. The volume and power keys on the unit I tried didn't feel great, almost no travel or feedback. The plastic back might suggest wireless charging but that's not here, just wired 15 watt charging through the USB-C port. And on top of that, the battery is only about 2500 milliamp hours, that's 10% smaller than the battery in the Pixel 4 I just reviewed, which has the worst endurance I've seen in years. And to top it all off, the units we got to handle were running an Android version behind, though Motorola does promise an update shortly after launch to Android 10. That's a lot of compromises for $1,500, which is what this will cost you when it goes on sale in January. But don't click away yet, I'm gonna tell you why I think this thing will still be a smash hit. Right after a word about how you can save money with a little do-it-yourself action. Fun fact about me, back when I sold cell phones at retail I used to take apart broken phones that got returned just to see if I could fix 'em and, boy, do I wish today's sponsor had been around back then. iFixit it gives you the power to repair your busted tech yourself, with packages like this all-in-one fix fit. This packs enough tools to get you inside your broken phone and iFixit also has parts and step-by-step instructions, with photos and videos, so that when you do get inside you've got the materials you need and you know what you're doing. Look, we've all known the pain of a broken phone, so if you'd rather fix what got then buy something else visit ifixit.com/mrmobile today and you'll get $10 off your next $50 fix. Thanks to iFixit it for sponsoring this video. So what we have in the razr is part flashy technological feat, part practical portability perk, sold at a premium price, despite some forgettable specs. If you're thinking it's not worth it I'm not gonna say you're wrong. But consider this, when the first razr launched in 2004, it too was exclusive to one carrier. It had a small battery, a dim display, a mushy keypad, bad software and for all that you had to shell out 600 bucks, as much as many smartphones cost back then. And Motorola would go on to sell 130 million razr series phones over the next four years, it was the most successful flip phone of all time. Today the market is different and a lot of us reviewers have been railing against the scourge of $1,000 phones when you can get a great one for 500. But, counter point. This is a secret between, I'm going to buy this. I'm buying this. Already, doesn't matter, I love it. Yeah, the end of the day this phone is a very intentional fusion of nostalgia and bleeding edge technology. It was built, at least in part, to entice. To catapult a stagnant, if profitable, Motorola back to relevancy at the high end. And while I'll wait for the full review to decide if it's worth it or not, I can say with some confidence that droves of folks won't wait for people like me to give them the go-ahead. This is one of those things that, if you're a certain kind of person, you've just gotta have. It's nice to see smartphones like that again, especially when they come from the brand that basically invented the cellphone. This hands-on was shot at a Motorola press event in Los Angeles, ahead of the official debut. As always, MrMobile does not produce paid reviews and Motorola was not was not given a copy of this video ahead of publication. They're seeing it for the first time right alongside you. If you like videos like that and you'd like to see more, please subscribe to the MrMobile on YouTube, and check out Android Central's hands-on for an alternative perspective. Until next time, thanks for watching. And stay mobile my friends.",
    "transcript_keywords": [
        "Motorola",
        "Galaxy Fold",
        "Samsung Galaxy Fold",
        "phone",
        "display",
        "razr",
        "Fold",
        "Samsung Galaxy",
        "Motorola razr",
        "Galaxy",
        "phones",
        "lot",
        "years",
        "back",
        "time",
        "Motorola calls",
        "Motorola back",
        "chin",
        "broken phone",
        "video"
    ],
    "transcript_entity_values": [
        "2020",
        "Lenovo",
        "Today",
        "four years ago",
        "10",
        "January",
        "YouTube",
        "128",
        "Galaxy Fold",
        "Android 10",
        "Verizon",
        "Samsung",
        "Android Central's",
        "the OnePlus 6",
        "600 bucks",
        "microSD",
        "the Galaxy Fold's",
        "next $50",
        "Los Angeles",
        "130 million",
        "21:9",
        "10%",
        "five megapixel",
        "2.7 inch",
        "Moto Display",
        "only about 2500 milliamp hours",
        "Xperia",
        "Motorola",
        "more than one",
        "today",
        "selfie",
        "first",
        "2004",
        "U.S.",
        "15 watt",
        "4",
        "6.2 inch",
        "iFixit",
        "years",
        "the Galaxy Fold",
        "Google Pay",
        "the spring of 2018",
        "1,500",
        "500",
        "the next four years",
        "MrMobile",
        "1,000",
        "two-years-old",
        "Sony",
        "14 years ago",
        "one",
        "Android",
        "the end of the day"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "MONEY",
        "DATE",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "EVENT",
        "MONEY",
        "PRODUCT",
        "ORG",
        "MONEY",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORDINAL",
        "DATE",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "PERSON",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.18558108806610107,
        0.05099409818649292,
        0.014870849438011646,
        -0.00823390856385231,
        0.03216766566038132,
        -0.07054009288549423,
        0.02876889891922474,
        0.1525353044271469,
        -0.08675943315029144,
        0.0051595671102404594,
        0.021579910069704056,
        0.08605320006608963,
        0.04913851618766785,
        0.04468157887458801,
        -0.010914526879787445,
        0.04622828960418701,
        0.02781539410352707,
        -0.056489620357751846,
        -0.0070223743095994,
        0.027738459408283234,
        -0.061272624880075455,
        0.007343153934925795,
        0.00766236986964941,
        -0.014895226806402206,
        0.028873782604932785,
        0.04585420340299606,
        -0.020506499335169792,
        0.021095002070069313,
        0.00644213892519474,
        -0.040209848433732986,
        0.04166482016444206,
        0.15205441415309906,
        0.019046863541007042,
        0.02132086642086506,
        0.03478704020380974,
        -0.02569301798939705,
        -0.000383687176508829,
        -0.010829662904143333,
        -0.07933599501848221,
        -0.04600513353943825,
        0.0002629718801472336,
        -0.046597208827733994,
        -0.016408981755375862,
        0.01644194684922695,
        0.0020886061247438192,
        -0.014726435765624046,
        0.06733536720275879,
        0.0025925314985215664,
        -0.018255766481161118,
        -0.006476139184087515,
        0.03847483545541763,
        -0.033015813678503036,
        0.05676772817969322,
        -0.029782744124531746,
        -0.09364718198776245,
        0.05734366178512573,
        -0.08778063207864761,
        -0.014989388175308704,
        0.022471878677606583,
        0.025560272857546806,
        0.04105678200721741,
        -0.027177389711141586,
        -0.05808437988162041,
        0.03824147582054138,
        0.0035112998448312283,
        0.017439916729927063,
        -0.02759537287056446,
        -0.06927258521318436,
        -0.016069212928414345,
        0.026934929192066193,
        0.029338186606764793,
        -0.020153362303972244,
        0.04695403575897217,
        -0.027057135477662086,
        -0.052963029593229294,
        0.04033202305436134,
        0.09169682115316391,
        0.021857744082808495,
        -0.08052435517311096,
        0.07227717339992523,
        0.07415615767240524,
        -0.06683690845966339,
        -0.02473815530538559,
        -0.021903328597545624,
        0.06843053549528122,
        0.026250246912240982,
        0.028563806787133217,
        0.05353527516126633,
        -0.01452652271836996,
        -0.023766739293932915,
        -0.06418252736330032,
        0.09291324019432068,
        0.012022113427519798,
        -0.03246143460273743,
        -0.11362697929143906,
        0.013392233289778233,
        0.02289695292711258,
        -0.019863000139594078,
        0.019721336662769318,
        0.005871623754501343,
        0.038844503462314606,
        0.01635894551873207,
        0.12164206802845001,
        -0.05304289609193802,
        0.04559563100337982,
        -0.09535358101129532,
        -0.015377527102828026,
        0.01140659675002098,
        3.0503166271955706e-05,
        0.07214736193418503,
        -0.05464868247509003,
        0.038389746099710464,
        -0.024045975878834724,
        -0.0006866217590868473,
        -0.006573578808456659,
        -0.030856654047966003,
        -0.0900241807103157,
        0.02031848207116127,
        0.11415013670921326,
        -0.019026201218366623,
        -0.00706439558416605,
        0.05655263736844063,
        0.014593667350709438,
        -0.08016989380121231,
        0.06286982446908951,
        0.012906764633953571,
        -0.020014043897390366,
        4.992831439881047e-33,
        -0.08227092027664185,
        0.15235188603401184,
        -0.10271380841732025,
        -0.009093880653381348,
        -0.07377281785011292,
        0.0777895599603653,
        0.04605092108249664,
        0.07609008997678757,
        -0.06886868178844452,
        0.045343317091464996,
        -0.002049295464530587,
        0.029635543003678322,
        0.04720183461904526,
        -0.02205459028482437,
        0.01679929904639721,
        -0.04857175424695015,
        -0.049781687557697296,
        -0.049591753631830215,
        -0.09132828563451767,
        -0.04012506082653999,
        -0.035081930458545685,
        0.007149496581405401,
        -0.009855248965322971,
        -0.025902798399329185,
        -0.07173910737037659,
        -0.0012852390063926578,
        0.03069848008453846,
        -0.04008655622601509,
        0.040283042937517166,
        0.008859621360898018,
        -0.028402650728821754,
        0.06107509136199951,
        0.041642218828201294,
        -0.005071714986115694,
        -0.049287524074316025,
        0.041690364480018616,
        -0.015946950763463974,
        -0.12667101621627808,
        0.012789726257324219,
        -0.026013104245066643,
        -0.11311805248260498,
        0.0448949858546257,
        -0.06821015477180481,
        0.022114580497145653,
        0.046239566057920456,
        -0.007863239385187626,
        -0.013188633136451244,
        0.006742147263139486,
        -0.05232195556163788,
        -0.059141550213098526,
        -0.09397318959236145,
        -0.02479660138487816,
        -0.05044617876410484,
        -0.010076494887471199,
        -0.06396530568599701,
        0.014123366214334965,
        0.013753782957792282,
        -0.013062141835689545,
        0.05656448379158974,
        0.038252729922533035,
        0.015105210244655609,
        0.03240661695599556,
        -0.08427155017852783,
        0.023755986243486404,
        -0.031872376799583435,
        0.026223065331578255,
        0.015248721465468407,
        -0.06859087944030762,
        -0.0602806881070137,
        0.05839776620268822,
        0.05531188100576401,
        -0.03833793103694916,
        0.0037571259308606386,
        -0.028582826256752014,
        0.10478181391954422,
        0.0018287268467247486,
        0.06591398268938065,
        0.03612622618675232,
        0.009684463031589985,
        0.018200568854808807,
        0.008942931890487671,
        0.026921378448605537,
        0.05832025781273842,
        0.02458386868238449,
        0.06266942620277405,
        -0.029401186853647232,
        -0.001639733323827386,
        -0.056131962686777115,
        0.0166604146361351,
        0.052693430334329605,
        0.05529037490487099,
        -0.08510695397853851,
        -0.036467671394348145,
        -0.04222128540277481,
        0.015479608438909054,
        -4.916393083008905e-33,
        0.010628961026668549,
        0.0316731221973896,
        0.05006396397948265,
        0.03122485801577568,
        0.08228661119937897,
        -0.06635858118534088,
        0.02665592171251774,
        0.08888385444879532,
        -0.017256107181310654,
        -0.14209969341754913,
        0.02801382727921009,
        0.055386096239089966,
        0.02156388759613037,
        -0.0046772719360888,
        0.016454661265015602,
        0.012287898920476437,
        0.011686541140079498,
        -0.07749141752719879,
        0.03821227699518204,
        0.038788143545389175,
        0.00033059564884752035,
        0.059066202491521835,
        -0.02278219535946846,
        0.042789164930582047,
        -0.07680115848779678,
        0.02267366275191307,
        0.08700000494718552,
        -0.023463580757379532,
        0.03456356003880501,
        0.02333240397274494,
        -0.0530611053109169,
        0.006403306033462286,
        0.04251784458756447,
        0.057340107858181,
        0.050612419843673706,
        -0.00028273783391341567,
        -0.0006290702731348574,
        -0.01804201863706112,
        0.005912385880947113,
        -0.07654549181461334,
        0.0315588116645813,
        0.044941436499357224,
        -0.057163022458553314,
        0.0032115611247718334,
        0.04545891657471657,
        -0.0770205706357956,
        -0.04765646904706955,
        -0.01820371486246586,
        0.029153984040021896,
        -0.010224382393062115,
        -0.007142107002437115,
        -0.004829766694456339,
        -0.011389635503292084,
        0.0303526408970356,
        -0.04581982269883156,
        -0.008536620996892452,
        0.012874863110482693,
        -0.07676609605550766,
        0.018626254051923752,
        0.0048488532193005085,
        0.08698547631502151,
        0.07059771567583084,
        0.004165907856076956,
        -0.012933075428009033,
        -0.019674034789204597,
        -0.03348233550786972,
        0.07042688131332397,
        -0.017648257315158844,
        -0.04597696661949158,
        -0.01194626372307539,
        -0.014541196636855602,
        0.020038774237036705,
        0.017799047753214836,
        -0.04807122424244881,
        0.012879569083452225,
        0.09046436846256256,
        -0.09277639538049698,
        -0.02452005073428154,
        -0.06344865262508392,
        -0.05095377564430237,
        0.04295670613646507,
        0.02535213716328144,
        0.018019655719399452,
        -0.018145227804780006,
        0.039030276238918304,
        -0.010692400857806206,
        -0.00046779256081208587,
        -0.012365954928100109,
        -0.05628914386034012,
        -0.045863572508096695,
        -0.043370429426431656,
        0.006941391155123711,
        -0.07693304121494293,
        0.0995916947722435,
        0.08730310201644897,
        -5.325919971710391e-08,
        0.021928491070866585,
        0.026948796585202217,
        -0.0056861815974116325,
        -0.02472495101392269,
        0.07936238497495651,
        0.012334439903497696,
        0.0023699351586401463,
        -0.03532491251826286,
        0.07059978693723679,
        0.07465901225805283,
        -0.04578911140561104,
        -0.03202230483293533,
        -0.058300990611314774,
        0.04924236610531807,
        -0.055571697652339935,
        0.08140567690134048,
        -0.018279796466231346,
        0.03404482454061508,
        -0.0018360529793426394,
        0.06886303424835205,
        0.0032243013847619295,
        0.053462836891412735,
        0.06730930507183075,
        -0.05420771986246109,
        0.01886390894651413,
        0.03796111419796944,
        -0.0937013253569603,
        0.012337928637862206,
        0.08659098297357559,
        -0.08178764581680298,
        -0.023606691509485245,
        -0.003273481735959649,
        0.0651063472032547,
        0.05097069591283798,
        -0.022694891318678856,
        -0.08244258165359497,
        -0.013884416781365871,
        -0.06686916947364807,
        0.047657303512096405,
        -0.057473599910736084,
        0.09361068904399872,
        -0.023498188704252243,
        -0.02926049754023552,
        0.06736308336257935,
        -0.06358795613050461,
        -0.05572442337870598,
        -0.003057047026231885,
        -0.11660873144865036,
        -0.020374232903122902,
        -0.02060314454138279,
        -0.021473024040460587,
        -0.005491849035024643,
        -0.05583915486931801,
        -0.052897315472364426,
        0.07878535240888596,
        -0.019949177280068398,
        -0.024754738435149193,
        -0.0010980117367580533,
        -0.08721954375505447,
        -0.00451459689065814,
        0.005155631341040134,
        -0.15478281676769257,
        0.0061997962184250355,
        0.07088308036327362
    ]
}