{
    "id": "GsI5Yt6WDlA",
    "title": "Huawei P40 Pro Plus: A Nokia Lumia For 2020 [Camera Tour]",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-06-10T05:00:33Z",
    "video_url": "https://www.youtube.com/watch?v=GsI5Yt6WDlA",
    "category": "Science & Technology",
    "tags": [
        "huawei p40 pro plus review",
        "huawei p40 pro review",
        "huawei p40 review",
        "best cameraphone 2020",
        "best phone camera 2020"
    ],
    "views": 308542,
    "likes": 13813,
    "comments_count": 1067,
    "description": "It sounds strange but, just go with me for a second: the key to understanding the Huawei P40 Pro+  is looking back at a Nokia phone from seven years ago.  The Nokia Lumia 1020 was a revolutionary re-imagining of what a cameraphone could be. In a time when most phone cameras topped out at 12 or 16 megapixels, it brought a monster 41-megapixel sensor that let you crop zoom without the quality loss of those smaller cameras  and it mounted the whole thing on a bed of ball bearings for optical stabilization. In 2013 this was incredible stuff, especially for the (in retrospect, reasonable) price of $649. So why didnt Nokia run away with the market? Well mainly because it ran a platform called Windows Phone. A platform that failed largely because it just didnt have the apps people were looking for.  Over the past few years, Huawei has kind of stepped into Nokias old spot in the smartphone photography space, by recruiting some of the imaging pioneers from Nokia  by partnering with famed photography brand Leica  and by applying good old-fashioned R&D to produce some stunning phone cameras. The Huawei P40 Pro Plus is the latest evolution of that legacy  so I took it on a road trip from Brooklyn to the boonies  and along the way, this collection of cameras captured my heart. But unless youre a phone-tweaking geek like me, youll probably find that no optical achievement is worth the compromises this phone carries. To see why, join me for MrMobile's Huawei P40 Pro Plus camera review!   [SUBSCRIBE TO MRMOBILE]     [ABOUT HUAWEI P40 PRO+ / P40 PRO PLUS CAMERA TOUR]  MrMobiles Huawei P40 Pro+ / P40 Pro Plus Camera Tour video was produced following five days with a Huawei P40 Pro Plus review sample provided by Huawei. Pre-production sample running pre-release software. Device received one software update 20 hours before publication. No company paid a fee or otherwise offered compensation in exchange for this coverage, nor did any company preview or approve this content before publication.    [PRODUCTS IN THIS VIDEO]  Twelvesouth HiRise Wireless Charger:   Nomad Base Station, Walnut Edition:    [LINKS]  Huawei P40 Pro Plus Camera Review [Android Central]:   LEICA Lens Names [KenRockwell.com]:   Nokia Lumia 1020 Review [Pocketnow]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase. See our affiliate link policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #huaweip40proplus #huaweip40pro #huaweip40pro+ #huaweip40 #huawei #smartphones #tech",
    "description_links": [
        "https://www.youtube.com/channel/UCSOp...",
        "http://mrmobile.tech/1Rs",
        "http://mrmobile.tech/1Rt",
        "https://youtu.be/OYddZd8mmbY",
        "https://www.kenrockwell.com/leica/lens-names.htm",
        "https://pocketnow.com/nokia-lumia-1020-review-the-warthog-of-cameraphones",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- All right, this is gonna sound a little strange but just go with me on it. The key to understanding the Huawei P40 Pro+ is looking back on a Nokia phone from nine years ago. In a time when most phone cameras topped out at 12 or 16 megapixels, Nokia's Lumia 1020 was a revolutionary reimagining of what a camera phone could be. Its monster 41 megapixel sensor lets you crop zoom without the quality loss of those smaller cameras, and it mounted the whole thing on a bed of ball bearings for optical stabilization. In 2013, this was incredible stuff, especially for the, in retrospect, reasonable price of 649. So why didn't Nokia run away with the market? Well, mainly because the platform it ran on, Windows Phone, failed, largely because it just didn't have the apps people were looking for. Over the past few years, Huawei has kind of stepped into Nokia's old spot in the photography space by recruiting some of the imaging pioneers from Nokia by partnering with famed photography brand Leica and by applying some good old-fashioned R&D to produce some stunning phone cameras. The P40 Pro+ is the latest evolution of that legacy, so I took it on a road trip from Brooklyn to the boonies, and along the way, this collection of cameras captured my heart all over again. But you knew it was coming. Unless you're a phone-tweakin' geek like me, you'll probably find that no optical achievement is worth the compromises this phone carries. (upbeat music) Now let's be clear, those compromises are not entirely Huawei's fault, and they're probably not something Huawei wants reviewers to focus on, but I don't work for Huawei, I work for you. So I have to tell you that out of the box, this phone does not have Google Apps. It doesn't have the Google Mobile Services framework that allows those apps to function. It does not have the Google Play Store. In its place, the Huawei AppGallery, which is off to an okay start but still has only 2% the number of titles that Google Play Store has, and an awful lot of those are just junk. Now Huawei has attracted some big-name developers, so you do see familiar titles in here like Telegram, Amazon, Snapchat, but you know, I've been through this before. I've held out hope that the Palm App Store would pick up steam after HP bought Palm. I've put my faith in the scale of Microsoft and Windows Phones still lost. Microsoft, folks. So to say it's an uphill slog for Huawei in the west is an understatement. In markets like China where customers aren't as reliant on Google's apps and services, the situation is different. But here in the States, the only people who should consider this thing are people who are willing to cobble together an app collection from Huawei and Amazon and sideload Google Apps even though they're not guaranteed to work well. Still, I wanted to cover this thing in some capacity because if nothing else, it's important to see what we're missing out on, right? Well, on our way to the cameras, let's stop over and talk about the casing, and one of the things I like about Huawei is it's usually not content to just build aspirational smartphones. Historically, it's insisted that they also stand out with a fanciful finish. Recall the bottomless blues of the Mate 20 Pro, the iridescent nebula of the P20 Pro. Well, 2020 seems to be the year when brands go bland. You can get a black one or you can get a white one. I asked Huawei about this and the company said, for this generation, it was interested in creating something classic and timeless. (chuckles) Well, I don't see why that would have prevented it from also giving buyers a fun option. I will give the company credit. The white version that I have is attractive in a restrained sort of way. It looks expensive. It feels expensive, thanks to its weight. Also, I like that rather than glass, Huawei went with a microcrystalline zirconium ceramic backplate that makes it more scratch-resistant while still allowing for wireless charging, 40-watt wireless charging if you have the special Huawei charger, which as of yet, I do not. In an era when most wireless pads are limited to 15 watts and under, it's nice to see Huawei pushing the envelope. All right, let's get to why we're here. There are five, separate cameras filling out the face of the raised mesa-like optical array on the back of the phone, which bears the legend Vario-Summilux. As photographer Ken Rockwell explains on his website, that's decades old Leica lingo meant to evoke superior performance in two areas, low light and zoom. The sensors themselves are a 50-megapixel primary backed up by 40-megapixel Ultra Wide; a depth sensor; and two, separate eight-megapixel cameras for zoom, one with 3x mag, the other with 10x. That's optical zoom. It's not cropping the image and sacrificing quality, but rather using a series of mirrors and prisms to bend the incoming light, achieving a similar effect to a big glass lens on a conventional camera. That zoom capability opens up a whole new set of possibilities for creative framing, and it comes in handy for more than just distant sailboats. Example, I wanted to capture the mid-century spirit of the Silver Sands Motel sign in Greenport, but not these anachronistic modern-day vehicles out front. So I punched in to the next lens and cropped a little further until I got what I wanted. Could you do this with your Pixel or your iPhone? Sure, but you wouldn't get this kind of sharpness. I will say that while I am happy with this photo and the others I took on this day, they were captured using an older software version, which had some issues that made it difficult to capture these oil tankers off Long Beach and these Manhattan skyscrapers too. But Huawei being Huawei, it pushed out an 11th-hour update shortly before press time that fixed that, making it much easier for me to frame up a telephoto shot. These were after the update. Even though the quality sacrifice as you zoom past 20 or 30x is noticeable, with enough patience and a little bit of luck, you can snag shots that you can't get with almost any other smartphone. Okay, that's the Vario. Now how about that Summilux? Yeah, night mode is the thing that really put Huawei on the map back in the days of the P20 Pro, and you know, it hasn't changed much with this generation. Of course it brings the light up tremendously in the dark as designed. I'll toss a side-by-side up here for comparison, but as you may remember, it's an awful lot of fun to play with during the day too. It's obviously not something you wanna use all the time. It totally destroys contrast and its quest for epic, dynamic range. I kind of wish Huawei would have refined it a little bit so it didn't do that. But if you're trying for a heavily stylized look, no other phone does it with this particular flare. Ditto the color filters and monochrome modes and the viewfinder on any other phone, you know, I'd dismiss them as cheap tricks, but there's just something about the color tuning in this Huawei, like a combo that makes me wanna use 'em more often. The predictive AI modes, which I normally turn off, are in the same boat. It turns out, Huawei's autodetection really does make this car look better. Moving over from the 50-megapixel primary, the 40-megapixel Cine is so named because of its 16:9 sensor, but you can use it for stills. And this is a bit of a letdown. While the images are good and I'm always happy to have an Ultra Wide, I wish Huawei hadn't limited its field of view. Look at this side-by-side with the Galaxy Fold, a phone with demonstrably inferior optics, but a proper wide-angle lens that lends this scene the imposing feel I wanted. As for video, I'll share the handful of samples I was able to capture in the few hours between the latest software update and my publication deadline. (upbeat music) Completing the optical hardware roundup is the selfie array upfront with a 32-megapixel camera with autofocus, a depth sensor, and a maximum video resolution of 4K, and what looks like some pretty good video stabilization too. It also packs the same portrait mode offerings as the rear camera, a bevy of options that aren't that great, particularly not the Apple-aping Studio mode, but I admit, like a Midwest kid with a soda sweet tooth, I am partial to pop. Passerby removal, dual view, ultra slow motion. Folks, there are enough features to fill two videos this length, but fortunately, I've seen enough to know that the P40 Pro+ carries the most versatile mobile camera of its generation. It's a modern-day Lumia. Unfortunately, it can't just be a camera, it also has to be a phone, and just like the Lumia, it's all about the apps or lack thereof. It is possible through methods like Aurora and Phone Clone, et cetera, to get GMS and Google Play at least mostly working. And hey, if you can run your life on the apps you can download from the Amazon Appstore, more power to you, maybe it will be enough, maybe the Huawei AppGallery will get more traction, maybe someday the phone will actually be worth its asking price of a little under US$1,600, but the problem for Huawei, one of them, is that phones like the Samsung Galaxy S20 Ultra exist with similar camera capabilities and all the apps you could ever want. I look forward to a day when I can recommend a Huawei phone again, but for now, like so many would-be customers out there, I just have to admire its stunning cameras from afar. This video was produced using a P40 Pro+ review sample provided by Huawei, a pre-production device running pre-release software. MrMobile does not produce paid reviews. Huawei received no copy approval or even an early look at this video, and the opinions contained within are mine and mine alone. Please subscribe if that's the kind of video you'd like to see more of on YouTube. Special thanks to Android Central for providing additional footage. Visit them at the link in the description for a much more extensive review. Until next time, thanks for watching. And as the world slowly spins back up to a place where it might be possible to do so, I encourage you to please keep wearing those masks and stay safe while you also stay mobile, my friends.",
    "transcript_keywords": [
        "Huawei",
        "Google Play Store",
        "phone",
        "Google Apps",
        "Google Play",
        "Google",
        "apps",
        "Pro",
        "Nokia",
        "Huawei phone",
        "cameras",
        "phone cameras",
        "camera",
        "Palm App Store",
        "Nokia phone",
        "Huawei AppGallery",
        "Play Store",
        "sideload Google Apps",
        "phone cameras topped",
        "Nokia Lumia"
    ],
    "transcript_entity_values": [
        "Telegram",
        "the few hours",
        "Microsoft",
        "2013",
        "the Palm App Store",
        "mid-century",
        "eight-megapixel",
        "Leica",
        "the Amazon Appstore",
        "Google Play Store",
        "Google Apps",
        "two",
        "4",
        "Nokia",
        "MrMobile",
        "Ultra Wide",
        "Cine",
        "one",
        "nine years ago",
        "12",
        "Aurora",
        "only 2%",
        "Lumia",
        "Greenport",
        "Brooklyn",
        "Long Beach",
        "mesa",
        "GMS",
        "Snapchat",
        "Lumia",
        "P40 Pro+",
        "Windows Phones",
        "20",
        "32-megapixel",
        "Google",
        "the day",
        "3x",
        "Vario",
        "the P20 Pro",
        "Ken Rockwell",
        "Vario-Summilux",
        "11th-hour",
        "Huawei",
        "40-watt",
        "Lumia 1020",
        "modern-day",
        "649",
        "Apple",
        "the days",
        "China",
        "a little under US$1,600",
        "Leica",
        "Midwest",
        "Manhattan",
        "the Huawei AppGallery",
        "the Galaxy Fold",
        "YouTube",
        "2020",
        "41",
        "Windows Phone",
        "40-megapixel",
        "this day",
        "16:9",
        "Phone Clone",
        "the Silver Sands Motel",
        "HP",
        "States",
        "Google Mobile Services",
        "the year",
        "the Google Play Store",
        "decades",
        "Samsung Galaxy S20 Ultra",
        "16 megapixels",
        "50-megapixel",
        "the past few years",
        "five",
        "15 watts",
        "Palm",
        "Amazon"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "FAC",
        "PERCENT",
        "ORG",
        "LOC",
        "GPE",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "EVENT",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "MONEY",
        "PRODUCT",
        "LOC",
        "GPE",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "EVENT",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.056310851126909256,
        0.07886183261871338,
        0.09939733892679214,
        -0.056437090039253235,
        0.03950158879160881,
        -0.054732222110033035,
        0.01827874593436718,
        0.09169594943523407,
        -0.0030667800456285477,
        0.08619261533021927,
        0.04975481703877449,
        0.09085947275161743,
        0.09115763753652573,
        0.04876914620399475,
        0.011172302067279816,
        0.0073315748013556,
        0.040007513016462326,
        -0.052270255982875824,
        -0.04603850841522217,
        0.025759827345609665,
        0.01372501440346241,
        -0.0751684308052063,
        0.004578785039484501,
        -0.02109418995678425,
        0.05434805899858475,
        0.024601386860013008,
        -0.09401588886976242,
        -0.014295090921223164,
        0.01167293731123209,
        0.01807248406112194,
        -0.012833117507398129,
        0.14476987719535828,
        0.04050280898809433,
        0.053364913910627365,
        -0.03914584219455719,
        -0.08375243097543716,
        0.013366153463721275,
        -0.038711290806531906,
        -0.03691301867365837,
        -0.027407757937908173,
        -0.0018331656465306878,
        0.016539938747882843,
        -0.03499240055680275,
        0.02012077160179615,
        -0.004329899325966835,
        -0.07845959067344666,
        0.09532814472913742,
        -0.041962865740060806,
        -0.07646769285202026,
        -0.05505231022834778,
        -0.014650346711277962,
        -0.0009584518265910447,
        -0.009977107867598534,
        -0.04715709015727043,
        -0.08016405999660492,
        -0.003195783356204629,
        0.0032416649628430605,
        0.004553716164082289,
        0.01834295503795147,
        -0.029945198446512222,
        0.012705869972705841,
        0.02155381627380848,
        -0.04887567460536957,
        0.03907102718949318,
        -0.0373348593711853,
        -0.029282815754413605,
        -0.0056928652338683605,
        -0.06412585824728012,
        0.020913682878017426,
        -0.004765066783875227,
        0.004874516278505325,
        -0.00879062619060278,
        0.013858477585017681,
        0.02485758811235428,
        -0.050870344042778015,
        -0.0003728036826942116,
        0.03138137608766556,
        0.0040521277114748955,
        -0.058629412204027176,
        0.0049475678242743015,
        0.1375419646501541,
        -0.05838024616241455,
        -0.024755321443080902,
        -0.019316203892230988,
        0.06457419693470001,
        -0.008396567776799202,
        -0.021935319527983665,
        0.08934219926595688,
        -0.06303440779447556,
        -0.15849904716014862,
        -0.050238609313964844,
        0.04140910506248474,
        -0.16807527840137482,
        0.020278828218579292,
        -0.04490930959582329,
        -0.039487384259700775,
        -0.060764994472265244,
        -0.05505523830652237,
        -0.03665158897638321,
        -0.027103625237941742,
        0.04014958068728447,
        0.008135738782584667,
        -0.014287927187979221,
        -0.022661173716187477,
        0.009055636823177338,
        -0.07223083823919296,
        0.014336265623569489,
        -0.013448162004351616,
        -0.005578308366239071,
        0.04551902785897255,
        -0.03222616761922836,
        -0.002982271369546652,
        -0.0574164018034935,
        -0.01821557618677616,
        -0.0534479059278965,
        -0.03250269964337349,
        -0.049805812537670135,
        0.039026033133268356,
        0.047943275421857834,
        -0.08530230075120926,
        -0.0351470522582531,
        -0.06051329895853996,
        -0.11236788332462311,
        -0.060972731560468674,
        0.020622020587325096,
        0.031922683119773865,
        -0.04267304390668869,
        2.6914711913732275e-33,
        -0.006499091163277626,
        0.08185254782438278,
        -0.01922765001654625,
        0.011276956647634506,
        0.03406478464603424,
        -0.027243921533226967,
        0.0649370476603508,
        0.014387460425496101,
        -0.02274164743721485,
        -0.03221961483359337,
        0.006211211904883385,
        -0.009082150645554066,
        -0.02135552652180195,
        -0.005117227789014578,
        0.07974254339933395,
        -0.03428416699171066,
        -0.061294712126255035,
        -0.07023444771766663,
        0.013501696288585663,
        0.003918987233191729,
        -0.003764356952160597,
        -0.02960987761616707,
        -0.006475650705397129,
        0.04451927915215492,
        0.04124656319618225,
        0.0911092460155487,
        0.05440511927008629,
        0.03266625106334686,
        0.08791645616292953,
        0.00743652181699872,
        -0.06788019090890884,
        2.1616257072309963e-05,
        -0.01153628434985876,
        0.008761723525822163,
        -0.0063776723109185696,
        0.035468995571136475,
        -0.01907949335873127,
        -0.11828852444887161,
        0.008910085074603558,
        -0.03677938133478165,
        -0.010350589640438557,
        0.08253122121095657,
        -0.024925416335463524,
        -0.029923897236585617,
        0.03001275286078453,
        0.022376446053385735,
        -0.08011733740568161,
        0.06561249494552612,
        -0.1033695787191391,
        0.03840549290180206,
        0.07515266537666321,
        0.011856461875140667,
        -0.05207576975226402,
        0.0186744537204504,
        -0.07190664112567902,
        0.011277559213340282,
        -0.04291343688964844,
        -0.055498674511909485,
        -0.04112258553504944,
        0.03977811336517334,
        0.04789452627301216,
        -0.08596565574407578,
        -0.049736034125089645,
        0.018856307491660118,
        -0.009993846528232098,
        0.0561319924890995,
        0.06775259226560593,
        0.019584879279136658,
        -0.08650185167789459,
        0.17844127118587494,
        0.013793878257274628,
        -0.031646907329559326,
        -0.01485071424394846,
        -0.0495518296957016,
        0.0956585630774498,
        0.037326354533433914,
        -0.033033307641744614,
        -0.0115137854591012,
        -0.004749136511236429,
        0.07662220299243927,
        -0.024651063606142998,
        0.05368473380804062,
        0.05832459405064583,
        -0.006939478684216738,
        -0.018725397065281868,
        -0.04387679696083069,
        0.025263192132115364,
        -0.037773653864860535,
        -0.028771545737981796,
        0.05799617990851402,
        -0.032712697982788086,
        -0.016029641032218933,
        0.029350990429520607,
        0.05647648498415947,
        -0.03876839578151703,
        -4.2067754287503064e-33,
        0.01078802440315485,
        -0.035408731549978256,
        0.0005252783885225654,
        -0.015285870991647243,
        -0.01635674759745598,
        -0.05505134165287018,
        0.051781587302684784,
        0.009739232249557972,
        0.016624830663204193,
        -0.024150129407644272,
        0.045179035514593124,
        -0.007540198042988777,
        0.03936988115310669,
        0.04933823272585869,
        -0.061743613332509995,
        0.006523067131638527,
        -0.009008101187646389,
        -0.07490618526935577,
        0.03231680765748024,
        -0.005507125519216061,
        -0.0023522237315773964,
        0.10935785621404648,
        0.0528278611600399,
        0.1279340535402298,
        -0.04937689006328583,
        0.0024065389297902584,
        -0.03448646888136864,
        -0.03890671208500862,
        0.00409671850502491,
        -0.04083441197872162,
        0.0005246532382443547,
        -0.07853646576404572,
        0.046803224831819534,
        0.009384017437696457,
        0.01473933830857277,
        0.052534881979227066,
        -0.022821441292762756,
        -0.051857832819223404,
        0.05038757622241974,
        0.08493942022323608,
        0.005345520097762346,
        -0.0003097961889579892,
        0.04882977157831192,
        -0.058472298085689545,
        0.046056754887104034,
        -0.07127542048692703,
        0.014680210500955582,
        -0.0016090243589133024,
        0.00402245344594121,
        -0.01033188495784998,
        0.06843303143978119,
        0.10834687203168869,
        -0.057902950793504715,
        0.08617900311946869,
        -0.05546480417251587,
        -0.026817969977855682,
        -0.004194505512714386,
        -0.017068663612008095,
        0.010828684084117413,
        -0.013762599788606167,
        0.05009276792407036,
        0.029637565836310387,
        -0.08585616946220398,
        0.010782979428768158,
        -0.046111803501844406,
        0.10644911974668503,
        0.07757437974214554,
        -0.0371939092874527,
        -0.05894286185503006,
        -0.015479405410587788,
        -0.006865085102617741,
        -0.008616197854280472,
        -0.03953402861952782,
        0.08735671639442444,
        0.011189203709363937,
        0.03895806521177292,
        -0.15254129469394684,
        0.033919330686330795,
        0.007573618087917566,
        0.01397120114415884,
        0.024417705833911896,
        -0.018154213204979897,
        0.042060669511556625,
        0.03162301704287529,
        0.05937916412949562,
        -0.025134893134236336,
        -0.019473856315016747,
        -0.05190974846482277,
        -0.0408753901720047,
        0.00992807187139988,
        -0.005610684864223003,
        -0.06609763950109482,
        -0.03286341205239296,
        0.07180466502904892,
        0.014388234354555607,
        -4.5177301899457234e-08,
        -0.0006872821832075715,
        0.034765586256980896,
        -0.008136062882840633,
        -0.0428449846804142,
        -0.05455545708537102,
        -0.09989569336175919,
        -0.008110078051686287,
        0.05674350634217262,
        0.175451397895813,
        0.006369682028889656,
        -0.021281089633703232,
        -0.1018548309803009,
        -0.09431055933237076,
        0.11254928261041641,
        0.03604518249630928,
        0.05334743484854698,
        -0.01274083275347948,
        0.01046840101480484,
        0.02286425046622753,
        0.04863812401890755,
        -0.01604958064854145,
        0.04616960883140564,
        -0.03202475607395172,
        -0.035802293568849564,
        0.030903685837984085,
        0.04745529964566231,
        -0.07658082246780396,
        -0.05614777281880379,
        0.07857997715473175,
        -0.05127057433128357,
        -0.009815741330385208,
        -0.025125565007328987,
        0.012154651805758476,
        0.02912825159728527,
        -0.03941398859024048,
        -0.0053780716843903065,
        0.015084969811141491,
        -0.02234690636396408,
        0.11168200522661209,
        0.011942100711166859,
        0.0013563622487708926,
        -0.04808686673641205,
        -0.04286346212029457,
        0.0223457720130682,
        0.05128718912601471,
        -0.0034671237226575613,
        0.04232382774353027,
        -0.048316024243831635,
        -0.06144430488348007,
        0.05118744820356369,
        0.025748690590262413,
        0.04833516478538513,
        0.02832799404859543,
        -0.053538668900728226,
        -0.0009998178575187922,
        -0.07928641885519028,
        0.06262295693159103,
        -0.027675431221723557,
        -0.046863947063684464,
        0.005967915989458561,
        0.023735620081424713,
        -0.07580304145812988,
        0.02300489880144596,
        0.06616350263357162
    ]
}