{
    "id": "GtD48dr9T6A",
    "title": "Surface Pro X Review: Looks Like A Laptop, Acts Like A Smartphone",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-12-21T15:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=GtD48dr9T6A",
    "category": "Science & Technology",
    "tags": [],
    "views": 394050,
    "likes": 9570,
    "comments_count": 514,
    "description": "Sponsored by dbrand. Get your Surface Pro X skins here:   The Microsoft Surface Pro X is the Surface Ive been asking for for the past seven years. But in a world of Chromebooks and iPads, does the Surface Pro X still have a place? The answer, as it turns out, depends on what you do for work  and just how connected you need to be. Join me as I try out a Qualcomm-powered Always Connected PC for the first time in too long, in MrMobile's Surface Pro X review!   [LINKS]  Microsoft Surface Pro X [Amazon]:   Microsoft Surface Pro X Review [Windows Central]:   Should your next PC be an Always-Connected PC? [Windows Central]:   Surface Pro X vs Surface Pro 7: Which Should You Buy? [Windows Central]     [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S SURFACE PRO X REVIEW]  MrMobile's Surface Pro X Review was produced following three weeks with a Microsoft Surface Pro X review sample provided by Qualcomm. MrMobile does not produce paid or sponsored reviews; no company featured in this video was offered copy approval, and no compensation was requested or provided in exchange for this coverage. The lone sponsor of this video is dbrand.   [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links, which afford Mobile Nations a commission if you make a purchase. See Mobile Nations' disclosure policy for more details:   #microsoftsurface #surfaceprox #alwaysconnectedpc #pc #surface #surfaceprox #surfacepro7 #windows10 #windows #tablet #laptop #notebook",
    "description_links": [
        "https://dbrand.com/mrmobile-pro-x",
        "http://mrmobile.tech/1Nv",
        "https://www.windowscentral.com/surface-pro-x",
        "https://www.windowscentral.com/should-your-next-pc-be-always-connected-pc",
        "https://www.windowscentral.com/microsoft-surface-pro-7-vs-surface-pro-x",
        "https://www.youtube.com/channel/UCSOp...",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links"
    ],
    "transcript": "(futuristic techno music) - [Fisher] This is the Microsoft Surface I've been asking for for seven years. But in a world of Chromebooks and iPads, does it still have a place? Well, as it turns out, the answer depends on what you do for work and just how connected you need to be. First glance, you can't really see what makes this Surface stand out from its predecessors. To do that, you need to peer past the aluminum shell, right into the guts. This isn't a normal PC. It's what Qualcomm calls an Always Connected PC. Qualcomm isn't the only company building laptops with a 4G connection, but it is the only company doing it in this particular way. See, instead of a traditional processor, like one from Intel, say, at the heart of this thing is something much closer in design to what powers a smartphone. And that makes a lot of sense because if you think about it, a smartphone SOC is good at three things, staying cool, staying connected, and staying alive. And of those three smartphone-like strengths, the Surface Pro X nails two of them. First off, partly because that processor doesn't need any fans, this is the thinnest and lightest Surface ever made. It's not quite as thin as the iPad Pro I've been carrying for the past year, but it's almost there. And for the slight difference, you get the trademark built-in kickstand. Being able to prop this up at just the right angle to read a book or browse the web is something you'd need to buy a case for on any other tablet. And if you spring of the keyboard, your fingers will thank you. It's springy, by not mushy, tactile, but not clackety. The only place it doesn't really work, as usual for a Surface, is on a lap. I wish there was a secondary flap that folded down from the main kickstand to give it a secondary base. A little surprised Microsoft hasn't built that in yet. Anyway, Windows Hello is faster than on any machine I've used. There's a cool magnet the keeps the keyboard shut when it's closed. Thanks to Danny Rubino for pointing that out. The speakers are loud. You've got dual-USB ports. And there's even a user-accessible SSD. The only real complaints I have about the hardware are cosmetic. The display, while bright and beautiful, lacks the rounded corners that I've come to appreciate from the iPad. And I sure wish Microsoft had given us another color options besides black aluminum, which gets smudgy the instant you take it out of the box. Yeah, you knows where this going. If you buy one of these, get yourself a skin from my sponsor, dbrand. I tried a variety of strong but wrong color options before settling on what I think is a fun combo, Swarm honeycomb and colorized Windows logo. It won't bring back the headphone jack, but dbrand will give your Surface the personality that Microsoft wouldn't, and protect it in the process. Hit the sponsor link in the description. Smartphone-like Surface success two of three, staying connected. Like the iPad Pro, this thing has an eSIM that let's you set up an account and start surfing in a few minutes. Now, I did this with the default provider, GigSky, and it cost me a pricey $50 for five gigs, so it's nice that there's also a nano SIM slot so you can pop in your own. With that set up, I'm able to just open the computer anywhere I have cellular coverage and know that I'm connected. Yes, I could do this with a smartphone hotspot, and I often do, but this doesn't roast your phone's battery and it's one less hassle, especially if you don't have to pay for it. More on that at the end. Qualcomm isn't the only company powering the connected laptop. That Surface Go I reviewed last year also had an LTE connection, even though it was Intel-powered. Now, the way Qualcomm has stood out from those is with battery life. Windows Central got 15 hours of continuous use out of a Lenovo AC PC in the last generation. And David Kogan's early impressions of his Samsung Galaxy Book S, powered by almost the same chipset as the one inside the Surface here, are very favorable as well. This is where the Surface Pro X starts to stumble. Being so thin and light means it's had to sacrifice battery size. In the two weeks that I've been using it, the longest I've been able to hit is about six hours of use. Now, that's making no concessions to endurance. Performance slider at 3/4, using Chrome as my browser, average of 10 tabs, apps like Evernote and Telegram mixed in. I also use the cellular connection almost exclusively. Under those conditions, six hours is okay. It's better than what I could get out of my more beastly MacBook or ZenBook. But it's well-short of the eight hours that I got from Google's Pixelbook Go and the up-to 20 hours Qualcomm promises on other AC PCs. When battery life, which is such a pillar of the AC PC experience, falls short, it makes dealing with the system's other compromises tougher. Like this build of Windows. Because it's Windows on ARM, it can't run the same deep well of programs that have made the platform such a bastion of corporate productivity. Some apps, like two popular VPNs I usually use, don't work at all without special configuration. Win23 apps run in emulation, which is to say usually pretty slowly. Others are promised. Photoshop by Adobe is the biggest name I hear tossed around for 2020, you can see Zach Boden playing with it here, but with no firm delivery date. And as strong as the Windows ecosystem is for legacy PC programs, for tablet apps, it's bad. I tried reading on this thing, only to discover that Amazon dropped the tablet version of the Kindle app years ago. The desktop version works, but you need to double-click on a book to open it. This is a good PC but it's not a very good tablet. So I started wondering who would buy one of these over, say, a Chromebook. And I did what all great researchers do. I asked Twitter. The answer came loudly and instantaneously. Business users! Even though it doesn't run everything a more conventional PC will, you do have the enter Microsoft Office suite. It's compatible with Active Directory, which is how lots of workers log onto their corporate intranet. Thank you, Brad Sams. Sasha Siegan points out that some companies require Microsoft Edge, instead of the Chrome that a Chromebook would lock you into. And for other folks, it's not about corporate rules, so much as not wanting any more Google in their life. All right, so let's take it home. Do I like this thing? Yes, very much! But I didn't have to pay anything to borrow this one from Qualcomm. If I had to cough up $1,000, which is what the base model costs, plus another $140 for the keyboard or $270 for the keyboard and pen, well, as a consumer, I'd hope that someone reminded me that for about the same price, I could get a better tablet in the iPad or a better PC in the Surface Pro 7 or I could buy a Pixelbook Go, along with literally every accessory Google offers. So if you're an enterprise professional and you need a PC with an always-on connection, definitely try to expense one of these or get your IT department to snag one. I don't think you'll regret it and the fact that your company will probably also pay for your internet connection helps a lot, too. If you're anyone else, though, you can probably get by without it. Special thanks to Daniel Rubino of Windows Central, whose Slack I absolutely blow up with questions every time I do a Windows video. He's got a great review of this device and a great explainer on the history of AC PCs, which I will link below. This review made possible by a Surface Pro X review sample provided by Qualcomm, but I don't do paid reviews, and the company didn't get a copy of this video in advance. They're seeing it for the first time, right alongside you. Please subscribe if you'd like to see more videos like this on YouTube. Until next time, thanks for watching and stay mobile, my friends!",
    "transcript_keywords": [
        "Surface Pro",
        "Surface",
        "Windows",
        "Qualcomm",
        "Pro",
        "Microsoft",
        "Microsoft Surface",
        "connected",
        "iPad Pro",
        "Windows Central",
        "hours",
        "company",
        "connection",
        "tablet",
        "staying connected",
        "iPad",
        "thing",
        "keyboard",
        "staying",
        "apps"
    ],
    "transcript_entity_values": [
        "3/4",
        "Lenovo AC",
        "2020",
        "ZenBook",
        "First",
        "Brad Sams",
        "AC",
        "Chromebook",
        "LTE",
        "Adobe",
        "Daniel Rubino",
        "Windows",
        "YouTube",
        "the iPad Pro",
        "GigSky",
        "the two weeks",
        "Zach Boden",
        "Active Directory",
        "SSD",
        "Telegram",
        "Qualcomm",
        "Microsoft",
        "140",
        "Chromebooks",
        "seven years",
        "Evernote",
        "last year",
        "15 hours",
        "10",
        "270",
        "Amazon",
        "Microsoft Office",
        "MacBook",
        "Windows Central",
        "iPads",
        "a few minutes",
        "Danny Rubino",
        "Samsung Galaxy Book S",
        "first",
        "five",
        "SOC",
        "Google",
        "20 hours",
        "Intel",
        "4",
        "two",
        "the past year",
        "Kindle",
        "Sasha Siegan",
        "David Kogan's",
        "Surface",
        "Pixelbook Go",
        "about six hours",
        "the eight hours",
        "years ago",
        "Surface",
        "Fisher",
        "Pixelbook Go",
        "six hours",
        "the Microsoft Surface",
        "Chrome",
        "1,000",
        "iPad",
        "Windows",
        "Twitter",
        "three",
        "one",
        "Windows Hello",
        "50",
        "the iPad Pro",
        "the Surface Pro 7",
        "Microsoft Edge"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "NORP",
        "GPE",
        "PRODUCT",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "LOC",
        "DATE",
        "PERSON",
        "DATE",
        "TIME",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "TIME",
        "TIME",
        "DATE",
        "LOC",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.10604290664196014,
        -0.05866517871618271,
        0.07663266360759735,
        -0.047251638025045395,
        0.03704041615128517,
        0.02455495111644268,
        -0.008142108097672462,
        0.05070853978395462,
        -0.029192009940743446,
        0.018491780385375023,
        0.08392795920372009,
        0.05423065274953842,
        0.029014205560088158,
        0.1042327880859375,
        0.029696980491280556,
        0.08740494400262833,
        0.059085309505462646,
        -0.14412404596805573,
        0.02983815222978592,
        0.08907944709062576,
        -0.022335758432745934,
        -0.07341986894607544,
        0.03815927356481552,
        -0.11792232096195221,
        0.031376101076602936,
        -0.05590255558490753,
        0.0140612181276083,
        0.04618086665868759,
        0.033702343702316284,
        -0.005144872702658176,
        -0.07840936630964279,
        0.06551309674978256,
        -0.0005699661560356617,
        0.011527271009981632,
        0.017204875126481056,
        -0.1295490860939026,
        -0.05516450107097626,
        0.017604921013116837,
        -0.10215140879154205,
        -0.11103752255439758,
        -0.03535875305533409,
        -0.07443057745695114,
        -0.06492965668439865,
        0.034225720912218094,
        0.12473201006650925,
        -0.006009300239384174,
        0.06239538639783859,
        -0.017152514308691025,
        0.000745248282328248,
        -0.007615872658789158,
        0.011454031802713871,
        -0.03594347462058067,
        0.028624191880226135,
        -0.018675578758120537,
        -0.09230883419513702,
        0.0409209243953228,
        0.038373254239559174,
        0.006822886876761913,
        0.04670067876577377,
        -0.042214199900627136,
        0.032482534646987915,
        -0.03270753473043442,
        -0.018029306083917618,
        0.00017825979739427567,
        0.02562447264790535,
        0.027362516149878502,
        -0.04491380602121353,
        -0.032081831246614456,
        0.01491212472319603,
        0.01844870299100876,
        -0.06028534471988678,
        0.026260826736688614,
        0.021674320101737976,
        0.0035600021947175264,
        0.030902106314897537,
        0.032652560621500015,
        0.03796203434467316,
        -0.044372864067554474,
        -0.04449963942170143,
        -0.021368492394685745,
        -0.0026361560449004173,
        0.09235099703073502,
        -0.0021696442272514105,
        -0.03742964193224907,
        0.042305171489715576,
        -0.03372581675648689,
        -0.017702516168355942,
        0.07739565521478653,
        -0.09331905096769333,
        -0.1056601032614708,
        -0.04365221783518791,
        0.12107391655445099,
        -0.010303523391485214,
        0.002339812694117427,
        0.0005425995332188904,
        -0.048922404646873474,
        0.05591180548071861,
        -0.05487208068370819,
        -0.05375387892127037,
        0.008048078045248985,
        0.0403665192425251,
        -0.00608208030462265,
        0.050065841525793076,
        -0.038486868143081665,
        -0.012368952855467796,
        -0.0665658637881279,
        -0.026473334059119225,
        0.03759937360882759,
        -0.025753431022167206,
        0.010427727364003658,
        0.015270017087459564,
        -0.034653425216674805,
        -0.08203235268592834,
        0.007964763790369034,
        -0.06180287152528763,
        0.031478818506002426,
        -0.018206153064966202,
        0.08514316380023956,
        0.12966559827327728,
        -0.007680950686335564,
        -0.0625104010105133,
        0.029327504336833954,
        -0.022402873262763023,
        -0.08024615049362183,
        0.03150620684027672,
        0.002359515754505992,
        0.01742251217365265,
        6.111102725705306e-33,
        -0.06520984321832657,
        0.07883712649345398,
        -0.04182026535272598,
        -0.04798542708158493,
        -0.009051984176039696,
        -0.066439189016819,
        0.07058633118867874,
        0.06118794530630112,
        0.06352068483829498,
        0.043434880673885345,
        -0.045930761843919754,
        0.010529723018407822,
        -0.05272297561168671,
        0.0045581539161503315,
        0.05658750981092453,
        -0.04713093861937523,
        0.005222780164331198,
        -0.05324338749051094,
        -0.06449511647224426,
        -0.002366433385759592,
        0.012181037105619907,
        -0.050848886370658875,
        -0.007240626495331526,
        -0.055764615535736084,
        0.021486714482307434,
        0.03976892679929733,
        0.004976538009941578,
        0.04206972196698189,
        0.06503113359212875,
        0.024648750200867653,
        -0.1185428649187088,
        -0.008047406561672688,
        -0.02011200040578842,
        -0.05824490264058113,
        -0.03448798879981041,
        0.030688676983118057,
        -0.048648636788129807,
        -0.12112103402614594,
        0.07555428147315979,
        0.015863385051488876,
        -0.11933813989162445,
        -0.07063888758420944,
        0.03340183570981026,
        -0.017079448327422142,
        0.01947440579533577,
        -0.07761308550834656,
        0.007283429149538279,
        0.002742702141404152,
        -0.01879899762570858,
        -0.04210738092660904,
        -0.03628629073500633,
        -0.035855017602443695,
        -0.043776482343673706,
        0.007858960889279842,
        -0.035389937460422516,
        -0.01403375156223774,
        -0.007868981920182705,
        0.028317861258983612,
        0.019194114953279495,
        0.044187530875205994,
        0.03158070147037506,
        -0.0464710034430027,
        -0.08998847007751465,
        0.03241701424121857,
        -0.09847663342952728,
        0.03607749193906784,
        0.08779112249612808,
        0.02016003616154194,
        -0.10331179946660995,
        0.026209037750959396,
        0.02650407887995243,
        0.007764181587845087,
        0.024997536092996597,
        -0.0931137427687645,
        -0.014164427295327187,
        -0.002755665685981512,
        -0.029183870181441307,
        0.041533444076776505,
        -0.06664811819791794,
        0.034075770527124405,
        -0.0029812604188919067,
        0.055700525641441345,
        -0.013766979798674583,
        0.002164604375138879,
        -0.07225996255874634,
        -0.011849682778120041,
        0.020874449983239174,
        -0.06785782426595688,
        -0.005433930549770594,
        0.10842954367399216,
        -0.026060210540890694,
        0.014881727285683155,
        -0.013623228296637535,
        0.03870561718940735,
        -0.0402604378759861,
        -7.127641587621619e-33,
        -0.12942713499069214,
        -0.016900556161999702,
        0.0015660807257518172,
        0.01959890127182007,
        0.013405174016952515,
        -0.046116989105939865,
        0.009574820287525654,
        0.0026251585222780704,
        -0.06774970144033432,
        -0.05457853153347969,
        0.02560444548726082,
        0.01122591458261013,
        0.021512486040592194,
        0.019107770174741745,
        -0.021519161760807037,
        0.06202396750450134,
        -0.04404858127236366,
        -0.09490364044904709,
        0.03737929090857506,
        0.02937639132142067,
        0.0581669844686985,
        0.055336374789476395,
        0.0797562301158905,
        0.03775183483958244,
        -0.001067580422386527,
        -0.019265666604042053,
        0.02611200325191021,
        -0.021449193358421326,
        0.06992063671350479,
        0.07299088686704636,
        0.003596559399738908,
        -0.013138334266841412,
        -0.03108593262732029,
        0.01515523623675108,
        0.077517569065094,
        0.04659249261021614,
        0.05002143606543541,
        -0.04760624095797539,
        -0.003010065760463476,
        0.03270474076271057,
        0.06501111388206482,
        -0.03750129044055939,
        -0.0008637427818030119,
        0.004310077987611294,
        0.07384171336889267,
        0.020519955083727837,
        -0.0011519234394654632,
        -0.07141916453838348,
        0.008841818198561668,
        0.0007078280323185027,
        0.0033676307648420334,
        0.04219952970743179,
        -0.05592108145356178,
        -0.034797098487615585,
        -0.062387097626924515,
        0.015630019828677177,
        0.019290706142783165,
        -0.022246308624744415,
        -0.059308819472789764,
        -0.014772719703614712,
        0.08317189663648605,
        -0.010290776379406452,
        -0.005407493561506271,
        -0.018185632303357124,
        -0.025889160111546516,
        0.08287765830755234,
        0.08718914538621902,
        0.02221650630235672,
        0.04625103995203972,
        0.008516838774085045,
        -0.07658334821462631,
        0.01756044663488865,
        -0.06220552697777748,
        -0.09405045956373215,
        -0.028273947536945343,
        0.1200871542096138,
        0.037344932556152344,
        -0.003036229172721505,
        -0.027738071978092194,
        -0.09923846274614334,
        0.05347898229956627,
        0.02226479910314083,
        0.039113808423280716,
        0.0027343030087649822,
        0.03877193480730057,
        -0.024619776755571365,
        -0.02418074943125248,
        0.026732005178928375,
        -0.016141662374138832,
        0.05166279897093773,
        -0.012193419970571995,
        -0.01932334527373314,
        -0.06582343578338623,
        0.07727404683828354,
        -0.025277551263570786,
        -5.1754430074879565e-08,
        0.0548878014087677,
        0.08424966782331467,
        0.09107223153114319,
        -0.04931291192770004,
        -0.01107536256313324,
        -0.08699089288711548,
        0.08835548907518387,
        -0.08543617278337479,
        0.06031762436032295,
        0.03353744372725487,
        -0.08544354885816574,
        -0.06423377245664597,
        -0.05066575109958649,
        0.0862220972776413,
        0.03919864445924759,
        0.14883939921855927,
        -0.006044590845704079,
        0.02730897255241871,
        -0.0033651210833340883,
        -0.05175074562430382,
        0.024455590173602104,
        0.0023748953826725483,
        -0.007214785553514957,
        0.006332119461148977,
        0.05873052030801773,
        -0.0175778828561306,
        -0.02824227139353752,
        0.05643446743488312,
        0.006764666177332401,
        0.0008235808345489204,
        -0.07771360129117966,
        0.008142690174281597,
        -0.026315845549106598,
        0.045122645795345306,
        0.03324718773365021,
        -0.06371040642261505,
        0.021258849650621414,
        0.007283898536115885,
        0.07164634019136429,
        0.004586014896631241,
        0.03178432211279869,
        0.01501550618559122,
        -0.0904487743973732,
        0.037604279816150665,
        0.03835655003786087,
        0.028128497302532196,
        -0.0681096762418747,
        -0.0842079222202301,
        0.009384854696691036,
        0.04574546962976456,
        -0.036961447447538376,
        -0.053536634892225266,
        0.05221611261367798,
        -0.01349234115332365,
        0.04459328204393387,
        0.04694764316082001,
        0.0243817251175642,
        -0.036064792424440384,
        0.04435516148805618,
        0.01285641174763441,
        0.021179554983973503,
        -0.05259958282113075,
        0.021891195327043533,
        0.03730760142207146
    ]
}