{
    "id": "Gu6CLnfd_8s",
    "title": "The UltraWide Gaming Setup Battle!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2017-10-12T16:00:33Z",
    "video_url": "https://www.youtube.com/watch?v=Gu6CLnfd_8s",
    "category": "Science & Technology",
    "tags": [
        "gaming pc",
        "linustechtips",
        "linus tech tips",
        "challenge",
        "gaming",
        "pc",
        "pc gaming",
        "pc build",
        "gaming pc build",
        "gaming pc 2017",
        "tech",
        "austin evans",
        "lg",
        "ultrawide",
        "ultrawide festival"
    ],
    "views": 959834,
    "likes": 19968,
    "comments_count": 859,
    "description": "A $2000 gaming PC build challenge: Linus and I are at it again. LG 34UC89G monitor:  Huge shoutout to the UltraWide Festival!   Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "http://www.lg.com/us/monitors/lg-34UC89G-B-ultrawide-monitor",
        "http://www.ultrawidefestival.com",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin, and today we're here for the LG UltraWide Festival. Of course, big shoutout to LG for sponsoring this video. And you're mouthing what I'm saying the entire time aren't you? (laughing) - No. - [Austin] After hundreds of entries, Linus and I narrowed it down to three finalists: Taylor, Zach, and John. They each have a budget of $2,000 to build a gaming PC setup to go along with the LG 34UC89G UltraWide monitor, and the winner gets a $10,000 grand prize. What's the deal with the parts, right? So you went with the Mini ITX system. - [Taylor] I went with the Mini ITX system. This case is really beautiful. - [Austin] Actually, I've not built anything in the Manta. - [Taylor] I have not either, it's gonna be exciting. - [Austin] It looks nice. So you're also going, obviously, you've got the Z270I. You've got the Core I7, but you're able to fit a 1080ti in the $2,000 budget. - Yes. - [Austin] With that i7 7700K, paired with a GTX 1080ti, 16 gigs of RGB-fied RAM and a 250 gig SSD, Taylor's got a pretty well rounded small form factor build. Next, we're here with Zachary. Now you picked a very different style of computer. So what are you planning on doing with it? - Well I wanted to focus more on immersive game play. - Immersive gameplay? - Yes. - Okay, well you definitely went a lot higher end on the accessories. You spent probably what, like 150 bucks or so on accessories? - Yeah, 170. - 170. So you put in a decent-- - Well technically a little bit more than that. - Technically? What do you mean technically? - Well I bought something else. - What's the something else? - It's the secret weapon. - I don't think anyone's getting anything close to this, but I'm curious? Okay, so you have a B250 motherboard, but you have an unlocked Core i7. Is there some reasoning behind that? - Well there's a big reason for that. - Okay. - I'm just stupid. - Wrong motherboard aside, while Zach is rocking much better accessories to go with the ultra wide monitor, he's taking a serious hit with only a GTX 1080, as well as spending a big chunk of his budget on a 480 gig SSD. Next where here with John, and you actually picked out a little bit of a different system. So what's the main thing you wanna do with this? - I want to make 3D animation videos. - Okay. - Yes, and maybe a little bit of gaming. - Okay, gotcha, so it's a little bit more on the content creation side of things? - Yes. - Here, John's also got a i7 7700K paired with a GTX 1080ti, but he also stepped it up with matching RGB accessories, even including a headset. For $2000, you should be able to build a pretty solid gaming system, and at first glance everyone has solid parts, but part of the challenge is actually building them and tuning them in a single afternoon to work with that ultra wide monitor. Three. - One, two. - What?! It's three, two, one. We just said three, two, one. - Okay, so three, two, one, go? Or three, two, one? - Three, two, one, and then you go on go. - Okay. - Alright, everybody ready? - [Both] Three, two, one, start. - Oh my god! - So is the headband giving you the power to complete the build faster? (grunts) Is it that manly power that you don't even need to use your words to just brute force it? - I just thought it was cool. (laughing) - It does look cool. What? - Yeah, seriously. - Wait. Hold on, hold on. - It's really bad. - Whoa. That is crazy. Yeah, so you can see those pins are definitely bent there. Actually, there's a couple over here as well. What do you think? Cause I don't think there's any easy way of fixing this, at all. Do you have another? Look at this. That's totally fair. Like this is not your fault that you got a busted motherboard. Of course not. After about an hour or so of building, the system's are coming along nicely. Hey! Dude, good job. Alright, so you're actually the first person to get a system up and running. LOL, you suck. - Okay, try again. (laughing) - Alright, pair it up. - Alright, well one fan's not spinning. Graphics card looks like it's... - Whaap whaap. - Because he actually had to sway out the motherboard, it's probably not POSTing, because there's a Kaby Lake CPU in here and it's really looking for Skylake. So, if we have a BIOS update that will probably fix it, but it's going to set you back. This is kind of a tough one. Alright, so your system is done. Do you have anything else to do, besides overclocking right now? - No. Put it on the glass. That's about it. - Well it POSTs, so that's a big improvement over Taylor's machine. - Besides the secret weapon, which I'm sure will be 100% figured out by the time that we're actually ready, you have everything installed? - Yes. - Okay, so now it's going to basically come down to, since you can't overclock the CPU, you're gonna try to get as much as you can outta the 1080. - Yep. - Alright, so everyone's basically buttoning up their systems now. It looks like you're just doing the final bit of cable management? - No I gotta get this RAM reseated that wasn't seated properly. - So you're actually only at eight gigs of RAM that's showing up right now? - Yes. - Okay, got it. So you feel, like it's just going to need to be reseated? - Yeah. - Alright, so we are almost done. Everyone has their systems setup, and now it's just the final stuff, like making sure all the benchmarks are setup, doing the overclocking, tweaking all the last minute little lighting stuff, cables, all that kinda thing. The first test is gonna be Cinebench. - Cinebench! Now they all have the same CPU. - Yes. But overclocking is going to be very different. - Or. - Or is it? - Nonexistant. Gentlemen, start your, yeah okay. - Let's just do three, two, one. - Yeah, three, two, one, two. - [Man] When are you going? Go? - Okay, go, go. Just go. - Start. - Go. Everyone go. - [Austin] So you're at five Gigahertz. - [Linus] Five gigahertz overclock on that little Cryorig cooler, very nice. - [Austin] That's really impressive. So the next test is going to be 3DMark, which is going to be testing their GPU performance. So, are you guys ready? Alright, three, two, one, start. - [Linus] Alright so we've got our Time Spy benchmarks, basically John's card is a little more overclocked and/or margin of error of the test, but he takes this one by a hair. So for Ghost Recon, we're running at the native resolution of these monitors; that's 2560x1080 and we're using the ultra preset, because we figure for two grand you should be having a pretty, ultra gaming experience. Now one of the things that we're gonna be looking for is not just being able to run the game, but being able to run it at a frame rate where you're gonna be taking advantage of these high refresh rate monitors. - [Austin] 65.7, 65.9, and 53.4. - [Linus] Okay. - [Austin] You guys basically tied. With benchmark results in hand, Linus and I stepped away to discuss what we though about the competition so far. I feel like right now, Zack is kinda not looking so great. I feel like he's got the wrong motherboard. There are some fairly major issues. I'm not a huge fan of the idea that he spent so much on the SSD, and with some of the other stuff where he skimped on things like the 1080 as opposed to a 1080ti. - Him having the worst graphics card out of everyone for a gaming setup, is... - It's a problem. - Pretty tough. - And the motherboard, that's a huge problem, cause he got a very expensive motherboard, but it's still not overclocking compatible. I think it looks nice. The complete system's going to look solid, but that's a big, big problem, which I guess brings us to Taylor. So Taylor had a huge disadvantage in the fact that he got a broken motherboard out of the box. So we're not gonna dock him points for that, I mean, I'm not. I think I like his build. I like the idea he's going small form factor. I think it's going to match pretty well with the monitor. - Well he had a rationale behind everything. He's like, \"Yeah I chose like a case with curved side panels to match the curved monitor\". \"And I chose a black and red case to match the monitor.\" And it feels a little kiss ass to me. - I mean the rules were that you had to get a system to go along with the setup. I don't think we can penalize him for trying to make something inside the rules. What do you think about John so far? - John? Everything's going smoothly over there. I don't disagree with any of his hardware choices. I think his is, in a vacuum, the best balanced machine on the table. - I tentatively agree with that. - So third place is... Zachary. You fought hard. The scores were super close actually. - It was actually, we basically agreed on almost everything. - Yep, but I think.. - The performance hurt. - The performance hurt you. The good news is that you come out of this with a wicked awesome gaming rig. - Absolutely. - And hopefully you had fun today. - I did. - I think before we announce the winner, we agreed on basically every category. I think we were pretty much on the same page. You guys all did really well. - It was way close. John you took it home. - Wonderful. - And Taylor, you fought hard and you were a lot of fun to hang out with today. You were okay too. - Alright, and of course, the best piece. - Austin you get to do the check. Do the check, Austin. - Oh the check. This is, this is what it feels like. - I mean it's not a check. Doesn't even really look like a check. - You actually can't go cash this. - You can't cash that. - We're gonna try anyways. - [Man] They're gonna laugh you outta the bank. - Is this 21x9? - So of course, huge shout out to LG for sponsoring the video, and inviting us out to sort of host the Ultra Wide Festival. And let us know what you guys think about the whole thing. Actually would like to do more. And you're gonna just keep doing that, aren't you? You know, I'm glad the video's over. I can finally go home.",
    "transcript_keywords": [
        "Mini ITX system",
        "Alright",
        "system",
        "John",
        "Taylor",
        "Mini ITX",
        "motherboard",
        "Yeah",
        "ITX system",
        "monitor",
        "big",
        "gaming",
        "pretty",
        "basically",
        "ultra wide monitor",
        "ultra",
        "bit",
        "build",
        "ultra wide",
        "check"
    ],
    "transcript_entity_values": [
        "Cryorig",
        "third",
        "three",
        "Ghost Recon",
        "Skylake",
        "2,000",
        "Three",
        "1080",
        "first",
        "RAM",
        "2000",
        "Core",
        "eight",
        "250",
        "Austin",
        "five Gigahertz",
        "RGB",
        "a single afternoon",
        "the Ultra Wide Festival",
        "two",
        "Five gigahertz",
        "170",
        "LG",
        "100%",
        "53.4",
        "65.9",
        "G UltraWide",
        "Austin",
        "480",
        "7700K",
        "one",
        "Zach",
        "John",
        "Zachary",
        "Zack",
        "GTX",
        "150 bucks",
        "about an hour",
        "16",
        "CPU",
        "B250",
        "SSD",
        "Manta",
        "Mini ITX",
        "Linus",
        "Cinebench",
        "Taylor",
        "hundreds",
        "21x9",
        "GPU",
        "today",
        "10,000",
        "Time Spy",
        "Linus"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "TIME",
        "LAW",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "WORK_OF_ART"
    ],
    "vector": [
        0.007216497324407101,
        0.008203311823308468,
        0.049325890839099884,
        -0.10668123513460159,
        0.05083102732896805,
        -0.022928887978196144,
        0.029168806970119476,
        0.0568043515086174,
        -0.07497246563434601,
        0.04516296833753586,
        -0.037823427468538284,
        -0.013200612738728523,
        0.05801590532064438,
        -0.0008212215034291148,
        -0.023394085466861725,
        -0.022297512739896774,
        0.08119498938322067,
        -0.11980743706226349,
        0.002354805124923587,
        0.030469434335827827,
        0.015150293707847595,
        -0.07918044179677963,
        -0.08382344245910645,
        -0.050599973648786545,
        0.03630214184522629,
        0.07938897609710693,
        -0.016196835786104202,
        -0.01725374348461628,
        -0.0054945675656199455,
        -0.050171587616205215,
        0.021256141364574432,
        0.0764542892575264,
        0.0020910813473165035,
        -0.027858085930347443,
        -0.026036953553557396,
        -0.03302895650267601,
        0.03644175827503204,
        -0.10314808785915375,
        -0.08480367809534073,
        -0.12311552464962006,
        -0.05364955961704254,
        0.0074769798666238785,
        0.03407244384288788,
        0.08085539191961288,
        -0.01996457949280739,
        -0.028015010058879852,
        0.01095358282327652,
        -0.08893582969903946,
        0.005429779179394245,
        -0.021934011951088905,
        -0.0007998902583494782,
        -0.08844276517629623,
        0.08938651531934738,
        -0.05748027190566063,
        -0.07696746289730072,
        0.05031828582286835,
        -0.03027918189764023,
        -0.04601072892546654,
        0.03449147567152977,
        -0.0205847080796957,
        0.026607679203152657,
        -0.07514391839504242,
        -0.01729309931397438,
        0.09214738011360168,
        0.011614806950092316,
        -0.025662515312433243,
        -0.028378896415233612,
        -0.054504625499248505,
        -0.044607460498809814,
        0.026312828063964844,
        0.06589352339506149,
        -0.024197600781917572,
        0.004701399710029364,
        0.046461302787065506,
        0.09533646702766418,
        0.06929090619087219,
        0.05327469855546951,
        -0.06333654373884201,
        0.07001014798879623,
        0.05289475992321968,
        0.029967710375785828,
        -0.02161691151559353,
        -0.047937389463186264,
        -0.024238741025328636,
        -0.0035674560349434614,
        0.0006068946095183492,
        0.013166447170078754,
        0.018663212656974792,
        0.04409029707312584,
        -0.11347480863332748,
        0.02883237972855568,
        0.043581292033195496,
        0.016570214182138443,
        0.06130611523985863,
        0.018112393096089363,
        -0.0013124760007485747,
        0.027693303301930428,
        -0.007959333248436451,
        -0.037461843341588974,
        0.08269720524549484,
        0.042537786066532135,
        0.05135096237063408,
        0.1254940927028656,
        0.023964617401361465,
        0.018757803365588188,
        -0.05104302242398262,
        -0.030893320217728615,
        0.02552184648811817,
        -0.02739478461444378,
        -0.06064334884285927,
        -0.036304425448179245,
        0.02047833427786827,
        -0.0003924223128706217,
        0.04200390353798866,
        -0.041925981640815735,
        -0.02436365745961666,
        -0.021129809319972992,
        0.03371955454349518,
        0.0838092789053917,
        -0.011080811731517315,
        0.032716721296310425,
        -0.029067428782582283,
        -0.028774110600352287,
        0.07834991067647934,
        0.06076432764530182,
        0.06372757256031036,
        -0.10940048098564148,
        2.7365150328707837e-33,
        -0.022429078817367554,
        0.10564067959785461,
        -0.030488625168800354,
        0.0069832587614655495,
        -0.015400337986648083,
        0.011083529330790043,
        0.058997172862291336,
        0.06005784496665001,
        -0.045020464807748795,
        0.08523348718881607,
        -0.06136954575777054,
        0.0758865475654602,
        -0.03365129977464676,
        0.04944457858800888,
        0.16270412504673004,
        -0.07360494881868362,
        -0.031050151214003563,
        -0.011007148772478104,
        -0.025232169777154922,
        -0.01212485134601593,
        0.04084739834070206,
        0.0355108417570591,
        0.06059572845697403,
        -0.058031413704156876,
        0.0318046472966671,
        0.009218729101121426,
        0.05576898157596588,
        -0.015309718437492847,
        0.042986638844013214,
        0.013535702601075172,
        -0.1082935482263565,
        -0.10585515201091766,
        0.05746222287416458,
        0.04327719286084175,
        0.040086496621370316,
        -0.012265145778656006,
        0.0348951630294323,
        -0.12611301243305206,
        0.014356444589793682,
        0.04557165503501892,
        -0.07113751024007797,
        0.06476301699876785,
        -0.05598070099949837,
        -0.0563097782433033,
        -0.07199030369520187,
        0.044203020632267,
        0.03532131388783455,
        0.03010028414428234,
        0.0057494621723890305,
        -0.0405099056661129,
        -0.041376639157533646,
        0.015743132680654526,
        -0.029982388019561768,
        -0.04453582689166069,
        -0.007674968335777521,
        0.0010850053513422608,
        0.021944306790828705,
        -0.029088985174894333,
        0.05806555598974228,
        0.06518447399139404,
        -0.00868138950318098,
        -0.013949180953204632,
        0.04245603457093239,
        0.09381548315286636,
        -0.06743552535772324,
        0.04627213999629021,
        0.09284412860870361,
        -0.001966926036402583,
        -0.015451633371412754,
        -0.021636327728629112,
        -0.06133754178881645,
        -0.062427159398794174,
        0.10666840523481369,
        -0.08694751560688019,
        0.12611453235149384,
        0.00856799352914095,
        -0.038575705140829086,
        0.014903491362929344,
        -0.02822643518447876,
        -0.06833427399396896,
        -0.025879641994833946,
        0.037240684032440186,
        -0.03287242725491524,
        0.022102506831288338,
        0.00583674618974328,
        -0.024624254554510117,
        -0.010923843830823898,
        0.01387059036642313,
        -0.016871221363544464,
        0.0015966292703524232,
        -0.031009934842586517,
        -0.04510809853672981,
        0.03015093319118023,
        0.009950155392289162,
        0.020636912435293198,
        -2.929527531855957e-33,
        -0.05110994353890419,
        -0.07327014952898026,
        0.01998898759484291,
        -0.01950213313102722,
        0.13888996839523315,
        -0.03947416692972183,
        0.04412263259291649,
        -0.06442893296480179,
        0.062413934618234634,
        0.015557140111923218,
        0.07134819030761719,
        0.04801919311285019,
        0.005419757217168808,
        -0.05414154753088951,
        -0.014702209271490574,
        -0.03158312663435936,
        0.0642513707280159,
        -0.07518873363733292,
        0.01021218579262495,
        -0.044080547988414764,
        0.11545183509588242,
        0.03961002826690674,
        -0.06845466792583466,
        -0.044097352772951126,
        0.028816428035497665,
        0.02422468550503254,
        0.020467454567551613,
        0.006297512445598841,
        0.025793464854359627,
        0.06615385413169861,
        0.004219985567033291,
        -0.0483134426176548,
        -0.02948218770325184,
        0.04554076865315437,
        0.07453589141368866,
        0.010278156027197838,
        0.022360440343618393,
        0.03729328513145447,
        0.03987395018339157,
        -0.03146054968237877,
        -0.010232294909656048,
        0.010691439732909203,
        -0.005650983192026615,
        0.04132569581270218,
        0.07026784121990204,
        0.012374029494822025,
        -0.04907926172018051,
        -0.09678146988153458,
        0.026815373450517654,
        -0.0022840923629701138,
        -0.050930455327034,
        -0.03436120226979256,
        -0.019276458770036697,
        -0.01102390605956316,
        -0.07377193123102188,
        -0.03942663222551346,
        0.002103741280734539,
        0.04613413289189339,
        0.002838066080585122,
        0.014624309726059437,
        0.01443425752222538,
        -0.02468276582658291,
        -0.010029811412096024,
        0.016145553439855576,
        -0.038466669619083405,
        0.02506447769701481,
        -0.003289237152785063,
        -0.024802790954709053,
        -0.045581426471471786,
        0.007027456071227789,
        -0.09410392493009567,
        -0.0019950564019382,
        -0.07388614118099213,
        -0.0467761754989624,
        -0.06040012836456299,
        0.1322464793920517,
        -0.005546315107494593,
        0.008351076394319534,
        0.0686858519911766,
        -0.06517904251813889,
        -0.00030223908834159374,
        0.013502543792128563,
        0.0798199400305748,
        -0.012032144702970982,
        0.11938058584928513,
        -0.027236854657530785,
        -0.007556711323559284,
        0.06986720860004425,
        -0.010418425314128399,
        -0.04362133517861366,
        0.004222845658659935,
        0.029204024001955986,
        0.014641179703176022,
        -0.052687015384435654,
        0.027612896636128426,
        -5.6525344405145006e-08,
        -0.01154232770204544,
        0.01194875780493021,
        -0.08028070628643036,
        -0.023291489109396935,
        -0.010822732001543045,
        -0.06239347159862518,
        0.02987585961818695,
        0.007680151611566544,
        0.05983683839440346,
        0.014648345299065113,
        0.06523124873638153,
        -0.10307855159044266,
        -0.02868601493537426,
        -0.024888942018151283,
        0.03446875140070915,
        0.044251102954149246,
        -0.060463741421699524,
        0.02679583802819252,
        -0.05924736708402634,
        0.0069899652153253555,
        -0.019466694444417953,
        0.020836399868130684,
        0.024952532723546028,
        -0.04029640927910805,
        -0.009426338598132133,
        0.016224272549152374,
        -0.025189470499753952,
        0.05173446238040924,
        0.04595121741294861,
        -0.0011510953772813082,
        -0.039970215409994125,
        0.00930204801261425,
        -0.07439017295837402,
        -0.024781102314591408,
        0.035689208656549454,
        -0.0664476826786995,
        -0.02918197587132454,
        0.10280241817235947,
        0.12144475430250168,
        0.008357635699212551,
        -0.0491936095058918,
        -0.06099943816661835,
        -0.06726382672786713,
        0.020774798467755318,
        0.0377977229654789,
        0.02381700463593006,
        -0.12347740679979324,
        -0.07564135640859604,
        0.04593431577086449,
        0.00646699033677578,
        0.00262857205234468,
        -0.03884626924991608,
        -0.06137445941567421,
        -0.022836698219180107,
        0.08607462793588638,
        -0.06231662631034851,
        -0.005481049418449402,
        0.05256104841828346,
        -0.025373969227075577,
        0.03255493938922882,
        0.01577017270028591,
        -0.07067026197910309,
        -0.02922709845006466,
        0.06013250723481178
    ]
}