{
    "id": "GuoFW2yAD7g",
    "title": "Automatic Record Changers: We used to like them",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2019-06-02T13:24:50Z",
    "video_url": "https://www.youtube.com/watch?v=GuoFW2yAD7g",
    "category": "Science & Technology",
    "tags": [
        "record player",
        "changer",
        "technology connections",
        "BSR",
        "glenburn",
        "dual",
        "record changer",
        "disc changer",
        "turntable",
        "hi-fi",
        "hifi"
    ],
    "views": 1061535,
    "likes": 35942,
    "comments_count": 3557,
    "description": "You can support this channel on Patreon! Link below     Hmm. What were these things? Why were some record sets made to work with them? When did we decide we hated them? Was that the right call? Will I ask another question? These are the things youll learn in this video, where we explore the humble record changer. Seriously. They didnt suck!  If youd like a more complete look at the Victor VE 10-50, you should take a look at these videos. Note that in the last link, the model shown is the premium 10-70 which included an electronic amplifier! Ooohh! The other two were Orthophonic Victrolas, which used an acoustic reproducer and a folded horn to achieve their surprisingly good fidelity.     Also, this site gives great info about Victrolas, and you should check them out!     How about some more links? Ive got plenty!  Technology Connections on Twitter:   The TC Subreddit   Technology Connections 2 (the channel where I sometimes talk about stuff and generally dont prepare for anything):   You can support this channel on Patreon! It has been amazing what Patreon has done for this channel, but also for me (your dorky host) personally. Through the support of people just like you, Technology Connections has become my job and I am so excited and thankful for it! If youd like to join the fine folks in a pledge to help the channel grow, please check out my Patreon page. Thank you for your consideration!    And thank you to the following patrons! Trey Harris, Peter Pfundstein, Wilhelm Screamer, Mat Stu, Charlycobra, Thomas Kolanus, William Kisley, Daniel Johnson, Potch, Reemt Rhmkorf, Jack Nichol, Robin Rattay, Bruce Justyn, Rae McIntosh, Justin D, Adam Zawisza, LordJakson, Triancia, Max Barnash, Microfrost, MrSonicOSG, Sinirlan, rusty shakelford, Mitch Schenk, Juan Olivares, Andrei Alexandru Bleortu, Mike Bird, Emmett Ray, Michael Shaffer, Steve Trambert, Sputnik, Jason Spriggs, Danny S., Gregory Kumpula, Chris Zaremba, Tom Burns, Daniel Pf, Yung Kim, John W Campbell, Matthew Jones, Slappy826, Steven Ingles, Robert Howcroft, Troy King, Some Random, Peter Sarossy, Leigh Beattie, Tracy Cogsdill, Matt Allaire, Dave Mausner, Guy, John Hickey, Benjamin Gott, Luke, Rayne Luna, Zach Le, Fredrik strem, Greg Hodgdon, Anil Dash, Michael Wileczka, Chris Wolf, John Ehler, William Matthews, Fred Leckie, Julian Zielke, John Rogers, Kenneth Morenz, Andy, Greg Stearns, Zack, Robert L LaBelle, Chris Satterfield (Compgeke), Brian Johnson, Cameron Benton, Samuli Suomi, Keith McCready, Jeffrey Glover, John Marshall, Hsin-Kuei Chen, HenryD, Damian, David Anez, Josiah Keller, M T Bono, Conall  Maiti, Struan Clark, Keeb, Tarrien, DrMoebyus, Biking With Panda, Chris Larsen, JH, Michael Romero, Jonathon Mah, Jonathan Polirer, Derek Nickel, Marc Versailles, Ian Pirner, Mark Stone, Arthur Zalevsky, John Fruetel, Jonathan Mayfield, Adam Veneziano, Christopher Swenson, Andrew Diamond, Cole Campbell, Christopher Beattie, Paul Bryan, Samuel Kirzner, Gus Polly, a ray, Daniel Pritchard, Brandon Tomlinson, Eric Loewenthal, Sebastian Stenner, Jeremy Samuels, Malcolm Miles, Matthew Lloyd, David L Jones, Matthew Burket, Mike Burns, Andrew Roland, Luke Whiting, John Cockerill, Smith8154, David Groover, Michael Wehner, Kyle Creasey, Rainbow Warrior, jacob kamphaus, Alex Hurley, Andrew Bobulsky, Matthew R, Richard Sams, Andy Kettu, On Ice Perspectives, Brian Wright, TheGreatCO, Marcus, Ethan R, Petteri Hjort, Daniel DeLage, Nathan Obuchowski, Sam Tran, Shaun Puzon, Bret Holmes, Vlycop, Alexandra Stanovska, Tom Ebenhoe, Casey Blackburn, Matthew Jensen, Devon Hodgson, Paul Macejewski, Case Tu'ikolovatu, Zimpan, Loc Esch, Filmmaker IQ, Greg H, Lin Le, Ryan Blair, Jan Houben, Bren Ehnebuske, T.J. Zientek, AdamPlays, Vernon, Ton Brands, Scott Wright, Jason Ashcroft, Kory Howard, William Lahti, Thanasis Dimas, Marc Grondin, Lisa, Hex, Mark Stradling, Gareth Lucas, Anton Mironov, Robert West, Peter Sodke, joseph, Kristian Scheibe, Jacob, McLargehuge 510, Andrew, Nick, Ruxnor, Greg Tan, The Masterpiece, Sean, Chris Cody, Chad Fertig, Daniel Delaney, Greg Lindsey, Joseph Houghtaling, Ben Tucci, Seph P, Dave Stares, Josh Braun, Lachy Bell, Joe Johnson, Daniel Dugger, Nathan Back, Christopher Lowell, Oleg, PC Perspective, Howard Longden",
    "description_links": [
        "https://www.youtube.com/watch?v=QclRCJ4nwTU",
        "https://www.youtube.com/watch?v=MciuIUW0DGg",
        "https://www.youtube.com/watch?v=QHuX24TUZ80",
        "http://www.victor-victrola.com/10-50.htm",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Have you ever run across a set of records where something seems a little off? Take a look at these. This album is across three discs. Heres disc one, side one. And on the back is side six. The fu--? Side two is on the next disc? Alright then I suppose we should find side five on the back of this one and... yeah. Sure enough, we do. Only this last disc has any semblance of normalcy. It seems like it ought to be disc two, seeing that it has sides 3 and 4, but no! This is disc three. Did they just suck at numbers in the 60s? Well a few people did, Im sure, but in fact this apparently bizarre numbering scheme is quite logical. You see, this record set was designed specifically to be used in an automatic record changer. Arranging the sides like this was often called automatic sequencing. Now, as someone who lived until the age of 13 or 14 before ever using any sort of record player, the idea of a record changer seemed laughable. See, I had grown up with one of these things (those shiny things are called compact discs, they held music on them, and this is a compact disc changer, its pretty neat I did some videos on these things, oh look a card) so when I heard of record changers I envisioned some really giant version of this. But in fact record changers were nothing more than an ordinary looking phonograph save for two modifications; an extraordinarily long and funky spindle, and a weird floating arm thing. These things are certainly not rare by any means, in fact they were pretty standard fare in homes from the 1940s through to the 1970s. They eventually fell out of favor, and Audiophiles HATE them! but in this video Id like to pay tribute to the cleverness that is the automatic record changer. Lets start with a field trip to the 1920s. By this point we had already decided that cylinders were the Betamax of sound formats and were all in on disc. Only trouble was that the 78 RPM records of the day could only hold between 3 and 5 minutes of music per side. So, having just settled in listening to your favorite set of tunes, youd quickly have to get back up and do some good ol fashioned disc jockeying. Well thats no good, is it? So, we humans, ever looking for problems to solve, set to work on enabling a more leisurely experience. If this website I found is to be believed, the first record changer with a design similar to this was invented by Eric Waterworth of Hobart, Australia in 1925. However, his invention never made it to market, likely due to difficulties in getting records to play upside down. The first record changer to really find a groove was the Automatic Orthophonic Victrola, by our friends at the Victor company. This design, from 1927, used a rather precarious looking arrangement of stacked records held at an angle. A weird hoop thing would rise up, grab a disc from the stack, place it gently on the turntable, then it would be played once. And then the hoop thing would pick it back up and not-so-gently drop it down a padded chute. I mean, it worked. But yikes! To give you an idea how desperate we were for automated record playing, the Victor VE 10-50, the first and most basic model with the automatic changer, retailed for $600, which is worth about $9,000 in 2019 money. And if you think nobody bought them, youd be wrong, as an estimated 12,000 of these things were produced in 1927 alone. We wanted automation and we wanted it yesterday. But lets fast forward a few decades. Throughout the 1930s, 40s, and 50s, record changer development continued at a breakneck pace. Plenty of clever innovations made their way into the hands of consumers, as well as plenty of duds, but by the 1960s (and especially into the 70s) we had pretty much settled on this design. This Glenburn changer is one of many, many copies of the infamous BSR changer. If you bought any sort of stereo in the late sixties to mid 70s, odds are it had something really similar to this in it. I have heard both that Glenburns were considered cheap knockoffs and that theyre better than your average BSR, so take that as you will. So. How does one use this clever contraption? Lets compare this rather standard turntable from Sony with our miraculous Glenburn. The Sony is a no-surprises affair. You put the record on the turntable, and you put the stylus on the disc. Thats about it. But this record player.... Theres, theres more to consider! Theres this thing. And look at all these selector levers! I dont know, Winnifred, this looks pretty complicated! [in a 1960s instructional demo voice] Have no fear, as with a little knowledge and training, youll find a record-listening experience thats automatic beyond belief! First, lift the record stabilizer arm out of the way. Next, be sure to select the appropriate diameter of the disc youll be playing. This standard LP is a 12 inch disc, so well set it to 12. Then, double check the speed setting. 33 and a third and how! Now that we have all the settings dialed in, we can place our record on the spindle. Uh-oh! Its all wonky! Not to worry! Reposition the record stabilizer, and well be just one step away. With our record sitting neat and pretty, simply switch on the turntable by moving the selector from Stop to Start, and then to Auto. It will spring back to the Start position, but dont worry! Automatic operation is underway! Now your record automatically drops into place, and the tone arm travels to the outer edge to play it. Beautiful! When your record is over, the record player automatically returns the tone arm to the resting position, and even turns itself off! Plus, it secures the tone arm in place. What marvels we enjoy today! But wait. Thats just a real Rube Goldbergian way to play a record automatically. What was the point of holding them up in the air like that? Im glad you asked! The notched spindle prevents the disc from falling until this actuator moves to the left. This action both decreases the effective diameter of the spindle, allowing the disc to fall, and it also pushes the disc past the lip it was resting on. But - and heres the real kicker - thanks to this second piece, we can place another disc on top! When the bottom record is pushed off the ledge, the very piece that does the pushing prevents the disc above it from falling, too! The result is a machine that will play a stack of discs automatically one-at-a-time! But last time the record player stopped when it was done playing. Whats to keep it from doing that again? Why, the record stabilizer, of course! Notice how it rests higher-than-usual when braced against a record. This tells the record player that theres another disc to play! After the last disc has fallen, the lever drops down, and now it knows its time to stop after this disc is done. Its just like magic! Well its not really like magic. Ha ha, it sure is! The recor-- No. Stop it. Were done with that. This is actually one of the most basic designs of record changer, as they really peaked in performance in the late 1950s and early 60s. After that, many of their more advanced features dwindled away. For instance, many record changers could automatically determine the diameter of the discs, negating the need for this selector. Some did this by using the tonearm to deliberately bump into the edge of the disc it was about to play to determine its size. Other methods were used, too, though a common theme with those machines was that mixed sizes of discs, if they were supported at all, had to be stacked largest to smallest. Not always, but usually. Can you see now why this record set has the sides in such a strange order? With this record player, its not weird at all! If you stack the three discs like this, with side one on the bottom, 2 in the middle, and three on the top, then it will play each of those sides in that order. Then, flipping the entire stack over plays the opposite sides in reverse sequence, so it will play side 4, then 5, and finally 6. Automatic sequencing of records goes back pretty much as far as record changers have been available. These rather delightful Looney Tunes childrens sets are auto-sequenced, and, uh, theyre from 1948. But certainly not everything was, awkward pause as I reach for another set of records, these selections from Gilbert and Sullivans H.M.S. Pinafore are sequenced as normal. By the way, these things - theyre called record albums. Theyre like photo albums, but they hold records. Before the advent of long-play records, a group of songs was sold in one of these record albums. And thats where the name comes from. Fun fact. The most clever thing about these machines, at least from my perspective, is that their automatic functions are achieved using the same motor that spins the turntable. This record changer, along with the vast majority of others, is entirely mechanical. The tone arms movement, along with the dropping of the next record, are driven off the turntable itself. In fact, with the record player unplugged, we can make it go through its automatic routines by simply turning it by hand. Thanks to the miracle of precarious rigging, we can watch what the mechanism does as it changes a disc. Its all just a bunch of cam drives, pushing on this and pulling on that. This piece here is attached to the tone arm, and you can see how changing the size selector changes where the tone arm will stop. Its really a fascinating bit of engineering cleverness. The designers were aware that any sort of drag on the turntable is likely to introduce some wow and flutter, so the mechanism is effectively disengaged from the turntable unless some sort of automatic function is being performed. Of course its kind of impossible to convey this over video, but I can definitely feel that its difficult to spin the turntable as it does its rigamorol, but as soon as the tone arm settles to where it would be playing a disc, the mechanism diesengages and it becomes much easier to rotate. In fact, there's so little drag on the turntable, pretty much just the friction of the motor and idler wheel, that it takes a fair while to come to a stop. But, as soon as the tone arm makes it to the center, it re-engages the mechanism, and now the turntable no longer spins freely. Actually, I suppose I can convey this over video. Here. Its spinning nice and fine but as soon as it starts moving the tone arm it quickly comes to a stop without the help of either my hand or the motor to keep it along. Of course one of the downsides of this approach is that the speed of the changing is impacted by the RPM of the records youre playing (in nearly all of these turntables). The movement is fairly graceful with long play records, but introduce some 78s like those Looney Tunes ones we saw earlier into the mix and it gets real herky jerky. These discs, by the way, are 10 inch discs so Ive put the selector into the 10 position. And of course, if you happen to have a set of spoken-word or other records that play at the rather uncommon 16 and RPM speed, the once-graceful movement becomes annoyingly slow. Finally. And now lets talk about why Audiophiles HATE them! First, lets address the simple truth that some audiophiles apparently are incapable of appreciating. Most humans will happily make sacrifices to quality for convenience. I feel that needs repeating with greater emphasis. Most humans will *quite* happily make sacrifices to quality if the experience is more convenient. If you value quality over all else, that is fine. We salute you in your pursuit of perfection. But do not judge your fellow humans for tastes that be different to yours, and do not try to convince us that our standards are too low. Also--what is convenient is in the eye of the beholder. That deserves consideration, too. Alright, now that Ive checked that off my list, lets start with the more tenuous concerns regarding record changers. Notice that as more records get stacked, the angle of the tone-arm changes. This makes the angle at which the stylus sits in the groove not-quite optimal, which may impact the quality of the sound coming from the cartridge. Blasphemy! Lets see how bad it really is, though. Heres what a record sounds like being played resting directly on the turntable. [Music plays] Alright, and now stacked on top of 5 other records. [Music plays again, with no appreciable change in quality. Even in person before the digitizing and compression that I and then YouTube did to it these sounded identical. Seriously, I think I have pretty good ears, and these two recordings in their uncompressed nature are indistinguishable in person through some pretty great headphones. But obviously my ears are just not good enough to enjoy music correctly] [Wow I didn't know you could fit that much in one caption] Ill even switch back and forth repeatedly. Spot the difference! [A different track plays, with the recording switching back and forth at random. Its completely unnoticeable. But then again, Im no audiophile (I just play one on TV)] Did you see that ludicrous display last night? Yeah, I cant hear it either. OK, then the other, slightly more legitimate concern is that the act of stacking discs is just plain bad for them! I mean, you dont want to just go around touching the surface of a vinyl record. Surely letting them rub together when the stationary disc falls on the rotating one will result in a disaster! Well, not really. I mean, think about this for a second. The sound recording on a record isnt ON the surface of the disc. Its below the surface, between the grooves. Sure, in theory, a big piece of dust or other debris might cause cause some sort of a scratch during the brief period of acceleration from stopped to moving, but generally discs rubbing against each other proved to be pretty harmless. Again, the only parts that touch, under normal circumstances anyway, are the tops of the groove walls which... dont actually contain any of the sound. The one bit of damage that was known to occur (and quite frequently, mind you) was a bit of chewing up on the label right around the hole, especially for the discs on the bottom of a tall stack. You might potentially have the weight of 4 or 5 vinyl--or even shellac--records resting on just this little shelf, and when the disc gets pushed off of it, that might do some nasty things to the label. But I mean, when you imagine a record as a delivery medium for the days popular music, and not a fragile collectors item to be protected, who cares? No seriously, now youd shout bloody murder over the wearing down of the center hole, but back when this was popular not so much. Nevertheless, the general public did eventually grow to view these as less-than-ideal for the preservation of their discs. It took a great long while, though, as remember until the 1970s a record changer was more-or-less the norm. I think a few things contributed to their demise. First was the fact that the truly elegant designs of the 50s and 60s were standardized into these cheaper, ineloquent hunks of OK I guess. By the 1970s, record changers had become pretty mediocre. Sure, they worked fine, and honestly this one sounds very nice (aside from the fact that it runs ever-so-slightly too fast which infuriates me) But by the 1970s, changers just werent very good record players. And very good record players, almost without exception, werent changers. Additionally, the market was moving away from monstrous console systems which these would fit nicely into, to more compact bookshelf and component systems, meaning that the extra height and bulk of the changer suddenly became a disadvantage. And lastly, and Ill admit this is just me musing about human tendencies, I think they just went out of style. Ya gotta admit this Sony unit is a whole lot sleeker looking than its Glenburn counterpart. Yeah, its quite a bit newer, but without a tall spindle and the extra depth required for the mechanism, it could save quite a bit of space in the Z dimension. But regardless of who or what killed the changer, I hope we can appreciate its cleverness for a little while longer. I especially like the automatic sequencing, in my eyes its almost like a hack. And, one other thing I didnt mention about that--even on a manual turntable, assuming youre willing to stack your records, its arguably more convenient. Play side one, then put two on top of it, then three on top of that. Flip the top record over to play four, flip the top two to play 5, and flip the whole stack to play six. I suppose though if youre unwilling to let the vinyl get a little cozy with its partners, then yeah its a pain in the ass. Oh, and although we shunned the idea of stacking, turntable automation didnt die out completely. Fancier turntables could start a record automatically with the press of a button. And while thats a little advanced for this guy, hes still happy to return the tone arm for you and shut off. And of course, it also uses the movement of the turntable to provide movement of the tonearm. Thanks for watching, and I hope you enjoyed this video. Now comes the time where I thank the fine folks who support the channel on Patreon, with a special thanks going to the people scrolling down your screen. Your support has really been a life changer, and its making sure theres always another video waiting to drop. If youd like to join these people in supporting the channel, check out my Patreon page. Thanks for your consideration, and Ill see you next time! sequentially smooth jazz That was real! YES!!! Ha ha ha! On the word Drop! No video fakery this time, ha ha! I promise, that was actually real! Im so.. Yeah if you cant tell by the smile on my face uh. YES!! Lets compare this rather standard turntable I used the hand motion wrong Other methods, other ugh that was a really good take and then we screwed it up. Then it will play each of those di - [stares intensely at the camera] Should have thought that through, Jared. Thats right, Clover. Youre just coming up with names on the spot! No Im not! Yes you are! Yes I am.",
    "transcript_keywords": [
        "record",
        "record changer",
        "disc",
        "records",
        "automatic record changer",
        "record player",
        "changer",
        "discs",
        "turntable",
        "play",
        "tone arm",
        "automatic",
        "automatic record",
        "record automatically",
        "changers",
        "arm",
        "fact record changers",
        "side",
        "record set",
        "good record players"
    ],
    "transcript_entity_values": [
        "the late 1950s",
        "Clover",
        "Jared",
        "1948",
        "spring",
        "12 inch",
        "two",
        "Drop",
        "3",
        "10 inch",
        "Rube Goldbergian",
        "six",
        "2",
        "the late sixties",
        "14",
        "Auto",
        "mid 70s",
        "four",
        "one",
        "5",
        "days",
        "Glenburn",
        "Sullivans H.M.S.",
        "13",
        "the 1920s",
        "Sony",
        "78",
        "about $9,000",
        "Betamax",
        "50s",
        "first",
        "4",
        "16",
        "the 60s",
        "5 minutes",
        "600",
        "three",
        "an estimated 12,000",
        "Winnifred",
        "Stop to Start",
        "Patreon",
        "1927",
        "today",
        "YouTube",
        "Victor VE 10-50",
        "a few decades",
        "BSR",
        "60s",
        "10",
        "between 3",
        "1960s",
        "the 1940s through to the 1970s",
        "Gilbert",
        "the 1930s",
        "2019",
        "Glenburn",
        "33 and a third",
        "1925",
        "the age of",
        "early 60s",
        "6",
        "the 1970s",
        "Looney Tunes",
        "the 70s",
        "Glenburns",
        "the 1960s",
        "12",
        "Hobart",
        "Eric Waterworth",
        "last night",
        "five",
        "yesterday",
        "First",
        "40s",
        "second",
        "Victor",
        "Australia",
        "the day"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "TIME",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "GPE",
        "PERSON",
        "TIME",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORDINAL",
        "PERSON",
        "GPE",
        "DATE"
    ],
    "vector": [
        -0.16208653151988983,
        -0.017588643357157707,
        0.014098924584686756,
        -0.07551407068967819,
        -0.06295336037874222,
        0.032057661563158035,
        -0.010072887875139713,
        0.05425034835934639,
        -0.028972819447517395,
        -0.03879265487194061,
        -0.04214821383357048,
        0.04120128974318504,
        0.0090523362159729,
        -0.03668602183461189,
        -0.05674624815583229,
        -0.023170648142695427,
        0.0029634027741849422,
        -0.029506227001547813,
        -0.032933056354522705,
        -0.0075559839606285095,
        -0.025540156289935112,
        0.011837879195809364,
        0.014631296508014202,
        0.01132091972976923,
        0.02441846765577793,
        0.02718408778309822,
        -0.08601175248622894,
        0.033233921974897385,
        0.005393417086452246,
        -0.05777965858578682,
        -0.0618186853826046,
        0.04101850837469101,
        -0.03283058851957321,
        -0.06114111840724945,
        -0.09972035139799118,
        -0.0684080570936203,
        0.09342960268259048,
        0.0687750056385994,
        -0.0615188404917717,
        0.020950933918356895,
        0.0383717343211174,
        -0.07018063217401505,
        0.01712128520011902,
        -0.033194735646247864,
        -0.08558706939220428,
        -0.00010407681838842109,
        -0.013271370902657509,
        -0.052670326083898544,
        -0.048335570842027664,
        -0.02689203992486,
        -0.03313783183693886,
        -0.034488141536712646,
        0.09927442669868469,
        0.026343440636992455,
        -0.038638316094875336,
        -0.008627874776721,
        0.010898968204855919,
        0.06983817368745804,
        0.019162626937031746,
        -0.02589598298072815,
        0.0840158611536026,
        0.01643216237425804,
        -0.04381692036986351,
        -0.015609834343194962,
        -0.0887012928724289,
        0.01624302938580513,
        0.026302801445126534,
        0.0627957433462143,
        0.036647990345954895,
        -0.0488925464451313,
        -0.07713910192251205,
        -0.020868748426437378,
        0.01649610884487629,
        0.02990778349339962,
        0.09171811491250992,
        -0.03987623751163483,
        0.06336932629346848,
        -0.02206951007246971,
        0.03763839974999428,
        -0.03996581584215164,
        0.07886741310358047,
        -0.03260091692209244,
        -0.0772484615445137,
        -0.06359829753637314,
        -0.04471490532159805,
        0.002062489278614521,
        -0.006162434350699186,
        -0.005405652802437544,
        -0.019027169793844223,
        -0.029537610709667206,
        -0.05766460299491882,
        -0.007354043889790773,
        -0.0007961542578414083,
        -0.04414111375808716,
        0.008492648601531982,
        0.00222518527880311,
        -0.04201079159975052,
        0.008763507008552551,
        0.08044014126062393,
        0.06863619387149811,
        0.0644461065530777,
        0.047719359397888184,
        0.01735188439488411,
        -0.08660387247800827,
        -0.04695114120841026,
        -0.037735242396593094,
        -0.059705544263124466,
        0.11469043791294098,
        0.08155234903097153,
        -0.049619678407907486,
        -0.001941110473126173,
        0.06821339577436447,
        -0.044574934989213943,
        -0.06821606308221817,
        0.018995270133018494,
        0.01677628792822361,
        -0.12475933879613876,
        0.07604394108057022,
        0.019100479781627655,
        -0.032459650188684464,
        0.0007104250253178179,
        -0.08905243873596191,
        -0.0557994619011879,
        0.04179418087005615,
        0.0711587518453598,
        -0.004733070265501738,
        -0.038831472396850586,
        2.3094195479796526e-33,
        0.059975143522024155,
        0.08659420907497406,
        -0.05892680957913399,
        0.009042731486260891,
        0.06606151908636093,
        0.018205389380455017,
        -0.10659655183553696,
        0.09920409321784973,
        -0.03441275656223297,
        0.008452795445919037,
        0.03144871070981026,
        0.05369889736175537,
        -0.09037017077207565,
        -0.007612244691699743,
        0.04289019852876663,
        -0.07998846471309662,
        -0.1270875185728073,
        -0.04537488892674446,
        0.017466239631175995,
        -0.06272523105144501,
        -0.039152830839157104,
        0.059728797525167465,
        0.052074894309043884,
        0.0376213975250721,
        0.044732656329870224,
        -0.008146400563418865,
        0.008237725123763084,
        0.057515326887369156,
        0.06598522514104843,
        -0.0013551787706092,
        -0.04173474386334419,
        0.0202227421104908,
        0.04302313178777695,
        -0.04638173058629036,
        0.0521123968064785,
        0.020705729722976685,
        -0.047278862446546555,
        -0.13575026392936707,
        -0.04922927916049957,
        -0.026860039681196213,
        0.06061141565442085,
        0.057181067764759064,
        -0.06861976534128189,
        0.017739949747920036,
        -0.023368963971734047,
        -0.035816121846437454,
        0.010140440426766872,
        0.0935664102435112,
        0.05074654147028923,
        0.013440442271530628,
        0.003097072010859847,
        0.060848090797662735,
        -0.10072050243616104,
        0.0187853816896677,
        0.00032924156403169036,
        0.04833364114165306,
        0.002149824518710375,
        0.01595027931034565,
        0.03214540332555771,
        -0.00866079144179821,
        0.07432954758405685,
        0.03426239639520645,
        0.04180368408560753,
        -0.04947385936975479,
        -0.07905721664428711,
        0.08414928615093231,
        0.07344744354486465,
        -0.05608325079083443,
        -0.006744386628270149,
        0.024697478860616684,
        -0.08511243760585785,
        0.015461676754057407,
        -0.07575753331184387,
        -0.10278773307800293,
        0.0452248714864254,
        0.06895700097084045,
        -0.08761243522167206,
        0.0016982340021058917,
        -0.005468720570206642,
        0.012867557816207409,
        -0.019163770601153374,
        0.045121390372514725,
        -0.022530799731612206,
        0.05135466903448105,
        0.017175184562802315,
        0.026105208322405815,
        0.04756676405668259,
        -0.00045244002831168473,
        0.0020906617864966393,
        0.0035044036339968443,
        0.02554912306368351,
        0.03553401678800583,
        -0.026570597663521767,
        0.015054097399115562,
        0.04756927117705345,
        -4.138429983141591e-33,
        -0.006525798235088587,
        0.013832754455506802,
        -0.0020183022134006023,
        0.052722908556461334,
        0.03611113876104355,
        -0.018205702304840088,
        0.016716666519641876,
        0.033880602568387985,
        0.04146565496921539,
        -0.0537903718650341,
        0.060474831610918045,
        -0.02194637432694435,
        0.031217306852340698,
        -0.03282361850142479,
        -0.10438153892755508,
        -0.09255394339561462,
        -0.03342188522219658,
        -0.027703437954187393,
        -0.002119924873113632,
        -0.0024920112919062376,
        0.12913952767848969,
        0.10598871856927872,
        -0.030252166092395782,
        0.03957606852054596,
        -0.04267015680670738,
        -0.008389542810618877,
        -0.063385508954525,
        0.07418320327997208,
        0.02008494734764099,
        -0.011945338919758797,
        0.003733587684109807,
        -0.010160393081605434,
        0.04243830591440201,
        -0.02411363273859024,
        -0.03460844233632088,
        0.06614290922880173,
        0.1604257971048355,
        0.02561243623495102,
        -0.03338143974542618,
        -0.10385391116142273,
        0.005667340476065874,
        0.05301588028669357,
        -0.022273343056440353,
        -0.008116546086966991,
        -0.062226396054029465,
        0.012014545500278473,
        -0.10450658947229385,
        0.05020272359251976,
        -0.042885709553956985,
        0.004198592621833086,
        0.0406063012778759,
        -0.030981937423348427,
        0.04381020739674568,
        -0.048609837889671326,
        -0.05450492724776268,
        0.009355337359011173,
        -0.0007493281154893339,
        -0.006666150409728289,
        0.007600180804729462,
        0.11917892098426819,
        -0.06965089589357376,
        0.01396321039646864,
        -0.0137642128393054,
        -0.019219404086470604,
        0.02854994311928749,
        0.03738664463162422,
        0.09346535801887512,
        0.003673124359920621,
        -0.022173574194312096,
        0.028732264414429665,
        0.0270366333425045,
        0.02944185584783554,
        0.04226447269320488,
        -0.06068919226527214,
        0.01928020641207695,
        -0.0595187284052372,
        -0.09771381318569183,
        -0.10555464029312134,
        -0.0656648650765419,
        0.028666097670793533,
        -0.07003262639045715,
        -0.015608570538461208,
        0.04477768391370773,
        0.01371179148554802,
        0.02456003427505493,
        0.1336347609758377,
        0.032419174909591675,
        0.023235196247696877,
        -0.024937300011515617,
        0.048190638422966,
        0.04982152208685875,
        0.06458908319473267,
        0.01822948455810547,
        0.0180628914386034,
        0.04106574505567551,
        -5.502814914848386e-08,
        -0.029924219474196434,
        0.06896040588617325,
        -0.03655082732439041,
        -0.014550453051924706,
        0.0039522224105894566,
        -0.0965435579419136,
        0.06452353298664093,
        0.0210372656583786,
        -0.00518648698925972,
        -0.012006284669041634,
        -0.02421627752482891,
        -0.015813883394002914,
        -0.030893102288246155,
        0.05864651873707771,
        0.058762792497873306,
        -0.02435852587223053,
        -0.011799496598541737,
        0.05915355682373047,
        -0.05768444389104843,
        -0.04164333641529083,
        0.05064675584435463,
        -0.015102596953511238,
        0.10444887727499008,
        -0.012124135158956051,
        0.06713276356458664,
        -0.027023866772651672,
        0.03376717492938042,
        0.06641523540019989,
        -0.031808316707611084,
        0.0063017974607646465,
        -0.0658268854022026,
        0.0036502350121736526,
        -0.03268114849925041,
        -2.723624675127212e-05,
        0.0052359942346811295,
        -0.01867687702178955,
        -0.09369214624166489,
        -0.0008889133459888399,
        -0.014415624551475048,
        0.01967097446322441,
        0.032653145492076874,
        -0.06663082540035248,
        -0.1088099479675293,
        0.06943241506814957,
        0.008746405132114887,
        0.01874553970992565,
        -0.018551010638475418,
        -0.03374272584915161,
        -0.05894039198756218,
        -0.0015372311463579535,
        0.06728062033653259,
        0.022479955106973648,
        -0.012206410989165306,
        -0.044647619128227234,
        0.017134154215455055,
        0.029164813458919525,
        0.028810882940888405,
        0.052611641585826874,
        0.004233248997479677,
        0.06684313714504242,
        -0.016178224235773087,
        -0.03129628300666809,
        -0.007904494181275368,
        0.029111430048942566
    ]
}