{
    "id": "GViozvj4deI",
    "title": "More TV for less! - LG QNED85",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-11-30T20:30:01Z",
    "video_url": "https://www.youtube.com/watch?v=GViozvj4deI",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "lg qned",
        "mini led tv",
        "qned tv",
        "best tv",
        "8k tv",
        "4k tv",
        "large tv",
        "best gaming tv",
        "75 tv"
    ],
    "views": 419529,
    "likes": 12781,
    "comments_count": 638,
    "description": "Thanks LG for sponsoring today's video! Buy an LG QNED85 4K TV [US]:  Buy an LG QNED86 4K TV [UK]:   James sits down with the LG 75 QNED 4K TV. How does LG's use of NanoCell color technology stack up against the rest of the quantum dot options on the market?  Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Intro 2:12 Assembling the TV 4:00 The Peel and Remote 4:52 Specs and Features 6:06 It's Corn 8:33 Now Lets Play Some Gears 9:18 Quantum Dots and NanoCell Technology 10:40 Living in an HDR World 11:02 Where'd the Bird Go? 11:45 Outro",
    "description_links": [
        "https://bit.ly/LGQNED85_SC",
        "https://bit.ly/LGQNED86_SC",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- They gave me a knife again because LG sponsored this video to show off their QNED85, but don't be deceived, this is the 75 inch model. Can you believe it? This won't even fit in the back of your car, but you'll get it home somehow, because it's nice to have a 75 inch TV. Anyways, let's get this thing opened up, we'll check it out. It's MiniLED, people! Okay, you guys, this is too much packaging. Ugh. Ooh, now come on. For a guy who's opened a lot of TV boxes, I still never really exactly know if I'm supposed to pull these out first. Some brands want you to do that. Or if I'm supposed to just go straight to this step. Ah! HH, why don't you give me a hand? My lovely assistant. - [Assistant] Stop. - Or mighty assistant. - [Assistant] Yeah. - You're lovely anyway. Use your legs. - I got it. - Squeeze the glutes. - I am. There's no way to pick this up. - Yeah, push it off with the foot, like this. Yeah, you see that? Like a Captain Morgan commercial. These are freaking aggressive, man. Oh, I guess these are gonna get buried inside the TV, because either they look really gamer-y or they look like some kind of weapon from an \"X-Men\" movie. I'm pretty sure there's a ninja princess who wields these. Anyways, these are the feet. Let's see where they go. I honestly have no idea. This is different than what I've seen before. Does this come off? Boom. Bam. That is very simple, although it's not tool less. You do need to put some screws in, as is tradition. Open up a little bag of treats here. There's the remote, instructions, some little cable management channel dealies, same deal with this, and there's the screws and they even have included washers. I can't believe the ratcheting action on this lttstore.com screwdriver. I have a very nice screwdriver. This is better. Although, I must say, it's made for Linus' small hands. I can't get used to that. I will get used to it, it's just smaller than what I'm used to. All right, the feet are on. They're 52 inches apart, which is pretty far apart. I think it's gonna fit in our stand over there, but before we go over there, let's take a moment to look at the IO, since it's so accessible right now. We've got a 90 degree kind of corner style IO, which is nice. Nice to have some of the ports on the side. There are four HDMI ports here. Two of them are 4K 120 hertz, the HDMI 2.1 ports. One of those is the ER port. You're gonna use that to pass audio through from say your speakers through your AVR to your TV and back again, so you do that all over one port, instead of having dedicated audio ports like the olden times. There's a USB in port over here. Then there's also an optical digital audio out port. If you don't have an AVR that has HDMI, you're using something old like a vintage AVR, you can use toslink. And on this side, there's the antenna/cable-in. Not sure who that's for, maybe sports types. Then there's the LAN, although you may get faster speeds from the WiFi because I believe they put 100 up and 100 down networking cards in here. The RS-232C port and the USB in, another USB port. USB ports obviously are useful for things like Android TV boxes or even random stuff, like someone left an LED projector thing at my house. It only has a USB power. I plugged it into the back of the TV, it's like a party in my living room. Thanks, random person who left it there. And before I call my lovely assistant back over here, I do wanna make a comment on the back of this TV. I think it's very nice and simple and very flat. I like the texture. It does appear to be a full metal back, which is nice. It's particularly thin, I'd say, especially for a MiniLED back lit TV with precision dimming, a more advanced back lighting system than your usual full array with local dimming. All right, it's finally in place and I can do my peels. The remote has a glossy back and a matte plate on the front. It's got six dedicated streamer buttons: Netflix, Prime Video, Disney+, an Alexa button, which I don't think I've seen before, a Google Assistant button and an LG Channels button, which you'll be pressing a lot. There's also the colored kind of, I forget what they call those buttons but they're really kind of versatile. You can actually remap those ones, which is nice. Then you've got the directional pad. - [TV] Left, left. - Oh, look at that. Describe video. - [TV] Right, up, left. - I really like the roll on this button in the middle. You hear that? You can also click it. - [TV] Okay. - No back light on this roll, but it does have the Wii-mote pointer style thing that LG's been using for years now, which is pretty fun. And if you go into the settings, you can actually change that little icon to be a very fun little bird. We'll do that later. Onboard very QNED85 is, of course, the Alpha7 Gen5 Processor, which can do a lot, not just for picture quality but also audio. So you can see during the setup here, we have two toggles here. One is for AI Picture Pro, which will do 4K up sampling, as well as increasing the contrast and resolution. So the demo picture they have here gives this kid shinier hair and more freckles, which is cool. And then the AI Sound Pro is for upscaling your regular stereo content into not just 5.1 but 5.1.2. That extra .2 refers to height channel speakers, because it supports Dolby Atmos. All right, let's see how that AI Picture Pro handles this older network television Canadian content. I wanna see some upscaling. Is anything happening? On top of the AI Picture Pro, there's also AI Brightness settings. So it actually looks at the content and compares that to the ambient brightness around you, and kind of tone maps it according to that. So you can actually see in real time that some of these shadows and the overall picture is changing and flashing as I turn this on and off. Oh, look at that freeze frame. Wow, \"Degrassi\"! Wow, look at that. You log into YouTube for the first time, no account signed in, and \"It's Corn\" is the video it gives you. That kid, man, he's going places. This isn't working now 'cause I got the Xbox going. Oh my gosh. But one thing I do wanna highlight, which I like about LG TVs, 'cause I am an LG TV user at home, is their picture menus. What? This looks all gamer-y now. Look at that, I don't have that on mine. Because we're connected to a console, it's like it has a whole new on-screen display that's aimed at gamers. This is crazy. And looks like they've exposed a lot of the options that gamers would care about when in this mode, like telling me if black stabilizer is on or VRR. You can see that this mode is capable of 120 FPS, variable refresh rate is on. What else we got? Dark room mode. You know, that's nice. People get really obsessed with how bright their TV is, but a lot of times, it's just searing your eyeballs when you're in a completely light controlled room, like late at night in your basement, or your parents basement. What's multi-view? Here we go. - [Bell] That's actually sick. You like that? What would you use that for? - [Bell] Watching YouTube while playing games. - YouTube while playing games? - [Bell] Yeah. - You can watch a picture in picture of a guy playing games while you're playing games. So I'm in game optimizer mode, but they also have their vivid and standard modes, which I don't typically use. But what I do use is filmmaker mode, which is not just a pro file for colors and stuff, but it also removes motion interpolation. So this is the mode that's going to get you closest to what the creator of the content intended. And another thing that's nice about filmmaker mode is that it's consistent across different brands. Brand specific mode that I like and use a lot is the ISF modes. These are very color accurate modes and they have one for bright and dark. So a lot of the time, if I'm going to be switching between using the TV in the daytime or nighttime, because there's a big window in that room, I use this as a quick way to switch the brightness of my TV while still maintaining color accuracy. Filmmaker mode on this YouTube video, let's go. Here you can really see the display of the dimming zones, because we've got a lot of contrast. Look how bright that sun is, while you still have detail in the shadows down in the corners. And how kickass is Iceland? Gotta wear jackets though. I could watch Iceland all day. Dolby Vision, there's the thing. Game optimizer is a single toggle that controls a group of settings that are relevant to gaming. You got reduce your blue lights, dark room mode. Oh cool, and you can change your blackness levels, so if you like to cheat while playing first person shooters, you can just crank those shadows up and shoot people in the dark. Another thing I really like in this advanced settings menu is the apply to all inputs button. In the past, you wouldn't have needed this because in the olden days, back when you changed your settings on your TV, it did apply to all inputs. But nowadays, usually when you playing with settings, it only applies to the input you're on, so HDMI3, for example. And then when you switch to HDMI2, you're like, oh, why is motion interpolation on again? I've gotta turn it off again. But now you don't, apply to all inputs, boom. Now if you're getting an LCE TV, you want something with quantum dots. The MiniLEDs work alongside quantum dot and LG's nanocell technology to achieve what LG claims is 100% color volume coverage of DCI-P3. So that means that it's doing the whole 2D color gamut, plus the whole brightness range. That's what makes it a three dimensional volume. The reason why quantum dots are so cool is 'cause they're these tiny little particles that are grown in chemical reaction vats, and you can grow them to very very precise small sizes, and the size of the quantum dot determines what color will shine out of it if you activate it with light. And so that allows them to make R, G and B that are very precisely R, G and B. QNED TVs combine the power of both nanocell plus quantum dots. Only the green color is enhanced by the quantum dot layer, while the red color is enhanced by a nanocell, and blue is coming through the blue LED lights, which is different compared to the standard quantum dot color technology. So you don't get any crappy inaccurate colors coming out of your TV. Combine quantum dot with MiniLED and you're basically, you've reached the minimum standard of what I would tolerate while buying an LCD today. That is just, there's no reason to get anything else, because the prices have come down so far with the quality being so high. Yeah, the HDR is sweet. I really like that you can see these specular highlights on the shoulder armor and the LEDs by his collar and our little robot friend here, meanwhile lots of other parts of the scene are nice and dark like these shadowy backgrounds. If you're not living in an HDR world, you're not living. This is really fast and snappy, and I like their remotes quite a bit. If you kind of bump your remote or if your remote is sitting on top of a subwoofer or something and it vibrates, then it can actually wake up this little pointer, which can be a bit annoying, but just keep it away from your kids. You should be all right. Look how snappy this is. Bam, bam, bam, bam, bam. That's that processor, Alpha7. Oh, I said I was gonna turn this into a bird too, hold on. Here we go. Oh no, what? No, they got rid of it? They only have pointer size now. They use to also have pointer style and you could make it this little bird, and then when you clicked the wheel in the middle, it would go eh. I love that bird, that's what I have at home. Bring it back, LG. So if you're a gamer, check out the link below to get more information and pricing information on this TV. It's definitely, they've got a lot of gaming features in here, very cool. So thanks for watching Short Circuit. Like the video and come back next time. For now, I'm going to bed. He is out of her league.",
    "transcript_keywords": [
        "back",
        "mode",
        "nice",
        "picture",
        "lot",
        "Picture Pro",
        "quantum dot",
        "color",
        "quantum",
        "port",
        "USB",
        "thing",
        "Pro",
        "ports",
        "video",
        "Bam",
        "kind",
        "playing",
        "Yeah",
        "settings"
    ],
    "transcript_entity_values": [
        "Alexa",
        "5.1.2",
        "FPS",
        "75 inch",
        "100%",
        "all day",
        "three",
        "One",
        "AVR",
        "4",
        "one",
        "USB",
        "AI Brightness",
        "Google",
        "100",
        "YouTube",
        "night",
        "LCE TV",
        "B. QNED",
        "52 inches",
        "YouTube",
        "the olden days",
        "IO",
        "Dolby Vision",
        "daytime",
        "Morgan",
        "HDMI2",
        "LAN",
        "HDMI3",
        "LG",
        "DCI-P3",
        "VRR",
        "Android TV",
        "LG Channels",
        "first",
        "Netflix",
        "two",
        "Canadian",
        "120",
        "the AI Picture Pro",
        "Iceland",
        "AI Picture Pro",
        "ISF",
        "four",
        "the AI Sound Pro",
        "LCD",
        "90 degree",
        "Short Circuit",
        "Two",
        "Linus",
        "Xbox",
        "six",
        "2.1",
        "Dolby Atmos",
        "nighttime",
        "YouTube",
        "years",
        "ER",
        "today",
        "the Alpha7 Gen5 Processor"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "TIME",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "DATE",
        "GPE",
        "ORG",
        "TIME",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "LAW",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.038074783980846405,
        -0.025422224774956703,
        0.0452539324760437,
        -0.07696119695901871,
        0.06011627987027168,
        0.06400606036186218,
        0.009885204955935478,
        0.042718589305877686,
        0.030691515654325485,
        0.026481330394744873,
        -0.015439458191394806,
        -0.014912824146449566,
        0.015010190196335316,
        -0.030848529189825058,
        0.04807422310113907,
        -0.0007068308768793941,
        0.06694252043962479,
        -0.10375508666038513,
        -0.07035821676254272,
        -0.05189003422856331,
        -0.012003111653029919,
        -0.08898679912090302,
        -0.014457960613071918,
        -0.023400727659463882,
        0.024200143292546272,
        -0.023490766063332558,
        0.008013722486793995,
        -0.003903389908373356,
        0.03452068939805031,
        -0.09081452339887619,
        0.01100497879087925,
        0.12307830899953842,
        0.02608613297343254,
        -0.01804589293897152,
        -0.05994934216141701,
        -0.04505335912108421,
        -0.02711394988000393,
        -0.08987157046794891,
        -0.08813585340976715,
        -0.00890478864312172,
        0.012387330643832684,
        -0.0691646933555603,
        -0.03412845730781555,
        -0.04617356136441231,
        -0.0238924790173769,
        -0.032763756811618805,
        0.051063172519207,
        -0.023719703778624535,
        -0.04672831669449806,
        -0.06954464316368103,
        -0.011984489858150482,
        -0.06799864023923874,
        0.04330132529139519,
        -0.006554769817739725,
        -0.06143675372004509,
        0.030802041292190552,
        -0.024151476100087166,
        0.0610044039785862,
        0.08844784647226334,
        0.018952131271362305,
        0.0044745090417563915,
        -0.03051522746682167,
        -0.05709944665431976,
        0.1001531183719635,
        0.04707958549261093,
        -0.0057523599825799465,
        -0.017401404678821564,
        0.01949407160282135,
        -0.050636548548936844,
        -0.03397955372929573,
        -0.0008483089040964842,
        -0.014293106272816658,
        0.03330177068710327,
        0.05798445641994476,
        0.05710974335670471,
        0.022499728947877884,
        0.10688909888267517,
        -0.022081032395362854,
        0.032216522842645645,
        -0.009970991872251034,
        0.058613575994968414,
        -0.06609147042036057,
        -0.04715112969279289,
        0.03346259519457817,
        0.05733470246195793,
        -0.024221062660217285,
        -0.03756117448210716,
        0.021229583770036697,
        -0.08335524052381516,
        -0.085415318608284,
        -0.040971171110868454,
        0.08129952847957611,
        0.004798076115548611,
        0.04541979357600212,
        -0.024388864636421204,
        0.033538106828927994,
        -0.0052914973348379135,
        -0.07808251678943634,
        -0.009286146610975266,
        0.049259208142757416,
        0.10748883336782455,
        0.03997566178441048,
        -0.020486967638134956,
        -0.005811234936118126,
        -0.0864669531583786,
        -0.12141096591949463,
        0.04965068772435188,
        0.10990287363529205,
        0.04545385763049126,
        0.019423825666308403,
        -0.01930263824760914,
        0.06259370595216751,
        -0.05221489444375038,
        -0.03644302114844322,
        -0.0775982216000557,
        0.005773437209427357,
        -0.015782982110977173,
        0.045958660542964935,
        0.08679698407649994,
        -0.05522529408335686,
        0.010335583239793777,
        -0.017672065645456314,
        -0.06014419347047806,
        0.0018279621144756675,
        0.015027699060738087,
        0.019906677305698395,
        -0.07539398968219757,
        6.679018852240597e-35,
        -0.026670724153518677,
        0.07509761303663254,
        -0.0276218019425869,
        -0.08993534743785858,
        0.050101712346076965,
        0.05137031152844429,
        -0.0031750788912177086,
        0.0016519516939297318,
        -0.05235139653086662,
        -0.057598013430833817,
        0.03327401727437973,
        0.059655897319316864,
        -0.10939385741949081,
        0.04816371202468872,
        0.024590488523244858,
        -0.07696359604597092,
        -0.06768010556697845,
        -0.01722111739218235,
        -0.07301203161478043,
        0.009494771249592304,
        -0.03584212809801102,
        -0.012826438993215561,
        -0.04338828846812248,
        0.054581157863140106,
        0.05589832365512848,
        0.010873465798795223,
        0.05433199927210808,
        0.024056725203990936,
        -0.009411095641553402,
        0.026283137500286102,
        -0.03784823417663574,
        0.06341453641653061,
        0.009731077589094639,
        -0.04408134147524834,
        -0.06192455813288689,
        -0.008542320691049099,
        -0.10963911563158035,
        -0.082951121032238,
        0.03093147650361061,
        0.011624947190284729,
        -0.012015569023787975,
        0.08471351861953735,
        -0.06783095002174377,
        -0.03338010236620903,
        -0.027345620095729828,
        0.08526960760354996,
        0.04575160890817642,
        -0.02947312779724598,
        -0.020688064396381378,
        0.04162224009633064,
        0.029775433242321014,
        -0.03220413625240326,
        -0.13684527575969696,
        -0.11836408078670502,
        0.0823620855808258,
        -0.01355297677218914,
        -0.03729509562253952,
        -0.045532356947660446,
        0.02933744341135025,
        -0.008468100801110268,
        0.031514812260866165,
        0.06205497682094574,
        0.05610219016671181,
        0.03196483850479126,
        -0.0780833512544632,
        0.0489141009747982,
        0.0537588857114315,
        -0.048648376017808914,
        -0.1393967717885971,
        0.018788021057844162,
        -0.013139906339347363,
        0.0504327192902565,
        0.11517496407032013,
        -0.07712817192077637,
        0.01239542756229639,
        -0.01714111678302288,
        -0.05973222851753235,
        -0.05368967354297638,
        0.06160055100917816,
        0.024214299395680428,
        0.007536841556429863,
        -0.025124412029981613,
        0.020329413935542107,
        -0.027017980813980103,
        -0.02161906100809574,
        -0.10244949162006378,
        -0.015041938051581383,
        -0.03314501419663429,
        -0.04155503213405609,
        -0.013844952918589115,
        -0.004426324740052223,
        -0.05847902223467827,
        -0.026480067521333694,
        -0.013226084411144257,
        -0.09067706018686295,
        -3.140407361302637e-33,
        -0.05232806131243706,
        0.051807742565870285,
        -0.05436629056930542,
        0.04517214372754097,
        0.03882531449198723,
        -0.041715990751981735,
        0.09445366263389587,
        -0.033427927643060684,
        0.09921769052743912,
        -0.018317067995667458,
        0.01784946396946907,
        0.023763157427310944,
        -0.0769372507929802,
        0.022712038829922676,
        -0.04744695872068405,
        -0.05202119052410126,
        0.03842683881521225,
        -0.07291541248559952,
        0.022209901362657547,
        -0.051133621484041214,
        0.05031822994351387,
        -0.03276781737804413,
        0.026579106226563454,
        0.09410612285137177,
        0.054844506084918976,
        -0.02409231849014759,
        0.022208990529179573,
        0.07543238252401352,
        -0.0426064170897007,
        -0.014845713973045349,
        -0.011445030570030212,
        -0.0981130599975586,
        0.02649645321071148,
        -0.026368560269474983,
        0.03883426636457443,
        0.009559907019138336,
        0.08114153146743774,
        0.04636968672275543,
        -0.0437423400580883,
        -0.0574023500084877,
        -0.02387303113937378,
        -0.05307166278362274,
        -0.013086166232824326,
        -0.023382149636745453,
        0.007143030408769846,
        -0.008241360075771809,
        -0.014535537920892239,
        -0.07421473413705826,
        0.00981645192950964,
        0.009541892446577549,
        0.019476400688290596,
        0.06201968342065811,
        0.05000807344913483,
        0.04136491194367409,
        -0.0915091261267662,
        0.005161570385098457,
        -0.028814520686864853,
        0.1446472704410553,
        -0.007799470331519842,
        0.0028465124778449535,
        0.019780006259679794,
        -0.010607295669615269,
        -0.02974981814622879,
        0.0043060267344117165,
        0.005216688383370638,
        -0.01653978042304516,
        0.07624071836471558,
        0.02760324999690056,
        0.034842804074287415,
        -0.029133865609765053,
        0.07712150365114212,
        -0.04631391540169716,
        0.03932655230164528,
        -0.06335742026567459,
        -0.0022738499101251364,
        0.04471302032470703,
        0.018724340945482254,
        -0.029155336320400238,
        -0.039010707288980484,
        -5.798192069050856e-05,
        -0.027116497978568077,
        0.07965724170207977,
        0.07603532820940018,
        -0.0003694883198477328,
        0.021405983716249466,
        0.0012514143018051982,
        0.023400727659463882,
        -0.0020629914943128824,
        -0.04793557897210121,
        0.03579196706414223,
        -0.028712911531329155,
        0.027298467233777046,
        0.02062298357486725,
        0.04705127701163292,
        0.05517110601067543,
        -5.692862359296669e-08,
        0.017838696017861366,
        -0.055495135486125946,
        -0.0020288231316953897,
        -0.0421755276620388,
        0.02167988009750843,
        -0.08193764835596085,
        0.03614352270960808,
        -0.004333164542913437,
        0.06648218631744385,
        0.03141963854432106,
        0.003197198500856757,
        -0.03717604652047157,
        -0.043330226093530655,
        0.045691508799791336,
        0.07626448571681976,
        0.029216211289167404,
        -0.08545104414224625,
        -0.03620687499642372,
        -0.02332940697669983,
        0.04030512645840645,
        -0.015483657829463482,
        0.06773463636636734,
        0.022037172690033913,
        0.017912229523062706,
        -0.014155934564769268,
        0.07553339749574661,
        0.002220593160018325,
        0.02818225882947445,
        0.12580209970474243,
        -0.042442113161087036,
        -0.06887643039226532,
        0.0306207574903965,
        0.003415188519284129,
        -0.003877365030348301,
        -0.04745418578386307,
        -0.08223716914653778,
        -0.09312795102596283,
        0.04632028564810753,
        0.05574454367160797,
        0.08914853632450104,
        -0.059648387134075165,
        -0.03984161838889122,
        0.04250415414571762,
        0.030166734009981155,
        0.006226911209523678,
        -0.018265508115291595,
        -0.019642651081085205,
        -0.03513019159436226,
        0.029223931953310966,
        0.019863825291395187,
        -0.01848542131483555,
        -0.0086439810693264,
        -0.08549373596906662,
        -0.032067570835351944,
        0.014849310740828514,
        -0.056775178760290146,
        0.016547037288546562,
        0.06513458490371704,
        -0.014199049212038517,
        0.0063947769813239574,
        0.02205435372889042,
        -0.12667971849441528,
        -0.00032701133750379086,
        0.1344219446182251
    ]
}