{
    "id": "gw9kwsAgLRo",
    "title": "When Phones Were Fun: Motorola AURA (2008)",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-05-23T16:14:04Z",
    "video_url": "https://www.youtube.com/watch?v=gw9kwsAgLRo",
    "category": "Science & Technology",
    "tags": [
        "motorola aura review",
        "motorola aura celestial edition",
        "motorola aura r1",
        "motorola v70 review",
        "motorola retro phone",
        "2008 phone",
        "luxury phone"
    ],
    "views": 2517394,
    "likes": 56165,
    "comments_count": 2941,
    "description": "A first-of-its-kind circular display. A stainless steel casing that took two weeks to etch. And a Swiss-inspired mechanism that means it opens just as smoothly in 2020 as it did twelve years ago. Motorola didnt get much wrong with its first true luxury phone  unless you count launching it directly into the midst of a global economic recession. The year is 2008; the device is the Motorola AURA; and this is episode 2 of When Phones Were Fun!    [SUBSCRIBE TO MRMOBILE]     [ABOUT WHEN PHONES WERE FUN: MOTOROLA AURA R1 / CELESTIAL EDITION]  This is the second in a series of MrMobile episodes exploring the mobile tech world's most vibrant period in design and experimentation. In When Phones Were Fun, Michael Fisher re-reviews cellphones from the golden age of mobile, the decade-long span from the turn of the century to approximately 2009.  When Phones Were Fun: Episode 2 features the Motorola AURA. The review sample featured in this video is a Motorola AURA Celestial Edition on loan from Motorola, but the bulk of the coverage focuses on the base level R1. No company paid a fee or otherwise offered compensation in exchange for this coverage, nor did any company preview or approve this content before publication.   [PRODUCTS IN THIS VIDEO]  Nomad Kevlar charging cable USB-C to Universal [Nomad]:   CKANDAY SIM adapter kit [Amazon]:    [LINKS]  When Phones Were Fun, Episode 1: The Matrix Phone (Reloaded), 2003 [MrMobile]:   Motorola Launches $2000 Luxury Phone [Wired]:   Anticipated Cellular Carriers 2G/3G Sunset Dates [MultiTech - PDF Link]:   Hands-On With The Runcible [Pocketnow]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase. See our affiliate link policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #motorolaaura #aura #motorola #throwback #retro #tech #2008",
    "description_links": [
        "https://www.youtube.com/channel/UCSOp...",
        "http://mrmobile.tech/1Rb",
        "http://mrmobile.tech/1Rc",
        "https://youtu.be/u05gxIWYv8k",
        "https://www.wired.com/2008/10/motorola-goes-a/",
        "https://www.multitech.com/documents/publications/marketing-guides/MT_Anticipated_Sunset_Cellular_Carriers_PDF.pdf",
        "https://www.youtube.com/watch?v=dlo8jHHeP8Y",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- [Mr. Mobile] A first of its kind circular screen. A stainless steel casing that took two weeks to etch and a Swiss inspired mechanism that ensures it opens just as smoothly in 2020 as it did in 2008. I'm Mr. Mobile and this is the Motorola Aura. A rare artifact from back in the days when phones were fun. (upbeat music) Now despite the fact that it comes from the same four letter lineage as the Pebl, Slve, Rokr, and of course, Razr, you probably don't remember the Motorola Aura and there's a good reason for that. First of all it debuted at the staggering price of $2,000 U.S. dollars, or nearly $2,400, adjusted for inflation. On top of that its lanch in October 2008 was perfectly, terribly timed with the sub prime mortgage crisis that kicked off the great recession. Launching high end specialty phones into a market crippled by an economic crisis, boy I sure am glad Motorola's luck has changed. Oh, boy. Now the reason this pricey indulgence is worth a look to me is because it's the closest the mobile world has gotten to an heirloom product. Look at the phones I was carrying when the Aura launched, and iPhone 3G and a Motorola Renegade. Sorry you have to say it like that, it's the law. Each of those while great in its own way, was also made of the utilitarian stuff of 2008, plastic, rubber, and the Aura bucked those trends. Take the housing, instead of plastic, stainless steel, with a PVD coating that's been chemically etched in a process that Motorola says took two weeks. The keypad aluminum, with a spin finish morray, that recalls the Razr and this display. It's not just that it's the first circular TFT LCD on a mobile phone, this thing had an effective resolution of 300 dpi, which was unheard of at the time. It would be another two to four years, before screens of this sharpness became the norm. Just look at how beautifully this Apollo 11 medallion is, a very intentional out of box choice by the way, which I'll explain in a minute and what I love most about the Aura is that it doesn't stop at high end features, it always sticks a flourish on top. This for example, this is not glass. It's 62 carat sapphire crystal, very difficult to scratch and it's not a flat plate, but domed. That means light refracts as it passes through, bending at the borders, making the display look even more like a physical object. Even when it's off, this thing is just fun to move around in your hand and look at. That domed sapphire was inspired by the world of the high-end time piece and analogy that continues around back. Take a peak through this window as you might on a pocket watch with a skeleton dial and you'll find a mechanism, just as you would on a pocket watch and honest to goodness Swiss made baring with over 200 pieces and hardened steel gears coated in tungsten carbide an over engineered way to open a phone, yeah absolutely, but as I said in the intro, it works just as well now as it did 12 years ago and it's absolutely addictive. As Motorola seemed to forecast in it's user manual, repeatedly opening and closing the blade can inadvertently answer and end a call, basically telling you not to mess with it. We know it's fun, don't play with it too much. That's right, it's a fidget spinner for rich people. Now despite the heirloom potential of this hardware, the biggest reason technology doesn't get passed down through the generations is it ages too quickly, right. Just take the camera. Framing shots through a circular viewfinder is fun, if difficult and the sensor is cleverly mounted horizontally so you can hold the phone upright and still get a landscape photo. That's a trick Motorola would bring back for some of it's 2019 smartphones, but the fixed focus to mega pixel camera doesn't hold up and hey, remember when you had to tell the phone that you wanted to save the photo you just took. Otherwise it would go ahead and delete it for you. Yeah, good times. In my opinion Motorola wouldn't get a handle on good software design until the Moto X, five years after this. So you have this slow un intuitive interface that you have to navigate with these tiny buttons. Even back in 2008, companies were already shipping scroll wheels on phones, Motorola included. So it's weird to me that the Aura, which lavishes so much attention on it's circular screen makes you muddle through with this D-pad for ants. In most parts of the software the circular motif just gets ignored, apps are square, the menus are just lists of texts, really just a lot of opportunities here. Folks, I did try to get the Aura working so I could make a phone call. I got a a SIM adaptor kit from Amazon, because back in 2008, SIMS were actually, physically larger and I charged the phone up until it's embedded ring light glowed a steady green, but try as I might I could not get the phone to see the T-Mobile network. Not that this 2G phone would be terribly useful for much longer. Eventually even the storied GSM technology it depends upon will be sunset in favor of more modern networks and that's why you don't see many companies making the effort to build phones as exquisite as this one. Sure you had Nokia's Vertu handsets, and the Aura also recalls the novel Runcible handset from Monohm, but Virtu got spun off and then went bankrupt and Monohm claims it's still working on the Runcible, but it's four years overdue, despite the fact that they have thousands of dollars from gullible rubes like me. The point besides, you should be careful which indigogos you back. Technology just moves too quickly for anyone but the super rich to drop this kind of money on a fashion piece. That said, the Aura wasn't the failure you might expect. It spawned several variations through 2009. Some with diamonds, some gold plated, and this one, the celestial addition. Yeah, Motorola built this to commemorate the 40th anniversary of the moon landing, which the company had actually helped with back in 1969 as a communications vendor. So this variant of the Aura came with custom wallpapers and ringtones, - [Radio] We copy you down eagle. - [Mr. Mobile] And reportedly one was actually given to Neil Armstrong as a gift. I don't think it was engraved steely-eyed missile man, but I hope it was. The Aura is an interesting contrast to the last phone I featured in this series, Samsung's Matrix phone, which felt cheaper than it looked. The Aura is kind of the opposite. It feels even more expensive than it looks. Maybe that's the reason it hasn't depreciated in value that much since release, another rare achievement. We don't yet have a pocket watch of phones, or an heirloom of mobiles, but once upon a time, we sure got close, back in the days when phones were fun. Special thanks to Motorola for loaning this handset for this video and sorry friends, it's not for sale. In fact, it'll shortly be on a truck back to Chicago. As usual, of course Motorola got no copy approval, or early preview of this video. They're seeing it for the first time right alongside you and speaking of device loans, I lucked out and got a handful of exciting ones for episode three of When Phones Were Fun. So make sure to flip out your screen and point your hiptop to that subscribe button, because next week, we're checking out the T-Mobile Sidekick and you're not gonna wanna miss it. Until next time, thanks for watching. Stay safe at home for now, but in spirit stay mobile my friends. (winding music)",
    "transcript_keywords": [
        "Aura",
        "Motorola",
        "Motorola Aura",
        "phone",
        "phones",
        "back",
        "fun",
        "Motorola Renegade",
        "time",
        "circular",
        "Mobile",
        "mobile phone",
        "Samsung Matrix phone",
        "reason",
        "years",
        "phones were fun",
        "Aura working",
        "circular screen",
        "Aura launched",
        "Matrix phone"
    ],
    "transcript_entity_values": [
        "2020",
        "First",
        "Runcible",
        "Matrix",
        "keypad",
        "Aura",
        "PVD",
        "2009",
        "the moon landing",
        "Samsung",
        "carat",
        "TFT LCD",
        "GSM",
        "SIM",
        "Monohm",
        "300",
        "a Motorola Renegade",
        "2008",
        "SIMS",
        "four",
        "40th",
        "three",
        "200",
        "the days",
        "the Motorola Aura",
        "Mobile",
        "Motorola",
        "3",
        "2",
        "first",
        "two weeks",
        "Rokr",
        "Neil Armstrong",
        "nearly $2,400",
        "$2,000 U.S. dollars",
        "another two to four years",
        "Chicago",
        "12 years ago",
        "Nokia",
        "five years",
        "2019",
        "October 2008",
        "1969",
        "Swiss",
        "Virtu",
        "a minute",
        "un",
        "62",
        "thousands of dollars",
        "next week",
        "four years",
        "Apollo",
        "Amazon"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "DATE",
        "LOC",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "MONEY",
        "MONEY",
        "DATE",
        "GPE",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "NORP",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "DATE",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.11766941845417023,
        0.026718908920884132,
        0.09972651302814484,
        -0.038185764104127884,
        -0.01823374442756176,
        -0.05107783153653145,
        0.057860445231199265,
        0.08012373745441437,
        -0.021816009655594826,
        -0.011825142428278923,
        0.06235513463616371,
        0.06323061883449554,
        0.028625747188925743,
        0.043110523372888565,
        0.04380660504102707,
        -0.0043424684554338455,
        0.11466463655233383,
        -0.1014934852719307,
        0.01891440898180008,
        0.0862485021352768,
        0.03559493273496628,
        -0.007505759131163359,
        -0.033260345458984375,
        0.009781391359865665,
        0.03922053799033165,
        0.02508239820599556,
        -0.03323712199926376,
        -0.009764744900166988,
        0.02281753160059452,
        -0.032749149948358536,
        -0.001979081192985177,
        0.08693940937519073,
        0.05229094251990318,
        0.0681985542178154,
        -0.06761923432350159,
        -0.1123058944940567,
        0.03020610101521015,
        0.02585829608142376,
        -0.10689375549554825,
        -0.040422990918159485,
        -0.08187312632799149,
        -0.059160277247428894,
        0.05041631683707237,
        -0.023783743381500244,
        0.04640432447195053,
        -0.008540002629160881,
        0.09522616118192673,
        -0.09406936913728714,
        0.015224261209368706,
        -0.026963887736201286,
        -0.04005022719502449,
        -0.03837750107049942,
        0.025435175746679306,
        0.014735355973243713,
        -0.0666801780462265,
        0.0641913190484047,
        -0.025662563741207123,
        0.06847035139799118,
        0.05519884079694748,
        0.021924680098891258,
        -0.00011373808229109272,
        -0.038970086723566055,
        0.004879627376794815,
        0.05408536642789841,
        0.014285199344158173,
        -0.021805141121149063,
        -0.04483915492892265,
        -0.10871835798025131,
        -0.00829483475536108,
        -0.007162990048527718,
        0.009769069030880928,
        -0.036239635199308395,
        0.020765691995620728,
        -0.02857978455722332,
        -0.020789947360754013,
        0.13818423449993134,
        0.034996844828128815,
        0.009138865396380424,
        -0.07408246397972107,
        0.005974302068352699,
        0.0913282260298729,
        -0.02362827956676483,
        -0.03840712085366249,
        -0.02242286503314972,
        -0.0033033937215805054,
        0.012189913541078568,
        0.01600232720375061,
        0.030299706384539604,
        -0.1097998172044754,
        -0.054086580872535706,
        -0.042873553931713104,
        0.1234751045703888,
        -0.04867969825863838,
        0.008680712431669235,
        -0.08502589166164398,
        -0.07230943441390991,
        0.02885897271335125,
        -0.024660306051373482,
        0.04606585204601288,
        0.08781830966472626,
        0.0209774412214756,
        -0.003694083308801055,
        0.028278911486268044,
        0.04109087213873863,
        0.04694616422057152,
        -0.04004143550992012,
        -0.0189255028963089,
        0.01654934696853161,
        0.051613468676805496,
        0.021958380937576294,
        -0.04311766475439072,
        0.0021380148828029633,
        -0.0784333348274231,
        -0.015367241576313972,
        -0.04998981952667236,
        -0.08746632933616638,
        -0.05408808961510658,
        0.10267538577318192,
        0.06561940163373947,
        0.03541161119937897,
        0.06671566516160965,
        -0.055599089711904526,
        -0.0030690960120409727,
        -0.069052554666996,
        0.014054251834750175,
        0.005972438026219606,
        -0.002567326882854104,
        1.0486889997532871e-33,
        -0.048721980303525925,
        0.05235091969370842,
        0.003969487734138966,
        0.032141365110874176,
        -0.019682789221405983,
        0.026366638019680977,
        -0.017340058460831642,
        0.013137558475136757,
        0.021837133914232254,
        0.012986928224563599,
        0.017557740211486816,
        0.015974707901477814,
        -0.041013382375240326,
        -0.027750181034207344,
        0.04265077784657478,
        -0.09228787571191788,
        -0.10587601363658905,
        -0.07285364717245102,
        -0.002194981789216399,
        -0.04434659332036972,
        -0.050004538148641586,
        -0.06683309376239777,
        0.016299491748213768,
        -0.027159182354807854,
        -0.013321996666491032,
        0.0950833261013031,
        0.08867669105529785,
        -0.05087396502494812,
        0.0641227588057518,
        0.03142675384879112,
        -0.03666973114013672,
        0.03575490415096283,
        0.010830612853169441,
        -0.03391675278544426,
        -0.033906448632478714,
        0.0607585683465004,
        -0.01389268133789301,
        -0.09930644929409027,
        0.015555732883512974,
        -0.018530074506998062,
        -0.07934454083442688,
        0.013533571735024452,
        -0.08813531696796417,
        0.05052466318011284,
        0.011852005496621132,
        -0.029261117801070213,
        0.018656600266695023,
        0.03894711658358574,
        -0.03927847743034363,
        -0.04482376575469971,
        -0.06982599198818207,
        -0.030657725408673286,
        -0.00042062680586241186,
        -0.015189388766884804,
        0.0017081721452996135,
        -0.0027433899231255054,
        0.05316178500652313,
        -0.012128954753279686,
        0.024034574627876282,
        0.02637077495455742,
        0.009487021714448929,
        0.009988655336201191,
        -0.020346686244010925,
        -0.0452432818710804,
        -0.08430249243974686,
        0.046865176409482956,
        -0.002171472180634737,
        -0.0699022188782692,
        -0.022303683683276176,
        0.04440592974424362,
        0.06239840388298035,
        -0.01342962495982647,
        0.028613625094294548,
        -0.0700938031077385,
        0.03352335840463638,
        0.016312560066580772,
        0.037201255559921265,
        0.026976866647601128,
        -0.04381556063890457,
        0.001247710781171918,
        -0.06411153823137283,
        -0.026343179866671562,
        0.027420129626989365,
        0.03290597349405289,
        0.06563322246074677,
        -0.07343827188014984,
        -0.01662689819931984,
        -0.09511736035346985,
        -0.06574500352144241,
        0.038628630340099335,
        0.01883874088525772,
        -0.06163705140352249,
        0.0027206421364098787,
        0.027415938675403595,
        0.015038499608635902,
        -1.348701974048013e-33,
        -0.05453309416770935,
        0.014179833233356476,
        -0.017586952075362206,
        -0.0006423210143111646,
        0.09707749634981155,
        -0.12002658098936081,
        -0.03571091964840889,
        0.07946733385324478,
        -0.05737985670566559,
        -0.03859187662601471,
        0.05653999000787735,
        0.03153878077864647,
        0.006153922528028488,
        0.023002296686172485,
        -0.010514745488762856,
        -0.009531145915389061,
        0.015662066638469696,
        -0.09529771655797958,
        0.02957248128950596,
        0.07762815803289413,
        0.07664701342582703,
        0.030274804681539536,
        -0.019479302689433098,
        0.05386243388056755,
        -0.0360395722091198,
        0.04295758903026581,
        0.016736064106225967,
        0.009682499803602695,
        0.06734393537044525,
        0.006709840148687363,
        -0.060647085309028625,
        0.02908872440457344,
        0.03074849583208561,
        0.015716552734375,
        0.059033188968896866,
        0.018956322222948074,
        -0.0009431465296074748,
        -0.04306940361857414,
        0.0004982321406714618,
        -0.03771236911416054,
        0.03159090504050255,
        0.04273352771997452,
        0.00919100921601057,
        -0.03450288996100426,
        0.032961733639240265,
        -0.04127092286944389,
        -0.020253779366612434,
        0.027895724400877953,
        0.017522022128105164,
        -0.015356493182480335,
        0.06432466208934784,
        0.055105555802583694,
        -0.05129995197057724,
        -0.00416058162227273,
        -0.09732837975025177,
        -0.03794478625059128,
        0.033226076513528824,
        -0.012529977597296238,
        0.07970922440290451,
        -0.013974308967590332,
        0.09625157713890076,
        0.004137957002967596,
        -0.039219725877046585,
        -0.04133396968245506,
        -0.11250989139080048,
        0.032224733382463455,
        0.11574043333530426,
        -0.01714956760406494,
        -0.027551766484975815,
        0.01641271263360977,
        -0.012872026301920414,
        -0.012270982377231121,
        0.027541982010006905,
        -0.05700124427676201,
        0.0437234602868557,
        0.0348459929227829,
        -0.09522988647222519,
        -0.04989653453230858,
        0.009495521895587444,
        -0.07760061323642731,
        0.06753546744585037,
        0.04890475794672966,
        0.05584046244621277,
        0.030977481976151466,
        0.04823265224695206,
        0.007518318016082048,
        -0.011642048135399818,
        -0.015267702750861645,
        -0.13979212939739227,
        0.06629937887191772,
        -0.010019899345934391,
        0.07395552098751068,
        -0.07721628248691559,
        0.08880046755075455,
        -0.0052923038601875305,
        -5.547270021111217e-08,
        0.07963462918996811,
        -0.03659424930810928,
        0.07609481364488602,
        -0.06870660930871964,
        0.0873224064707756,
        -0.021766923367977142,
        -0.023732682690024376,
        -0.016846541315317154,
        0.0683005228638649,
        -0.004614429082721472,
        -0.02433580718934536,
        -0.03659632056951523,
        -0.006282477173954248,
        0.06405672430992126,
        0.04390529543161392,
        0.14219334721565247,
        0.0040300339460372925,
        0.024277085438370705,
        -0.03284209966659546,
        0.07420466840267181,
        0.00955236330628395,
        0.04865673929452896,
        0.06087642163038254,
        -0.07473506033420563,
        0.053148772567510605,
        0.013859355822205544,
        -0.039694927632808685,
        0.031169600784778595,
        0.05100995674729347,
        -0.040438901633024216,
        -0.03835228085517883,
        0.04451712593436241,
        0.0034416266717016697,
        -0.028441015630960464,
        -0.042282696813344955,
        -0.06638169288635254,
        -0.06238485872745514,
        -0.03338879346847534,
        0.0549151673913002,
        -0.07850959897041321,
        0.04532617703080177,
        -0.04980046674609184,
        0.010410741902887821,
        0.05409189313650131,
        -0.032301343977451324,
        -0.03516852855682373,
        -0.022305117920041084,
        -0.10351142287254333,
        -0.047254350036382675,
        0.0426899753510952,
        -0.02930280938744545,
        -0.0719389021396637,
        -0.07797306030988693,
        -0.08311010152101517,
        0.04801291972398758,
        -0.06699997931718826,
        0.06260944157838821,
        0.021498341113328934,
        -0.06696166843175888,
        -0.02042423188686371,
        0.019530558958649635,
        0.0008180114673450589,
        0.03295106813311577,
        0.05855836719274521
    ]
}