{
    "id": "gX3KV42qXs0",
    "title": "It's like steroids for your phone! - NexDock Wireless",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-05-16T19:00:22Z",
    "video_url": "https://www.youtube.com/watch?v=gX3KV42qXs0",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy"
    ],
    "views": 502511,
    "likes": 18305,
    "comments_count": 1543,
    "description": "Better sleep makes a better you! Check out Eight Sleep at   and use code LMG for $150 off the Pod Cover.  Laptops can be big and bulky, and our phones are getting more and more powerful, so why not just use it as your portable computer? The new NexDock Wireless is here to hopefully make that dream a reality and Riley's here to see if they've made build quality improvements compared to the NextDock Touch from years ago.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 An argument for the ages 1:08 Unboxing 1:44 Design, ports, and specs 4:05 Connection options 4:43 Sponsor - Eight Sleep 5:14 OSD settings and setup 6:20 Initial impressions 8:18 The problem with \"No software updates\" 10:24 Display and speaker impressions 12:43 Does it work with an AYANEO? 14:25 Pricing and overall thoughts 15:44 Outro",
    "description_links": [
        "https://www.eightsleep.com/lmg",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Wow, it's been a while since the whole using your phone as a laptop discourse. For a while there it was real hot. Were you into it? I certainly was. But now it seems like not as many people care about it. Except NexDock. Them and a few other companies are still trying to make lapdocks, which are basically laptops but without a computer inside. It does have a keyboard, mouse or trackpad, and a display that can be used basically as an external monitor for anything with a video output. Which means that the opportunities are limitless. Why are you laughing? It is a product category that some people do laugh at because they say, \"Oh, why would you buy a laptop with no computer inside when you can buy a laptop for like maybe a bit more expensive with a computer inside? Or for the same price? Huh?\" You know, I said this in the previous videos, but it's because this future where you don't have to lug a phone, and a laptop, and your other devices, a power bank, blah, blah, blah. I like this product category, and I'm excited to take a look at this new product. But first, let's see what else is in this box. Got a box within a box. Alright, we have a HDMI to mini HDMI cable. We have the power adapter, which is a 20 Watt PD charger. We have a USB-C to C right angle cable, and that will be for if you don't want to use the wireless mode, you can connect via a cable. And then there is also, oh, it does kind of a nice include. They have a USB-C to USB-A cable. Okay. The device itself, very exciting. There's the NexDock logo. I don't know why that's their logo. I guess it's because that's a device that you can plug into a Pacman, and Pacman turns into the ghost in the video game? The last NexDock that I looked at was the NexDock Touch, which is basically it was not a fully reversible 360-hinge NexDock, and it could only go back to there. So it's nice to see. This is my first experience with the Touch model that they actually have been selling for a while now but in a non-wireless version. So this is the USB-C port that you use for input when they got a helpful little icon there. So that's nice. Specifically for input. Don't plug anything else. Don't. Over here is the mini HDMI port which you can use to, you know, plug in things that don't have USB-C with display port baked in. Over here we have the charging USB-C port that won't carry data. We got a headphone jack. We got a micro SD card slot. That's a nice workaround for phones that don't have built-in expandable storage. We got the power button and a USB-C port over here, which is for data. So that's means that you can also expand your phone or whatever device you're using even more. It's a USB-C hub too. Guys, please like this product! The display here is a 13-inch 1080p? - [David] Yep. - Thank you. It's IPS. So colors should look okay. Down here we got what looks like four speakers? One, two, three, four. And down here the trackpad. That is one area that I really hope that they've improved on. The trackpad in previous models was pretty lackluster, and it had some glitching effects that made things pretty frustrating. So hopefully they've improved that. And the keyboard. Hmm. (keys clicking) Another thing that was lacking in the previous models was flex in the... Well, not lacking, there was too much of it. There was too much flex in the previous models. When you pushed down, you could kind of see the whole thing kind of press in. But that seems to be very much reduced here. It still does a little bit, but a lot better than it was before. Now when you press the power button, I guess it comes into this ready to connect mode. It gives you a little instructions. That's nice. Okay, the two main ways that you can connect to it, USB-C cable and wireless. To connect wireless and use all the keyboard and the trackpad, you're gonna have to use Miracast to cast wirelessly your display. And then you're gonna have to connect the keyboard and trackpad I guess together and the touch screen as Bluetooth devices. Swipe down here with two fingers to show settings. Hello? - [David] It doesn't say swipe down here. - Oh, all that did was bring up our sponsor, Eight Sleep. Sleep is important, and temperature is the most important factor in improving your sleep. Eight Sleep's products allow you to control the temperature on both sides of the bed. Adjustable from 55 degrees Fahrenheit to 110 degrees Fahrenheit. Perfect for partners who prefer different temperatures, like me and my wife. She's always cold. Features such as temperature control and sleep pattern insights are all accessible through their easy-to-navigate app. So head over to the link below and use the code LMG for a nice discount on the pod cover. Okay, what do we got here? We got volume, brightness. Contrast? I'm supposed to know what half sun and, or a half moon and half sun, are these Egyptian hieroglyphics? So you can change between USB-C and HDMI inputs. And right now it's set to cast, and then I don't know what these are. Oh, charging? Oh, can you like disable the charging port maybe? We'll have to see. Alright, let's try casting. So we're using a Samsung phone. If you don't know, Samsung has a whole desktop Android feature called DeX that, you know, turns Android into like a desktop environment like Windows. Start now. And nice! Okay. Boom. Oh, but there's no touchscreen, and I... There's no touchpad, so I have to go here and connect the actual Bluetooth device as well. Okay, so now I'm connected to the keyboard and the touchscreen, and I'm casting. Will this work? It will. Cool. You know, honestly, (laughs) I don't wanna say that I wasn't expecting it to be that smooth, but I wasn't, okay? A full disclosure. Alright, let's start using this thing. Ooh, yep. There's some latency. It's not unusable. This video is not going to be about, you know, Samsung DeX or, you know, that desktop environment like whether how usable it is, although I have heard that it's made some major improvements recently. Like you got windows snapping, you know, it's getting better and better. But this video is not about that. It's just gonna be, I'm gonna try to make it just about the the hardware itself, even though I wanna talk a long time about all of it. I should have done this a bit earlier. You know, the fact that it's a bit stiff while opening means that it can be stiff at multiple different angles which is pretty nice because, you know, as I said, you don't have to use this as like a actual laptop replacement or, you know. a phone dock thing. You can use it just as a monitor. So like you could bring a console around, and like prop this up, and now you're playing video games on your little thing and that's cool too. The other thing I did not mention is that I think these bezels are I think it's a little thicker on the top and the bottom than I remember seeing on the previous NexDock Dutch. Dutch? NexDock Touch back in 2020. So I don't know whether they, I mean, it's kind of disappointing to see a big bezel like that on the bottom here, but you know, again, what are you you asking for? Alright, now we're back to using the touchpad. The biggest weakness and in wireless mode, you know, as you would expect, there's a little bit of latency. It's hard for me to tell right now whether I'd be able to get used to this, but, you know, I can try clicking around and things and see what happens. See. Oh, okay. Does it have tap to click? It does. If you like the idea of using your phone as a computer, this is definitely an option based on the stuff that I've seen so far. I mean, they have the, I think they have Windows snapping here, if I... Yep, bring it over there and there's no running apps. Can I start another one right away? Let's open Firefox. Oh, get, why? Oh, see here. Oh, did you see that? You guys didn't, 'cause you can't see. But I went to, I was trying to click that X, and there was like a ghost, I guess I did a ghost touch on the touchpad, and it jumped all the way down to the bottom. I'm coming into this as somebody who actually is kind of interested in the idea of using like a phone as a PC. And the touchpad remains in every model that I've tested, it remains the thing that turns me off the most. I'm like, this isn't ready, not because of the software or other elements of the hardware, it's literally just the touchpad. It might be kind of basically the same model of touchpad as it was in the previous ones, which is definitely disappointing. And the thing about having hardware problems with a product like this is that, you know, oh, whoops, I turned it off. What are you doing NexDock? So I accidentally hit the power button and then that means it breaks the whole connection. I don't know whether that's that... That's the thing. So the point I was just going to make is that if there's an issue with the hardware, they can't fix it with like a firmware update or a software update because there's no, there's nothing in here except the keyboard, and the touchpad, and the monitor, and there's no processor or anything. There's nothing to push an update to. On the one hand, that's an advantage because, you know, according to the NexDock, it's like you don't have to worry about driver updates. You don't have to worry about glitchy stuff and, you know, trying to fix it. But the con is the same thing. It's like there's no driver updates. So anyways. Rant over. Oh, okay. Alright, well, well that's a plus. At least, you know, I started DeX up again and it automatically was right, it was still connected via Bluetooth. So that's something, but still. So touchpad experience, usable, but on the border. So what happens if I put, okay, that brings up the apps, kind of like ChromeOS. Firefox, okay. Oh, see right there, I'm trying to click on stuff. I might have to rescind my rating of this trackpad as usable. So we tried to enable a refresh rate in the developer options. Understandably, the phone, you know, isn't quite ready to, I guess Android maybe... Correct me if I'm wrong in the comments. Android isn't ready to show you the refresh rate of an external display. Or maybe it can, but I'm not an Android developer. I don't know how. It says 60 over here, but it won't tell me what this is. Based on the information we can see online, this is a 30 Hertz display, which is definitely, you know, it's okay, it's not so great in a world in which we're used to seeing 60 fps laptop displays at least, 30 Hertz, 1080p display is a little lackluster. But, you know, what are you gonna do? Okay, alright. That saga is done. (upbeat music) Okay, full screen. But then you actually have to fullscreen the... Because in DeX... What? Wow, because in DeX you have your, like each one of your windows is like, it's acting as if it's an Android device with the screen that size. So I fullscreened it within the window, but now I have to fullscreen the actual window itself. That's a little annoying. (upbeat music) You know, honestly, this is so great. Honestly, they're not great, but they're actually better than I thought they would be. I think they are improved over the previous NexDock model. You know, it's not the worst speakers I've ever heard in a laptop. They're not good speakers. It's a good thing there's a touchscreen because I'm getting frustrated with the touchpad and using the touchscreen more often than I would like for sure. Okay, we're at 4K quality on a 1080p display here. I mean, I like the colors. The colors look, you know, pretty vivid. See now this, the other thing is that we're going wireless here. This is on a wifi connection, and so like I saw a little bit of stuttering there, just like a tiny bit, but it seems to have recovered. So you know, there is that potential when you're streaming wireless video that you're gonna get some artifacts like that. But overall I'm pretty impressed. Like this looks great. I forgot that it was wireless. That's enough crabs. There's a 44 Watt hour battery in the NexDock Wireless, which is actually less than the one that was in the NexDock Touch. Although I can kind of understand that because this thing is, as far as I can tell, quite a bit thinner than the other one was. It's not too heavy either, which is understandable, you know, for the reasons that I've said, no computer, et cetera, et cetera. Now, since the last video I did on the NexDock, there has actually been a fairly interesting development. The rise of these gaming handhelds based on both Windows and Linux, SteamOS, powerful handheld computers that you can use as computers in addition to like, you know, gaming handhelds. I won this AYANEO at the Christmas party so I've got this Windows handheld, it's still running Windows 10. I'll probably have to connect via Bluetooth to the keyboard the same way probably. Connecting to your device. Come on. Or unless, maybe it just timed out. Connected duplicate. Oh, whoa, whoa. We got some artifacting here. Alright. Some protocol is confused. It's not breaking, I think. Nice. Okay. So hear me out here. You don't wanna get a laptop, but you do wanna get one of these handheld devices that are so, so, so popular. And all of these gaming devices, they're small, they're portable, they have really powerful processors in them. If you have a Steam Deck, which has a desktop mode, right? I haven't used it, but I've heard that it exists. Or you have one of these Windows-powered gaming handhelds, look at that, you got... Now you have both. But I hear some of you saying, Riley, this thing is, well, the wireless version is 349, and the non-wireless version is 299. You can get Chromebooks for that price, and Chromebooks are a much better value for your money. Are they though? \"Cause if you've been paying attention, you might have noticed recent news, the fact that Chromebooks in education markets have just kind of broke after a few years. Because they break all the time because they're cheap. Is the hardware in this thing that much better? If you've been watching this video, you might be able to tell that, okay, no it's not that much better. But I still wanna hold onto this future, okay? Listen, this product doesn't make sense for a lot of people. Most people shouldn't buy this. But I think that the improvements that I've seen have been just enough to keep my faith in the idea that one day we could potentially have a situation where this is our phone, and our laptop, and our regular computer, and we just kind of have docks that we just like use when we have to. I know that I'm foolish, I know it's just a dream, but I believe. NexDock, fix your fricking trackpad, please. And 60 Hertz on the display. And then we can talk more next time. Hey, thanks for watching this video, guys. If you wanna watch something else, you could watch the previous review I did on this, on the NexDock Touch back in 2020. It's a little old, but that's the last time anyone in the world I think thought about this idea, so.",
    "transcript_keywords": [
        "thing",
        "NexDock",
        "USBC",
        "NexDock Touch",
        "USBC port",
        "kind",
        "Touch",
        "phone",
        "video",
        "Windows",
        "nice",
        "laptop",
        "wireless",
        "display",
        "touchpad",
        "previous",
        "Android",
        "bit",
        "NexDock Touch back",
        "keyboard"
    ],
    "transcript_entity_values": [
        "110 degrees Fahrenheit",
        "half",
        "NexDock Dutch",
        "NexDock Touch",
        "the NexDock Wireless",
        "Samsung DeX",
        "Hertz",
        "three",
        "One",
        "60",
        "one",
        "LMG",
        "USB",
        "4",
        "Riley",
        "299",
        "the NexDock Touch",
        "NexDock",
        "55 degrees Fahrenheit",
        "Egyptian",
        "Dutch",
        "Windows",
        "NexDock",
        "Miracast",
        "Pacman",
        "349",
        "2020",
        "Samsung",
        "Windows",
        "Linux",
        "13-inch 1080p",
        "Chromebooks",
        "DeX",
        "a half moon and half",
        "a few years",
        "first",
        "HDMI",
        "two",
        "Firefox",
        "Windows 10",
        "1080p",
        "Android",
        "four",
        "30",
        "one day",
        "Eight",
        "USB-C",
        "AYANEO",
        "44 Watt hour",
        "SD",
        "Pacman",
        "jack",
        "Christmas",
        "DeX",
        "20"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "FAC",
        "GPE",
        "QUANTITY",
        "NORP",
        "NORP",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "NORP",
        "GPE",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "GPE",
        "CARDINAL"
    ],
    "vector": [
        -0.07214207947254181,
        0.08666558563709259,
        0.0999242514371872,
        -0.05577210709452629,
        0.09157059341669083,
        0.020528333261609077,
        0.019880546256899834,
        0.04159801825881004,
        0.017755519598722458,
        0.004007106646895409,
        0.02141880802810192,
        0.010336281731724739,
        0.05166397616267204,
        -0.02418176457285881,
        0.019550101831555367,
        -0.04432188719511032,
        0.12039105594158173,
        -0.10743040591478348,
        -0.03178652003407478,
        -2.6479676307644695e-05,
        -0.05618250370025635,
        -0.00929218903183937,
        0.010388500057160854,
        -0.021784987300634384,
        0.03271017596125603,
        -0.021276608109474182,
        0.009913823567330837,
        -0.0772060751914978,
        -0.024923527613282204,
        0.02439657598733902,
        -0.03676198795437813,
        0.09880436211824417,
        -0.02072058990597725,
        -0.03855418041348457,
        -0.012501819059252739,
        -0.08599939942359924,
        -0.03750801086425781,
        -0.008231469430029392,
        -0.10594107210636139,
        -0.04443726688623428,
        -0.05066027119755745,
        -0.07883164286613464,
        0.006551433354616165,
        0.07601159811019897,
        0.01666443794965744,
        -0.048390794545412064,
        -0.011164942756295204,
        -0.05784313380718231,
        0.05639852583408356,
        0.04385288432240486,
        0.03651874512434006,
        -0.0320008359849453,
        0.04462825134396553,
        0.02224193699657917,
        -0.06780125945806503,
        0.040435463190078735,
        -0.016526181250810623,
        0.04082184284925461,
        0.04228502884507179,
        0.007792698219418526,
        0.06579805910587311,
        -0.06715857982635498,
        -0.00787591002881527,
        0.036687221378088,
        0.01907125860452652,
        -0.015181293711066246,
        -0.06935930997133255,
        0.08402238041162491,
        0.04319145530462265,
        0.05398257076740265,
        0.033378567546606064,
        0.0064402916468679905,
        0.048588212579488754,
        -0.02694922685623169,
        -0.022642172873020172,
        -0.010650510899722576,
        0.053793251514434814,
        -0.015630915760993958,
        0.0031427135691046715,
        0.03531093895435333,
        -0.0008499656105414033,
        0.02489292062819004,
        0.02747424505650997,
        -0.03843225911259651,
        0.07030436396598816,
        -0.023313215002417564,
        0.011961794458329678,
        0.019261861220002174,
        -0.09146838635206223,
        -0.11785697191953659,
        0.034720685333013535,
        0.10445576906204224,
        -0.006829764693975449,
        0.00783245638012886,
        -0.0408560112118721,
        -0.024022987112402916,
        -0.003713857615366578,
        -0.029066110029816628,
        -0.09336365014314651,
        0.03798683360219002,
        0.05533936619758606,
        0.09925099462270737,
        0.03920412063598633,
        -0.0037934165447950363,
        -0.014529643580317497,
        -0.07164925336837769,
        0.015540647320449352,
        -0.021706420928239822,
        0.03431281819939613,
        0.026593133807182312,
        -0.049139246344566345,
        -0.04733496904373169,
        -0.09054933488368988,
        0.004518116358667612,
        -0.01330381166189909,
        0.04282040894031525,
        -0.030960507690906525,
        0.08332917094230652,
        0.13396745920181274,
        -0.004574005492031574,
        0.025789527222514153,
        -0.023296723142266273,
        -0.003974437713623047,
        -0.06515678763389587,
        0.05099025368690491,
        0.042320799082517624,
        -0.08622381091117859,
        3.310431966231526e-33,
        -0.017332397401332855,
        0.009283728897571564,
        -0.09372319281101227,
        -0.0033734706230461597,
        0.06340991705656052,
        -0.04930700361728668,
        0.011521494947373867,
        0.017950918525457382,
        -0.048038139939308167,
        0.050030630081892014,
        -0.072125144302845,
        0.02070758119225502,
        -0.0713769793510437,
        0.05131981521844864,
        0.06095493957400322,
        -0.12320844829082489,
        -0.05981212854385376,
        -0.02049064263701439,
        -0.004742166493088007,
        -0.007931703701615334,
        0.04093140736222267,
        -0.06905268877744675,
        -0.015544082969427109,
        -0.07619836926460266,
        0.04974135383963585,
        -0.012310050427913666,
        0.03683202341198921,
        -0.05603288486599922,
        0.04538079723715782,
        0.049595482647418976,
        -0.08038144558668137,
        -0.04772143065929413,
        -0.017361704260110855,
        -0.10172712802886963,
        -0.06388112157583237,
        -0.03147086501121521,
        -0.07817938178777695,
        -0.06235342472791672,
        0.09782624244689941,
        -0.012584352865815163,
        -0.08244497328996658,
        -0.009160326793789864,
        -0.03944116830825806,
        -0.11632430553436279,
        0.0160105898976326,
        -0.029641110450029373,
        0.08175497502088547,
        0.029043113812804222,
        0.029687201604247093,
        -0.008424853906035423,
        -0.0163174569606781,
        -0.071661576628685,
        -0.07732703536748886,
        -0.040552105754613876,
        -0.051990024745464325,
        -0.10841786116361618,
        -0.009104287251830101,
        0.05056331306695938,
        0.08835537731647491,
        0.06442483514547348,
        -0.048427022993564606,
        0.001963281538337469,
        -0.00173435197211802,
        -0.009463208727538586,
        -0.04806303232908249,
        0.06077245622873306,
        0.023758050054311752,
        0.01854625716805458,
        -0.06464914977550507,
        0.028835313394665718,
        0.017221763730049133,
        0.00908419769257307,
        0.0609026663005352,
        -0.04364372417330742,
        0.0678318664431572,
        0.02389126643538475,
        -0.04110961779952049,
        -0.045059964060783386,
        -0.05873441323637962,
        -0.014057544060051441,
        0.0020326313097029924,
        0.00711569469422102,
        -0.01890692114830017,
        0.035785920917987823,
        0.03886109218001366,
        -0.06801217794418335,
        0.0035457974299788475,
        -0.04492011293768883,
        -0.07875476032495499,
        0.1040559634566307,
        -0.04263303428888321,
        0.04402477666735649,
        -0.08629608899354935,
        0.01333570759743452,
        -0.08598826825618744,
        -3.359127187056324e-33,
        -0.016213903203606606,
        -0.004377627279609442,
        -0.008257217705249786,
        -0.03240025043487549,
        0.024277864024043083,
        -0.017809441313147545,
        0.06869728863239288,
        -0.01638604700565338,
        -0.02363508753478527,
        -0.03910501301288605,
        -0.03692784905433655,
        0.04128820076584816,
        -0.05004671961069107,
        -0.009815232828259468,
        0.01969573087990284,
        -0.03581700846552849,
        -0.0015661311335861683,
        -0.09990553557872772,
        0.015806537121534348,
        -0.08788436651229858,
        0.025892550125718117,
        -0.0010109350550919771,
        -0.02156534604728222,
        0.06832324713468552,
        -0.010651339776813984,
        0.0168988648802042,
        0.0560574010014534,
        0.055010464042425156,
        0.013116182759404182,
        -0.021205686032772064,
        -0.059142135083675385,
        -0.06246916204690933,
        0.0007896644528955221,
        0.043546780943870544,
        0.12584134936332703,
        0.04841192439198494,
        0.020715730264782906,
        0.06511979550123215,
        -0.005730186589062214,
        -0.04911515489220619,
        0.09864793717861176,
        -0.06399068236351013,
        0.016056900843977928,
        0.00475307647138834,
        0.0520106740295887,
        -0.045280296355485916,
        -0.1257999986410141,
        0.02993112802505493,
        0.0022291645873337984,
        0.008979878388345242,
        0.06176947429776192,
        -0.047088079154491425,
        -0.010129512287676334,
        0.022367607802152634,
        -0.03866202011704445,
        -0.020186202600598335,
        -0.032881900668144226,
        -0.016827814280986786,
        -0.023644743487238884,
        -0.04391563683748245,
        0.09315506368875504,
        0.007486711256206036,
        -0.004724544007331133,
        0.021341389045119286,
        -0.0004334857512731105,
        -0.03327220678329468,
        0.030757924541831017,
        0.06408274173736572,
        -0.03129246458411217,
        0.06535085290670395,
        -0.03155156597495079,
        -0.014981893822550774,
        -0.007979417219758034,
        -0.025821521878242493,
        -0.02553909830749035,
        0.001977818552404642,
        0.09557995200157166,
        -0.008508659899234772,
        0.014272322878241539,
        -0.07528351992368698,
        0.002388488734140992,
        0.03630302473902702,
        0.06653125584125519,
        -0.07512277364730835,
        0.06238958239555359,
        0.03767528012394905,
        0.03537625074386597,
        0.029519371688365936,
        0.02061856910586357,
        0.03554944694042206,
        -0.027756569907069206,
        0.03896639868617058,
        -0.09862788021564484,
        0.11521603912115097,
        0.05506927892565727,
        -5.943276448761026e-08,
        -0.0021508827339857817,
        -0.0030229026451706886,
        0.06790617853403091,
        0.03924140706658363,
        -0.0691542774438858,
        -0.07686320692300797,
        0.09014482796192169,
        -0.05232452228665352,
        0.07892297953367233,
        0.022032974287867546,
        0.024711178615689278,
        -0.09587736427783966,
        -0.047806497663259506,
        0.03171152621507645,
        0.009831472299993038,
        0.09750079363584518,
        -0.01690218225121498,
        0.014950750395655632,
        -0.01309624407440424,
        -0.0503036230802536,
        -0.0008026444702409208,
        0.05604955181479454,
        0.018357332795858383,
        -0.015535105019807816,
        0.02465517446398735,
        0.06076592206954956,
        0.04274265468120575,
        0.050023362040519714,
        0.12402188777923584,
        -0.06592285633087158,
        -0.0746711865067482,
        -0.04210482910275459,
        -0.016643518581986427,
        0.0481351874768734,
        -0.03732633218169212,
        -0.042707134038209915,
        -0.055524177849292755,
        0.008539853617548943,
        0.04237011447548866,
        0.024497970938682556,
        -0.044913653284311295,
        -0.06029275804758072,
        0.00025870781973935664,
        -0.017541244626045227,
        -0.03145301714539528,
        -0.10980571061372757,
        -0.010231961496174335,
        -0.044678930193185806,
        0.041551314294338226,
        0.07054591923952103,
        -0.023548215627670288,
        -0.06788831204175949,
        0.03413090109825134,
        0.02142699807882309,
        0.05226581171154976,
        0.0473976768553257,
        -0.009501160122454166,
        0.0394841693341732,
        0.04699203372001648,
        0.05129091441631317,
        -0.006190594285726547,
        -0.04443923383951187,
        -0.022757183760404587,
        0.11129044741392136
    ]
}