{
    "id": "gZeg2LMBQ20",
    "title": "Note 20 Ultra review: big phone, small updates",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-08-18T14:00:09Z",
    "video_url": "https://www.youtube.com/watch?v=gZeg2LMBQ20",
    "category": "Science & Technology",
    "tags": [
        "samsung",
        "galaxy",
        "galaxy note 20",
        "note 20",
        "galaxy note 20 ultra",
        "samsung note 20",
        "smartphone",
        "stylus",
        "s pen",
        "review",
        "tech",
        "verge",
        "the verge",
        "dieter bohn",
        "dieter",
        "technology",
        "gadgets",
        "samsung galaxy",
        "samsung event",
        "samsung electronics",
        "samsung galaxy note 20 review",
        "samsung ultra",
        "samsung galaxy note 20 ultra",
        "note 20 ultra",
        "samsung review",
        "note 20 ultra camera test",
        "samsung galaxy s20 ultra",
        "note 20 vs pixel 4",
        "note 20 review"
    ],
    "views": 337901,
    "likes": 7858,
    "comments_count": 636,
    "description": "Samsung's Galaxy Note 20 has nearly every top-end spec you could ask for on an Android phone, including a massive 6.9-inch high refresh rate 120Hz screen. The camera system fixes what was wrong with the S20 Ultra. And Samsung Notes is ...really good? It's really good, especially with the S Pen stylus.  Read the full review here:   If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:   Preorder your Galaxy Note 20 Ultra here:   Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/3aEOkwv",
        "http://bit.ly/2TQsqjB",
        "https://bit.ly/2EhnBu4",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- Samsung Galaxy Note 20 Ultra. (upbeat music) It is big, it's also pretty, it has a great screen, there is a huge camera above. It's actually a bit like the Galaxy S20 Ultra version of the same phone like, okay, actually a lot like Galaxy S20 Ultra, Galaxy Note 20 Ultra, S20 Ultra, Note 20 Ultra. Sorry, look, we'll get into a few of the differences between these two phones later. The main point right now is that well, I don't like that the Note 20 Ultra starts at 1300 bucks, I do like this phone and there's not some grand Samsung reinvented the Note story to tell here. It's just, you know, it's a big phone, but what I like about it, and a few of the things that I don't really like about it, turn out to be just a lot of little things. We should, we should just get into it, let's get into it. (upbeat music) So not every phone review is about spec. Some phones have kind of mediocre spec. Like here's the Pixel 4A, it's not a mediocre spec, but it's a really good phone. But this is the Note Ultra with a capital U. And so yeah, people going for this phone are gonna care about the spec. So let's just talk about some key ones right at the top. It has a 6.9-inch quad HD plus display that supports HDR 10 plus, it is of course OLED and has 120 Hertz refresh rate, and a first for Samsung, it is a variable refresh rate. Samsung says that it can go all the way down to 10 Hertz if nothing is moving on the screen, and that is supposed to save battery life. Besides refresh rate, the screen is great. I love the colors, I love the pixel density. I don't even mind how it curves around on the sides, but I'm gonna talk about the refresh rate again. It really matters on a phone of this class and it really does look great. You can feel it just all over the operating system. Now, one thing you should know is you can't have the max refresh rate at 120 and get the maximum resolution on the screen, but I don't care. Give me the refresh rate. It has 12 gigs of RAM, which, to me, is enough for an Android phone to do a bunch of multitasking. And the $1,300 version of this phone has 128 gigs of storage, which, really Samsung? I know that it's expandable with micro SD, but it can't spring for 256 at this price point? Come on. Anyway, the 512-gig version costs an extra 150 bucks on top of that. The processor in this is the Snapdragon 865 Plus, and of course it supports both millimeter-wave and sub-6 versions of 5G. Because Samsung wants U.S. carriers to actually care about this phone. U.S. carriers only care about 5G, so it's got 5G. Ah, 5G rent over. It's got a 4500-milliampere battery, and I'm getting five, sometimes six hours of screen time with pretty heavy use of this thing. Overnight on standby, it's draining like maybe 10%. So I think battery life is great. I mean, it should be, this is, as I've said, a big phone. It's got in-screen ultrasonic fingerprint sensor, wireless charging, reverse wireless charging, stereo speakers iP 16, water resistance, Bluetooth 5, this S pen here, this huge camera bump here. Actually, we're gonna save the camera on the S Pen for later 'cause there was a lot going on there, but anyway, you get the point. The specs on this phone are great. This phone is fast and the design of this phone, well, it's very noting and it's very ultra heat, but I mean, this Galaxy Notes are big, but they're also like properly squared off at the corners here. They make you think of a slab, and I think that's actually good for what a note is that it feels like a slab. There's this new matte finish on the back that I think looks better than glossy, but it's also just a little bit more slippery actually, at least it feels that way to me. Now for this thing being ultra E, what does ultra E mean? Well, here's what I think that means. This thing right here, this camera bump, it's a mesa. It is a huge flat outcropping rising spontaneously out of the vast desert, that is the back of this phone. It's big and it's squared off. In fact, it's even bigger than the gigantic camera bump on the Galaxy S20 Ultra. So what do you get out of this bump? (upbeat music) We're gonna go from easy to talk about to complicated when we talk about the many cameras on the Note 20 Ultra. First is the ultra wide angle camera and that one's simple, it's got a 12 megapixel sensor and the photos that come out of it are okay but not stunning, which is kind of par for the course for ultra wide cameras. Then there's the selfie camera, which is just 10 megapixels. And what is happening here, Samsung? I have turned off every face filter option that I could find, and it is still painting bad makeup all over my face. I literally looked like a ham in this photo. I know that there's good camera inside this phone here somewhere, could be so try hard about doing all this face smoothing with it. Telephoto. There's good news for the telephoto lens. It has a 12 megapixel sensor and it uses a periscope to extend the range so it can do 5x optical zoom and up to 50x space zoom digitally. Now it's interesting is that is a smaller megapixel count and a smaller zoom than what it is on the galaxy S20 Ultra. And you know what? Good, even at 50x on this thing, things don't look great, but they still look better than they did at 100x on other phone. It's still kind of a party trick once you get over 10x or 15x. But you know what's great? Having a photo that zoomed in 10 or 15 times that I would actually be willing to post somewhere. I like the zoom on this camera. Okay, so the main camera on here is your standard wide angle lens, but it has Samsung's 108 megapixel sensor behind it. Now, usually those pixels get combined or binned into just a 12 megapixel image, but you can take 108 megapixel sensor image full-size thing if you want. And you know what, this is the juice right here. Samsung's whole deal with the ultra phones is it wants to take this big 108 megapixel sensor and do cool stuff with it. It is how Samsung wants to separate itself out from Google and Apple in the photography department. Now, what it tried to do before with the Galaxy S20 Ultra, that didn't go so hot because this sensor just couldn't focus fast enough. And I am happy to say that on the Note 20 Ultra, that problem has been fixed with a laser. It's using lasers for autofocusing, and I haven't had a problem with focusing speed at all. I just want to say that using this camera system here is the blast. You have so many options, but they're all kind of approachable, even in Pro mode, it's kind of approachable. And as long as you're in good light, you can just mess with them all and get really good results, like you can shoot video in 8K if you want to. I don't think you should, but you totally can. But what you can also do in the Pro camera mode is mess with the microphones. You can use the front-facing mic, the rear-facing mic, an omni mic that listens everywhere, a Bluetooth microphone like in your earbuds or whatever, or USB microphone. And typically I'm not the kind of person that thinks that shooting \"Pro\" video on a phone makes a lot of sense, but it's actually starting to make more sense to me here. They just up the quality a little bit, get closer to an iPhone 11 Pro, you could do some really interesting things with this thing. Oh yeah, picture quality. We should talk about the pictures that come out of the thing. The Note 20 is still a half step behind the Google Pixel 4 or the Apple iPhone 11 Pro. Part of that is just the color balance that Samsung likes. And we can agree to disagree on color balance, but I just can't get on board with over sharpening and over smoothing that Samsung tends to do. Now, interestingly, sometimes that works in the Note 20's favor. So with night mode, I actually prefer the Note 20's photos to the Pixel 4's photos, because everything just looks a little bit smoother in the dark in a way that feels actually kind of natural. (upbeat music) So usually talk about the cameras is like the most interesting differentiated thing on a high-end smartphone, but with the Note 20, that's not actually the case. The main reason to get a note really is the S pen. And I think that Samsung has done something really special with it this year. Now I am not talking about the waggy air gestures that you can do to control your phone from far away. I'm not talking about the fact that the stylus is finally on the left-hand side of the phone, so lefties get a year where they feel special instead of righties always getting the year. I'm also not talking about the improved latency when you're writing on the screen, although I got to say that really is noticeable, it really does feel really good to write on the screen, nope, I'm talking about something else and can't believe I'm gonna say this, but I am talking about Samsung's Notes app. It might be the best Notes app that you can get on a phone. Yes, I just said that. But look, Samsung's Notes app already did stuff that Apple Notes is just catching up to and Microsoft's OneNote on mobile can't do it all, like let you highlight your handwriting and then copy out the plain text. It also lets you export to docs or like now you can export to PowerPoint. It has really, really good handwriting recognition, even on my terrible handwriting, and God, I love the software that it's keep on coming, it can realign your handwriting so that it looks nicer straight down on a page. It seems dumb but it really does matter when you try to come back to them later. It can natively annotate PDFs finally, but still Samsung also add a folder organization this year if you care about that. It can do the thing where it records audio while you're taking notes, and then later on you can go look over your notes again, tap on the spot where you jot something down and you can hear what the phone recorded. That is great for interviews or for lectures or whatever. I mean at this point, the only thing I don't like about Samsung notes is that it's Samsung. That's a really mean thing to say. What I mean is that it's really, really good on the note and everywhere else, ugh. Did you know that there's a PC version of Samsung Notes? I just learned that because now they've added instant syncing for Notes there, so that's helpful. But the really big deal is later on this year, they're going to add the option to integrate with Microsoft OneNote. Now it's only an export from Samsung Notes to OneNote, but what that means is all of the work that you put into taking a bunch of notes in this thing won't be stuck on this thing or the next thing, you can actually buy a different phone someday and just use Microsoft OneNote. You might not be hanging with me on this one. You might not believe that Samsung Notes is great, but I promise you it's great. But even if it's great, it doesn't mean that you should buy this phone to get Samsung Notes, but you know what, credit where due. And actually speaking of OneNote and Microsoft, there are a bunch of integrations coming, reminders and tasks will sync both ways to Outlook, you're gonna be able to run multiple Android apps at once on your windows PC, and of course Samsung and Microsoft are touting the note as this great Xbox Game Pass Ultimate phone and yeah, playing Xbox games on a relatively huge phone screen is pretty great, also (mumbles). (light music) So after all that, yeah, Samsung Galaxy Note 20 Ultra, I think it's pretty good, but the things that make it good are all of the little things like Samsung Notes, better low light photography, all those microphone options when shooting video, the variable refresh rate, variable refresh rate making battery life better, no fingerprint smudges on the back, the low latency on the stylus. They're all really nice, but none of them are a reason to go out and buy this phone. If you've got a Note 10 or even a Note 9, I really don't think you should upgrade. You know, one of the reasons that people buy a Note phone isn't the stylus is because it's a super nice kind of flashy phone. But this is not a flashy update, it's more like a spec bump, (laughs) bump, it's more like a spec bump over the last year, but that still makes it one of the best top tier Android phones that you can buy right now. And that, that's not a little thing. Hey everybody, thanks so much for watching. Let me know what you think of the Note 20 Ultra downstairs in the comments. Are you waiting for the Fold or maybe you want to get a OnePlus instead? Talk about that down there. If you're looking for another video to watch, Becca just reviewed the Galaxy Beans. That's what they're called. Not the Buds Live, the Beans. They're headphones, we call them Beans.",
    "transcript_keywords": [
        "Samsung Notes",
        "Samsung Galaxy Note",
        "Samsung",
        "Note",
        "Ultra",
        "phone",
        "Notes",
        "Samsung Notes app",
        "Galaxy Note",
        "thing",
        "Samsung Galaxy",
        "Galaxy",
        "Note Ultra",
        "camera",
        "great",
        "refresh rate",
        "good",
        "Notes app",
        "Note phone",
        "refresh"
    ],
    "transcript_entity_values": [
        "6.9-inch",
        "11",
        "the S pen",
        "Galaxy S20 Ultra",
        "Android",
        "108",
        "one",
        "Apple",
        "the last year",
        "128",
        "1,300",
        "Overnight",
        "USB",
        "10%",
        "Fold",
        "Bluetooth 5",
        "Google",
        "S20 Ultra",
        "8",
        "120",
        "5",
        "six hours",
        "the S Pen",
        "Telephoto",
        "5x",
        "512",
        "10 or 15",
        "the Galaxy S20 Ultra",
        "4500",
        "Samsung Notes",
        "Becca",
        "20",
        "Outlook",
        "Hertz",
        "just 10 megapixels",
        "Samsung",
        "an extra 150 bucks",
        "half",
        "OneNote",
        "the Buds Live",
        "the Galaxy S20 Ultra",
        "12",
        "256",
        "4",
        "the Snapdragon 865 Plus",
        "12 megapixel",
        "this year",
        "millimeter",
        "Xbox",
        "Notes",
        "Samsung Galaxy Note 20",
        "1300 bucks",
        "five",
        "micro SD",
        "Microsoft",
        "first",
        "about 5",
        "the Galaxy Beans",
        "PowerPoint",
        "RAM",
        "16",
        "the year",
        "max",
        "U.S.",
        "First",
        "108 megapixel",
        "OnePlus",
        "10"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "TIME",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "EVENT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "GPE",
        "ORDINAL",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL"
    ],
    "vector": [
        -0.07059669494628906,
        -0.006891935132443905,
        0.05367039889097214,
        -0.04047628492116928,
        0.020785357803106308,
        0.02058296464383602,
        -0.03892906382679939,
        0.10876092314720154,
        -0.013696881011128426,
        0.03121117874979973,
        0.05129150301218033,
        0.12200140208005905,
        0.03829691559076309,
        0.027560239657759666,
        0.07158061861991882,
        -0.04706595838069916,
        0.1252824068069458,
        -0.10826850682497025,
        -0.06849529594182968,
        0.04123684763908386,
        0.05399175360798836,
        -0.06051268056035042,
        0.0013024704530835152,
        -0.023554913699626923,
        0.007101521827280521,
        0.00869607925415039,
        -0.08829762041568756,
        -0.07507701218128204,
        -0.016806382685899734,
        -0.02009563148021698,
        0.015565026551485062,
        0.13842825591564178,
        -0.0017790879355743527,
        -0.012037690728902817,
        -0.049868881702423096,
        -0.11746819317340851,
        0.025459861382842064,
        0.013248465023934841,
        -0.004221033304929733,
        -0.02102428860962391,
        -0.019286444410681725,
        -0.03277496248483658,
        0.027388574555516243,
        -0.020259853452444077,
        0.05815425142645836,
        -0.08880297839641571,
        0.024671336635947227,
        -0.007862040773034096,
        -0.02956378273665905,
        -0.050816070288419724,
        -0.019837606698274612,
        -0.06907833367586136,
        0.006235720124095678,
        -0.02082248590886593,
        -0.03488240763545036,
        0.04892551153898239,
        0.020555289462208748,
        -0.011350451968610287,
        0.08367902040481567,
        -0.08140367269515991,
        0.06648167222738266,
        -0.08136019855737686,
        0.031501445919275284,
        0.005967592354863882,
        -0.028748737648129463,
        0.05263352394104004,
        0.03786304220557213,
        -0.06252554059028625,
        0.011743558570742607,
        -0.0003297055955044925,
        -0.022265249863266945,
        -0.0044662863947451115,
        0.014603323303163052,
        0.04220278188586235,
        -0.04696359857916832,
        -0.026392236351966858,
        0.02546478621661663,
        -0.012704383581876755,
        -0.03791886940598488,
        -0.0412246510386467,
        0.06930042058229446,
        -0.11836713552474976,
        -0.009686554782092571,
        -0.05240267142653465,
        0.05422499403357506,
        -0.028053993359208107,
        0.015220405533909798,
        -0.006652535870671272,
        -0.08213139325380325,
        -0.03579314425587654,
        -0.006601953878998756,
        0.059314075857400894,
        -0.08502146601676941,
        -0.008806577883660793,
        -0.05667988955974579,
        0.01709458976984024,
        -0.07904722541570663,
        -0.07256791740655899,
        -0.023681294173002243,
        0.013296032324433327,
        0.10405269265174866,
        0.07602725178003311,
        0.08580541610717773,
        0.006376753095537424,
        0.0778387039899826,
        -0.03684147074818611,
        0.023202968761324883,
        0.005715621169656515,
        -0.018131310120224953,
        -0.0007985464762896299,
        0.027817022055387497,
        0.075048066675663,
        -0.033346161246299744,
        0.06331533938646317,
        0.023839406669139862,
        -0.0552404411137104,
        0.005774907302111387,
        0.04046989604830742,
        0.08686921000480652,
        0.052578963339328766,
        0.008409745059907436,
        0.004667792934924364,
        -0.1349988579750061,
        -0.07940683513879776,
        -0.009796460159122944,
        0.05996708944439888,
        -0.04934152960777283,
        3.4390461092328545e-33,
        -0.02316921576857567,
        0.12559518218040466,
        -0.06144765391945839,
        -0.01359621249139309,
        0.02766784466803074,
        0.02874786965548992,
        0.004236519802361727,
        0.06127222999930382,
        -0.0032014313619583845,
        0.005521636921912432,
        -0.02000175602734089,
        0.006077663507312536,
        0.018244454637169838,
        0.09567797183990479,
        0.059784889221191406,
        -0.05147351324558258,
        -0.06087392941117287,
        -0.004546459764242172,
        -0.01739022508263588,
        -0.008376801386475563,
        -0.006138868164271116,
        -0.0034493152052164078,
        -0.0061347028240561485,
        -0.01800249144434929,
        0.011872455477714539,
        0.008391430601477623,
        0.07395320385694504,
        0.038256287574768066,
        0.03642401844263077,
        -0.0005459334352053702,
        -0.11759510636329651,
        -0.016832489520311356,
        0.06345180422067642,
        -0.029299873858690262,
        -0.003986256662756205,
        2.622120973683195e-06,
        -0.006084420718252659,
        -0.05346599593758583,
        0.04730841517448425,
        -0.09869951009750366,
        -0.0038604377768933773,
        0.09993960708379745,
        -0.10633183270692825,
        0.055197540670633316,
        0.02160513401031494,
        0.07798455655574799,
        -0.021845396608114243,
        0.023989975452423096,
        -0.009586122818291187,
        -0.004327906295657158,
        -0.009630360640585423,
        -0.02549322322010994,
        -0.0671171098947525,
        0.02626589499413967,
        -0.053781941533088684,
        -0.010649265721440315,
        0.0013171276077628136,
        -0.06412304192781448,
        -0.02753565087914467,
        0.07167504727840424,
        0.032663989812135696,
        -0.009690329432487488,
        -0.08485566079616547,
        0.051626019179821014,
        -0.05846482142806053,
        0.10522912442684174,
        0.019617395475506783,
        -0.004764322191476822,
        -0.027056807652115822,
        0.02374064177274704,
        0.010566080920398235,
        0.017228109762072563,
        0.10157176852226257,
        -0.003213719232007861,
        0.025347653776407242,
        -0.02385425753891468,
        0.021213268861174583,
        -0.038119491189718246,
        0.006100903265178204,
        -0.0019458407768979669,
        -0.04152797907590866,
        0.006077448837459087,
        0.05921129882335663,
        -0.008684109896421432,
        -0.026908081024885178,
        -0.033280760049819946,
        -0.0073806545697152615,
        -0.08518348634243011,
        0.007919852621853352,
        0.00862837117165327,
        -0.040996529161930084,
        -0.01572228968143463,
        0.057934507727622986,
        0.03009803034365177,
        -0.06549521535634995,
        -3.03505533314912e-33,
        0.007159817963838577,
        -0.03159631788730621,
        -0.011195812374353409,
        0.02470311149954796,
        0.001748040085658431,
        0.049545131623744965,
        0.03737177327275276,
        0.08518630266189575,
        0.005786743946373463,
        -0.018329966813325882,
        0.04370199143886566,
        0.038940366357564926,
        0.018294552341103554,
        -0.023631762713193893,
        -0.025235412642359734,
        -0.05456850677728653,
        0.020192697644233704,
        -0.0862693339586258,
        0.03215089067816734,
        -0.03689265251159668,
        0.025084907189011574,
        0.020357390865683556,
        0.04785505309700966,
        0.11336655169725418,
        0.021206995472311974,
        0.0350191667675972,
        -0.04635118320584297,
        -0.03950144350528717,
        -0.01587887853384018,
        0.013078412041068077,
        0.04235193505883217,
        -0.09583239257335663,
        -0.004075773525983095,
        0.03933420404791832,
        0.025129813700914383,
        0.01904185116291046,
        0.03847262263298035,
        -0.060840826481580734,
        -0.012078629806637764,
        0.0025191600434482098,
        0.0058946767821908,
        0.06717173010110855,
        0.027509720996022224,
        -0.02620982564985752,
        0.010174292139708996,
        0.015261889435350895,
        -0.02137996442615986,
        0.016485009342432022,
        -0.06405290961265564,
        -0.026885392144322395,
        0.03843272849917412,
        -0.0069708009250462055,
        0.02691035531461239,
        0.011251680552959442,
        -0.09373465180397034,
        -0.05309409275650978,
        -0.013647790998220444,
        -0.012319233268499374,
        -0.04782988876104355,
        0.006033390294760466,
        0.0721910372376442,
        0.02153247408568859,
        -0.11265010386705399,
        -0.06874419003725052,
        -0.007595242001116276,
        0.015845734626054764,
        0.04178124666213989,
        -0.015790129080414772,
        0.02111946791410446,
        0.07956340163946152,
        -0.04050631448626518,
        -0.027114003896713257,
        -0.03950813040137291,
        -0.04493758827447891,
        -0.01108719315379858,
        0.08058866858482361,
        -0.019056007266044617,
        -0.06481259316205978,
        0.0123757254332304,
        -0.07089729607105255,
        0.0002767592668533325,
        0.038781456649303436,
        0.05302714556455612,
        0.01655825413763523,
        0.048725273460149765,
        0.011166542768478394,
        -0.058986905962228775,
        -0.017241626977920532,
        -0.040040262043476105,
        0.0746426209807396,
        -0.09457085281610489,
        -0.010191604495048523,
        -0.0475376732647419,
        -0.012179121375083923,
        0.07327762991189957,
        -4.7335646513602114e-08,
        0.017952388152480125,
        0.03404749929904938,
        -0.004250378347933292,
        -0.025370508432388306,
        0.039607007056474686,
        -0.08932238072156906,
        -0.021336859092116356,
        -0.026778332889080048,
        0.12334967404603958,
        0.03701458498835564,
        -0.019475392997264862,
        -0.14116299152374268,
        -0.05617300420999527,
        -0.015364423394203186,
        -0.00041247831541113555,
        0.059841085225343704,
        -0.022551879286766052,
        0.05616389214992523,
        -0.006607442162930965,
        0.002453537890687585,
        -0.008076157420873642,
        0.12480584532022476,
        0.03040803223848343,
        -0.07651945948600769,
        0.10029499232769012,
        0.007041890639811754,
        0.027510464191436768,
        0.024827856570482254,
        0.03890793398022652,
        -0.021280230954289436,
        -0.0033189125824719667,
        -0.05062960833311081,
        -0.042352497577667236,
        0.03305116668343544,
        0.02691069431602955,
        -0.03855505585670471,
        0.0009003690793178976,
        -0.021217714995145798,
        0.11009033024311066,
        0.06533338874578476,
        -0.007001413032412529,
        -0.041419658809900284,
        -0.05139339715242386,
        0.050701696425676346,
        0.007584863342344761,
        -0.18840734660625458,
        0.028449418023228645,
        -0.10612857341766357,
        -0.06459824740886688,
        0.041021090000867844,
        -0.07178014516830444,
        -0.02981714718043804,
        -0.04172630235552788,
        -0.035237815231084824,
        0.02152574248611927,
        0.0318756029009819,
        0.024939069524407387,
        0.02866184338927269,
        -0.04440857842564583,
        0.10493897646665573,
        0.12649579346179962,
        0.0041263895109295845,
        -0.01813827082514763,
        0.12073279172182083
    ]
}