{
    "id": "H-4Lx-h73_c",
    "title": "OnePlus 7 Pro Unboxing + Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-05-14T16:00:55Z",
    "video_url": "https://www.youtube.com/watch?v=H-4Lx-h73_c",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "oneplus",
        "oneplus 7 pro",
        "unboxing",
        "review"
    ],
    "views": 485290,
    "likes": 14534,
    "comments_count": 1445,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and today in front of me we have on the first OnePlus 7 Pros to check out. I'm so excited, this was just announced, and now we're gonna do an unboxing and then take this thing out and do some testing. (electronic music) So in front of us we have the new OnePlus 7 Pro, and we have the new Bullets Wireless 2, and this, this is a Warp Charge 30 Car Charger. Now let's unbox the OnePlus 7 Pro, this is the Nebula Blue version (electronic music) That was the slowest reveal ever. Here it is, oh, ooh. It feels a little heavier than I thought. Like I said this is the Nebula Blue version. Oh wow. Gosh, if there's one thing the OnePlus does right, is the colors. Like this is so beautiful. Would you take a look at that. I think I need to change my background color now to Nebula Blue. Hold on a second. How's that? That looks pretty Nebula to me. I think that works. What is this? Is this, is this where a pop-up camera could potentially be? I think so. This is the OnePlus 7 Pro in the Nebula Blue. It features a Qualcomm Snapdragon 855 processor, and up to 12 gigs of RAM. This model has 256 gigs of storage and the display is a 6.67-inch, QHD fluid AMOLED. And yes, it does have a pop-up front-facing 16-megapixel camera. There's a triple lens setup on the back. There's an ultra-wide angle, which is 117 degrees, 16-megapixel sensor. There's a telephoto lens which is 3x optical and the main lens which is a 48-megapixel sensor. It also features Warp Charge 30 and a 4000-milliamp battery. There's dual speakers with Dolby Atmos, night mode 2.0, haptic vibration and a ten-layer liquid cooling system. It also comes in three colors, this is the Nebula Blue, there is also a near-black and an almond. So that's a little overview of the OnePlus 7 Pro. I'm gonna set this thing up, and then we're gonna take this thing outside. But first, I also have a few other things inside this box that we need to check out. Here of course we've got a nice clear case which I'm going to put on immediately. Oh my goodness, this is impressive. And of course, my favorite, the red USB-C charging cables. Anything else in here? Like something I could eat? No, but we do have a SIM car ejector which I am gonna need. Let's take a look at this car charger. Oh, very nice. Another one. Just what I need. And you've also got the OnePlus Bullet Wireless 2 Headphones. Oh, well that was easier than I thought. I love this case. I loved it in the last version and I am still loving it. You've got various sizes, depending upon your ear size. Here we go, look at you. I'll always love the Bullets design, especially these little magnetic earpieces. These also have Warp Charge, so if you charge them for ten minutes, that'll give you ten hours of playback. It's also got quick pair, so you can pair two different devices, and you can easily switch between the two devices by pressing twice on the shortcut key on the headphones. So let's get this thing set up and I'll meet you guys outside. So it's all set up but before we go outside I need to add some security on here. I don't have my fingerprint set up so right now I'm gonna do that. Much like the previous version, the fingerprint sensor is inside of the screen. Okay, yeah, I'm getting some haptic feedback. You guys can't see it. Continue to adjust the position of your finger, all right. Been scanning every part of my finger. There it is, fingerprint added. Let's try it. Ready? That was super quick. Now, there's something that I wanna show you guys. This is something that I haven't tried yet. I've been holding off for this very moment. But are you ready? Feast your little eyes right here. Oh it's good, you guys have to see it from here, look here just watch this, watch this, watch this, watch this, watch, watch, watch, I'm so excited! Hi, Tyler. Oh my goodness, it's so incredible. So in this reviewer's guide this is something that I want to read to you guys because this is really fascinating. The pop-up camera's elevator mechanism has been tested over 300,000 times. So this means if you were to use the camera 150 times a day, you'd still be able to use it for over 5 years. With as many selfies as I take... I'm going to flip this around and I'm gonna take a picture of Tyler. Here is the wide angle. Here is the regular. Here is the 3x optical, oh my gosh, I am so zoomed-in on you. I can see your pores. - [Tyler] I don't like that. - Oh I can do some portrait, okay let's do a portrait. Oh, wow. Oh my gosh, this is going in GQ. Let me see, can we do front-facing portrait? Yes, yes sir. Definitely going in Vogue. There's also nightscape, which we're not going to test out yet because it's not nighttime. Let's do a quick little video test. Shooting in 4k, wowee. Whoa, the zoom in is fierce. Hey, would you push the push the 1x button? So it only shoots 1080p on the front camera but that's pretty much like most cameras. Is this riveting content? I think it is. Don't worry, we're gonna take this thing outside. We're gonna test it out a little more, but this is the front-facing camera. Hello, hello, hello. I just like to do a preliminary test before I head outside into the wild, 'cause you never know what you're gonna get. Any time I get a new phone to review, my favorite thing to test out is the camera. So I'm gonna take some photos and some videos for you guys, and I'd love to know what you guys think. So the first picture I'm gonna take is using the ultra-wide. There it is. Here's regular, and here is the 3x, zoomed in. Oh yeah. Okay I'm gonna flip this around That' really great. It's like probably my best work ever. Now I'm testing out the front-facing video. One of the things I've noticed, even just looking back at the footage I shot yesterday using this camera, OnePlus really doesn't do a good job with the audio, so the microphone sounds a little bit tinny. So here's a comparison to what the iPhone sounds like. Okay we're shooting side by side. This is the iPhone and this is the OnePlus 7 Pro. So you guys can tell that the audio on the iPhone definitely sounds a lot better. So that is one thing that I really wish that OnePlus would kind of step up their game. The phone so far is pretty awesome. It is pretty speedy. Looking at them side by side, hmm, I'm not sure. What do you guys think? I'm leaving this up to you. Oh, there's a bird, a bird, oh come on, gotta get the shot, get the shot, come here, come here, come here. Oh my gosh, I am a photographer. National Geographic, tweet me if you want that shot because it's really my best work. So the camera's using ultrashot, which is HDR Plus. So it's controlling the exposure value of each pixel and it collects four times more data. So with super resolution it extracts key information from each photo, and then it takes all those photos, layers them together, and then you get more detail in each shot that you take. I'm loving it. I'm gonna go take a few more photos, and I do a little montage here for you guys of some pictures that I took. (upbeat jazzy music) When the pop-up camera pops up, there's a really cool animation that happens. I've gotta show you guys this. So it happens right up here, are you ready? Look at it. I'm almost at my daily 150 limit. Mattie, are you a good boy? Hey. Who's the best boy? Is it you? Is it you? Let me do another wide angle of you. Let's do a portrait pup. Mattie. Mattie do you think this will be your new profile pic? These portrait photos actually look really good. Look at you, Mattie. This is something that I have been waiting this entire video to test out. I wanted to do a drop test, because it says that the camera would retract when it detects free fall. So using the accelerometer and the gyroscope inside the phone, it knows when you drop it. So I thought I would use this lovely, lush, love sack here, put the camera into slow-mo and drop it, and see if we can catch this retracting. Tyler, are you ready? Let's do it. No way! It worked! (upbeat music) Oh my gosh, this is incredible. So it definitely detected the fall because you could see in the slow-mo shot, we need to replay this. Look at this. The camera just retracted as it detected the fall, and on here it gives you notification, that says free fall detected, the front camera has been lowered. Would you like to use the front camera again? Yes. This is great, wow. There's a night mode 2.0, so when you click this, this will filter out all the shortwave bluerays that affect your vision. So if you're watching content in the dark, or before bed, this is so much easier on your eyes. Oh it sounds so good too. (electronic music) Whoa, this is testing out the Dolby Atmos speakers. This is the first time that I'm actually watching this, and you can really hear the surround sound. I'm a big Dolby Atmos fan. It's finally dark enough to test out the OnePlus 7 Pro in some low-light situations. I'm using the night shot feature and there's a train going by, so here's the shots. (electronic music) This also has a gaming mode, and I was downloading Fortnite but it was taking too long, so I have another really incredible game that I was just searching on the Google Play Store, and I saw this. It's a Chuck E Cheese skateboarding game. I know. Oxygen OS now has a screen recorder built in so I can go in here and I can screen record this incredible gameplay that you guys are about to witness. Another cool thing about the screen recording is that when you go in here into the settings you can go into the audio source so you can choose not to record the audio, just record the internal audio of the game, or you can activate your microphone so you can record not only the gameplay audio but your own voice. SO I'm gonna do that. Do I have to jump over it? Well I'm starting my gaming channel back up again. Maybe I jump over it. Yep, okay. Okay but, oh. Okay I got it now. Now that I've figured it out I am unstoppable. It's ready to go. Now I'm getting really good at this. I'm going pro. You'll see me in the next esports world league of Chuck E Cheese skateboarding. I gotta get this fish. I'm having a great time. Whoa, did you see that trick? So I think we get the point. I'm gonna stop my recording now. So let's say I've been playing Chuck E Cheese Skate Unlimited for four hours, I'm exhausted, I ran into so many blocks and snowmen. I need to take a break. Well there is a really cool zen mode on here now, which is awesome, because this will pretty much disable your phone for 20 minutes. You can still make and receive emergency calls, but for the most part, notifications and everything else, disabled. So I think that's probably a good point that we can end this video now. Thank you guys so much for watching. I'm going to hit zen mode, and I'm gonna zen out. Enjoy the company of your pets. Enjoy romantic, whoa, look at that. Here's some rules: zen mode can't be canceled once its' started. Incoming notifications will be temporarily muted. You may still receive calls and make emergency calls. All apps will be locked except for the camera. Let's hit start. Three, two, one, go. So here's the emergency call. Okay, what if I don't know anyone's phone number? Here's the camera, so you still have access to that, so that's good. In case I need to take an emergency selfie. So that's really cool, I now have 19 minutes and 27 seconds until I can use my phone again. Thank you guys so much for watching. Hope you guys enjoyed this video. I'm really excited to test this out a little bit more. Let me know if there's any other videos you'd like me to make with the new OnePlus 7, huge thank you to OnePlus for sending me this phone to check out. I always love reviewing their phones. Let me know if there's anything else you guys would like to see me test with the OnePlus 7 Pro. I had so much fun making this video. Hope you guys enjoyed it. Don't forget to subscribe and also hit the bell if you haven't already. That's how you'll be notified when I post new videos. Now I'm gonna go zen out and I'm not really sure what I'm gonna do for 18 minutes. Actually I'll probably just go pick up my iPhone, but let's be real. You gotta have a backup phone for your zen phone.",
    "transcript_keywords": [
        "Nebula Blue",
        "guys",
        "Justine and today",
        "camera",
        "Nebula Blue version",
        "OnePlus",
        "Pro",
        "Nebula",
        "test",
        "thing",
        "Blue",
        "phone",
        "Warp Charge",
        "good",
        "watch",
        "shot",
        "Justine",
        "OnePlus Bullet Wireless",
        "Chuck E Cheese",
        "Dolby Atmos"
    ],
    "transcript_entity_values": [
        "4k",
        "the Nebula Blue",
        "117 degrees",
        "second",
        "48-megapixel",
        "GQ",
        "one",
        "3x",
        "One",
        "20 minutes",
        "Warp",
        "Justine",
        "Nebula Blue",
        "na zen",
        "Fortnite",
        "the OnePlus 7 Pro",
        "256",
        "Warp Charge",
        "four hours",
        "ten hours",
        "iPhone",
        "16-megapixel",
        "30",
        "three",
        "ten",
        "over 300,000",
        "4000-milliamp",
        "over 5 years",
        "ten minutes",
        "National Geographic",
        "18 minutes",
        "four",
        "OnePlus 7 Pro",
        "Dolby Atmos",
        "1080p",
        "Chuck E Cheese Skate Unlimited",
        "RAM",
        "AMOLED",
        "daily",
        "OnePlus",
        "Mattie",
        "19 minutes and 27 seconds",
        "Chuck E Cheese",
        "up to 12",
        "today",
        "two",
        "Bullets Wireless 2",
        "Vogue",
        "Three",
        "Bullets",
        "the Google Play Store",
        "Tyler",
        "1x",
        "first",
        "6.67-inch",
        "Qualcomm",
        "855",
        "2.0",
        "HDR Plus",
        "the Nebula Blue",
        "USB",
        "OnePlus 7",
        "yesterday",
        "wowee",
        "150"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "FAC",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "TIME",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "TIME",
        "ORG",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "PERSON",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "EVENT",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "GPE",
        "CARDINAL"
    ],
    "vector": [
        -0.029658397659659386,
        -0.06478723138570786,
        -0.04591817036271095,
        -0.08576677739620209,
        0.024873612448573112,
        0.04942520707845688,
        0.024311736226081848,
        0.029882019385695457,
        -0.039511989802122116,
        0.08539285510778427,
        0.015549927949905396,
        0.021417103707790375,
        -0.030651941895484924,
        -0.025908352807164192,
        -0.01854235678911209,
        0.032118212431669235,
        0.013178748078644276,
        -0.0340702161192894,
        0.0025317270774394274,
        0.04058341681957245,
        -0.012833014130592346,
        -0.06816957890987396,
        0.02214394509792328,
        -0.0003589749685488641,
        0.01868700236082077,
        0.033060211688280106,
        0.0038882438093423843,
        0.047412242740392685,
        -0.08191197365522385,
        -0.11011073738336563,
        0.011370005086064339,
        0.02638077922165394,
        0.09037639945745468,
        0.01038343459367752,
        2.5348779672640376e-05,
        -0.03185388818383217,
        0.05193731188774109,
        -0.008290626108646393,
        -0.05580786615610123,
        -0.023080850020051003,
        0.015362304635345936,
        -0.01548366341739893,
        -0.0046629393473267555,
        -0.041367143392562866,
        -0.07549559324979782,
        -0.07674999535083771,
        -0.016916796565055847,
        -0.05824808031320572,
        0.06239067763090134,
        0.01404037605971098,
        -0.013472409918904305,
        0.01900036633014679,
        0.04927084594964981,
        0.03401912748813629,
        -0.0879652127623558,
        -0.026938417926430702,
        -0.0946827381849289,
        -0.011565148830413818,
        0.004985505249351263,
        -0.11500655859708786,
        0.01695682667195797,
        -0.029765687882900238,
        0.01611909829080105,
        0.042314380407333374,
        -0.04133416712284088,
        -0.030478011816740036,
        0.0004993155598640442,
        -0.011684033088386059,
        -0.016304396092891693,
        -0.0010791332460939884,
        -0.10957277566194534,
        0.04869483411312103,
        -0.015073856338858604,
        0.04288825765252113,
        0.017756011337041855,
        0.07229123264551163,
        0.005317516624927521,
        -0.06473024189472198,
        -0.006967552471905947,
        0.05788447707891464,
        0.04136626422405243,
        -0.02506108768284321,
        -0.07070963829755783,
        -0.034415602684020996,
        0.02099987491965294,
        0.01978670246899128,
        -0.012294365093111992,
        0.06877913326025009,
        -0.008996671997010708,
        -0.09735375642776489,
        -0.05982552096247673,
        0.03334738686680794,
        0.042023926973342896,
        0.0325222946703434,
        -0.007054924964904785,
        -0.06654512882232666,
        -0.059512268751859665,
        -0.035489849746227264,
        -0.08083899319171906,
        0.0479322113096714,
        0.045097582042217255,
        -0.03938274830579758,
        0.006525050383061171,
        -0.0262495968490839,
        -0.021932346746325493,
        -0.08446934819221497,
        -0.05371241644024849,
        -0.003099354449659586,
        0.039668429642915726,
        0.019211003556847572,
        -0.052794426679611206,
        0.022142253816127777,
        -0.06216699630022049,
        -0.007767417933791876,
        0.00880027748644352,
        0.12494862824678421,
        -0.03729414567351341,
        0.09812340140342712,
        0.03319786116480827,
        -0.011027942411601543,
        -0.012063678354024887,
        -0.13689200580120087,
        -0.003285932820290327,
        0.05835212394595146,
        -0.031214024871587753,
        -0.009129351936280727,
        -0.055260274559259415,
        1.3296592594382797e-32,
        -0.041558556258678436,
        0.030746541917324066,
        -0.0164822805672884,
        0.07651787996292114,
        0.00466231070458889,
        0.0043561700731515884,
        -0.00019682172569446266,
        0.0829128846526146,
        0.0007266943575814366,
        0.041862890124320984,
        -0.03814109042286873,
        0.04769080877304077,
        -0.03516112640500069,
        0.05195409804582596,
        -0.00018337696383241564,
        -0.0658910796046257,
        0.03171849623322487,
        -0.021401846781373024,
        -0.04265231266617775,
        0.0011564313899725676,
        -0.0005345555837266147,
        0.01892387866973877,
        -0.02749808505177498,
        0.08248603343963623,
        0.13114678859710693,
        0.10054226219654083,
        0.036260150372982025,
        -0.0044798776507377625,
        0.09701074659824371,
        0.0023696718271821737,
        -0.05724629759788513,
        -0.059452496469020844,
        -0.015612753108143806,
        -0.03978883847594261,
        0.03028280660510063,
        0.008969871327280998,
        -0.08814264088869095,
        0.0359056182205677,
        0.006297884043306112,
        0.006458437070250511,
        -0.026018133386969566,
        -0.036740344017744064,
        -0.05386105552315712,
        -0.09832186251878738,
        0.1057489886879921,
        0.003619845723733306,
        0.019547568634152412,
        0.08381720632314682,
        -0.031800441443920135,
        -0.011650711297988892,
        0.005303808953613043,
        0.02093224786221981,
        -0.06837800145149231,
        -0.021204447373747826,
        -0.0332980751991272,
        -0.07799411565065384,
        -0.033999256789684296,
        0.07979430258274078,
        0.10229206085205078,
        0.06519658118486404,
        0.013829817995429039,
        -0.028148632496595383,
        -0.05237177386879921,
        -0.054990947246551514,
        -0.070216603577137,
        0.1160934716463089,
        0.018193144351243973,
        -0.04021553322672844,
        -0.004274730104953051,
        0.042114876210689545,
        -0.0031813320238143206,
        0.019727535545825958,
        0.04221111536026001,
        0.014577346853911877,
        0.023981519043445587,
        0.09314044564962387,
        -0.05296583101153374,
        -0.03953288868069649,
        0.029508531093597412,
        -0.035328663885593414,
        -0.08740353584289551,
        0.08705799281597137,
        -0.04883554205298424,
        0.10216430574655533,
        -0.0283245537430048,
        -0.04389866814017296,
        0.01856052130460739,
        -0.011432486586272717,
        -0.07147657126188278,
        0.03186972066760063,
        0.030572913587093353,
        0.09677020460367203,
        -0.09485719352960587,
        -0.0360507071018219,
        0.004061516840010881,
        -1.2845975651202704e-32,
        0.006602794397622347,
        0.022883683443069458,
        -0.026240507140755653,
        -0.024575578048825264,
        0.0682881623506546,
        0.00963036809116602,
        0.06087899208068848,
        0.10791858285665512,
        0.06204863637685776,
        -0.08952076733112335,
        0.03953991457819939,
        -0.0981028825044632,
        -0.13222624361515045,
        0.008419382385909557,
        -0.037593740969896317,
        -0.010403648018836975,
        -0.03219994530081749,
        -0.014410514384508133,
        0.04490971937775612,
        0.0005208150832913816,
        0.07688268274068832,
        0.13764885067939758,
        0.0754915177822113,
        0.030252717435359955,
        -0.03796718642115593,
        0.0016494703013449907,
        0.029170559719204903,
        0.03224681690335274,
        0.05795738846063614,
        0.08949129283428192,
        0.004066635388880968,
        -0.03999987989664078,
        -0.019292429089546204,
        0.008210033178329468,
        0.03091874159872532,
        0.05178292840719223,
        -0.01927316188812256,
        0.02395925670862198,
        0.027117647230625153,
        -0.06964020431041718,
        0.01974700763821602,
        0.009895372204482555,
        -0.019340133294463158,
        -0.018837980926036835,
        0.03682161495089531,
        -0.11609197407960892,
        -0.0637936145067215,
        0.021410763263702393,
        0.03489755094051361,
        0.012224584817886353,
        -0.0958000048995018,
        -0.016277238726615906,
        -0.012273293919861317,
        -0.04390663281083107,
        -0.01731148362159729,
        -0.010321359150111675,
        -0.0353160984814167,
        -0.03702712431550026,
        0.028495000675320625,
        0.016490967944264412,
        0.056407466530799866,
        -0.017632033675909042,
        -0.0522945262491703,
        -0.06773018091917038,
        -0.0002534430823288858,
        -0.07318305224180222,
        0.08436883240938187,
        0.004376374650746584,
        -0.00691280048340559,
        -0.00953994132578373,
        -0.012582995928823948,
        0.018897684291005135,
        0.023119037970900536,
        -0.0322825089097023,
        0.05550867319107056,
        0.011445613577961922,
        -0.10888848453760147,
        -0.010606277734041214,
        0.09952973574399948,
        -0.03362654894590378,
        -0.08985605835914612,
        -0.039201728999614716,
        0.0048779514618217945,
        0.062428057193756104,
        0.1172730028629303,
        0.06293370574712753,
        0.126648411154747,
        -0.03889600932598114,
        0.013486748561263084,
        0.04698586463928223,
        0.036508556455373764,
        0.049201469868421555,
        0.06378201395273209,
        0.09867498278617859,
        -0.08616569638252258,
        -6.228614779502095e-08,
        0.023520290851593018,
        -0.004039590246975422,
        -0.001675266306847334,
        -0.010730302892625332,
        0.028102509677410126,
        -0.09925347566604614,
        -0.022099556401371956,
        0.011663857847452164,
        0.04756828397512436,
        -0.08173229545354843,
        0.09423854947090149,
        -0.004600150976330042,
        -0.06259331107139587,
        0.09880243986845016,
        0.0260948333889246,
        0.029319820925593376,
        -0.08440358936786652,
        0.09554214775562286,
        -0.018940400332212448,
        -0.020474320277571678,
        -0.008709758520126343,
        0.02462760917842388,
        0.04117487370967865,
        -0.028555050492286682,
        0.06391941756010056,
        -0.004457883071154356,
        -0.021013379096984863,
        0.0012125602224841714,
        0.05667564645409584,
        -0.010425452142953873,
        -0.07196733355522156,
        -0.03030198998749256,
        0.033570267260074615,
        -0.01603246107697487,
        -0.04821885749697685,
        -0.023927152156829834,
        -0.017876246944069862,
        0.01278548501431942,
        0.035527680069208145,
        -0.014458129182457924,
        0.02568349614739418,
        -0.10510649532079697,
        -0.02865963615477085,
        -0.014530524611473083,
        0.006884617730975151,
        -0.035430941730737686,
        0.0467342771589756,
        -0.06877230107784271,
        -0.07404353469610214,
        -0.02020767517387867,
        -0.038540732115507126,
        0.0540490485727787,
        0.01766066811978817,
        -0.0443907231092453,
        0.0756290853023529,
        -0.024548867717385292,
        0.01340178307145834,
        0.08185168355703354,
        0.012378607876598835,
        -6.142474740045145e-05,
        0.018363410606980324,
        0.004474073648452759,
        -0.06423613429069519,
        0.03047032468020916
    ]
}