{
    "id": "h01t5STfpbU",
    "title": "I Bought the World’s First OLED TV from 2008! - Sony XEL-1",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-07-17T17:49:11Z",
    "video_url": "https://www.youtube.com/watch?v=h01t5STfpbU",
    "category": "Science & Technology",
    "tags": [
        "Sony",
        "XEL-1",
        "OLED",
        "Tandem OLED",
        "QD OLED",
        "WOLED",
        "MicroLED",
        "LG",
        "Samsung",
        "iPad Pro",
        "HDR",
        "Retro"
    ],
    "views": 953901,
    "likes": 32514,
    "comments_count": 1219,
    "description": "Get 20% off DeleteMe US consumer plans when you go to   and use promo code LTT20 at checkout.  DeleteMe International Plans:   Seasonics Vertex GX-1000 is on sale now. Get yours for your new build or upgrade:   Get up to 60% off LTTStore.com products and find exclusive limited-quantity deals EVERY DAY from July 16-19 during LIME Day:   Sony released an OLED TV in over a decade ago, and it may have been tiny but it was cool as heck and holds up surprisingly well to today's standards.  Discuss on the forum:   Buy a Sony XEL-1 on eBay: Buy an iPad Pro M4:  Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   GET A VPN:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:09 XEL-1 3:03 Gaming 4:42 iPad Pro Comparison 6:20 LIME DAY 7:07 Downsides 8:15 Audio 10:05 R&D 11:30 Conclusion 13:37 Outro",
    "description_links": [
        "http://joindeleteme.com/LTT20",
        "https://international.joindeleteme.com/",
        "https://lmg.gg/TQVT1K",
        "https://lmg.gg/limeday24-ltt17",
        "https://linustechtips.com/topic/1576852-i-bought-the-world%E2%80%99s-first-oled-tv/",
        "https://ebay.us/ggXlUw",
        "https://geni.us/0aWp",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "http://www.piavpn.com/linus",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "I just picked up a sick new OLED TV and, okay, at a mere 11 diagonal inches, the Sony XEL-1 isn't gonna impress your friends with its size anymore. But back in 2008, this thing stunned the world with its organic LED screen, its shockingly thin profile, and of course, its astronomical price. According to OLEDinfo.com, Sony initially viewed this product as more of a prototype. But by the end of its run, tens of thousands of these little guys had made their way into the hands of wealthy, eagle-eyed enthusiasts. Kind of surprising given that, even by 2008 standards, it was woefully impractical. What's more surprising is that as far as OLED technology has come in 16 years, it still holds up shockingly well today. I mean, just look at the definition of this segue to today's sponsor. Seasonic. Reliability. Check. Affordability. Check. Efficiency ability. Double check. Take a look at the new Vertex lineup on sale for Prime Day using our link in the description. Back in 2007, OLED had been invented and even featured in commercial products like this Pioneer car stereo. But most people had only ever seen one in a magazine or in an online article. And I still vividly remember the buzz around this thing. Both from the optimists who saw it as a window into the future. And from the haters who criticized, well, everything, 'cause they're haters. I'm really excited to try it, 'cause I never got a chance back then. But first, let's do a quick tour, shall we? All the brains are in this bottom box down here, and then it's attached using this kind of funky arm to what is, true to Sony's marketing, a shockingly thin panel. Though... It kind of reminds me of LG's earlier OLED models where they had the really really thin display But then a pretty big caboose down at the bottom of them. There isn't much in the way of viewing angle adjustments other than tilt Though if that's what it took for them to have this tank-like build quality, honestly I'm okay with it. So many of these survive that you can still readily find them on eBay I've got a big fat speaker girl on the bottom that kind of makes it look more like a Bluetooth speaker now with display technology. New product category anyone? Music video players? Anyway, unlike a lot of old display tech that we look at it's modern enough that we've got an HDMI input, a USB port in case we want to play our MP4s, RF coax, a LAN port because we've got the Japanese version, and a handy dandy headphone jack on the side in case you want to quietly game or watch TV next to your sleeping partner. You know, if I hadn't been poor as sh*t Back in 2007, I might have been able to see what a sick bougie bedside TV this thing could be as it was I was just like In fairness to me, that's a pretty reasonable reaction too Let's give it a shot. I almost feel wrong playing PlayStation 5 on it But hey it can doesn't support the most modern features and there's no variable refresh rate It's only 60 Hertz and even the resolution is a little bit of an oddball. It runs 960 by 540 which is exactly 1/4 of the pixel count of 1080p, which even at the time was weird because HD was often 1366 by 768 for some reason. Kind of makes me wonder if like a 22 inch full HD model was ever considered but then scrapped out of concerns for cost. I mean it would have probably been like 20 grand. There's definitely things about the display that are not perfect by modern standards. But if you didn't tell me that this was 16 years old, I would not know. The motion clarity is awesome. There's a bit of a weird flicker, almost like black frame insertion, but it's super clear. Even just like input lag is fine. Like dude, this plus a PS3 back in the day. I mean, yeah, you got to sit kind of close and everything, but like, holy crap. At this size, the resolution's fine. Overall, the most surprising thing about this to me is how close it is to a modern device. Even the marketing is the same. Sony boasted rapid pixel response times, super high contrast ratios thanks to inky blacks, high peak brightness on a per pixel level, and they talked about the thin panel. All stuff that's only just starting to give way to new marketing focus points like AI. Goodie. Now, for funsies, what we wanted to do... is take it another step and compare it to Apple's new Ultra Retina XDR display with Tandem OLED. This thing? Incredible. Not only does the SDR and HDR accuracy rival the $20,000 reference display that we looked at last year, but this thing gets bright. And while 1600 nits isn't as high as some of the newer OLED TVs, this can do a thousand nits, full-screen sustained. And there's just nothing else like that at the moment. Though with that said if we account for the differences in time Boy is this ever impressive like damn it looked good in games And I was like well this looks really good for the time in games, but it's it's not even HDR It just has nice punchy SD, HDR didn't exist yet as a standard holy Crap, what is going on right now? This should not look this close You can really see it in a couple spots like when she brings up the flame the flame gets really bright like even there that It's way brighter on the iPad Moon looks like more highlighted on the iPad like you can tell Yeah, and the Colors are a little off. Yep. I am super impressed right now. right? It's so good Oh, yeah highlights look way better on the on the iPad a little bit of a green cast to that brown We'll get the color accuracy later. It's hmm, but if I took this away And you said watch this movie enjoy this movie. I would enjoy this movie I was dude when I pitched the comparison to this for the video because this was something I asked Plouffe to arrange for My expectation was that it was really going to put in context the development that had been done over the last 16 years Instead all it's really showing us is how far ahead Sony was. Now, there's issues It falls short of the coverage of even the sRGB color space and while it's average Delta E 2000 of 6.36 is about in line with high-end LCDs at the time It's on a completely different planet from our calibrated tandem OLED Even if it's the sort of thing that only a big nerd is likely to notice Frankly these ended up looking so close to each other that we were digging around in the shield menu to find out if it was doing some kind of HDR to SDR tone mapping or something that was giving the XCL one an advantage, but it just looks really good I mean I ran into the same thing on my TCL TV at home where SDR content looks great on it Because it just allows itself to take full advantage of its full brightness giving it a more poppy \"HDR\" look even if you're definitely missing some color volume and in how to train your dragon That difference in color volume we saw that in the night scenes where there wasn't enough saturation also the difference in color Accuracy are very noticeable. You can really see the pink cast in the sky here compared to a properly calibrated display One thing that's come a really long way in the last couple decades is audio performance and compact devices So I'll be curious to see how the speakers are Not too loud you got to kind of crank it Good dialogue clarity though. God. This is a good soundtrack and these speakers do not do it justice Plug your headphones in. Yeah plug your headphones in. Which isn't a guarantee. They'll sound good. Hold on I'd watch the shit out of movies like this. Yeah It's almost like dialogue enhancement is on Yeah, so the musical score is Not standing out enough the clarity if I was an elderly person watching content on here though is outstanding there's a whole other paragraph scripted talking about how they compare to each other and I just don't know if we need it because You can have the conversation of well, which one is the more bestest in these specific ways But at the end of the day for most people that's not what they're asking. What they're asking is am I enjoying this experience? And I am. Even seeing it next to the state of the art. I am. I don't need it. But one area where a lot of advancements have been made are in OLED longevity. We did notice some reverse burn-in on the display where the sides are a little bit brighter than the middle and our suspicion is that this is because a lot of content back then was letterboxed so those pixels probably weren't used as much. Now part of why our Sony looks so good is it's taking advantage of modern processing tricks that didn't exist back when it came out. It's hooked up to an Nvidia shield. But part of why it looks so good is that it's just kind of incredible. So I guess the question is why did it take so long to get from this to this? Well research and development costs a lot even at the best of times and unlike with LCD, which can be manufactured in a few separate parts before being assembled, OLED is put together in mostly a singular package. So instead of a product ecosystem with a few companies that are focused on components like backlight, liquid crystal layer, color filter, polarization film, and then tossing individual components if there are errors within the batch, it's one company focused on one finished good for the most part. Speaking of errors, you can get notified about our next round of scribedrivers at lttstore.com. Every pen is made of a failed screwdriver shaft, so you can own your own piece of one of my most expensive mistakes. Another huge factor making OLED expensive is the difference in yields from a single sheet of motherglass due to the precision and cleanliness that are required at the deposition step. To make an OLED panel, display companies needed to learn to work more like a semiconductor fab. You vaporize organic material in a vacuum. And you deposit the sublimated particles perfectly onto the mother glass. A bit too much material, or a bit too much moisture or heat during this process. And that entire sheet is ruined, necessitating the use of clean rooms. On the other hand, LCD is a lot more tolerant to dust and defects. So in a less perfect environment, you could still get a perfectly working panel. And don't forget, just like with our OLED here... LCD prototypes and \"little concept models\" were coming out decades before we saw mass adoption of that technology. Companies like Epson and Sharp were releasing early LCDs as far back as the 1980s. And it wasn't until about 20 years later the big, for the time, 40, 50, 60-inch LCD TVs started replacing the bulky CRTs in everyone's living rooms. So, the progress here... is largely thanks to LG, if we're being realistic, who really banked on making OLED a premium but obtainable option, and who continue to invest in new innovations like the tandem OLED panel that this iPad has that stacks two OLED layers on top of each other to produce that brighter image. Now that the competition's heating up though, and manufacturing processes are a lot more mature, and there's some actual demand thanks to HDR advances on the content side of things, who knows, in another four years... OLED, whether it's Tandem, QD, W, or otherwise, could be your standard issue, and future technologies like Micro LED or, man, those emissive quantum dot ones, whoo, might finally start popping up in the premium consumer space. Just like this segue to our sponsor is popping up in my personal space. Delete me. You may know how to keep your digital identity private, but how about those you care about? Delete me's family plans cover not just you, but your loved ones as well. With their family account management, you can easily add and monitor personalized protection for each member. This means reducing the risk of exposure to spam and scams for both kids and adults. It really is as simple as setting up everyone's profile, then leaving the rest to the team to hunt down and remove data. Plus if you're ever curious about what information is removed, Delete me can send out quarterly personalized reports for everyone under your plan. So keep yourself and your family protected from data brokers. Hit up our link in the description and use code LTT at checkout for 20% off. Any delete me plan. If you guys enjoyed this video, make sure to check out the CRT versus OLED video. I think the results might surprise you. Whoa, this thing gets hot. Dude, 38 Watts passively cooled in a chassis this size. Whoo, she toasts.",
    "transcript_keywords": [
        "OLED",
        "Tandem OLED",
        "thing",
        "good",
        "Kind",
        "display",
        "back",
        "Sony",
        "HDR",
        "OLED panel",
        "diagonal inches",
        "impress your friends",
        "tandem OLED panel",
        "color",
        "yeah",
        "making OLED",
        "bit",
        "lot",
        "calibrated tandem OLED",
        "time"
    ],
    "transcript_entity_values": [
        "Sony",
        "1/4",
        "only 60",
        "768",
        "one",
        "1600",
        "20",
        "SD",
        "Apple",
        "6.36",
        "first",
        "LG",
        "eBay",
        "LAN",
        "PlayStation 5",
        "Tandem",
        "50",
        "11 diagonal inches",
        "Hertz",
        "20,000",
        "One",
        "60-inch",
        "OLEDinfo.com",
        "Delta E 2000",
        "Japanese",
        "40",
        "iPad",
        "XCL",
        "last year",
        "HDR",
        "the last couple decades",
        "Epson",
        "another four years",
        "22 inch",
        "decades",
        "SDR",
        "today",
        "Ultra Retina XDR",
        "the end of the day",
        "Micro",
        "Plouffe",
        "Watts",
        "Sharp",
        "tens of thousands",
        "Prime Day",
        "2007",
        "16 years",
        "960",
        "OLED",
        "Vertex",
        "jack",
        "the last 16 years",
        "2008",
        "20%",
        "LTT",
        "1366",
        "Nvidia",
        "16 years old",
        "about 20 years later",
        "USB",
        "the iPad Moon",
        "quarterly",
        "Pioneer",
        "the day",
        "CRT",
        "LCD",
        "QD",
        "thousand",
        "38",
        "W",
        "two",
        "the 1980s",
        "540"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "LAW",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "LOC",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.04827007278800011,
        -0.04877636954188347,
        0.05974280461668968,
        -0.10608132183551788,
        0.09716678410768509,
        0.043765198439359665,
        -0.017346592620015144,
        0.10481764376163483,
        -0.0014925057766959071,
        0.008041533641517162,
        0.026746083050966263,
        0.07479539513587952,
        0.023920588195323944,
        -0.0326659120619297,
        0.07215026766061783,
        -0.05941265448927879,
        0.052602529525756836,
        -0.09720403701066971,
        -0.017544062808156013,
        -0.014809192158281803,
        0.01656394824385643,
        -0.07372689247131348,
        0.01575382985174656,
        -0.0650351271033287,
        0.06228049471974373,
        0.016241881996393204,
        0.036242492496967316,
        -0.07704678177833557,
        0.0205953661352396,
        -0.023131806403398514,
        -0.002577504375949502,
        0.05084273964166641,
        -0.0065373145043849945,
        0.050175536423921585,
        -0.058113012462854385,
        -0.13503381609916687,
        0.08845624327659607,
        -0.09075096994638443,
        -0.10647287219762802,
        -0.005522929131984711,
        0.01919347420334816,
        -0.04785791039466858,
        -0.06588393449783325,
        -0.06327768415212631,
        -0.017574021592736244,
        -0.04854608699679375,
        0.051385149359703064,
        0.002086355583742261,
        0.017508970573544502,
        -0.02578718028962612,
        0.03865545615553856,
        -0.003004063619300723,
        0.00926200207322836,
        -0.0639733299612999,
        -0.02511799894273281,
        -0.02447897382080555,
        -0.0063802325166761875,
        -0.0035498938523232937,
        0.035166095942258835,
        0.004539331886917353,
        0.06895726919174194,
        -0.08500861376523972,
        0.03758406639099121,
        0.07791019976139069,
        0.0012679428327828646,
        0.017046084627509117,
        0.007864996790885925,
        -0.02161034569144249,
        -0.049108196049928665,
        -0.05473416671156883,
        -0.1296129822731018,
        0.026630040258169174,
        0.0020209455396980047,
        0.05253145098686218,
        -0.037703901529312134,
        0.04990173131227493,
        0.10922957956790924,
        -0.0723281130194664,
        0.023199863731861115,
        -0.008203373290598392,
        0.0005915925139561296,
        0.00104561320040375,
        -0.08785470575094223,
        -0.004802847281098366,
        0.05077412724494934,
        -0.024546001106500626,
        0.05949784815311432,
        0.08387637138366699,
        -0.0030045013409107924,
        -0.026972362771630287,
        -0.004135093651711941,
        0.10826577246189117,
        0.006992634851485491,
        0.08087503910064697,
        -0.016764843836426735,
        -0.0034677404910326004,
        0.036794938147068024,
        -0.032520197331905365,
        -0.03637261316180229,
        0.07136278599500656,
        -0.004563360940665007,
        0.05901839956641197,
        0.023823624476790428,
        -0.00933742430061102,
        -0.12486062198877335,
        -0.10211597383022308,
        0.02107962779700756,
        0.09055716544389725,
        -0.041311539709568024,
        -0.020116843283176422,
        -0.09229070693254471,
        0.015345867723226547,
        -0.04485834762454033,
        0.0068854643031954765,
        -0.027940116822719574,
        0.009162003174424171,
        -0.030132612213492393,
        -0.0004993488546460867,
        0.08418869227170944,
        -0.0963611975312233,
        0.009848153218626976,
        -0.035459935665130615,
        -0.06784483045339584,
        0.040337417274713516,
        -0.022198820486664772,
        -0.005845652427524328,
        0.03765711188316345,
        4.1336144970650504e-33,
        -0.05495992675423622,
        0.05059439688920975,
        -0.10198172181844711,
        -0.07087721675634384,
        -0.03704068809747696,
        0.0567874014377594,
        0.04041481763124466,
        0.11303219944238663,
        0.026122810319066048,
        0.008273730054497719,
        0.025245625525712967,
        -0.010824717581272125,
        -0.13279324769973755,
        0.022662034258246422,
        0.06361980736255646,
        -0.026623273268342018,
        -0.05318965017795563,
        0.008422662504017353,
        0.019403375685214996,
        0.04237211123108864,
        0.008912458084523678,
        -0.0076860771514475346,
        0.047490525990724564,
        0.0031426281202584505,
        -0.027271104976534843,
        0.015792997553944588,
        -0.010190965607762337,
        0.02122054435312748,
        0.06562112271785736,
        0.003606486599892378,
        -0.05636396259069443,
        -0.0657736286520958,
        -0.005578833632171154,
        -0.04797956719994545,
        -0.03888993337750435,
        0.0060337744653224945,
        -0.07980479300022125,
        -0.08460051566362381,
        0.02770567685365677,
        -0.03101639449596405,
        -0.07944107800722122,
        0.09350898861885071,
        -0.06461694091558456,
        -0.044549666345119476,
        0.021145207807421684,
        0.10069230198860168,
        0.0021225684322416782,
        0.015108199790120125,
        -0.014550718478858471,
        -0.02075629122555256,
        -0.06415820121765137,
        0.08406767249107361,
        -0.07375562936067581,
        -0.02164638228714466,
        0.02084358222782612,
        -0.01274909172207117,
        -0.021148765459656715,
        -0.039623524993658066,
        0.042271390557289124,
        -0.008274647407233715,
        0.051388487219810486,
        0.032574281096458435,
        -0.012134391814470291,
        0.0010159013327211142,
        -0.11875298619270325,
        0.10920369625091553,
        0.08557219058275223,
        -0.011836390942335129,
        -0.08607884496450424,
        -0.022358668968081474,
        0.008613523095846176,
        -0.02113470248878002,
        0.03665520250797272,
        -0.09054633975028992,
        0.08919169753789902,
        0.0015076647978276014,
        0.000321572384564206,
        0.012552863918244839,
        0.03982435166835785,
        -0.016998164355754852,
        -0.01944836787879467,
        0.04122321680188179,
        0.06980622559785843,
        0.029344696551561356,
        -0.006317772902548313,
        0.02320358343422413,
        -0.0006895316182635725,
        0.018084848299622536,
        -0.03878989815711975,
        -0.003060454735532403,
        -0.022452086210250854,
        -0.040653329342603683,
        -0.016209254041314125,
        0.04564009979367256,
        0.03928939625620842,
        -5.0776400512150135e-33,
        0.028183072805404663,
        0.011182110756635666,
        -0.013033801689743996,
        -0.042225759476423264,
        -0.03793059289455414,
        -0.027450382709503174,
        -0.0515831895172596,
        0.08450276404619217,
        -0.013399587944149971,
        -0.0726819634437561,
        0.07239146530628204,
        -0.00024834033683873713,
        -0.033292558044195175,
        -0.011552518233656883,
        -0.02420670911669731,
        -0.07475263625383377,
        0.049190983176231384,
        -0.11024396121501923,
        0.0419786162674427,
        -0.03412572667002678,
        0.09938323497772217,
        0.06007494404911995,
        0.01113751158118248,
        0.05230088531970978,
        0.035344239324331284,
        -0.012011497281491756,
        0.013400540687143803,
        0.05976688861846924,
        -0.04583674296736717,
        -0.010873752646148205,
        0.011437242850661278,
        -0.014216299168765545,
        0.018902979791164398,
        -0.009987235069274902,
        0.05087869241833687,
        -0.0023150891065597534,
        0.08100572973489761,
        -0.010740472003817558,
        -0.05134357511997223,
        0.033596865832805634,
        0.029805734753608704,
        0.004000507760792971,
        -0.0028802945744246244,
        -0.00849603209644556,
        0.038206249475479126,
        0.012912891805171967,
        -0.05078473687171936,
        -0.03175067901611328,
        0.07614531368017197,
        0.01303362287580967,
        0.008431611582636833,
        0.08099235594272614,
        0.008096701465547085,
        -0.08952163904905319,
        -0.024187324568629265,
        -0.029044436290860176,
        -0.012052836827933788,
        0.05318619683384895,
        -0.04230816289782524,
        -0.05145750939846039,
        -0.0023614487145096064,
        0.015428086742758751,
        -0.04130936041474342,
        -0.057118989527225494,
        -0.025343947112560272,
        -0.031600091606378555,
        0.1026172861456871,
        0.02051444724202156,
        0.011718867346644402,
        0.003121079644188285,
        -0.0040688891895115376,
        -0.06099777668714523,
        -0.04203858599066734,
        -0.05026942119002342,
        0.02223883382976055,
        0.0758965015411377,
        -0.01821189746260643,
        -0.029317589476704597,
        0.030253153294324875,
        -0.027093686163425446,
        -0.0555494986474514,
        0.060255229473114014,
        0.05955389514565468,
        -0.0011186127085238695,
        0.08560213446617126,
        0.05422819033265114,
        -0.01922377198934555,
        -0.05781267210841179,
        -0.015364060178399086,
        0.0576181560754776,
        -0.07828664034605026,
        -0.0032241209410130978,
        -0.08571310341358185,
        0.05162528157234192,
        0.055329594761133194,
        -5.616801601604493e-08,
        -0.01597754843533039,
        0.013737545348703861,
        0.059089623391628265,
        -0.0052882046438753605,
        0.0066803996451199055,
        -0.11321932077407837,
        -5.967087054159492e-05,
        0.017600521445274353,
        0.14549605548381805,
        -0.05999590829014778,
        -0.009806283749639988,
        -0.07372337579727173,
        -0.04998406022787094,
        0.046225566416978836,
        0.021816445514559746,
        -0.014320473186671734,
        -0.06538219004869461,
        0.011484593152999878,
        -0.002264202106744051,
        -0.03479881212115288,
        0.012546952813863754,
        -0.0012651542201638222,
        0.12323249131441116,
        -0.05594513565301895,
        0.05157964304089546,
        0.028302274644374847,
        0.015965236350893974,
        0.0011021242244169116,
        0.09643479436635971,
        -0.008634119294583797,
        -0.05256614461541176,
        -0.019134122878313065,
        0.026951555162668228,
        -0.028604380786418915,
        0.03553136810660362,
        -0.05439288914203644,
        -0.05637352913618088,
        0.04612867906689644,
        0.068792425096035,
        0.01279875636100769,
        0.02885264717042446,
        -0.054713718593120575,
        -0.001103495596908033,
        0.01995796337723732,
        0.055995527654886246,
        0.04080144688487053,
        0.0023103030398488045,
        -0.05094582960009575,
        0.0027027535252273083,
        -0.021838275715708733,
        0.024059941992163658,
        0.027851393446326256,
        -0.056511104106903076,
        -0.016881218180060387,
        -0.004671746864914894,
        -0.08767597377300262,
        -0.0027795154601335526,
        0.03505430370569229,
        -0.02939133159816265,
        0.04473785683512688,
        0.035680558532476425,
        -0.14850212633609772,
        -0.06678178906440735,
        0.1330830305814743
    ]
}