{
    "id": "H19_JKw4QN4",
    "title": "Is Buying More RAM a WASTE for Gamers? (2022)",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-06-16T17:00:13Z",
    "video_url": "https://www.youtube.com/watch?v=H19_JKw4QN4",
    "category": "Science & Technology",
    "tags": [
        "ram",
        "crucial",
        "test",
        "gaming",
        "video games",
        "ltt",
        "linus tech tips",
        "build",
        "pc",
        "computer",
        "RAM",
        "memory"
    ],
    "views": 2220304,
    "likes": 86571,
    "comments_count": 6215,
    "description": "Thanks to Crucial for sponsoring this video!  Check out Crucial's DDR5 RAM today at:   Still gaming in 2022 on 8GB of RAM (hopefully) in dual channel? We tested some newer games to find out whether or not you'll benefit from an upgrade, or if you're good to go for a little while yet.  Discuss on the forum:   Buy a stick of Crucial DDR5 8GB RAM:   Buy a kit of Crucial Ballistix DDR4 (2x8GB) RAM:   Buy an EK AIO 360 DRGB:   Buy an Intel Core i9-12900K:   Buy a Samsung 980 Pro 2TB:   Buy an RTX 3080 Ti:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:47 Why RAM is important 1:36 How we tested 2:30 CS:GO 3:14 How DDR5 is different from DDR4 4:01 Far Cry 6 5:46 Tiny Tina's Wonderland 6:53 Why is DDR5 better now? 7:34 Warhammer 3 8:15 AC: Valhalla 8:28 So what should I buy? 9:16 Outro",
    "description_links": [
        "https://crucial.gg/LTT_DDR5",
        "https://linustechtips.com/topic/1437566-is-buying-more-ram-a-waste-for-gamers-2022-sponsored/",
        "https://geni.us/ZSZtDIN",
        "https://geni.us/JQWiTPM",
        "https://geni.us/2imXioC",
        "https://geni.us/ynspX",
        "https://geni.us/hkH7l",
        "https://geni.us/UNzq",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Your RAM, sir? - Oh, this is the eight gig stick. I ordered the 16 gigabyte kit. - Uh, the chef insists, sir. - Your chef is a fool, because some game developers are even recommending 32 gigabytes. - Told you this was the kind of place you leave hungry. (suspenseful music) - Unless, eight gigabytes is enough. To find out, Crucial sponsored this video, where we're gonna be testing 8 and 16 gigabyte kits in both DDR4 and DDR5 flavors to ensure that you are not wasting your money. (bright upbeat music) For gamers system, memory or RAM plays a crucial role. See what I did there? Its main job is to ensure that your CPU, and for gamers using onboard graphics, your GPU get the high speed access to assets that are required to run your game smoothly. Because the second you have to swap files out to an SSD, or even worse, a hard drive, you're likely to encounter problems ranging from FPS drops, to slower loading times, to random hitching or stuttering. But, once you have enough RAM to eliminate these problems, there's often no performance benefit to adding more. Meaning, it is really easy to blow away money that could have been spent on a better CPU, better GPU, or even a faster, rather than higher capacity RAM kit. To isolate memory as our performance variable, then we chose a top tier test bench with a Core i9 CPU and an RTX 3080 TI. We also tested each game at both 1080p and 4K to see if our RAM would affect performance more or less depending on whether we're CPU or GPU bottlenecked. As for our memory, we tested eight gigs of DDR4 in both single and dual channel configurations, and 16 gigs in dual channel. And Crucial also asked us to throw in their new DDR5 sticks with the black PCB, That's right, no unicorn vomit lighting effects on these boys, but they're pretty sharp-looking in an understated kind of way. And according to Crucial internal testing, they don't need heat spreaders. So, it turns out some of the concerns about DDR5s on dim power management requiring extra cooling, don't apply to at least Jade spec modules. Anyway, whether you like RGB or blackout builds, at the end of the day, it's performance that counts. So, let's kick things off with \"CS:GO\" at 1080p. It's our tried and true CPU limited game. And you'll be happy to know that, yes, 10 years later, it will still run perfectly fine with only eight gigs of RAM. However, the advantage of going dual channel is huge at this resolution with our single eight-gig stick of DDR4, performing terribly by comparison. This advantage mostly disappeared however, once we scaled up to 4K, and adding more memory, hardly made a difference at either resolution. Which makes sense, given the developer calls for only two gigabytes of system memory. Curiously, while our DDR5 numbers are a little lower than DDR4, we don't see the same massive drop in performance for dropping from dual to single channel. What? Ah, that's because DDR5 is already dual channel. Or sort of. Instead of using a single 72-bit BUS on a dim like DDR4 with 64 bits for data and 8 for ECC, or Error Correction Code, each DDR5 module gets two 40 bits BUSes, again with eight bits on each going towards ECC. So, you still get the same total 64 bit data width, but with each half of it operating semi independently. Now, some workloads, like running complex simulations, may still need at least two sticks for peak performance. But for bandwidth light applications like games, well, the results kinda speak for themselves. \"CS:GO\" is old though. Let's turn to Far Cry 6, which launched late last year with a minimum requirement of eight gigs of RAM, specifically dual channel and a recommendation of 16 gigs. Unsurprisingly, eight gigs in dual channel did perform markedly better than a single channel stick at 1080p. But curiously, this uptick applied only to average frame rates. The far more important 1% lows, were nearly identical between the two at either resolution. Doubling our memory to a 16-gig kit, however, saw our lows skyrocket improving over 40% at Full HD. We saw improvements at 4K resolution as well, with a 16-gig kit, bringing our lows from 47 FPS to 61 on DDR4. These are the kinds of performance differences that you will feel while gaming. Floatplane.com, by the way, has a great behind the scenes of Alex feeling pretty upset about spilling water on a system and trying to fix it. You can check it out at the link down below. Moving up a generation. Our single stick of DDR5, marginally outperforms our single stick of DDR4 at 1080p, but then does slightly worse at 4K. However, when we add a second eight-gig DDR5 module, we see the same trend of increased capacity leading to better performance at both resolutions, lifting our 1% lows by 25% in 1080p, and 33% at 4K, getting us really close to that magic 60 FPS number where most people consider animation to be very smooth. Remember though, guys, just because a game runs at an average of 60 frames per second, that doesn't mean you're not gonna notice hitching when you're hitting those 1% lows of 30 or 40 FPS. So, for the smoothest experience possible, you want your lows at 60 or even higher. \"Tiny Tina's Wonderland\" saw similar, if lower results at 1080p with our poor sad single stick of DDR4 underperforming by about 18% compared to our dual channel configuration. And here again, increasing capacity doesn't really net us improvements to our average FPS, but it does impact our 1% lows, though only by about 5% this time. It's up to you to decide if a 5% gain is worth doubling up your RAM budget. When we scale up to 4K though, all three configurations of DDR4, saw nearly identical results since our CPU usage dropped and our GPU became the limiting factor. What's interesting about \"Wonderlands,\" however, is that we actually saw the best results with DDR5. In 1080p, our single stick of DDR5 beat our single stick of DDR4 by 11%, and doubling up improved it even more. At 4K, the story is pretty similar with our single channel DDR4, being the worst. Adding capacity beyond eight gig, not really seeming to help and DDR5 being the absolute king for performance in this game. But why though? Well \"Wonderlands\" is the newest game we tested. So, it could be that newer games coming out over the next few years, are going to be designed, targeting current gen consoles, which have much faster memory than the PlayStation 4 and Xbox One X Generation. These newer games may be able to better take advantage of what DDR5 has to offer. And Crucial would like us to point out, that with up to 87% more bandwidth than DDR4 at launch, performance is enhanced, not just during testing, but in real world conditions. And with support for X and P3.0, we can expect to see even more performance out of Crucial's DDR5 on future platforms, like AMDs, upcoming AM5, and Intel's 13th Gen Core. Thanks again, Crucial for sponsoring this video, and for understanding that our audience needs the whole picture, which might include situations where your product won't have much of an impact. \"Total Warhammer 3\" saw almost identical performance across the board at 4K, regardless of single, dual channel, capacity, and even the generation of memory. Then at 1080p, improvements to our hardware yielded only minimal performance uplifts. Meaning, that if you only play \"TW 3,\" you could just pick up a Wan hoodie from lttstore.com instead. Check 'em out at the link below, 'cause we've got lots in stock finally. Back to our results. \"Assassins Creed; Valhalla\" saw clear improvements going from single to dual channel, as expected. But increasing capacity, only seemed to help DDR5 and not by much, regardless of resolution. Now, unfortunately, because every game is developed so differently. Even if you're looking at two titles that use the same engine, it's hard to say whether or not upgrading your memory capacity will improve your gaming experience. We've known for years, that dual channel at the bare minimum, is the way to go. And that's still crystal clear here. But unless you're playing newer games that actually take advantage of more memory, you're probably better off buying a faster dual channel configuration and dumping any extra you have left over into your CPU, GPU combo. Now, to be clear, there are games out there now that will utilize more than eight gigs of RAM. But if you're not playing the newest triple A titles, it may not be worth the upgrade for you yet. If you wanna be ready though, we're gonna have all the products we use today linked in the video description below. Thanks for watching, guys. If you enjoyed this video, make sure to check out some of our other RAM videos. Like that time we tested mixed memory modules with mixed results. (bright upbeat music)",
    "transcript_keywords": [
        "dual channel",
        "RAM",
        "channel",
        "single",
        "dual",
        "performance",
        "CPU",
        "single stick",
        "Crucial",
        "memory",
        "stick",
        "game",
        "GPU",
        "single channel",
        "gigs",
        "FPS",
        "lows",
        "capacity",
        "dual channel configuration",
        "games"
    ],
    "transcript_entity_values": [
        "40",
        "PCB",
        "Far Cry 6",
        "40%",
        "Gen Core",
        "second",
        "DDR5",
        "Intel",
        "the next few years",
        "SSD",
        "BUSes",
        "eight",
        "RGB",
        "Crucial",
        "33%",
        "ECC",
        "Tiny Tina's",
        "1080p",
        "GPU",
        "the end of the day",
        "3080 TI",
        "61",
        "16",
        "1%",
        "Floatplane.com",
        "Alex",
        "5%",
        "Wan",
        "today",
        "late last year",
        "Assassins Creed",
        "RAM",
        "years",
        "8",
        "16 gigabyte",
        "64",
        "10 years later",
        "FPS",
        "eight-gig",
        "30",
        "about 5%",
        "about 18%",
        "Xbox One X Generation",
        "4",
        "only eight",
        "72",
        "25%",
        "Valhalla",
        "32 gigabytes",
        "three",
        "more than eight",
        "at least two",
        "CPU",
        "eight gigabytes",
        "11%",
        "13th",
        "Correction Code",
        "60 FPS",
        "PlayStation 4",
        "only two gigabytes",
        "60",
        "DDR5",
        "two",
        "47 FPS",
        "half",
        "Core",
        "87%",
        "Wonderlands"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "EVENT",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "PERSON",
        "PERCENT",
        "PRODUCT",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "PERCENT",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "ORDINAL",
        "LAW",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "WORK_OF_ART"
    ],
    "vector": [
        -0.02171146310865879,
        0.004558655433356762,
        -0.00479059386998415,
        -0.042068175971508026,
        0.06876100599765778,
        0.06149094179272652,
        0.011974740773439407,
        0.06485122442245483,
        -0.019369449466466904,
        0.019757704809308052,
        -0.08936439454555511,
        0.03895037993788719,
        0.0018377399537712336,
        -0.042869869619607925,
        0.1264916956424713,
        0.045704036951065063,
        0.08487378805875778,
        -0.10041051357984543,
        -0.05098094046115875,
        -0.09133300930261612,
        -0.02513926476240158,
        -0.030943933874368668,
        -0.0012093139812350273,
        -0.03962995484471321,
        0.014196500182151794,
        0.04482940956950188,
        0.04919694364070892,
        -0.07157798856496811,
        -0.022163331508636475,
        -0.009612223133444786,
        0.03224097192287445,
        0.07357081025838852,
        -0.08242812007665634,
        -0.045549336820840836,
        -0.018800953403115273,
        -0.03311281278729439,
        0.0030531215015798807,
        -0.011997140944004059,
        0.026234053075313568,
        -0.046430714428424835,
        0.002332514151930809,
        -0.008734897710382938,
        -0.012908028438687325,
        0.029547691345214844,
        0.06958327442407608,
        0.024307796731591225,
        -0.01139734499156475,
        -0.02885730192065239,
        0.02412247844040394,
        0.005810212809592485,
        -0.01873834989964962,
        -0.05150378867983818,
        0.07971818000078201,
        -0.008545739576220512,
        -0.07552623003721237,
        0.06333167105913162,
        -0.03083256632089615,
        -0.0320584699511528,
        -0.01601387932896614,
        0.0062385923229157925,
        0.043861303478479385,
        -0.1141040176153183,
        0.02939094603061676,
        0.08240900188684464,
        -0.007417547982186079,
        -0.07084854692220688,
        0.09618125110864639,
        -0.051504749804735184,
        0.03140240162611008,
        0.055315542966127396,
        -0.035383813083171844,
        0.018719710409641266,
        0.04065734148025513,
        0.0033805440180003643,
        0.03628494217991829,
        -0.025705864652991295,
        0.051332298666238785,
        -0.05642275884747505,
        0.0543275885283947,
        -0.058409806340932846,
        0.010156541131436825,
        -0.007855848409235477,
        0.02006015181541443,
        -0.05607670918107033,
        -0.007828722707927227,
        -0.012581514194607735,
        0.053368717432022095,
        -0.02578330971300602,
        -0.021456530317664146,
        -0.05965935438871384,
        0.08458763360977173,
        0.02722030319273472,
        0.11999978870153427,
        0.025247013196349144,
        -0.0028988795820623636,
        0.08700110763311386,
        -0.09476125240325928,
        -0.02632788009941578,
        -0.02925458364188671,
        -0.00591204734519124,
        0.02581626921892166,
        0.037850528955459595,
        0.03484233841300011,
        -0.007935612462460995,
        -0.035101208835840225,
        -0.02718636579811573,
        -0.023034464567899704,
        0.02176145277917385,
        -0.015390799380838871,
        0.011219676584005356,
        -0.032791901379823685,
        0.08927031606435776,
        0.005446271970868111,
        0.06858355551958084,
        -0.000455320201581344,
        -0.033861350268125534,
        -0.018176386132836342,
        -0.05317561328411102,
        0.07043244689702988,
        0.0630873590707779,
        -0.010977491736412048,
        -0.0587051622569561,
        -0.02706962823867798,
        0.05159450322389603,
        -0.041817303746938705,
        -0.021533189341425896,
        -0.1406785100698471,
        9.828431326789998e-34,
        -0.0561973936855793,
        0.051209647208452225,
        -0.07635825872421265,
        -0.03770880028605461,
        -0.036349181085824966,
        0.0013118669157847762,
        0.019061896950006485,
        -0.03081679344177246,
        0.00016302414587698877,
        0.04228559881448746,
        -0.09772337228059769,
        -0.06194918975234032,
        -0.06398552656173706,
        0.10429677367210388,
        0.1037382185459137,
        -0.03376854211091995,
        -0.03543857857584953,
        0.021876653656363487,
        0.02606162242591381,
        0.04832935705780983,
        0.031676363199949265,
        0.0044171568006277084,
        -0.030297234654426575,
        -0.008176223374903202,
        0.05158049613237381,
        -0.06950785964727402,
        0.045720815658569336,
        -0.011368668638169765,
        0.02131608873605728,
        -0.0015273200115188956,
        -0.032761987298727036,
        -0.11978388577699661,
        -0.033335670828819275,
        -0.002365614054724574,
        0.05718227103352547,
        0.005398167297244072,
        -0.02592051960527897,
        -0.044176630675792694,
        -0.01882985420525074,
        -0.0212925523519516,
        0.024775030091404915,
        0.15117205679416656,
        -0.0569305457174778,
        -0.10166456550359726,
        -0.04754912108182907,
        -0.04307105764746666,
        0.02464945614337921,
        -0.022198421880602837,
        -0.044697292149066925,
        -0.018384123221039772,
        -0.05212996155023575,
        0.009800122119486332,
        -0.05697351321578026,
        0.030106689780950546,
        0.033113136887550354,
        -0.03991606459021568,
        -0.006337741389870644,
        -0.061057012528181076,
        0.06928667426109314,
        0.049509890377521515,
        -0.02443820796906948,
        -0.07769472151994705,
        -0.025967849418520927,
        -0.026212071999907494,
        -0.033153142780065536,
        0.04461168125271797,
        0.15233702957630157,
        0.09780757129192352,
        -0.0946006253361702,
        -0.04618432745337486,
        0.03224959224462509,
        -0.07086215168237686,
        0.049828458577394485,
        0.0022314516827464104,
        0.04428160935640335,
        0.016283676028251648,
        -0.005141161382198334,
        -0.036678459495306015,
        0.00021488915081135929,
        0.01933087781071663,
        0.026234490796923637,
        0.020570192486047745,
        0.005032999441027641,
        0.09135489165782928,
        -0.0041880980134010315,
        0.04106207564473152,
        0.07978852838277817,
        0.01205885037779808,
        0.015229921787977219,
        0.03020964190363884,
        -0.024856911972165108,
        0.011002391576766968,
        -0.03142990916967392,
        0.0031206717249006033,
        -0.05087783560156822,
        -2.7219284336740253e-33,
        -0.04035506770014763,
        0.005407121032476425,
        -0.018107347190380096,
        0.09330780804157257,
        -0.020257262513041496,
        -0.048339616507291794,
        0.01373561192303896,
        -0.049045175313949585,
        0.025674697011709213,
        -0.09659142792224884,
        -0.01449943333864212,
        0.11904279887676239,
        0.031152427196502686,
        0.06946666538715363,
        -0.0063377260230481625,
        -0.11059731990098953,
        -0.050574518740177155,
        -0.022593365982174873,
        0.06845837086439133,
        -0.09922599047422409,
        0.06689443439245224,
        0.044352177530527115,
        0.041787609457969666,
        -0.0564395934343338,
        -0.025740686804056168,
        0.007540648337453604,
        -0.044903334230184555,
        0.08827659487724304,
        -0.07773000746965408,
        0.02852468565106392,
        0.043022118508815765,
        -0.018581511452794075,
        0.03366424888372421,
        -0.005482736509293318,
        0.05271810293197632,
        -0.06536442786455154,
        0.12506863474845886,
        0.00191788119263947,
        -0.0007734400569461286,
        0.015722282230854034,
        0.010091112926602364,
        0.06742111593484879,
        -0.007648685481399298,
        -0.05227925628423691,
        0.04840610921382904,
        0.038587916642427444,
        0.033629246056079865,
        -0.034921154379844666,
        0.08242914080619812,
        0.047541797161102295,
        0.013121480122208595,
        0.05682726949453354,
        0.03830670937895775,
        -0.03879602625966072,
        -0.0016933847218751907,
        -0.08115588873624802,
        -0.03876720741391182,
        -0.01445728912949562,
        0.04536772891879082,
        -0.04055633023381233,
        0.004683385137468576,
        0.05648503080010414,
        -0.019105929881334305,
        -0.04261261969804764,
        0.018254829570651054,
        -0.01852220483124256,
        0.03193490952253342,
        0.03551848232746124,
        -0.0009510673116892576,
        -0.04521385207772255,
        -0.04931042715907097,
        -0.10893724113702774,
        -0.06905407458543777,
        -0.03347589075565338,
        -0.04976619407534599,
        0.07341566681861877,
        0.0532139353454113,
        -0.004352749790996313,
        0.031807344406843185,
        -0.019389471039175987,
        -0.11784335225820541,
        0.019435955211520195,
        0.0328705720603466,
        -0.059295449405908585,
        -0.032357193529605865,
        -0.015554008074104786,
        -0.029779858887195587,
        -0.06717594712972641,
        -0.06541778892278671,
        -0.06822381168603897,
        -0.04819798469543457,
        0.007869812659919262,
        -0.0020339321345090866,
        0.006420531310141087,
        -0.02890199050307274,
        -4.6040582901696325e-08,
        0.03840084746479988,
        -0.021186627447605133,
        0.053620852530002594,
        0.003131522797048092,
        -0.028763649985194206,
        -0.10297667235136032,
        -0.03713686764240265,
        0.047967277467250824,
        0.1239142194390297,
        0.004903314169496298,
        0.08619308471679688,
        -0.052233487367630005,
        -0.04103462025523186,
        0.004307977855205536,
        0.07812443375587463,
        0.073973648250103,
        0.02892450802028179,
        -0.023149773478507996,
        -0.00117611198220402,
        -0.04759818688035011,
        0.04459777846932411,
        0.024160640314221382,
        0.07032664865255356,
        -0.03269996866583824,
        0.01481618732213974,
        0.058779530227184296,
        0.026105504482984543,
        4.799887028639205e-05,
        0.04471247270703316,
        -0.025568228214979172,
        -0.048641934990882874,
        0.03884267061948776,
        0.0655684769153595,
        -0.06226729229092598,
        0.07707139849662781,
        -0.11187947541475296,
        -0.018093349412083626,
        0.0711633712053299,
        0.1003618836402893,
        0.06187136471271515,
        -0.016449984163045883,
        -0.06191052496433258,
        0.0046653421595692635,
        0.04311462491750717,
        0.04356054961681366,
        -0.07013311237096786,
        0.01864507421851158,
        -0.04826292768120766,
        -0.04528741165995598,
        -0.04227013885974884,
        -0.06251467019319534,
        0.03753285109996796,
        0.0015938525320962071,
        -0.010646749287843704,
        0.0486040934920311,
        -0.03056846186518669,
        -0.023035185411572456,
        0.04749036952853203,
        0.0005910388426855206,
        0.01789378561079502,
        -0.045505404472351074,
        -0.1113065779209137,
        -0.08636078983545303,
        -0.006355580873787403
    ]
}