{
    "id": "H4KxxXwKODc",
    "title": "Samsung S10 - Which one will I get?!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-02-22T18:42:11Z",
    "video_url": "https://www.youtube.com/watch?v=H4KxxXwKODc",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "samsung s10",
        "s10+"
    ],
    "views": 354285,
    "likes": 12727,
    "comments_count": 1850,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and today we are going to be chatting a little bit about the new Samsung Galaxy S10. The S10e. The S10 Plus and the Galaxy Fold. As a lot of you guys know and have probably seen in your subscription feed, I was supposed to (mumbles) Samsung Galaxy that was announced this week in San Francisco and unfortunately, I wasn't able to make it to the event. My family's been in town, so I wanted to stay and hang out with them. But a lot of you guys were asking me, \"Justine, which phone are you going to get?\" As many of you had guessed on Twitter, I pre ordered the white 1 Terabyte ceramic version. So, it's kind of crazy because the total number of configurations of phones that they announced... Actually, well I'm not going to count it, but I think it's like, over 30. Which is a lot of phones. So, in the Galaxy line-up to start off, they announced the S10. Which I feel like is the mid-range tier which most people will end up getting. Above that is the S10 Plus. And below those, is the S10e. And above all of that, I guess sort of above all of that, Because it kind of has some upsides and some downsides. Is the S10 5G. You may have already seen a little of the specs and some review videos and some hands-on things but I don't a phone with me. So, I don't really have a thing to show you other than what they announced at the press conference, if you didn't see it already. Which is a quick rundown of some of the specs and prices. As they said, the S10 is their mid-range and starting price at nine hundred dollars. It features 3 rear cameras. The first one is a 16-megapixel ultra-wide lens and this looks incredible. There's something about, just a wide-angle lens. Especially coming from a phone that's amazing. This one doesn't feature Optical Image Stabilization, but the other two lenses do. There's a 12-megapixel duel aperture and a 12-megapixel telephoto which has 2X optical zoom. Upon facing selfie camera, is 10-megapixels and it also features the duel aperture function. The S10 comes in a hundred and twenty-eight or five-twelve gig options with eight gigs of RAM. You can also expand the storage with an SD card, up to 512 gigs. It has a 6.1 inch screen. Which is one of the first to earn an HT ORC 10 Plus certification. This is basically Samsung's version of Dolby Vision. As for colors, this is where I shine, even though I would probably get the Flamingo Pink, but they don't have that one in a one-terabyte option. That's why I opted for the white ceramic. Also, did I mention that it has 12 gigs of RAM. The ceramic. What? I fell to the floor when I heard that. So, here's all of the color options. There's a Flamingo Pink. A Prism Blue. A Prism Black, and the Prism White. So, the Ceramic White and Black is only available in the five-twelve in one-terabyte options. If that is something that you didn't want in the S10 Plus, then you're going to have to do the upgrade. Which brings us to the S10 Plus. Which has a starting price of a thousand bucks. It is a 6.4 inch screen with a forty-one hundred milliampere battery, where as the S10 only has a thirty-four hundred milliampere battery. The S10 Plus has the same triple camera set up as the S10, but it does have an additional selfie camera on the front. Which gives us the same 10-megapixel selfie camera as on the S10, but this other one is an 8-megapixel depth sensing camera so this will give you better front facing portrait or depth mode photos. Like I had mentioned previously, this model does come in a one-terabyte option with twelve gigs of RAM. Yes. You heard me correctly. The five-twelve and one-terabyte options are the ones that can be configured in the black or white ceramic. Obviously, it's completely unnecessary but it's there if you want it, and if you don't, it also comes in a one twenty-eight and five-twelve. In much like the ceramic Apple Watch, which was one of my favorite Apple watches. Ceramic does tend to be a little bit heavier. So I will be interested to see the weight difference between this ceramic and just one of the regular phones. I love ceramic, so I am extremely excited about this. Now this brings us to the S10e, which is the lowest model in this line-up. The starting price for this one is seven-fifty. It features a 5.8 inch screen. Which is smaller than the previous S9. The S10e only has two cameras in the front. So it has the wide-angle and the ultra-wide. If the telephoto is something that you're interested in, this does not have it. Two of the things that this phone doesn't have that the other two have, is a curved screen. It also doesn't have the in-screen fingerprint reader and this is all new for Samsung, because it's using its ultrasonic sensor technology. When you press your finger on this screen, it's using sound waves to read your fingerprint. The S10 does have a fingerprint sensor but it's actually on the power button, which I think is kind of an interesting placement because you're usually going to be turning the power button on and off anyway. So, it seems like a very natural place to put that. Then that brings us to another phone. This is the fourth option, which is not going to be available. I think, until Q-2 which could technically be as early as April. In this 5G option, it will be coming to Verizon first and then other carriers. The screen size on the 5G version is actually 6.7 inches. So, that's larger than the S10 Plus. Which is 6.4 inches. Another really cool thing about the 5G version is it has four cameras on the front. Like, that's a lot of cameras. Three of them are the same as the S10 Plus, but it also has this new 3D depth camera, Which is not necessarily, I feel like going to be used to take photos but I think it'll definitely help taking portrait-road photos. Or even use an AR applications or it filters. Or do people still use Snapchat? I'm not sure. I still love Snapchat filters, don't get me wrong. It will be interesting to see how they implement that in the futures since that is something new. I mean, there's four freaking cameras. Like, what are you going to do? I don't even know. This is just getting out of hand and I love it. I am here for it. I want forty-five cameras. I want to have every single possible option. Just give me all of the lenses. It also has the same dual camera set up as the S10 Plus. It's got that 8-megapixel depth sensing and the 10-megapixel selfie camera. It has forty-five hundred milliampere battery and it comes in a two hundred and 250 gig storage option. But the thing about this is, it doesn't have expandable storage like some of the other phones do. So, if that was something that was important to you, then this may not be the phone for you. Hey, you're going to have 5G speeds. You're going to have six total cameras to just get wild. Sacrifices have to be made and I think that's probably, I don't know. I really love having an SD card, I'm not going to lie. Even though my iPhone doesn't have an SD card option, being able to transfer files and photos from my phone to my computer, the SD card is always so incredible. And last but not least, to the Galaxy Fold. This is so incredible because one of the things that a lot of the people were saying online is, \"It's so expensive, it's this, it's that.\" Shh. Calm yourself. This is something that is not for everyone. This is sort of a concept brought to life and its available for us to try it out. This is honestly something that I think is still super early. I don't think it's going to be the best version of what the future of this is going to look like. I mean, having a foldable display, this really does kind of open up a wide range of possibilities. Especially for developers. That's one of the things that I'm going to be really interested to see is, how are developers going to take advantage of this? Like, what kind of cool things can they come up with it? Haven't been created already because you couldn't fold your phone. So, a little of the specs on this thing is, it has a 4.6 inch display when its folded and when it's unfolded, it has a 7.3 inch display. This is supposed to be available in late April and the starting price is one thousand, nine hundred and eighty dollars. But yes, it's a lot of money. But like I said, this is not something that everyone is going to buy. That everyone is going to need. It is something that is kind of pushing the envelope, showing people that this is the next wave of where we're going. Is it where we're going? I don't know. I feel like it is. It has twelve gigs of RAM, which is quite a lot, but I feel like it is a tablet, so you will be doing more on this than you would be, say on your phone. It also has two batteries. There's one on each side. It also has six total cameras. Much like the 5G version. It has the 12-megapixel wide. 12-megapixel telephoto and a 16-megapixel ultra-wide. Then there's two on the inside. It has the 10-megapixel selfie camera and the 8-megapixel depth sensing camera. There's just a lot of information. Are you guys even still there? It also has one more camera. It's a 10-megapixel one that is on the front. So, whatever configuration this foldable tablet is, you'll be able to take a picture. It doesn't have an expandable SD card option, but it does have 512 gigs of storage which I think is probably perfectly fine. If all else fails, you can just store some stuff on the Cloud. Which I feel like most of you do anyway. One thing that it doesn't have which I wish that it kind of did, but I feel like, hey this thing folds lets not get too crazy. It doesn't have the in-print ultrasonic fingerprint reader, but much like the S10e, it has the fingerprint reader on the power button. So it's pretty easily accessible. I think the reason that they did that is because they want you to be able to have access to that. Whether its opened or closed. I feel like, if it was opened or closed, you wouldn't be able to have the fingerprint screen reader because that probably make the phone even way more expensive if you have two ultrasonic fingerprint readers. Let's just calm down. In the U.S., this will be available for AT&T and T-Mobile customers first. So that was some of the announcements from this past week and man, the Galaxy Fold though. It is something I'm super hyped to check out because just taking a screen and folding it, I feel like is going to be so satisfying. That is not something that you're supposed to do. Like the roll able LG TVs that they had at CES, they actually had in person this year. That was something in the, it was sort of a concept that we saw on stage or in videos. Samsung has been pushing this concept, I think for the past few years at CES. So now that it is actually a real thing that we can purchase and buy and have in our home. In our hands, is pretty cool. I look forward to checking it out. Again, I ordered the Ceramic White version. I'm so tempted to get the Flamingo Pink because it's just calling my name. I don't know. We'll see. Leave me a comment below if you think that I should get the Flamingo Pink as well. Or do I not? Do I just need one phone? I just need one phone. I don't need another phone. Justine, what are you doing? Do you have a problem? I have too many phones. (laughs) Thanks for watching. Let me know if you guys have any other questions or comments below. I look forward to checking out these phones and some more fun phones. They will be coming out very, very shortly. This year is going to get so crazy, so quick. I can feel it. Whoa. I'll see you later. Bye. (exalted piano keys)",
    "transcript_keywords": [
        "phone",
        "camera",
        "Galaxy Fold",
        "Galaxy",
        "ceramic",
        "Samsung Galaxy",
        "cameras",
        "Flamingo Pink",
        "selfie camera",
        "phones",
        "feel",
        "option",
        "thing",
        "lot",
        "screen",
        "white",
        "Samsung",
        "hundred",
        "fingerprint",
        "version"
    ],
    "transcript_entity_values": [
        "forty-five",
        "Samsung Galaxy",
        "one",
        "LG",
        "T-Mobile",
        "16-megapixel",
        "10-megapixel",
        "the Galaxy Fold",
        "5",
        "Verizon",
        "S9",
        "10 Plus",
        "six",
        "seven-fifty",
        "1 Terabyte",
        "S10",
        "the Flamingo Pink",
        "Twitter",
        "forty-five hundred",
        "first",
        "512",
        "five-twelve",
        "One",
        "Two",
        "30",
        "a thousand bucks",
        "Samsung Galaxy",
        "the S10 Plus",
        "five-twelve",
        "late April",
        "this past week",
        "10-megapixels",
        "RAM",
        "this week",
        "12-megapixel",
        "eight",
        "today",
        "one twenty-eight",
        "the Galaxy Fold",
        "fourth",
        "4.6 inch",
        "one-terabyte",
        "AT&T",
        "two hundred and 250",
        "8-megapixel",
        "This year",
        "6.4 inch",
        "Justine",
        "CES",
        "iPhone",
        "twelve",
        "HT",
        "a Flamingo Pink",
        "five-twelve",
        "S10e",
        "Samsung",
        "thirty-four hundred",
        "SD",
        "this year",
        "Three",
        "one thousand",
        "5.8 inch",
        "the Prism White",
        "Apple Watch",
        "Dolby Vision",
        "12",
        "The S10 Plus",
        "6.4 inches",
        "nine hundred and eighty dollars",
        "a hundred and twenty-eight",
        "forty-one hundred",
        "Optical Image Stabilization",
        "Apple",
        "S10",
        "San Francisco",
        "2X",
        "6.1 inch",
        "four",
        "nine hundred dollars",
        "3",
        "U.S.",
        "the past few years",
        "two",
        "Snapchat",
        "7.3 inch",
        "Q-2",
        "S10e",
        "6.7 inches",
        "Galaxy"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "LOC",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "LOC",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG"
    ],
    "vector": [
        -0.08969986438751221,
        -0.06558799743652344,
        -0.05076001584529877,
        -0.1196337565779686,
        0.06752654910087585,
        0.08758361637592316,
        0.0349133238196373,
        0.06958423554897308,
        -0.04607301205396652,
        0.046827852725982666,
        0.02311384491622448,
        0.004325408022850752,
        0.027558205649256706,
        0.024076128378510475,
        0.008051006123423576,
        0.01392971072345972,
        0.03392845019698143,
        -0.028320012614130974,
        0.005576027557253838,
        0.028990687802433968,
        0.00436438899487257,
        -0.02909734658896923,
        0.015616859309375286,
        -0.016273457556962967,
        0.009047850966453552,
        0.044885724782943726,
        0.011422970332205296,
        0.010788636282086372,
        -0.07110030204057693,
        -0.04071325436234474,
        0.02985600382089615,
        0.01765330880880356,
        0.09291766583919525,
        0.04034261777997017,
        -0.005607470870018005,
        -0.1309605836868286,
        0.058991678059101105,
        -0.011217115446925163,
        -0.02164258062839508,
        0.006905674934387207,
        -0.033370282500982285,
        -0.017196860164403915,
        -0.00349045149050653,
        -0.08640239387750626,
        -0.03841833397746086,
        -0.08168406039476395,
        0.0004072625015396625,
        -0.05133889615535736,
        -0.0027399747632443905,
        0.0733591690659523,
        -0.042076319456100464,
        -0.017886539921164513,
        -0.03541549667716026,
        0.031273577362298965,
        -0.06913663446903229,
        -0.014650553464889526,
        -0.11699306219816208,
        -0.021748485043644905,
        0.033645763993263245,
        -0.09815148264169693,
        0.023600339889526367,
        -0.08931124955415726,
        0.01885603740811348,
        0.08272368460893631,
        -0.04960980266332626,
        -0.02908216416835785,
        0.032317593693733215,
        -0.01268215011805296,
        0.01291398610919714,
        -0.03233592212200165,
        -0.09569164365530014,
        0.026270579546689987,
        -0.029874855652451515,
        0.001118502113968134,
        -0.02996480092406273,
        0.0635259598493576,
        0.07829824835062027,
        -0.05672111362218857,
        -0.02325928956270218,
        0.03888275846838951,
        0.027636295184493065,
        -0.028164681047201157,
        -0.12460438907146454,
        -0.05704265832901001,
        0.0016576234484091401,
        0.01282759103924036,
        0.011065365746617317,
        0.06114666536450386,
        -0.044193290174007416,
        -0.02620207518339157,
        -0.05728932097554207,
        0.004583432804793119,
        0.010852424427866936,
        -0.024193456396460533,
        -0.03867783397436142,
        0.00973606202751398,
        -0.057988978922367096,
        -0.03430377319455147,
        -0.020375004038214684,
        0.01390083134174347,
        0.026986921206116676,
        -0.028978727757930756,
        0.03096557967364788,
        -0.038927942514419556,
        0.03294587880373001,
        -0.08839067071676254,
        -0.016279850155115128,
        0.022433625534176826,
        0.03180539608001709,
        -0.01011921837925911,
        -0.008977899327874184,
        0.056004688143730164,
        -0.09085142612457275,
        -0.024639040231704712,
        -0.003413462545722723,
        0.09475088864564896,
        -0.0216072928160429,
        0.06322646886110306,
        0.038659945130348206,
        0.03335181251168251,
        -0.010999305173754692,
        -0.12708956003189087,
        -0.001151046366430819,
        -0.001287139137275517,
        -0.03634684905409813,
        0.05549681559205055,
        -0.10007566213607788,
        1.0554210559004464e-32,
        -0.011331554502248764,
        0.07517626136541367,
        -0.030308200046420097,
        0.03186216205358505,
        0.02352781407535076,
        0.00860100518912077,
        -0.01967204175889492,
        0.1348796784877777,
        -0.002387602813541889,
        0.0022727285977452993,
        -0.08725778013467789,
        0.04048970714211464,
        -0.07509580254554749,
        0.038916707038879395,
        -0.0009255075710825622,
        -0.03689323365688324,
        -0.018083037808537483,
        -0.054297249764204025,
        -0.08774274587631226,
        -0.018605133518576622,
        0.0056471205316483974,
        0.014133649878203869,
        0.02314237505197525,
        0.10267481952905655,
        0.14476798474788666,
        0.008213494904339314,
        0.07393644005060196,
        0.0283275805413723,
        0.05138436704874039,
        0.002534424187615514,
        -0.019459929317235947,
        -0.06744810938835144,
        -0.004112497437745333,
        -0.061472825706005096,
        0.040859051048755646,
        0.029640303924679756,
        -0.015935847535729408,
        -0.011474558152258396,
        0.058413244783878326,
        -0.080909363925457,
        -0.027015239000320435,
        0.018241139128804207,
        -0.08716804534196854,
        0.006050491705536842,
        0.09782112389802933,
        0.010165950283408165,
        0.028602803125977516,
        0.07983089983463287,
        -0.015331248752772808,
        -0.019241830334067345,
        -0.045394811779260635,
        0.0054222457110881805,
        -0.03905105963349342,
        0.011854193173348904,
        -0.02422071248292923,
        -0.09313441812992096,
        -0.021577714011073112,
        0.0793379470705986,
        0.012473653070628643,
        0.06371894478797913,
        0.008652141317725182,
        -0.04176492989063263,
        -0.043087515980005264,
        0.013043340295553207,
        -0.020435962826013565,
        0.08645658940076828,
        0.10697619616985321,
        -0.030911380425095558,
        0.01019599661231041,
        0.03203059360384941,
        0.041976794600486755,
        0.008535422384738922,
        0.08574492484331131,
        0.03243008255958557,
        0.09598001092672348,
        0.056832101196050644,
        -0.04051752761006355,
        -0.06755766272544861,
        0.03247237205505371,
        -0.011052562855184078,
        -0.1016673818230629,
        0.0911150723695755,
        -0.041457366198301315,
        0.15038996934890747,
        -0.025038404390215874,
        -0.02737259306013584,
        0.037200573831796646,
        -0.03984147682785988,
        0.005635128356516361,
        0.015720734372735023,
        -0.025659147650003433,
        0.07060842961072922,
        -0.03676886856555939,
        -0.005549122579395771,
        -0.019315868616104126,
        -9.554218249443913e-33,
        0.01594720035791397,
        0.009418386034667492,
        -0.018513888120651245,
        0.01471317932009697,
        0.03058093786239624,
        -0.010705015622079372,
        0.08839930593967438,
        0.06618838012218475,
        0.0790230929851532,
        -0.09208229929208755,
        0.05543747544288635,
        -0.04476197436451912,
        -0.0806785598397255,
        -0.0027368925511837006,
        -0.03798365592956543,
        -0.024005714803934097,
        -0.06407871842384338,
        -0.10488410294055939,
        0.040714461356401443,
        -0.02400420978665352,
        0.061595574021339417,
        0.12920629978179932,
        0.10465385019779205,
        -0.000214936095289886,
        0.019365673884749413,
        0.003311017993837595,
        0.01948363333940506,
        0.048535097390413284,
        0.033848054707050323,
        0.06457657366991043,
        0.0082483422011137,
        -0.09720514714717865,
        -0.007519065868109465,
        0.007163521833717823,
        0.014577903784811497,
        0.027281010523438454,
        0.04876904934644699,
        0.027751265093684196,
        0.03362954035401344,
        -0.06451195478439331,
        0.034076303243637085,
        -0.007720007561147213,
        0.010751542635262012,
        -0.011000657454133034,
        0.05516572669148445,
        -0.07438220828771591,
        -0.08380277454853058,
        0.034237585961818695,
        0.012599947862327099,
        -0.034369245171546936,
        -0.047716688364744186,
        -0.017835337668657303,
        -0.009269297122955322,
        0.011194624938070774,
        -0.0057281991466879845,
        -0.02835693582892418,
        -0.0633510872721672,
        -0.01171326357871294,
        0.005701255053281784,
        -0.01225140318274498,
        0.03146856278181076,
        -0.003050879342481494,
        -0.06993425637483597,
        -0.05243390053510666,
        -0.010760958306491375,
        -0.03898390382528305,
        0.0876309797167778,
        0.0014465457061305642,
        -0.01923242397606373,
        0.021062912419438362,
        0.0029673059470951557,
        -0.00854372140020132,
        0.03836783394217491,
        -0.0038514933548867702,
        0.013338588178157806,
        0.04042799025774002,
        -0.08133339881896973,
        0.0023143035359680653,
        0.10397021472454071,
        -0.053331177681684494,
        -0.02721482329070568,
        0.01616230234503746,
        0.014188888482749462,
        0.0786365196108818,
        0.08294067531824112,
        0.0837668627500534,
        0.07570350170135498,
        -0.06076318398118019,
        0.028157560154795647,
        0.03678809106349945,
        -0.013421970419585705,
        0.04429559409618378,
        0.023836776614189148,
        0.035269465297460556,
        -0.08863640576601028,
        -5.483447296228405e-08,
        0.05822232365608215,
        0.03206215798854828,
        -0.007139560766518116,
        -0.009182372130453587,
        0.06031863018870354,
        -0.07196000963449478,
        -0.046656180173158646,
        -0.0141778364777565,
        0.1263066828250885,
        -0.04204721003770828,
        0.09266692399978638,
        -0.06619507074356079,
        -0.02158339135348797,
        0.054786719381809235,
        0.027178535237908363,
        -0.034888848662376404,
        -0.05902567505836487,
        0.05970725789666176,
        -0.019779736176133156,
        -0.021124577149748802,
        -0.038618940860033035,
        0.09680383652448654,
        0.02506839483976364,
        -0.04943743720650673,
        0.041463807225227356,
        0.0031665805727243423,
        -0.035819243639707565,
        -0.027636293321847916,
        0.03444862365722656,
        0.019562194123864174,
        -0.04850693419575691,
        -0.0323016457259655,
        -0.04577729478478432,
        0.029893362894654274,
        -0.04518894478678703,
        -0.053832851350307465,
        -0.05577439069747925,
        -0.03270106017589569,
        0.10784783959388733,
        0.03847010061144829,
        0.05165788158774376,
        -0.11154230684041977,
        -0.028642648831009865,
        0.000864399888087064,
        -0.0030378594528883696,
        -0.10652805119752884,
        0.017461201176047325,
        -0.07302659749984741,
        -0.05163181573152542,
        -0.010820391587913036,
        -0.04469890147447586,
        0.01335618644952774,
        -0.04910864308476448,
        -0.03734583780169487,
        0.019680649042129517,
        -0.03251390531659126,
        0.0679185539484024,
        0.024605989456176758,
        -0.031009407714009285,
        0.031888823956251144,
        0.041929688304662704,
        0.03376572206616402,
        -0.07903037965297699,
        0.02975807711482048
    ]
}