{
    "id": "H5m6zs1UIVg",
    "title": "Exploring the good ol' Cassette Tape",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2016-06-23T08:22:26Z",
    "video_url": "https://www.youtube.com/watch?v=H5m6zs1UIVg",
    "category": "Science & Technology",
    "tags": [
        "Cassette",
        "cassette tape",
        "philips compact cassette",
        "compact cassette",
        "how do cassettes work",
        "old tape",
        "tape player",
        "tape deck",
        "audio tape",
        "walkman",
        "sony walkman"
    ],
    "views": 729609,
    "likes": 20479,
    "comments_count": 2258,
    "description": "If you remember the cassette as sounding awful, I have news for you.  They actually sound just fine.  The Compact Cassette has a unique history in the world of sound, which we explore along with their attributes in this Tech Explorations video.  Music Credits:  Rubix Cube by Audionautix is licensed under a Creative Commons Attribution license ( Artist:   Old Bossa by Twin Musicom is licensed under a Creative Commons Attribution license ( Artist:",
    "description_links": [
        "https://creativecommons.org/licenses/by/4.0/)",
        "http://audionautix.com/",
        "https://creativecommons.org/licenses/by/4.0/)",
        "http://www.twinmusicom.org/"
    ],
    "transcript": "So you think you know the cassette tape, eh? That 80s and 90s crappy-sounding barely tolerable thing we had before CDs? The ones that got eaten by your car all the time? The thing hipsters are pretending to listen to? Whatever memories you have of the cassette could probably use some refreshing. They dont sound awful, theyre actually much older than you think, and theyre backed by some interesting technology. Lets have a look. The cassette tape is actually a product of the 1960s, though it took some years for them to take off. The official name for them is the Compact Cassette, and it was the Philips company that invented them in 1962. They aimed to solve two problems, neither of which had anything to do with music. Magnetic tape was not a new thing in 1962, and reel-to-reel tape recorders were fairly widespread. But the machines werent very portable, and even those that tried to be were still plagued by the problem of tape which required being manually threaded. In the professional recording studio, these werent problems. The machine would just sit in one spot in the studio, and having to be threaded manually wasnt a hassle compared to all the other hassles that accompany recording music. But people saw uses for magnetic tape outside the recording studio, particularly in recording speech. In those days, men werent really expected to know how to type. The big-wigs in offices had secretaries to type their letters for them. But secretaries had this annoying habit of leaving at the end of the day, thus being unavailable to use their stenographic skills. Machines like the dictaphone allowed these corporate luddites to record their speech at their whimsy so someone else could write it out later. The problem with the dictaphone was that it used non-reusable cylinders or belts, and mistakes couldnt be fixed without some sort of added note marking them as a mistake. Magnetic tape, though, could be reused and recorded over, since the magnetic signals recorded on the tape could be erased. Mistakes were easy to correct, just back the tape up and record over the mistake. But with large reel-to-reel machines and their open reel tape, you werent about to see them in an office setting. The compact cassette fixed that right up, though. A number of clever innovations made for a practical, portable tape format. The most important innovation was the cassette itself. Instead of having an open reel of tape, the tape is sandwiched in a shell of plastic with access holes at the bottom of the cassette. The tape was pre-threaded in the shell, and the holes in the middle of the cassette allow the machine to wind the tape with special spindles that mesh with these cogs. Having the tape contained so that you didnt have to touch it meant that the tape could be much thinner. With open reels of tape, since grubby little hands are always fiddling with it, it cant get too thin or it will break with handling. But inside a cassette where it wont get touched (or at least, shouldnt get touched), it could afford to be thinner and thus you could pack a longer length of tape inside. The bottom portion of the cassette is wider than the rest, and it has a standard pattern of holes that are very important. These are what allow the cassette recorder to interact with the tape. Cassette recorders work fundamentally the same as a reel to reel recorder, but since were using a cassette the machine interacts with the tape a little differently. Lets take a step back and look at a reel to reel machine to see how ordinary tape gets recorded. The parts that interact with the tape are called the transport. A reel-to-reel recorder has 2 spindles that hold the tape reels, and the transport sits between them. When using the machine, a full reel of tape is placed on the left, and then the tape is pulled out and through the transport before being wound onto the empty reel. The tape passes three heads, first an erase head, then the record head, and finally the playback head. Lastly, the tape goes through the capstan and pinch roller, which are the parts that actually pull the tape past the heads. The capstan is one of the most important parts because it regulates the speed of the tape. The pinch roller, a small rubber wheel, squeezes the tape between itself and the spinning capstan, and this is what actually moves the tape. The reel on the right only rotates to spool the tape onto the reel. See, if I stop it, the tape doesnt stop moving through the machine. Also important to note is the curved path of the tape as it passes the heads. This ensures that it stays tightly against the heads, and various tape guides make sure it stays in alignment as it passes them. If you look at the parts inside a cassette deck, youll see that theyre fundamentally the same, although smaller. Theres an erase head to the left, a record and playback head in the middle (cassettes use one head for both functions), and the capstan and pinch roller are on the right. But you might notice some problems that come about with the cassette. The capstan--it needs to be on one side of the tape, and the pinch roller needs to be on the other. The tape has to somehow get between them. Hows that supposed to work when the tape is trapped in a box? Well, thats what the holes on the side of the cassette are for. See how the capstan is shaped almost like a spike? The capstan goes through this hole and thus ends up behind the tape. Then the pinch roller can move upwards and squeeze the tape against the capstan. Which brings us to the holes on the bottom of the cassette. Rather than bring the tape to the heads, the cassette brings the heads to the tape. The three holes on the bottom are shaped and sized so that the erase head, play head, and pinch roller can all fit neatly inside the cassette shell. The mechanism of the cassette deck lifts these three components together inside the cassette. A felt pad sits inside the cassette shell, and it helps keep the tape against the head. The pad is glued to a metal brace that acts like a spring, making sure that the pad pushes firmly on the tape. When recording, only half the tape is actually used. This head is aligned with only one side of the tape so that the tape can be turned round at the end and run in the opposite direction for a second side. Part of what made the cassette successful was its simplicity. In many recorders, the buttons that you pressed were physically linked to the mechanism. This sony stereo is a great example. This cassette recorder actually holds the tape upside down. The play button is directly connected to pinch roller and heads, and the act of pushing down on the button is what actually pushes the heads into the tape. In conventional cassette decks, the buttons are instead levers that sit underneath the cassette door. Theyre often called piano keys, and they did just what this button does. The only reason this cassette recorder holds the tape upside down is so that the buttons could be on top. Higher end machines like this use automatic mechanisms to move the components around, rather than directly connect those components to the buttons. These were called soft touch controls, and when cassette decks started to get microcomputers inside controlling them, the buttons could be placed anywhere on the machine, and these machines were said to have full logic control. Now that we understand the mechanical elements of the compact cassette, lets examine the technical details. At the time of the cassettes introduction, standard audio tape sounded pretty awful at the slow speed of 1 and seven eights inches per second. Heres an example of what that sounds like: This speed wasnt very good for music, but it was fine for speech. See? Ive run this sound through the tape recorder and inserted it here. It may not sound as good as before, but you can still understand me just fine. So this was the speed chosen for the compact cassette. The slow speed allowed for recording times of up to 60 minutes per side on the cassette, which was a great benefit for recording memos. Now the corporate luddites we talked about earlier could record their letter to Professor Frederick, pop the cassette in an envelope for inter-departmental delivery, and the ladies in the transcription department would type up the letter and send it back for approval. What a weird time we used to live in But that was it. That right there is what Philips invented the cassette for. 8 track cartridges were just coming out, and they seemed fine for music. No need to improve the cassette. OK, there actually was a need. The 8 track was a weird format plagued with issues, and wouldnt last. Now we had the problem of how to get the cassette ready for music. The slow tape speed wasnt gonna allow for decent music. Well, it might not have in 1962, but by the 1970s the actual tape was improved so much that the slow speed wasnt an issue. Cassettes had roughly the same fidelity as the 8 track by the early 70s. But then theres another issue. We want stereo! To get stereo sound on the cassette, the tape had to be split into 4 tracks. 2 in one direction, and 2 in the other. These narrow tracks were kept compatible with older mono equipment because they were right next to each other, and theyd work together for a mono signal. But they also introduced a problem. The signal to noise ratio of the tape suddenly became much worse. Having a narrower track meant that the signals recorded onto the tape became weaker compared to the background noise. But Dolby noise reduction would save the day and bring the noise back in line, in fact improving noise beyond what it was originally. Here youll find a separate video explaining how Dolby Noise Reduction works. By the 1980s, the cassette was well established as a music format. And they sounded really good. Have a listen: I bet you didnt think the cassette sounded that good. Well, thats just the tip of the iceberg. That recording used normal tape, which uses ferric oxide as the magnetic medium. Cassette recorders equipped with adjustable bias circuitry could also record onto chromium tapes and metal tapes. These special tapes were designated type 2 and type 4, and they sounded even better. A type 2 tape uses chromium dioxide as its medium, and this can hold more signal than standard type 1 tape. It required that the machine record with a higher bias frequency and more volume, but the resulting recording had a superior signal to noise ratio than standard tape. Type 4 tape was fairly expensive and used pure metal particles. These could hold a lot of signal, but only higher-end cassette decks could record onto them. Metal tapes sounded better than vinyl records, and indeed they sound just as good as any CD, provided youve got a good enough tape deck. So we have type 1, 2, and 4. Astute viewers may have noticed we skipped 3. Type 3 tapes used a mixture of chromium dioxide and metal, but they really never took off. Theyre so uncommon youll probably never find a machine with a setting to use them. The types of tapes have notches on the back so that higher end machines could tell them apart automatically. Right next to the write-protect tab is another notch indicating that this is a chrome tape. Metal tapes have yet another notch closer to the center. Sensors in the tape deck would detect these notches and adjust the record parameters automatically. This deck, though, has a manual selector switch. Lets listen to the difference each tape type makes. Heres the same song recorded with the same level on each of the three tapes. Because people are so lazy, auto reverse became a priority. Early machines used elaborate mechanisms to actually remove the cassette from the transport, flip it over, and then put it back. These were quickly superseded by machines that used a rotating head. When the tape was playing in the forward direction, the heads would sit like any other deck. But when the tape got to the end, they heads would quickly flip around and then the tape would start moving in the other direction. The change in direction happened due to a pair of capstans which turn in opposite directions. Depending on the direction selected, the pinch roller corresponding to that direction would come up and squeeze the tape against the capstan. Interestingly, Nakamichi, the fairly undisputed champion of high quality cassette decks, returned to a mechanism which actually flipped the tape around because of concerns that the rotating head mechanism could over time bring the heads out of alignment. Whether or not this happens in practice is up for debate. Part of why the cassette took off was that it was so portable. The Sony Walkman was the first portable cassette player, and it was introduced in 1979. Later models like this one would add dolby noise reduction, tape formulation selection, and even auto reverse. All in a machine barely larger than the tape itself. In fact, one walkman was smaller than a cassette, and the machine expanded around it when playing. One interesting note here is that auto reverse walkmans actually have 4 heads. When playing in one direction, the heads listening to the other side are muted and you only hear the forward heads (the other heads are listening to side B backwards). Then when the it got to the end of a side, it switched pinch rollers, thereby reversing direction, and then switched electronically to the other set of heads. Ive often wondered why Nakamichi didnt just do this, with 4 heads and a miniature erase head like this conventional auto reverse machine has on each side. The cassette died a slow death into the 2000s. It stuck around in car stereos for a while since road vibrations didnt affect tapes like they did CDs, but eventually they pretty much faded away. The cassette never really disappeared though. Its not really dead, and in fact is receiving somewhat of a revival. I admit I like the ability to make a mixtape (the modern equivalent being a playlist) and have a physical thing that contains the music. And they do have a retro quality to them thats hard to replicate with a playlist on a smartphone. Thanks for joining me on Tech Explorations. Be sure to subscribe for more videos like this, or our series Technology Connections.",
    "transcript_keywords": [
        "tape",
        "cassette",
        "heads",
        "tapes",
        "cassette tape",
        "head",
        "machine",
        "cassette decks",
        "Compact Cassette",
        "Magnetic tape",
        "metal tapes",
        "cassette recorder",
        "reel",
        "type",
        "machines",
        "pinch roller",
        "tape deck",
        "pinch",
        "record",
        "recording"
    ],
    "transcript_entity_values": [
        "Philips",
        "the 2000s",
        "80s",
        "Tech Explorations",
        "those days",
        "only half",
        "the early 70s",
        "1",
        "90s",
        "only one",
        "Sony",
        "two",
        "up to 60 minutes",
        "8",
        "3",
        "Technology Connections",
        "the end of the day",
        "the 1970s",
        "the Compact Cassette",
        "sony",
        "2",
        "the 1960s",
        "Dolby",
        "1979",
        "first",
        "4",
        "one",
        "Walkman",
        "1962",
        "One",
        "some years",
        "the 1980s",
        "Dolby Noise Reduction",
        "second",
        "Frederick",
        "Nakamichi",
        "seven eights inches",
        "three",
        "the day"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "DATE"
    ],
    "vector": [
        -0.06542910635471344,
        -0.03345336392521858,
        -0.09547819197177887,
        -0.027390243485569954,
        -0.06299977749586105,
        0.04653102904558182,
        0.01123824343085289,
        0.03191407024860382,
        -0.07676733285188675,
        -0.07277536392211914,
        -0.01076278742402792,
        0.10524873435497284,
        0.03932398185133934,
        -0.010377940721809864,
        -0.049290213733911514,
        -0.01790124922990799,
        0.03170989081263542,
        0.00528250215575099,
        0.08615466207265854,
        -0.016857024282217026,
        -0.025754043832421303,
        -0.01163062360137701,
        0.028604570776224136,
        0.05213756486773491,
        -0.04560873284935951,
        0.08668780326843262,
        -0.04910152405500412,
        -0.0003459466970525682,
        -0.026127532124519348,
        -0.05827529728412628,
        0.0004276727559044957,
        0.10155598074197769,
        0.10502642393112183,
        -0.08798462897539139,
        0.0038563755806535482,
        -0.052697595208883286,
        0.03989085555076599,
        0.011422894895076752,
        -0.014391059055924416,
        -0.0395362563431263,
        0.039228059351444244,
        0.006083490792661905,
        0.06924086064100266,
        -0.05130189284682274,
        -0.09878873825073242,
        -0.044230371713638306,
        -0.041014477610588074,
        -0.0502437986433506,
        -0.04835309460759163,
        -0.012105163186788559,
        -0.009265736676752567,
        -0.028003880754113197,
        0.030677901580929756,
        -0.04699688032269478,
        0.010270853526890278,
        -0.05131109431385994,
        0.04826865345239639,
        0.05720377713441849,
        0.0037460688035935163,
        0.00038840610068291426,
        -0.022071460261940956,
        -0.10192204266786575,
        -0.01518664788454771,
        -0.0011988102924078703,
        0.016463935375213623,
        -0.005665214266628027,
        -0.046684712171554565,
        0.04605066776275635,
        -0.051702830940485,
        0.029061688110232353,
        -0.11409763246774673,
        0.022498510777950287,
        -0.04681171476840973,
        0.016385164111852646,
        0.063602514564991,
        -0.006393601186573505,
        -0.012981101870536804,
        0.017399020493030548,
        -0.09191456437110901,
        0.034707099199295044,
        -0.05274030938744545,
        -0.057122424244880676,
        -0.040817741304636,
        -0.03067275695502758,
        -0.06048792228102684,
        0.06799879670143127,
        0.06537246704101562,
        0.004771301988512278,
        -0.0696217343211174,
        -0.07054745405912399,
        0.0168959628790617,
        0.10273243486881256,
        -0.022166622802615166,
        -0.03997683525085449,
        0.08641651272773743,
        -0.010942269116640091,
        -0.02132866159081459,
        0.06195833534002304,
        0.0412423238158226,
        -0.006028320174664259,
        0.1257253885269165,
        0.01922827959060669,
        0.0007113556494005024,
        -0.05954801291227341,
        -0.012787398882210255,
        -0.12687866389751434,
        -0.043292336165905,
        0.026243584230542183,
        0.023877164348959923,
        -0.018767930567264557,
        -0.013406799174845219,
        0.034989017993211746,
        -0.027382155880331993,
        -0.019682789221405983,
        0.027151359245181084,
        -0.05746270343661308,
        -0.019102761521935463,
        0.0033317545894533396,
        -0.01312609575688839,
        0.02606518566608429,
        0.04397379979491234,
        -0.02927323803305626,
        -0.042450934648513794,
        -0.004690923262387514,
        0.028734806925058365,
        -0.0027328880969434977,
        -0.003230009227991104,
        2.7499850961052532e-33,
        -0.053783759474754333,
        0.06596054136753082,
        -0.055685918778181076,
        0.031052296981215477,
        0.061126794666051865,
        -0.031532250344753265,
        -0.04831605777144432,
        0.07086348533630371,
        0.01853075623512268,
        0.07279936969280243,
        0.04777676612138748,
        0.09446598589420319,
        -0.008589236065745354,
        0.027120055630803108,
        0.00519138528034091,
        -0.025441570207476616,
        -0.10851559042930603,
        0.02564987540245056,
        -0.06891650706529617,
        -0.053083039820194244,
        0.007271517068147659,
        0.06185123324394226,
        0.12550252676010132,
        0.03813428059220314,
        0.019301332533359528,
        -0.030408579856157303,
        -0.018136268481612206,
        -0.015915917232632637,
        0.06375770270824432,
        -0.004764032084494829,
        -0.01766316220164299,
        -0.03564593940973282,
        0.007952307350933552,
        -0.05805857107043266,
        0.020981766283512115,
        0.049067407846450806,
        -0.10911132395267487,
        -0.019993549212813377,
        -0.02094818837940693,
        -0.008360971696674824,
        0.08304720371961594,
        0.018042774870991707,
        -0.03594959154725075,
        -0.012959197163581848,
        0.020115651190280914,
        -0.013545981608331203,
        0.13981345295906067,
        0.032914984971284866,
        0.05222763866186142,
        0.011796138249337673,
        -0.0016228276072070003,
        -0.024629801511764526,
        -0.0789308100938797,
        -0.04236997663974762,
        0.007644197437912226,
        -0.012226355262100697,
        0.02497016452252865,
        0.01540232915431261,
        -0.03480391949415207,
        -0.017868636175990105,
        0.07380811125040054,
        0.07134746760129929,
        0.029466452077031136,
        -0.0014328568940982223,
        -0.037770386785268784,
        0.12047700583934784,
        0.040235232561826706,
        0.02204415388405323,
        0.025058744475245476,
        0.03274691477417946,
        0.04136883094906807,
        0.009139121510088444,
        -0.07309820502996445,
        -0.05594269931316376,
        0.061585187911987305,
        0.04515499994158745,
        -0.03615197911858559,
        -0.05650944635272026,
        0.01051000040024519,
        -0.09335459768772125,
        -0.01373695582151413,
        -0.025523163378238678,
        -0.038831956684589386,
        -0.02324177511036396,
        -0.006104646250605583,
        0.021513022482395172,
        -0.03359141945838928,
        0.0021747269202023745,
        0.019238464534282684,
        0.0352163165807724,
        -0.06681329756975174,
        0.015744337812066078,
        -0.07864369451999664,
        0.006166092585772276,
        -0.004810130223631859,
        -5.406209824053044e-33,
        0.06172358617186546,
        -0.029062742367386818,
        0.06325660645961761,
        0.025586748495697975,
        -0.009733212180435658,
        -0.0007682465948164463,
        -0.014193307608366013,
        0.012340035289525986,
        -0.007679353002458811,
        -0.01732073910534382,
        0.01603061519563198,
        -0.020369108766317368,
        0.03208989277482033,
        0.049358706921339035,
        -0.0138325784355402,
        -0.07769434154033661,
        0.029470911249518394,
        -0.008634962141513824,
        0.027568744495511055,
        -0.01982644945383072,
        -0.01971684955060482,
        0.026080787181854248,
        0.035460151731967926,
        0.05026726797223091,
        -0.09544059634208679,
        0.04664725810289383,
        -0.0033055327367037535,
        -0.06004535034298897,
        0.1287558227777481,
        0.05474976450204849,
        -0.0209345780313015,
        -0.008909651078283787,
        0.03396480903029442,
        -0.02755393274128437,
        0.042455192655324936,
        0.0043763346038758755,
        0.04421762377023697,
        0.030315576121211052,
        -0.045750413089990616,
        -0.11721177399158478,
        -0.08558990806341171,
        0.08746518939733505,
        -0.009374339133501053,
        -0.06292908638715744,
        0.03045879490673542,
        -0.09730415046215057,
        -0.06791936606168747,
        0.09043364226818085,
        -0.050845928490161896,
        0.09151622653007507,
        0.05635488033294678,
        -0.03716367110610008,
        0.03254958987236023,
        -0.08807408809661865,
        -0.061611391603946686,
        -0.04276195913553238,
        -0.08248699456453323,
        -0.04162238910794258,
        0.09629994630813599,
        0.0459226593375206,
        -0.004132739268243313,
        0.0057702576741576195,
        -0.10438141971826553,
        -0.055582113564014435,
        -0.032808855175971985,
        0.07749039679765701,
        0.08734834939241409,
        0.027751727029681206,
        -0.049028508365154266,
        0.03458302095532417,
        0.07697700709104538,
        0.013278346508741379,
        -0.012636939063668251,
        -0.08559578657150269,
        -0.0699775367975235,
        0.04716400057077408,
        -0.1209515631198883,
        -0.006814180873334408,
        -0.09577303379774094,
        -0.04804306477308273,
        -0.05271615460515022,
        0.008959370665252209,
        -0.003357761772349477,
        0.057576004415750504,
        0.004443447105586529,
        0.03989865630865097,
        0.025174761191010475,
        -0.014225051738321781,
        -0.057211991399526596,
        0.05312857776880264,
        0.06885748356580734,
        -0.011289205402135849,
        -0.02036711387336254,
        0.10440818965435028,
        -0.02175498567521572,
        -5.7121479102306694e-08,
        -0.013001739047467709,
        0.06794809550046921,
        0.0030379502568393946,
        -0.030527785420417786,
        0.007359563373029232,
        -0.0766795203089714,
        0.022368671372532845,
        0.010980870574712753,
        -0.012037520296871662,
        0.04784268140792847,
        0.00021494766406249255,
        -0.030743608251214027,
        0.01865360513329506,
        0.07120665162801743,
        0.05394355207681656,
        0.08725027740001678,
        -0.06101343408226967,
        -0.04952554777264595,
        -0.017673229798674583,
        0.006332479417324066,
        0.011330378241837025,
        -0.03743932023644447,
        0.11119220405817032,
        -0.001505728461779654,
        -0.04163767024874687,
        0.008968346752226353,
        0.05175289511680603,
        0.05878521502017975,
        0.14489594101905823,
        -0.020207876339554787,
        -0.0005673500127159059,
        -0.011402025818824768,
        -0.013067221269011497,
        -0.03172031044960022,
        0.018181752413511276,
        -0.09317944198846817,
        0.008687996305525303,
        -0.0088230911642313,
        0.07897957414388657,
        -0.012219233438372612,
        -0.021588247269392014,
        -0.03845222666859627,
        -0.04845695197582245,
        0.021363183856010437,
        -0.07403998076915741,
        -0.08307021111249924,
        -0.07437930256128311,
        -0.020182540640234947,
        -0.05445263534784317,
        0.09928306192159653,
        -0.02147505432367325,
        0.0581238828599453,
        -0.01864486187696457,
        0.04422461986541748,
        0.09261678159236908,
        -0.0060297963209450245,
        -0.0013939442578703165,
        0.042477864772081375,
        -0.07134383916854858,
        0.038496702909469604,
        0.03394050896167755,
        -0.00918465107679367,
        0.06160888075828552,
        0.06955665349960327
    ]
}