{
    "id": "h7Ws8us8f0I",
    "title": "Don’t take it from me - Bose QuietComfort Ultra",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-11-02T19:00:18Z",
    "video_url": "https://www.youtube.com/watch?v=h7Ws8us8f0I",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "Bose",
        "Bose QC",
        "Bose QuietComfort",
        "Headphones",
        "QC45",
        "QuietComfort",
        "Earbuds",
        "Noise cancelling"
    ],
    "views": 412135,
    "likes": 10945,
    "comments_count": 534,
    "description": "Thanks to Bose for sponsoring this video! Learn more about the Bose QuietComfort Ultra at:   Bose has been making their QuietComfort headphones for over 20 years now. But this time around, they're Ultra. What does that mean exactly? Well, you'll have to watch the video and find out!  Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Intro 0:20 Unboxing 1:53 Design impressions 3:43 Pairing to the phone & setup 6:25 Immersive audio test 8:05 Regular audio test 8:40 Frequency response graphs & more 11:20 Microphone test 11:31 Extra features 12:59 Outro",
    "description_links": [
        "https://lmg.gg/BoseQCUltra",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "When I was in college, I bought a headphone that in its own small way would change my life because it was the first thing that actually sounded great and made me really pay attention to music and kind of begin my journey as what I would call, not really an audiophile, but an appreciator of good audio. And that headphone was from Bose. This headphone is from Bose. This is the QuietComfort Ultra. So Bose reached out to sponsor this video to talk about this new line of headphone because they haven't had this before. What they had before was the QC45s. Now they changed that to QuietComfort headphone. They also introduced this new tier, which includes this. Oh God. You know what? The QuietComfort Ultra. And they did the same thing for the in-ears. These little guys, the QuietComfort Ultra earbuds. Maybe we'll put those on in a little bit too. Looking at the box, they've got some real quick instructions here. They've got a QR code so you can download the app. We've already got the app. We'll be checking that out. And then they've just got like a desiccant that they tell you not to eat, but grocery prices these days. I'll take whatever I can get. And here we are with the case. This is a protein leather kind of case. It has some structure to it. So offering some protection. The zipper quality is always important. That's smooth. I mean, as far as travel cases go, this is pretty nice. It's got this extra bump to keep these things from flipping around in there. You can see these do fold for travel, but we'll look at them in a little bit. Yeah, this is pretty cool. It's got this little pocket. It comes with a little cable here, an auxiliary cable for wired playback. Looks like it's about three feet long. Oh my, I've already ruined it. Doesn't matter. A USB A to C cable. Note though that this is for power only. There's no music playback via USB-C. They come in three colors. There's black, sandstone, and white smoke, which is what this is. And you must be holding a whiskey when you tell people that. They've got these plushy protein leather ear cups. They don't look like they easily detach. Oh, oh. They do. There they are. And you can see there's actually a bit of a contour on the baffle here. It's deeper at the back than it is near the front. Yeah, you could totally replace these. You can see the protein leather wrapping around with some speed holes or airflow holes around the actual foam there. And let's see how easily I can snap them back on. It looks like they're completely symmetrical. It doesn't really matter if it's up or down. Done. That was easy. And you can see how much squish they got. The squish factor. It's what I look for in a partner. And just doing a little physical tour here, I can see there's some venting on the ear cups in three different spots. I can see at least one mic hole. There's your plug for the auxiliary. There's your USB-C for the charging. For the adjustment mechanism, we have a continuous movement. And let's see how large these get. What kind of melon support we got on these, you know? That big. I would probably crank these down. Wow, an immediate sense of noise cancellation. And a helpful voice telling me the battery's full. Very light as well, 254 grams. I wanna get into how they sound and how it works with the app and everything. Right after this message from Just Joking, the whole video is sponsored. Honestly, I don't know that these are all just for venting. There's a lot of perforations here. You got those two on the front, on the top, and then kind of on the back. Some of these might also be for mic holes. I don't know why that sounds so funny. Michael, Michael Robert George Kimber, get down here. They need Bluetooth access. That makes sense. Bluetooth 5.3. Okay, press and hold the Bluetooth button until you hear ready to connect. And the Bluetooth light slowly pulses blue. I can't look at the light and hear it at the same time, you guys. Pear, my favorite Bluetooth operation and a really good fruit too. Product tips. When you take off your headphones, they go to sleep and save battery. When you put them on, they wake up. If you don't use them for 24 hours, they power off completely. Holy, after 24 hours? Man, these things must just only sip power if they can do that. You can change the auto-off time and settings. Or if you don't wanna put them back on, you just hit the power button. That'll wake them up too. And you can, of course, put them to sleep by holding down the power button. Okay, so this larger button that I thought was an action button is the play and pause button. And it's near the back. Press the multifunction button at the back of the ear cup to play and pause. Double press to skip. Three times for previous. If you're on a call, the button changes to be able to answer the call, hang up. And that line that I saw earlier, swipe up and down for volume. You can see, oh look, the phone is reacting. It's swipey. So it's a combination of buttons and capacitive, which I actually like, because I don't really like tapping on capacitive things. Okay, now this is what I'm interested in hearing, because I don't think you can actually just turn off active noise canceling. So let's see the details here. Use quiet mode for our highest noise canceling level. Use aware mode to hear the world around you. So you're going from quiet mode to awareness mode between active noise canceling full on to full transparency. Then there's immersion mode. The reason that this exists, the difference between this headphone and the quiet comfort non-ultra headphone. Immersion mode. Level up your content with immersive audio and our class leading noise cancellation. So this mode has both spatial audio, which they are calling immersion, immersive audio, with active noise canceling turned on. This is the most realistic sounding audio you can get. And it actually converts any signal coming through Bluetooth to immersive audio. Touch and hold the volume strip on the right ear cup to use your shortcut, like quick access to immersive mode or voice control. Wow. Even the capacitive strip is also a button if you hold it long enough. Interesting. All set, let's go. Oh, someone was listening to Josie by Steely Dan. That's a great track. Was it me? Was I the last one? Aware. Wow. I'm aware. Wow. Holy cow. The buzzing from this transformer over there, it's just like, it's gone. It's just gone now. That's great. I am going to listen to music in these very soon, but I do wanna check out this immersion mode thing. And I think there might be a demo for you to check out. Audio stays. Oh, that has nothing to do with me. Audio stays in place. This is the best when you're sitting down. Audio follows you. This is best when you're moving around. Okay, yeah, that makes sense. Because one of the things with spatial audio is head tracking. So if I'm just like sitting on a chair using this, one thing that spatial audio does is kind of simulate that the sound, instead of being in the middle of your head and coming from the drivers that are on your ears, it's like you're using a home theater where you've got, say, bookshelf or tower speakers in front of you. You can have head tracking where if I turn my head, you know, hello, are you speaking to me? The TV still stays over here. But if I was moving around, like cooking dinner using this, then my point of reference would be all messed up. So I'd probably wanna have motion mode on. I'm gonna use still for now. Let's try the demo. Man, if she's not immersed, I don't know. Oh, this is a very loud demo. Scroll. Oh yeah, I can hear it panning. Ah, this sounds great to be honest. Mm-hmm, it sounds like the sound is kind of just like an arm's length away. There's just like a wall of it. And kind of up here too, a lot of these elements. A little shaker back here. Wow, I gotta say, I am enveloped. That is very cool. Now if I do motion, audio follows me. Yeah. I think I like still better. That was cool. I never have really been sold on the spatial audio thing, so I don't know. Maybe it's happening, I don't know. Now I'm gonna listen to some music I love, and we can talk about the frequency response of these headphones. Who's listening to Justice? Oh yeah, this is a great era of my life. Oh, these rock, man. In terms of like caliper pressure and like sticking on you, you could work out in these. If someone pushes you down to the ground like in judo or something, you might lose an ear. Comfortable though. And they do offer you an equalizer in the app. It just has three different little grabbies. Not super high resolution, but definitely appreciated if you don't love the out-of-the-box curve, which we will look at now. So the reason these sounded so exciting to me probably is because I am used to a much more neutral headphone than these. These are what we would call moderately V-shaped. These have a bit of a boost on both the high end and the low end. On the high end, it's about like a five dB boost at about 3000 Hertz. The bass boosting starts at about 20 Hertz and goes up to about 200, which is a little higher up in the range, a little into the lower mid range. To you, it might sound like these are like really exciting and lively, or maybe they sound a bit shouty and the bass is just like overcooked. What Bose has done here is quite subtle. Like we said, moderately V-shaped. It's like a tasteful nude. I would say they did it in a nice way. I was pretty happy listening to them like as a first impression. And I should say that the frequency response of this headphone is very similar to what we measured on these earphones, which is pretty cool. If you're kind of a Bose enthusiast and you have both of these for some reason, you have consistency across products, which I think is actually pretty cool. Another feature of the sound on these is volume dependent EQ. So there's different sensitivities to different frequencies in your ears, right? So as music gets quieter, you can't hear the bass, for example, as loudly. That's why for some headphones or speakers, you really got to turn it up for it to sound good. That is not gonna be so much of a thing on these because as you can see at different volumes, that's what the different colors on this graph represent, they actually boost the bass and the treble. They boost it more and more the quieter the volume is so that the sound you perceive stays more constant. We also measured the dynamic range performance. So this is like how consistent they sound when you turn them up from a compression standpoint. These measured great, although you can see there is an imperfection here when we turn them all the way around the 200 Hertz area, there's a bit of a dip. So that would manifest as a compression artifact that sounds, I guess, kind of pumpy. Not to a huge degree. This is less than five dB, but it's there. And finally, the noise cancellation. This is with it in quiet mode. So just as much cancellation as you can get, and you can see it's very good. This is like what we would call tier one noise cancellation. You're getting almost 30 dB of cancellation around 40 Hertz down to 33 dB of cancellation when you're closer to 200. You're even getting more than that in that treble. So these are gonna be great on a plane or in a cafe or just in your house because you hate your family. You know what? Maybe I do need to buy both pairs. Though it should be noted that if your main thing is noise cancellation when it comes to your purchase of your next speaker in your head device, these ones give you a little bit more noise cancellation at some frequencies than these, some worse than other frequencies. Now, of course, it's a Bluetooth microphone. So there's limits to how good it can sound. And it's not really Bose's fault. This is what it sounds like. It's Bluetooth baby, Bluetooth 5.3. These also have custom tune. Now it's not really something you need to do. Every time you turn these on, you'll just, it'll play a tone. And that tone, does it work like sonar? Bounces around your head? I don't know. It's magic, but it will adjust the EQ for your particular ear shape. I'm gonna turn these on while wearing them and apparently it's gonna play a tone that will initiate this. Sounds like, I don't know, like a cello or something or maybe multiple instruments. I don't know. I'm just a layman. For battery life, they're advertising up to 24 hours of playback, 18 hours with immersive mode on. And you might just binge watch so many of your favorite shows with that on because you can actually sync these to your Bose soundbar using simple sync. It's so easy, you guys. And basically your family can be listening through the soundbar while you're like, I like it loud. I like my own custom ear canal tuning and listen along in your headphones. Before we go though, I do wanna open these up. I wanna just see how different they are from the other ones, what they look like. Here's what's in the box. This is just rapid fire. They got ear tips in here? They do. They got this little case. They look pretty similar to the other ones I checked out. You should check that video if you're interested in. They really have a similar sound profile to those other earphones as well. It's just that they also have immersive mode. 299 for the ultra earbuds, $429 for the new QuietComfort Ultra headphone. So thanks for watching, guys. And thanks to Bose for letting us check out their all new ultra line of headphones and earphones. And if you like this video, we've got lots of content covering other audio products, including the non-ultra QuietComfort earbuds.",
    "transcript_keywords": [
        "audio",
        "mode",
        "Bluetooth",
        "QuietComfort Ultra",
        "sound",
        "Bose",
        "headphone",
        "noise",
        "noise cancellation",
        "Ultra",
        "button",
        "kind",
        "cancellation",
        "ear",
        "sounds",
        "QuietComfort Ultra headphone",
        "thing",
        "QuietComfort",
        "back",
        "bit"
    ],
    "transcript_entity_values": [
        "Michael Robert George Kimber",
        "almost 30",
        "Three",
        "Hertz",
        "three",
        "USB-C.",
        "Steely Dan",
        "40",
        "Audio",
        "one",
        "Michael",
        "USB",
        "33",
        "about 200",
        "Josie",
        "299",
        "Bose",
        "The QuietComfort Ultra",
        "Bose",
        "24 hours",
        "200",
        "Hertz",
        "at least one",
        "about 3000",
        "QuietComfort Ultra",
        "18 hours",
        "429",
        "Bluetooth",
        "first",
        "these days",
        "two",
        "the QuietComfort Ultra",
        "QuietComfort",
        "5.3",
        "EQ",
        "Bose",
        "Justice",
        "less than five",
        "about three feet",
        "254 grams",
        "five",
        "about 20"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "MONEY",
        "PERSON",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.0556207075715065,
        -0.02942773886024952,
        -0.01040002703666687,
        -0.012908203527331352,
        0.061402980238199234,
        0.05982659012079239,
        0.043937068432569504,
        -0.018132349476218224,
        0.005889989901334047,
        -0.022567143663764,
        0.016940245404839516,
        0.019390873610973358,
        -0.013018675148487091,
        -0.08809326589107513,
        -0.011254338547587395,
        0.001602297299541533,
        0.04433201253414154,
        -0.10407888144254684,
        -0.11903146654367447,
        0.01729358732700348,
        0.022391846403479576,
        -0.025332799181342125,
        0.010626968927681446,
        0.07653088122606277,
        -0.010054743848741055,
        -0.009494968689978123,
        -0.0014818073250353336,
        -0.046349264681339264,
        0.0687982514500618,
        -0.0625067949295044,
        0.00025396913406439126,
        0.10714875906705856,
        0.10806871950626373,
        0.01014572475105524,
        -0.03203865513205528,
        -0.008753406815230846,
        -0.01690998114645481,
        -0.061631783843040466,
        -0.05266064032912254,
        0.011029289104044437,
        -0.008623725734651089,
        -0.054483138024806976,
        -0.06801176816225052,
        0.008494964800775051,
        -0.09250911325216293,
        -0.017281128093600273,
        -0.04895520582795143,
        -0.04861033335328102,
        -0.02414287067949772,
        -0.013840981759130955,
        0.026733331382274628,
        -0.022939475253224373,
        0.027255021035671234,
        0.020297301933169365,
        -0.003921076189726591,
        0.02999202348291874,
        -0.04055245965719223,
        0.017575375735759735,
        0.06960376352071762,
        -0.0026145700830966234,
        0.06553572416305542,
        -0.04900655150413513,
        -0.005450989585369825,
        0.017787743359804153,
        0.08851955085992813,
        0.04147738218307495,
        -0.12253529578447342,
        0.09024442732334137,
        -0.048644714057445526,
        -0.01914736069738865,
        0.031088348478078842,
        -0.025738216936588287,
        0.001224293140694499,
        0.08921198546886444,
        0.09894166886806488,
        -0.057849060744047165,
        0.05230927839875221,
        -0.027410343289375305,
        -0.04111458733677864,
        0.04163661599159241,
        -0.036223284900188446,
        -0.12801533937454224,
        -0.011434897780418396,
        -0.04626288637518883,
        0.02647927775979042,
        0.03448909893631935,
        -0.008696872740983963,
        -0.03131521865725517,
        -0.1331673413515091,
        -0.10499513149261475,
        -0.03910042345523834,
        -0.04185382276773453,
        0.021140186116099358,
        0.0040764049626886845,
        0.010868294164538383,
        -0.015980593860149384,
        -0.04118376225233078,
        -0.007542611565440893,
        0.042727380990982056,
        0.048498623073101044,
        0.06072048470377922,
        0.02553272433578968,
        -0.03140348941087723,
        -0.014398464001715183,
        -0.06436587125062943,
        -0.15463371574878693,
        -0.032020941376686096,
        0.051514752209186554,
        0.044235941022634506,
        0.015113964676856995,
        -0.0727115273475647,
        -0.007760200649499893,
        -0.008863621391355991,
        0.0076494840905070305,
        -0.0805388018488884,
        -0.04322943836450577,
        -0.06699220091104507,
        0.06601423025131226,
        0.046604692935943604,
        -0.03337602689862251,
        0.010627604089677334,
        0.054708629846572876,
        -0.04942239820957184,
        0.011485634371638298,
        -0.0654965490102768,
        0.03524824604392052,
        -0.07644912600517273,
        -2.2890181088371625e-34,
        0.066812664270401,
        0.04552486911416054,
        -0.01833317056298256,
        -0.08731632679700851,
        0.04218008741736412,
        -0.014018671587109566,
        -0.03532809391617775,
        0.00432942807674408,
        -0.05427565425634384,
        0.09367229044437408,
        -0.004638196900486946,
        0.08200525492429733,
        0.004523952025920153,
        0.06667432934045792,
        -0.022770514711737633,
        -0.12684693932533264,
        -0.03627050668001175,
        0.02820161171257496,
        0.005067585501819849,
        -0.01013440452516079,
        -0.047881219536066055,
        0.08445034176111221,
        -0.03342870622873306,
        -0.01925528421998024,
        0.07735893875360489,
        -0.03389498591423035,
        -0.003534367075189948,
        0.02768760919570923,
        0.020570162683725357,
        0.03788014128804207,
        -0.09924809634685516,
        0.03966620936989784,
        -0.0003877149138133973,
        -0.10196114331483841,
        0.008248438127338886,
        0.03473656252026558,
        -0.04989330843091011,
        -0.030742667615413666,
        0.009357823990285397,
        0.0013906472595408559,
        0.04493371769785881,
        -0.02507384680211544,
        -0.105618417263031,
        -0.03702738508582115,
        -0.0496092326939106,
        0.036410801112651825,
        0.01027566660195589,
        0.05233188718557358,
        0.09591542184352875,
        -0.01919204369187355,
        -0.03124718740582466,
        0.009047403931617737,
        -0.08952175080776215,
        -0.06334149092435837,
        0.04765484482049942,
        -0.051585059612989426,
        0.006837580818682909,
        -0.012217366136610508,
        0.06574934720993042,
        0.0003201689978595823,
        0.09051159769296646,
        0.019106490537524223,
        0.011942887678742409,
        -0.017816750332713127,
        -0.030437324196100235,
        0.06988970935344696,
        -0.006164224818348885,
        0.0003784152795560658,
        -0.02653391845524311,
        -0.05752740427851677,
        -0.012517975643277168,
        0.0139511963352561,
        0.06132303550839424,
        -0.023807676509022713,
        0.016496146097779274,
        0.008801800198853016,
        -0.053018718957901,
        0.004135314840823412,
        0.06645176559686661,
        -0.0186562892049551,
        -0.08555910736322403,
        0.08492043614387512,
        0.01672935113310814,
        0.07611328363418579,
        -0.03716708719730377,
        -0.0051915706135332584,
        -0.03427116945385933,
        -0.0715697631239891,
        -0.10302410274744034,
        0.0031057405285537243,
        -0.09375092387199402,
        0.006209221202880144,
        -0.0980755165219307,
        -0.044953446835279465,
        -0.07127659022808075,
        -4.502625683675183e-33,
        0.05683029443025589,
        0.01832776516675949,
        -0.042840488255023956,
        0.02288513071835041,
        0.0788353905081749,
        0.018538963049650192,
        -0.007917670533061028,
        0.05156765505671501,
        0.05273441970348358,
        0.05014317110180855,
        0.09857539087533951,
        -0.020579252392053604,
        -0.08466091006994247,
        -0.052545979619026184,
        -0.038103729486465454,
        -0.018886398524045944,
        0.03494570031762123,
        -0.036854617297649384,
        -0.029576273635029793,
        -0.022260716184973717,
        0.11590644717216492,
        -0.01180948968976736,
        0.01944618672132492,
        0.03224269300699234,
        -0.06876659393310547,
        -0.03263716772198677,
        0.06975538283586502,
        0.028278928250074387,
        -0.03000863455235958,
        -0.0018030648352578282,
        -0.042145851999521255,
        -0.045950766652822495,
        -0.10986437648534775,
        -0.022776441648602486,
        -0.025776874274015427,
        -0.037244923412799835,
        0.007522427011281252,
        0.07360474020242691,
        -0.042659882456064224,
        -0.12602528929710388,
        -0.05551934242248535,
        0.03232303634285927,
        0.033799733966588974,
        -0.038116298615932465,
        0.018446166068315506,
        -0.05063357576727867,
        -0.04064539447426796,
        -0.08108413964509964,
        0.012879877351224422,
        -0.017147406935691833,
        0.030920740216970444,
        -0.008761627599596977,
        0.11965429782867432,
        0.06278342008590698,
        -0.10606852173805237,
        -0.05021481588482857,
        -0.10033935308456421,
        0.02860763669013977,
        0.04971161112189293,
        -0.030877521261572838,
        0.10448736697435379,
        -0.024649079889059067,
        -0.021923702210187912,
        0.01961074210703373,
        -0.009394187480211258,
        0.021072588860988617,
        -0.013816576451063156,
        0.036590661853551865,
        0.007727782242000103,
        -0.007795523852109909,
        0.02848430909216404,
        -0.03712499514222145,
        0.037764739245176315,
        -0.006756320595741272,
        -0.08802437037229538,
        0.02318280003964901,
        -0.04901783540844917,
        -0.036895811557769775,
        0.028435708954930305,
        0.01735958829522133,
        -0.02047930285334587,
        0.04149085655808449,
        0.03718744218349457,
        0.08922994136810303,
        0.044585272669792175,
        -0.004002043046057224,
        -0.00765297980979085,
        -0.03869272395968437,
        -0.014697160571813583,
        0.04038538038730621,
        -0.03526903688907623,
        0.019716938957571983,
        -0.01295645534992218,
        0.015473895706236362,
        0.009643442928791046,
        -6.222092707730553e-08,
        0.010757303796708584,
        -0.024471133947372437,
        -0.035295892506837845,
        -0.03653794527053833,
        0.0451069213449955,
        -0.06332806497812271,
        0.005797078367322683,
        -0.041556283831596375,
        -0.007539114914834499,
        -0.0010833620326593518,
        -0.004855025094002485,
        -0.07644712924957275,
        -0.032405029982328415,
        -0.02065202221274376,
        0.05099337175488472,
        0.036747198551893234,
        -0.0004987515276297927,
        0.07318154722452164,
        0.0052690766751766205,
        -0.03026629239320755,
        -0.05464750900864601,
        0.0961780995130539,
        0.14351995289325714,
        -0.03792542964220047,
        0.0014596938854083419,
        0.05759904161095619,
        0.06702180951833725,
        0.01076129823923111,
        0.09322048723697662,
        -0.020731573924422264,
        -0.05812990292906761,
        0.056744880974292755,
        -0.025600099936127663,
        -0.026736102998256683,
        -0.03191560134291649,
        -0.03115822747349739,
        -0.06978044658899307,
        0.04868853837251663,
        -0.04667706415057182,
        0.026307109743356705,
        -0.05290134996175766,
        -0.029870089143514633,
        0.021307624876499176,
        0.06781227886676788,
        0.06044969707727432,
        -0.06805464625358582,
        0.03991703316569328,
        0.03330155834555626,
        0.009538284502923489,
        0.06970386207103729,
        -0.006873970851302147,
        0.01005756575614214,
        -0.032441042363643646,
        0.021191587671637535,
        -0.005908829625695944,
        0.013640318065881729,
        -0.08584460616111755,
        0.046317655593156815,
        -0.11080474406480789,
        0.06340674310922623,
        0.02059231512248516,
        -0.03227849677205086,
        0.03759530186653137,
        0.08951913565397263
    ]
}