{
    "id": "H8PLt4lG-tY",
    "title": "The Ultimate Pocket Camera: Insta360 X3!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-09-09T18:59:05Z",
    "video_url": "https://www.youtube.com/watch?v=H8PLt4lG-tY",
    "category": "Science & Technology",
    "tags": [],
    "views": 3120615,
    "likes": 102508,
    "comments_count": 2857,
    "description": "Welcome to my pocket camera arsenal, X3!  The Auto Focus channel:   Thanks to Insta360 for sponsoring today's video! Grab their latest X3 camera with our affiliate link at  and get their free invisible selfie stick for a limited time!  MKBHD Merch:   Tech I'm using right now:   Intro Track: Jordyn Edmonds   Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "https://www.youtube.com/channel/UC2J-0g_nxlwcD9JBK1eTleQ",
        "https://geni.us/Insta360X3",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://smarturl.it/jordynedmonds",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "- [Marques] This video is sponsored by Insta360. So this tiny camera has basically one great trick that makes it the most versatile camera that I've ever used. So there's been action cameras and 360 cameras for a while now. I've tried some on and off for a few years. But Insta360 asked to sponsor a look at their latest, highest quality, most fully featured version yet. This is the X3 and I'm really glad I did. So here's how it works. This camera body has two 1/2-inch, high resolution sensors back-to-back. So they're each recording a super wide-angle video that stretches way back, actually a little beyond 180 degrees. And so since each camera goes a bit beyond 180, there's a little overlap at the seams. And then the camera does the work to stitch the two feeds together into one. And then even better, since it knows where the mounting point is, it knows where a selfie stick would be and it can stitch that out of the video. And then of course, it knows its own exact dimensions so it can also stitch itself out of the shot. So essentially it creates this invisible ball of 360-degree video capturing goodness, which is pretty sick. But honestly, the how it works isn't nearly as interesting as what it actually enables you to do. So check this out. You pair it up to your phone, right? You can see what the camera's pointed at, which is me. And then when I start moving it, it stays pointed at me. So they named this FlowState Stabilization. Basically, it's using AI to find a horizon and keep that level and locking on a target somewhere in that sphere of video. And now you're really getting an idea of the power of this camera. This isn't something you get just to shoot spherical video. Really, this is a sphere of video where you can choose any piece of that sphere to point at and use. And that's what makes this the most versatile camera I've ever seen. So this X3 is the latest version here to shoot this way. It has a new 1/2-inch sensor, like I said. It can shoot 5.7K 360 video with HDR or 8K time lapses if you want. It has a new 2.3-inch touch screen with tempered glass. And the whole thing is waterproof up to 33 feet with an IPX8 rating with an 1800 milliampere hour removable battery inside. And so then the whole Insta360 advantage, their whole thing is the ability to take advantage of the fact that it's always shooting this whole sphere of video all the time. So if you can picture it, you're just holding a ball of 360 degree video and you can put it wherever you want. So that opens up a massive world of possibilities. So lemme show you some of the things you can do ranging from the simplest to the craziest and most impressive. So the simple one is called Me Mode. You've probably seen this one before. You can hold out the camera on a selfie stick and it tracks you and focuses on you automatically. This is already kind of wild that it looks like there's just a camera floating out in front of you. It can kind of look like a pseudo drone shot if you move it around over your head enough. But it's basically just stitching out the selfie stick and it can export a regular looking widescreen video from a crazy perspective. So then, okay, there's what I like to call GTA Mode, which is basically using the extended selfie stick mounted to a vehicle so that it's basically floating off the back. And thanks to tracking, it has this sick like first person view of an actual car driving down an actual street. You might have seen some of these shots on Instagram. At least I know I have. I really like, though, this next one which is called First Person Mode. This is something I'm actually gonna start using more on the auto-focused channel that we just started because believe it or not holding a phone in one hand while driving down the highway with the other is not actually the safest thing to do. So all you have to do for First Person is put the camera either on your head or literally hold in your mouth, and then track the part of the sphere that faces forward. And boom, not only do you have a first person, wide-angle shot of what I'm seeing as I drive, but it's super out of the way and it's very useful. Fun fact, the other side of the sphere looks like this. Some people have called this Nose Mode. You might have seen some clips like this, also, all over the internet. But probably the craziest thing I've seen in this software is something called Bullet Time. This is just literally swinging this camera around your head on a string. So Insta360 actually makes a cord just for this feature. It's got a 1/4-20 screw at the end. You connect them and you swing the camera around in slow motion and it can make some pretty sweet videos. Kind of an advanced selfie showing off your environment in 360 degrees. So it's a pretty complex system that's very capable. But the craziest part of all this is that it's all edited on your phone. It's all done in the Insta360 app. So that makes it this sort of next level of accessible. I've been talking about starting YouTube channel on your phone, making videos on your phone. You can do all of this with the camera and one app on your phone. And render times are not bad either. So just going through a clip you've shot on this camera and asking it to track something. It tracks faster than real time, which is sick. And you can do a whole Sky Swap of a video clip in a few seconds. It just analyzes the whole clip and then does a pretty solid convincing Sky Swap. And if you think about it at all, it is much faster, much faster than any Adobe app or motion graphics tool that I've tried. But the whole point is any effect you wanna achieve can be done within the app. So whether it's something super complex like Bullet Time or just some simple reframing, just moving around that sphere of video using keyframing and even using the gyroscope of your phone to point at new things and adjust your shot. It all works very smoothly. No matter what you always have the whole sphere to play with and you can move around and create a custom video of whatever angles you want super quickly. You can get really creative with it. So this is a $449 camera and the app on your phone and a selfie stick. And that's it. That's the whole system. So I'm gonna be adding this to the arsenal for the auto-focused channel, for sure. There is also some accessories. There's this guy, which is a reader accessory. So instead of having to take out the battery, which is removable, to get to the micro SD card, you can just plug it straight into your phone and grab files that way. There is also a mic jack accessory. So you get plug in via USB-C and then there's a mic jack. So things to sort of add a little bit of production quality to this camera that's already pretty solid on its own. And there's also other smart features like Loop Recording which records every 30 minutes, and you can use it as a dash cam. So are there any weaknesses? Basically, the only one that I found is with a 360 setup like this with back to back cameras, if you put the subject right on the seam, like on the edge of where the two cameras are recording, where it's stitching them together, you can get some distortion, especially if you're very close to the camera. But it's pretty easy to shoot around that. It's easy to change the orientation to just make sure somewhere in the sphere is the subject. And then you're good. So yeah, realistically, this is the most versatile camera I've ever seen and actually used. And honestly, I don't even scratch the surface of the creativity that I've seen people do with these cameras. Again, all over my Instagram feed, I've seen people like throwing this around, doing fake drone shots. I saw somebody actually throw it off of a cliff next to somebody who is diving and it just fell into the water. But of course, the sphere captured the person diving right next to the camera. Just cool stuff. So naturally I'm gonna be bringing this into auto-focused videos. First person driving shots, maybe selfie stick outside of the car stuff, things like that. But go ahead and subscribe over there if you wanna see that stuff. I'll have a link below to the channel. I also have a link below to the camera itself. And thanks again to Insta360 for sponsoring this look. But that's pretty much been it. Thanks for watching and I catch you guys in the next one. Peace.",
    "transcript_keywords": [
        "camera",
        "video",
        "sphere",
        "phone",
        "selfie stick",
        "cameras",
        "selfie",
        "person",
        "pretty",
        "versatile camera",
        "stick",
        "Mode",
        "basically",
        "time",
        "shot",
        "app",
        "videos",
        "thing",
        "things",
        "sphere of video"
    ],
    "transcript_entity_values": [
        "1/4-20",
        "this FlowState Stabilization",
        "AI",
        "1/2-inch",
        "Me Mode",
        "360 degrees",
        "one",
        "a few years",
        "a few seconds",
        "two 1/2-inch",
        "Bullet Time",
        "5.7",
        "8",
        "Loop Recording",
        "Sky Swap",
        "180",
        "33 feet",
        "First Person",
        "first",
        "USB-C",
        "every 30 minutes",
        "1800",
        "First",
        "SD",
        "Adobe",
        "X3",
        "selfie",
        "180 degrees",
        "YouTube",
        "360-degree",
        "449",
        "Instagram",
        "two",
        "IPX8",
        "2.3-inch",
        "up to"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "TIME",
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "FAC",
        "PERSON",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY"
    ],
    "vector": [
        -0.033873461186885834,
        -0.06097197160124779,
        -0.04586739465594292,
        -0.10336830466985703,
        0.13308879733085632,
        -0.05134677141904831,
        0.09733904153108597,
        0.03830330818891525,
        0.019089678302407265,
        0.006379577796906233,
        0.04867880418896675,
        0.015411967411637306,
        -0.016226373612880707,
        -0.02504567615687847,
        0.08129885047674179,
        -0.024880744516849518,
        0.07330048084259033,
        0.00308158528059721,
        -0.07399580627679825,
        0.05957545340061188,
        0.003948403522372246,
        -0.13588881492614746,
        0.013630782254040241,
        0.010571018792688847,
        -0.05784871429204941,
        0.025345968082547188,
        -0.03796854615211487,
        -0.07149742543697357,
        -0.044886454939842224,
        -0.06417501717805862,
        -0.03061290830373764,
        0.0567125640809536,
        0.022129641845822334,
        -0.04052571579813957,
        0.010481424629688263,
        -0.09439045935869217,
        -0.020249228924512863,
        0.00271484418772161,
        -0.15207916498184204,
        -0.027661994099617004,
        0.0019916074816137552,
        0.02175174281001091,
        0.04149317741394043,
        -0.029631590470671654,
        0.04098279029130936,
        0.013431467115879059,
        0.01702331006526947,
        0.02789812535047531,
        0.020771024748682976,
        -0.01696169376373291,
        -0.08331962674856186,
        -0.06702244281768799,
        0.038514070212841034,
        0.02972077578306198,
        -0.05183293670415878,
        0.004856374114751816,
        -0.11644121259450912,
        -0.005714904051274061,
        0.025645786896348,
        -0.01296943984925747,
        0.15324637293815613,
        0.03867040202021599,
        0.01345638744533062,
        0.030925799161195755,
        0.0004284917959012091,
        -0.024322636425495148,
        0.0822673887014389,
        -0.03890889510512352,
        0.012035277672111988,
        -0.013570291921496391,
        -0.0831613764166832,
        0.01768384873867035,
        -0.04100659489631653,
        -0.02540072798728943,
        0.03722172603011131,
        0.0013448023237287998,
        0.03249690681695938,
        0.019778333604335785,
        -0.03632831200957298,
        -0.036235976964235306,
        0.08221761137247086,
        -0.027797430753707886,
        -0.014695301651954651,
        0.06609204411506653,
        -0.006927947048097849,
        -0.027852119877934456,
        -0.03758121281862259,
        0.013104182668030262,
        -0.07984191924333572,
        -0.001721723354421556,
        -0.07868457585573196,
        0.025746438652276993,
        -0.10083432495594025,
        -0.07933151721954346,
        -0.027570029720664024,
        -0.005257454700767994,
        0.01461949571967125,
        -0.04721176251769066,
        -0.011936227791011333,
        0.05091364309191704,
        0.03152509033679962,
        -0.00858211051672697,
        0.040246859192848206,
        0.032966598868370056,
        0.009328256361186504,
        -0.07081714272499084,
        -0.015873076394200325,
        0.03890565410256386,
        0.04406995698809624,
        0.05733470991253853,
        -0.01301458477973938,
        -0.02271142788231373,
        -0.034998826682567596,
        -0.01233820989727974,
        0.011517440900206566,
        0.07408216595649719,
        -0.04431043192744255,
        0.06493781507015228,
        0.08812953531742096,
        -0.04500807076692581,
        0.041134271770715714,
        -0.03729015216231346,
        -0.007092822343111038,
        -0.002067356836050749,
        0.04990090802311897,
        0.010888942517340183,
        -0.017889970913529396,
        6.902533684755181e-33,
        -0.013765711337327957,
        0.15865398943424225,
        0.006195641588419676,
        0.014537671580910683,
        -0.0389864481985569,
        -0.04486570507287979,
        0.007263279519975185,
        0.00759635167196393,
        -0.03700464218854904,
        0.06479403376579285,
        0.034692198038101196,
        -0.006791053339838982,
        -0.005488605238497257,
        0.033643294125795364,
        0.08684884756803513,
        -0.034171782433986664,
        -0.11872269958257675,
        -0.0012034206883981824,
        -0.02956194244325161,
        0.11708896607160568,
        0.07966747879981995,
        -0.0010106463450938463,
        0.021822862327098846,
        0.032018836587667465,
        0.05441786348819733,
        0.04232952743768692,
        0.07818609476089478,
        0.010802564211189747,
        0.031514085829257965,
        0.01787746325135231,
        -0.020621567964553833,
        -0.009063772857189178,
        0.029243802651762962,
        -0.04471563547849655,
        0.018157105892896652,
        -0.012841455638408661,
        -0.07263685762882233,
        -0.0719824880361557,
        -0.03677723929286003,
        0.03643258288502693,
        0.02833418920636177,
        0.0855192244052887,
        -0.050846707075834274,
        -0.08792878687381744,
        -0.016431737691164017,
        0.016836121678352356,
        0.051446251571178436,
        0.11285775154829025,
        -0.04303286224603653,
        0.009104015305638313,
        0.07374986261129379,
        -0.03447696566581726,
        -0.05809042975306511,
        -0.05710991472005844,
        -0.031523697078228,
        0.012354230508208275,
        -0.055332720279693604,
        -0.012222749181091785,
        0.005937671288847923,
        0.023754997178912163,
        0.04424834996461868,
        -0.09310893714427948,
        -0.03703368455171585,
        0.019386297091841698,
        -0.056113846600055695,
        0.05420650169253349,
        0.009908830747008324,
        0.022116413339972496,
        0.007420196197926998,
        0.0410369336605072,
        -0.05591042339801788,
        -0.011475875973701477,
        0.04378015920519829,
        -0.09793226420879364,
        0.10719067603349686,
        0.009045320563018322,
        -0.11241421848535538,
        -0.007764339447021484,
        0.01660744845867157,
        0.04709465801715851,
        -0.061599135398864746,
        0.021758178249001503,
        0.050223905593156815,
        0.045682068914175034,
        -0.05846888944506645,
        -0.025474006310105324,
        -0.036941781640052795,
        0.011097238399088383,
        -0.06911264359951019,
        -0.007851462811231613,
        0.028694652020931244,
        0.03855947032570839,
        0.058570560067892075,
        0.014124319888651371,
        -0.020446211099624634,
        -5.290911093310655e-33,
        0.05348740145564079,
        0.023973051458597183,
        0.004443390294909477,
        -0.013362597674131393,
        0.0394074022769928,
        0.0018655542517080903,
        0.10241285711526871,
        0.09977424144744873,
        0.07936113327741623,
        -0.03301291912794113,
        0.021754706278443336,
        -0.05254187434911728,
        -0.04584603011608124,
        0.043692030012607574,
        -0.04907587170600891,
        -0.018813494592905045,
        0.029258066788315773,
        -0.11528713256120682,
        -0.04345658794045448,
        -0.009616250172257423,
        0.0959116667509079,
        0.002153162844479084,
        0.05180643871426582,
        0.03661099076271057,
        -0.050150204449892044,
        0.06370859593153,
        0.048420969396829605,
        0.05177522078156471,
        0.08414886146783829,
        -0.06550589203834534,
        -0.009628632105886936,
        -0.01749255135655403,
        0.03572443127632141,
        -0.0392209067940712,
        -0.055940113961696625,
        0.04830186814069748,
        -0.023439154028892517,
        0.00464860862120986,
        -0.05187453702092171,
        -0.01869502291083336,
        -0.01029268093407154,
        -0.0007049509440548718,
        0.005402281414717436,
        -0.024857468903064728,
        0.029556110501289368,
        0.008713551796972752,
        0.011297435499727726,
        0.07891790568828583,
        -0.013288084417581558,
        0.06177031993865967,
        -0.027936454862356186,
        0.010782692581415176,
        -0.04544712230563164,
        0.022376736626029015,
        -0.020511779934167862,
        -0.051214322447776794,
        -0.03750007972121239,
        0.006440106779336929,
        -0.018212268128991127,
        0.06154704466462135,
        -0.007843655534088612,
        0.0424184650182724,
        -0.003854498965665698,
        -0.011133218184113503,
        0.026235409080982208,
        0.035447534173727036,
        0.04852063208818436,
        -0.006782940588891506,
        -0.04919486492872238,
        0.06495197862386703,
        0.005591656547039747,
        -0.0011847256682813168,
        0.021529363468289375,
        -0.07209344208240509,
        0.05322268232703209,
        0.026091154664754868,
        -0.009087243117392063,
        -0.04382150620222092,
        0.06900199502706528,
        -0.05660858377814293,
        -0.05949439853429794,
        -0.0727703869342804,
        0.04171312600374222,
        0.11420190334320068,
        0.06382711231708527,
        0.12825043499469757,
        -0.007701096124947071,
        0.031824368983507156,
        -0.02542847953736782,
        0.09828193485736847,
        0.01627568155527115,
        0.055656395852565765,
        -0.009611694142222404,
        0.06387501209974289,
        0.03788452222943306,
        -5.3908870256691444e-08,
        -0.04491253197193146,
        0.03039947710931301,
        -0.07186256349086761,
        0.009703841991722584,
        -0.09150991588830948,
        -0.09796438366174698,
        0.03687775507569313,
        0.030139971524477005,
        0.08268783986568451,
        -0.08516927808523178,
        0.016397912055253983,
        -0.015324884094297886,
        0.002477239351719618,
        0.0006856143590994179,
        0.027939001098275185,
        -0.013083572499454021,
        -0.021899091079831123,
        0.026184139773249626,
        -0.053948868066072464,
        0.01929478533565998,
        -0.02498890832066536,
        -0.06487078219652176,
        0.008253213949501514,
        -0.11582256108522415,
        0.013281905092298985,
        -0.023867318406701088,
        -0.04678668826818466,
        0.009563061408698559,
        0.04871461167931557,
        -0.05633897706866264,
        -0.06160982325673103,
        -0.039041172713041306,
        0.03339084982872009,
        0.009569937363266945,
        -0.021258944645524025,
        -0.10381496697664261,
        -0.044337257742881775,
        -0.031131356954574585,
        0.05968673154711723,
        -0.0027222034987062216,
        -0.00969057995826006,
        -0.005764015484601259,
        -0.012442298233509064,
        0.004130698274821043,
        0.00798182561993599,
        -0.02377726323902607,
        0.0415627583861351,
        -0.10566411912441254,
        -0.057740263640880585,
        -0.006964217405766249,
        -0.10795456916093826,
        -0.05607331544160843,
        -0.0069587342441082,
        0.04329945147037506,
        0.10967922955751419,
        0.03859654441475868,
        0.0903884693980217,
        0.0014786164974793792,
        0.008726135827600956,
        0.09324927628040314,
        0.009840665385127068,
        -0.06403960287570953,
        -0.061283309012651443,
        0.10998476296663284
    ]
}