{
    "id": "h9VykVA0hsM",
    "title": "The Best Black Friday 2018 Tech Deals!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-11-20T20:00:38Z",
    "video_url": "https://www.youtube.com/watch?v=h9VykVA0hsM",
    "category": "Science & Technology",
    "tags": [
        "black friday",
        "black friday 2018",
        "black friday sales",
        "black friday deals",
        "black friday deals 2018",
        "best black friday deals",
        "black friday 2018 deals",
        "xbox",
        "playstation",
        "ps4",
        "xbox one x",
        "smartphone",
        "phone",
        "tv",
        "galaxy s9",
        "camera",
        "homepod",
        "computer",
        "laptop",
        "nintendo switch",
        "austin evans"
    ],
    "views": 656593,
    "likes": 16810,
    "comments_count": 1278,
    "description": "Xbox One X for $400 on Amazon:  Xbox One S w/ Minecraft for $200 on Amazon:  PS4 Slim with Spider-Man for $200 at Gamestop:  PS4 Pro with Red Dead Redemption 2 for $400 at Best Buy:  PlayStation 4 Wireless Controller for $39 on Amazon:  Xbox One Wireless Controller for $47 on Amazon:  PlayStation VR bundle for $200 on Amazon:  Nintendo Switch with Mario Kart 8 Deluxe for $300 at Best Buy:  The Switch is also at Kohl's for $330 with a carrying case, Turtle Beach headset and $90 of Kohl's cash but it's only in store.  COMPUTERS Microsoft Surface Pro 6 with Type Cover for $800 at the Microsoft Store:  Microsoft Surface Go for $450 on Amazon:  Google Pixelbook for $700 at the Google Store:  Acer Aspire 7 gaming laptop for $980 at Newegg:  Acer Nitro 5 for $520 at Best Buy (live on Black Friday):   FUN STUFF 500GB Samsung T5 SSD for $100 on Amazon:  32\" Samsung 4K FreeSync monitor for $350 on Amazon:  Apple HomePod for $250 at Best Buy (live on Black Friday):  Google Chromecast + Home Mini Bundle for $45 at Google Store (live on the 22nd):  Sony A7ii with kit lens for $1000 on Amazon:   PHONES Samsung Galaxy S9 for $520 on Amazon:  Samsung Galaxy Note 9 for $800 on Amazon:  Google Pixel 3 for $650 and Pixel 3 XL for $700 at the Google Store (live on the 22nd):  128GB iPad Mini 4 for $250 at Best Buy (live on Black Friday):   TVs Toshiba 50\" 4K Fire TV for $300 on Amazon (live on the 22nd):  LG 65\" 4K TV for $600 at Best Buy:  Vizio 70\" 4K TV for $750 at Best Buy:    By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Check out our new channel!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://austin.tech/xonex",
        "http://austin.tech/xonesminecraft",
        "https://www.gamestop.com/ps4/consoles/playstation-4-1tb-marvels-spider-man-bundle/169461",
        "https://www.bestbuy.com/site/sony-playstation-4-pro-1tb-red-dead-redemption-2-console-bundle-jet-black/6301643.p?skuId=6301643",
        "http://austin.tech/ps4controller",
        "http://austin.tech/xboxcontroller",
        "http://austin.tech/psvrbundle",
        "https://www.bestbuy.com/site/nintendo-switch-with-mario-kart-8-deluxe-neon-blue-neon-red-joy-con/6302309.p?skuId=6302309",
        "https://www.microsoft.com/en-us/p/surface-pro-6-type-cover-bundle/8vvgcgkpsws0?activetab=pivot%3aoverviewtab",
        "http://austin.tech/surfacego128",
        "https://store.google.com/product/google_pixelbook",
        "https://www.newegg.com/Product/Product.aspx?Item=N82E16834316435",
        "https://www.bestbuy.com/site/acer-nitro-5-15-6-laptop-intel-core-i5-8gb-memory-nvidia-geforce-gtx-1050-1tb-hard-drive-shale-black/6212601.p?skuId=6212601",
        "http://austin.tech/500samsungt5",
        "http://austin.tech/samsung32",
        "https://www.bestbuy.com/site/apple-homepod-space-gray/5902410.p?skuId=5902410",
        "https://store.google.com/category/black_friday_cyber_monday_promos",
        "http://austin.tech/a7ii",
        "http://austin.tech/galaxys9",
        "http://austin.tech/note9",
        "https://store.google.com/product/pixel_3",
        "https://www.bestbuy.com/site/apple-ipad-mini-4-wi-fi-128gb-space-gray/4265700.p?skuId=4265700",
        "http://austin.tech/toshiba50",
        "https://www.bestbuy.com/site/lg-65-class-led-uk6090pua-series-2160p-smart-4k-uhd-tv-with-hdr/6290164.p?skuId=6290164",
        "https://www.bestbuy.com/site/vizio-70-class-led-e-series-2160p-smart-4k-uhd-tv-with-hdr/6259880.p?skuId=6259880",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin, and welcome to the Black Friday deal preview for 2018. Now you guys are all familiar with Black Friday. It's that holiday ever year where people fight over very mildly-discounted electronics, but instead of having to go out and brave the cold, brave the crowds, brave the fights, instead, you can be lazy and shop from the comfort of your own home, but some of the deals are already live right now. Doesn't that sound like a wonderful proposition? Starting with consoles, we have the Xbox One X at $400. Now we've done an entire video on this, but the gist of it is is that you're getting a full 4K experience on a lot of games, and it is straight up the most powerful console experience you can get, specifically even over the PS4 Pro. Now $400 is a pretty solid price considering that it's normally 500 bucks, and unlike some of the other deals which are available only on Black Friday or actual Thanksgiving itself, you can pick up the Xbox One X for $400 starting right now at the link in the description. Next up for the base consoles, we have a $200 deal on not only the PS4 but also the Xbox One. Specifically with that Xbox One, you do get Minecraft bundled, whereas with the PS4 you get the new Spider-Man game, but regardless, $200 is a great pickup, especially if you don't really care about playing at 4K, and of course, links to all this stuff will be in the description. Did you get that point yet? We're linking everything in the description. Literally everything. Now something I wasn't able to find this year was any good PS4 Pro deals, so it, weirdly, it actually feels like it's out of stock in a lot of places, but the best thing I could do is at Best Buy you can pick up a Red Dead Redemption bundle with the PS4 Pro for 400 bucks, but this doesn't really seem like a good time. Honestly, if you're going to pick up a console this year, get either a base PS4, Xbox, or pick up that One X for 400 bucks. For accessories, we have the PS4 controller available on Amazon for $39, the Xbox One controllers available for 47 bucks, and you can pick up PS VR with the full setup as well as a couple games for $200 on Amazon right now. If you want to get in on that Switch action, you can pick up the Switch for $300, and that includes a free copy of Mario Kart 8 at Best Buy, Walmart, and Target, but all of these are going live on Thanksgiving or Black Friday itself, so you'll have to be a little bit patient. Oh, hi, Josh, do you have something to add? - I do. You can go over there to Best Buy, Walmart. Me, I'm gonna be at Kohl's. - Of course. - $330, you get the Switch, you get a carrying case, a Turtle Beach headset, and $90 of Kohl's Cash for $330. - That's a good deal. - I think it's a better deal. - Is that worth being in the cold at Kohl's at 6 p.m. on Thanksgiving? - I'll be on the West Coast. It won't be that cold. - [Austin] Moving over to computers, if you're eyeing up that brand-new Surface Pro 6, you can pick up the Core i5 version with the bundled Type Cover, which does not come with it normally, for $799 right now at the Microsoft Store. That's especially a good deal considering that it's a full, what, $270 off the normal price? Speaking of the Surface, my favorite Surface product announced this year is actually the Surface Go, which is also on sale. This guy is a lot cheaper, so we're only going to save $50, but for 450 bucks, you can pick it up on Amazon right now, and importantly, it's the 128-gig version, unlike the lower-end version which is much slower. 128 is definitely the way to go, and for 450, not bad. Now if you're all about that Chrome OS life, and I'm not sure that there are a ton of people who are, but if you are, you can pick up the Google Pixelbook for a full $300 off on the Google Store. That does bring it down from 1,000 to 700 bucks, but the catch here is that you do need to wait until at least Black Friday, or actually, I think it goes live on the 22nd. But the Pixelbook, even though it's a little bit weird, even though it's a little expensive, at $700 is a really solid laptop if you're okay with the limitations of Chrome OS. Get into the gaming laptops, and we have a few different options. Some of the best ones I've seen is an Acer Aspire 7 available over at Newegg. Now this does have a full 17-inch screen. It's got the new Core i7 as well as the GTX 1060, and that's going to only run you $980. If that's too expensive for you, of course you can pick up the Acer Nitro 5 for $520 at Best Buy. Now that is going to get you a full Core i5 processor, eight gigs of RAM as well as a GTX 1050. The only real downside in addition that that this is one of the deals that goes live on Thanksgiving is that you do only have a one terabyte hard drive, so you're probably gonna want to budget a little bit of money to upgrade this guy with an SSD, but a proper gaming laptop that you can play some real games with for $520 is definitely a solid Black Friday deal. Deal Raptor, what's the next deal? Oh, really, is it a Samsung T5 500-gigabyte version for only $100? That's really impressive! Yeah, I know, I'm excited about it too. The Samsung T5 is something that we use on a daily basis to edit all of our videos, so they're very fast SSDs that are based on USB Type C. All right, that's okay, I got you. Yeah, for $100, this is a great deal, and of course you can get the larger capacities, but Deal Raptor, he likes the 500 gig, right? Right? Continuing along the deal train, we have a Samsung 32-inch FreeSync monitor, and this is a full 4K display for only $350 right now. We're gonna turn off Deal Raptor for a second because we got a lot more deals for you, starting with the Apple HomePod. Now this is available for $100 off at Best Buy for Black Friday, which does bring it down to $250. Still expensive, but it is a very good-sounding speaker. The only downside really is that you are limited with Siri, but if you've been looking to pick one up, now seems like the time. Speaking of assistants, the Google Store has a bundle with not only the Google Home Mini but also a Chromecast available for $45. Now usually the Google Home Mini itself costs $50, so essentially you're getting a discount and a free Chromecast. The only downside here is that you do have to wait until the 22nd before the deal's live over at the Google Store, but if you've been looking to upgrade your TV setup and get a little bit of Google Home action, now is the time. I sound like a great infomercial sales person. Now is the time for deals, deals, deals! As far as cameras go, there's some pretty good deals on the Sony side with the A7 Mark II available for only $1,000. Now not only does that include the kit lens, but this is a proper full-frame camera, so you can get some pretty solid video and especially some great stills for only a grand. Robo-raptor's not a big fan of the iPad, but what Robo-raptor is a big fan of are the deals, and one of the best ones I've actually seen on this entire list is the Galaxy S9 available unlocked for only $520. Now you can also get a discount on the Galaxy Note 9 at 800 bucks, but $520 for the basic Galaxy S9-- (electronic roaring) Yeah, I agree, it's a good deal. The Google Store has a solid deal on the Pixel 3 and the Pixel 3 XL, so right now you can get the Pixel 3 for only $650, and you can get the Pixel 3 XL for $700, which is a full $200 off of its normal price. Now the downside here is that you do need to wait until the 22nd like a lot of these other deals, but if you've been waiting to pick up some of my favorite phones of the year, they're now available at much, much more reasonable prices. This is a little bit of a weird one, but the iPad Mini 4 is available for only $250 at Best Buy on Black Friday. Now I know this is an iPad that has not seen a lot of love lately, but if you do want a small and unique form factor, and I know a lot of people like them for reading and video and stuff, and this is pretty much the best deal I've ever seen on an iPad Mini. It's not a Black Friday without some TV deals, and when I say TV deals, I mean that there are literally hundreds and hundreds of TV deals available this week. Some of my favorites include a 50-inch Toshiba 4K Fire TV for $300 on Amazon as well as an LG 65-inch 4K TV for only $600 at Best Buy. If you wanna go even bigger, there's a Vizio 70-inch TV available at Best Buy for only $750. Like all the rest of the TVs, it's full 4K, it sports HDR, it's a smart TV. What you're getting here is one of the biggest TVs that you can get for less than $1,000, and it is a lot less than $1,000. So that, my friends, are all the Black Friday deals that Deal Raptor and I could find. As always, links to all of these will be in the description of the video. Just keep in mind that some of the deals are going to expire, some of the prices are going to change, and specifically, some of the deals will only be active on Black Friday itself so make sure to go check back. I'll do my best to keep that description up-to-date. Is there anything else you want to add, Deal Raptor? (loud clattering) That's a lot of enthusiasm. I don't really, I mean, I can't really add anything to that.",
    "transcript_keywords": [
        "Black Friday",
        "Black Friday deal",
        "deal",
        "deals",
        "Deal Raptor",
        "Friday deal preview",
        "Black",
        "Friday",
        "Google Store",
        "Friday deal",
        "Google Home Mini",
        "pick",
        "Buy",
        "Google",
        "Xbox",
        "solid Black Friday",
        "Google Home",
        "good deal",
        "full",
        "lot"
    ],
    "transcript_entity_values": [
        "Black Friday",
        "only $100",
        "hundreds and hundreds",
        "PS4 Pro",
        "only $750",
        "Best Buy for Black",
        "K TV",
        "the 22nd",
        "iPad",
        "the Google Home Mini",
        "Turtle Beach",
        "the Google Store",
        "The Google Store",
        "Surface Pro 6",
        "Switch",
        "Surface",
        "Kohl",
        "Toshiba",
        "90",
        "one",
        "the PS4 Pro",
        "Newegg",
        "a ton",
        "500-gigabyte",
        "Galaxy S9--",
        "Google Home",
        "Siri",
        "only $650",
        "Acer Aspire 7",
        "Samsung T5",
        "Black",
        "2018",
        "Walmart",
        "250",
        "Core",
        "330",
        "17-inch",
        "the Google Pixelbook",
        "Austin",
        "only $250",
        "800 bucks",
        "400 bucks",
        "Best Buy",
        "Xbox One",
        "less than $1,000",
        "Thanksgiving",
        "the West Coast",
        "LG",
        "450 bucks",
        "Xbox One X",
        "the Microsoft Store",
        "1060",
        "GTX",
        "500",
        "799",
        "520",
        "SSD",
        "PS4",
        "Target",
        "The Samsung T5",
        "32-inch",
        "270",
        "100",
        "70-inch",
        "daily",
        "Acer Nitro 5",
        "Chrome",
        "39",
        "Vizio",
        "K Fire TV",
        "Amazon",
        "eight",
        "400",
        "FreeSync",
        "Best Buy on Black",
        "300",
        "only $600",
        "Xbox",
        "this week",
        "700",
        "only $350",
        "Sony",
        "200",
        "the Surface Go",
        "50-inch",
        "the Apple HomePod",
        "this year",
        "Friday",
        "only $1,000",
        "500 bucks",
        "PS VR",
        "the Google Store",
        "RAM",
        "Samsung",
        "980",
        "450",
        "Chromecast",
        "PS4",
        "6 p.m.",
        "50",
        "XL",
        "Mario Kart 8",
        "4",
        "Austin",
        "Minecraft",
        "second",
        "the year",
        "128",
        "Pixelbook",
        "the Galaxy S9",
        "only $520",
        "USB Type C. All",
        "128-gig",
        "65-inch",
        "45",
        "the PS4 Pro.",
        "1,000 to 700 bucks",
        "47 bucks",
        "iPad Mini",
        "Josh"
    ],
    "transcript_entity_types": [
        "EVENT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "LAW",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "PRODUCT",
        "LOC",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "QUANTITY",
        "ORG",
        "PERSON",
        "MONEY",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "LOC",
        "ORG",
        "MONEY",
        "PRODUCT",
        "FAC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "DATE",
        "MONEY",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "MONEY",
        "MONEY",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "QUANTITY",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "PERSON"
    ],
    "vector": [
        -0.04284186661243439,
        0.02113635092973709,
        0.013048550114035606,
        -0.03028630092740059,
        0.061247825622558594,
        0.07691816240549088,
        0.03326965495944023,
        0.024189073592424393,
        -0.007928935810923576,
        0.06832786649465561,
        0.01747654192149639,
        0.0261077880859375,
        0.033128757029771805,
        -0.0073954579420387745,
        0.04552798718214035,
        0.04156152904033661,
        0.06538799405097961,
        -0.07708665728569031,
        -0.01186059694737196,
        0.005688040517270565,
        -0.08574027568101883,
        -0.003632055828347802,
        -0.045083630830049515,
        -0.05619135499000549,
        -0.01862182654440403,
        0.06442888081073761,
        -0.034724678844213486,
        -0.09130912274122238,
        -0.05655806511640549,
        0.022229040041565895,
        -0.08879305422306061,
        -0.024641575291752815,
        -0.07537445425987244,
        0.04614565148949623,
        0.004558604676276445,
        -0.07225243002176285,
        -0.028124038130044937,
        0.014113976620137691,
        -0.06912395358085632,
        -0.06957383453845978,
        -0.0684775561094284,
        -0.017993588000535965,
        -0.07673482596874237,
        0.0329897478222847,
        0.048695072531700134,
        -0.00743257999420166,
        0.018598150461912155,
        0.05674278363585472,
        0.04010085016489029,
        0.028128381818532944,
        0.04412159323692322,
        -0.08191249519586563,
        0.05145376920700073,
        -0.030649736523628235,
        -0.02672083117067814,
        0.0406089723110199,
        -0.051893409341573715,
        0.03926552087068558,
        0.08218426257371902,
        -0.047528114169836044,
        -0.005147573538124561,
        -0.14574161171913147,
        0.023900268599390984,
        -0.007132524624466896,
        -0.03182230144739151,
        -0.001136432634666562,
        0.004478582181036472,
        -0.023858433589339256,
        -0.026676593348383904,
        0.014412549324333668,
        -0.08710669726133347,
        0.0735732913017273,
        0.06214271858334541,
        -0.01497263927012682,
        0.013873608782887459,
        0.02229315973818302,
        0.10824165493249893,
        -0.08981101214885712,
        0.005142589099705219,
        0.10723180323839188,
        -0.05006937310099602,
        -0.016916515305638313,
        -0.1174117848277092,
        -0.028355533257126808,
        0.01605808362364769,
        -0.014907131902873516,
        0.009880183264613152,
        0.040395885705947876,
        0.007076283451169729,
        -0.06181027367711067,
        0.004484756384044886,
        -0.0006911610253155231,
        -0.01642138510942459,
        0.03865441307425499,
        -0.10539911687374115,
        -0.08104008436203003,
        0.024343067780137062,
        -0.03809138387441635,
        0.005379999987781048,
        -0.004934431053698063,
        -0.025659294798970222,
        0.007759058382362127,
        0.09856995940208435,
        -0.030500903725624084,
        0.013830309733748436,
        -0.09566584974527359,
        -0.031510282307863235,
        0.009239970706403255,
        0.006319828797131777,
        0.005216558929532766,
        -0.0644332692027092,
        -0.008282595314085484,
        -0.08823330700397491,
        0.02685801312327385,
        0.025905447080731392,
        -0.002959778066724539,
        0.0076778605580329895,
        0.0341375395655632,
        0.10270911455154419,
        0.017101207748055458,
        0.036802880465984344,
        0.03448159992694855,
        0.021465471014380455,
        -0.03711661323904991,
        -0.012244761921465397,
        -0.011321086436510086,
        0.013340032659471035,
        4.922949402750616e-33,
        -0.018779387697577477,
        0.11264471709728241,
        -0.01324743777513504,
        -0.13667751848697662,
        0.007742335554212332,
        0.024266734719276428,
        0.07154151797294617,
        0.03845909237861633,
        0.007830639369785786,
        0.08613298088312149,
        -0.1340433657169342,
        0.02676394209265709,
        -0.09053733199834824,
        0.07825933396816254,
        0.08163599669933319,
        -0.07581201940774918,
        0.005641976837068796,
        -0.015272269956767559,
        -0.026615850627422333,
        -0.015936391428112984,
        -0.0164303220808506,
        0.05187152326107025,
        -0.03158995136618614,
        -0.03758007660508156,
        -0.05380096286535263,
        -0.01612212508916855,
        -0.0028108691330999136,
        -0.029397640377283096,
        0.10023914277553558,
        -0.008871400728821754,
        -0.11474089324474335,
        -0.026171578094363213,
        0.04548601433634758,
        -0.03563544899225235,
        -0.0033005548175424337,
        -0.010404129512608051,
        -0.026133522391319275,
        -0.06609511375427246,
        0.030303189530968666,
        -0.01604929007589817,
        -0.0451560840010643,
        0.061167921870946884,
        -0.08539742231369019,
        -0.03491739183664322,
        0.10508936643600464,
        -0.04420645534992218,
        -0.007311707828193903,
        -0.02502971515059471,
        9.254340693587437e-05,
        0.003180090803653002,
        -0.10630015283823013,
        0.0012981371255591512,
        -0.002601019572466612,
        -0.01603618822991848,
        -0.08246666938066483,
        -0.07815257459878922,
        0.04903807118535042,
        -0.003363759256899357,
        0.08645698428153992,
        0.062025729566812515,
        -0.012662211433053017,
        -0.023179547861218452,
        0.004803308751434088,
        -0.017586568370461464,
        -0.06921513378620148,
        0.007051362656056881,
        0.13465602695941925,
        0.018996069207787514,
        -0.10616550594568253,
        0.03523087874054909,
        0.011509398929774761,
        0.028955286368727684,
        0.07174500823020935,
        -0.07123624533414841,
        0.010601634159684181,
        0.05841676518321037,
        -0.03860912099480629,
        -0.005042192526161671,
        0.020490942522883415,
        -0.03534632921218872,
        -0.009794403798878193,
        0.06778502464294434,
        0.05267121270298958,
        0.03385698422789574,
        -0.03467532619833946,
        0.030539212748408318,
        -0.04519084841012955,
        0.00815594382584095,
        -0.020160852000117302,
        -0.029473645612597466,
        -0.03809018060564995,
        0.01955142430961132,
        -0.03023548051714897,
        0.00647250609472394,
        0.08235478401184082,
        -7.003338202809947e-33,
        -0.018734563142061234,
        -0.055021021515131,
        0.057122085243463516,
        0.07676044851541519,
        0.026872774586081505,
        -0.006492048967629671,
        0.04375593736767769,
        0.02029498666524887,
        -0.042301714420318604,
        -0.03454453498125076,
        -0.03867397457361221,
        0.036549199372529984,
        -0.001530408044345677,
        0.08268124610185623,
        0.05238460376858711,
        -0.02625923417508602,
        -0.06788862496614456,
        -0.06385805457830429,
        0.12401426583528519,
        -0.03894555941224098,
        -0.012209661304950714,
        0.02131795696914196,
        -0.007038505282253027,
        -0.011551078408956528,
        0.006511148530989885,
        -0.03420963138341904,
        -0.004054002929478884,
        6.413461960619316e-05,
        0.005957101006060839,
        0.025789283215999603,
        -0.04678185284137726,
        -0.049452029168605804,
        0.08888444304466248,
        0.06104733422398567,
        0.06664332002401352,
        0.0012681478401646018,
        0.013681975193321705,
        0.029110142961144447,
        0.07301413267850876,
        0.02420618198812008,
        0.06541859358549118,
        0.0011329507688060403,
        0.06379332393407822,
        0.02399975061416626,
        0.06720845401287079,
        0.024019915610551834,
        -0.06658030301332474,
        0.009327021427452564,
        0.025699423626065254,
        0.018262023106217384,
        -0.033414922654628754,
        0.037437357008457184,
        -0.001978485379368067,
        -0.04129132628440857,
        -0.01588195189833641,
        -0.049957454204559326,
        -0.04569779336452484,
        -0.004469290375709534,
        -0.02890302985906601,
        -0.014313927851617336,
        -0.015182661823928356,
        0.005701875779777765,
        -0.06501473486423492,
        0.05183134600520134,
        -0.03831758350133896,
        0.0687384158372879,
        0.09187842905521393,
        0.011790499091148376,
        0.029176395386457443,
        -0.048537008464336395,
        -0.11048232764005661,
        -0.02377104014158249,
        0.015239900909364223,
        -0.11551354825496674,
        -0.031211137771606445,
        0.04068541154265404,
        0.004774041008204222,
        0.03757857158780098,
        0.0768594741821289,
        0.026779789477586746,
        -0.011395178735256195,
        0.04532954841852188,
        0.056110650300979614,
        -0.019010717049241066,
        -0.014703778550028801,
        -0.032683610916137695,
        -0.03230181708931923,
        -0.00015210483979899436,
        -0.08021175861358643,
        0.02374802902340889,
        -0.06704813987016678,
        -0.0006272268947213888,
        -0.012808172032237053,
        0.026982810348272324,
        0.025866415351629257,
        -4.559649369184626e-08,
        0.08780543506145477,
        0.036188267171382904,
        0.06888239830732346,
        -0.010391362011432648,
        0.055935200303792953,
        -0.056314900517463684,
        0.07950242608785629,
        -0.0019113834714516997,
        0.09082748740911484,
        0.062437571585178375,
        -0.02429778315126896,
        -0.0841822698712349,
        -0.030960239470005035,
        -0.029882967472076416,
        -0.028890293091535568,
        0.07160478830337524,
        -0.025492018088698387,
        -0.008428890258073807,
        0.0481765940785408,
        0.025353169068694115,
        0.0022433584090322256,
        0.053464487195014954,
        0.01254549715667963,
        -0.05528952553868294,
        0.05312925577163696,
        0.04051612690091133,
        -0.059870220720767975,
        0.06559740751981735,
        0.013179962523281574,
        0.03691045939922333,
        -0.03503749147057533,
        -0.055766716599464417,
        0.003883332246914506,
        -0.05901578068733215,
        0.07054654508829117,
        -0.10670848190784454,
        -0.053292177617549896,
        0.004667711444199085,
        0.061629269272089005,
        0.04239707440137863,
        0.025298381224274635,
        -0.08045266568660736,
        -0.10692918300628662,
        -0.06740647554397583,
        0.01609310321509838,
        -0.01904170587658882,
        -0.10344192385673523,
        -0.10495583713054657,
        -0.02448149397969246,
        0.049943964928388596,
        -0.054561685770750046,
        -0.0016968367854133248,
        0.0035654939711093903,
        -0.014323142357170582,
        0.038794923573732376,
        0.05024276301264763,
        0.05227743834257126,
        -0.04662810266017914,
        -0.02237406000494957,
        0.05066058412194252,
        0.01299925334751606,
        -0.13901130855083466,
        -0.05268581211566925,
        0.06945335865020752
    ]
}