{
    "id": "h_sS1fjfZVY",
    "title": "This Rugged Speaker is made from.... Silk?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-07-05T13:43:00Z",
    "video_url": "https://www.youtube.com/watch?v=h_sS1fjfZVY",
    "category": "Howto & Style",
    "tags": [
        "portable speaker",
        "best portable speaker",
        "bluetooth speaker",
        "soundcore",
        "anker",
        "Silk",
        "titanium",
        "Motion boom plus",
        "motion boom plus review",
        "sound quality",
        "speaker material",
        "party cast 2.0"
    ],
    "views": 519571,
    "likes": 24246,
    "comments_count": 873,
    "description": "When I hear the material 'Silk' I don't automatically think of 'speaker' But it sounds GOOD! Grab your Motion Boom Plus from Soundcore HERE:  huge thanks to Soundcore for sponsoring this video. Honestly I didnt think Titanium would be a viable speaker component - but here we really are with the Motion Boom Plus from Soundcore. This buoyant water resistant portable sound system is also capable of pairing up with up to 100 other speakers at the same time. That would be a crazy party!    Music I used for this video is here:  Free Download / Stream:   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://soundcore.club/JREMotionBoomPlus",
        "https://youtu.be/yJg-Y5byMMw",
        "http://ncs.io/mortals",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "It takes a special speaker to catch my attention enough for a tear down. Soundcore sent over one of their Motion Boom Plus units, which they say has some rather unique interior construction...like speakers made out of silk and titanium. So I think it's time we find out if that's true or not. And, of course, see how everything looks from the inside. And, if I can get it back together in one piece, I'll give away a brand new one at the end of the video. So fingers crossed that'll still play music after I'm done. Let's get started. [Intro] This Motion Boom Plus is Soundcore's newest outdoor rugged waterproof speaker. [Techno Music playing from the speaker] And I gotta say right off the bat it does sound pretty darn good. It's much louder than I anticipated. The four drivers are front and center with what looks like passive radiators on the sides. There is a lot of motion over here. The reason these guys are called passive is because they aren't powered by electricity. [Music continuing to play] The sides are powered or moved by internal air pressure, creating a damping effect for the super low base, which is also surprisingly strong. Speaking of strong, structurally there are no visible exterior screws, not even under the rubber foot pads which is where they can usually be found. Turns out there are 4 screws hidden on either side next to the passive radiators. Besides the silk and titanium, the Motion Boom Plus has a few other tricks up its sleeve. Not only is it IP67 water resistant, but it uses that water resistance to create an airtight chamber inside, which makes the speaker buoyant, meaning it'll float if it's ever dropped into a pool or body of water. The next piece to come off is the large plastic end caps and aesthetic portion of the carrying handle. Looks kind of like a pair of headphones. It's made from some heavy duty plastic and it's kind of fun seeing how everything is assembled. Just for kicks let's see if it still works without the exteriors. [Music playing] So far, so good. The metal front grill is held in place by two screws over on the sides. This grill keeps any damage from happening to the drivers, but damage is kind of what we're here for so it's gotta go. With the metal lifted up and flipped to the back side, it's interesting that some of the guiding pins are filled with a plasticky goop. I imagine this ensures nothing rattles inside the speaker when it's going full thump. Speaking of which, it does still work. [Music playing] The side passive radiators can be seen flexing and we aren't even turned up all the way. Finally, to get to that inner watertight buoyant cavity, we have 8 more Phillips head screws around the front driver, and two more near the strap anchors on the handle. I actually got so excited to see the insides that we forgot to explore the outsides. Real quick, on the back of the Motion Boom Plus there is a USB-C charging port, and headphone jack auxiliary input port. Additionally, there's also a USB port that acts as a 13,000 milliamp hour power bank, which can charge up other devices. The carrying handle has an additional 4 screws that tighten a series of latches. Everything is redundantly locked into place which is definitely a rather creative and rugged design. With the screws gone we can crack open the buoyant sarcophagus. I mean, I think the waterproofing is cool and all, but I live left to what's left of Lake Mead and Lake Powell, so excess water isn't really something we're too worried about. Inside, the first thing I noticed is that I still haven't powered this thing off. But that's fine, we can see the 80 watts of speaker power in action. [Music playing] Dual 3.5 inch woofers, and the 2 silk tweeters on either side rattling things on my desk. The plug that the 4 drivers are wired into is also glued into place. I assume, again, to help survive the vibrations that come with being a portable rugged speaker. Another interesting thing is that each of these wires and ribbons are sheathed with foam. Again, probably to ensure they won't make noise or vibrations inside while the tunes are blasting out the front. The 13,000 milliamp hour battery sits at the bottom of the speaker, also covered in foam. This is what gives us the 20 hours of play time. But we aren't here for battery life, we're here for the speaker's composition. And judging by the plethora of screws stuck to the surface, they are indeed magnetized. I'll plug the speakers back in. The tweeters on the outside are extremely soft, silky smooth I should say, so I have no doubt they are indeed made of silk. Especially since silk is a relatively common tweeter material in higher end audio systems. I did try to see what would happen if we caught the silk on fire, but there is so much air moving around the speaker that my lighter doesn't stay lit. So I think the tweeter deserves to win this round. I do have doubts about the main speakers, however, with Soundcore saying it's constructed of premium titanium. But there are ways to find out for sure. I have methods of testing different metals. For example, a cut off disk can tell us quite a bit. If the inner portion is made of plastic it'll just melt. If it's made of aluminum it won't spark at all. And if it's made of steel it'll spark with an orange glow. But if it really is titanium, just like we saw when I made my wedding ring, it'll spark with white sparks as we cut into it. And as we can see it is indeed metal, and it is indeed sparking with white hot titanium. Very interesting. Titanium is a super premium material for speakers. Non-corrosive and a bit more expensive. But it's also extremely stiff and extremely lightweight so the dome can more precisely vibrate. Starting and stopping easier to make more accurate sounds. It's also a better thermal conductor and can dissipate heat build up from the speaker itself better than plastic can. It's definitely a thin layer of titanium of course, but that's all we need. For how inexpensive this speaker is, I'm impressed with the build quality of the components, and of course, its ability to still be alive after everything I've done to it. [Music playing] Plus, and this might be the most impressive part yet, Soundcore has enabled party cast 2.0 on this Motion Book Plus, which means we can simultaneously connect up to 100 speakers together at the same time, synchronized in one big group. Personally I only have one speaker at the moment...well two if you count the one I'm giving away on Twitter at the end of the video, but it's super cool to know that if I ever do meet someone or 100 someones out in the wild with a Soundcore party cast 2.0 enabled speaker, we can all bump tunes together. [Music playing] Nice work, Soundcore. I'll leave a link down in the description if you want to check out current pricing or want to snag one for yourself. And, of course, you might even be able to pair it with a brand new one that I'm giving away over on Twitter, in the box, unopened, with undamaged titanium drivers. Or, of course, you know, I can damage them real quick if that's what you're into. The guy who won the Steam Deck a while back did have me sign my name on the back with a razor blade. He's got good taste. Anyway, hit that subscribe button if you haven't already. Come hang out with me on Instagram and Twitter, and thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Motion Boom",
        "speaker",
        "Motion",
        "Soundcore",
        "titanium",
        "catch my attention",
        "speakers",
        "screws",
        "made",
        "Boom",
        "special speaker",
        "back",
        "silk",
        "inside",
        "side",
        "passive radiators",
        "drivers",
        "passive",
        "sides",
        "front"
    ],
    "transcript_entity_values": [
        "2.0",
        "Lake Mead",
        "the Motion Boom Plus",
        "an additional 4",
        "the Steam Deck",
        "up to 100",
        "8",
        "the Motion Boom",
        "power bank",
        "Instagram",
        "four",
        "two",
        "Soundcore",
        "100",
        "jack",
        "Techno Music",
        "4",
        "Phillips",
        "13,000 milliamp hour",
        "80",
        "Lake Powell",
        "first",
        "the 20 hours",
        "Soundcore",
        "USB",
        "one",
        "Twitter",
        "2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "LOC",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.1361076682806015,
        0.012639421969652176,
        -0.006488579325377941,
        -0.06855405122041702,
        -0.004064805805683136,
        0.02356402948498726,
        0.11301711946725845,
        -0.025699669495224953,
        -0.0677100121974945,
        -0.01826099492609501,
        0.04065774381160736,
        -0.060651056468486786,
        0.01789206452667713,
        0.05239196866750717,
        0.0010412869742140174,
        0.04781448096036911,
        0.13937871158123016,
        0.03163591027259827,
        0.0232792217284441,
        0.05862002074718475,
        -0.015301505103707314,
        0.004468780476599932,
        0.011002021841704845,
        -0.021245809271931648,
        0.015140910632908344,
        0.01857570931315422,
        0.011284619569778442,
        0.01649635285139084,
        -0.031501371413469315,
        -0.04296581447124481,
        0.0748814195394516,
        0.0566335953772068,
        0.02311086282134056,
        -0.025575226172804832,
        -0.026576898992061615,
        -0.04072244092822075,
        0.007273001130670309,
        -0.0335344523191452,
        -0.095118947327137,
        -0.00943344458937645,
        -0.07889662683010101,
        0.050548113882541656,
        0.02789335511624813,
        -0.07112663239240646,
        -0.01089857891201973,
        -0.03241603076457977,
        0.024227997288107872,
        -0.06483154743909836,
        0.015301598235964775,
        0.04268752038478851,
        -0.05623972788453102,
        -0.06383997201919556,
        0.09553832560777664,
        -0.014706796035170555,
        -0.026559585705399513,
        -0.020248660817742348,
        0.02072080224752426,
        -0.022831829264760017,
        0.022481027990579605,
        -0.021642308682203293,
        0.0637388825416565,
        -0.011247077956795692,
        0.012087356299161911,
        -0.010589100420475006,
        -0.01359559129923582,
        -0.009719287976622581,
        0.0379641056060791,
        0.05343173071742058,
        -0.02716708369553089,
        -0.028879523277282715,
        -0.050407346338033676,
        -0.005459908861666918,
        0.04076126590371132,
        -0.004859112203121185,
        0.0037048878148198128,
        0.003610605373978615,
        0.07931624352931976,
        -0.029702117666602135,
        -0.03695206344127655,
        0.07980253547430038,
        0.02651873603463173,
        -0.04220280051231384,
        -0.01502709649503231,
        -0.08368293195962906,
        -0.001270816195756197,
        0.05080549046397209,
        0.008885924704372883,
        0.05184809863567352,
        -0.10403308272361755,
        -0.03370023891329765,
        -0.09551462531089783,
        0.07893894612789154,
        -0.05649082362651825,
        -0.06722275912761688,
        0.08796350657939911,
        -0.026380781084299088,
        -0.10837981104850769,
        -0.061902567744255066,
        0.01335794385522604,
        0.053753238171339035,
        -0.010470905341207981,
        -0.03132646158337593,
        0.08014283329248428,
        -0.08287329226732254,
        0.002332072937861085,
        -0.12042689323425293,
        -0.10042984038591385,
        0.15903529524803162,
        0.07193324714899063,
        0.008267817087471485,
        -0.05470990389585495,
        0.012479945085942745,
        -0.03430250659584999,
        0.02284332364797592,
        0.022882666438817978,
        0.010052938014268875,
        -0.14634336531162262,
        0.05923281982541084,
        0.04917074739933014,
        -0.0008745378581807017,
        0.08851765841245651,
        -0.0057146367616951466,
        -0.04706800729036331,
        0.05744219198822975,
        0.08402369171380997,
        -0.013783574104309082,
        -0.06886368244886398,
        5.1182214222832606e-33,
        0.06558528542518616,
        0.1457609385251999,
        0.00517247524112463,
        0.012465056963264942,
        0.03323028236627579,
        -0.05593324080109596,
        -0.009853893890976906,
        0.009128686040639877,
        -0.05859622731804848,
        0.019200656563043594,
        -0.02351505123078823,
        0.02435486949980259,
        -0.003050888190045953,
        0.0068450672551989555,
        -0.027433209121227264,
        -0.15416976809501648,
        -0.04139415919780731,
        -0.0548144094645977,
        -0.00614056596532464,
        -0.05258921906352043,
        -0.05346648767590523,
        -0.01250822376459837,
        0.00034733215579763055,
        0.029536569491028786,
        0.06217213347554207,
        0.03569280356168747,
        0.04344460740685463,
        -0.0038576247170567513,
        0.09206292778253555,
        0.018767397850751877,
        -0.07906155288219452,
        -0.010410893708467484,
        0.05205390602350235,
        0.01477145031094551,
        0.03531891480088234,
        0.014193207025527954,
        -0.06477861851453781,
        -0.0758749321103096,
        -0.04380280151963234,
        -0.06936386972665787,
        -0.010405664332211018,
        0.016498863697052002,
        -0.0339193195104599,
        0.029194530099630356,
        -0.05093586444854736,
        -0.061637699604034424,
        -0.059986408799886703,
        0.06076350063085556,
        0.022803235799074173,
        -0.07306522876024246,
        0.0025933266151696444,
        0.007402407005429268,
        -0.024275321513414383,
        0.03339527174830437,
        -0.0702817514538765,
        -0.05338677391409874,
        0.021038217470049858,
        -0.0030377316288650036,
        0.019079014658927917,
        -0.03505194932222366,
        0.03148365765810013,
        -0.025881275534629822,
        -0.005955855827778578,
        -0.034321609884500504,
        -0.0636412650346756,
        -0.026295550167560577,
        -0.03634314984083176,
        -0.0020229811780154705,
        -0.036277540028095245,
        0.008736585266888142,
        0.02314252033829689,
        0.013438860885798931,
        0.03331505507230759,
        -0.01059671863913536,
        -0.012697435915470123,
        0.038012318313121796,
        0.023291975259780884,
        -0.020503215491771698,
        0.017842231318354607,
        -0.013879692181944847,
        -0.14721882343292236,
        -0.010329973883926868,
        0.036469895392656326,
        0.03382646664977074,
        0.0013950337888672948,
        -0.010384242050349712,
        -0.011060663498938084,
        -0.07750049978494644,
        0.022622523829340935,
        -0.007314109243452549,
        -0.0554356724023819,
        -0.07394643872976303,
        -0.02317669615149498,
        -0.05585668608546257,
        0.03115498460829258,
        -6.680025093772e-33,
        0.014174115844070911,
        0.08124800026416779,
        0.036970142275094986,
        0.008533303625881672,
        0.16759276390075684,
        0.011077888309955597,
        0.08260587602853775,
        0.07945862412452698,
        0.008411556482315063,
        -0.05270778015255928,
        0.03471489995718002,
        0.0174727626144886,
        -0.020784806460142136,
        -0.03111160732805729,
        0.03771812468767166,
        0.04224168881773949,
        0.0509464405477047,
        -0.06226939707994461,
        0.052147701382637024,
        -0.0027928268536925316,
        0.05663752555847168,
        -0.005929435137659311,
        0.10128457844257355,
        0.0005944958538748324,
        -0.05448317900300026,
        0.013185819610953331,
        0.0238833986222744,
        -0.02473107911646366,
        0.0918583869934082,
        0.03047584928572178,
        0.014346416108310223,
        -0.039791274815797806,
        -0.005806532222777605,
        -0.03004034422338009,
        0.009802538901567459,
        0.08633635193109512,
        0.020714258775115013,
        -0.00696891313418746,
        -0.04102011024951935,
        -0.09640692919492722,
        -0.01079333946108818,
        0.023290283977985382,
        -0.024561816826462746,
        0.0004204479919280857,
        0.022118618711829185,
        -0.01421828381717205,
        -0.06570560485124588,
        0.03764490410685539,
        -0.03698105737566948,
        -0.031945910304784775,
        0.02900335006415844,
        0.005339117720723152,
        0.07492173463106155,
        -0.03957526385784149,
        -0.07822883874177933,
        -0.04210009425878525,
        0.08105546981096268,
        -0.04914436861872673,
        -0.0030496171675622463,
        -0.00924722384661436,
        0.06645636260509491,
        0.05960024148225784,
        0.009778471663594246,
        -0.05546104162931442,
        -0.039985042065382004,
        0.04116886481642723,
        0.023286473006010056,
        0.057476263493299484,
        -0.031253620982170105,
        0.0026527862064540386,
        0.0009753377526067197,
        -0.016202151775360107,
        -0.012842954136431217,
        -0.005621403455734253,
        -0.01410628017038107,
        -0.08546503633260727,
        -0.08508262783288956,
        0.006936436053365469,
        0.07013200223445892,
        -0.03322068229317665,
        0.045356426388025284,
        0.049502599984407425,
        0.05264725908637047,
        0.020447179675102234,
        0.08329944312572479,
        0.029317323118448257,
        0.026250870898365974,
        0.06121175363659859,
        0.003617884824052453,
        0.05361073091626167,
        -0.003439186606556177,
        0.05522572621703148,
        0.00020702321489807218,
        0.03881235048174858,
        0.01893804967403412,
        -6.547760023067895e-08,
        -0.025349877774715424,
        0.05114690214395523,
        -0.06690388172864914,
        -0.06921058893203735,
        -0.023559782654047012,
        -0.053667083382606506,
        0.06310751289129257,
        -0.09261222183704376,
        0.062142737209796906,
        -0.07742291688919067,
        -0.02157377265393734,
        -0.11569557338953018,
        0.016783742234110832,
        0.03719627857208252,
        -0.042188722640275955,
        0.056665316224098206,
        -0.06109236553311348,
        0.06663559377193451,
        -0.05918530374765396,
        -0.07718008011579514,
        -0.05389115959405899,
        0.014110064134001732,
        0.04652264714241028,
        0.02638104557991028,
        -0.0320805199444294,
        0.06720428913831711,
        -0.04420008882880211,
        -0.012107061222195625,
        0.0768224447965622,
        0.004619545303285122,
        -0.10630491375923157,
        0.01727433130145073,
        -0.1192786917090416,
        -0.014478313736617565,
        -0.02735944092273712,
        0.0065462361089885235,
        -0.10239215195178986,
        -0.0005549804773181677,
        -0.003857054514810443,
        0.09230071306228638,
        -0.031585175544023514,
        -0.005601032637059689,
        -0.005542131140828133,
        0.05267457291483879,
        0.023299913853406906,
        -0.032836828380823135,
        0.016988880932331085,
        -0.13004158437252045,
        -0.03233383968472481,
        0.08502291142940521,
        -0.008410298265516758,
        0.020612753927707672,
        -0.04334784299135208,
        0.0031334441155195236,
        0.03865634649991989,
        0.07043103873729706,
        0.0034191543236374855,
        -0.029813779518008232,
        0.009596788324415684,
        -0.0019603190012276173,
        -0.020352264866232872,
        -0.06023867800831795,
        0.041226234287023544,
        0.04901580885052681
    ]
}