{
    "id": "HDrv4qMpClw",
    "title": "First look inside the Electric Mercedes! - Should Tesla Be Worried?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-09-06T13:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=HDrv4qMpClw",
    "category": "Autos & Vehicles",
    "tags": [
        "mercedes eqc review",
        "mercedes eqc 400",
        "mercedes eqc electric suv",
        "Best Electric Car",
        "Mercedes EQ",
        "electric cars",
        "Tesla",
        "Tesla Model X",
        "Tesla killer",
        "tesla autopilot",
        "EQC",
        "EQC Top speed",
        "Green vehicle",
        "no emissions",
        "zero emissions",
        "autonomous car",
        "auto pilot"
    ],
    "views": 1011105,
    "likes": 19598,
    "comments_count": 3290,
    "description": "The Mercedes EQC brings a new level of competition to the Electric Vehicle marketplace. Mercedes has a massive 130 year head start building cars... BUT are brand new walking into the electric car industry, heavily dominated by Tesla. Will they be able to stand out? Lets jump into the details. This video will help you decide between an All electric Mercedes, or a Tesla.  Come along as we take a First Look inside the All New Electric Mercedes EQC.  Check out Dan's video on the Mercedes event here:   Let me know what you think!  The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/NGwiqWu-aZg",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRig..."
    ],
    "transcript": "[Music playing] It's super cool of Mercedes to give us a first look at the EQC, and right off the bat you can tell it's a Mercedes. Mercedes has been making cars for the last 130 years, and today they just announced their brand new all-electric vehicle: the Mercedes EQC. It's kind of an SUV type of vehicle competing with Tesla's Model X. While Mercedes has been around for 130 years, Tesla's only been around for 15. Mercedes made 2.4 million cars last year. Tesla only made 100,000. So it will be interesting to see what the 2 companies can come up with when comparing the 2 vehicles. Let's get started. [Intro] And even though it's a fully electric vehicle, it does have a grille in the front which I found interesting. A lot of the Tesla's do not have a grille because there is no need to cool down anything inside of the engine bay because there's a frunk in a Tesla. But the Mercedes, on the other hand, has it's motor in the front engine compartment. So the front headlights have their LED bands that go all the way across the top giving it a very unique look. And the grille is actually functional. There's a cooling system inside that brings the temperature of the batteries and the motor down with the air flow. The door handles are pretty normal. Open it up. Inside of the EQC. Let's take a look. My camera man has arrived. Dan, you want to hold the camera for me? [Dan] You got it! [Zack] So I've been inside of a couple different Mercedes cars. I've been inside the G-Class when we did that road trip across Spain. I've been inside the A-Class and the S-Class. If you've driven a Mercedes in the past, you're going to feel right at home in this. It has the same Mercedes vibe as their previous cars...with a few subtle differences. So we have the standard dual screens that we saw premiered with the A-Class with these little buttons right here that toggle back and forth between all the information. There are quite a lot of buttons in this vehicle, including this track pad. But one thing I do like is that specifically, Mercedes designed these to look like circuit board patterns the same type of design you would see patterned inside of a cell phone or a motherboard computer. As well as, these silver lines going around the sides are modeled after an aluminum heat sink, which is pretty cool. So while Mercedes has maintained true to their normal interior design, there are a couple aspects that are more futuristic. So if you've been on the internet at all in the last couple years, you would know that Tesla's had some production issues. Obviously, scaling vehicle production is one thing, but there's minor issues like body panel gaps in the Model 3 that Tesla has had problems with. One step ahead that Mercedes has is where they've been designing vehicles for 130 years, they already have those little cosmetic issues figured out and probably won't be a problem with their newer electric vehicles. Another cool thing is that Mercedes has dual charging with AC and DC, and can go from 10%-80% in about 40 minutes, which is pretty quick with how massive that battery pack is. Now that we've seen the outside, let's jump inside the components and see how the battery pack and the motors actually work underneath the car. [Music playing] So the interior of the car, there are two motors. There's one right here in the front, and there's one in the back as well. And so the front is a more efficient, more powerful motor. But if you want the performance, then they combine the back and the front at the same time. The front motor has more copper windings inside which makes it more efficient. So the battery pack is in the floor of the car, and to charge it up, it's right back here. Also, one more cool thing with the motor is that there is individual mounts here, here, and there, as well as on the other side. Because the motor is one of the things that's gonna have the most vibrations in it as it's moving, and this whole contraption is going to keep the thing stable, eliminating a lot of the noise transfer inside of the car. So one cool thing about having the battery in the very bottom of the vehicle is that it gives it a low center of gravity, so there won't be any rollover if you're taking corners super tight. Obviously, with lithium ion batteries there are a couple things to be concerned about. One is temperature. Another is like damaging...like punctures to the sides. And so Mercedes has taken special precautions with this frame, that their side impact zones and front impact zones to keep those battery cells safe. It gives more structure to the side of the car. So if something impacts, it has multiple layers of metal to go through before it reaches the internal battery compartments. And if you look at the top of the battery, these black tubes running along the top can keep the battery cool as well as warm up the battery in cold conditions. Where I'm from in Utah, there's a lot of snow on the ground in the winter, and the batteries aren't optimal when they're cold when they're in the freezer. If you take your cellphone and stick it in the freezer for a couple hours, your battery percentage is actually going to go down. So where the cooling and the heating system are combined in this battery, you can drive the car optimally in cold conditions, which is pretty cool. So these are the individual cells inside of the battery pack right here. And the battery pack sits inside of the massive chassis over there. It's interesting that Mercedes chose to go with the pouch style lithium ion instead of the cylindrical batteries like Tesla does. So where there are 384 of these pouch style lithium batteries inside of the EQC, Tesla has about 7,000 of those little cylindrical batteries inside of their car with the same battery capacity. One cool thing about the EQC is that it has 2 motors. So it's effectively all-wheel drive. And, if one of the motors for some reason stops working, the other motor can take over and fully power the entire car. Whereas if you have a gas-powered vehicle, if your motor dies, it's over and done with. So it's nice to have like a redundant system in an electric car with 2 motors. [Music playing] So there's no official price point on the EQC yet, but rumor has it is supposed to be competitive with the Model X when it comes out. And my buddy Dan here has had a Model X for a long time. So what are your thoughts...how do you feel? Are you going to trade in your Model X for this thing? [Dan] I like the car. Availability is supposed to be in the U.S. maybe early 2020, which is around the same time I'll be getting my roadster. So I'm going to hold onto my Model X for a few more years. Like there's no reason to go and like put down a deposit. I think I can wait a little bit. But I do like this car and I think there's still a lot that we need to learn about it over the next few years. Like, what is the super charging network, or the charging network going to look like in the U.S. because right now it's kind of weak, really weak, compared to my Tesla. I love road trips. What is the price going to be? Rumors are it's going to be less expensive than the Model X. We don't know yet. It's going to be a while till we know for the U.S. So it's a good looking car and when Mercedes builds something, they build it with really really high quality. They've taken a long time to build this thing and I think a lot of the reasons are because they are doing a lot of different testing on it. I'm sure that there's going to be a lot more thought behind this than the Tesla's that are...some would say are thrown together in a rush from a car company that's only been around for a few years. So. [Zack] Mercedes has been around for a long time. [Dan] And I love my Tesla. I love it. But, I don't know. I've never...I haven't even driven in it yet, so I need a test drive. Okay, so back to you. Would you trade in your Tacoma for this...next week? [Zack] First of all...there's no good...I need a truck, and there are no good electric trucks right now that are ready to buy. And also, one thing to keep in mind is that this Mercedes car, like Dan said, is still way out down the road. It's not even going to be released in the United States until maybe 2020. So even through Mercedes has been around for 130 years, there's still a maybe in the current electric market space where Tesla would be the adult, even after 15 years of being there. [Dan] It's exciting. I love it. There's a lot of questions. Like would you buy this over a Model 3? I think I would. I feel like it's nicer, especially if the price point is closer. [Zack] As of right now... [Dan] As of right now, yes. [Zack] Remember, the Model 3 is going to be like a year and a half old by the time this thing comes out. [Dan] Right. You might have a $35,000 Model 3 in a year and a half, who knows. [Zack] Could go either way. [Dan] Overall though, this is great. This is great for sustainable energy. This is great for the future of electric cars. More competition. People that have been on the fence and said 'I'm not going to buy a Tesla, it's not a legit car company', they are going to look at this and say, 'Oh, look at this, Mercedes has an electric car. It must be okay to get an electric car', and they might start looking into it and buy a car, and that's good. [Zack] Yeah, the more knowledge, and the more cars, and the more information that's out there is better for everyone. We do know that the top speed is right around 110 miles per hour, so it's a little bit slower than the Tesla's, but the EQC does have regenerative braking, so every time you step on the brake, it can charge the batteries. Or if you're going downhill it will charge the batteries, and that's a good feature to have in an electric car. Most people are never going to buy an electric car just to save the planet. They're going to buy an electric car when it's performance and the price outweigh it's gas-powered counterparts. And as more car manufacturers jump into the industry, the overall price should come down while the performance should go up. Competition is always a good thing. And the more competition there is, the lower the price is, the more people are going to be buying electric vehicles which helps the planet overall. Mercedes is working on their own version of autopilot with a bunch of cameras up there behind the rear view mirror, as well as radar behind the Mercedes logo which also lights up underneath this LED bar up at the top. And then there's another camera right here down at the bottom. So on the back of the car we have the gas cap. It opens up and we have the AC and DC charging right here, top and bottom. And it also has a QR code right here. And that QR code is for emergency responders. If they come and the car has been wrecked or been in an accident or something like that, the emergency responders can scan that QR code and know exactly where to turn off the battery and help the person inside. So we don't know the exact range of the EQC, but it does have an 80 kilowatt hour battery which means it should be around 250 to 300 miles, give or take, a little bit...and...which is pretty interesting compared to the different battery pack inside of the Tesla. Remember, this one has those flat batteries that I showed you earlier. The nice thing about Mercedes stepping into the electric car world, means that now everyone needs to step up their game. And it's going to be improvement for all the consumers around who want an electric vehicle. Super huge thanks to Mercedes for having us out. If you have any questions, go ahead and leave them down in the comments and I'll try to answer those. And thanks a ton for watching. I'll see you around. [Music playing]",
    "transcript_keywords": [
        "Mercedes",
        "car",
        "Tesla",
        "electric car",
        "battery",
        "inside",
        "thing",
        "Model",
        "electric",
        "EQC",
        "battery pack",
        "Mercedes cars",
        "Mercedes EQC",
        "cars",
        "years",
        "motor",
        "vehicle",
        "cool thing",
        "cool",
        "lot"
    ],
    "transcript_entity_values": [
        "about 7,000",
        "2020",
        "$35,000",
        "Dan] Overall",
        "Tacoma",
        "Zack]",
        "15",
        "80 kilowatt hour",
        "two",
        "100,000",
        "around 110 miles per hour",
        "around 250 to 300 miles",
        "the S-Class",
        "Zack] Remember",
        "AC",
        "DC",
        "Tesla",
        "Spain",
        "Dan] Right",
        "the next few years",
        "Mercedes",
        "2.4 million",
        "the winter",
        "U.S.",
        "next week",
        "Mercedes",
        "Model X",
        "a few more years",
        "a few years",
        "the United States",
        "the last couple years",
        "Model X",
        "Tesla",
        "last year",
        "first",
        "Zack] First",
        "Model 3",
        "130 years",
        "the last 130 years",
        "about 40 minutes",
        "today",
        "a couple hours",
        "10%-80%",
        "Dan",
        "Zack] Mercedes",
        "384",
        "Zack",
        "One",
        "15 years",
        "Utah",
        "one",
        "early 2020",
        "2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "MONEY",
        "PERSON",
        "GPE",
        "PERSON",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "FAC",
        "GPE",
        "PERSON",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "GPE",
        "DATE",
        "ORG",
        "NORP",
        "DATE",
        "DATE",
        "GPE",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "DATE",
        "DATE",
        "TIME",
        "DATE",
        "TIME",
        "PERCENT",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "GPE",
        "CARDINAL",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.061361681669950485,
        0.07795505970716476,
        -0.017796022817492485,
        -0.0526965893805027,
        0.05922523885965347,
        -0.0018383604474365711,
        0.012665408663451672,
        0.08090879023075104,
        -0.060844309628009796,
        0.0016248106257990003,
        0.049328308552503586,
        -0.03020751290023327,
        0.06688134372234344,
        -0.024931306019425392,
        -0.05000845715403557,
        0.01750343292951584,
        0.03602215647697449,
        -0.07394662499427795,
        -0.09758423268795013,
        0.12890106439590454,
        -0.00715945428237319,
        -0.043679386377334595,
        0.0013624981511384249,
        0.003391266567632556,
        0.019059589132666588,
        -0.017274433746933937,
        0.006288670934736729,
        0.05229444429278374,
        -0.07126768678426743,
        -0.06571151316165924,
        -0.006826431956142187,
        -0.018241036683321,
        -0.06339891254901886,
        0.037916142493486404,
        0.03974755108356476,
        -0.00770201301202178,
        0.025934066623449326,
        -0.07238313555717468,
        -0.005616551265120506,
        -0.06078772991895676,
        -0.017725054174661636,
        -0.07604630291461945,
        -0.03156300261616707,
        -0.06854832172393799,
        0.062407881021499634,
        0.027455274015665054,
        0.14255213737487793,
        -0.09535004198551178,
        0.0006223281379789114,
        -0.07489831745624542,
        -0.09730442613363266,
        -0.04508522152900696,
        0.055665161460638046,
        -0.0188628938049078,
        -0.06829221546649933,
        -0.017193345353007317,
        -0.040095582604408264,
        -0.052593011409044266,
        0.023323465138673782,
        0.012163704261183739,
        0.08864491432905197,
        -0.017558300867676735,
        -0.005698157008737326,
        0.07141996175050735,
        -0.010893909260630608,
        -0.052918508648872375,
        -0.000654160394333303,
        -0.0814720168709755,
        -0.04714777693152428,
        0.03378671035170555,
        0.03083113208413124,
        -0.06579054147005081,
        -0.00010671227209968492,
        -0.02861565537750721,
        -0.011919038370251656,
        0.017961522564291954,
        0.012855146080255508,
        5.8932437241310254e-05,
        0.02802925743162632,
        -0.03793201968073845,
        0.0692136287689209,
        -0.02273039147257805,
        -0.07698113471269608,
        0.04628458619117737,
        -0.03904343023896217,
        0.008792501874268055,
        -0.03682085499167442,
        0.008777028881013393,
        -0.022656721994280815,
        0.008966993540525436,
        -0.0187024287879467,
        -0.07434555888175964,
        0.025133349001407623,
        0.039171092212200165,
        0.022123213857412338,
        -0.023977452889084816,
        -0.00042932090582326055,
        -0.06330259889364243,
        -0.002434282563626766,
        -0.0034886710345745087,
        0.03226735442876816,
        0.01705765537917614,
        0.014453500509262085,
        0.011528159491717815,
        -0.066825270652771,
        -0.008264373987913132,
        -0.003722046036273241,
        0.07925807684659958,
        -0.011198500171303749,
        -0.06465936452150345,
        0.05889170989394188,
        0.034393925219774246,
        -0.10121789574623108,
        -0.03320387750864029,
        -0.09614028036594391,
        0.0791248306632042,
        -0.042402151972055435,
        -0.019787702709436417,
        0.05699655041098595,
        0.042804837226867676,
        0.06559323519468307,
        0.01797100342810154,
        0.029443232342600822,
        0.08446358144283295,
        0.08216989785432816,
        -0.02391526848077774,
        -0.04934796318411827,
        2.3566981144407173e-33,
        -0.03533017635345459,
        0.08408008515834808,
        0.02395797334611416,
        -0.013735457323491573,
        0.002235768362879753,
        0.10349854826927185,
        -0.03356273099780083,
        0.0953373983502388,
        -0.01921566016972065,
        -0.010259284637868404,
        -0.0015688491985201836,
        0.01847224496304989,
        0.07876333594322205,
        -0.015280493535101414,
        -0.014635628089308739,
        0.05524693801999092,
        -0.09379096329212189,
        -0.07593786716461182,
        -0.128032386302948,
        -0.008251039311289787,
        0.04995715618133545,
        -0.0715055912733078,
        0.02596934698522091,
        0.05503556504845619,
        0.027275757864117622,
        0.004676219541579485,
        0.060848116874694824,
        0.015985531732439995,
        -0.006511362735182047,
        0.06903769075870514,
        -0.03825244680047035,
        0.0663130134344101,
        -0.025980617851018906,
        -0.00183430640026927,
        -0.02618941105902195,
        0.09151914715766907,
        -0.05398666113615036,
        -0.015290655195713043,
        -0.05283715948462486,
        -0.03750760853290558,
        0.06292057037353516,
        0.024150090292096138,
        -0.05052117258310318,
        -0.049399327486753464,
        0.03024349734187126,
        0.03194046765565872,
        -0.030570436269044876,
        -0.001790386508218944,
        -0.056237101554870605,
        2.906966756199836e-06,
        0.04067301005125046,
        -0.07632797956466675,
        0.00844962615519762,
        -0.018227439373731613,
        0.008862257935106754,
        0.11733084917068481,
        -0.0010458321776241064,
        0.0010232257191091776,
        -0.02395971491932869,
        0.010648665018379688,
        -0.014989071525633335,
        0.047824714332818985,
        -0.09710036218166351,
        0.020394906401634216,
        -0.06332768499851227,
        0.043995451182127,
        0.0402526780962944,
        0.05668668448925018,
        -0.11984379589557648,
        0.07083342969417572,
        0.013355721719563007,
        -0.061795059591531754,
        -0.0217566080391407,
        0.004529351834207773,
        -0.04947818070650101,
        0.01271258108317852,
        -0.13423116505146027,
        0.04044714570045471,
        0.06594285368919373,
        0.014304040931165218,
        -0.03820579871535301,
        0.002778569469228387,
        0.049775995314121246,
        -0.04702868312597275,
        0.012555843219161034,
        -0.06245100125670433,
        0.0033589680679142475,
        0.008428883738815784,
        -0.013174225576221943,
        0.08809198439121246,
        0.06844373047351837,
        0.04636517912149429,
        -0.05225276201963425,
        -0.007240246050059795,
        -0.1000736728310585,
        -6.029198687443824e-33,
        -0.038505636155605316,
        0.021304089576005936,
        0.008865758776664734,
        0.024871543049812317,
        0.049445755779743195,
        -0.008565799333155155,
        0.0352991558611393,
        0.03679656609892845,
        0.10150949656963348,
        -0.010585710406303406,
        -0.005294716916978359,
        0.01181967742741108,
        -0.1095576211810112,
        0.008931754156947136,
        0.06458868086338043,
        -0.07816588878631592,
        -0.047149498015642166,
        -0.12788766622543335,
        -0.028866244480013847,
        0.041016608476638794,
        0.019688598811626434,
        -0.0010599514935165644,
        0.07111368328332901,
        0.025685375556349754,
        -0.0257538091391325,
        0.03836982324719429,
        -0.046887267380952835,
        -0.007584781385958195,
        0.04416145384311676,
        -0.01186832133680582,
        -0.04674133285880089,
        -0.050122298300266266,
        -0.02373144030570984,
        0.03888610005378723,
        0.02033725567162037,
        0.03613392263650894,
        -0.026454128324985504,
        -0.045926034450531006,
        0.052017033100128174,
        -0.04966898635029793,
        -0.015142462216317654,
        0.020415589213371277,
        -0.028950052335858345,
        -0.020186925306916237,
        0.0358295775949955,
        -0.03762203827500343,
        -0.016266973689198494,
        -1.403990427206736e-05,
        0.0026526523288339376,
        0.06376956403255463,
        0.01140120904892683,
        -0.0004940834478475153,
        0.010285615921020508,
        0.08933614194393158,
        -0.055532511323690414,
        -0.044361408799886703,
        0.04038713872432709,
        -0.015145285986363888,
        0.0026664186734706163,
        -0.0001879381452454254,
        0.07428757846355438,
        0.023966193199157715,
        -0.04573865979909897,
        -0.02886654995381832,
        -0.0626605749130249,
        -0.09800586849451065,
        -0.0199897401034832,
        0.026997949928045273,
        0.07407667487859726,
        -0.010596432723104954,
        0.06312993168830872,
        -0.021879276260733604,
        -0.08335184305906296,
        -0.0903807207942009,
        -0.10140158236026764,
        0.030699869617819786,
        -0.010292370803654194,
        -0.011514110490679741,
        0.027661548927426338,
        -0.10576789081096649,
        0.06166728958487511,
        0.0021901957225054502,
        0.08591381460428238,
        0.09648894518613815,
        0.10035611689090729,
        0.054061394184827805,
        -0.02552279457449913,
        -0.019864391535520554,
        0.02913406491279602,
        0.07274911552667618,
        -0.03212745115160942,
        0.03747533634305,
        -0.048338934779167175,
        0.08076976984739304,
        -0.050567321479320526,
        -5.6134712878019855e-08,
        0.0018049038480967283,
        0.05159812420606613,
        -0.026327846571803093,
        0.0010004073847085238,
        0.03902306780219078,
        -0.06900876015424728,
        -0.03079889342188835,
        -0.026324335485696793,
        0.03092760592699051,
        0.026019172742962837,
        0.07627806812524796,
        -0.05019841715693474,
        0.03513744845986366,
        0.06704555451869965,
        -0.07805155962705612,
        0.0005465863505378366,
        0.006724947597831488,
        0.00249616545625031,
        -0.025652622804045677,
        0.13217777013778687,
        -0.02940935082733631,
        0.007432891987264156,
        -0.020019371062517166,
        0.026783857494592667,
        0.03720121830701828,
        0.012504126876592636,
        -0.08867192268371582,
        -0.03716210275888443,
        0.028544388711452484,
        -0.00997292809188366,
        -0.07207633554935455,
        0.017174752429127693,
        0.024652156978845596,
        0.05301646515727043,
        -0.12359735369682312,
        -0.11122660338878632,
        -0.036288198083639145,
        -0.04227219149470329,
        0.04671872407197952,
        -0.046249620616436005,
        0.05213656648993492,
        -0.01471630297601223,
        0.03150505945086479,
        0.013678803108632565,
        -0.0314938947558403,
        -0.03230992332100868,
        0.009060593321919441,
        -0.15890313684940338,
        -0.03161797672510147,
        0.05865403264760971,
        -0.0682474821805954,
        -0.048735059797763824,
        -0.013421858660876751,
        0.062018200755119324,
        0.00022819403966423124,
        -0.0015534061240032315,
        0.027552032843232155,
        -0.009340726770460606,
        -0.0375351719558239,
        -0.03377785161137581,
        0.05413638800382614,
        -0.0015239164931699634,
        -0.026887066662311554,
        0.087057925760746
    ]
}