{
    "id": "HdWQxGM6Rco",
    "title": "We used Apple Fitness Plus for two months. Here’s what you need to know",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-02-25T16:00:12Z",
    "video_url": "https://www.youtube.com/watch?v=HdWQxGM6Rco",
    "category": "Science & Technology",
    "tags": [
        "apple",
        "apple fitness+",
        "apple fitness plus",
        "apple fitness app",
        "apple fitness plus review",
        "apple fitness plus vs peloton",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge",
        "peloton",
        "home workout",
        "workout",
        "fitness subscription",
        "subscription",
        "spinning",
        "exercise",
        "health",
        "comparison",
        "apple watch",
        "iphone",
        "fitness",
        "work from home",
        "running",
        "treadmill",
        "cycling"
    ],
    "views": 852448,
    "likes": 32514,
    "comments_count": 482,
    "description": "Often in our reviews the question is Is this thing good?, but for the Apple Fitness+ review the real question becomes Who is it good for?. Four Verge staffers spent months exercising with Apples latest service to see how it compares to others like Peloton and if it's worth your money.   If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:   You can sign up for Apple Fitness+ here:    Learn more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2TQsqjB",
        "https://bit.ly/3sEtPIn",
        "http://bit.ly/3aSJ3TI",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(soft music) - Apple Fitness Plus. It's the 10 bucks a month subscription service with a bunch of exercise videos that integrate with and actually require your Apple Watch and you probably know it's been out for a few months now but a bunch of us at the verge have been using it for a couple of months to review it. - Okay. So I'm about to do my first Apple Fitness Plus workout. - This is gonna be my first ever experience with Apple Fitness Plus. - We've been totally, absolutely being really, really good at daily exercise and closing those rings with a subscription service that we totally pay for every month making it worth our money. Yup. - Speak for yourself. I took it pretty seriously. - Yes. Yes we did actually try. - I took it kind of seriously. - Look, I've never exercised regularly in my entire life. I've never held on to a gym membership for more than a year. I mean, I'm not a total slug, but I'm slug adjacent. So I wanted to know if Fitness Plus could turn that around for me and we'll get to that, but first I think it's more important to hear from people who actually do exercise on a regular basis and who can compare Apple Fitness Plus to other similar services. Apple Fitness Plus has a bunch of different, prerecorded exercise videos with three trainers in each of them. Two of them are offering accommodations on the main exercise. These videos can vary in length from 10 minutes to up to 45 minutes. It also has integration with Apple Music, so you can listen to real actual music that you'd actually wanna listen to while you're working out. Now, there are a few different categories of exercise. There's Hitt and Yoga and Core and Dance and this thing called Mindful Cooldown which is basically just stretching with meditation. But there are also exercise videos that require you to have specific equipment, so you might need dumbbells for strength, there's cycling, there's treadmill and there's also rowing. There's one more piece of equipment that is absolutely required for all of the videos, an Apple Watch and then also something to watch the videos on, so that would be an iPhone, an iPad, an Apple TV or you can stream it to your TV via Airplay. Sometimes with reviews, the only important question is, is it good? And for what it is, yeah. Apple Fitness Plus is pretty good. So for this review I think a better question is who is it good for? (upbeat music) - So right off the bat, I loved using Apple Fitness Plus. For someone who's already plugged into the Apple ecosystem and is just getting started out with fitness, I think it's a great program. So I started using a Peloton bike last year. I haven't loved Peloton, but it's the closest I can get to my pre COVID fitness classes. On paper, the cardio offerings from Peloton and Fitness Plus look pretty similar. In both programs, you can choose classes with different lengths, playlists and levels of intensity. There's a variety of instructors, although not as many as Peloton and Apple's workouts have an added emphasis on mental health and general wellness in addition to physical health. There's a lot more of a like throw away your cares, throw away your worries, how can we be better people today attitude that you don't see across all the Peloton rides. - [Instructor] Me, you and your Fitness Plus trainer team. Let's start to add some resistance. - [Monica] This instructor is excited about being on a bike ride, it make me excited too. But it's newer than Peloton's program and that shows in a couple of ways. First, there just aren't as many teachers to choose from. There are only six Apple cycling instructors as of now and Peloton has 23 to choose from. Current playlist offerings are more generic as well. So with Peloton, I've done everything from Hamilton rides to Bon Jovi rides whereas Apple's rides are still mostly like hip hop or rock. But the one thing that bothered me the most is that the workout lengths are more limited. With Peloton, you can ride for up to 90 minutes. Apple's cycling rides max out at 45 minutes so I often found myself stringing multiple Apple workouts together to get the workout lengths that I wanted. These things are all functions of Apple Fitness Plus being fairly new and there'll be easy to fix, but some other things won't be. For example, on Peloton the instructors can give you an exact range to put your resistance at, whereas on Apple Fitness Plus because you know, everyone's using different bikes, they can only be pretty general, so easy or moderate or hard and that makes it more difficult to know whether you're at the intensity that you're supposed to be at. Okay. In the cool-down now. I've actually loved that. I thought that was so much fun. The instructor was great. The music was great. I burnt 195 calories. So you know, for 20 minutes of biking that's not bad at all. This was a lot of fun. - So I'm already a committed Peloton user and I wasn't willing to give up my bike time. I decided to keep using the bike for my cardio workouts and then use Fitness Plus for my Cooldown and Strength classes. Immediately, I noticed Apple's choice in instructors. They're diverse and interesting and I wanted to try their classes, which is a good sign. I also appreciated that the Strength classes offered three different levels. One person demoed the regular exercise. Another modified it to make it accessible for anyone with injuries or needing to go easier on their bodies and the third person made the movement more advanced. Peloton doesn't do this and it's Strength classes and I find it super frustrating, especially as someone with chronic lower back pain and like others have mentioned, I really appreciated the deep integration with the Apple Watch, even if it's super Apple like behavior to make it mandatory. I did however, like having my rings as a constant reminder in the corner of the screen. It motivated me, especially considering that when I use my Peloton, my heart rate only shows up on the screen and nothing else. Otherwise though, Apple Fitness Plus didn't hook me. I like to strength train specific parts of my body. Usually my arms, because the bike works my lower body. The app doesn't allow you to filter by workout type. So to find an upper body Strength class, I had to read through all the Strength class descriptions. Filters feel like they should be table stakes for a fitness app and here's another potential barrier to entry. I don't own an iPad or an Apple TV. So I had to stream my workouts from my phone, which was terrible. The screen is small and especially terrible when switching from Peloton's behemoth bike display to my iPhone 11 Pro. I don't understand why Apple wouldn't make Fitness Plus available through a Mac Book. How many Apple products do I need to make this program work well? As for the classes themselves, they were fine. I didn't love or hate them. The Strength classes were about what you'd expect from any Strength class and the Cooldowns were a little bit different, in that they incorporated mindfulness into them which I liked, but might be annoying if you wanna just do your stretches and get in and out. (upbeat music) - Working out in one space has always been a struggle for me. I just get bored and uninterested when I'm not actively going somewhere or physically achieving something, that's why I usually get my workouts on my bike. Taking loops off in the park or slack lining behind some trees or going for a jog. So the at-home workouts within Apple Fitness Plus, well they weren't really of interest to me. That is until a few weeks ago though, when Apple rolled out the Time to Walk feature within Apple Fitness Plus. That's something in theory, I can get behind. Time to Walk pairs inspirational monologues, music and photos from famous musicians, athletes, notable people with Apple Watch's Exercise Tracking to create a more engaging way to take a walk. Now, there are only a couple of differences between Time to Walk and a more traditional podcast. Most notably about twice an episode, your watch will buzz and a photo will appear on your watch that relates to what the host is talking about. It's cool. It's not game changing. And then secondly, the hosts are either also on a walk or they're talking about what walking means to them and this, I actually appreciated a bit more. Ruby Bridges has a slow, calm pace you can hear as she strolls through a park in New Orleans. - [Ruby] Right now we are in Audubon park, here in New Orleans. - Well Dream on Greens, Heavier Foot on a Gravel Path and Malibu is accompanied by the sounds of distant waves. - [Instructor 2] I try to go on a walk maybe once every couple of weeks. Its your time to lose yourself in nature. - Huge shout out to the audio engineers that worked on these because it really makes it sound like you're walking next to somebody or in a different place entirely. Now my big issues with Apple Fitness Plus at large is just needing to be in the Apple ecosystem and this definitely affects Time to Walk, because if you're not using Apple's headphones, it's just kind of a pain to have to manually connect your Bluetooth headphones to your watch, and then say you get a phone call on your iPhone while you're walking, you have to manually your headphones to your iPhone and then back to your watch when you're done with your call to continue your walk. I just found it a big pain and navigating the 40 millimeter Apple watch screen to do all of this is not easy either, but if you can put all of that aside and maybe you're already all within this ecosystem anyway, Time to Walk is really a great feature and every Monday, the new mystery slab shows up on your watch face. And that's something I actually started to look forward to. (upbeat music) - So I went all out for this review because one thing I've learned in my life is that buying stuff like exercise equipment means that you're totally gonna use it, right? So I got this trainer for my bike. I also bought this here, yoga mat and I also even bought these pants from Lululemon that, I am never wearing these in public, these are hideous. Now, I have to admit for an absolute beginner like me, Apple's Fitness Plus classes are kind of right at the perfect level. I can start with the really easy stuff and then I can see the slightly more difficult classes just waiting there as a kind of a goal to step up to and if what I'm doing is too difficult, there's always three different trainers on the screen. One of them has got an accommodation to make something a little bit easier if the exercise that the main trainer showing is too tough. So that's all great, but can I just say that as a Gen X-er, the whole vibe of all of these videos, is a lot. - [Instructor 3] Be expressive. Let everything go. Be who you wanna be. (hiphop music) - I'm used to jaded MTV VJ's from the nineties and I really don't like this hazy, really enthusiastic, but not quite religious, vague spiritualism kind of mindfulness vibe you get in the Cooldowns. It's just, I don't love it. The trainers are great and I really love the diversity that you get with all the trainers, but I just kinda wish there was a way to turn the voices down and the music up. I also have to admit that I'm with Becca. I got back into riding my bike right before the pandemic had started. So during the pandemic, I am a super enjoying riding my bike around outside. Now I know that not everybody can do that. You might not be able to and of course there's probably snow on the ground and it's too cold, so I am lucky to be in California. But the point to me is that everybody does eventually end up finding an exercise style that works for them, hopefully. - I don't feel like there's anywhere for me to really go with Fitness Plus. I think if I become a significantly stronger rider which I'm hoping will happen sooner rather than later, it'll be too easy, but I am looking forward to see where Apple Fitness Plus goes. I'm excited to see them diversify their offerings and expand what they have. I think when it's found its footing, Fitness Plus will be an excellent program. - Overall Fitness Plus isn't going to become my go-to fitness app. Because I'm a month long Peloton user, I'm already in that world and possibly too far gone. It's hard for me to switch up my routine when I can get everything done through the Peloton. But if Apple really wants to keep people like me logging on, it needs to sweeten the offerings with equipment like Peloton and have a larger catalog of classes to choose from. - I found that I only really used the Time to Walk feature with an Apple Fitness Plus and that's simply not enough to keep me subscribed to the service as a whole, but it did make me think that Apple could do some really cool site specific workouts, like in terms of walking, imagine walking through Yosemite with Alex Honnold or down Broadway in New York city with Fran Leibowitz. Now that's something I could definitely get behind and yes, it might start to feel like a guided museum to her with like heart rate tracking and calorie counts, but I don't know something cool to think about. - As for me, I'm already paying for Fitness Plus anyway because I'm an Apple's big bundle and you know what since I have a bad back, I'm actually using the service itself more than I've ever used a gym membership. I really enjoy the core exercises and you know, even though I like riding my bike outside more than I like sitting on a trainer, I am finding that I'm doing a little bit more of both now that Fitness Plus is around. They're sort of a virtuous cycle around it and it's become a bit more of a habit for me. It's not something that I would go out and buy an Apple Watch just to get, but Fitness Plus is something that makes it slightly more likely that I wanna keep using this Apple watch instead of switching to something else someday. There is no way that Apple could make a fitness service that appeals to everybody, especially right out of the gate. So I do think it was kind of smart to aim Fitness Plus at a broad beginner audience. If you already have an exercise routine, Apple Fitness Plus might not be advanced enough to hold your attention yet, but if you don't exercise much, well, Apple Fitness Plus is literally better than nothing. Hey everybody thanks so much, no Vjeran. Vjeran is gonna do the end card. Yeah. - Wait, what did I do wrong? Like and subscribe.",
    "transcript_keywords": [
        "Apple Fitness",
        "Apple",
        "Fitness",
        "Apple Watch",
        "Peloton",
        "Apple Watch Exercise",
        "compare Apple Fitness",
        "Watch",
        "exercise",
        "Walk",
        "Apple workouts",
        "strength",
        "Apple watch screen",
        "Time to Walk",
        "bike",
        "Strength classes",
        "time",
        "classes",
        "Apple cycling",
        "COVID fitness classes"
    ],
    "transcript_entity_values": [
        "last year",
        "23",
        "Bon Jovi",
        "the nineties",
        "Strength",
        "every couple of weeks",
        "the Time to Walk",
        "Broadway",
        "a few weeks ago",
        "one",
        "third",
        "Hitt",
        "Apple",
        "Peloton",
        "a Mac Book",
        "three",
        "45 minutes",
        "Monica",
        "today",
        "Alex Honnold",
        "Apple Fitness Plus",
        "Fitness Plus",
        "195",
        "California",
        "Apple Watch's Exercise Tracking",
        "Fran Leibowitz",
        "only six",
        "a couple of months",
        "Hamilton",
        "iPad",
        "Becca",
        "daily",
        "every month",
        "Malibu",
        "a few months",
        "Apple TV",
        "up to 90 minutes",
        "20 minutes",
        "Mindful Cooldown",
        "Yosemite",
        "Two",
        "One",
        "10 bucks",
        "secondly",
        "Apple Watch",
        "New Orleans",
        "more than a year",
        "Peloton and Fitness Plus",
        "Ruby Bridges",
        "the Apple Watch",
        "Audubon",
        "10 minutes",
        "40 millimeter",
        "Lululemon",
        "iPhone 11",
        "Monday",
        "first",
        "iPhone",
        "New York",
        "Greens",
        "Yoga and Core and Dance",
        "max",
        "Peloton",
        "month",
        "First",
        "MTV VJ's",
        "Apple Music"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "FAC",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "CARDINAL",
        "TIME",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "GPE",
        "DATE",
        "ORG",
        "TIME",
        "TIME",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "TIME",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "ORG",
        "GPE",
        "NORP",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.05036488547921181,
        -0.08417053520679474,
        0.014025310054421425,
        -0.04300304502248764,
        0.07785999774932861,
        0.0407567135989666,
        -0.02394329011440277,
        0.0364188514649868,
        0.0011420289520174265,
        0.02112947218120098,
        0.01593528874218464,
        0.010581772774457932,
        -0.016612708568572998,
        -0.014003154821693897,
        0.08400203287601471,
        -0.037454064935445786,
        0.09619240462779999,
        -0.07477084547281265,
        0.02011951617896557,
        -0.020290423184633255,
        -0.09316691756248474,
        -0.02655247040092945,
        0.072937972843647,
        0.07353339344263077,
        -0.023623328655958176,
        0.02303062193095684,
        -0.030340533703565598,
        0.0009170153643935919,
        -0.033608175814151764,
        -0.005092565435916185,
        0.002575736492872238,
        0.0379265733063221,
        0.07866711169481277,
        -5.195413177716546e-05,
        -0.09535621106624603,
        -0.0706789568066597,
        0.0678858831524849,
        -0.02139635756611824,
        -0.14277811348438263,
        -0.07516676187515259,
        -0.09659513086080551,
        -0.009377598762512207,
        0.029568666592240334,
        0.052955131977796555,
        0.015290051698684692,
        -0.02065468207001686,
        0.02299170009791851,
        -0.04939308762550354,
        0.056185971945524216,
        0.06606698781251907,
        0.022240201011300087,
        -0.15461385250091553,
        0.10030186176300049,
        -0.005523104686290026,
        0.007813867181539536,
        0.0038332194089889526,
        -0.0245585385710001,
        0.022012967616319656,
        0.008686920627951622,
        0.017509613186120987,
        0.0979187861084938,
        -0.14168523252010345,
        -0.037501782178878784,
        0.016845472157001495,
        -0.04576592147350311,
        0.0025149581488221884,
        -0.03441505506634712,
        0.07386140525341034,
        0.0625205785036087,
        -0.08913607150316238,
        -0.05216013267636299,
        -0.061171192675828934,
        0.06512454152107239,
        0.02953130006790161,
        0.032799020409584045,
        0.07900083810091019,
        0.0751904845237732,
        -0.09050938487052917,
        -0.018713882192969322,
        -0.035370007157325745,
        -0.04078061506152153,
        0.0149496179074049,
        -0.003676079213619232,
        0.004251313861459494,
        0.053958311676979065,
        -0.010466746985912323,
        0.026461679488420486,
        0.001974699320271611,
        -0.03305156156420708,
        -0.008303412236273289,
        0.0028625777922570705,
        0.12182340025901794,
        -0.04048745334148407,
        -0.045747142285108566,
        0.05466995760798454,
        0.043185021728277206,
        -0.12560629844665527,
        -0.0812937468290329,
        -0.06787355989217758,
        0.004982658661901951,
        0.004270934034138918,
        0.08060809969902039,
        0.04799070954322815,
        -0.015815285965800285,
        -0.00699750566855073,
        -0.10535506159067154,
        0.017229750752449036,
        0.04969392344355583,
        0.1224205270409584,
        0.13555429875850677,
        0.012057670392096043,
        -0.006464495789259672,
        0.008484992198646069,
        0.062083519995212555,
        0.052991610020399094,
        0.07813060283660889,
        0.0260508731007576,
        0.06800994277000427,
        0.08109042048454285,
        0.06780043989419937,
        0.032897159457206726,
        0.08247346431016922,
        0.01320187933743,
        -0.03351495414972305,
        -0.011466034688055515,
        -0.04867237061262131,
        -0.047575242817401886,
        1.958563687946978e-33,
        -0.08225329965353012,
        0.07411232590675354,
        0.03837232291698456,
        -0.010109860450029373,
        0.031137293204665184,
        -0.06905213743448257,
        -0.030686678364872932,
        0.011484849266707897,
        0.013097521848976612,
        0.010849208571016788,
        -0.031727977097034454,
        0.07104641199111938,
        0.002167060971260071,
        0.07026395946741104,
        0.005494060926139355,
        -0.10280159115791321,
        -0.035479333251714706,
        0.017900964245200157,
        -0.04866882041096687,
        0.004651147872209549,
        0.061360232532024384,
        -0.08505251258611679,
        -0.04114363342523575,
        -0.0018718724604696035,
        0.00874118972569704,
        0.011428014375269413,
        0.05734391510486603,
        0.03713073953986168,
        0.13164839148521423,
        0.00016898811736609787,
        -0.07194861769676208,
        -0.02732500061392784,
        -0.0634264424443245,
        -0.09337004274129868,
        0.024441339075565338,
        0.03830618038773537,
        0.016742732375860214,
        -0.030512060970067978,
        0.004421534016728401,
        -0.006110330577939749,
        -0.09210251271724701,
        -0.002544347895309329,
        -0.020607082173228264,
        -0.05235522240400314,
        0.028088470920920372,
        0.007082260213792324,
        0.05432155728340149,
        -0.016394130885601044,
        0.034918852150440216,
        -0.04435556009411812,
        -0.050911955535411835,
        -0.03823164850473404,
        -0.005933745764195919,
        -0.018892966210842133,
        -0.03645617887377739,
        0.027542823925614357,
        0.0044358037412166595,
        -0.04305695742368698,
        -0.03135981783270836,
        -0.006447056774049997,
        0.03432365134358406,
        0.027802495285868645,
        -0.0008193079847842455,
        -0.031074251979589462,
        -0.16102203726768494,
        0.04465164244174957,
        0.0007610731991007924,
        -0.02083101123571396,
        -0.0689016804099083,
        0.10521312803030014,
        -0.04777619615197182,
        0.07711415737867355,
        -0.056033819913864136,
        -0.03252747654914856,
        0.01789219304919243,
        -0.006963419262319803,
        -0.07776036858558655,
        -0.005817348603159189,
        -0.047358542680740356,
        0.06421618908643723,
        0.0396486334502697,
        -0.007304253056645393,
        0.005751533433794975,
        0.033155106008052826,
        0.023705091327428818,
        0.04788509011268616,
        -0.022608555853366852,
        0.009801809675991535,
        0.003460812382400036,
        -0.00932726263999939,
        -0.030137576162815094,
        0.05684014409780502,
        -0.005857415962964296,
        0.11669468879699707,
        -0.025152744725346565,
        -2.400718724840081e-33,
        -0.07323264330625534,
        -0.030966738238930702,
        0.05757275968790054,
        0.010423419997096062,
        0.03557146340608597,
        -0.01113272923976183,
        0.007470051292330027,
        -0.008897929452359676,
        0.0018249601125717163,
        0.004562755580991507,
        -0.052258819341659546,
        -0.033177636563777924,
        -0.04085410758852959,
        0.0005974408704787493,
        0.020704321563243866,
        0.029574325308203697,
        -0.0520695261657238,
        -0.07362432777881622,
        -0.013428042642772198,
        -0.022002296522259712,
        -0.009116598404943943,
        0.012446997687220573,
        0.00630186265334487,
        -0.0739315003156662,
        0.038431670516729355,
        0.03662801906466484,
        0.06043456494808197,
        0.08973316848278046,
        0.03041096031665802,
        -0.007967597804963589,
        -0.017773175612092018,
        -0.028235962614417076,
        -0.0457843542098999,
        -0.06985621899366379,
        0.05084792152047157,
        0.05622890591621399,
        -0.006441918667405844,
        0.0036698614712804556,
        -0.04492555186152458,
        -0.04219139739871025,
        0.0566307008266449,
        0.028265442699193954,
        0.00556260347366333,
        -0.014511420391499996,
        -0.015929825603961945,
        -0.012254512868821621,
        -0.017954567447304726,
        0.06376209110021591,
        -0.08737257868051529,
        -0.03403732180595398,
        0.03370383754372597,
        -0.03640631213784218,
        0.026916760951280594,
        -0.01307770423591137,
        0.00980094913393259,
        0.004689841065555811,
        -0.05455201491713524,
        0.051893576979637146,
        -0.04500832408666611,
        -0.07232896983623505,
        -0.07279060781002045,
        0.013320427387952805,
        -0.041151031851768494,
        0.0003968355304095894,
        0.008028407581150532,
        0.01102425903081894,
        0.07709725201129913,
        0.038021959364414215,
        -0.06597161293029785,
        0.055904362350702286,
        -0.00862125214189291,
        0.03138110041618347,
        -0.037032708525657654,
        -0.04863065481185913,
        -0.040374383330345154,
        0.07384363561868668,
        0.08353592455387115,
        -0.05644230544567108,
        -0.11435046046972275,
        -0.0067870523780584335,
        0.035263966768980026,
        0.02645014598965645,
        0.08012605458498001,
        -0.029520777985453606,
        0.0805816650390625,
        0.0753588005900383,
        -0.0002989351050928235,
        0.06093312054872513,
        -0.06291081756353378,
        0.08689572662115097,
        -0.01982036419212818,
        -0.00521449139341712,
        -0.07281973958015442,
        0.05071913078427315,
        0.018423356115818024,
        -4.738092229672475e-08,
        -0.0255340114235878,
        -0.030009901151061058,
        0.04566876217722893,
        -0.005462094210088253,
        -0.008918079547584057,
        -0.001056380569934845,
        0.017586540430784225,
        0.011994045227766037,
        0.01858261600136757,
        0.04148625209927559,
        -3.552581256371923e-05,
        -0.04404797777533531,
        -0.06855481117963791,
        0.08139616996049881,
        -0.0006167154060676694,
        -0.002196133602410555,
        0.012910071760416031,
        0.04739266633987427,
        -0.02349042147397995,
        -0.0012150105321779847,
        -0.04360268637537956,
        0.0380597859621048,
        -0.004832329228520393,
        -0.023178549483418465,
        -0.017328713089227676,
        0.045459553599357605,
        0.0030260304920375347,
        0.01610393077135086,
        0.004375826101750135,
        -0.022691255435347557,
        -0.008267650380730629,
        0.02049264684319496,
        -0.013892656192183495,
        -0.03330598771572113,
        -0.08953756839036942,
        -0.06651464849710464,
        0.03352254256606102,
        -0.0025203898549079895,
        -0.02166263572871685,
        0.09631688892841339,
        -0.016405291855335236,
        0.01265543419867754,
        0.04312043637037277,
        0.01405737828463316,
        -0.027873706072568893,
        -0.06708530336618423,
        -0.04856637865304947,
        -0.09491874277591705,
        0.036166176199913025,
        0.03657574579119682,
        0.04180707037448883,
        -0.05663852021098137,
        0.1234605461359024,
        0.03155966103076935,
        -0.02549934573471546,
        0.035197820514440536,
        -0.022426415234804153,
        -0.061895985156297684,
        -0.06460466980934143,
        0.120398610830307,
        0.03773554414510727,
        -0.1251767873764038,
        0.029238533228635788,
        0.03936319053173065
    ]
}