{
    "id": "hFKFs9hXeqI",
    "title": "The New iPad is...  (Lets just not talk about it...)",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-12-12T17:16:16Z",
    "video_url": "https://www.youtube.com/watch?v=hFKFs9hXeqI",
    "category": "Howto & Style",
    "tags": [
        "ipad",
        "new ipad",
        "apple ipad",
        "allnewipad",
        "ipad 10th generation",
        "10th gen ipad",
        "ipad usbc",
        "ipad durability test",
        "regular ipad",
        "ipad scratch test"
    ],
    "views": 2325323,
    "likes": 68757,
    "comments_count": 3936,
    "description": "Lets *not* talk about this one... Get a 4-week trial, free postage, and a digital scale at  Thanks to Stamps.com for sponsoring the show! I feel like every time I blink - Apple is releasing a new iPad. This time it comes in some cool new colors though! Its time to find out how durable apples new iPad really is. And... maybe... if the all new iPad fails - we'll be able to see whats inside the iPad.   Grab a Razor knife here:    Get your Teardown Skin HERE:   Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.stamps.com/jerryrig.",
        "https://www.jerryrigknife.com/",
        "https://dbrand.com/teardown",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "In front of us today we have a brand new 2022 iPad in pink. This is not to be confused, of course, with the iPad Pro, iPad Mini, iPad Air, or 9th Generation iPad, all of which are still for sale on Apple's website. These new iPads are the most colorful though. Today we're going to find out how durable this new iPad is. Speaking of colorful and durable, I have a JerryRig knife sale going on, that I'm probably going to regret later, for just $9.99. USPS says the last day to order something and have it still arrive by Christmas is December 17th. So the clock is ticking. I think the first colors that we're going to run out of are the Metal and Clear, so if you've been eyeing those, now is the time. And of course I will do my absolute best to get them to you by the holidays. If you do a lot of shipping like me, and if you hate leaving your house, like me, you're going to love today's sponsor, Stamps.com. For more than 20 years Stamps.com has been giving over 1 million businesses complete access to USPS and UPS straight from our computer. With massive discounts, up to 86% off, it's a stress-free solution. All you need is a computer and a printer. And with Stamps.com Switch and Save feature you can compare rates and carriers making sure you get the best deal every time, and can even schedule pickups. Stamps.com also integrates with online stores like Shopify, Etsy, eBay, and other online shopping carts. This holiday season you can trade late nights for silent nights. To get your 4-week trial go to Stamps.com/JerryRig. You can get free postage, a free digital scale, and no long term commitments or contracts just how we like it. No lines, no traffic, no hassle. Huge thanks to Stamps.com for sponsoring this video. Now I think it's time we get extremely up close and personal with Apple's new iPad. Let's get started. [Intro] Your first question today is probably, 'Hey Jerry, what makes this iPad different from the other 4 iPads for sale on Apple's website?' And I'm going to be honest, they all kind of seem the same to me. But this one is pink and costs about $450, which doesn't seem all that bad. The pink is kind of a softer peachy pink in my opinion. Inside the box we have a pretty high quality charging cable. A charging brick. And if we look close we can check the wattage. Sorry. If we look close we can check the wattage. It looks like 20 watts...and holy cannoli, both ends of this cable are USB-C. The new iPad 10th Generation has officially caught up with the rest of the world and is using USB-C. Nice work, Apple. Hopefully that means that iPhones are next to transition, which I'm betting they'll have to to comply with the new EU regulations. The most difficult part of this transition, of course, will be the accessories we lose along the way. For example, this 10th Generation iPad is compatible with the 1st Generation Apple pencil, but not the wirelessly charging 2nd Generation pencil. Which means if you do get the 1st Gen pencil with it's lightning port eraser, you'll have to buy the $9 Apple pencil adapter which then plugs into a USB-C cable, which then plugs into the iPad to both pair and charge the Apple pencil. Lose any one of these three tiny components and your pencil will no longer function. Apple's loving it though. I hear they're even changing the catchphrase from think different to think dongle. We'll get this little menage a trois out of the way and get down to analyzing the color a little more thoroughly. It's not a bad pink. A little less vibrant than my knife but also not quite as Bubble Gum as the lighter. But still loud enough to be noticed for sure. I don't hate it. Getting ready for the front screen scratch test I notice something interesting. We always set up for our Mohs scale of hardness, but this time around I can tell there is an air gap between the front glass and the display underneath. Not something we normally find. We can see the glass on top move independently from the pixels. We'll have to confirm this during the teardown, or you know, later on in this video if it does snap in half. All in good time of course. Plastic would scratch at a level 2 or 3. Glass scratches at a 5 or 6. And sapphire would scratch at a level 8 or 9. The free floating pane of glass however, starts scratching at level 6, with deeper grooves at a level 7. Pretty standard. No complaints so far. Making our way up to the top front facing camera...which is no longer at the top. It's now tucked into the side bezel and protected by glass. It is a 12 megapixel ultra wide camera. I am a fan of this placement although I really don't have strong feelings one way or the other. The sides are made from anodized aluminum. 100% recycled aluminum to be exact. This iPad was maybe a Mountain Dew can in a previous life. And maybe it'll be a Mountain Dew can again in the next life...which will be coming pretty soon. The buttons are metal except for the top power button which doubles as a fingerprint scanner. It does not scratch. Thumbs up for that. On the opposite side of the camera we have more metal and three golden circles near the magnetical attachment point for the keyboard thing. At the bottom we have more speaker grills, and our good buddy, the USB-C port. Making our way to the back panel we have our 12 megapixel wide angle camera back here, along with a directional mic. And of course, the super shiney Apple logo, which does scratch. Now we know Apple has 5 iPads for sale right now. The iPad Pro hits that sweet demographic of people who like having the power of a laptop, and like paying extra for the keyboard. The iPad Air is for people who like the regular iPad but don't like going two dongles deep to get the Apple pencil working. Then, of course, this is the regular iPad. We also have last year's iPad 9th Gen which doesn't change all that much, and the iPad Mini which is the small one. I hope that cleared up any confusion. And even though my drawing is complete, I'm highly doubtful anyone can tell what it is. I'll be the first one to admit it's not my best work. I tried going for a cute little pink Kirby, but this one looks like he got tko'd on a 1v1 first m2k. Maybe we should just keep going with the durability test and put the nightmare Kirby behind us. Apple's calling the 10.9 inch screen a liquid retina display. And after about 15 seconds from my lighter, we can see that the heat passing through the glass and air gap causes the LCD to go black. But after some time it does recover. At this point we would usually test the fingerprint scanner, but since it's unscratchable up here, there's no need. We can go straight to the bend test. You might be thinking that iPads are weak and of course they'll break, but in fact, the most recent iPad Pro survived, along with the older iPad Mini. It, too, survived the bend test. This iPad 10th Generation, however, should not be put in a back pocket. The Achilles heel of this tablet seems to be the three gold pads running along the side. Less material and less structure led to a catastrophic weak point and subsequent shattering. The other side of the tablet without the dots does not crack, even after it's been structurally compromised. So if the dots could be moved on the next iteration it would, indeed, become a stronger tablet. Kirby's still back here being absolutely terrifying. I think that since we have nothing left to lose it's time for a teardown. A little bit of heat can help soften the adhesive around the edges. And it looks like the top layer of laminated glass is indeed completely separate from the display underneath. The digitizer is not glued to the pixels. Speaking of pixels, the liquid retina, or LCD, makes some pretty cool designs as I peel it away from the tablet. Bright flashes of light and color. It's gleaming it's last gleam. To be fair though this iPad does look pretty repairable. And from the inside this iPad tension looks a whole lot emptier than I was expecting. The motherboard is over here on the right side with some stylish aesthetic black lettering on the 28.9 watt hour battery. The biggest surprise though is that there are only 2 little tiny speakers in here. The iPad Pro has 4 speakers inside positioned close to their corresponding grill holes. But this particular speaker here at the bottom isn't even close to the opening. It's still stereo of course but there's a whole lot of empty space inside of this thing. The metal squares you're seeing are magnets, probably to help keep the folio cover closed. It's cool to see the magnets on the side labeled with their pole orientation to help keep the keyboard locked into place. Apple is using 100% recycled magnets for this, along with recycled tin, gold, and copper on the motherboard. I'm a fan of that. I'm not, however, a fan of nightmare Kirby back here. Luckily he can be gone forever with one of my Teardown Skins which lets you see the exact layout of all the internal components without ever needing to snap your tablet in half, which is probably preferable to most parents out there. Let's just all agree to never talk about Kirby again. Grab your discounted JerryRig knife with the link in the description. They make excellent stocking stuffers. Just make sure to keep track of those fingers Santa can't replace digits. Come hang out with me on Instagram. Thanks a ton for watching. And I'll see you around.",
    "transcript_keywords": [
        "iPad",
        "Apple",
        "iPad Pro",
        "Apple pencil",
        "Generation Apple pencil",
        "Generation iPad",
        "iPad Mini",
        "Stamps.com",
        "Generation",
        "iPad Air",
        "iPads",
        "Generation Apple",
        "pencil",
        "time",
        "glass",
        "Kirby",
        "Apple website",
        "pink",
        "side",
        "USBC"
    ],
    "transcript_entity_values": [
        "iPad Mini",
        "two",
        "6",
        "about $450",
        "about 15 seconds",
        "EU",
        "Kirby",
        "This holiday season",
        "the last day",
        "first",
        "Christmas",
        "iPads",
        "10.9 inch",
        "Bubble Gum",
        "Shopify",
        "iPad Air",
        "iPad 9th Gen",
        "9",
        "nights",
        "Stamps.com",
        "USB-C. Nice",
        "Jerry",
        "Stamps.com Switch",
        "m2k",
        "Generation Apple",
        "more than 20 years",
        "iPad",
        "20 watts",
        "the iPad Mini",
        "last year's",
        "December 17th",
        "Apple",
        "iPhones",
        "USB-C",
        "over 1 million",
        "LCD",
        "86%",
        "3",
        "Santa",
        "iPad 10th Generation",
        "one",
        "10th",
        "late nights",
        "8",
        "Instagram",
        "eBay",
        "100%",
        "Glass",
        "three",
        "the iPad Pro",
        "Etsy",
        "12 megapixel",
        "half",
        "shiney Apple",
        "USPS",
        "The iPad Air",
        "USB-C.",
        "5",
        "iPads",
        "28.9 watt hour",
        "4-week",
        "1st",
        "The iPad Pro",
        "Teardown Skins",
        "6",
        "JerryRig",
        "only 2",
        "just $9.99",
        "4",
        "iPad",
        "9th",
        "today",
        "Achilles",
        "2022",
        "Today",
        "iPad Pro",
        "Generation iPad",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "TIME",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL"
    ],
    "vector": [
        -0.08064045011997223,
        -0.01912112720310688,
        0.029151676222682,
        -0.06107041612267494,
        0.10212669521570206,
        -0.07355808466672897,
        0.05414072051644325,
        -0.02637602388858795,
        0.049122005701065063,
        0.027657123282551765,
        0.10282072424888611,
        -0.01794084720313549,
        -0.12363284081220627,
        0.0011517676757648587,
        0.01761774718761444,
        0.014739377424120903,
        0.03154202550649643,
        0.008977015502750874,
        -0.08133422583341599,
        0.029109762981534004,
        -0.02205965667963028,
        -0.011044914834201336,
        0.04788757860660553,
        -0.04603671282529831,
        -0.05083134025335312,
        0.019247567281126976,
        0.019125455990433693,
        -0.03369561582803726,
        -0.07030106335878372,
        -0.010167176835238934,
        0.0029870576690882444,
        -0.0023833252489566803,
        -0.07675456255674362,
        0.12523065507411957,
        -0.03189676254987717,
        -0.017394760623574257,
        0.05460912734270096,
        0.02825404703617096,
        -0.02245192602276802,
        -0.05828750506043434,
        -0.016373883932828903,
        -0.012342669069766998,
        -0.0608970932662487,
        0.03888288512825966,
        0.03327900916337967,
        0.048322901129722595,
        0.023662997409701347,
        -0.03832216188311577,
        0.049861639738082886,
        0.003582579083740711,
        -0.04988120123744011,
        -0.04489012062549591,
        0.012085502967238426,
        -0.07517590373754501,
        0.005919247400015593,
        -0.02279805764555931,
        0.04130055010318756,
        -0.02606777660548687,
        0.06348104774951935,
        0.05243249610066414,
        0.05179906636476517,
        -0.04851091280579567,
        0.05938473343849182,
        0.041314754635095596,
        0.00935128703713417,
        -0.016152583062648773,
        0.03197536617517471,
        -0.06655731052160263,
        -0.0024218596518039703,
        -0.06959014385938644,
        -0.044337522238492966,
        0.004209257662296295,
        0.08664169907569885,
        0.005004345439374447,
        -0.026479413732886314,
        0.031919173896312714,
        -0.0042910464107990265,
        0.05365883558988571,
        -0.0367814376950264,
        0.023846536874771118,
        0.04159974306821823,
        0.0030044326558709145,
        0.032504789531230927,
        0.003417798550799489,
        0.002607670845463872,
        0.032199762761592865,
        -0.03355508670210838,
        0.04596825689077377,
        -0.07338330894708633,
        -0.006156547926366329,
        -0.003711291588842869,
        0.08280133455991745,
        -0.0242475438863039,
        0.004902080167084932,
        0.005177418701350689,
        -0.015780191868543625,
        -0.024304889142513275,
        -0.07626669853925705,
        -0.07409465312957764,
        0.05315018817782402,
        -0.02613772451877594,
        -0.007894845679402351,
        0.06363444775342941,
        -0.06749366968870163,
        0.018914930522441864,
        -0.05534021183848381,
        -0.047968946397304535,
        -0.03391699865460396,
        0.03933694213628769,
        0.07232901453971863,
        0.05625869333744049,
        -0.021916834637522697,
        -0.07119247317314148,
        -0.03011281229555607,
        0.10426591336727142,
        -0.0037817598786205053,
        -0.10097236186265945,
        0.10641173273324966,
        0.12410265952348709,
        0.033724043518304825,
        0.06348168104887009,
        0.08342055976390839,
        -0.06858529895544052,
        -0.06738755851984024,
        -0.029917629435658455,
        0.06312008202075958,
        -0.016217952594161034,
        1.7885361442822114e-33,
        -0.0027003686409443617,
        0.1592850685119629,
        -0.005763250403106213,
        0.03429260849952698,
        -0.023584745824337006,
        -0.08410992473363876,
        0.026785830035805702,
        0.12001436948776245,
        0.04180854931473732,
        -0.002063784981146455,
        0.02895309217274189,
        -0.021819008514285088,
        -0.07659640908241272,
        -0.015023783780634403,
        0.017071258276700974,
        -0.10518834739923477,
        -0.052714526653289795,
        -0.0663190558552742,
        0.017664834856987,
        0.005856244824826717,
        -0.09468929469585419,
        -0.05273985117673874,
        0.012064874172210693,
        0.02259826473891735,
        0.01785123348236084,
        -0.003614578163251281,
        0.06299981474876404,
        -0.03287968412041664,
        -0.014702599495649338,
        0.005104711279273033,
        -0.11684947460889816,
        0.028639445081353188,
        0.022321738302707672,
        -0.08281582593917847,
        -0.06749726086854935,
        -0.041406575590372086,
        -0.0020010320004075766,
        -0.05985373258590698,
        0.013519794680178165,
        0.015252550132572651,
        -0.0848294049501419,
        -0.014322889968752861,
        -0.04496513679623604,
        -0.004702825099229813,
        0.0326220765709877,
        0.034817636013031006,
        -0.002082584658637643,
        0.06894470751285553,
        -6.777827366022393e-05,
        -0.056542523205280304,
        -0.03228968381881714,
        -0.10854309797286987,
        0.02660888060927391,
        -0.03574657812714577,
        -0.08266016095876694,
        -0.04669169709086418,
        -0.023358527570962906,
        -0.04698897898197174,
        0.08723034709692001,
        0.03701603412628174,
        0.04231404513120651,
        -0.06034539267420769,
        -0.01791961118578911,
        0.05961070582270622,
        -0.08510028570890427,
        0.04986957460641861,
        -0.022296763956546783,
        0.01564229093492031,
        -0.08003677427768707,
        -0.008432582952082157,
        -0.01693021133542061,
        0.039325546473264694,
        0.01209581084549427,
        -0.03099687024950981,
        -0.01933581568300724,
        0.0022727646864950657,
        0.024046117439866066,
        0.007975299842655659,
        0.011291535571217537,
        -0.05926376208662987,
        -0.029905706644058228,
        0.04323330894112587,
        0.05248784273862839,
        0.04675308242440224,
        -0.01883678510785103,
        0.011472167447209358,
        0.01219739019870758,
        -0.056318048387765884,
        -0.0185997411608696,
        -0.04700499400496483,
        -0.005681411828845739,
        -0.006209914106875658,
        -0.042681775987148285,
        -0.04425696283578873,
        0.059639181941747665,
        -3.96106074257197e-33,
        0.04833994433283806,
        0.007971225306391716,
        -0.0807444304227829,
        -0.02428138628602028,
        0.011723592877388,
        -0.020442813634872437,
        0.06899318099021912,
        0.08465959876775742,
        0.02596351131796837,
        -0.0627850592136383,
        -0.027024464681744576,
        0.049042172729969025,
        -0.024938415735960007,
        -0.05498113855719566,
        0.007363222539424896,
        0.023834634572267532,
        -0.06344233453273773,
        -0.00854738149791956,
        0.0629206970334053,
        -0.014971655793488026,
        0.011170381680130959,
        0.0361856184899807,
        0.08480118960142136,
        -0.02128473110496998,
        0.03306291624903679,
        -0.01641962304711342,
        0.0696631669998169,
        -0.016218241304159164,
        0.060559358447790146,
        -0.010395410470664501,
        0.06394243240356445,
        -0.12614962458610535,
        0.007679303642362356,
        0.09824874252080917,
        0.018725335597991943,
        0.06401252001523972,
        0.08020032942295074,
        -0.07498475909233093,
        -0.05404997989535332,
        -0.00709482142701745,
        0.055433448404073715,
        -0.005484236404299736,
        -0.0535598024725914,
        -0.009495427832007408,
        -0.06765696406364441,
        -0.011813356541097164,
        -0.022728320211172104,
        0.07121071964502335,
        0.017534470185637474,
        -0.012120258063077927,
        -0.02455156296491623,
        0.054864078760147095,
        -0.08365865051746368,
        -0.003442971734330058,
        -0.11490772664546967,
        0.04687274247407913,
        0.05873696133494377,
        -0.014204703271389008,
        -0.02052254043519497,
        0.007539897691458464,
        -0.037070419639348984,
        -0.014188946224749088,
        0.007592792622745037,
        -0.011583075858652592,
        -0.019231270998716354,
        -0.0467844121158123,
        0.026274478062987328,
        0.0205219853669405,
        0.00179712672252208,
        0.03680773451924324,
        0.01891176588833332,
        -0.025537053123116493,
        -0.0570458322763443,
        -0.09521377086639404,
        0.03858914598822594,
        0.04656074568629265,
        0.05888828635215759,
        -0.06273911148309708,
        -0.0678490698337555,
        -0.012178586795926094,
        0.04830363765358925,
        0.03836401179432869,
        0.011619594879448414,
        0.07790215313434601,
        0.08243480324745178,
        0.012231635861098766,
        0.08489742130041122,
        0.01747700572013855,
        -0.08180905133485794,
        0.02175632305443287,
        -0.03491167351603508,
        0.021939557045698166,
        -0.059715572744607925,
        0.09305348992347717,
        -0.01611054129898548,
        -6.247548611781895e-08,
        -0.009317872114479542,
        0.06832212209701538,
        0.04956759139895439,
        -0.07131553441286087,
        0.10017292946577072,
        -0.006369371898472309,
        0.010385654866695404,
        0.04041649401187897,
        0.015345758758485317,
        -0.04679805412888527,
        -0.07427603751420975,
        -0.08301136642694473,
        -0.011366082355380058,
        0.12239741533994675,
        0.0073888273909688,
        0.06037062406539917,
        -0.047667667269706726,
        0.02980097010731697,
        -0.014851574786007404,
        -0.05771173536777496,
        -0.09927097707986832,
        0.0016300217248499393,
        0.02309775911271572,
        -0.07413602620363235,
        -0.05379704758524895,
        0.04225650429725647,
        -0.08761601150035858,
        -0.012461106292903423,
        0.04259482026100159,
        0.08177684992551804,
        -0.019118374213576317,
        -0.03647078573703766,
        0.06520464271306992,
        -0.04693356156349182,
        -0.006946156267076731,
        -0.05340620130300522,
        -0.09204331785440445,
        0.03816058486700058,
        0.03812277689576149,
        0.0038033826276659966,
        -0.08856382220983505,
        -0.0708661824464798,
        -0.01048486027866602,
        0.03269176185131073,
        -0.019688241183757782,
        -0.037258002907037735,
        0.003255675081163645,
        -0.09538670629262924,
        -0.005388866178691387,
        0.08626114577054977,
        0.04462099447846413,
        -0.01399313285946846,
        0.022312289103865623,
        0.0814884603023529,
        0.017209120094776154,
        -0.008308733813464642,
        0.009087294340133667,
        0.0023796872701495886,
        0.05517591908574104,
        0.04147493466734886,
        0.09540043771266937,
        -0.07615029066801071,
        0.031490255147218704,
        0.09350750595331192
    ]
}