{
    "id": "HJYqgZDmsZo",
    "title": "Galaxy S9 Durability Test! - Upgraded Aluminum?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-03-10T14:30:00Z",
    "video_url": "https://www.youtube.com/watch?v=HJYqgZDmsZo",
    "category": "Howto & Style",
    "tags": [
        "Galaxy S9",
        "Galaxy s9 plus",
        "samsung galaxy s9",
        "s9",
        "android",
        "smartphone",
        "iphone",
        "tech",
        "technology",
        "mobile phone",
        "variable aperature",
        "jerryrigeverything",
        "Scratch test",
        "bend test",
        "burn test",
        "durability test",
        "how durable is the S9",
        "Tested",
        "review",
        "unboxing",
        "hands on",
        "impressions"
    ],
    "views": 3065816,
    "likes": 58847,
    "comments_count": 5503,
    "description": "Galaxy S9 dbrand Skins are HERE:  Samsung has released their newest flagship, the Galaxy S9 and the Galaxy S9 Plus. This time... things are a bit different. New dual cameras fill up the Galaxy S9+ and variable aperture lenses cover the sensor inside the phones. Pretty impressive hardware. And that is what we are here to test. How durable is the Galaxy S9?   With new aluminum and thicker glass we are already off to a good start while testing the Galaxy S9. The scratch test is first, followed by a series of other tests including a flame test and a bend test. Bend testing the Galaxy S9 is the ultimate test of structural durability. Hopefully it survives...   Fix your Galaxy with repair guides and parts from iFixit!:   Galaxy S9 Teardown video HERE:   Current Galaxy S9 Pricing on Amazon:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://dbrand.com/jerryrig-s9",
        "https://ifix.gd/2zMN4Xf",
        "https://youtu.be/Y9UulQbxSYs",
        "https://amzn.to/32tYviZ",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Galaxy S9 and the Galaxy S9 Plus are here, and it's finally time for the hands on experience you've all been waiting for. Samsung has basically kept the same build style as last year...and the year before...and the year before that. And they have never really failed a durability test yet so it's working for them. But it's time to see what happens with this new Galaxy S9. Let's get started. [Intro] The Galaxy S9 is still rocking the Gorilla Glass 5 on the screen this year, but this time the glass is a bit thicker which is supposedly going to help with drop protection. I'll have the drop test in a future video, but as of now we're still scoring the same on the scratch test as other flagships. It'll scratch at a level 6 and a deeper groove at a level 7. HTC is still holding that top spot with their scratch resistant sapphire crystal display, scratching at a level 8. Tempered glass is pretty normal for smartphones these days. At least razor blades, coins and keys won't do any damage. The bottom of the phone has digital buttons underneath that glass so nothing new to check down here. The earpiece is sitting flush and tight inside it's little slot. It is metal with little holes protecting it from dirt and metal shavings attracted to that magnet underneath. It's a smart design and better than some of the cloth ones we've seen before on other phones. The 8 megapixel front facing camera is sitting under the front glass and protected from scratches. The sides of the phone come with a thin plastic covering protecting that painted surface underneath. I'll peel that off so we can get some adequate....verification of material. [Scratching sounds.] Yeah, it's metal. One cool thing about this phone is that Samsung has upgraded the aluminum so it is more scratch and impact resistant. This has added about 8 grams of weight to the phone since the glass is a bit thicker too. But in my mind weight is associated with quality so I'm fine with these upgraded materials. The SD card slot up top is upgraded to hold an impressive 400 gigabytes of whatever you need that many gigabytes for. It's nice to have more features than you could ever need on a phone. All the buttons are made from metal...and oh! Samsung took that dedicated Bixby button that nobody wants and upgraded it to version 2.0. So that's cool. Down here at the bottom of the phone we have the USB-C slot, as well as the headphone jack, which makes the S9 definite daily driver material. I don't use a 3.5 jack often, but it's incredibly nice to have on the phone when I do need it. The camera on the back of the phone is where we start to see some pretty significant improvements over the Galaxy S8, which I'll get to more in a second. This 12 megapixel sensor is still protected by glass, and thankfully the fingerprint scanner is now below the camera in a much more reachable location. Thumbs up for that Samsung. The fingerprint scanner can get scratched by my razor blade though, so we'll give it a little test to see if it still works. And even with that much damage to the surface, it still functions like a champ. Pretty solid. Now let's see what that camera can do. One thing Samsung did add this year is something called the AR emoji which makes a little resemblance of yourself and sticks it on screen. It's pretty similar to Animoji that we saw on the iPhone X. But if you look closely at my lips, one follows a lot closer than the other one does. Fun fact, you can change different hairstyles, and in real life, back in high school, my hair looked a lot more like this. No joke. If you scroll back far enough on my Instagram you can probably see a couple more pictures. Long story short, if you're into animated characters, iPhone's probably going to be the way to go the lips actually work. So dbrand did say they were going to send me some new skins to show off in this video. I haven't seen them yet though, so I'll just leave a link down in the video description. You can check out their new selection so you can hide the fingerprints on the back of this glass sandwich. Thank you dbrand for sponsoring this video, and I'll let you know if your camo skins ever show up. The feature that impresses me the more with this Galaxy S9 is the rear camera. This is the first smartphone camera with a dual aperture sensor inside. It's got a mechanical system that can expand and contract to let more light hit the sensor. Professional camera lenses have this and it's incredibly cool to see it start making it's way into the smartphone world. Better pictures for everyone to enjoy. We'll have to take a look at this from the inside during the teardown. The larger S9 Plus also adds a telephoto lens to the phone, which is impressive. Here I'm adjusting the aperture manually in Pro mode. You can see the light difference as I jump from a 1.5 to a 2.4. The 1.5 will help considerably in low light situations. The back glass of the Galaxy S9 makes Art Class with Jerry impossible. The Samsung logo is still on the underside of the glass and won't ever scratch or run off...well, unless you want a clear S9 of course. Let me know in the comments if I should turn this phone transparent. It's time for the burn test. Bixby 2.0 is already getting in the way, so I'll just roast him for a second. This HDR 101440p 5.8 inch super AMOLED display lasted 12 seconds before the pixels started to go white. After I removed the flame, the pixels did start to recover which doesn't always happen with LED displays. The oleophobic coating though, never survives the burn test. You can see my fingerprints still on the surface of the glass, so it's important not to try this at home. It's cool to see the Samsung screen recover though, even though the only person who probably ever deals with this kind of damage is me. And now the bend test. Samsung has never failed my durability test before, and with this upgraded aluminum frame, the results are consistent, surviving both flexes from the front and the back. With the Galaxy S7 a few years ago, we had some glass separation during the bend which compromised the water proofing. But with the Galaxy S9, even with the abuse, the glass is still sealed and the ip68 rating is intact. Another solidly built phone from Samsung and a good choice for anyone looking to upgrade. I've personally been using the S8 Plus for the past year, and while this new phone is indeed tempting, it's not enough for me to switch my stuff over. I'll probably hold off and see if the next Note has anything worth switching for, or maybe I'll jump ship entirely and use another Android phone from a different company. Let's just see what 2018 brings. Huge thanks again to dbrand for sponsoring this video. The camouflage skins are pretty sneaky. Check the link in the description to see all their new stuff, and then come hang out with me on Instagram. Maybe I'll post some more old school hair pictures. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "phone",
        "Glass",
        "Galaxy",
        "Samsung",
        "test",
        "hands on experience",
        "camera",
        "year",
        "back",
        "scratch",
        "time",
        "finally time",
        "upgraded",
        "pretty",
        "video",
        "Gorilla Glass",
        "metal",
        "cool",
        "back glass",
        "level"
    ],
    "transcript_entity_values": [
        "HTC",
        "2.0",
        "3.5",
        "12 seconds",
        "8 megapixel",
        "iPhone",
        "Bixby 2.0",
        "ip68",
        "6",
        "8",
        "the year before",
        "2.4",
        "SD",
        "Instagram",
        "the S8 Plus",
        "400 gigabytes",
        "jack",
        "Jerry",
        "The Galaxy S9",
        "Galaxy S9",
        "S9",
        "12 megapixel",
        "1.5",
        "the past year",
        "this year",
        "the AR emoji",
        "daily",
        "about 8 grams",
        "a few years ago",
        "2018",
        "last year",
        "second",
        "first",
        "the Galaxy S7",
        "Samsung",
        "these days",
        "Android",
        "Animoji",
        "One",
        "Bixby",
        "the Galaxy S9",
        "the Galaxy S8",
        "this Galaxy S9",
        "101440p 5.8 inch",
        "7",
        "S9 Plus"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "LAW",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "FAC",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.15087860822677612,
        0.03541353717446327,
        0.09135062247514725,
        -0.03937768563628197,
        0.06519044190645218,
        -0.03599357604980469,
        0.019957633689045906,
        0.1070433035492897,
        -0.14578129351139069,
        -0.026692163199186325,
        -0.006153280381113291,
        0.002434302121400833,
        -0.012555296532809734,
        0.051431454718112946,
        0.031137553974986076,
        -0.07811447232961655,
        0.024853350594639778,
        -0.06932426244020462,
        -0.03803281858563423,
        0.06313803046941757,
        0.019233785569667816,
        0.02068248763680458,
        0.002953506773337722,
        -0.034037284553050995,
        0.06084072217345238,
        0.033492159098386765,
        -0.017403345555067062,
        -0.006782691925764084,
        -0.050320763140916824,
        -0.04333052411675453,
        0.03896968811750412,
        0.07393096387386322,
        -0.13447627425193787,
        0.10427737981081009,
        0.019246863201260567,
        -0.12207408249378204,
        0.0018241859506815672,
        0.0061256461776793,
        -0.031123502179980278,
        -0.04228096455335617,
        -0.09211266040802002,
        0.013280701823532581,
        0.03951045498251915,
        -0.0077681830152869225,
        0.06012086942791939,
        -0.05934111773967743,
        0.14627918601036072,
        -0.034499894827604294,
        0.0049042971804738045,
        0.03485378250479698,
        -0.023168979212641716,
        -0.01688547059893608,
        0.055768441408872604,
        -0.023572660982608795,
        0.004155520349740982,
        -0.0066068428568542,
        0.00369256641715765,
        -0.05929935723543167,
        0.038876503705978394,
        -0.08341577649116516,
        0.1085616946220398,
        -0.08613618463277817,
        -0.0032650199718773365,
        0.07808716595172882,
        0.028877941891551018,
        0.02108573727309704,
        0.05422757938504219,
        -0.10833712667226791,
        0.03161289170384407,
        -0.0018773599294945598,
        0.01928100176155567,
        0.006232207641005516,
        -0.024460341781377792,
        0.007698510307818651,
        0.022683868184685707,
        0.07446573674678802,
        0.04869316890835762,
        -0.05285673961043358,
        -0.05599677562713623,
        0.034562550485134125,
        0.01585567742586136,
        -0.008195423521101475,
        -0.027938777580857277,
        0.046522147953510284,
        0.0013715737732127309,
        -0.016411662101745605,
        0.025738511234521866,
        0.05585167184472084,
        -0.060415562242269516,
        0.009708967059850693,
        0.06324446946382523,
        0.10659129172563553,
        -0.09633862972259521,
        -0.014345330186188221,
        -0.01664837636053562,
        -0.002034659031778574,
        -0.10028485208749771,
        -0.07746101170778275,
        -0.033209241926670074,
        0.05491189658641815,
        0.02109404094517231,
        -0.01540444791316986,
        0.039626725018024445,
        0.025972915813326836,
        0.0499892458319664,
        -0.0035193613730371,
        -0.025486623868346214,
        0.011193600483238697,
        -0.029995111748576164,
        -0.03179103136062622,
        0.00842998269945383,
        0.021702278405427933,
        -0.03910098597407341,
        0.022071778774261475,
        -0.020428767427802086,
        -0.06968504935503006,
        -0.02285749837756157,
        0.018489645794034004,
        -0.02883090078830719,
        0.05998105928301811,
        0.021599197760224342,
        -0.00026813376462087035,
        -0.037039369344711304,
        -0.022478917613625526,
        0.04907293617725372,
        0.023431528359651566,
        -0.08174474537372589,
        2.4302440205258676e-33,
        0.01574106514453888,
        0.07146888226270676,
        -0.005513377487659454,
        -0.026699675247073174,
        -0.027826135978102684,
        0.01176092866808176,
        -0.013749878853559494,
        0.1288011372089386,
        -0.09643469005823135,
        0.033977437764406204,
        -0.033814217895269394,
        0.018688330426812172,
        -0.06641126424074173,
        -0.023826221004128456,
        0.050841666758060455,
        -0.02939300611615181,
        -0.024331767112016678,
        -0.035875070840120316,
        -0.0900057926774025,
        -0.007208281196653843,
        -0.05918453261256218,
        -0.02007753774523735,
        0.028127288445830345,
        0.010872713290154934,
        0.07087908685207367,
        0.05313954874873161,
        0.10704581439495087,
        0.022750673815608025,
        -0.002925090491771698,
        0.025023598223924637,
        -0.07080718874931335,
        0.03655650094151497,
        -0.0019282610155642033,
        0.021683799102902412,
        -0.037953391671180725,
        0.031715258955955505,
        -0.01714605838060379,
        -0.03797483816742897,
        -0.0040647899731993675,
        -0.03876471146941185,
        -0.05331198871135712,
        0.07633895426988602,
        0.042259275913238525,
        0.007378235924988985,
        0.0832093209028244,
        -0.03433525562286377,
        -0.08263226598501205,
        0.04244018718600273,
        -0.030588844791054726,
        -0.023020673543214798,
        0.00251939264126122,
        -0.030317144468426704,
        0.030863700434565544,
        0.029297927394509315,
        -0.1032274067401886,
        0.04204407334327698,
        0.0389726497232914,
        -0.0321778804063797,
        -0.0015712397871538997,
        0.09052172303199768,
        0.0317007340490818,
        -0.046448349952697754,
        -0.08860910683870316,
        0.03190680220723152,
        -0.02253681980073452,
        0.03897685185074806,
        0.01733054593205452,
        0.0518055185675621,
        -0.013325821608304977,
        -0.056999050080776215,
        0.005026006139814854,
        -0.07085654884576797,
        0.042284753173589706,
        0.024779507890343666,
        0.012487244792282581,
        0.04214073717594147,
        0.014210490509867668,
        0.020728912204504013,
        0.046475600451231,
        -0.0382506363093853,
        -0.028026366606354713,
        0.02013266831636429,
        0.08500371128320694,
        -0.031933341175317764,
        -0.060619667172431946,
        -0.0439067967236042,
        1.7941069017979316e-05,
        -0.07734394073486328,
        0.04678754881024361,
        -0.0035130325704813004,
        0.028434578329324722,
        -0.021887240931391716,
        0.013846047222614288,
        -0.04322360083460808,
        -0.021435430273413658,
        -2.8113290034868836e-33,
        -0.004882641136646271,
        -0.04384361580014229,
        -0.01274042297154665,
        0.02213689498603344,
        0.020903034135699272,
        -0.06935492157936096,
        0.026152191683650017,
        0.08478476852178574,
        -0.02683791145682335,
        -0.06956006586551666,
        0.023042431101202965,
        0.011619015596807003,
        -0.026557305827736855,
        -0.10437963157892227,
        -0.05520946905016899,
        -0.03581499308347702,
        -0.011981402523815632,
        -0.07802142947912216,
        0.031589582562446594,
        0.0002501413400750607,
        0.07625171542167664,
        0.10359224677085876,
        0.04972025379538536,
        0.005136743187904358,
        -0.033446189016103745,
        -0.006189689505845308,
        -0.011747343465685844,
        -0.014811378903687,
        0.029246797785162926,
        0.03200643137097359,
        0.01973135583102703,
        -0.025306880474090576,
        -0.0383099801838398,
        0.05270199477672577,
        0.03334202617406845,
        0.025326024740934372,
        0.06874643266201019,
        -0.009133799001574516,
        0.0494067445397377,
        -0.08384376019239426,
        0.11264229565858841,
        0.11740228533744812,
        -0.02502138540148735,
        -0.032798245549201965,
        0.044427987188100815,
        -0.044164061546325684,
        0.023632051423192024,
        0.03643225133419037,
        -0.01515185832977295,
        0.005020915064960718,
        0.031043514609336853,
        -0.03126589581370354,
        0.012505872175097466,
        0.023994293063879013,
        0.030700774863362312,
        0.033435918390750885,
        0.0703931376338005,
        -0.08285272121429443,
        -0.034972939640283585,
        0.01979677379131317,
        0.052136894315481186,
        0.0870080515742302,
        -0.022658731788396835,
        -0.03967032581567764,
        -0.03057468868792057,
        -0.08086313307285309,
        0.05012907832860947,
        0.0290647242218256,
        0.03421972692012787,
        -0.048437800258398056,
        -0.000268022675300017,
        0.004645854700356722,
        -0.04930906742811203,
        -0.05603671446442604,
        0.098923459649086,
        0.05095983296632767,
        -0.07961151003837585,
        -0.03991932049393654,
        0.012570426799356937,
        0.005141381174325943,
        0.024721205234527588,
        -0.04986017942428589,
        0.014726386405527592,
        0.07317261397838593,
        0.10514429956674576,
        0.001415907870978117,
        -0.003796617966145277,
        0.06682565808296204,
        0.03151746094226837,
        0.03897566720843315,
        -0.11118919402360916,
        0.023932984098792076,
        -0.02017691731452942,
        0.039303578436374664,
        -0.05632273852825165,
        -4.582334156566503e-08,
        0.01909560337662697,
        0.02007870376110077,
        0.021653909236192703,
        0.02775995060801506,
        -0.016252512112259865,
        -0.028122957795858383,
        0.03077360801398754,
        -0.015665017068386078,
        0.0393938347697258,
        -0.09854279458522797,
        -0.008638784289360046,
        -0.07146884500980377,
        -0.06135242432355881,
        0.03742837905883789,
        -0.04310408607125282,
        0.01950775645673275,
        -0.002566564828157425,
        0.07652978599071503,
        -0.026149816811084747,
        0.015777399763464928,
        -0.09690332412719727,
        0.028499023988842964,
        0.10164698958396912,
        -0.005652435589581728,
        -0.0310581736266613,
        0.09687138348817825,
        -0.1369316279888153,
        0.03470603749155998,
        0.06548628211021423,
        0.05016694217920303,
        -0.012555360794067383,
        -0.050981905311346054,
        -0.031834326684474945,
        -0.021372303366661072,
        -0.01945740357041359,
        -0.08530748635530472,
        -0.01608387939631939,
        0.0340452715754509,
        0.11114967614412308,
        0.05542806163430214,
        -0.005622543394565582,
        -0.035018377006053925,
        -0.006041421554982662,
        0.03772971034049988,
        -0.010281904600560665,
        -0.08429203927516937,
        0.00382590782828629,
        -0.05766706168651581,
        -0.05619431659579277,
        -0.007080079987645149,
        0.05571683123707771,
        -0.04427370801568031,
        -0.1291871964931488,
        -0.010356881655752659,
        -0.00530971260741353,
        -0.0515386238694191,
        0.08632750064134598,
        0.008161705918610096,
        -0.03832158446311951,
        0.03885192051529884,
        0.05760619044303894,
        -0.0870615690946579,
        -0.02143879421055317,
        0.057640984654426575
    ]
}