{
    "id": "hlQDl6g5BhA",
    "title": "Fixing a Viewer's BROKEN Gaming PC? - Fix or Flop S4:E3",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2023-05-17T14:43:03Z",
    "video_url": "https://www.youtube.com/watch?v=hlQDl6g5BhA",
    "category": "Science & Technology",
    "tags": [
        "fix or flop",
        "computer repair",
        "fix",
        "broken",
        "broken gaming pc",
        "viewer pc",
        "fixing a viewer's broken gaming pc",
        "fof",
        "broken pc",
        "dead pc",
        "dead computer",
        "computer",
        "pc",
        "gaming",
        "gaming pc",
        "greg salazar fix or flop",
        "pc no post",
        "how to troubleshoot",
        "how to",
        "greg salazar",
        "broken computer",
        "how to fix a pc",
        "how to fix a computer",
        "fix or flop season 4",
        "computer troubleshooting",
        "computer wont turn on",
        "no post",
        "Computer doesn't post"
    ],
    "views": 209143,
    "likes": 10916,
    "comments_count": 753,
    "description": "SPONSORS: Shop VIP-SCDKey OEM Windows 10 Pro keys for $16 and use code 'SKGS' for a 25% discount:   Shop be quiet! Light Wings fans:   Welcome to Fix or Flop! We're up to Season 4, Episode 3. This viewer's gaming PC doesn't POST! Is this something we can fix? By the way, if you live in the Orlando, FL area and have an issue with your PC, apply to have it (possibly) fixed for free today!   Check out other Fix or Flop episodes in this playlist:    Consider supporting us on Patreon!    My troubleshooting gear: FLIR C5 Thermal Camera:  Skybasic Digital Microscope:  YIHUA Soldering Station:  Helping Hand Soldering Board:  Xool 80 Precision Tool Set:  PassMark Inline PSU Tester:    My cleaning gear:  SYINE Respirator Mask:  Scott Shop Towels:  Electric Air Duster:  ONSON Cordless Vacuum:  Medical Grade 99.9% Isopropyl Alcohol:  Q-tips Cotton Swabs:  Xool 80 Precision Tool Set:  Hizek Black Disposable Gloves:    My studio gear: Sony a6600 (Primary):  Sony a6400 (Secondary):  2x Pixio PX277 Prime 165Hz IPS Monitors:  Neewer LED Lighting Kit:  Audio-Technica AT2035:  Yamaha MG10XU Mixer:  Neewer Microphone Arms:  Arrowzoom Sound-Damping Foam Panels:    Follow me on social media: TWITCH:  FACEBOOK:  TWITTER:  INSTAGRAM:    Join our public Discord server:   DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our Rakuten account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.  #FixOrFlop",
    "description_links": [
        "https://bit.ly/Win10SKGS",
        "https://geni.us/USaRA",
        "https://gregsalazar.com/fix-or-flop",
        "https://youtube.com/playlist?list=PLyReHG5dDxXXSgTLdfvdzJpFei941MX6H",
        "https://www.patreon.com/gregsalazar",
        "https://geni.us/3ALEI",
        "https://geni.us/6zurf",
        "https://geni.us/DbjS",
        "https://geni.us/7DDrL",
        "https://geni.us/1IfxDSw",
        "https://bit.ly/3BoBHoQ",
        "https://geni.us/V4uA",
        "https://geni.us/rIy5O6Y",
        "https://geni.us/RALt4",
        "https://geni.us/aABrFWE",
        "https://geni.us/tBVQ",
        "https://geni.us/nQhVVQm",
        "https://geni.us/1IfxDSw",
        "https://geni.us/MBCJaf",
        "https://geni.us/k8VBToq",
        "https://geni.us/24nqw",
        "https://geni.us/bCg4nD",
        "http://geni.us/9VTXr0",
        "http://geni.us/xvQc",
        "http://geni.us/d4VvGM",
        "http://geni.us/1w5Sx2Y",
        "http://geni.us/EKFxZc",
        "http://www.twitch.tv/GregSalazar",
        "http://www.facebook.com/GregSalazarYT",
        "http://www.twitter.com/GregSalazarYT",
        "http://www.instagram.com/GregSalazarYT",
        "https://discord.gg/jYA9Xvp"
    ],
    "transcript": "This is my brand new PC that I built myself. This is my first time building a PC. I got it to POST a picture once and also install Windows on it. But when I did that, I noticed the fans in the cooler weren't on. So I messed with it to fix that problem. But in doing so, now I can only get it to POST a picture on my monitor after I clear the CMOS, but it will only go into the BIOS. And after I save and exit the BIOS, it won't POST a picture to the monitor. I need your help, please. I would like to get this PC up and running. I do believe I did something to it, but I'm not 100% sure. This here is that viewer's rig, and we're going to try to fix it in this video. Hey there, and welcome to Fix or Flop. Pertinent info is in the video description. Just know that everything you see us do here is free of charge, and it's because of your viewership and support from manufacturers and components like the ones you see in this rig that we're able to keep doing what we're doing for $0.00 to the viewer, including replacing parts, which often happens, I've found in this playlist. All right, so we're going to jump to the ad, and then we'll get straight into the troubleshooting. We're going to power this thing on and attempt to replicate the issue described by the owner. Are you ready? Stay with me. To get rid of that annoying Windows activation watermark, head on over to VIP SCD Key. Purchase a Windows 10 Pro OEM key for a fraction of the price of retail. Just use a secure payment method like PayPal, enter your product key into your PC settings window and say bye-bye to the watermark. And be sure to use our offer code SKGS for a so-weet discount. Now, in case you're wondering, basic specs of this rig include a beefy RTX 3090 Zotac graphics card. I sincerely hope this is not the reason why the system isn't posting or booting into Windows. It does actually sound like the rig is getting into the BIOS, so that would be a POST. But it's not wanting to load into Windows, which could be a drive issue or potentially just a failed install of the OS. It looks like we have an Intel platform as well. Really like the white aesthetic in this Lian Li case. Maybe 32 or 64 gigs of DDR4 or 5. I, we changed on the form. Now we're requiring, we're making it a mandatory, uh, thing to list specifications. So I know ahead of time what I'm getting into, uh, but this is either a 12th or 13th gen CPU in here from Intel. And I believe it's a higher end one as well. He spent a lot of money on this and it's a shame it hasn't worked right out of the gate. First things first, let's try to get this rig to power on and see if we can get into windows. Again, I think that's going to be our problem is getting into windows, but where's the, there's the power button. But, you know, these things are kind of, I don't know, the symptoms can be fickle, especially when we're worrying about software and what was or wasn't loaded onto the drive. It sounds like this person did successfully install Windows at one point, but we'll see. So right now it looks like we're not getting a post at all. Does this board have debug LEDs? Yes, it does. We have the DRAM LED lit right now. That's great. That is not good. Thank you. Now, don't be fooled by these LEDs. Just because our RAM appears to be receiving power at the surface, it doesn't mean that they're slotted all the way in. Also, this DRAM LED doesn't necessarily mean that there's a problem with DRAM, as we've seen time and time again in this playlist. Sometimes, debug LEDs come in very handy. And other times, they lead us down rabbit holes that go nowhere. And you just spend a bunch of time troubleshooting something that was never the problem to begin with. Now if you notice, this far left DIMM is being shoved to the right. And it's so exaggerated here that the DIMMs appear to be sitting unevenly, even though the spacing of the slots is fairly even in this board. It's because of this thick cable right here leading from the AIO. A lot of these AIO designers don't really think about the hindrances of cable stemming from the blocks. when it comes to DRAM placement or heat sink placement around the socket, and it's just super annoying. It's just a lazy approach. Just not a good place at all to have this. I recommend maybe rotating the block another 90 degrees, which we can do here, and don't be worried about having a crooked... logo because you can rotate this thing all the way around. So at least NZXT thought of that, but this is something we will definitely address. I don't think it's the reason why the system's not posting, but what I'm going to do next is remove three of these four DIMMs and see if we can get a post, then I'll try clearing the CMOS. Hey, and would you look at that? That's a green boot LED. And not joking, folks, that there is a post. That was pretty effortless. So what I'm going to do now is add DIMMs back to the rig, single stick by single stick, up until we get to that last innermost left slot. I do think, at this point, that we're just having an issue with contact because of how pressed against the module the cables are here from this unit. Which, again, would be a quick fix. We could just rotate the block another 90 degrees and have the cable stem out maybe the left side, or maybe have them stem down here. We'll cross that bridge when we come to it. But for now, let's keep adding modules back to the rig until it fails. So here's two DIMMs. You can see the DRAM light is illuminated currently, but then that disappears. The VGA light should pop up. It's a white LED. Any second now, there it is. And then that'll quickly pivot to the green boot LED. There it goes. And I know you can't see this on camera, but we do have a post on our portable monitor. So two modules is A-OK. This also indicates to me that both memory channels are functioning properly, since at this point we do have two separate sticks and two separate modules. Usually it's A2 and B2 to start. So doesn't look like a CPU issue, doesn't look like a motherboard issue. Again, I think it's just the pressure that one of these DIMMs was receiving from that AIO. I know this one looks super awkward, but with three DIMMs installed, we still get a POST. So what I'm going to do now is install the fourth module, but remove these cables stemming from the AIO so that there's no pressure on the DIMM. We'll see if we get a POST there. These cables, by the way, are not crucial or vital for the POST process. And there we go we get our post with all four DIMMs in so I don't think we have a problem with memory or the board or the CPU in that sense and I think this was the reason why he wasn't getting a post consistently. Now the other issue is Windows and we'll check that in a second. Also I don't want to keep this running too long because well the pump's off so we don't want the CPU getting too hot. Now, I was in the middle of trying to rotate this block around just so that the cables are out of the way of the DIMMs. The problem is, if we rotate it this way so it'd be counterclockwise from the position he originally had it, you can see these tubes now are literally blocking the first and innermost DIMM slot. That's no good. Let's rotate it the other way then, shall we? Let's put the tubes up top. That shouldn't be a problem. Well, I can't even fit the block all the way in now because the tubes are hitting this uppermost heatsink. and then you think, okay, well let's just completely rotate it 180 degrees. Same issue. We got tubes hitting this heatsink slash shield here. This is a very annoying design. I'm not sure why Asus thought it'd be okay to put stuff this close to the holes in the board for cooler mounting. There's just not enough clearance here for a conventional AIO with tube sticking out of it. I just, I hate this so much. I can't even set the block diagonally on the mounting bracket because, well, despite us being able to rotate this kind of however we want, the tubes end up blocking one of the four thumb screws to tighten the whole block down. It's just, you can't win here. So I've had no choice but to go back to the original setup, but I've just tried my best to wedge those cables as far left as possible to keep this left dim free. You can see the dim still sways a bit to the right. It's not necessarily this thinner cable down here, which is actually multiple cables kind of routed together, but it's this thicker micro USB cable. I really hate the fact that there's a micro USB cable, like a literal physical micro USB connector stemming from this block. That to me is also really dumb, but we have to work with what we have. I have tried bending this as much as I can without compromising the integrity of the cable, but I think the long-term solution here would be to connect a 90 degree micro USB cable. I don't have one of those around because remember the other side of this cable is a USB 2.0 connector for a motherboard So we'll see what we can do in the long run. I think now though we're gonna be okay All this RAM is seated very very very well I just forced them into the slots made sure nothing's being dislodged or pushed out and we're gonna try for another post Let's see what happens power on at the rear power on up front All modules have lit up, the pump is working, and should be getting a post any second now. Yes, okay, there we go. In the short run, at least, we've fixed that issue. Still frustrated with it, but it is what it is. There's not much more we can really do with what we have at our disposal here. The next thing we're going to try to do is boot into Windows. I'm going to check in the BIOS first to see if there's even a boot partition. If there's not, then we know that's probably a corrupt install, or maybe Windows just wasn't installed to begin with, and the viewer thought it was. Something else we can do for an off-key. Though I don't think this is the reason why the system would give us these issues is update the BIOS This one's a bit old. Then again, this might be the latest revision. Maybe just hasn't been updated since it was that July or so Let's check boot. And yeah, not seeing any any partition at all here. I'm not even seeing any drive. I'm going to enable CSM. In this case, we're going to all the boot devices, UEFI or legacy. We'll just select UEFI only. And then we're going to go to save changes and reset. And let's see now if anything happens 12 seconds later. We're still getting issues. You can see we don't have a SATA device connected, which is why I was led to believe we just have an M.2 boot device in here. And for the amount of money this person supposedly paid, it would make sense that they went with an M.2 option, preferably NVMe. The problem is over here, pardon the glare, it says that no NVMe device is found. So where do we go from here? It's possible, maybe we have a conflict with the PCIe generation, I'm going to force Gen 3. Again, I'm just shooting in the dark here, the software is not my strong suit, these sorts of boot issues are just hit or miss often times in my experience, but I'm trying everything I can in my arsenal. I suppose it would help to actually see what drive we're dealing with in person. This is a 970 Evo Plus, which I believe is a Gen 3 drive, and normally having the M.2 slot set to Gen 4, just auto, won't affect the stability of a Gen 3 drive, but again, that was one of the reasons why I wanted to fiddle with it a bit. Still didn't work. Physically, this drive looks okay. I think the only other option we have here is just to try a different slot. If we can't get it to be detected then, I'm just going to maybe try updating the BIOS. There might be an issue with this particular BIOS revision that's preventing it from seeing certain NVMEs. I can't even get this drive to show up in Windows boot media. If I'm trying to install Windows, it's not even showing that a drive is connected to the system. That's a big problem, and again, I've tried multiple BIOS configs, I've tried multiple M.2 slots, CSM enabled vs. disabled, Windows UEFI, other OS, it's just... I'm not sure what else I can do here beyond update the BIOS. And while this is happening, make sure you don't power off your system, that would result in a pretty bad time. And remember, we don't actually know for sure if Windows is even on this drive. If it isn't, not a big deal. We can install it, hopefully, now that the BIOS detects NVMEs. But if it is, it'll boot straight into Windows right away, and our job is mostly done. So this is a good sign. You can see it's attempting to load into Windows. This usually means it's bypassed all the checks, and everything looks good. But there's a problem, you'll see pop up here in a second. It's happened multiple times, no matter what I do, it just keeps throwing this particular BSOD. 3, 2, 1. 1. 1 0 there it is and it says inaccessible boot device It's always the same code this either means in my experience The the m.2 physically is bad or there's a corrupt Volume on the drive. I'm hoping it's the latter because that'd be very easy to fix again There's nothing important on this drive from what I'm told it just had Windows installed by the time it started acting up So let's try booting into our media creation tool here and seeing if we can reflash Windows a few moments later Wait a minute. What what? What is this what is this I can't even Okay Okay, back to the BIOS again to change some settings to hopefully get this stupid drive to show up again. See, what's really confusing is that the BIOS shows us there's a Windows Boot Manager loaded onto this Samsung SSD, which tells us there was at least an attempt to install Windows on this drive. Uh, the issue though, of course, we just saw, is that... I can't actually see the drive when attempting to install Windows through the boot tool. That's a big problem. So let's fiddle around with some other boot settings in the BIOS and try this again. But we keep getting the same prompt, inaccessible boot device. It's just so dang frustrating. So here's what's going to happen, folks. Let me get the camera off the tripod here and talk to you face to face. Flip the screen around so I can see where I'm pointing this thing, and then brighten up the screen a bit, because holy cow, that's dark. Okay, I think his drive is toast at this point, even if it's not, I'm just, I've wasted so much time trying to just get this thing to even... work, that I'm ready to call it. Yeah, again, my time at this point is, I think, more valuable than the cost of a replacement NVMe, and this one's not, like, super expensive or anything. So, we're going to throw a new drive in there for me. It's a two terabyte in here. I'm going to try to match that with something I have on hand. So, yeah, really bummed by this, but hopefully this replacement here, this is a brand new MP600 Pro NH from Corsair. Again, same two terabyte capacity, and I think this is also Gen 4 speeds. Yeah, definitely Gen 4 speeds, you can see there at the bottom. So, Hopefully being brand new, we'll just be plug and play and we won't have the same issues we had with the Samsung SSD, not entirely sure what was wrong with it, but if we have any further issues with this one, we'll know that it's not the drive in question, but likely the motherboard, which I don't want to have to replace because I don't have a whiteboard to match his case, so I'll have to order one. But wouldn't you know it, we still got a problem. I'm getting so tired of this. We don't see either drive in the Windows tool for installing, but we can see both drives here in the BIOS. Again, I've checked and unchecked every single boot setting in this BIOS. I have no idea what's going on. I've never run into, frankly, something this stubborn. All right, well, this is something I've never had to do before, install Intel RST drivers in order to get the NVMEs to even be detected by this Windows boot USB. Let's give it a shot, see... if this fixes it. I doubt it's going to, but I really have no other choice here. I've tried everything I can think of apart from just replacing the motherboard. Hey! Wow! Wow! That's really what it took. I've got to say, that's the first time that's ever worked for me, or that I've ever even had to get to this point, I should say. That is incredible. Okay, so here we go. So we can see his original drive is Drive 2, and he does have Windows installed. It looks like a Windows partition is on here. And then we have drive 3, which is unallocated. And that is a 2 terabyte NVMe I just connected that is from Corsair. So I'm going to try wiping his drive first and reinstalling Windows, because that was our issue to begin with was we got those recurring blue screens of death. I think it was just a corrupt OS. So we'll do that. If this still doesn't work, then we'll move on to my drive, which I think is going to work out of the box since it's brand new. So let's let Windows do its thing and cross our fingers. This is a good sign here. It's just getting things ready, which means that, well, it's at least successfully installed. Should be seeing a blue screen here soon. Not not the bad kind of blue screen, not the one we were seeing before. Come on. Any second now. Yes. I cannot tell you how excited this makes me because you can probably tell in the previous clips I was getting very frustrated and just spent so much time on this, almost four and a half hours trying to figure out why either the drive wasn't booting into Windows or our Windows bootable USB wasn't detecting the drives. It's just like one big... loop, and while it looks stable now, I'm going to leave this running for about 30 minutes or so, and we'll call it. I'm not going to run through and redo the setup, because if it was going to blue screen, it would have blue screened before it even got to this page, which we could never get to to begin with anyway. I'm going to remove the replacement drive I had on hand for him. This was an MP600 Pro NH. It was also a 2TB drive. This was Gen 4. But of course, if his drive works, there's no need to do that. There's one more thing I want to do. Apart from cable management just a tad, I noticed that he had one of his cables at the rear disconnected. It was actually a SATA power cable. It turns out that's for the case lighting. So I went ahead and connected that for him. And then also, I want to add a few more fans to this case. because these Li and Li cases tend to perform well when you have additional fans shoving in air. So I've got six extra fans from Be Quiet that I think are going to be the icing on the cake for this rig. These are Be Quiet Lightwings fans. These are 120s, they're PWM, and of course they have beautiful integrated RGBs. These are addressable, so you can do really cool effects with them, and you can either daisy chain them or use the included hub if you buy the triple pack here. We actually have two of these packs. So we're going to load him up with some pretty sweet be quiet fans. If you want to learn more about these light wings fans, we're going to have them linked below, but I'm excited to show you what they look like in his rig. Yes, they're black, not white, but he does have some black components in his rig, including the graphics card. So I think these will actually offset all of the white components quite nicely. So we're going to install three of these along the bottom set to intakes. I'm gonna have to move some cables out of the way for sure, but you get the idea for now. All right, and this is the last of the three at the rear here, or against the motherboard tray, I should say. So we've actually got six intake fans now, and three exhausts, three exhausts through the radiator up top. I'd rather have positive pressure than negative. I don't wanna put a fan at the rear because we've got these AIO tubes in the way, but I think it looks so much more filled out now. It looks like a more complete build with these six additional fans. And you're probably wondering how the heck we're going to see these LEDs if the fans are turned this way where they're going to be shining through the right side panel. This isn't ideal, right? Well, be quiet, thought of this, and you can see very clearly the LEDs on the opposing side of the fans as well, the areas that are typically neglected of LEDs in LED functioning fans. So this is a really cool feature. I think this is actually my favorite feature of the Lightwings fans. So not only are they quiet PWM supported, you can find them in triple packs, including an RGB hub. You can also daisy chain these if you want to bypass the hub altogether. But they also have tasteful LEDs that are good for both sides of the fan, regardless of whether you set it to intake or exhaust. It's gonna look good in pretty much any case. And again, they're available in triple packs or singles. You can find these linked below if you're interested. I want to thank Be Quiet for being our continued product sponsor of this fix or flop playlist. So there you have it. The rig posts into Windows over and over again. We've tried many times to make this fail, and it does not. So that's good. I think we've solved the Windows loading issue. And then also, whatever we were running to in the beginning that was preventing the system from posting, I'm expecting it was just the fact there was a lot of pressure on that innermost. dim, that has also been remedied. We cleared the CMOS and did a few other things just to make sure, but I think ultimately adjusting the cables and the amount of pressure on that dim solved that initial problem. We added the fans. Again, I think they look really good. Cleaned up cable management just a tad. I've got the tubes running more to the left this time so that you can see more of the block. It's not so covered up. Tightened up some cabling down here. And overall, just, yeah. just looks really good. It's also incredible how quiet this thing is at idle. I mean, considering there's what, six, nine, arguably 12 fans if you count the fans in the card, which, okay, those showed off at idle, but still, it's just, it's a really quiet rig considering how much airflow this rig now has thanks to the additional intake fans that we added. So all in all I'm very pleased. I already contacted the owner and he's super pumped gonna pick it up tomorrow First thing in the morning so excited for him glad we can get up and running Hopefully this video taught you a thing or two. I definitely learned something about getting the stupid windows boot device to even detect NVMEs. I've run into issues like this before, but never to this severity, and I've never had to install drivers to get the boot device, or the boot USB, to see the drives. all the BIOS settings aside, because we had tried everything there, it's just odd that it came down to just the drivers that needed to be updated. So, kind of a weird one, but I'm glad we figured it out. Again, that's something I learned, so I'll know that I should maybe look... faster in that direction if we run into it again in the future and that's what the whole point of this playlist is not only to help folks out locally in the Orlando Florida area but also learn a thing or two and that knowledge is honestly priceless I mean you could pay someone thousands of dollars to learn things about this but seeing it with your own eyes working on things hands-on or as close to hands-on as you possibly can get through the lens of a camera that that experience is just it's unrivaled So thanks for coming along for the ride, and thanks for supporting us by watching these videos, especially as far as you do if you're still watching this one. Consider leaving a like, subscribing, and commenting down below if you haven't already. If you want to support us on Patreon, that would be greatly appreciated. You can join our public Discord server free of charge, and yeah, stick around. I'll catch you in the next one. My name is Greg. Thanks for learning with me.",
    "transcript_keywords": [
        "Windows",
        "drive",
        "Windows boot",
        "BIOS",
        "install Windows",
        "Windows boot USB",
        "boot",
        "POST",
        "fans",
        "cable",
        "issue",
        "thing",
        "rig",
        "problem",
        "time",
        "windows boot device",
        "micro USB cable",
        "USB cable",
        "USB",
        "cables"
    ],
    "transcript_entity_values": [
        "three",
        "Windows UEFI",
        "Corsair",
        "Orlando",
        "Samsung",
        "32",
        "2 terabyte",
        "four",
        "two",
        "tomorrow",
        "second",
        "RGB",
        "1 0",
        "Intel",
        "3090 Zotac",
        "POST",
        "Windows",
        "90 degrees",
        "Gen 4",
        "someone thousands of dollars",
        "USB",
        "12",
        "64",
        "TB",
        "BIOS",
        "970",
        "3",
        "Florida",
        "DRAM",
        "MP600 Pro NH",
        "about 30 minutes",
        "Windows",
        "one",
        "M.2",
        "RAM",
        "AIO",
        "90",
        "Windows",
        "DIMM",
        "first",
        "180 degrees",
        "almost four and a half hours",
        "SATA",
        "Discord",
        "Lian Li",
        "Asus",
        "July",
        "0.00",
        "First",
        "CMOS",
        "1",
        "5",
        "another 90 degrees",
        "nine",
        "10",
        "12th or 13th",
        "NZXT",
        "six",
        "M.2",
        "Li",
        "an MP600 Pro NH",
        "Drive 2",
        "12 seconds",
        "PWM",
        "120s",
        "PayPal",
        "VIP SCD Key",
        "CSM",
        "Patreon",
        "two terabyte",
        "CPU",
        "2",
        "A2",
        "100%",
        "Lightwings",
        "VGA",
        "UEFI",
        "Greg",
        "fourth",
        "2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "NORP",
        "QUANTITY",
        "FAC",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "MONEY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "LAW",
        "PERSON",
        "FAC",
        "FAC",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "DATE"
    ],
    "vector": [
        -0.09154907613992691,
        -0.06070705130696297,
        0.018439054489135742,
        -0.06965238600969315,
        0.09694767743349075,
        -0.003624709788709879,
        0.018985962495207787,
        -0.04001539573073387,
        -0.06212877854704857,
        0.0017743650823831558,
        0.07165271043777466,
        0.07729677855968475,
        -0.09235084801912308,
        0.033807508647441864,
        0.02140478603541851,
        0.01629529893398285,
        -0.003474051598459482,
        -0.035809047520160675,
        -0.053011175245046616,
        0.04839298501610756,
        -0.0693742111325264,
        -0.08452640473842621,
        -0.0370490625500679,
        0.0077666169963777065,
        -0.05136050283908844,
        0.011446639895439148,
        -0.05144014209508896,
        0.015378432348370552,
        -0.08645789325237274,
        -0.004835845902562141,
        0.004612154792994261,
        0.05649612471461296,
        -0.025944843888282776,
        0.047456514090299606,
        0.13218343257904053,
        -0.0491962656378746,
        0.015330777503550053,
        -0.03754919394850731,
        -0.099815733730793,
        0.0011019083904102445,
        -0.020801087841391563,
        0.0015972100663930178,
        -0.0043893600814044476,
        0.03358083218336105,
        0.06099310517311096,
        0.012385472655296326,
        0.022738706320524216,
        -0.018146967515349388,
        0.04212541878223419,
        0.011249731294810772,
        -0.0781087651848793,
        0.02444271370768547,
        0.07920116186141968,
        -0.09865856170654297,
        -0.03147948905825615,
        -0.00907731894403696,
        0.02688082680106163,
        -0.00347489514388144,
        0.0381283164024353,
        -0.030892763286828995,
        0.0923229306936264,
        -0.03527810797095299,
        -0.04599779099225998,
        0.06512121856212616,
        0.004526258911937475,
        0.06486465781927109,
        0.04934525862336159,
        -0.0681886374950409,
        -0.0021488876082003117,
        0.01633014902472496,
        -0.05362327769398689,
        0.006538297049701214,
        -0.036099717020988464,
        0.024714618921279907,
        -0.0077386354096233845,
        0.05478275939822197,
        0.0035842780489474535,
        -0.1259354054927826,
        0.0533980168402195,
        -1.3778913853457198e-05,
        0.016573933884501457,
        -0.07286151498556137,
        -0.016144754365086555,
        0.027355367317795753,
        0.04149068892002106,
        0.015601148828864098,
        0.019103694707155228,
        -0.05500159040093422,
        -0.024951526895165443,
        -0.0007082042866386473,
        -0.08313305675983429,
        0.014818795956671238,
        0.08307426422834396,
        0.007839882746338844,
        0.04408559948205948,
        0.03096628002822399,
        0.067331463098526,
        -0.0643860250711441,
        -0.08539625257253647,
        0.0613875687122345,
        -0.03636840730905533,
        -0.014506001025438309,
        0.1092081367969513,
        -0.07431434839963913,
        0.023231258615851402,
        -0.026034673675894737,
        -0.009055551141500473,
        0.039865605533123016,
        -0.0801863744854927,
        -0.013290283270180225,
        0.007523984182626009,
        0.04081370308995247,
        -0.017105616629123688,
        0.0030909976921975613,
        0.08201375603675842,
        -0.0007884466904215515,
        -0.03495508432388306,
        0.04711225628852844,
        -0.003792593954131007,
        -0.023349538445472717,
        0.03258150443434715,
        0.0015501182060688734,
        -0.040346015244722366,
        -0.02153634838759899,
        0.09188153594732285,
        0.0006395535892806947,
        -0.01670878194272518,
        7.160046293453943e-33,
        0.01898154616355896,
        0.0320153534412384,
        0.0014071479672566056,
        -0.03516755998134613,
        0.008776127360761166,
        -0.007569335401058197,
        0.08928513526916504,
        0.014259198680520058,
        -0.0033633101265877485,
        0.09760160744190216,
        0.025066234171390533,
        -0.024167003110051155,
        -0.017597734928131104,
        -0.05261712148785591,
        -0.004438292700797319,
        -0.02897965908050537,
        0.005548857152462006,
        0.028857167810201645,
        -0.1170736774802208,
        0.02069144695997238,
        0.0020438700448721647,
        -0.04018368944525719,
        0.031126363202929497,
        -0.014283319003880024,
        -0.021798428148031235,
        0.04645451530814171,
        -0.0771060511469841,
        0.01703772321343422,
        0.13092540204524994,
        0.026884475722908974,
        -0.04064355045557022,
        0.02824520692229271,
        0.016134822741150856,
        -0.02917938493192196,
        -0.0625414326786995,
        -0.03551405668258667,
        -0.014520817436277866,
        -0.07628166675567627,
        -0.0025652849581092596,
        0.02212921902537346,
        -0.07394423335790634,
        0.010699937120079994,
        -0.03069530986249447,
        -0.04042825847864151,
        0.014052433893084526,
        -0.013900562189519405,
        -0.002933698706328869,
        0.04295405000448227,
        0.024461966007947922,
        0.03756965696811676,
        -0.08341734856367111,
        0.04042193293571472,
        0.03497859463095665,
        -0.007059113588184118,
        -0.07779746502637863,
        -0.04258463531732559,
        0.05500684678554535,
        -0.004259108100086451,
        0.05961265414953232,
        0.04448359087109566,
        0.08257599174976349,
        0.009910963475704193,
        0.017963994294404984,
        -0.05932430550456047,
        -0.014337241649627686,
        -0.04278579726815224,
        0.09054858237504959,
        0.043476834893226624,
        -0.030431989580392838,
        -0.04682603478431702,
        0.0030380194075405598,
        -0.005735964048653841,
        0.012256489135324955,
        0.012167717330157757,
        0.0442807599902153,
        -0.007126577198505402,
        -0.049149032682180405,
        -0.012008578516542912,
        -0.05194521322846413,
        -0.0025283475406467915,
        0.019966844469308853,
        -0.005249502137303352,
        0.045107293874025345,
        -0.009216820821166039,
        -0.03392013534903526,
        -0.05265641212463379,
        -0.03004792518913746,
        0.06577107310295105,
        -0.02801494486629963,
        -0.03302544355392456,
        -0.027940385043621063,
        -0.05056065693497658,
        0.020491082221269608,
        0.010861022397875786,
        -0.002650092588737607,
        -7.397739332713871e-33,
        -0.05454636737704277,
        -0.09799864143133163,
        -0.01310554426163435,
        0.05966108664870262,
        -0.03689219430088997,
        -0.01146616879850626,
        -0.007056940346956253,
        0.015175217762589455,
        0.0831899493932724,
        -0.05218476057052612,
        -0.022392820566892624,
        0.020104818046092987,
        -0.11189822107553482,
        -0.03392472490668297,
        0.009076097048819065,
        0.022220319136977196,
        -0.08536052703857422,
        -0.005637239199131727,
        0.032071832567453384,
        0.05272695794701576,
        0.09578464925289154,
        0.04639938846230507,
        0.019458454102277756,
        0.07719492167234421,
        -0.001988070784136653,
        0.06140977889299393,
        0.08769238740205765,
        -0.02418472059071064,
        0.04178350418806076,
        0.04560902714729309,
        0.06683463603258133,
        0.05900173261761665,
        -0.03616996109485626,
        0.05875849723815918,
        0.04751726612448692,
        -0.05085749551653862,
        0.047865334898233414,
        -0.03723122552037239,
        -0.06992440670728683,
        -0.030197834596037865,
        0.048939529806375504,
        0.07691975682973862,
        -0.013621409423649311,
        0.08554793149232864,
        0.026644742116332054,
        0.005940290633589029,
        -0.0025314907543361187,
        -0.07795517891645432,
        0.02887171320617199,
        0.032956309616565704,
        -0.029084768146276474,
        -0.04815942794084549,
        -0.014882387593388557,
        -0.010693643242120743,
        -0.01806408166885376,
        0.04506954178214073,
        -0.06339678913354874,
        -0.0037078391760587692,
        -0.08835693448781967,
        -0.048542752861976624,
        0.0030544092878699303,
        0.015408644452691078,
        -0.04219787195324898,
        -0.07305319607257843,
        0.09126972407102585,
        0.04714678227901459,
        0.11230417340993881,
        0.05061832815408707,
        0.014167390763759613,
        -0.051841411739587784,
        -0.06712602078914642,
        0.021593501791357994,
        -0.027794860303401947,
        -0.11619949340820312,
        0.06211839243769646,
        0.07371392846107483,
        -0.07489553838968277,
        -0.0011909374734386802,
        0.029235776513814926,
        0.020645061507821083,
        0.005780201870948076,
        -0.11470314115285873,
        -0.017895065248012543,
        0.06672283262014389,
        0.06268981099128723,
        -0.023305432870984077,
        0.012880649417638779,
        0.07636179774999619,
        -0.015986859798431396,
        -0.07173004001379013,
        -0.03529516980051994,
        0.023935561999678612,
        0.054184190928936005,
        0.050763800740242004,
        0.01744500920176506,
        -5.913422995718065e-08,
        0.034178055822849274,
        0.07555190473794937,
        0.011506279930472374,
        0.0285466481000185,
        0.012842646799981594,
        -0.05254151299595833,
        -0.010197115130722523,
        0.030011579394340515,
        -0.0009056826238520443,
        -0.035825297236442566,
        -0.020877907052636147,
        -0.05587504431605339,
        -0.0029379241168498993,
        -0.05030542239546776,
        0.0763179138302803,
        -0.05942116305232048,
        -0.14299245178699493,
        0.14437724649906158,
        -0.08250518143177032,
        -0.08464576303958893,
        0.00388796697370708,
        0.04146281257271767,
        0.10420166701078415,
        -0.0394802987575531,
        -0.008170277811586857,
        0.015681762248277664,
        -0.023212289437651634,
        0.024001561105251312,
        0.08146274834871292,
        -0.04845331981778145,
        -0.05669735372066498,
        -0.06474224478006363,
        0.0700429156422615,
        -0.06762491911649704,
        0.021533619612455368,
        -0.08333851397037506,
        0.07195767015218735,
        0.05429697781801224,
        0.13012737035751343,
        0.016833636909723282,
        -0.05895312875509262,
        -0.1144309714436531,
        -0.052254628390073776,
        0.00654016574844718,
        -0.054470244795084,
        -0.010732444934546947,
        -0.04210234805941582,
        -0.026894524693489075,
        -0.011204633861780167,
        -0.07038599252700806,
        -0.06004154682159424,
        0.04499609023332596,
        -0.07344195991754532,
        0.07506494969129562,
        0.041526131331920624,
        0.002839708002284169,
        0.018482301384210587,
        0.04718685895204544,
        0.05646020919084549,
        0.048612721264362335,
        -0.028489693999290466,
        -0.03387724980711937,
        -0.12407200783491135,
        0.06642976403236389
    ]
}