{
    "id": "HM-SCTAL6C4",
    "title": "Whats On My iPhone 15 Pro Max - a month later!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-10-30T18:58:13Z",
    "video_url": "https://www.youtube.com/watch?v=HM-SCTAL6C4",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 229971,
    "likes": 6588,
    "comments_count": 405,
    "description": "Thanks to Eight Sleep for sponsoring a portion of this video. Use my code IJUSTINE for $200 off the Pod Cover:    PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE:    GET YOUR OURA RING:    FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -",
    "description_links": [
        "https://www.eightsleep.com/ijustine/",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "https://oura.link/ijustine",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ"
    ],
    "transcript": "- Hey, everyone. So it's been a few months since I got my iPhone 15 and I thought I would do a little updated what's on my iPhone. I changed some things around from my previous phone because normally, when I get a new iPhone, I completely start from scratch, which is kind of annoying because I have to redownload all of the apps. But I love it because it's a fresh start on my phone. What I don't like is I do end up losing all of my messages, but it just feels like a fresh start every year. So let me show you guys what I have on my phone and how I have it laid out. I don't like a lot of pages. I don't like having more than two pages. So as you'll see here, I have one page, two page, and I have some folders for some things like my crypto, my house, and then I have shopping, production, travel, and healthcare and fitness, which there's actually not that many things in there, but that's fine. The number one thing that you will see though is I do have my Eight Sleep widget up here. So a huge thank you to Eight Sleep for sponsoring a portion of this video. Before we get into the rest of the apps, I wanna just tell you what it's been like for over the past year of using Eight Sleep. If you don't know what Eight Sleep is, it is basically a game changer when it comes to getting the best sleep ever. Like when I say that this thing has changed my life, no joke, it is so incredible. So Eight Sleep has a mattress and a pod cover that is temperature-controlled so it'll either heat up or cool down according to how you like to sleep. And it has made such a huge difference. For me, I like to fall asleep with a little bit colder of a temperature. So as you'll see here, my pod is currently off, but I can click in through the widgets. And right now, it's warming it because it's actually currently at negative three. It's a little bit colder in my house at this point. So for me, I like to fall asleep at about a negative two. So this right now is currently at a negative two for bedtime. So I can have this set for all nights since that is my current preference. And with autopilot, it automatically will adjust to make sure that I'm at my ideal temperature that I like. My favorite part though is I hate having an alarm wake me up. So I can have this do a gentle vibration on my half of the bed, and it'll also warm up to a warmer temperature. So it's like a gradual, very peaceful way to wake up. I've also loved having both sides of the bed be separate. So if your partner likes to have a colder temperature or a warmer temperature, your bedsides can be separate and each one of you can sleep at the ideal temperature. The other added bonus is this has sleep tracking, which I'm so obsessed with. This shows your your sleep fitness score. I had an incredible sleep there, 100%. 93% routine, and I slept for eight hours and 32 minutes. And I love the detail that this goes into with your different sleep stages. Also, your health metrics, your heart rate, HRV, your breath rate, your routine, your schedule consistency, your sleep latency, the time you went to sleep, and it's just so fun to be able to compare this night after night. Like I think I had to fly out this day, so you can see I woke up at 5:30. And then the next day, there's no data because I was gone and sad because I missed my Eight Sleep. Since having this for the past year, I honestly cannot say enough great things about it and I know I'm not the only one. I have so many other friends who also have this, and I love being able to chat with them about their sleep scores and how much this has improved their sleep as well. If you guys wanna get more information, I'll put a link in the description and let me know if you have one or if you are looking to get one, I would love to hear from you. So this is my second home screen, but let's go back and let's go through all of the apps that I currently have and my organizational thought process. For whatever reason, I like having the settings right here because I do find myself going into there quite often. So being able to have that just right up at the top left that I can quickly just hit. I know where it is, it's easy to get to. Also the clock, I'm always setting alarms. I know I can probably just say, \"Hey,\" and she would set it for me, but I do like having this here. Also, the App Store, I'm always looking for apps, downloading things, updating things, so I like having that easily accessible in my first row. My Calendar is easily accessible. We've also got Apple Maps and Google Maps. We've got the Tesla app, the Notes app, which is just by far the most superior app in the world. We have this app that was formerly known as Twitter, which I still think is Twitter, so don't get me started. TikTok, Threads, Instagram, and Facebook. I like that I have them all right here, kind of close together, but I did kinda wanna have all of these three apps matching because they were all black and they just looked nice together. So that I put Instagram here. There's like a weird thought process behind all of this. I don't know. We've got Snapchat, YouTube Studio, and the YouTube app. Then we have my Crypto folder. I know, I don't wanna hear it, like this is my phone, let me have what I want on my phone, okay? We've got Coinbase, Helium, Coinbase Pro, the Rainbow Wallet, Venmo, which is not actually crypto, but it's, I basically just using this as my Finance folder. Metamask, Public, Phantom, Wallet, Trust Wallet, Google Authenticator. I don't know why you're in there, but that's fine, whatever. Do what you want. Kraken Pro, BlockFi. You went bankrupt, you shouldn't even be there, but whatever. POAP and Amex, you're also not crypto, but it's fine. We've got Discord, Spotify, Telegram, and we have my Home folder. So we've got Google Home, this is for my garage. We've got Nest, and of course, my Eight Sleep, Protect, PowerView, Lutron, Bravo, Gosund. That is a home sprinkler system. I don't even think it's actually connected to be honest with you, which is probably why my plants are dying. I should look into that. iRobot, that's for my vacuum. Nanoleaf, Traeger, that's my grill, Control Center. That's to control the lights in my gaming room. Ring Doorbell, Washos, that's a car wash app. ECOVACS HOME, that's also my robot vacuum/mop. And of course, Apple Home. We've got Genopets, which is my Solana crypto pet. I don't wanna hear it. I don't wanna hear it, okay? I'm still in it, all right? Whatever. I've been playing this Genopets game for the past, maybe over a year, maybe a year and a half. I'm obsessed. Leave me alone. We've got WhatsApp, we've got the Oura Ring. And then down here in the tray, I have my Messages, I've got the Gmail app, Safari, and my camera. I love being able to have the camera easily accessible. And you might be wondering, what do I have my action button set to? Hold on, you're never gonna believe it. It silences my phone. I know, I'm so cool and so innovative. Next up, we have shopping. So I've got Postmates, DoorDash, Yummy, Instacart, Blue Bottle, Home Depot, Zappos, and Amazon. What more do you need? You need nothing else. This is my Production folder. So this is for a lot of stuff that I use to make videos. We've got Frame.io, Sidus Link for controlling all of my lights here. LumaFusion, which is a video editor, which is basically the closest thing to Final Cut on the iPhone that I could find and I'm so obsessed with it. Oceanic, this is for the Apple Watch app to go diving and also to the Oceanic Dive Housing. So that connects to that. The GoPro app for controlling my GoPro, the DJI Mimo for controlling some of my DGI devices. Meta View for the Meta Ray-Bans collab, which I'm obsessed, they did such a great job with us. Like say what you want about Meta, but man, the Ray-Bans Meta collab is A plus. 100% love it. Captions, that's how I add captions to my videos sometimes. I don't do it all the time, but I do love this app. It's super easy to use. Imaging Edge Mobile, that's for connecting my Sony cameras to my phone. Hover X1, I may or may not have already posted this video, but if not, it's coming out soon. It is this drone that basically takes off from your palm and I'm also obsessed with that. I'm obsessed with a lot of things and I can't wait to show you that video 'cause it's super fun. Remote control that controls a teleprompter app that I have. I've got the Google app, we've got the Google Docs, we have WebEx Meet, and the LG Soundbar app. Next we have travel. We've got Delta, Uber, Spirit, American, and Surfline. I don't surf, but I just sometimes wanna see how the waves are. Health and fitness, we have Flow. It's a period tracker. Apollo is a little wearable device that sends sound vibration through your body to reduce stress. I'm still testing it out, so stay tuned for that. MyFitnessPal, sometimes I like to track my food or look things up and see how much protein I've had in the day. I need to get back to that, but I love MyFitnessPal. It gets just, it still has been one of my favorite apps for food tracking. We've got Audible. I love listening to audiobooks, like I have a problem. Like I listen to them all day long. Like I'll be walking around the house, cleaning, I'll be driving, whatever that I'm doing that I can be listening to an audiobook, I am. So huge Audible fan. Twitch, Disney+, Pandora, and then I have easy access to my Tesla and then Spotify. And of course, 1989 Taylor's version on deck. I actually really love Spotify. I use it more, I think, than Apple Music, which is kind of ironic. It is what it is. I've just been using it for so long that it's just got my playlist, it's got all of my things, and I really like it. So yeah, my friends, that is what is on my iPhone 15 currently. Let me know if there's any apps that you think I should check out. What do you think of my app layouts? I guess I'm gonna say, like I don't really, like I don't care what you think about it because this works for me. So please don't judge, or you can judge me, it's fine. You can do whatever you want. And if you're wondering why I don't have a third page, honestly, for the longest time, I only had one page and I even had a folder with all of these other things. But finally, I was like, \"Okay, I like using widgets and I like having a few other apps that I use a lot just readily accessible.\" But most of the time, I just swipe down and I search for whatever app I want. So it really doesn't matter where it is on my phone, but this is my setup. So that, my friends, I will see you guys in my next video. If you wanna see some more videos, I've got some here on the end screen. And if you haven't already, be sure to like, comment, and subscribe. Hit the bell to be notified when I post new videos, and I'll see you in the next one. Bye.",
    "transcript_keywords": [
        "Sleep",
        "App",
        "apps",
        "things",
        "love",
        "home",
        "phone",
        "Google",
        "temperature",
        "Apple Watch app",
        "obsessed",
        "video",
        "Google app",
        "Apple",
        "page",
        "crypto",
        "year",
        "folder",
        "Meta",
        "iPhone"
    ],
    "transcript_entity_values": [
        "the App Store",
        "the Oura Ring",
        "Safari",
        "HRV",
        "Home Depot",
        "one",
        "Imaging Edge Mobile",
        "eight hours",
        "the Ray-Bans Meta",
        "Coinbase",
        "Gmail",
        "LumaFusion",
        "Instagram",
        "100%",
        "Tesla",
        "Kraken Pro",
        "a year and a half",
        "Twitter",
        "Washos",
        "Twitch",
        "Control Center",
        "93%",
        "Genopets",
        "iRobot",
        "WhatsApp",
        "GoPro",
        "Wallet, Trust Wallet",
        "Zappos",
        "Ring Doorbell",
        "Amazon",
        "Taylor",
        "Spotify",
        "Lutron",
        "this night",
        "Amex",
        "YouTube",
        "every year",
        "Eight Sleep",
        "Google",
        "Telegram",
        "Discord",
        "Gosund",
        "Helium",
        "third",
        "the Oceanic Dive Housing",
        "Metamask",
        "Postmates",
        "Facebook",
        "Traeger",
        "Delta",
        "ECOVACS",
        "Nest",
        "Spirit",
        "second",
        "32 minutes",
        "DGI",
        "MyFitnessPal",
        "iPhone 15",
        "Sony",
        "iPhone",
        "more than two",
        "three",
        "the day",
        "the next day",
        "the DJI Mimo",
        "all nights",
        "Google Home",
        "Frame.io",
        "Apollo",
        "Final Cut",
        "Sidus",
        "Instacart",
        "this day",
        "1989",
        "Meta",
        "Apple Music",
        "Surfline",
        "BlockFi",
        "Notes",
        "Bravo",
        "Coinbase Pro",
        "Eight",
        "Yummy",
        "Solana",
        "American",
        "Meta View",
        "WebEx Meet",
        "Venmo",
        "half",
        "my first row",
        "Apple Maps",
        "YouTube Studio",
        "the past year",
        "Crypto",
        "two",
        "Snapchat",
        "5:30",
        "the Google Docs",
        "a few months",
        "Apple Home",
        "Blue Bottle",
        "Phantom",
        "TikTok",
        "the Apple Watch"
    ],
    "transcript_entity_types": [
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERCENT",
        "NORP",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "TIME",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "PERSON",
        "NORP",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.013532204553484917,
        -0.09166977554559708,
        0.06677591055631638,
        -0.06957732141017914,
        0.062294796109199524,
        -0.0013862536288797855,
        0.02730405144393444,
        0.06061934307217598,
        0.036877427250146866,
        0.027898702770471573,
        0.07042647898197174,
        -0.005234462674707174,
        -0.06947287917137146,
        0.05926639586687088,
        -0.04982542246580124,
        0.07170099020004272,
        0.03062961995601654,
        -0.006997580174356699,
        -0.12327521294355392,
        -0.0209366288036108,
        -0.08250802010297775,
        -0.056950151920318604,
        0.01435798779129982,
        0.0405263788998127,
        -0.0011180046712979674,
        0.121365986764431,
        -0.03289872407913208,
        -0.0329117476940155,
        -0.08106129616498947,
        -0.05906926095485687,
        -0.041176989674568176,
        0.00888977013528347,
        0.08095908164978027,
        -0.010153304785490036,
        0.01333967037498951,
        -0.0749867856502533,
        -0.04743145406246185,
        0.017169935628771782,
        0.0021233458537608385,
        -0.05624660849571228,
        0.010615373030304909,
        0.00227591535076499,
        -0.02122150920331478,
        0.05134683847427368,
        -0.03381787985563278,
        -0.017957737669348717,
        0.02928904816508293,
        0.0066972766071558,
        0.056400448083877563,
        0.013589673675596714,
        -0.028148770332336426,
        0.03635619580745697,
        -0.06594964116811752,
        0.019813651219010353,
        -0.0362485870718956,
        0.026546744629740715,
        -0.003732176497578621,
        0.04037603363394737,
        0.08034100383520126,
        0.0021173865534365177,
        0.051348231732845306,
        0.02126271091401577,
        -0.03142446652054787,
        0.03199275955557823,
        -0.008600729517638683,
        -0.06271828711032867,
        0.0015226576942950487,
        0.004479219671338797,
        -0.01689590886235237,
        0.03371460735797882,
        -0.06404037773609161,
        0.059225041419267654,
        0.03177827596664429,
        0.03130387142300606,
        0.003321259981021285,
        0.02063743583858013,
        -0.01178690791130066,
        4.9180212954524904e-05,
        -0.09103373438119888,
        -0.010523608885705471,
        0.05208326503634453,
        -0.005077139474451542,
        -0.03685736656188965,
        -0.027387473732233047,
        0.045096900314092636,
        0.03622472286224365,
        0.022455237805843353,
        0.022647062316536903,
        -0.00980105809867382,
        -0.049055300652980804,
        -0.07848062366247177,
        0.01278244610875845,
        0.026414327323436737,
        -0.008931511081755161,
        -0.021876437589526176,
        0.03944915905594826,
        -0.039252351969480515,
        -0.0897885262966156,
        -0.03156818822026253,
        0.045366670936346054,
        0.08029769361019135,
        -0.10285761207342148,
        0.012621918693184853,
        -0.003809389192610979,
        -0.029076574370265007,
        -0.10198570042848587,
        -0.07040897011756897,
        -0.015668606385588646,
        -0.005689783021807671,
        0.10455037653446198,
        0.01854250393807888,
        0.01699715480208397,
        -0.03506889566779137,
        -0.046788737177848816,
        0.03267746791243553,
        0.09228821843862534,
        -0.05185892432928085,
        0.09553850442171097,
        -0.0008302379865199327,
        0.051968492567539215,
        0.014750265516340733,
        -0.056619733572006226,
        -0.037010300904512405,
        -0.02687382511794567,
        -0.07354366034269333,
        -0.03743552416563034,
        -0.05338338389992714,
        4.921839662615043e-33,
        0.05935024842619896,
        0.00984655600041151,
        -0.007965038530528545,
        0.08588215708732605,
        -0.07907485961914062,
        -0.04875442385673523,
        0.0700853168964386,
        0.12642303109169006,
        -0.008050411939620972,
        -0.0015051543014124036,
        0.03650284931063652,
        0.01887720264494419,
        -0.057625215500593185,
        -0.018061921000480652,
        0.03708736598491669,
        0.005214089527726173,
        -0.0035872117150574923,
        -0.08158578723669052,
        -0.019055582582950592,
        0.00164798682089895,
        -0.01758214272558689,
        -0.04789610952138901,
        -0.0409255288541317,
        0.03138035163283348,
        0.04613076522946358,
        0.07138576358556747,
        0.061289966106414795,
        -0.01611909829080105,
        -0.03515433520078659,
        -0.02263212576508522,
        -0.07538460195064545,
        0.05723221227526665,
        -0.02904372662305832,
        -0.04063970968127251,
        -0.03689505532383919,
        0.014394153840839863,
        0.05182475969195366,
        -0.029387444257736206,
        0.02951160818338394,
        -0.019589433446526527,
        0.012167979031801224,
        0.02976633794605732,
        -0.029291445389389992,
        0.014875518158078194,
        0.10248688608407974,
        0.08350570499897003,
        -0.013354702852666378,
        0.07387948036193848,
        -0.06379184126853943,
        0.014986749738454819,
        0.03026166930794716,
        -0.018305618315935135,
        -0.01682741940021515,
        -0.07045576721429825,
        -0.1340676248073578,
        0.008848682045936584,
        -0.04520771652460098,
        0.01143852062523365,
        0.012879686430096626,
        -0.00210568867623806,
        0.06417407095432281,
        -0.014058130793273449,
        -0.06367829442024231,
        0.052689600735902786,
        -0.07831953465938568,
        0.12388857454061508,
        0.007324981037527323,
        -0.015801144763827324,
        0.03787339851260185,
        0.11131187528371811,
        -0.06992456316947937,
        0.005036058835685253,
        0.04851601645350456,
        0.028814490884542465,
        0.05242559313774109,
        0.05675671994686127,
        -0.049012843519449234,
        -0.05402123183012009,
        -0.03692619502544403,
        0.0015984525671228766,
        -0.028177594766020775,
        0.08909183740615845,
        -0.03365955129265785,
        0.038407616317272186,
        -0.014002857729792595,
        -0.08580859750509262,
        0.008715663105249405,
        -0.021872712299227715,
        0.01869908906519413,
        0.08770236372947693,
        0.005082681775093079,
        -0.005441764369606972,
        -0.043522030115127563,
        -0.022848855704069138,
        -0.025884568691253662,
        -6.1471338316099166e-33,
        0.03655382618308067,
        -0.06174169480800629,
        -0.021606063470244408,
        -0.07687104493379593,
        0.049454472959041595,
        -0.038825176656246185,
        -0.051205992698669434,
        0.11124583333730698,
        0.025487219914793968,
        -0.06670395284891129,
        0.038141656666994095,
        -0.07956773042678833,
        -0.06923209875822067,
        0.026932843029499054,
        -0.07768099755048752,
        -0.013232230208814144,
        -0.04815513268113136,
        -0.06764708459377289,
        0.008145201951265335,
        0.03580716624855995,
        -0.002429347252473235,
        0.0964687392115593,
        0.050453025847673416,
        -0.01821143366396427,
        -0.06619826704263687,
        0.0037688706070184708,
        0.01618209108710289,
        0.05262058973312378,
        0.07092322409152985,
        -0.027626212686300278,
        0.06021460145711899,
        -0.0724586695432663,
        -0.07082618027925491,
        -0.05440106615424156,
        0.007685629650950432,
        0.05956198275089264,
        -0.013377318158745766,
        -0.053240932524204254,
        -0.015671538189053535,
        -0.05609831586480141,
        0.02808477357029915,
        -0.018701165914535522,
        0.0022629282902926207,
        0.005601491779088974,
        0.027812974527478218,
        -0.060396261513233185,
        -0.05703776329755783,
        0.05545833334326744,
        0.004513969179242849,
        -0.023234983906149864,
        -0.014809818007051945,
        -0.005724659655243158,
        -0.03190147876739502,
        -0.019247639924287796,
        -0.059100329875946045,
        0.015744246542453766,
        0.020264916121959686,
        -0.002599497092887759,
        0.06444407254457474,
        -0.0031674662604928017,
        0.06592711061239243,
        0.023130379617214203,
        -0.07485825568437576,
        -0.09607324749231339,
        -0.07755839079618454,
        -0.07886157929897308,
        0.05218721926212311,
        -0.05509979650378227,
        -0.015990475192666054,
        0.06994195282459259,
        -0.09125328063964844,
        0.005238020326942205,
        0.05232847481966019,
        -0.03975808992981911,
        0.030223431065678596,
        -0.0330691896378994,
        -0.06118639558553696,
        -0.02293701283633709,
        0.029663212597370148,
        -0.019368238747119904,
        0.021218471229076385,
        0.04065738245844841,
        0.037851810455322266,
        0.06650030612945557,
        0.11422010511159897,
        0.11948911100625992,
        0.06256532669067383,
        0.01973149925470352,
        0.03779424726963043,
        0.055760785937309265,
        0.02098371833562851,
        0.042768873274326324,
        0.004195512272417545,
        0.09417577087879181,
        -0.08314880728721619,
        -5.3988060244591907e-08,
        0.10604892671108246,
        0.007402463816106319,
        -0.018347032368183136,
        0.05503656342625618,
        -0.009813150390982628,
        -0.05626344680786133,
        -0.06501498073339462,
        0.060144081711769104,
        0.09610816091299057,
        -0.09485325962305069,
        -0.001361375325359404,
        -0.01244071964174509,
        -0.026820968836545944,
        0.12229315936565399,
        -0.02021656185388565,
        0.013687739148736,
        0.012254252098500729,
        0.0025518066249787807,
        0.003617041977122426,
        -0.05012214183807373,
        -0.07901187241077423,
        0.08591126650571823,
        0.04619932919740677,
        -0.03397327661514282,
        0.05098005756735802,
        -0.0042028967291116714,
        0.04713135212659836,
        -0.04938207566738129,
        0.030732497572898865,
        -0.003669367404654622,
        0.025956058874726295,
        -0.010177239775657654,
        0.07613155990839005,
        0.0061834282241761684,
        -0.05605750158429146,
        -0.026231100782752037,
        -0.01616852916777134,
        -0.0546121671795845,
        0.0359012596309185,
        -0.043114203959703445,
        0.03467922657728195,
        -0.07306579500436783,
        0.01759081706404686,
        0.015726478770375252,
        -0.018886342644691467,
        -0.11485285311937332,
        0.06166677549481392,
        -0.11251022666692734,
        0.038319334387779236,
        -0.035998325794935226,
        -0.10356133431196213,
        -0.03450164943933487,
        0.016964655369520187,
        -0.04225681349635124,
        0.14070101082324982,
        -0.03629017993807793,
        0.042079485952854156,
        0.04856177419424057,
        -0.03741231560707092,
        -0.014578793197870255,
        0.005589308682829142,
        -0.04318174347281456,
        -0.046534858644008636,
        0.02367716282606125
    ]
}