{
    "id": "HmW2MUiIIcI",
    "title": "RAIDING Area 51?",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2019-07-19T16:30:36Z",
    "video_url": "https://www.youtube.com/watch?v=HmW2MUiIIcI",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "area 51",
        "storm area 51",
        "area 51 raid",
        "news",
        "storming area51 memes",
        "RED cameras",
        "RED",
        "red minimag",
        "jinnitech",
        "facebook event",
        "camera",
        "tech",
        "faceapp",
        "faceapp old filter",
        "faceapp data",
        "data",
        "they can't stop all of us",
        "faceapp challenge",
        "bob lazar",
        "ufo",
        "face app",
        "roswell",
        "groom lake",
        "storm area 51 plan",
        "current events",
        "data breach",
        "faceapp privacy",
        "faceapp russia",
        "red camera",
        "area 51 aliens",
        "memes",
        "naruto run",
        "pop culture",
        "facebook",
        "aliens",
        "area 51 memes",
        "jinni"
    ],
    "views": 115124,
    "likes": 5286,
    "comments_count": 289,
    "description": "Are you storming Area 51 with the boys?   Kyoto Animation:    So You Want to Be an Astronaut:  How Japan Took Over 7-Eleven:  Who is the CRAZIEST President of All Time?:  Where Do Banks Keep Your Money?:  Why There's a Traffic Jam on Mount Everest:   Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://www3.nhk.or.jp/nhkworld/en/news/20190719_04/",
        "https://myanimelist.net/anime/producer/2/Kyoto_Animation",
        "https://youtu.be/p7J63sLw_dU",
        "https://youtu.be/CU9vL6zdhso",
        "https://youtu.be/8Guyxz_-wEo",
        "https://youtu.be/8Guyxz_-wEo",
        "https://youtu.be/l_3KVwHa36M",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hey, guys, and welcome to This is Now. Over the past week the internet has absolutely been buzzing about an upcoming raid on Area 51 to see them aliens on September 20th. But they've ballooned to over 1.5 million people who said they're going, with another 1.2 million people who are interested. I just like that idea. I'm interested in storming a US military compound to see them aliens. No big deal. - Just don't wanna commit. - So while the event was started as a joke, there are definitely some who are taking it a little bit more serious than others. Hotels around the area have reportedly seen a spike in reservations because of the event. 1.2 million people is probably more than the single hotel which is next to Area 51 even supports. The popularity has grown to the point where the US Air Force was forced to issue a statement that, quote, the US Air Force always stands ready to protect America and its assets. Or to paraphrase, you will definitely be shot on-site. But don't worry. The Facebook group has a plan for that. Just Naruto run across the border. You'll be too fast for the bullets. Why am I saying? This is terrible advice. - [Matt] This is literally the description of the event. - If you don't know what Area 51 is, basically it's an area of government-owned land located about 83 miles north of Las Vegas, Nevada. Now, the total area of the base is around 25 square miles and it's actually named the Groom box. That's because the area's made up of the Homey Airport and a giant salt flat called Groom Lake. There is some speculation on how it became known as Area 51. Allegedly it got its name from a CIA document during the Vietnam War. It's also been called the Dreamland and Paradise Ranch, which was later shortened to just the Ranch. Wait, what? No one's ever called that any of these names. It's Area 51. There's aliens inside. They sell beef jerky on the outside. It's fine. - [Matt] Alien beef jerky. - I've actually never tried that. I've seen it so many times driving on the way to Vegas. I'm like, hey, stop for alien beef jerky. - [Matt] It's actually Delicious. - The area is strictly off-limits to both civilians, and even unauthorized military personnel, and that includes the airspace. One of the only outside aircraft that is permitted is the US Air Force's Janet Airlines, who transport the military personnel from Vegas to Area 51 every day. Now, fun fact. Janet is actually the airline's callsign and there's some speculation on what that stands for. Some say just another nonexistent terminal. But it's likely something boring, like the joint air network for employee transportation. Now, the entire perimeter is under surveillance from cameras, as well as motion sensors buried underground. And of course there are naturally armed guards who patrol it because it's a secret military base. The official uses for it over the years have mostly been aviation-based. In the 1950s the CIA used it as a testing facility for the Lockheed U-2 strategic recon plane. The reason they tested the plane out in the middle of nowhere was that, of course, it needed to be developed in total secrecy. Just don't tell the nerds. Other planes have also been tested there over the years, like the SR-71 Blackbird, as well as the Lockheed D-21. So why do people think that the government is keeping the aliens there? Of course speculation started after the 1947 UFO crash in Roswell, New Mexico. The initial government report said that it was a crashed weather balloon, as if you'd had possibly believed them. However, many people though that they were actually covering up a crashed alien ship. However, in the '90s the US declassified the Roswell crash as Project Mogul, a surveillance balloon designed to detect Soviet nuclear testing. Or so they want you to think. That, combined with the mystery of the base and several experimental aircraft, or UFOs, actually it's technically true 'cause it's an unidentified flying object, which does not mean alien, by the way. Just saying. But this has really led people to theorize for decades that there are little green men running around inside. As if anyone could keep a secret like that. A physicist, Bob Lazar, recently went on the Joe Rogan podcast and talked about his time working on a UFO 30 years ago. However, even the thinks that the raid is a dumb idea. Real talk, though. If you were considering storming Area 51, yeah, it's a great meme, but no one is going to be able to Naruto their way through a...(laughing) No one is going to be able to Naruto their way through a giant metal fence and with all the mines and the tanks and the dogs. I'm sure they're not going to be particularly happy to, I can't take this seriously in this. This is not, this is, just take it. Now, if you've been on Twitter, Instagram, or the internet in general lately, you've probably seen the old filter, which has been taking over. Well, this is known as FaceApp, and while it is a lot of fun and technically free, but the question is, is it really? FaceApp is developed by a Russian company, Wireless Lab, and they have one of the more unique user agreements. So to use the app you first have to read through the terms of service and then agree. But let's face it. No one is actually reading through that. So by using FaceApp you are, quote, granting FaceApp a perpetual, irrevocable, nonexclusive, royalty-free, worldwide, fully-paid, transferable sub-licensable license to use, reproduce, modify, adapt, publish, translate, create derivative works from, distribute, publicly perform and display your user content and any name, username, or likeness provided in connection with your user content in all media formats and channels now known or later developed without compensation to you. Oh, boy. I love my old face filter now. So what does that actually mean? Well, the firestorm online has proven that there's a lot of people who are excited about it, but it means that they can pretty much do whatever they want with your photo as soon as you submit it to the app, whether that means that you're using your face in a weird stock photo, or more likely, if they're using it to train the AI, which they almost certainly are, they have the complete right to use your likeness to do that. This all sounds so nefarious. However, they are definitely not the only tech company who uses your data like this. Both IBM and Flickr were caught providing user data such as photos to develop AI engines for things like facial recognition for police. Yikes. In fact, while people have posted FaceApp's terms and conditions all over Twitter, many have failed to realize that Twitter, as well as a lot of other apps that we use on a pretty much regular basis, actually have very similar policies. Now, I think this is very much one of those cases where the internet is super fired up about it, and while, yes, it's a little bit suspicious, in fact it's mostly suspicious, but you're using a free app. What do you expect? They have to make money somehow and if they're using it to develop some secret alien-tracking facial recognition technology, then you should be happy that you're a part of it. High-end camera manufacturer Red has come under scrutiny recently over their Red Mini-Mags. Now, Red cameras are a favorite of a lot of filmmakers and we actually do use Red here at the office as well. Now, while the image quality is top-notch, one of the main complaints is just how expensive the ecosystem is. One of Red's most expensive accessories is the proprietary SSD media, the Mini-Mag which costs almost $2,400 for a 960 gigabyte drive. Not only is the housing custom, but the pin connection is not compatible with your standard SATA connector. So not only does this require the user to buy the drive, but you also, of course, have to buy the camera, as well as the proprietary reader. Now, red CEO, Jarred Land, claims that the drives were a custom intellectual property created through countless hours of R&D. However, the YouTube channel Jinni Tech uploaded a video tearing down one of their custom Mini-Mags, revealing that the custom firmware was actually just a couple of off-the-shelf components. Now, really what's inside these SSDs is just a standard mSATA drive connected to a simple pinout adapter which probably only cost a few dollars to manufacture. The SSDs themselves are not special or custom in any way. They're standard Micron or Crucial SSDs which cost a couple hundred dollars, not $2,000. Now, one of the most damning pieces of evidence against Red is that they advertise their drives at 512 gigs, but the actual mSATA drive itself has far less capacity than that available. Now, while it is true that there's nothing special about the Red Mini-Mags or the drives inside, there is a custom piece of software for communicating the with the camera. Now, Jinni Tech tried using another OTS drive and the camera recognized it, but what they didn't mention in the video is that the non-Red drive actually doesn't record to full speed, so it's a little bit of misleading marketing. And you have to consider that Jinni Tech is not just a random YouTuber or filmmaker. They're a company based out of the UK who sells third-party, and therefore unapproved, Red-Mags. So it's pretty plausible that this whole controversy was absolutely a way for them to drum up business for themselves. If it wasn't, there's definitely going to be a side effect for this whole mess. So Red has issued a number of responses condemning Jenny tech. The native presses apparently enough for Red to finally reduce their mini night prices by 20%. This entire story is weird, right? So I think Linus, in fact, has done the best video kind of summing it all up. But essentially, there's a lot of wrong on both sides. Jinni Tech is absolutely useless as a huge marketing tool. On the other hand, Red has been absolutely overpricing these things forever. And the fact that they're finally being called out on it, I think is a good thing. Last but certainly not least, today we have a little bit of a sad story, Ken, I don't know if you wanna take this one? - Yeah, this is a story we were debating, not talking about. But something that hit hard was the tragedy that happened in Kyoto Japan. On Thursday, an arsonist set fire to one building of beloved Anime Studio Kyoto Animation, suddenly injuring and killing many. Now the story is still unfolding at the time of this recording. And really this new series on the channel is not really about detailing gruesome events such as this, but if you wanna know more about it, I'll leave a link in the description below. But the outpouring of support and love being sent to Kyoto Animations way is the little ray of light to the situation, with famous works such as the \"Haruhi Suzumiya\" series, \"K-On\" and \"Violet Evergarden\" as well as tons more. It's hardly surprising. The fans all around the world have poured in their support. And for me, Kyoto Animation has played a pivotal role in my life, not only as a fan, but also professionally. So I actually started watching Anime in high school right around the time I was applying for college, and I watched their work Clannad specifically Clannad after story of the second season. Right as I was applying for film school, I literally did it on a whim. And the one film school that I applied to actually accepted me so if it wasn't for that, I probably wouldn't be here working this job. I probably wouldn't have met Matt, our buddy Wes, like our editor, Josh, like, all those guys that I met at film school, I probably wouldn't have met. I wouldn't have done YouTube stuff. It played a huge role in my life and I really attribute Cute Animation to a lot of that, believe it or not. Really, this whole part of this video is just to help me cope with this whole thing 'cause I'm still trying to make sense of it all. But I think the best thing that we can all really do right now is just keep 'em in your thoughts and prayers and yeah.",
    "transcript_keywords": [
        "Area",
        "Red",
        "Jinni Tech",
        "Air Force",
        "people",
        "tech",
        "million people",
        "drive",
        "Red MiniMags",
        "Kyoto Animation",
        "lot",
        "custom",
        "Air",
        "Air Force Janet",
        "aliens",
        "Alien",
        "Kyoto",
        "Jinni",
        "fact",
        "user"
    ],
    "transcript_entity_values": [
        "FaceApp",
        "New Mexico",
        "Janet Airlines",
        "Lockheed",
        "Mini-Mag",
        "Project Mogul",
        "mSATA",
        "Vegas",
        "the US Air Force",
        "2,000",
        "Naruto",
        "Anime Studio Kyoto Animation",
        "September 20th",
        "CIA",
        "the Homey Airport",
        "One",
        "51",
        "Wes",
        "YouTube",
        "Clannad",
        "1947",
        "D-21",
        "Groom Lake",
        "Kyoto Animations",
        "Violet Evergarden",
        "Red Mini-Mags",
        "Kyoto Animation",
        "third",
        "20%",
        "Paradise Ranch",
        "Twitter",
        "YouTuber",
        "countless hours",
        "around 25 square miles",
        "Matt",
        "the US Air Force's",
        "Roswell",
        "Soviet",
        "the '90s",
        "decades",
        "first",
        "Instagram",
        "Kyoto",
        "Jinni Tech",
        "Josh",
        "AI",
        "the past week",
        "US",
        "the \"Haruhi Suzumiya",
        "a few dollars",
        "512",
        "IBM",
        "Las Vegas",
        "Lockheed U-2",
        "Facebook",
        "Blackbird",
        "Russian",
        "Linus",
        "Nevada",
        "Red-Mags",
        "1.2 million",
        "a couple hundred dollars",
        "Micron",
        "OTS",
        "the Vietnam War",
        "over 1.5 million",
        "Roswell",
        "one",
        "today",
        "the 1950s",
        "960 gigabyte",
        "Bob Lazar",
        "FaceApp",
        "UK",
        "30 years ago",
        "the years",
        "Janet",
        "Joe Rogan",
        "Mini-Mags",
        "America",
        "Wireless Lab",
        "about 83 miles",
        "Thursday",
        "the second season",
        "51",
        "SR-71",
        "Japan",
        "Jarred Land",
        "SSD",
        "almost $2,400",
        "Ken",
        "Jenny",
        "Flickr"
    ],
    "transcript_entity_types": [
        "PERSON",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "QUANTITY",
        "PERSON",
        "ORG",
        "GPE",
        "NORP",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "GPE",
        "WORK_OF_ART",
        "MONEY",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "NORP",
        "PERSON",
        "GPE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "EVENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "QUANTITY",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "GPE",
        "PERSON",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORG"
    ],
    "vector": [
        0.06799748539924622,
        -0.036378953605890274,
        0.040032416582107544,
        0.03463514894247055,
        0.020145291462540627,
        -0.09591248631477356,
        -0.0052117882296442986,
        -0.0250590480864048,
        -0.02208106219768524,
        0.07264389097690582,
        -0.024014461785554886,
        -0.0024984523188322783,
        0.10399296879768372,
        0.03791312873363495,
        0.06951045244932175,
        0.0019258379470556974,
        0.03886440396308899,
        -0.08008141815662384,
        -0.006859687622636557,
        0.05820046365261078,
        -0.06556690484285355,
        -0.026999345049262047,
        0.013875668868422508,
        0.01975368894636631,
        -0.023404888808727264,
        0.021806076169013977,
        -0.015974581241607666,
        0.047266338020563126,
        -0.10275999456644058,
        0.01995203085243702,
        0.0369296595454216,
        0.13028909265995026,
        -0.014674767851829529,
        0.020992496982216835,
        0.0978945791721344,
        0.041634052991867065,
        -0.002024299232289195,
        -0.08400722593069077,
        0.06525599956512451,
        -0.004093236289918423,
        0.030980560928583145,
        0.0003737227525562048,
        0.15243084728717804,
        5.183070607017726e-05,
        -0.0063537294045090675,
        -0.027157984673976898,
        -0.04296298697590828,
        0.02543768845498562,
        0.032750096172094345,
        0.02629195712506771,
        0.04567993804812431,
        -0.0035033368039876223,
        0.07320461422204971,
        -0.01795630343258381,
        -0.03014623001217842,
        -0.04263998940587044,
        -0.013808559626340866,
        -0.10755027085542679,
        0.028143534436821938,
        -0.052752863615751266,
        0.034080032259225845,
        -0.012473143637180328,
        0.07945316284894943,
        -0.04200666397809982,
        -0.030663615092635155,
        -0.013599853962659836,
        0.012813865207135677,
        0.06541009247303009,
        0.11870434880256653,
        -0.029152071103453636,
        0.0935165286064148,
        -0.0023880640510469675,
        0.03134262189269066,
        -0.0011844740947708488,
        0.008817552588880062,
        -0.027154041454195976,
        -0.016421044245362282,
        0.07243947684764862,
        0.018919415771961212,
        -0.07461804151535034,
        0.052357058972120285,
        -0.046481043100357056,
        0.04794511944055557,
        -0.07798799872398376,
        -0.04785281792283058,
        -0.019440818578004837,
        0.0031802861485630274,
        0.018746687099337578,
        0.021511688828468323,
        0.06058260798454285,
        -0.09059830754995346,
        0.05060841515660286,
        0.01970214769244194,
        0.009049068205058575,
        0.023546840995550156,
        0.08190794289112091,
        -0.015442810021340847,
        0.009383807890117168,
        -0.07290180772542953,
        0.009422482922673225,
        0.07888224720954895,
        0.07003441452980042,
        -0.022260215133428574,
        -0.09663691371679306,
        -0.05635477229952812,
        0.00037920274189673364,
        0.0479397252202034,
        0.018049536272883415,
        -0.007219936233013868,
        -0.05765075981616974,
        -0.06996223330497742,
        0.06562843173742294,
        -0.018735766410827637,
        -0.03635644540190697,
        0.0018859267001971602,
        0.008835406973958015,
        0.08190609514713287,
        -0.013119379989802837,
        -0.0014323791256174445,
        -0.007503825705498457,
        0.04493645951151848,
        -0.03882531449198723,
        -0.02373148687183857,
        0.003038180060684681,
        0.04465043544769287,
        -0.015703842043876648,
        -0.12365638464689255,
        3.477939911223702e-33,
        0.03977648541331291,
        0.057344309985637665,
        -0.05463802441954613,
        0.02196359448134899,
        0.006239989772439003,
        0.008377484045922756,
        -0.0649394690990448,
        0.05411862954497337,
        -0.03261208534240723,
        -0.006576553452759981,
        -0.03872741013765335,
        -0.05045338347554207,
        0.025608418509364128,
        -0.03678186982870102,
        -0.01770896464586258,
        -0.06830331683158875,
        0.01129468996077776,
        -0.026981104165315628,
        -0.0003946186916437,
        -0.03544241189956665,
        0.016761723905801773,
        -0.058952830731868744,
        -0.026922231540083885,
        0.062317948788404465,
        0.021889690309762955,
        0.03212834522128105,
        -0.021729853004217148,
        0.014568272046744823,
        0.05321906507015228,
        0.033232178539037704,
        -0.06303703039884567,
        -0.0049730828031897545,
        0.0063064382411539555,
        -0.023105330765247345,
        -0.025521686300635338,
        -0.03753212094306946,
        0.014339327812194824,
        -0.006524201482534409,
        -0.06692364811897278,
        -0.01793564297258854,
        -0.1270844042301178,
        0.075132355093956,
        -0.12243707478046417,
        0.02372540719807148,
        -0.006737006362527609,
        0.12886810302734375,
        0.06691789627075195,
        0.005699500907212496,
        -0.009818325750529766,
        -0.04035169258713722,
        -0.025982938706874847,
        0.011636820621788502,
        -0.03093557432293892,
        -0.027989190071821213,
        0.03179237246513367,
        -0.039014171808958054,
        0.04852255806326866,
        -0.031032582744956017,
        0.027104152366518974,
        -0.0219107773154974,
        -0.024458054453134537,
        0.016699638217687607,
        -0.07751429080963135,
        0.06933753937482834,
        -0.06382721662521362,
        -0.03684861958026886,
        0.02824983559548855,
        0.041753534227609634,
        -0.0371830053627491,
        0.02010340988636017,
        0.05083993822336197,
        -0.06693220138549805,
        -0.05157492309808731,
        0.01321076788008213,
        -0.0335535854101181,
        -0.01853969506919384,
        0.0016201544785872102,
        0.026285013183951378,
        0.0997682437300682,
        0.06512857228517532,
        0.06114654615521431,
        -0.05396777018904686,
        0.07409750670194626,
        0.026339108124375343,
        0.015934236347675323,
        0.011304563842713833,
        0.05666394904255867,
        -0.03973885998129845,
        -0.026311343535780907,
        0.04127469286322594,
        -0.04430289566516876,
        -0.04591070115566254,
        0.06991002708673477,
        -0.02372169680893421,
        -0.03852073848247528,
        -4.409892771048736e-33,
        0.0035073268227279186,
        -0.004730536136776209,
        -0.07002468407154083,
        -0.09663145244121552,
        -0.023896867409348488,
        -0.027642611414194107,
        -0.013593202456831932,
        -0.029421472921967506,
        -0.010078858584165573,
        -0.03431692719459534,
        -0.11465013772249222,
        0.06697927415370941,
        -0.0010900500928983092,
        -0.0020521720871329308,
        -0.029573610052466393,
        -0.07778614014387131,
        0.1322920173406601,
        -0.01575625315308571,
        0.00041162490379065275,
        0.08943796157836914,
        0.09100329130887985,
        -0.02447092905640602,
        -0.07466713339090347,
        -0.008069593459367752,
        -0.04054422304034233,
        0.10958374291658401,
        0.00796105619519949,
        0.027003180235624313,
        0.029743116348981857,
        -0.026327231898903847,
        -0.08605415374040604,
        -0.022241082042455673,
        -0.0022721237037330866,
        0.00760203180834651,
        0.05585820972919464,
        0.06784895062446594,
        0.0552515909075737,
        -8.150846406351775e-05,
        -0.07875542342662811,
        -0.04330125451087952,
        -0.0028752610087394714,
        0.003953532315790653,
        -0.09037306159734726,
        -0.05281241610646248,
        -0.07239910215139389,
        0.0319320373237133,
        0.021029511466622353,
        0.08801202476024628,
        -0.07649600505828857,
        -0.05361967533826828,
        -0.0877910777926445,
        -0.016892999410629272,
        -0.07990647107362747,
        -0.01366391684859991,
        -0.029470453038811684,
        -0.0036712863948196173,
        -0.05345612391829491,
        0.04402904585003853,
        0.04859020933508873,
        0.05552343279123306,
        -0.038351308554410934,
        0.0031306284945458174,
        -0.011759679764509201,
        0.01824638806283474,
        -0.04588472470641136,
        -0.052338115870952606,
        0.04964757710695267,
        0.045289479196071625,
        -0.06136578693985939,
        0.06500403583049774,
        -0.017256855964660645,
        -0.06696618348360062,
        -0.05485698953270912,
        0.0724807009100914,
        0.019018135964870453,
        -0.025438716635107994,
        0.03984546661376953,
        -0.0342276394367218,
        0.019262483343482018,
        -0.06681586802005768,
        0.03082442656159401,
        -0.002107810927554965,
        -0.06218788027763367,
        -0.034567538648843765,
        0.10153092443943024,
        0.0974113941192627,
        0.06017066910862923,
        -0.0069442023523151875,
        -0.023485079407691956,
        0.02956567145884037,
        -0.06135200709104538,
        -0.07275800406932831,
        -0.0042217085137963295,
        -0.027690446004271507,
        0.013233747333288193,
        -5.910259659458461e-08,
        0.04303925484418869,
        0.015242467634379864,
        0.017560625448822975,
        -0.01878439262509346,
        -0.0015895057003945112,
        -0.08574461936950684,
        -0.07474967837333679,
        0.0606938898563385,
        0.07195214927196503,
        0.0058576068840920925,
        0.07533829659223557,
        0.010659596882760525,
        -0.010334495455026627,
        0.0015302555402740836,
        -0.0694902241230011,
        0.0514669269323349,
        -0.04477247595787048,
        -0.0399799570441246,
        -0.05155786871910095,
        0.0337085947394371,
        -0.06426367163658142,
        0.015250240452587605,
        -0.0464506559073925,
        -0.05533676967024803,
        0.049899592995643616,
        0.06345441937446594,
        -0.004934391938149929,
        0.00519212381914258,
        0.05779141187667847,
        -0.037033211439847946,
        -0.06180986762046814,
        -0.09772785753011703,
        -0.09934177249670029,
        0.01529020071029663,
        0.054313212633132935,
        0.018515417352318764,
        -0.009483309462666512,
        -0.0590955950319767,
        0.05012167617678642,
        -0.02856353484094143,
        -0.056489840149879456,
        0.01974567398428917,
        0.007305297069251537,
        0.084248848259449,
        0.05299682542681694,
        -0.03851425647735596,
        -0.07251335680484772,
        -0.026152770966291428,
        0.028730766847729683,
        -0.05585674196481705,
        -0.04295673593878746,
        -0.05466308072209358,
        -0.03664161264896393,
        0.08717171847820282,
        0.03463837876915932,
        0.07619795948266983,
        0.02070596069097519,
        0.011057560332119465,
        0.030640574172139168,
        0.06866929680109024,
        0.05895061790943146,
        -0.061262816190719604,
        -0.17781101167201996,
        0.014066426083445549
    ]
}